{
    "title": "$10K reward offered in Pappy Van Winkle theft",
    "text": "LOUISVILLE, KY (WAVE) – A local sheriff is offering a $10,000 reward for information leading to an arrest after a thief stole thousands of dollars worth of a rare bourbon from a distillery. Franklin County Sheriff Pat Melton announced the reward during a news conference Monday afternoon. \"It's another twist in this case, a positive twist, and it keeps the heat on,\" Melton said. \"Our focus is narrowing down on some folks. I think we're coming close (to solving the case).\" [PREVIOUS STORY: Principal cleared in Pappy thefts] Melton also said Monday that Bardstown High School principal Chris Pickett was no longer a person of interest in the case. [PREVIOUS STORY: Bourbon heist getting attention, but no suspects] Pickett became a person of interest in the case after the Franklin County Sheriff's Office released security video showing the principal inside an Elizabethtown liquor store. Managers said Pickett tried to sell them cases of Pappy Van Winkle 20-year bourbon, something Pickett's lawyer has repeatedly denied. [PREVIOUS STORY: High school principal says he's not involved in Pappy Van Winkle heist] In October, 195 bottles of 20-year-old Pappy Van Winkle and nine cases of 13-year-old Pappy Van Winkle Rye, worth around $26,000 total, were stolen from the Buffalo Trace distillery in Frankfort. The bottles retail for $120 each, but can be sold for nearly ten times that price in auction. [PREVIOUS STORY: High-profile bourbon heist case takes twist] Melton said detectives have interviewed more than 100 in the case and continue to check sites like Craigslist for tips. He said he still believed the theft was an inside job. Melton declined to release the stamp numbers on each bottle of bourbon, which some have said would help track the stolen bottles. The theft has shaken up the bourbon industry because Pappy Van Winkle is already in short supply, said Tom Fischer, who runs BourbonBlog.com. \"It has affected the perception of distributors who say, 'We used to allocate 20 bottles to this store, now we can only give five or six,\" he said. \"It's been tough on the bourbon community.\" Pickett's lawyer, Doug Hubbard, said the principal has continued to work at Bardstown High School during the case, and is now trying to move on. Hubbard questioned whether the theft was a publicity stunt by Buffalo Trace. Bluegrass Crimestoppers gave $1,000 toward the reward. Anonymous donors have contributed the additional $9,000, Melton said. Anyone with information is asked to call the anonymous tip line at (502) 320-3306. Copyright 2013 WAVE 3 News. All rights reserved. ",
    "datetime": "2013-12-03T02:00:02Z",
    "url": "https://www.wave3.com/story/24114733/10k-reward-offered-in-pappy-van-winkle-theft/"
}