{
    "title": "$1K VIP tickets to G-Dragon concert in Singapore is most expensive ever",
    "text": "Where else would you be able to get a Pharrell Williams sweatshirt for only S$39 after discount? Fans hoping to get VIP tickets to G-Dragon’s upcoming solo concert in Singapore will have to pay S$1,000 each. Plus, it doesn't mean you'll be guaranteed one if you have the moolah — there are only 20 tickets available. The VIP tickets come with a meet-and-greet session with the 25-year-old singer and leader of popular K-pop group Big Bang. This is by far the most expensive VIP ticket for a K-pop event and it costs even higher than the “Super VIP Experience Package” ticket for this November’s MBC Korean Music Wave festival, which is tagged at S$688 each. Organisers of FIDe fashion week announced this just days after revealing that another South Korean star, Rain, will be making an appearance at the 11-day fashion event happening at The Shoppes at Marina Bay Sands. Meanwhile, a standard ticket for G-Dragon’s solo concert happening on 12 October costs S$120 each. All tickets go on sale on Tuesday. G-Dragon, whose real name is Kwon Ji Young, was in Singapore just two weeks ago, performing together with his group, Big Bang, as part of an opening concert for the Formula One Singapore Grand Prix at the Padang. Hungarian Victoria Secret model, Barbara Palvin, 20, will also be coming to Singapore for the fashion festival, organisers said. For more information or to purchase tickets, visit the event’s website. The Princess of Wales attended Lady Rose Windsor and George Gilman's wedding in 2008 without boyfriend Prince William in a mini wedding guest dress – throwback photos. In \"The Woman in Me,\" Britney Spears says she heard a different message when Justin Timberlake talked about their sex life back in 2002. 保證內部回報率3.02-3.3% Israel demanded the resignation of the UN secretary-general on Tuesday over “shocking” comments in which he suggested that the Oct 7 attack was provoked by the “suffocating occupation” of the Palestinian territories. The Premier League has recommended that Everton face a 12-point deduction in its case against them for breaching profit and sustainability rules, the Telegraph has learnt. Chong Un Kim, 26, immigrated to the US in 1981 and her remains were found in a dumpster on Valentine’s Day 1988 開立Preferred Banking戶口，獎賞總值高達HK$5,650 全新啟用Money Master可享三重獎賞！ A woman whose confrontation with the police at a hospital went viral on TikTok has been sentenced to five weeks and five days in jail, coupled with a $600 fine. The 32-year-old is living in Florida, where he moved earlier this year after he was successfully sued for defamation in Israel The company — and other retailers — made a commitment in 2018, but backtracked soon after. 有業界No.1自願醫保，唔驚！FWD尊衛您醫療計劃！全數保障一系列住院同手術費用！ Jesus Ayala, 18, and Jzamir Keys, 16, have been charged with murder over hit-and-run incident that killed Andreas Probst A Lebanese front is unlikely: it wouldn’t be in Iran’s interests, as it would probably spark US intervention, says Lina Khatib, director of the Soas Middle East Institute American intelligence officials have explained to their European counterparts why they failed to anticipate Hamas’s assault on Israeli villages, which was reportedly planned on telephone lines in hidden tunnels. 有安信，一定快！「CASH快線」小額貸款，一Click即批即過數！送高達$12000現金獎！ \"It's hard to fathom that there are people in the world who would target such innocence,\" Hilton wrote on Instagram. Energy company Lukoil last year took a public stand over Moscow’s invasion of Ukraine China has replaced Defense Minister Gen. Li Shangfu, who has been out of public view for almost two months, state media reported Tuesday.  Li is the second senior Chinese official to disappear this year, following former Foreign Minister Qin Gang, who was removed from office in July with no explanation offered.  Li, who became defense minister during a Cabinet reshuffle in March, hasn’t been seen since giving a speech on Aug. 29. 機會來了！玩網上小遊戲，加深認識《憲法》及《基本法》的同時，答對問題、儲夠分數，更有機會換領餅店、咖啡店、超市禮券或書券等！ Liverpool boss waxes lyrical about striker ahead of Toulouse encounter \"Can’t read and won’t follow the rules.\" Hamas is believed to have weaponised thousands of commercial drones with the help of Iran This Is Me...Now: Limited edition created by Jennifer Lopez What would you do if your child turned into a bridezilla? In 2020, 350 elephants mysteriously died in Botswana, with a further 35 dying in similar circumstances in Zimbabwe. Now scientists think they may have found the reason why Russian generals are throwing their troops forward in their assault on the eastern town of Avdiivka despite suffering heavy losses, Ukraine has claimed. ",
    "datetime": null,
    "url": "http://sg.entertainment.yahoo.com/blogs/going-out-by-night/1k-vip-tickets-g-dragon-concert-singapore-most-125624023.html"
}