{
    "title": "'Gangnam Style' at 10: How Psy's smash hit sent Korean culture global | CNN",
    "text": "The early 2010s were an era of instant hits. From the “Harlem Shake” to “Party Rock Anthem”, digital platforms ushered in a new era of publicity – and virality. On July 15, 2012, South Korean singer and rapper Psy broke onto the global music scene with a bright blue tuxedo, an unforgettable horse-riding dance and an energetic beat that dropped to the catchy lyric, “Oppan Gangnam style.” “Gangnam Style” soon went viral, making waves around the world. The song hijacked the airwaves, the music video flooded Facebook timelines and Psy’s slicked-back hair and sunglasses showed up on American late-night shows. The song debuted on the Billboard Hot 100 in September, before climbing to number 2 weeks later. It also became the first video to hit 1 billion views on YouTube. Psy, who was already popular in his home country but barely known globally, quickly became one of the most recognizable artists in the world. Within a year, he had broken three Guinness World Records and was performing at New York’s Madison Square Garden with Madonna. For the then-35-year-old from Seoul, the whirlwind success was something he could have never imagined. In an interview ahead of the song’s 10-year anniversary, he compares that period of his life to celebrating a birthday. “On the day before, you’re excited in anticipation,” he tells CNN from the Seoul headquarters of P-Nation, the record label and entertainment agency he founded in 2018. “And then on the day of … it’s all a little wild and crazy.” But the song’s impact stretched far beyond the music industry. In fact, the success of “Gangnam Style” is considered a major catalyst in the “Korean wave”, or “hallyu”, a term describing the recent proliferation of Korean culture internationally – something the South Korean government has been attempting to push through music and media since the 1990s. Seoul Fashion Week: A vision of Korean designers' creative future According to Gyu Tag Lee, an associate professor of cultural studies specializing in K-pop and hallyu at George Mason University’s South Korean campus, it was “Gangnam Style” that gave Korean pop culture mainstream recognition outside of East Asia. “These kinds of going-viral-on-the-internet media platforms, (such as) YouTube, made K-pop and hallyu really popular and big overseas,” he says. Fast forward a decade and South Korean talents have reached new levels of global popularity and fandom. K-pop band BTS was the world’s top-selling musical act in 2021, and the group has since performed at the Grammys and made an appearance at the White House to discuss Asian representation and anti-Asian hate crimes. Girl group Blackpink, meanwhile, has performed at the Coachella music festival and collaborated with the likes of Lady Gaga and Selena Gomez, with its four members all joining major brands or luxury fashion houses as ambassadors. K-pop supergroup BTS visits the White House Lee believes that these highly successful K-pop acts are following in Psy’s footsteps by using shareable video content to reach global audiences. “Without the big hit that was ‘Gangnam Style,’ there may not have been BTS, there may not have been Blackpink,” Lee says. BTS has often cited – and thanked – Psy for helping globalize K-pop. One of the boy band’s members, Suga, even co-produced and featured on “That That” , the lead single from the Psy’s new album, “Psy 9th”. Like “Gangnam Style”, the song is catchy and danceable, while the music video features some of the singer’s signature humor and has already garnered more than 272 million views on YouTube. In a behind-the-scenes video interview, posted to Psy’s YouTube account, Suga expresses his gratitude for the “Gangnam Style” singer. “He paved the way for K-pop in the US, which allowed (BTS) to follow that path more comfortably,” Suga says. And the appreciation is mutual. “I think it’s an incredible feat,” Psy says of BTS’ success. “Every single part of me applauds them and is cheering them on. That heavy burden that I felt in 2012 – BTS has been shouldering that for six or seven years now.” For Psy, there has always been another side to his global success. As excited and happy as he was during those “Gangnam Style” days, he said that performing and being on the road left him feeling “just too overwhelmed” and “a little empty inside.” Fame also brought about new expectations – and the pressure to make more hits. Dior hosts runway show in South Korea for the first time “When the song is a hit, then your songs need to continue to be hits,” he says. “When the person is a hit, the success is more sustainable. In this case, I’m the former and BTS is the latter.” While Psy never replicated the success of “Gangnam Style”, he has spent the last decade proving himself to be a musician and dancer with a singular drive to entertain. Since 2012, he has released three full-length albums that showcase his diverse style – from the dance hits he’s best known for, to softer, rhythmic ballads reminiscent of his earlier output. Since founding P-Nation, he has used the label to discover, develop and creatively support the next generation of South Korean acts. Between it all, Psy is still filling venues in his home country. His annual concert series, “Summer Swag” is currently underway after being canceled due to the pandemic. “Interacting with audiences (and) sharing that experience is something I can’t even describe,” Psy says. “I feel incredibly proud and content in that moment.” And his mission hasn’t changed since his breakout hit: “To make fun music, fun dances and bring joy to my fans.” “That’s my hope,” he adds. “I was of the same mind 10 years ago and I think I’ll feel the same way 20 years from now as well. I’ll always be true to that.” Watch the video above to hear more from Psy. © 2023 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network. ",
    "datetime": "2022-07-15T01:50:14Z",
    "url": "https://www.cnn.com/style/article/psy-gangnam-style-10-years-intl-hnk/index.html"
}