{
    "title": "'Hallyu'-themed annual K-culture fest to kick off Saturday in Seoul | Yonhap News Agency",
    "text": "All Headlines North Korea Sports Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies URL is copied. SEOUL, Sept. 30 (Yonhap) -- An annual festival showcasing the Korean Wave will kick off in Seoul on Saturday, featuring popular K-pop stars, such as NCT Dream, The Boyz, Monsta X, Ive, Oh My Girl and WJSN. Founded in 2020 by the Ministry of Culture, Sports and Tourism and its affiliated private Korean Foundation for International Cultural Exchange (KOFICE), the festival has been held every year to promote \"hallyu,\" or the global boom of Korean pop culture. The festival's third edition will take place at Gwanghwamun Square in central Seoul and the Seoul Sports Complex in the Jamsil district of the capital until Oct. 8. Admission is free. There will be an event to celebrate the eve of the festival's opening Friday at a public square inside Gyeongbok Palace, a royal palace from the Joseon Dynasty (1392-1910) in central Seoul. A \"calligraphy croquis\" performance by creator and armless painter Seok Chang-woo, as well as traditional Korean and classical music performances, will be held to present both traditional and contemporary Korean culture. This image provided by the Ministry of Culture, Sports and Tourism shows a promotional poster for the 2022 K-Culture Festival set to run from Sept. 30-Oct. 8, 2022, in Seoul. (PHOTO NOT FOR SALE) (Yonhap)  The festival will officially open Saturday with an event titled \"The-K drama concert,\" in which a stage musical composed of famous scenes and original soundtracks of various hit Korean TV dramas, including \"Jewel in the Palace,\" \"Itaewon Class,\" \"The Red Sleeve\" and \"My Liberation Notes,\" will be played. There also will be a talk session between producers of famous Korean dramas and their fans, as well as a performance of original soundtracks of some popular TV series by the artists who sang the songs, including Paul Kim and Kyuhyun, a vocalist of leading K-pop boy group Super Junior, as part of the opening event. The Boyz and Oh My Girl will hold a meet-and-greet event for their fans at the auxiliary stadium in the Seoul Sports Complex on Sunday and Monday, respectively. The highlight of the festival will be a K-pop concert at Olympic Stadium in the sports complex next Friday. The show will feature NCT Dream, Monsta X, Ive, STAYC, WJSN, WINNER, Zico, Blank2y, MCND and Cravity. American singer-songwriter MAX will also hit the stage. Four smaller concerts to showcase other popular mainstream K-pop, indie and hip-hop musicians, as well as DJs, will also take place in the Gwanghwamun and Jamsil areas during the festival period. They include Pentagon, Brave Girls, CIX, VIVIZ, JK Kim Dong-wook, Sunwoo Jung-A, 10cm, The Quiett, Raiden and Ginjo. Hallyu fans will also be offered a chance to experience Korean food, fashion, cosmetics products, games, webtoons and craftwork during \"The-K Fan Fair,\" set to be held at the two venues. There will be a street parade themed on the Korean culture on Oct. 8, the last day of the festival, in Seoul's city center. Some 2,000 citizens and art troupe members will march along a 2.6-kilometer-long section linking Jongno to Gwanghwamun Square during the parade. For overseas hallyu fans, the festival will be streamed live through its official YouTube channel. sshim@yna.co.kr(END) All News National North Korea Economy/Finance Biz Culture/K-pop Sports Images Videos Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies Korea in Brief Useful Links Festival Calendar Weather Advertise with Yonhap News Agency ",
    "datetime": "2022-09-30T10:23:50+09:00",
    "url": "https://en.yna.co.kr/view/AEN20220930002400315"
}