{
    "title": "'Hallyu' brings South Korean culture closer to Vietnam",
    "text": "19/10/2022   06:38 (GMT+07:00) It is a collective term that refers to the extraordinary rise of South Korean culture in global popular culture, which includes everything from music, movies, drama, to online gaming and Korean food. To some extent, the Hallyu movement in Vietnam can be traced back to 1998, when HCM City Television (HTV) first aired the K-series Medical Brothers. The show was an instant hit because of the striking parallels between Vietnamese and South Korean culture and lifestyle. It also inspired a slew of new fashion trends in the country. However, it wasn't until the year 2000 that the concept of Hallyu really took off in Vietnam, with the release of the television blockbuster The Autumn Heart, followed by Glass Slippers, Winter Sonata, and Dae Jang Geum. In this heyday, Korean films were so popular that whenever the term is uttered, local viewers quickly conjure up images of cancer, car accidents, and memory loss, which are common motifs in K flicks, as well as magnificent winter sceneries. Dae Jang Geum, a K-series about an orphaned chef who becomes the king's first female physician, was a huge hit across Vietnam and beyond, introducing Korean ancient history and food to audiences outside of Korea. The heart warming plot and image of the talented chef Dae Jang Geum have been deeply rooted in the memory of many Vietnamese viewers, pushing the series to the top of the most loved Korean dramas in Vietnam almost 20 years after its first broadcast. From 2008 to 2009, South Korean drama had a tremendous \"makeover\", when the majority of films shifted from tragedies to romantic comedies with Boys Over Flowers as the breakthrough hit. Male characters who are \"pretty like flowers\", a romantic storyline, and a philosophy that encourages people to overcome adversity all helped viewers in Vietnam develop empathy for and a nuanced understanding of South Korean culture. From the early 2010s, the spread of the Korean Wave in Vietnam was mostly led by K-pop boy and girl groups known as idol stars, such as Big Bang, Girls' Generation, and Super Junior. For the fans, Korean pop means far more than just a catchy song or a performance. It is bringing something new, authentic, and distinct to the game in a way that they can relate to intimately. According to Dr. Park Nark Jong, former director of the Korean Cultural Centre in Vietnam, traditional cultural material is at the core of what makes Hallyu so popular. Dr. Park believes that the success of Hallyu in Vietnam can be summed up in several aspects, including: the growing number of Vietnamese students in South Korea; the popularity of Korean dramas and movies, as well as Korean tourism; and the appeal of K-Beauty such as cosmetics and plastic surgery services. He also believes that Vietnam and South Korea are becoming closer to each other in relation, and the success of the Vietnamese national football team when they were guided by Korean Park Hang Seo is further indication of this movement. Cultural bridge In honour of the 30th anniversary of diplomatic relations between Vietnam and South Korea, the Korea Content Creation Agency (KOCCA) has planned a number of cultural and entertaining events throughout this year. The Hanoi Hallyu Expo 2022, which takes place on October 27 and 28, will be the centrepiece, showcasing Korean consumer products and the Hallyu trend. According to Hong Jeong Yong, director of KOCCA Vietnam, the organisation strives to become a \"bilateral and multilateral bridge\", linking enterprises involved in content creation in Vietnam and Korea and encouraging commercial endeavours in the cultural content sector. \"KOCCA Vietnam is a key office in the Korean Government's New Southern Policy, encouraging friendly relations between the two countries by increasing the Hallyu market in Vietnam, supporting the export and import of Hallyu content, and promoting associated sectors,\" Hong said. He also expressed his delight when Vietnamese youth showed an interest in Korean culture and Hallyu. He stated that Vietnam's cultural industry is rapidly increasing, and that the Vietnamese government has particular policies and goals for this sector. Hong believes that the material helps to the building of strong sentiments between the two countries are based on cultural and historical parallels - connections that only Vietnam and South Korea share. This year, KOCCA Vietnam will also continue to perform market research and connect content creators from the two countries. Source: Vietnam News Topic: ",
    "datetime": null,
    "url": "https://vietnamnet.vn/en/hallyu-brings-south-korean-culture-closer-to-vietnam-2071145.html"
}