{
    "title": "'K' wave sweeps India with dramas, music and more- The New Indian Express",
    "text": "The viewing for Korean dramas on Netflix in India increased more than 370 per cent in 2020 over 2019, a spokesperson for the OTT platform said. Published: 06th  October 2021 05:01 PM  |  \n      \n         Last Updated: 06th  October 2021 05:01 PM\n\n  |  A+A A- South Korean pop band BTS (Photo | AP) NEW DELHI: We love their soppy soaps and gentle romances, their thrillers and their intense cinema, their music and increasingly even their food. The 'K' way of life has middle and upper class India in thrall, a 'we love everything about South Korea' movement led primarily by its small screen entertainment industry that has found the unlikeliest loyalists here. There is even a word for this South Korean cultural phenomenon -- hallyu. In February 2020, \"Parasite\" director Bong Joon-ho urged viewers to overcome the \"one-inch-tall barrier of subtitles\" in his Oscar acceptance speech. Less than two years later, almost as if India was listening to him, the hallyu wave has swept through the country through shows such as \"Crash Landing on You\" and \"Vincenzo\", the music of boyband BTS and also films. The pandemic-led OTT boom brought with it hallyu 2.0 when many Indian watchers moved past their staple diet of American, Nordic and Indian shows to discover K-dramas, a world removed from the 'K' Hindi dramas of not so long ago. The viewing for K-dramas on Netflix in India increased more than 370 per cent in 2020 over 2019, a spokesperson for the OTT platform said. From the cerebral lawyer looking for quality entertainment to the elderly partaker of TV soaps, the shows have found fans aplenty. A glance at Netflix's top-10 category shows the inroads Korean shows have made in India with Lee Jung-jae and Park Hae-soo's \"Squid Game\" and ?Kim Seon-ho and ?Shin Min-a-starrer romantic drama \"Hometown Cha-Cha-Cha\" consistently featuring on the list. \"Squid Game\", a \"Hunger Games\" like survival show inspired by Korean children's games, is on its way to becoming the biggest show in Netflix history, Ted Sarandos, co-CEO of Netflix, said this week. Since it began working with Korean filmmakers and talents in 2016, the streamer has introduced over 80 original Korean shows and films to its members around the world and subs the K-content in 30 languages, the spokesperson said. \"Kingdom Season 2\", \"It's Okay to Not Be Okay\" and \"Crash Landing.....\" are among the series to have regularly featured in the Top 10 on Netflix in India. And over 22 million households tuned it for the Korean horror TV series \"Sweet Home\". This is why Hyun Bin and Son Ye-jin of the super popular \"Crash Landing on You\", a soft romance without any rough edges between a North Korean officer and a South Korean heiress, and actors Song Joong-ki, Park Bo-gum have become huge stars in India alongside others such as Song Hye-kyo and Bae Suzy. K-drama lovers are also hooked on to Rakuten Viki, a streaming service that has over 15 million users globally. \"It's been an exciting time for us, especially as Rakuten Viki houses the largest K-drama collection across any streaming platform,\" Sarah Kim, SVP of Content Business & Regional GM (Asia), told PTI in a statement. \"We're finding that people are hungry for Asian content, particularly K-dramas, for its unique storytelling and plot twists, and because it offers a different production quality compared to American and Western content....,\" she said. Such is the love for all things South Korean that many fans have overcome the \"subtitle barrier\" and included Korean words such as \"noona and oppa\" (elder sister and brother), \"namja-chingoo\" (boyfriend), \"yoja-chingoo\" (girlfriend) and \"sarang-hae\" (I love you) and many other words and phrases in their daily vocabulary. Globally, too, the language is making waves with the Oxford English Dictionary recently adding 26 Korean words, including K-drama, hallyu and kimbap to the dictionary. \"We are all riding the crest of the Korean wave,\" BBC quoted OED as saying in a statement. Closer home, the Korean Cultural Centre India has started three-month online Korean language classes and the 1,200 slots get full within two to three minutes of opening for registration, said KCCI director Hwang Il-yong. \"Creating unique stories from the normal and familiar life stories can be the power of K-dramas, and this can be one of the main reasons why K-content is getting global popularity. Normal and ordinary people's stories can get universal acceptance without resistance or barriers,\" Hwang said. To introduce Indians to the world of K-pop, KCCI also runs a K-pop contest pan India along with a K-pop academy. Catering to the rising demand, the Jawaharlal Nehru University is also running a Korean language teacher training course as well as a regular subject in collaboration with the KCCI. According to Young-Geul Choi, director of New Delhi's Korea Tourism Organization (KTO), the popularity of K-content exploded during the pandemic but the first K-wave emerged in the Northeast in 2000 when teenagers became fascinated with the Korean lifestyle. \"India is now one of the top countries in terms of numbers for streaming and watching K-Pop or K-drama content. We often receive consumer queries on our social networking sites asking about how to visit K-drama filming sites or K-pop exhibition spaces or where to buy official merchandise,\" he said. With entertainment comes the culture, lifestyle and fashion influence, which hallyu fans now want to adopt in their lives, Choi said. \"The Family Man\" star Priyamani remembers how she made the transition from English, Turkish and Belgian series to Korean shows. She first chanced upon \"The Bride of Habaek\", starring Shin Se-kyung and Nam Joo-hyuk, sometime late last year. She found the mystery and fantasy element \"cute\", but it was the smash hit series \"Descendants of the Sun\", featuring Song Joong-ki and Song Hye-kyo, that sparked her \"love affair\" with K-dramas. \"I am a big Song Joong-ki fan. I don't have his posters and things like that on my wall but I just admire him. I immediately fell in love with him and the character he played. After 'Descendants of the Sun', I just kept watching and watching a lot of series. Touchwood, my love is still going strong.\" \"What I found was these shows are very relatable. You can relate to the culture and tradition because they are also very family-oriented like us (Indians). You can connect with these stories even if it is a fantasy or romance. The acting is also extremely real,\" the actor said. Priyamani believes that K-drama fans already have cities like Seoul, Busan, or Daegu on their travel bucket list. A lot of people were already watching these dramas even before the pandemic, added Divya Jaladi, a training manager in Guntur. \"The craze has been there for a long time now but the pandemic definitely gave it a push. People were bored, there was not much content on TV channels. K-dramas are a little bit different....There is a sort of guilty pleasure to them,\" Jaladi, 37. Aspirational storylines like rich man-meets-poor woman or plots set in a fantastical world also help. \"You sometimes wish for yourself that something like that happens to me. It's very fantastic and generally doesn't happen (in real life). Also, you don't get to see some very good-looking people on the screen that often.\" Follow The New Indian Express channel on WhatsApp O\n    P\n    E\n    N Comments  Disclaimer : We respect your thoughts and views! But we need to be judicious while moderating your comments. All the comments will be moderated by the newindianexpress.com editorial. Abstain from posting comments that are obscene, defamatory or inflammatory, and do not indulge in personal attacks. Try to avoid outside hyperlinks inside the comment. Help us delete comments that do not follow these guidelines. The views expressed in comments published on newindianexpress.com are those of the comment writers alone. They do not represent the views or opinions of newindianexpress.com or its staff, nor do they represent the views or opinions of The New Indian Express Group, or any entity of, or affiliated with, The New Indian Express Group. newindianexpress.com reserves the right to take any or all comments down at any time. The Morning Standard | Dinamani |  Kannada Prabha |  Samakalika Malayalam | Cinema Express  |   Indulgexpress  |  Edex Live  | Events Xpress Contact Us | \nAbout Us | Privacy Policy | \nTerms of Use | Home |  Nation |  World |  Cities |  Business |  Columns |  Entertainment |  Sport |  Magazine |  The Sunday Standard Copyright - newindianexpress.com 2023. All rights reserved. Website Designed, Developed & Maintained by Express Network Private Ltd. ",
    "datetime": null,
    "url": "https://www.newindianexpress.com/entertainment/2021/oct/06/k-wave-sweeps-india-with-dramas-music-and-more-2368398.html"
}