{
    "title": "'Korean wave' sweeps Oxford English Dictionary as new words are added | CNN",
    "text": "Korean exports seem to be sweeping the world’s screens, headsets and runways – and now more than 20 words of Korean origin have been added to the Oxford English Dictionary (OED) in its September update. Over the past two decades, South Korea has churned out entertainment coveted by millions of fans, from K-pop – added to the OED in 2016 – to “Squid Game,” the South Korean fictional drama billed by Netflix as possibly its “biggest show ever.” Koreans use the term “hallyu” to describe the phenomenon, which refers to the “Korean wave” of entertainment that has swept across Asia and now much of the world – and now this word has been added to the OED. Food is also prominent in the update, including “banchan,” a small side dish of vegetables, served along with rice as part of a typical Korean meal, “bulgogi,” which are thin slices of beef or pork that are marinated and grilled or stir-fried, and “dongchimi,” a type of kimchi made with radish and typically also containing napa cabbage. 'Pandemic' is, unsurprisingly, the Word of the Year for Merriam-Webster and Dictionary.com “Hanbok,” the traditional Korean costume worn by both men and women, “aegyo,” a type of cuteness or charm considered characteristically Korean, and “mukbang,” a video featuring a person eating large amounts of food and talking to an audience, were also included in September’s additions. “K-drama,” a Korean language television produced in South Korea, was also added. But not all of the recently added words are “borrowings, reborrowings, or loan translations from Korean,” the OED said, adding that several words are either new formations, or “new senses of existing English words.” The interjection “fighting!” is used to convey encouragement, incitement, or support – much like “go for it!,” the OED said. Meanwhile, “skinship” is a blend of the English words “skin” and “kinship,” referring to the touching or close physical contact between parent and child or between lovers or friends. “We are all riding the crest of the Korean wave, and this can be felt not only in film, music, or fashion, but also in our language, as evidenced by some of the words and phrases of Korean origin included in the latest update of the Oxford English Dictionary,” the OED said in a statement. “The adoption and development of these Korean words in English also demonstrate how lexical innovation is no longer confined to the traditional centres of English in the United Kingdom and the United States – they show how Asians in different parts of the continent invent and exchange words within their own local contexts, then introduce these words to the rest of the English-speaking world, thus allowing the Korean wave to continue to ripple on the sea of English words,” the OED added. © 2023 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network. ",
    "datetime": "2021-10-05T15:27:19Z",
    "url": "https://www.cnn.com/2021/10/05/asia/korean-words-oed-intl-scli/index.html"
}