{
    "title": "'Korean Wave' to wash over Center City with new restaurant | PhillyVoice",
    "text": "© 2023 WWB Holdings, LLC. All rights reserved May 07, 2015 Kimchi, seafood pancake, Korean barbecued beef and endless side dishes of zucchini, potatoes, soft tofu and eggplant fill the table in an impressive lunch spread. Ask celebrity chef Anthony Bourdain what's hot in the American culinary world right now, and he'll point you straight to barbecue and bibimbap -- Korean dishes that, in Philadelphia especially, have only recently permeated the mainstream food vernacular. But it's not the case that Korean food has only recently surfaced here. Rather, it's that Philadelphia is just now waking up and smelling the kimchi. \"We’ve been cooking the same food for 20 years,\" Chris Cho, co-owner of Seorabol, a long-running Korean restaurant at 5734 Old Second St. in Olney, told PhillyVoice. \"Trends change, and people are like, ‘You're known for BBQ.’ And we’re like, ‘OK, we’re known for BBQ.’ Sometimes we’re known for bibimbap, or hot pots. But we’re just trying to be us.\" By \"us,\" he means tried-and-true Korean chefs who've been cooking Korean food long before Korean tacos or cheesesteaks were even a thought -- the latter a suggestion Cho said he's actually received from friends. Located in a laundromat-led strip mall with a junkyard just down the street, one look at Seorabol's exterior and you'd likely peg it as a dime-a-dozen takeout spot, not one of the city's finer cultural food experiences. Inside, a left-right scan of the scene yields mixed impressions: lattice woodwork on the walls, rounded chair backs and stone dividers make it look like any other Zen Chinese restaurant. But then your peripheral spots flames whipping from table centers and wait staff responding to table-side buzzers (\"Hey, over here!\" an electronic voice shrieks), and you suddenly realize you're dining somewhere a tad ... different. Or, by Cho's account, \"authentic.\" Still, for all his pride in preserving his culture, Cho said Korean food trends have proven helpful for expanding his business, part of a \"Korean Wave\" that's finally extending to American food culture. He also said that Bourdain's declaration of Korean food as the next great influencer in American cuisine gave him the giddiness and gumption to assert himself as a cheerleader of Korean cuisine to a broader population of Philadelphia -- one that's unlikely to trek it 30 minutes by car for lunch. His goals are nothing if not lofty.  “I want to globalize Korean food as a whole, not just our brand,\" Cho said. \"I want more people to know Korean food. People know Chinese food; people know Japanese food -- people don’t know Korean food.” Cho plans to open a Center City location of Seorabol this September. The move is part of a long game to spark movement toward Philadelphia having its own bustling \"K-Town,\" just as you'd find in New York and Los Angeles. For the short term, he wants to, for a non-Korean audience, focus on providing an experience that he can proudly tout as all-the-way Korean -- no slap-kimchi-on-a-burger-bun fusion Frankenstein, but the real deal. ... But what exactly is the authentic Korean experience, anyway? And why might Seorabol be the one to push it forward? First things first: Seorabol's claim of authenticity isn't without roots in Korea itself. Seorabol, located in Philadelphia's Koreatown in Olney, was founded by Cho's father, Kye Cho, about 15 years ago. An immigrant from South Korea, he departed in 1988 at age 33 for an executive chef role at the Ritz-Carlton in New York City, before joining in on two short-lived Korean restaurant ventures in Olney in the early '90s. He ultimately set up shop with Seorabol when Philly Korean community leaders pressed him to give the business another go. The second go-round paid off. “It was a dream for me,\" Kye Cho said of making his way as a chef. \"Back then, no one made it out of Korea. So anyone going out, we weren’t the richest country, so we were just happy about having a new life.” Three qualities ultimately make Seorabol a staple for cuisine in Koreatown: its track record as a destination that's outlasted every other restaurant in Olney and Cheltenham Avenue, preservation of cuisine and customs and its abnormal decision to serve a full menu in lieu of a specialization -- that is, selling strictly noodles, fried chicken, soup, etc. Chef Kye Cho, center, his son Chris Cho, right, and brother, Gyu Cho, left, have a reputation in the Korean community for serving traditional Korean cuisine in Philadelphia. Thom Carroll / PhillyVoice  It's a one-stop shop for the Korean experience. \"The restaurant is where my friends’ parents come,\" Chris Cho explained. \"We keep it as authentic as possible.\" Chris Cho said that keeping out fusion food, popular in some expressly fusion-oriented or contemporary restaurants in Philly, is part of that effort. It's what allows Seorabol to both keep its predominantly Korean clientele -- its street cred, if you will -- and, he hopes, will draw in new audiences when he opens his second location.  \"We’re established to Koreans themselves, but do people [outside] know about this? No,\" he admitted. \"Because none of the chefs speak English.\" Three years ago, he made a decision to combat the language barrier by hiring English-speaking servers (a big deal in Koreatown) and speaking up as a Korean chef-media personality -- an attempt to put a Philly face to Korean cuisine. (With 100,000 Facebook followers, he's doing a solid job so far.) Because, quite frankly, it's a food culture that's only recently had full-grown, English-speaking ambassadors like Chris Cho capable of spreading the word -- no matter how difficult the word may be to unpack. Chris Cho is the first to admit that Korean cuisine is not the easiest food culture to explain. On one hand, roots in Confucius culture imply it's heavy on vegetables -- which it is. As of the past few decades, however, as South Korea has accumulated wealth, meat has entered the fray as a point of focus, with plates like beef barbecue (\"bulgogi\") becoming more of a mainstay. Then, there's the spice factor of Korean food, which takes cues from the Portuguese, who introduced chili peppers to the peninsula in the 16th century. Point being, Korean food culture is less \"this or that\" and more about how all of the above complement one another, much like the careful pairing of a fine wine with the right cut of meat.  “Korean cuisine has a lot of depth of flavors that truly accentuate vegetables -- there’s a huge vegetarian culture in their population,\" Mike Traud, who teaches a Korean cuisine course at Drexel University, told PhillyVoice. \"The general idea is to have these dishes that are very flavorful but also very healthy.” Bibimbap, a signature Korean dish that has recently gained popularity in the U.S. Chef Chris Cho says this is mostly attributed to the dish being healthy and consisting of many vegetables. Thom Carroll / PhillyVoice  Josh George, a dietitian with Cooper University Hospital, told PhillyVoice that the colorful spread of vegetables does, in fact, make it a desirable diet -- especially since many of those veggies are low in starch. \"The only thing to concern yourself with is sodium content. Because a lot of it is pickled or salt-geared,\" George said. \"But as far as health and calories are concerned, it’s a great diet, with great-quality proteins.” Korean portions are small, but a meal consists of a rather large (and literal) sprawl of food. Main entrees are placed in the center of the table, and small dishes flank all sides. It's typical for an authentic restaurant -- Seorabol included -- to serve as many as 10 side dishes with just one entree. These dishes, which come free with an entree, are almost always vegetables -- carrots, bean sprouts, eggplant, zucchini, cucumber, cabbage (aka kimchi) and seaweed. At Seorabol, most of these dishes are prepared with some variation of pepper flakes, pepper paste and sesame oil. What's sometimes confusing to non-Koreans, admitted Cho, is that none of these side dishes actually have a name.  “Kimchi is the only thing that has a name for it,\" he said. \"People ask me what the name for all of this is, and I look at a dish, and I’ll say, ‘potato,’ or ‘zucchini.’ Or, 'What is that sauce?' We don’t have a name for it.” Main Korean dishes run the gamut of extremes (have you seen those grilled-alive eels?) in Korean culture, but at Seorabol, they range from braised pork belly with kimchi, to a hot-pot spicy tofu soup, to marinated beef barbecue that can be eaten as a sort of lettuce burrito, containing rice and a soybean paste. To boot, Korean cuisine is also as much about how you consume as much as it is about what you consume.  Clyde, a server at Seorabol, grills beef at the table on a charcoal-fired grill, a traditional method for preparing Korean barbecue. Korean foods are not typically fried. Thom Carroll / PhillyVoice A typical Korean meal experience features behavior most Americans would consider rude -- gross, really. Quadruple-dipping into plates is to be expected; meat comes to the table in raw form (you cook it yourself over a table-installed charcoal pit); mass alcohol consumption is practically assumed upon entry (Chris Cho described \"soju,\" a Korean vodka, as \"like nail polish remover\"); and, if your server's not annoyingly zipping back to the table with a \"Would you like more?\" at least three times while you're eating, they're probably not doing their job right. Chris Cho's looming challenge, of course, is to translate and normalize all of this knowledge to a casual Center City diner in the course of a one- to two-hour meal -- the same diner who might look at chopsticks in the same way grandma looks at a smartphone.  \"It's a lot to carry on your shoulders,\" Cho said of trying to represent Korean cuisine. \"For newcomers, everything will be new [when we open] – they’ll want to understand. And even to us, it’s huge. How we present it is how they’re going to think of Korean cuisine and Korean people.\" To be sure, the pressure's not all on Chris Cho and chefs like him to be missionaries for Korean culture. The Korean government is unprecedented in that it funds its culture as an export. The Korean cuisine course Traud teaches at Drexel University, for example, is paid for by an agency of the South Korean government based in New York. Sharlyn Rhee, research associate of the University of Pennsylvania's James Joo-Jin Kim Program in Korean Studies, told PhillyVoice that Korean-pop -- K-pop -- has led what academics call the \"Korean Wave,\" or a global spread of Korean music, dramas and other elements of culture. It's most widespread in South Asia but is also in New York, Los Angeles and, in recent years, has been embraced by Middle Eastern countries as a subtle act of anti-Americanism. (She explained that countries like Iran look to South Korea, with its patriarchal background, as an alternative to the contemporary culture of the U.S.) Chef Kye Cho dishes out a bowl of Soondubu Jjigae, a shellfish, vegetable and soft tofu stew. Thom Carroll / PhillyVoice Korean food is expected to benefit from the after-effects of this wave.  “In five years, [Korean culture] probably will have fizzled out in popularity, but in that time, it won’t matter much because it will be integrated into our national consciousness,\" Rhee said. \"It would be the triumph of Korean inroads in America if you saw four or five different kinds of kimchi next to Greek olives at Whole Foods and have no one think twice about it.\" Seorabol's forthcoming Center City presence is an active step toward making that happen. And it's also, frankly, a matter of pride. \"I'm Korean, and I'm Philly. And I'm a Korean-Philadelphian more than I'm an American. I'm not just doing this for Korean food, I'm doing this for Philly,\" Chris Cho said. \"One day, I'm going to represent Korean food, and I'm going to be the restaurant that came from Philly.\" Brandon Baker\n                            \n\n                            PhillyVoice Contributor Investigations Sponsored Senior Health Music Phillies Family-Friendly Performances Mental Health Entertainment Banking Youth Sports Transportation Travel Real Estate Fall Travel © 2023 WWB Holdings, LLC. All rights reserved ",
    "datetime": "",
    "url": "https://www.phillyvoice.com/koreatown-restaurant-introduce-korean-center-city/"
}