{
    "title": "'Pachinko' author Min Jin Lee credits Korean Wave for her success | Yonhap News Agency",
    "text": "All Headlines North Korea Sports Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies URL is copied. By Kim Boram SEOUL, Aug. 8 (Yonhap) -- Min Jin Lee, the author of historical novel \"Pachinko,\" on Monday gave credit to artists behind the Korean Wave for the wide recognition of her works and other Korean American novels in the United States. In a press conference to promote the publication of the new Korean edition of her second novel \"Pachinko\" (2017), she said the rising global popularity of South Korean pop culture, known as \"hallyu,\" has been creating synergy in the U.S. to bring more attention to works by Korean-American novelists like her. Min Jin Lee, author of the novel \"Pachinko,\" speaks during a press conference in Seoul on Aug. 8, 2022. (Yonhap)  \"I'm also benefiting from (the Korean wave) as a Korean American,\" she said in English. \"I'm grateful for the excellent art and writings coming from Korea. Those are people who have made sacrifices to be writers, painters, filmmakers, actors and singers.\" She said there have been many Korean-American writers in the U.S., including Younghill Kang and Ronyoung Kim, whose presence was hardly felt. But in recent years, the Korean wave has helped create another kind of wave in America. \"(Korean artists) are doing a lot of work. I'm doing work, and other people in my country in America are also doing work,\" she said. \"So around the world, we have a kind of hallyu wave and in a response, another kind of wave. That's the synergy.\" \"Pachinko\" is an epic historical novel about a Korean family who immigrate to Japan during the 1910-1945 colonial era. It depicts hardships and social discrimination that the family experiences in Japan as a Korean Japanese for over the 70 years. It was adapted to the namesake popular TV series produced by Apple TV+ in 2022, starring Korean actors Youn Yuh-jung, Lee Min-ho and Kim Min-ha. \"I wrote this book on the very strong wish that I believe the stories of Korean-Japanese people and their history were so central to understanding the identity of Koreans around the world,\" said the author who became a full-time writer from a lawyer. \"To have this opportunity to share this story with the widest possible audience is really important to me,\" she said. She said she hopes the young generation becomes more interested in history through \"Pachinko\" in a way to seek who they are and where their identity comes from. \"Identity is a meaningless and empty container without understanding history,\" she said. \"How do I make history interesting? I have to tell an interesting story. History is just facts, events, winners and losers, not interesting.\" This image provided by Influential shows the new Korean edition of \"Pachinko\" by Min Jin Lee. (PHOTO NOT FOR SALE) (Yonhap)  For her next project, she is working on a novel titled \"American Hagwon,\" depicting Korean people's craze for eduction. Hagwon is the Korean-language word for a for-profit private institute or cram school. \"I'm writing this book because I was interested in education and why education is so important to Koreans around the world, not just in Korea,\" she said. \"In Korea, very often, education is linked inextricably with status, rank and hierarchy. I found that to be very interesting. So I'm working on that right now.\" brk@yna.co.kr(END) All News National North Korea Economy/Finance Biz Culture/K-pop Sports Images Videos Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies Korea in Brief Useful Links Festival Calendar Weather Advertise with Yonhap News Agency ",
    "datetime": "2022-08-08T16:26:45+09:00",
    "url": "https://en.yna.co.kr/view/AEN20220808007600315"
}