{
    "title": "'Skin Garden', a K-Cosmetics Shop in Shinjuku, Gains Popularity As a Filming Site for TV Drama Series | Business Wire",
    "text": "Providing diverse Korea-made cosmetics and other interesting things to see, Skin Garden is crowded with family-oriented customers. (Photo: Business Wire) Providing diverse Korea-made cosmetics and other interesting things to see, Skin Garden is crowded with family-oriented customers. (Photo: Business Wire)  TOKYO--(BUSINESS WIRE)--Skin Garden (http://www.skingarden.jp/), \n      a K-cosmetics shop located in the central area of the Korean wave \n      shopping district in Shinjuku, Tokyo, is attracting popularity as a \n      filming site for TV drama series.  Diverse TV programs have been filmed at the cosmetics shop since its \n      launch. On January 23, WOWOW TV, the biggest and first pay TV station in \n      Japan, filmed a drama series at the shop. A filming staff member at WOWOW TV said, “The shop, with sophisticated \n      store display where customers frequently visit, naturally dissolves in \n      the drama series which fits the film location perfectly.” A manager at Skin Garden said, “After this, a new drama series to be \n      launched in the spring season of 2015 is scheduled to be filmed here. \n      Continuous filming of movies and TV drama series at the shop will \n      significantly attract more customers.” As one of the largest Korean wave cosmetics shops located in Shinjuku, \n      Tokyo, Skin Garden (http://www.skingarden.jp/) \n      (http://www.skingarden.jp/wpkr) \n      carries a wide range of quality Korean products, including Korea-made \n      cosmetics that are popular among Asian women, accessories, fashion \n      clothing and Korean wave commodities. The first Skin Garden is the most popular Korean wave shop in K-Plaza \n      where many Korean wave products shopping malls and Korean traditional \n      restaurants are concentrated. The second store is gaining affections of \n      a large number of customers since it opened in June 2012 at ‘Design 89’, \n      a Korean wave amusement building. Providing diverse Korea-made cosmetics and other interesting things to \n      see, Skin Garden is crowded with family-oriented customers. For videos of various events held at Skin Garden, please visit (http://www.skingarden.jp/wpkr/yutube/).  Skin GardenYoungun Park, 82 70-8768-7946park98@skingarden.jp  Skin Garden, a K-cosmetics shop located in  Shinjuku, Tokyo, is attracting popularity as a filming site for TV drama series. Skin GardenYoungun Park, 82 70-8768-7946park98@skingarden.jp  ",
    "datetime": null,
    "url": "https://www.businesswire.com/news/home/20150128005345/en/Skin-Garden-a-K-Cosmetics-Shop-in-Shinjuku-Gains-Popularity-As-a-Filming-Site-for-TV-Drama-Series"
}