{
    "title": "'The 5th Wave': Book lover's critque - The Collegian",
    "text": "“The 5th Wave” hit the big screen last Friday. The movie was based on Rick Yancey’s novel, and for some, it seemed to be a fun, alien-invasion movie with a bit of action and, of course, forbidden romance. For those who have read the book and anxiously awaited the day the movie came out, however, this was a chance to see Hollywood either succeed in bringing a wonderful book to life or once again disappoint book lovers everywhere. “The 5th Wave” is about a normal 16-year-old girl Cassie Sullivan, played by Chloë Grace Mortez, who happened to survive four waves of an alien invasion and now has to find her brother, Sammy, who was taken by the military. The first wave was an electromagnetic pulse that killed all power on the planet. The second wave was a massive earthquake that destroyed many cities and set off a tsunami that destroyed almost all the other cities. The third wave was an alien flu modified to be unstoppable, killing billions of people. The forth wave, the aliens, also known as the Others, made it known that they were inhabiting human hosts. The fifth wave, though Cassie didn’t know it yet, was already in progress. For those who have read the book: In the acknowledgements of his book, Yancey recognized the movie studio for beginning work on the movie before the book was even finished, so now it suddenly makes sense that the second half of the movie was so far off. The movie writers didn’t have the end yet. The first half of the movie was solid. Though some very dramatic and emotional scenes were left out, clips of the four waves were included. These scenes were only glossed over in the book, so it was really cool to see them in the movie. The last hour or so, however, was painful to watch. Everything was changed, including very important revelations about certain characters. Let’s talk about Evan Walker. He starts off pretty dang close to what the book intended, but then the movie-writers decided to take him in an entirely different direction. They made him a lovesick puppy following Cassie around without any of his heartbreaking backstory. Messing with Evan’s character changed the ending drastically. Unfortunately, many of the characters felt flat and uninteresting compared to the book. Without spoiling anything, “prepare to be underwhelmed” is the only thing to say. The casting was OK considering the terrible character development. Everyone looked their part, but few could actually play the part, with the exception of Mortez, who did a spectacular job. The actors probably would have been phenomenal had it not been for the writers, who left out so many details and tidbits that the book included. The movie took out so much of the emotion, drama and fear that made the book fantastic and turned it into a cliche. It was such a disappointment, even though that should have been expected. I give “The 5th Wave” three out of five stars. ",
    "datetime": "2016-01-25T05:16:57+00:00",
    "url": "https://www.kstatecollegian.com/2016/01/24/the-5th-wave-book-lovers-critque/"
}