{
    "title": "'The Wave' Movie Review",
    "text": "By \n\n\tDavid Fear When you think  of disaster movies, you picture the all-star extravaganzas of the 1970s, when a who’s-who of famous faces fought to survive four-alarm fires, flash floods, killer-bee swarms, etc. — essentially a big-screen Love Boat episode with catastrophe sauce drizzled over it. Or you imagine the steroidal post-digital versions we get now, where an A-lister like, say, Dwayne Johnson takes on an earthquake and the seismic waves don’t stand a chance. (For the record: The Rock > falling rocks.) This Norwegian import about a small town hit by a gigantic tsunami, however, doesn’t try to out-blockbuster Hollywood in the CGI sound-and-fury department. The bombastic score and a soaking-wet centerpiece when the shit hits the fjord suggest director Roar Uthaug has studied up on the genre, but what it really wants to be is a waterlogged family drama in extremis. Trending\n\t\n\t\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tAt Least 22 Dead and Suspect at Large in Maine Shooting\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tDuran Duran Have Gone Fully Goth on Their New Album. Wait, What?\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBob Lee’s Murder Shook San Francisco. What Really Happened?\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tWatch Lady Gaga Perform 'Shallow' With U2 in Las Vegas Sphere The titular character, in fact, doesn’t even show up [spoiler alert] for nearly an hour; until then, viewers mostly get to watch a geologist (Kristoffer Joner, who resembles a feral, off-brand Jeff Foxworthy) fret over relocating his clan to the big city. The kids sulk and give him death stares; his hotel-manager wife (Ane Dahl Torp) is supportive but equally unsure this is the right move. When our hero suddenly senses that The Big One could hit under a perfect storm of circumstances, he stops the caravan right before they leave town and warns his co-workers that all is not well. The family is split up once a telltale rockslide signals an even worse disaster to come — at which point you’re reminded exactly why this film is called The Wave.  Once that modest (but nonetheless magnificent) spectacle brings the turmoil, it’s all floating corpses, passenger-seat impalements, swimming through underwater hotels passageways, last-minute rescues and revivals and, just for good measure, a strangling-by-strong-female-thighs. In fact, the more the movie leans into its claustrophobic, Poseidon Adventure-ish survival story in its last act, the more effective the film becomes; if the old-school fun of guessing which celebrity would make it out alive is M.I.A., Uthaug and co. know how to keep the stakes high and the screws tightened. More than anything, The Wave‘s ability to sustain tension out of its tired scenario makes it even more impressive than its Me Decade ancestors. Somewhere out there, Irwin Allen is either cursing them out in Norwegian or beaming like a proud papa. We want to hear it. Send us a tip using our anonymous form. Rolling Stone is a part of Penske Media Corporation. © 2023 Rolling Stone, LLC. All rights reserved. ",
    "datetime": "2016-03-04T15:49:00+00:00",
    "url": "https://www.rollingstone.com/tv-movies/tv-movie-reviews/the-wave-93513/"
}