{
    "title": "'The Plotters' by Un-su Kim and the rising profile of Korean literature - Macleans.ca",
    "text": "© 2023 SJC Media. Society The dark-as-a-dungeon page-turner shows the Korean wave isn’t just about film and pop music By Brian Bethune\n\n February 25, 2019 Prize-winning author Un-su Kim. (Roy Cruz) It’s one thing when a K-pop boy band addresses the UN, as global superstars BTS did in September, or when South Korean films like The Handmaiden regularly make foreign critics’ top-10 lists. It’s quite another when soju starts appearing in North American restaurants. Sora Kim-Russell was half joking when she pointed to the newly risen profile of Korean rice wine, which has never had a fraction of the international fame enjoyed by Japanese sake, as further proof the so-called Korean wave is still cresting. But, seated around a table in the Seoul library of the state-funded Literature Translation Institute (LTI) with a famous South Korean novelist, employees of the LTI and a Canadian journalist, Kim-Russell—the most prominent and by far the busiest Korean-to-English translator at work today—has more serious arguments to offer. “Whether it’s the government’s doing or just the flukes of culture, there’s a lot more attention and knowledge abroad about Korean literature these days,” says the American-born professor at Seoul’s Ewha Womans University. “Just look around,” Kim-Russell adds, waving her hand at shelves of Korean books translated over the past decade into everything from Hungarian to Malaysian, to show how the written word, as always following in the wake of more easily exportable music and film, is making its mark in the world. “You can see that the government has been investing serious money in this project. The Plotters is a particularly interesting case because we had a lot of government support for it.” READ: These are the books you need to read in 2019 Kim-Russell is referring to the 2010 novel by Un-su Kim, 46, the prize-winning author sitting across from her. LTI translation money certainly played a key role in bringing The Plotters to English—the translation, Kim’s first into this language, was recently published in North America—but government support also needs a spark. This one was almost surely provided by the enormous international success of a previous Kim-Russell translation, 2017’s The Hole by Hye-young Pyun, a superb literary novel with enough dark horror-story elements to win it the Shirley Jackson Award, one of the most prestigious in the genre. Suddenly, anglophone publishers were interested in the commercial possibilities of Korean writing, and Kim’s novel—unpredictable, often grotesquely funny, piled with corpses and dark as a dungeon—was waiting for them. The Plotters is also a compulsive page-turner. For decades, in a version of Seoul the novel’s publishers describe as “alternate” and Kim describes as just the way things are, governments, corporations and private citizens have been using loosely connected assassination guilds to take care of their little problems. The protagonist of the story is Reseng, who was literally raised in a library, albeit a library founded during the days of Japanese colonial rule over Korea and designed from its beginning to be what it still is, a cloak for a place “crawling with assassins, hired guns and bounty hunters.” Abandoned in a garbage can as a baby 32 years earlier, Reseng—whose unusual name means “next life”—was adopted by the library’s master, a cunning assassin-runner known as Old Raccoon, and trained to be a highly skilled murderer. The times are changing, though, even as the novel opens with Reseng looking through the crosshairs at his latest assignment. What had been a slow trickle of work for the library—whether killing Japanese collaborators on behalf of Korean resisters, or the reverse, or doing odds jobs for the military dictatorships that followed the Korean War—has turned into a flood with the coming of democracy. The military, which could bundle troublemakers into Jeeps in full view of their families, didn’t have much need for outsourcing, but civilian politicians and corporations require plausible deniability. They need “plotters” who can organize quiet killings and, just as important, offer tidy body disposals. New boutique assassination businesses have started up to meet the increased demand. One of those, run by a former Old Raccoon protégé named Hanja, a killer with a Stanford M.B.A., is far more in tune than the musty library is with market forces and corporate etiquette—just like a contemporary high-end department store, in Reseng’s sour summation, complete with beautiful door greeters asking customers, “Who can we kill for you today?” At the same time, victims’ families are showing the first signs of seeking not just a public airing but actual revenge, even as Reseng’s old companions are killed and Hanja alternates between offering Reseng enticements to join him and threats if he does not. When he finds a bomb in his toilet, Reseng knows his own life is balanced on a knife’s edge, and The Plotters races to a kinetically violent conclusion. Yet despite Kim’s attention to the details of every bullet in his plot, there is just as much going on under the novel’s surface—less overtly violent but just as dark. “I wrote this out of anger,” he says. “During the Japanese occupation and under the military, there were Koreans who supported those forces and people who fought for democracy and independence. Those [latter] people never actually got to rise in the end, and this country is still run by people who support colonialism and repression. I saw that heroic figures like Achilles die so easily, that the people who oppose human freedom can so easily kill them. Beauty dies so easily. Things are supposed to be better now, but there is no salvation in capitalism.” RELATED: The best books to read this winter Some of that rage can be seen in The Plotters’ mockery of Kim’s own calling. The library setting and the English title—the original Korean name leans toward a meaning more like “architects”—deliberately put Old Raccoon and Kim on the same page in their God-like sway over characters’ lives. Then there is Old Raccoon’s cry from the heart (and fist to the face) when he learns nine-year-old Reseng—who has never been to school—has somehow taught himself to read by way of the library’s picture books: “Reading books will doom you to a life of fear and shame.” Or at least to Reseng-level fatalism: among his bedside reading, all Western books, are volumes by Albert Camus and Andrew Solomon’s award-winning “atlas” of depression, The Noonday Demon. Books increase only awareness, not the power to act on that knowledge, The Plotters implicitly argues, and leave readers in paralysis. Reseng would have been better off in blissful ignorance. But most of the author’s anger, which hasn’t really abated over the past decade, is directed at the way he feels things are in his country, where a handful of people struggle to unearth the crimes of the past, the powers that be work hard to keep a lid on that knowledge, and most older Koreans carry around some kind of suppressed rage, with roots that stretch back for decades. That’s connected to the idea of han, described by Kim-Russell as the supposed defining feature of 20th-century Korean culture. “It’s not quite anger, more like a grudge that has come from a history of oppression, and particularly associated with women. It’s the idea of being so oppressed you can’t speak out about it, and so the discontent gets tamped down and expresses itself in other ways, perhaps through illness or through art or literature. It interests me because it’s one of those things in Korean studies where some people say han explains everything and some people say, ‘Stop talking about it.’ ” Kim doesn’t deny han’s reality. “I abhor it coming from my mother—or anyone else, for that matter—because it’s toxic, a poison that comes from having been continuously beaten down.” Like seemingly everything else in South Korean society, it’s grist for his satirical mill. There is a minor character, a middle-aged woman who takes out a contract on her husband’s life, changes her mind then returns a third time, offering to renew the deal if she can get a discount. Asked about her, author and translator both break into laughter. “Oh, her! Yeah, definitely han,” says Kim-Russell. “The other stereotype for Korean women that age is being so good at driving a bargain, apparently including when killing their husbands.” But Kim is dismissive of han’s interpretive power. “It is fading among contemporary Korean women,” he continues, “because han is about enduring without an exit, and modern women do not choose to feel that way.” That’s an unusually optimistic comment for him, and runs counter to what he feels about his compatriots as a whole and the fatalism they display, whether linked to han or not. All his novels, Kim says, like much of modern South Korean literature, explore why people stay moored in situations and structures that are killing them, figuratively or, as in the case of The Plotters, literally. Small wonder the author balks at calling his novel a thriller, a label he blames on genre-obsessed Western commentary. “It’s like calling The Little Prince science fiction,” Kim protests. “There are only good novels and bad novels.” And The Plotters is a very good one. © 2023 SJC Media. ",
    "datetime": "2019-02-25T21:37:30+00:00",
    "url": "https://macleans.ca/culture/books/the-plotters-by-un-su-kim-and-the-rising-profile-of-korean-literature/"
}