{
    "title": "'Universal Stories' Help Korean Dramas Find International Success",
    "text": " Profile Sections tv Featured More From NBC Follow NBC News A man arrested in the killing of a Baltimore tech entrepreneur was suspected of raping a woman days before and was already under surveillance, police say September 28, 2023, 12:24 PM Michael Gambon, the actor best known for playing Dumbledore in the 'Harry Potter' films, dies at 82 September 28, 2023, 8:02 AM Morning Rundown: Biden impeachment inquiry's first hearing, Powerball jackpot nears $1 billion, and Kansas City's love story with Taylor Swift September 28, 2023, 7:36 AM U.S. soldier Travis King arrives back on American soil after being expelled from North Korea September 28, 2023, 4:04 AM Remains found in Colorado are identified as Suzanne Morphew, a mom who disappeared in 2020 September 27, 2023, 5:54 PM The mother of a man suspected of killing a Baltimore tech CEO urged him to surrender, fearing police would try to kill him September 27, 2023, 2:37 PM Samiyah Defreitas was a college student in the middle of finals, but that didn’t deter her from traveling two hours in December to attend a pop-up event for DramaFever, one of her favorite sites to stream Korean dramas. Defreitas told NBC News that she started watching Korean dramas only a few years ago, despite not speaking the language, when her cousin introduced her. “At first I was sharing an account, but I ended up getting my own because I was watching so much,“ Defreitas said. “The comments section is usually pretty fun. It’s a little like a community.” Korean dramas have inspired Defreitas to learn the language, and she wants to teach in Korea after she graduates. She said she continues to watch Korean dramas because it offers something “different.” She's not the only one who's been caught in the Korean wave. According to data analytics company comScore, DramaFever had 2.4 million unique visitors in November 2016. According to the company, its users stream 800 million minutes of content a month. Ji-Yeon Yuh, a professor of Asian-American Studies at Northwestern University, told NBC News that \"structural factors that facilitate global consumption\" — such as the internet — have allowed Korean dramas to find a wider international audience. Want to spend New Year's night with in with some oppas? This list of amaze dramas has got your sorted ;) https://t.co/rfJTyIldoN pic.twitter.com/DzWBHDHdan \"But mere availability doesn't explain popularity,\" she said, noting that there is speculation that Korean culture is popular internationally because it offers a \"different aesthetic mode of modernity.\" \"That is, Korean drama and pop music, but drama especially, offer a version of a society that holds onto traditions and traditional values while moving forward as an economically advanced and developed society,\" Yuh added. For Amy Lau, a 15-year-old high school student, the dramas were something she “grew up watching” because of her mother, Aida Qyu, who has been a longtime fan. “The earliest drama I remember watching was 2002, ‘Winter Sonata,’” Lau told NBC News. “The theme song was like my childhood lullaby.” She and her mother now enjoy watching the programs together, and are currently watching “Goblin,” one of the most unprecedentedly popular television dramas in South Korean history, according to the Korea Times. Qyu laments that the current show schedule isn’t enough to fulfill her needs. “One week is only two episodes. If it were five, that would be good.” Qyu said. “You know, maybe seven would be really good.” For Lau and Qyu, neither of whom speak Korean, subtitles are necessary and were more difficult to find before websites like DramaFever and Viki, another streaming site, began operations. DramaFever offers international dramas on both free and paid subscription plans, similar to Hulu, and was acquired by Warner Brothers earlier in early 2016. It estimated that approximately 500 people attended its pop-up event to celebrate the release of “Goblin.” https://www.instagram.com/p/BNH4F_rjOMm According to the company, the majority of DramaFever’s user base is largely women of color. Of its female viewers, DramaFever found that 43 percent of them were white, 27 percent Latino, 24 percent Asian and 17 percent black. DramaFever offers shows from Europe and Latin America in addition to its Asian content, but Jacqueline Sia, the company's director of video operations, told NBC News, “Korean dramas take the cake. Asian dramas are really what people are looking for right now.” In order to satisfy growing international demand for these dramas, Sia and the DramaFever team translate the shows in-house, adding subtitles in English, Spanish, Portuguese, and simplified Chinese, and releasing them in as little as 24 hours after original broadcast. \"I think it really counts a lot,” Sia said. “Instead of going to pirated sites, with ads and everything, people come here for a clean experience.” The popularity of Korean dramas has also made them a prime target for American adaptions. Korean-American actor Daniel Dae Kim’s production company announced it was putting three pilots into development last year — two of them were adaptations of successful Korean dramas. (One of the shows, \"The Good Doctor,\" received a pilot order from ABC this week.) “I personally feel don’t remake any of these shows, because I’m a fan of the original, but I also appreciate that they’re trying to tell these stories,” Sia said. She noted that the dramas picked up for adaptation, such as “My Love From Another Star,” which broke records last year and tells the story of an alien falling in love with a human, are “universal.” “Those are very universal stories. They don’t have to be Korean,\" she said. \"I think they picked good stories to remake, so more power to them. And if people are interested in the original, they can come to DramaFever.” Follow NBC Asian America on Facebook, Twitter, Instagram and Tumblr. © 2023 NBC UNIVERSAL ",
    "datetime": null,
    "url": "https://www.nbcnews.com/news/asian-america/universal-stories-help-korean-dramas-find-international-success-n698511"
}