{
    "title": "(G)I-dle and Monsta X to play Europe's biggest ever K-pop festival | Live | Music Week",
    "text": "Login For assistance please contact Our Customer Service on: Tel: +44(0)20 8955 7020. Email: musicweek@abacusemedia.com Please enter your email so we can send you password reset link. An email has been sent to you containing a link to reset your password For assistance please contact Our Customer Service on: Tel: +44(0)20 8955 7020. Email: musicweek@abacusemedia.com K-pop stars Monsta X and (G)I-dle (pictured) are the first names announced for Europe’s biggest ever K-Pop festival, Kpop.Flex. On Saturday, May 14, 2022 at Frankfurt’s Deutsche Bank Park, 44,000 fans will witness performances from some of the world’s biggest K-pop stars, with five more acts still to be unveiled. The event is being staged by K-Pop Europa, in partnership with PK Events and Korean broadcaster SBS Television Network. K-Pop Europa is a partnership between Live Company Group and Explorado Group. A record-breaking year for K-pop drove South Korea to 44.8% growth and the position as the fastest-growing major market in 2020, according to IFPI. Its audience in the US has tripled in as many years, thanks to K-pop multi-group concerts. Kpop.Flex, the first event of its kind in Europe, aims to do the same as part of a five-year plan specifically targeting the continent. Formed through a Korean reality TV programme, Monsta X have continued to grow internationally. Meanwhile, (G)I-dle, who debuted in 2018 under Cube Entertainment, currently rank as one of the most popular K-Pop girl groups in Korea. The Korean Wave has been gathering force in Europe for some time David Ciclitira Kpop.Flex will kick off the music season at Frankfurt’s Deutsche Bank Park, which has already sold out three dates for Coldplay and two for Ed Sheeran later in the year. Korean broadcaster SBS will film the festival and create a made-for-TV edit, for screening in Korea after the event. David Ciclitira, a partner in K-Pop Europa and chairman of Live Company Group, said: “The Korean Wave has been gathering force in Europe for some time now, so we are particularly excited to be able to give our growing fan base what they want, right here on European turf, with the return to major live music events here in Frankfurt next Spring.” Deutsche Bank Park MD Patrik Meyer added: “Kpop.Flex is a really dynamic addition to our line-up, which includes Ed Sheeran and Coldplay – and we’ve already pre-sold 300,000 tickets for those. 2022 is going to be a memory-making year for our state-of-the-art stadium!” Mr Choi, from SSD Media Group, added: “SSD Media Group is extremely excited to be a partner with SBS in the Kpop.Flex mega concert in Frankfurt, Germany.” Tickets go on sale at 9am on Friday, December 10 at the official site and through Ticketmaster. For more stories like this, and to keep up to date with all our market leading news, features and analysis, sign up to receive our daily Morning Briefing newsletter ",
    "datetime": null,
    "url": "https://www.musicweek.com/live/read/g-i-dle-and-monsta-x-to-play-europe-s-biggest-ever-k-pop-festival/084808"
}