{
    "title": "(News Focus) Disney+ makes big bet on K-content for growth in OTT market | Yonhap News Agency",
    "text": "All Headlines North Korea Sports Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies URL is copied. By Kim Eun-jung SINGAPORE, Dec. 2 (Yonhap) -- As Korean dramas and films enthrall a wider global audience, entertainment giant Disney now looks ready to ride the Korean Wave to expand its presence in the thriving streaming market. Following streaming leader Netflix's international success of \"Squid Game,\" more viewers from across the globe are watching Korean series in various genres from zombie horror to thrillers and rom-coms streamed on over-the-top (OTT) platforms. Launched in November 2019, Disney+ has shown fast growth in the streaming service space with wide libraries of movies and TV shows, including original series and movies from Marvel, Star Wars franchises and animation studios. To further boost the subscription base, Disney+ presented a new slate of star-studded Korean dramas and documentaries on K-pop sensation BTS during the annual Disney Content Showcase held in Singapore from Wednesday to Thursday. Korean content and stars took center stage at this year's event, which unveiled plans to release over 50 original series in the Asia-Pacific region by the end of 2023, including 12 from South Korea alone. Luke Kang, president of The Walt Disney Co. Asia Pacific, introduces new movies and series during the Disney Content Showcase held at Marina Bay Sands in Singapore on Nov. 30, 2022, in this photo provided by Disney. (PHOTO NOT FOR SALE) (Yonhap)  Luke Kang, president of The Walt Disney Co. Asia Pacific, said the company is focusing on developing more localized content, such as Korean dramas, to better target audiences and bring them to the global market. \"We want to serve our viewers in every market with globally branded content like Disney, Marvel, Star Wars and Pixar, as well as locally produced stories that resonate with them, while also taking the best of those stories global,\" Kang said during the event held at Marina Bay Sands on Wednesday. Despite the lower production costs than Hollywood projects, Korean dramas have frequently made to the top 10 of global streaming charts this year, and some of them, including \"Extraordinary Attorney Woo\" and \"Narco-Saints,\" received acclaim from both critics and viewers. On Disney+, Korean series \"Big Mouth,\" \"Soundtrack #1 and \"In the Soop: Friendcation\" were the top-three titles in the Asia-Pacific region this year, according to the company. This composite image provided by Disney+ shows new Korean original drama series (clockwise from top L), \"Connect,\" \"Big Bet,\" \"Call It Love\" and \"The Worst of Evil.\" (PHOTO NOT FOR SALE) (Yonhap)  To ride on the popularity of K-dramas, Disney+ said it will step up collaborations with talented creators to develop high-quality content that can reach out to the global audiences. \"Korean culture and content are attracting the attention of people around the world and are exerting greater power than ever before,\" Kim So-yeon, CEO of Disney+ Korea, said during the event. \"Disney plans to continue expanding its Korean content lineup, collaborating with domestic creators, to bring excellent storytelling and presenting it to the world.\" Among the highly anticipated Korean dramas are \"Connect,\" directed by Japanese filmmaker Miike Takashi and starring Korean actors Jung Hae-in and Ko Kyung-pyo, and \"Big Bet,\" which will mark veteran actor Choi Min-sik's return to the small screen in 26 years. Webtoon-based series \"Moving,\" starring Ryu Seung-ryong, Zo In-sung and Cha Tae-hyun, and \"Call It Love,\" played by Kim Young-kwang and Lee Sung-kyung, will premier next year. Also coming next year will be two documentaries on BTS, which will chart the monumental success of the K-pop supergroup and tell the stories behind member J-Hope's solo debut. The release of a flurry of new original series was also seen as Disney+'s efforts to increase Korean subscribers in the face of tough competition with Netflix and three other homegrown OTT platforms -- Tving, Wavve and Coupang Play. According to data from app tracker Mobile Index, Disney+'s monthly active users stood at 1.79 million in October, far behind dominant leader Netflix's 11.36 million, Tving's 4.3 million, Wavve's 4.16 million and Coupang Play's 3.54 million.  https://youtu.be/CgMuLECr9Jw ejkim@yna.co.kr(END) All News National North Korea Economy/Finance Biz Culture/K-pop Sports Images Videos Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies Korea in Brief Useful Links Festival Calendar Weather Advertise with Yonhap News Agency ",
    "datetime": "2022-12-02T11:51:05+09:00",
    "url": "https://en.yna.co.kr/view/AEN20221202005000315"
}