{
    "title": "(Yonhap Feature) Samsung seeks more vibrant marketing via collaborations with BTS, other 'hallyu' stars | Yonhap News Agency",
    "text": "All Headlines North Korea Sports Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies URL is copied. By Joo Kyung-don SEOUL, Aug. 9 (Yonhap) -- Park Sung-hwan has been an ARMY, a fan of K-pop sensation BTS, for only about seven months, and when Samsung Electronics Co. announced the launch of BTS-themed gadgets, he didn't hesitate to buy one. Park, whose wife and daughter are also ARMYs, went to the Weverse Shop, the official online merchandising store of BTS, in June and ordered the Samsung Galaxy Buds Plus BTS Edition wireless earbuds. \"I bought them because I'm a BTS fan,\" Park said. \"I found that Samsung has really cared about fans of BTS and released products that can be meaningful to ARMY.\" As \"hallyu,\" or the Korean Wave, which refers to the global popularity of Korean pop culture, sweeps across the globe, Samsung, South Korea's largest company, is also trying to ride the phenomenon as it has reinforced marketing with homegrown celebrities and launched star-inspired products. This photo, provided by Samsung Electronics Co., shows an ad featuring BTS using the Samsung Galaxy Buds Plus and S20 Plus BTS Edition, released on July 9, 2020. (PHOTO NOT FOR SALE) (Yonhap)  It is not unusual for South Korean companies to work with famous hallyu stars to advertise their products, but when it comes to promoting its mobile devices, Samsung has rarely used celebrities in recent years, focusing more on explaining the technologies and qualities of their handsets. Marketing experts said Samsung's recent collaboration with BTS is aimed at more than just boosting its gadget sales instantly amid the novel coronavirus pandemic. They pointed out it is more of an investment as the tech giant wants to attract more young people who could become its loyal customers in the future. \"BTS is arguably the best idol in the world for the so-called MZ Generation, and Samsung had to do something with the next-generation consumers,\" said Suh Yong-gu, a professor who teaches marketing at Sookmyung Women's University in Seoul. The MZ Generation encompasses millennials and Generation Z, referring to those born between 1980 and 2010. \"Consumers aged between 30 and 50 are the largest buyers of electronics products,\" Suh said. \"For those who are to enter their 30s, BTS is the most popular star. BTS is like a bridge connecting Samsung and young consumers.\" Unlike Samsung's previous celebrity branding strategy, the company appears to be focusing more on sustainable partnerships with stars this time, rather than one-time promotional efforts, Suh added. This image captured from Samsung Electronics Co.'s Galaxy Unpacked event on Aug. 5, 2020, shows BTS members introducing the Galaxy Z Fold 2 smartphone. (PHOTO NOT FOR SALE) (Yonhap)  Before unveiling the BTS-themed gadgets, Samsung supported the augmented reality (AR) docent service of the boy band's exhibitions. It also provided BESPOKE refrigerators for \"House of BTS,\" the pop-up store of BTS, last year. \"The relationship between Samsung and BTS appears to be more than just an advertiser and an endorser,\" Suh said. \"This is an example of a co-branding strategy, where the two sides are pursuing a win-win success for sustainability.\" BTS has been also actively engaging in Samsung's recent events. The boy band appeared at Samsung's Galaxy Unpacked online event Wednesday and introduced the Galaxy Z Fold 2 foldable smartphone. Samsung said it joined hands with BTS because they share the same value: defying barriers to deliver meaningful experiences to people. \"We believed that a together-growing partnership will be created, bringing synergy that has never been possible,\" said Stephanie Choi, head of the global marketing team of Samsung's mobile communications business. \"Samsung is pursuing a true, authentic partnership, which we can leverage to highlight each parties' strength and unique aspiration.\" ARMY members are apparently satisfied with Samsung's collaboration with BTS. They think it is way more fan-oriented compared with other companies as Samsung's products better reflect the theme of the seven-member K-pop group. In fact, Samsung is not the first smartphone maker to work with BTS. In 2018, Samsung's local rival, LG Electronics Inc., released its G7 ThinQ BTS Edition smartphone in collaboration with the boy band. This image, provided by Samsung Electronics Co., shows the company's Galaxy S20 Plus BTS Edition smartphone. (PHOTO NOT FOR SALE) (Yonhap)  But Samsung's BTS collaboration is more appealing than LG's, according to a BTS fan surnamed Yoon, who runs a blog under ID \"Melonchoco.\" \"There are unique symbols that BTS and ARMY can recognize, such as purple color, milky way and whale,\" said Yoon, who has been following BTS for four years. \"I didn't expect Samsung to put those things in its product, so I was really impressed when it released the BTS edition.\" Yoon, who purchased the BTS edition of the Galaxy S20 Plus smartphone and Galaxy Buds Plus earbuds, said she knows many companies are releasing products endorsed by BTS, but many of them will not last long as they just offer posters and photo cards of BTS members as giveaways. \"Samsung analyzed what fans of BTS really want,\" she said. \"I believe that the rumor that Samsung developed the BTS edition gadgets with employees who are fans of BTS is true.\" Industry observers predicted Samsung may introduce more collaboration projects with hallyu stars even if its target market is small. This image provided by Samsung Electronics Co. shows the company's Galaxy A80 smartphone, Galaxy Watch and Galaxy Buds products inspired by K-pop girl group BLACKPINK. (PHOTO NOT FOR SALE) (Yonhap)  Last year, Samsung released the limited edition of its Galaxy A80 smartphone, Galaxy Watch smartwatch and Galaxy Buds in collaboration with K-pop girl band BLACKPINK for the Southeast Asian market. In Vietnam, the company launched a special edition of the Galaxy S10 Plus smartphone inspired by South Korean football coach Park Hang-seo, who became a national hero there after leading the Vietnamese men's national football team to victories at tournaments. \"When it comes to advertising, global firms need to think about both standardization and localization,\" said Kim Byoung-hee, a professor of advertising and public relations at Seowon University. \"Samsung is a big, global company, and obviously it will not pick a random star to promote its products.\" As hallyu supporters grow worldwide, collaborations with Korean stars are also likely to boost sales of Samsung's products. Samsung did not provide how many BTS-inspired products were sold and how much they contributed to its profitability, but market watchers said considering BTS' massive fan base, which is estimated to have millions of followers around the globe, the impact of the collaboration cannot be ignored. \"Fans think that buying Samsung's BTS-themed products is a way of helping BTS,\" said Koh Jung-min, a professor at the Graduate School of Arts and Cultural Management at Hongik University. \"That is why fans feel satisfied when they buy star-themed products.\" Koh believes that more South Korean companies, including Samsung, will expand their hallyu marketing. This image provided by Samsung Electronics Co. shows the company's special edition of the Galaxy S10 Plus inspired by South Korean football coach Park Hang-seo who leads the Vietnamese national football team. (PHOTO NOT FOR SALE) (Yonhap)  \"The power of hallyu got bigger compared to the past,\" he said. \"Previously, hallyu marketing was focused on other Asian countries, but now it is targeting Europe and the United States.\" Samsung hinted that it will further push its marketing with hallyu stars and content. \"The Korean wave, such as K-pop, K-dramas and K-movies, impacts global pop culture and Gen Z's lifestyle,\" said Choi from Samsung's mobile communications business. \"The momentum behind the Korean Wave comes from its power to bring people together around shared cultural experiences but also personal connections to cultural moments, and that's why hallyu is important and valuable to us.\" kdon@yna.co.kr(END) All News National North Korea Economy/Finance Biz Culture/K-pop Sports Images Videos Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies Korea in Brief Useful Links Festival Calendar Weather Advertise with Yonhap News Agency ",
    "datetime": "2020-08-09T07:22:00+09:00",
    "url": "https://en.yna.co.kr/view/AEN20200807000600320"
}