{
    "title": "10 K-drama actresses who started out as models, from Song Hye-kyo and Squid Game’s HoYeon Jung, to Jun Ji-hyun and the ‘Gigi Hadid of South Korea’, Lee Sung-kyung | South China Morning Post",
    "text": "Meet the South Korean actresses who began their careers as commercial and print ad models. Jun Ji-hyun Before dipping her toes into the K-drama world and becoming one of its highest-paid actresses, Jun Ji-hyun established herself as a fashion icon, appearing on the cover of Ecole magazine in 1997 and pursuing more modelling gigs that eventually landed her a Samsung MyJet printer commercial, catapulting her to fame. Following her popularity, she was given the lead role in the highest-grossing Korean romantic comedy film of all time, My Sassy Girl (2001). which also earned her the titles “nation’s first love” and “Korea’s sweetheart”. She eventually made her Hollywood debut in Blood: The Last Vampire (2009) and appeared in more chart-topping K-dramas such as My Love From the Star (2013) and Legend of the Blue Sea (2016). With her career spanning more than two decades, Jun is not only popular in South Korea, but throughout Asia. She’s cultivated such a strong fan base that almost all the products she endorses sell out like hot cakes, not only in South Korea but even overseas. The Hallyu star is known as the first-ever Korean actress to be photographed for American Vogue. She also appeared on the cover of many other prestigious fashion magazines such as Elle, Harper’s Bazaar, W and Marie Claire. Song Hye-kyo Her growing list of brand endorsements includes Italian luxury fashion house Bottega Veneta, high-end skincare line Sulwhasoo, and cosmetics brand Laneige, to name a few. Earlier this year, LVMH appointed Song as the first Korean global ambassador for Fendi and the Asia-Pacific ambassador for Chaumet. Shin Min-ah Even before carving her name in the acting business, the “goddess of beauty” of South Korea was recognised for making big strides within the fashion industry. Shin Min-ah has been modelling since the age of 14, spending her teenage years posing for photographs and appearing in commercials and music videos. Her success did not end there as she eventually made her acting debut in 2001 in the movie Volcano High. Her acting career took off after she starred in the comedy series My Girlfriend is a Gumiho (2010) and Oh My Venus (2015). She has also graced the pages of magazines not only in Korea, but overseas. She is known as the first Korean actress to have an exclusive feature in The New York Times T Magazine, and she once flew to Milan, Italy to shoot a Calvin Klein spread with Hollywood actor Jamie Dornan. Vogue’s editor-in-chief Anna Wintour was quoted praising Shin for her beauty and the final photo shoot result, according to Soompi. Gong Hyo-jin According to various media reports, the award-winning actress started receiving calls from agencies convincing her to further her acting career after she took a supporting role in the horror film Memento Mori (1999). Since then, Gong has appeared in 30 films as well as K-dramas with notable performances in It’s OK, This Is Love (2014) and When the Camellia Blooms (2019). Proving that she is a fashion icon in her own right, Gong launched her own fashion line called Excuse Me x Suecomma Bonnie in 2012 and has appeared on the cover of Vogue, Elle, W, Instyle and Harper’s Bazaar. She has also modelled for Valentino, Dior and Burberry, and is currently an ambassador for luxury watch and jewellery brand Piaget. Bae Doona Bae Doona was scouted by a Korean modelling agency while she was still in university. She started as a catalogue model for the clothing line CoolDog in 1998 and began her acting career a year later by debuting in the KBS TV drama School. Fast forward to 2016 and she became Louis Vuitton’s first-ever South Korean muse, representing the luxury fashion brand not just in South Korea, but in Paris and the US. In 2019, she graced the cover of American Vogue together with Scarlett Johansson and Deepika Padukone. Kim Hyo-jin After returning home from her brief stay in Australia, Kim Hyo-jin took some modelling gigs for teen magazines in 1997 before making her acting debut in 1999. She had several small roles before bagging bigger parts in the comedy film Everybody Has Secrets (2004) and family drama I Am Happy (2009). Kim also switched to theatre and delved into some erotic thrillers and LGBTQ+ films. While acting, she continued doing endorsement shoots through which she met her now-husband, actor-director Yoo Ji-tae. Over the years, she has graced the glossy pages of Marie Claire Korea, Elle and Harper’s Bazaar. Han Ye-seul She continued to act in comedic roles and later won several local best new actress awards. She was embroiled in controversy after missing two days of filming for the KBS TV drama Spy Myeongwol in 2011, according to The Chosun Ilbo, prompting a hiatus from acting. Eventually, she made a successful comeback in 2014 through the TV series Birth of a Beauty. Throughout her career, she has appeared in Harper’s Bazaar, Grazia and Elle. Lee Sung-kyung With her growing reputation as an ulzzang – a Korean term for “best face” or “good-looking” – she became one of the first model-actresses to be signed with YG Entertainment, a South Korean agency known for managing BigBang, 2NE1 and many more K-pop artists. As a top model, she has graced the covers of leading fashion magazines such as W, Vogue Girl, Grazia and CéCi. She has also endorsed Laneige, Fresh Pop and Adidas. Kim Ji-won Before bagging her roles in Fight For My Way (2017) and Arthdal Chronicles (2019), Kim Ji-won was a teenager auditioning for commercials and extras in music videos. The Hallyu star has since become the face of multiple brands such as Dr. G, Basic House, J. Estina, Lonsdale and even Shin Ramyun! She has also posed for magazines such as Harper’s Bazaar, Marie Claire and Vogue Girl. Jung Ho-yeon She kick-started her career at Seoul Fashion Week and then went on to compete in season four of Korea’s Next Top Model in 2013. She decided to leave Seoul to further her modelling career and made her international modelling debut as an exclusive model for Louis Vuitton in 2016. Since then, she’s walked for luxury brands like Chanel, Gucci, Prabal Gurung, Marc Jacobs, Jeremy Scott and Roberto Cavalli. The popular model has also posed on the covers of Vogue, Harper’s Bazaar, W, Dazed and Marie Claire, to name a few. ",
    "datetime": "2021-11-22T13:02:24+08:00",
    "url": "https://www.scmp.com/magazines/style/celebrity/article/3156915/10-k-drama-actresses-who-started-out-models-song-hye-kyo"
}