{
    "title": "2 men charged in theft of $36K of air conditioning parts",
    "text": "LOUISVILLE, KY (WAVE) - Two men wanted on theft charges for allegedly stealing thousands of dollars in property and selling it for scrap have been arrested. David W. Patterson, 56, and Brian Hampton, 37, were arrested months after they allegedly began stealing from River City Chiller Mechanical, a commercial HVAC company. Louisville Metro police arrested Patterson on a warrant for theft by unlawful taking over $10,000 and possession of burglary tools. Hampton was arrested in Nelson County. Jeffersontown police said Patterson and Hampton committed the thefts on three occasions over a three-month period. The men were recorded on video surveillance using an Enterprise rental truck to remove stock for air conditioners from the grounds of River City Chiller. “We knew their routine because we caught them on camera, so we set up a plan,” said Hoyt Howerton, the IT manager at River City Chiller. Destroyed equipment became the norm at River City starting in May. Two men were seen on camera stealing from industrial coolers, with their faces covered. “We drew this plan out in our heads and we put it down exactly as we planned it and they did exactly what we thought they would do,” Howerton said. The thieves stopped covering their faces and Howerton and his co-workers said they were sick of being targets. The employees hid a camera and set metal in strategic places. A motion activator also was placed in their trap, and a text notification was sent to their phones. In the middle of August, the trap led the suspects and police to the property at the same time. Hampton ran away, but Patterson fell into a ditch. Police found him and took him to Baptist Health Louisville for treatment of injuries, but police said he left the hospital before being formally discharged. “Well that takes the wind out of your sails,” Howerton said. “We were riding the high of setting up this intricate plan. We were proud and then they escaped.” The materials were scrapped at Grade A/Allstate on Grade Lane. Despite the suspects running, police used all the images captured by Howerton, leading to the two arrests. “It feels good to hear they are behind bars and can’t do this to any other business,” Howerton said. Patterson was booked into Louisville Metro Corrections and is being held on $10,000 bond. Copyright 2018 WAVE 3 News. All rights reserved. ",
    "datetime": "2018-09-19T00:23:34.931Z",
    "url": "https://www.wave3.com/2018/09/18/man-charged-theft-k-air-conditioning-parts/"
}