{
    "title": "2 men charged with 8 convenience store robberies",
    "text": "LOUISVILLE, KY (WAVE) - Two men accused in a string of armed robberies throughout Louisville have been arrested. Lavarr Melton, 27, and Robert Short, 35, are accused of eight gas station robberies in about a two month span. \"They needed the money,\" said Lt. Jennifer Coe of the Louisville Metro Police Department Robbery Division. \"They had young children to feed and that seems to be the motive behind these holdups.\" Police said the duo kept their M.O. the same, only targeting convenience stores early in the morning with Melton demanding cash at gunpoint as Short stood lookout as the getaway driver. [SLIDESHOW: Mugshot Roundup - August 2014] \"Mr. Short basically would enter the business a few minutes prior to Mr. Melton entering the business,\" said Lt. Coe. \"Mr. Melton would enter a short time later, and yes, he was masked and in each one of them he was armed.\" The pair is accused of holding up six different convenience stores, robbing two stores twice. Detectives said Melton had carried out this type of crime before. \"Mr. Melton had actually been arrested here in Louisville for three robberies dating back to 2008 time frame,\" began Lt. Coe, \"all same type of gas station holdups.\" Melton's latest string of armed robberies came to an end early Wednesday morning after police tracked down the duo and arrested them near Dixie Highway and Garrs Lane. \"We had some good help from the public and witness statements,\" said Lt. Coe. \"we had some witness information on a suspect vehicle that was believed to be a Crown Vic[toria] or a Grand Marquis. We disseminated that information out and it was indeed a grey Crown Vic that they were arrested in. So, that helped us tremendously.\" Both Melton and Short face eight counts of first degree robbery. \"We are up on robberies this year compared to this time last year,\" said Lt. Coe. \"we do believe that they'll just be responsible for these eight.\" Copyright 2014 WAVE 3 News. All rights reserved. ",
    "datetime": "2014-08-28T21:48:15Z",
    "url": "https://www.wave3.com/story/26395487/2-men-charged-with-8-convenience-store-robberies/"
}