{
    "title": "3 Questions: Stefan Helmreich on wave science | MIT News | Massachusetts Institute of Technology",
    "text": "Suggestions or feedback? Images for download on the MIT News office website are made available to non-commercial entities, press and the general public under a \n    Creative Commons Attribution Non-Commercial No Derivatives license.\n    You may not alter the images provided, other than to crop them to size. A credit line must be used when reproducing images; if one is not provided \n    below, credit the images to \"MIT.\" Previous image\nNext image In 2009, MIT anthropologist Stefan Helmreich explored the depths of recent scientific thinking about the living sea in his award-winning book “Alien Ocean: Anthropological Voyages in Microbial Seas.” Now, the Elting E. Morison Professor of Anthropology has turned his attention to the world of wave science — the study of periodic, oscillating, and undulating phenomena — in fields including oceanography, cosmology, electrical engineering, biomedicine, sports, and social science. Helmreich investigates waves not simply as facts of nature but also as objects of scientific, and therefore cultural, interpretation: Indeed, the very definition of waves is in transition, as waves are explored by new scientific modes of measurement and description. This fall, Helmreich delivered the prestigious Lewis Henry Morgan Lecture at the University of Rochester, an annual event established in 1963 to honor one of America’s first anthropologists. He recently elaborated on the ideas he described in his talk, which was titled, “Waves: An Anthropology of Scientific Things.” Q. How did you come, as an anthropologist, to study waves and wave science? Why are waves something that an anthropologist would care about? A. As an anthropologist of science … I am fascinated by how scientific abstractions operate to identify and create new entities in the world. So I am curious to learn, for example, what happens when scientists and lay people employ the abstraction of the “wave” to gather together quite disparate phenomena. How has it become possible, for instance, for ocean wave scientists modeling “rogue waves” to find inspiration in the formulations of colleagues in electrical engineering who seek to understand anomalous pulses of light in optical fiber? How do cardiologists tracking waves of electrical potential in the heart draw inspiration from research in physics? How has the image of the wave migrated into social theory, making it possible to speak of waves of opinion, of revolution, of immigration, of innovation? The cultural work of analogy in the sciences — natural and social both — fascinates me. And waves are excellent vehicles for tracking that work. Another reason waves might be of interest in anthropology is this: The discipline has lately become interested in thinking about that which is “beyond the human” — whether that is animal, plant, or microbial life or, indeed, the world of water, air, and earth. In a curious way, many anthropologists these days are trying to become less anthropocentric, thinking newly about all the other agents and objects with which we share the world. So, thinking about waves — particularly watery waves and the waves of the vibratory world — is part of that. I will say, though, that one irony of the new “post-human” anthropology is that training our attention on the liveliness of such substances as seawater, soil, and smog often gets us right back to following the effects of human action, especially in an age that many geologists now want to call the “Anthropocene” — a term meant to call attention to how the geological record today bears indelible marks of human agency, from histories of coal extraction to legacies of atomic testing and more. Q. In your Morgan Lecture, you suggested that scientists and engineers modeling and predicting ocean wave behavior treat waves like “texts.” What do these texts have to tell us? A. My lecture centered on fieldwork I’ve done recently among oceanographers, meteorologists, and buoy designers, all people concerned with measuring, monitoring, and perhaps managing wave action in the sea. By attending wave conferences … I learned that ocean waves, for the scientists who model and predict them, are at once real things in the world as well as statistical abstractions that are made legible through a relay of at-sea buoys, feeds of buoy measurements into wave models, and simulated projections of aggregate wave behavior.\nWhat scientists take a “wave” to be is an amalgam, a hybrid of instrumental captures of real-world events, mathematical descriptions of those events, and interpretations of those events for some purpose (such as weather forecasting). I find it useful, then, to think of waves as “texts\" that these scientists read for meaning. What do these special kinds of texts have to tell us? Well, the scientists with whom I spoke are curious to figure out whether Earth’s wavescape is changing in calibration with climate change. I find quite arresting the possibility that ocean waves — which might appear to be among the most “natural,” untouched-by-human sorts of things — might indeed be shaped by human action, might be characters in the Anthropocene. Q. How are models of wave action in such sciences as oceanography and, to take another example about which you've written, cardiology, matters of human interpretation and representation? What can we learn from recognizing this? A. While waves have a manifest materiality to them, the “wave” is also an abstraction, one that takes a particular form depending on how waves are conceived, observed, and modeled. In other words, waves often appear to scientists as “data,” and those data take shape in large part from the way that they are gathered — and that, in turn, depends on infrastructure. The world of waves cannot be understood scientifically except through networks of buoys, weather satellites, computer simulation systems, and more. That network is very patchy — much more elaborate, for example, in the Northern than in the Southern Hemisphere — which means that ocean-wave knowledge is unevenly distributed. There’s an international and hemispheric politics to who knows what about the oceans. Here’s another example of how waves are known — or not — through networks of infrastructure: Many heart disease patients who have had cardiac defibrillators surgically implanted in order to track life-threatening arrhythmias are wirelessly monitored; electrocardiograph visualizations of their arrhythmias can be fed to websites where medical professionals can study these waveforms to see who might need what intervention when. That practice, again, depends on infrastructure, not always evenly distributed. Some people’s irregular cardiac waveforms are more likely to be caught than others, a matter that runs right into questions of disparities in health care access and the like.\nThe implication, then, is that “waves” — whether, in my examples here, biomedical or oceanographic — are not simply or only natural things in the world, but are also measured and captured as such through humanly built infrastructure — which makes them, additionally, cultural and political things, and therefore objects of interest to anthropology. Previous item\nNext item Read full story → Read full story → Read full story → Read full story → Read full story → Read full story → This website is managed by the MIT News Office, part of the Institute Office of Communications. Massachusetts Institute of Technology77 Massachusetts Avenue, Cambridge, MA, USA ",
    "datetime": null,
    "url": "https://news.mit.edu/2014/3-questions-stefan-helmreich-wave-science-1121"
}