{
    "title": "4 Signs K-Pop Band K.A.R.D. Are Headed For Worldwide Success",
    "text": " K.A.R.D. are one of the many K-pop groups headed for crossover success.  This summer has been a rather atypical one on the music charts. While the Song of the Summer has historically been an English-language track, this year, just about everyone seems to agree that the winner was Luis Fonsi and Daddy Yankee's \"Despacito,\" the most successful mostly Spanish-language single since \"Macarena\" in 1995. And just this week, charts darling Taylor Swift was knocked off her Billboard Hot 100 throne by a total newcomer in Bronx rapper/reality TV star Cardi B. And now there seems to be another player shaking up U.S. charts: K-pop. Just this week, seven-member K-pop boy band BTS landed their first single on the Billboard Hot 100 with \"DNA,\" marking only the second K-pop artist to have a Korean-language single on that chart. (PSY's \"Gangam Style\" was the emphatic first back in 2012, when it hit No. 2.) Simultaneously, BTS' latest album, Love Yourself: Her, debuted at No. 7 on the Billboard 200 Chart, marking the first time ever a K-pop album has reached the top 10 of that chart.   Part of BTS' success is due, of course, to their massive and passionate fanbase, known as the ARMY. In case you haven't heard, they're a pretty powerful group -- powerful enough to drive BTS to take home the Top Social Artist prize at this year's Billboard Music Awards, beating out social darlings Justin Bieber, Selena Gomez, Shawn Mendes and Ariana Grande. But this unbridled passion isn't exclusive to them. Rather, it reflects a growing interest in K-Pop, one that has been gaining steam outside of South Korea ever since PSY first galloped his way into our consciences. The \"K-wave,\" as it's known, has grown stronger and stronger by the year. Which is to say: There couldn't be a better moment for rising K-pop band K.A.R.D. to introduce themselves. According to social and streaming data from analytics provider Next Big Sound, the co-ed foursome is seizing the moment. The band -- which comprises two women, Jiwoo and Somin, and two men, J.Seph and B.M. -- are currently at No. 7 on the Pandora Predictions Chart, which uses social media growth to predict the artists most likely to hit the Billboard 200 chart for the first time within a year. Taking a look at their data, it seems that K.A.R.D. could be headed to BTS levels. Here's why. They have a strong presence outside of South Korea Even before K.A.R.D. released their debut EP, Hola Hola,  the group had already embarked on their first tour, and it wasn't even in South Korea. Rather, their Wild KARD Tour -- clever, right? -- featured stops in the United States, Canada, and Brazil. And that was all on the success of just three singles. After the July release of Hola Hola, they expanded their reach in the U.S. to five cities on Part 2 of the tour, hitting Minneapolis, Washington, D.C., New York, Miami and San Francisco.   When measured by Twitter mentions per person with internet access, KARD see comparable fan... [+] engagement in the states and South Korea.  Looking at their worldwide popularity based on Twitter activity, it makes sense. While K.A.R.D. see a good amount of Twitter activity in South Korea, it's just as impressive in the States and parts of South America. Looking at the number of Twitter mentions per person with Internet access, the U.S. is on par, while some South American countries see higher rates of engagement. They have the sound So what is it about K.A.R.D. that has such a strong appeal outside of their home country? There are a lot of factors, but one likely reason is that their sound drips with that top-40 feel, particularly the top-40 feel that's emerged over the past few years. Looking at their catalog, it seems K.A.R.D.'s music is indebted to both EDM and reggae. Judging by the popularity of dancehall-influenced singles \"Work\" or \"Controlla\" and the ubiquity of the so-called \"pop drop,\" it seems K.A.R.D. have picked a formula that's proven to be successful.   For an example of this sound, listen to \"Don't Recall,\" which is one of K.A.R.D's songs with the strongest reggae influence. It's no surprise that \"Don't Recall,\" their sophomore single, is the band's most popular track on Pandora, with around 1 million spins to date. Their audience is highly engaged Anyone with a well-endowed wallet can have a lot of followers; just ask these people. But not everyone can manage to have high engagement, which is, essentially, the number of people interacting with you compared to the number of followers you have. K.A.R.D. don't have a problem with that, and instead have what Next Big Sound would qualify as strong fan engagement. A good way to measure audience engagement is looking at the ratio of Pandora Thumbs Up to Pandora Spins. While K.A.R.D. haven't quite caught up with BTS on their spin-to-thumb ratio -- give them some time -- they are already heavily outperforming some major American pop stars, including Justin Bieber and Selena Gomez. On social media, meanwhile, K.A.R.D. have particularly high engagement on Facebook, where they've seen an average of close to 13,000 \"talking about this\" per day over the past month. There's something different about them There's something very noticeably different about K.A.R.D. compared to other K-pop groups. While most of their predecessors have been either boy bands or girl bands, K.A.R.D. are co-ed. Does that mean that they appeal to a wider audience? Maybe not. Like the all-male BTS, an overwhelming majority of K.A.R.D.'s audience is women 18 to 24, but they do manage to skew ever so slightly more male than BTS on Pandora. Even if their gender makeup doesn't affect the audience they attract, it surely doesn't hurt to stick out.  ",
    "datetime": null,
    "url": "https://www.forbes.com/sites/emilyblake1/2017/09/27/kard-k-pop-music-charts/"
}