{
    "title": "40 years after de-segregation, a look back at busing in Louisville",
    "text": "LOUISVILLE, KY (WAVE) - This school year marks 40 years since the U.S. Supreme Court school bus ruling that merged the Louisville and Jefferson County districts. The merger also created a desegregation plan that included mandatory busing and racial guidelines for school assignments that still spark controversy today. Tracy E. K'Meyer, author of \"From Brown to Meredith: The Long Struggle for School Desegregation in Louisville, Kentucky, 1954-2007,\" spent several years gathering the verbal narratives and history leading up to and through the desegregation of schools in Louisville. \"In 1964, when the civil rights act passed, it included a measure that said if your schools aren't integrated by 1974, you lose your federal funding,\" K'Meyer said. [RELATED: Dawne Gee shares heart-racing memories of desegregation, busing] Louisville's city and county schools were segregated at the time and as different as black and white. \"About (1971) they got to Jefferson County,\" K'Meyer said. \"They got to Jefferson County and found persistent segregation in Jefferson County Schools. The Kentucky Civil Liberties Union, the NAACP and the Kentucky Commission on Human Rights filed a lawsuit asking for the merger of the school systems and the desegregation of the systems.\" K'Meyer recently detailed the story of a teacher who thought someone was playing a joke on her when she arrived at her west-end school only to find out there was only one pair of scissors, and the teachers had to share them. \"The classrooms didn't have scissors, and the teacher had to go down to the office to check out a pair of scissors for a couple of hours,\" K'Meyer said. Pamela Smith was a student at Shawnee High School until her family moved to Shively. Although she loved Shawnee, she said she was surprised by the huge disparities between the school she attended in the west end and the school she attended after she moved. \"We would read about science experiments and what was supposed to happen,\" she said. \"We didn't actually get to see it because we didn't have working Bunsen burners or chemicals to do experiments with. We had to get the same information without the same resources.\" In 1975, the appeals and arguments in the courtroom ceased and the drama moved to the classroom, and while the merger was good news for some people, there were opponents throughout the city. Edith Nelson Yarbrough was ready to attend high school but wasn't aware her life and the city around her were about to go through drastic changes. \"Late summer, we got a letter in the mail and the letter told me my assignment,\" she said, describing her reaction to the letter. \"Wow. I'm going to Fairdale. Where is that? Where's Fairdale?\" The school bus rides were long and in the first few weeks very dangerous. Under the court order, school enrollments had to be between 15 and 50 percent black. White students were bused for two of their 12 years of schooling. black students as many as 10. Then-Gov. Julian Carroll called on the Kentucky National Guard during the first few days of forced busing to protect the students and the buses. \"As that bus slowed down into the parking lot, we had sticks, cans, bricks, limbs of trees all thrown at the bus,\" Lynn Elliot told WAVE 3 News as tears streamed down here face. \"A lot of us were on the floor of the bus.\" Elliot added that she was horrified, but what was worse than having thing thrown at her and her friends was what was said to them. \"I can remember finding something that said a n***** hunting license, and it talked about what you could do to a black person,\" she said. \"I don't think that one could ever be prepared for what we went through.\" John Stovall, who now works for JCPS, was a student who lived in Fern Creek. Stovall was bused from his home school Moore to Thomas Jefferson. \"I remember them burning tires in front of Southern High School,\" he said. \"I remember the KKK.\" Stovall said the kids handled the conflict better than the adults did. \"Back in the day, this side of town had this, and this side of town had that, and you really didn't intermingle,\" he said. Cate Fosl, an associate professor at the University of Louisville and the director of the Anne Braden Institute for Social Justice Research, said she hopes the entire country has learned from local efforts. \"It's really shocking to look back and see the protest and see the poor treatment of some of those early pioneers,\" Fosl said. \"At that moment in history here, you could not be for racial justice and be against busing.\" JCPS recognizes in its vision today that the current state of educational inequity is due to complex political, historical, social and economic forces. The JCPS states its goal today is that \"all students will graduate prepared to reach their full potential and contribute to society throughout life.\" Copyright 2016 WAVE 3 News. All rights reserved. ",
    "datetime": "2016-02-09T02:58:45Z",
    "url": "https://www.wave3.com/story/31170091/on-a-journeybusing-a-look-back/"
}