{
    "title": "5 K-dramas and films delayed by Korea’s fourth Covid-19 wave, from Netflix’s Money Heist to Bogotá: City of the Lost starring Song Joong-ki | South China Morning Post",
    "text": "TV and film productions in Korea are being halted as the country enters what appears to be a fourth wave of Covid-19 infections. Companies including KBS and Netflix confirmed disruptions to their shooting schedules.\n\nOn Tuesday, July 6, a press conference for TVN’s reality show Udo Inn was cancelled abruptly because actress Kim Hee-sun had to undergo Covid-19 testing after Cha Ji-yeon, who has been starring in the musical Red Book and preparing for the upcoming musical Gwanghwamun Sonata and Netflix’s series The Bride of Black, tested positive for the virus on Sunday, July 4. Kim, as well as the rest of the cast and crew for The Bride of Black, have been tested and were all confirmed negative. Cha’s infection has also dented the live theatre sector. The musical Red Book has been suspended until July 17, while a press conference for Gwanghwamun Sonata, which was originally scheduled for Monday, July 5, was called off.\n\nSince the beginning of July, the number of new confirmed cases in Korea has shot up, prompting the government to review elevating the social distancing rules to the highest level. Some 1,275 cases were reported on Thursday, July 8, the highest tally Korea has seen throughout the pandemic, which began early last year. Earlier on July 2, the production team for the crime drama film Bogotá: City of the Lost, starring Song Joong-ki, announced it halted filming after one of the actors had been in contact with a person known to have been infected. “Shooting of the film will not resume until the whole cast and crew end their self-quarantine. We will adjust production schedules after paying close attention to the situation and making full preparations for safety,” the film’s distributor Megabox Plus M said. KBS, a major public broadcaster, has suspended filming the daily TV series Be My Dream Family after an actor tested positive on Monday, July 5. The cast and crew all tested negative, but the show will not be airing episodes from July 19 to 23 as a result of the precautionary measure. “Complying with the health guidelines of the government and for the safety of our cast and crew, we have decided to pause production schedules for now,” the production team said. Want more stories like this? Sign up here. Follow STYLE on  Facebook,  Instagram,  YouTube and  Twitter. ",
    "datetime": "2021-07-11T09:00:10+08:00",
    "url": "https://www.scmp.com/magazines/style/celebrity/article/3140524/5-k-dramas-and-films-delayed-koreas-fourth-covid-19-wave"
}