{
    "title": "\r\n[Scholars and Their Spaces] Die the death of hero: Korean spirit and K-wave",
    "text": "Most Popular G-Dragon booked for drug use South Korea, Qatar agree to elevate ties, forge $4.6b industry partnership Former Olympic hero battles rumors surrounding her groom-to-be S. Korea goes all out to contain lumpy skin disease Yoon pitches S. Korea's investment appeal to Middle East Yoon meets Park, honors father in gesture of conservative unity 4-meter deep sinkhole injures 1 in central Seoul [News Focus] A year after Halloween crowd crush, legislation remains stalled Olympic medalist ‘tricked’ by fiance-turned-stalker Braving wind and high water to celebrate Dokdo Day Start your day with a roundup of key stories from The Korea Herald with news and comment on all that’s happening in Korea. Published : Sept. 24, 2022 - 16:01 Link copied The hiring system of Goguryeo is called \"sunbae,\" meaning a man of high character. It enabled people to become government officials regardless of their status or class. It was also the parent to the system of “Hwarang,” or warriors, in the Silla Kingdom. Hwarang cultivated morality with each other through communal life. They enjoyed singing and making music together while walking in the mountains and valleys, fully enjoying nature and training the body as well. It was also important to learn geography in preparation for war. Such people were chosen and recommended to the government. Our ancestors considered people who were verified through community life and improved themselves physically and mentally through relationships with others to be fit for working for others. As a historian, Shin Chae-ho (1880-1936) also thought highly of being good at both literary and martial arts -- like Hwarang -- and named their way of thinking \"nangga.\" He also viewed it as Korea’s own national spirit. On the other hand, he criticized Korean neo-Confucianism as having lost its identity in placing too much importance on education that was biased in favor of literary studies and removed from reality. He saw it as held captive by formalism, familism and Sinocentrism. Instead, the onetime Confucian scholar and professor at Sungkyunkwan academy highly valued Silhak, a progressive Confucian social reform movement. Shin tried to achieve national independence through a sense of history. He stressed studying Korea's own history to restore its national spirit, and not teaching history that was distorted by sycophants or Japanese collaborators. This is the reason why his historiography is called the history of nationalism. Moreover, he was engrossed in extreme heroism and looked forward to the appearance of a hero who would bring an end to the Japanese occupation. He wrote critical biographies of heroes on the battlefield in Korean history such as Adm. Yi Sun-sin of Joseon, Gen. Choi Yeong of Goryeo and Gen. Eulji Mundeok of Goguryeo. As a journalist, Shin bitterly criticized Japanese imperialist aggression and the anti-national activities of pro-imperial Japan individuals in the newspaper where he worked, the Daehan Maeil Sinbo. He was relatively free to write the articles thanks to the chief editor of the newspaper, Ernest Thomas Bethell, who was British. However, watching the fall of the Korean empire, Shin decided to leave his homeland and travel to Manchuria, Shanghai, Qingdao and Vladivostok to prepare armed struggles for national independence. “Independence is not given by chance but achieved through struggle,” said Shin, who knew this better than anyone. He made bombs while writing articles and researching history wandering foreign lands. Unfortunately, Shin, a legendary independence activist, historian, journalist and Confucian scholar, died as an anarchist in prison abroad. He wanted his ashes to be scattered at sea, but his wife returned with her beloved husband’s remains to his grandfather’s hometown, Chungwon in North Chungcheon Province. Shin was finally able to come home after a 26-year absence. Although Imperial Japan did not allow him to be buried in his homeland, poet Han Yong-un sharpened his gravestone and calligrapher Oh Se-chang engraved his name on the stone. Thanks to his comrades in the independence movement, he could at last be buried in his homeland. “When a Buddha comes to our Joseon, it becomes not ‘the Buddha of Joseon’ but the country becomes ‘Buddha's Joseon.' When Confucius comes here, it becomes not ‘the Confucius of Joseon’ but ‘the Confucius' Joseon,'” he said, in criticizing the prevailing sentiment of kowtowing to more powerful countries. Shin was always wary of Korea becoming a nation that loses its identity and its people forgetting who they are and where they come from. Today the Korean wave is roaring through the world, not to mention neighbors China and Japan. Koreans did not forget who they are and where they come from. Now, \"the Buddha of Joseon” and the \"Confucius of Joseon\" have come true.  By Park Jeong-eon (histopia78@gmail.com) Park Jeong-eon is a senior researcher at Chungnam Institute of History and Culture. -- Ed.    Articles by Korea Herald The Korea Herald by Herald CorporationCopyright Herald Corporation. All Rights Reserved.  ",
    "datetime": "2022-09-22T17:07:53+09:00",
    "url": "https://www.koreaherald.com/view.php?ud=20220922000809"
}