{
    "title": "A beginner's guide to Korea's addictive TV dramas - CNET",
    "text": "Our expert, award-winning staff selects the products we cover and rigorously researches and tests our top picks. If you buy through our links, we may get a commission. Reviews ethics statement I'm hopelessly hooked. The world outside Asia is fast catching on to the phenomenon known as Hallyu: the Korean Wave. Put simply, Korean culture is going global in a big way. K-pop band BTS are now at the top of the Billboard music charts with not one, but two songs certified gold by the Recording Industry Association of America, and they've got a much-anticipated collaboration with Canadian singing sensation Shawn Mendes expected. Music aside, the Koreans' knack for making good TV is why the trend is unsurprising. Korean shows typically incorporate creative and unusual elements. Unafraid of breaking boundaries, they are unconventional, yet hilarious and oddly satisfying to watch. There's something for everyone, from lighthearted dramas and variety programmes like Busted! that have you laughing so hard your stomach hurts, to 100-episode dramas with increasingly ridiculous story lines you can't help finding yourself addicted to. There are so many I love -- and even more I'm catching up with. If you haven't caught up on Hallyu, here are 11 shows we recommend you start with. If there's something not listed here you've loved watching, share it with us in the comments below. Pinocchio. No, this is not an adaptation of Disney's wooden puppet. Korea's Pinocchio features drama darling Park Shin-hye as Choi In-ha, who hiccups whenever she tells a lie. Together with her friend Choi Dal-po (also Ki Ha-myung), portrayed by Lee Jong-suk, they become rookie reporters at rival networks. It later turns out Ki's family is a victim of fake news from years ago, and its perpetrator was none other than Choi's mother, who in present day is a tremendously successful reporter. A twist of fate leads to both characters working on the same goal: to eradicate fake news. Definitely add this to your must-watch list if fake news is abomination to you or if you don't get why people hate it so much. You can stream it on Amazon Prime, Viki. Strong Girl Bong-soon. So many films tell me saving the world is a man's job. Not Strong Girl Bong-soon. Do Bong-soon, played by another drama sweetheart, Park Bo-young, is a cute, petite girl born with extraordinary strength, for which she's hired by a game development firm to protect its boss. It's refreshing to see Do stop a bus with her bare hands and punch teeth out of street mafia. More than a year since its finale, I still remember 80 percent of what happened in the show -- that's how much I loved it. You can stream it on Amazon Prime, Netflix, Viki. Yep, that must be the lustful, virgin ghost in Bong-sun's body. Want more of actress Park? In Oh My Ghost, she plays Na Bong-sun, a girl who becomes possessed by a ghost (Soon Shin-ae, portrayed by Kim Seul-gi) and consequently transforms from timid and unconfident into a feisty girl on a mission. The mission: Soon wants to lose her virginity, which will apparently resolve her \"grudge\" and help her move on to the afterlife. Soon is fast running out of time though, and if she doesn't meet the deadline she'll become an evil spirit. The show is full of hilarious moments, but as with most dramas featuring death, prepare to sob into your Kleenex. You can stream it on Amazon Prime, Netflix, Viki. The Sound Of My Heart. Are you an aspiring comic artist? The Sound of Your Heart offers this formula for success: Paint the mundanity of your family's daily life. That's how South Korean artist Jo Seok (played by Lee Kwang-soo in the show) hit the jackpot. The series, based on his 2006 webtoon, covers his mom's attempt to one-up her friend's \n  smart home\n devices, his brother's hours-long video call involving a trip to the grocery store, and how Jo won the heart of his girlfriend-turned-wife, Ae Bong (Jung So-min). Small in details, big on funny. You can stream it on Netflix. Descendants Of The Sun. Descendants of the Sun is a love story starring real-life couple Song Joong-ki and Song Hye-kyo, who play the captain of South Korea's Special Forces Unit and a doctor respectively. Unlike typical romance dramas, this takes place in the fictional war torn country of Uruq, where Yoo (Song Joong-ki) is on a peacekeeping mission and Kang (Song Hye-kyo) leads a medical team. But there's a lot more going on than mere sappy love scenes, and you find yourself holding your breath whenever someone's in danger. You can stream it on Amazon Prime, Netflix, Viki. Fight For My Way. Ditching the usual Cinderella storyline, this feel-good drama goes in favour of life's \"supporting actors.\" Fight For My Way puts its heroes through various hardships -- like Choi Ae-ra (portrayed by Kim Ji-won) having her career sabotaged more than once by her best friend Ko Dong-man's (played by Park Seo-joon) jealous girlfriend -- forcing them to fight for their dreams. While this show is a good reminder not to let life get you down, I do wonder if the characters were already destined for success, all of them blessed with talent. You can stream it on Amazon Prime, Viki. Good Doctor. This is the very show that inspired ABC's The Good Doctor. While the leading characters in both dramas are autistic savants, Park Shi-on (Joo Won) is a pediatrician in South Korea's version. I've loved medical dramas since I was a kid watching Hong Kong's take on this genre, but what made this outstanding for me was its portrayal of an autistic savant as a doctor. More than it being a heartwarming show, it has definitely helped me understand more about those living with autism. You can stream it on Amazon Prime, Netflix, Viki. Goblin: The Lonely and Great God. God has a plan and you can't change it, according to this wonderfully weird Korean fantasy romance. In Goblin: The Lonely and Great God, ancient magic can turn you into a goblin after death, meaning you get to live for centuries, with endless wealth and a servant whose descendants will keep serving you for as long as you live. You also get to travel the world by opening literal doors. Sound good? The catch is you have to \"live and die\" every few decades and get a new fake identity so the authorities won't suspect something's up. One of the best, weirdest shows Korea has to offer. You can stream it on Amazon Prime, Viki. Strongest Deliveryman. Strongest Deliveryman is a story about a food delivery app. But it's not just any app. An entire street of restaurant owners depend on it to save their businesses. The show's delivery company helps small eateries fend off a huge restaurant chain from taking them over. It also explores the dangers that delivery men face -- a car hits one of them and drives off. By the end of the show, I found myself becoming more patient when my deliveries arrived late in real life. Also, prepare to be awed by exceptional driving skills. You can stream it on Amazon Prime, Netflix. Things get a little intense on Circle: Two Worlds Connected. If you've always wondered what lies in Earth's technological future, look no further than Circle: Two Worlds Connected. The Korean sci-fi suggests the world will be split in two: one called \"Smart Earth,\" equipped with all sorts of high-end technology, and the other more like society as we know it. While the show delves mainly into one question -- will tech make us happy? -- it explores the existence of aliens and ethical questions involving science and technology. This show has been labelled the true sci-fi Kdrama. I'm still missing it a year after finishing it, and part of that is because of an open ending I haven't had figured out yet -- and there's no word yet on a second season. You can stream it on Amazon Prime. I don't think I need to tell you which of them is the evil, whiskey-guzzling twin on Duel. This Korean sci-fi involves a dynamite combo of action and clones. The drama starts right from the beginning and never stops, just like the rollercoaster of emotions it's bound to put you through over 16 episodes. You'll feel bad for the clueless man (Sung Joon, played by Yang Se-jong, also my newest eye candy) who keeps getting beaten up, and you'll likely feel worse for his evil, non-stop whiskey-guzzling twin Sung Hoon. If you're brave enough to watch, be warned that you'll probably need boxes of Kleenex to tide you over. You can stream it on Amazon Prime. First published July 8, 4 a.m. PT. Update, Oct. 16 at 6:54 p.m.: Removes DramaFever links, as the streaming service is shutting down. CNET Magazine: Check out a sample of the stories in CNET's newsstand edition. Read next: Best Netflix series for July 2018 ",
    "datetime": null,
    "url": "https://www.cnet.com/culture/entertainment/a-beginners-guide-to-korean-drama/"
}