{
    "title": "A big rap for The Korean Wave in London | The West Australian",
    "text": "A decade ago, a song by South Korean rapper Psy took the world by storm, with the music video for Gangnam Style becoming the first YouTube clip to hit a staggering one billion views. The catchy tune told of an upmarket district in the capital Seoul, but it was his offbeat dance moves that inundated social media as people did their best to replicate them, including then British prime minister David Cameron and even United Nations secretary-general Ban Ki Moon. Although Barack Obama didn’t step up for his shot in front of the cameras, the president said the impact of the video was undeniable in playing a part in “people being swept up by Korean culture”. A wall of screens replaying this globally recognisable video (as well as some of the many parodies and covers that came after) greet me as I enter Hallyu! The Korean Wave, a new exhibition being staged at the V&A in London. A celebration of the cultural exports from the country — think K-Drama, K-Pop and K-Beauty — the impact of these industries is undeniable. Named after the term that identifies the increase in the global popularity of South Korean culture in recent decades, hallyu was first coined back in the 1990s, and specifically relates to the phenomenal popularity of creative industries, from technology and cinema, to music, beauty and fashion. While South Korean culture has seemingly been making its mark in the West in more recent times, it was in the early 1990s that the first wave started to ripple across the world, led by the country’s film and television offerings. Long before Parasite or Squid Game, silver screen offerings like Oldboy (2003) and Train to Busan (2016) picked up cult followings, but as Parasite director Bong Joon Ho pointed out when picking up the Best Picture Oscar for his film in 2020, “once you overcome the one-inch tall barrier of subtitles, you will be introduced to so many more amazing films”. Soon after, it was clear the Korean wave had well and truly started to break over the Western world. Studios and streaming services have been taking note, with Netflix investing more than $700 million into original Korean content since 2016, leading to the development of hit shows like Crash Landing On You (2019), Hellbound (2021) and All Of Us Are Dead (2022). With plenty of memorabilia from some of the county’s most loved silver and small screen productions on display (keep an eye out for Oh Dae-su’s Oldboy wig and a full-scale replica of part of a banjiha, the basement flats presented in Parasite), you are likely to leave wanting to dive into the back catalogue of any you haven’t yet tuned into. If you dare, you can also get close to the tracksuits and boiler suits made famous by the players and guards in Squid Game, which manage to send a shiver down my spine as I recall the terrifying scenes of the show. It’s not just the Korean screen industry that has found success spreading at a sensational pace. It may have been around for three decades now, but K-Pop has made global superstars of the artists (or “idols”), who form part of the pop groups that have spurned excitably loyal fandoms. Despite the language barrier, bands like BTS and Blackpink have seen their hits rocket up the charts, with their catchy tunes and polished performances reminiscent of the boy and girl bands that dominated in the nineties and noughties. Even if you think you haven’t heard this unique blend of musical genres, you’ve almost certainly (maybe inadvertently) overheard BTS’ 2020 single Dynamite, which debuted at No. 1 on Billboard, and saw the band become the first Korean artist to be nominated for a Grammy. Headphones line the walls of the section dedicated to K-Pop, allowing those who might not be as familiar with some of the lesser-known Korean artists to bop along. If you’re feeling brave (and co-ordinated) enough, Hallyu also gives visitors a chance to bust out some moves and participate in a virtual K-Pop dance class. Although I wouldn’t have said no to getting to try some of the exclusive (and expensive) K-Beauty brands behind some of the displays, that part of the exhibition is more educational, but just as extensive, running through the history of beauty practices and products, and how the West has adopted many of these now too. As the third largest exporter of cosmetics in the world, Korean products are the result of highly advanced research and product development, offering users original ingredients, advanced skincare and eye-catching packaging. Product placement in movies, shows and on stage has helped with marketing too, as is the case with Korean fashion, with branding accelerating popularity internationally when the latest ‘IT’ TV or music star wears a new eye-catching look. Daring street style outfits from Seoul Fashion Week to show-stopping creations worn on the stage by K-Pop idols are spotlighted, as are some of the country’s traditional costumes in the final section, dedicated to beauty and design. Historically reserved for ceremonial occasions, the reinvention of hanbok is helping to expand its appeal and encourage younger generations to express their heritage. Designers like the late Lee Young-hee have been part of this movement, with several striking pieces from her 1993 collection Costumes du Vent (Wind Dresses), framing the final few steps out of the exhibition, a striking symbol of how this country has managed to mix its traditions with modern advancements. If the cultural and economic effects of these facets of Korean culture aren’t enough to convince you of the impact of the Korean Wave, in 2021, the word hallyu (alongside 25 other Korean words), were added to the Oxford English Dictionary. Daebak! + Hallyu! The Korean Wave is on until June 25, 2023. Sign up for our emails Find out More © West Australian Newspapers Limited 2023 ",
    "datetime": "2022-10-09T00:12:00.000Z",
    "url": "https://thewest.com.au/travel/a-big-rap-for-the-korean-wave-in-london-c-8428025"
}