{
    "title": "A Brief History of K-pop | Teen Vogue",
    "text": "By Brittany Vincent It's K-Pop Week! Teen Vogue is exploring the popular music genre with articles that explore its origins, biggest stars, and intricacies. Whether you're a BTS ARMY, a self-described BLACKPINK Blink, or a member of LOONA’s Orbit fanbase, there's one thing we can all agree on: K-pop is a global phenomenon quite unlike anything else. While we can credit South Korea as the country with many of the obsessions we carry with us every day (emotional television dramas, Mukbang videos, and amazing skincare routines), one of its most dominant, effervescent exports is glistening, well-produced pop music. Hallyu, colloquially known as the Korean culture wave, is truly a force to be reckoned with. Ever since the early '90s, K-pop has been slowly refined into nothing less than an art form, and it's become an influential powerhouse over the years. From groups such as Girls’ Generation and NCT 127 to BIGBANG and 2NE1, there’s a band out there to suit every taste. That’s on purpose. K-pop performers are both ridiculously talented and malleable. They can excel at a variety of different styles: rap, bubblegum pop, ballads, and rock. And a good portion of South Korea's most famous K-pop exports come wrapped in a dazzling, iridescent candy coating in the form of their meticulously-crafted packaging; everything from outfits to hairstyles to overall images are carefully measured to craft a certain brand that’ll reel in droves of fans. While the emergence of \"true\" K-pop can arguably be traced back to acts that debuted ahead of the '90s, it wasn't until the debut of one particular group that the genre as we know it officially blossomed into existence: the veritable kings of K-pop, Seo Taiji and Boys. While Korean music was far from flourishing before Seo Taiji and Boys, most of the country's culture was actually influenced by creations from American and Japanese folk music – given the country's roots in both countries. Following South Korea's lift on travel restrictions for its citizens in 1988, it soon became much simpler for artists to research and take in musical elements from other cultures and foreign countries. This would eventually result in more ways for artists to experiment in their music – thus paving the way for bands that had \"new\" sounds to them, i.e. Seo Taiji and Boys. The trio consisting of Seo Taiji, Yang Hyun-suk, and Lee Juno came out of the gate swinging with a fusion of American rap and Korean lyrics. The Boys didn't fare very well during their first televised appearance on a talent show in 1992, receiving the lowest rating from the jury, but it didn't matter. Fans had heard enough to propel the outfit to stardom simply based on the song they performed during the show. \"I Know\" hit the charts and remained there, skyrocketing to number one on the South Korea singles charts and dominating the position for over 17 weeks. There's no \"official\" date on record for the turning point of K-pop, but many credit its origins to Seo Taiji and Boys' tumultuous television debut and the wave of success that followed. Seo Taiji and Boys melded Western-style pop music with lyrics in Korean that went above and beyond the cultural norms acceptable in popular culture at the time. Much of South Korea's early pop music had distinct American and Japanese influences, and a glut of artists was performing \"trot\" music, or tunes derived from American and British folk songs with Korean-language lyrics that, for the most part, featured lyrics that spoke out against the country's colonial authorities. Combined with ballads and slower, country-type music, this was basically the status quo of the time. Seo Taiji and Boys' implementation of hip hop and new jack swing marked a turning point in the genre for their willingness to break tradition. By Lexi McMenamin By Sara Delgado By Anjana Pawa Their sound had a jagged, “urban” edge to it – musically, something similar to what you might hear from New Kids on the Block at the time in terms of a “hip hop” swagger – and as such, their popularity in South Korea opened up several doors for them as well as a number of groups that immediately sprang up looking to capitalize on or replicate their success. Copycats began streaming in, all borne of the entertainment industry's desire to churn out the Next Big Thing – and what would ultimately be refined into the \"idol culture\" we know today. Idol culture is centered around artists with massive, dedicated fanbases, idols are usually trained by entertainment agencies in dance, vocals, and just about every other aspect of performance art. Their entire image is crafted around pleasing fans and creating relationships with their supporters. There are a litany of strict rules many entertainers must follow as a result of the training they receive, and artists are often subject to lengthy contracts with their management groups. It can be extremely difficult to be chosen as an idol, and as such, only the best of the best end up succeeding and finally making their debut. Often, idol training begins during performers' teen years, when potential artists often attend performing arts high schools and hone their craft as early as possible. While this is hardly localized to K-pop artists, it was a way to ensure hopefuls had as much training as possible before entering the entertainment agencies that would later help shape them into the stars they were hoping to be. The first wave of idol groups came soaring in after Seo Taiji and Boys made their mark on history. In the late '90s, three music studios jumped onto the scene: SM Entertainment (or SM Town), the Yang Hyun-suk-founded YG Entertainment , and JYP Entertainment created by J.Y. Park, establishing the tried-and-true idol-making process that remains such a successful formula today. Out of the trio, SM Entertainment was responsible for assembling a group called H.O.T. that debuted in 1996. Comprised of five diverse male singers (who could also dance, incidentally), the boy band offered a little something for everyone: good-looking members, colorful clothing, and funky beats anyone could get down to. From H.O.T., it was only a stone's throw to other, similar acts that debuted throughout the decade from various entertainment collectives. By Lexi McMenamin By Sara Delgado By Anjana Pawa The idol explosion continued through the ‘90s and into the 2000s, churning out groups form a similar formula: a group of attractive and charismatic members, catchy hip hop and pop tracks you could dance to, and an aggressive promotion strategy. Fin.K.L., Shinhwa, and a host of other talented groups hit the scene at the same time throughout the early 2000s. As entertainment moguls pushed further into the space, they continually took what they learned from pioneers of the genre like Seo Taiji and Boys and the bands that spawned from them and passed it on. The formula continued to be perfected until it had gotten down to almost a science. These details included what kind of choreography, outfits, and mannerisms were popular with fans, or what types of songs ended up resonating more with the fans who were becoming ravenous for their favorite artists. As the formula evolved, groups began to come \"assembled\" in various flavors. the hip-hop of B.A.P. or the bubblegum pop stylings of girl idol group Apink. But all-male K-pop groups were far from the singular focus from entertainment organizations. There were female artists to promote and market as well. That’s how the 2000s saw the up-and-coming Kwon Bo-Ah, otherwise known as South Korean mega-star BoA, making her debut. Discovered by SM Entertainment after accompanying her brother to a talent search in 1998, she received two years of training before making her official debut. Ever since, she's gone on to release nearly two dozen albums, making her mark on the industry and earning the title of the \"K-pop queen.\" Beyond BoA, however, girl groups were soon on the rise as well. Talented female singers were gathered together in units like the inimitable Girls' Generation, a glittering, glamorous vision of femininity, with a number of subgroups and ridiculously catchy breakout songs like \"Gee.\" The song became a viral sensation in 2009, achieving overseas success and helping spawn additional girl group concepts that would eventually give way to musicians like 2NE1 and Wonder Girls, and then the modern day K-pop groups including Red Velvet and Blackpink. Intriguingly, Wonder Girls even joined the Jonas Brothers as an opener (alongside Jordin Sparks and Honor Society) on the U.S. leg of the Jonas Brothers World Tour 2009. This showed there were plans in place to attempt to bring Korean artists into the bigger, worldwide stage. The Wonder Girls didn’t quite catch on with Western audiences the way artists like BTS eventually did later on, but it was still a monumental point in K-pop history at the time, and a major win for American fans when it came to improving visibility. By Lexi McMenamin By Sara Delgado By Anjana Pawa As K-pop artists continued to polish and hone their craft, certain artists' influence began echoing across the world, with Western fans mounting. The world of idols began to expand into the public consciousness, with confident tunes like \"I Am The Best\" from hip hop/pop outfit 2NE1 and the equally sassy f(x) piquing curiosity from fans eager to hear something different than what was currently dominating the radio. At the time, Western radio was flush with slick pop songs and ballads, with Adele's \"Rolling in the Deep\" topping Billboard's 2011 Year-End Hot 100 chart that year and tracks like LMFAO's \"Party Rock Anthem\" following it up at the number two slot. No one could argue that 2NE1's driving, unrestrained hip hop track with swagger and braggadocio would \"blend in.\" It was extremely catchy, and self-confident at a time when the industry needed such an anthem.  Marketed as \"rebels\" with their own edgy yet sexy style, these girl groups continued to pave the way for Blackpink's inevitable takeover in the last year. By Lexi McMenamin By Sara Delgado By Anjana Pawa One of K-pop's big moments for Western audiences ended up coming from an unlikely source: South Korean rapper Psy. The lead single from his sixth studio album \"Gangnam Style\" went viral immediately, becoming the first YouTube video to reach one billion views, surpassing even videos like \"Baby\" from Justin Bieber in terms of the most viewed video in the platform in 2012. A song about the supposed \"lifestyle\" of the Gangnam District of Seoul, Psy played up the imagery of a \"perfect girlfriend\" from the Beverly Hills-like area and and paired up insanely catchy rap lyrics with a music video that didn't have an ounce of seriousness in it –  but people loved it. Hilariously enough, \"Gangnam Style\" was so far removed from the refined \"idol\" image other groups had worked hard to portray, and that's likely why it worked so well, just bizarre enough to capture a whole new geographical area's attention. Psy's earworm of a dance track launched Western fans into a frenzy looking for more from the artist himself and other Korean artists, and arguably But the evolution of K-pop, many will agree, has culminated in the success of one of the biggest sensations from South Korea of all time: BTS. The chart-topping septet has broken records and stereotypes in both their home country and abroad, making huge strides for the K-pop industry as a whole. For instance, in May 2018, BTS's Love Yourself: Tear album debuted at number one on the US Billboard 200 chart in May 2018, which speaks volumes about their influence, and by June 2018, the group was named one of Time’s \"25 Most Influential People on the Internet.\" Later that year, in September,  the band's album Love Yourself: Answer hit number one on the same chart again, proving that apparently lighting can certainly strike twice. BTS has made it their business to adopt a model similar to the band that started it all, Seo Taiji and Boys, choosing to sing about more serious matters: relationships, societal pressures, and other narrative threads inspired by everything from Jungian philosophy to having a dream and pursuing it. By Lexi McMenamin By Sara Delgado By Anjana Pawa While BTS is a product and natural result of a refined formula, the group also challenges K-pop history with their willingness to talk about things like mental health and politics. They’ve achieved a level of international fame that constantly produces trending Twitter hashtags and a truly massive ARMY of fans. That fandom has attracted numerous western collaborators, from Halsey to Zara Larsson to Charli XCX, further propelling BTS’s pop domination beyond Korea. But while K-pop has been positively booming in popularity, with BTS receiving a slew of impressive accolades, it's still yet to receive the same level of critical acclaim or respect that Western pop artists receive. For instance, it's often vaulted away in side categories when it comes to award shows – despite only being pop music created in Korea instead of being a completely different genre. It seems that even though Korea has produced one of the greatest boy bands of all time with BTS, there's still quite a ways to go before the music is seen as \"equal\" in Western culture as, say, a new Ariana Grande album or a Beyoncé single. By Lexi McMenamin By Sara Delgado By Anjana Pawa Whether you're along for the ride because you stan Loona or you live for your BTS bias, K-pop groups have something for everyone (that’s basically the point). The genre is ultimately a collection of influences ranging from rap and hip-hop to ‘80s international pop to traditional Korean sounds and instruments. Combined with hard-working idols and a huge, diverse community fan experience, K-pop is proving an irresistible force in 2019 — after all, there’s a future ARMY or Monbebe inside all of us. Related: Criticism of BTS Is Often Just Xenophobia in Disguise Check this out: By Sara Delgado By Tabitha Yuen By Meredith Oldham By P. Claire Dodson More from Teen Vogue Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Teen Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "datetime": "2019-10-21T13:45:26.334Z",
    "url": "https://www.teenvogue.com/story/brief-history-of-k-pop"
}