{
    "title": "A global phenomenon",
    "text": "The rising popularity of South Korea’s cultural influence, otherwise known as the ‘Hallyu wave’ has been sweeping across the globe over the last two decades or so. This can be seen in the number of people who are in love with Korean music (the ever-present K-pop), Korean dramas and movies, food, fashion and beauty. The wave primarily started with a few very well-made television series (remember 2002’s Winter Sonata?) and eventually introduced people to other aspects of Korean entertainment, such as music and animation. The international interest in Korean culture eventually spilled over into areas like tourism, cuisine and education, and included people wanting to learn the Korean language itself. K-pop has since become a global phenomenon due to its amazing choreography, catchy music and, of course, its very good-looking South Korean performers. Although the Hallyu wave has been there for a while, it has grown increasingly visible over the past 10 years. The first time the K-wave struck the US market was in the mid-2000s through one of Korea’s biggest idols at the time, Rain. He became known both as a K-pop star and as an actor. From then on, the wave kept on rolling: the very talented Wonder Girls made it to Billboard Top 100 with their song Nobody, and Big Bang’s Fantastic Baby also made inroads in American culture. And in Asia, both groups reigned supreme. Then came the worldwide phenomenon that was Psy’s Gangnam Style. The music video for the unforgettable track became the first to reach one billion views on YouTube in 2012. Since then, there has been a steady stream of K-pop idols to make teenagers all over the world swoon. The most popular band in the world right now is BTS, a group which is still smashing the music charts. K-pop stars have become the international face of South Korea, while also spearheading a multi billion-dollar industry. South Korean acts have been known to be ablet to sell out giant stadiums within minutes. Korean television series and movies have also exploded across the globe in recent years. They are all described as having excellent production quality along the years with different types of genres and storylines. This focus on quality helped sustain the popularity of the productions, which is also one of the reasons driving the Korean wave. People around the world have been able to learn about South Korea’s culture thanks to Korean historical and cultural dramas. Last year, South Korean film Parasite made history as it took home four awards at the Academy Awards, proving that global audiences were able to relate to its themes of class divide and inequality. On the small screen, the survival-thriller Squid Game become Netflix’s most popular series, achieving the title of the streamer’s biggest launch ever. Hallyu has also given tourism to South Korea a huge boost. People from different countries have been making their way to South Korea to experience Korean culture and to visit all the locations, towns and resorts that they saw featured in their favourite K-dramas or movies. Even Korean cuisine has gotten a boost. Signature Korean dishes have emerged as a new Asian element in the global food scene. The list includes kimchi – fermented pickled vegetables – ramyeon, bulgogi, bibimbap or fermented chili pepper. By adding a Korean twist into existing food like burgers and chicken, the country is solidifying its place on the global food scene. Eating shows, also known as Mukbang, have also emerged as a global trend. They consist of video streams where a host consumes variety of food and interacts with their audience. It first became popular in South Korea back in 2010. Today, mukbangers can be found all over the world, with millions tuning in to watch them consume often huge amounts of food. The growth of Korean fashion can also be attributed to interest in the Korean culture wave, thanks to fans wanting to imitate the chic looks of their favourite Korean celebrities. Not to forget, Korean skincare products are also flooding the market because everyone wants to have the signature ‘Korean glow’, and they are in high demand especially if popular idols and celebrity are part of the advertisement campaigns. With so much international attention, the Hallyu wave has been a fascinating one to follow, and it’s still unfolding even to this day. Everyone are still very excited to see how the trends will continue to develop, and whether Hallyu can sustain its appeal to global audiences. The only question now is, will any other country ever be able to come up with another wave like this?  Tel: +603-7784 6688      Fax: +603-7785 2624 / +603-7785 2625 ",
    "datetime": null,
    "url": "https://www.thesundaily.my/style-life/a-global-phenomenon-CB8704598"
}