{
    "title": "A new kind of Korean wave – Lotte Duty Free launches cross-border platform : The Moodie Davitt Report -The Moodie Davitt Report          ",
    "text": " SOUTH KOREA. Lotte Duty Free has launched what it says is the first online platform to sell Korean domestic products to consumers in overseas countries. The move follows the decision earlier this year (effective 23 March) by Korea Customs Service to allow overseas residents to make online purchases of Korean products from downtown duty free stores without visiting the Republic. The initiative was designed to mitigate the severe impact of the pandemic on Korean travel retailers. Lotte Duty Free subsequently established a task force and started developing the platform launched today.Other travel retailers, including The Shilla Duty Free (see below) and Shinsegae Duty Free (see below) are following suit. The new Lotte Duty Free platform provides services to nine countries including Singapore, Malaysia and Thailand, as well as US, Japan, and China, which have the largest online consumption markets, the retailer said. Foreigners residing in those countries can receive the product without any shipping costs being added if they spend US$70 or more. “We fully utilised our product sourcing capabilities and knowhow of operating online shops to launch the platform,” a Lotte Duty Free spokesman told The Moodie Davitt Report. “We will continue working on discovering more popular domestic items for the new sales channel.” That impact of the global health crisis on Korean travel retail has been exacerbated by a deteriorating Won/US Dollar exchange rate.“Despite the transition to an endemic phase of the COVID-19 pandemic, Won-Dollar exchange rates are going through the roof. Facing the challenge of losing our domestic consumer base, we are looking into ways to appeal to a larger pool of international customers,” a Lotte Duty Free official told The Korea Herald (see full story below). The report added that The Shilla Duty Free has forged a partnership with Alibaba’s logistics unit Cainiao, with which it will offer an end-to-end logistics service including domestic and international shipping, inventory and customs management. The report said that Shilla Duty Free and Cainiao will introduce an online duty free shopping service for Chinese consumers, featuring over 300 items ranging from cosmetics to health food products. The Moodie Davitt Report has reached out to Shilla for more details. How The Korea Herald reported the news. Click on the image to read the local coverage. The result – dubbed Lotte Duty Free Station Direct – offers an English version of a separate section within the Lotte Internet Duty Free Shop website and mobile application. Other languages such as Japanese and Chinese (simplified and traditional) will be added to enhance convenience. Lotte Duty Free has introduced not only popular categories such as cosmetics, fashion, accessories, and food, but also albums and related goods from world-renowned K-pop artists. The retailer will also introduce high-quality small and medium-sized brands to help them develop overseas markets. Lotte Duty Free is offering an initial range of 220 brands and 3,000 products, including Sulwhasoo, Laneige and Kahi cosmetics and Jeonggwanjan ginseng. The products are not sold by individual operators, but are sourced directly from Lotte Duty Free through the brand and are guaranteed 100% genuine. Under the K-Culture and Beauty categories, the new platform presents a diverse range of products from big name and emergent producers   A Lotte Duty Free official said, “We have opened the station direct purchase platform by actively utilising Lotte Duty Free’s product sourcing capabilities and online channel operating capabilities. We will do our best to open up new markets.”  Follow The Moodie Davitt Report on Linkedin:  Share this article: The group, which joins fellow top names Super Junior, Lee Jun-ho, Twice, Stray Kids, and Espa as Lotte Duty Free models, is hugely popular in South Korea, Japan and Greater China. Read More Precisely 25 years ago yesterday, Hong Kong International Airport moved from Kai Tak to Chek Lap Kok. Today’s photo selection for our popular column with Strange Nature gin captures the joyous celebrations of the landmark. Read More Tumi is premiering its Fall collection in trademark style with a dazzling pop-up in Seoul. In fact, you could say the brand has it down to a ‘T’ in the latest choice for our popular column with Strange Nature gin. Read More Big brands such as Chanel, Estée Lauder and popular Korean ginseng CheongKwanJang have been placed at the front of the revamped store to drive penetration. Read More ",
    "datetime": "2022-06-29T15:59:07+00:00",
    "url": "https://www.moodiedavittreport.com/a-new-kind-of-korean-wave-lotte-duty-free-launches-cross-border-platform/"
}