{
    "title": "A Record-Breaking Week Has Us Wondering: How Far Can K-Pop Go? : The Record : NPR",
    "text": "By Colin Marshall BTS at the Samsung Card Hall on August 19, 2014 in Seoul.\n                \n                    \n                    Han Myung-Gu/WireImage\n                    \n                \nhide caption BTS at the Samsung Card Hall on August 19, 2014 in Seoul. Making it to the top of the Korean pop music charts demands no small amount of blood, tears, and sweat — and even more to break beyond it. Few current groups know it as well as the boys of BTS, the young septet who this week became the highest-ranked K-pop act ever on the Billboard 200 chart, as well as only one to rise into its top ten and to appear on both the Billboard 200 and the Billboard Hot 100 at the same time. Their success marks one more step in a long campaign in the Korean pop music industry, and the Korean entertainment industry as a whole, to cultivate a robust fan base as far beyond the borders of South Korea as possible. But how far, K-pop observers have long wondered, can this unabashedly glossy, visually oriented, and aggressively young music really go? Though 21st-century Korea's intensively trained (and even more intensively groomed) squadrons of boy bands and girl groups may seem indistinguishable, BTS has had a way of standing out since they made their debut in the summer of 2013. Like every major pop act, they came vetted by the country's talent oligarchy, specifically as a product of Big Hit Entertainment, an artist management company founded by Bang Si-hyuk, former songwriting partner of top star-making record executive Park Jin-young (known to anyone with an eye on Korean pop culture simply as \"JYP\"). Before they turned up to Big Hit's auditions, two of their members were art-school students and two were underground rappers; some point to the group's own active participation in the writing and production of their songs, heretofore an unusual practice in the highly specialized world of K-pop, as one reason for their rapid and outsized success. Certainly no other boy band of any nationality has put out a hit single inspired by the work of Nobel Prize-winning German novelist Hermann Hesse, as BTS' members described last year's \"Blood Sweat & Tears.\" Its elaborate music video even features a passage from Hesse's Demian, a novel near-universally known in South Korea and beloved by several generations of its people. The words come recited by member Kim Nam-joon, better known as \"Rap Monster,\" who has emerged as the group's breakout star as well as something of a self-styled intellectual, having placed high on IQ tests and South Korea's university entrance exams — a high mark of distinction in a ranking-obsessed society — becoming fluent in English, and continuing, on his own initiative, the Japanese-language studies all the BTS members received as trainees. The Japanese training required of BTS — who have put out two albums in the language of Korea's onetime colonizer — reflects K-pop producers' insistence that their groups start developing an international appeal from the first. Japan makes for a particularly enticing marketing target, not just because of its status as the third-largest music market in the world and one where physical CDs still sell for the equivalent of $20 to $30 USD (unlike Korea, where song downloads go for pennies), but because its resentful K-pop haters are greatly outnumbered by its K-pop addicts. In recent years, K-pop bands have employed not just the languages of other Asian countries, but their performers, too. In the case of Exo, who debuted the year before BTS, six of its original twelve members came from China, which surely did nothing to reduce the fan base that has made them the biggest boy band in the world. But ever since Japanese pop music, or \"J-pop,\" failed to parlay the moment it enjoyed in the '90s into lasting worldwide popularity, received wisdom in the K-pop industry has held that an act can't go truly global without English. Driven by an export-oriented economy since its industrialization, South Korea has long regarded English as the sine qua non of large-scale success in any sector. Consequentially, the country spends more money than any other on English education, albeit not always with impressive results. The much-touted \"Korean wave\" of soft power, comprising everything from pop music to television dramas to snack foods, has so far washed most thoroughly over poorer Asian countries like Vietnam and the Philippines. Whether the rest of the world will warm to Korean popular culture remains an unanswered question, but one with a potentially profitable answer. K-pop has gone through a number of strategies to appeal to the English-speaking West, one of the most recent trends being to load groups with a native English speaker or two, usually an ethnic Korean born or raised in America. BTS (an initialism that originally stood for the Korean expression expression bangtan sonyeondan, or \"bulletproof boy scouts,\" but which a rebranding earlier this year converted into the English \"Beyond The Scene\") bucks that trend not only with its lack of native English-speaking members, but with its lack of fully English-language songs: \"DNA,\" the one that got them onto the Billboard 100, was written almost entirely in Korean, as was most of the material in Wings, the album that Billboard named the best K-pop album of 2016. \"When the group launched, they seemed to resonate more outside Korea than in Korea,\" says Mark Russell, author of Pop Goes Korea and K-Pop Now. \"It was a little odd. They didn't really have any big hit songs, but there was something about them that was getting the fans excited — style, good PR, that mysterious star quality?\" Soon enough, a sure sign that the group had accrued a fervent following at home emerged: \"I started noticing 'BTS' graffiti turning up on the playgrounds around Seoul,\" Russell says. Not to say the group has their backs turned to the West: in addition to the hip-hop and electronica influences unusually forefronted in the its sound, the group has also collaborated with American artists like The Chainsmokers' Andrew Taggart (as Rap Monster has, individually, with Warren G), and DJ Steve Aoki announced plans to work with BTS in late September. More than ever, success in Korean popular culture now requires simultaneously appealing to the wider world and mobilizing their listeners at home. Luckily, Korean listeners are more than willing to be mobilized, as evidenced by all manner of signs, from playground graffiti to the enormous fan club-funded birthday messages for K-pop group members seen every day in the advertising spaces of Seoul's subway stations. Russell notes that \"Korean music fans are so enthusiastic, they've long been able to chart new releases for a day or two\" on their own power, amplified by their country's highly developed social media technology. \"So the real test will be longevity.\" In a time of increasingly borderless music production as well as music fandom, though, one might question the relevance of Billboard chart placement as an indicator of a K-pop group's prospects. \"Lots of acts have success on Billboard but cannot fill a concert hall, let alone a stadium,\" says Russell, \"but Korean acts fill stadiums already.\" Nobody can quite say which stadiums they'll fill next, and what kind of fans will be there, just as nobody — least of all Koreans — predicted the astonishing global success of Psy's \"Gangnam Style,\" a nearly 100-percent-Korean quasi-novelty song poking fun at Seoul's nouveau riche. \"I've seen people consistently guess wrong about K-pop for nearly 20 years. I don't see any reason why that should stop now,\" says Russell. \"It's a hyper-competitive industry, but that but that also helps give it a lot of vitality. I wouldn't like to bet against it.\" Sponsor Message Become an NPR sponsor ",
    "datetime": null,
    "url": "https://www.npr.org/sections/therecord/2017/09/29/554496829/a-record-breaking-week-begs-the-question-how-far-can-k-pop-go"
}