{
    "title": "A Social Experiment: A K-pop Boy Band with No Koreans",
    "text": "Hyperallergic Sensitive to Art & its Discontents EXP performing “Luv/Wrong” at the Columbia University MFA Thesis Show at Fisher Landau Center for Art (photo by James Gentile, all images courtesy IMMABB) I’m Making A Boy Band (IMMABB), initiated by Korean Columbia MFA graduate Bora Kim, is an ongoing project that uses Korean pop (K-pop) to pose questions about nationhood, cultural appropriation, and gender roles. Since 2014, Kim and collaborators Karin Kuroda and Samantha Shao have worked to create EXP (short for “experiment”), the first New York-based K-pop boy band. Following the release of their single “Luv/Wrong,” the trio raised $30,000 to create an album and continue work on a documentary tracking the development of IMMABB. With their flirty, boyish charms, immaculately coiffed ‘dos, and pupillary sparkle — to say nothing of their tight, uniform dance moves and bilingual crooning — EXP’s six members (Hunter Kohl, Frankie Daponte Jr., David Wallace, Koki Tomlinson, Šime Košta, and Tarion Taylor Anderson) have all but one of the trappings of K-pop legends: Korean nationality. As EXP’s presence grows on social media and YouTube, this fact has come to the fore in online debate, and made them the target of considerable vitriol. As one ardent K-pop fan fumed on YouTube, “How the hell can you be a K-pop group when you don’t have the ‘K’ in it … Korean?” These are, of course, precisely the questions Kim, Kuroda, and Shao hope their project, borne of an era of unprecedented pop crossover and globalization, will provoke. And judging by online comments, for every EXP detractor there is one converted fan. None, however, could be as passionate as the EXP creators themselves, who, despite viewing K-pop in a critical light, remain self-professed “fangirls.” I visited the Columbia University MFA studios to discuss with EXP creators the origins of IMMABB, Korean and Asian identity, fandom, and the nuances of K-pop gender performance. *   *   * Bora Kim, Karin Kuroda, and Samantha Shao at work in the Columbia MFA studios Hannah Stamler: Where did the idea for “IMMABB” come from? Bora Kim: I’d been researching K-Wave, a very recent phenomenon [in which] Korean culture has become popular not only in Asia, but also all over the world. I have a background in sociology, and what I’m doing now is somewhere between sociology and art. All my work starts with interest in some social phenomenon, or has something to do with media. I’d been researching [K-pop] since last year, and was playing around with found footage on YouTube … I had all of this information on K-pop and boy bands, and thought, I should just make one. I started to look up what I’d need to do and realized it was impossible to do by myself. HS: How did you meet and start working with Karin and Sam? BK: Karin and I met in Chicago in undergrad. I moved there and got a BFA, and then came here for my MFA and met [Sam] in the [Columbia University] studios. I was at a small party complaining about how I couldn’t make this boy band alone… Samantha Shao: And she asked me, “What do you do?” I said “marketing,” and she said, “I need you!” I studied arts management in Holland, but before that, I studied in Taiwan and majored in history. I took a lot of courses in politics and economics, and that sort of makes sense with the project. Karin Kuroda: I originally came on board because I wanted to be the research consultant for the group. I studied fashion photography and postcolonial theory/visual studies. HS: And where did the boys — is it okay to call them “boys” — come from? BK: We use that word, it’s okay! We found out that there are millions of talent [scouting] websites. HS: So, the boys are professionals? BK: Yes, the boys have experience in musical theater, as well as modeling, dancing, and acting. SS: We had three auditions. At first, we screened mostly from appearance because in K-pop it’s very much about the visuals. But we discovered it’s really important to work with people who have talent and experience. We also came to realize that how we phrased [IMMABB] could help get us who we wanted. BK: We wanted to explain what this project was, and make sure they understood it. SS: That was really important to her. BK: How we phrased it was that this will be a documentary, something in between a reality show and fiction.  HS: Not to be crude, but I’m curious how labor works here. Are the boys participating for money or exposure? SS: Both. We’re paying them, but not a lot, like a stipend. They also want to become known or famous, so they see potential in this project. BK: We have a contract with them, it’s very short-term, but we pay them and [in turn] they have to participate in rehearsals or shows. HS: Talking about contracts brings me to another crucial layer of IMMABB: the fact that you’re women managing an all-male band. How atypical is that in K-pop? BK: Very, very atypical. KK: I realized recently that it would have been illegal for us to make an actual [K-pop] boy band. [The performers] start from like 14 or 15 and get pulled into a seven-year training program. BK: One of the reasons I started this project is that I think K-pop reflects Korean society so well. The product, that is, the performances of these young kids, are so precise. The performers work like 17 hours a day. They are “trainees” of entertainment companies and their managers’ role is like [that of a] parent. In Korea and a lot of Asian countries where Confucianism is influential, hierarchy is very strong. You have to be obedient to your father figure, [and] leaders are almost always male… I’m critical of the K-pop world, but at the same time, the reason it’s so successful is because of [its] rigid structure. I feel very conflicted when I look at this phenomenon. I’m sure a lot of other Koreans feel this way too. HS: But beyond an analytical interest in K-pop, you’re also all K-pop fans. I think this is a really appealing aspect of the project, and that it would have an entirely different character if it came from people who didn’t genuinely appreciate the music and aesthetic. Could you talk about what role K-pop has played in your lives? KK: To give a really short summary, in my art school there was a weird discrimination against Asians because there were so many of us. I was [dealing with] that, and found K-pop. Even though they’re not Japanese, it was still [powerful] because growing up there were basically no Asians in American media. Bora and I became friends while I was really in my K-pop hole. I think Bora was a fan in high school but lost interest as she got older because it was normal, not edgy. But for me it was like, ‘Asians are cool!’ BK: I was a really hardcore [K-pop] fan in high school, but I graduated and for almost seven years was completely detached from this world. I became interested in the scene again because of all of this attention on Korean pop culture. SS: I think it’s an interesting contrast. [Bora] grew up in Korea, so for her it’s the norm. But Karin grew up here, so it’s more about how Asians perform. She can see it from a distance. KK: I would say there’s a specific point, in 2005–6, when Korean culture got popular outside of Korea, but it gained much more momentum with Psy and Gagnam Style. SS: When [Bora and I] first met, this is what we would talk about. I grew up in Taiwan. I knew some K-pop bands, but wasn’t that into it. But living in Taiwan now you can’t escape it. ‘EXP,’ the first New York-based K-pop boy band (photo by Wei Hsinyen) HS: Is Korean culture the dominant one in Asia right now? SS: Yes, definitely. Even for government. [The Taiwanese government] has started to adapt Korean cultural policy because they’ve seen how successful it’s been. BK: Korea is technically a postcolonial country, and this cultural reversal was such a big shock for Korean people. Now nationalistic sentiment is attached to K-pop boy bands and girl groups. They’re not only pop stars, but also national heroes. KK: This is a conflation of terms, too. In Asia, you use the word “idol” to describe famous celebrities. I’m Japanese, the country that colonized Korea. Korean dramas really affected and changed middle-aged women in Japan. Their prejudice towards Korea [is] totally erased. SS: It’s very effective. In the ‘80s Taiwan and Korea had the same economic status. When Korea started becoming very successful, people were saying, “Oh, I don’t like Korea.” And now because of K-Drama, people don’t care about that anymore. KK: We call it “pop-aganda.” HS: Can you talk about the online reactions you’ve gotten from K-pop fans? KK: We get lots of comments saying, “your boys haven’t worked,” or “your boys haven’t endured the training process.” HS: I’m surprised that the perceived lack of “Koreanness” in EXP has centered on work structure rather than nationality. BK: Well, that comment mainly comes from hardcore fans. We have a lot of comments on nationality or appropriation — obvious issues that we are intentionally trying to raise. KK: We [also] get comments from fans saying, “your boys are gay.” In more Western-centric countries, K-pop is seen as flamboyant. The understanding is that if you’re a K-pop fan, you’re used to this soft look. But suddenly, when non-Asians do it, it’s seen as very strange. BK: The masculinity of Asian males is an important part of this project and something we wanted to highlight. [Male] idol groups are very feminine or pretty. These characteristics are now considered attractive, desirable. It’s become almost a new male type. HS: So has K-pop expanded categories of masculinity in Korea? BK: Yes, but not only in Korea. KK: A really important thing to talk about, though, is that homosexuality is not acknowledged. If two K-pop idols are seen doing something homoerotic, it’s viewed as playful or boyish. It’s a very interesting category and performance of gender and sexuality. ‘EXP’ (photo by Sandy Ramirez, directed by Malan Breton, makeup by Bella On Demand) HS: Is overt sexuality, like we see in American pop, part of K-pop? SS: They do perform sexuality, but differently. It’s not about exposing their bodies. BK: If it’s an official TV channel, [idols] are very proper because they’re being seen as national heroes. But in concerts, it’s more private. Everyone is a fan, and they control recordings and distribution. In that kind of setting, they kiss. It’s an expected part of teenage girl culture called “fan service.” KK: There’s a word in Japanese that encompasses that desire for straight females to view [male homosexuality]. A lot of anime is based around that. SS: We call the stories “BL” for “boy love.” KK: We wanted to call our band Boy Love. [Laughs.] All these men performing for the female gaze — it’s such an unacknowledged, unexpected thing. BK: We want to eventually tackle this concept in our project. HS: It seems like despite the male hierarchy in entertainment companies, young women mostly inform pop cultural trends. BK: Yes. I see a potential in fan culture around boy bands. I think it’s feminist because, especially in Asian societies, it allows a space for young girls to express sexual desire openly. KK: To counter that, though, “fangirl” is still a derogatory term. The space is allowed, but then it’s dismissed. Any time a girl is a fan of something, it’s seen as vapid or silly. BK: I think we’re really trying own that fangirl idea. We are K-pop fangirls, but we’re also making our own band. HS: How have people unfamiliar with K-pop reacted to the project? SS: Non-K-pop people talking about this project are mostly in art. My friends know it’s art, and then after a while, when they realize we’re still doing this, they ask, “Are you guys for real?” It’s very interesting because they think if it’s art, it’s not real. This is a line we’re trying to cross. KK: Our project really tries to bridge art and pop, but in both camps there’s a dismissal of the other. BK: People also assume we’re making fun of K-pop or that it’s a parody. But to me, parody is an American concept. In Korea, we don’t really have [it]. It’s not our intention to make fun of something. We genuinely want to make this work, but at the same time we try not to lose criticality. EXP will perform at Bowery Electric (327 Bowery, Lower East Side, Manhattan) this Thursday, June 16. The group will release its first music video for “Luv/Wrong” this month. For more information on EXP, visit http://www.immakingaboyband.com/. Hannah Stamler is a New York–based arts writer. Her work has appeared in Frieze, Modern Painters, and BOMB online.\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tMore by Hannah Stamler The cultural community has seen events canceled and artworks returned after expressing solidarity with Palestine. Varo’s paintings beckon us to plunge into their vaporous worlds while challenging us to decode intricate scenarios. Presented by Boston Center for the Arts and Bodega, this weekend-long event in November features artist books, prints, workshops, and more by over 140 exhibitors. What the artworks in Amazonia offer is a means to communicate complex or abstract subjects with uncommon immediacy. The festival’s Currents program deserves praise for its selection of risk-taking films. An expansive solo exhibition by the multidisciplinary Tlingit and Unangax̂ artist centers Indigenous perspectives and aims to boldly disrupt colonial narratives. Copy Machine Manifestos: Artists Who Make Zines, opening next month at the Brooklyn Museum, will feature nearly a thousand works by almost 100 artists. The free, week-long event kicks off on November 12 at Lower Manhattan’s Jewish Heritage Museum. Designing Peace at San Francisco’s Museum of Craft and Design features projects from around the world that explore how design can play a role in pursuing peace. Preservationists have just weeks to salvage tiles from Isaiah Zagar’s legendary artwork in Old City. These are not your goth grandmother’s Halloween nails. Hyperallergic is a forum for serious, playful, and radical thinking about art in the world today. Founded in 2009, Hyperallergic is headquartered in Brooklyn, New York. ",
    "datetime": "2015-07-15T12:56:47+00:00",
    "url": "https://hyperallergic.com/222205/a-social-experiment-a-k-pop-boy-band-with-no-koreans/"
}