{
    "title": "A walk with the Park | Philstar.com",
    "text": "Meet cute: Park Shin Hye gets up close and personal with her Filipino fans during her visit to Manila. Watching K-Drama is a pastime that’s slowly made me slip down the black hole that we call the Hallyu wave. Recently, it seems that everyone, from my titas to Anne Curtis, has been going crazy over Korean culture. I’ve noticed that riding this wave brings with it more ways to connect with people. Finding out that others are a part of a fandom unlocks a bunch of new topics for discussion. Dinnertime conversation and Twitter threads nowadays are devoted to fangirling over Gong Yoo’s personality and wondering about Song Hye Kyo’s skincare routine. When we aren’t fawning over the latest episode of our fave K-Dramas, we discuss the phenomenon itself. What is it about the Korean entertainment industry that makes it so appealing to us? And more importantly, what might a Hallyu star have to say about this worldwide interest? It turns out that I didn’t have to wait very long for my questions to be answered. Bench hit two birds with one stone when they brought K-Drama queen Park Shin Hye (of The Heirs and Pinocchio) to the country last weekend for a string of events as part of her “Flower of Angel” Asia tour. Bench is a brand that feeds fandom, whether it’s by producing campaigns with our favorite loveteams (those EDSA-Guadalupe billboards still guarantee kilig) or flying in K-superstars (Lee Min Ho and Super Junior’s Siwon and Donghae were endorsers) to meet their fans.     After her press conference last Friday, Shin Hye (who looked exactly like I remembered her from The Heirs: still chok chok goals, except wearing a pin-striped polo dress with lace trimmings) gamely sat down — translator by her side — to answer some of my questions. When I asked what she thought of the rising global interest in Korean culture, she clarified that her opinions were her own, not primarily those of an actress. Through her translator, she said: “Because the world is changing faster than it used to be before, and people used to be a bit more passionate for Hollywood and a more Western culture. Nowadays, people are opening up to a culture where they can actually follow their peers a little bit.” Citing the ever-growing K-Pop industry as an example, she mentioned that singers inspire fans because of their relatable performances and the subjects of their songs. Shin Hye also touched on the evolution of the film and TV industry, saying that, “if the previous films focused more on a romantic and a cinematic kind of love, Korean dramas and TV shows focus more on relatable topics — relationships among families, romantic relationships, and (relationships) among friends.” She continued: “It’s something that is similar to everyone’s lives. At the same time, a bit unique and with a little bit of a twist.” When I asked how she thought the industry has changed in the years she’s been acting, Shin Hye compared its rise to building construction: “When buildings are built too fast, there is a (shortcut) in it,” she said. Though she thinks there are many positive aspects to this rising pop phenomenon, she’s worried it might be used up too quickly if it continues to grow at the same rate. She adds there may be some areas that could be amended or improved. After we exchanged our kamsahamnidas and said our annyeonghi gasibsios, I walked out of the room a bit more enlightened on the subject of Hallyu. Getting answers from Park Shin Hye only made me want to consume more — suddenly, I had the urge to binge-watch the rest of Pinocchio with a facemask on. At any rate, like millions of others, I’ll keep on riding the K-wave, wherever it takes me. Philstar.com is one of the most vibrant, opinionated, discerning communities of readers on cyberspace. With your meaningful insights, help shape the stories that can shape the country. Sign up now! ",
    "datetime": null,
    "url": "https://www.philstar.com/lifestyle/young-star/2017/08/03/1724524/walk-park"
}