{
    "title": "Acting with his idol Lee Young Ae made K-drama star Song Seung Heon flub his lines | The Straits Times",
    "text": "SINGAPORE - South Korean actor Song Seung Heon was the object of affection of 1,500 fervent fans at a public meet-and-greet event at The Cathay on Saturday. Many of them probably first got to know him through the hugely popular television romantic drama Autumn In My Heart (2000), in which he played a sensitive and devoted artist. But even swoonsome superstar Song has an idol whose mere presence will make his heart palpitate and cause him to stumble over his words. She is none other than Lee Young Ae, lead actress of Jewel In The Palace, the 2003 hit period drama that turned the Korean Wave into a tsunami. \"When you talk about Lee Young Ae, not only me, all the guys in Korea and all the guys in Asia are her fans,\" says Song, 40, at a press conference held here before the meet-and-greet to promote his new series Saimdang. And his co-star in the epic drama is none other than Lee. The show premieres here on cable channel Oh!K later this month. \"At our first filming, I was really nervous. I felt like it was my debut performance. I made a lot of mistakes and I had to keep repeating my lines,\" he says. But even Lee, 45, ended up having many NG (No Good) takes during their first shoot too, he adds. Perhaps because this is her first television role in 12 years. There has been much interest in the drama as the mother of five year-old twins has largely remained out of the spotlight since marrying Korean-American businessman Jeong Ho Yeong in 2009. She plays the titular Shin Saimdang, the 16th-century painter and poet whose face is plastered on the 50,000 won bill. She also plays a modern-day art history lecturer in the drama which alternates between the present and the past. Song's fictional character Lee Gyeom is a talented artist who reunites with his childhood sweetheart Shin two decades later only to find out she is married to a good-for-nothing husband. The bachelor Song admits to struggling with the moral dilemma of loving a married woman in the drama. He says: \"It was really hard to show this love story because I am not sure how it is ethical. She is married and I am single. If both characters were single, we would be free to portray the love story. We could hold hands and run away. The producer and I worked together to make it a beautiful, but morally ethical drama.\" While the nobleman's undying devotion is unrealistic by Song's own admission, he can still identify with the admirable trait. Even though there was no mention of his rumoured beau, Chinese actress Liu Yifei, 29, she might well be comforted by what he says. Song declares: \"If I really love a person, I think I would only have eyes for the person just like Lee Gyeom. I would love and care for that one person.\" •Saimdang premieres on Oh!K (StarHub TV Channel 816, Singtel TV Channel 525) on Jan 26 at 9pm. The series is also available as part of the Hallyu pack on the Cast app. Join ST's Telegram channel and get the latest breaking news delivered to you. Read 3 articles and stand to win rewards Spin the wheel now MCI (P) 066/10/2023. Published by SPH Media Limited, Co. Regn. No. 202120748H. Copyright © 2023 SPH Media Limited. All rights reserved. ",
    "datetime": "2017-01-08T10:59:35+08:00",
    "url": "https://www.straitstimes.com/lifestyle/entertainment/acting-with-his-idol-lee-young-ae-made-k-drama-star-song-seung-heon-flub-his"
}