{
    "title": "Action Report: Bay St.. Louis Harbor to cost an additional $375k",
    "text": "BAY ST. LOUIS, MS (WLOX) - Ask anybody who stands on Beach Boulevard and looks out toward the Mississippi Sound, and they'll tell you the Bay St. Louis Harbor is a thing of beauty. What they don't see is what the harbor master and boat owners see: Inside the harbor, wave action generated by southeasterly winds is banging boats against their slips. \"We've had a few complaints. We've only had three people leave because of the wave action,\" Harbor Master Chuck Fortin said. City leaders know all about those winds because of complaints during public meetings from boat owners, and reports from engineer Jason Chiniche. \"It's causing some discomfort to the boats, causing some of the boats to bounce around,\" Chiniche said. He said the price tag to fix the problem is $375,000. Here's why people are scratching their heads. In the original plans to build the $21 million harbor, a wave break was designed to alleviate the wave action inside the harbor. But it was eliminated from the final design. \"It was money,\" Bay St. Louis Director of Administration Buzz Olsen explained. \"When we put this project, we had a specific amount of money. We stayed within that amount of money. We did have to make some adjustments because we wanted to make sure we had enough to complete the project.\" Olsen said after hearing complaints from boat owners, the city decided to spent $20,000 on a study to see if a wave break was needed to curtail the waves entering into the marina. It was. The engineer hired by Bay St. Louis to review the breakwater complaints is in charge of the project. \"Basically, we're going to design and construct a 200-foot long wave break, or wave screen, that will be installed to the entrance to the basin that will be on the south side of the basin entrance to prevent stronger, southeasterly winds inside the harbor of the basin,\" Chiniche said. City Councilmen Lonnie Falgout and Mike Favre told WLOX they questioned why the city had to pay an additional $20,000 for a study on something that was already built into the original design plans for the marina. According to Olsen, a DMR boating infrastructure grant was used to pay for the study. But who will pay the additional $375,000 for construction of the wave break project? \"Fortunately for the city, we had some existing funds available through the Department of Marine Resources called Tidelands Funds, and we can use these for various harbor access projects,\" said Olsen. Chiniche said the breakwater project is set to begin in late May, just when boaters should be untying their vessels and sailing through the Mississippi Sound. Copyright 2015 WLOX. All Rights Reserved. ",
    "datetime": "2015-03-10T06:32:31Z",
    "url": "https://www.wlox.com/story/28329323/action-report-bay-st-louis-harbor-to-cost-an-additional-375k/"
}