{
    "title": "After Ellis murder, Bardstown Police add new K-9s",
    "text": "BARDSTOWN, KY (WAVE) – Bardstown Police welcomed two new K-9s to their department Tuesday, expanding the program after Officer Jason Ellis' murder. Ellis, a K-9 officer, was ambushed and murdered on an exit ramp off of the Bluegrass Parkway on May 25.City administrators decided to retire his dog, Figo, to Ellis' wife and two children. Ace, a 16-month-old from Mexico, and Zeus, an 18-month-old from the Netherlands, showed off their skills for a small crowd outside the police station Tuesday. \"It is bittersweet in that we are able to do what Jason was looking forward to in adding a second dog,\" Chief Rick McCubbin said. \"Sadly, we retired Figo and have a second dog in his place.\" The dogs are trained in narcotics detection, tracking, and apprehension and will be patrolling the streets with their handlers. It costs $10,000 to buy and train each dog. The department had the money for one of the K-9s in its budget because police administrators had already planned to add a second dog. The other K-9 purchase came through assets seized from drug dealers and other criminals, McCubbin said. He said Figo is living \"a good life\" with the Ellis family and has become \"kind of a hit,\" with people requesting the dog be present at their community events. Kentucky State Police are in charge of Ellis' murder. \"They're never forgetting what's happened with Officer Ellis and we're not either up here at Kentucky State Police Post 4,\" said Trooper Jeff Gregory. \"We have one detective that's assigned full time to that case.\" The tips that once poured in, now are down to maybe a call a week. \"We know that KSP is doing everything,\" said McCubbin. \"We do talk with them. We send them tips, we know everything is being done, probably more so in this officer murder than any other officer murder in recent history.\" \"I have faith that we will (see it resolved). But it's going to take time -- it's going to take longer than any of us want it to.\" Copyright 2013 WAVE 3 News. All rights reserved. ",
    "datetime": "2013-10-16T01:42:06Z",
    "url": "https://www.wave3.com/story/23699607/four-legged-members-join-bardstown-police-department/"
}