{
    "title": "After Hallyu, it’s K-Food wave set to sweep India - Asian Community News",
    "text": "Asian Community News - Community News NEW DELHI: The award ceremony for Pan India Online Korean Culinary Challenge 2020 was organized on 22nd Nov ‘International Kimchi Day’, which was jointly organized by Korean Culture Center India (KCCI) and Banarsidas Chandiwala Institute of Hotel Management & Catering Technology (BCIHMCT). 32 students from 14 institutes participated from across India by posting their Cuisine preparation videos on both organizer’s social networking sites. The viewership of participants` cooking videos reached 5 lakh (539,865). Arushi Gatg, the 3rd year student of Institute of Hotel Management, Chennai was the winner of this contest. She made good Korean cuisine combination consisting of Kimchi Jjiggae (stew), Doenjang Jjigae(soybean paste stew), Pajeon(green onion pancake), Gamja-jorim (Soy Sauce Braised Potatoes), Sigeumchi Namul(Seasoned Spinach), Dak Gangjeong(weet and Sour Chicken).  Besides making the video for food preparation, she also had described what Kimchi is and gave details on varieties of Kimchi. Lee Yeon-soon, National food master of the Republic of Korea who was the professional jury for this event was impressed by the high level of understanding and skill of students in terms of Korean cuisine, and glad to see Korean food`s awareness built in India. She has visited India 2 times for diplomatic events by Korean Cultural Centre India, she suggests Tandoori chicken can be fascinating Indian cuisine to Korean people. According to Lee Yeon-soon the Korean food has been well preserved through its prototype and tradition through its long history, it represents wellbeing food in recent time as well as balanced healthy food between taste and nutrition. Five basic vegetable ingredients with the red, yellow, black, white, green color called “Oh Bang” color represents the harmony of all creation and the universe`s energy. It has philosophical storytelling. Korean traditional foods are quite well known as high-quality food which can strengthen the human`s constitution and improve the immune system. There is a Korean proverb, ‘Yak Shik Dong-Won’ which means food is medicine. Some traditional foods whose ingredients are herb medicines really helpful to us especially in this pandemic situation.’ Prof. Raj Kishor Bhandari, Head (BCIHMCT) talked about the qualities of Korean cuisines and he gave special mentions about kimchi. He was happy to hold this event as an India-Korea food exchange program on Kimchi day, 22nd November which was designated by the Korean government to promote Kimchi and its relating culture and industries. For utilizing the advantage of an online event, the contest invited netizen`s participation in the evaluation process through checking the viewership number of participants` videos. The best 10 videos selected by netizens` evaluation were judged by the professional jury panel including the Korean National Food master, Chef Lee Yeonsoon. Choi Jong-ho, the minister of the Embassy of the Republic of Korea, appreciated the institute for holding the event on Kimchi day, which was its first anniversary after the designation last year, and suggested to continue cultural exchange between the two countries through food. Dr. Mahesh Verma, Vice-Chancellor of Guru Gobind Singh Indraprastha University, Prof. Raj Kishor Bhandari, Head of Banarsidas Chandiwala Institute of Hotel Management & Catering Technology, Mr. Hwang Il-yong, director of Korean Cultural Centre India and other juries and faculty members of the institute in a limited manner attended the ceremony according to Covid 19 protocol and Korean food reception was being followed after the first session of the ceremony.    Prev Post School textbooks of 60 countries scanned to know what foreign students are studying about India Next Post Animated video on Princess Suriratna (Queen Huh), Photo on Korean-Indian Thali win Korea-India Friendship (Dosti) Contest 2020 What Maxes Six Senses Ninh Van Bay The Most Sustainable Resort In Vietnam? Delectable Chinese at XO – JW Marriott Chandigarh Successful restart for Germany Incoming: GTM 2022 in Oberammergau reports turn around… La Perle….One of Dubai’s most fascinating shows Leave A Reply Cancel Reply Your email address will not be published.     Recent Posts Japanese all-girls pop group Momoiro Clover… India to host skill evaluation test, job… Gujarati Garba meets Japanese & Korean… ASCI implements guidelines for “Dark… Japanese giants Panasonic, NEDO, JICA join… Japan Science & Technology agency… Assam-Japan Gateway 2023 event in Guwahati… Data Protection for India’s FinTech… KCCI New Delhi student Srija Paul wins… Golf Wellness Club comes up at DIA Park… Galaxy of top journalists to gather at Web… Flow of business travellers to Korea… Trending News Japanese all-girls pop group Momoiro Clover Z marks 15th… India to host skill evaluation test, job fair for job… Gujarati Garba meets Japanese & Korean Elegance at… Popular Articles Galaxy of top journalists to gather at Web Media Summit on… Ritu Agarwal, Country Head – Japan, Russia and Southeast… The Great Reset: Ongoing crisis molds our thinking about the… Welcome, Login to your account. Recover your password. A password will be e-mailed to you. ",
    "datetime": "2020-11-23T11:02:43+00:00",
    "url": "https://www.asiancommunitynews.com/after-hallyu-its-k-food-wave-set-to-sweep-india/"
}