{
    "title": "After K-Pop, K-Lit? Why Young Korean Writers Are Creating a Stir in Japanese Publishing | Nippon.com",
    "text": " The Japanese publishing industry, like many others around the world, has struggled in recent decades with shrinking sales as competition by online competitors increase. One recent work that has bucked this trend is the Korean novel Kim Jiyoung, Born 1982, by Cho Nam-Joo, which has sold more than 230,000 copies in Japan so far. A “feminist novel” depicting the deeply entrenched chauvinism and misogyny in Korean society, Kim Jiyoung came out in Japanese translation in December 2018. The book’s release in Japan catapulted its author to overnight success. Bookseller Kim Seungbok compares the impact of the novel to that of Bae Yong-Joon, the heartthrob actor and star of the television drama Winter Sonata who helped launch the “Korean wave” nearly 20 years ago, ushering in a new era of widespread popularity for the country’s cultural output. Kim Jiyoung, Born 1982 was made into a movie that was released in Japan in October 2020. The success of Kim Jiyoung has been followed by several more bestsellers translated from Korea, notably I Decided to Live As Me, by Kim Soo Hyun, which has sold more than 550,000 copies since its 2019 release. This is just one of a remarkable series of successes for Korean books in Japan in recent years. Coincidentally, both these books received a promotional boost when members of the Korean boy band BTS recommended them to fans. But Kim Seungbok says there is more to the recent popularity of Korean books than a single celebrity endorsement. She instead insists that the conditions necessary for Korean literature to make a breakthrough have been slowly coming into place for some time. Although too modest to admit it, Kim was one of the people who laid down these foundations, having worked steadily to promote the literature of her home country since coming to Japan as a student 30 years ago. Kim Seungbok The stylish cover design by Yorifuji Bunpei and Suzuki Chikako for the Japanese translation of Han Kang’s novel The Vegetarian. The book’s simple, modern design helped make it popular with readers from a wide range of age groups. “When I first came to Japan, I was shocked that it was almost impossible to find translations of Korean literature outside university libraries,” Kim explains. “This was quite different from the situation in Korea, where bookstores were full of Japanese novels.” Kim took to translating stories by some of her favorite writers herself and circulated her translations among friends for discussions in an informal book club. In 2007, she formed Cuon, a publishing company that specializes in translations of Korean writing. In 2011, the company launched the “New Korean Literature Series,” as a way of introducing Japanese readers to works written since 2000. The company’s first release was Kim’s personal choice to be the standard-bearer for the new series, Han Kang’s shocking and groundbreaking novel The Vegetarian. Kim was determined from the outset that everything about the new series should epitomize quality and sophistication, down to cover designs and packaging. Han Kang’s book, which captures in evocative, powerful prose the lasting psychological trauma inflicted on its female protagonist, was prominently reviewed in the leading newspapers. In 2016, the book came to worldwide prominence when the English translation won the International Booker Prize, the first time the award had gone to a book translated from an Asian language. The book has continued to be one of Cuon’s bestselling titles ever since. The major turning point for Korean literature in Japan, Kim says, came in 2015, when the novella Castella by Park Min-gyu won the inaugural Best Translation Award. Scooping this high-profile prize, Kim says, helped bring Korean literature to the attention of readers and opened many people’s eyes to the ground-breaking and high-quality writing being published in Korea today. Before democratization in 1987, many Korean novels were rather heavy-going affairs that grappled with somber subjects like colonial rule and the military dictatorship. Many were marked by a strong ethnonationalist ideology. A shift began to occur from the 1990s, as younger novelists started to publish more entertainment-driven books written for a mass readership. Their stories were marked by a lightness of touch that had been missing from the writing of previous generations, and addressed the struggles and anxieties of daily life from a more personal perspective. Many of these novels dealt with subjects that are serious social issues in Japan as well as Korea, including discrimination against women and growing economic disparities. This new style of writing and more accessible subject matter made it easier for readers in Japan to identify with Korean writing, Kim says. Coincidentally, it was also in 2015 that Kim opened Chekccori, a bookstore and café in Tokyo’s Jinbōchō, Tokyo’s bookseller district. The store specializes in Korean writing, stocking around 4,000 volumes, including translations published by Cuon and other companies and books obtained directly from publishers in Korea. The store quickly became a magnet for lovers of Korean literature in the capital. Every inch of shelf space is taken up by novels, anthologies, essays, illustrated books, comics, language textbooks, and magazines. Kim has come up with a number of innovative ways to introduce the appeal of Korean writing to more readers in Japan, such as translation classes and guided tours that take loyal customers to the Korean cities that have provided the settings for popular books. Until the pandemic hit, the store regularly hosted authors, editors, and translators, and held around 100 events a year, including lectures, readings, and concerts. Of course, there are limits to what even the most creative and ambitious person can do to popularize Korean literature on her own. Kim admits that one of her aims is to nurture a new generation of enthusiasts in Japan, who she hopes will work together with her to help Korean writing gain an even wider audience. “I want to form a community of people and share the joy of working together to bring this writing to as many people as possible,” she says. One example of these efforts is a literary festival organized by K-Book, a foundation for which Kim serves as representative director. Held online in 2020, the festival hosted a series of events including presentations by editors at 26 publishing companies who introduced their favorite works among the Korean books their companies had published, as well as author readings and interviews, a roundtable discussion of translators, and a dialogue between Japanese and Korean book designers. These events helped to forge stronger ties between the writers and publishers who produce the books and the readers who support them, Kim says. The foundation also organizes a translation competition as part of its efforts to unearth talented translators who can help bring the appeal of Korean writing to outside audiences. It is fair to say that the synergy created by these events together helped prepared the ground for the popularity enjoyed by Korean writing in Japan today. One striking aspect of the new popularity for K-lit is the number of new companies looking to get involved in publishing Korean books in translation. According to the K-Book foundation, more than 10 publishers were involved in translations of Korean essay collections alone between 2020 and 2021, and the number of Korean books being published in translation, including essays and other genres, increased nearly threefold. “One area that’s particularly successful is science fiction by young writers in their thirties,” Kim says. Books like Chung Serang’s Koe o agemasu (I’ll Give You My Voice) and Kim Choyeop’s Watashi-tachi ga hikari no hayasa de susumenai nara (If We Can’t Go at the Speed of Light) offer an effective and refreshing combination of serious subject matter with an appealing lightness of touch, often depicting a vision of the near future. Compared to the work of writers of previous generations, Kim says, many of these recent books “have an approachability and warmth to them and carry a strong sense of the present moment.” As for the future of Korean literature itself, Kim says it is likely to go from strength to strength. “I think books like these will continue to find a wider audience in Japan in the years to come,” she says. “In Korea it’s quite natural for people to name Japanese authors like Murakami Haruki and Higashino Keigo among their favorite writers. I think we’ll soon have a similar situation in Japan. People will identify as fans of Han Kang, for example, and will look forward to reading the latest book by their favorite authors.” There is no doubt that the growing popularity of K-Lit is one that lovers of good writing will want to keep their eyes on in the years to come. (Originally published in Japanese. Banner photo: Kim Seungbok in her Chekccori bookstore. Photos by Kodera Kei.)  culture\nliterature\nSouth Korea     ",
    "datetime": "2021-10-14T00:00:01+0900",
    "url": "https://www.nippon.com/en/japan-topics/c10401/"
}