{
    "title": "All you need to know about K-drama hit Descendants Of The Sun | The Straits Times",
    "text": "The finale of hit drama Descendants Of The Sun will air in South Korea and China on Thursday (April 14) at 9pm (Singapore time). It will be available in Singapore on Viu, the website and the app, on Friday from 6am. A three-part special about the drama will air in South Korea from April 20 to 22, and be available on Viu from April 21. KBS 2TV, the Korean network which airs the show, said that as the series was fully filmed before airing, it was \"virtually impossible\" to air more episodes than initially planned. As such, it does not plan to air an extension for Descendants. In China, Descendants has been streamed more than two billion times. The show has been a breakway hit for several reasons. After the feverish success of My Love from the Star in China in late 2013 and early 2014, Chinese entertainment regulators put stricter limits on foreign dramas on video websites, effectively cooling down Chinese viewers' love affair with K-dramas. K-dramas are usually scripted and shot days before they are shown, to allow tweaks every week. Breaking with tradition, Descendants was fully pre-produced to pass the new Chinese guidelines and be cleared for simulcasts in China and South Korea. It is the first K-drama to air simultaneously in the two countries, which certainly helps when you want a show to go viral. There is not only leading lady Song Hye Kyo, an early star of the Korean Wave, but also star writer Kim Eun Sook (The Inheritors, 2013; Secret Garden, 2010; Lovers In Paris, 2004). Kim had a long relationship with SBS, which aired all her previous dramas but dropped Descendants. According to a report on the Korean Web portal Nate, SBS had doubts about a show about soldiers, as having characters in uniforms and military situations means that there is less money to be made from fashion sponsorship and product placement. Now Kim has partnered up with KBS, and SBS must be kicking itself. Every few years, the right K-drama star in the right role comes along whom millions can go gaga over collectively. In 2009, it was Lee Min Ho in Boys Over Flowers. In 2013, it was Kim Soo Hyun in My Love From The Star. This year, right now, belongs to Song, who is giving a star-making performance in Descendants as a soldier conducting an up-and-down courtship of a surgeon - a performance that is possibly up there with the one that aeons ago made a star of some kid in Top Gun called Tom Cruise. Here are some stories to tide you through the Descendants finale. Chinese government warns of dangers of Korean dramas as Descendants Of The Sun hits 440m views in China Descendants Of The Sun: Hot, hot, hot Song Joong Ki sizzles in K-drama Descendants Of The Sun Descendants Of The Sun producer on K-drama's unlikely success: Song Joong Ki's Captain Yoo didn't even exist in early script Hit K-drama boosts sales of South Korean products Descendants Of The Sun star Song Joong Ki: \"It feels natural for me to be in a soldier's uniform\" Descendants Of The Sun's Song Hye Kyo says her heart fluttered when watching her character wooed by Song Joong Ki 3 reasons why Descendants Of The Sun is the biggest K-drama phenomenon now Descendants Of The Sun star Song Joong Ki's high school life revealed Join ST's Telegram channel and get the latest breaking news delivered to you. Read 3 articles and stand to win rewards Spin the wheel now MCI (P) 066/10/2023. Published by SPH Media Limited, Co. Regn. No. 202120748H. Copyright © 2023 SPH Media Limited. All rights reserved. ",
    "datetime": "2016-04-14T10:10:00+08:00",
    "url": "https://www.straitstimes.com/lifestyle/entertainment/descendants-of-the-sun-ends-this-week-heres-all-you-need-to-know-about-the-k"
}