{
    "title": "Amid BTS’ Global Fame, K-Pop “Could Still Get Bigger” – The Hollywood Reporter",
    "text": "Subscribe for full access to The Hollywood Reporter Subscribe for full access to The Hollywood Reporter The seven-man group leads a Korean wave sweeping the planet as boundaries crumble and the West discovers a new generation of global hitmakers. By \n\n\tRebecca Sun Senior Editor, Diversity & Inclusion  There were four days this summer — Aug. 15 through 18 — when it was nearly impossible not to overhear at least a snippet of Korean pop music in Los Angeles.  Downtown, 103,000 K-pop fans mobbed the L.A. Convention Center for KCON LA, a Korean pop culture festival that featured performances by Seventeen, Mamamoo and a dozen other bands. Meanwhile, just 3½ miles east, in L.A. State Historic Park, another crowd of 25,000 music lovers was partying at Head in the Clouds, a slightly grittier festival — dubbed the “Asian Coachella” — that showcased acts like iKon and Korean-American rapper Dumbfoundead.  And it’s not just happening in L.A.: K-pop is becoming harder to miss all over the planet, with KCON conventions sprouting up in Mexico, France, United Arab Emirates, Thailand, Japan and Australia. The K-pop industry notched $5 billion in global sales in 2017, a 9.3 percent increase from the year before, and $2 billion in the first half of 2018, according to the government’s Korea Creative Content Agency. K-pop is now the seventh-most-popular genre in the world, ahead of metal, R&B and classical, according to the International Federation of the Phonographic Industry. And according to the Korea Foundation, a nonprofit that keeps track of such things, the global audience for Hallyu — Korean pop culture — is expected to hit 100 million in 2020. For context, the population of South Korea is 51 million. “The West is smart and wants to get into that market,” notes Peter Chun, former U.S. director for the K-pop label YG Entertainment who in February launched theQoos, an app that aggregates K-pop content for English-language fans. “And we’ve finally come to a place where we can collaborate and it makes sense for both sides.”  Of course, BTS remains the giant of the industry, but other bands are breaking out and climbing up the charts, like Blackpink, the first K-pop girl group to play Coachella. K-pop’s share of total listening on Spotify grew by more than 1,000 percent between January 2014 and April 2019. No surprise, then, that more Western record labels have begun courting the genre — Columbia, Interscope, Capitol, Republic, Epic and RCA now all have K-pop artists in their rosters. And Western acts are increasingly collaborating with their Korean counterparts. Lizzo remixed her chart-topper “Truth Hurts” with K-pop boy band AB6IX, while Lil Nas X partnered with BTS‘ RM for a Korean-themed remix of “Old Town Road” (called “Seoul Town Road”). Even Hollywood has been trying to cash in on the craze. Scooter Braun announced plans in August to develop a K-pop feature with Fox 2000, and at least two other projects at other major studios are in various stages of development. “The two pop cultures are getting closer, which is why K-pop is now resonating in the West,” says Chun. “When Girls’ Generation was on David Letterman [in 2012], it was a big deal. I thought the genre was peaking then, but now companies bring Asian artists out here for a whole day of television: Good Morning America, Ellen, Stephen Colbert. These groups are taking it to a new level, and it could still get bigger.” This story first appeared in the Oct. 1 issue of The Hollywood Reporter magazine. To receive the magazine, click here to subscribe. Sign up for THR news straight to your inbox every day Sign up for THR news straight to your inbox every day Subscribe for full access to The Hollywood Reporter Send us a tip using our anonymous form. ",
    "datetime": "2019-10-02T06:00:00+00:00",
    "url": "https://www.hollywoodreporter.com/news/general-news/bts-global-fame-k-pop-could-still-get-bigger-1244581/"
}