{
    "title": "AmorePacific Fronts Korean Beauty Craze – WWD",
    "text": "Suh Kyung-Bae has powered South Korea’s AmorePacific to a leading position in the East. Now, his goal is to globalize the firm and become the world’s leading Asian beauty company by 2020. Associate Editor The cosmetics company AmorePacific isn’t riding the craze for South Korean beauty products — it is the K wave. Over the past five years, the Seoul-based group’s sales have soared, from $1.84 billion in 2009 to $4.47 billion in 2014, an increase of 143 percent. Its proprietary cushion compact, first launched in 2008 and now available across its spectrum of 13 brands, posted growth of 1,000 percent year-on-year in 2014 alone, with more than 26 million units sold globally. AmorePacific may be one of the fastest-growing companies in the global beauty industry, but ask chairman and chief executive officer Suh Kyung-Bae, whose grandmother founded the company in her kitchen, how he envisions its continued development and he will only smile slightly, stroke his chin thoughtfully and note, “Figures are just figures. They are not important.” Related Articles\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tBeauty Features\n\t\n\n\n\n\t\n\t\t\tFounderSix Raises $12 Million in Funding\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tFashion Scoops\n\t\n\n\n\n\t\n\t\t\tGwyneth Paltrow to Pick Up Honor for Goop at CFDA Fashion Awards Suh is given to such philosophical musings, citing Charles Darwin’s quote, “From so simple a beginning endless forms most beautiful and most wonderful have been, and are being, evolved,” for example, when asked to describe his impact on the company. “I think my endless form would be pleasing people with beauty, making them happy, making them beautiful, with cosmetics. That is the reason I am doing the beauty business,” he says. But his impact on AmorePacific’s business has been much more material, and it is just that kind of paradox that Suh has built the company on — the marriage of cutting-edge modern technology with traditional Asian ingredients to create his vision of a “new beauty.” “We use traditional ingredients, but we add our innovative ideas and technologies to create the most modernized and scientifically advanced products to suit the needs of global customers,” he said, during an interview in New York in late April. “That is what we are pursuing. That is the new beauty.” Since its beginnings 70 years ago, AmorePacific has been primarily pursuing that strategy in Asia: In addition to Korea, its key markets are China, Hong Kong, Taiwan, Singapore, Thailand, Malaysia and Japan. For 2014, domestic sales were about $3.5 billion at current exchange, up 16 percent; sales in China rose 38 percent to $426 million, and turnover in the rest of Asia, excluding China, climbed 152 percent to $245 million. France, where AmorePacific owns the fragrance brands Annick Goutal and Lolita Lempicka, accounted for just 2 percent of overall sales, and the U.S., where the AmorePacific brand is sold in about 200 department store and Sephora doors, Sulwhasoo in five Bergdorf Goodman and Neiman Marcus stores, and Laneige in 750 Target doors, represented only about 1 percent of AmorePacific’s 2014 turnover. Now, Suh, who received his master’s degree in business administration from Cornell University in 1987, is setting his sights on globalizing the company’s business, with the goal of generating 50 percent of the group’s turnover in international markets by 2020 and reaching KRW 12 trillion (about $11.1 billion at current exchange) in annual sales. That would mean knocking Shiseido off its pedestal; the Tokyo-based beauty giant is currently the fifth largest global player, with 2014 sales of an estimated $7.37 billion.  Of particular interest is the U.S., where Korean beauty brands are all the rage but the landscape remains fragmented among relatively small companies. “Both our luxury and premium brand businesses are still in the beginning level,” Suh said. “We are starting to carry out full-fledged business efforts from now on. We do not have as many opportunities as we want to meet our customers, so we have to create more opportunities. Our goal is to have AmorePacific join the top 20 skin-care brands by 2020.” Retailers said given the brand’s current performance, that’s a realistic goal. “It’s a fine line, because they will need more penetration and distribution, but at the same time, will need to make sure it is still prestige distribution,” said Gemma Lionello, executive vice president and general merchandise manager, beauty, of Nordstrom. Currently AmorePacific is in 28 out of 118 Nordstrom doors and Sulwhasoo is launching in two later this year. “For us to make it really high ranking in terms of volume,” Lionello said, “they would have to be in most of our doors. It’s making sure they have more presence.” Beyond Nordstrom, the company is adding doors — AmorePacific will open a large Bloomingdale’s corner on June 1, Sulwhasoo is adding three stores, and an Annick Goutal boutique is scheduled to open on New York’s Upper East Side in June. But Suh’s overarching goal is to maximize the performance of each door, rather than simply increase the number of stores where the brands are sold. “We’re pursuing qualitative growth,” he said. “What’s most important is increasing the sales at each store rather than actually increasing the number of doors.”\nTo gain that presence, AmorePacific plans on following a strategy similar to one it pursued in China, when it launched there 20 years ago — put boots on the ground to better understand consumers at a grassroots level, improve the purchase experience and use proprietary technology to create products geared toward the unique needs of a market when necessary. “We launched in China in 1994. Even without the K wave, our business there continued to grow, because we made a lot of efforts to understand the Chinese culture and we also hired local Chinese people so that we could get more feedback and gather the voice of the people,” Suh said.  While AmorePacific hasn’t pursued a strategy of creating specialized brands for the market, it has localized the offerings of its global brands by tweaking the texture of an AmorePacific eye cream, for example, and adding a cleansing foam to the Mamonde line that targets even the very smallest particles of pollution from the skin. “This has been very popular with Chinese customers,” said Suh, “because pollution is such a big social issue there and they really care about their skin health.” Already, AmorePacific is taking baby steps toward creating specific products for the U.S., and will launch a three-item sun-care collection that includes the first “colorless” cushion compact, in June. Suh’s vision for the U.S. is a long-term one, and he’s shown himself to be patient when it comes to developing potential markets and concepts. For example, when cushion compacts first launched, sales were dismal. “It was a troublemaker,” he said. “It was the kind of product that had never existed before, so nobody knew how to use it. Actually, our distributors rejected it because they found it so strange,” he continued, referring to the company’s direct sales force. But Suh believed in the concept and decided to relaunch the product on a television shopping channel. “Because the product didn’t sell that much, we had a lot of inventory,” he said with a grin. “But it was a big hit on TV and after that, everything went smoothly.” Suh believes his vision is achievable in five years, and also doesn’t rule out the possibility of acquisitions. But ask him to quantify a sales target for the U.S., and true to form, he demures. “Once we do well, the figures will always follow us,” he said. “We don’t really pay much attention to it. In the long term, we try to think about how we are going to deliver the value of Asian beauty to the world and to the global customers. That is our goal.” It is a lesson he learned from his father, Sung-hwan Suh, who transformed the small store started by his mother into the modern-day AmorePacific, South Korea’s largest beauty company. “My father taught me that truth is the biggest asset you can have when you are running a business,” said Suh, “and that we have to differentiate ourselves from others and find something we excel in and do something better than anyone else.”  One major point of difference for AmorePacific is its eight-acre green tea plantation on Jeju island, started by Suh the elder and the site of the company’s celebrations for its recent 70th anniversary. “My father used to go twice a month and farm. He wasn’t alive to see the success of our green tea-based brands, but his value and spirit have passed down to the company,” said Suh. Suh also shares with his father an avid love of art, but whereas the elder man collected Eastern art, his son has developed a passion for contemporary Western artists. Already on this trip, he has had a private tour of the Donald Judd house in SoHo, and is eagerly anticipating visiting the just-opened Whitney Museum of American Art. “Tomorrow!” he exclaimed when asked if he has been. “Tomorrow as soon as it opens at 10:30.” Talk then turns to the horticultural composition of the High Line nearby, and the conversation comes full circle with Suh’s concept of modern beauty. “I think that kind of thing makes people more happy and the world more beautiful. “When it comes to happiness,” he continued, “it is about frequency, not intensity. I want to be remembered as a person who makes a small change but a significant change, to help people to become more beautiful.” Sign up for beauty news straight to your inbox every day Top News Stories Alerts Straight to your Inbox. Send us a tip using our anonymous form. WWD and Women's Wear Daily are part of Penske Media Corporation. © 2023 Fairchild Publishing, LLC. All Rights Reserved. ",
    "datetime": "2015-05-13T04:01:04+00:00",
    "url": "https://wwd.com/feature/amorepacific-korean-beauty-10127806/"
}