{
    "title": "AmorePacific's Suh Kyung-Bae Is Forbes Asia's 2015 Businessman of the Year",
    "text": "This story appears in the December 13, 2015 issue of Forbes Asia. Subscribe to Forbes Asia On a recent Asiana Airlines flight from Seoul to Beijing, Liu Yanan searches the overhead bins for a place for her overstuffed shopping bag. Liu, a 28-year-old advertising copywriter, visited Seoul for a concert by her favorite music artists, boy band Shinhwa, and on her way home she loaded up on discounted cosmetics at a duty-free outlet. Along with classic international brands such as Chanel and Lanc?me, Liu snapped up skin care products that are increasingly popular with young, upwardly mobile Chinese women: innisfree and Laneige, from the South Korean cosmetics company AmorePacific. Liu says she got hooked on Korean cosmetics because she fell in love with South Korea. A diehard fan of Korean popular music, or K-pop, since her teenage years, she also avidly tunes in to Korean TV soap operas, nicknamed K-dramas, which have won an army of fans across Asia. After watching the stars using Korean cosmetics in the shows and in advertising, she tried them herself, and liked both the price and quality. The colors and formulas of the makeup and creams, she says, are better suited for her Asian skin than many Western offerings. And she's far from alone in her fascination with all things Korean. Some of the boxes crammed into her shopping bag she bought on request from Chinese friends. \"We like the style\" in South Korea, she says. \"If you love something, you have to support it.\" Consumers such as Liu have AmorePacific Chairman and Chief Executive Suh Kyung-Bae feeling the love, and they are a big reason he's FORBES ASIA's 2015 Businessman of the Year. South Korea's largest cosmetics company is winning the hearts of China's middle-class shoppers--the newly flush customers every competitor in the global industry is wooing. The group's sales in China last year, which reached nearly $450 million, more than tripled in only four years. During the mainland shopping holiday Singles' Day last month, the Laneige brand was the third-best seller on Internet retail site Tmall, operated by e-commerce giant Alibaba. AmorePacific's products are flying off the shelves across the rest of the continent as well. Sales in Asia outside of South Korea and China surged 152% last year. \"We will change the world through Asian beauty,\" Suh tells FORBES ASIA. That success has turned AmorePacific into an industry highflier. Last year the group's revenue jumped 21% to $4.5 billion, while overall growth in the global beauty and personal care industry inched upward by a mere 1.6%, according to market research firm Euromonitor. Analysts expect group revenue to reach $4.9 billion this year and top $5.8 billion next year. Shares of AmorePacific Corp. have skyrocketed 345% in the past two years. All that growth has made Suh, 52, upwardly mobile himself. He became a billionaire in only 2011, but this year he ranked as the country's second-wealthiest person, with a $9.2 billion fortune--372% larger in just two years. The sudden ascent of Suh and the company founded by his father 70 years ago is inseparable from the success of South Korea itself. Thanks to hip songsters such as Psy and his hit \"Gangnam Style,\" hot pop groups such as Girls' Generation and stylish soap actresses Jun Ji-Hyun and others, Korean popular culture has come to define what is sexy, cool and fashionable throughout East Asia. That surge of cultural influence--known as Hallyu, or the \"Korean Wave\"--has buffed the image of the country and everything it makes, from its spicy food to Hyundai cars and Samsung smartphones. The K-Wave has been a tidal wave for the cosmetics industry. Asian women from Shanghai to Jakarta became mesmerized by the Korean stars they saw in dance videos and TV dramas and desired the same look--called K-beauty. Cosmetics exports from South Korea soared 95% in only two years, to $1.6 billion in 2014. HS Chung, CEO of consulting firm Synergy Hill+Knowlton Strategies in Seoul, believes that the Korean cosmetics industry would never have grown as quickly in recent years without the push from the K-Wave. \"The Korean Wave greatly affects the positive perception of Made in Korea products,\" she says. \"Every Korean corporation going global is benefiting.\" Nevertheless, the soft-spoken Suh believes that AmorePacific has risen on its own merits, not only on the K-Wave. While he acknowledges that the phenomenon \"did help us expand our business,\" he prefers to claim credit for the company's stellar performance for himself. \"The point in time when we considered ourselves to be on the trajectory towards success was before the K-Wave had even entered China,\" he says. Suh may fear that his company could be perceived as merely part of a fad that could fade. He stresses that his products are ultimately the source of his success. \"We were introducing new products to the rising Asia middle class,\" says Suh. \"We are not dependent or reliant on the K-Wave.\" That attitude may be based on a key aspect of Suh's management philosophy. A fan of sportswear company Nike, Suh says he learned a valuable lesson from its founder, Phil Knight: A good CEO must take responsibility for his business' success or failure. \"Don't blame others,\" he says, summarizing Knight. \"There is no such thing as a growing industry or declining industry. There are only growing companies and declining companies. Whether your company grows or declines is your responsibility.\" A self-described introvert and history buff who's as comfortable discussing the Roman Empire as retail, Suh says relentless inquisitiveness propels him to take a detail-oriented approach to management. \"I always try to learn things with the mind-set of a student as if I was back in school,\" he says. Sean Kim, AmorePacific's executive vice president for global strategy, says Suh can often be found chatting with a saleswoman inside a store, examining the factory machinery or discussing the latest formulas with researchers. \"People may think that because he is the CEO he mostly talks about the big picture, but in his case it is very different,\" says Kim. \"He has a very in-depth curiosity.\" Suh will need to study a lot more if AmorePacific is to reach its ultimate goal. Kim says the company doesn't aim to be merely the No. 1 cosmetics company in Asia but No. 1 in the world. \"We were able to gain some footprint in global markets,\" he says. \"This is just a starting point to achieve our global aspirations.\" The roots of the K-Wave can be traced to the Asian financial crisis of 1997, which forced South Korea to accept a humiliating International Monetary Fund bailout but is seen today as a critical change agent that broke apart outdated business practices. The result was an explosion of creativity in marketing, design, branding and research and development--the \"soft\" side of business that companies in the developing world find so hard to learn. Representing this trend, and supporting it, was the boom in Korean pop culture. K-pop, with its nifty beats, glamorous acts and snazzy videos, became the region's most influential force in contemporary music, while K-dramas, boasting higher production quality and stronger characters than many locally made programs, captivated viewers from Japan to Singapore and beyond. Korean singers and actors, from Rain to BoA, became pan-Asian superstars. Suh confesses that he failed to foresee the impact of the Korean Wave. But he was quick to capitalize on it. He has promoted his products by placing them in K-dramas and hiring Korean stars as models in marketing campaigns--with spectacular results. Last year, in the K-drama megahit My Love from the Star, AmorePacific enlisted lead actress Jun Ji-Hyun--a frequent company spokesmodel--to appear wearing its IOPE brand's Water Fit Lipstick #44 Forever Pink, which sold out around the region after the program aired. When she used a moisturizing care balm from its Hanyul brand in another episode, sales of that product exploded by 75%. But Suh didn't simply surf the K-Wave; he contributed to it by bolstering the perception of Korean brands and consumer products abroad. Suh realized upon taking the helm at AmorePacific in 1997 that his company had to change to survive. AmorePacific was a successful but very local business, with nearly all of its sales in South Korea. Overly focused on promoting one brand, the company also was too dependent on door-to-door sales by female agents. Suh sold off businesses unrelated to cosmetics, expanded his product lines, and began setting up or enlarging operations around the region. In China AmorePacific had been selling its wares on a limited basis since the early 1990s, but in 2002 Suh moved his China headquarters from the provincial city of Shenyang to glitzy Shanghai and began introducing a wider selection of products. (Today AmorePacific has more than 20 major brands and sells its products in 14 markets.) Most of all, Suh strove to make AmorePacific more innovative--he now spends roughly 2% of revenue on R&D. At a space-age R&D center south of Seoul in Yongin, Suh employs 450 chemists, biologists, pharmacists and other experts--a 30% increase in staffing since 2011. Last year the company also expanded an R&D facility in Shanghai to develop products for the China market. That investment has paid off. Some timely marketing may have tempted young women in China and Southeast Asia to try AmorePacific's creams and lipsticks, but he's kept many of them coming back with smart products. One of the company's most popular inventions is its \"cushion\" technology, introduced in 2008, which allows AmorePacific to mix sunscreen, foundation and skin moisturizer into one convenient compact applied with no more than a small puff. Products using the \"cushion\" have become a mainstay of the Korean woman's handbag. The company figures it sells one \"cushion\" product every second. In 2013 it introduced a creative offering called a \"finisher,\" which is used to seal in the benefits of skin moisturizers and toners before applying makeup. Such innovations suggest that AmorePacific can continue to sizzle even if the Korean Wave fizzles. Zhao Yufei, a 25-year-old government employee in Shijiazhuang in China's Hebei Province, may be a fan of K-dramas and AmorePacific spokesmodel Jun Ji-Hyun, but she says that's not why she buys the company's cosmetics. Zhao started using the products last year and buys them from a friend studying in South Korea. A fan of the group's makeup line Etude House, she has collected every limited-edition eye shadow launched under the label. \"I like their sweet, cute style,\" she says.  \"We like the style\": AmorePacific product lines such as innisfree are increasingly popular among... [+] young, upwardly mobile customers. Credit: Jae Hyun Kim for Forbes  None of this success, though, satisfies Suh. His goal for AmorePacific stretches beyond Asia--to take on L'Or?al, Est?e Lauder and other industry titans on their home turf in the U.S. and Europe. These are places the K-Wave can't carry him. The K-pop and K-drama starlets who have become fashion icons to Chinese women are much less familiar in the West. Out there, in a viciously competitive market, Suh is on his own. He's off to a promising start. Rather than rushing in, Suh has chosen a cautious approach in the U.S., introducing his products slowly and choosing his channels carefully. AmorePacific first placed its ultrapremium brand Sulwhasoo in luxury department store Bergdorf Goodman in 2010 and has since expanded its presence to Neiman Marcus, Nordstrom and other outlets, steadily building a following along the way. Sulwhasoo \"is considered a great brand in the finer stores,\" says Karen Grant, global beauty industry analyst at consulting firm NPD Group. \"They position themselves high and that they are something special. That has created a mystique around the brand.\" In 2014 AmorePacific reached into the more mass end of the market by introducing its Laneige line in Target stores. So far, though, Suh has barely dented the U.S. market. Last year his North American business amounted to a mere $33 million. Many of its customers, furthermore, are Korean or Chinese-Americans who may already be familiar with his offerings. \"It is more difficult to persuade the U.S. consumer to buy from us,\" admits Suh. \"We are still in the learning process.\" Unlike in China, where newly rich consumers are just beginning to forge loyalties to specific brands, American women already have established shopping habits and favorite lines, so getting them to try something new is a harder task. Many of Suh's products, furthermore, are geared for Asian skin tones and types, which attract shoppers such as concertgoer Liu Yanan but may not be as good a fit for Western women. \"Their strength in Asian markets could become a weakness in other markets, in the West especially,\" says Regina Hahm, cosmetics industry analyst at brokerage KDB Daewoo Securities in Seoul. Suh, however, isn't shying away from his Asian heritage. In fact, he plans to highlight his Asianness to distinguish AmorePacific from the competition. One of the big trends in cosmetics today has been a longtime focus for AmorePacific--the consumer's demand for more \"natural\" products. The company since its founding has used ingredients common to traditional Asian medicine and skin care, such as ginseng and green tea, and relentlessly hammers that home in its marketing. In South Korea its retail stores display the original plants under glass alongside the products made from them. (The company even owns a tea plantation on South Korea's Jeju Island.) Suh hopes this message resonates with U.S. consumers, too. \"We always pursue Asian beauty, which is a new beauty paradigm,\" he explains. \"What we aspire to is to have Asian beauty ideas reflected in the modern rituals. It is about bringing to people something different.\" That will prove critical. Despite its recent surge of growth, Suh has a long way to go to becoming a truly global company. Last year AmorePacific's revenue from outside South Korea was less than 18% of the total. To become the next L'Or?al, Suh will have to find new waves to carry him or keep creating more of his own. Jane Ho contributed to this story from Shanghai.  ",
    "datetime": null,
    "url": "https://www.forbes.com/sites/michaelschuman/2015/12/02/amorepacifics-suh-kyung-bae-is-forbes-asias-2015-businessman-of-the-year/"
}