{
    "title": "Anime and K-pop fuel language-learning boom - Taipei Times",
    "text": "Interest in anime, gaming and K-pop is fuelling a boom in Korean and Japanese university degrees that is helping to revive modern languages departments struggling with falling enrollments. Acceptances to study Korean more than trebled from 50 to 175 between 2012 and 2018, while Japanese places grew by 71 percent in the same period, according to a report published this year by the University Council of Modern Languages (UCML). More students now study Korean than Russian, and more take Japanese than Italian, the report shows. Experts who spoke to the Guardian said this was due to the popularity of east Asian culture — in particular K-pop and J-pop, Japanese video games, anime and popular films such as Parasite, and series such as the violent survival drama Squid Game — which has been boosted by their accessibility on platforms such as Netflix and Spotify. Photo: AP According to Netflix data, the South Korean series Squid Game is comfortably its most viewed show of all time, with 1.65 billion hours of the series streamed in the first four weeks after its release date. The rising popularity of Korean culture in particular, a phenomenon referred to as the Korean wave or K-wave, or hallyu, is influencing trends in a number of sectors, from cosmetics and fashion to food and household appliances. SHIFT IN INTEREST Photo: EPA-EFE At the heart of the K-wave is K-pop, which in 2017 was already estimated to be a nearly US$5 billion industry. The South Korean K-pop group BTS set a new record and made headlines for achieving the most YouTube views for a music video debut — more than 101.1 billion within 24 hours for last year’s song Dynamite. Emma Cayley, UCML’s chief executive, said: “It is clear that there has been a shift away from more traditionally taught European languages to non-European.” She said this included Arabic and Chinese, which combined with Japanese and Korean are driving the recovery of the study of languages and culture in universities. Photo: AFP A recent UCML study based on universities self-reporting their language provision suggested the proportion of universities offering Japanese rose from 19 percent in 2018 to 39 percent this school year, while a small increase was observed in departments offering Korean. Lecturers say students often start studying Korean and Japanese as a hobby while at school on language-learning platforms such as Duolingo, with recent figures in the UK showing Japanese was the fastest-growing language and Korean the fourth fastest. CULTURAL INTEREST Photo: AFP “They started learning Japanese just casually, for fun, and then they thought ‘this is fun’ so they want to study more seriously either as a degree or as an optional subject,” said Kazuki Morimoto, a Japanese lecturer at the University of Leeds. Morimoto said he had noticed a shift away from students opting to combine Japanese with business or economics 10 to 20 years ago to improve their job prospects, towards students studying the language and culture by itself for the love of it, although many do still find jobs connected to Japan as graduates. He thinks young people have been influenced by the spread of the culture on social media as well as by a strategic program of cultural diplomacy initiated by the Japanese government in the run-up to the rugby World Cup and Tokyo Olympics. Many students were also drawn to the prospect of a year in Japan, he added. Jaeuk Park, a Korean lecturer at Leeds, said his students typically studied Korean as a result of their love for K-pop and K-dramas, although some were also interested in understanding more about North Korea, a notoriously secretive nation. Sarah Keith, who researches Korean popular culture at Macquarie University in Australia, said its appeal to westerners was a result of “how global culture is now,” with many Korean creators having grown up consuming Hollywood films and European culture. As a result, their cultural outputs are a “balance of familiarity and novelty” that westerners find compelling. “For example in Squid Game, the dramatic pacing and arc of the show are intelligible to viewers worldwide, but at the same time it engages with specifically Korean themes which are totally new to foreign audiences,” she said. Last week the New York Times published Oriana Skylar Mastro’s “This is what America is getting wrong about China and Taiwan.” The piece was a fairly typical example of the well-worn genre claiming that peace can be achieved by selling out Taiwan, arguing that the US should “try to understand China’s deep sensitivities about Taiwan” and that it “should recommit — clearly and unequivocally — to the idea that only China and Taiwan can work out their political differences.” \r\n Yes, Skylar Mastro actually argues that the people with the knife at their throat should be allowed to “work out Deep inside his tribe’s sacred rainforest on the Indonesian holiday island of Bali, Indigenous guide Putu Willy Suputra looks on in disbelief as a group of tourists video themselves mimicking monkeys by swinging on a long, woody vine.\r\nSuputra is a member of the 20,000-strong Adat Dalem Tamblingan Indigenous community who have lived in northern Bali since the 9th century and want rights to curb tourism and protect their rainforest and lake.\r\n“These types of things really hurt me,” the 27-year-old said. “That liana will definitely die.”\r\n“If we go into this forest, it is enough to walk, see, hear and leave a Tainan’s Sanye Creek (三爺溪) isn’t by any stretch of the imagination a tourist attraction. For years, it was the worst-polluted tributary of one of Taiwan’s most degraded rivers. These days, however, it makes for pleasant cycling, especially if you’ve an aversion to traffic and gradients.\r\nThis 14.4km-long waterway also looks and smells a good deal better than you’d expect, if you were to research its postwar history. Alternatively known as Sanyegong Creek (三爺宮溪) or Sanlaoyegong Creek (三老爺宮溪) — names which suggest there’s a temple on its bank — its source is somewhere in Yongkang District (永康). That part of Tainan is Last month, Bill Gates surprised some people by saying that planting trees isn’t one of his responses to climate change. Speaking at the New York Times Climate Forward Summit on Sep. 21, the billionaire described relying on tree-planting efforts to roll back global warming as “complete nonsense.”\r\nGates is right. Even if humanity was to utilize all suitable land and plant a trillion trees — a goal endorsed by the World Economic Forum, World Wildlife Fund, Wildlife Conservation Society and other organizations — new woodlands wouldn’t by themselves come close to countering global carbon dioxide emissions. \r\nThe Microsoft founder went on ",
    "datetime": "2021-12-30T00:00:00+08:00",
    "url": "https://www.taipeitimes.com/News/feat/archives/2021/12/30/2003770413"
}