{
    "title": "Apink’s ‘Luv’ MV Blends ’90s Hip-Hop & Ballad Melancholy | Billboard – Billboard",
    "text": "The sweet girl group long for a lost lover  over beat that recalls TLC and Will Smith's early hits. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin After snatching their second No. 2-peaking K-Pop Hot 100 hit with “Mr. Chu” in April, Apink return with a complex new single. On the surface, “Luv” is a peppy pop track that recalls ’90s hip-hop production — think early TLC and Will Smith — but its lyrics speak on longing for a lost lover and reminsicing of the love (or “luv”) once shared.  Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news “Luv” is a throwback track similar in theory to Apink’s 2011 single “MyMy” recalled early ’00s bubblegum pop and 2012’s “NoNoNo” touched on ’80s synth-pop notes. Despite the glossy production and funky dance breaks, the girls are singing about lost love, rather than their signature cheery lyrics.  Showing a new side of themselves lyrically, Apink’s members remember time spent with their ex-lovers and the safety felt with them while wondering if they reminisce over such feelings as well. Melody-wise, “Luv” has a brightness to it with a hint of melancholy in the girls’ voices. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t11/25/2014 While it’s not true for the entire song, Apink also slightly mixes up their formula in terms of line distribution here. While main vocalists Eunji and Bomi have almost always handled the choruses, member Chorong gets a chance to shine on the final section. K-Pop’s Next Wave: Apink & 9 More Artists to Watch The accompanying video plays more to the sorrowful side of the song as the girls longingly sing to the camera with crystal stickers stuck near their eyelids, looking a bit like tear drops. Like any Apink visual, there’s loads of glam shots and cute dance moves, but it’s all presented with a fall-themed color palette with whites, grays, black and beiges instead of the usual pinks, blues and yellows we’re used to seeing from the band. Mixing a sad subject with a vintage, throwback beat makes “Luv” a rather multidimensional track while showing that Apink can make a few tweaks to their usual formula and still provide the aspects that help them continue to stand out from other acts. Watch the girls take on the song live below:  Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2014-11-26T01:27:01+00:00",
    "url": "https://www.billboard.com/music/music-news/apinks-luv-mv-video-6327584/"
}