{
    "title": "Ari Lasso Bikin Fan NCT Dream Berdendang Lagu Hampa di Korean Wave",
    "text": "Ari Lasso tampil girang di atas panggung Korean Wave 2022 di Trans Studio Mall Cibubur, Rabu (27/9). Ia membawakan sejumlah lagu, di antaranya Hampa dan Misteri Ilahi. Dengan mengenakan setelan jas hitam yang senada dengan celana panjang dan sepatu, Ari Lasso tampak bahagia naik ke atas panggung dan menyapa penonton. Saat Ari Lasso membawakan Hampa, seisi TSM Cibubur yang dipadati NCTzen ikut berdendang. Momen itu tak disia-siakan oleh Ari Lasso dengan merekam penonton melalui ponselnya. ADVERTISEMENT SCROLL TO CONTINUE WITH CONTENT  Ari Lasso merupakan salah satu dari sekian penampil Korean Wave 2022. Sebelum dirinya, ada Nassar dan Raisa yang ikut membuka acara tersebut. Nassar sempat membawakan gubahan lagu Gangnam Style dengan energik. Tepat pukul 19.00 WIB, Nassar dan para penari latar yang berpakaian meriah berhasil memecah resah para pengunjung yang sudah antre sedari sore tadi. Usai Gangnam Style versi Nassar, giliran Raisa yang memasuki panggung dengan anggun untuk bawakan lagu Jadikan Aku Pacarmu milik Sheila on 7. Setelah Raisa, Ari Lasso membawakan tembang klasik Misteri Ilahi untuk mengajak penonton bersenandung bersama. Refrain lagu tersebut berhasil membuat lautan penonton berubah warna menjadi hijau berkat cahaya lightstick para fans NCT Dream.  Korean Wave 2022 yang digelar di Trans Studio Mall Cibubur pada Rabu (27/9) akan menghadirkan NCT Dream sebagai penampil utama. Selain itu, acara ini juga akan turut menghadirkan Ayu Ting Ting, Nassar, Fabio Asher, UN1TY, dan Anneth. Sedangkan, Korean Wave 2022 akan dipandu oleh Astri Tiar dan Indra Herlambang. NCT Dream sebelumnya tampil di hadapan NCTzen di Indonesia di acara Allo Bank Festival 2022 yang berlangsung di Istora Senayan, Jakarta pada Mei lalu. Kemudian, sub unit boy group NCT itu juga pernah datang ke Indonesia pada September 2019. Mereka hadir untuk merayakan ulang tahun ke-18 Transmedia yang diadakan di Trans Studio Mall Cibubur, Depok, Jawa Barat.    ",
    "datetime": null,
    "url": "https://www.cnnindonesia.com/hiburan/20220928195132-227-853944/ari-lasso-bikin-fan-nct-dream-berdendang-lagu-hampa-di-korean-wave"
}