{
    "title": "Army Backs Down on FOIA, Waives $300K Fee for PFAS Contamination Data | Environmental Working Group",
    "text": "Creators of Skin Deep Database Tapwater Database EWG Verified The New LedeSearch WASHINGTON – Under pressure from Environmental Working Group and Capitol Hill lawmakers, the Army today agreed to waive its fee of almost $300,000 to process a public records request seeking information about fluorinated chemical contamination at military installations. In November, EWG filed a Freedom of Information Act request for data to determine the severity of PFAS contamination of drinking water and groundwater at hundreds of bases nationwide. EWG requested a fee waiver, which the Associated Press reported is routinely given to news outlets and nonprofit groups seeking information in the public interest. But earlier this month, the Army said EWG would have to pay $290,400 for collection and preparation of the data. EWG appealed. “Considering the Pentagon is one of the largest sources of pollution in this ballooning drinking water crisis, the Army and the rest of the military must be part of the solution, not more of the problem,” said EWG Legislative Attorney Melanie Benesh. “Collecting as much of the data as possible about where and how much PFAS contamination threatens service members, their families and others who live and work near these facilities is paramount to this effort.” The Marine Corps and two regional branches of the Navy granted the fee waiver, Benesh said. EWG is awaiting a reply from some other branches of the military. The Pentagon is lobbying the White House to back woefully weak cleanup standards for PFAS chemicals, according to The New York Times. The levels pushed by the Pentagon, up to 30 times the recommendation of some federal scientists, could mean some sites are not cleaned up at all. EWG has laid out a comprehensive plan for the Trump administration that would tackle the growing PFAS contamination crisis, including mandating that the Pentagon quickly clean up all of its contaminated facilities. ### The Environmental Working Group is a nonprofit, non-partisan organization that empowers people to live healthier lives in a healthier environment. Through research, advocacy and unique education tools, EWG drives consumer choice and civic action. View the discussion thread. If anything good came of recent brinkmanship over federal spending, it might be the reminder that large parts of the economy depend on the federal government. Everything from medical research to food... In a major win for people aiming to live healthier lives, EWG has helped usher in six new California laws that will reduce exposure to harmful chemicals in food, cosmetics and other products – and... When you drink from a plastic water bottle, you could be exposing yourself to tiny, potentially harmful plastic particles known as microplastics. And the biggest source of your exposure to these... Environmental Working Group 1250 I Street NW\nSuite 1000\nWashington, DC 20005 All Offices    Contact Us EWG is a 501(c)(3) nonprofit corporation, EIN 52-2148600. Copyright © 2023, Environmental Working Group. All rights reserved.\nVisit EWG's 501(c)(4) organization, EWG Action Fund. Creators of Skin Deep Database Tapwater Database EWG Verified The New LedeSearch ",
    "datetime": null,
    "url": "https://www.ewg.org/news-insights/news-release/army-backs-down-foia-waives-300k-fee-pfas-contamination-data"
}