{
    "title": "As the K-Wave Rises Across America, Jongga, Korea's No.1 Kimchi Brand, Helps Make Korean Cuisine More Accessible",
    "text": "Searching for your content... In-Language News Contact Us 888-776-0942\n\nfrom 8 AM - 10 PM ET California Recognizes the Importance of Kimchi in Korean Culture and Healthy Eating with the State's First-Ever Kimchi Day News provided by 22 Nov, 2021, 10:00 ET Share this article LOS ANGELES, Nov. 22, 2021 /PRNewswire/ -- From \"Squid Games,\" BTS and Gentle Monster eyewear to \"Sesame Street,\" which recently introduced Ji-Young, a guitar-playing Korean American character to the neighborhood, the Korean culture wave is rising again in the United States. And now, kimchi, the traditional Korean side dish that is a staple in Korean cuisine, is being celebrated, too, with California's proclamation that today is Kimchi Day. Jongga, Korea's No.1 kimchi brand, is owned by South Korea's Daesang Group and managed by California-based Daesang America.  Jongga, Korea's No.1 kimchi brand, applauds California for recognizing Korean culture with first-ever Kimchi Day! Kimchi is typically made of fermented cabbage, salt and hot peppers, and traditionally is eaten with most Korean meals. In fact, in its 2021 Taste Charts forecasting the food trends of the coming year, Kerry, the global ingredient company, expects kimchi to be an \"Up & Coming Savory\" flavor. Known for its refreshing crunchy texture and deep flavor, Jongga delivers a consistent, mouth-watering kimchi through its innovative fermentation process, which combines ideal temperature control and meticulous time management. As a result, Jongga brand represents more than 60 percent of the kimchi exported from South Korea to the United States. Additionally, in just the last three years, Jongga kimchi exports to the United States have grown more than 20 percent. \"We're thrilled that the State of California is recognizing the role that kimchi not only plays in Korean culture, but also the significant health benefits of kimchi, including probiotics, calcium and vitamins A, B and C,\" said Brian Tompkins, vice president of sales and marketing at Daesang America. \"With more and more professional chefs and home cooks incorporating Korean flavors and ingredients into their menus, we anticipate the demand for kimchi among American consumers will continue to increase for many years to come.\"Daesang America demonstrated its commitment to the growth of Jongga kimchi with its previously announced plan to open the first-ever U.S. kimchi production facility in the Los Angeles metro area next year. With this investment, Americans will have access to the freshest, flavorful kimchi possible.About Daesang America, Inc.Founded in 1956, Daesang Group has grown to one of the world's largest producers of fermented food products for every day consumers. Headquartered in South Korea, the company boasts sales and manufacturing subsidiaries—from the East in Europe, Japan, Hong Kong, China, Indonesia and Vietnam, to the West in the United States—exceeding $2.6 billion in sales revenue. Daesang's American branch now includes three leading brands of specialized products—O'Food, Jongga and Chung Jung One—available on shelves nationally, as well as online at Amazon. Look for Daesang to continue to expand on these efforts as well as to bring new products from Korea and beyond. For more information, visit the website and check out recipes, photos, and more on their Instagram, Facebook and Twitter pages.SOURCE Daesang America Known for its refreshing crunchy texture and deep flavor, Jongga delivers a consistent, mouth-watering kimchi through its innovative fermentation process, which combines ideal temperature control and meticulous time management. As a result, Jongga brand represents more than 60 percent of the kimchi exported from South Korea to the United States. Additionally, in just the last three years, Jongga kimchi exports to the United States have grown more than 20 percent. \"We're thrilled that the State of California is recognizing the role that kimchi not only plays in Korean culture, but also the significant health benefits of kimchi, including probiotics, calcium and vitamins A, B and C,\" said Brian Tompkins, vice president of sales and marketing at Daesang America. \"With more and more professional chefs and home cooks incorporating Korean flavors and ingredients into their menus, we anticipate the demand for kimchi among American consumers will continue to increase for many years to come.\" Daesang America demonstrated its commitment to the growth of Jongga kimchi with its previously announced plan to open the first-ever U.S. kimchi production facility in the Los Angeles metro area next year. With this investment, Americans will have access to the freshest, flavorful kimchi possible. About Daesang America, Inc. Founded in 1956, Daesang Group has grown to one of the world's largest producers of fermented food products for every day consumers. Headquartered in South Korea, the company boasts sales and manufacturing subsidiaries—from the East in Europe, Japan, Hong Kong, China, Indonesia and Vietnam, to the West in the United States—exceeding $2.6 billion in sales revenue. Daesang's American branch now includes three leading brands of specialized products—O'Food, Jongga and Chung Jung One—available on shelves nationally, as well as online at Amazon. Look for Daesang to continue to expand on these efforts as well as to bring new products from Korea and beyond. For more information, visit the website and check out recipes, photos, and more on their Instagram, Facebook and Twitter pages. SOURCE Daesang America Sign up to get PRN’s top stories and curated news delivered to your inbox weekly!  ",
    "datetime": null,
    "url": "https://www.prnewswire.com/news-releases/as-the-k-wave-rises-across-america-jongga-koreas-no1-kimchi-brand-helps-make-korean-cuisine-more-accessible-301429430.html"
}