{
    "title": "ASEAN, South Korea to enhance culture exchange",
    "text": "The Korean Wave has gotten the pulse of its audience in ASEAN countries, and officials and experts are saying they hope the ASEAN and Korea can go beyond the one-way wave and bring a two-way wave through more culture exchanges in the future. SEOUL — South Korea’s popularity is on the rise, not just in ASEAN countries, but around the globe. K-pop songs top the charts not only in Asia but also in America and the United Kingdom, making BTS the first Korean band to ever have a UK number one. But it’s not just music that’s helping improve South Korea. “The Korean Wave” refers to the global popularity of South Korea's cultural economy exporting pop culture, entertainment, music, TV dramas and movies. The phenomenon is consumed all over the world. ASEAN region, in particular, is one of the largest consumption markets South Korean dramas and K-pop (South Korean pop music). The export of South Korean music and broadcast content to ASEAN had totalled USS$86 million in 2016. ASEAN countries also are the second largest in term of number of fan page and fan club members for K-pop stars. “Most scholars and critics have explained in terms of economic benefits and the growth in soft power on global diplomacy. I think it’s time for us to discuss the transnational community,” said Jang Won-ho, director of the Center for Glocal Culture and Social Empathy, who is also the Dean of the College of Urban Sciences, University of Seoul, at the ASEAN-Korea Media Forum in Seoul yesterday. Jang has researched the phenomenon, also called Hallyu, and he said he saw positive signs. He cited the case of BTS, the most popular K-pop band in the region. Since BTS has a large number of fans and see themselves as role model, the band has been working with the UNICEF to raise funds for the “Love Myself” Campaign. “I see the good influence on fandoms that the band has,” he said. Jang also shared a picture of two Palestinians girls and a Jewish girl, who are BTS’s fans, saying he saw the possibility for strong empathy among young people who share the same interests. “I think this is the strong possibility for the solidarity between different groups of people,” he said. “It should be the future of Hallyu.” Lee Hyuk, secretary general off the ASEAN-Korea Center, said the Korean Wave has become a crucial pillar for the strong relationship between the two regions. He added that promoting socio-cultural exchanges between ASEAN and South Korea will be fostered in the future. “Better understanding of each other’s culture will help us to appreciate and respect each other. We should continue our efforts in fostering a better environment to expand relationships through lively social, cultural and people-to-people exchange,” he said. Ko Jeong Min, a professor at the Hongik University, Seoul, agreed. “It is important that ASEAN-Korea cultural exchange is not one-side,” he said. “(South) Korea is now exporting its culture to ASEAN but I believe culture exchange between the two sides can be improved. ASEAN knows a lot about Korean culture but we don’t know anything about ASEAN idols. If we know, we can enjoy the benefits from ASEAN countries,” he said. He also emphasised on the need to utilise the residence programme in South Korea to support the stay of ASEAN personnel in South Korea and support their activities. Ko also proposed the co-production by ASEAN and South Korea in terms of performances, films and dramas. Not just K-pop Cod Satrusayang, managing editor of the Asia News Network, agreed that cultural exchanges were necessary in order to ensure empathy, understanding and building a closer regional bond, but said cultural exchanges should not only be about the Korean Waves. “I’m impressed by how much K-pop fills Korea and how TV infiltrated various cultures in ASEAN nations and I think that’s only a good thing. But popular culture, the arts, and entertainment music – that’s only a fraction of culture,” Cod said. “Culture is also ideas, culture is also heritage with which you inherited from the people.  I think within South Korean culture, beyond K-pop, beyond the next Korean drama, there are important ideas within South Korea that ASEAN would be happy to learn from,” he said. K-pop is important, but there’s also an intellectual cachet that can be had by exchanging intellectual ideas as well, Cod said.—VNS The event, organised by American Motion Picture Association (MPA), AnSinh Group and IPCom Việt Nam, aimed to raise awareness of the importance of protecting IP in the context Việt Nam has joined the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP), as well as amid the rapid growth of digital technology, software, arts and entertainment. The floor of the bridge is made of 5cm thick bulletproof glass and can serve from 50 to 70 visitors at a time. Belgium's Dardenne brothers seek Cannes fest immortality Copyrights 2012 Viet Nam News. All rights reserved.\r\n                    Add:79 Ly Thuong Kiet Street, Ha Noi, Viet Nam. Editor_In_Chief: Nguyen Minh\r\n                    Tel: 84-24-39332316 - Fax: 84-24-39332311 - E-mail: vnnews@vnagency.com.vn\r\n                    Publication Permit: 141/GP-BTTTT. ",
    "datetime": null,
    "url": "http://vietnamnews.vn/life-style/519138/asean-south-korea-to-enhance-culture-exchange.html"
}