{
    "title": "Asia Society Korea Center's 5th Anniversary Dinner | Asia Society",
    "text": "Unsupported Browser Detected.It seems the web browser you're using doesn't support some of the features of this site. For the best experience, we recommend using a modern browser that supports the features of this website. We recommend Google Chrome, Mozilla Firefox, or Microsoft Edge  Asia Society President Josette Sheeran gives remarks during the Asia Society Korea Center's 5th Anniversary Dinner. (Jun Michael Park/Asia Society) SEOUL, November 7, 2013 – The Asia Society Korea Center celebrated five years of helping to deepen cooperation between the United States and the Asia-Pacific region with the help of luminaries from both South Korea and the U.S. In the Crystal Ballroom of the Lotte Hotel Seoul, the Korea Center honored its many supporters, members, and friends that made its successful journey as the eleventh global center of Asia Society possible. The U.S. Ambassador to Korea, H.E. Sung Y. Kim, offered congratulatory remarks regarding the deep impact that the Korea Center had over the years in the areas of arts and culture, business, policy, and education. The Dinner also featured an Awards Ceremony that lit up the stage with influential Koreans, with Hyun-Jin Ryu, famous left-handed starting pitcher for the Los Angeles Dodgers, and Dae-Hwa Koh, President of Aura Media and producer of legendary Hallyu (Korean Wave) dramas. Ryu, the first Korean pitcher to have a starting win in the postseason of Major League Baseball, received the Cultural Achievement Award for his contribution to U.S.-Korea relations and mutual goodwill through sports. Koh received the Cultural Diplomacy Award for his efforts to promote Hallyu and increase understanding of Korean culture globally. Hallyu refers to the recent surge in popularity of Korean entertainment, particularly television dramas, movies, and popular music. Although Hallyu, or the K-Wave, had a large impact in Japan, China, Taiwan, and Southeast Asian countries, it soon turned into a global phenomenon. Koh produced major acclaimed Hallyu television series including “Hwang Jini” and “Jumong” that helped put Korea on the entertainment map.  (From left to right) Josette Sheeran, Hyun-Jin Ryu, and Yvonne Kim pose for cameras before the start of the Asia Society Korea Center's Anniversary Dinner. (Jun Michael Park/Asia Society) H.E. John A. Prasetio, the Ambassador of Indonesia to South Korea, received the Ambassador Award for his great support of the Asia Society Korea Center. Hong-Kee Kim, Managing Partner of Samil PricewaterhouseCoopers, and SeungWha Gweon, CEO of EY, each received the Business Leadership Award on behalf of their respective companies. The Embassy of Russia and the Embassy of Kazakhstan conveyed their warm congratulations to the Korea Center through exciting performances from their respective cultures. Ten students from the Embassy of Russia performed a traditional dance called “Russian National Dance with Shawls.” Two students from the Embassy of Kazakhstan performed a traditional song called “Kozimnin Karasy.” Ronnie Chan, Co-Chair of Global Asia Society and Chairman of Hang Lung Group; Josette Sheeran, President & CEO Asia Society; Dr. Hong-Koo Lee, Honorary Chairman of the Asia Society Korea Center; and Dong-Bin Shin, Chairman of the Asia Society Korea Center, were among the over 200 guests at the dinner.  Ronnie C. Chan, Co-Chair of Global Asia Society, gestures during his remarks at the Asia Society Korea Center's 5th Anniversary Dinner. (Jun Michael Park/Asia Society) A major highlight of the evening was the debut of the trailer for Asia Society Korea Center’s documentary, “Korean Beauty.” This new documentary aims to go beyond the façade and demonstrate the inner beauty of Korean women by exploring women throughout Korean history, folklore, and contemporary trends. The Korea Center’s 5th Anniversary Dinner also paid homage to the Rockefeller family and its legacy of establishing Asia Society during a time when the channels for cross-cultural understanding and collaboration were not well formed. Tonight’s guests were seated at tables that were named after members of the Rockefeller family and featured cards that highlighted their contributions in art, politics, and business. Asia Society takes no institutional position on policy issues and has no affiliation with any government.\nThe views expressed by Asia Society staff, fellows, experts, report authors, program speakers, board members, and other affiliates are solely their own. Learn more.   ",
    "datetime": null,
    "url": "https://asiasociety.org/korea/asia-society-korea-centers-5th-anniversary-dinner"
}