{
    "title": "Asia falls for South Korean military romance Descendants of the Sun - TODAY",
    "text": "Entertainment SEOUL — Millions across Asia will sit down this week for the finale of a hit South Korean drama series that has triggered relationship health warnings in China, a thumbs-up review from Thailand’s junta chief and a trans-regional passion for its two young stars. This undated handout photo released by Next Entertainment World in Seoul on April 5, 2016 shows South Korean actor Song Joong-Ki (R) and actress Song Hye-Kyo in a scene from the hit South Korean drama series \"Descendants of the Sun\". Photo via AFP SEOUL — Millions across Asia will sit down this week for the finale of a hit South Korean drama series that has triggered relationship health warnings in China, a thumbs-up review from Thailand’s junta chief and a trans-regional passion for its two young stars. Descendants of the Sun tells the story of an army captain sent on a peacekeeping mission to a fictional war-torn country, Uruk, where he meets and falls in love with a surgeon working with a medical NGO. The 16-episode show has garnered impressive domestic ratings for broadcaster KBS, but its real success has been overseas and the series has been hailed for reviving the so-called “Hallyu” (Korean Wave) of k-pop and k-drama that started spreading across Asia in the early 2000s. It has proved particularly popular in China, where it has been simulcast on the video-streaming site iQiyi.com and has notched up more than 2.0 billion accumulated views, while becoming one of the top-ranked search and discussion topics on Weibo, China’s version of Twitter. “Will I be able to find an acceptable husband if I keep watching K-dramas?” said one Weibo user, describing herself as “totally in love” with lead actor Song Joong-Ki’s character. ‘SONG JOONG-KI SICKNESS’ Such obsessive yearnings triggered a tongue-in-cheek warning from China’s Public Security Ministry about thousands of women who were suffering from “Song Joong-Ki sickness”. “When chasing male or female stars, do not become too infatuated with them, because sometimes your casual words could end up hurting those who really care for you,” the ministry advised on its own Weibo account. And it is not just China. In Singapore, advertising executive Jamayne Lam, who described Song as “every girl’s dream”, confessed to getting hooked on the drama after just 10 minutes and binge-watching all 11 available episodes in two days. In Hong Kong, where it’s shown on Viu TV — a free-to-air channel that also has an online portal — the series is popular with commuters who like to view it on their smartphones while travelling to and from work. “After watching the first episode, I could not help but chase it,” said Susan Yuen, a 30-year-old clerk, adding that waiting for the latest episode upload had become a weekly routine for her and many colleagues in her office. Korean dramas normally begin airing before later episodes are filmed — allowing for ratings-boosting script adjustments. RISKY MARKETING STRATEGY But Descendants of the Sun was pre-recorded in its entirety — a major “risk”, according to its South Korean producer Next Entertainment World (NEW). “None of the pre-recorded dramas have been successful in the past,” a spokeswoman for NEW told AFP. “But it was necessary to pass Beijing’s censorship rules for our first simulcast in China.” Censors did make some changes to the Chinese-version of the drama, including deleting a fight between South and North Korean soldiers in the first episode. Pre-recording paid off by allowing a strong pre-broadcast marketing strategy that included airing movie-like teasers in South Korea and China three months in advance. The drama has now been sold to 32 countries, including non-Asian broadcasters in the United States, England, France and Russia. Its success is built on the same staples that have made k-dramas a lucrative cultural export: attractive lead actors, melodrama and romance. What sets it apart, experts say, is its modern-day setting of military peace-keeping, upbeat patriotism and, perhaps most crucially, the fact that it’s a k-drama that isn’t “too Korean”. “At a time when Asia has seen scores of natural disasters like tsunamis and earthquakes, the series projects a sense of universal humanity,” said Yun Suk-Jin, professor of Korean Literature at Chungnam National University. “And because it is set overseas rather than in Korea, it appeals more to international viewers,” Yun said. POPULAR EXPORT It has spawned a mini industry, with Chinese fans snapping up cosmetics, clothes and fashion accessories favoured by the show’s stars — especially the female lead Song Hye-Kyo — and sold on iQiyi.com’s online shopping site. The South Korean city of Taebaek — the location for the military barracks in the drama — is opening the film set to the public after President Park Geun-Hye told senior officials that the drama could fuel a boost in tourism. Park was just one of a number of political leaders to applaud the drama for helping to “instill a sense of patriotism among young people”. In Thailand, former army chief-turned-Prime Minister Prayut Chan-O-Cha praised the series for its sense of sacrifice, obedience and duty. “So please watch it and if anyone wants to make such a drama I will financially sponsor it to make people love government officials,” Prayut told delegates at a government function in Bangkok. His only criticism was that Song Joong-ki was possibly too young and handsome. “In real life a captain must shoulder a lot of burden and would look older,” he suggested. AFP Read more of the latest in Subscribe to get daily news updates, insights and must reads delivered straight to your inbox. By clicking subscribe, I agree for my personal data to be used to send me TODAY newsletters, promotional offers and for research and analysis. Copyright 2023 © Mediacorp Pte Ltd. All rights reserved. We know it's a hassle to switch browsers but we want your experience with TODAY to be fast, secure and the best it can possibly be. To continue, upgrade to a supported browser or, for the finest experience, download the mobile app. Upgraded but still having issues? Contact us ",
    "datetime": null,
    "url": "https://www.todayonline.com/entertainment/television/asia-falls-south-korean-military-romance-descendants-sun"
}