{
    "title": "Astronomers discover giant wave-shaped structure in the Milky Way | CNN",
    "text": "Our solar system resides in one of the Milky Way galaxy’s spiral arms, and for the first time, astronomers have realized we’re close to a giant wave-shaped gaseous structure that connects star nurseries. This wave – now known as the “Radcliffe Wave” for the Radcliffe Institute for Advanced Study – extends in crests that are 500 light-years both above and below the middle of our galaxy’s disk. The long structure stretches for 9,000 light-years total and measure 400 light-years wide. It’s the largest of its kind in our galaxy. The finding was announced Tuesday at the 235th meeting of the American Astronomical Society in Honolulu. Researchers from Harvard University analyzed data from the European Space Agency’s Gaia spacecraft, which has been measuring stars since 2013. Gaia’s data was used to create a 3D map of the Milky Way’s matter. It revealed the wave pattern in one of the Milky Way’s spiral arms that is closest to our solar system. “No astronomer expected that we live next to a giant, wave-like collection of gas – or that it forms the Local Arm of the Milky Way,” said Alyssa Goodman, the Robert Wheeler Willson professor of applied astronomy at Harvard University and co-director of the Science Program at the Radcliffe Institute of Advanced Study. “We were completely shocked when we first realized how long and straight the Radcliffe Wave is, looking down on it from above in 3D, but how sinusoidal [defining the shape of a wave] it is when viewed from Earth. The Wave’s very existence is forcing us to rethink our understanding of the Milky Way’s 3D structure.” New image reveals explosive history of Milky Way's center Previously, the nurseries of star formation in this wave-like structure were thought to be part of “Gould’s Belt.” This band included regions of star formation thought to be arranged in a kind of ring around the sun. “Instead, what we’ve observed is the largest coherent gas structure we know of in the galaxy, organized not in a ring but in a massive, undulating filament,” said João Alves, professor of stellar astrophysics at the University of Vienna and former Radcliffe Fellow. “The Sun lies only 500 light-years from the Wave at its closest point. It’s been right in front of our eyes all the time, but we couldn’t see it until now.” And as it turns out, we actually interact with this wave. The Milky Way's black hole kicked a star out of our galaxy “We don’t know what causes this shape but it could be like a ripple in a pond, as if something extraordinarily massive landed in our galaxy,” Alves said. “What we do know is that our Sun interacts with this structure. It passed by a festival of supernovae as it crossed Orion 13 million years ago, and in another 13 million years it will cross the structure again, sort of like we are ‘surfing the wave.’ “ The 3D map could just be the beginning for other new discoveries in our galaxy. Although we live in the Milky Way, it can be difficult to study because of gas and dust that obscures the view from our vantage point in the galaxy. This week, NASA shared a new infrared image that cuts through the gas and dust to look in detail at the center of our galaxy. The image reveals more than 600 light-years and allows astronomers to better study the formation of massive stars and the diet of the black hole at the galactic center. The perspective was possible because of the Stratospheric Observatory for Infrared Astronomy, or SOFIA, the world’s largest airborne telescope. “It’s incredible to see our galactic center in detail we’ve never seen before,” said James Radomski, a Universities Space Research Association scientist at the SOFIA Science Center at NASA’s Ames Research Center in California’s Silicon Valley. “Studying this area has been like trying to assemble a puzzle with missing pieces. The SOFIA data fills in some of the holes, putting us significantly closer to having a complete picture.” © 2023 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network. ",
    "datetime": "2020-01-07T21:39:38Z",
    "url": "https://www.cnn.com/2020/01/07/world/new-milky-way-map-scn/index.html"
}