{
    "title": "Autoneum fined $224K by Indiana OSHA after worker fatality",
    "text": "By: Elizabeth Beilman, News and Tribune JEFFERSONVILLE, IN (NEWS AND TRIBUNE) — A Jeffersonville automotive manufacturing facility has been fined $224,000 by the Indiana Occupational Safety and Health Administration for five alleged safety violations following the death of an employee in October. Autoneum North America Inc., an international automotive supplier, must either pay the fines or contest the violations 15 business days from the order that was issued on Nov. 15. Melissa Stephens, 44, died after an incident with a machine at the plant on Saturday, Oct. 21, according to a previous News and Tribune report. The preliminary cause of her death was ruled multiple blunt force trauma, but a final cause has not yet been determined, according to Clark County Coroner Billy Scott. The safety order and violations resulted from an investigation at the River Ridge Commerce Center facility that began Oct. 23. A spokeswoman for IOSHA confirmed it opened an investigation when it received word of a fatality. \" ... IOSHA believes that had the appropriate safety precautions been in place, the fatality would not have occurred,\" spokeswoman Molly Deuberry stated in an email. Two of the violations were deemed to cause a \"high probability of death or serious harm,\" she said. These violations, totaling $14,000, were a failure to establish and maintain safe work conditions through employees' exposure to being caught in rotating machine parts due to loose clothing; and lack of effective training on hazardous power sources, such as power from moving belts, that could cause employees to become caught or pinched by machinery. The remaining three were violations that Autoneum \"knowingly [committed] with plain indifference to the law; the employer either [knew] action is a violation or [was] aware of hazardous conditions with no effort to eliminate,\" Deuberry stated in reference to the type of violation found. These violations, totaling $210,000, were inadequate procedures in identifying how to control the belt and pulley power and how to stop it; failure to properly guard pulleys that were 7 feet or less from the floor or work area; and failure to properly guard rotating belts from employees. When asked whether Autoneum has challenged the violations, Deuberry replied that the deadline to contest has not yet closed. A request for comment from Autoneum, whose media requests are handled by its Switzerland headquarters, was not answered by press time. In addition to paying or challenging fines, Autoneum must show through written reports to IOSHA how it is correcting the actions that led to the violations. IOSHA may perform a followup inspection in an instance such as this one, according to the safety order sent to Autoneum. Failure to correct these violations may result in additional fines for each day they have not been corrected. The penalties handed down at the Jeffersonville facility aren't the first for the automotive company. In January, OSHA fined one of Autoneum's Ohio facilities $569,463 for five violations, which are under contest by the company. According to an article published by the Toledo Blade, the fines came from an investigation following an employee losing his hand and part of his arm while at work. That facility, as well as three others, were fined for a total of 33 violations by OSHA within the last four years (not including the Jeffersonville violations), according to data on OSHA's webpage. Fine amounts were lowered in every one of those cases that is now closed, and OSHA didn't impose any fines for failure to correct these violations. IOSHA has no previous investigations of Autoneum, which also is a minority shareholder in a Valparaiso location. The company's 305,000-square-foot facility started production at River Ridge in 2016. It plans to add 144,000 square-feet of space to the existing plant. The company, which specializes in vehicle acoustic and thermal management systems, has 50 locations in more than 20 countries and employs more than 11,000 people. Autoneum released the following statement Wednesday on behalf of Anahid Rickmann: \"Autoneum confirms the receipt of the \"Safety Order and Notification of Penalty\" issued by the Indiana Occupational Safety and Health Administration. We plan to attend an informal conference with OSHA to discuss the penalty. Autoneum complies with occupational health and safety regulations and is committed to the highest local and international standards in this area. Our health and safety management system is a framework integrating international and national laws and regulations and the requirements of the international Occupational Health and Safety Management System OHSAS 18001. As a global manufacturing company, we constantly monitor our production procedures and define necessary actions to ensure a safe working environment. As an example, our production staff is regularly trained at all locations on occupational risks and hazards. This includes the correct operating of machinery and equipment. In North America, we run the SafeStart training program aiming explicitly at production staff. Focus of this training program is the key types of at-risk behavior and the core elements of safe behavior that decisively influence safety in production.\" Copyright 2017 News and Tribune. All rights reserved. ",
    "datetime": "2017-11-28T04:11:17Z",
    "url": "https://www.wave3.com/story/36935876/autoneum-fined-224k-by-indiana-osha-after-worker-fatality/"
}