{
    "title": "Bae Suzy’s new look will surely make a way into your hearts! | Macau Business",
    "text": "SINGAPORE – Media  OutReach – 6 October 2021 -DAEBAK! Bae Suzy has a new look and is looking  gorgeous at the new K-Wave zone in Madame Tussauds Singapore. Her blue dress  was inspired from an outfit that she had worn at the press conference of the  movie, Baekdu Mountain (Ashfall).    “Not only being one of the most popular actresses in South  Korea, Suzy is also one of the most popular wax figures in Madame Tussauds  Singapore, and we are very happy to give her a new fresh look. We will also be  launching more new figures and experiences to the attraction in the next couple  of months,” says Alex Ward, General Manager of Madame Tussauds Singapore.    Visitors will be able to play a fun game and take selka  with a special filter for Instagram stories. Simply follow @mtssingapore on  Instagram, use the Instagram Filter and check out which Bae Suzy’s character  are you.  Suzy is one of the most popular actresses in South Korea. After  her film debut in 2012, Suzy was nicknamed Korea’s first love. Since then, she  has appeared in the cinema office smash “Ashfall” in 2019 as well as  the popular TV dramas “Vagabond” in 2019 and “Start-Up” in  2020.  Head down to Madame Tussauds Singapore to experience the  wonderful ambience of Korea, with romantic cherry blossom tree and traditional  hanoks as your backdrop. Receive exclusive prizes worth up to $20 proudly  sponsored by Shiseido when you play the game and flash it to the staff!  Madame Tussauds Singapore’s K-Wave zone is also a home to  other Korean celebrities including: Park Hae-jin and Song Seung Heon. More  figures will be added to the zone given the highly raved Korean popular  culture.  For high res images: https://bit.ly/mtsgbaesuzy  The ultimate celebrity experience and the world’s best known and most popular wax attraction. There are currently 23 Madame Tussauds attractions around the world.  Each of the attractions is unique and tailored to the host city and visitor demographic to feature both local as well as international figures.  The result of 200 years of expertise and painstaking research every figure takes Madame Tussauds’ gifted sculptors a minimum of three months to make, and costs more than $300K (Singapore dollars). Most contemporary figures are also produced following sittings with the celebrities themselves.  Madame Tussauds SingaporeTwitter: @MTsSingapore Instagram: @MTsSingapore Facebook: @MadameTussaudsSingapore Hashtag: #MadameTussaudsSG    ",
    "datetime": "2021-10-05T16:50:00+00:00",
    "url": "https://www.macaubusiness.com/bae-suzys-new-look-will-surely-make-a-way-into-your-hearts/"
}