{
    "title": "Bagaimana Awal Perkembangan K-Wave yang Mempengaruhi Pertumbuhan Ekonomi Korea Selatan - Kompasiana.com",
    "text": "Saat kamu sudah memulainya, maka kamu siap dengan tantangannya. Selanjutnya Tutup Korea selatan adalah salah satu negara yang terletak di kawasan Asia Timur dengan budaya, tradisi yang kental serta seni dan hiburan yang luar biasa. Tidak heran jika banyak wisatawan tertarik untuk menjelajahi berbagai tempat wisata di Korea Selatan. K-Wave Merupakan gelombang yang membawa produk budaya dan hiburan dari Korea Selatan diatas puncak ketenaran ke penjuru dunia. Untuk pertama kalinya dalam sejarah, pada awal tahun 2020 film berbahasa non-inggris yaitu Parasite yang berasal dari Korea Selatan menang piala Oscar kategori film terbaik. Negara yang dulu memiliki nasib sama seperti Indonesia, yang dijajah oleh negara jepang dan dilanda krisis tahun 1997-1998, sekarang menjadi pemeran utama dalam industri hiburan dunia. Pada tahun 1960-1980, korea selatan dikuasai oleh rezim militer otoriter yang mengandalkan industri berat seperti otomotif, kimia dan elektronik. Sementara itu, bisnis dan hiburan sangat dibatasi, hingga akhirnya tumbuh setelah pintu kebebasan sipil mulai dibuka sejak awal tahun 90an. Di era tersebut dipimpin oleh presiden Kim Young-sam dari kalangan sipil pertama setelah rezim militer lengser. Pemerintah Korea Selatan akhirnya membuat tiga kebijakan penting yang memudahkan bisnis hiburan dan budaya berkembang yakni perubahan sensor, pengurangan pembatasan perjalanan dan kemauan untuk diversifikasi ekonomi. Menurut laporan penasehat Sains Dan Teknologi Korea Selatan, pendapatan film Jurassic Park setara dengan pemasukan ekspor 1.5 juta hyundai sebagai mobil Nasional kebanggaan orang Korea Selatan, serta menandai peralihan fokus pemerintah ke industri budaya dan hiburan. Tidak heran jika usaha memasarkan musik, drama dan film korea ke pasar internasional bisa dilihat mulai pada dekade 90an. Pada tahun 1992 grub musik Seo Taiji Boys yang didaulat sebagai pionir grup musik pop Korea Selata. meluncurkan single perdananya \"I Know\" yang digandrungi anak muda pada masa itu. Selanjutnya pada tahun 1997 drama korea \"What Is Love All About\" mulai tayang di televisi china CCTV. Dua tahun kemudian tepatnya pada tahun 1999, film layar lebar \"Shiri\" rilIs di bioskop dan ditonton sekitar 5.8 juta orang di korea selatan, pecahkan rekor yang sebelumnya dipegang oleh Titanic. Tiga raksasa perusahaan hiburan di Korea Selatan yakni SM Entertaiment, YG Entertaimen dan JYP Entertaiment juga didirikan pada akhir dekade 90an. Tiga perusahaan hiburan inilah yang kemudian melahirkan artis ternama seperti Girls Generation, EXO, Bigbang, Twice sampai Blackpink.  Masuk pada dekade 2000an, industri hiburan dan budaya Korea Selatan semakin mendunia. Winter Sonata laris manis di Asia Dan Timur Tengah. Bahkan di Indonesia, drama seri ini ditayangkan ulang beberapa kali. Pada 2012, \"Gangnam Style\" dari PSY, jadi video pertama yang diputar lebih dari 1 miliar kali di Youtobe. Enam tahun kemudian, BTS jadi artis Korea Selatan pertama yang mencapai peringkat pertama Billboard Artist 100 (one hundred). Dan untuk pertama kalinya grup perempuan Korea tampil di Coachella yaitu Blackpink.  Dampak Ekonomi Korean Wave atau biasa disebut Hallyu adalah arus besar musik, film dan acara TV Korea Selatan ke dunia Barat. Hallyu telah membantu menghasilkan jumlah yang luar biasa bagi ekonomi Korea Selatan terutama dengan seberapa cepat pertumbuhannya, dan ini jelas telah menghilangkan tekanan ekonomi Korea Selatan akibat krisis keuangan Asia 1997. 'Parasite' menjadi film Korea Selatan terlaris pada tahun 2019, memperoleh US$ 258 juta di seluruh dunia. 'Parasite' kemudian memenangkan empat Academy Awards termasuk Film Terbaik, Sutradara Terbaik dan Skenario Asli Terbaik. Semua bagian Hallyu jelas telah mendorong ekonomi Korea Selatan dengan mengembangkan ekspor senilai US$ 9,48 miliar. Hasil perdagangan dari Barang-barang K-Pop membuat penambahan yang cukup signifikan terhadap jumlah yang terus bertambah. 23% dari pendapatan BigHit Entertainment, perusahaan K-Pop yang menjadi bagian dari BTS, berasal dari pendapatan merchandise, diperkirakan sekitar US$ 114,5 juta. Selain itu, ketenaran dari artis-artis Korea dimanfatkan untuk mempromosikan produk-produk asal Korea Selatan yang akhirnya menambah pendapatan ekonomi Negeri Gingseng sekitar US$ 3,6 miliar Salah satu dukungan grup K-Pop yang lebih dikenal adalah antara Korean Air (maskapai penerbangan nasional Korea Selatan) dan grup K-Pop SuperM. SuperM, terdiri dari 7 anggota yang membuat video keselamatan futuristik untuk maskapai Korea Selatan, memberikan informasi tentang fitur keselamatan pesawat Korean Air, di samping lagu asli dan koreografi yang dibuat khusus untuk video tersebut. Pada tahun 2020, pendapatan Korean Air mencapai US$ 11,2 miliar dengan pendapatan operasional $228 juta. Untuk pariwisata sendiri, pada 2019, Korea Selatan membawa rekor jumlah sekitar 17,5 juta pengunjung. Perjalanan ke Korea Selatan untuk rekreasi dan pariwisata pada tahun 2017 menghasilkan ekonomi 59,83 triliun won Korea Selatan.  Pada 2017 pendapatan ekspor konten budaya Korea mencapai US$ 6,7 milyar. Dari jumlah tersebut, game online menyumbang pendapatan hingga US$ 3,77 milyar. Sektor musik menduduki peringkat 4 dengan sumbangan pendapatan US$ 500 juta. Adapun animasi memperoleh US$ 135 juta, periklanan US$ 102 juta, film US$43 juta, dan kartun US$40 juta. Konser K-Pop adalah cara yang sangat berguna untuk meningkatkan pendapatan bagi ekonomi Korea Selatan. Pada Oktober 2019, BTS mengadakan tiga konser di Seoul Olympic Stadium sebagai bagian dari tur 'Love Yourself: Speak Yourself [The Final]'. Tiga malam ini saja diperkirakan menghasilkan pendapatan 922,9 miliar won Korea Selatan. Baru-baru ini, BTS telah mengadakan konser online karena pandemi dan ini juga menghasilkan uang yang cukup besar. 'Map of the Soul: ONE' ditonton oleh 993.000 orang di 191 negara dan menghasilkan pendapatan lebih dari 50 miliar won Korea Selatan selama dua hari siaran langsung. Dari hal ini kita bisa melihat jelas bahwa K-Pop memberikan kontribusi besar bagi sistem ekonomi Korea Selatan. Menurut Yayasan Korea untuk Pertukaran Budaya Internasional, \"Gelombang Korea\" dari K-Pop, drama TV dan game menyumbang USD 9,5 miliar untuk ekonomi Korea Selatan pada tahun 2018.  ",
    "datetime": "2021-07-05T15:02:29+0700",
    "url": "https://www.kompasiana.com/sunariomangera2531/60e2bc951525105f7d68ea02/awal-ketenaran-k-wave-yang-mempengaruhi-pertumbuhan-ekonomi-korea-selatan"
}