{
    "title": "Bain Capital takes Gangnam style to China | Alternatives | AsianInvestor",
    "text": "The “Korean wave” of cultural influence, or hallyu in Korean, is taking Asia by storm. In China alone, Korean K-drama actors like Song Joong-ki and YoonA and members of Korean boy bands like EXO are A-list celebrities. Private equity firm Bain Capital plans to ride that wave, using Korean brands’ popularity to sell the products of its portfolio companies to China’s burgeoning middle class. “Koreans have become leaders in developing new products, new technology, new ways to consume, ways to improve one’s own self-image and wellbeing,” said Jonathan Zhu, managing director of Bain Capital, in an interview with FinanceAsia, a sister publication to AsianInvestor. Global cosmetics firms have invested in Korea's skincare sector, such as Estée Lauder which bought an interest in Have & Be, the South Korean company behind skincare brands Dr Jart+ and Do The Right Thing back in 2015. L Catteron, backed by LVMH, bought a stake in Korea's Clio in 2016. Bain Capital is in the midst of buying a controlling stake in Hugel, a South Korean medical beauty firm that produces botulinium toxin, the anti-wrinkle treatment, for W927.4 billion ($830 million). The Boston-based firm struck a deal in April to pay W354.7 billion for 985,217 new shares in Hugel and W99.9 billion in convertible bonds. Bain Capital is also buying 100% of Hugel’s controlling shareholder Tongyang HC, for W472.8 billion. Hugel is Bain Capital’s second investment in Korean medical beauty sector, after it invested in Carver Korea last year alongside Goldman Sachs. Carver is growing fast in China. China's medical beauty sector had a market size of about Rmb75 billion in 2015, according to equity research analysts at China Galaxy Securities Research. Within that, the injectable products segment was growing at 40% annually and surgical procedures expanding at 20% annually. The following transcript has been condensed and edited. Q  Why are you investing in Hugel? A  When we look broadly at Asian countries, consumption is a major investment theme. What we’ve noticed is that as income levels rise, people’s focus shifts from basic needs: food, apparel, shoes and so forth, towards lifestyle, health and wellness. Koreans on average spend more time on how they look, and I think how they look affects how they feel about themselves. As a result, Koreans have become leaders in developing new products, new technology, new ways to consume, ways to improve one’s own self-image and wellbeing. [Carver’s home page proclaims: We think cosmetics can change people’s lives. They not only give you a new look, but also make you feel more confident and happier as you go out into the world.] This consumption theme is tied to K-pop, Korean soap operas and so forth. The phenomenon has had an interesting level of influence on countries outside of Korea, like China, and Vietnam. So we are looking to capitalise on that theme and have made two investments. Q  Is the strategy with the Korean investments to expand them in China? And is it expensive to effectively buy the rights to their brands in China? A  Carver Korea continues to penetrate the market in Korea, but the appeal of the brand of the products is not limited to Korea. The Chinese market is bigger, so therefore very attractive to us. We have substantially expanded Carver’s e-commerce platforms so the products are now sold on major e-commerce platforms in China. Ever since we started, we took over the business we have very much focused on completing applications for approval. We have already received approval for more than a dozen products. So within the next 12 months we should be able to double or even triple the approved products in China. The offline, regular import channel is a substantially broader channel than the cross-border e-commerce channel. We are confident we can achieve further growth in China because we have this bigger wider channel to pass through. Q  Are you concerned about the clamp down by regulators and the bad press following a series of botch jobs involving treatments such as blood transfusions to boost vitality, stem cells from umbilical cords used in anti-ageing therapies, liposuction and breast enhancements? There has been at least one death linked to a stem cell procedure gone wrong in Shanghai. A  First of all we need to make sure that our products are effective and safe. Secondly, only after receiving approvals from Chinese regulators will we sell products into the market aggressively. We also need to make sure we educate both the consumers and the medical staff in the proper use of the products. Q  Is the barrier to entry high enough to warrant investment in a premium brand? A  We’ve invested in both instances in sizeable, established businesses in terms of existing and future products. Carver Korea now has almost $200 million of Ebitda [earning before interest, tax, depreciation and amortisation]. To get this kind of scale is not easy – in the case of Hugel, there is a very high hurdle to entry, it is one of only a very small number to develop botulax on its own and win approval to market the product. That being said, you can never bet on other people not getting into the market – so the bet always has to be that you have good products, you continue to innovate and build out good products in the future. You can do all the advertising and branding you want – if the product is not effective, you won’t be able to succeed in the long term. Q  As an investor how do you evaluate the more invasive surgery sector? A  We have looked at very high-end medical businesses. We have invested in APMG (Asia Pacific Medical Group), which has a full medical licence. I was actually at one of the APMG Hospitals recently, and we performed a complicated brain surgery to remove a tumour in the blood vessel inside the brain. If somebody is going to undergo brain surgery that person is not going to just believe in some internet-based advertising -- you need to have a long and proven track record in order to gain the confidence and trust of patients. You need to have the right facilities, highly trained doctors to perform these procedures, without that kind of capability; the barrier to entry is huge We think today there is a shortage of supply of doctors in China and that is one of the reasons why we are interested in the market. Cosmetic surgery is an emerging field, because 10 or 20 years ago, you would have no cosmetic surgery business to speak of in China. People who had cosmetic surgery were probably people who had gone through some trauma, such as accidents that caused disfigurements. China, generally, is still short on medical resources and so public hospitals tend not to focus on these kinds of areas. There are still a pretty small, limited number of specialty cosmetic hospitals, and obviously a much larger number of cosmetic clinics. A lot of Chinese consumers still travel overseas to receive cosmetic treatments, so our expectation is that soon there is going to be more demand, and therefore people will try to find a way to meet that demand. Q  How do you regard the digital medial sector? A  Internet-based diagnostics is an area we spend a lot of time evaluating. There are certain things that can be performed remotely over the internet, let’s say for example a computer using AI which can read an MRI scan quite well. But then again, a computer may very well be able to tell me that there is some abnormality in my lung, but what exactly is it and what do I need to do about it? Medicine, both diagnostics and treatment, is highly regulated. So I would say that in the future, what AI is going to be able to do in terms of medical diagnosis and treatment is very much a function of what the governments will allow. We are not just going to rush into it without a pretty good understanding of what regulatory framework will be in place for these kinds of businesses. Additional reporting by Katya Yan and Jill Mao ",
    "datetime": "2017-07-12T22:29:00.000Z",
    "url": "https://www.asianinvestor.net/article/bain-capital-takes-gangnam-style-to-china/438052"
}