{
    "title": "BBC Radio 1 and BBC Sounds podcast to tell the story of K-Pop through the eyes of its fandom  - Media Centre",
    "text": " The podcast will explore the K-Pop powerhouse, from the role the BTS army has played and female K-Pop stars, to the gruelling training regime of a K-Pop icon, its popularity in the UK and its future K-Pop: A Stan Story will chart the global phenomenon that is K-Pop from the point of view of six die-hard fans and is available on BBC Sounds from today. Over eight episodes, the series will trace the evolution of the South Korean music genre from its beginnings in South Korea to its rise up the music charts to catapulting into mainstream global culture. Hosted by journalist Lucy Ford, the podcast will explore the K-Pop powerhouse, from the role the BTS army has played and female K-Pop stars, to the gruelling training regime of a K-Pop icon, its popularity in the UK and its future. Lucy will hear from the stans about the impact K-Pop has had on their lives, some of K-Pops biggest names, experts in the K-Wave space and Radio 1’s Adele Roberts who played K-Pop band BTS for the first time on Radio 1. Lucy Ford says: “I'm so excited to be hosting this series which looks at the history of K-pop, its place on the global stage and the real-life experiences of the people who love it - the stans! A lot of conversations about K-pop mischaracterise or leave fans out of the equation altogether, so I'm really thrilled to be centring them in this conversation and letting them be the ones to tell their stories! “Having been a huge K-pop stan for so long, it's amazing to be a part of sharing with the world why it's so meaningful and fun for fans, and maybe (just maybe!) convert a few more newbies in the process.” Adele Roberts says: “In 2017, I gave BTS its first play on Radio 1, marking the beginning of my journey of discovering K-Pop, meeting stans and icons and even travelling to South Korea. Of all aspects of K-Pop, for me it’s the fans that make this movement so special; the feeling of togetherness, kindness and inclusion that they embody is just incredible. “It’s like a close family that just happens to be spread across the planet! As the podcast shows, K-Pop is a global movement and I can’t wait for listeners to hear how it has evolved and continues to evolve.” FW Episode Guide - Listen here Episode 1: Oppan Gangnam Style! Ten years ago, Psy’s Gangnam Style sent K-Pop viral. Lucy and six devoted Stans discuss the lasting impact of that watershed moment for Korean music in the West. Episode 2: Hallyu! For 30 years, the Korean Wave - Hallyu - has been on the rise and this episode traces its origins with contributions from the first K-Pop band, H.O.T, who were signed by SM Entertainment in 1996. Kangta, one of the members of H.O.T says: “One day, someone from SM Entertainment spotted me on the street and gave me a business card. This is called ‘road casting’ in Korea. So I contacted the company, passed the audition, and debuted as a singer. “When our Chief Producer Soo-Man Lee offered us to go abroad, I could not imagine at all we would be popular outside of Korea as well.” Episode 3: Bangtan Boys! Bangtan Boys AKA BTS are the biggest boyband on the planet. Here Lucy explores their success and meets some of the influential of the BTS Army. Episode 4: Girl Power As well as boy bands, there has been an explosion of K-Pop girl bands and icons; this episode looks at the specific challenges they face as women in K-Pop. Episode 5: Icons Becoming a K-Pop idol is no easy feat and even if you make it through the long and difficult training process, there’s no guarantee of success. Lucy finds out what it really takes to break through in the Korean music industry. She hears from Shreya Lenka, India’s first K-Pop star who is in girl group, Black Swan. Shreya Lenka says: “A day is full of practice and schedules. We will have Korean classes in the morning and then go to the studio and then we will start practicing. In practice, we used to do workouts, we’d run and sing the song to make our voice stable. Then we would practice dance and sing the song live. I’d then go home and learn Korean at night and complete my homework and sleep at three and wake up at seven.” Episode 6: K-UK! The Korean Wave is thundering through the towns and cities of the West - and the UK is no exception. From Brighton to Betws-y-Coed, the days of K-pop as a niche concern are over. Lucy chats to stans and experts about the mainstreaming of K-culture in Britain. Episode 7: Army Fandoms are a huge part of K-Pop and this episode looks at the role they play in influencing mainstream culture and making a difference in the political and social space. Episode 8: Future The podcast concludes with a look to the future of K-Pop, and asks our stans what their fandom might look like in 2023. ",
    "datetime": null,
    "url": "https://www.bbc.com/mediacentre/2022/bbc-radio-1-podcast-story-of-k-pop"
}