{
    "title": "Best South Korean Movies and Shows to Stream on Netflix Right Now",
    "text": "Jump to South Korean movies and TV shows are gaining massive popularity on Netflix. It's the latest chapter of the new \"Korean Wave\" phenomenon, frequently dubbed \"Hallyu.\" 2020 revitalized the Korean Wave, from \"Parasite's\" historic Oscar sweeps to BTS's latest single \"Dynamite.\" \"Nothing happens overnight,\" Ju Oak Kim, an Assistant Professor of Communication at Texas A&M International University, told Insider. When it comes to shows and movies, she explained that the \"quality of Korean dramas and movies have improved overall\" over time. She added that storylines in so-called \"K-dramas\" and films are different from what American audiences are accustomed to, but can still be embraced by audiences universally. If you want to find your next binge-watch, here are 11 South Korean shows and movies that US audiences should check out on Netflix. \"#Alive\" is a zombie film that follows the story of Joon-woo and Yoo-bin who must fight their infected zombie neighbors after wireless networks and phone service is cut off. The South Korean zombie film stars A-listers Yoo Ah-in and Park Shin-hye, who have respectively built successful careers for themselves since debuting as child actors. The movie grapples with solitude and fear with lots of \"K-Zombie\" action that will keep you on the edge of your seat. \"#Alive\" was immediately met with massive popularity from US Netflix audiences. The zombie thriller ranked fourth on Netflix's US Top 10 list only a day after its release. The script was adapted by the film's director Cho Il-hyung and Matt Naylor, and based on Naylor's upcoming horror film \"Alone.\" In the process of putting together what is now \"#Alive,\" the creators of the film changed the title from \"Alone\" to \"Alive.\" Cho said in an interview with South Korean film magazine Cine21 that he felt that the message that \"two people must be alive together\" was the most important takeaway, hence the name change. \"Kingdom\" follows the story of a Korean Kingdom as it tries to battle the spread of a mysterious disease. If \"#Alive\" got you hooked on zombie films, you have to watch this K-drama series that will give you more than its fair share of zombies. The series released its second season in 2020 after gaining massive popularity with its first season last year. \"Kingdom\" popularized the term \"K-Zombie,\" Hong Seok Kyeong, Professor of Communication at Seoul National University, told Insider. The movie is set in a \"kingdom\" of the Chosun dynasty, and stars Ju Ji-hoon, Ryu Seung-ryong, and Bae Doona, who is no stranger to Hollywood fame with roles in \"Cloud Atlas\" and \"Sense8.\" \"Itaewon Class\" centers on protagonist Park Sae-roy's revenge after he loses his father in a tragic accident. He eventually sets out to take down the CEO of a food conglomerate that he believes is responsible for his father's death. Each of the characters' storylines spans 15 years, from adolescence to adulthood. Many members of the cast won critical acclaim for the show. Actor Park Seo-joon was nominated for best actor, Yoo Jae-myung for best supporting actor, Kwon Nara for best supporting actress, and Ahn Bo-hyun for best new actor at the prestigious Korean Baeksang Arts Awards. Actress Kim Da-mi was also named best new actress at Baeksang for her role. The television drama series also features a song by BTS member V, who is known to be a close friend to lead actor Park Seo-joon. \"Crash Landing on You\" is a romantic comedy that follows a South Korean heiress who accidentally paraglides herself into North Korea to eventually meet the love of her life. This romantic comedy is full of cute, heart-warming scenes that will make you feel fuzzy. The lead actress and actor in this drama, Son Ye-jin and Hyun Bin, are two of the biggest stars in South Korea. If you want to watch more dramas and films with Son and Hyun on Netflix, you might try watching \"Something in the Rain\" (a romance starring Son Ye-jin and Jung Hae-In) or \"Memories of the Alahambra\" (a sci-fi drama starring Hyun Bin and Park Shin-hye). The \"Reply\" drama series has three shows to date: \"Reply 1997,\" \"Reply 1994,\" and \"Reply 1988.\" Each show is set during a certain era (1997, 1994, 1988, respectively). This franchise — created by star producer and writer duo Shin Won-ho and Lee Woo-Jung — has garnered a large fanbase. All three shows are similar to \"How I Met Your Mother\" in the sense that audiences will keep guessing which relationships will and won't eventually work out. And while it's very fun to guess who will fall in love with each other, the focus of the series is on family, community, and growing up. Although each show is similar in terms of theme, style, and format, each season has a different set of characters and new storylines. \"It's a very unique approach to a television series,\" Hong told Insider. \"The concept of the show is maintained throughout, but it's not that all of the shows are led by the same characters.\" \"Hospital playlist\" focuses on five college friends who attended the same medical school and are now working together at the same hospital. When they're not saving lives in the ER, they play in a band to reminisce about their college days. If you liked the Shin and Lee's \"Reply\" series, you'll likely enjoy this one from them as well. \"Hospital Playlist\" gained massive popularity in South Korea. The show was renewed for a second season that is expected to release in 2021. Bonus for K-pop fans: This series has a number of songs where current K-pop artists sing South Korean throwbacks from the '90s and early 2000s. \"My Mister\" follows the story of a young 20-something woman just starting out in her career who finds companionship and mentorship with her middle-aged coworker. They navigate their respective hardships and challenges together. This drama is incredibly heartwarming, but you may need to prepare tissues since it's a tear-jerker. The show will make you question what it means to be a good adult. This K-drama stars \"Parasite\" actor Lee Sun-Kyun and one of K-pop's biggest stars IU in the lead roles. \"Okja\" follows the story of a young South Korean girl who raises a massive \"super pig\" only for that pig to be taken away by a giant food conglomerate. The girl must set out to save her friend from slaughter.Directed by Bong Joon Ho, \"Okja\" is an action-adventure film that showcases talent around the world. Scottish actress Tilda Swinton, American actor Jake Gyllenhaal, South Korean-American actor Steven Yeun, and \"Parasite\" actor Choi Woo-shik are among those in this star-studded cast. The film was nominated for a Palme d'Or in 2017 and was named as one of the most influential films of the decade by the New York Times in 2019. \"Romance is a Bonus Book\" follows the story of Kang Dan-i who, following her divorce, decides to return to work after taking a break from her successful career as a copywriter to focus on raising her child. She moves in with her longtime friend Cha Eun-ho, who is a high-profile author at the publishing company where she is employed. This show is a beautiful romantic comedy with lots of dreamy scenes that remind you of a fairy tale. Plus, the soundtrack for this show will make you feel as fuzzy and warm as the show itself. \"Record of Youth\" is a fun romance that follows the story of Ahn Jeong-ha and Sa Hye-jun who lean on each other as they navigate their careers as a makeup artist and a model, respectively. Starring \"Parasite\" star Park So-dam and \"Reply 1988\" star Park Bo-gum, this show follows a cute romance that will be particularly engaging for K-pop fans. Ahn is a longtime fan of Sa, and the show gives a good amount of reference to South Korea's fandom culture. The soundtrack for \"Record of Youth\" is stacked with K-pop stars, including songs from SuperM's Baekhyun, SEVENTEEN's Seungkwan, Chungha, and Mamamoo's Whee In. Disclosure: Mathias Döpfner, CEO of Business Insider's parent company, Axel Springer, is a Netflix board member. Read next ",
    "datetime": null,
    "url": "https://www.insider.com/best-south-korean-movies-shows-to-stream-on-netflix"
}