{
    "title": "BRANDSTARS Announces ‘2022 Korean Wave Brands (KWB)’ | Business Wire",
    "text": "SEOUL, South Korea--(BUSINESS WIRE)--The representative brands for each category of ‘2022 Korean Wave Brands (KWB)’ hosted by the BRANDSTARS Selection Committee have been announced. Marking the fifth anniversary this year, this event to select and announce the representative Korean Wave brands concurrently through major media outlets in China and Southeast Asia is aimed at helping consumers make better choices by providing accurate information to overseas consumers. As the brands representing each industry, Samsung Electronics’ Samsung Galaxy Z Fold4 and Z Flip4, Hyundai Motor Company’s IONIQ5, LG Electronics’ OLED TV and TROMM, Dong-A Pharm’s Bacchus were selected. In the shopping category, Lotte Department Store and The Shilla Duty Free were again selected this year. In the entertainment category, BTS and Extraordinary Attorney Woo, which are leading the popularity of K-pop and K-drama respectively, were selected. In the tourism and performance categories, Jeju Special Self-Governing Province and Jeju Sky Water Show were on the list, respectively. Amorepacific’s Sulwhasoo and LG Household and Health Care’s The History of Whoo were selected in the category of K-beauty cosmetics, and OLIVE YOUNG was chosen for the category of health and beauty shop. In functional cosmetics, organic cosmetics, and mask pack categories, Skin79, Coszone Make9, and Scanco Ballon Blanc were selected respectively. In healthcare category, CheongKwanJang, a leading health functional food brand specializing in red ginseng, and FromBIO, a functional food company, were selected. In the category of health examination, Samsung Medical Center was selected. The most popular K-food brands were CJ CheilJedang’s Bibigo, Binggrae’s Banana Flavored Milk, Nongshim’s Chapaghetti, Ottogi’s Jin Ramen, Paris Baguette, and ISSAC TOAST. Sinjeon Tteok-bokki and Samyang Foods’ Buldak Hot Chicken Flavor Ramen were also selected as the brands representing spicy flavors. In the K-fashion category, NOS7, a brand launched by Son Heung-min, and Gentle Monster, a sunglass brand, were selected. In Brand K category, a joint brand representing Korea, Funshine Optatum, a fabric perfume brand, and Rokkiss, an organic cosmetic brand, were selected. BRANDSTARS Selection Committee\nKJ.Kim\n+82-2-544-0153\nbrandstars@daum.net The representative brands for each category of 2022 Korean Wave Brands (KWB), selected by BRANDSTARS Selection Committee, are announced. BRANDSTARS Selection Committee\nKJ.Kim\n+82-2-544-0153\nbrandstars@daum.net ",
    "datetime": null,
    "url": "https://www.businesswire.com/news/home/20221211005004/en/BRANDSTARS-Announces-%E2%80%982022-Korean-Wave-Brands-KWB-%E2%80%99"
}