{
    "title": "Brian Brodersen Officially Takes Senior Pastor Role at Calvary Chapel Costa Mesa; Position Held by Chuck Smith | Church & Ministries News",
    "text": "The Christian Post To enjoy our website, you'll need to enable JavaScript in your web browser. Please click here to learn how. SANTA ANA, Calif. – Brian Brodersen, who served as a senior pastor within Calvary Chapel's fellowship of churches in Vista, Calif., and in Westminster, London, England, was officially appointed as the successor to Pastor Chuck Smith at Calvary Chapel Costa Mesa, by an affirming vote from the congregation on Wednesday. Brodersen replaces Smith, who was a major influence in both the Jesus movement of the late '60s and early '70s and the exponential growth nationally and internationally of Calvary Chapel's network of churches, and who died after a battle with lung cancer on Oct. 3 at the age of 86. After the vote that affirms the church Boards' decision, and after giving the CCCM's midweek Bible study, Brodersen told the congregation that not only did he say \"yes\" when asked to be the pastor of the church by its Board, but also said he believes God has called him to be the church's pastor. \"Cheryl (Brodersen's wife) and I are committed to you, love you, pray for you, faithfully teach you the Word, and do all we can to minister to you and cultivate an atmosphere of Godliness, and grace and love here,\" he said. \"We're committed to being here, I told the guys we are committed to being here the rest of our lives as long as the Lord has us here.\" Brodersen, who has been involved in pastoral ministry for more than 30 years, added, \"Thank you so much for your confidence and thank you so much for your love.\" The 55-year-old pastor served extensively in missions and church planting work throughout various parts of the world. He is the featured speaker on the Bible teaching program \"Back to Basics.\" He also served as the host for a memorial tribute held for Smith, when more than 16,000 people attended the event held at a Southern California sports arena. More than 52,000 people watched \"A Tribute to Pastor Chuck\" live from 80 countries (including 420-plus simulcast churches), according to the event's webcast team. The tribute was also broadcast live nationally via Calvary Chapel's radio station, K-WAVE. The archived version of the tribute can be seen online by clicking here: http://pastorchucksmith.com/. A comment underneath a photo of Brodersen and his wife being prayed for and anointed posted on Facebook by Brodersen reads, \"Remember to keep this couple in fervent prayer, and for a pouring out of the Holy Spirit upon them. Also pray for the CCCM body. This is a huge adjustment for all…\"  Was this article helpful? Want more articles like this? Help keep The Christian Post free for everyone by making a one-time donation today. We’re sorry to hear that. Hope you’ll give us another try and check out some other articles. Return to homepage. Join thousands of others to get the FREEDOM POST newsletter for free, sent twice a week from The Christian Post. A religious liberty newsletter that is a must-read for people of faith.  The Christian Post ",
    "datetime": "2013-11-15T09:02:48-05:00",
    "url": "https://www.christianpost.com/news/brian-brodersen-officially-takes-senior-pastor-role-at-calvary-chapel-costa-mesa-position-held-by-chuck-smith.html"
}