{
    "title": "Broadband Lamb Wave Trapping in Cellular Metamaterial Plates with Multiple Local Resonances | Scientific Reports",
    "text": "Thank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\n            the best experience, we recommend you use a more up to date browser (or turn off compatibility mode in\n            Internet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles\n            and JavaScript. Advertisement Scientific Reports\nvolume 5, Article number: 9376 (2015)\n            Cite this article 3531 Accesses 25 Citations Metrics details We have investigated the Lamb wave propagation in cellular metamaterial plates constructed by bending-dominated and stretch-dominated unit-cells with the stiffness differed by orders of magnitude at an ultralow density. The simulation results show that ultralight metamaterial plates with textured stubs deposited on the surface can support strong local resonances for both symmetric and anti-symmetric modes at low frequencies, where Lamb waves at the resonance frequencies are highly localized in the vibrating stubs. The resonance frequency is very sensitive to the geometry of textured stubs. By reasonable design of the geometry of resonant elements, we establish a simple loaded-bar model with the array of oscillators having a gradient relative density (or weight) that can support multiple local resonances, which permits the feasibility of a broadband Lamb wave trapping. Our study could be potentially significant in designing ingenious weight-efficient acoustic devices for practical applications, such as shock absorption, cushioning and vibrations traffic, etc. Over the past two decades, the propagation of acoustic waves in highly dispersive materials, such as phononic crystals and acoustic metamaterials, has been intensely studied due to the possibilities of existing acoustic band gaps1,2,3 as well as anomalous dispersions associated with Dirac-like cones4,5 and near zero6,7,8,9,10,11,12 or negative13,14 group velocities. Artificial materials with these intriguing properties have found myriad potential applications, such as acoustic cloaking15,16,17,18,19, vibration isolation20,21,22,23,24,25, wave guiding26,27, acoustic energy filtering and trapping12,28,29,30, etc. For the constituent material of phononic crystals and metamaterials with contrasted properties, it is normal that stiff material has a larger mass density than that of soft one. However, it is exceptional that one material and its allotropic form of comparable densities can have very different elastic properties due to the rather different configurations on the molecular level. In nature, there are two well-known allotropes of carbon: graphite and diamond31. In graphite, carbon atoms are bonded to form a two-dimensional (2D) network composed of hexagonal rings and the resulting 2D sheets are loosely stacked via van der Waals forces. That weak bonding force between stacking sheets will lead to the crystalline instability. While in the more compact allotrope diamond, each carbon atom is bonded tetrahedrally to four other atoms, thus building up a topologically stable three-dimensional (3D) network that forms the most rigid material in nature to the best knowledge. Analogously, we can find a way to achieve ultralight metamaterials of widely varying elastic properties by evolving topologically stable and unstable cellular frameworks32,33,34,35. Exploration of elastic wave propagation in such composite cellular structures offers a new door to acoustic metamaterials with rich physics and useful functionalities, where ingenious weight-efficient acoustic devices can be designed for practical applications, such as shocking absorption, cushioning and vibrations traffic, etc. For simplicity, we only consider 2D cellular structures with two typical unit-cells which are named bending-dominated (BD) structure and stretch-dominated (SD) structure, respectively, as schematically shown in Figs. 1 (a) and 1(b). For the two square unit-cells, lengths of each side are LBDand LSD and the thicknesses of bars are tBD and tSD, except for the additional crossing bars in the SD structured unit-cell with the thickness being . We choose steel as the constituent material for which the material density, longitudinal wave velocity and transverse wave velocity are ρs = 7850 kg/m3, cl = 6145 m/s and ct = 3095 m/s, respectively. It needs to be mentioned that the fabrication of cellular steel frameworks can be made possibly by projection microstereolithography or 3D metal printing35. The relative densities of BD and SD structured unit-cells in Figs. 1(a) and 1(b) are concisely expressed as and Here, the relative density is defined by the density of cellular structures over the density of steel, where the detailed derivations can be found in the \nSupplementary Information\n. In the following simulations, we set LBD = LSD = L = 2 mm as an example, with the thicknesses of bars tBD and tSD both tunable parameters for tailoring the relative densities of BD and SD structured unit-cells. The schematic diagram of two typical unit-cells. Unit-cells of (a) the bending-dominated (BD) structure and (b) the stretch-dominated (SD) structure. Pin-jointed frameworks of (c) the BD structure and (d) the SD structure for analyzing the stability of cellular unit-cells. The inset is the irreducible Brillouin zone. The BD and SD structured unit-cells can be further simplified into pin-jointed frameworks with locked joints, which are shown in Figs. 1(c) and 1(d), respectively. Their topological stability can be judged by a simple yet fundamental rule: Maxwell's stability criterion35: where s and j are the numbers of struts and joints. For the BD structured unit-cell [Fig. 1(c)], M = −1  0. The structure becomes both statically and kinematically determinate, indicating the SD structure is much stiffer than BD one in the prescribed directions due to the fact that the crossing bars can carry tension or compression when an external force is applied. In elastic mechanics, the stiffness of a solid material can be characterized by its elastic moduli or the associated elastic wave velocities. In order to investigate the effective mechanical properties of BD and SD structures in the long wavelength condition, we have calculated the band structures of 2D periodic superlattices with BD and SD structured unit-cells and further obtained the effective longitudinal and transverse wave velocities in all directions by using νl(t) = ωl(t)/kl(t), where kl(t) → 0. During the calculation, the relative densities of BD and SD structures are set to be , while the magnitude of Bloch wave vector |kl(t)| is 0.02π/L. It is noted that the Bloch wavelength λl(t) = 2π/|kl(t)| = 100L is much larger than the size of unit-cells (side length: L). Therefore, the BD and SD structures can be regarded as homogeneous metamaterials for the propagating elastic waves at low frequencies. The effective longitudinal and transverse wave velocities of BD and SD structures in all directions are displayed in Fig. 2(a), where the 0°and 45° represent Γ-X and Γ-M directions, respectively. It clearly reveals that the wave velocities in BD structured metamaterial have much greater variation along with different directions than those in SD one. It denotes the BD structure is much more anisotropic than the SD structure. Specifically, in the Γ-X direction, the transverse wave velocity of SD structured metamaterial is over one order of magnitude larger than that of BD structured one, indicating the BD structured metamaterial is much more flexible in this case. We then set our focus on the Γ-X direction and map out the relation between the ratio of effective shear modulus μeff(SD)/μeff(BD). (here  for both BD and SD structured metamaterials) and relative density in Fig. 2(b). It is interesting to find out that the contrast of μeff will rapidly increase as the relative density decreases. For example, at an ultralow relative density , the ratio of μeff between SD and BD structured metamaterials can be as large as ~ 332. These two cellular metamaterials with different topologies exhibit a remarkable stiffness contrast at low densities, which provides a unique route towards the next generation of ultralight acoustic devices for various wave manipulation applications. Effective mechanical properties of the cellular metamaterials. (a) The effective elastic wave velocities for cellular metamaterials of the BD structure (longitudinal: red solid line, transverse: black solid line) and the SD structure (longitudinal: pink dashed line, transverse: blue dashed line) along different directions, where the relative density is 0.19 for both cases. (b) The ratio of effective shear modulus of the SD structure to the BD structure versus the relative density of cellular metamaterials along the direction Γ-X. Taking advantage of the great contrast of effective shear moduli in the Γ-X direction of metamaterials with SD and BD structured unit-cells, we can construct locally resonant elements by purposely assembling these two typical unit-cells. The resonant element is shown schematically in Fig. 3(a), which is featured by 5 × 3 arrayed SD structured unit-cells in the substrate, with a pair of composite stubs made of a 1 × 3 SD structured cap on a 1 × 3 BD structured base deposited on both sides of the substrate. The geometrical parameters of SD and BD structured unit-cells are the same as those presented in Fig. 2(a). Since the SD structured cap is much less flexible than the BD structured base, this composite stub can be regarded as a resonator where a stiff load is fixed at the end of a soft bar, viz. a loaded-bar system10. Due to the strong coupling of Lamb waves propagating in the substrate and the local resonances of the composite stub pairs, several flat bands in low frequencies can be clearly observed in the band structure as shown in Fig. 3(b). All these flat bands are the mixtures of two degenerate resonant modes: anti-symmetry modes (A) and symmetry modes (S). Eigenmodes and eigenfields of cellular metamaterial plates with periodic composite stubs. (a) One unit-cell of cellular metamaterial plates with a pair of stubs, where the lattice constant a = 5L = 10 mm. The unit-cells are periodically arrayed in x-direction, whose band structure is calculated in (b). For the lowest locally resonant eigenmodes marked by an arrow in (b), the displacement eigenfield distributions with scaled deformations are shown in (c): anti-symmetry mode (A0) and (d): symmetry mode (S0), respectively. (e) The resonance frequencies of A0 mode and S0 mode versus the relative density of SD caps in the composite stubs. Here and hereafter, the frequency is normalized by 2πct/a. To give an intuitive understanding of the local resonances in the system, we have plotted in Figs. 3(c) and 3(d) the displacement field distributions of eigenmodes [marked by A0 and S0 in Fig. 3(b)] at the lowest flat band near the edge of the Brillouin zone to present how the composite stubs vibrate under those conditions. The eigenfield distribution of A0 mode shows that the composite stubs on two sides of the substrate plate are vibrating out-of-phase. While for S0 mode, the vibrations of two stubs are in-phase. For each vibrating composite stub, it gives a remarkable resemblance to the first-order bending mode in a loaded-bar system. The phase differences between the two degenerate resonant modes are actually originated from the vibration features of anti-symmetry and symmetry Lamb wave modes10. Since the SD structured cap is viewed as the mass load, its density or weight will greatly influence the resonance frequency. The dependence of resonance frequency on the relative density of SD structured caps is sketched in Fig. 3(e). It distinctly reveals that the resonance frequency is very sensitive to the density of SD caps, especially in the lower density situation. In the lower density region (<0.2), the resonance frequencies of A0 mode and S0 mode have a small discrepancy. However, as the relative density of the caps increases (or becomes heavier), these two modes will eventually be degenerate. Thanks to the zero group velocities of the flat bands as well as its sensibility to the resonator geometries, a judicious design of a tailored resonant element array is possible to achieve Lamb wave trapping, with some intriguing properties: trapping vibrations in a deep subwavelength scale, in a broad frequency band and for both anti-symmetric and symmetric modes. In previous works, many plate systems with stubbed surfaces were employed to achieve broadband Lamb wave23 or surface wave trapping12. In our case, the cellular metamaterial plate for broadband Lamb wave trapping is shown in Fig. 4(a), which consists of an array of resonant elements in Fig. 3(a) with tailored properties along the x-direction. The resonant elements, grouping in threes, have a linearly increasing relative density for the SD structured caps. The number of groups is 10 (the total number of resonant elements is 30) and the relative density of SD structured caps in the group i is . According to the curves in Fig. 3(e), our system can trap Lamb waves in the frequency region from ~0.0103 to ~0.0133. We note that this trapping frequency bandwidth can be further broadened by adding more tailored resonant elements. The displacement field distributions of three selective frequencies, viz. 0.0129, 0.0116 and 0.0107, are numerically calculated and sketched, for both A0 mode and S0 mode in Figs. 4(b) to 4(d). According to Fig. 3(e), when the resonance frequencies of A0 mode and S0 mode are set to be 0.0129, the relative densities of corresponding SD structured caps should be about 0.2 and 0.21, respectively. Therefore, we can observe that A0 mode and S0 mode are trapped in the left part of our system with some differences in the trapping position. In a similar way, for the frequency of 0.0116 (the relative density of corresponding SD structured caps is approximately 0.27), both A0 mode and S0 mode will be trapped in the middle part of the system with a smaller difference in the trapping position. When the frequency decreases further down to 0.0107 (the relative density of corresponding SD structured caps is approximately 0.33), Lamb waves are trapped in the right part of the system, while A0 mode and S0 mode are localized nearly at the same positions. The results in Figs. 4(b)–4(d) are in good agreement with the theoretical predictions in Fig. 3(e). From the above, we demonstrate that a broadband Lamb wave trapping in a cellular metamaterial plate is physically realizable by purposely introducing multiple local resonances through tailoring the weight of stub caps, let alone its unprecedented weight efficiency. The numerical demonstration of Lamb wave rainbow trapping. (a) A schematic view of the cellular metamaterial plate for broadband Lamb wave trapping. (b)–(d) Displacement field distributions for A0 mode and S0 mode stimulations of three selected driving frequencies, respectively. In summary, we have investigated cellular metamaterials of two typical structures: BD structure and SD structure, which possess superior bulk-scale elastic properties, such as greatly contrasted stiffness at an ultralow density. By purposely arranging BD and SD structured unit-cells, we have developed a prototype of cellular metamaterial plates with composite textured stubs deposited on the surfaces for producing strong local resonances. Since the resonance frequency is very sensitive to the relative density (or weight) of the stub caps, a broadband Lamb wave trapping is therefore realizable by tailoring the geometry of resonant elements. In this paper, we only focus on the lowest flat bands for the Lamb wave trapping. At the lowest flat bands, the motion of resonant stubs is mainly a shear vibration, for which the shear modulus μeff plays a dominant role in local resonances. Therefore we can ignore the effects of the other Lamé coefficient λeff. As a matter of fact, we can also achieve Lamb wave trapping at the flat bands of higher frequencies. In this case, more complicated compression and extension will kick in for the resonant stubs, so that λeff also needs to be considered. Further studies should be performed for exploring trapping properties of metamaterials with 3D cellular frameworks (see the \nSupplementary Information\n), as well as the sample fabrication and experimental characterization. Our system could find its significance in designing myriad ultralight devices for elastic wave guiding and filtering, as well as acoustic energy harvesting. Throughout this paper, numerical simulations are carried out by the finite element solver in commercial software COMSOL Multiphysics with the help of a high performance computing cluster. In Fig. 2, we use BD and SD structures as the unit cells and calculate their band structures. Then we employ the linear dispersion lines in the long wave approximation to calculate their effective wave velocities and shear moduli. In Fig. 4, a uniform steel layer is added at the left side of trapping structure and an external normal/tangential oscillating stimulus is loaded on the left boundary to provide an input of longitudinal/transverse waves. The amplitude of force load per unit area is set to be 1 Pa. A perfectly matched layer (PML) is added at the right side to prevent reflections. Martinez-Sala, R. et al. Sound attenuation by sculpture. Nature 378, 241 (1995). Article \n    ADS \n    CAS \n    \n                    Google Scholar Sigalas, M. M. & Ecomonou, E. N. Elastic and acoustic wave band structure. J. Sound Vib. 158, 377 (1992). Article \n    ADS \n    \n                    Google Scholar Kushwaha, M. S., Halevi, P., Dobrzynski, L. & Djafari-Rouhani, B. Acoustic band structure of periodic elastic composites. Phys. Rev. Lett. 71, 2022 (1993). Article \n    ADS \n    CAS \n    \n                    Google Scholar Liu, F. M., Huang, X. Q. & Chan, C. T. Dirac cones at in acoustic crystals and zero refractive index acoustic materials. Appl. Phys. Lett. 100, 071911 (2012). Article \n    ADS \n    \n                    Google Scholar Lu, J. Y. et al. Dirac cones in two-dimensional artificial crystals for classical waves. Phys. Rev. B 89, 134302 (2014). Article \n    ADS \n    \n                    Google Scholar Liu, Z. et al. Locally resonant sonic materials. Science 289, 1734 (2000). Article \n    ADS \n    CAS \n    \n                    Google Scholar Zhu, X. F. Effective zero index in locally resonant acoustic material. Phys. Lett. A 377, 1784 (2013). Article \n    ADS \n    MathSciNet \n    CAS \n    \n                    Google Scholar Pennec, Y., Djafari-Rouhani, B., Larabi, H., Vasseur, J. O. & Hladky-Hennion, A. C. Low-frequency gaps in a phononic crystal constituted of cylindrical dots deposited on a thin homogeneous plate. Phys. Rev. B 78, 104105 (2008). Article \n    ADS \n    \n                    Google Scholar Wu, T. C., Wu, T. T. & Hsu, J. C. Waveguiding and frequency selection of Lamb waves in a plate with a periodic stubbed surface. Phys. Rev. B 79, 104306 (2009). Article \n    ADS \n    \n                    Google Scholar Oudich, M., Li, Y., Assouar, B. M. & Hou, Z. L. A sonic band gap based on the locally resonant phononic plates with stubs. New J. Phys. 12, 083049 (2010). Article \n    ADS \n    \n                    Google Scholar Rupin, M., Lemoult, F., Lerosey, G. & Roux, P. Experimental Demonstration of Ordered and Disordered Multiresonant Metamaterials for Lamb Waves. Phys. Rev. Lett. 112, 234301 (2014). Article \n    ADS \n    \n                    Google Scholar Zhu, J. et al. Acoustic rainbow trapping. Sci. Rep. 3, 1728 (2013). Article \n    CAS \n    \n                    Google Scholar Yang, S. X. et al. Focusing of sound in a 3D phononic crystal. Phys. Rev. Lett. 93, 024301 (2004). Article \n    ADS \n    \n                    Google Scholar Lu, M. H. et al. Negative birefraction of acoustic waves in a sonic crystal. Nature Mater. 6, 744 (2007). Article \n    ADS \n    CAS \n    \n                    Google Scholar Zhu, X. F., Liang, B., Kan, W. W., Zou, X. Y. & Cheng, J. C. Acoustic cloaking by a superlens with single-negative materials. Phys. Rev. Lett. 106, 014301 (2011). Article \n    ADS \n    \n                    Google Scholar Zhang, S., Xia, C. & Fang, N. Broadband acoustic cloak for ultrasound waves. Phys. Rev. Lett. 106, 024301 (2011). Article \n    ADS \n    \n                    Google Scholar Popa, B. I., Zigoneanu, L. & Cummer, S. A. Experimental acoustic ground cloak in air. Phys. Rev. Lett. 106, 253901 (2011). Article \n    ADS \n    \n                    Google Scholar Stenger, N., Wilhelm, M. & Wegener, M. Experiments on elastic cloaking in thin plates. Phys. Rev. Lett. 108, 014301 (2012). Article \n    ADS \n    \n                    Google Scholar Zhu, X. F., Ramezani, H., Shi, C., Zhu, J. & Zhang, X. PT-symmetric acoustics. Phys. Rev. X 4, 031042 (2014). Google Scholar Tanaka, Y. & Tamura, S. I. Surface acoustic waves in two-dimensional periodic elastic structures. Phys. Rev. B 58, 7958 (1998). Article \n    ADS \n    CAS \n    \n                    Google Scholar Vasseur, J. O., Deymier, P. A., Djafari-Rouhani, B., Pennec, Y. & Hladky-Hennion, A. C. Absolute forbidden bands and waveguiding in two-dimensional phononic crystal plates. Phys. Rev. B 77, 085415 (2008). Article \n    ADS \n    \n                    Google Scholar Zhu, X. F. Acoustic waves switch based on meta-fluid phononic crystals. J. Appl. Phys. 112, 044509 (2012). Article \n    ADS \n    \n                    Google Scholar Assouar, M. B., Senesi, M., Oudich, M., Ruzzene, M. & Hou, Z. L. Broadband plate-type acoustic metamaterial for low-frequency sound attenuation. Appl. Phys. Lett. 101, 173505 (2012). Article \n    ADS \n    \n                    Google Scholar Oudich, M. et al. Experimental evidence of locally resonant sonic band gap in two-dimensional phononic stubbed plates. Phys. Rev. B 84, 165136 (2011). Article \n    ADS \n    \n                    Google Scholar Lai, Y., Wu, Y., Sheng, P. & Zhang, Z. Q. Hybrid elastic solids. Nature Mater. 10, 620 (2011). Article \n    ADS \n    CAS \n    \n                    Google Scholar Lemoult, F., Kaina, N., Fink, M. & Lerosey, G. Wave propagation control at the deep subwavelength scale in metamaterials. Nature Phys. 9, 55 (2013). Article \n    ADS \n    CAS \n    \n                    Google Scholar Otsuka, P. H. et al. Broadband evolution of phononic-crystal-waveguide eigenstates in real- and k-spaces. Sci. Rep. 3, 3351 (2013). Article \n    CAS \n    \n                    Google Scholar Huang, Z. G. Silicon-based filters, resonators and acoustic channels with phononic crystal structures. J. Phys. D: Appl. Phys. 44, 245406 (2011). Article \n    ADS \n    \n                    Google Scholar Ding, H. X., Shen, Z. H., Ni, X. W. & Zhu, X. F. Multi-splitting and self-similarity of band gap structures in quasi-periodic plates of Cantor series. Appl. Phys. Lett. 100, 083501 (2012). Article \n    ADS \n    \n                    Google Scholar Zhao, D. G., Ye, Y. T., Xu, S. J., Zhu, X. F. & Yi, L. Broadband and wide-angle negative reflection at a phononic crystal boundary. Appl. Phys. Lett. 104, 043503 (2014). Article \n    ADS \n    \n                    Google Scholar Mounet, N. & Marzari, N. First-principles determination of the structural, vibrational and thermodynamic properties of diamond, graphite and derivatives. Phys. Rev. B 71, 205214 (2005). Article \n    ADS \n    \n                    Google Scholar Zheng, X. et al. Ultralight, ultrastiff mechanical metamaterials. Science 344, 1373 (2014). Article \n    ADS \n    CAS \n    \n                    Google Scholar Meza, L. R., Das, S. & Greer, J. R. Strong, lightweight and recoverable three-dimensional ceramic nanolattices. Science 345, 1322 (2014). Article \n    ADS \n    CAS \n    \n                    Google Scholar Guest, S. D. Tensegrities and rotating rings of tetrahedra: a symmetry viewpoint of structural mechanics. Philos. Trans. R. Soc. Lond. A 358, 229 (2000). Article \n    ADS \n    MathSciNet \n    \n                    Google Scholar Deshpande, V. S., Ashby, M. F. & Fleck, N. A. Foam topology: bending versus stretching dominated architectures. Acta Mater. 49, 1035 (2001). Article \n    CAS \n    \n                    Google Scholar Download references This work was supported by the National Natural Science Foundation of China under No.11304105, No.11404125 and the financial support from the Bird Nest Plan of HUST. Department of Physics, Huazhong University of Science and Technology, 430074, Wuhan, China De-Gang Zhao & Xue-Feng Zhu Department of Physics, Hong Kong University of Science and Technology, Clear Water Bay, Hong Kong, China De-Gang Zhao & Yong Li Innovation Institute, Huazhong University of Science and Technology, 430074, Wuhan, China Xue-Feng Zhu You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar D.G.Z. and X.F.Z. carried out the numerical simulations and theoretical analysis. X.F.Z., D.G.Z. and Y.L. contributed in the discussion of theoretical analysis and wrote the paper. X.F.Z. conceived and supervised the study. The authors declare no competing financial interests. Supplementary Information This work is licensed under a Creative Commons Attribution 4.0 International License. The images or other third party material in this article are included in the article's Creative Commons license, unless indicated otherwise in the credit line; if the material is not included under the Creative Commons license, users will need to obtain permission from the license holder in order to reproduce the material. To view a copy of this license, visit http://creativecommons.org/licenses/by/4.0/ Reprints and Permissions Zhao, DG., Li, Y. & Zhu, XF. Broadband Lamb Wave Trapping in Cellular Metamaterial Plates with Multiple Local Resonances.\n                    Sci Rep 5, 9376 (2015). https://doi.org/10.1038/srep09376 Download citation Received: 13 December 2014 Accepted: 02 March 2015 Published: 20 March 2015 DOI: https://doi.org/10.1038/srep09376 Anyone you share the following link with will be able to read this content: Sorry, a shareable link is not currently available for this article.  Provided by the Springer Nature SharedIt content-sharing initiative Scientific Reports (2019) Scientific Reports (2017) Scientific Reports (2016) Nature Communications (2016) Scientific Reports (2015) By submitting a comment you agree to abide by our Terms and Community Guidelines. If you find something abusive or that does not comply with our terms or guidelines please flag it as inappropriate. Advertisement Scientific Reports (Sci Rep)\n                \n\nISSN 2045-2322 (online) © 2023 Springer Nature Limited Sign up for the Nature Briefing newsletter — what matters in science, free to your inbox daily. ",
    "datetime": null,
    "url": "https://www.nature.com/articles/srep09376"
}