{
    "title": "BTS spearheads K-pop's conquest of the West - Asia Times",
    "text": "Register today to stay up-to-date with the latest news from Asia, China and beyond.  Thank you for registering! An account was already registered with this email. Please check your inbox for an authentication link. Asia Times Covering geo-political news and current affairs across Asia Asia Times’ Managing Editor Patrick Dunne thought he had escaped the continent when he flew to Calgary, Canada, on a family visit last week – only to find his eight-year-old daughter Amara singing in a language he did not recognize. “I thought she was speaking in tongues,” Dunne recalled. “Then I realized she was repeating lyrics from the K-pop song ‘Likey’ by Twice.” His daughter told him that at school, she and her friends occupy much of their free time doing K-pop dance moves. “Yes,” Dunne mused. “K-pop has made it to Canada.” Indeed. For decades, K-pop and its wider trend, hallyu (“The Korean Wave” –  comprising music, TV dramas and film) flooded across Southeast Asia, East Asia and parts of the Middle East and Latin American. However, the saccharine charms of perfectly choreographed pretty-boy and pretty-girl bands were largely resisted by Western audiences, even though the phenomenon was widely reported. Artists with apparent breakthrough potential, such as Rain (“Bi”), Girls Generation and the Wonder Girls never quite made it in London or New York, while quirky ironist Psy – who was, anyway, a virtual anti-K-pop artist – proved to be a one-hit wonder overseas with the now-immortal “Gangnam Style.” Now, however, the K-wave has – finally – crashed upon Western shores. With a vengeance. Spearheading the tsunami is BTS – the boy band whose collective faces are almost as globally recognizable as Kim Jong Un’s. According to the International Federation of the Phonographic Industry, the organization which represents the recording sector worldwide, BTS was the number-two global artist in 2018 behind Drake. Ticketmaster voted their four-continent world tour – which sold out both London’s Wembley and California’s Rose Ball – the hottest concert ticket of the year, while Spotify named them 2018’s second-most streamed artists.  They even addressed the United Nations. “2018 was the breakout year that BTS became the Asian-version of Beatlemania,” said Bernie Cho, president of Korean music artist and label services agency DFSB Kollective. “It’s been a bit surreal to see a K-Pop band like BTS neck-and-neck on international music charts with the likes of Drake, Lady Gaga and Queen. It’s hard to believe that BTS concert tickets are now more expensive than Elton John, Taylor Swift, and The Eagles.” How did BTS do it? Everyone has an opinion. Readers can comment on stories with free registration. Or sign up for our newsletters  Thank you for registering! An account was already registered with this email. Please check your inbox for an authentication link. Mark Russell, the author of “K-Pop Now,” suggests BTS arrived in a market that was just maturing. “Any time a new genre is rising, it is a series of steps to grow the fanbase and develop the connections,’ he said. “A lot of people nibbled at it – you had the Wonder Girls and Girls Generation – it is a whole process of growing any market.” Others cite musicality and the heartfelt messaging behind BTS’s songs. “I am 63 and I am a fan – I am going to their concert because I really sympathize with what they are saying when they are singing,” gushed Choi Jungwha, head of the Corea Image Communication Institute, or CICI. “Their songs are what I feel – their sincerity!” While all K-pop acts have leveraged social media – most notably by using YouTube as a distribution mechanism to cross borders while building a visual as well as aural brand – BTS have deployed weapons-grade social media skills to connect with their millions of fans, the BTS “Army.” “They show their daily lives on vlog so there is no barrier – it is as if we are friends or family,” Choi said. “BTS have all these ‘Army’ members who translate into many languages every aspect of their daily lives, which is shared on social media. Other bands did not do that.” Production values are stratospheric. “When you see their vlog – aesthetically it is so well done, so beautiful, it is almost perfection,” Choi said. But why did other K-idol bands not break through before? After all, multiple BTS selling points – pinpoint dance choreography, hyper stylish threads, flawless complexions and cutesy good looks – were typical of their predecessors. One commentator, speaking on condition of anonymity due to the sensitivity of his comments, suggested that the K-poppers who came prior were too carefully curated by the Seoul-based entertainment agencies that incubate talent using a factory-style training process, and usually supply groups with songs and music. “The Wonder Girls and Rain did not write their own music and their life experiences were all about being trainees [in the hands of the management companies which mold the stars], so though they made great music, when they were thrust into an interview situation, they had nothing to talk about,” the source said. “Fans actually want humans: K-pop acts came across as too robotic and over rehearsed … they are so trained, it is hard for them to be natural and normal.” BTS, however, are actual singer-songwriters. “Maybe people were waiting for someone like The Beatles who wrote their own songs and built their own brand,” said Park Ye-seul, who operated Seoul’s K-Pop Academy, an experience center, in 2018. “The runaway success of BTS is in many ways, a rebellious proof of concept that K-Pop needs to evolve beyond the ‘pretty boy-band’ stereotype,” said Cho. “BTS Army fans around the world are very loud and very proud of the fact the band members are not management manufactured idols but actually socially aware, outspoken artists.” That presents a challenge to other K-popsters. “Just looking good is not good enough, fans and critics want more,” Cho added. “Idols, for better and not for worse, now have to be ‘artists.’” K-pop, with its multiple cultural influences and high-tech distribution and marketing, may be poised as a global cultural norm for the 21st century. “K-pop is a global cultural appropriation machine that takes in other cultures’ systems and turns them into new things, with no allegiance to the original,” said Michael Hurt, a visual sociologist and research professor at the University of Seoul. “It if sounds good, who the hell cares where it came from? If you want to mix rap, jazz, RnB and rock it does not matter – it is a hyper-modernity kind of thing.” The combination of BTS’ staggering success and the maturing market for K-pop means that other Korean acts are also capturing bridgeheads in Western markets. Just days after BTS announced their sell-out world tour, the debut mini-album by fellow label members TXT (“Tomorrow by Together”) topped the iTunes Top Album charts in 49 countries, including Australia, Norway, Russia, Spain, Sweden and the US. This year, one of the biggest music festivals in the world, California’s Coachella, will be headlined by Korean girl group Blackpink. And K-music extends beyond idols; Blackpink will be joined at Coachella by two other Korean acts. One is Jamba Nai – an experimental, punky-looking alternative rock band that wields Korean traditional instruments. The other is Hyukoh – an indie rock band that sings in Korean, English and Chinese. According to Cho, Korea is the world’s biggest market for “indie music” – not a genre, but a descriptor of artists not represented by the big three global labels, Sony, Universal and Warner. The market is pioneering creative new sales concepts. For example, Korea, once known as a market where digital music had killed physical sales, has now reverted. In 2018, BTS were the first Korean act ever nominated for a Grammy in the “Best Recording Package” category. Their fanatical Army don’t just buy digital music, but CDs too – which are so well designed, they become collectors’ items. “Although the CD packaging design was impressive, CD sales were even more impressive,” said Cho. “Last year, BTS collectively sold over 600,000 CDs in the US – second only to Eminem, who amassed over 750,000 CD sales. What’s more impressive is that BTS sold over 1.4 million CDs in Korea in just one week – nearly the same amount the best-selling CD in the USA sold in an entire year.” And there are other revenue streams. For decades Korean products, from smartphones to cosmetics, have been promoted across Asia by K-pop idols in commercial endorsements. The emergence of K-pop stars in Western markets suggests lucrative new brand-to-band commercial ties. Kia Motors is sponsoring Blackpink, Hyundai Motor are in bed with BTS. And of course, Brand Korea scores collateral benefits. “K-pop is a gateway drug to Koreana in general,” said Hurt. K-drama and K-pop music videos “are very influential in introducing people to other layers of the K-cake,” he added. Thanks to K-pop, the K-fashion, K-cosmetics, K-cuisine and K-tourism sectors have all benefited. But not every fan is ultra-engaged. Back in snowy Calgary, Amara Dunne has not analyzed K-pop too heavily. ”I saw some friends working on dance moves and wanted to try it too,” the eight-year-old said of the lure of K-pop. “It’s cool!” 1 Comment I do not even understand how I stopped up here, but I assumed this submit was good. I don’t understand who you’re however definitely you’re going to a well-known blogger if you happen to are not already 😉 Cheers! You must be logged in to post a comment. We've recently sent you an authentication link. Please, check your inbox! Sign in with a password below, or sign in using your email. Get a code sent to your email to sign in, or sign in using a password. Enter the code you received via email to sign in, or sign in using a password. Subscribe to our newsletters: Sign in with your email Lost your password? Try a different email Send another code Sign in with a password ",
    "datetime": "2019-03-08T10:43:10+00:00",
    "url": "http://asiatimes.com/2019/03/bts-spearheads-k-pops-conquest-of-the-west/"
}