{
    "title": "BTS Lead The Growth Of Hallyu To Nearly 90 Million Fans Worldwide In 2018",
    "text": " NEW YORK, NY - MARCH 22: Jin, Suga, J-Hope, Rap Monster, Jimin, V and JungKook of the South Korean... [+] boy band 'BTS' visit Music Choice on March 22, 2017 in New York City. (Photo by Santiago Felipe/Getty Images)  The number of Hallyu (or Korean Wave) fans surged to 89.19 million worldwide in 2018, according to a year-end report by the government-affiliated Korea Foundation. The non-profit organization, which promotes a better understanding of Korea, reported that the 2018 Hallyu fan estimate is a 22 percent, or 16.07 million, increase from 73.12 million in 2017. Hallyu doesn't only comprise K-pop — it also includes film, TV and language. From 2016 to 2017, the report noted that Hallyu fans swelled by 14 million across the globe. Taken as a whole, there’s been an increase of 30 million fans since 2016. Hallyu’s global fandom has grown exponentially in only three years. So, the foundation predicted that the Korean Wave will reach 100 million fans by 2020. This drastic increase in the global fandom was largely attributed to the world’s biggest boy band, BTS. The septet has nearly 18 million followers on Twitter, and they had the most-liked tweet worldwide last year. Not only did two of their albums reach No. 1 on the Billboard 200, but they sold the second-highest amount of albums among all artists in the States. Earlier in 2018, they were recognized with the Order of Cultural Merit for spreading Korean culture. President Moon Jae-in recently mentioned BTS in a speech that covered his goals for the new year. “Many foreigners are wildly excited about K-pop such as BTS and Korean dramas,” he said, according to Soompi. “I will work to establish an environment of fair competition where the creation of the second generation of BTS and the third generation of Hallyu is possible, and creators receive the proper treatment they deserve.” The foundation’s report also estimated that 1,843 Hallyu fan clubs were spread across 113 countries, excluding South Korea, according to Yonhap News. Hallyu fan clubs include enthusiasts of “Korean singers, actors, culture and food, taekwondo clubs and Korean culture societies at universities.” The report also broke up fan estimates by region. North and South America accounted for 11.8 million members at 712 fan clubs. Asia and Oceania came out on top with 70.59 million members across 457 fan clubs. Europe had 6.57 million members at 534 fan clubs, while Africa and the Middle East had 230,000 members at 140 clubs. Japan, the world’s second-biggest music market, has become a go-to promotional region for K-pop over the years. But 2018 was Hallyu’s most successful year in the country as the number of fans tripled to over 300,000. Steady growth was also attributed to other parts of Asia, Africa and the Middle East. The Korea Foundation also noted the purchasing power of female fans, who became the key consumers of cosmetics, tourism and other fields. If you want more music news, follow me on Twitter.  ",
    "datetime": null,
    "url": "https://www.forbes.com/sites/caitlinkelley/2019/01/11/bts-lead-growth-of-hallyu-90-million-fans-2018/"
}