{
    "title": "BTS Is Changing the K-Pop Comeback at 2018 Billboard Music Awards Performance | Billboard – Billboard",
    "text": "The Billboard Music Awards announced BTS will perform at the 2018 ceremony on May 20 with the K-pop phenoms making giving the debut television performance of the new single from their forthcoming… By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin At the end of last month, it was announced that BTS will perform at the Billboard Music Awards on May 20, with the K-pop phenoms set to give the debut TV performance of the new single from their forthcoming Love Yourself: Tear album. In the K-pop scene, the debut performance of a new single is a big deal, known as the “comeback” performance or stage. With their upcoming BBMAs performance, BTS is essentially elevating themselves not only as artists who can land such a big awards-show slot, but also as Korean-culture leaders to create bigger and larger opportunities to lift the Korean wave. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tBTS\t\t\n\t\t\t\t\t\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news From the aesthetics to the musical performances themselves, K-pop fans know and always anticipate artists’ comeback stages on Korea’s weekly music chart show programs that see acts performing their promoted music and a No. 1 winner named for the week. In these comeback performances, acts typically get a special stage setup from the network with additional scenery and props — making the already extravagant K-pop live stages that much more extravagant — with acts typically performing their single along with one or two album tracks. Sometimes for the really popular acts, like BTS, they’re even given their own dedicated episode like the group had in their Comeback Show – BTS DNA special that aired on Korean broadcast channel Mnet and included the first performances of Love Yourself: Her tracks like “Mic Drop” and “Go Go.”   While there have been rare moments where K-pop acts have taken their comeback performances to non-Korean TV performances — like when boy band Teen Top debuted their new single “Rocking” at the 2013 KCON festival in Los Angeles — for the most part, the first performance for new music happen exclusively in Korea’s broadcast world. Yet, BTS performing their new single for the first time at one of America’s biggest award shows, alongside fellow superstars like Janet Jackson, Camila Cabello, Shawn Mendes, Christina Aguilera, Demi Lovato and more, puts them at a new level as top-notch performers. In fact, after this performance, the next question on everyone’s mind may be where will the next big comeback stage happen? Will it come from BTS or will another act try to one-up them? As K-pop’s international interest continues to rise and its artists continue earn more visibility in mainstream markets, could it become more of a norm for artists to debut their music on larger stages — both literally and figuratively — than what they’ve done in the past in Korea? Depending on the response, perhaps BTS will pioneer a new a standard for Korean acts to set in the pop world and prove that tradition doesn’t necessarily always need to be the only way to do something. In fact, if given and allowed the opportunity to innovate with their performance and premiere rollouts, perhaps K-pop could create even more excitement for the beloved Korean music shows and their other programming to keep the Hallyu going all the more strong. New to the word “comeback” when it comes to K-pop artists? Check out one of BTS’ most memorable comeback stages when M Countdown created an entire custom set inspired by the band’s You Never Walk Alone album paired unveiling a second set decorated by light bulbs, sky lanterns and a chandelier of flowers that showered the band with gorgeous petals.    Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2018-05-11T00:50:03+00:00",
    "url": "https://www.billboard.com/music/music-news/bts-billboard-music-awards-2018-how-it-will-change-the-k-pop-comeback-8448783/"
}