{
    "title": "BTS are the stars of Seoul's brand new tourism campaign - Lonely Planet",
    "text": "BETA Oct 24, 2018 • 2 min read  BTS is, undoubtedly, the biggest group in the world right now, conquering one nation after the other with their irresistible K-pop beat and incredible choreographies. The group is currently busy with its world tour, which has just completed its North American and European dates, but even if the seven members of BTS are far from home they never forget their home country, South Korea, or its capital. And that’s exactly why they want you to come and visit the many wonders Seoul has to offer. The seven Billboard-winning artists are Seoul’s Honorary Tourism Ambassadors, and their latest campaign in collaboration with Visit Seoul (the city’s official tourism agency) has just been released. With the title “Live Seoul like I Do,” it aims to show tourists, fans and everyone in between BTS’ favourite spots around the city. BTS are musicians, so it makes perfect sense that the way they’re showing what they love about Seoul is a playlist— each member has his own Seoul playlist centred around a particular theme, all presented as video commercials which are already trending all over YouTube. RM, the group’s leader, shows you around “Extreme Seoul,” like Mount Bukhansan, a favorite destination for climbers; Jin explains all the activities lovers of “Historic Seoul” can do, like watching traditional martial arts; Suga is in charge of “Fashionable Seoul,” which brings visitors right in the middle of the city’s shopping districts; J Hope stays on brand with his “K-Wave Seoul” playlist, which shows you how you can learn to dance like a K-pop star and where to find the best K-pop goods. Jimin helps you discover “Relaxing Seoul,” for example by kayaking at sunset on Hangang river; V opens the doors of “Exclusive Seoul,” where you can have your own custom-made traditional Korean clothing; and finally, the group’s youngest member Jungkook takes charge of everyone’s favourite part of a trip, food, with his “Delicious Seoul” playlist. And since BTS are so well-known around the world, there’s also a competition designed exclusively for people outside of South Korea – if you complete your own Seoul playlist, you can get a chance to win a three-night stay in the city, and visit it following one of the boys’ personalised routes. If you’d like to see more campaign content or enter the competition, you can do so by visiting the official website here. Music Mar 27, 2020 • 2 min read Popular Korean band BTS has launched an online video series designed to teach Korean to the world. Jan 28, 2023 • 6 min read Jan 2, 2023 • 12 min read Sep 27, 2022 • 6 min read Aug 31, 2022 • 12 min read Aug 22, 2022 • 8 min read Aug 20, 2022 • 8 min read Aug 19, 2022 • 8 min read Aug 18, 2022 • 7 min read Aug 16, 2022 • 11 min read For Explorers Everywhere © 2023 Lonely Planet, a Red Ventures company. All rights reserved. No part of this site may be reproduced without our written permission. English ",
    "datetime": null,
    "url": "https://www.lonelyplanet.com/news/bts-seoul-tourism-campaign"
}