{
    "title": "BTS Talks Conquering America Like No K-Pop Act In U.S. History",
    "text": " The members of K-pop vocal group BTS.  After years of holding on to their position as one of the biggest names in K-pop in the world, vocal group BTS finally broke into the top 10 on the all-genre Billboard 200 chart with their new EP Love Yourself: Her, becoming the first group from their musical style to do so. In addition to starting their latest collection at No. 7, the EP's lead single \"DNA\" also made it onto the Hot 100, making the group one of the few K-pop acts in history to find a place on that important tally. BTS has been able to achieve as much as they have thanks to the dedicated support of a massive fan base, which launched an intense and well-executed social media promotional campaign, and now that their careers have been taken to new heights, it will be interesting to see what they do next to capitalize on their newfound fame in America. Shortly after the group's charting feat, I spoke with BTS band member Rap Monster about what it means to lead the charge for a genre that has been slowly growing in popularity in America, despite the language barrier.   Hugh McIntyre: What does it feel like to be the first K-pop act to hit the top 10 on the Billboard 200 in the U.S.? Rap Monster: It's still like we're dreaming. The Billboard 200 top 10 is not something [I thought] that we could achieve. I was born to. I feel like we're so lucky and so grateful for the fans. McIntyre: Over your career, the albums have been doing better and better every time you put a new one out. Did you have any inclination that this would come close to the top 10, or was this totally unexpected? Monster: It was actually totally unexpected. I mean, we expected something… We're gaining some attention in the U.S. but we were like, “Could we make the top 10?” We sometimes imagined it, but never thought we could really do it. We wanted to but didn’t actually intend on it. So we still feel lucky. McIntyre: Is conquering the American charts a goal you guys have or was it just a happy accident that came happened thanks to the new album? Monster: I think we're gaining some attention and getting some fans based in America. It's happening gradually, going up really slow, so I think we could expect more for the future. It's happening, and I hope that it's not just a happy accident. We have to keep up with the work. Watch On Forbes  McIntyre: What do you think made this album perform so much better than your previous ones? Monster: I think we're always doing something for teenagers and youngsters because BTS originally performed itself as a socially conscious band. We always wanted to sell our performances like we did with our debut. I think what makes this album really special is that it’s a real turning point for us. It has a new concept: to love yourself, and I think fans are really reacting to it. They really think about how could they love themselves. Through this album, I think of how I could love myself more, and it's happening. The music is trendier, so I think our history and the music and the new concept has maxed this time. Everything was perfect so the Billboard thing could happen. McIntyre: Now that it has happened, do you guys have any plans to hop on this and return to America or release music in English? What are you planning on doing to capitalize on this moment? Monster: To capitalize on this, we have to not lose our minds. That's how we capitalize on this. Because we don't want to be so happy for this that we release an English song. Those things are really great, but we have to keep up with what we're doing. Getting ready for our next album. And, of course, we'll be coming back to America, I think more often because we're getting positive attention. McIntyre: You guys record in several different languages, and your output is pretty incredible. You release a lot of music! How do you keep up with that schedule? Monster: Yeah, it's really hard to keep up with that schedule because, like you said, our timing is quite fast. I think it's our thing to do. Fans always want something new, and we’ve got a lot of performances we want to show off. But I think the basic rules are that most important are to sleep well, practice much. That's really important for us right now. McIntyre: K-pop has been growing in popularity in America for years now, but obviously the past month or so has been a big moment for the genre. Do you find it empowering or do you maybe find it a little scary to be the group that is leading this in a big way at the moment? Monster: You know, we're sometimes really nervous to carry the weight and of being a leader in this life. But to be some of the first is really a great opportunity to feel like an artist. We try to enjoy the wave and the weight as much as we can. That's what we can do. McIntyre: A lot of credit has been given to your massive fan base for pushing this new album up the charts. They promoted it quite a bit in a way that we in America don't really see. What do you think makes them so dedicated and work so hard to push your music? Monster: I think, that's really hard thing to put into words. I think now they are really reacting to what we've been saying for four years. We're always giving back, always trying to give them messages. You know, how to live, how to breathe in this cruel world as a teenager. We always upload our pictures, and what we're thinking about, like what we're doing on our Twitter and YouTube. I think that's a really big help too. That's what makes it really special for the public and it's important to us. Sometimes I'm really confused about that too. They're doing so much in America, and we're trying to thank them. Give something back, like music, or a performance, as a concert in America. So I think we're charging our batteries continuously. That's what really makes BTS special. McIntyre: You've just made history, and you've mentioned new music coming. What does the rest of 2017 and 2018 bring for you guys? Monster: 2018 is going to be like another turning point for us because we're planning something really big. Bigger than even this year! But the important thing is that we will keep on doing what we're doing—getting ready for our new album. Going on tour. Visiting America and performing concerts for our American fans. I think keeping up what we're doing and making it bigger is going to be our next year and this year. McIntyre: You have also dabbled in working with some American hip-hop artists on your own. Is that something you are also interested in pursuing further? Monster: Oh, yeah, of course. I'm also solo. I've always wanted to do that. And I'm doing an actually. I can not say who, but, yeah, I'm solo. I really keep that work too. McIntyre: Is there a rapper in America you'd love to work with? Monster: There's so many. Dre. J Cole. Too many rap groups there. I can name like 20. McIntyre: I bet a J. Cole collaboration would be great. Monster: Yeah, he's one of the greatest. He's so cool.  ",
    "datetime": null,
    "url": "https://www.forbes.com/sites/hughmcintyre/2017/11/08/bts-talks-conquering-america-like-no-k-pop-act-in-u-s-history/"
}