{
    "title": "BTS: ‘K-Wave’ arrives at White House with anti-Asian hate summit – FBC News",
    "text": "[Source: BBC] They are the world’s best-selling artists, and they have brought the “K-Wave” to the White House. They are the world’s best-selling artists, and they have brought the “K-Wave” to the White House. But BTS were not there to show President Joe Biden their “dynamite” moves. Rather, it was to discuss anti-Asian hate. Crimes targeting East Asians have risen dramatically in the US amid the Covid-19 pandemic. The boy band members – all in their 20s – vowed to help Mr Biden, 79, tackle the issue. “It’s not wrong to be different,” BTS member Suga said through an interpreter. “Maybe equality begins when we open up and embrace all of our differences”. Another member, V, said that “everyone has their own history”. “We hope today is one step forward to respecting and understanding each and every one as a valuable person,” he added. Dressed in matching black suits, the seven members group did not take questions from reporters before leaving the White House briefing room to head to their meeting with President Biden. The group have been outspoken about their experiences with anti-Asian hate. Following a series of massage parlours shootings targeting Asian women in Georgia last year, Jin, Suga, J-Hope, RM, Jimin, V and Jungkook spoke out about their own experiences with anti-Asian discrimination. They’ve “endured expletives without reason” and have been mocked for their appearance, they said. “We cannot put into words the pain of becoming the subject of hatred and violence for such a reason”. In February, the International Federation of the Phonographic Industry – a music industry body – announced that the group beat the likes of Taylor Swift, Drake and Adele to become the world’s best-selling artists for a second year running. “We still feel surprised that music created by South Korean artists reaches so many people around the world, transcending languages and cultural barriers,” Jungkook said at the White House. He added that the group believes that “music is always an amazing and wonderful unifier of all things”. ",
    "datetime": null,
    "url": "https://www.fbcnews.com.fj/entertainment/bts-k-wave-arrives-at-white-house-with-anti-asian-hate-summit/"
}