{
    "title": "BTS, GOT7 & Other K-Pop Acts Win Big at Soompi Awards | Billboard – Billboard",
    "text": "K-pop acts including BTS and GOT7 were recognized in the annual awards of one of the most prominent English-language K-pop news sites. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tTamar Herman This year’s Soompi Awards saw many of K-pop’s most prominent acts take home awards, with boy bands BTS and GOT7 coming out on top. Partially based on fan voting and partially based on Soompi’s music charts, the Korean pop-culture site dubbed BTS the artist of the year and recognized their single “DNA” and You Never Walk Alone album as the best song and album of the year. Boy band GOT7 was recognized as the best male group and for having the best Twitter fandom, while girl group GFRIEND was the best female group. IU and Byun Baekhyun of EXO also received the top nods in their respective solo categories. The 2018 awards season dubbed Monsta X the breakout artist of the past year and boy band Wanna One the rookie of the year. Soloist Heize was crowned the best hip-hop/R&B artist. Girls’ Generation’s “Holiday” received the award for the top stage outfit. GOT7 also took home the Latin America popularity award. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tBTS\t\t\n\t\t\t\t\t\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news BTS took home a total of six awards as a group, the first act to ever do so at the Soompi Awards. Along with their primary nods, the septet also received awards in the best collaboration, best choreography, and music video of the year categories, while member V was recognized for his role in the television show Hwarang as the best idol actor. The awards also recognized SHINee’s Kim Jonghyun as the recipient of the Hallyu, or Korean Wave, special award. The 27-year-old artist died in December. In its 20th year, Soompi is one of the most prominent English-language sites dedicated to Korean pop culture. Its audience is made up of 65 percent millennial viewers and 79 percent female viewers. This year’s Soompi Awards, its 13th, generated 1.86 billion impressions, up from the 568 million of the previous year, a 228 percent increase. The Soompi Awards were presented on YouTube by Monsta X earlier Monday (April 16). Along with their K-pop-oriented categories, the Soompi Awards also recognized talent in the world of Korean television dramas. Television shows Goblin and Hwarang received the majority of the awards.  Below is a list of all of the award recipients: Artist of the Year: BTS Best Female Solo: IU  Best Male Solo: Baekhyun Best Female Group: GFRIEND Best Male Group: GOT7 Best Hip-Hop/R&B Artist: Heize Breakout Artist: MONSTA X Rookie of the Year: Wanna One Song of the Year: “DNA” by BTS Album of the Year: You Never Walk Alone by BTS Best Collaboration: “Mic Drop Remix”  by BTS with Steve Aoki feat. Desiigner Best Choreography: “DNA” by BTS Best Stage Outfit: “Holiday” by Girls’ Generation FUSE Music Video of the Year: “DNA” by BTS Breakout Actor: Jung Hae In (While You Were Sleeping) Best Idol Actor: V (Hwarang) Best Web Series: Ruby Ruby Love Best Acting Ensemble: Hwarang Best Foreign Drama: Attention, Love! Best Variety Show: It’s Dangerous Beyond the Blankets Best Music Reality Show: Produce 101 Season 2 Best Soundtrack: Goblin OST Best Supporting Actor: Lee Dong Wook (Goblin) Best Supporting Actress: Yoo In Na (Goblin) Best Kiss: Nam Ji Hyun and Ji Chang Wook (Suspicious Partner) Best Couple: Park Bo Young and Park Hyung Sik (Strong Woman Do Bong Soon) Actor of the Year: Lee Joon Gi (Criminal Minds) Actress of the Year: YoonA (The King Loves) Drama of the Year: Goblin Twitter Best Fandom: GOT7 Latin America Popularity Award: GOT7 Hallyu Special Award: Jonghyun Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2018-04-16T22:35:18+00:00",
    "url": "https://www.billboard.com/music/music-news/soompi-awards-bts-got7-k-pop-8342116/"
}