{
    "title": "BTS, BigBang or Seventeen – which K-pop boy band has the most educated members? 17 South Korean idols who found time to get a university degree | South China Morning Post",
    "text": "Everyone knows education is important, whatever career path one wants to take. Even in the world of K-pop, getting a solid schooling is a big deal, with Korean entertainment companies actively encouraging idols-in-training to get ahead academically as well as artistically – whether as a security net, or simply for personal growth and fulfilment. As a career in the entertainment industry isn’t as stable as a day job, most idols climb up the academic ladder after graduating from high school, whether by taking up short courses and language classes to attending scholarships and pursuing doctorates. Which just begs the question – which K-pop stars are the smartest, most-educated, and who found time to get a degree while reaching for superstardom? BTS BTS is well known for advocating education, and encourages its “Army” of fans to stay in school and learn new things. Do the boys they practice what they preach? Graduating with a major in film studies from Seoul’s Konkuk University in 2017, Jin is currently attending Hanyang Cyber University for graduate studies. RM, Suga, J-Hope, Jimin and V all graduated from Global Cyber University with a degree in broadcasting and entertainment, and are now also attending the same university as Jin for their MBA in advertising and media. Meanwhile maknae (youngest member) Jungkook is now attending Global Cyber University for broadcasting and entertainment like his hyungs. Nu’est’s and Seventeen’s 95-line It was announced earlier this year by Hanyang University that Nu’est’s JR, Minhyun, Baekho and Ren have enrolled as freshmen, alongside their hoobaes S.Coups and Jeonghan of Seventeen, in the university’s Institute for Future Talents. The labelmates will be taking up the institute’s practical music course in the K-pop division. BigBang Aside from their hit songs and outstanding K-pop legacy, some BigBang members take pride in their educational attainments. Taeyang held a Bachelor’s degree in theatre and film before receiving his Master’s degree in producing performances and images in 2016 at Daejin University. He also wrote a thesis titled “The Influence of BigBang’s 2015 World Tour on the Sustainability of the Korean Wave”, which is available online through the National Library of Korea. Members T.O.P and G-Dragon also both have Master’s degrees, in theatre and film from Dankook University and retail and distribution from Sejong University, respectively. Girl’s Day’s Sojin Girl’s Day’s Sojin clearly has a practical mind, completing her degree in mechanical engineering from Yeungnam University. The group’s leader and lead vocalist initially faced a backlash about her acceptance into the university, however she soon proved that she deserved her place. During her college years, she was one of eight women in her major consisting of 1,000 students. Although she initially wanted to become a doctor, she still managed to become top of her class and graduate with high grades – attending university with a scholarship. Want more stories like this? Sign up  here. Follow STYLE on  Facebook,  Instagram,  YouTube and  Twitter . BTS’ RM, Suga, J-Hope, Jimin, Jin and V are all studying postgraduate courses at Hanyang Cyber University, while maknae Jungkook is now attending Global Cyber University – but Taeyang’s Master’s thesis, titled ‘The Influence of BigBang’s 2015 World Tour on the Sustainability of the Korean Wave’, was placed in the National Library of Korea ",
    "datetime": "2020-09-16T15:22:35+08:00",
    "url": "https://www.scmp.com/magazines/style/celebrity/article/3101757/bts-bigbang-or-seventeen-which-k-pop-boy-band-has-most"
}