{
    "title": "BTS’ Canceled Gig Underlines Japan & Korea’s Awkward K-Pop Relationship | Billboard – Billboard",
    "text": "Japan and South Korea have had a long and icy history when it comes to entertainment exports, with BTS' canceled appearance on 'Music Station' supposedly over Jimin wearing a T-shirt depicting the… By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin On Friday (Nov. 9), headlines ran across both mainstream and music news outlets about BTS being dropped from a Japanese TV show over member Jimin wearing a T-shirt in 2017 that depicted the atomic bomb drop on Japan, among text celebrating Korea’s liberation from Japanese rule during World War II. Fashion taste aside, what the stories are largely failing to recognize is the ongoing, politically driven tension that has plagued Korean acts in Japan for years, with this being the latest stumble in an already awkward relationship. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tBTS\t\t\n\t\t\t\t\t\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news  K-pop began its international expansion largely thanks to its success in Japan, the world’s second-largest music industry after America. In the early 2000s, solo diva BoA became the first Korean singer to top the charts in the island nation with her Japanese debut album Listen to My Heart. This paved the way for second-generation K-pop boy bands (like TVXQ!, BIGBANG and SHINee) and girl groups (Girls’ Generation and Kara) to hit new heights in the market and become regular fixtures on the Japanese media scene — hitting a new jackpot when it came to overseas earnings by the early 2010s. Largely, though, many groups (particularly TVXQ!) were considered to have worked from the bottom up in the industry rather than riding an already-popular trend.   Still, with an idol scene all its own, Japan had seemingly struggled to balance the popularity of Korean artists compared to its domestic acts. In 2011, thousands gathered in Tokyo to protest the Korean wave in Japan after an actor said he felt “brainwashed” by the amount of K-content on a popular TV network and was subsequently fired. By 2013, the Wall Street Journal was reporting on small but “hostile demonstrations against the country’s Korean residents” staged every weekend across the country. Around this time, K-pop acts began promoting in Japan less frequently when it appeared that broadcasters had a general sense to slow down on K-pop. It’s only been with the recent success of new-generation leaders like BTS and TWICE that it seemed like the time for K-pop’s Japanese comeback. It’s important to acknowledge that the icy relationship is also largely rooted in long-standing political history. During World War II, the Japanese empire advanced throughout southeast Asia, occupying all of Korea and parts of China. With Japan’s notoriously brutal rule, there is still unresolved issues between the Japanese and Koreans over wartime incidents, such as the compensation for South Korean women trafficked to Japanese army brothels (known as “comfort women”) as well as Seoul’s refusal to let the “Rising Sun” flag (a symbol considered to embody the mind-set of the former Japanese empire) fly at naval review.  Korea has made a point not to welcome Japanese media as well. After the Japanese rule ended in Korea in 1945, punishment laws and restrictions were enacted to bar music, videos, games and more from other countries — with a major focus on Japan — which gave South Korea no legal access to Japanese products until the ’90s. Korean radio and TV stations still cannot broadcast Japanese music or dramas even as minor steps to acknowledging the country have come via the popular singing competition Produce 48, which saw K-pop hopefuls and Japanese idols competing for a spot in a new girl group.  Despite all this, K-pop is still hot in Japan and arguably hitting another high. Earlier this week, TVXQ! was announced as the No. 1 touring artist in the country — beating all Japanese and international artists — drawing an audience of nearly 1.3 million in 2018, according to Japan’s Nikkei Entertainment magazine. Meanwhile, TVXQ!, SHINee, BTS, TWICE, EXO and iKON have all hit No. 1 on Japan’s main Oricon Albums Chart just this year alone — the highest amount of Korean chart-toppers since 2011. Earlier this week, rumors swirled in Asian media that BTS and TWICE (who have three members of Japanese descent) would not be invited to Japan’s prestigious and highly rated year-end music festival Kohaku Uta Gassen despite their success in the market. BTS set a new, first-week record for Korean-artist album sales with their Face Yourself LP, while TWICE scored two No. 1s on the Billboard Japan Hot 100 chart. Still, the issue was mainly chalked up to the recent tensions over a South Korean supreme court ruling that Japan’s Nippon Steel & Sumitomo Metal Corp. needs to compensate four Koreans for forced labor during World War II, a decision Japan denounced, according to Reuters, as “unthinkable.” BTS’ T-shirt incident certainly didn’t help matters, but it’s hardly the sole reason for this cancellation among issues that are largely rooted in long-standing political and cultural stances between countries. In fact, if it was the only issue, BTS’ previous Japanese television appearances (including a December 2017 performance on Japan Music Station Super Live) would have logically been canceled too. To those watching the situation for longer than BTS’ rise to prominence, it is yet another slip in an ongoing awkwardly tense situation where culture and politics far outweigh a fashion item.  Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2018-11-09T23:23:30+00:00",
    "url": "https://www.billboard.com/music/music-news/bts-t-shirt-issue-japan-korea-kpop-history-8484226/"
}