{
    "title": "Can Japan recapture its cool? A country’s government-backed multimillion-dollar bet - The Globe and Mail",
    "text": "This article was published more than 9 years ago. Some information may no longer be current. Visitors to a 2012 exhibit in Hong Kong inspect 100 figures, each showing Doraemon – Japan’s first anime cultural ambassador – in a different pose. After 45 years, the Japanese icon’s tales have been translated into English.BOBBY YIP/Reuters Doraemon is a blue robot cat whose front pocket is stuffed with a seemingly endless supply of neat gadgets that he uses to help out a Tokyo fourth-grader named Noby. Forty-five years after he first appeared in a manga, or Japanese comic book, hardly anyone in this country doesn't know that Doraemon was sent back in time from the 22nd century by Noby's great-grandchildren, hoping that his good deeds would make their lives better as well. Now, the guardians of Japan's economic future are banking on much the same thing. They hope that the beloved, magical cat can reach into his bag of tricks and pull out a ticket to the global spotlight, both for himself and for the nation that created him. Although appointed Japan's \"anime ambassador\" in 2008, Doraemon didn't speak English until a few months ago. Then, as part of a sweeping effort to rekindle Japanese domination of international pop culture, his new ebook series made its U.S. debut on amazon.com. The government has created the $405-million \"Cool Japan Fund,\" a blatant attempt to reclaim the country's lost status as a global trendsetter, just as \"Cool Britannia\" rose from the ashes of the Swinging Sixties three decades later. Officials want exports of cultural products such as Doraemon to reach $100-billion by 2020, which is when the Summer Olympics come to Tokyo. It won't be an easy feat. Five years ago, such exports were worth barely half that much. And, besides, is cool even something that a country can manufacture? In 2010, Japan lost its place as the world's second-largest economy to China. A year later, its global image was tarnished by the Fukushima nuclear disaster. But Prime Minister Shinzo Abe, in many ways the country's optimist-in-chief, has launched a campaign to tell the world that \"Japan is back.\" This week the outspoken and often controversial populist marked National Foundation Day by saying he is determined to see the country \"go forward as a Japan that has pride.\" He also reminded the public it has an obligation to hand down both \"peace and prosperity\" to the next generation. With the 2020 Games on the horizon, his government is certainly trying to turn things around. Since returning to power just over a year ago, Mr. Abe has committed at least 10 trillion yen ($107-billion) to stimulate growth in an economy that has suffered from deflation since 1998, the last time the Olympics came to Japan, at Nagano . Pouring all that fuel on the economy has had a dramatic effect. After years of declining salaries and prospects, the stock market has been roaring, unemployment is at a six-year low and optimism is staging a comeback. Brand Japan, however, is not. Not only did Fukushima strike at the very heart of the nation's reputation for technological sophistication and savvy, international sales of manga are plummeting (down 35 per cent in the United States alone), and J-pop has given way to K-pop and such Korean mega hits as Gangnam Style. It has been little more than a decade since an article in Foreign Policy magazine entitled \"Japan's Gross National Cool\" noted Japan's sudden prominence on the global stage. Sony PlayStation and Nintendo gaming consoles, along with other high-tech wonders, were spreading into the world's living rooms. International manga sales were on a rocket ride, anime techniques being mimicked in Hollywood, and The New York Times had declared Tokyo \"the real international capital of fashion.\" All of which prompted Foreign Policy to conclude that \"Japan's growing cultural presence has created a mighty engine of national cool.\" The world saw Japanese styles and literature, and went crazy. But the designers and writers who were responsible were not, by and large, seeking such adulation – some were even uncomfortable with the notion of being \"cool.\" It just sort of happened. Rebels versus the mainstream Just as suddenly it fell apart. Last month, Nintendo, which once had a per-employee profit higher than that of Wall Street money-spinner Goldman Sachs, forecast an annual loss of $270-million. At the same time, Japan increasingly has no choice but to look abroad for consumers – its own are dying off. Last year, the world's oldest population (almost one-quarter of the 127 million citizens are over 65) shrank by 244,000, or 0.2 per cent, the largest decline on record. At this rate, the population will be one-third smaller in 50 years. New buyers are essential, even if they have to be bought. Coolness, however, is an elusive commodity. U.S. marketing expert Caleb Miller, who wrote his 2010 doctoral thesis on the subject, says that it originates outside the mainstream. In fact, he writes, \"my studies suggest that people and brands can become cool by displaying 'bounded autonomy' – which is typically inferred from displays of rebellion and uniqueness.\" Not exactly how Japan is trying to recapture the magic. The comeback bid has its headquarters high in an office tower in Tokyo's swank Roppongi Hills development. Visitors are greeted by jangling music, five screens showing a slow-moving panorama of the highlands near Nagano and a stainless-steel floor that vibrates with the bass tones. It's all meant to envelop the senses, to surround the visitor with a new vision of the nation. Everything about Cool Japan, from the ultra-modern furniture (made in Japan, of course), to its overseers (executives drawn from television, fashion and gaming), to its giant money pot (supplied by corporations as well as government) is part of an ambitious attempt to reshape how a famously insular culture works. The fund's first request for proposals sparked a deluge: nearly 100 proposals, seeking nearly 10 times the money that's available. \"One of our models is Hollywood, the other is Disney,\" says co-chief operating officer Masaki Koito. \"They produce content with the global market in mind, and they have distribution channels all over the world. \"We believe that, for Japanese content, we need a more scientific business method.\" Think a new push to sell the world everything from ramen and rice to fruit and convenience-store pouches of curry, as well as win back audiences for manga and anime. Then think of the deeper efforts required to do all that: hiring translators to give the world access to a large body of existing literature; paying lawyers to negotiate content rights and buy up TV time around the world; finding logistics experts to build new \"cold chains\" to deliver that fruit unspoiled. With additional government money on the way (the $405-million is expected to more than double), Cool Japan has mulled investing overseas in Japan-centric shopping malls and food courts, while closer to home, it tries to breathe new life into old hits. Enter Doraemon. Until recently, not one of the 12,500 pages occupied by the blue cat's story had been published in English. But over the past year, a small group of translators has prepared the entire Doraemon catalogue for a new audience. The first issue was published as a digital Kindle book in November, in part thanks to the efforts of Matt Alt, a Tokyo translator with a broad knowledge of manga culture. For Japan, he says, products like Doraemon are a bit like an untapped oil and gas reservoir – immensely valuable, and just waiting to be exploited. But taking the plunge isn't always easy, according to Yoshiaki Koga, a senior deputy director of publishing giant Kodansha. \"Readership will shrink in Japan, so we have to look overseas … We all know this is the reality. But we still find it tough to make the huge investment.\" He speaks from experience. From 1968 to 1971, Japanese television audiences sat enthralled by another comic-book story, this one about a young baseball pitcher whose dreams of greatness come true partly because he has pitches with magical properties. Star of the Giants played out over 182 episodes so popular that some were shown in theatres; four decades later, middle-aged Japanese men can still describe its plot and characters vividly. Low-rent remakes 2010, Mr. Koga had an idea: Why not remake Star of the Giants for India and adapt the story line to cricket? After all, he says, \"baseball's origins are in cricket.\" It was a bold move. Kodansha had never animated for a foreign audience, but eventually agreed to 26 episodes. A company in Hyderabad was recruited for the animation, and the main character given a new backstory that included growing up in the slums of Mumbai. It was done on the cheap, eschewing 3D. \"We don't need anything fancy like Pixar for Indian people,\" Mr. Koga says. But no channel in India's vast television universe wanted to bet on Suraj – The Rising Star, as the story was called, so Kodansha had to buy air time instead. Worse, merchandise sales, the real source of potential profit, haven't taken off. \"We still haven't recovered all of our investment,\" Mr. Koga acknowledges (even in Japan, that can take three years). \"India, even though they have a huge population, it's not like you can get overnight success.\" Still, Kodansha is considering a followup, and Mr. Koga, eager to try again, wants to move to India to shepherd operations himself. \"We have to try something new,\" he says. \"We have to challenge ourselves.\" Japan is hardly the first country to attempt what the marketers call \"national branding.\" In fact, the reigning champion isn't too far away. In the mid-1990s, Chinese state television helped to unleash the \"Korean Wave\" when it began to air television dramas from South Korea, which by 2011 was exporting about $155-million (U.S.) worth of programming to Iran, Iraq and Japan as well as China. The wave now goes far beyond TV (even Japan has developed an appetite for kimchi, and Gangnam Style has the world begging for K-pop), and thrives on mountains of public money. Created in 2001, the government-run Korean Culture and Content Agency spent $330-million last year alone on promoting pop culture overseas. In many ways, Seoul is now Asia's capital of cool. But the government didn't create that cool; it seized on a trend already in progress, just as Britain had a decade earlier. Whitehall set out to rebrand the country long after reading about \"Cool Britannia\" in Newsweek – and discovered the peril in entrusting such things to bureaucrats. \"Nothing is sadder than trying too hard to be cool,\" The Economist observed of the British attempt, whose tactics included putting Union Jack mini-skirts on The Spice Girls. And, of course, cool isn't forever. Thirteen years after his 1996 Newsweek cover story declared London \"the coolest city on the planet,\" writer Stryker McGuire returned with an obituary: \"The Blair era is long gone, and so too is the national spirit, the hope and the optimism, that reigned in those days.\" \"The government forgot it was trying to promote Britain,\" lamented policy adviser Simon Anholt, who has made a career of reviving images, \"and started promoting the campaign to promote Britain.\" Seoul's investment paid off Korea, however, offers Japan some hope. The return on its investment in cultural promotion has been staggering. In 2002, Korean Wave exports were about $500-million (U.S.). A decade later: $10-billion, which Seoul says could hit $57-billion by 2020. Still, Noel O'Dea, head of the St. John's marketing firm responsible for Newfoundland and Labrador's award-winning tourism ads, isn't so sure. \"Most places try to be like Disneyland,\" he says. \"They try to follow what other countries, places, products, services have been doing that seems successful.\" It doesn't work. Branding can be powerful, but there has to be a story to tell. \"There are truths,\" Mr. O'Dea says, \"and the truths should start with the DNA of the country.\" Which raises a difficult question: Is Japan, in fact, still cool? To some, the answer is a qualified yes. Ian Condry, a cultural anthropologist at the Massachusetts Institute of Technology, has organized the MIT/Harvard Cool Japan Research Project – a series of seminars and arts events – since 2006. \"The Japanese pop-culture boom may seem less visible now,\" he explains, and yet North American audiences \"at things like anime conventions are roughly double what they were a decade ago.\" Others worry that Japan has become so culturally fragmented that its allure to the outside world is much diminished. Manga is increasingly inwardly-focused and self-referential, rendering it opaque to all but those with a lifetime obsession. In an online essay, Tokyo writer and musician David W. Marx observes that trends such as the otaku (geek) and gyaru (\"gal\") cultures have become powerful forces, attracting an upwelling of niche fashion and literature. But unlike, say, Mario or Hello Kitty, neither has the kind of mainstream appeal that might make them globally significant. \"Japanese companies now face a true crisis,\" Mr. Marx writes. \"Appealing to the most powerful consumers in Japan will lead them away from tastes and values that can be easily exported overseas.\" Matt Alt, the Doraemon translator, is an unapologetic believer in Japan's ability to reverse course, noting that it was only a few decades after the devastation of Hiroshima and Nagasaki that Japanese electronics were lusted after by the world. \"There's so much vitality here in this city,\" he says. \"And Japan is absolutely a comeback king.\" But some of Cool Japan's early returns aren't promising. Nancy Snow, who is writing a book on Japan's post-Fukushima brand image, attended the agency's launch party and shook her head in disbelief at who was in the crowd: older men in suits \"who really aren't tapped into the trends in Japan, and what the youth are interested in.\" Also, argues the professor of communications at California State University, the campaign's priorities – food, manga, anime, fashion – are hardly cutting-edge. \"They're conservative and they're uncreative.\" Or worse. Ms. Snow points to the appointment of pop-culture follower Danny Choo last year to a high-profile committee on \"creative industries internationalization\" that advises the Ministry of Economy, Trade and Industry. Out of touch, out of luck? British-born and now based in Tokyo, Mr. Choo is the creator of Mirai Suenaga, a doe-eyed and enormously busty robotic doll. She has realistic nipples and, as Ms. Snow says, offers \"a cute reaction when she is given a pat.\" Mirai Suenaga serves as the mascot for Culture Japan, Mr. Choo's weekly TV show, and is so popular that her image has appeared on aircraft. But to Ms. Snow, the character illustrates just how out of step Japan is with the rest of the world. \"They're porn-style dolls,\" she says, adding that, upon first seeing Mirai, she thought: \"Are they really that out of touch that they can't see how offensive these images are?\" Rather than spending hundreds of millions in a desperate, possibly misguided attempt to make itself cool again, she concludes, \"what Japan has to do is really open itself up more.\" If Doraemon is such a cool cat, maybe he has a gadget that does just that. Nathan VanderKlippe is The Globe and Mail's Asia correspondent based in Beijing. Follow Nathan VanderKlippe on Twitter: @nvanderklippeOpens in a new window Report an error Editorial code of conduct Build your personal news feed Build your personal news feed © Copyright 2023 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO ",
    "datetime": "2014-02-14T18:00:00-0500",
    "url": "https://www.theglobeandmail.com/news/world/can-japan-recapture-its-cool-a-countrys-government-backed-multimillion-dollar-bet/article16902150/"
}