{
    "title": "Can Korea Turn Itself into a Global Pop Juggernaut? | Yale Insights",
    "text": "Two decades ago, with the aim of diversifying its economy, Korea set its sights on supplying pop culture to the world. What does the country’s top-down effort to build a creative economy say about what it takes to succeed on the global stage? By Ted O’Callahan The most watched video ever on YouTube has received more than 2.5 billion views, a testament to the massive reach of the online platform. This top video has a billion-click lead on Taylor Swift’s “Blank Space” and is a solid 1.3 billion views ahead of anything by Justin Bieber. You’ve most likely heard this song about a ritzy district in Seoul, South Korea, and can call to mind the image of a slightly portly man in a blue tuxedo jacket gyrating to a dance beat. It’s, of course, “Gangnam Style,” by Psy. The music video’s success is a symbol of both the growing global reach of South Korean pop culture and the potential of the global entertainment system to spread ideas. Embedded in the song’s name is a reference to a Seoul neighborhood, and the penumbra of association and reputation that go with it. Before the video, few outside of South Korea would have understood that reference. Today, millions can tell you that Gangnam is a district in Seoul, while mimicking Psy’s goofy dance moves. While Psy’s reach is arguably sui generis, the development of Korea’s creative economy is the result of very intentional government policy—policy enacted through close collaboration between the public and private sectors—and an extension of the economic approach that drove the country’s rapid rise from poverty. Korea was occupied by Japan for the first half of the 20th century, then devastated by the war that divided the peninsula. In 1961, South Korea’s GDP, at $91 per capita, was less than that of Sri Lanka, Bangladesh, and much of Sub-Saharan Africa. By 2013, it had risen to $26,000, which put South Korea on par with Saudi Arabia, Portugal, and Spain, according to World Bank figures. A country with limited natural resources on a land mass smaller than Kentucky managed this transformation through rapid, government-led, export-oriented industrialization. “South Korea is the only capitalist liberal democracy that can behave, when necessary, as a command economy,” says Euny Hong YC ’95, author of The Birth of Korean Cool: How One Nation Is Conquering the World Through Pop Culture. She describes a “voluntary coercion” that can seem like South Korea’s government is a board of directors overseeing 50 million employees. “In Korea everything is linked, so a change in economic strategy means a change in society and a change in politics.” The government’s industrialization strategy was carried out by chaebols—family-controlled businesses. In the process, those chaebols became multinational conglomerates; Samsung, Hyundai, and LG are among the best known in the West. The size of the chaebols has grown to the point where the top 10 accounted for 76% of the country’s GDP in 2011. The economy’s dependence on such a small number of firms has long been a concern. Efforts to diversify go back to the 1990s, beginning with a whitepaper from a presidential advisory board on science and technology, which noted that a single movie, Jurassic Park, earned the equivalent of selling 1.5 million Hyundai cars. The paper sparked a national discussion about getting into the pop culture business. The result was the formation, in 1994, of the Cultural Industry Bureau. Despite the bureaucratic name, it was an audacious step because, as Hong says, “There was zero market for Korean popular culture. It had to be force fed into foreign markets.” The government paid to translate Korean soap operas and even arranged for ad sales so that TV stations across Asia would accept the ready-to-play packages. It worked. After succeeding in Asian countries, the process was repeated in Latin America. Even niche audiences got attention. Soap operas sent to Paraguay included both Spanish and Guarani-language versions. “For a time, many people thought globalization was code for Americanization,” Hong says. “In parts of the world, there is a generation of children growing up who have more familiarity with Korean TV than American TV. Those influences have impact.” She acknowledges that the U.S. is still the dominant player: it has about 35% of the global media and entertainment market share while Korea has 3%, according to the PwC Global Entertainment and Media Outlook. Yet, Hong believes that a potentially tectonic shift could be underway. Korea has, in many cases, targeted poor countries that aren’t currently important markets for consumer goods. It is a strategy that may take time to fully pay off but, as those countries develop, Korean brands will be the ones linked to aspirational lifestyles. Part of the appeal may come from offering something very different. Though Korean movies often contain violence and sex, Korean television dramas are produced to be family-friendly—the country’s child-protection laws are extremely strict. As a result, Korean shows have benefitted from what what Hong describes as the “Twilight Effect.” “There is a market for the chaste, old-fashioned courtship, where nobody has sex,” she says. In fact, Korean dramas have strong followings in a number of strict Muslim societies. Judging the success of the overall strategy is difficult. Total output of Korean creative content industries has expanded quickly, but even so in 2014 it accounted for just $5.4 billion in Korea’s $1.4 trillion economy (in the U.S., by comparison, entertainment industries account for $600 billion within a $17.4 trillion economy). “While the creative content industry is a small part of the Korean economy, its impact on the overall economy is significant,” says Dal Yong Jin, a professor of media studies at Simon Fraser University. “The spillover effects are not small at all.” The music, film, TV, video games, and even food and fashion industries are maturing, Dal notes: “The Korean Wave is unique because the country has developed several cultural industries at the same time.” Dal also points to the marketing benefits of the strategy. “The government plans to enhance the national image and national brands in tandem with the Korean Wave,” he says. Korea’s entertainment push is closely tied to a technological foundation. As Dal puts it, “The new Korean Wave relies on both popular culture and digital culture.” Social media, streaming, and mobile platforms are critical in reaching audiences. Online games allow producers to reach a global audience while bypassing the game console wars. And a more recent push into mobile gaming is also an opportunity for Samsung’s phones, which have long been used for the social networks that spread and stream K-pop music videos. Korean pop music is a new package built using an old model. As in the old Hollywood studio system, artists are signed to years-long, ironclad contracts. Talent is controlled and packaged by studios. K-pop artists are typically signed very young and, after years of training, emerge as stars with names and personae created out of whole cloth by the studio. And the music? “There’s nothing very Korean about K-pop,” says Hong. “A typical K-pop song will have a melody bought from Sweden, the lyrics will be written in house, and the dance choreographers are usually American.” She explains that the head of one of the largest studios told her the key to K-pop is the visuals. “The reason K-pop videos are so mesmerizing is that everyone is moving in this almost super-human synchronicity,” Hong says—the result of seven or eight years of practicing together before performing in public. The control of the stars and vertical integration of the studios allow for slick packages that include albums, music videos, tours, video games, movies, and stage shows. This is where Psy’s success is unexpected. K-pop stars are generally shiny characters created by the studios. Psy doesn’t fit the mold. “He was born with the wrong look,” Hong says. “He was born with the wrong body shape. He has the wrong face. He dresses himself. He writes his own song—in Korea that’s extremely rare—and he doesn’t write about the K-pop themes.” Psy is controversial, but popular, in Korea. “This is a paradoxical example of winning the K-pop game by doing it the American way,” Hong notes. “He is literally the only one.” So when Psy became the global face of Korean pop culture, he also became a symbol of innovation at home. But, Hong says, Koreans are very good at making decisions based on data. While Psy violates many of Korea’s norms, the data point offered by his YouTube dominance is compelling. Thus the man whose greatest fame comes from mocking the aspirations and affectations of Gangnam—the Beverly Hills of Seoul—is now being held up as a model to follow. Yale Insights is produced by the Yale School of Management.\n    \n    © 2007-2023 Yale School of Management ",
    "datetime": null,
    "url": "https://insights.som.yale.edu/insights/can-korea-turn-itself-into-global-pop-juggernaut"
}