{
    "title": "Cashing in on Pop Culture",
    "text": "This story appears in the May 5, 2013 issue of Forbes Asia. Subscribe to Forbes Asia  Credit: Joongang Photo  If 2012 was the year the Korean Wave came ashore around the world, then certainly Lee Jay-Hyun made one of the biggest splashes. His CJ Group is big in Korean entertainment, and at a time when Korean movies and K-pop songs seem to be everywhere, that has helped goose the stock price. Lee's wealth jumped 70%, to $1.7 billion, over the past year, riding an 84% leap in holding company \nCJ Corp\n.'s stock price. He moved up to No. 10 on the list, from No. 22 a year ago. CJ was a darling of investors looking for a safe domestic play in an uncertain year for the customary locomotives of the Korean stock market, the big manufacturing exporters. It generated revenue of $25 billion last year and boasts operations from food services to biotechnology and logistics. “Exporters were usually the main players in the stock market, but last year they posted poor results due to the market situation in developed countries,” says Lee Hoon, who covers CJ for Korea Investment and Securities in Seoul. “But look at the business portrait of CJ: They are domestic players and they are stable and reliable, so most [of the companies] saw earnings momentum and record high share prices.” CJ E&M, the entertainment and media arm, turned in $1.3 billion in revenue and is growing fast. It promotes Korean food, drink, film, music and television shows, leveraging local pride in the country's growing cultural success overseas. Lee's sister, Lee Mi-Kyung, or Miky Lee, heads the unit and led the marketing charge of Korean pop content across Asia. She's hoping for the company's first Hollywood blockbuster, the big-budget sci-fi epic Snowpiercer, being released this summer. Lee may be the biggest percentage gainer on the list, but his uncle, Samsung Chairman Lee Kun-Hee, was the biggest gainer in dollar terms, adding $1.8 billion to his fortune. He came in at No. 1, as he has for every year since FORBES ASIA started compiling a roster of South Korea's richest in 2005. No. 2, Hyundai's Chung Mong-Koo, saw his net worth shrink by $1.2 billion, to $5.4 billion. Overall, the Korean stock market's decline over the past year--the Kospi slipped 3.3%--and the won's very slight decrease against the dollar took a toll on the country's richest. Some 17 fortunes rose, but 18 declined and another 2 fell off the list. The net worths of 3 people came in the same as 2012. There are 22 billionaires, just as there were a year ago. This year we expanded our list to 50 names, from 40 previously. That helped 6 new people make the cut--including a self-made car dealer at No. 37, a casino operator at No. 44 and a second person from Internet company NHN at No. 45. Six returned to the list after missing the cutoff for at least a year. That includes 2--at Nos. 35 and 38--whose poor health got them out of prison but who could be back behind bars if they get better. But the list wasn't long enough for Huh Jung-Soo of GS and solar company OCI's Lee Soo-Young, who dropped off. --with Andrew Salmon in Seoul  ",
    "datetime": null,
    "url": "https://www.forbes.com/sites/johnkoppisch/2013/04/24/cashing-in-on-pop-culture/"
}