{
    "title": "Cashing In on Asia’s Red Carpet Economy | BoF",
    "text": "Agenda-setting intelligence, analysis and advice for the global fashion community. SHANGHAI, China – Li Yuchun has become something of a red carpet darling. The androgynous songstress and star of blockbuster films \"Flying Swords of Dragon Gate\" and \"Monster Hunt 2\" has been making adventurous appearances at this year's Cannes Film Festival wearing Gucci and a striking spiral ensemble from Jean Paul Gaultier. But it wasn't too long ago that this friend and muse of designers such as Riccardo Tisci and Alessandro Michele was making her Cannes debut, fresh faced and looking to make a splash with a special red carpet look to get the industry talking. In 2013, Leaf Greener, then still the fashion editor of Elle China, agreed to help Li, who is also known by her English name Chris Lee, with her Cannes debut. \"I contacted Givenchy PR and organised for her to wear haute couture Givenchy.  She was the first Asian celebrity to wear haute couture Givenchy,\" Greener recalls. The moment was a coup for both Li and Greener – and a turning point for Asian celebrities on the global red carpet circuit. “In the past five years, a lot of people have gotten involved in celebrity styling but before that, celebrities in China didn’t even have stylists, they dressed themselves,” she adds. Celebrity stylists such as Rhea Kapoor (whose Bollywood superstar sister Sonam Kapoor made waves on the red carpet with an elaborate, midriff-baring Ralph & Russo dress) and Lucia Liu (who dressed China's Ma Sichun, also known as Sandra Ma, in a closely tailored, layered pant suit) made an impression this month in Cannes. Korean celebrities hit the global stage earlier, having ridden a global K-wave of popularity across Asia and made names such as Lee Hye-young, Daniel Henney and Kim Sung-soo red carpet staples.  All three are clients of Korea's original celebrity stylist, Yun-kee Jeong. “Yun-kee has so many stories about how much he went through to get dresses from brands that were not yet distributing in Korea or were not bought by stores because they were too much of a ‘show piece’,” says Inhae Yeo, the Korean director of Oikonomos agency. Asian cinema flexes its muscle Asian films are causing major buzz on the French Riviera this month, with Jia Zhangke’s \"Ash is the Purest White\" starring wife Zhao Tao, in contention for the Palme d'Or, alongside Japanese film, \"Asako I & II\" starring doll-faced beauty Erika Karata. Also making its premier at the festival is the timely Korean thriller, \"The Spy Gone North.\" When Cannes kicked off earlier this month, news broke that China’s film market surpassed North America’s in quarterly box office revenue for the first time, taking 20 billion yuan ($3.14 billion) from January to March. And they did it easily, according to domestic industry tracker Maoyan, raking in 42 percent more than the $2.22 billion gross Box Office Mojo reported North American theatres made during the same period. Celebrity culture has gate-crashed our lives with a vengeance. And as Asia’s cinematic accomplishments grow, more international brands are lining up to dress Asian celebrities on red carpets around the world. “It doesn’t make a difference if it's California or Kolkata, it’s the same everywhere,” says Indian stylist and television host Rishi Raj. “Celebrity culture has gate-crashed our lives with a vengeance, especially with the leaps social media has taken over the last few years. Fans, and non-fans alike, follow every move of the celebrity, whether it’s at the airport or on the red carpet.” A-List actress Carina Lau has been gracing red carpets in Asia and around the world for decades. Her name is regularly among the best actress nominees at events such as the Golden Horse awards and Hong Kong Film Awards. She won the latter in 2011 for her role as Chinese Empress Wu Zetian, a feat she has reprised multiple times as part of the \"Detective Dee\" series of films. “The Asian and Chinese cultures are now shaping the red carpet scene [now],” Lau says. “Due to rapid social change and development in fashion and movies [in China], celebrities get worldwide attention for their choice of clothing and film roles. It reflects that their social status is rising and being recognised by the international fashion world.” Lau’s most acclaimed role on the international stage was as an abandoned housewife in the 2013 film, \"Bends\", which garnered her an acting nod at Cannes that year. Luxury brands battle for celebrity contracts Many of Asia's biggest stars are already tied to designer labels via lucrative endorsement contracts – Angelababy to Dior, for example, or Yang Mi with Michael Kors – but the right look on the right star on the red carpet can have a huge impact on smaller brands who don't necessarily have the same footprint in the Asian region. \"Couture brands such as Elie Saab or Oscar de la Renta with little to no presence in China have made themselves famous to Chinese consumers thanks to celebrities wearing them at international events,\" explains Louis Houdart, CEO of China-based branding agency Creative Capital. Sonam Kapoor at the 71st annual Cannes Film Festival | Source: Getty Sonam Kapoor at the 71st annual Cannes Film Festival | Source: Getty Sonam Kapoor at the 71st annual Cannes Film Festival | Source: Getty Both designers have proven favourite red carpet choices of Fan Bingbing, arguably the biggest Chinese film star of them all, who balances her mega-watt appearances between major brands and more niche offerings. This year's Cannes Film Festival has seen her trot out in a metallic, one-shouldered Alexis Mabille gown and tiered tulle from Ali Karoui. According to the co-author of the book \"Celebrity Culture and the Entertainment Industry in Asia,\" Tommy Tse, “asian celebrities now have complex, distant-yet-intimate online relationships with their fans via social media. Their strong fame and emotional bonding among Asian fashion consumers [is due to] cultural proximity, familiarity, similar body types and a sense of pride.” Big opportunities on the Asian film circuit Beyond the international, jet set glamour of Cannes, local red carpet events in Asia are growing in stature making them valuable marketing vehicles for Asian brands looking for greater visibility. Festivals such as Korea’s Busan Film Festival, due to be held this year in October, should rank highly on a brand’s calendar, as a well-regarded industry event and because of the influence Korean celebrities have traditionally had beyond their own borders over the region more broadly – the K-Wave is still strong from Singapore to Thailand, Taiwan and Mainland China. Though it would seem a logical focus, according to Cindy Hanh, executive director of Concept Korea, a government initiative to promote Korean fashion at home and abroad, fans from around the region looking to Korea’s fashion icons aren’t necessarily looking to their red carpet looks for direct inspiration.  It is more of a brand building exercise. “The problem is that, in Korean culture, we don’t have that many formal or gala events, so people don’t have any occasions to wear evening dresses. Although we enjoy seeing these red-carpet styles, it doesn’t translate into the market. It’s different from the U.S. or China.” Likewise, long-running and regionally important film awards nights and festivals in Hong Kong, as well as Taiwan’s Golden Horse film awards – with 55 years of history and held in November each year – are important to the Chinese-speaking world, but their importance in comparison to Mainland events is diminishing as the power of the film industry and consumer power in the latter increases. Brands should pay more attention to red carpet events happening in Hong Kong, “Traditionally the Oscars and Cannes have been the biggest events, however with the rise of China, as well as the Chinese movie industry, heavy investments and government push into the 'Made in China 2025' there is no doubt that Chinese movie festival like the one in Shanghai will keep growing and Chinese celebrities will be even more influential for Chinese consumers than the foreign events,” Houdart says. Though major red carpet players such as Giorgio Armani and Dior are a common sight on the red carpet at Asia's major film events, the opaque nature of the nascent film business in countries such as Japan and Korea and the still-developing culture of celebrity stylists, agents and studios (especially in China) can make it difficult for international brands to access and navigate the local red carpet economy. “I believe that international labels are [becoming more] aware of events from different regions,” Carina Lau says, citing a dress Ralph & Russo lent her for the Asian Film Awards.  “[But brands] should pay more attention to red carpet events happening in Hong Kong, because what celebrities wear can represent the brand significantly. It’s also a great way to get media exposure and visibility.” Growing competition from local designers Some Asian brands have long an advantage in dressing Asian celebrities for Asian events. Taiwanese label Shiatzy Chen has long leveraged its local connections to feature prominently at red carpet events around the region. “[At the] Hong Kong, Shanghai and Taiwan film awards, we had lots celebrities in Shiatzy Chen because of our stronger relationship in the local market.  Asian press are more willing to support and emphasize the brand story. We don’t want to miss any occasion because we have our main market here,” Shiatzy Chen CEO Harry Wang explains. In India, where the Bollywood’s unique infrastructure and rising consumer power have combined to draw the attention of luxury brands to red carpet events in Mumbai and Delhi, there has been a shift from predominantly local labels and silhouettes, to a more international flavour. “I remember, hopefully correctly, it was Preeti Zinta in a minimalistic Gauri & Nainika gown, that made her stand out in a sea of razzle dazzle at a film awards event, and since that season, more and more stars started opting for cleaner, westernised silhouettes,” stylist Rishi Raj recalls. “There are a few who are known for sticking to a sari, whatever the occasion, and working the red carpet as beautifully as they would in a gown.” True to form, on this year's Cannes red carpet, Bollywood beauties have had a big impact wearing a mix of homegrown and international designers, with former beauty queen Aishwarya Rai Bachchan wearing an orange jacket from Manish Arora one day and a head-turning ultra-violet, Swarovski encrusted gown from Dubai-based Filipino designer Michael Cinco the next. Deepika Padukone meanwhile chose looks from Ashi Studios, as well as a plunging Alberta Ferretti number and Mallika Sherawat joined the \"naked dress\" trend at this year's festival with her Tony Ward gown. For Chinese brands, Harry Wong believes the future looks bright for more red carpet collaborations as the management system matures for Chinese celebrities. “The benefit we have as an Asian brand is that we have built a strong local in-house communication team with professional experience in China. They are growing up with the market, and they are responsible to maintain the relationship with different stylists and celebrities’ teams, to understand their expectations for the red carpet and special events,” he says. Christopher Bu, celebrity stylist to megastar Fan Bingbing turned designer, agrees that the rising professionalism of the Chinese fashion and film industries will only improve the status of the red carpet here moving forward. “Actually, we’re still in the development stage, there are many things that we may need to improve and learn. [But] now you can see that the red carpet at domestic festivals is getting better and better,” Bu says. Related Articles [ The Cult of the Catwalk Celebrity ] [ The Digital Asia Effect ] [ Kris Wu: China's Influencer 'Triple Threat' ] © 2023 The Business of Fashion. All rights reserved. For more information read our Terms & Conditions At the latest edition of China’s top fashion week, brands adapted their designs for a more value-minded shopper as retail buyers prepared for a softer local market. As the country’s economy moves into deflationary territory, manufacturing output declines and a real estate crisis worsens, some consumers are becoming increasingly cautious. Its flagship brand struggled following the departure of its creative director but better growth was seen at other labels. After years of outsized growth in prestige cosmetics, consumers have pulled back on the typically recession-proof category. The essential daily round-up of fashion news, analysis, and breaking news alerts. Our newsletters may include 3rd-party advertising, by subscribing you agree to the Terms and Conditions & Privacy Policy.   ",
    "datetime": null,
    "url": "https://www.businessoffashion.com/articles/china/cashing-in-on-asias-red-carpet-economy/"
}