{
    "title": "Chang: The 'K-wave' is bringing Canada and Korea together | Ottawa Citizen",
    "text": "Words of Korean origin are rapidly entering the Canadian lexicon. We are trading partners. Our two cultures are intertwined. We are allies in peace. Capturing the number one spot in Canada and more than 90 other countries, the Netflix K-drama Squid Game has become a global phenomenon. As the ambassador of the Republic of Korea to Canada, I have observed a noticeable uptick in the popularity of Korean culture, be it K-pop, K-drama, or K-cinema; the craze for all things Korean is indeed putting the global spotlight on Hangeul (the Korean language). Subscribe now to read the latest news in your city and across Canada. Subscribe now to read the latest news in your city and across Canada. Create an account or sign in to continue with your reading experience. Don't have an account?  Create Account The growing popularity of K-pop has made the word “Maknae,” which refers to the youngest person in a group, also universal. Words of Korean origin are also entering the Canadian lexicon, with 26 words included in the Oxford English Dictionary. In addition, other Korean words such as “Kimchi” and “Bibimbap” are so common place that they are now a mainstay in Canadian English. Korea has a deep and longstanding relationship with Canada, and Canadians learning Korean no doubt fosters interpersonal exchanges which ultimately lead to a more robust mutual understanding between our two countries. We are trading partners. We are a connected people. Our two cultures are intertwined. We are allies in peace. I would like to pause and recognize the sacrifices of brave Canadians who fought and died in Korea. We honour their memory and extend our deep thanks for their service. This year, we commemorated the 70th anniversary of the Battle of Kapyong, a defining moment in Canada’s military history and a key chapter in the story we share as partner countries. Our common values and historical bonds shape collaborative endeavours in the cultural sphere. As the influence of Korean popular culture grows, so does the number of Canadians pursuing Korean language courses, which has increased exponentially. Since its establishment in 2016, the Korean Cultural Centre in Ottawa has offered various levels of Korean language courses. The KCC upgraded and shifted its language programs online, reaching an even larger demographic. And during the same year, due to increased demand from students, Carleton University launched a Korean language minor program. Likewise, Korean language courses are now offered in more than 50 Canadian public schools across Canada. In fact, Hangeul has become the seventh most spoken language in the world. King Sejong, the fourth king of Korea’s Joseon Dynasty, invented Hangeul in the mid-15th century. Prior to the creation of Hangeul, Koreans utilized Chinese characters to write, which was far too complex for the lower-level classes to learn, as they were deprived of the privilege of education. King Sejong, who had devoted his reign to the wellbeing of all his people, created the Korean alphabet as a means for people from all socio-economic classes to easily learn the language. As a result, many newcomers often find it easy to learn how to read and write Hangeul, as compared to other more difficult languages. Canada is a multicultural and welcoming country: it embraces newcomers, supports their integration, and proactively encourages the promotion and understanding of different cultures. The official designation of “Asian Heritage Month” and “Ontario Korean Heritage Month” is a prime example of this. About 200,000 Canadians identify as Korean. Considering the growing demand for Korean language courses across Canada, second and third-generation Korean immigrant families will likely serve as ambassadors to expand cultural learning exchanges between Korea and Canada. I look forward to building on the growing popularity of the K-Wave, by expanding and promoting Korean language learning opportunities across Canada. It is my hope that this will foster greater interest in Korean culture, a deeper appreciation of our shared history with an eye on the future as we continue to foster the strong bond between our two nations. Chang Keung Ryong is ambassador of the Republic of Korea to Canada. Postmedia is committed to maintaining a lively but civil forum for discussion and encourage all readers to share their views on our articles. Comments may take up to an hour for moderation before appearing on the site. We ask you to keep your comments relevant and respectful. We have enabled email notifications—you will now receive an email if you receive a reply to your comment, there is an update to a comment thread you follow or if a user you follow comments. Visit our Community Guidelines for more information and details on how to adjust your email settings. To contribute to the conversation, you need to be logged in. If you are not yet registered, create your account now - it's FREE. 365 Bloor Street East, Toronto, Ontario, M4W 3L4 © 2023 Ottawa Citizen, a division of Postmedia Network Inc. All rights reserved. Unauthorized distribution, transmission or republication strictly prohibited. This website uses cookies to personalize your content (including ads), and allows us to analyze our traffic. Read more about cookies here. By continuing to use our site, you agree to our Terms of Service and Privacy Policy. ",
    "datetime": null,
    "url": "https://ottawacitizen.com/opinion/chang-the-k-wave-is-bringing-canada-and-korea-together"
}