{
    "title": "Chasing eternal youth in Seoul’s Beauty Belt - The Globe and Mail",
    "text": "This article was published more than 10 years ago. Some information may no longer be current. Members of K-Pop idol group Girls' Generation perform during the Korean Pop Culture and Art Awards In Seoul.Jo Yong hak/Reuters Mandy Liu looks like she can afford almost anything she wants. A trader from the Chinese special administrative region of Macau, she arrives in Seoul's trendy Gangnam neighbourhood wearing diamond earrings, a thick diamond wedding band and a matching watch. And what the 50-year-old with the auburn-dyed hair wants now is wider eyes, without the surrounding wrinkles. Maybe new breasts, too. That's why Ms. Liu came to South Korea. \"Korean cosmetic surgery is the most famous in the world. Everybody wants to go to get their cosmetic surgery done here,\" she says, draped in a blue dressing gown after a consultation at the premier BK Plastic Surgery Hospital. \"Also, you can do some tourism after.\" They call it the Beauty Belt, a stretch of downtown Seoul that's home to more than 200 cosmetic-surgery clinics. After decades of widening Korean eyes and reshaping Korean noses, Seoul is famous as the most \"remade\" city on the planet. Now the Beauty Belt is an international tourist attraction, luring an estimated 150,000 extra visitors to Seoul last year alone, nearly double the 82,000 medical tourists who came in 2010. It's an all-looks lifestyle that South Korean singer Psy mocked in his runaway hit song Gangnam Style, written about the neighbourhood in which the Beauty Belt is located. And not even the threat of a war, which North Korean leader Kim Jong-un has repeatedly warned is imminent, can keep the cosmetic-surgery tourists away any more. Most of those who come to Seoul for double-eyelid surgery – an eye-widening procedure that's most popular with Beauty Belt customers – are Chinese. They're here because they've seen Korean singers and movie stars on their television sets and computer screens and want to look more like their heroines (95 per cent of the patients at the BK clinic are women). It's something they can't imagine when watching Hollywood actresses. The tourist influx is a victory for the South Korean government's determined effort to spread South Korean culture – in the form of its well-made television shows and movies, as well as its saccharine pop stars – throughout Asia. Seoul provides loans and credit worth more than $300-million a year to companies that export Korean culture and food, betting on a payback in tourism and trade. The strategy has been wildly successful. Go to a movie theatre in Bangkok or Jakarta, and the main competition for Hollywood films is usually South Korean. Climb into a Beijing taxi, and the driver might be watching sexy Korean pop (or \"K-Pop\") music videos. Collectively, the easy-on-the-eyes cultural offerings are known across Asia as hallyu, or the Korean Wave. \"The main reason they come here is they can't ignore the K-Pop fever. It's so widespread and it's changed a lot of people's definition of beauty. A lot of people have recognized that Asians are pretty because of K-Pop stars. They also know that a lot of K-Pop stars have had cosmetic surgery,\" said Julie Kang, who works in the international marketing department of the BK Plastic Surgery Hospital. Ms. Kang, whose own TV-star good looks are partly attributable to having had double-eyelid surgery and a nose job herself, said that a fifth of the 80 clients who come to the 16-storey clinic every day are now foreigners. Chinese make up the lion's share of the new clientele, but Southeast Asians from Singapore, Vietnam, Indonesia and Malaysia are also increasingly common, she said. In addition to English and Chinese speakers, the clinic now has Japanese, Vietnamese and Mongolian translators on staff. Many plastic-surgery tourists also come from Canada and the United States, though almost all of them are Korean-Canadians or Korean-Americans, Ms. Kang said. South Korea's plastic surgeons occupy the enviable position of being surrounded by a huge Asian market where millions are now rich enough to consider luxuries like cosmetic surgery. At the same time, competition between Seoul's 5,000 clinics is so fierce that it keeps prices down to roughly two-thirds of what the same procedures might cost in the United States. And, particularly in China, there are horror stories of plastic surgery gone wrong; this is driving people to spend the extra cash to fly to Seoul to get the procedure done safely and properly. The next client into the BK clinic's consultation room after Ms. Liu is a 30-year-old woman from China's northeastern Jilin province who is hoping to have a bungled eye operation fixed by a South Korean doctor. Shin Yong-ho, the hospital's director and chief surgeon, grimaces when asked about some of the cosmetic surgeries done in China. \"They're very, very unusual,\" he says, explaining that he's seen scars in places where no properly trained cosmetic surgeon would ever cut. \"In China, this field is very, very underdeveloped.\" The 50-year-old surgeon said many South Korean doctors are opening private cosmetic-surgery clinics because the country's universal health-care system – where the government sets fees and pays for most procedures – leaves little room for doctors to make money for themselves. While Dr. Shin is a government-certified plastic surgeon, many of those who operate in the Beauty Belt are obstetricians, gynecologists, orthopedic surgeons and even general practitioners who quit their posts in the state medical system to cash in on the plastic-surgery craze. Plastic surgery is now so common in South Korea that women in cafés will openly discuss the procedures they've had or are thinking of having. When Dr. Shin goes out for dinner, he braces himself for the inevitable questions about what kind of nipping and tucking he thinks the women at the table should have done. Many of his patients, particularly those from China, come in clutching photographs of K-Pop stars, most often a member of the multimillion-selling Girls' Generation band, which is a collective of nine shimmering Korean women in their early 20s. But plastic surgeons can only do so much, Dr. Shin says. \"It's an impossible dream.\" Follow Mark MacKinnon on Twitter: @markmackinnonOpens in a new window Report an error Editorial code of conduct Build your personal news feed Build your personal news feed © Copyright 2023 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO ",
    "datetime": "2013-03-22T20:16:25-0400",
    "url": "https://www.theglobeandmail.com/news/world/chasing-eternal-youth-in-seouls-beauty-belt/article10242906/"
}