{
    "title": "Chicago preschool applications open April 30 - Chalkbeat Chicago",
    "text": "Chicago will start taking applications for public preschool on April 30, and it will offer 2,250 more seats than are available in the current school year. Those seats, offered for free and concentrated in public schools across 28 South and West side neighborhoods, are the first wave of Mayor Rahm Emanuel’s universal pre-K expansion. The bulk of the new seats are intended for families whose children will turn 4 by Sept. 1. Among the neighborhoods that will see the most new seats next year are Logan Square, Humboldt Park, Avondale, and Lawndale. The city’s early learning portal, where families go to submit applications, offers a menu of preschool options at both schools and at community-based providers. The universal pre-K rollout is intended to expand seats at both; however, community providers have complained that the universal pre-K rollout has caused their enrollment to dwindle, as families defect for seats at schools. Chicago will continue to offer half-day programs for 3-year-olds, but there will be fewer available in schools. The idea is that, while schools bulk up programs for 4-year-olds, community centers can enroll more 3-year-olds in full-day programs, which will help offset their enrollment losses to schools. The city is also steering a new wave of grants toward community providers to help open up more seats for even younger children — infants and toddlers — with emphasis on low-income families who currently aren’t enrolled in formal care. Chicago will spend $24.4 million to open 135 new pre-kindergarten classrooms next year, part of outgoing Mayor Rahm Emanuel’s plan to make pre-K available and free for all 4-year-olds across the city by 2021. The $175 million rollout will span four years, with 28 neighborhoods offering the program next school year, followed by 35 more in 2020-21, until every community in the city offers free pre-K options by 2021-22. Chicago intends to hire more than 1,000 more preschool teachers by 2021. Even as universal pre-K expands the number of free seats, families still encounter a complex menu of options depending on where they live, the age of their children, and their household income. While the universal pre-K wave will offer free seats in some schools, others will continue to charge tuition for 3- and 4-year-olds. Eleven popular elementary schools on the North Side will continue to operate tuition-based programs. The school district also operates four high-demand magnet preschools on the North Side that are free but accept families by lottery. Applications were due in December through the school district’s GoCPS online portal for acceptance to Suder, Inter-American, Mayer, and Drummond, all on the North Side. Families are to be notified with those offers on Monday. Click here to see which neighborhoods are part of the first expansion wave. Have questions? Submit them in the form below.   By signing up, you agree to our Privacy Notice and European users agree to the data transfer policy. You may also receive occasional messages from sponsors. ",
    "datetime": "2019-04-22T20:20:04",
    "url": "https://chicago.chalkbeat.org/2019/4/22/21108016/chicago-will-start-taking-universal-pre-k-applications-on-april-30"
}