{
    "title": "Chinese animation draws Gen-Z crowd - CGTN",
    "text": "Share Copied Vivian Yin, industry expert and former CEO of Fremantle China /CGTN Photo Animated movies, Nezha and Abominable, have been two of this year's biggest box office smashes, with legions of gen Z fans around the world. Apart from both being top billing animated movies, these titles have something else in common; they are both set in China. Whilst Nezha was produced locally by Chinese filmmaker, Yang Yu, and distributed in Mandarin; Abominable was a co-production between Chinese and American film studios; Shanghai-based Pearl Studio and U.S. DreamWorks Animation. The two film giants produced slightly different versions of the film in Mandarin and English to appeal to the different markets. Nezha tells the story of the Chinese mythological deity, and the movie's box office success was fueled by local popularity. It became the highest-grossing animated film of all time this summer, a record which was previously held by Oscar-winning animation, Zootopia. Abominable, the story of a runaway Yeti, took Chinese storytelling to a mainstream, international audience, swooping in at the top of the box office during its opening weekend in America, with around 21 million dollars in ticketing. The Asia TV Forum & Market (ATF) was held this month in Singapore, connecting content sellers and buyers from around the region and further afield. Attendees at the ATF believe that the two Chinese movie's success is part of a wider trend of international demand for Asian stories from the new generation. As younger audiences have more access than ever to content on their personal devices, family televisions, and in movie theatres, there is an insatiable thirst for knowledge. As the international community paddles in the dregs of a K-Wave, there is a ripple of a C-Wave on the horizon. Rob Gilby, Chairman of the Singapore Media Festival Advisory Board /CGTN Photo Rob Gilby, Chairman of the Singapore Media Festival Advisory Board, believes that there are a few positive forces in the industry that are helping propel the likes of Nezha and Abominable up the charts. “Nezha is very popular domestically, so obviously the explosion of the number of cinemas in China over the last ten years has really provided a robust base of the cinema-going public. The development of other media forms, whether it is traditional television, but also digital media, has provided platforms for media. What that means is there is investment going into the sector, and that means the investment is going into people and talent, and skills,'” he said. In terms of Abominable's success, Gilby thinks that it can be replicated. “That kind of collaboration of talent between Chinese talent and U.S. talent to try and tell a story that has global appeal, but maybe is set in China, that's I think where the most interesting opportunities arise.” Another AFT heavy hitter with views on this topic is senior industry expert, Vivian Yin, who recently stepped away from her position as CEO of Fremantle China. Yin believes that it is the younger generation of global content consumers who are ready and willing to devour Chinese content. “When they were growing up, they were born with a mobile, they were born with a laptop. It is completely different. They were exposed to the global news, global entertainment, so they have a much broader horizon than our generation,” she said. Yin also believes that talented young Chinese content creators will inevitably produce films and television suitable for an international audience. “I encourage the younger generation to keep pressing in, keep working on, craft our skillset, craft our way of expression, and to bring the Chinese culture to the global stage more and more.” Bharath Laxmipati, Senior Vice President of Green Gold Animation /CGTN Photo It is not just Chinese content creators benefiting from a shift in the dominance of traditional Hollywood movies to more international and democratized productions. The Indian company, Green Gold Animation, has also struck success with its original animation show, Mighty Little Bheem. Baby Bheem is loved across the globe, with 27 million households outside India watching the show on Netflix. Senior Vice President of Green Gold Animation, Bharath Laxmipati, believes the formula that has proven successful for Mighty Little Bheem can also be applied to the triumph of these top-grossing Chinese animated movies. “When you come with a bouquet of such rich elements, the automatic outcome is that you will have a grand success story. Nezha is a great example of how it showcases Chinese culture, Chinese mythology, and Chinese heritage so beautifully on screen, and that's why it is working,” said Laxmipati. Although some around the world might have been surprised to find Chinese movies on their screens this year, industry watchers were less so. In fact, some experts at ATF believe that this might be the beginning of a long-lasting trend towards Chinese film and television as a younger generation become the main consumers of, and driving force behind, Chinese content creation. Copyright © 2018 CGTN. Beijing ICP prepared NO.16065310-3 Copyright © 2018 CGTN. Beijing ICP prepared NO.16065310-3 Copyright © 2018 CGTN. Beijing ICP prepared NO.16065310-3 ",
    "datetime": null,
    "url": "https://news.cgtn.com/news/2019-12-17/Chinese-animation-draws-Gen-Z-crowd-MrWKql9P0I/index.html"
}