{
    "title": "Chinese tourists, with Korean drama stars in mind, flock to Seoul for cosmetic surgery - The Washington Post",
    "text": "clockThis article was published more than 9 years ago All around the southern Seoul district of Gangnam — the area of conspicuous consumption made famous by the hit song “Gangnam Style” — Chinese women walk down the street with bandages over their faces and around their heads. Some, despite hoodies pulled up and parasols pulled down, are so badly bruised and swollen that they look as if they’ve just survived a car accident — if only barely. They’re riding the latest crest of the Korean Wave: plastic surgery. Korean cultural exports — especially the manufactured “K-Pop” music and schmaltzy soap operas — have become a phenomenon across Asia. There’s a huge following in China, in particular, and an increasing number of fans are coming to South Korea not just for shopping and sightseeing, but also for nips and tucks — and more. \"Naturally, Korean dramas and K-Pop has a lot to do with it,\" said Hong Sung-bum, a plastic surgeon and the director of the BK Hospital, a 15-story building in Gangnam devoted to various kinds of cosmetic additions or subtractions, which employs 30 Chinese-speaking staff. “There are lots of Chinese patients who come here asking to look like a certain Korean Wave star,” he said in his office, still wearing his blue scrubs and rubber clogs. On the desk sat a skull wearing a Burberry-pattern headband. Right now, the hottest look is Jun Ji-hyun, the star of “My Love From the Star,” a soap opera with an unlikely story line: An alien accidentally arrives on Earth 400 years ago, meets an arrogant female pop star and falls in love. Women covet not just Jun’s wardrobe and her lifestyle, but her face, too. But don’t think this is just a female thing. A considerable number of men want to look more like Kim Soo-hyun, who plays the alien character. As the Korean government promotes ever-closer economic relations with China, it is busily promoting a “Korean medical wave.” The Korean Tourism Organization regularly organizes plastic surgery expos in Beijing and Shanghai, where K-Pop singers and dancers perform and women learn how to do their makeup like Korean Wave stars. Groups of doctors offer advice to prospective patients. “We tell them that these people are not just doctors, they’re beauty designers,” said Kim Su-jin, an official at the KTO’s medical tourism division. The Korean surgery craze is part of a broader boom in tourism from China and comes as arrivals from Japan have fallen sharply amid worsening geo­political tensions. According to KTO figures, 56,075 Chinese visitors had medical treatment in South Korea last year, rising 26.5 percent from the previous year and up from just 4,725 in 2009. (Not all of them had plastic surgery: The numbers for 2013 have not yet been released, but almost 10,000 Chinese had plastic surgery in Korea in 2012.) “The Korean dramas definitely had an effect on my decision to come here,” said Xu Xiao Hong, a 28-year-old office worker from Tsingtao, who was visiting the BK clinic during a shopping trip to Korea. “I think Korean actresses are very beautiful,” she said. Carefully made up and trendily dressed in short shorts and platform sandals, she cut a stylish figure. What’s more, she had a megawatt smile. But Xu said she had a complex about her cheekbones. They were too prominent, she said, and she wanted to find out about having them fixed. “Normally it doesn’t bother me, but when I see myself in photos, all I can see is my cheeks,” she said in one of the consultation rooms at BK. She is getting married next year and wants her wedding pictures to be perfect. Her fiance — who, she said, had no complaints about her appearance — knew she was in Korea but not that she was consulting a plastic surgeon. “If the consultation goes well, I will talk to my boyfriend and my parents about it,” she said. “It’s a pretty big operation.” Indeed, it is. While the most common procedures are operations to make Caucasian-style double-eyelids (with clinics charging $700 to $1,500) and nose jobs ($1,500 to $4,500), a sizable proportion of patients, like Xu, want “facial contouring” — invasive surgery that involves shaving or chopping away bones. One particularly common procedure — which Hong, the surgeon, calls “super smile surgery” — is for patients who think their chins are too prominent. It involves cutting whole sections out of their jawbones so that their entire mouth and chin can be pushed back. Although it takes only three hours, the recovery takes a good six months. There have been reports of women suffering from severe complications — such as jaws that no longer meet — and even deaths during some of the more invasive operations. But Hong says the most common risk is patient dissatisfaction. “This is not a clothing store where you can shop for the clothes that Jun wears,” Hong says. “When a patient comes in and says that they want to look like her, we go through a consultation process and try to find a halfway point.” The Korean plastic surgery craze creates big business in China, too. Chinese travel agencies offer tour packages that combine several days of sightseeing with longer periods of plastic surgery. Ocean International Travel Service offers a typical five-day tour for about $1,000, surgeries not included. The plastic surgery industry has become so dominant in Gangnam that some intersections feature clinics on all four corners. The underpasses to the subway station are wallpapered with ads for cosmetic enhancements. Sitting up in a hospital bed in a recovery room at BK, with a blue mask over her mouth and a drip in her arm, Chen Mao said she started aging more rapidly when she hit 35 three years ago and wanted to do something about it. She had fat from her midriff injected into her face to smooth out the lines, a procedure that she said appealed to her because it didn’t involve going under the knife. “I want to look more youthful, and with this procedure, I can have a better texture,” Chen said, patting her bandages. On this trip, she’s been seeing some tourist sites, doing a lot of shopping and eating in nice restaurants. “I’ve done a lot to help the Korean economy,” she laughed, estimating that she had spent a total of $8,000. As with Xu, it was the Korean Wave that washed her ashore here. “I know that Korean celebrities’ beauty is not natural, and I know that they all have their surgeries done in Gangnam,” she said. “So I wanted to be like them and invest my time and money here, too.” Hallie Gu in Beijing contributed to this report. ",
    "datetime": "2014-08-27T00:55:22.000Z",
    "url": "https://www.washingtonpost.com/world/chinese-tourists-with-korean-drama-stars-in-mind-flock-to-seoul-for-cosmetic-surgery/2014/08/26/6f91c23b-cdae-4d27-aff3-d10fd634e2f4_story.html"
}