{
    "title": "China’s DMG, Korea’s CJ to Co-Produce TV Drama ‘Sweet City’  – The Hollywood Reporter",
    "text": "Subscribe for full access to The Hollywood Reporter Subscribe for full access to The Hollywood Reporter An adaptation of bestselling South Korean novel \"My Sweet City,\" the series will star Henry from popular K-pop boy band Super Junior. By \n\n\tPatrick Brzeski Asia Bureau Chief China’s DMG Entertainment, co-producer of Iron Man 3, is ramping up its recent push into international TV, partnering with Korea’s CJ E&M to develop and produce the romance series Sweet City, starring K-pop star Henry (aka Liu Xianhua) from South Korean boy band, Super Junior. It will be Liu’s acting debut. While DMG is best known for its Hollywood co-productions, Looper and Iron Man 3, along with Chinese hits Founding of a Republic (2009) and Go LaLa Go (2010), the company has been expanding its activity in TV. On Wednesday, the DMG signed an agreement with Washington FilmWorks to develop, produce and shoot a Chinese-language TV drama on location in Seattle for later broadcast by CCTV.  PHOTOS: What TV Viewers Really Want CJ E&M, South Korea’s largest entertainment conglomerate, has several joint venture initiatives underway in China, including cinema construction projects across the country, and co-production of director Park Kwang-hyun‘s sci-fi fantasy The Fist, with $20 million of investment from China Film Group and Pegasus & Taihe Entertainment. “We are very excited to be working with the team from CJ. It’s a great opportunity to enhance the close ties between the two countries, while adding a dash of DMG style to the Chinese TV market,” said Wu Bing, DMG president and executive producer of “Sweet City.” An adaptation of South Korean author Jeong Lee Hyeung‘s bestselling novel, My Sweet City, the drama series will have built-in appeal for the South Korean market. The first edition of her book sold 250,000 copies and went on to top the country’s best-selling lists with a record 65 reprints. STORY: China’s DMG to Shoot CCTV Drama in Seattle “In order to cater to the tastes of Chinese fans, DMG’s TV development team has revised and updated the story to give it more of a Chinese sensibility,” said Bing. Henry will play the role of a talented teenager who drops out of school to follow his dreams. DMG says it developed the character’s playful style and attitude to match Henry’s off-screen persona in Super Junior. The two companies say they hope the project will be the first in a line of collaborations, as they seek to instigate a “new Korean Wave in Chinese TV.”  Related Stories\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tRelated Story\n\t\t\t\n\n\n\n\t\n\t\t\n\t\t\t\t\tJohnny Depp’s ‘Transcendence’ Scores China Partner DMG Entertainment\t\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tRelated Stories\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tRelated Story\n\t\t\t\n\n\n\n\t\n\t\t\n\t\t\t\t\tWhat TV Viewers Really Want\t\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tRelated Stories\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tRelated Story\n\t\t\t\n\n\n\n\t\n\t\t\n\t\t\t\t\t'American Pie'\t\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tRelated Stories\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tRelated Story\n\t\t\t\n\n\n\n\t\n\t\t\n\t\t\t\t\tChina's DMG to Shoot CCTV Drama in Seattle\t\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tRelated Stories\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tRelated Story\n\t\t\t\n\n\n\n\t\n\t\t\n\t\t\t\t\tSteve Carell in Foxcatcher Trailer Screengrab - H 2013 Sign up for THR news straight to your inbox every day Sign up for THR news straight to your inbox every day Subscribe for full access to The Hollywood Reporter Send us a tip using our anonymous form. ",
    "datetime": "2013-11-15T04:36:28+00:00",
    "url": "https://www.hollywoodreporter.com/news/general-news/chinas-dmg-koreas-cj-produce-656320/"
}