{
    "title": "Church donates backpacks filled with $50K worth of food to school",
    "text": "NEW ALBANY, IN (WAVE) – Students at one middle school went home with two backpacks on Friday. Thanks to Graceland Baptist Church, members handed out $50,000 worth of food to help keep families fed over the weekend. Nearly 1,000 backpacks were filled with essential food items for each student at Hazelwood Middle School. Each bag weighed about 20 pounds. Two semi trucks and a forklift were needed to complete a mission that has been weeks in the making. [MORE: Louisville honors Sept. 11 victims, heroes]\"We wanted to partner with a local school and we realized that Hazelwood had a need and we wanted to fill that need and we also saw some areas we could help and the backpacks could be a blessing,\" Graceland Baptist Church Senior Pastor Ray Green said.Graceland launched Operation Backpack this year. Green said it wasn't hard to get people to join in. \"This last week we saw hundreds of volunteers come together at our facilities to put this together in corporation with Meijer, so it's just a great effort,\" Green said.A total of $50,000 made it possible to fill the 1,000 backpacks with $50 worth of food, so each student would get to take one home. \"This is a one-time thing they wanted to do and sort of reach out and form a bond with our school and what's been nice in conversations with a lot of them, they want to come back and mentor and tutor some of our students, so it's been a wonderful opportunity for us,\" Hazelwood Principal Jessica Waters said. Nearly 70 percent of students are on free or reduced lunch, so to Waters, she knows this gift will be a tremendous help.  \"What's nice is, it's going to all of students, even though some of them might need it a little more, it's going to everybody,\" Waters said.For those who don't need it, she's confident it will find its way to someone who does. \"Some of our parents have stated, thank you so much for the opportunity, but we are going to pay it forward,\" Waters said.That's a lesson that cannot be taught in books, but demonstrated by example. \"The scripture talks about how the son of man did not come to be served, but to serve, and that's what we are trying to do. We are just trying to model after his example,\" Green said. Graceland Baptist Church hopes to carry this mission forward in years to come. Copyright 2015 WAVE 3 News. All rights reserved. ",
    "datetime": "2015-09-12T00:06:37Z",
    "url": "https://www.wave3.com/story/30011899/church-donates-backpacks-filled-with-50000-worth-of-food-to-middle-school/"
}