{
    "title": "CJ CGV launches into Myanmar circuit | News | Screen",
    "text": "By Jean Noh2014-12-02T11:26:00+00:00 South Korean exhibitor will start running Junction Cineplex in Myanmar from Dec 6. Major South Korean exhibitor CJ CGV is launching into the Myanmar multiplex circuit. The company announced today (Dec 2) the Burmese government has authorized their investment and they have established a joint venture with local corporation Shwe Taung Development (STD) to start running Junction Cineplex from Dec 6. The first multiplex in Myanmar, Junction Cineplex was established in 2009 by Shwe Taung Group in the capital city of Naypyidaw. With an expansion to the country’s economic centre of Yangon, Junction Cineplex now has three cinemas with a total of six screens that account for approximately 15% of the Burmese box office. Jeong Seo, CEO of CJ CGV, said “the [South Korean] domestic exhibition market has more or less reached saturation” and that “CJ CGV is making global expansion a top priority”. CJ CGV was the first South Korean exhibitor to launch into the China market in 2006 and they now have 33 cinemas there, one in the US, 18 in Vietnam and 12 in Indonesia. The company notes that with Myanmar opening up its economy and Western countries dropping sanctions in recent years, foreign investment has increased “explosively” and 7% economic growth by 2018 is forecast. The country has over 50 million people in a population that skews young. CJ CGV notes they only have around 70 screens and last year’s box office total was $9m. The exhibitor sees growth potential because there are not many entertainment options in the country and the preference for cinema seems high. That the Southeast Asian country has also been hit with the Korean Wave of TV dramas and K-pop apparently is also a factor for the Korean company with diverse entertainment media and distribution affiliates. 2023-10-25T20:13:00Z\nBy Michael Rosser The acclaimed director will no longer make ‘On The Shulan River’. 2023-10-25T09:42:00Z\nBy Ben Dalton Bookmark this page for the latest updates in the territory. 2023-10-24T14:59:00Z\nBy Michael Rosser The latest instalment in the classic monster franchise will open on December 15. 2023-10-26T07:00:00Z\nBy Rebecca Leffler First slate to include Rachel’s Game, Oldies But Goodies, Survive. 2023-10-26T07:00:00Z\nBy Ben Dalton 101 VP of international sales Eoghan Burke will sell the films at AFM. 2023-10-25T21:35:00Z\nBy Jeremy Kay ”We will be meeting across the table with the CEOs tomorrow.” Screen International is the essential resource for the international film industry. Subscribe now for monthly editions, awards season weeklies, access to the Screen International archive and supplements including Stars of Tomorrow and World of Locations. Site powered by Webvision Cloud ",
    "datetime": null,
    "url": "https://www.screendaily.com/news/cj-cgv-launches-into-myanmar-circuit/5080566.article"
}