{
    "title": "CJ companies to build 'hallyu-themed' cultural facilities near Seoul | Yonhap News Agency",
    "text": "All Headlines North Korea Sports Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies URL is copied. SEOUL, June 19 (Yonhap) -- CJ Group companies are planning to build two massive cultural facilities themed after \"hallyu,\" or the Korean Wave of popular culture, just northwest of Seoul, company officials said Wednesday. CJ ENM, an entertainment and mass media giant owned by CJ Group, has agreed to build the cultural facilities covering about 210,000 square meters in Paju, about 30 kilometers northwest of Seoul, by June 2023, the officials said. CJ ENM and the city of Paju signed an agreement last Wednesday on the construction of the facility tentatively named CJ ENM Content World within Paju Unification Park, they said. This photo taken June 12, 2019, shows a signing ceremony between CJ ENM and the city of Paju on the construction of CJ ENM Content World. (Yonhap)  CJ ENM Content World will feature about 20 studios, including a large studio, a special shooting studio, a permanent studio, experiential sightseeing facilities and outdoor open sets. In addition, the facility will house a historical drama set, a period drama set and a K-pop open set, they said, adding that construction for the 320 billion-won (US$272 million) facility, the size of 32 football fields, will commence next month. Company and municipal officials expect the content world to create 21,700 new jobs in facility construction and content production and management over the next decade, in addition to a positive effect of 2.26 trillion won. The outdoor open sets are also expected to attract about 1.2 million tourists annually. This rendering, provided by CJ LiveCity Corp. on June 10, 2019, shows the state-of-the-art arena to be built in Goyang, northwest of Seoul. (PHOTO NOT FOR SALE) (Yonhap)  On June 10, another CJ Group company, CJ LiveCity Corp., announced an agreement with the global entertainment firm Anschutz Entertainment Group (AEG) to build a state-of-the-art arena in Goyang, just northwest of Seoul. The 20,000-seat arena will serve as the country's leading live performance venue for K-pop stars, international artists and sports events, the company said. CJ LiveCity said the arena will combine CJ's expertise in cultural content with AEG's venue management and is expected to bring in more than 20 million visitors annually. Visitors to the arena will be able to watch live performances and the production process of dramas and other TV programs. As soon as the authorities approve its arena project, CJ LiveCity plans to begin the construction this year for its completion in 2024. The arena is about 20 km away from CJ ENM Content World, and the two facilities are also close to the headquarters of CJ ENM in the Sangam district in western Seoul. ycm@yna.co.kr(END) All News National North Korea Economy/Finance Biz Culture/K-pop Sports Images Videos Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies Korea in Brief Useful Links Festival Calendar Weather Advertise with Yonhap News Agency ",
    "datetime": "2019-06-19T10:47:04+09:00",
    "url": "https://en.yna.co.kr/view/AEN20190619002800315"
}