{
    "title": "Clark County K-9 featured in A&E’s ‘America’s Top Dog’",
    "text": "CLARK COUNTY, Ind. (News and Tribune) - K-9 Jago of the Clark County Sheriff’s Office has a wide variety of talents - he can locate missing people, sniff out drugs and help apprehend criminals. But earlier this year, he and his handler, Cpl. Mark Grube, demonstrated some new skills on a national stage. Jago and Grube competed in a new A&E series called “America’s Top Dog,” which premieres at 9 p.m. Wednesday, Jan. 8. Jago, pronounced as “ya-go,” is a 5-year-old Belgian Malinois who has worked as K-9 officer for three years with Grube, a detective and K-9 unit supervisor for the Clark County Sheriff’s Office. In the reality competition, K9s and civilian dogs compete to test skills such as speed, agility, teamwork and scenting as they complete a series of tasks on a large obstacle course. For Grube, the news came as a total surprise. He wasn't aware that Clark County Sheriff Jamey Noel had nominated them for the competition until April, when the sheriff informed him that he and Jago were picked to compete. They were one of 50 teams selected out of about 900 nominees. \"At first, I thought [Noel] was joking. I didn’t know anything about it,\" Grube said. \"There wasn’t anything leading up to it or any discussion on it, so when he told me, I was excited, but I was nervous, because I had no clue what to expect.\" In each episode, four police K-9 teams and one civilian team compete against each other in three rounds, and a different set of teams are featured in each episode before the final competition in episode 11. Each week, the winning team receives $10,000 and an additional $5,000 for a charity of their choice, and in the final week, top competitors compete for the \"America's Top Dog\" title and a prize of $25,000. This isn't the Clark County team's first time on national television — Grube and Jago have also been featured on two other A&E shows, including \"Live PD\" and \"Live PD: Wanted.\" Although they've been on TV before, \"America's Top Dog\" was a completely new experience for the K-9 team, since they are not used to performing in competitions, Grube said. Jago had to learn skills such as jumping fences and crossing wobbly rope bridges. For a while, he didn't hear anything about the competition, but in the first week of June, he learned that they would be leaving for Santa Clarita, Calif., the following week to perform in the show, and before departing, they trained for \"a couple days to learn things that might take months for other [teams] to learn.\" Since the show hasn't aired yet, he can't provide too many details about the competition, but he said it was a challenging and eye-opening experience. It was a chance to think \"outside the box\" and adapt to new scenarios. \"As far as going into this unknown and unexpected experience, you’ve got to trust your dog, you’ve got to trust the experience that you have,\" Grube said. \"I was nervous beforehand, of course. You’re putting yourself out there on a national stage and competing, so it was very challenging.\" Col. Scottie Maples of the Clark County Sheriff's Office, said as the department's K-9 supervisor, Grube is an obvious choice for the show, and the competition was a chance for both the K-9 and police officer to do something different than their usual training and continue to improve their work in Clark County. \"We’re proud to have Grube and Jago represent the Clark County Sheriff's Office on national level,\" he said. Jago went from a rescue dog to a patrol dog, and he has overcome many obstacles to become a K-9, Grube said. The dog is not only his K-9 partner — he is also his best friend who stays with him 24/7. \"His journey to get here has not been the normal one, and my journey has not been the normal one, so we’re very proud of everything we’ve overcome together as a team,\" he said. \"When I first got Jago, he was apprehensive to even go around people, so to go on a national TV show and to compete in front of a live audience, it’s a big deal. I’m very proud of him, and I’m very proud to tell his story.\" Grube said he feels honored to represent Clark County on the show, and he said the area is blessed with great K-9 teams. He recognized the work of Sgt. Ben Bertram, a K-9 officer with the Charlestown Police Department who died in the line of duty in 2018. They both worked together at the Clark County jail before becoming police officers. When Bertram heard Grube was getting a K-9, his advice was to \"check your ego at the door.\" Those words have stayed with him over the years. “We truly believe ‘America’s Top Dog’ would have been Bertram,” Grube said. “I can’t say that enough. I told his family before I left [for the competition]. That’s my opinion. Ben would have been ‘America’s Top Dog.’ There would have been no question, if he had competed, that he would have won this darn thing...he’s a big pillar in our local K-9 community, and we try to honor him in what we do.” WAVE 3 News ",
    "datetime": "2019-12-30T17:32:54.877Z",
    "url": "https://www.wave3.com/2019/12/30/clark-county-k-featured-aes-americas-top-dog/"
}