{
    "title": "Coca-Cola rides K-pop wave with global BTS campaign starting in Indonesia | Marketing-Interactive",
    "text": "published author share on The Coca-Cola Company has partnered with K-pop boy band BTS for its new global campaign “Turn up your rhythm”. The campaign features BTS’s cover of “Jungle”, which was originally sang by American rock band, X Ambassador. Starting in Indonesia, the campaign is also supported by an integrated marketing campaign across social media, TV, mobile and in-store. It will roll out in countries across the region over the course of the year, according to Pratik Thakar, head of global creative strategy and content, The Coca-Cola Company. The one-minute spot takes the viewer on a journey of imagination through a Coca-Cola factory where dull moments, such as sitting in an office or waiting at a bus stop, are transformed into memorable and uplifting ones. Throughout the ad, BTS’ version of “Jungle” is playing in the background, which according to Thakar, provides the pulsing, energetic beats to the bottles of Coca-Cola on their way out to refresh the world. MARKETING-INTERACTIVE has reached out for additional comments.  Coca-Cola is the latest to hop on the K-pop bandwagon. Its move seemed rather timely as well, seeing that just two weeks ago, its rival company Pepsi named another K-pop group, BLACKPINK, as its brand ambassador for APAC. Pepsi's partnership with BLACKPINK sees the brand looking to encourage the Gen Z to be bold and push the boundaries of possibility when it comes to pursuing their passion in life. Separately earlier this month, insurance company Prudential also collaborated with K-pop group SuperM to launch a new campaign titled \"We DO Well Together\". With the partnership, Prudential aims to encourage people across Asia to stay well and healthy, and have fun doing it. The campaign is said to be rolled out across Prudential's 11 markets in Asia: Singapore, Malaysia, Indonesia, Thailand, Cambodia, Hong Kong, Laos, Myanmar, the Philippines, Taiwan, and Vietnam. Meanwhile in 2020, Hyundai also embarked on a similar campaign as Coca-Cola. The automobile tied up with BTS to release a new song titled “IONIQ: I’m on it\". The new release follows Hyundai's launch campaign of its new electric vehicle brand “IONIQ\" earlier in August. The new song was made available on the brand’s website, while the music video was launched on Hyundai's official YouTube channel. Related Articles:Pepsi names K-pop girl group BLACKPINK Asia brand ambassadorsPrudential taps on K-pop stars SuperM to push healthy living across AsiaK-pop boyband BTS and Big Hit Entertainment make US$1m Black Lives Matter donationK-pop agency SM Entertainment flamed for ad promoting online store selling masks  share on We break down the big and messy topics of the day so you're updated on the most important developments in Asia's marketing development – for free. MARKETING-INTERACTIVE is an online publication of Lighthouse Independent Media. ©  Lighthouse Independent Media. All rights reserved. Marketing Interactive is not responsible for the content of external sites. ",
    "datetime": null,
    "url": "https://www.marketing-interactive.com/coca-cola-rides-on-the-k-pop-wave-shortly-after-pepsi-with-new-spot"
}