{
    "title": "Community reacts to whistleblower case awarding demoted LMPD Major $300K",
    "text": "LOUISVILLE, KY (WAVE) - Louisville Metro Police Department Lieutenant Jimmy Harper and his attorney sought $6.6 million in damages. Harper said he believes LMPD Chief Steven Conrad destroyed his career. There were some wins in Harper's lawsuit against the city, but it was not a total victory. Jurors found Harper was acting in good faith when he talked to Mayor Greg Fischer about what he believed was mismanagement by Conrad. Harper was later demoted and moved to LMPD's River Patrol. \"We thought there were possibly three whistleblower violations, but the fact that they found even a single whistleblower violation for me, for this police department, is a very serious matter,\" Thomas Clay, Harper's attorney, said. All 12 jurors agreed the statements Harper made to Fischer did play a role in his demotion. PREVIOUS STORIES+ Jimmy Harper: Jurors return mixed verdict in whistleblower suit against city+ Tears and politics: Whistleblower trial continues with accusations + Harper reveals secret recording of conversation with Conrad+ Witness called by city makes valid points for plaintiff \"There have been a lot of details and insight into how things work behind the scenes and I think it is a lot for us to digest right now,\" Nicolai Jilek, President of the Fraternal Order of Police, said. Jilek said he attended Harper's trial not only in his official role, but to support his former Major. \"It's unfortunate that someone of Major Harper's stature is now in a position where his ability to affect public safety and the community has been diminished,\" Jilek said. Harper was compensated for lost wages and emotional distress but was not awarded punitive damages. Instead of the $6.6 million asked for, he was awarded a total of $300,000. Clay said the future of Harper's career is bleak. \"He is going to go back to the position which was created,\" Clay said. \"It really has few if any responsibilities as a lieutenant.\" Conrad responded to the verdict, saying he was disappointed, but standing by his actions: \"This is a disappointing verdict. But, as I have said before, I support the decisions of the court and I thank the jury for their work. Today, the jury ruled against us. Nevertheless, I will not apologize for my actions, because I believe they were in the best interest of the department and the city. Through the reorganization of the department, which included implementing a full-time SWAT Team, increasing the size of our Narcotics Unit, and devoting overtime patrols in the 1st, 2nd, and 4th divisions, we have made a significant impact on violent crime in this community. I want to make sure that the members of this community understand that I am your police chief. And regardless of what is in the news, know that the men and women of my department come to work each and every day and put their lives on the line to make this city a safer place. I ask that you continue to support my officers and this department, and join us as we continue to do our part in making Louisville a stronger, safer city.\" The county attorney's office said they \"greatly respect the jury's time and effort in this case and will confer with our client regarding any possible next steps.\" Mayor Fischer also responded, echoing that sentiment. He remained supportive of Conrad in his statement: \"I appreciate the jury's consideration in this case, and we will defer to the County Attorney's office on any next steps. It's important to remember that the changes Chief Conrad made last year are showing positive results -- overall crime is down 7 percent, violent crime is down 9 percent, and homicides are down 30 percent. As we move forward, I again urge everyone to continue supporting the women and men of LMPD as they do the daily work of making our city an even safer place.\" Copyright 2018 WAVE 3 News. All rights reserved. ",
    "datetime": "2018-08-16T06:46:15Z",
    "url": "https://www.wave3.com/story/38895153/community-reacts-to-whistleblower-case-awarding-demoted-lmpd-major-300k/"
}