{
    "title": "Concept Korea: Bringing K-Wave To New York Fashion Week",
    "text": " Korean designers ChungChung Lee (left) and Younhee Park (right) showcased their collections at... [+] Concept Korea show this season during New York Fashion Week. (Supplied photo)  K-pop, K-drama, K-beauty: These days adding a \"K\" – signifying Korean origin or style – to anything from the arts to the world of entertainment, seems to instantly boosts its appeal among young millennials increasingly looking east for lifestyle inspiration. Aside from its accessible and slightly kitschy aesthetic, the now global phenomenon known as Hallyu, or simply K-wave, is also partly the result of investment from the South Korean government and private companies, such as K-beauty giant Amore Pacific, who played a crucial role in exporting this craze to all corners of the planet. And an affair like New York Fashion Week (NYFW), with its street-style sensibility, seems to provide the perfect platform for K-fashion. Its appeal comes from employing feminine silhouettes to casual wear and the unique way of mixing a variety of fabrics in one garment, making K-fashion look daring and stylish, yet very wearable – in other words, it's considered commercial enough without losing its edge. Seven years and still counting  GREEDILOUS SS18 collection during Concept Korea show, hosted on September 8 during New York Fashion... [+] Week.  Concept Korea is a biannual fashion show, supported by the Ministry of Culture, Sports and Tourism of South Korea and organized by Creative Content Agency (KOCCA), to showcase Korean designers' collections at NYFW in the hope of expanding overseas business and awareness of up-and-coming Korean designer brands. According to the organizers, this initiative -- running since 2010 -- has already paid off. \"Overseas business performance of the participating brands has been steadily rising, and the average performance has increased 10-fold in comparison to 2010 figures,\" Team Director of KOCCA, Kyeong Hwa Ji tells FORBES. In its 16th season now, the show runs as part of the NYFW program where organizers pick two designers to showcase each season based on criteria like creativity, marketability and brand competency. This Spring/Summer 2018 show, which was hosted on September 8, featured homegrown brands LIE and GREEDILOUS, both of which have enjoyed considerable success at home. The recent show attracted fashion heavyweights such as Fern Mallis, ex-executive director of the Council of Fashion Designers of America (CFDA), who earned the moniker \"The Godmother of Fashion\" for her efforts in creating New York Fashion Week. Her attendance is a testament to the growing global appeal of K-fashion. Standing out from the crowd  GREEDILOUS SS18 collection during Concept Korea show, hosted on September 8 during New York Fashion... [+] Week.  Even for talented designers, venturing into the U.S. fashion market is no easy task given the local competition already in place and the fact that in such a saturated market, it might take more than a pretty dress to sell and guarantee longevity. In this day and age, it seems brands are selling a lifestyle rather than a mere product. K-fashion ticks both boxes: product sensibility and a \"cool\" factor that's closely tied to Korean lifestyle in general. \"Korea has a dynamic energy because of its rapid growth, and it seems that energy is also reflected in our fashion sensibility,\" says KOCCA's Ji, who doesn't see the K-craze as a fad likely to disappear anytime time soon. As for the product, the casual street aesthetics inherent to Korean fashion, as well as quality standards and attention to detail – all at reasonably lower price point than similar products from elsewhere – help magnify its appeal. \"Korean fashion is synonymous with street fashion and sports casual, and if this trend grows, Korean designers will become star players on a global scale,\" explains Ji. Hopes and challenges  Looks from LIE SS18 collection as part of Concept Korea show at NYFW.  LIE's ChungChung Lee, who is the son of Korea's most accomplished designer Li Sangbong, already boasts a retail store in New York's trendy Meatpacking District and his label is stocked at various retailers worldwide. But even for the Central Saint Martin's alumnus who describes LIE's vision as “everyday wear luxury with a twist,” the challenge is always present at home and abroad. \"As the competition within the Korean fashion market becomes increasingly intense and the market gets saturated, designers in my generation are facing more challenges than ever,\" he says -- though he acknowledges that compared to his father's generation, it's become a lot easier for Korean designer brands to gain global exposure. Younhee Park, the creative director behind GREEDILOUS, hopes Concept Korea will give her exciting label similar visibility in the American market. Park, whose bold statement pieces have been spotted on numerous K-pop artists – and even global stars like Beyoncé – wants to promote the brand to \"many of the world's top celebrities,\" as well as reach top fashion buyers to expand her stockist list.  Looks from LIE SS18 collection as part of Concept Korea show at NYFW.  Where to next? In every episode of the fashion design competition TV show Project Runway, host Heidi Klum reminds contestants that \"in fashion, one day you're in, the next you're out,\" reflecting on the fast-paced and trend-driven industry. So what about K-fashion? Will its popularity continue? For now -- as long as current streetwear trends continue to feature in the collections of major labels worldwide. For KOCCA's Ji, there's no doubt about where K-fashion's priorities lie. \"The main and most difficult aspect of our mission is to raise the Korean brands’ awareness as we work to introduce unfamiliar designers to the global fashion market. Although it is always a concern to attract people to visit our shows, the fact that we can show a unique collection of new designers every year is in itself a fresh approach to the New York fashion scene,\" she says.  ",
    "datetime": null,
    "url": "https://www.forbes.com/sites/ranawehbe/2017/09/11/concept-korea-bringing-k-wave-to-new-york-fashion-week/"
}