{
    "title": "Concert review: Big Bang MADE tour 2015 - TODAY",
    "text": "Entertainment SINGAPORE — Critics who say the K-pop wave is receding should have been at the Singapore Indoor Stadium on Saturday night when K-pop megastars Big Bang wowed the Singapore crowd with not just their powerhouse moves on stage but also their seasoned and cheeky banter. SINGAPORE — Critics who say the K-pop wave is receding should have been at the Singapore Indoor Stadium on Saturday night when K-pop megastars Big Bang wowed the Singapore crowd with not just their powerhouse moves on stage but also their seasoned and cheeky banter. Their two-night concert in Singapore is part of their MADE tour, which comes three years after their last world outing Alive Galaxy Tour 2012. The tour also runs concurrently with the release of the new songs from their latest album. (In a departure from how albums are usually released, Big Bang has been releasing two new songs at the start of every month since May.) They kicked off Saturday’s concert with their new song Bang Bang Bang, an electro-dance tune. Other new songs performed included Loser, Bae Bae and Sober, which also saw Daesung showing off his drumming skills. The line-up was also packed with fan favourites such as Tonight, Haru Haru and Blue — some slightly rearranged for the live band accompanying them — to which thousands of fans sang along in Korean, no less. Saturday’s concert saw a marked difference from Big Bang’s previous visits to Singapore. Back then their interaction with fans was limited with a smattering of English exchanges from the members. This time round, they had done their homework. The quintet’s youngest member Seungri teased the mostly female audience with his comments and questions posed in fluent Mandarin, which he recently picked up. Addressing the full-house crowd, the 24-year-old said: “I feel that Singaporean girls are the prettiest. Is that right?” before posing the question to each of his other team members. Bandmate Daesung, 26, who initially had his back turned to the audience, joked that he could not see from under his latest bowl-cut hair. “I can only hear you!” The second half of the concert was dominated by solo performances with crowd-pleasers such as Taeyang’s Eyes Nose Lips, T.O.P’s Doom dada and collaborative efforts such as Good Boy by Taeyang and G-Dragon. Unlike other K-pop groups, Big Bang doesn’t quite have the most synchronised dance moves. But their stage theatrics — which saw a female dancer douse G-Dragon in a pail of water midway through Crooked — and elaborate production sets involving moving platforms and blockbuster-worthy videos in between songs made up for it. The concert, which lasted slightly over two-hours, was rounded up with a 15-minute encore by the band as they performed songs such as Hands Up and their new song We Like To Party. But Big Bang could not leave without a final round of teasing: Seungri declared his love for their Singaporean fans by shouting “Qin qin! (Kiss, kiss)”, inviting peals of laughter from the crowd. All too soon, it was over. Big Bang left the building. But for the fans who slowly made their way out, this is one Big Bang of a show that would stay for some time to come. Well, until the next concert, that is. Siau Ming En   Read more of the latest in Subscribe to get daily news updates, insights and must reads delivered straight to your inbox. By clicking subscribe, I agree for my personal data to be used to send me TODAY newsletters, promotional offers and for research and analysis. Copyright 2023 © Mediacorp Pte Ltd. All rights reserved. We know it's a hassle to switch browsers but we want your experience with TODAY to be fast, secure and the best it can possibly be. To continue, upgrade to a supported browser or, for the finest experience, download the mobile app. Upgraded but still having issues? Contact us ",
    "datetime": null,
    "url": "https://www.todayonline.com/entertainment/music/concert-review-big-bang-made-tour-2015"
}