{
    "title": "Crayon Pop Brings Leg Wobbling & Silly Holiday Cheer on ‘Lonely Christmas’ – Billboard",
    "text": "After riding a viral wave to their first K-Pop Hot 100 No. 1 with \"Bar Bar Bar,\" Crayon Pop the K-pop girl group bring their fun antics for a holiday concept for \"Lonely Christmas.\" By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin Earlier this year, rookie K-pop group Crayon Pop found itself at No. 1 on the K-Pop Hot 100 following a viral response to the video for its fourth single “Bar Bar Bar.” Now, the quintet is mixing its quirky-cute charms with holiday music on its latest release, “Lonely Christmas.” Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news Notably, the production for “Lonely Christmas” is much higher production than “Bar Bar Bar” with loads of energetic synths, trumpets and guitars backing the girls’ singing and cheers. In fact, the girls’ voices sound harmonious, even sultry, on the final notes of the bridge. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t12/03/2013 Meet Crayon Pop in K-Town’s Video Interview Still, it’s a little too obvious the song is trying to remind the public of all the things that made them fall in love with “Bar Bar Bar.” Crayon Pop even uses the pre-chorus cheer from “Bar Bar Bar” and pastes it in “Lonely Christmas.” Still, the catchy, English hook “You, you! Don’t worry, be happy!” is a fun, easy to remember and rolls off the tongue easier than “Bar Bar Bar” hook, “I don’t want to stick at home now.”  The accompanying music video also sees Crayon Pop using a similar formula that earned the group over 13 million collective views for the two “Bar Bar Bar” vids. Again, the girls bounce around to silly, easy-to-follow choreography. But instead of the “straight-five-engine dance,” the girls are betting on a shaky leg dance — that looks even more hilarious when one member performs it (see Ellin at 1:16) — as the signature move. Similar to what PSY did with his “Gangnam Style” follow-up video “Gentleman,” the girls are playing off similar elements of what made the public fall in love with them in the first place. Crayon Pop’s “Lonely Christmas” outshines “Bar Bar Bar” in terms of song composition and hook, but the public could soon grow weary of the same formula if the music and group doesn’t continue to show growth. Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2013-12-04T03:39:23+00:00",
    "url": "https://www.billboard.com/music/music-news/crayon-pop-brings-leg-wobbling-silly-holiday-cheer-on-lonely-5812369/"
}