{
    "title": "CRAZY FOR KOREA - Newspaper - DAWN.COM",
    "text": "  You’ve heard K-pop even if you think you haven’t. If you’re an occasional viewer of local TV channels or a semi-regular radio listener; if you know more than three teenage girls in your family or in your school; and, more strikingly, if you follow the annual United Nations General Assembly (UNGA) held in New York, you have inadvertently caught the K-pop frequency. It’s safe to say K-pop, short for Korean pop, has become mainstream in Pakistan and there are plenty of fans here that demand more of it. On TV, the latest Samsung phone commercial is set to ‘Butter’, the latest number by the biggest boy band from Korea known as BTS. On FM radio, you will hear at least one Korean pop song during your drive, at any given time on any day of the week. And, this September, more than a million viewers worldwide tuned in to stream a seven-minute speech by BTS members ahead of the UNGA and to watch a recorded video of them dancing to their hit song ‘Permission to Dance’ in an empty UN Assembly Hall.   BTS is a seven-member all boys group which is currently synonymous with what we know as K-pop. ‘Butter’ was the longest-running number 1 song of 2021 on Billboard’s Hot 100 charts, ruling the charts for seven weeks. Only to be replaced by ‘Permission to Dance.’ Which was then again knocked off by ‘Butter’. These boys are basically up against themselves. Their following is of such bizarre magnitude that when Spotify launched in Russia, BTS became one of the country’s top-streamed artists, according to the platform. They have made it so big around the globe that they were appointed South Korean President Moon Jae-in’s special presidential envoy for future generations and culture. The boys, the oldest being 28, are President Moon’s pride for their unbeatable talents and maybe because they manage to contribute some billions of dollars to their country’s GDP. Estimates say 3.6 billion dollars in 2018 and higher in the successive years. The superstar group’s management agency, HYBE (previously Big Hit Entertainment), had a market valuation of 7.61 billion dollars last year, according to Reuters. Some three years ago, I was aware that BTS was a global phenomenon; young artists the likes of One Direction, Backstreet Boys, or even earlier, The Beatles. But I was still illogically surprised to discover that it’s not just one Korean group that had a huge following right here in Pakistan. My teenage nephew one day complained how a group of girls in his school obsessively put up K-pop posters in the classroom and the boys take them down in irritation. My friend sent me a photo of her 12-year-old daughter sporting a haircut and glasses to emulate her favourite K-pop star. My 13-year-old niece, who we thought was interested in nothing about life, was suddenly gushing about Kim Tae-hyung from BTS every time she saw my face. This was not the usual boy band fan following. This was clearly something bigger. A global phenomenon, the likes of which we haven’t seen in decades.  *** I was initiated into the weird and wonderful world of Korean entertainment by my friend and K-pop-meister Zara Asif, on one of her visits from Canada to Pakistan. After having binged on some Korean variety shows, she began streaming the TMA, which are Korea’s equivalent of the Grammys, I suppose. I was safely ensconced in my Anglophone experience of pop culture as any average ‘English-medium’ Pakistani is in their postcolonial complacency. We were just shooting the breeze as Zara watched ‘her’ stuff. Then, slowly, she started giving me the context of things — the winners, the nominees and the whole mechanics of the Korean entertainment machine. With her unbridled passion for everything Korean , she gave me the low-down on the culture of K-pop and its followers worldwide. The career trajectories, names and numbers of each band member and artist appearing on stage (okay, she doesn’t have their phone numbers, but may as well have). I was slow to follow. She was speaking some new form of English. K-pop fans have their own lingo. They don’t just call a singer a singer or a lead, they call them an “idol”. If you are really into a group or idol, you don’t love them, you “stan” them. The stans (fans) of each band unite into a fandom (much like avid Star Trek nerds are known as Trekkies) and each fandom has a unique name for themselves. ARMY. Blinks. Engenes. Moas. They have their own light sticks that glow in the dark, which they wave during concerts — lighters and phone screens are obviously passé for kids these days. These light sticks also have their own names.   Zara is the epitome of a K-pop aficionado. I have never met any Korean Christian missionaries who visit Pakistan, but I doubt they could match her level of zeal in promoting a cause. In 2015, she attended the first K-pop Convention that was held in Toronto, because a friend was going. A year later, she returned, this time as a volunteer to help out in a fan project for one of her favourite bands Vixx, who were touring Canada. Fan projects involve designing welcome banners in Korean or English, choosing the time to raise the banner during the concert, making creative gifts for the artists, arranging refreshments for them backstage and other gestures to show love for a group. All this creative organisation begins some five months ahead of the artist tour and requires funds, which are also raised through fans. “We used GoFundMe.org that year I think and one girl donated over 100 dollars even though she was not attending the concert,” Zara says. “She just wanted to do something for her favourite group,” she says. The volunteers then have to propose all their ideas to the group’s agency for approval. “I was in my shy stage back then,” Zara says. But she soon found the flow of things and hit it off with all the volunteers for the Vixx project because they were united in their musical love. Then, a turning point for Zara came when there was a last-minute cancellation from the convention and she was asked to step in and do a Vixx panel.  “I wasn’t into public speaking and avoided such things because of my social anxiety, so I was very nervous to speak to an audience of around 50 people,” she says. “But, with the help of my team and friends, I got into the swing of things and we ended up turning it into a Vixx dance party. It was so much fun.” On her next return to the convention, Zara was a known figure there. “People would come up to me to thank me [for last year’s work], and I remember walking down the hall and being stopped every so often by people saying hi to me,” she recalls. I’ve always been introverted and this was so not me, but that’s the sort of person I ended up becoming through the concert community.” By 2017, Zara was in charge of leading all the fan projects for all groups. Her level of dedication to K-pop is not uncommon in fandoms across the world. “Fan projects foster creativity, artistic talent and organisational skills in the young fans,” says a paper titled The Capitalist Control of K-pop: The Idol as a Product. Now, if you can find research papers on the power and influence of K-pop, you can reckon it’s a force worth acknowledging. Published by the RKK International Centre for Defence and Security, the paper asserts how these projects “facilitate closeness between performers and fans.” An article in Time magazine explains how K-pop fandom is managed: “‘The artist-fan relationship is so important and investing efforts in developing that is what builds loyalty and a strong fandom,’ says Kossy Ng, Head of Artists & Label Partnerships Asia at Spotify, highlighting the power of BTS’s ARMY fan base.” The people interviewed for this story display that enthusiasm (read: devotion) for Korean pop and thus they predict the Korean wave will sustain. “It’s only going to get bigger,” says a Pakistani YouTuber who goes by the name Leneha Junsu on social media. For the purpose of this story, her chosen name has all the relevance too. ***   Based in Lahore, Leneha runs a YouTube account related to all things Asian and separately an online business where she sells K-pop merchandise. Growing up, she had a curiosity for Asian cultures because her father used to watch Japanese and Chinese programmes on TV transmitted through satellite dish antennae that became ubiquitous in Pakistan in the early 1990s. “I wanted to explore something different,” says Leneha. She was familiar with Chinese and Japanese entertainment already and only had to look a little further to find Korean music. This veteran K-pop buff has observed the explosion of numbers in the local K-pop lovers demographic as compared to its obscurity when the first generation of K-pop bands emerged on the global scene. (For noobs, like me, K-pop bands are classified into generations. BTS is part of Gen 3 groups, those formed between 2012-2017, which also includes groups such as Exo and Twice.) Gen 2 boy band Big Bang, formed in 2006, is one of the bands that had caught Leneha’s imagination because it had a unique sound inspired by heavy metal, and a striking fashion sense, in a time when K-pop drew heavily from the genres of hip-hop and pop. Big Bang was also a major influence for BTS. Other groups she stans are Exo, Stray Kids and Ateez, the latter two being Gen 4 groups. Apart from her two enterprises, Leneha remains involved in local K-pop fan clubs, where they meet up, play games such as guessing which lyrics or choreography belong to which idol, or watch concerts on projector screens. Girls as young as nine join these fan clubs and also the vast online K-pop communities, including Facebook pages such as K-Craze Pakistani, which has 81,431 followers. “There are multiple group chats on WhatsApp and Twitter mainly which you can join to be a part of the fan base, where events and projects all over Pakistan are being discussed,” says 17-year-old Filzah Ahmer, who is a member of the Pak-Korea Culture Collaboration programme initiated by the Korean Consulate. Some of the WhatsApp groups she is part of have about 70 members each. Earlier this month, Twitter and Instagram were abuzz with the planning of Park Ji-min’s birthday on October 13. The Pakistani BTS ARMY across the country organised events to mark the auspicious day of their idol. In Karachi, a fan club held an event at a banquet hall where the Korean ambassador to Pakistan was the chief guest. This was purportedly the biggest event for Ji-min’s birthday in Pakistan. In Lahore’s Emporium Mall and Islamabad’s Centaurus Mall, LED displays played reels featuring the K-pop star. A beneficent grocery store in Multan gave a 10 percent discount on all products for the day’s shoppers. The ARMY from a college in Muzaffargarh and a women’s college in Lahore shared videos of their small-scale celebrations too. And even one of the biggest local news channels aired a news item about the fans’ celebrations on October 13.  Earlier in September, a huge billboard in Gujranwala displayed a picture of Jungkook, another BTS member, wishing him a happy 24th birthday. Everyone was surprised to see this incongruous homage to Korean boy who was as stranger to this quarter of Punjab. But nobody was surprised when a killjoy had it taken down on the pretext of it spreading homosexuality. All zealots have rabid imaginations. Leneha did a quick trip to Emporium on Ji-min’s birthday and said that in the past she would have been over the moon if she knew as many BTS fans existed in Lahore as she saw in the mall that day. “It’s impossible that this craze ends any time soon,” says Leneha. “I think it has just started.”  *** ‘Ddu-du ddu-du’ has 1.7 billion views on YouTube. I’m talking about the music video (m/v) for a song by Korean girl group Blackpink who are taking the music scene by storm. They made history as the first Korean girl group at Coachella Valley Music and Arts Festival in 2019 in California, and they kicked off their line-up with ‘Ddu-du’. The four strutted, sang and sashayed before thousands of their fans, and thousands more who were previously unaware of them. The group has also collaborated with the likes of Dua Lipa, Selena Gomez, Cardi B and Lady Gaga. The dance choreography of the four-member group is mesmerising in its precision, energy and uber-coolness. Their high-fashion costumes are dazzling and their songs stick in your head like bubble gum. I first heard of the group when I heard (my personal favourite) ‘Let’s Kill This Love’ on FM89. I mistook this over-the-top, explosive, marching-band beat to be by Lady Gaga. Versatility of genres is inherent in contemporary K-pop as one song can segue from pop to EDM to rap, reminiscent of what made artists such as Lady Gaga to be considered experimental. The pioneers of modern K-pop Seo Taiji and Boys experimented with popular Western genres of music in the 1990s and created a fusion of rap with pop and hip hop. This opened the doors of creativity for Korean contemporary artists and opened the world to K-pop. Although it is called pop, the music hardly sticks to one genre. For starters, every band member has a designated rapper, so every song has a rap part that bursts out mid-song. “I enjoy K-pop more than other music as it is about self-love and self-acceptance… and it just feels good,” says Amna Malik, an A-levels student from Karachi, whose favourite idols are Sana from the girl group Twice and Nam-joon, the rapper from BTS. “Each group has covered many genres, their discography is wild,” she explains. “For example, BTS has done multiple genres: orchestral with ‘Black Swan’, rock with ‘Dionysus’ and ballad with ‘Truth Untold’. The same goes for other groups.” It was the uniqueness of K-pop that appealed to cover artist and dancer Sophia Mujahid. Being a fashionista, she was taken by the fashion sense of the singers; as a dancer she was awed by their choreography: “It’s undeniably good in every aspect.” Sophia posts dance covers of K-pop artists on YouTube and has been a finalist on a K-pop dance festival held in Islamabad by the Korean Embassy in Pakistan. In 2018, she went on a Korean government-sponsored trip to Seoul on an exchange programme. Once you get into K-pop, “there’s no going back,” she says. “I take inspiration from K-pop,” the YouTuber says. Whether it is for editing skills, video content rating, dance covers or singing. “I could relate to the music groups when I looked at their backgrounds and at how hard they trained. Lisa from Blackpink is a role model for me. She was treated unfairly and faced racism being the only Thai member of the girl group. But she tackled it so bravely.” *** Ashhar Hussain, 26, is a chemical engineering student by day but moonlights as a K-pop dancer by night. I speak to him on messaging app KakaoTalk one afternoon. It is about 8pm in Busan and he has just come back home after his classes at his university. He has free time because he doesn’t have any dance lessons scheduled for that evening. Originally from Karachi, his affinity for K-pop has shaped the arc of his life. “I was always different to normal society,” he says. “I was always dancing, had my own sense of style and didn’t care what people thought of it.” In Karachi, Ashhar was the only one among his friends who was into Japanese music, manga comics and watching Asian variety shows. He had just started uploading his dance videos on YouTube for fun when he stumbled upon the K-pop dance festival being held by the Korean Embassy in Islamabad in 2016. “Not a soul [I knew] was talking about K pop back then,” he recalls, so the call for entries was a bolt from the blue for him. It also made him brazen enough to audition, because how many contenders could there possibly be, he thought, “Who would dare compete against me?” When he travelled to Islamabad after getting selected as a finalist, everything about the day of the competition was as bizarre as its discovery. The venue was National University of Modern Languages (Numl); the sparse audience was mostly uninterested students mandated to attend the event and there were some parents accompanying the participating finalists. But none of it mattered. Ashhar was focused and pumped, he had designed his own costume, carefully done his own makeup and chosen a K-pop number that really represented his dance mood, BTS vocalist Park Ji-min’s solo 'Lie'. The repertoire of finalists before he went on stage included singers, two \"Korean uncles\" who were unbearable to sit through, a few young girls who did dance performances and a couple of guys. He saw only Sophia as his competition and as a performer who had clearly been practicing for much longer than he had. Ashhar’s on-stage time went by without major hiccups. It was the moment after he got down from the stage that is memorable. There was applause and, more shockingly, a couple of participants came up to him to appreciate his act. And when the results came in, he got fourth place. People sought him out to show their support. “You should have won,” they said. This continued the rest of the evening after he was back at his Islamabad hotel. An attendee had uploaded his dance performance online and as the video did the rounds on social media, a ton of K-pop fans reached out to him. This earned him the epithet ‘Pakistani Ji-min.’ By the time Ashhar performed at the third K-pop dance festival, the growing number of K-pop lovers was already noticeable. This time the seats were packed and more kids wanted to come and see the competition. The response he has received for his dance videos has changed everything for him. He is shooting for the sky and hopes to break into the idol industry in Korea. He knows he has his work cut out for him, but in finding K-pop he feels he has found his tribe and goal. Such has been the swiftness and power of what researchers Claudia Valge and Maari Hinsberg call “South Korea’s number one cultural export,” in The Capitalist Control of K-pop. From what you see among the Pakistani fans, the lyrics, the music and the self-expression sold by Korean stars has touched a nerve, and become a conduit for youthful exuberance and imaginativeness. *** We are part of the world that happens to like the content South Korea sells. ‘Baby Shark,’ also Korean, remains the most viewed music video of all times at 9.2 billion views. And do you remember when literally the whole world was dancing ‘Gangnam’ style? Yes, that too is K-pop and still one of the top 20 videos at 4.19 billion views. “[W]hen ‘Gangnam Style’ became the most viewed video on YouTube, the Korean media and even the Korean government suddenly couldn’t get enough of him, hailing him as a national hero for catapulting his country to global stardom,” writes Regina Kim, in her Rolling Stones article on changing music trends in Korea. “His face was plastered everywhere, from Korean cosmetics to instant noodle ads to postage stamps. A statue commemorating his viral hit was erected in Seoul.” The cultural imprint of that song is undeniable. When I ask the endearing radio-show host Wes Malik if he recalls which K-pop song he first played on his radio show, he takes barely a second to remember. “The first Korean song I played was ‘Gangnam Style,’ back when it came out [in 2013],” he answers. Wes was the first to introduce K-pop on national airwaves. “I specifically started putting Korean songs on rotation on my playlists because there was a huge demand [for it],” he says. The requests kept pouring in. “It’s gotten big because of the fan base,” Wes says. “Even though the BTS ARMY is the biggest fandom, [K-pop] listeners are open to more than just BTS and they are open-minded and listen to other bands.”  “Their fandom mirrors my own teenage years,” the RJ says. “I think it was just a different time and a different band but I understand what K-pop fans are experiencing.” Wes recalls that when he was young and listening to George Michael and Michael Jackson, his father derided him and asked in Punjabi, ‘Ki Jackie, Jackie laaya da ae’ [What is this Jackie that you’re playing?]. “So English music back then was as foreign to our culture as Korean music is now,” he says. “But I do enjoy it — it’s entertaining and I think it’s great.” “The soft power of K-pop in foreign policy is proved by the performances of CL and Exo during the closing ceremony at the Winter Olympic Games in PyeongChang in 2018, BTS’s speech at the UN and the fact that former US president Barack Obama noted in his speech at the Asia leadership Conference in 2017 how many Americans were learning Korean to keep up with the K-pop Group SHINee,” observe Valge and Hinsberg in their paper. It’s big business and, as Time magazine cites, “South Korean news has reported that the entertainment agency will become the region’s largest, entering into global competition… On Spotify, for instance, K-pop listening has climbed 2,500 percent over the past six years, and in 2019 the South Korean music industry had an export value of about 560 million dollars.” In order to understand song lyrics, learning Korean is in high demand, too, in countries such as the US, Canada, Thailand, Malaysia and Algeria, BBC reports. The Korean Wave has crashed on us in Pakistan too and, as far as entertainment is concerned, things are going swimmingly for its admirers. Header image: Members of the band BTS speak at the UN General Assembly in New York | Reuters Continue reading: The unparalleled comfort of K-dramas The writer is a member of staff Published in Dawn, EOS, October 24th, 2021 Copyright © 2023 Scribe Publishing Platform ",
    "datetime": "2021-10-24 06:24:42+05:00",
    "url": "https://www.dawn.com/news/1653670"
}