{
    "title": "CSRWire - Hawaii K-12 Students, Staff Riding Record Energy Efficiency Wave",
    "text": "Now Reading Green team ties 16-year total of Hawaii ENERGY STAR® certified buildings Green team ties 16-year total of Hawaii ENERGY STAR® certified buildings Published 03-04-16 Submitted by Momentum Bay One of Hawaii’s biggest sustainability waves just carried over 63,000 K-12 students and leaders in the State of Hawaii straight to the bank. From 1999 to 2014, only 74 buildings won the U.S. Environmental Protection Agency’s prestigious ENERGY STAR certification. However, in just the past year, the EPA certified 74 Hawaii Public Schools for exemplary top 25 percent energy performance. Kaimiloa Elementary earned ENERGY STAR certificate number 74 on this Hawaii real estate consulting project. When compared to similar schools nationwide, this Hawaiian portfolio of grade ‘A’ healthy, energy efficient green schools saves more than $8,800,000 yearly on energy costs, cuts energy usage by 42 percent, and avoids emitting 19,000 tons of the greenhouse gas carbon dioxide. “These impressive results don’t just save money for the school district, they also contribute to a cleaner, healthier environment for the whole community,” said Jean Lupinacci, Director, ENERGY STAR Commercial & Industrial Branch at the U.S. Environmental Protection Agency. “We applaud the Hawaii Department of Education for its national leadership in energy efficiency and dedication to protecting our most precious natural resource – our children.” Since 1999, over 27,000 buildings nationwide have won the prized ENERGY STAR label, recognizing buildings and campuses that achieve energy efficient operations among the nation’s top 25th percentile. In 2006, the State of Hawaii passed Bill 1464 requiring all state government buildings greater than 5,000 square feet to benchmark energy usage using the EPA’s free ENERGY STAR Portfolio Manager tool. A decade later, Hawaii’s motivation for benchmarking has migrated from mandates to money, and even the Triple Bottom Line (3BL). Colorado-based Engineering Economics, Inc. and Texas-based Momentum Bay – both operating in Hawaii – analyzed air and light quality, and benchmarked electricity, gas, and solar PV usage for over 2,500 state government buildings. Both firms rank among the EPA’s Most Active ENERGY STAR Service and Product Providers. According to the EPA, simply weighing in – becoming aware of a building’s fitness by tracking energy per square foot – saves real estate owners seven percent on average. ENERGY STAR certified buildings save five times more than those building owners, investors and managers who simply benchmark tend to spend 35 percent less than their average peer nationwide. “While ENERGY STAR benchmarking is like my learning to surf with Uncle Bryan on five-foot waves in Haleiwa, ENERGY STAR certification is much more powerful – like technical freestyling a North Shore 25-foot curl, but much less intimidating,” said Momentum Bay’s Mark Robinson, a Certified Energy Manager (CEM®). Like surfing, green building and sustainable real estate is simply conservation coupled with determination, discipline, and practice – that is, implementing low-cost, high-value Energy Efficiency Measures (EEMs) well known by building commissioning (Cx) agents. If all 256 DOE schools replicate the first 74 campuses’ energy efficiency, the State of Hawaii could save more than $300 million over ten years. That money could be reinvested in career-ready students, more STEM learning, innovation, faster and better school turnarounds, and even healthier and safer schools. The next ENERGY STAR waves are sure to be even bigger, better and more fun. Imagine the family-sized impact of all 41 State of Hawaii departments and 67,000 other commercial buildings getting a bit more fit, tracking real estate fitness. The energy savings and occupant productivity gains in healthy, efficient green buildings could make Hawaii a billionaire like local investor Larry Ellison, and even raise the value of Ellison’s Hawaii investments. Which states will continue to lead the nation with healthier, more efficient sustainable real estate – ENERGY STAR, LEED®, and WELL® certified buildings? Given recent daring victories by civil servant leaders at Hawaii Public Schools, the Department of Business, Economic Development & Tourism (DBEDT) and other agencies, Hawaii seems to be on the verge of a sustainable real estate revolution, and could one day trump the sum of all ENERGY STAR certified buildings and commercial plants since 1999. The surf is up again for going green. Triple Bottom Line Context:Together, Hawaii Public Schools’ exemplary, “A” grade portfolio of green schools covers 6,584,615 square feet of occupied space across 859 buildings that: Save $8,853,744 annually through energy efficiency and conservation Enhance the productivity and lives of 57,942 students daily Improve the work environment of 5,684 full-time equivalent workers daily Use 42.8% less energy than comparable schools, and Avoid 19,142 metric tons of CO2 emissions annually, equivalent to the annual greenhouse gas emissions from 3,180 passenger vehicles. Momentum Bay (855-624-2924) is a full-service management consulting boutique focused on energy, water and sustainable real estate. From Texas to Hawaii, Momentum Bay is one of the nation’s most active EPA ENERGY STAR Service and Product Providers (SPPs), helping 2,500+ buildings get a bit fit, boosting employee productivity and business value. Why? To secure sustainable success: healthier profits, healthier people, and a healthier planet. What? Momentum Bay restores good, old-fashioned values in a modern world through better habits and green building technologies – from conservation and efficiency to health. How? By equipping real estate and other executives with sound facts, integrated plans, and practical actions at www.momentumbay.com/hawaii ENERGY STAR: https://www.energystar.gov/buildings Hawaii Public Schools: http://www.hawaiipublicschools.org Engineering Economics, Inc.: http://eeiengineers.com/ Uncle Bryan’s Sunset Suratt Surf School: https://surfnorthshore.com For the real-time list of Momentum Bay’s certified green buildings, campuses and plants, including HIDOE schools, please visit  http://www.momentumbay.com/hawaii. Momentum Bay (877-326-8392) is a full-service management consulting boutique and general contractor focused on energy, water and sustainability.\r\n\r\nFrom Houston to Honolulu, Momentum Bay is one of the nation’s most active ENERGY STAR Service and Product Providers, helping 2,500+ buildings get a bit fit, boosting employee productivity and business value.\r\n\r\nWhy? To secure sustainable success: healthier profits, healthier people, and a healthier planet.\r\n\r\nWhat? Momentum Bay restores good, old-fashioned values in a modern world through better habits and technologies - from conservation and efficiency to health.\r\n\r\nHow? By equipping real estate and other executives with sound facts, integrated plans, and practical actions at momentumbay.com More from Momentum Bay ",
    "datetime": null,
    "url": "https://www.csrwire.com/press_releases/38760-hawaii-k-12-students-staff-riding-record-energy-efficiency-wave"
}