{
    "title": "Cuma Rp 375 Ribu, Nonton Korean Wave in Love & Jajal Wahana TSM Cibubur",
    "text": "Trans Studio Cibubur, Indoor Theme Park berkelas dunia, bakal menggelar Konser 'Korean Wave in Love' pada Jumat 21 Februari 2020 pukul 19.00 WIB. Konser yang akan dimeriahkan oleh artis-artis ternama Tanah Air hingga Korea ini juga bakal disiarkan langsung di Trans TV. Namun, buat yang ingin datang langsung, cukup membeli tiket seharga Rp 375 ribu. Kamu dijamin akan dimanjakan dengan berbagai penampilan menarik dari penyanyi-penyanyi terbaik sambil menikmati wahana-wahana kece berkelas internasional yang pastinya akan menghibur dan menantang adrenalin. Trans Studio Cibubur menghadirkan belasan wahana dan atraksi yang pastinya memberikan ketegangan sekaligus kesenangan buat para pengunjung. Sebut saja ada Pacific Rim dan Jurassic Island yang merupakan wahana yang pertama kali ada di dunia. ADVERTISEMENT SCROLL TO CONTINUE WITH CONTENT Lalu buat kamu yang suka tantangan dan ketegangan, kamu wajib coba wahana Zombie Wars, Alien Taxi dan Gravitron. Selain itu, Trans Studio Cibubur juga menyediakan wahana-wahana yang ramah anak seperti wahana Carousel, Mandi Bola, Snow Playground, Wave Racer, Formula Kart, dan Bat Glider. Anak-anak juga bisa makin mengerti dunia science dan teknologi saat mengunjungi Science Centre. Ditambah akan ada parade meriah, Spectacular Multimedia Show dan pertunjukan SWAT Raid Stunt Show yang akan membuat hatimu di Trans Studio Cibubur semakin berwarna. Cara pembelian tiket masuk Trans Studio Cibubur bisa dipesan melalui situs https://transstudiocibubur.com/id/tiket atau on the spot di loket tiket Trans Studio Theme Park Cibubur. Lokasi Trans Studio Cibubur terletak di Jalan Alternatif Cibubur No 230, Depok, Jawa Barat. Kamu yang mau ke sini dengan menggunakan kendaraan umum pun mudah diakses, cek trayeknya di sini. Yuk, jangan sampai ketinggalan, ajak teman, keluarga, pacar, dan gebetan untuk nonton konser Korean Wave in Love dan menikmati berbagai permainan seru, menegangkan serta menggembirakan di Trans Studio Cibubur. Jadi tunggu apalagi? ",
    "datetime": null,
    "url": "https://hot.detik.com/music/d-4907458/cuma-rp-375-ribu-nonton-korean-wave-in-love--jajal-wahana-tsm-cibubur"
}