{
    "title": "Cutting edge: K-pop band praise plastic surgery beauty - TODAY",
    "text": "World SEOUL — Rounder eyes, narrower faces, bigger breasts: A South Korean girlband is celebrating the country’s obsession with surgically-enhanced beauty by going under the knife to praise the virtues of “Becoming Pretty”. SEOUL — Rounder eyes, narrower faces, bigger breasts: A South Korean girlband is celebrating the country’s obsession with surgically-enhanced beauty by going under the knife to praise the virtues of “Becoming Pretty”. All four members of obscure K-pop outfit SixBomb went through extensive plastic surgery, from nose jobs to breast implants, before releasing their new single on Thursday (March 16). A series of videos showed the four women visiting a clinic, strutting into an operating theatre and lying on the operating table. Another had them practising dance moves in sunglasses with their heads wrapped in bandages. “Everyone follows me, they know I’m pretty,” they sing in “Becoming Pretty” – an electronic dance number with a hook reminiscent of South Korean singer Psy’s 2012 global phenomenon Gangnam Style. The track could be the direct antithesis to Lady Gaga’s Born This Way, lyrics: “I’m beautiful in my way/Cause God makes no mistakes/I’m on the right track, baby/I was born this way.” It has raised questions over the South’s ultra-competitive, looks-obsessed society, where physical features enhance social standing and can help secure jobs, with many recruitment adverts requiring a “neat appearance” and a CV with photo. Despite a population of only 50 million, it is the world’s third biggest plastic surgery market, with thousands of clinics performing an estimated 1.2 million procedures a year. Adverts showing dramatic before-and-after pictures are omnipresent on street billboards, subway trains, bus stops and toilet walls, urging women to “change” their lives or admonishing them: “Everyone but you has done it.” ‘COME OUT OF THE CLOSET’ SixBomb’s lead singer Dain had her breasts enlarged and her cheekbones shaved to make her face look smaller for the song. “We all wanted to get some surgeries done to look prettier... and thought, ‘Why not perform a song about it instead of trying to conceal it?’” she said. “People will notice it anyway... so we wanted to be open about this reality where many women want to look pretty,” she told AFP. SixBomb were founded in 2012 and have released five albums, but have yet to become major stars and with their members now in their mid-20s, time could be running out for them in a youth-driven market. The project was funded by their management, which spent 100 million won (around S$124,000) for “almost every kind of surgery that could be done on a face” and breast implants, said head manager Kim Il-woong. “We haven’t committed any crimes. Our only crime would be talking about it in such an open manner,” he said, adding many celebrities go under the knife but do not “come out of the closet”. KOREAN WAVE K-pop has conquered much of Asia and spread beyond it in a “Korean Wave”, with top girl- and boybands, their good looks often surgically perfected and performing dance moves with military precision, enjoying huge followings. Many are tightly controlled by their managements, who dictate everything from what songs to sing, to what to eat – or not – to maintain rail-thin figures, and what operations to have. Their popularity has itself fuelled the surgery business, with many fans – including from overseas, particularly Chinese – having procedures in the hope of looking like their favourite stars. A prominent Seoul clinic confirmed that SixBomb’s members had gone through extensive operations “all above the waist”. None of the four were forced to go through surgery, they said, although rapper Soa had to think “long and hard” before having the “double eyelid” procedure to make eyes wider and rounder. “I really liked and was satisfied with my previous eyes, so I had to think long and hard before deciding to take part in this concept,” Soa said. ‘WORSHIPPED AND CONSUMED’ The stunt has raised eyebrows. “I understand that you guys are desperate for publicity... but did you really need to go this far?” asked one online commentator, while another described it “flat-out bizarre”. The move is emblematic of the “plastic surgery culture” prevalent in a country which ranks at the bottom of OECD surveys on gender equality despite being Asia’s fourth-largest economy, said Ms Jung Seul-ah, media monitor at rights group Korea Womenlink. Looks often play a key role in South Korean women’s “social survival” and job prospects, Ms Jung said. “This culture has made plastic surgery something essential for many women deemed not pretty enough,” Ms Jung said, and an “absolute necessity for female celebrities whose looks are worshipped, consumed and capitalised on incessantly”. But for her part, singer Dain had no doubts. “I really love my new face and am proud of how good I look on TV screens,” she said, adding she would welcome “any kind of public attention, good or bad” for the project. AFP Read more of the latest in Subscribe to get daily news updates, insights and must reads delivered straight to your inbox. By clicking subscribe, I agree for my personal data to be used to send me TODAY newsletters, promotional offers and for research and analysis. Copyright 2023 © Mediacorp Pte Ltd. All rights reserved. We know it's a hassle to switch browsers but we want your experience with TODAY to be fast, secure and the best it can possibly be. To continue, upgrade to a supported browser or, for the finest experience, download the mobile app. Upgraded but still having issues? Contact us ",
    "datetime": null,
    "url": "https://www.todayonline.com/world/asia/cutting-edge-k-pop-band-praise-plastic-surgery-beauty"
}