{
    "title": "D-Wave: A multimillion-dollar sham or quantum breakthrough? (Interview) | VentureBeat",
    "text": "Canadian startup D-Wave is so far ahead of the rest of us that employees refer to IBM’s Watson — and the rest of the world’s fastest supercomputers — as “classical.” That’s because D-Wave is the first and so far only commercial quantum-computing company. It’s also one of the most controversial companies in existence, with many scientists skeptical that D-Wave’s computer architecture really pulls off quantum computation. D-Wave’s senior executives paid me a visit at the VentureBeat offices. Don’t miss the full interview below. Some of the leading experts have publicly denounced D-Wave as a classical computer dressed up by its research team to appear to be far more impressive than it actually is. Anthony Leggett, a physicist at the University of Illinois at Urbana-Champaign and a Nobel laureate in physics, is one of many high-profile critics who have voiced concern. D-Wave has made claims that “have not been generally regarded as substantiated in the community,” he told IEEE Spectrum in 2009. Founder Dr. Geordie Rose unveiled D-Wave’s first proof-of-concept processor in 2007 at a high-profile event at the Computer History Museum in Mountain View, Calif. As a science journalist for Nature recalls, this company seemed to come out of nowhere, and most of the academic world thought it was crazy. Classical computers run in binary 1s and 0s, but a quantum computer is comprised of quantum bits or “qubits,” which can carry far more information. D-Wave hopes that this new computing dynamic will give us the capability to determine a variety of possible solutions simultaneously and save energy by speeding up the computing process by many orders of magnitude. The founders have dedicated the past year trying to solidify its claims. But the critics continue to raise concerns after D-Wave raised $30 million in October 2012 from the CIA, Amazon founder Jeff Bezos, and other investors — or when the company sold a quantum computer to Lockheed Martin for $10 million in March. Most impressive of all, in May, Google and NASA announced plans to boot up a quantum computer at NASA Ames Research Center in Mountain View, Calif. To mark the announcement, Google released a short video explaining what quantum computing actually is. To watch it, skip to the bottom of this post. Also in May, a company in Ontario, Canada utterly dismissed D-Wave by claiming to be on the brink of a scientific breakthrough that is “bigger than the moon landing.” Executive-in-residence of the Institute of Quantum Computing Rob Crow told us that “we are trying to be the first to build the quantum computer.” Last month, D-Wave’s chief executive Vern Brownell and chief scientist Eric Ladizinsky visited to discuss how quantum computing could some of the world’s thorniest computing problems. Here are excerpts from that interview. VentureBeat: What is quantum computing? Vern Brownell: Quantum computing uses the laws of quantum mechanics to directly do a computation. The promise of quantum computing is that it can speed up classical algorithms. We use the term “classic” to refer to virtually everything in the world today — these are all classical computers as they are not using quantum mechanics. There are problems that could take all the time in the universe and you still couldn’t solve them — but you could with a quantum computer. We are at the dawn of the quantum-computing industry right now. VentureBeat: You’ve had a long career in technology and finance. What inspired you to join D-Wave? Brownell: I joined D-Wave four-and-a-half years ago after running technology for Goldman Sachs and working in various engineering management roles. I believed then, and certainly now, that this technology is going to change the world at a faster rate. It’s incredibly complicated and a huge opportunity. I also recognize that there is some controversy around quantum computing. But we are off to a great start with customers like Google and Lockheed Martin. When I joined the company, I thought, “This is a big swing — it’s either a crater or the best thing to happen to computing in 20 years.” Now, I’m far more confident. We are proven that this quantum computer exists. This is a tremendous opportunity for our investors and corporate partners. VentureBeat: How does the technology actually work? Brownell: The system at its lowest level is a semiconductor chip. It runs at these very low temperatures. It needs to tap into that quantum mechanical effects. A shielding surrounds the machine that is the size of a fingernail. Eric Ladizinsky: This is not another supercomputer. It’s akin to discovering fire or electricity. The quantum computers use physical phenomenon that seems like magic. The same physical object can live out many possibilities. Here’s an example I use: Imagine you’re at the Library of Congress and surrounded by 50 million books. I put an X in one of those books. Go and find the X. It would be near impossible if you were to look at one book sequentially. You would be acting classically. That is the way that processors work today. The trick is to talk to all of those shelves at once, and have one of those shelves raise its hand when it recognizes the X. VentureBeat: What types of problems will we solve with a quantum computer? Ladizinsky: We can solve very hard problems — those problems that scale exponentially with a number of variables. Genomic matching is a good example — you have to take a genome and match it against a certain pattern. It can be done by a quantum computer much faster than a classical computer. For financial services, we could use the computer to value risk and look at what could happen to the firm’s portfolio or balance sheet. We are really in this for the types of problems we can solve; we are trying to move science forward. There are so many problems that are beyond the capability of classical computers today. VentureBeat: What’s the go-to-market strategy? Brownell: We don’t intend on giving exclusivity to any company for this machine. Our philosophy as we build the business is that we’re partnering with large companies initially to develop the technology. For instance, we are working with Google on machine learning applications. With Lockheed Martin, we’re doing software verification. We are looking for the leaders in teach of the spaces that we’re working in. We’ll develop joint intellectual property and then open it up to everyone else. [youtube=http://www.youtube.com/watch?v=CMdHDHEuOUE&w=560&h=315] VentureBeat's mission is to be a digital town square for technical decision-makers to gain knowledge about transformative enterprise technology and transact. Discover our Briefings. Join us for key insights and networking with leaders in the Data and AI spaces at VB's exclusive after hours event this November! © 2023 VentureBeat. All rights reserved. ",
    "datetime": "2013-12-27T20:03:58+00:00",
    "url": "https://venturebeat.com/business/d-wave-a-multimillion-dollar-sham-or-quantum-breakthrough-interview/"
}