{
    "title": "Deadly heat wave hits Pakistan’s Karachi",
    "text": "© 2023 Copyright France 24 - All rights reserved. France 24 is not responsible for the content of external websites. Audience ratings certified by ACPM/OJD. An intense heat wave killed more than 120 people over the weekend in Pakistan’s southern city of Karachi, officials said on Monday, as the electricity grid crashed during the first days of the Muslim holy month of Ramadan. Issued on: 22/06/2015 - 08:28Modified: 22/06/2015 - 11:04 The outages hit large portions of Pakistan’s financial heart and home to 20 million people, where residents lit bonfires in protest. “Hundreds of patients suffering from the heat wave are being treated at government hospitals,” Saeed Mangnejo, health secretary for the province of Sindh, told Reuters. Temperature soared to 44 degrees Celsius (111 Fahrenheit) on Saturday and hovered at 43 degrees Celsius (109 Fahrenheit) on Sunday, coinciding with a surge of demand for power as families observed  Ramadan, when Muslims fast during daylight hours. Both the federal government and K-Electric, the private company that supplies Karachi with power, had promised there would be no outages during the time when families gathered to break their fast at sunset. Officials from K-Electric were not immediately available for comment on the scale or cause of the outages, which left many families without water, air-conditioning, fans and light. One of the Karachi’s biggest hospitals, the Jinnah Postgraduate Medical Centre, reported 85 deaths from heat stroke and dehydration. Thirty-five patients died from heat stroke in other hospitals, doctors said. Two more died from heat-related complications, Mangnejo said. Corruption and mismanagement mean Pakistan usually suffers eight hours of daily power cuts even in its wealthy urban areas.  Those in poorer areas are hit even harder. The cash-strapped government sells power for less than the cost of production, but its late payments to suppliers cause a chronic shortage. Many wealthy or influential families and factory owners exacerbate the problem by refusing to pay their bills or cutting deals with corrupt power officials. (REUTERS) Daily newsletterReceive essential international news every morning Take international news everywhere with you! Download the France 24 app The content you requested does not exist or is not available anymore. ",
    "datetime": "2015-06-22T06:28:50+00:00",
    "url": "https://www.france24.com/en/20150622-pakistan-karachi-deadly-heat-wave"
}