{
    "title": "\n\tDecoding Hallyu, the Korean Wave in India - The Hindu\n",
    "text": "To enjoy additional benefits CONNECT WITH US September 13, 2019 03:34 pm | Updated September 14, 2019 06:01 pm IST - Thiruvananthapuram COMMents SHARE READ LATER Descendants of the Sun Shivani Suresh is busy catching up on the life of Jang Man-wol, the CEO of Hotel Del Luna, while Renie John is curious to know if Choi Joon-Woo, a transfer student, has settled down in his new school. Malavika Ajith is keeping her fingers crossed for Sung Deok-mi and Cha Shi-an becoming a couple. In case you are wondering, Jang Man-wol, Choi Joon-Woo, Sung Deok-mi and Cha Shi-an are characters from Korean dramas (K-drama), a current viewing favourite amongst many, a part of the Hallyu (Korean wave) that they are riding on. In fact, shows like\nRooftop Prince ,\nThe Heirs  and\nShe was Pretty  are on the must-watch TV list of many millennials. The Hallyu phenomenon began with Korean pop (K-pop), thanks largely to Psy’s\nGangnam Style that went viral. Soon, sleek K-pop videos and lyrics peppered with English, began resonating with many. However, it is not just Korean tunes that are lapped up now, dramas are turning popular too. What's Wrong with Secretary Kim? What's Wrong with Secretary Kim? The Korean wave is at least 10 to 12 years old and started with the rise of Korean films, explains film editor Appu N Bhattathiri. “There was a period in Mollywood when the films were quite monotonous. It was during this time that Kollywood came out with experimental films such as\nPudhupettai , for instance. This kind of cinema was new and gritty and pulled in the audience. People started looking for movies with similar themes on the Internet. One search would throw up options that would include Hollywood, Japanese and Korean films,” says Appu, who ran a film blog, Apur Sansar, in his school days. The International Film Festival of Kerala also helped popularise Korean cinema. “Korean filmmakers such as Park Chan-wook, Kim Ji-Woon and Kim Ki-Duk were pushing the boundaries of filmmaking while our filmmakers were, and to a certain extent still are, sticking within the confines of a box. However, having said that, many Mollywood filmmakers are now gently breaking the audience to newer themes,” says Appu. The crowd that watches K-dramas, according to Appu, are those who watch content on their mobile phones and computers. “K-dramas explore narratives that deal with the youth; I don’t think Indian television targets the youth like they do. Besides, access to Netflix, Amazon and so on has taken viewing to a whole new level. The availability of content has created the urge to explore,” says Appu. The Lonely and Great God – Goblin The Lonely and Great God – Goblin K-dramas are known for their universal appeal as they revolve around familiar themes of love, family and friendship. Good-looking stars, fashionable clothes and opulent sets are also reasons why many are glued to Korean soaps. Homemaker Shruthi Solomon says there is a soap to suit every taste; from forbidden love to rags-to-riches stories and heartbreaking family feuds. “However, Indian serials lack diversity in themes. Also, most of the Malayalam serials are long-winding, aimed at crossing 1,000 episodes,” says Shivani. A typical Korean drama is, however, 16 to 20 episodes. Each episode is usually an hour long. “It’s short, simple and sweet. They are perfect, compact mini-series that you can binge-watch into the wee hours of the morning. Despite being brief, each drama is successful in creating an emotional connect with the viewers,” says techie Parvathy Ravikumar. Top favourites as suggested by K-drama fans WDescendants of the SunBoys over FlowersThe Lonely and Great God – GoblinWhat’s Wrong with Secretary Kim? Nevertheless, actor and producer Chippy Renjith says the story lines and plots might not work in Kerala. “Unlike the Korean TV industry, we do not have a large budget, so our costumes and sets are not as extravagant as theirs. Also, the targeted audience for serial makers is unfortunately not the youth, but the older generation, who prefer watching family dramas or tales from mythologies. Few television producers risk experimenting with new story lines, fearing lower TRP ratings.” Video-streaming sites such as DramaFever, YouTube, Netflix and Viki and even apps such as Rakuten and Viu have made Korean dramas readily available. Each episode comes with English subtitles. WhatsApp groups and various fan pages on Facebook and Instagram keep the devotees in the loop on the latest gossip and happenings in the world of K-drama. Elaborates Malavika: “Music trends change, fashions go in and out of style, personal tastes evolve... However, one thing that never changes is the power of a great story to suck you in. That’s something Korean television is good at — delivering a compelling story. At the end, good storytelling is good storytelling.” COMMents SHARE Thiruvananthapuram\n\n/\n\nThe Hindu MetroPlus\n\n/\n\ntelevision\n\n/\n\narts, culture and entertainment\n\n/\n\nentertainment (general)\n\n/\n\nsociety\n\n/\n\nlifestyle and leisure\n\n/\n\ntelevision industry BACK TO TOP Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. ",
    "datetime": "2019-09-13T10:04:33.000Z",
    "url": "https://www.thehindu.com/entertainment/many-in-thiruvananthapuram-are-now-tuning-into-k-drama/article29408650.ece"
}