{
    "title": "Designer Teo Yang Carries Korean Traditions into the 21st Century",
    "text": "Over the last decade, as the cultural Korean Wave captured our global imagination, Seoul has become synonymous with a look that is slick, shiny, and new. But in the city’s bustling Bukchon Hanok Village, nestled between Gyeongbok and Changdeokgung palaces, traditional homes dating to the Joseon dynasty offer a reminder of the Korean peninsula’s rich aesthetic history. “These houses are all about living with nature,” says designer Teo Yang, who for the past 10 years has lived and worked out of two local hanoks, their swooping roofs framing an interior courtyard. Built out of stone, tile, and wood, using traditional techniques, the early-20th-century residences were devised to weather humid summers and snowy winters alike, keeping people healthy year-round. “Those messages don’t stay in the past. They still speak to people living in the 21st century.” With his home as a case study, Yang has taken on a role of translator between past and present, repackaging centuries-old philosophies into contemporary spaces, products, and brand- ing projects for a worldwide audience. He adapted Joseon-era still-life paintings into wallpapers for de Gournay, and the moon—a Korean symbol of good luck—into an elegant bed for Savoir. He recently revamped the lobby of the Silla History Gallery at the Gyeongju National Museum, creating a sleek, modern backdrop for ancient artifacts from the rise of Korean civilization. And he not only launched his own skin-care line, EATH Library (focused on natural ingredients), but consults for international cosmetics brands like SK-II and LG. His interiors, meanwhile, span galleries, restaurants, stores, and private homes, increasingly abroad. In Los Angeles, a residence for an influential Korean family and a karaoke lounge for SM Management, a major K-Pop label, are in the works. Yang grew up in Seoul but left home at the age of 19, studying interior architecture at the School of the Art Institute of Chicago, then environmental design at Pasadena’s Art Center College of Design. He developed his interest in revisiting ancient Korean folklore and philosophy in, of all places, Amsterdam, where he worked for Marcel Wanders. Observing how the Dutch design star reexamined his own heritage, Yang began to mine the rich culture of craft he had grown up around, noting, “He inspired me to look at myself and made me want to go back to my own roots. \"There is a Korean philosophy called ‘no taste,’ ” Yang goes on. “It’s like taste beyond taste. You’ve had all the best things in your life. But now you know that materialism doesn’t make you happy.” It’s the inspiration behind Eastern Edition, his new line of pared-down furnishings that recall Korean traditions and reveal the same material-first thinking as seen in hanoks. A stool is topped with two black cushions, symbols of respect. (“There’s an old saying that if you don’t respect someone, you don’t offer them a cushion.”) A daybed in walnut and bronze likewise holds significance, particularly for Korean scholars. “You study on it, you eat on it, you sleep on it,” explains Yang. “It talks about the balance of life and work.” And the organic shapes of a black-stained walnut writing desk and a granite and stainless-steel side table nod to water-smoothed pebbles, celebrated objects in Korean culture. “In Korea, our life is based on wood,” Yang says of the collection’s predominant material. “We build our houses using wood; we build our furniture using wood. Even the chopstick and spoon are made of wood.” To produce the collection, he teamed up with a handful of local woodworkers out of both necessity (importing was a challenge during the pandemic) and personal interest. Yang has long advocated for the preservation of local craft, even partnering with the YÉOL Korean Heritage Preservation Society to create an archive of artisans nationwide. In the future, he’s looking forward to collaborating with stone carvers, bronze workers, and bamboo weavers. “Creating a story is the most crucial part of Teo’s design process,” says Alistair Hughes, the managing director of Savoir. “His designs and stories not only acknowledge traditional Korean culture but also have a contemporary aesthetic.” It’s a sentiment echoed by another past collaborator, de Gournay’s Hannah Cecil Gurney, who notes, “Teo captivated us with tales of Korean art history and the visual traditions of the Joseon dynasty.” Nowadays the world is watching as Seoul enjoys its moment as a reenergized nexus of music, art, technology, beauty, and now design. But while the city evolves, Yang laments, “I have seen so much of our heritage disappearing, things without context showing up.” His work aims to counter that. “Focusing on local context, on heritage, on culture, and putting it in a very modern, 21st-century aesthetic has become a sort of manifesto for me.” Originally Appeared on Architectural Digest ",
    "datetime": null,
    "url": "https://news.yahoo.com/designer-teo-yang-carries-korean-121808042.html"
}