{
    "title": "Direct flights, K-Pop driving jump in Bruneian tourists to Korea - The Scoop",
    "text": "BANDAR SERI BEGAWAN – Buoyed by direct flights to Seoul and the popularity of K-Wave culture, visitor numbers from Brunei to Korea jumped 29.6 percent last year, making the sultanate an emerging market to fuel Korea’s halal tourism industry. Speaking during a travel seminar on Thursday, Korean ambassador Yoon Hyun Bong said that the number of Bruneian tourists going to Korea has been steadily increasing. In 2016, 2,997 Bruneians visited Korea, going up to to 3,763 in 2017 and 4,876 in 2018. The figure is projected to exceed 5,000 for 2019. Yoon attributed the growing interest in Korea to the introduction of direct flights between the capitals, as well as the influence of K-Pop culture in Asia. The market is still at an early stage, but I believe that there is high potential to bring more Bruneians to Korea as we develop tourism products related to the K-Wave and halal food experiences, she said. June Lau Shi Yun, marketing manager of the Korean Tourism Organization in Malaysia and Brunei, said Korea is trying to strengthen its capacity to tap into the halal tourism market, especially within Muslim-majority countries in ASEAN. She said despite its small market size, Bruneians have stronger spending power than tourists from Malaysia and Indonesia, preferring shopping to other tourist activities. “We are constantly trying to strengthen our offerings in terms of halal Korean food, as most of the halal restaurants available in Korea are Indian and Middle Eastern cuisine. “We do have a few restaurants in Seoul that offer halal-certified Korean food, and a lot of tourism players are working really hard to accommodate all Muslim travelers with hotels and new malls providing prayer rooms, because the Muslim market is really big”. According to the State of the Global Islamic Economy report, Muslim spending on travel was at US$177 billion in 2017 and is expected to grow to US$274 billion by 2023. Lee Younggeun, managing director of KTO in Malaysia and Brunei, said there were still challenges in expanding the Brunei market and that more promotion was needed. “Fortunately in recent years, local governments and tour agencies from Korea have recognised the great outbound tourism potential of Brunei, and are starting to invest more interest in the country,” he said. In 2017, Korea was the ninth most popular tourist destination in Asia with 13.3 million international visitors. Follow us on YouTube Copyright [wpsos_year] Scoop Media ",
    "datetime": "2019-06-20T22:39:26+00:00",
    "url": "http://thescoop.co/2019/06/21/direct-flights-k-pop-driving-jump-in-bruneian-tourists-to-korea/"
}