{
    "title": "Direct observation of negative-index microwave surface waves | Scientific Reports",
    "text": "Thank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\n            the best experience, we recommend you use a more up to date browser (or turn off compatibility mode in\n            Internet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles\n            and JavaScript. Advertisement Scientific Reports\nvolume 6, Article number: 22018 (2016)\n            Cite this article 1809 Accesses 20 Citations 1 Altmetric Metrics details Waves propagating in a negative-index material have wave-front propagation (wavevector, k) opposite in direction to that of energy flow (Poynting vector, S). Here we present an experimental realisation at microwave frequencies of an analogous surface wave phenomenon whereby a metasurface supports a surface mode that has two possible wavevector eigenstates within a narrow band of frequencies: one that supports surface waves with positive mode index and another that supports surface waves with negative mode index. Phase sensitive measurements of the near-field of surface waves across the metasurface show the contrasting spatial evolution of the two eigenstates, providing a unique opportunity to directly observe the negative-index phenomenon. Waves that propagate in any medium characterised by a negative refractive index are defined by the propagation of wave-fronts (k) that move in the opposite direction to the energy flow (S). Such behaviour was first reported in 1960 by Clarricoats and Waldron1 in circular metallic waveguides consisting of a high index core surrounded by lower index cladding. Given an injected wave with a known wavevector, the relative proportion of local energy flow in each medium will dictate the overall magnitude and direction of the Poynting vector. In a theoretical study in 1968, Veselago proposed2 that a similar result may be observed in a bulk material that possesses simultaneously negative electric permittivity ε and magnetic permeability μ. Such negative-index materials have not been found to exist in nature, so this idea lay dormant until the year 2000 when it was revived by Pendry3. Since then, a significant body of research has been devoted to developing artificial media (metamaterials) with negative refractive indices4,5,6, owing to a range of potential interesting possibilities such as a reversed Snell’s law7,8, a reversed Doppler shift9and a reversed Vavilov-Cerenkov effect10. It has also been shown that a reversed Snell’s law or ‘negative refraction’ can be observed using non-linear media, for example, four-wave mixing using graphene, as demonstrated by Harytyunyan et al.11. One may extend the concept of a negative refractive index to other systems, such as electromagnetic waves bound to surfaces. An example of one such wave is the surface plasmon polariton (SPP)12; an electromagnetic surface wave that propagates non-radiatively along the interface between a metal and a dielectric and is typically found at optical and ultra-violet frequencies13, where there is significant field penetration into the metal. Indeed negative refraction of SPPs has been reported both in theory14 and in experiment15. In these examples, it is important to note that it is the surface mode index that is negative and not the bulk refractive index of the media either side of the interface. In bulk matter, a negative refractive index is often demonstrated by presenting a refracted signal on the ‘wrong’ side of the surface normal. However, the lack of phase sensitivity in such a bulk experiment does not readily allow for the relative directions of S and k to be resolved. It is the topic of this present study to provide detailed phase sensitive measurements of the local fields of microwave surface waves that evanescently decay from the interface to which they are confined, providing a unique opportunity to directly visualise the negative index phenomenon. Due to the ease of experimentation and sample fabrication methods, we elect to undertake our studies in the microwave regime. At these low frequencies, metals are nearly perfectly conducting and SPPs are no longer strongly localised at the interface16: they are, in effect, simple surface currents. However, in 2004, Pendry showed theoretically17 and experiment later confirmed18, that perforating a planar metal surface with an array of sub-wavelength holes allows the surface to support SPP-like modes, even in the perfectly conducting limit. Although Pendry’s geometry is possibly the most well-known “spoof” SPP supporting ‘metasurface’19, there are a number of other well-documented geometries that give strong confinement of surface waves that are similarly analogous to SPPs20,21,22. Some of these were conceived many decades before the terms metamaterial and spoof surface plasmon polariton were coined, for example the grooved structures explored by Cutler in the 1940s (republished in 1994)23, developed in order to control the propagation of surface waves on the metallic skin of aircraft. In this present work, we investigate a variation of the well-known ‘mushroom’ metasurface that was first proposed as a resonant high-impedance surface for microwaves by Sievenpiper et al.24. The transverse-magnetic (TM) surface mode supported by this metasurface exhibits ‘negative dispersion’13 allowing for a negative mode index to be achieved. The dispersion curve for the TM surface mode supported by the sample studied in this paper is shown by the grey line in Fig. 1, where a schematic depicting a small section of this 45 cm × 45 cm sample is included as an inset. This dispersion curve is calculated using finite element method (FEM) numerical simulations (COMSOL Multiphysics). It is evident that, within a small frequency window (12.5 – 14.0 GHz), two wavevector eigenstates (k+ and k–) exist with contrasting signs of group velocity either side of the dispersion’s turning point. Since for low-loss systems, as studied here, the direction of the group velocity coincides with the direction of the energy flow25, this implies that one eigenstate supports surface waves with aligned S and k (positive mode index, denoted k+) and a second eigenstate supports surface waves with anti-aligned S and k (negative mode index, denoted k–). The dispersion curve is shown for both positive and negative k||, with the eigenstates that are denoted without a prime possessing a positive group velocity and those labelled with a prime possessing a negative group velocity. This is an important distinction, with the reasoning most easily explained if one considers this mode excited along the line (i.e. in 1D) to which this dispersion curve corresponds. In this case, it is these two pairs (primed and un-primed) of eigenstates that will contribute to separate interference patterns either side of a point source. The rectangular ‘mushroom’ array investigated in this study supports a transverse-magnetic surface mode. Predictions of the dispersion curve for a surface mode along the Γ to X direction is shown (grey line), where two wavevector eigenstates (k+ and k–) exist within a small frequency window. The eigenstate labelled as k– has opposing S and k as a consequence of the magnitude of the integrated local power flow below the surface (where it is negative, blue line) exceeding that above the surface (where it is positive, red line). The eigenstates denoted with a prime have a negative group velocity and those that are not have a positive group velocity. (Inset) A schematic depicting a small section of the ‘mushroom’ sample, that consists of an array of 17 μm thick rectangular copper patches of size ax = 2.47 mm × ay = 2.97 mm, arranged in a rectangular lattice of pitch λx = 2.70 mm × λy = 3.20 mm, where each patch is separated from a ground plane by a t = 0.79 mm thick dielectric (εr = 2.220 + 0.002i) layer, but electrically connected to it by a centrally located pin of radius rp = 0.15 mm that is located at the centre of each patch. The presence of the turning point and the shape of the dispersion curve can be understood by examining the local power flow in two distinct regions of this metasurface. The magnitude of the integrated local power flow (also calculated from numerical simulations) above (red line) and below (blue line) the surface of the structure is also shown in Fig. 1 for positive k||. Unlike the surface waves supported by Pendry’s hole-array geometry17, surface modes supported by the mushroom array allow for power flow beneath the surface to which the mode is localised. Crucially, this power flows in the opposite direction to that in the air above the surface26. Hence the dispersion curve of the surface mode exhibits a maximum in frequency at a wavevector far from the Brillouin Zone boundary, where the magnitude of these contributions becomes equal; this is unlike the case for single interface SPPs on bulk metals where the magnitude of the power flow within the substrate cannot exceed that in the dielectric above12. Either side of this maximum, the dominant contribution to the power flow determines the net direction of the energy flux and hence, the sign of the group velocity. The numerical calculations of the surface mode dispersion illustrated in Fig. 1 demonstrate the negative mode-index phenomenon along the ΓX direction in reciprocal space. However in order to fully understand the wave’s propagation on the surface, it is helpful to explore the full 2D band-structure (Fig. 2(A)). This data is re-plotted as iso-frequency contours (Fig. 2(B–F)), with the plot for 13.0 GHz in Fig. 2(D) corresponding to the plane drawn through the band structure in Fig. 2(A). In these diagrams, the red lines, labelled with outward-going arrows in Fig. 2(D), represent the k+ eigenstate contours with positive mode index and the blue lines represent the k– eigenstate contours (inward arrows) with negative mode index. In these plots, the k– and k+ contours contain both the primed and un-primed eigenstates that are shown in Fig. 1 and so are simply referred to as the k– and k+ contours. Although not a topic for study in this paper, it is also apparent that the contours for the two eigenstates merge above the frequency of the turning point of the mode’s dispersion mode in the ΓY direction. The appearance of the closed contours (purple lines) is due to the difference in this limiting frequency in the ΓX and ΓY directions, which itself is a consequence of Bragg scattering associated with the rectangular symmetry of the geometry. The surface wave eigenstates for the rectangular ‘mushroom’ array, calculated using numerical simulations. (A) The dispersion surface of the mode where the colour represents the frequency. The grey cone represents the ‘light cone’, the three dimensional representation of the light circles and the dark transparent plane drawn at 13.0 GHz demonstrates how the dispersion surface corresponds to the iso-frequency contour plots (D). (B–F) The iso-frequency contours for this surface mode are shown for several frequencies, where the k+ eigenstate is signified by the red lines and the k– eigenstate is shown by the blue lines. Purple lines indicate iso-frequency contours for frequencies above the surface mode limit frequency along the ΓY direction, where the k+ and k– contours merge and create two closed contours. The black circles (‘light circles’) represent the maximum in-plane wavevector obtainable for a freely propagating plane-wave at each frequency and the coloured arrows represent the direction of group velocity vg = ∇kω, for the relevant eigenstate; the latter also highlighting that the two contours disperse in opposite directions as frequency is increased. In order to probe the surface eigenmodes supported by the mushroom metasurface (Fig. 1(A)), phase-sensitive near-field measurements are recorded using a Vector Network Analyser (VNA) and a motorised translation stage (see Fig. S1 in the Supplementary Material). A map of the measured instantaneous electric field profile27, recorded at 13.0 GHz for a centrally located point source is presented in Fig 3(A). Notice the presence of four narrow beams and further notice the wavelength of the surface wave within these beams is much shorter than of the isotropic pattern on the bulk of the surface. By reviewing the iso-frequency contours at 13.0 GHz (Fig. 2(D)), the strongly anisotropic propagation characteristic of the k– contour (blue) associated with the beams is clearly apparent. It is in stark contrast to the isotropic propagation of the k+ contour (red) responsible for the fields on the rest of the surface. Of course, the measured instantaneous electric field profile of surface waves emitted from a point source contains both of these contrasting excitation patterns and although surface waves from both eigenstates are indeed present in all directions, the directional weighting of these two eigenstates vary drastically. Hence, along the beams the k– eigenstate (negative mode-index) dominates the measurement and outside of these beams, the k+ eigenstate (positive mode index) dominates the measurement. Measurements of surface waves emitted from a centrally located point source on the rectangular ‘mushroom’ array metasurface. (A) The measured instantaneous electric field (Ez) map for a frequency of 13.0 GHz, where the source antenna is located at the centre of the plot. The point source excitation pattern for the k+ eigenstate is almost perfectly isotropic whereas the excitation pattern for the k– eigenstate comprises of four beams and so the measurement represents a convolution of both. The variation between the magnitudes of the four beams is a consequence of experimental inaccuracies in the form of imperfect azimuthal invariance of the excitation pattern of surface waves emitted from the source and the angles from which the beams propagate outwards from the source is representative of the rectangular symmetry of the sample. (B) By interpolating the Cartesian grid of the measured phase map along the solid black lines shown in (A), a comparison between the phase of the k+ and k– eigenstates can be made. The unwrapped (removing the 2π degeneracy) phase from outside of the beams (k+ eigenstate) is shown by the red dots and the unwrapped phase from within a beam (k– eigenstate) is shown by the blue dots, with the coloured lines representing least squares fits. It is evident that the phase along these two lines cycles in different directions, with the negative gradient of the unwrapped phase within the beam implying the presence of a negative mode index. There is a unique opportunity to directly observe the negative-index character of these surface waves if the instantaneous field plot (Fig. 3(A)) is animated in time (phase). This is beautifully visualised in the Supplementary Material in movie S1, where the wave-fronts within the beams (k–) move towards the source and the wave-fronts outside of the beams (k+) move away from the source. By construction, the experimental setup requires power to flow away from the source and the fact that the wave-fronts within the beams are propagating in the opposite direction clearly demonstrates that the S and k vectors (i.e. the group and phase velocities) point in opposite directions and that the system exhibits a negative mode index. This is entirely analogous to the propagation of waves in media with negative refractive indices and is the first such experimental field map showcasing the negative-index phenomenon. By interpolating the Cartesian grid of the measured phase map along the solid black lines shown in Fig. 3(A), a comparison between the phase cycles of surface waves with in-plane wavevectors defined by the k+ and k– contours can be made. This analysis does of course make the assumption that only the surface waves with an in-plane wavevector defined as k+ are found outside of the beams and that only surface waves with an in-plane wavevector defined as k– are found within the beams. The unwrapped (removing the 2π degeneracy) phase along these lines is shown in Fig. 3(B) (coloured dots), where it is evident that the phase for the two eigenstates cycles in opposite directions. The gradient of a least squares fit (coloured lines) to each of these data sets reveals the in-plane wavevector component , which is measured to be k+ = 327 ± 1 m−1 and k– = −666 ± 2 m−1 along the relevant directions respectively. This compares favourably to the location of the peaks in the iso-frequency contour measurements (to be discussed shortly) along the relevant directions in Fig. 4(C) of k+ = 330 ± 16 m−1 and k– = −662 ± 16 m−1. Measurements of the iso-frequency contours of the surface mode supported by the rectangular ‘mushroom’ array metasurface. The magnitude of 2D Fast Fourier Transforms (FFT) of the measured instantaneous electric field maps such as that shown in Fig. 3(A) is shown for a series of frequencies, where the ‘peaks’ in Fourier amplitude (colour scale) correspond to the iso-frequency contours shown in Fig. 2. The signals from the four quadrants of the FFT have been averaged with respect to the symmetry planes of the metasurface in order to improve the signal-to-noise ratio (the Supplementary Material details the calculation of these plots) whilst the white circles represent the ‘light circles’ at the various frequencies. By performing a 2D Fast Fourier Transform (FFT) on the derived instantaneous electric field measurements (see the methods section), the wavevectors,  present in the measured field maps can be determined28. This technique therefore allows the eigenmodes present in the system to be mapped out, where these plots represent a convolution of the available eigenstates of the metasurface and the in-plane excitation pattern of the source. The measured iso-frequency contours are shown in Fig. 4, where the signals from the four quadrants have been averaged with respect to the symmetry planes of the metasurface, in order to improve the signal-to-noise ratio. These measured FFT plots confirm the band structure of the eigenmodes supported by the sample and hence the iso-frequency contours. The peaks in the Fourier amplitude with larger in-plane wavevectors than that available to freely propagating plane-waves (white circles) are identified as the non-radiative surface wave solutions and the distribution of these peaks agrees very well with the modelled iso-frequency contours Fig. 2(B–F). By monitoring the positions of the peaks that correspond to the k+ and k– contours, it is clear that they disperse in opposite directions. Thus the nature of the k– eigenstate as having phase and group velocities of opposite sign and of the k+ eigenstate as having phase and group velocities of the same sign is again confirmed. For a clearer demonstration of the evolution of the measured iso-frequency contours with frequency, see movie S2 in the Supplementary Material. These measurements are also reformatted in the form of a measured dispersion curve in supplementary Fig. S2, also in the Supplementary Material. We have presented measurements demonstrating the flow of power (Poynting vector S) propagating in the opposite direction to the wave fronts (wavevector k) within beams of electromagnetic surface waves. This represents a surface-wave analogue of the negative-index phenomenon and these measurements constitute the first such direct experimental observation in the form of both a field map and iso-frequency contours that showcase this effect. We provide animations showing the phase-evolution of the generated surface waves in the Supplementary Material, as well as an animation of the evolution of the iso-frequency contours with frequency. The animated field map beautifully visualises the negative-index phenomenon since the wave-fronts within the beams propagate towards the source. The metasurface investigated in this study is fabricated using printed circuit board (PCB) technology. First, an array of holes is drilled completely through a 0.79 mm thick, 450 × 600 mm panel of Nelco NY-922029, clad either side with a 17 μm thick copper layer. Electroless deposition is subsequently used to deposit copper on the inner surface of the holes, where the outer radius of these hollow, metallic ‘pins’ is 150 μm. For the final step, the desired pattern of patches is etched into the top copper layer, so that a pin is located at the centre of each patch, providing electrical connection to the continuous lower copper layer (‘ground plane’). Our experimental methods allow for the measurement of the instantaneous electric field profile of the surface waves that are excited from point source located at the sample’s centre (an illustration is included in. Such a setup is preferable to other excitation mechanisms such as the Otto configuration30 since it is less invasive (for an Otto excitation, the close proximity of a high index dielectric to the sample surface will invariably alter the surface mode dispersion) and allows for the excitation of surface waves in all directions. Two antennas31 are used to provide the near-field excitation and to probe the z-component of the local electric fields (see Fig. S1 in the Supplementary Material). They each comprise of a cut length of coaxial line, with the outer conductor and insulation removed from the final few millimetres and are connected to separate ports of a vector network analyser (VNA) to provide measurements of both time averaged electric field magnitude and phase (continuous wave). The exact experimental arrangement involves one probe (that is designated as the source antenna) being threaded through a small hole that is drilled through the centre of the sample, at a point precisely between four patches. The corners of those four patches are slightly modified in order to prevent any electrical contact with the antenna. A second antenna (that is designated as the detector antenna) is oriented normal to and just above (~1 mm) the metasurface and is attached to a motorised xyz-stage. This antenna is scanned across an area of the sample of approximately 200 × 200 mm with a step size 0.675 mm in the x direction and 0.800 mm in the y direction (i.e. four measurement points per unit cell). The raw measurements of time averaged electric field magnitude |Ez| and phase φ are subsequently combined to allow for the instantaneous electric field |Ez| exp(iφ) to be derived27. A 2D Fast Fourier Transform (FFT) is then performed upon this data, with the magnitude of the Fourier terms indicative of the wavevector components present in the spatial field measurement. Since the metasurface has two orthogonal mirror symmetry planes, the signal-to-noise ratio in the FFT is improved by averaging the data from each of the four quadrants, hence imposing the symmetry of the metasurface onto the measurements. An animation of the surface wave fields on resonance provides a beautiful demonstration of the negative mode index phenomenon. This animation (Movie S1) is generated by systematically advancing the phase (across a full temporal cycle), with the instantaneous electric field recalculated for every increment in phase. This allows the dynamics of the available surface-wave eigenstates to be directly visualised. How to cite this article: Dockrey, J. A. et al. Direct observation of negative-index microwave surface waves. Sci. Rep. 6, 22018; doi: 10.1038/srep22018 (2016). Clarricoats, P. J. B. & Waldron, R. A. Non-periodic Slow-wave and Backward-wave Structures. J. Electron. Contr. 8, 455 (1960). Article \n    \n                    Google Scholar Veselago, V. The Electrodynamics of Substances With Simultaneously Negative Values of ε and μ. Sov. Phys. Usp. 10, 509 (1968). Article \n    ADS \n    \n                    Google Scholar Pendry, J. B. Negative Refraction Makes a Perfect Lens. Phys. Rev. Lett. 85, 3966 (2000). Article \n    ADS \n    CAS \n    \n                    Google Scholar Smith, D., Pendry J. B. & Wiltshire, M. Metamaterials and Negative Refractive Index. Science 305, 788 (2004). Article \n    ADS \n    CAS \n    \n                    Google Scholar Dolling, G. et al. Simultaneous Negative Phase and Group Velocity of Light in a Metamaterial. Science 312, 5775 (2006). Article \n    \n                    Google Scholar Shalaev, V. Optical Negative-Index Metamaterials. Nat. Photon. 1, 41 (2007). Article \n    ADS \n    CAS \n    \n                    Google Scholar Shelby, R., Smith, D. & Schultz, S. Experimental Verification of a Negative Index of Refraction. Science 292, 77 (2001). Article \n    ADS \n    CAS \n    \n                    Google Scholar Parozzoli, C. et al. Experimental Verification and Simulation of Negative Index of Refraction Using Snell’s Law. Phys. Rev. Lett. 90, 107401 (2003). Article \n    ADS \n    \n                    Google Scholar Chen, J. et al. Observation of the Inverse Doppler Effect in Negative-Index Materials at Optical Frequencies. Nat. Photon. 5, 239 (2011). Article \n    ADS \n    CAS \n    \n                    Google Scholar Xi, S. et al. Experimental Verification of Reversed Cherenkov Radiation in Left-Handed Metamaterial. Phys. Rev. Lett. 103, 194801 (2009). Article \n    ADS \n    \n                    Google Scholar Harutyunyan, H., Beams, R. & Novotny, L. Controllable Optical Negative Refraction and Phase Conjugation in Graphite Thin Films. Nature 9, 423 (2013). CAS \n    \n                    Google Scholar Maradudin, A. A., Barnes, W. L. & Sambles, J. R. Modern Plasmonics, Elsevier Science Ltd (2014). Tsuei, K. D., Plummer, E. W. & Feibelman, P. J. Surface-Plasmon Dispersion in Simple Metals. Phys. Rev. Lett. 63, 2256 (1989). Article \n    ADS \n    CAS \n    \n                    Google Scholar Shin, H. & Fan, S. All-Angle Negative Refraction for Surface Plasmon Waves Using a Metal-Dielectric-Metal Structure. Phys. Rev. Lett. 96, 073907 (2006). Article \n    ADS \n    \n                    Google Scholar Lezec, H., Dionne, J. & Atwater, H. Negative Refraction at Visible Frequencies. Science 316, 430 (2007). Article \n    ADS \n    CAS \n    \n                    Google Scholar Barnes, W. L. & Sambles, J. R. Only Skin Deep. Science 305, 785 (2004). Article \n    CAS \n    \n                    Google Scholar Pendry, J. P., Martin-Moreno, L. & Garcia-Vidal, F. J. Mimicking Surface Plasmons with Structured Surfaces. Science 305, 847 (2004). Article \n    ADS \n    CAS \n    \n                    Google Scholar Hibbins, A. P., Evans, B. R. & Sambles, J. R. Experimental Verification of Designer Surface Plasmons. Science 308, 670 (2005). Article \n    ADS \n    CAS \n    \n                    Google Scholar Kildishev, A. V., Boltasseva, A. & Shalaev, V. M. Planar Photonics with Metasurfaces. Science 339, 1232009 (2013). Article \n    \n                    Google Scholar Navarro-Cia, M. et al. Broadband Spoof Plasmons and Subwavelength Electromagnetic Energy Confinement on Ultrathin Metafilms. Optics Express 17, 18184 (2009). Article \n    ADS \n    CAS \n    \n                    Google Scholar Xue, L. & Fusco, V. Printed Holey Plate Luneburg Lens. Micr. Opt. Techn. Let. 50, 378 (2008). Article \n    \n                    Google Scholar Hooper, I. R. et al. Massively Sub-wavelength Guiding of Electromagnetic Waves. Sci. Rep. 1, 7495 (2014). Google Scholar Cutler, C. C. Genesis of the Corrugated Electromagnetic Surface. Proc. IEEE Ant. Prop. Soc. Int. Sym. URSI Nat. Rad. Sci. Meet. Seattle (1994). Sievenpiper, D. et al. High-Impedance Electromagnetic Surfaces with a Forbidden Frequency Band. IEEE T. Microw. Theory 47, 2059 (1999). Article \n    \n                    Google Scholar Feigenbaum, F., Kaminski, N. & Orenstein M. Negative Dispersion: A Backward Wave or Fast Light? Nanoplasmonic Examples. Optics Express 17, 18934 (2009). Article \n    ADS \n    CAS \n    \n                    Google Scholar Clavijo, S., Díaz, R. E. & Mckinzie, W. E. Design Methodology for Sievenpiper High-Impedance Surfaces: An Artificial Magnetic Conductor for Positive Gain Electrically Small Antennas. IEEE T. Antenn. Propag. 51, 2678 (2003). Article \n    ADS \n    \n                    Google Scholar Dockrey, J. A. et al. Thin Metamaterial Luneburg Lens for Surface Waves. Phys. Rev. B 87, 125137 (2013). Article \n    ADS \n    \n                    Google Scholar Engelen, R. J. P. et al. Ultrafast Evolution of Photonic Eigenstates in k-Space. Nat. Phys. 3, 401 (2007). Article \n    CAS \n    \n                    Google Scholar Park Electrochemical Corporation. http://www.parkelectro.com/ (2013) (Date of access:10/04/2015). Otto, A. Excitation of Nonradiative Surface Plasma Wave in Silver by the Method of Frustrated Total Reflection. Zeitschrift fur Physik 216, 398 (1968). Article \n    ADS \n    CAS \n    \n                    Google Scholar Berry, S. J. et al. Surface Wave Resonances Supported on a Square Array of Square Metallic Pillars. Appl. Phys. Lett. 100, 101107 (2012). Article \n    ADS \n    \n                    Google Scholar Download references The authors wish to acknowledge financial support from the EPSRC through the University of Exeter’s Doctoral Training Account and also for support through the QUEST programme grant (EP/I034548/1) “The Quest for Ultimate Electromagnetics using Spatial Transformations”. Department of Physics and Astronomy, Electromagnetic and Acoustic Materials Group, University of Exeter, Stocker Road, Exeter, EX4 4QL, UK J. A. Dockrey, S. A. R. Horsley, I. R. Hooper, J. R. Sambles & A. P. Hibbins You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar J.A.D. designed, performed and analysed the data from the experiments and wrote the manuscript under the supervision of J.R.S. and A.P.H. Both S.A.R.H. and I.R.H. contributed to the interpretation of the measurements, provided tools for the analysis and co-wrote the manuscript. The authors declare no competing financial interests. This work is licensed under a Creative Commons Attribution 4.0 International License. The images or other third party material in this article are included in the article’s Creative Commons license, unless indicated otherwise in the credit line; if the material is not included under the Creative Commons license, users will need to obtain permission from the license holder to reproduce the material. To view a copy of this license, visit http://creativecommons.org/licenses/by/4.0/ Reprints and Permissions Dockrey, J., Horsley, S., Hooper, I. et al. Direct observation of negative-index microwave surface waves.\n                    Sci Rep 6, 22018 (2016). https://doi.org/10.1038/srep22018 Download citation Received: 03 December 2015 Accepted: 29 January 2016 Published: 23 February 2016 DOI: https://doi.org/10.1038/srep22018 Anyone you share the following link with will be able to read this content: Sorry, a shareable link is not currently available for this article.  Provided by the Springer Nature SharedIt content-sharing initiative Scientific Reports (2018) By submitting a comment you agree to abide by our Terms and Community Guidelines. If you find something abusive or that does not comply with our terms or guidelines please flag it as inappropriate. Advertisement Scientific Reports (Sci Rep)\n                \n\nISSN 2045-2322 (online) © 2023 Springer Nature Limited Sign up for the Nature Briefing newsletter — what matters in science, free to your inbox daily. ",
    "datetime": null,
    "url": "https://www.nature.com/articles/srep22018"
}