{
    "title": "Disneyland, Ocean Park and more join Hong Kong Summer Fun with new features, exhibits | Philstar.com",
    "text": "MANILA, Philippines – To this day, families and friends visiting Hong Kong are impressed with the variety of activities compactly and conveniently located in Asia’s World City. From special interest museums to the world’s most famous theme parks, Hong Kong packs fun and wonder for all its visitors in all its dynamic corners. Now, as summer in the city comes in, new features and exhibitions are waiting to be explored by tourists, along with smashing deals from Hong Kong Summer Fun which runs until August 31, 2015. World-class entertainment destinations lead the summer revelries as Hong Kong Disneyland presents the Frozen village. Based on the 2013 blockbuster animation, the village is a welcome break from the heat with its enchanting winter wonderland setting. Musical performances from Queen Elsa, Princess Anna, and Kristoff await arriving guests who can also hug Olaf and try out a toboggan ride. Characters from popular messaging app LINE are also making their way to Ocean Park Hong Kong for an exciting water party at the Ocean Park Summer Splash 2015. LINE friends Brown, Cony, and Sally are all ready to get wet with guests in water activities which include a maze, slide, waterfall swings, and disco foam party. Hong Kong’s museums are also prepping for new exhibits starting off with Madame Tussauds. The world-famous wax museum recently opened two new zones in celebration of its 15th anniversary: the K-Wave Zone and Kung Fu Zone. K-Wave brings together some of South Korea’s biggest stars like Kim Soohyun, Bae Yong Joon, TVXQ, 2PM’s Nichkhun, and Super Junior’s Choi Siwon. Meanwhile, the Kung Fu Zone kicks off with the biggest names in kung fu, led by Bruce Lee, Jackie Chan, Michelle Yeoh and Donnie Yen. Fans of the popular Japanese animated series One Piece are also in for a special visit as the Straw Hat crew invades the Hong Kong 3D Museum. Enjoy priceless photo opportunities with family and friends with the characters from the show in over 30 photo spots featuring famous scenes from the series. Spend a day in the awesome world of 3D at the Repulse Bay Visual Art Museum, Hong Kong’s largest 3D museum standing at an area of over 2,000 square meters. Visitors of all ages can experience the art of optical illusion with the museum’s 3D paintings and digital artwork. Afterwards, there’s also the option to enjoy some sand and sea at the nearby Repulse Bay Beach. The wildly popular Trick Eye Museum from South Korea also recently opened at the Peak Galleria Mall, offering guests even more options for fun 3D photos and adventures. The museum comprises creatively-themed sections with each housing a magnificent collection of 3D art pieces. Get ready to flood your social media with photos of this hub of visual wonders. The audio visual feast Hong Kong Pulse 3D Light Show also returns to join the summer festivities. This technological marvel is again geared to inspire awe among audiences with a new summer-themed show. Apart from the thrilling line-up of exhibitions and activities, visitors will also get the chance to redeem prizes through various promotions. e-Coupons that unlock instant gourmet privileges, shopping discounts, and one-of-a-kind offers may be downloaded at DiscoverHongKong.com. The Shop Eat Play VIP Card gives visitors exclusive offers and discounts from participating merchants — the VIP Card will be included in the Welcome Pack, which will be distributed in the pre-immigration hall of the Hong Kong International Airport. Visitors can also get an exciting free gift at the Hong Kong Summer Fun booth upon arrival. A Hong Kong trip valued at PHP 1.7M (HK$300,000) is also up for grabs in the Return To Hong Kong Like A Millionaire grand draw. Truly, there’s no better time to gather friends and families than this summer as Hong Kong’s most popular destinations deck out to give visitors an unforgettable visit with Hong Kong Summer Fun. Log on to DiscoverHongKong.com for more information. READ MORE: Indulging in Hong Kong’s flavor feast The shopper’s paradise: Hong Kong and its retail stars Hong Kong Summer Fun brings a fete of sizzling sights and offers  Philstar.com is one of the most vibrant, opinionated, discerning communities of readers on cyberspace. With your meaningful insights, help shape the stories that can shape the country. Sign up now! ",
    "datetime": null,
    "url": "https://www.philstar.com/lifestyle/travel-and-tourism/2015/07/29/1479025/disneyland-ocean-park-and-more-join-hong-kong-summer-fun-new-features-exhibits"
}