{
    "title": "Diversity, sporting power on show at Asiad opening | Reuters",
    "text": "Discover Thomson Reuters By Peter Rutherford 6 Min Read INCHEON South Korea (Reuters) - The 17th Asian Games opened in a multi-coloured blaze of fireworks and carefully crafted K-Pop routines on Friday, as athletes from the world’s most populous region came together in pursuit of gold and glory in South Korea. An array of Olympians and regional sports stars will compete over 15 days of competition in Incheon where South Korean President Park Geun-hye and Olympic chief Thomas Bach were among the powerful figures watching a vivid opening ceremony. Athletes dressed in colourful national garb, sharp suits and comfortable tracksuits waved to a crowd of 60,000, who offered enthusiastic welcomes to delegations from 45 countries including the South’s belligerent neighbour, North Korea. South Korean culture, known as the ‘Korean Wave’ or Hallyu, has swept through Asia in recent years generating billions of dollars in revenue from drama and pop music and Friday’s ceremony drew heavily on its influence. Actress and model Lee Young-ae, the face of countless commercials across the region, lit the Asian Games cauldron and ‘Gangnam Style’ singer Psy delivered a rousing finale. The ceremony, dubbed: ‘Dream of 4.5 billion people, One Asia,’ also featured traditional Korean performances of song, dance and poetry as athletes stood shoulder to shoulder behind the flags of 45 countries at the Incheon Asian Main Stadium. Sheikh Ahmad Al-Fahad Al-Sabah, the president of the Olympic Council of Asia (OCA), told the athletes: “We are delighted to welcome you and are looking forward to seeing you compete and perform based on fair play and respect. “You are the heart and soul of the Games.” From weightlifting to wushu, rowing to rugby sevens and swimming to sepaktakraw, the Games will showcase elite Asian talent in 36 sports, with the first of 439 gold medals to be awarded in the women’s 10 metre air pistol team event on Saturday. Much of the attention will be focused on the pool where Olympic champions Sun Yang of China and South Korea’s homegrown hero Park Tae-hwan will meet in a series of freestyle duels. China has topped the medals table at the last eight Asian Games and is expected to do so again, while the hosts’ target is finishing second, above fierce rivals Japan, for the fifth straight Asiad. China’s vast delegation includes badminton great Lin Dan and London Olympic gold medallist Yi Shiwen while Japan expect great things from a swim team that took seven golds at the recent Pan Pacific Championships. Olympic champions Yang Hak-seon and Lee Yong-dae will spearhead South Korea’s campaign for 90 golds on home soil in a Games that will also put Korea’s financial muscle and logistical capabilities to the test once again. After hosting the Asian Games in 1986 and 2002, and the Olympics in 1988, South Korea will stage the winter Olympics for the first time in Pyeongchang in four years’ time. A successful Incheon Games would go a long way to allaying any concerns that South Korea will struggle to be ready. A gold-medal laden performance would also be well received in South Korea, where the mood has been one of grief and despair following the Sewol ferry disaster in April. Of the 476 passengers and crew on board, 339 were children and teachers from the same school. Only 172 people were rescued and the remainder are all presumed to have drowned. While relations remain strained between Tokyo and Pyongyang, North Korean and Japanese athletes showed no signs of tension as they filed into the stadium one after another, the Korean alphabet putting the delegations beside each other. The North Korean flag was also flying at the stadium, a week after complaints from ultra-conservative South Korean groups forced organisers to take them down from the streets in the host city and other venues. Tensions between North and South Korea are high and the two states are still technically at war after the 1950-53 Korean War ended in a truce, not a peace treaty. The Saudi athletic contingent marched into the stadium waving and smiling like all the other delegations but with one major difference - Saudi Arabia is the only country not to send female athletes to the Games, which are running under the slogan: “Diversity Shines Here”. Their decision has drawn criticism from Human Rights Watch but Saudi officials have defended their stance, saying their female athletes were not ‘competitive’ enough for the Asian Games, a multi-sports event held every four years. The lead-up to Friday’s opening ceremony was also tarnished when a member of the Iranian delegation was thrown out of the Games after being charged with sexual harassment of a female volunteer at a soccer stadium. A Palestine soccer player was also charged with the same offence and Sheikh Ahmad told Reuters that he was sorry the incidents had marred the start of the Games. Sheikh Ahmad also told Reuters that Indonesia was poised to be named the host of the next Asian Games following Vietnam’s decision to pull out due to financial woes. The OCA will make a formal announcement on the next host on Saturday at its general assembly. Wherever the Games land, the hosts will struggle to match Incheon’s vibrant curtainrasier, which blended popular Korean culture with some of the country’s leading sports personalities. Actors Hyun Bin, Jang Dong-gun and Kim Soo-hyun, soprano Jo Su-mi, and Korean pop groups EXO and JYJ featured in a ceremony that took spectators through snapshots of Asian history, its rich culture, traditions and development. Korean sporting heroes also had their place in the spotlight, with golf major winners Pak Se-ri and Park In-bee appearing with Olympic weightlifting champion Jang Mi-ran and speedskater Lee Kyou-hyuk, who appeared at six winter Games. Editing by Sudipto Ganguly Our Standards: The Thomson Reuters Trust Principles. All quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays. ",
    "datetime": null,
    "url": "https://www.reuters.com/article/uk-games-asian-idUKKBN0HE1IC20140919"
}