{
    "title": "Don't Hold Your Breath for Korean Reunification: 5 Problems | Time",
    "text": "Despite several years of escalating missile and nuclear tests, the outlook for peace on the Korean peninsular is rosier now than anytime since North Korean Supreme Leader Kim Jong Un took power in 2011. The 34-year-old despot has agreed to meet South Korean President Moon Jae-in on Friday and U.S. President Donald Trump in coming weeks to discuss denuclearization. Kim has pledged an end to weapons tests and agreed to dismantle the Punggye-ri nuclear testing site (though geologists report it may already have collapsed). He has indicated, according to South Korean interlocutors, that any agreement to denuclearize would not be contingent on U.S. troops leaving South Korea. In response, South Korea has halted the propaganda that blares over the demilitarized zone, or DMZ, which has separated the two states since the 1950-53 Korean War. Moon has also indicated he may submit a formal declaration of peace with North Korea — the neighbors remain technically at war as only an armistice was ever signed — at the U.N. General Assembly. Seoul has offered economic and political concessions if Pyongyang permits nuclear inspectors into its military facilities. But while the leaders of the two Koreas appear set for a love-in — even a mango dessert served during a banquet will feature a map of the united peninsular — talk of reunification is audaciously premature. Here are five major hurdles that would have to be overcome. Given that Kim’s priority is safeguarding his dynastic regime, it’s unlikely North Korea will agree to national reunification on terms that herald its own demise. And as freewheeling, democratic South Korea won’t relish wallowing under Stalinist totalitarianism, mending the political divide remains a huge sticking point. One option maybe some form of “one country, two systems” arrangement, similar to how China and Hong Kong have two unique political systems under the umbrella of the same nation. However, Kim knows that relaxing internal controls — such as exchanges of people, information, and capital — enfeebles his own position as his 25 million impoverished subjects will no doubt begin agitating for economic parity with their sophisticated 50 million brethren across the DMZ. (The fall of the Berlin Wall is an example of just how this can manifest.) Even backburnering the considerable political pitfalls, economic issues are no easy fix. Largely agrarian North Korea has a GDP less than 1% of the South, which is the world’s 11th biggest economy, boasting some of the top tech and engineering firms. As such, merging the two economies would wreak hardships many times worse than when East and West German united in 1990. (Even today, Eastern provinces lag behind in most developmental metrics.) Which is why the South Korean reunification plan is step-by-step over several decades, whereby economic incentives gradually bring Northern living standards to a practical level by which full assimilation is possible. Still, for South Koreans battling sluggish growth, record youth unemployment and an aging population this is still far from an attractive proposition. But while absorbing millions of uneducated North Koreans is a problem for the South, the perils go both ways. North Korean expert Andrei Lankov, who studied in Pyongyang in 1995 as a Russian exchange student, says resource speculations by rapacious South Korean businessmen is likely to be rife, and safeguards must be put in place to ensure guileless North Koreans are not duped out of their birthrights. South Korea is one of the fastest-paced, kitschiest and most competitive environments in the world. It’s spawned K-Pop and popularized Cosplay, boasts rage rooms for object-smashing stress relief, 24-hour video game parlors, and exotic animal cafes for snuggling with meerkats. But K-Wave culture hides a litany of social ills. South Koreans work the second longest hours of all developed nations, with even school kids studying for 16 hours a day in a bid to gain access to one of three top universities. It has the highest rates of cosmetic surgery and teen suicide in the world. The contrast between this dog-eat-dog, helter-skelter environment and collectivized North Korea could not be starker. While all South Korean men spend two years of military service, the norm for North Koreans is ten, with schooling under the regime little more than mind-numbing indoctrination. Little wonder North Korean defectors frequently struggle to assimilate, suffering depression, failing to find work, and sometimes even return back to the North. A colossal affirmative action program would be needed to give North Koreans the skills and opportunities required to compete with their Southern peers. But this risks stoking resentment and social unrest. There’s also a good chance that some North Koreans, especially military personnel with easy access to small arms, may resort to petty larceny to get ahead. North Korea is believed to have a standing army of 1.1 million troops along with 7.7 million reserves. According to a South Korean Ministry of National Defense report, Pyongyang boasts more than 1,300 aircraft, some 300 helicopters, 250 amphibious vessels, 430 combatant vessels, 4,300 tanks, 2,500 armored vehicles, 70 submarines, and 5,500 multiple-rocket launchers. And lest we forget the up to 60 nuclear bombs, a bevy of short and intercontinental-range missiles, and stockpiles of 2,500 – 5,000 tons of chemical weapons the regime wields. Preventing these assets being sold off or otherwise proliferated would be a priority for a unified Korean state. Unfortunately, the world knows very little about the location of the regime’s arsenals or the chains of command that control them. But perhaps most worrying of all is the cabal of nuclear and missile scientists that would presumably find themselves out of work and with skills to sell — perhaps even to criminal or terrorist groups. As TIME correspondent Simon Shuster recently reported, North Korea’s own missile program was built on the back of jettisoned Soviet scientists recruited by the regime. East Asia’s security architecture is delicately balanced, with South Korea and Japan the key U.S. allies, and North Korea backed by China and Russia (even if that support is fitful and waning). The North Korean threat is a large reason why the U.S. maintains some 40,000 troops in Japan and 28,500 in South Korea. Much of Chinese support for North Korea stems from its aversion to a united, U.S.-allied Korean peninsular possibly putting American troops on its border. Reunification — or even a formal peace treaty between North and South — would undermine Washington’s argument for its continued military presence. “There would be voices raised with the question: why are the U.S. troops still here if we have a peace regime in North Korea?” says Christopher Green, a senior researcher on the Korean Peninsular for the International Crisis Group. “So it would certainly be politically very destabilizing for South Korea.” Already, an increasingly assertive China under President Xi Jinping has taken aim at South Korea hosting the U.S. THAAD anti-missile battery. One might expect these complaints to amplify were the North Korean threat neutralized, boosting China’s regional clout at the expense of the U.S. Write to Charlie Campbell at charlie.campbell@time.com. ",
    "datetime": "2018-04-26T05:36:25.000Z",
    "url": "https://time.com/5255381/north-south-korea-kim-jong-un-reunification/"
}