{
    "title": "Don’t belong to Korean wave? These Korean Dramas will Surely Engulf you",
    "text": "The ‘Korean Wave’ has taken over the world and if you are still not affected by it, you are seriously missing out. Korean Wave is increasing the popularity of South Korean culture. Initially driven by the spread of K-pop and K-drama throughout Southeast Asia, the Korean wave has evolved from a regional to global phenomenon due to the internet and social media. K-dramas are known for their unique plot, strong characters, and sometimes relatable situations. So if you are not already addicted, these Korean dramas will definitely do the job. Living forever can get old after a while. Kim Shin, a goblin having an immortal life watches over people’s souls, becomes roommate with Wang Yeo, a Grim Reaper who suffers from amnesia but still does his job to usher people’s souls to afterlife. Yoo Deok Hwa, Shin’s nephew is a rebellious cahebol heir whose family has been the caretakers of the Goblin for centuries. Tired of immortality, Shin searches for ‘a true goblin’s bride’ who can guide him to mortality, meets Ji Eun Tak, a high school student whose mother was saved by Kim Shin 19 years back. Sunny (Kim Sun) the owner of a chicken restaurant where Ji Eun Tak works, falls for the Grim Reaper. Sky Castle is a private luxury condo community, where wealthy doctors and professors reside. Built by the first president of Joo Nam University, it is the most prestigious university in all of Korea. Most of the residents are doctors and professors of the university. The drama describes all the ins and outs of how the wealthy make their children enter a top university. It is a comic satirical drama that closely looks at what goes behind the materialistic desires of the upper-class parents in Korea and how they ruthlessly secure the successes of their families at the cost of destroying others’ lives. An alien named Do Min Joon, lands on Earth about 400 years ago during the Joseon Dynasty period. He holds a perfect look and powerful physical attributes that include his vision, hearing and speed. As time passes Min-joon is compelled to pick up a new identity every ten years, as his human look never ages. Later, when he discovers that he has only three months left in hand before he returns back from Earth, he meets Cheon Song Yi, the biggest K-drama star in Korea who becomes his neighbor. She remind him of a girl he fell in love with 300 years ago and thus tries to keep distance from her but obviously fails. Seo Jung Hoo is special type of night courier, known only as “Healer”. For the right price and with the help of a genius hacker, he can get his clients whatever they want, as long as it doesn’t involve murder. His latest job leads him to a second-rate tabloid writer, Chae Young Shin and the successful reporter, Kim Moon Ho who is a popular reporter at major broadcasting company. One day, he unfolds the truth of a decades-old event involving a group of five friends who operated an illegal pro-democracy broadcasting station during the Fifth Republic in South Korea. Jung hoo intentionally approaches people who are related to the case to help Chae Young Shin and Kim Moon Ho. While doing so, he worries over the truth and beliefs. The story of this drama revolves around two characters. A young, talented, and good looking man named Cha Eun Ho, works as the chief editor at a publishing company. He holds the character of a calm minded and professional individual. However, his life gets an unexpected turn when he gets involved in the life of Kang Dan Yi, his childhood friend, who was once a well-known copywriter. She is now an unemployed divorced single mother, struggling to secure a job. But even with her strong career history she constantly faces rejection. However, in a desperate attempt to get a job she lies about her background and begins to work as a contract worker in the same company as Cha Eun Ho. They both face personal as well as professional challenges as they slowly start to realize their true feelings for each other. Intrigued? Then go grab the seats and make sure to watch these amazing K-dramas. Save my name, email, and website in this browser for the next time I comment.  ",
    "datetime": "2019-06-01T17:23:34+00:00",
    "url": "https://youthincmag.com/top-korean-dramas"
}