{
    "title": "Double K owner named as grand marshal of Parade | News | norfolkdailynews.com",
    "text": "Northeast/North Central Nebraska’s most trusted, comprehensive, and timely news source  Kids line Norfolk Avenue waiting for candy to be given out during the Fourth of July parade in downtown Norfolk.   No matter where Marvin Konopasek goes, someone recognizes him. And on the Fourth of July later this week, Konopasek will get the chance to wave at all of those who know him as this year’s grand marshal of the annual Norfolk Odd Fellow Lodge parade. “I love the thought of it,” he said. “I was very surprised.” As a longtime Norfolk resident, Konopasek has been part of some well-known businesses in the city. Konopasek started in business in 1956 with a small eating shop in downtown Norfolk. He moved the eatery to Pasewalk Avenue in 1958 and then built the Double K restaurant in 1964, said his wife, Arla. “No matter where we go, someone will say they miss the onion rings or the cole slaw,” Mrs. Konopasek said. “I don’t think we go somewhere where we don’t have a response.” The large chicken affixed to the Double K’s roof was practically a landmark, she said. The chicken is now located in the Elkhorn Valley Museum and Research Center in Norfolk. “A lot of people will tell us when they would give directions, they’d say, ‘When you come over the viaduct, you’ll see the chicken on the roof,’ and they gave directions from there,” she said. Konopasek also purchased King’s Ballroom in 1972, which he operated until it burned in 1986. On top of that, he catered for a lot of events in Northeast Nebraska. “A lot of people know him through that,” Mrs. Konopasek said. “No matter where we go, someone says, ‘Hi, Marv.’ ” In 2004, Konopasek closed the Double K’s doors and has enjoyed retirement ever since. “Everybody said I was going to miss the restaurant and the ballroom. I don’t really miss anything, but I miss the people, talking to them,” he said. “I love my retirement.” Registration for the annual holiday parade will start at 8 a.m. on Thursday, July 4, with the parade starting at 10 a.m. The parade route will be different than previous years. Lining up of parade entries will begin at the VFW on Fourth Street and Braasch Avenue, and wind southward onto Second Street and Norfolk Avenue. The parade will now start at the corner of Second Street and Norfolk Avenue; proceed south on Second Street to Madison Avenue; west on Madison Avenue to Fifth Street; north on Fifth Street to Prospect Avenue; east on Prospect Avenue to Fourth Street and then south on Fourth Street. Other activities on the Fourth of July include a pie social and antique car show at The Meadows from 11:30 a.m. to 1:30 p.m. Dynamite Duo and the Sparklers also will be putting on two shows for the holiday. The free-admission concerts will be held Wednesday, July 3, at 7 p.m. and Thursday, July 4, at 2 p.m. at First Presbyterian Church, 104 S. 10th St. In a celebration of traditional American values, the concerts will feature patriotic, Broadway, sacred and golden oldies music performed by local musicians on pipe organ, grand piano, band and stringed instrumentation. Other highlights include a salute to military veterans, costumed characters, accordion music, dramatic readings, vocal and sing-along numbers and a magnificently decorated church sanctuary. The church is air-conditioned and handicapped accessible. Doors open one hour prior to performance times. The event is free, and all are welcome to attend. During the evening of the Fourth of July, the second concert in the Music in the Park series will be held. Performing will be High Heel from 6 to 9 p.m. at Skyview Lake. Beer and wine are permitted. The concert series is sponosored by the Norfolk Rotary Club. A two-vehicle crash north of Stanton on Monday resulted in an Iowa woman being taken to the hospital. A motorcycle accident at one of the city’s main intersections claimed the life of a Norfolk man on Friday night. With mail theft and postal carrier robberies up, law enforcement officials have made more than 600 arrests since May in a crackdown launched to address crime that includes carriers being accosted at gunpoint for their antiquated universal keys, the Postal Service announced Wednesday. A 66-year-old North Bend man has died in a motorcycle crash in Saunders County. A 65-year-old man from rural Norfolk sustained serious injuries in a crash Monday afternoon in Pierce County. HELENA, Mont. (AP) — The first major snowstorm of the season dropped up to a foot of snow in the Helena, Montana, area by Wednesday morning, canceling some school bus routes on the western side of the city. LINCOLN — Nebraska and 40 other states announced a barrage of federal and state lawsuits Tuesday against the parent company of Facebook and Instagram. The filings allege Meta designed social media platforms it knew were addictive and damaging to teens. Norfolk police arrested a man late Monday who allegedly was at a residence he is ordered to stay away from. The public is invited to attend a meeting of a regional governmental body based in Madison County at which tax dollars may be spent. WeatherThreat.com Closings With mail theft and postal carrier robberies up, law enforcement officials have made more th… HELENA, Mont. (AP) — The first major snowstorm of the season dropped up to a foot of snow in… RAFAH, Gaza Strip (AP) — Israel escalated airstrikes across the Gaza Strip on Tuesday, crush… KYIV, Ukraine (AP) — Russia fired almost a dozen Shahed drones against Ukrainian targets and… NEW YORK (AP) — A man was trapped inside a steel-reinforced concrete jewelry vault in New Yo… Sorry, there are no recent results for popular commented articles. Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers: ",
    "datetime": null,
    "url": "https://norfolkdailynews.com/news/double-k-owner-named-as-grand-marshal-of-parade/article_a386e6c8-e255-11e2-aa70-0019bb30f31a.html"
}