{
    "title": "Dressed Gain from the Parametrically Amplified Four-Wave Mixing Process in an Atomic Vapor | Scientific Reports",
    "text": "Thank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\n            the best experience, we recommend you use a more up to date browser (or turn off compatibility mode in\n            Internet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles\n            and JavaScript. Advertisement Scientific Reports\nvolume 5, Article number: 15058 (2015)\n            Cite this article 1934 Accesses 33 Citations Metrics details With a forward cone emitting from the strong pump laser in a thermal rubidium atomic vapor, we investigate the non-degenerate parametrically amplified four-wave mixing (PA-FWM) process with dressing effects in a three-level “double-Λ” configuration both theoretically and experimentally. By seeding a weak probe field into the Stokes or anti-Stokes channel of the FWM, the gain processes are generated in the bright twin beams which are called conjugate and probe beams, respectively. However, the strong dressing effect of the pump beam will dramatically affect the gain factors both in the probe and conjugate channels and can inevitably impose an influence on the quantum effects such as entangled degree and the quantum noise reduction between the two channels. We systematically investigate the intensity evolution of the dressed gain processes by manipulating the atomic density, the Rabi frequency and the frequency detuning. Such dressing effects are also visually evidenced by the observation of Autler-Townes splitting of the gain peaks. The investigation can contribute to the development of quantum information processing and quantum communications. The parametric four-wave mixing (FWM) process based on atomic coherence1,2,3 plays important roles in the squeezed and entangled states of optical fields4,5,6,7 as well as the high-order cascaded nonlinear optical process8,9. For the cascaded-nonlinearity process in an atomic system, the FWM process can serve as a low-noise linear phase-insensitive or phase-sensitive amplifier10,11 with easily adjustable parameters. Moreover, with the introduction of the squeezed state based on FWM process12,13, the progresses in the squeezing of light involve in various applications such as the generation of the multi-spatial-mode entangled beams14,15,16 and continuous-variable quantum images processing17,18,19. In recent years, the non-degenerate FWM process driven by a strong pump beam in a coherent “double-Λ” atomic system without the disturbance of a cavity is demonstrated to generate strong relative intensity squeezing between the bright twin beams named as probe and conjugate20,21. Also, the diamond-type four-level configuration22,23,24,25 with a stable ground state, two intermediate levels and an upper state in an atomic system is also developed to study non-degenerated FWM process at the wavelength for telecommunication26,27. Compared with the diamond-type configuration (5S1/2, 5P1/2, 5P3/2 and 6S1/2) in a rubidium vapor, the “double-Λ” system can be more efficient due to the low requirement on phase matching condition (PMC). For the FWM process characterized as large nonlinearity at near resonance and reduced the excess noise15 in the “double-Λ” system, the probe and conjugate beams can be both amplified and then induce the generation of a pair of strongly correlated Stokes and anti-Stokes fields28 with high efficiency, which can produce squeezed states with narrow bandwidth and low frequency20,29. Actually, the parametrically amplified factor in the FWM process can directly determine the squeezing level of the two bright beams15,17. In this article, we demonstrate the parametrically amplified FWM (PA-FWM) process with dressing effects in an off-resonant “double-Λ” arrangement by establishing a forward cone30 in a thermal rubidium atomic vapor both theoretically and experimentally. On one hand, with the weak probe beam seeded into the Stokes or anti-Stokes channel in the FWM process generated from the strong pump beam, the gain processes can be obtained in both the conjugate and probe channels. On the other hand, with the pump filed considered as a coupling or dressing field, the classical electromagnetically induced absorption (EIA)31 is also observed in the probe channel. As a result, the EIA effect can interact and compete with the gain process in the probe field, which can inevitably render the change of squeezing state as well as the amplification factor. Such interaction and competition are investigated by the signal intensity evolution dependences of the dressed gain on the atomic density, the Rabi frequency and the frequency detuning of the pump laser. As a consequence, we can control quantum effects as well as the amplification factor in the FWM process by easily manipulating the corresponding parameters. The fundamental study on the dressed gain of the bright twin beams can be effectively conducive to the development of quantum information processing such as entangled images and the generation of correlated photons source as well as squeezing states. A three-level “double-Λ” type 85Rb atomic system, consisting of two hyperfine states F = 3 (|0〉) and F = 2 (|3〉) of the ground state 5S1/2 and an excited state 5P3/2 (|1〉), is used to generate the PA-FWM process. Two laser beams derived from a Ti:sapphire laser and an external cavity diode laser (ECDL) are coupled into the corresponding transitions as shown in Fig. 1(a). The spatial beams alignment is shown in Fig. 1(b). With the laser frequency tuned to the D2 line transition of rubidium atoms, the strong pump beam E1 (frequency ω1, wave vector k1, Rabi frequency G1, vertical polarization) up to 500 mW is coupled into the cell by a polarizing beam splitter (PBS). The weak probe beam E2 (ω2, k2, G2, horizontal polarization) with approximately 100 μW propagates in the same direction of E1 with an angle of 0.26° and is detected by a branch of a balanced homodyne photodiode detector. The generated conjugate signal that can establish the coherence between the two ground states |0〉 and |1〉 co-propagates withE2 symmetrically with respect to E1 and is received by the other branch of the balanced detector. (a) Energy-level diagram for the double-Λ configuration in 85Rb atoms. (b1) Spatial beams alignment for the PA-FWM process. (b2) Phase-matching geometrical diagram of the PA-FWM process. (b3) Measured Stokes field ESt and (b4) anti-Stokes field EASt versus the pump frequency in the FWM process. (c1,c2) Measured probe transmission signal and corresponding conjugate signal versus the probe frequency detuning Δ2, respectively. With the frequency detuning of E1 tuned far away from the resonance, the FWM process will occur in the “double-Λ” configuration, which can generate the Stokes field ESt and anti-Stokes field EASt (satisfying the PMCs kSt = 2k1 − kASt and kASt = 2k1 − kSt, respectively) on the forward cone shown in Fig. 1(b2). Here the detuning Δi = Ωi − ωi is defined as the difference between the resonant transition frequency Ωi and the laser frequency ωi of Ei. The detected ESt and EASt signals (via perturbation chains  and  by means of the Liouville pathway32) are shown in Fig. 1(b3,b4), respectively. Here the corresponding third-order density matrix elements and can be described as where Gi = μijEij/ħ (i, j = 1, 2, conj, St, ASt) is the Rabi frequency between levels |i〉 ↔ |j〉 and μij is the dipole momentum; d20 = γ20 + iΔ1, d21 = γ21 + iΔ1, d10 = γ10 + i(Δ1 − ΔSt), , , ; Γij is the nature decay rate between levels |i〉 and |j〉 and γij = (Γi + Γj)/2 is the decoherence rate between levels |i〉 and |j〉. The presence of the weak probe beam E2 can be viewed as being injected into the Stokes or anti-Stokes port of the FWM process and the injection will serve as an optical parametric amplification (OPA) process (with PMC kASt = 2k1 − k2 or kSt = 2k1 − k2) assisted by the cascaded nonlinear process. With the perturbation chains rewritten as  and , Eqs (1 and 2) should be modified as As a result, the input probe beam with a intensity of P2 is amplified to produce an output probe with a intensity of gP2 and an output conjugate with a intensity of (g–1)P2. See Methods for the theoretical derivations of the gain factor g. Taking the dressing effects of E1 and E2 into consideration, the expression for the Stokes and conjugate anti-Stokes fields should be written as Also, with E2 and E1 viewed as probe and coupling fields, respectively, the first-order density matrix  for the probe transmission signal with dressing effect is Consequently, the intensity Ip of the probe signal with gain and dressing effect can be expressed by  and  for transitions F = 3 → F′ and F = 2 → F′, respectively, where I0 is the intensity of the probe field without Doppler absorption. By experimentally scanning the probe detuning over 16 GHz across the D2 line, we obtain the featured transmission signal and corresponding conjugate signal as shown in Fig. 1(c1,c2), respectively. The observed character in the probe channel can be attributed to Raman absorption, EIA effect, parametrical amplification process and the combined dressing effects. The absorptive dip at Δ2 = −3.5 GHz has a linewidth of 278.5 MHz and is caused by Raman absorption on 87Rb, F = 2 → F′. The dip at Δ2 = 4.5 GHz indicates the detuning of the pump field. The most prominent points are the Stokes and anti-Stokes gain peaks at the 85Rb ground-state hyperfine states (Δ2 = 1.2 GHz and 7.2 GHz, respectively). According to the experimental condition, there exists 6 GHz frequency gap between the Stokes and anti-Stokes signals in the probe channel. The seeding process can also generate the anti-Stokes and Stokes peaks in the conjugate channel corresponding to the Stokes and anti-Stokes in the probe channel, respectively. The Stokes (F = 3 → F′) in the probe channel and the corresponding anti-Stokes in the conjugate channel are strongly correlated, so do the anti-Stoke (F = 2 → F′) of the probe and Stokes of the conjugate. Figure 2(a,b) show the Stokes (85Rb, F = 3 → F′ transition) and anti-Stokes (85Rb, F = 2 → F′ transition) signal evolutions in the probe channel by varying the atomic intensity, respectively. The single Stokes signal profile in Fig. 2(a) obviously consists of an EIA dip with a full width at half maximum (FWHM) of 101.7 MHz and a gain peak with a FWHM of 32.4 MHz. Here, the sharp gain peak is caused by seeding E1 into the Stokes port of the FWM process and the gain intensity is related to the generated photon number described by Eq. (11) in Methods part. The EIA dip reveals the dressing effects when E1 and E2 beams are viewed as coupling and probe fields, respectively. The single anti-Stokes peak with a FWHM of 50.8 MHz in Fig. 2(b) also results from the injection of E2 beam, which can be attributed to the amplification process in Eq. (10) related to F = 2 → F′ transition. Intensity evolutions of the Stokes (a) and anti-stokes (b) gain peaks in the probe channel versus Δ2 by increasing the 85Rb atomic density. The atomic density is about 3 × 1013 cm−3 at 120 °C. The dotted lines are guides for eyes. The measured intensity of the Stokes gain by increasing the atomic density in Fig. 2(a) is first getting larger and then smaller, which demonstrates the competition between the atomic dynamics process and the propagation of the FWM process. At the lower atomic density (105 °C–115 °C), the gain directly proportional to the atomic density is dominated by the increase of the thermal motion of the atoms, while the absorption of FWM is small. With the density continuing to grow (115 °C–125 °C), the atomic dynamics process and the absorption can achieve a balance and the signal intensity remains almost unchanged. When the temperature is over 125 °C, the decrease of the gain can be attributed to the fact that the absorption of the FWM during its propagation is increasing while the atomic motion gets saturated at high atomic density, namely, the absorption can be dominant. The varying tendency of the anti-Stokes peak in Fig. 2(b) is similar to that of the Stokes peak described previously. The EIA depth in Fig. 2(a) described with term  can experience growing, unchanged and getting smaller by increasing the atomic density. The first growth and saturation can be attributed to the dominated dressing effects caused by G2 and G1 and the subsequent weakening is similarly due to the strengthening of the Doppler effect. Figure 3(a1,a2) are the dressed Stokes and Anti-Stokes signals, respectively, from the probe output by growing the power of pump field with the conjugate detection branch blocked. For the Stokes signal, the peak represents the gain intensity and the dip is the classical EIA intensity. According to Eq. (3), the gain peak should increase with the square of pump Rabi frequency G1. At small E1 power (P1), the gain can increase with G1, which is observed in Fig. 3(a1) with P1 changing from 30 mW to 90 mW. However, due to the strong dressing effects caused by denominator terms  and  in Eq. (5), the peak can then be suppressed when P1 is getting larger. Also, the EIA dip can be deepened due to the increase of G1 as described by Eq. (7). For the anti-Stokes in Fig. 3(a2), the dressing effects are weak with Δ1 being far away from the resonance. Consequently, the anti-Stokes gain described by Eq. (4) can increase with G1 and the gain can also be much stronger than that in Fig. 3(a1). Measured probe and corresponding conjugate signals versus Δ2 at different pump power. (a1,a2) Intensity evolutions of the Stokes and anti-Stokes gain peaks at probe channel versus Δ2 by increasing the power of E1, respectively. (b1,b2) Phase conjugate signals corresponding to (a1,a2), respectively. (c1,c2) Intensity difference between the probe and conjugate signals related to F = 3 → F′ and F = 2 → F′, respectively, by use of the homodyne detector. The dotted lines are guides for eyes. (d1,d4) Simulated lineshapes correspond to the signals in (a1,a2,b1,b2), respectively. The theoretical simulations in (e1,e2) agree well with the experimental observations. The squares, triangles and dots represent the original experimental observations of corresponding signals and the solid curves are the theoretical predictions. The anti-Stokes and Stokes signals that are conjugate to the two gain peaks in the probe channel are shown in Fig. 3(b1,b2), respectively. Physically, the two pairs of generated Stokes and anti-Stokes signals by scanning the probe detuning are correlated in frequency and space, so the measured anti-Stokes and Stokes signals in the conjugate channel should behave similarly to the corresponding signals in the probe channel. However, due to the absence of directly dressing effect, both the intensities of Stokes and anti-Stokes in the conjugate channel can grow with G1, which are depicted in Fig. 3(b1,b2) and can be explained by Eqs (3 and 4), respectively. With the twin branches of the detector turned on, Fig. 3(c1,c2) are the measured intensity difference evolutions on F = 3 → F′ and F = 2 → F′ transitions with different G1, respectively. Figure 3(d1,d2,d3 and d4) are the simulated lineshapes for the Stokes and anti-Stokes in the probe channel and anti-Stokes and Stokes in the conjugate channel. The theoretical curves in Fig. 3(e1,e2) agree well with the experimental results. Figure 4(a1,a2) are the Stokes and anti-Stokes measured from the probe channel at different Δ1, respectively. Since the horizontal positions of the two gain peaks on the probe signal can move with the pump detuning changing, the probe detuning values Δ2 in Fig. 4 can directly depict the change of Δ1, which can also be consistent with the coordinate probe detuning shown in Fig. 1(c1). The peaks in Fig. 4(a,b) should be the highest near Δ2 = 0 and Δ2 = 6 GHz, respectively, due to the improved nonlinearity caused by the strong coherence in the FWM process at resonance. Similarly, the EIA and dressing effects can also be strengthened, which in turn can impose stronger suppression on the gain peaks. As a result of the interaction, the gain peak can have the almost unchanged intensity with Δ1 varying from Δ2 = −200 MHz to 200 MHz. The optimum choice of pump detuning Δ1 should be a balance between the increasing of gain and reduction of the dressing effect as well as the probe loss with Δ1 tuned close to the atomic line. By blocking the probe detection branch, the corresponding anti-Stokes and Stokes are received from the non-injected channel and demonstrated in Fig. 4(b1,b2), respectively. According to Eqs (5 and 6), the third-order polarization or  at Δ1>0 decreases with the increase of Δ1 with G1 ≫ G2 and G1 ≫ Gc considered, which can also interpret the height evolutions of the observed gain peaks well. The intensity difference changes between the probe and conjugate signals at different Δ1 are shown in Fig. 4(c1,c2). Figure 4(d) provides the images of the probe and conjugate beam for F = 2 → F′ transition at different Δ1. The right image and left image in each picture are the probe signal and conjugate signal and visually demonstrate the signal intensity evolutions corresponding to Fig. 4(a2,b2), respectively. The strong signal image in the middle of each picture with almost unchanged intensity are the residual transmission of the pump beam (vertical polarization) after the polarizing beam splitter (PBS). Figure 4(e1,e2) are corresponding theoretical predictions and coincidence with the experimental observations. Measured probe and corresponding conjugate signals versus Δ2 at different Δ1. (a1,a2) Stokes and corresponding anti-Stokes gain peaks in the seeding channel, respectively. (b1,b2) Conjugate FWM signals corresponding to (a1,a2), respectively. (c1,c2) Measured intensity difference between the probe and corresponding FWM signals related to F = 3 → F′ and F = 2 → F′, respectively. The dotted lines are guides for eyes. (d) Measured images of the probe and conjugate signals corresponding to (a2,b2), respectively. (e1,e2) Intensity dependences on pump detuning corresponding to F = 3 → F′ and F = 2 → F′ transitions, respectively. The squares, triangles and dots are the original experimental observations of corresponding signals and the solid curves are the theoretical predictions. So far, we have presented the PA-FWM process with dressing effects assisted by the cascaded-nonlinearity process in a “double-Λ” 85Rb atomic system both theoretically and experimentally. With the parametrically FWM process established, we can obtain bright twin beams with gain by seeding a weak probe beam into the Stokes or anti-Stokes channel of the FWM process. Also, the dressing effects of the strong pump, the weak probe and the generated conjugate fields can impose influences on the probe gain and the conjugate gain. As an extension to our discussion, we present another powerful evidence for the dressing effects on the gain processes. To be specific, the observed Autler-Townes (AT) splitting27 on the gain peaks shown in Fig. 5 can be attributed to the interaction between the gain processes and the combined dressing effects. AT splitting of the Stokes (a) and anti-stokes (b) gain peaks in the probe channel versus Δ2 by varying the pump detuning Δ1. (a1,b1) Theoretical predictions corresponding to (a,b), respectively. The dotted lines are guides for eyes. Figure 5(a,b) are the observed AT splitting of the gain processes on 85Rb, F = 3 → F′ and 85Rb, F = 2 → F′, respectively, by varying the detuning of pump field. Similarly to Fig. 4, the probe detuning Δ2 in Fig. 5 can also reflect the pump detuning Δ1. When the single-peak gain in Fig. 5 is split into two peaks, the AT splitting caused by the combined dressing effects is obtained. The AT splitting effect in Fig. 5(a) firstly appears at Δ2 = 0.05 GHz and then the intensities of left and right peaks can change with Δ1, which means that the strong pump laser starts to dress the energy levels |1〉 and |2〉 to create corresponding primary dressing states33 |1+〉 & |1−〉 and |2+〉 & |2−〉, respectively. The two dressing state effects can be described by perturbation chains  and , respectively. Such dressing effect with the participation of the two third-order nonlinear processes can dress the involved energy levels, which can then affect the third-order Stokes and anti-Stokes signals themselves. The measured left and right peaks in the Stokes gain in Fig. 5(a) correspond to the dress states |2+〉 and |2−〉, respectively. With Δ1 tuned close to the dress state |2+〉, the left peak is much higher than the right one. Similarly, the right peak can be enhanced with Δ1 tuned close to |2−〉. Considering the parallel generation process for the anti-Stokes, the dressing states |1+〉 and |1−〉 can also explain the evolution from single peak to double peaks in Fig. 5(b) well. The theoretical simulation results in Fig. 5(a1,b1) agree well with the observed results in Fig. 5(a,b), respectively. With the interaction between the dressing state effects and gain processes systematically investigated by the intensity dependences of the dressed gain on the atomic density, the Rabi frequency and the frequency detuning, we can control the amplification factor in the FWM process by easily manipulating the corresponding parameters. Furthermore, the current study on controlling the dressed gain of the bright twin beams can have contribution to the development of entangled images and the generation of correlated photons source as well as squeezing states. We use two light beams from a continuous-wave Ti:sapphire laser and an ECDL to couple the three-level “double-Λ” rubidium atomic system. The strong pump laser beam E1 and the weak probe beam E2 have diameters of 0.7 mm and 0.4 mm respectively. The pump beam with vertical polarization is first coupled into the cell by use of a polarizing beam splitter (PBS) and then separated from the detection path via another PBS cube after the cell. The probe beam propagates in the same direction of E1 with an angle of 0.26° and intersects with the pump beam at the center inside the cell with natural abundance. The 10 mm long rubidium cell with Brewster’s angle is wrapped by μ-metal and heated by the heater tape. The weak probe and the generated conjugate beam are received by a balanced phtotodetector with 105 V/A transimpedance gain and ≈82% quantum efficiency. For the case of the FWM process without seeding, the generated twin-photon numbers of the Stokes and anti-Stokes channels that are proportional to the signal intensity can be shown as where  is the boson-creation operator of ESt (EASt) and  is the gain with the modulus A and B (phase angles φ1 and φ2) defined in  and  for ESt and EASt, respectively. Here the amplification factors are the same for the two output ports of the amplifier without seeding. When the weak probe field is injected into the Stokes port of the FWM process, it can amplify the seeded signal in an appropriate condition. The photon numbers of the output Stokes and anti-Stokes fields in the amplification process with injection are described as How to cite this article: Zhang, Z. et al. Dressed Gain from the Parametrically Amplified Four-Wave Mixing Process in an Atomic Vapor. Sci. Rep. 5, 15058; doi: 10.1038/srep15058 (2015). Lukin, M. D., Hemmer, P. R., Löffler, M. & Scully, M. O. Resonant enhancement of parametric processes via radiative interference and induced coherence. Phys. Rev. Lett. 81, 2675–2678 (1998). Article \n    CAS \n    ADS \n    \n                    Google Scholar Lukin, M. D., Matsko, A. B., Fleischhauer. M. & Scully, M. O. Quantum noise and correlations in resonantly enhanced wave mixing based on atomic coherence. Phys. Rev. Lett. 82, 1847–1850 (1999). Article \n    CAS \n    ADS \n    \n                    Google Scholar McCormick, C. F., Marino, A. M., Boyer, V. & Lett, P. D. Strong low-frequency quantum correlations from a four-wave-mixing amplifier. Phys. Rev. A. 78, 043816 (2008). Article \n    ADS \n    \n                    Google Scholar Boyer, V., Marino, A. M., Pooser, R. C. & Lett, P. D. Entangled images from four-wave mixing. Science. 321, 544–547 (2008). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Fang, Y. & Jing, J. Quantum squeezing and entanglement from a two-mode phase sensitive amplifier via four-wave mixing in rubidium vapor. New J. Phys. 17, 023027 (2015). Article \n    ADS \n    \n                    Google Scholar Yan, H. et al. Generation of narrow-band hyperentangled nondegenerate paired photons. Phys. Rev. Lett. 106, 033601 (2011). Article \n    ADS \n    PubMed \n    \n                    Google Scholar Shu, C., Guo, X., Chen, P., Loy, M. M. T. & Du, S. Narrowband biphotons with polarization-frequency-coupled entanglement. Phys. Rev. A. 91, 043820 (2015). Article \n    ADS \n    \n                    Google Scholar Zheng, H. et al. Parametric amplification and cascaded-nonlinearity processes in common atomic system. Sci. Rep. 3, 1885 (2013). Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Chen, H. et al. Parametrically amplified bright-state polariton of four- and six-wave mixing in an optical ring cavity. Sci. Rep. 4, 3619 (2014). Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Pooser, R. C., Marino, A. M., Boyer, V., Jones, K. M. & Lett, P. D. Low-noise amplification of a continuous variable quantum state. Phys. Rev. Lett. 103, 010501 (2009). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Corzo, N. V., Marino, A. M., Jones, K. M. & Lett, P. D. Noiseless optical amplifier operating on hundreds of spatial modes. Phys. Rev. Lett. 109, 043602 (2012). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Yuen, H. P. & Shapiro, J. H. Generation and detection of two-photon coherent states in degenerate four-wave mixing. Opt. Lett. 4, 334–336 (1979). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Slusher, R. E., Hollberg, L. W., Yurke, B., Mertz, J. C. & Valley, J. F. Observation of squeezed states generated by four-wave mixing in an optical cavity. Phys. Rev. Lett. 55, 2409–2412 (1985). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Boyer, V., Marino, A. M., Pooser, R. C. & Lett, P. D. Entangling light in its spatial degrees of freedom with four-wave mixing in an atomic vapor. Chem. Phys. Chem. 10, 755–760 (2009). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Corzo, N., Marino, A. M., Jones, K. M. & Lett, P. D. Multi-spatial-mode single-beam quadrature squeezed states of light from four-wave mixing in hot rubidium vapor. Opt. Express. 19, 21358–21369 (2011). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Qin, Z. et al. Compact diode-laser-pumped quantum light source based on four-wave mixing in hot rubidium vapor. Opt. Lett. 37, 3141–3143 (2012). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Boyer, V., Marino, A. M. & Lett, P. D. Generation of spatially broadband twin beams for quantum imaging. Phys. Rev. Lett. 100, 143601 (2008). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Vasilyev, M., Stelmakh, N. & Kumar, P. Phase-sensitive image amplification with elliptical Gaussian pump. Opt. Express. 17, 11415–11425 (2009). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Lopez, L., Treps, N., Chalopin, B., Fabre, C. & Maitre, A. Quantum processing of images by continuous wave optical parametric amplification. Phys. Rev. Lett. 100, 013604 (2008). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar McCormick, C. F., Boyer, V., Arimondo, E. & Lett., P. D. Strong relative intensity squeezing by four-wave mixing in rubidium vapor. Opt. Lett. 32, 178–180 (2007). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Jasperse, M., Turner, L. D. & Scholten, R. E. Relative intensity squeezing by four-wave mixing with loss: an analytic model and experimental diagnostic. Opt. Express. 19, 3765–3774 (2011). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Akulshin, A. M., McLean, R. J., Sidorov, A. I. & Hannaford, P. Coherent and collimated blue light generated by four-wave mixing in Rb vapour. Opt. Express. 17, 22861–22870 (2009). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Vernier, A., Franke-Arnold, S., Riis, E. & Arnold, A. S. Enhanced frequency up-conversion in Rb vapor. Opt. Express. 18, 17020–17026 (2010). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Meijer, T., White, J. D., Smeets, B., Jeppesen, M. & Scholten, R. E. Blue five-level frequency-upconversion system in rubidium. Opt. Lett. 31, 1002–1004 (2006). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Zibrov, A. S., Lukin, M. D., Hollberg, L. & Scully, M. O. Efficient frequency up-conversion in resonant coherent media. Phys. Rev. A. 65, 051801(R) (2002). Article \n    ADS \n    \n                    Google Scholar Becerra, F. E., Willis, R. T., Rolston, S. L. & Orozco, L. A. Nondegenerate four-wave mixing in rubidium vapor: The diamond configuration. Phys. Rev. A. 78, 013834 (2008). Article \n    ADS \n    \n                    Google Scholar Willis, R. T., Becerra, F. E., Orozco, L. A. & Rolston, S. L. Four-wave mixing in the diamond configuration in an atomic vapor. Phys. Rev. A. 79, 033814 (2009). Article \n    ADS \n    \n                    Google Scholar Wu, H. & Xiao, M. Bright correlated twin beams from an atomic ensemble in the optical cavity. Phys. Rev. A. 80, 063415 (2009). Article \n    ADS \n    \n                    Google Scholar Liu, C. et al. Realization of low frequency and controllable bandwidth squeezing based on a four-wave-mixing amplifier in rubidium vapor. Opt. Lett. 36, 2979–2981 (2011). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Zhang, Y. et al. Optical cavity squeezing of multi-wave mixing via dark states. J. Opt. Soc. Am. B. 31, 2792–2801 (2014). Article \n    CAS \n    ADS \n    \n                    Google Scholar Dimitrijević, J., Arsenović, D. & Jelenković, B. M. Intensity dependence narrowing of electromagnetically induced absorption in a Doppler-broadened medium. Phys. Rev. A. 76, 013836 (2007). Article \n    ADS \n    \n                    Google Scholar Zhang, Y. P., Khadka, U., Anderson, B. & Xiao, M. Temporal and spatial interference between four-wave mixing and six-wave mixing channels. Phys. Rev. Lett. 102, 013601 (2009). Article \n    ADS \n    PubMed \n    \n                    Google Scholar Zhang, Y. P. et al. Evidence of Autler-Townes splitting in high-order nonlinear processes. Opt. Lett. 35, 3420–3422 (2010). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Download references This work was supported by the 973 Program (2012CB921804), NSFC (11474228, 61308015, 61205112), KSTIT of Shaanxi Province (2014KCT-10). Key Laboratory for Physical Electronics and Devices of the Ministry of Education & Shaanxi Key Lab of Information Photonic Technique, Xi’an Jiaotong University, Xi’an, 710049, China Zhaoyang Zhang, Feng Wen, Junling Che, Dan Zhang, Changbiao Li & Yanpeng Zhang Department of Physics, University of Arkansas, Fayetteville, Arkansas, 72701, USA Min Xiao National Laboratory of Solid State Microstructures and Department of Physics, Nanjing University, Nanjing, 210093, China Min Xiao You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar Z.Y.Z. wrote the main manuscript and contributed to experimental work. Y.P.Z. and M.X. provided the idea. F.W., J.L.C., D.Z. and C.B.L. contributed to the presentation and execution of the theoretical work. All authors discussed the results and contributed to the writing of the manuscript. The authors declare no competing financial interests. This work is licensed under a Creative Commons Attribution 4.0 International License. The images or other third party material in this article are included in the article’s Creative Commons license, unless indicated otherwise in the credit line; if the material is not included under the Creative Commons license, users will need to obtain permission from the license holder to reproduce the material. To view a copy of this license, visit http://creativecommons.org/licenses/by/4.0/ Reprints and Permissions Zhang, Z., Wen, F., Che, J. et al. Dressed Gain from the Parametrically Amplified Four-Wave Mixing Process in an Atomic Vapor.\n                    Sci Rep 5, 15058 (2015). https://doi.org/10.1038/srep15058 Download citation Received: 17 June 2015 Accepted: 16 September 2015 Published: 14 October 2015 DOI: https://doi.org/10.1038/srep15058 Anyone you share the following link with will be able to read this content: Sorry, a shareable link is not currently available for this article.  Provided by the Springer Nature SharedIt content-sharing initiative Applied Physics B (2023) International Journal of Theoretical Physics (2020) Scientific Reports (2019) Scientific Reports (2017) Scientific Reports (2017) By submitting a comment you agree to abide by our Terms and Community Guidelines. If you find something abusive or that does not comply with our terms or guidelines please flag it as inappropriate. Advertisement Scientific Reports (Sci Rep)\n                \n\nISSN 2045-2322 (online) © 2023 Springer Nature Limited Sign up for the Nature Briefing newsletter — what matters in science, free to your inbox daily. ",
    "datetime": null,
    "url": "https://www.nature.com/articles/srep15058"
}