{
    "title": "Economic Theory And Long-Wave Cycles | Seeking Alpha",
    "text": "MicroStockHub/iStock via Getty Images  MicroStockHub/iStock via Getty Images Investors and others are confused by the early stages of accelerating price inflation. One misleading belief is in cycles of industrial production, such as Kondratieff’s waves. The Kondratieff cycle began to emerge in financial commentaries during the inflationary 1970s, along with other wacky theories. We should reject them as an explanation for rising prices today. This article explains why the only cycle that matters is of bank credit, from which all other cyclical observations should be made. But that is not enough, because on their own cycles of bank credit do not destroy currencies — that is the consequence of central bank policies and the expansion of base money. The relationship between base money and changes in a currency’s purchasing power is not mechanical. It merely sets the scene. What matters is widespread public perceptions of how much spending liquidity is personally needed. It is by altering the ratio of currency-to-hand to anticipated needs that purchasing power is radically altered, and in the earliest stages of the hyperinflation of prices, it leads to imbalances between supply and demand, resulting in the panic buying for essentials becoming evident today. Panics over energy and other necessities are only the start of it. Unless it is checked by halting the expansion of currency and credit, current dislocations will slide rapidly into a wider flight from currency into real goods — a crack-up boom. For eighteen months, the world has seen a boom in commodity prices, which has inevitably led to speculation about a new Kondratieff or K-wave. Google it, and we see it described as a long cycle of economic activity in capitalist economies lasting 40—60 years. It marks periods of evolution and correction driven by technological innovation[I]. Today’s adherents to the theory describe it in terms of the seasons. Spring is recovery, leading into a boom. Summer is an increase in wealth and affluence and a deceleration of growth. Autumn is stagnating economic conditions. And winter is a debilitating depression. But these descriptions did not feature in Kondratieff’s work. Van Duijan[ii] construed it differently around life cycles: introduction, growth, maturity, and decline. We must discard the word growth, substituting for progress. Growth, as measured by GDP, is no more than an increase in the amount of currency and bank credit in circulation and therefore meaningless. Most people who refer to growth believe they are describing progress or a general improvement in quality of life. Instead, they are sanctioning inflationism. There is little doubt that economic progress is uneven, but that is down to innovation. Kondratieff’s followers argue that innovation is a cyclical phenomenon, otherwise as a cyclical theory, it cannot hold water. An economic historian would argue that the root of innovation is the application of technological discoveries which by their nature must be random as opposed to cyclical events. Furthermore, a decision must be made about how to measure the K-wave. Is it of fluctuations in the price level and of what or of output volumes? Bear in mind that GDP and GNP were not invented until the 1930s, and all prior GDP figures are guesswork. Is it driven by Walt Rostow’s contention that the K-wave is pushed by variations in the relative scarcity of food and raw materials?[iii] Or is it a monetary phenomenon, which appeared to cease after the Second World War when currency expansion was not hampered by a gold standard? It was an argument consistent with that put forward by Edward Bernstein, who was a key adviser to the US delegation at Bretton Woods, when he concluded that the war need not be followed by the deep post-war depression which based on historical precedent was widely expected at the time. Kondratieff’s wave theories were buried by the lack of a post-war slump until price inflation began to increase in the 1970s and Kondratieff became fashionable again. Kondratieff maintained that his wave theory is a global capitalist phenomenon, applicable to and detected in major economies, such as those of Britain, America, and Germany. But there is no statistical evidence of a long wave in Britain’s industrial production in the first half of the nineteenth century when Britannia ruled the economic waves. And while there were financial crises from time to time, the downward phase to complete Kondratieff’s cycle never materialised. Today, with K-waves being fundamental to so much analysis of cyclical factors and their extrapolation, the lack of evidence and rigour in Kondratieff's theory should be concerning to those who believe in it. That there are variations in the pace of human progress is unarguable, and that there is a discernible cycle of them beyond mundane seasonal influences cannot be denied. But that is a cycle of credit, a factor which was at least partially understood by Bernstein when he correctly surmised that the way to bury a post-war depression was by expanding the quantity of money. When the inflation of money supply is mostly that of bank credit, it is cyclical in nature. Its consequences for the purchasing power of the currency conforms with the cycle, but with a time lag. Furthermore, the effect is weaker in a population which tends to save than with one which tends to spend more of its income on immediate consumption. No further comment is required on this effect, other than to state that over the whole cycle of bank credit, prices are likely to be relatively stable. This was the situation in Britain, which dominated the global economy for most of the period between the introduction of the gold sovereign following the 1816 Coinage Act until the First World War. Figure 1 confirms that despite fluctuating levels of bank credit, from 1822—1914, the general level of prices was broadly unchanged. The price effect of the expansion of coin-backed currency between the two dates and the increase in population offset the reduction of costs in production through a combination of improvements in production methods, technological developments, and increased volumes. What cannot be reflected in the graph is the remarkable progress made in improving the standards of living for everyone over the nineteenth century.The gold standard was abandoned at the start of the First World War, and the general level of prices more than doubled. Having seen prices rise during the war, in December 1919 the Cunliffe Committee recommended a return to the gold standard, and the supply of currency was restricted from 1920 with this objective in mind. A gold bullion standard instead of a coin standard was introduced in 1925, tying sterling at the pre-war rate of $4.8665, which remained in place until 1931[iv]. From thereon, the purchasing power of the currency began its long decline as central bank money supply expanded. There is no long-term cyclicality in these changes. Following the abandonment of the gold standard, and in line with other currencies which abandoned gold convertibility in the 1930s, sterling simply sank. The key to this devaluation is not fluctuations in bank credit, but the expansion of base currency. And there is no evidence of a Kondratieff or any other long-term cycle of production. It can only be a monetary effect. It is worth bearing in mind that the so-called evidence discovered by Kondratieff was in the mind of a Marxist convinced that capitalism would fail. The downturn of a capitalist winter, or decline in growth — whatever definition is used, was baked in the anti-capitalist cake. The Marxists and other socialists were and still are all too ready to claim supposed failings of capitalism, evidenced in their eyes by periodic recessions, slumps, and depressions. Kondratieff’s economic bias may or may not have coloured his analysis — only by digging deeply into his own soul could he have answered that. But in the absence of firm evidence supporting his wave theory, we should discard it. After all, there is a rich history of the religious zeal with which spurious theories in the fields of economics and money arise. The consequences of sunspot cycles and the supposed importance of anniversary dates are typical of this ouija board theme. Non-monetary cycle themes such as that devised by Kondratieff have socialism at their core. It is assumed that capitalists, bourgeois businessmen seeking through the division of labour to manufacture and supply consumer goods for profit, in their greed are reckless about commercial risks from overinvestment. This is nonsense. Fools are quickly discovered in free markets, and they are also quickly dismissed. Successful entrepreneurs and businessmen are very much aware of the risk and do not embark on projects in the expectation they will be unprofitable, and it is, therefore, untrue to suggest that the capitalist system fails for this reason. To the contrary, markets that are truly free have been entirely responsible for the rapid improvement in the human condition, while it is government intervention that leads to periodic crises by interfering in the relationships between producers and consumers and setting in motion a cycle of interest rate suppression and currency expansion. Markets which are truly free deliver economic progress by anticipating consumer demands and deploying capital efficiently to meet them. It is no accident that economies with minimal government intervention deliver far higher standards of living than those micro-managed by governments. Hong Kong under hands-off British administration, with no natural resources and enduring floods of impoverished refugees from Mainland China, stood in sharp contrast with China under Mao. Post-war East and West Germany, populated by the same ethnic people, the former communist, and the latter capitalist, provides further unarguable proof that capitalism succeeds where socialism fails. Marxist socialism kills cycles by the most brutal method. It cannot entertain the economic calculations necessary to link production with anticipated demand. There is no mechanism for the redistribution of capital for its more efficient use. Consumption is never satisfied, and consumers must wait interminably for inferior products to be supplied. Any pretence at a cycle is simply suppressed out of existence. Almost all long-wave literature assumes that prices change due to supply and demand for commodities and goods alone, and never from variations in the quantity of money and credit. But even under a gold standard, the quantities of money and credit varied all the time. In Britain, and therefore in the rest of the financially developed world which adopted its banking practices, gold was merely partial backing for currency and bank deposits, which since the days of London’s goldsmiths also lubricated the creation of debt outside the banking system. While originally gold was used as coin money, since 1914 when Britain went off the gold coin standard even this role in transactions ceased. Having explained the random nature of free-market capitalism, the difference from capitalistic banking must be explained. It owes its origin to London’s goldsmiths, who took in deposits to use for their own benefit, paying six percent out of the profits they made by dealing in money. This evolved into fractional reserve banking which became the banking model for the British Empire and the rest of the world. As well as renewing the Bank of England’s charter, the Bank Charter Act of 1844 further legitimised fractional reserve banking by giving in to the Banking School’s argument that the amount of credit in circulation is adequately controlled by the ordinary processes of competitive banking. If banks acted independently from one another competing for customers and business, we might reasonably conclude that there would be from time-to-time random bank failures without cyclicality, as the Banking School argued. In capitalistic commerce, it is this process of creative destruction that ensures consumers are best served and an economy progresses to their advantage. But with banks, it is different. Each bank creates deposits which are interchanged between other banks, and imbalances are centrally cleared. Therefore, every bank has financial relations with its competitors and is exposed to its competitors’ counterparty risks, which if acted upon creates losses for themselves and other banks, risking in extremis a system-wide crisis. Banking is therefore a cartel whose members acting in their own interests tend to act in unison. In the nineteenth century, this led to systemic crises, the most infamous of which were the Overend Gurney and Baring failures. It was to address this systemic risk that central banking took upon itself the role of lender of last resort so that in the future these failures would be contained. But this mitigation of risk merely strengthened the banking cartel even further, leading to the possibility of a complete banking and currency failure. And since bankers have limited liability and personally risk little more than their salary in the knowledge that a central bank will always backstop them, reckless balance sheet expansion is richly rewarded — until it fails. Fred “the shred” Goodwin, who grew a staid Royal Bank of Scotland to become the largest bank in Europe before it collapsed into government ownership was a recent example of the genre. It is these differences between banking and other commercial activities that drive a cycle of bank credit expansion and contraction while non-financial business activities cannot originate cycles. The state-sponsored structure of the banking system attempts to control it. Governments through their central banks also trigger a boom in business activity by suppressing interest rates as the principal means of encouraging the growth of currency and credit. The distortions created by these interventions and their continuance inevitably lead to a terminating crisis. As Ludwig von Mises put it: “The wavelike movement affecting the economic system, the recurrence of periods of boom which are followed by periods of depression, is the unavoidable outcome of the attempts, repeated again and again, to lower the gross market rate of interest by means of credit expansion. There is no means of avoiding the final collapse of a boom brought about by credit expansion. The alternative is only whether the crisis should come sooner as a result of a voluntary abandonment of further credit expansion, or later as a final and total catastrophe of the currency system involved.”[v]A long period of credit expansion with relatively minor hiccups ending in such a crisis could easily be confused with a Kondratieff 40—60-year cycle. But the error is to mistake its origins. Kondratieff tried to persuade us that the boom and bust was a feature of capitalist business failings when it is a currency and credit problem. The irony is that Stalin refused to admit even to an expansionary phase in capitalism, condemning Kondratieff to the gulags, and then a firing squad in 1938. He lived as a Marxist-Leninist and was executed by the system he venerated. Having identified the source of cycles as being a combination of state action and fluctuations in currency and credit in a state-sponsored banking system and not capitalistic production for profit, we can admit that there are further cyclical consequences. Whether they exist or not is usually a matter of conjecture. Purely financial cycles, such as Elliott Wave Theory, will also owe their motive forces to cycles of credit and not business activity. Kondratieff wave followers claim that commodity bull and bear markets are the consequence of a K-wave spring and summer followed by autumn, when it tops out, and winter when it collapses before rising into the next K-wave cycle. But we have demonstrated that the K-wave is not supported by the evidence. Instead, changes in the general level of commodity prices are a function of changes in the quantity of money. And as we have seen, there is a base component and a cyclical component of bank credit. We must now refocus our attention from the long-run UK statistics shown in Figure 1 to the contemporary situation for the US dollar, in which commodities have been priced almost exclusively since the early 1970s. The chart from the St Louis Fed below is of an index of industrial materials from 1992.We can see why the Kondratieff myth might be perpetuated, with industrial material prices more than halving between 2011 and 2016. But these swings came substantially from the dollar side of prices, whose trade-weighted index rose strongly between these dates. Between 2016—2018 the dollar weakened, before strengthening into 2020. Clearly, it was the purchasing power of the dollar driving speculative as well as commercial flows in international commodity markets. In March 2020, the Fed reduced its fund rate to the zero bound and announced QE (money-printing) of an unprecedented $120bn every month. Figure 2 below shows the consequences for the general level of commodity prices.Since late-March, the components of this ETF have almost doubled in price, and after a period of consolidation appear to be increasing again. K-wave followers might conclude that it is evidence of a new Kondratieff spring or summer, with the global economy set for a new spurt of economic “growth”. But this ignores the expansion of the Fed’s balance sheet reflected in base money, which is the next FRED chart.The monetary base has approximately doubled since the Fed’s March 2020 stimulus, additional to the post-Lehman crisis expansion. The last expansion undermined the purchasing power of the dollar to a similar extent in terms of the commodity prices shown in Figure 2. Sudden increases in the money quantity have disruptive effects on markets for goods and services and the behaviour of individuals. As well as undermining a currency’s purchasing power, supplies of essential goods become disordered by unexpected shifts in demand. Throughout history, there has been evidence of these inflationary consequences, often exacerbated by statist attempts to impose price controls. The Roman emperor Diocletian with his edict on maximum prices caused starvation for citizens, who were forced to leave Rome to forage for food in the surrounding countryside. The edict made the provision of food uneconomic, leading to extreme scarcity. During the reign of Henry I in England there was a monetary crisis in 1124 from the debasement of silver coins, which combined with a poor harvest drove up the prices of staples, causing widespread famine. The French revolution has been attributed to the insensitivity of royalty and the aristocracy to the masses; but it occurred at the time of the assignat inflation, which led to aggravated discontent among the lower orders and the storming of the Bastille. And today, we have widespread disruption of essential supplies, ranging from energy to carbonated foodstuffs. The lesson from history is it has only just started. The problems arise because individuals’ knowledge of the relationship between money and goods comes from the immediate past. They use that knowledge to decide what to buy for future consumption, and if they are in business, for production. In the latter case, they might change inventory policies from today’s just-in-time practices to ensure an adequate stock of components is available, driving up demand for them and creating shortages of vital factors of production. Consumers faced with shortages will alter the balance between their money liquidity and goods for which they may not have an immediate need but expect to consume at a future date. Bank account balances and credit available on credit cards will be drawn down, for example, to fill their car tanks with fuel, even though no journey is planned. And as we see in the UK today, it rapidly leads to fuel shortages and rationing at the petrol pumps. While the authorities try to calm things down, either by denying there is a supply problem or by imposing price controls, consumers are likely to see these moves as propaganda and justification for reducing money liquidity even further by purchasing yet more goods. The flight out of currency liquidity has a disproportionate effect on prices, particularly for essentials. They will simply drive prices higher until no further price rises are expected. Or put more accurately, the value of the currency continues to fall. It is worth illustrating the problem for its true context. If on the one hand, everyone decides they would rather have as much cash in hand money as possible rather than goods, prices will collapse. It is, as a matter of fact, a situation which cannot occur. If alternatively, everyone decides to dispose of all their liquidity by buying everything just to get rid of the currency, then the purchasing power of the currency sinks to zero. Unlike the former case, this can and does happen, when it becomes widely recognised that the currency might become worthless. In other words, a state-issued unbacked currency then collapses. Almost no one, so far, attributes today’s logistical and economic dislocations to monetary inflation, yet as pointed out above, empirical evidence points to a clear connection. Governments and central banks also seem unaware. But they appear to sense that there is an undefinable risk of consumer panic, making fuel and other shortages even worse. So far, the blame lies with logistic failures, which seem to be getting worse. Comments from leading central bankers, currently meeting in Portugal and organised by the ECB, confirm the official position of playing popular tunes while the ship goes down. The heads of the Fed, the ECB, the Bank of England, and the Bank of Japan are quoted in the Daily Telegraph as agreeing that staff shortages, shipping chaos, and surging fuel costs are likely to cause further disruption as winter draws near[vi]. Andrew Bailey, Governor of the Bank of England, warned “…that the UK’s GDP will not recover to pre-pandemic levels until early next year”. But besides the Bank keeping a close watch on inflation, he commented that monetary policy can’t solve supply-side shocks. Jay Powell admitted that at the margin apparently bottleneck and supply chain problems are getting marginally worse. But all the central bankers agreed that price pressures will be temporary. We can see from these comments a desire not to rock the boat and cause further panic among consumers. More worrying is the insistence that inflation remains a temporary problem. Unless there is a move to stop the monetary printing presses, they must believe it. It is confirmation that there is no intention to change monetary policy. But these problems are not restricted to the West. This week, we learn that even China, which has followed a policy of restricting monetary growth, faces an energy crisis with coal at power plants critically low, and coal prices up fourfold. Energy is being rationed with production of everything from food and animal feedstuffs to steel and aluminium plants supplying other factories, which in turn face power outages[vii]. China is the world’s manufacturing hub. The United States relies on China’s exports. There were some seventy container ships at anchor or at drift areas off San Pedro earlier this week, but after dropping slightly the numbers are expected to rise again. And in China, there are delays at ports of more than three days in Busan, Shanghai, Ningbo, and Yantian[viii]. Ship charter rates have rocketed from $10,000 a day to as much as $200,000[ix]. There can be no doubt as the northern hemisphere enters its winter that the consuming nations in America and Europe will see yet more product shortages, more price rises, and continuing logistics disruption. Central banks will become increasingly desperate to discourage consumers from hoarding items by claiming that shortages and price increases are transitory. What they fail to realise is that the consequences of currency debasement have led to consumption goods being wrongly priced, fuelling the shortages. These shortages can only be addressed by yet higher prices, even in the absence of further monetary debasement — until no further price increases are expected by consumers. But with massive and increasing government deficits to finance, central banks have no mandate to restrict the expansion of currency. An acceleration of monetary debasement as each unit of it buys less is therefore inevitable because consumers and businesses alike will begin to understand there is no limit to prices increasing. Left to its logical conclusion, the purchasing power of a currency falls exponentially until it has no value left. The speed at which it happens depends on the time taken for acting humans to realise what is happening. Unless it is stopped, an economy experiences what in the 1920s was described as a flight into real goods, or a crack-up boom. Economists today seem unable to comprehend the instability caused by monetary inflation. They adopt their models to ignore it. As von Mises put it, “The mathematical economists are at a loss to comprehend the causal relation between the increase in the quantity of money and what they call ‘velocity of circulation’”[x]. The confusion in the minds of central bank economists renders it unlikely that they will take the actions necessary to stop their currencies sliding towards worthlessness sooner rather than later. Central to resolving the problem is maintaining confidence that the currency will retain its purchasing power. But with the advent of cryptocurrencies, there is a growing proportion of the public who understand in advance of inflationary consequences that fiat currencies are being debauched at an accelerating rate. This represents a major change from the past, when, as Keynes put it supposedly quoting Lenin, “There is no subtler, no surer means of overturning the existing basis of society than to debauch the currency. The process engages all the hidden forces of economic law on the side of destruction and does it in a manner which not one man in one million is able to diagnose”[xi]. The fact that millions now do understand the currency is being debauched is likely to make it more difficult for the state to maintain confidence in the currency in these troubled times. We should know that what is happening to commodity prices is not some long-term Kondratieff wave or any other wave with origins in production beyond purely seasonal factors. We can say unequivocally that the cause is in changing quantities of currency and bank credit. We can also see that there are yet further effects driving prices higher from the expansion of currency so far. We can expect currency expansion to continue, so prices of commodities and consumer goods will continue to rise. Or put in a way in which it is likely to become more widely understood as the current hiatus continues, the purchasing power of the currencies in which prices are measured will continue to fall. [i] Investopedia.com [ii] The Long Wave in Economic Life by JJ van Duijn. Boston: George Allen and Unwin, 1983. See Chapter 8. [iii] Rostow [iv] A bullion standard operated so that only 400-ounce bars would be issued against redeemed currency, effectively cutting the general public out of the gold standard, whereas before the First World War currency could be exchanged for gold coins. The dollar exchange rate reflected its rate against gold at $20.67 per ounce. [v] Human Action by Ludwig von Mises, Chapter 20.8: “The Monetary or Circulation Credit Theory of the Trade Cycle”. [vi] Daily Telegraph, 30 September: Recovery will be delayed until 2022, Bailey warns. [vii] Daily Telegraph, 29 September: China’s energy crisis will send a chill through global markets. [viii]Seatrade maritime News, 29 September. [ix] Splash247.com. Boxship charter rates hit unprecedented $200,000 a day, 8 September. [x] Ibid Chapter 17.8 “The Anticipation of Expected Changes in Purchasing Power”. [xi] The Economic Consequences of the Peace. The views and opinions expressed in this article are those of the author(s) and do not reflect those of Goldmoney, unless expressly stated. The article is for general information purposes only and does not constitute either Goldmoney or the author(s) providing you with legal, financial, tax, investment, or accounting advice. You should not act or rely on any information contained in the article without first seeking independent professional advice. Care has been taken to ensure that the information in the article is reliable; however, Goldmoney does not represent that it is accurate, complete, up-to-date and/or to be taken as an indication of future results and it should not be relied upon as such. Goldmoney will not be held responsible for any claim, loss, damage, or inconvenience caused as a result of any information or opinion contained in this article and any action taken as a result of the opinions and information contained in this article is at your own risk. Original Post Editor's Note: The summary bullets for this article were chosen by Seeking Alpha editors. This article was written by     ",
    "datetime": "2021-10-03T13:44:00-04:00",
    "url": "https://seekingalpha.com/article/4458244-economic-theory-and-long-wave-cycles"
}