{
    "title": "Enslaved to the rhythm: why South Korean K-Pop is struggling to hide its darker side ",
    "text": "For years the stars of K-pop, South Korea’s pop industry, have been seen as squeaky clean. From their good looks and bright smiles to their split-second perfect dance routines and high-production music videos, every aspect of K-pop is presented in a way to be as close to perfection as possible. The fantasy sells well: K-pop is an enormous industry that has branched out in recent years beyond South Korea's borders to the rest of Asia and, increasingly, the rest of the world. In 2016, $4.7 billion-worth of K-pop singles, albums and merchandise was sold worldwide, according to the Korea Creative Content Agency. Hallyu, the Korean wave of culture, has brought us the mega-hit Gangnam Style, at the time YouTube’s most popular video, and has created a number of other icons that are recognised by an increasingly international audience. But there is a dark side to this glamorous world. Stringent management, intense fan adulation, unrelenting media scrutiny and the pressures of a highly competitive industry combine to create a hothouse in which few K-pop stars succeed and many burn out from the stresses and strains of trying to make it. The latest victim of K-pop’s dark side is Kim Jong-hyun, better known as Jonghyun to the fans of South Korean pop group SHINee, who died after being found unconscious in a private hotel in Seoul on December 18. “It’s not the first suicide in K-pop,” explains Emma Kalka, editor-in-chief of Groove Korea, a music website focused on K-pop and an American expat who has lived in the country for a decade. Male K-pop star Seo Ji-won took his life in 1996, citing concerns that he had become too popular, too quickly, and worrying that he wouldn’t be able to match the high standards his fans required of him. Eleven years later female singer U;Nee – who had previously been an actress before joining the K-pop industry – committed suicide following criticism on the internet. Earlier this year T.O.P, a rapper in mega-group Big Bang, overdosed on drugs but regained consciousness after three days in intensive care. When he was wheeled out of the hospital treating him, he told the assembled media: “I’m sorry”. T.O.P may have been apologising to his fans, but was also apologising to his paymasters. Korean entertainment companies (part-record labels, part-talent agencies and part-management firms) trawl through the country, hosting open auditions to find people they can mold into the next big things. Talent becomes little more than a commodity, and the people and personalities behind the K-pop idols are forgotten in the pursuit of profit. “They will invest in you as a teenager, spend years training you in language, dance, looks, paying for your plastic surgery,” explains Keith Howard, professor emeritus at SOAS, University of London, and author of Korean Pop Music: Riding the Wave. “It’s all about the image.” In exchange for that investment, entertainment companies require an incredible amount from talent. “You’re basically in servitude to them with a small chance of actually making it,” says Howard. The industry is intensely competitive, with K-pop nearing a saturation point. Anywhere between 20 and 50 mega groups will debut a year, with each entertainment company representing them hoping for a return on their investment. Few of them succeed. 어떻게 지내? 나는 집에서 친구들이랑 모였어 2:34 듣고싶어 취기가 올라오네요 잘자요 A post shared by @ jonghyun.948 on Sep 15, 2017 at 8:10am PDT In order to try to make a return on their investment as likely as possible, entertainment companies hothouse their talent, enforcing strict rules on their behaviour (and requiring many of them to live in dormitories) so they cannot be led astray by the temptations of fame and fortune. “Bands have always had adoring fanbases, but you can’t get near them because you’re policed all the time,” explains Howard. “You’re living in a place paid for by your entertainment company and you have to obey all those rules.” Social media usage is monitored – as are K-pop stars’ private lives. Some aren’t even allowed to date, for fear that it ruins the illusion of the attainable, single star. “The company really controls their life,” says Kalka. Those who breach the terms of their contract or try to nullify them are required to pay up to $129,000, according to South Korea’s Fair Trade Commission. Earlier this year the Fair Trade Commission raised concerns about the “slave contracts” under which entertainment companies kept their workers, specifically singling out the three largest firms, including SM Entertainment, for their unfair working practices. “The contracts may seem draconian, and in many ways they are. But from the entertainment company’s point of view, they’ve invested a lot of money in the training and surgery over the years, and they claim they need to get their money back,” he adds. Seeing a lot of comments for the mp3s to my covers so i made a SOUNDCLOUD account where you guys can download them (for free!!) [LINK IN BIO] 제 커버mp3 요청하는 댓글 많이 봐서 제가 사운드클라우드 만들었어요! (공짜로) 다운 받을 수 있어요!! 很多人说要我的cover的mp3. 所以我做了一个SOUNDCLOUD! (免费）可以下载我歌！ 📸: @ril2chaphotos A post shared by  Amber J. Liu 刘逸云 (@ajol_llama) on Sep 25, 2017 at 9:07am PDT But it’s not just pressures from management that weigh heavily on K-pop stars. Every celebrity, regardless of whichever culture they live and work in, comes under scrutiny from the press, but in South Korea, the notion of having to live up to the perfect ideal is even worse. “Ordinary South Koreans care that these people are perfect,” explains Kalka. “Whereas in the States people would talk about it for a bit but it’d die down and wouldn’t really hurt the person’s career that much, people’s careers have completely ended because of one scandal.” Even for those that do succeed, the unusual circumstances (K-pop stars are recruited to fit into pre-ordained slots in a group carefully calculated to have mass appeal, rather than cultivated and helped to express their own creativity) in which they came to their fame can often leave household names bereft. Amber Liu, a member of f(x), a popular K-pop group, dresses like a tomboy. Fans and K-pop watchers alike have questioned whether Liu’s image is of her own volition, or an edict from her management company. She isn’t the only K-pop star who may have lost their personality as a result of the need to conform to the specific characteristics entertainment companies require for a certain band. It can lead to K-pop stars asking themselves some difficult questions, all while under the closest scrutiny. “Are you where you are because of your own intelligence and skills, or because your agency told you something?” asks Howard. “That can weigh on one’s mind.” Kim’s death is just one of many that have been attributed to the stresses of living in the limelight in the punishing K-pop industry, and worryingly, is just one of nearly 40 deaths by suicide in South Korea every day, according to World Health Organisation statistics – the highest in any OECD country. Though Kim’s fame undoubtedly exacerbated his situation – among the laments he made in a note handed to a professional colleague and friend in the weeks before he took his own life, he said that “Maybe I wasn’t supposed to come up against the world; maybe I wasn’t supposed to be known to the world” – the reality is that depression, which Kim admitted to suffering from in the note given to another musician, is often ignored and overlooked in South Korea. “There’s a lack of support when it comes to mental health issues in general across South Korea,” says Kalka. “It’s very hush-hush. People don’t talk about going to see therapists. It’s taboo,” she adds. Some therapists in the country provide their services at two different payscales: one for those who claim back the costs from their health insurers, and a cheaper one for those who don’t, because they feel they can’t do so for fear that their company would find out they have sought professional help. “They worry what their company is going to think; they fear they might be disadvantaged in some way,” says Kalka. “Korean culture is about saving face. They do whatever they can to save face, or avoid things that might make them look bad.” R.I.P. Jonghyun of SHINee i go to Korea often and depression is a topic not often discussed, therapy is almost taboo cause of the country’s “just get over it” attitude. Hope this a wake-up call to the whole industry over there. Others, including South Korean-American rapper Dumbfounded, used Kim’s death as a call to reform the K-pop industry, and to encourage South Korea to more openly discuss depression. In the world of celebrity – and particularly K-pop idols, who are preened and primped, including regular extensive plastic surgery paid for by the entertainment firms – that avoidance of any kind of perceived weakness is taken to extremes. “They’re creating a fantasy,” says Kalka. “They want fans to believe these idols are perfect and wholesome. They have to fit this image, and they don’t want them to appear in any other way, otherwise they might lose money.” Whether the latest tragic death in the K-pop industry is likely to change attitudes in the seedier, darker side of the industry is yet to be seen. “There’s no sign of this changing,” says Howard, citing South Korea’s culture and attitude towards high performance, and its intolerance of weakness of any kind. Kalka, however, is slightly more hopeful – in large part, because of the increasing popularity of K-pop worldwide. That foreign pressure can already be seen in a campaign led by a Costa Rican K-pop fan beseeching the industry to clean up its act. More than 400,000 people have signed a petition asking entertainment companies to consider their artists’ mental health more seriously. “We want to ask all entertainment agencies to make a plan or program to monitor mental health in their employees not for the company's interests, but for their artists' wellbeing and a back-up for the employees that the programme won't be used against them and harm their careers but to help them get back on their feet,” the petition reads. The signatories come from Russia, Mexico, the United States and Poland. “Social media plays a different role in society, and because of that it’s made international fans a little more important,” says Kalka. “They’re more willing to speak out about this than the Korean fans.” ",
    "datetime": null,
    "url": "https://www.telegraph.co.uk/music/artists/enslaved-rhythm-k-pop-struggling-hide-darker-side/"
}