{
    "title": "ESSAY: Hallyu, the Korean wave - Art & Culture - The Jakarta Post",
    "text": "Please Update your browser Your browser is out of date, and may not be compatible with our website. A list of the most popular web browsers can be found below.\n          Just click on the icons to get to the download page.  Or continue login with What happened to me in the first two weeks of 2017? I became a novice K-pop fan. But seriously, what’s so unusual about that? Are there not millions of K-pop fans too? Yes, that would be true, until I tell you my age. K-pop bands target teenagers, not grown-ups and certainly not people who are almost senior citizens like me.\nBut wait, I also became a novice fan of Korean drama shows. Please excuse me for being gender-biased. I once had the idea that K-drama shows only appealed to young girls or middleaged housewives, and I must now admit that’s absolutely wrong.\nMy views have changed and I also no longer think of K-dramas as trashy, sentimental soap operas able to catch the hearts of many in Southeast Asia, except myself.\nThe South Korean government strongly supports its popular culture and treats it like an export commodity. A shopping mall in Jakarta, a branch of a Korean department store chain, was in fact officially opened by the South Korean President herself. The mall has a somewhat Korean atmosphere, with Korean restaurants and shops and walls decorated with huge portraits of Korean pop idols.\nI was also not completed unexposed to Korean culture prior to this. I had watched a few Korean movies at international film festivals and at a Jakarta cinema that occasionally showcases selected, good-quality Asian films. I also once learned basic Korean with the intention to attend a conference in Busan, but then could not make it.\nRead also: Korean dramas escape to fantasy\nBut why this sudden enthusiasm on Korean popular culture? It all started when I watched My Annoying Brother during the recent holiday season — a touching drama-comedy that has what I consider good-quality acting. This led me to buy DVDs and watch Jealousy Incarnate (with Jo Jung-suk as the main lead) and Doctors (with Park Shin-hye as the main lead).\nThe Korean wave, known as Hallyu, was indeed South Korea’s soft invasion to the rest of the world. Soft power, a term coined by Harvard political analyst Joseph Nye in the early 1990s, is used to describe the intangible power a country wields through its image rather than by force, or hard power, like military invasions. The United States has demonstrated its world conquering soft power in the 20th century, through Levi’s, Coca Cola, Marlboro Man and Hollywood. Now it is South Korea’s turn.\nSouth Korea was still a developing country up to the mid-1980s. With all its advancement as a new economic power in Asia, it had never occurred in their minds that their music would take up significant market share in the US or Europe. Instead they focused on the developing world.\nAs they were once a developing nation too, South Korea would understand more the stages developing countries would have to go through. Hallyu became their number one priority. Their economists worked hard to find out how South Korea could prosper through the “creative economy.”\nRead also: Where to enjoy all-you-can-eat Korean BBQs in Jakarta\nIndonesia has begun developing its creative economy in recent years, but we still have much to learn. South Korea has multiple five-year plans. If you want to make changes, the change has to be drastic. One example is the internet. Spreading Korean culture was dependent on the internet and so the government subsidized internet access throughout the country. But as Hong further explains, it was not just the government that had five-year plans; private enterprises have them too.\nA Korean entertainment company or record label will invest through training of their future stars. Take the EXO members, for example. They all had to go through a training period of five to seven years before their debut. Training was like going to school. They learn to sing and dance, they learn etiquette, they study languages, and most importantly they learn to bond until a firm brotherhood (or sisterhood for the girl bands) has been established before they go public.\nCan our entertainment industry learn from them too? If you remember in the mid-2000s there was this craze of Indonesian Idol and Akademi Fantasi. Newly discovered singers became overnight superstars, starting from television-reality shows and off-screen performances. But where are they now? A few were able to maintain popularity for a couple of months, but then they disappeared. The only preparation they had was a few weeks’ quarantine before their show with the risk of being eliminated afterwards. Compare this with Koreans idols who spent years being trainees (and yes, that’s the term used in Korea) without public exposure.\nNow what about Korean dramas? K-drama is certainly not of the same quality as sinetron. Story lines can be sentimental, with tales of love triangles and tearjerking scenes, but characters are well-developed as not being black and white.\nThey knew how to arouse our emotions and heat up our curiosity towards the ending of the series. But apart from the story lines, Korean dramas are also designed as a tool to advance their soft power. It is not enough to bring Korean culture to the world, but Korea also needs to understand how the world moves.\nThe Korean Cultural Trade Commission published a handbook Hallyu Forever (in Korean), which is a well-researched guide on how to approach world markets, paying attention to socioeconomic, political and cultural factors of each region. A chapter on the Arab world, for example, points out the importance of keeping Muslim praying times in mind. Thus TV stations should avoid airing drama programs during these moments. One historical drama The Jewel in the Palace was so popular in Iran, that on the other hand Iranians also organized their mealtimes as not to interfere with the show’s broadcast time.\nThe best thing about popular culture is knowing that it is not shallow at all. In fact it is something we all like and need in our lives. Perhaps the government should give more support to our own popular culture, and then our goals of a better “creative economy” can be achieved.\nIf Ada Apa Dengan Cinta (What’s Up with Love) became so well-loved in our neighboring countries, could we export our films to non-Malay speaking countries too? Maybe yes, if we have a more sound strategy like Hallyu, using soft power to make Indonesia become known to the world.\n***\nDanny Yatim is a lecturer at Atma Jaya University and a creative writing instructor at The Jakarta Post Writing Center. What happened to me in the first two weeks of 2017? I became a novice K-pop fan. But seriously, what’s so unusual about that? Are there not millions of K-pop fans too? Yes, that would be true, until I tell you my age. K-pop bands target teenagers, not grown-ups and certainly not people who are almost senior citizens like me. But wait, I also became a novice fan of Korean drama shows. Please excuse me for being gender-biased. I once had the idea that K-drama shows only appealed to young girls or middleaged housewives, and I must now admit that’s absolutely wrong. My views have changed and I also no longer think of K-dramas as trashy, sentimental soap operas able to catch the hearts of many in Southeast Asia, except myself. The South Korean government strongly supports its popular culture and treats it like an export commodity. A shopping mall in Jakarta, a branch of a Korean department store chain, was in fact officially opened by the South Korean President herself. The mall has a somewhat Korean atmosphere, with Korean restaurants and shops and walls decorated with huge portraits of Korean pop idols. I was also not completed unexposed to Korean culture prior to this. I had watched a few Korean movies at international film festivals and at a Jakarta cinema that occasionally showcases selected, good-quality Asian films. I also once learned basic Korean with the intention to attend a conference in Busan, but then could not make it. Read also: Korean dramas escape to fantasy But why this sudden enthusiasm on Korean popular culture? It all started when I watched My Annoying Brother during the recent holiday season — a touching drama-comedy that has what I consider good-quality acting. This led me to buy DVDs and watch Jealousy Incarnate (with Jo Jung-suk as the main lead) and Doctors (with Park Shin-hye as the main lead). The Korean wave, known as Hallyu, was indeed South Korea’s soft invasion to the rest of the world. Soft power, a term coined by Harvard political analyst Joseph Nye in the early 1990s, is used to describe the intangible power a country wields through its image rather than by force, or hard power, like military invasions. The United States has demonstrated its world conquering soft power in the 20th century, through Levi’s, Coca Cola, Marlboro Man and Hollywood. Now it is South Korea’s turn. South Korea was still a developing country up to the mid-1980s. With all its advancement as a new economic power in Asia, it had never occurred in their minds that their music would take up significant market share in the US or Europe. Instead they focused on the developing world. As they were once a developing nation too, South Korea would understand more the stages developing countries would have to go through. Hallyu became their number one priority. Their economists worked hard to find out how South Korea could prosper through the “creative economy.” Read also: Where to enjoy all-you-can-eat Korean BBQs in Jakarta Indonesia has begun developing its creative economy in recent years, but we still have much to learn. South Korea has multiple five-year plans. If you want to make changes, the change has to be drastic. One example is the internet. Spreading Korean culture was dependent on the internet and so the government subsidized internet access throughout the country. But as Hong further explains, it was not just the government that had five-year plans; private enterprises have them too. A Korean entertainment company or record label will invest through training of their future stars. Take the EXO members, for example. They all had to go through a training period of five to seven years before their debut. Training was like going to school. They learn to sing and dance, they learn etiquette, they study languages, and most importantly they learn to bond until a firm brotherhood (or sisterhood for the girl bands) has been established before they go public. Can our entertainment industry learn from them too? If you remember in the mid-2000s there was this craze of Indonesian Idol and Akademi Fantasi. Newly discovered singers became overnight superstars, starting from television-reality shows and off-screen performances. But where are they now? A few were able to maintain popularity for a couple of months, but then they disappeared. The only preparation they had was a few weeks’ quarantine before their show with the risk of being eliminated afterwards. Compare this with Koreans idols who spent years being trainees (and yes, that’s the term used in Korea) without public exposure. Now what about Korean dramas? K-drama is certainly not of the same quality as sinetron. Story lines can be sentimental, with tales of love triangles and tearjerking scenes, but characters are well-developed as not being black and white. They knew how to arouse our emotions and heat up our curiosity towards the ending of the series. But apart from the story lines, Korean dramas are also designed as a tool to advance their soft power. It is not enough to bring Korean culture to the world, but Korea also needs to understand how the world moves. The Korean Cultural Trade Commission published a handbook Hallyu Forever (in Korean), which is a well-researched guide on how to approach world markets, paying attention to socioeconomic, political and cultural factors of each region. A chapter on the Arab world, for example, points out the importance of keeping Muslim praying times in mind. Thus TV stations should avoid airing drama programs during these moments. One historical drama The Jewel in the Palace was so popular in Iran, that on the other hand Iranians also organized their mealtimes as not to interfere with the show’s broadcast time. The best thing about popular culture is knowing that it is not shallow at all. In fact it is something we all like and need in our lives. Perhaps the government should give more support to our own popular culture, and then our goals of a better “creative economy” can be achieved. If Ada Apa Dengan Cinta (What’s Up with Love) became so well-loved in our neighboring countries, could we export our films to non-Malay speaking countries too? Maybe yes, if we have a more sound strategy like Hallyu, using soft power to make Indonesia become known to the world. *** Danny Yatim is a lecturer at Atma Jaya University and a creative writing instructor at The Jakarta Post Writing Center. TJP Documentaries: Tamiya Racing Fever Still Alive in Indonesia TJP Documentaries: The Tragic Victims of Robot Trading and Binary Option Scams TJP Documentaries: Why Indonesian E-sports Athletes Are Today’s Money-making Superstars © 2016 - 2023 PT. Bina Media Tenggara ",
    "datetime": null,
    "url": "http://www.thejakartapost.com/life/2017/02/13/essay-hallyu-the-korean-wave.html"
}