{
    "title": "Everyone Wants to Be a Korean Filmmaker",
    "text": " By \n\n\tPatrick Frater Asia Bureau Chief Surprising as it may sound, the Korean film industry has had a rough time over the past couple of years. Get ready for a comeback. Just at a moment when Korean film producers might have expected to capitalize on the unprecedented multi-Oscar success of “Parasite” (and the previous year’s Korean-language “Minari,” COVID closed down Korean cinemas , stifled production and extinguished Korean audiences’ willingness to venture into cinemas. Pre-COVID, South Korea had been the world’s fourth-largest theatrical market, but for two years has been in an abyss. That the Korean film industry has an undiminished capacity for delivering high-quality pictures is amply on display in Cannes, where the country has four starkly different titles: “Decision to Leave,” a meticulous detective mystery from maestro Park Chan-wook; “Broker,” an issues-driven drama made in Korea by Japan’s former Palme d’Or winner Kore-eda Hirokazu; a convoluted 1980s-set spy actioner from “Squid Game” star Lee Jung-jae, making his feature directing debut; and an understated and introspective drama, “Next Sohee,” from Cannes returnee Jung July.  But back home, cinema chains have lost vast sums of money over the past two years and  distributors reacted to the new conditions by halting local releases. Last year’s “Emergency Declaration,” showcased at Cannes, is still unreleased at home and joins a backlog of over 100 completed movies awaiting a release. As a result, Korean films’ market share collapsed to levels not seen for 10 years. Korean films’ gross revenues tumbled from some KRW970 billion ($776 million) in 2019 to just KRW173 billion ($138 million) in 2021. The film industry is now hoping for a trickle-down effect from Korea’s other creative sectors — music, TV drama, cosmetics and food — that will speed its revival. “One of the first things I did after getting the job was to change the industry’s branding. No more ‘Korean Cinema.’ Instead, we should call ourselves ‘K-Movies,’ ” said Korean Film Council (KOFIC) chairman Park Ki-yong. “It fits with the times.” Korea’s stand in the Cannes International Village has been appropriately rebadged. K-Movies’ comeback is also likely to have a more international flavor, as foreign filmmakers come to Korea to co-produce or make local productions. On the eve of his departure for Cannes, Kore-eda said that it was his “long-time dream” to make a film in Korea. “I’d met superb Korean actors like Song Kang-ho, Gang Dong-won and Bae Doo-na in many film festivals and have kept in close touch with them for a long time.”  Director Mike Figgis says the quality of Korean actors — especially its female talent — was among the key reasons he committed to helm “Shame,” his anticipated venture into Korean filmmaking. “Mainly through Netflix, about two years ago I watched lots of Korean dramas. I was intrigued by the style of Korean filmmaking,” said Figgis in Busan, shortly before the pandemic. “So, 15 months ago I decided to buy a plane ticket to Korea.” Figgis is not alone in being swept up by Korean contemporary culture. France’s Denis Dercourt recently released his Korean-set crime drama “Vanishing” with a mixed French and Korean cast and crew. And Davy Chou’s Un Certain Regard film “Return to Seoul” is a French-German-Belgian co-production focused on an adopted woman’s rediscovery of her roots in Korea. “I could see the huge cultural impact Korea has had on everything in Asia. When you travel in Asia, you see how people listen to current Korean music and watch Korean films. It was a phenomenon that was only happening in Asia a few years ago, but now it’s just everywhere,” Chou says. While making “Return to Seoul,” Chou said that he felt in awe of K-movies’ biggest names. “I firmly believe that Hong Sang-soo, Li Chang-dong and Bong Joon Ho are really some of the very best directors in the world,” he says. “There is such an abundance of talent here. It is a miracle. There’s no reason this Korean wave cannot continue for another five or 10 years,” says Lee Jooick, a veteran producer at the forefront of an earlier Korean wave in the early 2000s. “Those in the U.S. who thought ‘Gangnam Style’ was a one-off now listen to BTS and Blackpink on their radio. On the TV front, Korean formats such as ‘I Can See Your Voice’ and ‘The Masked Singer’ are now everywhere in the world. “I’m so proud of a show like ‘Pachinko,’ which I was not involved with personally, but demonstrates the versatility of Koreans, Korean-Americans and Korean-Japanese.” Lee adds. After a crushing fifth wave of COVID in the first months of 2022, the Korean domestic industry can finally feel that the comeback may be tangible. “The Roundup,” a crime action film fronted by the Korean-American Don Lee (aka Ma Dong-seok) is doing outstanding business. Released in cinemas on Wednesday, it has already clocked up $8.1 million of business in two days. Its international sales agent K-Movie has had no problem licensing it to over 130 territories. A Variety and iHeartRadio Podcast The Business of Entertainment ",
    "datetime": "2022-05-21T05:40:34+00:00",
    "url": "https://variety.com/2022/film/asia/everyone-wants-to-be-korean-as-the-k-wave-sucks-in-international-talent-1235272972/"
}