{
    "title": "EXCLUSIVE: Politicians at cockfighting rally caught on video",
    "text": "LOUISVILLE, KY (WAVE) - It's part of Kentucky's landscape, even when it's not readily visible. This part is hidden in a Henry County valley behind the trees by Lake Jericho. It features sprawling farms that raise chickens, but not the kind you eat. These chickens are separated by leg leashes and if they weren't they would fight. [WATCH VIDEO ON MOBILE DEVICES: Politicians at cockfighting rally captured on video] \"If they break off their ropes or out of their pens they do kill each other, by nature's way, not nothing to do with us,\" said farm owner Albert Fair. The man who owns Dink Fair Game Farm said there's nothing illegal going on here. [RELATED STORY: Bevin issues statement after WAVE 3 News cockfighting investigation] \"I specialize in breeding only,\" said Fair. \"What the other people do with them, like a gun salesman, I am not responsible.\" What other people do with them is the issue. Cockfighting has been illegal for years in Kentucky, but police have often looked the other way. A state trooper and sheriff's deputy were caught on camera by undercover Humane Society investigators in 2010 at a Manchester, Kentucky, cockfighting event, doing nothing about it. \"What you have is an illegal cockfighting industry in Kentucky. Kentucky is kind of the capitol of it and drug in people from other states involved in that crime,\" said Humane Society of the United States Animal Cruelty Policy Director John Goodwin. Goodwin successfully lobbied lawmakers to make it a federal crime to attend a cockfight and a felony to bring a child to one. \"This federal law, that was expanded to cover spectators at animal fights, is very same law used to prosecute Michael Vick. It is a very popular law,\" said Goodwin. It's not popular to a lot of people in Kentucky. On March 29, \"activist cockfighters\" were summoned through social media to the Corbin Arena for a meeting to legalize cockfigting. So I put on a cockfighting shirt and went in undercover. The second speaker, American Gamefowl Defense Director Dave Devereaux, spent several minutes explaining why we were here. \"For the sole purpose of legalizing gamecock fighting at the state level,\" said Devereaux. The next speaker, in front of more than 700 people, was Republican US Senate Candidate Matt Bevin. \"There is not a cause, there is not an issue, nothing we believe in that we could not bring to fruition if we turn out to vote,\" said Bevin. When he was finished, he was asked a direct question. \"Will you vote to support the effort to legalize gamecock fighting in the state of Kentucky?\" asked Devereaux. \"I support the people of Kentucky exercising their right, because it is our right to decide what it is that we want to do, and not the federal government's. Criminalizing behavior, if it's part of the heritage of this state, is in my opinion a bad idea. A bad idea. I will not support it,\" said Bevin, which was met with rousing applause from the crowd. Bevin was followed by standing State Representative Richard Henderson of Mt. Sterling, who supported legalization of cockfighting in Kentucky, and then made a popular confession. \"I bet on chickens,\" said Henderson. \"I must admit I've been to more than a few chicken fights. I must admit I liked them.\" Representative Henderson refused our request for an interview. \"The media misconstrues everything I say,\" he said. We caught up with Bevin at a Louisville campaign stop. He said he didn't know it was a cockfighting rally. \"I don't personally support cockfighting, never been to a cockfight in my life,\" he said. \"If you were there, you can tell, when I was speaking, were you there when I spoke?\" \"I was there the whole time,\" I said. \"I was there to speak about why I'm running for US Senate. That's the same thing I do everywhere I speak,\" Bevin said. \"When Dave Devereaux got up before you, he said we're here for the sole purpose of talking about legalizing cockfighting in Kentucky. What were you thinking when he said that?\" I asked. \"I honestly wasn't even paying attention. I was thinking about what I was going to say. I don't even remember him saying that,\" Bevin said. I read him back his comment from the rally: \"Criminalizing behavior, if it's part of the heritage of this state, is in my opinion a bad idea.\" \"You stand behind that?\" I asked. \"What I stand behind is people's ability to examine their First Amendment rights to speak about whatever they want to speak about,\" Bevin said. In the rally, Representative Henderson urged the crowd to appeal to lawmakers to modify the part of the bill that makes attending cockfights a felony. Devereaux and Goodwin say cockfighting advocates are focusing on Kentucky to wage this war because Kentucky has had weaker laws and has been more open to cockfighting. Copyright 2014 WAVE 3 News. All rights reserved. ",
    "datetime": "2014-04-25T23:01:26Z",
    "url": "https://www.wave3.com/story/25336346/exclusive-politicians-at-cockfighting-rally-caught-on-video/"
}