{
    "title": "Explained: How Korean wave is so much more than just Netflix’s Squid Game | Explained News - The Indian Express",
    "text": "The Netflix series Squid Game became a sensation last month with its dystopian premise where people, pushed to the brink of desperation, play deadly children’s games to win money. It’s brutal, stark nature and the whole concept seemed to resonate globally — paving the way for it to become Netflix’s biggest launch, with around more than 111 million households tuning in to watch. Squid Game, however, isn’t the streamer’s first Korean success, and neither has it been responsible for fuelling the Korean wave globally. Squid Game isn’t a flash in the pan for Korean dramas, it has been a pawn in South Korea’s ambition to spread awareness about their culture. The Hallyu wave The Hallyu (A Mandarin term designated to describe the growing popularity of the Korean entertainment industry) phenomenon did not take place overnight. It has been gradually spreading since the 1990’s – much before BTS formed their ARMY, before Hyun Bin and Son Ye-Jin crashed into our hearts with Crash Landing On You, and Parasite won the Oscar. The Hallyu wave was born out of the Asian financial crisis that hit South Korea in 1997. The country was drowning in debt after borrowing from the International Monetary Fund, and had to use the money to restore its depleted foreign currency reserves. In the midst of financial shambles, President Kim Dae-jung realised that the entertainment industry could serve as an economic engine. The Ministry of Culture was restructured, and funds were injected into the Korean film council to propagate pop culture, while ensuring that universities churned out talent. Several government ministries, including food, foreign affairs, sports and tourism invested heavily in the entertainment industry. Today, Hallyu is one of the main exports, as the government spends more than $500 million annually on its promotion through the Ministry of Economy and Finance. Yet, the wave doesn’t just restrict itself to just Korean popular culture, it has also generated a deep interest in Korean food, products and lifestyle and created more opportunities for tourism. Hallyu has grown exponentially since 1999 and is now being noticed as a global cultural phenomenon. So the perplexed expressions of long-term Hallyu fans might now be understood, when they see audiences having epiphanies that Korean dramas are actually just that ‘good’. South Korean culture, through their dramas and music, has been making ‘waves’ since the late 90’s and early 2000’s. Korean dramas have been commercially successful in Asia and Latin America, as well as the US, even before the days of Netflix, and fans had Viki subscriptions as well as DramaFever. Popularity of ‘K-dramas’ There are several reasons why ‘K-dramas’ (a term used to refer to the melodramatic romantic format of the shows) have found their audience. Apart from storytelling, visual appeal, themes, and stellar acting, there is wholesome rom-com energy, a taste of a consuming romance in most of the shows, rather than the predictable pattern of broken fragmented relationships and constant partner switching, a trope most shows fall victim to. In short, they appear to have perfected the romantic format, which is perhaps why their audience likes to binge watch a season in a week. While the romances are engaging, the familial relationships also add to the enjoyment factor of the show. K-dramas don’t restrict their stories to just their leads, they spill over to the surrounding neighbours or friends, bringing forth engaging tales and a multi-layered show, most of the time. If the romances are saccharine, the thrillers keep you on your toes, with their taut and edgy premises. K-dramas are usually short, they end a story within one season of 16-20 episodes, or sometimes three seasons, rather than an endless drag of eighteen plus seasons. Over the course of two decades, the dramas have explored various themes, and perhaps revolutionary ones too at a time when people weren’t ready for those kinds of discussions. Among the slew of K-dramas, in 2007, Train to Busan actor Gong Yoo and Yoon Eun-Hye’s Coffee Prince explored the concept of sexual identity, reversal of gender roles in a clear, concise and sensitive manner. In 2009, fans binged on Boys Over Flowers, a show that made actor Lee Min Ho a household name, and the show is still loved today. It was also one of the first shows that spurred the Hallyu wave to the West. A teenage romance set in the backdrop of a high school, it also is said to have sparked a fashion and grooming trend among Asian men. The series was appreciated for a nuanced premise: It was more than just academics and romance, it was noted for its realistic portrayal of the obstacles of teenagers. In 2013 and 2014, Lee Jong-suk emerged with his revenge-angst driven dramas, I Can Hear Your Voice and Pinocchio, which portrayed realistic insights into law proceedings and the desperation of media houses to sensationalise coverage for TRP’s. Later, he veered away from the edgy dark hero and became a lovelorn lead in Romance Is A Bonus Book, which apart from focussing on the romance, also delved into the nitty-gritties of a publishing house. In 2019, Crash Landing On You became the talking point of all Korean dramas, as it saw the star-crossed love story between a North Korean military officer and a South Korean heiress. In 2020, It’s Okay Not To Be Okay dealt with troubled parenting and fragilities of mental health, and quickly headed to Netflix’s Top 10 dramas. In 2021 itself, before Squid Game released, Hospital Playlist, a medical show revolving around the friendships between doctors who are also bandmates ended its run with the second season. The show was so popular that people hoped for a third season, which unfortunately won’t happen. K-dramas haven’t just stopped at heartfelt romances; they tapped into their Korean mythology, something that gave their shows a delightful flavour. Gong Yoo’s Guardian: The Lonely God, introduced many to ‘dokkabe’ – Korean goblins, which is a far cry from the English terminology. Dokkabe are natural deities and spiritual entities, and this formed the crux of Guardian. Guardian saw Gong Yoo as a Goblin, and Lee Dong-wook as a ‘Grim Reaper’, who spar to share a house, while dealing with their complicated love lives and even more complicated, intertwined pasts. This freshness and unusual storytelling found an audience and the show became one of the most watched series in Korea, and found fans globally as well. Korean fantasy series have introduced us to Imoogi, Gumihos (the nine-tailed fox), a concept that has made its way into several shows. The supernatural fantasy dramas had addictive premises: for instance Hotel Del Luna, a hotel that was run by ghosts who still had to make peace with their traumatic pasts, or The Tale Of The Nine-Tailed Fox, where a Gumiho was searching for his past love. So, Squid Game isn’t the first show to be riding the Hallyu wave, and neither will it be its last. Netflix has an overpowering collection of Korean dramas and has been keenly investing in the Korean entertainment industry since 2016, investing 700 million in the last 5 years itself. There are more major hits to come. Newsletter | Click to get the day’s best explainers in your inbox  Lakshana N PalatLakshana N Palat covers pop-culture, ranging from Bollywood, Hollywood... read more ",
    "datetime": "2021-10-16T10:40:52+05:30",
    "url": "https://indianexpress.com/article/explained/squid-game-south-korea-7574331/"
}