{
    "title": "\n\tExplained: Why South Korean culture is a global hit - Frontline\n",
    "text": "Published :\nDec 24, 2021 14:52\nIST COMMents Follow Us SHARE READ LATER The iconic imagery of 'Squid Game' is part of its appeal. Beyond Netflix's hit series \"Squid Game,\" South Korea boasts a variety of successful cultural exports in recent years. New albums by K-pop groups like BTS or Blackpink top the charts around the world, while South Korea's intense fandom culture is turning into a worldwide phenomenon. In 2019, Bong Joon-ho's film \"Parasite\" caused a sensation by winning four Oscars in 2020, including for best picture. South Korean literature has also been gaining international recognition, including through Han Kang, who won the Man Booker Prize in 2016 for her novel \"The Vegetarian,\" and Kim Young-ha, who was awarded the Deutscher Krimi Preis (German Crime Fiction Prize) in 2020 — the most prestigious German literary prize for crime fiction — for \"Diary of a Murderer.\" The current success of South Korean pop culture, however, has been a long time coming. The Chinese term \"Hallyu,\" which literally translates as \"Korean Wave\" and is now used to describe the popularity and spread of contemporary culture from South Korea, was coined in the mid-1990s. The wave first spread to other Asian countries \"Hallyu quickly conquered the Chinese market, but the industry always had their eyes on the US market, where it however faced many failures,\" Michael Fuhr, managing director at the Center for World Music and research assistant at the Institute for Music and Musicology at the University of Hildesheim, told\nDW . South Korea differed from other markets early on through its idol training system, says Fuhr, who is currently doing a doctorate on K-pop and has recently contributed to a research project on fan culture in K-pop with scholars from Liverpool and Seoul. A grueling training system The three biggest companies in the Korean entertainment industry, YG, SM and JYP, are agencies renowned for selecting hundreds of young trainees who are drilled in intense training programs, where they can spend 14 hours a day working on their performance skills. At the end of the 2000s, the group Girls' Generation, formed by SM Entertainment, was a big hit in South Korea and Japan, while the boy band Big Bang, which was put together by YG in 2006, started gaining recognition abroad as well. A milestone with Psy But South Korean music's major breakthrough in the West came in 2012, with the global hit \"Gangnam Style\" by rapper Psy. Its YouTube video was clicked more than a billion times within a few months, tallying up to more than 4.2 billion views to this day. \"Psy wasn't a classic representative of K-pop,\" points out Michael Fuhr, \"but he demonstrated for the first time that language was no longer a barrier to international success.\" The power of social networks YouTube, along with other rapidly growing streaming and social media platforms, definitely contributed to the phenomenon. Suddenly, record companies were no longer dependent on broadcasters playing their songs or videos; fans could determine on their own what they liked. \"The fans of K-pop are well networked; the fan culture is very participatory and the industry knows how to serve it,\" says Michael Fuhr. The agencies forming K-pop groups consciously select band members with different character traits to make sure that as many young people as possible can identify with them. The bands are also required to have an active online presence, allowing fans to get the feeling that they're part of the lives of their idols, says Michael Fuhr: \"It's a package that is being sold.\" But as soon as the idols present themselves in public in a way that deviates from their fans' expectations, they face hateful comments and pressure, which has already driven some stars to suicide. The high production quality of music and videos also contributes to its success. \"From a Western point of view, what you see there is somehow new, but at the same time there's something familiar about it,\" says Michael Fuhr, pointing out Michael Jackson's influence on the sophisticated choreography of boy bands like Take That. K-pop bands target an audience who has perhaps had enough of U.S. pop stars and is searching for something \"new and exciting, but at the same time not too strange.\" Imagery borrowed from video games \"Squid Game\" likewise renews an established visual style. The colorful aesthetics of the series feels familiar to a younger audience used to video games. For example, the symbols worn by the guards in the series -⁠— circle, square and triangle ⁠— are similar to those found on PlayStation consoles. Word-of-mouth praise through the gamers' global network is said to have significantly contributed to the success of the series. Stories with a social commentary The issues addressed in the series, including poverty, hustle culture and the growing gap between the rich and poor are universal, says Michael Fuhr. Here too, successful films and shows offer a new take on long-standing social problems — with \"Squid Game\" and \"Parasite\" serving as the most prominent examples. Beyond the fictional universes, these stories also provide insight into South Korean society, showing how many people in the country live in poverty, in cramped conditions, often without electricity and water or in basements, like the poor family who pushes their way into the life of a rich family in \"Parasite.\" According to the OECD, around 15 per cent of the 52 million inhabitants have less than the average income at their disposal; poverty in old age is estimated at 50 per cent; and youth unemployment is just under 10 per cent — almost twice as high as in Germany. Many families go into debt in order to provide their children with a good education. At the same time, it is common in South Korea to look down on those who have less. \"It's a society very much shaped by capitalist values,\" says Michael Fuhr. There is \"a strong work mentality and in parts a neo-Confucianist hierarchy of values.\" The protagonists in \"Squid Game\" are desperate for money. As proof that the fictional universe echoes real-life issues, protesters demonstrating against the South Korean government's labor market policy last October dressed up wearing costumes and masks from the show. COMMents Follow Us SHARE BACK TO TOP Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide to our community guidelines for posting your comment ",
    "datetime": "2021-12-24T09:22:00.000Z",
    "url": "https://frontline.thehindu.com/dispatches/explained-why-south-korean-culture-is-a-global-hit/article38027669.ece"
}