{
    "title": "\n        Explaining the Korean Wave «         Khabarhub    ",
    "text": "Thursday, October 26th, 2023  0% September 19, 2020 4 MIN READ Korean Wave (Hallyu) is a term used to refer to the popularity of Korean culture and entertainment in other parts of the world. First appeared during the mid-1990s, Korean TV dramas and pop music gained popularity in the Chinese-speaking communities. After Korea entered into diplomatic relations with China in 1992. The term was coined by journalists from China, who were surprised by the country’s appetite for South Korean cultural exports. “Hallyu” literally means “Flow of Korea”. To recall, one of the first successful TV dramas, “What Is Love?” was aired by CCTV in 1997. Imagine its impact: Over 150 million Chinese viewers watched the drama. Wasn’t this impactful?\nIn fact, Korean pop music — particularly dance music — began to gain popularity among the Chinese teenagers after it was introduced in 1997 by a radio program “Seoul Music Room” that was broadcast from Beijing. Not to forget the moment that ignited the Korean pop culture fever in China was the concert by Korean boy band H.O.T., held in Beijing in 2000. News reports in Korea used the term Hallyu, (Korean Wave), in describing this concert. The “Korean Wave”, which was then acknowledged in an article by Beijing Youth Daily in November 1999 began to finally be recognized by the Koreans themselves from this very point. In 2003, the same Korean Wave landed in Japan when the KBS TV drama series “Winter Sonata” was aired through the NHK. This “Winter Sonata” was an instant mega hit, making its male protagonist, Yon Sama, compelling his fans of Japan to visit film locations, including Namiseom Island, in South Korea.\nIn fact, what has to be understood is that the ‘Korean Wave’ craze has expanded to Korean traditional culture, literature, food, and language. The Hallyu-related organizations are K-Pop fan clubs. More than 74 million people in 92 countries have joined the Korean Wave organizations across Asia, the Americas, Europe, Oceania, Africa, and the Middle East. To explain it briefly, it is a neologism defining the rapid growth in the popularity of South Korean culture. The spread of televised dramas across Asia during its initial stage, the Korean Wave emerged from a regional development into a global phenomenon. This was all because of the proliferation of Korean pop music videos on YouTube. The spread of Korean Wave is visibly seen among teenagers and adults in Northeast India, Latin America, North Africa, the Middle East, and immigrant enclaves of the Western world. It has become a popular culture causing sensation in the world with TV dramas, pop music, and movies. Korea’s popular culture has gained fandom outside of the Korean community in recent times having significant political and economic impacts. Reports have said websites selling Korean materials are booming. The Korean lifestyle is espoused as a fresh model of cultural chic as K-pop and K-drama are gaining popularity in the United States and elsewhere via diverse channels. ",
    "datetime": null,
    "url": "https://english.khabarhub.com/2020/19/128625/"
}