{
    "title": "Explainer: what is K-pop and J-pop?",
    "text": "Lecturer in Cultural Studies, University of Otago Rosemary Overell does not work for, consult, own shares in or receive funding from any company or organisation that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.  University of Otago provides funding as a member of The Conversation AU. University of Otago provides funding as a member of The Conversation NZ. View all partners A little over a year ago, South Korean singer PSY galloped onto the global pop circuit singing about “sexy ladies” in the Seoul suburb of Gangnam. What followed were a flurry of articles (some going as far as to claim that PSY was offering a scathing critique of bourgeois South Koreans) introducing Western audiences to a formerly niche style of bubblegum pop called “K(orea)-pop”. Many of those articles focused on the more “exotic” and outrageous aspects of K-pop: its cute aesthetic, the gruelling dancing and singing training programme and the genre’s association with plastic surgery. Though K-pop had its origins with hip-hop outfit Seo Taiji and Boys in the 1990s, and has achieved astronomical success in the Asian market since the so-called “Korean Wave” (Hallyu) in the 2000s, a middle-aged man with a novelty dance was what it took for K-pop to “break” with Western audiences. While the average listener may now be familiar with K-pop as a novel genre of global pop, K-pop’s precursor – and sometimes rival – J(apan)-pop is less well known. Both proffer pop sung by impossibly good-looking young people, which ranges from sentimental ballads to highly-danceable tunes in Korean or Japanese, with a smattering of “cool” English words for good measure. PSY is actually anomalous in terms of K-pop. He is older, a solo artist and his music is more satirical than sentimental. But we need to understand both “pops” in terms of political scientist Joseph Nye’s idea of “soft power”. In short, Nye argues that, alongside political-economic might, key to contemporary manifestations of national power is culture. He suggests cultural exports – such as food, fashion and music – are effective ideological vehicles. In the 1980s and 1990s, Japan’s economy boomed. Key to this was a domination of the Asian pop music market. While Chinese, Singaporean and Malaysian consumers were wary of Japanese political clout following the Pacific War, the cute, catchy and apparently innocuous strains of Japanese pop music were seen as a “safe” mode of engaging with their formerly imperialist neighbour. Of course, territories such as Hong Kong had their own pop music industries (“Canto-pop”), but Japan was most successful in exporting its pop product. Unlike the gyrating rebelliousness of Western music, J-pop presented Asian consumers with a relatable “Asian-ness” that also appeared modern and cosmopolitan. J-pop was – and is – run in a similar manner to other Japanese companies. The jimusho (management agencies) are vertically structured, and pop hopefuls undergo a rigorous apprenticeship before “debuting” in their mid to late teens. J-pop stars are not simply singers: they are also accomplished dancers and often appear in Japanese soap operas, variety shows and even cooking programmes. 1990s J-pop aidoru (idols) such as SMAP and Wink garnered fans in Japan, but also in other Asian countries. But Korea restricted imports of Japanese goods due to the fraught historical relationship between the nations. Instead, Korea developed its own popular music industry, spearheaded by the management agency SM Entertainment. Koreans flocked to buy albums by boy bands Seo Taiji and H.O.T. K-pop’s musical style was similar to J-pop, as was the arrangement of the management agencies. Further, as with J-pop, K-pop was focused on cultivating a pan-Asian market. In particular, SM and its main competitors, YG and JYP, targetted Japanese consumers. In a novel move, K-pop producers diversified their product to suit local markets. Crucially, K-pop stars, such as female idol B.o.A, were trained in Japanese language and “culture”. B.o.A. would release two versions of her songs – in Korean and Japanese. In the early 2000s, Korean pop music began to dominate the Japanese charts. K-pop has further localised its music by training singers in Mandarin, Thai and, more recently, English. In a similarly market savvy move, K-pop “super groups” (often with ten or more members) have local “franchises” made up of mostly non-Korean members. Super Junior, for example, one of K-pop’s most successful boy bands, has local language franchises in China and Taiwan. Arguably, the “Korean wave” has been a more effective device of soft power than the “Japan boom”. While J-pop groups ruled the Asian market in the 1980s and 1990s, they never “cracked” the West. K-pop idols – PSY aside – on the other hand, have had some success overseas. Super Junior visited Sydney in 2012 and attracted a large crowd. Further, auxiliary cultural products, such as Korean food, fashion and language classes, have surged in popularity. Like J-pop, K-pop has a formalised fan-club system. Each group of fans has a “title” and even colour. Super Junior fans are known as “Everlasting Friends” (ELFs). Their colour is “pearl sapphire blue”. Fans network online from around the world and often pool together money to buy extravagant gifts for their idols. The cuteness and apparent innocuousness of cultural products is key to soft power. While ELFs brandishing pearl sapphire blue balloons and buying iPods for their idols may seem silly, K-pop’s revenue was US$ 3.4 billion in 2011, of which US$180 million was exports. While “Gangnam Style” was a novelty hit, the business and cultural politics behind Korean and Japanese pop music is far more serious. Copyright © 2010–2023, The Conversation ",
    "datetime": null,
    "url": "https://theconversation.com/explainer-what-is-k-pop-and-j-pop-20956"
}