{
    "title": "Extreme heat wave will worsen today, forecasters say - Los Angeles Times",
    "text": "California remains in the grip of a heat wave that threatens to bring record temperatures to the state this weekend. On Friday, several records were set, both for high temperatures and for hottest low temperatures. And this weekend is supposed to be even hotter. On Saturday, the National Weather Service warned that temperatures could climb to 120 degrees in some desert areas, 100 to 115 in valleys, 100 to 105 in lower mountains and 80-95 in coastal areas. Several agencies opened cooling centers — air-conditioned facilities where the public can escape the heat — around Los Angeles County. For information about the centers, call 211, or check out an interactive map of the centers online. Much of the state is under a heat warning at least through Sunday. PHOTOS: Heat wave in the Southland Temperature records in Palmdale and Lancaster, currently 113 and 114 degrees, respectively, could also fall this weekend, National Weather Service specialist Stuart Seto said. The last significant heat wave to hit Southern California was four years ago, Seto said. In 2009, Southern Californians baked in unrelenting heat for two weeks. In Los Angeles, the heat is a particular concern to firefighters because it comes in a year of record dry conditions that have already sparked several major brush fires across the region. Plus, fireworks went on sale in some areas beginning Friday, adding another fire danger. Fireworks can be sold in 295 designated communities in the state through the Fourth of July. Many weather experts this weekend will keep a special eye on Death Valley. Across the Furnace Creek Resort in Death Valley, sighs of “God, it’s hot,” can be heard in a variety of languages. International visitors flock to the motel in Furnace Creek, where the hottest temperature in the world -- 134 degrees -- was recorded nearly 100 years ago, on July 10, 1913. “It’s very warm, and people are coming here to see what it feels like,” said Ann Wegner, executive administrative assistant for the resort. “I don’t think anybody can really be prepared. “Even if the air is blowing, it’s hot,” she said, comparing the breeze to air coming out of a hot oven. Temperatures in Death Valley are expected to reach 129 degrees Sunday and Monday, breaking the record for the hottest June temperature -- 128 degrees, set June 29, 1994, said Chris Stachelski, a weather service meteorologist based in Las Vegas. Death Valley is typically about 12 degrees warmer than Las Vegas, with normal high temperatures hovering around 114 degrees and rising to about 115 at the beginning of July, he said. An excessive heat warning is in place for rangers and visitors to the Death Valley National Park. People going to or through Death Valley should travel during the coolest parts of the day and have water and food with them in case of a breakdown. Travelers should be prepared for the environment in the event something happens that strands them, Stachelski said. Those who venture out to sightsee should avoid long walks, especially during the hottest part of the day; wear sunscreen; stay hydrated; and know their limits. Visitors should go to the coolest parts of the park, which are at higher elevations, Stachelski said. The elderly, small children and those with medical issues should stay indoors. “If you’re not used to that kind of heat, after a while you can succumb to the elements,” he said. In Death Valley, July is the month that statistically has the most deaths and injuries such as dehydration. The people most likely to get injured are those who don’t know their limits, wander and become disoriented, he said. “Don’t challenge yourself,” Stachelski said. The last recorded heat-related death in the area was July 26, 2009; statistics for later than 2011 were not available. Most heat-related deaths involved people 60 and older. July is likely to have a “surplus of heat” as well, with a 38% chance for above-normal temperatures, Stachelski said. At the Furnace Creek Resort, there’s not much activity, Wegner said. Guests are staying by the pool and indoors. This weekend, the resort will have cool-down stations and misters out for visitors. For those going on day trips, Wegner said, remember that “nothing works in this kind of heat.” Cars overheat and cellphone service is limited, she said, so let someone know where you’re going and don’t go too far away. On the bright side, at least there’s no humidity, she said with a laugh. ALSO: L.A. Council extends LAFD plan to staff extra ambulances Prop 8: Gay marriages can resume in California, court rules Heat wave settles over Western U.S., bakes Southern California Start your day right Sign up for Essential California for news, features and recommendations from the L.A. Times and beyond in your inbox six days a week. You may occasionally receive promotional content from the Los Angeles Times. Follow Us Joseph Serna is the deputy editor of culture and talent at the Los Angeles Times and helps oversee its career training and recruitment efforts. Samantha Schaefer is a former producer and contributor to L.A. Now, the Los Angeles Times’ breaking news blog. California Oct. 25, 2023 California Oct. 25, 2023 California Oct. 25, 2023 California Oct. 25, 2023 California California Travel & Experiences Company Town Climate & Environment California Oct. 25, 2023 California Oct. 25, 2023 California Oct. 25, 2023 California Oct. 25, 2023 California Oct. 25, 2023 Subscribe for unlimited accessSite Map Follow Us MORE FROM THE L.A. TIMES ",
    "datetime": "2013-06-29T15:38:20",
    "url": "https://www.latimes.com/local/lanow/la-me-ln-extreme-heat-wave-has-california-broiling-20130629-story.html"
}