{
    "title": "Family of man killed by hit-and-run driver offering $10K reward",
    "text": "LOUISVILLE, KY (WAVE) - A $10,000 reward is now being offered in the case of a Louisville man who was leaving a music festival when he was killed by a hit-and-run driver in Brown County, Indiana. \"He loved music and he loved bluegrass,\" said Chad Demuth's stepfather, Bob Rice. His love for Bluegrass was the reason Demuth and his girlfriend attended the Bluegrass Music Festival at Bill Monroe Music Park on June 1. [PREVIOUS STORY: Investigators search for driver of deadly hit-and-run crash] Demuth's girlfriend left the festival early, so he started making his way out sometime after midnight. As he was walking southbound on Highway 135, Sheriff's investigators say a pick-up truck going the same way on 135 hit Demuth from behind, knocking him about 140 feet killing him. The truck was coming from the direction of Morgantown. Rice said, \"His mother is grieving immensely over a boy or a child that she will never be able to hug or kiss or get a Christmas card from.\" Evidence from the wreck suggested a two-door, full size 1988 to 1997 Chevy or GMC truck was involved. Previously, detectives didn't know what color the truck was, but new tests show either the truck or its bumper is black. They also said the truck likely has front end damage including the right headlight, the passenger door mirror and the possibly the windshield area. With more test results back on the truck, Demuth's family is now offering that $10,000 reward for information leading to the driver's arrest and conviction. \"Finding the perpetrators of this horrible deed will give some closure I'm sure,\" Rice said. \"It's not going to give complete closure, it will never heal,\" he added. \"A child dying before a parent is basically a crime against nature.\" Demuth was an Atherton High School graduate who attended JCTC and the University of Louisville. If you have information in this case you are asked to call Detective Scott Southerland at the Brown County Sheriff's Office at (812) 988-6655. Copyright 2014 WAVE 3 News. All rights reserved. ",
    "datetime": "2014-09-16T06:32:02Z",
    "url": "https://www.wave3.com/story/26539956/family-of-man-killed-by-hit-and-run-driver-offering-10k-reward/"
}