{
    "title": "Fans plan to welcome K-Pop group with haka - NZ Herald",
    "text": "Share this article B.A.P. has three No. 1s on Billboard's World Albums chart and an international fan club, including in New Zealand, where members are called \"Babyz\". File photo / Getty Images K-Pop fans are planning a mass haka to welcome the first K-Pop group to perform in New Zealand - against the wishes of the concert organisers. B.A.P., which stands for \"best, absolute, perfect\" will be the first to hold a concert here since Korean pop culture became a global phenomenon. Superfan Trezanah Monga MacCauley, 20, said the thousands of K-Pop fans here regard this as \"truly historic\" and felt a haka a culturally appropriate. \"A lot of fans are so keen to do a haka for them at the concert, but two weeks ago JK (Entertainment, the group's agents) said they didn't want us to do one because of health and safety reasons,\" Miss MacCauley said. \"We're upset, but some of us feel we should go ahead with it...it's something that the fans want to give, and we'll be printing the haka lyrics and handing them out ahead of the concert.\" Event local organising partner, HTV spokeswoman Diane Lee, confirmed that JK Entertainment did not want fans to perform the haka but did not say why. B.A.P. has three No. 1s on Billboard's World Albums chart and an international fan club, including in New Zealand, where members are called \"Babyz\". The South Korean sextet comprise of Yongguk and Himchan, both 26, Daehyun and Youngjae, both 22, Jongup, 21, and Zelo, 19. The show at the Trusts Arena tomorrow is part the group's Live on Earth 2016 world tour of 15 countries, which also includes Mexico, USA, Singapore, Russia and Australia. Paul Moon, Professor of History at AUT University's Faculty of Maori and Indigenous Development, disagreed that the haka was a health and safety hazard. \"Unless someone fell, or bumped someone else, then I can't see how it would be a specific health and safety concern,\" said Dr Moon. He said the role of haka has changed over the last few centuries, even within Maori communities. \"What we are seeing now is an acceleration in that rate of change, much of which is brought about by a combination of the impact of social media and New Zealand being one of the world's most ethnically diverse societies,\" Dr Moon said. Hundreds of fans, many from outside Auckland, are gathering at Albert Park today for a K-Pop meet-up ahead of the concert. Many others, like student Alicia Lee, 17, plan to be at Auckland Airport to greet their idols when they land at around 1.40pm. \"I've been listening to B.A.P.'s music online over and over again, for like a zillion times to memorize the lyrics,\" said Miss Lee. \"I still can't believe they're coming to New Zealand - it's crazy, and I just want to enjoy every bit of it.\" Korean pop music was leading a resurgence of Hallyu, or the Korean Wave, according to a report released by Victoria University this week. \"Neo-Hallyu, led by K-Pop, has an expanded fan base, including teens and those in their twenties, a demographic group familiar with the digital environment,\" said authors of \"Korean Wave: A Sourcebook\". \"The new Korean Wave is spreading through social media beyond Asia to every corner of the world, including the US, Europe and South America.\" Associate Professor Stephen Epstein, one of the editors of the book, estimated the number of K-Pop fans in New Zealand to be around 6000. Share this article ",
    "datetime": null,
    "url": "https://www.nzherald.co.nz/entertainment/fans-plan-to-welcome-k-pop-group-with-haka/D4YISB4DDUUA6TX42HDFYKCJJ4/"
}