{
    "title": "Father pleads for help to find missing son",
    "text": "MOUNT WASHINGTON, KY (WAVE) – The father of a 17-year-old from Ohio whose car was found abandoned on a Bullitt County hillside pleaded for help in the search for his son Tuesday. Ron Scheetz, whose son Billy Scheetz disappeared Monday, said doctors had diagnosed his son with depression. Billy had many friends and cared deeply about his church youth group and religion, his dad said. \"You see these stories all the time, and the first thing that comes to my mind is, 'This doesn't happen to me,'\" Ron Scheetz said. \"But it is happening to me and if you're (seeing this), he's not just another child, not just another number. He's a special person, and if you can do anything to help, I'd really appreciate it.\" About 10 people from the Bullitt County Sheriff's Office, along with local K-9 teams, searched an area off Bardstown Road, or Highway 31, just south of Mt. Washington. Crews suspended their search at 8 p.m. Tuesday because of darkness and the threat of bad weather. They expected to resume at 7 a.m. Wednesday. The Red Cross provided water to the crews, who got help from the Louisville Metro Police helicopter. \"People are worn out, it's been brutal out here, but we'll continue to search and see where it leads us,\" Bullitt County Lt. Scotty McGaha said. \"Nothing's been ruled out.\" A man checking his deer stand reported late Monday that a car had slid off a hillside and into a tree, McGaha said. Deputies didn't find Scheetz, but matched his car to a missing persons report his parents had filed early Monday morning. Scheetz is from Powell, Ohio, a Columbus suburb. Ron Scheetz said his son had talked about visiting The Abbey of Gethsemani near Bardstown, and thought he may have been following through on that idea this week. \"It wouldn't surprise me at all if that's what he wanted to do with his life,\" Ron Scheetz said. \"You just want your son to tell you that so (his parents) can help him get there a little bit easier.\" The police chief from Powell, Ohio, and a detective from that department drove to Kentucky to assist the search. They didn't find any sign of Scheetz at the monastery Tuesday. McGaha said people with information about the case should call their local law enforcement officials, who can access the case because of the missing persons report. Copyright 2013 WAVE 3 News. All rights reserved. ",
    "datetime": "2013-09-11T07:04:20Z",
    "url": "https://www.wave3.com/story/23398302/dad-asks-for-help-in-bullitt-county-search-for-missing-teen/"
}