{
    "title": "Fenomena Korean Wave pada Masa Pandemi: \"Semua Akan Kekoreaan pada Waktunya\" - Kompasiana.com",
    "text": "writing is a way of talking without being interrupted. Selanjutnya Tutup Korea Selatan memiliki berbagai budaya unik dan beragam yang berkembang secara meluas dan pesat menghasilkan beberapa istilah seperti Korean Wave, Hallyu Star hingga demam Korea. Popularitas hiburan dan konten kebudayaan yang menjadi komoditas ekspor utama Korea Selatan di negara-negara lain ini mencakup beberapa aspek, yakni musik (K-Pop), drama televisi (K-Drama), fesyen (K-Fashion), film, makanan, literatur dan bahasa. Situs Ministry of Foreign Affairs Republic of Korea menyebut fenomena Korean Wave atau Hallyu ini pertama kali muncul pada pertengahan 1990-an setelah Korea membangun hubungan diplomatik dengan Tiongkok pada tahun 1992. Setelah hal tersebut, K-Pop dan K-Drama mulai populer di tengah masyarakat Tiongkok. Di Indonesia sendiri, demam Korea dimulai sejak awal tahun 2000-an dengan hadirnya beberapa judul drama, seperti Winter Sonata, Endless Love, Full House, Boys Before Flowers, You Who Came From the Stars sampai Descendants of the Sun yang dinobatkan menjadi drama legendaris, sebab dapat menembus kancah internasional. Akhir tahun 2019, dunia dikejutkan dengan kemunculan varian virus baru COVID-19. Statusnya yang ditetapkan menjadi pandemi oleh Badan Kesehatan Dunia membuat seluruh aktivitas masyarakat di belahan dunia menjadi terganggu, tak terkecuali di Indonesia. Berbagai lonjakan kasus hingga kembali meledaknya serangan virus membuat pemerintah kembali melayangkan Pemberlakuan Pembatasan Kegiatan Masyarakat atau PPKM guna melemahkan kegiatan dan mobilitas yang berangsur-angsur kembali aktif.  Kembalinya kondisi masyarakat seperti saat awal mula pandemi mulai berlangsung membuat mereka cenderung membutuhkan hiburan untuk dilakukan saat menetap di rumah. Kebanyakan dari mereka kebingungan mencari cara untuk menghabiskan waktu dikala merasa jenuh atau bosan. Pasalnya pada situasi pandemi orang sulit mencari hiburan yang safety, berbeda dengan keadaan normal dimana siapapun dapat keluar kemanapun dan kapanpun tanpa perlu merasa khawatir dan risau. Di sisi lain, kegiatan seperti perkuliahan maupun pembelajaran daring masih tetap berjalan, belum lagi dengan pekerjaan yang masih harus dilakukan dari rumah (Work from Home).  Hal ini membuat Drama Korea (drakor) menjadi pilihan tepat dikala memerlukan pelarian dari segala rasa penat dan Lelah yang dirasakan. Selain menjanjikan, drakor dapat menjadi hiburan yang berkelanjutan alias tidak langsung selesai dengan beragam pilihan cerita menarik dan pastinya selalu membuat penasaran. Mulai dari alur cerita ringan, berat, fiksi, menginspirasi hingga berasal dari kisah nyata, menjadikan drakor tidak mudah membuat bosan sebab selalu menyajikan sisipan cerita unik di dalamnya. Terlebih lagi, pada setiap season episode yang ada tidak terlalu banyak dan tergolong memiliki alur cerita to the point tanpa bertele-tele. Uniknya, peminat drakor justru lebih antusias dan semakin bertambah pada masa pandemi. Salah satu komika sekaligus aktor, Kemal Palevi, membuat pengakuan dalam media sosial yang dimilikinya berupa pengunggahan salah satu poster drama korea, Itaewon Class beserta dengan caption \"Aduh kenapa jadi suka drakor\", tulisnya dengan imbuhan emoji menangis. Itaewon Class sendiri menceritakan tentang kisah Park Sae-Royi, seorang mantan narapidana yang kembali menata hidupnya dan berjuang meraih mimpi yang dimiliki setelah dikeluarkan dari sekolah karena melawan perundung. Akibatnya, kehidupan Royi berubah 180 derajat bahkan ia harus kehilangan ayahnya. Selain drama Itaewon Class, berikut beberapa rekomendasi drama untuk ditonton untuk menemani hari-hari disaat pandemi:Mouse.Law School.Move to Heaven.Vincenzo.Voice 4.Hospital Playlist 2.Doom at Your Service.Taxi Driver.Love Alarm 2.Love Revolution.Nevertheless.She Would Never Know.Youth of May.Penthouse 3.Devil Judge. REFERENSI:  liputan6 Diakses pada 7 Juli 2021 pukul 23.57 WIB. hipwee Diakses pada 7 Juli 2021 pukul 0.21 WIB. wowkeren Diakses pada 7 Juli 2021 pukul 0.46 WIB.  ",
    "datetime": "2021-07-08T01:31:55+0700",
    "url": "https://www.kompasiana.com/reginaphasya6763/60e5f2c21525103ddf09e623/fenomena-korean-wave-pada-masa-pandemi-semua-akan-kekoreaan-pada-waktunya"
}