{
    "title": "Festival taps into island craze for all things Korean | The Scoop | postguam.com",
    "text": "        Reporter        Since the 1990s, Hallyu, the Korean wave, a term used to describe the increase in global popularity of South Korean culture, has been taking over the world. From H.O.T. to Big Bang and Girls’ Generation to EXO, the reaches of K-pop have been international and immense. Korean dramas, cosmetics and cuisine have spread more widely in recent years, resulting in phenomena such as \"mukbangs\" and the growing international K-pop fan base, all on the back of the Hallyu wave. The island is no stranger to the phenomena and got a chance to share its love for all things Korean at the inaugural Korean Festival held Sept. 22 at the Gov. Joseph Flores Memorial Park in Tumon. It was organized by the Korean Association of Guam. KAG President Park Jae Moon said he had big hopes for the impact and outcome of the island's first festival, despite the rainy weather that lingered that day. “In the past, it’s been limited to mainly Koreans only. We hoped to do a festival that all kinds of people could attend, and that’s how it came to be the 1st Korean Festival,” Park said. “It’s been 40, 50 years since Korean people first began living on this island, but there’s never been a festival that both local and Korean people could attend and immerse themselves at,\" he said. \"We’re hoping that today will be the start of something new.” Excitement was in the air as several hundred people spent the day, engaging in K-pop or dining on Korean delicacies, many of them infused with a local palate in mind. Pika's Cafe and Royal Deli were on hand to showcase their wares. A kimchi-making competition allowed participants to test their skills. As a benefit, each contestant got to take the dish home to share. There were more than enough activities for every personality type. But, the longest lines were those seeking the most delicious korean delicacies at amazing prices. Royal Deli, a local Korean restaurant, was packed. Whether you ordered the kalbi or sesame chicken, the food was absolutely divine and at a good price, too. For just $10, guests could treat themselves to a plate of kalbi, rice or japchae and some papaya kimchi. Other vendors provided entertainment through festival games and photo booths. The smell of familiar Korean food and other delicacies mingling seemed to be the perfect complement to the mix of spoken Korean and English. The Korean Festival did not lack in fun activities for the children; there was a wide array of goodie tents for the playful kids to purchase some of the coolest new souvenirs and trinkets. Clear rainbow light balloons lit up the evening sky, dotting the festival grounds with bright spots of color. Children running and laughing seemed the perfect backdrop for a perfect night. Q’s Rental gave an even wider selection of enjoyment with a variety of cute toys and a hammer game where festival attendees could test their strength to win some awesome prizes. Later in the night, special performers took the stage, ranging from a pansori singer, which is a genre of traditional Korean music, to pungmul dancers. The much anticipated K-pop performance happened last, by Korean dance crew Hipxxi, currently active in South Korea as idol trainers. Among their most famous students is K-pop girl group Momoland. Kim Dahee, member of the Hipxxi dance crew, said, “It felt like we had come to a very unfamiliar place, but we were welcomed so warmly and kindly. Being on stage didn’t feel like a performance so much as it felt enjoyable and fun.” It’s no secret that K-pop has become a global phenomenon, and when festivalgoers were given the chance to show off their skills, they took it. Various teenagers and children of all ages stood on stage and danced to songs including Blackpink’s \"Ddu-du Ddu-du\" and \"Forever Young,\" Twice’s \"What is Love\" and Wanna One’s \"Energetic.\" “It was really enjoyable,” said festivalgoer Maria Maza. “I liked how it was local also, and I got to see some of my peers go up there and dance. And then we ended off with the K-pop performance and that was just great.” The 21-year-old University of Guam student added that she is looking forward to next year’s Korean Festival. “I came in here with no expectations,” she said, “And my mind was blown.” The inaugural Korean Festival managed to bring together aspects of Korean culture, ranging from Korean cuisine to K-pop. Though it was a new and unprecedented event, the outcome was excitement and a demand for more, reflecting the world’s current stance on the Hallyu wave.  Reporter   Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers: ",
    "datetime": null,
    "url": "https://www.postguam.com/island_life/the_scoop/festival-taps-into-island-craze-for-all-things-korean/article_077b0d8c-c052-11e8-b965-6bd229e48fca.html"
}