{
    "title": "Fidelity sued by employees over its own 401(k) plan ",
    "text": "Follow us: We're no longer maintaining this page. For the latest business news and markets data, please visit CNN\n            Business A group of current and former employees claim the plan is dominated by expensive Fidelity mutual funds when lower-fee options are available within Fidelity's own offerings and from other providers. Fidelity's employee retirement plan covers more than 50,000 participants and has roughly $8.5 billion in assets, according to court documents. An industry leader, Fidelity is the 401(k) provider for roughly 12 million workers across thousands of companies. The legal battle heated up earlier this month when 26 current and former employees signed on to join the proposed class action, which was filed by a former employee in March. Their request to join the suit is pending. Related: How much are 401(k) fees costing you? All of the more than 150 investment options available in the Fidelity plan were offered by Fidelity or a company subsidiary, according to the suit. And, at the end of 2010, nearly 85% of the plan's assets were held in actively managed Fidelity mutual funds, which tend to have higher fees than passively managed index funds. Fidelity has filed to dismiss the lawsuit, citing that its employees have a wide variety of investments to choose from -- including low-cost index funds. \"We believe the lawsuit is totally without merit, and we intend to defend vigorously against it,\" said spokesman Vincent Loporchio. \"Fidelity has a very generous benefits package that provides significant contributions to our employee's retirement planning.\" Fidelity provides a 100% match for up to 7% of a worker's salary and typically makes annual profit-sharing contributions as well, according to court documents. One of Fidelity's big competitors, TD Ameritrade, gets around potential conflicts of interest by outsourcing its 401(k) plan, the lawsuit said. The Fidelity complaint comes on the heels of a wave of 401(k)-related lawsuits against financial firms and other companies that allege mismanagement and inappropriately high fees. Related: Google, Southwest employees have a better 401(k) than you Under the federal Employee Retirement Income Security Act, companies with 401(k) retirement plans have a \"fiduciary responsibility\" to act in the best interest of their employees. In 2011, for example, Wells Fargo (WFC) agreed to pay $17.5 million to settle a class action lawsuit that alleged it had engaged in self-dealing when choosing investments for its 401(k) plan. In the same year, Wal-Mart (WMT) and Merrill Lynch settled a multimillion dollar lawsuit that alleged the Wal-Mart 401(k) plan had subjected its workers to excessively high fees. Most stock quote data provided by BATS. Market indices are shown in real time, except for the DJIA, which is delayed by two minutes. All times are ET. Disclaimer. Morningstar: Â© 2018\n\t\t\t\tMorningstar, Inc. All Rights Reserved. Factset: FactSet Research Systems Inc. 2018. All rights reserved. Chicago Mercantile Association: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor's and S&P are registered trademarks of Standard & Poor's Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Â© S&P Dow Jones Indices LLC 2018\n\t\t\t\tand/or its affiliates. © 2021\n\t\t\t\tCable News Network. A WarnerMedia Company. All Rights Reserved.Terms\n\t\t\t\tunder which this service is provided to you. Privacy Policy.\nDo Not Sell ",
    "datetime": null,
    "url": "https://money.cnn.com/2013/09/23/retirement/fidelity-lawsuit/"
}