{
    "title": "Former Papa John's employee charged with stealing nearly $75K in computer equipment",
    "text": "LOUISVILLE, KY (WAVE) - A Northern Kentucky man is facing theft charges for stealing nearly $75,000 in computer equipment from two businesses where he worked, Justin Mitchell Gilbert, 39, of Burlington, KY, was arrested Dec. 20 by Lexington, KY police on two warrants charging him with theft. >> MUGSHOTS: December 2017 Roundup One of the warrants says more than $50,000 in computer equipment was discovered missing from the Papa John's Data Center in Jeffersontown in September of this year while Gilbert was employed there. When employees started looking at the security video from that period they saw Gilbert in the room where the missing equipment was stored and using his key card to leave the building with the equipment. Gilbert was then seen re-entering the building using his key card, going back into the room and leaving the building with more equipment. The warrant says Gilbert suddenly quit several days later. MORE FROM WAVE3.COM+ Public Works employee killed in conveyor accident+ Kentucky deputy fatally shoots suspect past Tennessee line+ Man charged in Christmas morning drive-by shooting Gilbert is also charged with taking property from a data center in Kenton County, KY in November 2016. The warrant in that case says Gilbert resigned his position and returned the company property, but company officials realized that some things were missing. After a check, it was discovered that Gilbert had turned in a computer monitor that had been awaiting repair as the one he had been issued. Security video showed that Gilbert used his key card to get into a storage area, walk out with several large boxes and leave the building. An inventory check found several large IP computer switches, with a value of $24,400, missing. After originally being held at the Fayette County Detention Center in Lexington, Gilbert was booked into Louisville Metro Corrections on Dec. 22 but has since been released from custody. Copyright 2017 WAVE 3 News. All rights reserved. ",
    "datetime": "2017-12-28T00:20:21Z",
    "url": "https://www.wave3.com/story/37147631/former-papa-johns-employee-charged-with-stealing-nearly-75k-in-computer-equipment/"
}