{
    "title": "Fresh Korean Wave sweeping world, powered by Netflix hits  | The Asahi Shimbun: Breaking News, Japan News and Analysis",
    "text": "Skip to content Your browser does not support JavaScript, or it is disabled．Please check the site policy for more information. The Asahi Shimbun Asia & World Korean Peninsula article THE ASAHI SHIMBUN July 5, 2020 at 07:00 JST A scene from “Crash Landing on You,” a TV drama exclusively distributed by Netflix (Provided by Netflix) Even a beloved Japanese TV celebrity such as Tetsuko Kuroyanagi could be swept up in the new Korean Wave bringing TV dramas and other entertainment products to foreign shores. She commented on Instagram on the \"interesting\" South Korean TV drama \"Crash Landing on You\" while confessing that she \"binge-watched all the episodes without stopping.\" Led by the popularity of “Crash Landing on You” and “Itaewon Class,” both distributed by Netflix, titles from the country are reigniting the Japanese people’s interest in South Korean pop culture. They are being highly watched not only in Japan but also the Middle East, Southeast Asia and elsewhere in the world, partly due to their depiction of modern women, the national promotional campaign by Seoul, and stories that can be easily localized. Many posts praising the two South Korean dramas are uploaded every day on Twitter, describing them as “the only touch of color added to my self-isolated life,” while another Twitter user said the person has “watched it five times.” In “Crash Landing on You,” a South Korean woman from a financial conglomerate family crash-lands on North Korea in a paraglider accident, and falls in love with a commissioned officer of the reclusive state’s military. The work is filled with such factors as a huge industrial group, family feuds and other elements often featured in South Korean titles. Humor related to the clash of cultures and an emotional roller-coaster from the heart-tugging romance leave viewers spellbound and sets it apart. A star from “Winter Sonata,” a pioneering drama released in 2002 to crack open Japan’s entertainment market, makes an appearance in “Crash Landing on You” as well, adding to its appeal. Meanwhile, the protagonist of “Itaewon Class” is a young man whose life was ruined by a powerful family, and he challenges a huge restaurant chain with his friends. The drama adaptation of a popular online comic portrays a strong revenge motivation for his actions. When both titles were put out all over the world on the Netflix video streaming platform following their airing in South Korea, they quickly became two of the most popular works in the service’s ranking. After “Crash Landing on You” and “Itaewon Class” were successively introduced by the mass media in the Middle East, Southeast Asia and other regions, they made waves across the globe. NEW WOMAN IMAGE Behind the South Korean drama boom is the empathy of working women. All such works are centered on ambitious heroines who are strong enough to protect the men they love while living in their own style. Another characteristic of those series is that devious aspects of female characters as well as their good personalities are faithfully depicted. The heroines get the better of masculine men who do not want young females to participate in business operations. They also actively communicate with other women in local communities to obtain important information though doing so appears to be an exhausting task. The male protagonists respect the heroines’ autonomy and try to protect them so that their free-wheeling lifestyles will not be hampered. Yone Yamashita, a professor of South Korean culture and women’s studies at Bunkyo University, offered an explanation. “One trend of recent South Korean drama series is that the ways of women living in a down-to-earth manner are presented via the stories,” said Yamashita. “Their creators make the titles with that in mind.” This is in contrast to the way of melodramatic “Winter Sonata,” which captured the hearts of those middle-aged or older in the past. After the first South Korean entertainment boom ended due to soured ties between Tokyo and Seoul and other reasons, the K-pop fever flared up mainly among teens in the 2010s, underlining the fact that interest in South Korean culture constantly grow at some interval in Japan. In the latest boom, many of people posting their drama reviews on social networking sites are those in their 20s to 40s. Of these, working women who feel “exhilarated at the sight of decisive heroines,” in particular, positively view South Korean works. Those titles were marketed as an award was introduced in 1999 in South Korea to honor creations that contribute to gender equality. Working mothers, single-parent's families, gender inequality in households and other social issues, along with love affairs, are portrayed in many such stories. “The dramas show a society a step ahead of the reality, and characters appear in them who break down walls that women frequently face,” said Yamashita. “Viewers can easily relate to problems that overlap their own, so the programs are supported by a wide range of viewers even in Japan.” NATIONWIDE PROMOTION Various forms of assistance for the digital content industry are offered, greatly contributing to the remarkable achievements of pop culture from South Korea. Good examples of successful cases is the global popularity of K-pop singing group BTS and the “Parasite” film, which was recently chosen as the best picture in the Academy Awards. There appear to be no limitations to the spread of South Korean pop culture. Masaki Tsuchida, a film producer living in South Korea, noted that those achievements can be attributed to Seoul’s “nationwide efforts to nurture drama, movie and other industries while regarding them as important export businesses.” When he took office in 1998 in the wake of the Asian currency crisis, then-South Korean President Kim Dae-jung declared himself the “president of culture.” As Hollywood movies dominated the box-office lists throughout the world at the time, Seoul started financing content industries--including films and TV dramas--and developed legal systems to promote exports as part of its economic recovery strategy. Before that, TV plays from South Korea had already been widely accepted among broadcasters in Taiwan and Southeast Asia since the first half of the 1990s, because they were “much cheaper than their Japanese counterparts and comprised many installments.” Cashing in on the trend, the South Korean government strengthened promotion, leading to a further expanded market of dramas outside the nation. This also resulted in higher broadcasting rights fees and production budgets. Guaranteed salaries for new actors and scriptwriters rose as a result, attracting fresh new talent to the entertainment industry. In 2009, the South Korean government set up the Korea Creative Content Agency (KOCCA) to select online animated works and other creations popular among young consumers to be made into dramas and other adaptations. The KOCCA currently has locations in eight regions overseas, including fast-growing Indonesia, the United Arab Emirates, where South Korean products have exploded in popularity, and the United States. Through the establishments, it is attempting to sell titles suitable for markets through business discussions with the makers of video games, animations and dramas in the countries. Hwang Seon-hye, director of the KOCCA Japan Center, said “various kinds of content from South Korea” are now available. According to an estimate by the KOCCA, exports of dramas, films, video games and other such services totaled 1.056 trillion yen ($9.6 billion) in 2018, double the figure for 2012. EASIER TO LOCALIZE “Crash Landing on You,” “Parasite” and other titles set in situations peculiar to South Korea have proven popular abroad in some instances. But such dramas as “Itaewon Class,” which portrays young people combating economic disparity, are especially promising, because the localized versions of stories themed on universal issues can easily be created outside South Korea. The “Good Doctor” drama series released in Japan following the global hit of its U.S. version, as well as the “Signal” and “Voice” drama series aired in Japan, are all based on stories made in South Korea. Notching a total of more than 4.5 billion views across the world, the South Korean internet cartoon title “Tower of God” was converted into an animated adaptation jointly by Japan, the United States and South Korea. A Japanese TV drama developer is reportedly offering to make a new version of “Itaewon Class” set in Japan’s Roppongi district. “Japan has a well-established history as a great content creator, and has exceptionally high anime and drama-making abilities,” said Hwang. “We will collaborate with each other, not competing, to spread high quality products to other parts of the world.” (This article was written by Natsuki Edogawa and Erina Ito.) VOX POPULI: Drama depicts poignant divide between South and North Korea Fashion, K-pop fever fueling record trips to South Korea K-Pop stardom lures Japanese youth to Korea despite diplomatic chill Global K-pop fans emerge as political force, but some in S. Korea worry Seoul: North Korea blows up liaison office as tensions rise   Commuter ferry with a night view of central Tokyo begins service October 26, 2023 Wild boar caught after injuring man, 2 police officers in Chiba October 25, 2023 Maglev test ride offers a glimmer of train travel at 500 kph October 21, 2023  Visit this page for the latest news on Japan’s battle with the novel coronavirus pandemic.  Cooking experts, chefs and others involved in the field of food introduce their special recipes intertwined with their paths in life.  Here is a collection of first-hand accounts by “hibakusha” atomic bomb survivors.  The Asahi Shimbun aims “to achieve gender equality and empower all women and girls” through its Gender Equality Declaration.  Let’s explore the Japanese capital from the viewpoint of wheelchair users and people with disabilities with Barry Joshua Grisdale. In-house News and Messages BACK TO TOP Copyright © The Asahi Shimbun Company. All rights reserved. No reproduction or republication without written permission. ",
    "datetime": null,
    "url": "https://www.asahi.com/ajw/articles/13468714"
}