{
    "title": "From K-Pop To K-Drama: How Indian Teens Can't Get Enough Of The Korean Wave",
    "text": "No, you’re not imagining it — South Korean culture really is everywhere among GenZ, and you can see it in everything from their choice of entertainment to fashion. But why are teens suddenly obsessed with this small country in the Far East? What makes their fashion and skincare so appealing that it’s all the rage from Bangalore to Bilaspur? Let’s decode this phenomenon, and see what we can learn from it. Also Read: World's First Teenage-Positive App Is Changing How Kids Consume Content AFP It all began with strategic government initiatives spearheaded by the South Korean government way back in the 90s. The aim was to support creative industries to establish a presence as a soft power, both regionally and globally, to compete with the likes of the Japanese and British. This effort even led to the creation of a term to describe it — Hallyu, which loosely translates to Korean Wave. This wave began with K-dramas and K-pop across Asia, and has now become synonymous with street style-inspired fashion and unique skincare. The increased usage of YouTube and other social media among youngsters made it even easier for the wave to spread — all you needed was an internet connection. Now, South Korean culture is so popular, it’s almost a part of every teen’s daily life — from Netflix’s recommended shows to snail mucus face masks on the shelves of local cosmetics stores. South Korean culture is surprisingly similar to Indian culture, especially in areas like behaviour, manners, food etc. This makes it even easier for teens and GenZ to understand and absorb the culture and, by extension, its representation in media. So it’s no wonder then that words like Eonnie, Oppa, Aigoo, Daebak, Kamsahamnida, Annyeonghaseyo, and Saranghae have become as popular as Hindi or English slang. All of this makes indulging in K-dramas, with their love stories, family dynamics and drama almost as easy as watching the latest Indian saas-bahu serial. Not to mention, the surge in popularity of K-pop bands like BTS, BlackPink, and Twice has made all things Korea incredibly fascinating. In fact, K-pop stars have such ardent fans that brands are now using them to promote their products. Talk about merging culture and commerce! So it’s no wonder that youngsters are flocking to the brands that their favourite actors and pop stars are promoting. Rolling Stone Aside from entertainment, K-beauty is another big Korean export that teens and young adults seem to love — and it’s probably because they have seen its results for themselves in the flawless skin most popular Korean stars seem to flaunt. Healthy skin is highly valued in South Korea, often even more so than makeup, which means that they focus a lot on producing products to achieve that translucent look. Naturally, this has left a lasting impression on Indian youngster. Spinditty Teens and 20-somethings are, after all, usually strapped for cash. So when brands come along that give them high-quality fashion and skincare for cheap, you know the lines are going to be long. The booming textile industry and the availability of many traditional ingredients means that young shoppers have access to high quality clothes and skin care at a very affordable price point. This makes it a huge hit among youngsters. Proprofs Thanks to government subsidies for startups, many brands are owned or operated by young designers and entrepreneurs. This means that they churn out products that are youthful, fun, colourful, and therefore wildly popular among youngsters. Rather than having a few standard shapes, colours, silhouettes, or even products for standard skin types, South Korean products cater to all types of styles, needs, and desires. From dozens of face masks for the smallest of concerns to clothes that work for any aesthetic, South Korean brands are truly stepping up their game to compete with existing brands, and the effort seems to be paying off, given how many Korean brands we now see in our stores. These options tap into the psyche of these youngsters, who want to explore their style, try new things based on what’s trending, and don’t want to look, think, or act like their older counterparts. South Korea manages to tick all those boxes. With over 15,000,000 Hallyu fans in India, this isn’t just a passing phase — it really seems like South Korean culture and fashion is here to stay, and for good reason! And since teens are the tastemakers of the future, soon we’ll all be saying annyeonghaseyo to a lot more Korean brands! About the author: Vasavi Kandula, Co-Founder & Head of Growth, Uable (The social app for teens). Get the NEWS that fits your groove. Subscribe to Indiatimes Newsletter and get handpicked updates based on your interests! Connect With Us On ",
    "datetime": "Tue, 22 Mar 2022 06:00:44 GMT",
    "url": "https://www.indiatimes.com/entertainment/kpop-kdrama-wave-in-india-564526.html"
}