{
    "title": "G-Dragon, the Undisputed King of K-Pop, Takes New York | Vogue",
    "text": "To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. By Elizabeth Peng As you might suspect, Asia’s biggest megastar arrived with a bang in Brooklyn. The 28-year-old G-Dragon, formerly of K-pop boy band Big Bang, played Barclays Center amid his four-continent world tour, Act III, M.O.T.T.E., or Moment of Truth the End, a three-part performance chronicling the oeuvre of his solo career (which began in 2009) and the perpetual tension between his larger-than-life persona (G-Dragon) and his more introverted, actual self (Kwon Ji Yong). For the South Korean performer, who many have compared to Michael Jackson in terms of both talent and career arc, commanding the stage comes naturally. G-Dragon has been training for this moment for essentially his entire young life: working tirelessly among the lower rungs of the then-nascent Korean pop and entertainment industry in the 1990s and signing onto mainstream label YG Entertainment (LVMH is a current investor) in the early aughts. With Big Bang, G-Dragon and his bandmates—T.O.P., Taeyang, Seungri, and Daesung—went on to sell more than 140 million records, propelling themselves into superstar status both at home and throughout the rest of Asia and breaking records in Japan, Taiwan, and mainland China. The rest of the world soon took note. “I wasn’t trying to be famous when I started making music. I mean, that wasn’t the first thing I wanted,” G-Dragon told I-D in June. “But, of course, I see more and more people getting interested in Korean culture, and I’m so proud about it. I’m honored in a way. I love my country, so I’m more than happy to see it shine. It’s going really fast; there’s a good and a bad side to it, but I try to take the best of it. I still want to try new things so I can learn about them and then teach those things to younger people.” The rising tide of popularity of Korean pop music—consider the current prominence of Billboard-award winning bands like BTS—is also characteristic of a broader, cultural sweep known as hallyu, or the “Korean Wave,” a transnational flow of state-sponsored soft power in which music, television, fashion, beauty, aesthetics, and cuisine are all exported for ready consumption, giving birth to an enduring era of irrefutable Korean cultural currency. The effect of hallyu has not gone unnoticed: China’s government recently imposed a ban on K-pop stars, television dramas, and beauty products from entering mainland China as a retaliatory effort against the bilateral, U.S.–South Korean installation of the THAAD missile defense system. With the rise of the Korean Wave also came G-Dragon’s own staggering celebrity. A consummate breakout artist, he is known for his outré, gender-fluid fashions and slick, signature swag. His wide range of performance styles—rapping a lyrical verse one minute, singing falsetto sotto voce the next—perfectly captures the allure of K-pop’s unique synthesis: It’s part pop, hip-hop, and EDM, with the occasional interspersing of English words. Where K-pop really nails it, though, is with music videos, in which outsize outfits and non-narrative worlds of fantasy, fun, and intrigue converge—these are the blueprints that viral successes (think: Psy’s “Gangnam Style”) are made of. As the undisputed K-pop king, G-Dragon has not only transcended this label, but also his genre, and he does so by pushing boundaries and retaining a tightly drawn veil of mystique. It’s no wonder he has also captured the admiration of fashion’s elite, like designers Karl Lagerfeld, Hedi Slimane, and Jeremy Scott (he even began his own fashion line, PeaceMinusOne), and collaborated with such artists as Missy Elliott, Justin Bieber, Diplo, Baauer, Skrillex, and M.I.A. “I am going through an important phase in my life,” the musician recently told Hello Asia!. “Instead of focusing on showing a trendy new look and sound, I’ve worked on this album as if it’s my last.” A by-product of the wildly inventive K-pop process is that the music and the performance are always an amalgam of sorts. Because the content of his work isn’t rooted to a particular sense of place, culture, or time, G-Dragon is able to move around in new spaces and openings, sliding through the full-scale range of creative ingenuity and identity. Often deemed androgynous or gender-bending in a society that maintains traditional, patriarchal values and a noted adherence to manufactured beauty ideals (and plastic surgery), G-Dragon has no qualms sitting atop a white throne in an effete burgundy velvet smoking tuxedo with a matching choker and drop earrings, or crooning a ballad one minute and spitting rhymes among a scantily clad, all-female ensemble the next. “We are still hungry,” G-Dragon told I-D. “Korean people, including me, want to go faster and faster. In music, in fashion, in art, too. One shot, one kill: That’s my mentality.” His chameleon-like style and irrepressible persona continue to set hearts aflutter—his is an aura and aesthetic where, for some, it’s not merely enough to just aspire to date him, but to be him, as is the case of China’s latest K-pop inspired “boy band” Acrush, comprised of five handsome girls borrowing from his legacy and tableau. But G-Dragon, soon approaching mandatory inscription into South Korea’s military service, seems to have far evolved from the persona he helped to create, opting instead for the more introspective and grown-up man Kwon Ji Yong has become. This concert is “more like a present for myself,” the star told Hello Asia!, citing a desire to achieve “something meaningful” that he can recall fondly, a person who has made a real impact, and “I don’t want that person to be G-Dragon.” By Hannah Jackson By Hannah Jackson By Alexis Bennett Parker “Who am I?” G-Dragon asks the audience in a pretaped monologue during his second act at Barclays, a shiny sequined red kimono glistening as the camera playfully conceals his face—the audience, in suspense, hopes for the slightest reveal. The image cuts out as text appears. “Do you know who you are?” By signing up you agree to our User Agreement and Privacy Policy & Cookie Statement. By Kiana Murden By Laia Garcia-Furtado By Lisa Wong Macabasco By Karina Gonzalez Ulloa By Corey Seymour By David Graver More from Vogue See More Stories © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices CN Fashion & Beauty ",
    "datetime": "2017-07-31T15:24:40.747Z",
    "url": "https://www.vogue.com/article/g-dragon-act-3"
}