{
    "title": "Gangnam Squabbles: Why Asia's Pop-Music Superpowers Are Trading Disses - The Atlantic",
    "text": "As political tensions have heightened between South Korea, Japan, and China, so have tensions between musical fan bases. Korean pop has been under attack lately. Three days into January, Japanese news site CYZO ran a controversial article predicting that K-pop music, which had been a sales force in Japan for the last few years, would cease to be successful in 2013. CYZO spoke to several \"industry insiders\" who cited declining sales and lack of new Korean groups crossing over in Japan as signs of the K-Pop wave \"vanishing\" as early as this spring. A few weeks before, Jay Chou, a Taiwanese performer dubbed the \"father of modern Chinese pop music,\" called on Chinese performers to stop doing the Internet-beloved \"Gangnam Style\" dance. He urged fellow artists to not let the Korean wave overtake the Chinese wave, and in a subsequent interview said he did the famous \"horse dance\" first in 2007.  These incidents, among others, highlight the tense state of the Asian pop-music market in 2013. As relations between the big-three countries in East Asia suffer due to disputes old and new, a new dose of nationalism has been injected into the continent's pop landscape. \"Gangnam Style\" is a surprising viral video in other countries, but among music listeners in some parts of Asia it's being received more as a provocation. Japan's relationships with China and South Korea have long been strained, with many grievances stemming from World War II. But entertainers from all three countries have long been welcomed across Asia. Japan, boasting the world's second largest music industry behind the United State's, historically has held the most sway in the region. Japanese media has even had several boom periods in Korea. And last decade, Korean entertainers like BoA and TVXQ built big followings throughout Asia. Chinese performers also made their mark, with pop stars from the 1970s (Terese Teng) to the '00s (Faye Wong) becoming famous, even in the hard-to-break-through Japanese market. The balance of influence changed, though, with the \"Hallyu Wave,\" a term referring to the Korean pop-culture boom that gained steam in the mid 2000s. Spurred by the continental success of the aforementioned singers and of various Korean drama programs, \"K-Pop\" became a juggernaut in Asia , with groups like Girls' Generation and KARA dominating charts across the continent from summer 2010 to 2012. Popular Korean boy band Super Junior even created Super Junior-M, a Mandarin-speaking outfit made for the Chinese market and that has seen multiple No. 1 hits in a and Taiwan. The deluge of Korean media, particularly in Japan, wasn't met with completely open arms. Japanese actor Sousuke Takaoka was fired from his promotion agency in July 2011 after taking to Twitter to criticize the Fuji TV network for airing so many Korean dramas. The next month, a series of nationalist-tinged protests were held outside of Fuji TV, with thousands of people showing up to rally against the Korean wave. These anti-K-Pop sentiments carried over to the web, where users of message boards like the often-nationalistic 2chan further bashed Korean entertainment crossing over into Japan. In 2012, though, Japan's relations with China and Korea grew even more strained. A long-running dispute flared up in the Sea of Japan over the uninhabited Senkaku Islands (or Diayou in Chinese), which are claimed by both Japan and China, when China encroached on the territory and then-Tokyo Governor Shintaro Ishihara proclaimed he would buy the islands. The situation became so intense that violent anti-Japan protests erupted across China. A similar squabble broke out between Japan and Korea when as then-South-Korean President Lee Myung-Bak made a controversial visit to the disputed Liancourt Rocks. In Japan, the reaction to Myung-Bak's move was less in the realm of politics than it was in the realm of pop. Korean actor Song Il-guk had planned to make a trip to Japan last August, but after taking part in a swimming relay to the disputed territory, Japan's vice foreign minister said it would be difficult for the drama star to come to the country, and the network showing his drama cancelled the program. Political statements K-Pop stars made years before came under new scrutiny, with the group Girls' Generation getting grilled by Japanese fans and media for pro-Korea comments made at a concert three years earlier regarding the disputed islands. Staying silent also prompted rebukes, as popular six-piece KARA was slammed by Korean fans when its members remained mute about the dispute. Even though \"Gangnam Style\" didn't take off in Japan like it did elsewhere, that didn't stop netizens and CYZO from speculating that Psy's success was the result of Korean YouTube hacking. The biggest moment in this pop staredown happened in December at Japan's annual Kohaku Uta Gassen music show. Held every year since 1959, the New Year's Eve show features performances from the most popular singers of the past year. Foreign artists appear regularly—Cyndi Lauper and Paul Simon have guested before—and several K-Pop acts showed up in 2011. Yet this past year, the folks behind Kohaku invited no non-Japanese acts, and the omission didn't go unnoticed by fan sites or the mainstream media. The hostility goes both ways. Although Korea lifted the ban on Japanese pop culture years ago, the government still has rules limiting the broadcast of Japanese media. It remains illegal to air Japanese television programs or music over terrestrial channels. The J-Pop community in Korea, then, is very small. Several Korean media outlets spent the latter part of 2012 getting outraged about Japan's perceived pop transgressions—whether they be anti-Hallyu trends or just the fact \"Gangnam Style\" didn't take off there. At the start of this year, Korean netizens lashed out at J-Pop singer Kyary Pamyu Pamyu after she posed with the Imperial Flag of Japan in a New Year's card. Her side removed the image—aware that she will be performing in Seoul later this year. The renewed tension comes at a time when the region's balance of power is in flux. Japan used to be top dog both politically and culturally; now, China's a bigger player on the world stage and Korean entertainment draws more hype internationally. It also comes at a time of fierce competition for developing music markets in Asia. Southeast Asia has become a common tour stop for most of the big acts from all three East Asian nations, with Japanese pop act AKB48 going as far as to establish a sister group in Jakarta. Countries like Indonesia, Thailand, and the Philippines are growing economically, and the East Asian music industry sees opportunities for more money beyond what domestic markets provide. The coming months will be critical ones both politically and pop-wise for the region. The island disputes remain unsettled—recently, a Chinese navy frigate targeted a Japanese vessel with fire-control radar, although no missile was fired—and the relationship between China and Japan seems to be only becoming more frictional. The Chinese music scene, though, remains the least contentious at the moment, with the Jay Chou anti-Psy comments being the first of their kind. As China's entertainment industry continues to grow, though, that could change, especially with some observers saying that nationalism is on the rise there. As for Korea and Japan, a slew of high-profile K-Pop releases new and concerts are in the works, while a few Japanese acts like the aforementioned Kyary Pamyu Pamyu will travel to Seoul. Yet these won't just be international concerts, but rather events potentially clouded by politics in a tense region. ",
    "datetime": "2013-02-13T12:46:25Z",
    "url": "https://www.theatlantic.com/entertainment/archive/2013/02/gangnam-squabbles-why-asias-pop-music-superpowers-are-trading-disses/272847/"
}