{
    "title": "\r\n\tGaussian Beam - Definition and Parameters\r\n",
    "text": "We use cookies to enhance your experience. By continuing to browse this site you agree to our use of cookies.\r\n                        More info. A Gaussian beam is a beam of electromagnetic radiation with intensity distributions, and a transverse electric field represented by Gaussian functions. Gaussian beams are named after the physicist and mathematician Johann Carl Friedrich Gauβ. Following refraction by a diffraction-limited lens, a Gaussian beam is converted into another beam with a different set of parameters. The mathematical function representing the Gaussian beam is a resultant of the Helmholtz equation in paraxial form. This function is used to calculate the complex amplitude of the electric field of the beam. Gaussian beams are considered in conditions of small beam divergence, in order to apply paraxial approximation. A mathematical expression for the calculation of complex electric field amplitude of a monochromatic beam, propagating along the z-direction with wavelength λ, is given by: E(r,z) = E0[w0/w(z)] exp (-r2/w(z)2) exp (-i [kz – arctan z/zR + kr2/2R(z)]) where:\n     E0 = peak amplitude\n     w0 = beam radius\n     k = wave number = 2π/λ\n     zR = Rayleigh number\n     R(z) = radius of curvature of wavefronts. The geometry and nature of Gaussian beams are determined using a set of parameters, which includes the following: Gaussian modes are the lowest order modes of an optical resonator, set along the transverse direction. A stable resonator will have homogeneous optical media, and a flat or parabolic surface between the media. Hence, lasers in the fundamental transverse mode often emit beams close to Gaussian shape. Modes of high transverse order, on the other hand, are known as Laguerre-Gaussian, or Hermite-Gaussian, functions. Any deviation from a Gaussian beam shape can be estimated by the M2 factor. A Gaussian beam, having the highest beam quality, corresponds to M2 = 1. Do you have a review, update or anything you would like to add to this article? Cancel reply to comment The Velocity™ EBSD camera provides best indexing performance on real-world materials. Discover the NAN™ Electrophysiology focusing nosepiece microscope by Sutter instruments. The Total Absolute Measurement System (TAMS) unit allows you to choose the right detector for angular-dependent measurements of optical properties of thin and thick samples. Dr. Mustafa Kansiz In this interview conducted at Pittcon 2023 in Philadelphia, Pennsylvania, we spoke to Mustafa Kansiz, Director of Product Management and Marketing at Photothermal Spectroscopy Corp, about O-PTIR, a new and alternative infrared spectroscopy method. Professors Susmu Noda and Menaka De Zoysa In a new interview, AZoOptics talks with Professors Susmu Noda and Menaka De Zoysa about their research presenting a new nonmechanical 3D Lidar system. Dr. Quentin Meyer and Dr. Ying Da Wang In a new feature, AZoOptics talks with Dr. Quentin Meyer and Dr. Ying Da Wang about their novel technology that allows for superior imaging of hydrogen fuel cells. AZoOptics.com - An AZoNetwork Site Owned and operated by AZoNetwork, © 2000-2023 ",
    "datetime": "2014-01-06T04:26:00.0000000-05:00",
    "url": "https://www.azooptics.com/Article.aspx?ArticleID=702"
}