{
    "title": "\r\nGeopolitical feuds hamper Korean Wave in China",
    "text": "Most Popular G-Dragon booked for drug use South Korea, Qatar agree to elevate ties, forge $4.6b industry partnership Former Olympic hero battles rumors surrounding her groom-to-be S. Korea goes all out to contain lumpy skin disease Yoon pitches S. Korea's investment appeal to Middle East Yoon meets Park, honors father in gesture of conservative unity 4-meter deep sinkhole injures 1 in central Seoul [News Focus] A year after Halloween crowd crush, legislation remains stalled Olympic medalist ‘tricked’ by fiance-turned-stalker Braving wind and high water to celebrate Dokdo Day Start your day with a roundup of key stories from The Korea Herald with news and comment on all that’s happening in Korea. Published : Aug. 19, 2017 - 10:33 Link copied South Korea's entertainment industry was one of the biggest beneficiaries of the diplomatic normalization with China in 1992. Its pop songs, dramas and movies flooded into the once banned communist country, which has become the springboard for \"hallyu,\" or the growing popularity of South Korean popular culture. But they have recently emerged as a victim of politics. Korean showbiz faces the hardest time since entering China 25 years ago amid a raging anti-Korean sentiment and state restrictions sparked by ongoing diplomatic feuds over the deployment of a U.S. missile defense system in South Korea. The two Cold War foes established diplomatic ties on Aug. 24, 1992, opening the way for cultural exchanges between the two countries. China had its first taste of Korean pop culture in 1993, when the South Korean drama \"Jealousy\" was bought and aired by China's state-run CCTV. Since then, over 100 Korean TV series were broadcast in China, mostly to positive reaction.Hallyu, or the Korean Wave, hit its stride in China through TV shows during the early-to-mid 2000s with hit series such as \"Autumn Tale\" (2000) and \"Daejanggeum\" (2005). But the presence of Korean television shows later waned in China after Beijing imposed a cap on foreign TV dramas aired in the country.It wasn't until \"The Heirs,\" starring Lee Min-ho and Park Shin-hye, was made available via the online streaming platform iQiyi in 2013, that hallyu entered a renaissance phase. Lee became one of the most sought-out celebrities, appearing on \"New Year's Gala,\" one of China's premier television events on CCTV.Demand for Korean TV shows soared with the airing of \"My Love from the Star,\" a time-travel alien fantasy series starring Kim Soo-hyun and Jun Ji-hyun, and later skyrocketed with last year's \"Descendants of the Sun,\" featuring Song Joong-ki and Song Hye-kyo. Articles by Yonhap The Korea Herald by Herald CorporationCopyright Herald Corporation. All Rights Reserved.  ",
    "datetime": "2017-08-19T10:30:58+09:00",
    "url": "https://www.koreaherald.com/view.php?ud=20170819000030"
}