{
    "title": "German And U.K. Officials Warn Of A Possible New COVID-19 Wave In Europe : Coronavirus Updates : NPR",
    "text": "By Bill Chappell Parts of the European Union are at risk of a new wave of coronavirus cases, U.K. Prime Minister Boris Johnson says. The bloc began lifting many internal border restrictions last month. Here, airline passengers walk out of a departures area last week at Gatwick Airport, south of London.\n                \n                    \n                    Matt Dunham/AP\n                    \n                \nhide caption Parts of the European Union are at risk of a new wave of coronavirus cases, U.K. Prime Minister Boris Johnson says. The bloc began lifting many internal border restrictions last month. Here, airline passengers walk out of a departures area last week at Gatwick Airport, south of London. The European Union successfully flattened the curve of COVID-19 cases in the spring – but a second wave could be building in parts of the EU, according to both British Prime Minister Boris Johnson and the head of Germany's disease agency. \"I'm afraid you are starting to see, in some places, the signs of a second wave of the pandemic\" in Europe, Johnson said Tuesday. \"We don't know yet if this is the beginning of a second wave, but of course it could be,\" said Lothar Wieler, head of Germany's infectious disease agency, the Robert Koch Institute. His remarks were reported by Deutsche Welle. Wieler said he is \"very worried\" about a higher incidence of COVID-19 in many parts of Germany, blaming the rise on negligence. In its most recent situation report, the Robert Koch Institute said many cases are connected to people returning to work, having family celebrations and engaging in leisure activities. \"In the past two weeks there were more than 500 new cases a day, a slight uptick from the previous month, and local outbreaks have contributed to the rise,\" NPR's Rob Schmitz reported from Berlin. Both Johnson and Wieler said a second wave can be avoided if people take precautions such as wearing face masks, washing hands and maintaining physical distance. \"Everybody knows what the rules are,\" Johnson said. \"That's how we'll help ourselves.\" After being on a near-total lockdown in the spring, Europe has increasingly opened itself to travel this summer. Many internal border restrictions were lifted in June. As of July 1, the bloc is also allowing international tourists to visit from certain countries, depending on their epidemiological status. In a worrying sign, Europe's latest COVID-19 statistics show rising numbers in the 14-day average of coronavirus cases per 100,000 people. Spain's rate is now at 47 cases per 100,000 people, according to the European Centre for Disease Prevention and Control. Both Germany and the U.K. have identified Spain as a potential source of new cases due to its spike in transmission rates and its popularity with summer holiday travelers. The German foreign ministry is advising people not to visit the regions of Aragon, Navarra and Catalonia. The U.K. has taken a more formal step by imposing a 14-day quarantine order on anyone arriving from Spain. \"What we have to do is take swift and decisive action where we think that the risks are starting to bubble up again,\" Johnson said. Spanish Prime Minister Pedro Sánchez sharply criticized the British move, calling it an error and \"unjust\" during an appearance Monday night on national TV. The U.K. policy is misguided, Sánchez said, adding that Spain's spike in cases is concentrated in two territories in the northeast, while most of the country has a lower infection rate than both the U.K. and the EU. A graphic shows lab-confirmed cases of COVID-19 in the EU and the U.K., as of July 28. German and U.K. officials warn that the region could be seeing a second wave.\n                \n                    \n                    European Centre for Disease Prevention and Control\n                    \n                \nhide caption A graphic shows lab-confirmed cases of COVID-19 in the EU and the U.K., as of July 28. German and U.K. officials warn that the region could be seeing a second wave. The U.K. currently has more than 300,000 coronavirus cases – the most in Europe. Spain is close behind, with nearly 280,000 cases. Germany has around 207,000 cases. While the EU's most populous countries such as Germany, France and the U.K. are reporting case rates at or below 16 people per 100,000 people over the past 14 days, many of their close neighbors continue to struggle. Sweden's rate of new cases is nearly 35 per 100,000 people; Belgium's is nearly 30. Both Bulgaria and Portugal are reporting high rates – and Romania's is among the worst in the EU, at 66.7. The EU has roughly 116 million more people than the U.S. Taken along with the U.K., the European bloc is currently reporting nearly 1.7 million coronavirus cases — far less than the more than 4.3 million cases confirmed in the United States. Sponsor Message Become an NPR sponsor ",
    "datetime": null,
    "url": "https://www.npr.org/sections/coronavirus-live-updates/2020/07/28/896135038/german-and-u-k-officials-warn-of-a-possible-new-covid-19-wave-in-europe"
}