{
    "title": "GongCha Korea to acquire 70% stake in Taiwanese headquarters - 매일경제 영문뉴스 펄스(Pulse)",
    "text": "서비스 전체보기    By Kang Doo-soon and Seo Jin-woo [ⓒ Pulse by Maeil Business News Korea & mk.co.kr, All rights reserved] 1 Four North Koreans cross NLL in East Sea 2 Earth’s surface temp to be the hottest in 100,000 years in 2023 3 Korea’s GOPIZZA to enter U.S. markets with likely $10mn investment 4 SKT launches low-cost, high-efficiency cloud infrastructure 5 KTCU joins government accounting disclosure system 6 Korea signs $4.6 bn worth of MoUs with Qatar 7 SK hynix narrows Q3 losses by 38% on higher demand for high-performance chips 8 Hyundai Motor, IUCN collaborate on Vietnamese forest restoration initiative 9 Education investment efficiency in Kora declines over 10 years 10 Korea’s expected inflation rate rises again after 8 months 1 Samsung Card reports slight decline in Q3 net profit 2 Korean outdoor clothing maker Kolon Sport celebrates 50th an.. 3 Samsung Financial Networks awards 4 startups for creative id.. 4 Analysts cut target price for LG Innotek amid smartphone mar.. 5 GS25 to increase ATMs numbers at its stores to over 14,000 b.. 6 Satellite antenna developer Intellian aims to double revenue.. 7 Korea’s fashion, beauty industries integrate AI to offer new.. 8 Gov’t to enhance AI trustworthiness with watermarking 9 SKT-led consortium collaborates with Chungcheong for UAM ser.. 10 SK enmove, Hanwha Aerospace to develop thermal management te.. THURS 16.0℃ FRI 8/19℃ SAT 8/19℃ SUN 10/20℃ Receive occasional updates and special offers for Pulse占쏙옙s products and services. Receive occasional updates and special offers for Pulse’s products and services.  Unified EV charging service to become available nationwide in October LG CNS, Korea University join hands to foster AI data science talent Hanwha to join U.S. battery industry fair to promote EV equipment business Samsung Electronics’ Galaxy Z Fold 5 Thom Browne Edition sells out Hyundai Motor Group unveils sustainable hydrogen ecosystem Korea’s Industry Ministry discusses cooperation with Airbus Hyundai Glovis to attend Breakbulk Americas 2023 Kim Jong-un arrives at Khasan Station in Russia Korea-Saudi meeting draws farm, plant equipment manufacturers and buyers S. Korean space payload ready to join NASA’s Artemis project  1/10  pulse@mk.co.kr  ",
    "datetime": null,
    "url": "https://pulsenews.co.kr/view.php?year=2016&no=715995"
}