{
    "title": "GOP Wave to Sap Obama's Clout on Education",
    "text": "After midterm elections that vastly favored Republicans, President Barack Obama has far fewer allies in Congress and in states to champion his federal policy push on such priorities as teacher evaluation and common academic standards at a crucial stage in their implementation. At the state level, for example, the GOP surge means there will be more opponents of the Common Core State Standards in legislatures, and among state chiefs and governors, potentially threatening an initiative the Obama administration has backed with both money and regulatory incentives. At the federal level, the U.S. Senate—which will shift to GOP control in January—isn’t likely to pass a bill to reauthorize the badly outdated Elementary and Secondary Education Act that closely resembles the administration’s vision in areas like accountability and teacher quality.  With both chambers in Republican hands, the 114th Congress also is unlikely to give Secretary of Education Arne Duncan much more money for the kinds of competitive grants that have helped him carry his agenda forward—leaving the U.S. Department of Education running short on political carrots. “The Obama administration has to rethink its whole approach,” U.S. Rep. John Kline, R-Minn., the chairman of the House education committee, said in an interview this week. “Now, if he wants to get anything done, he needs to talk with us.” For his part, Mr. Obama said he plans to reach across the aisle. “The United States has big things to do, and we will make progress if we work together,” the president said in a Nov. 5 press conference. He listed issues including early-childhood education and college access as potential starting points for negotiations with the new Congress. But Congress isn’t likely to be the only roadblock for the administration. Secretary Duncan also doesn’t have much juice left to work his will on states looking to receive waivers from provisions of the No Child Left Behind Act, the current version of the ESEA. That process offered more than 40 states and the District of Columbia relief from the much-maligned law if they adopted administration priorities in areas like tougher teacher evaluations, rigorous standards and aligned tests, and aggressive tactics for school turnarounds. State schools chiefs will have far fewer qualms about dismissing Mr. Duncan and his team, with whom they’ve had to negotiate the finer points of accountability systems, said Vic Klatt, a former longtime aide to Republicans on the House education committee who is now a principal at the Penn Hill Group, a government-relations firm in Washington. “I think it’s going to be very tough for them going forward,” he said of Education Department officials. “States are going to feel much more comfortable ignoring the secretary and his staff on a whole range of issues.” Still, Mr. Klatt wouldn’t count the administration out, particularly on ESEA reauthorization. If any bill is get to the finish line, the White House and Senate Democrats will have to be on board, he said. What’s more, the administration still has some regulatory arrows in its quiver, including the waiver-renewal process, and the ability to issue guidelines on everything from teacher training to for-profit colleges. In a sign of the Obama administration’s already-waning clout at the state level, candidates for state schools chief who came out swinging against the common core generally trumped opponents who embraced the initiative. Opponents of the standards prevailed in state chiefs’ races in Georgia, Oklahoma, and Wyoming, and in Arizona, the Republican, also a common-core opponent, was leading as of Thursday morning.  The common core was initially developed by a bipartisan cadre of state chiefs and governors. But the Obama administration promoted the standards through its Race to the Top grant program, and its No Child Left Behind waivers. President Obama even took credit for them on the campaign trail in 2012, giving the standards a decidedly blue, Democratic tint—and prompting a backlash. Still, supporters of the standards don’t see the midterm elections as a major blow to the effort. “I feel pretty good,” said Chris Minnich, the executive director of the Council of Chief State School Officers, which spearheaded the common-core initiative along with the National Governors Association. He noted that more than 40 states are still advancing the standards. “I thought [the common core] could have been a factor in many more races,” he said. “They were talking about many other things.” The Obama administration also is unlikely to get much help on key priorities from some of the Democrats who were elected this week. In California, for example, Tom Torlakson, the teachers’-union-backed incumbent in a closely watched race for state superintendent, beat back a strong challenge from Marshall Tuck, a former president of the Green Dot Public Schools network of charter schools in Los Angeles.  California has been something of thorn in Secretary Duncan’s side. Mr. Torlakson and the president of the state school board, Michael Kirst, refused to write an NCLB waiver application that conformed to the administration’s vision of teacher evaluation. And the chief deputy state superintendent, Richard Zeiger, has been openly celebrating California’s decision to stay out of the waiver process. By contrast, Mr. Tuck, who had the support of groups that have strongly backed some of President Obama’s policies—including Democrats for Education Reform, or DFER, a high-profile political action committee—said the Golden State should have played ball with the Education Department on waivers. Still, Mr. Tuck’s supporters see the close race—the two candidates were separated by just a few percentage points—as a sign that issues such as rethinking teacher tenure and expanding charter schools can play well at the ballot box. And they see the momentum behind such policies as a big part of the Obama legacy. “The messages do matter,” said Joe Williams, the executive director of DFER. “The moment President Obama emerged as a leader, it made it a lot easier in statehouses and in mayor’s offices from coast to coast to have a lot of these conversations.” For their part, Republicans who are active on education issues see reason for optimism in 2016, given the sheer number of governors with prominent records on K-12 policy who are plausible contenders for the GOP presidential nomination. Potential GOP candidates who fit that bill include Gov. Scott Walker of Wisconsin, a foe of teachers’ unions and a champion of school choice who was easily re-elected this week; Gov. Chris Christie of New Jersey, who has worked with Democrats on teacher-quality issues; former Florida Gov. Jeb Bush, a big supporter of the common core and school choice; and Gov. Bobby Jindal of Louisiana, who has made headlines recently for his opposition to the standards and his support for private school vouchers.  “It’s not just ‘Republicans did well,’ ” said Andy Smarick, who served in the U.S. Department of Education during President George W. Bush’s tenure, and as deputy state education commissioner in New Jersey and is now a partner at Bellwether Education Partners, a nonprofit consulting group in Washington. “It’s ‘Republicans who care deeply about education and have records did well.’ ” “I can’t remember a time when there was a deeper bench of Republicans who could run for president who have that credential.” Staff Writers Lauren Camera and Andrew Ujifusa contributed to this article.A version of this article appeared in the November 12, 2014 edition of Education Week as GOP Electoral Wave Expected to Roil K-12 Policy Waters ",
    "datetime": "2014-11-06T20:24:33",
    "url": "https://www.edweek.org/policy-politics/gop-wave-to-sap-obamas-clout-on-education/2014/11"
}