{
    "title": "Grand champion ham sells for $600K as protesters target Kentucky Farm Bureau breakfast",
    "text": "LOUISVILLE, KY (WAVE) – The Kentucky State Fair's grand champion country ham sold for $600,000 at the 53rd annual Kentucky Farm Bureau (KFB) Country Ham Breakfast and Auction. It was purchased by Central Bank President Luther Deaton Jr. The ham from Broadbent B&B Foods weighed a little more than 17 pounds. That works out to approximately $35,294 a pound. Country ham, eggs, biscuits, fruit and red eye gravy filled the plates of the 1,600 breakfast attendees who had to pass about 50 protesters from the Fairness Campaign, the American Civil Liberties Union of Kentucky, the Jefferson County Teachers Association, and Louisville Showing Up for Racial Justice. >> PREVIOUS STORY: Yarmuth to join Kentucky Farm Bureau protest \"The Farm Bureau's big on discrimination,\" one protester said. \"They lobby on anti-union, anti-LGBT policies and anti-teacher policies.\" The Fairness Campaign and others have protested the KFB Country Ham Breakfast in the past, but Congressman John Yarmuth joined them this year. \"I've protested quietly with them, asking why are they (KFB) persistent in having these policies that have absolutely nothing to do with agriculture,\" Yarmuth said. \"I agree with many of the policies that the protesters are protesting, and I've publicly opposed many of the policies that are in the Farm Bureau's manual\" \"If the Kentucky Farm Bureau doesn't change their discriminatory policies, this won't let up,\" Fairness Campaign Director Chris Hartman said. Sen. Rand Paul addressed the protest during his speech at the breakfast. \"We've got to have tolerance on both sides,\" Paul said. \"The other side just wants to tell us that we have to give up on everything we believe in. What about the other side tolerating Christians who believe in traditional beliefs?\" After the breakfast and political speeches, it was all about the ham. Deaton said the money from his winning bid will be dispersed to several organizations: \"UK Athletics, UK Gatton School of Business, UK Hospital, Sunrise Children's Home, God's Pantry and Kentucky Community and Technical College.\" Traditionally, the auction proceeds benefit the winner's Kentucky charity of choice. Deaton said it's important to give back to the community. Copyright 2016 WAVE 3 News. All rights reserved. ",
    "datetime": "2016-08-25T20:23:03Z",
    "url": "https://www.wave3.com/story/32841108/grand-champion-ham-sells-for-600k-as-protesters-target-kentucky-farm-bureau-breakfast/"
}