{
    "title": "Grand Wave K-pop Music Festival 2022: Everything we know about the Malaysia concert",
    "text": "From legendary to trendy, the lineup of K-pop idols for the Grand Wave K-pop Music Festival 2022 in Malaysia is an interesting one. The event will give Malaysian K-pop fans a chance to see their favorite idols perform their respective recent hits live. The coveted music festival is all set to be held in November 2022. The lineup for the event was released recently, along with other details such as venue and time. Ticketing details are not out yet, but fans can expect it to drop anytime soon. From Girls’ Generation’s Hyoyeon to B.I, seven artists have been announced as the festival’s lineup. There has been no further confirmation if more artists will be announced or not. Fans are naturally excited about catching their favorite K-pop artists take over the stage and perform their hit songs in front of them. On October 10, Grand Wave Malaysia revealed the artists who will be joining the much-anticipated Grand Wave K-pop Music Festival 2022. The lineup includes: With B.I continuing his takeover of the internet with viral song BTBT (feat. DeVita) to EXO’s CHEN reaffirming his status as one of the most successful idols at the recent Best of Best Bangkok concert, and Park Bom reuniting with 2NE1 for a legendary Coachella performance, these K-pop artists have continued to thrive in some exciting ways. Fans can expect these artists performing their latest or most iconic songs. Since they all will share the same roof at the Grand Wave K-pop Music Festival in Malaysia, fans are ecstatic for the possible idol interactions they might get on the day of the concert. The music festival will be held at Sunway Lagoon Surf Beach on November 19, 2022, which is one of the most popular tourist and amusement sites in the country. Sunway Lagoon has a range of designated spaces that suit every person’s desires, right from theme amusement and water parks, to a Nickelodeon Lost Lagoon. Concert organizers are yet to open tickets for the K-pop festival. Since the lineup is already out and the event is only a month away, Grand Wave will announce ticketing information in the coming weeks. Additionally, November and December will be interesting months for Malaysian K-pop fans as it is packed with several K-pop concerts and tours. For the next month, there are plenty of events on radar, such as the Korea Fest from November 6-11 and MOKKOJI KOREA on November 12-13. December will see Epik High, DPR, and GOT7’s Jackson Wang performing their hits and meeting fans on their respective tours. Quick Links   ",
    "datetime": "2022-10-10T13:48:06+00:00",
    "url": "https://www.sportskeeda.com/pop-culture/news-grand-wave-k-pop-music-festival-2022-everything-know-malaysia-concert"
}