{
    "title": "Gravitational Waves: Did Merging Black Holes Form from Single Star? | Space",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works.  Could a single, dying star give birth to not one, but two black holes? Stranger things have happened in space. About 1.3 billion years ago, two black holes merged into one, creating ripples in the fabric of space-time known as gravitational waves. Those ripples were recorded by detectors on Earth, scientists announced on Feb. 11 — the first time gravitational waves had ever been directly detected, marking a significant achievement for physics and astronomy. Scientists have long held different ideas about how black holes of this size get close enough to collide, but another proposal has just entered the ring: that the black holes were created, shortly before their collision, from one, massive star as it was collapsing in on itself. [No Escape: Dive Into a Black Hole (Infographic)] This new hypothesis posits that the merger of these two black holes would produce light — including, possibly, a burst of gamma-rays, the highest-energy form of light. That possibility is now under investigation by scientists, who are following up on the historic gravitational-wave detection in a variety of ways. \"It's the cosmic equivalent of a pregnant woman carrying twins inside her belly,\" astrophysicist Avi Loeb, of the Harvard-Smithsonian Center for Astrophysics (CfA), said in a statement, talking about his proposal that two black holes can form out of the same dying star. The internal furnace of a massive star is powered by the fusion of hydrogen into helium, but even stars run out of fuel eventually. When a massive star (tens of times larger than the sun) reaches the end of its resources, it will explode as a supernova. With no engine pushing the star's remaining material outward, that matter will collapse down into a superdense, leftover nugget. Sometimes, this collapse forms a black hole. But Loeb's new paper, which has been accepted for publication in The Astrophysical Journal Letters, shows that if the star is spinning extremely rapidly as it collapses, the infalling material could split into a dumbbell configuration, and create two black holes. It was Albert Einstein who first predicted that space and time together make up a single cosmic fabric, and that two black holes spinning around each other and merging would not only bend that fabric, but also send ripples through it. For decades, scientists have tried to detect these ripples directly, but the first team to succeed was the Laser Interferometer Gravitational Wave Observatory (LIGO) group, which used big detectors in Hanford, Washington, and Livingston, Louisiana. Both detectors spotted the gravitational-wave signal in September 2015, and the LIGO team vetted the find for five months before announcing it to the world. Loeb told Space.com in an email that researchers have investigated the dumbbell process in other contexts. That includes star formation, in which a cloud of dust collapsing down to form a star could be spinning fast enough to split into two new stars. \"I had this idea in my head for about a decade,\" Loeb said. But he said it was the Feb. 11 announcement of the black hole collision that inspired him to put the hypothesis down on paper — that, and the possible detection of a bright burst of light from the same region of the sky. Living up to their name, black holes don't radiate any kind of light. However, many black holes can be \"seen\" because they are surrounded by material that is accelerated and heated by the black hole's gravity, causing the matter to emit light. But two black holes with masses a few tens of times that of the sun are not expected to be surrounded by material as they circle around one another and eventually collide. Loeb's hypothesis offers a possible case in which the two black holes could release a gamma-ray burst. Gamma rays are the highest-energy form of light, and gamma-ray bursts are caused by very energetic events. The bursts can occur when a single star collapses into a black hole, Loeb said. \"In order to produce a gamma-ray burst, one needs to feed a black hole at an enormous rate of somewhere between the mass of a planet and the mass of the sun every second,\" Loeb told Space.com. As a star begins to collapse into a black hole, the \"infall of matter … can lead to the production of a jet that drills a hole through the envelope of a star and produces a gamma-ray flash for an observer that happens to lie in its direction.\" Assuming the dying star could split into two black holes, it follows that such a star might also produce a gamma-ray burst. Thankfully, a gamma-ray telescope was looking at the sky at the same time that LIGO detected the black hole collision. Scientists with NASA's Fermi Gamma-ray Space Telescope announced that the space-based observatory may have seen a flash of gamma-ray light \"in the same region of the sky\" as the LIGO detection, only 0.4 seconds after LIGO detected its signal. Fermi scientists are still working to confirm whether the signal was real, or if it was a false alarm in the detector. [Record-Breaking Gamma-ray Burst Capturedby Fermi (Video)] \"I think that the Fermi/GBM detection is unlikely to be real (there are a variety of objections floating around the community),\" Edo Berger, a professor of astronomy at Harvard University, told Space.com in an email. \"This does not mean that Avi's paper is wrong (since it is just a theoretical model),\" Berger added. \"But right now there are no specific tests of the proposed model. Whether the process he's suggesting actually happens in nature remains to be seen with future observations. Luckily, LIGO and Virgo will find many more of these binary black hole mergers when they turn on for the next science run.\" Virgo is a facility in Italy that will soon join the LIGO detectors in the search for gravitational waves. And even if the Fermi detection was real, there's still a question of whether or not the gamma-ray burst came from the black hole merger. LIGO can currently only narrow down the location of the merger to an area on the sky measuring 600 square degrees. (The full moon covers 0.2 square degrees of the sky). \"I am rather doubtful that the Fermi report is indeed associated with the [gravitational wave] source; it is of relatively small statistical significance, and the sky patch associated with the [gravitational wave] source is huge,\" Vicky Kalogera, a black hole scientist at Northwestern University in Illinois and a member of the LIGO team, told Space.com in an email.  Kalogera also wondered why only gamma-rays would be detected if the black hole merger created light, she said. Other instruments searching in different wavelengths did not see a signal at the same time as the gravitational wave detection. There is still the possibility that the Fermi signal was real, and that it did indeed come from the black hole collision. But even if this particular black hole event wasn't an example of Loeb's dumbbell hypothesis, he said there could be other events that LIGO detects in the future that involve twin black holes, born from the same stellar mother. [Editor's Note, Feb. 26, 2016: It's looking more and more like the Fermi detection was a false alarm. If the signal were real, then the INTEGRAL gamma-ray observatory should have detected it as well. The collaboration has reported, however, that it did not.] [Editor's Note, April 19, 2016: The plot thickens. The Fermi collaboration has published a paper about the signal it detected, and the likelihood that it was associated with the gravitational wave event. Read more about it here.] Follow Calla Cofield @callacofield. Follow us @Spacedotcom, Facebook and Google+. Original article on Space.com. Join our Space Forums to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at: community@space.com. Breaking space news, the latest updates on rocket launches, skywatching events and more! Calla Cofield joined Space.com's crew in October 2014. She enjoys writing about black holes, exploding stars, ripples in space-time, science in comic books, and all the mysteries of the cosmos. Prior to joining Space.com Calla worked as a freelance writer, with her work appearing in APS News, Symmetry magazine, Scientific American, Nature News, Physics World, and others. From 2010 to 2014 she was a producer for The Physics Central Podcast. Previously, Calla worked at the American Museum of Natural History in New York City (hands down the best office building ever) and SLAC National Accelerator Laboratory in California. Calla studied physics at the University of Massachusetts, Amherst and is originally from Sandy, Utah. In 2018, Calla left Space.com to join NASA's Jet Propulsion Laboratory media team where she oversees astronomy, physics, exoplanets and the Cold Atom Lab mission. She has been underground at three of the largest particle accelerators in the world and would really like to know what the heck dark matter is. Contact Calla via: E-Mail – Twitter Strange anomaly in sun's solar cycle discovered in centuries-old texts from Korea China is building the world's largest underwater telescope to hunt for elusive 'ghost particles' The moon may be 40 million years older than we thought, Apollo 17 samples suggest By John LoefflerOctober 21, 2023 By Patrick PesterOctober 21, 2023 By Brett TingleyOctober 21, 2023 By Brian JacksonOctober 21, 2023 By Mike WallOctober 21, 2023 By Mike WallOctober 20, 2023 By Jeff SpryOctober 20, 2023 By Robert LeaOctober 20, 2023 By Robert LeaOctober 20, 2023 By Keith CooperOctober 20, 2023 By Samantha MathewsonOctober 20, 2023 Space is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. ",
    "datetime": "2016-02-25T12:39:03Z",
    "url": "https://www.space.com/32041-gravitational-waves-two-black-holes-one-star.html"
}