{
    "title": "Greg Long of San Clemente Accepts $100K Prize at WSL Big Wave Awards | Dana Point Times",
    "text": "By Andrea Swayne The 16th annual World Surf League Big Wave Awards rose to greater heights this year thanks not only to the daredevil athletes brave enough, and highly skilled enough, to ride the world’s most monstrous waves, but also to the El Niño weather pattern that delivered new challenges throughout the winter season. The event was held, once again, at the Grove Theater in Anaheim on Saturday, April 23, complete with a Hollywood-style red carpet. Returning to the top, Greg Long of San Clemente was officially crowned the 2015/2016 WSL Big Wave World Tour champion, his second world title, having also won in 2012. A highlight of the evening was his trophy presentation, which came along with the largest prize of the night—a $100,000 payday Long earned by making the finals at event No. 2, Todos Santos in Mexico, and then clinching the series in February at event No. 3 with an amazing performance at Jaws during the Pe’ahi Challenge in Maui, Hawaii. In his acceptance speech, Long expressed his sincere appreciation to the sport that has allowed him to follow his dreams—surfing, traveling and meeting so many “incredible and inspiring people.” “At the end of every winter I say, ‘How does it ever get bigger or better,’” Long said. “I know that I’m around the most incredible people in the world. This sport is only going forward to greater heights.” Long was also nominated for two Big Wave awards, Barrel of the Year and Overall Performance of the Year. Long’s Barrel of the Year nomination was earned via a gargantuan barrel he conquered at Jaws—the ride that ultimately clinched his world title. But when the final announcement for the category was made, so was history: For the first time ever, a woman competing on equal footing with the men came away with the award. Hawaiian Keala Kennelly claimed this year’s Barrel of the Year award for a ride at Teahupoo in Tahiti. As she accepted her award, Kennelly gave a shout out and gave thanks to everyone who ever told her she couldn’t do something because she is a woman. The Men’s Overall Performance Award was given to Shane Dorian (Hawaii), along with Ride of the Year honors. Long, who came in third for Overall Performance this year, previously won Ride of the Year in 2014. Hawaiian Aaron Gold won the Best Paddle Award and set a new Guinness World Record for paddling into a massive 63-foot wave at Jaws. The Women’s Best Performance Award went to Brazilian Andrea Moller and the XXL Biggest Wave Award went to Yuri Soledad (Hawaii) for a 73-foot ride at Jaws  DP Times Daily\nGet important news and updates delivered straight to your inbox. Sign up here. Subscriptions\nDon’t get the DP Times delivered to your home? Subscribe today. Advertising\nGet new customers and drive traffic to your business. Advertise with us. Support Local Journalism\nFor less than the cost of a couple of cups of coffee a month, become an “Insider” member and continue to get “Local News You Can Use” from the only independently owned, dedicated local news organization in South Orange County. Contribute today. Picket Fence Media is a proud member of the SoCal Media Network. © 2023 Picket Fence Media © 2023 Picket Fence Media ",
    "datetime": "2016-04-30T01:36:36-07:00",
    "url": "http://www.danapointtimes.com/greg-long-of-san-clemente-accepts-100k-prize-at-wsl-big-wave-awards/"
}