{
    "title": "Guwahati girl wins best vocal award at K-POP World Festival - Hindustan Times",
    "text": "Subscribe Now! Get features like At a time when thousands of boys and girls across India are busy auditioning for music and dance reality shows, Priyanka Mazumdar chose to take a different route. Instead of singing in Assamese, her mother tongue, or in Hindi and English, the Guwahati resident decided to sing ballads in Korean. Her passion got rewarded at Changwon in South Korea recently. Priyanka won the Excellent Vocal award at this year’s K-POP World Festival which concluded on September 30. She defeated contestants from 65 other countries and bagged 3,000,000 Won (Rs 1.81 lakh approx.). “My victory shows that one shouldn’t get dissuaded to choose a different path. I persisted with what I loved doing and won,” she told a local news channel on her arrival in India after the contest. K-POP World Festival is organized by South Korea’s foreign affairs ministry along with Korea Broadcasting System and Korean Culture and Information Service to promote Hallyu (Korean Wave). Hallyu or Korean Wave is the phenomenon of Korean entertainment and popular culture like pop music, TV dramas and movies becoming popular worldwide in the past two decades. Preliminary competitions are held in many countries where thousands of contestants take part in song and dance competitions in a bid to represent their countries in the final event at Changwon. The festival is held annually since 2011. This year, 13,000 participants took part in 65 countries. Fifteen teams and individuals were selected from 15 countries for the finals. Priyanka was chosen to represent India after she defeated participants from across the country at a national finals held in August. North-east is considered the heart of Korean Wave in India. Korean songs, movies and fashion styles are followed closely by many youths in the eight states of the region. Priyanka Mazumdar performing K Pop finale in Delhi: Utpal is a Senior Assistant Editor based in Guwahati. He covers seven states of North-East India and heads the editorial team for the region. He was previously based in Kathmandu, Dehradun and Delhi with Hindustan Times. ...view detail   ",
    "datetime": "2016-10-03T16:15:22+05:30",
    "url": "https://www.hindustantimes.com/music/guwahati-girl-wins-best-vocal-award-at-k-pop-world-festival/story-9nbmMizHEwHxs9yseYRd5M.html"
}