{
    "title": "Hallyu! The Korean Wave at the V&A is an unflinching look at the country's creative rise",
    "text": "Lecturer in Korean Studies, University of Sheffield Sarah A. Son does not work for, consult, own shares in or receive funding from any company or organisation that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.  University of Sheffield provides funding as a founding partner of The Conversation UK. View all partners The Hallyu! exhibition at London’s Victoria and Albert Museum offers an insight into everything the Korean Wave has offered up over the past 25 years, fulfilling its promise to showcase “Korean creativity at its finest”. The term Hallyu (Korean Wave) was first coined by Chinese audiences of Korean television dramas in the late 1990s and describes the force with which Korean cultural content has been promoted abroad. This exhibition is not just about Korean popular culture and how it developed, it is also a powerful testament to how extensively this cultural output is now consumed globally. It celebrates the recognition won by a country that overcame adversity during much of the 20th century by deploying a clever and massively successful cultural marketing strategy. With government backing, leaders in the creative industries have pushed into the international market, winning Oscars and Emmys and Grammy nominations in the process. This vigorous self-promotion has been audacious, challenging English-language dominance in global popular culture. In the late 1990s, the South Korean economy was recovering from the 1997 Asian Financial Crisis. It was also trying to overcome the failure of its state-centric economic system after several decades of remarkable growth under a succession of military dictatorships (1961-1988). In a bid to turn its situation around, South Korea turned towards marketing popular culture to boost export income. But this objective swiftly dovetailed with a larger post-democratisation national project to improve South Korea’s international image. It was hoped this would help the country distance itself from its common association with the Korean War (1950-1953) and its poor but troublesome northern neighbour. Yet the Hallyu! exhibition does not tell the story of the success of cultural commodities such as the martial art of taekwondo or hansik (Korean cuisine), which were targeted for international promotion in the early 2000s. Instead, the exhibition focuses on the extraordinary responsiveness of Korea’s creative industries. Companies seized on the success of the most unlikely products and deployed them to boost South Korea’s soft power in ways that couldn’t possibly have been imagined at the beginning of the national promotion project. Nowhere is this more evident than at the exhibition’s entrance – a wall of screens playing the music video that took K-pop music into the global mainstream in 2012, Psy’s Gangnam Style. It is hard to imagine the Presidential Committee for Nation Branding in charge of curating Korea’s international image choosing a middle-aged rapper who was resistant to military conscription as Korea’s cultural ambassador. Yet half a billion YouTube views later that was exactly what Psy became. This pattern of promoting consumer-focused content has continued over the past decade. It has resulted in a seemingly incoherent, yet continually enticing image of Korea as urban and hyper-modern, while also maintaining undertones of tradition and rural simplicity. It’s an image that seems to be endlessly appealing to global audiences. Installations presenting traditional elements of Korea’s cultural past are positioned carefully to provide context for the most contemporary of products. These include high-fashion interpretations of hanbok (Korean traditional dress) and the Joseon Dynasty-era (1392-1897) designs on the packaging of much sought-after Korean beauty products. Korea’s distinct traditions and culture were strongly revived by authoritarian governments after Japan’s colonial era – and its cultural assimilation policies – which ended in 1945. At the same time, there is evidence throughout the exhibition of a less stringent approach to tradition, which people and government are more comfortable to reimagine to provide easier access for overseas consumers. This is visible in the use of English lyrics in pop songs, in the “fusion” fashion designs created by members of the Korean diaspora, and in the creation of “new” traditions – such as the pop group-branded lightsticks wielded by devoted fans at concerts. Refreshingly, the story of the Korean Wave on display at Hallyu! is frank about the political tensions and controversies that were formative in the development of contemporary Korean creative expression. We don’t see a sanitised, linear trajectory from the ravages of the Korean War to the heights of the pop group BTS’s fame. Instead, we see the undulations in Korea’s fortunes as it experienced economic boom and bust. It touches on the fraught journey from dictatorship to democracy. It also notes present-day challenges in terms of widening socioeconomic inequalities. Artists and creatives have not shied away from frank representations of this chequered rise or the dark underbelly of late capitalism in Korea. This is epitomised in the recreation of the grimy basement apartment toilet from the Oscar-winning film Parasite. These sorts of productions, which seek to show the uglier side of things, would have once brought shame on a Korean society proud of its meteoric rise as an Asian Tiger. But the exhibition shows how productions with difficult subject matter are embraced and used for the national good because they achieve the critical and popular acclaim the country seeks. One such show is the 2021 hit Squid Game, a brutal representation of the corrupting impact of spiralling household debt) in Korean society. International audiences devoured the show’s fictional depiction of contestants fighting to the death in a brutal gamified social experiment. Hallyu! has created a space for Korea to shine in ways that the permanent Korea exhibition at the V&A – a small, rather drab display in a hallway behind the much larger Japan and China galleries – does not. The success of the Korean Wave has gone beyond promoting global consumption of the country’s cultural products. The wave has brought with it increased tourism, a larger market for Korea’s chaebol (big businesses) in the world and greater interest in Korea as an object of study and a notable geopolitical presence in international affairs. In other words, the consumption of K-culture has brought about developments the South Korean government didn’t anticipate. This exhibition proves that waves do not return to the sea unchanged by the surface they have covered – they bring with them a variety of unexpected flotsam. Copyright © 2010–2023, The Conversation ",
    "datetime": null,
    "url": "https://theconversation.com/hallyu-the-korean-wave-at-the-vanda-is-an-unflinching-look-at-the-countrys-creative-rise-191133"
}