{
    "title": "HALLYPOP K-Pop & Asian Music Digital Network Launching This Summer | Billboard – Billboard",
    "text": "K-pop gets one step closer to overseas audience with the upcoming launch of HALLYPOP, a partnership between Korea's powerhouse television network SBS, distribution and OTT service JungoTV, and and… By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin K-pop is getting one step closer to its overseas audiences with the forthcoming high-definition network HALLYPOP. Billboard can exclusively report that HALLYPOP, a digital-first entertainment network — that combines the word “Hallyu,” another word for the “Korean wave,” and pop — will launch in this summer with a focus on K-pop, Asian music, EDM and pop culture. The forthcoming channel will target distribution on traditional cable and digital platforms, as well as applicable skinny bundles.  Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t04/24/2018 The network will launch with more than 600 hours of content, including popular Korean music, variety and competition shows. Programming includes popular Korean programs like weekly music-chart programs Inkigayo and The Show (where K-pop acts all perform live and vie to be named the No. 1 artist of the week), Running Man (the reality-variety show where MCs and guests compete physical missions to win episodic races) and more. The launch comes via a partnership with Korea’s powerhouse television network SBS, distribution and OTT service JungoTV and U.S. content distributor Cinedigm. “By unifying people of all races and languages, K-pop inspires us all,” says Dr. Mehmet Oz, JungoTV co-founder and host of the Dr. Oz Show. “From North and South America, to Asia and the Middle East, K-pop has captivated the minds and ears of millions and millions of people from all walks of life. We’re excited to join forces with Cinedigm and SBS to bring this incredible art form into even more homes.”  Adds Erick Opeka, EVP of Cinedigm Networks: “K-pop has quickly become a global sensation and an international billion-dollar industry. HALLYPOP is a great complement to Cinedigm’s growing portfolio of networks dedicated to super fans and enthusiasts, and we can’t wait to bring it to programming platforms across the world.” Meanwhile, the move marks a big moment for SBS as Korean media continues to stretch overseas.  “With the launch of SBS LIVE OTT services, SBS International has successfully made the transition from a traditional broadcaster to a digital channel provider,” says Hong Kun Lee, CEO of SBS International. “As the industry leader in Korean entertainment, the strength of the SBS program line-up will position HALLYPOP as one of the sought-after digital channels among the millennial generation.” With K-pop makings its ways onto American shores more than ever — as evidenced by today’s announcement of BTS performing at the 2018 Billboard Music Awards or yesterday’s news of Kris Wu signing with Universal Music — a network launch like HALLYPOP continues to prove the music scene’s growing, multiplatform presence. Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2018-04-24T19:57:34+00:00",
    "url": "https://www.billboard.com/music/music-news/hallypop-k-pop-asian-music-network-summer-2018-8377034/"
}