{
    "title": "Hallyu: Korean Wave Takes Over India, From Gangnam to Dalgona - Asian Community News",
    "text": "Asian Community News - Community News By Anukrati Mehta MUMBAI: When Spotify descended upon India on Feb 26, 2019, it hardly had any idea of the movement that it was going to trigger in the country. Inadvertently setting off the Hallyu 2.0 (a term used to describe the emergence of Korean subculture) in the land, the music streaming app was itself taken aback by the reception that K-Pop enjoyed among the Indian masses. Case in point, the Korean boy band, BTS, was the fifth-most streamed artist of 2020 and had the third-most streamed album on Spotify India. It also broke the record for having the most streams for any given song twice in a year. While Spotify was surely stupefied, Hallyu was a long time in the making. The wave first gained momentum in 2012 when Psy’s horse-dance fervently spread among the masses as they tried to emulate his Gangnam style, spawning several thousand parodies in the process. It really took off in India, however, when a Korean band named N-Sonic toured the country shortly after and later on, became a member of the judging panel of the annual K-pop India music festival. Related article: Cheers K-pop fans! BTS Coming to India first on its next world tour? Half a decade since then, K-pop has become one of the most-loved genres nationwide, with festivals being routinely organized for fans. Bands like Blackpink and BTS are a household name today while shows like Descendants of the Sun and Crash Landing On You dominate Netflix. However, before K-pop’s craze had spread over, what caught the attention of the people at large was South Korea’s film and television fare. Thanks largely to The International Film Festival of Kerala, Korean films had started becoming popular in India. With the foundation for the subculture’s affinity laid in place, people slowly started migrating to K-dramas because of their universal appeal and the familiar themes of family, friendship, and love, something that’s a staple in Indian shows. This movement, however, grew more popular than ever during the pandemic when people with an inclination towards the Korean culture started immersing themselves in it. Trends like Dalgona coffee and the Mukbang challenge that became a global viral hit had Indians partaking in them in equal measure. As people started consuming more Korean content, they also began exploring K-beauty and Korean food more zealously. In fact, even the intent to overcome the language barrier had grown so much that Duolingo, the language-learning platform, saw a 256% increase in Korean learners in India. The K-beauty trend, too, has been massively popular in the country, with people being fascinated by the ‘no-makeup’ makeup look of the South Koreans. The trend has considerably influenced beauty and makeup routines and has introduced new and inventive skincare formats like sleeping masks, serums, and sheet masks. Its impact has been so huge that Shopclues, an e-commerce website formed an MoU with KOTRA (Korea Trade-Investment Promotion Agency) to support the entry of outstanding Korean enterprises into the Indian market. Related article: BTS Come to India but 3-5 years later when we grow young: Teenager K-pop fans The most favoured factors of the Hallyu wave have grown increasingly popular over 2020. Whether it’s food, music, beauty regimes, or films, it seems that Korea has something for everybody. For a nation like India that has since long attempted to ape the West, the adoption of Korean culture has come as a breath of fresh air. With the subculture having something in store for everyone, it needs to be seen how it progresses from here. One thing’s for sure, though: Hallyu is here to stay.  Prev Post Legal Risks and Exposure for Japanese Businesses in India Next Post Prof Ravikesh of JNU Receives Prestigious Citation Award from Dy-PM, Minister of Edn, South Korea India to host skill evaluation test, job fair for job seekers in Japanese hotel… ASCI implements guidelines for “Dark Pattern” Advertisement Japanese giants Panasonic, NEDO, JICA join hands to support IT-enabled e-rickshaw… Japan Science & Technology agency invites Indian edu institutions to implement… […] Related news: Hallyu: Korean Wave Takes Over India, From Gangnam to Dalgona […] Leave A Reply Cancel Reply Your email address will not be published.     Recent Posts Japanese all-girls pop group Momoiro Clover… India to host skill evaluation test, job… Gujarati Garba meets Japanese & Korean… ASCI implements guidelines for “Dark… Japanese giants Panasonic, NEDO, JICA join… Japan Science & Technology agency… Assam-Japan Gateway 2023 event in Guwahati… Data Protection for India’s FinTech… KCCI New Delhi student Srija Paul wins… Golf Wellness Club comes up at DIA Park… Galaxy of top journalists to gather at Web… Flow of business travellers to Korea… Trending News Japanese all-girls pop group Momoiro Clover Z marks 15th… India to host skill evaluation test, job fair for job… Gujarati Garba meets Japanese & Korean Elegance at… Popular Articles Japanese firms see  opportunities in retail, logistics,… China will not hesitate to use missiles against Taiwan to… ShineWing India moves to bigger, prime location; acquires… Welcome, Login to your account. Recover your password. A password will be e-mailed to you. ",
    "datetime": "2021-02-09T20:01:12+00:00",
    "url": "https://www.asiancommunitynews.com/hallyu-korean-wave-takes-over-india-from-gangnam-to-dalgona/"
}