{
    "title": "Hallyu fans and gender control | East Asia Forum",
    "text": "Author: Ingyu Oh, Korea University In October 2016 two female Saudi Hallyu (Korean cultural wave) fans fled to Seoul — the mecca of Hallyu — without telling their male guardians. Many Saudis were extremely angry — it’s still unlawful in Saudi Arabia for women to travel anywhere without male accompaniment. While this behaviour is a more extreme example, Hallyu — which includes K-Pop and Korean TV dramas and movies — is rapidly increasing in popularity and is the new buzzword for global female entertainment. An estimated 30 million Hallyu fans exist all over the world and more than 70 per cent of them are women.  In the early 2000s, when Hallyu became widely popular among middle aged Japanese women, most Asian specialists and pundits thought it would go away in less than three years. When I wrote an article about Japanese Hallyu fandom in 2009 for an Australian journal, the editorial staff refused to print it on the grounds that Hallyu was no longer relevant. But by 2013 the Japanese male dominant government had become so worried about the continuing love affair among Japanese women with Korean male idols that it deliberately postponed the passage of anti-hate speech law targeted against anti-Hallyu movements, especially the Zaitokukai, for three years since the onset of its anti-Hallyu marches in Tokyo’s Korea or Hallyu Town. Now, in 2016, with the passage of anti-hate speech law, Hallyu is still hugely popular among Japanese women, although they remain constrained by their male dominated society to more openly express their interest in Korean pop culture. Following on from Japan’s moves to control Hallyu popularity, the Chinese government is now trying hard to curb its own female population’s love affair with Korean culture. As of 2016 there are more than 10 million registered Hallyu fans in China and most of them are young women. The total export of Korean cosmetic goods to China is expected to be US$16.6 billion in 2016, making Amore Pacific’s CEO Seo Gyeong Bae the second richest man in Korea. But the recent bilateral decision between South Korea and the United States to deploy the THAAD (Terminal High Altitude Area Defence) missile defence system to the Korean peninsula has angered the Chinese government. Xi Jinping’s administration has chosen now as a good time to drop bombs on its female Hallyu fans. China’s State Administration of Radio, Film and Television (SARFT) is in charge of this ‘gender control’ of East Asian pop culture. In August 2016, SARFT issued both unofficial and official documents restraining Korean TV programs, public appearances by Korean idols and live internet broadcasting without SARFT permits. Like those Saudi females who risked being indicted and punished by their male authorities to go to Seoul and witness Korean culture first-hand, young Chinese women now have to make a conscious choice about their cultural consumption. Should they continue to buy Korean cultural goods secretly like their Japanese counterparts? Or should they turn to government propaganda dramas and music and show their loyalty to Xi, a new member of the Chinese hero group presided over by Mao Zedong and Deng Xiaoping? The Korean TV drama series A Lunar Woman: Bobogyeongsim Ryeo was sold to Youku — the Chinese counterpart of YouTube — for US$8 million this year and is currently live streamed in China. Its 18 episodes have attracted more than two billion views. A careful look at the post-episode commentary indicates that Chinese female fans persistently show their loyalty to Korean male actors, whereas male viewers openly detest the Korean drama. It looks like the THAAD fiasco and the North Korean missile threats will continue to dominate the overall discourse between the peninsula and its neighbours. But Chinese investors seem unscathed by the overall political situation, as if the cultural realm is unaffected by it. JD Group, for example, purchased 28 per cent of Fantasio shares to become the largest shareholder of the Korean entertainment company. As Chinese investment increases in Korea, especially in the entertainment sector, the Chinese government would be ill-advised to put an embargo on all Hallyu products. Chinese investments in Korean entertainment companies ensures formal and continuous cooperation between the two countries in the production and distribution of Korean dramas into China, avoiding governmental restrictions on purely Korean pop culture contents. Besides China, bilateral or multilateral cultural cooperation between other East Asian countries (for example, Japan) looks to become increasingly likely as nations try to save face from the failure of their gender control. In the meantime, Korea is looking for new niche markets in Australia, Canada and the United States for future entertainment business opportunities. It is not a mere coincidence that BTS, a Korean hip-hop band, came in at 26 on the Billboard Top 200 chart for the first time in Korean pop music history. Despite government efforts to curb the popularity of Hallyu across East Asia, its loyal fan base looks set to grow even further. Ingyu Oh is a Professor at the Research Institute of Korean Studies at Korea University.  Δ  Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Funny in the East Asia Forum about the article “Pop culture boosting harmony in East Asia 9 July 2016”, they stated that help people learn about each other culture and country and here, all this cultural exchange and cooperation is creating a backlash. As I stated in the 9 July 2016, it would be nice if the university students became the region’s top business and political leader, there would be more peaceful relationships between countries; however, I also stated that this is a dream not reality.  July – September 2023\nFor electronic copies of back issues, links to the individual articles and to subscribe to the hard copies, see the EAFQ page. ",
    "datetime": "2016-11-11T11:00:00+00:00",
    "url": "https://www.eastasiaforum.org/2016/11/11/hallyu-fans-and-gender-control/"
}