{
    "title": "Hallyu! The Korean Wave review – a dazzling historical remix | Art | The Guardian",
    "text": "V&A, LondonThis gleeful, giddy celebration of the culture of South Korea ranges from fashion to fine art and grand guignol to Gangnam style If you don’t recognise the guards’ costumes from Squid Game that loom at the V&A with their cerise suits and geometrical masks– where have you been? This dystopian TV series was watched by well over 100 million viewers in more than 80 countries on its release last year. It’s part of the surge of global pop culture from South Korea that Hallyu! – Korean for “wave” – celebrates. The reason this blockbuster show from the V&A translates so well is that it portrays its own desires and concerns as universal: it doesn’t recognise frontiers. In a century when many have become suspicious of globalisation, fleeing an economically and technologically unified world into renewed nationalism, South Korea has gone the other way. There’s no Krexit. This society embraces everything and everyone. That outlook was anticipated by the late Korean-American video artist Nam June Paik: his 1986 installation Mirage Stage is one of the show’s first highlights. Its array of flickering TV screens celebrates a zen-like hypnotic embrace of the endless, limitless possibilities of global communication. Here that mix includes everything from Psy’s 2012 mega-hit Gangnam Style on an opening video wall to a space where you can attempt some K-pop dancing, to a spectacular display of contemporary takes on traditional Korean hanbok dress. Fashion is fundamental to this exhibition’s gentle argument, for it does actually have one under the infectious soundtrack. You are surrounded by clothes that are simultaneously futurist and ancient, a dazzling historical remix. Until well into the 20th century, Korea was a pre-industrial society loyal to venerable customs. From 1910 until 1945 this identity survived colonisation by the Japanese empire. Hanbok style, with broad skirts for women and silk robes for men, expressed this old Korea: it was threatened again when South Korea started to industrialise after the Korean war. But now there seem to be infinite ways of reinventing hanbok, from a black and white lace-garnished suit worn by K-pop star RM to a deconstructed underwear dress designed by Suh Younghee. Floral patterns are taken to ecstatic extremes, from subtle grey petals to huge pink blooms to a dress in the shape of a giant peony. It’s also in fashion where you see one of the most appealing aspects of K-pop culture, its freedom from stale images of gender. Not only do male and female clothes blend, so does the crafting of female and male beauty. There’s a whole section on cosmetics and beauty treatments that shows how Korean stars get their looks, from actor Lee Dong-wook modelling Boy de Chanel cosmetics to the pioneering use of green tea as a skincare treatment. A statue by Gwon Osang of K-pop idol G-Dragon as an angelic matador piercing a fallen demon with his lance depicts both G-Dragon and his vanquished foe with exquisite androgynous beauty. This deliriously kitsch artwork also points to what may be the single most seductive aspect of South Korea’s pop culture: its freedom from any kind of cultural purity. It happily ransacks western art. G-Dragon’s heroic pose is modelled on Christian images of Saint George and the Archangel Michael. Why not? They’re as much grist to the mill as the Buddhist tradition in this urban, digital, post-everything worldview. You can go inside a curtained booth, braving the content warning, to watch an in-your-face big-screen clip of a street fight from Park Chan-wook’s violent, surreal 2003 film Oldboy, and see the ragged wig worn by its star Choi Min-sik. Oldboy is a glorious example of the pick’n’mix globalism of the Korean Wave: it is based on a Japanese manga version of the classic French novel The Count of Monte Cristo by Alexandre Dumas. Gangnam, the show reveals, is a wealthy district of Seoul. Its rise from rural suburb to high-rise glamour district is chronicled here. But not everyone lives Gangnam-style: you can peer into the tiny set of the poor family’s squalid bathroom from Oscar-winning film Parasite. Korean culture’s universality includes dramatising the conflicts and injustices it shares with the rest of the world – which is the dramatic heart of Squid Game. Yet the overwhelming feel of K-pop culture, this pulsing show proves, is a joyous embrace of the flow of modernity, an optimism that seems to have dried up elsewhere. Hallyu! The Korean Wave opens on 24 September 2022 at the V&A ",
    "datetime": "2022-09-21T14:19:14.000Z",
    "url": "https://www.theguardian.com/artanddesign/2022/sep/21/hallyu-the-korean-wave-review-a-dazzling-historical-remix"
}