{
    "title": "Hallyu: ‘cool Korea' and the art of soft power, by Maya Jaggi (Le Monde diplomatique - English edition, December 2022)",
    "text": "‘Seduction is always more effective than coercion’ South Korea’s tech-driven popular culture became a big earner from the 1990s, turning into a global phenomenon that has rebranded the small country. Hallyu! The Korean Wave at London’s Victoria and Albert Museum is the first major exhibition to explore how this was done and what comes next. When disaster struck the South Korean capital at Halloween, and more than 150 young revellers were killed in a crush in the leisure district of Itaewon, the unfolding horror touched the hearts of millions who had never visited Seoul. They were familiar with the narrow alleys and neighbourhood bars as the setting for Itaewon Class, a 2020 cable TV series about a group of misfits opening a restaurant, which became a worldwide Netflix hit. This ‘K-drama’ success showed the growing international appeal of South Korean popular culture since the late 1990s known as the Korean Wave, or Hallyu. The term was invented in China in 2000, when the boyband H.O.T. (High-Five of Teenagers) drew 12,000 fans to a Beijing concert. The East Asian craze for K-drama and K-pop spread across continents, and in 2008 Korea became a net exporter of culture. Today BTS — the world’s bestselling band — is not only worth $4.65bn to the South Korean economy but its members are UN goodwill ambassadors. US president Joe Biden was photographed with the boyband at the White House in June, making their finger-heart gesture against hate crime. The power of Hallyu extends beyond the lucrative export of pop culture products (and knock-on rise in incoming-tourist revenues) to the growth of Korean cultural influence in general — from hanbok (national costume) among fashionistas and kimchi (pickles) among foodies, and Korean-language learning abroad. Last year, 26 Korean words were added to the Oxford English Dictionary. South Korea now ranks 11th on the world soft-power index measuring countries’ cultural appeal. Soft power enables tiny but talented states with muscular neighbours to punch above their weight. Or as Joseph Nye, the Harvard professor who coined the term in 1990, wrote, ‘seduction is always more effective than coercion’. Not only does Hallyu challenge Western — notably US — cultural supremacy; this year’s Japanese remake of Itaewon Class confirms that Korea’s former imperial master (known for its lingering prejudice against the peninsula it brutally colonised from 1910 to 1945) is in thrall to a rebranded ‘cool Korea’. So how was this soft power won? Hallyu! The Korean Wave at London’s Victoria and Albert Museum, the first exhibition to illustrate and analyse the phenomenon, opens with a wall of screens showing Gangnam Style, PSY’s K-pop video of 2012, which mocks those who aspire to join Seoul’s flashily affluent southside district. With its jaunty beat, horse-trot dance moves and irreverent humour, this infectious parody became the first music video to reach one billion YouTube hits. From PSY’s pastel-pink suit to the set of Bong Joon-ho’s Parasite (2019) — the first Korean film to win the Palme d’Or at Cannes and first non-English-language film to win the Oscar for Best Picture — this ebullient show charts milestones in K-drama and cinema, K-pop music, and K-fashion and beauty. As importantly, it offers historical context. The section ‘From Rubble to Smartphones’ includes Kyungah Ham’s needlework installation of a fallen chandelier, What you see is the unseen /Chandeliers for Five Cities (2015), a metaphor for the cold-war division of the peninsula. An ox-drawn plough tilling fields in front of high-rises in Gangnam, in Jun Min Cho’s 1978 photograph, illustrates the drive for progress of a country that was poorer than North Korea when the ‘forgotten’ Korean war ended without a peace treaty in 1953, leaving 2.5 million dead and two million orphans. Rival spheres of influence contributed to a cultural hybridity that has shaped Hallyu. Japan, while posing as the bringer of modernity, banned US music and films, and forbade the Korean language. After 1945, Korea banned Japanese cultural imports until the late 1990s, and American popular culture rose to dominance (Marilyn Monroe performs at a US military base in a 1954 photograph in the show). The Kim Sisters (pictured with beehive hairdos in Life magazine) were among K-Pop’s precursors to find success in the US. But this cultural door was closed during the dictatorships of 1961-87. The export-led Miracle on the Han River (the rapid industrialisation and economic growth of those decades) was accompanied by cultural protectionism and censorship. Long hair and miniskirts were outlawed in 1971 and artistic freedom stifled. South Korea re-emerged as a democracy during the 1988 Seoul Olympics. But US complicity in the brutal crackdown on students and workers in the Gwangju Uprising of 1980 fuelled anti-American sentiment just as curbs on Hollywood imports were being lifted. Along with hostility to a flood of Japanese cultural imports in the late 1990s, this anti-American feeling may have been a factor in Korea’s cultural rise — though it did not preclude deep affinities. Seo Taiji and Boys (seen here on a TV show), who rapped in Korean in the early 1990s when the door opened to hip-hop, R&B and reggae, helped pave the way for K-pop. ‘The Korean Wave wasn’t created by government,’ I was told in 2014 by South Korea’s then culture minister, Yoo Jin-ryong. ‘It flowed organically.’ Music and drama gained an edge precisely when censorship was lifted, after 1987. But Kim Young-sam’s administration — the first civilian government in 30 years — paid attention when box office takings from Steven Spielberg’s Jurassic Park in 1994 exceeded profits from 1.5 million Hyundai cars. As the Asian financial crisis of 1997 devastated the economy, President Kim Dae-jung noted the revenues from Hollywood films and British stage musicals, and switched support from electronics and cars to pop culture. Alongside chaebols (family-run conglomerates) and private investors, government funds led to a cinematic renaissance. National box office takings from the K-film Shiri (1999) outperformed Titanic. With the national humiliation of the IMF’s $58bn bailout in 1997, startups — together with a popular campaign to donate gold wedding rings — contributed to the loan’s early repayment by 2001, and accelerated the recovery. Arguably the government’s greatest contribution was its embrace of new technologies. Korea invented moveable metal type in the 13th century, and remains an innovator. Responding to mass production of consumer electronics in the 1960s and 70s, Nam June Paik, the father of video art, envisaged the future in Mirage Stage, a 1986 ‘video-sculpture’ on show with flickering TV screens. Convinced that slowness to industrialise had enabled colonisation by Japan, successive governments quickly adopted information and communications technology (ICT), making this society one of the world’s most digitally savvy. Most households had access to broadband by 2010. One of the earliest known books printed with moveable type — in 1377, several decades before the Gutenberg Bible — is on show, alongside Korean digital innovations, from Samsung’s first mobile phone in 1998 to the first mp3 player, satellite TV mobile phone, and touchscreen phone. Technological nous gave cultural exports a competitive edge. Just as comics fuelled Hollywood superheroes, webtoons (a Korean innovation of vertically scrolling cartoons designed for mobile phones) seeded successful K-dramas, including Itaewon Class. K-drama was first spread through East Asia by cable TV; in the mid-2000s, it and cinema spread globally on streaming platforms. In the show, an umbrella printed with soft-focus couples uses stills from Winter Sonata (2002), a watershed in Hallyu’s transformation of Japanese attitudes towards Koreans (1). Also on display are the guards’ pink boiler suits from SquidGame (2021), a drama about social inequality that became the most watched season ever on Netflix — the first non-English Netflix show to top global viewing charts, at more than 140 million households. Recording studios were meanwhile replaced by companies such as SM Entertainment, founded in 1989 by Soo-man Lee, producer of H.O.T., the first superstar K-pop group. Having witnessed the rise of MTV in the US, Lee explains in the catalogue, he aimed to globalise K-pop through ‘Culture Technology’, a system of casting, training and managing idols that he compares to the perfectionist potters of Korea’s Goryeo and Joseon dynasties. By the mid-2000s, K-pop was poised to exploit smart phones and social media platforms to garner global fandoms and create a new paradigm: in Lee’s words, ‘If you bring culture to the world, economic wealth will follow.’ This axiom reverses the Western history of wealth and empire building followed by cultural dominance. Just as amateur subtitlers helped export films, K-pop fans have helped spread the word on idols, as technology tends towards greater participation, with ‘prosumers’ and ‘produsers’ generating digital content (the show culminates in an interactive K-pop dance challenge). Yet downsides of idol culture are hinted at in the show. They include the deep ambivalence towards fame embodied in Gwon Osang’s sculpture of the K-pop idol G-Dragon lancing a demon. Women as well as under-age girls (idols start at age 11) display what Mariam Elba identifies in thecatalogue as aegyo, an ‘infantilised cuteness’. Augmented reality has enabled the ‘first metaverse group’, the girlband Aespa, whose idols coexist with avatars. Yet, despite the show’s argument that K-pop and its fans are a force for inclusiveness, in a catalogue photograph, Aespa’s perfect avatars all appear to be blonde. Fiona Bae, in her book Make, Break, Remix: The Rise of K-Style (2022), argues that K-style, suffused with a ‘rebellious spirit’, rather than copying, remixes eclectic influences with Korean styles into a ‘new authenticity’. Far from a dilution of Korean cultural identity, this show suggests a greater ease with tradition, with K-pop idols singing mainly in Korean, and fashion designers reinventing the hanbok. As Ramon Pacheco Pardo concludes in his book Shrimp to Whale: South Korea from the Forgotten War to K-Pop (2022), Hallyu has seen a rise both in Koreans’ liberal values and in ‘pride in their own roots’. Yet Hallyu, whose appeal stems partly from its alternative to Western cultural dominance, has provoked a backlash in some Southeast Asian countries, alarmed by the threat to their own cultural industries. This show is noticeably silent on rivals. Motown’s precedent is mentioned but, strangely, not Bollywood’s — an Asian export model of cinema with catchy tunes, synchronised dance and constrained sexuality, which sustained an earlier challenge to Hollywood. The diversity of K-culture makes it increasingly dubious to lump all the country’s output together — anti-capitalist critiques such as Parasite and Squid Game with makes of lipstick. It is also faintly chilling to learn that President Moon Jae-in announced plans in 2017 to increase Hallyu’s global fan club membership to 100 million — a goal surpassed in 2020. K-culture bucked trends during the Covid pandemic because it was already innovating and thriving online. But as the young grapple with online pressures combined with social isolation, PSY’s parodic Gangnam video ten years ago may come to seem like an age of innocence as we are led deeper into a Brave New Metaverse. Unlike its excellent catalogue essays, this important exhibition (sponsored by the culture ministry in Seoul) loses some critical distance as it progresses, as though intoxicated by the Hallyu success story. Yet one factor behind Itaewon’s Halloween crush (which some reports ascribed to a rush when a celebrity was sighted in a bar) was the desire for human contact after the pandemic. As the disaster — South Korea’s worst since the Sewol ferry sank in 2014 — prompts self-questioning, it would be wise to keep a sober eye, not just on how this cultural wave can be sustained, but on where it may be headed next. Maya Jaggi (1) According to Youna Kim in the exhibition catalogue, the government provided the series free to broadcasters in Iraq to create positive feeling towards Korean soldiers there. ",
    "datetime": "2022-12-01",
    "url": "https://mondediplo.com/2022/12/11korea"
}