{
    "title": "\r\n\tHallyu-inspired events are all the rage in South Korea |  | Campaign Asia\r\n",
    "text": "Korea Tourism Organization uses its cultural influence to draw in events. About 10 years ago, at the cusp of the global reach of Korean dramas, Korea Tourism Organization (KTO) realised the value of its hallyu offerings. The term refers to the ‘Korean wave’ driven by pop culture and entertainment. These days, hallyu is not limited to pop culture but encompasses a lifestyle around fashion, make-up, and social media. It’s become a ‘way of life’ or something to aspire to for fans of the movement. While KTO has matured its hallyu marketing over the years, the meetings and events market is catching up. The Korea Mice Bureau—an events arms under KTO—recently launched a support program to incorporate hallyu in corporate meetings and incentives. The program was rolled out in August. Under the program, delegates can choose from various hallyu offerings including attractions (K-pop dance school, SM Entertaintment Museum, etc), merchandise and opt for K-pop entertainment. This will serve as additions to the standard stock of offerings such as welcome ceremonies at the airport, gala receptions, and traditional Korean souvenirs. “Ever since we've updated our support system which highlights hallyu content, we're constantly receiving inquiries regarding K-pop performances or hallyu experiences,” said Chulbeom Park, director of the corporate & incentive team for KTO. For instance, a large incentive group from Indonesia arriving this month requested for a K-pop performance at their gala dinner. Indonesia is cited as a ‘rapid growth’ market for hallyu according to the Korea Trade-Investment Promotion Agency’s annual hallyu index. the fanchant for sorry sorry is so crazy. the song that started the hallyu wave in Indonesia 😭💙 #AsianGameswithSJ pic.twitter.com/rCiV9dvzYr On top of that, KTO recently won a bid to host a general assembly for a multinational direct sales company in 2019. One of the biggest factors that drew the decision was the exclusive K-pop performance included in the new support program. “By utilising hallyu, not only can we differentiate Korea from other countries but we are also able to show Korea's charm as a destination for corporate meetings or incentive travel,” said Park. “It is unique cultural content that is from Korea alone.” In June, KTO appointed South Korean boy band, SHINee as the ‘Korea MICE Honorary Ambassador’ to draw in fans from Southeast Asia and China – the two main markets for South Korea. On top of that, roadshows were held in the region to show off film locations used in popular Korean dramas. “Hallyu is already popular with people all over the world. But countries that have more access to hallyu content such as Southeast Asia, Japan and China are more responsive to this campaign,” said Park. Top news, insights and analysis every weekday Sign up for Campaign Bulletins Who doesn't love enjoying a nice sweet treat. But would you use one to brush your teeth with before bed? From next year, Mickey Mouse the legendary rodent, will no longer be owned by Disney. With the chains of IP law beginning to unshackle, what does this mean for the future of the brand's beloved character? This tarot-reading Havas creative pines to visit the ancient pyramids of Egypt, get off Instagram so she can embrace a digital detox, and is busy trusting the process. A Mindshare China loyalist of over 24-years, Low is instrumental for commercial gains as well as client and staff retention. Terms & Conditions / Contact Us © Haymarket Media Ltd. ",
    "datetime": null,
    "url": "https://www.campaignasia.com/article/hallyu-inspired-events-are-all-the-rage-in-south-korea/446939"
}