{
    "title": "Hallyu 2.0 and the Korean Influence on Western European Luxury",
    "text": "loading... Hallyu is a Chinese term that translates to the ‘Korean Wave’ and it refers the transcendence and increasing popularity of South Korean cultural exports such as South Korean TV dramas and pop music. The movement started in Asian countries such as China and Japan from the mid-1990s to the mid-2000s, and now the second wave - or ‘Hallyu 2.0’ - is becoming popular in Western countries, as more consumers globally embrace Korean tv dramas, music, fashion, beauty and food. Luxury brands are seeking out more collaborations with Korean celebrities as global brand ambassadors - for example, recently, the BTS septet were all made Louis Vuitton brand ambassadors – and this seems to confirm the growing strength of Korea’s cultural currency.  Korea’s growing cultural influence, especially among Gen Z, owes a lot to the country’s development of contents, to social media platforms as well as OTT (Over-the-Top) channels including Netflix.  The latter has announced they will invest USD 470 million on K-contents, showing that the company sees potential in driving audiences globally with Korean contents. You can also listen to this story by clicking here. The luxury market in Korea has shown quite unique changes during this pandemic. Between 2020 to 2021, it shows double digit growth of 10-11 percent especially in luxury leather goods, jewellery, and designer apparel. Koreans used to love to go abroad and spending for travel, and they are now compensating for the missing experiences with luxury items. While young European luxury consumers look for brand purpose and distinctiveness, Koreans see luxury goods ownership both as an investment and a way to show off one’s own social and financial status.  According to the Euromonitor International Lifestyles Survey 2021, nearly 30 percent of European Gen Z and Millennials buy from brands that take support social and political issues that are aligned with their values and 30% of European millennials and 25% of European Gen Z make their purchasing decisions based on brands/companies social and political beliefs. While it seems that Western consumers and Korean consumers differ in terms of their expectations from the brands in which they invest, the luxury industry will still have to evolve and better understand consumer groups across different communities and cultures in order to accurately represent and meet the needs of its increasingly diverse consumer base. In order to do this, luxury brands will likely need to be more inherently socially progressive - a rather new concept as luxury is traditionally built on exclusivity. Young European consumers are increasingly looking for distinctiveness and to tap into different communities and cultures, both from a social justice perspective and from the perspective of young consumers, especially Gen Z, rejecting societal norms in the pursuit of building their identities on their own terms. As awareness and interest in Korean culture grow and the country’s cultural exports become more popular globally, it would be a successful move to not only have Koreans be the face of luxury brands but also a creative force for both brand narrative and strategy in the future. Written and created for FashionUnited by Euromonitor. Explore more fashion-related podcasts by Euromonitor on their website. ",
    "datetime": null,
    "url": "https://fashionunited.uk/news/business/hallyu-2-0-and-the-korean-influence-on-western-european-luxury/2021100858272"
}