{
    "title": "Hallyu in PH: What's next?",
    "text": "By Bamba Galang, CNN Philippines Published Dec 24, 2022, 5:38:56 PM Metro Manila (CNN Philippines) — \"It was refreshing. The rest is history.\" This was how Roshelle Capinpin, a K-pop fan for 10 years, described how she first got into the wave in 2012. Metro Manila (CNN Philippines) — \"It was refreshing. The rest is history.\" This was how Roshelle Capinpin, a K-pop fan for 10 years, described how she first got into the wave in 2012.   She said it started with the Korean drama, \"Dream High.\" She said it started with the Korean drama, \"Dream High.\"   \"My cousins and I love music ever since, so when we heard about this music-themed K-drama, we naturally got interested. Taecyeon of 2PM especially got our attention. We don't have anything to do with K-pop back then, but we started researching what 2PM is and got hooked,\" she shared. \"My cousins and I love music ever since, so when we heard about this music-themed K-drama, we naturally got interested. Taecyeon of 2PM especially got our attention. We don't have anything to do with K-pop back then, but we started researching what 2PM is and got hooked,\" she shared.   Roshelle's cousin, Niña Marcos, said she initially thought she would never be a fan. Roshelle's cousin, Niña Marcos, said she initially thought she would never be a fan.   \"The funny thing was I didn't plan on becoming one...but when I watched Dream High 1, I started liking Taecyeon, one of the casts there. Doon na nagstart yung curiosity ko (That's when my curiosity started),\" she added. \"The funny thing was I didn't plan on becoming one...but when I watched Dream High 1, I started liking Taecyeon, one of the casts there. Doon na nagstart yung curiosity ko (That's when my curiosity started),\" she added.   For Brianne Balingit, social media played a big role in how she started her K-pop journey. For Brianne Balingit, social media played a big role in how she started her K-pop journey.   Brianne said she only started watching K-dramas in 2020 when everyone was locked down in their homes due to the COVID-19 pandemic. The first K-drama she watched was \"Uncontrollably Fond,\" as recommended by a friend, followed by \"What's Wrong With Secretary Kim?\" - which sparked her interest in A-list actor Park Seo-Joon. Brianne said she only started watching K-dramas in 2020 when everyone was locked down in their homes due to the COVID-19 pandemic. The first K-drama she watched was \"Uncontrollably Fond,\" as recommended by a friend, followed by \"What's Wrong With Secretary Kim?\" - which sparked her interest in A-list actor Park Seo-Joon.   \"I came across one of his dramas, 'Hwarang' wherein some of his co-actors were K-pop idols. I then started searching about Shinee's Choi Minho and BTS's Kim Taehyung. Algorithm then did the work, putting a lot of K-pop idol videos into my suggested videos to watch on Youtube,\" she said. \"I came across one of his dramas, 'Hwarang' wherein some of his co-actors were K-pop idols. I then started searching about Shinee's Choi Minho and BTS's Kim Taehyung. Algorithm then did the work, putting a lot of K-pop idol videos into my suggested videos to watch on Youtube,\" she said.   Brianne considered K-pop content as \"a different kind of entertainment,\" and at some point, she preferred watching it over K-drama. Brianne considered K-pop content as \"a different kind of entertainment,\" and at some point, she preferred watching it over K-drama.   \"For the nth time, the algorithm did all the work. I came across a video of Seventeen. That video started everything,\" she added. \"For the nth time, the algorithm did all the work. I came across a video of Seventeen. That video started everything,\" she added.   The so-called Hallyu or Korean wave made a significant impact across the world. The so-called Hallyu or Korean wave made a significant impact across the world.   It also gained a following in the Philippines, as Filipinos were named the second biggest audience listening to K-pop superstars BTS on Spotify, and fourth among countries tweeting the most about K-content in 2022. It also gained a following in the Philippines, as Filipinos were named the second biggest audience listening to K-pop superstars BTS on Spotify, and fourth among countries tweeting the most about K-content in 2022.   Local networks have been also doing adaptations of K-dramas, like \"Endless Love: Autumn in My Heart,\" \"Descendants of the Sun,\" \"Start-Up,\" and \"Flower of Evil.\" Local networks have been also doing adaptations of K-dramas, like \"Endless Love: Autumn in My Heart,\" \"Descendants of the Sun,\" \"Start-Up,\" and \"Flower of Evil.\"   The Philippines also has its own version of one of Korea's longest-running variety show \"Running Man,\" which recently ended its first season. The Philippines also has its own version of one of Korea's longest-running variety show \"Running Man,\" which recently ended its first season.   Apart from these, the love for Korean food is there, especially for samgyeopsal or grilled pork - usually eaten with lettuce and other side dishes. Apart from these, the love for Korean food is there, especially for samgyeopsal or grilled pork - usually eaten with lettuce and other side dishes.   How Hallyu started in the PH   Speaking to CNN Philippines, Kyung-Min Bae, director of the UP Korea Research Center, said there were stages as to how Filipinos accepted Korean culture. Speaking to CNN Philippines, Kyung-Min Bae, director of the UP Korea Research Center, said there were stages as to how Filipinos accepted Korean culture.   When she first came to the Philippines in 2005, K-dramas were already popular among Filipinos, especially like the well-loved historical pieces \"Jewel in the Palace,\" and \"Jumong.\" When she first came to the Philippines in 2005, K-dramas were already popular among Filipinos, especially like the well-loved historical pieces \"Jewel in the Palace,\" and \"Jumong.\"   People would watch the Tagalog-dubbed versions aired on local TV channels, or through bootleg CDs, she noted. People would watch the Tagalog-dubbed versions aired on local TV channels, or through bootleg CDs, she noted.   \"I think these were very fresh for Filipino fans because Filipinos were used to either local dramas or Mexican novela or Taiwanese, so when they watched some different types of stories from Korea I think it really interested Filipino viewers,\" Bae pointed out. \"I think these were very fresh for Filipino fans because Filipinos were used to either local dramas or Mexican novela or Taiwanese, so when they watched some different types of stories from Korea I think it really interested Filipino viewers,\" Bae pointed out.   Gia Allana, an entertainment writer and blogger, also said Filipinos were already in the Korean wave since the 2000s, but noted that it was \"a niche with an intimate circle of Filipino fans.\" Gia Allana, an entertainment writer and blogger, also said Filipinos were already in the Korean wave since the 2000s, but noted that it was \"a niche with an intimate circle of Filipino fans.\"   Aside from Tagalog-dubbed Korean series getting popular, people started further noticing K-pop through the dance craze brought by \"Tell Me\" by Wonder Girls, she said. Aside from Tagalog-dubbed Korean series getting popular, people started further noticing K-pop through the dance craze brought by \"Tell Me\" by Wonder Girls, she said. Songs \"Nobody\" by Wonder Girls, \"Sorry, Sorry\" by Super Junior, and \"Gangnam Style\" by PSY then became hits in the Philippines, she added. Songs \"Nobody\" by Wonder Girls, \"Sorry, Sorry\" by Super Junior, and \"Gangnam Style\" by PSY then became hits in the Philippines, she added.   Allana, who is also a concert photographer, said it was in 2010 when various K-pop acts started to have mall tours in the country. In the same year, the first K-pop concert happened in the Philippines through Hallyu kings Super Junior, opening other possible solo concerts, she noted. Allana, who is also a concert photographer, said it was in 2010 when various K-pop acts started to have mall tours in the country. In the same year, the first K-pop concert happened in the Philippines through Hallyu kings Super Junior, opening other possible solo concerts, she noted.   For Aya Villa-Real, co-founder of concert promoter Makeitlive Asia, Hallyu was more associated with TV dramas in the early 2000s. For Aya Villa-Real, co-founder of concert promoter Makeitlive Asia, Hallyu was more associated with TV dramas in the early 2000s.   Then came 2009, 2010, when she felt more and more people were getting into the wave as more K-pop events were being held. Then came 2009, 2010, when she felt more and more people were getting into the wave as more K-pop events were being held.   \"In the Philippines, as long as the music is good, you can see this in the earlier trends, people hopped in the global trend like Gangnam Style. They hopped into it because it was good music people could dance into, it was super easy to get into,\" Real said. \"In the Philippines, as long as the music is good, you can see this in the earlier trends, people hopped in the global trend like Gangnam Style. They hopped into it because it was good music people could dance into, it was super easy to get into,\" Real said.   Ghia Lim, marketing and social media specialist at Makeitlive Asia, also noted how the community was very small at first. While it was already existing in 2009, the long period of lockdown in the Philippines made Hallyu a lot more mainstream because people gave it a chance, she added. Ghia Lim, marketing and social media specialist at Makeitlive Asia, also noted how the community was very small at first. While it was already existing in 2009, the long period of lockdown in the Philippines made Hallyu a lot more mainstream because people gave it a chance, she added.   \"No one really took you seriously if you are a K-pop fan before… Pero ngayon (But now) if you say Blackpink, if you say BTS, so many people know who these people are,\" Lim pointed out. \"No one really took you seriously if you are a K-pop fan before… Pero ngayon (But now) if you say Blackpink, if you say BTS, so many people know who these people are,\" Lim pointed out.   Transformation of Filipino fans   The transformation of Filipinos who are into Korean culture is very much seen as to how K-pop fans went beyond just listening to music. The transformation of Filipinos who are into Korean culture is very much seen as to how K-pop fans went beyond just listening to music.   Bae said when the concept of K-pop fandoms started in the Philippines in 2010, fans really became consumers as they willingly spent money to buy Korean stuff. Bae said when the concept of K-pop fandoms started in the Philippines in 2010, fans really became consumers as they willingly spent money to buy Korean stuff.   \"Filipinos who really are into Korean culture became more proactive because they don't just unidirectionally absorb, but they want to be more critical and they also want Koreans to understand Filipino culture as much as they welcome Korean popular culture of traditional culture,\" she added. \"Filipinos who really are into Korean culture became more proactive because they don't just unidirectionally absorb, but they want to be more critical and they also want Koreans to understand Filipino culture as much as they welcome Korean popular culture of traditional culture,\" she added.   Before the pandemic, fans were focused on balancing collecting K-pop merchandise and attending concerts, Lim said. Before the pandemic, fans were focused on balancing collecting K-pop merchandise and attending concerts, Lim said.   \"But now the culture of being a multifan is such a common thing. No one just sticks to one group anymore,\" she added. \"But now the culture of being a multifan is such a common thing. No one just sticks to one group anymore,\" she added.   Real also said the growth in demand was evident in 2022 alone, when 60-70% of the concerts held in the country were Korean. Real also said the growth in demand was evident in 2022 alone, when 60-70% of the concerts held in the country were Korean.   \"Social media is such a big factor in influencing how people love more than one group,\" according to Lim. \"Social media is such a big factor in influencing how people love more than one group,\" according to Lim.   She said in the early 2000s, getting information was very hard that fans tend to focus on just one group or artist. She said in the early 2000s, getting information was very hard that fans tend to focus on just one group or artist.   \"Now, you just log in to TikTok and everything is there. You don't even need to actively search. The algorithm does it for you,\" Lim noted. \"Now, you just log in to TikTok and everything is there. You don't even need to actively search. The algorithm does it for you,\" Lim noted.   Online content from artists, aside from music videos, also played a factor, Real added. Online content from artists, aside from music videos, also played a factor, Real added.   \"They are offering so much content, so much information,\" she said. \"They are offering so much content, so much information,\" she said.   What's ahead?   Filipinos have fallen in love with everything Korean, and Bae said she expects this phenomenon to continue. Filipinos have fallen in love with everything Korean, and Bae said she expects this phenomenon to continue.   \"For instance, Filipinos used to watch Mexican novela, why don't they watch it now? Because… [Mexican] drama did not become the lifestyle of Filipinos. The culture was not able to cross another line and they were not absorbed by Filipinos,\" she explained. \"For instance, Filipinos used to watch Mexican novela, why don't they watch it now? Because… [Mexican] drama did not become the lifestyle of Filipinos. The culture was not able to cross another line and they were not absorbed by Filipinos,\" she explained.   \"If you are in love with Korean culture, it's not just watching drama… or listen to the music… It really continues in your life, it lasts because it's already a lifestyle for some Flipinos,\" she said. \"If you are in love with Korean culture, it's not just watching drama… or listen to the music… It really continues in your life, it lasts because it's already a lifestyle for some Flipinos,\" she said.   For Allana, she sees Hallyu to further evolve. For Allana, she sees Hallyu to further evolve.   \"As people are evolving, so are the stories in Korean dramas and the music and concepts in K-pop. And this is true even for other genres and countries, too,\" she said. \"As people are evolving, so are the stories in Korean dramas and the music and concepts in K-pop. And this is true even for other genres and countries, too,\" she said.   Fans like Brianne, Niña, and Roshelle also expect Hallyu to flourish in the coming years. Fans like Brianne, Niña, and Roshelle also expect Hallyu to flourish in the coming years.   \"With the collaboration of our local entertainment companies with the Korean entertainment companies, I think this is just the beginning. I would like to think that there are endless possibilities for both our countries' entertainment industries in the years to come,\" Roshelle said. \"With the collaboration of our local entertainment companies with the Korean entertainment companies, I think this is just the beginning. I would like to think that there are endless possibilities for both our countries' entertainment industries in the years to come,\" Roshelle said.  800   © 2015 Nine Media Corp. CNN name, logo and all associated elements ™ and © 2015 Cable News Network. Warner Media Company. All rights reserved. CNN and the CNN logo are registered marks of Cable News Network, Inc., displayed with permission. ",
    "datetime": null,
    "url": "http://www.cnnphilippines.com/entertainment/2022/12/24/Future-of-Hallyu-wave-in-the-Philippines.html"
}