{
    "title": "Has a British plumber conquered the biggest wave ever surfed? Father-of-two from Devon pictured hurtling down monster 80ft wall of water off Portuguese coast | Daily Mail Online",
    "text": "By Mia De Graaf Published:  10:49 BST, 3 February 2014   |  Updated:  15:37 BST, 3 February 2014 512 View  comments This is the terrifying moment a British surfer hurtled down what experts are calling the biggest wave ever conquered. Father-of-two Andrew Cotton could only catch one wave over four hours at sea in perilous conditions. But even as he plummeted 80ft towards the Portuguese shore, Mr Cotton, 34, panicked as he felt himself being sucked back up. Scroll down for video Colossal: British surfer Andrew Cotton, 34, plummets down a potentially record-breaking wave after being towed up it by fellow surfer Garrett McNamara on a jet ski  Perilous: Mr Cotton, a plumber and lifeguard when he isn't surfing, could only tackle one 80ft wave in the entire wind-battered trip to Praia do Norte beach in Portugal  It was the first time the surfer called his wife to warn her of the conditions in his 10 years in the trade. 'I've never ridden a wave like that,' he said. 'I was hurtling down it so fast, but I couldn't get near the bottom. It was pushing me up all the time. 'It makes you wonder how far we can push it, how high can you go? 'It was scary. But you're always in the hands of mother nature and that's what's exciting.' 16-year-old sentenced to prison for gang initiation drive-by Pensioner tackles thug who robbed child and stole his phone UN chief slams 'misrepresented' claims he 'justified' Hamas attack Donald Trump storms out of courtroom during civil fraud trial U.N Ambassador urges General Secretary to resign unless he apologises Shocking moment thug batters police officers over the head with bike Horrific moment assassin executes Chilean 'TikTok Narco Queen' Met Office forecasts rainy showers and fog patches across the UK Grinning Palestine supporters tear down posters of kidnapped Israelis Dashcam footage reveals man praying metres from traffic CCTV shows Italian couple share last kiss before killed by Andrea CCTV of supermarket employee being hit by woman after bag check  Incredible: Dozens of people crowded onto the nearby hilltop at Portugal's so-called 'natural wonder', Nazaré, to watch father-of-two Mr Cotton make his bid for the title  'Sucked in': Part-time pro-surfer, plumber and lifeguard Mr Cotton told MailOnline he felt himself going backwards as he plummeted 80ft towards the ground  'Turbulent': The team, based all over the world, united in Nazaré when they heard of a brewing storm. Mr Cotton said the conditions were volatile and turbulent Mr Cotton, who lives with his wife and children in Devon, flew out to the coastal town of Nazaré on Saturday night after his team heard news of a brewing storm. Portugal's so-called 'natural wonder' has a canyon beneath the beach which sparks colossal waves, attracting surfers from all over the world. By Sunday morning, he was out in the water with dozens of people clustered on a nearby hill to watch. Amazed: Mr Cotton said this wave would have been unimaginable ten years ago. It is bigger than one he caught last year that he thought was the biggest humanly possible  Tow: The gigantic waves are too powerful for someone to paddle to so Mr Cotton was towed up by friend and colleague, current world record-holder Garrett McNamara  Intricate project: The pair spent four hours at sea but only managed to catch one wave each in the perilous waves. Mr McNamara carried Mr Cotton up to the peak on a jet ski   Facing such gigantic waves requires surfers to enlist a little extra help to line themselves up to ride the huge expanse of water. And so part-time pro-surfer, plumber and lifeguard Mr Cotton was carried by jet ski to catch the wave. 1. Garrett McNamara - 78ft (Nazaré, Portugal, November 2011) 2. Mark Parsons - 77ft (Cortes Bank, California, January 2008) 3. Pete Cabrinha - 70ft (Maui, January 2004) 4. TIE: Carlos Burle - 68ft (Maverick's, California, November 2001). Dan Moore - 68ft (Jaws, Maui, December 2004). Brag Gerlach - 68ft (Todos Santos, Mexico, December 2005) Towed in by fellow surfer Garrett McNamara, the current world-record holder for a 78ft wave, he admits the conditions were far from ideal. He said: 'The waves were not the best condition, and flying out to Portugal for one wave is not ideal. But that's the chance you take. 'I couldn't have caught that one, though, without the whole team. So much goes into calculating the conditions and judging when to be towed out. 'It's a large-scale project.' Staying at home with their six-year-old daughter, Honey, and son Ace, two, Mr Cotton's wife, Katie, was nervous this time. Mrs Cotton, 37, a singer and singing teacher, told MailOnline: 'He never says he's nervous about a wave or the height, but this time he called me saying it was looking dangerous. 'He just deals with it. I don't know how I deal with it - I just wait for his phone call afterwards. As long as I'm sure that's coming then it's fine. 'It's what he loves doing and trains so hard at so it would be wrong not to be happy that he's managing to surf these waves.' Footage of the spine-tingling surf has now been submitted to Billabong for judging, and within hours Mr Cotton got the call to say he'd been nominated. The final shortlist will be announced in May after an expert judging panel have given the video and images a closer examination.  Record: Billabong will now assess the footage of the surf, which has already been nominated for this year's world record. The video will be compiled into a documentary this year  Mother nature: The waves at Nazaré are caused by a canyon beneath the beach. It is a 'natural wonder' that Mr Cotton says makes his life so exciting and unpredictable 'Dangerous': Wife Katie, 37, a singing teacher, stayed at home with their two-year-old son and six-year-old daughter, but for the first time was worried about the turbulent waves   'Monsters': Spectators described the waves as 'monsters' as they thrashed the hill where viewers can normally stand at a safe distance Mr Cotton, who has been nominated for the accolade four times, said: 'To me, it felt like something I've never even seen before. 'It is exciting to think that this is a wave surfers wouldn't have dreamed of surfing ten years ago. What will it be like in another ten? 'I thought I'd reached the biggest three months ago - I never thought it beat that so soon. Surfing conditions: Surfing forecast website Magic Seaweed dubbed last weekend's weather system '\u0080\u0098Take Two Hercules'\u0080\u0099, following the Hercules storm on January 6  'I am so lucky to be able to do this. It's not like skiing - if you find the biggest mountain, that's it. Waves are always changing and surfers can never know what's coming.' Previously a full-time surfer, Mr Cotton is now having to juggle jobs as his sponsor was forced to drop surfing from their company in the wake of the economic crash. He is now on the hunt for a sponsor to be able to dedicate himself to developing the sport. Meanwhile, he is collaborating with Epic TV on a documentary about the awe-inspiring waves in Nazaré. Every year, short films are made about the town, which are then screened in cinemas across the country. Mr Cotton is hoping this piece, featuring more shocking footage than ever before, will be more widespread across the UK this year. Katie Cotton, pictured with Andrew on their wedding day, said his dedication is a real inspiration to her and their children  Singer and music teacher Katie Cotton said hearing the news of a storm brewing instills fear in her. For it is news of bad weather which ignites excitement in her husband Andrew, as he scours the reports searching for the next big swell to surf. But the 37-year-old said she has to 'keep it together', dealing with her own anxiety as her husband takes on some of the biggest and most dangerous waves in the world. 'I can't convey any of my fears to him at all,' she told MailOnline. 'He needs every bit of strength he has for himself, I can't have him worrying about me. 'I have to deal with my side of things and the kids. It is really difficult, you can't help but think \"is this the last time I am going to talk to you\". 'But I have every bit of faith in him.' Mrs Cotton said her husband's brave quest to surf the world's most dangerous waves is an 'inspiration' and a 'great example' to set their children. She added: 'Seeing him so focused, so determined it is a real inspiration. 'It might just appear to others that he is just getting up and heading off to catch a wave, but so much goes into it. 'He is doing what he was put on this earth to do, he was meant to surf. If he wasn't following this dream he wouldn't be being true to himself. 'While it is scary for me, it is the greatest lesson for our children, watching their dad follow his dream and his heart like this. 'Even if your dream is some absolutely crazy thing to other people you have to be true to yourself, and that is the example Andrew is setting Honey and Ace.' Despite living on the coast Mrs Cotton is yet to follow her husband on to a board. The mother-of-two does not surf and admitted as a child one of her biggest fears was big waves. 'It is almost like I am living my nightmare,' she said. 'It is as though life is making a joke out of it. I am facing my fears of big waves just being married to him - it is like we were meant to be. 'Being around somebody who is so driven and determined is inspirational. Surfing is a part of Andrew, he is just not himself if he is too far from his surf board.' Wow, guys got no fear, what a legend. Share what you think The comments below have not been moderated. The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. We are no longer accepting comments on this article. Published by Associated Newspapers Ltd Part of the Daily Mail, The Mail on Sunday & Metro Media Group ",
    "datetime": "2014-02-03T10:49:24+0000",
    "url": "https://www.dailymail.co.uk/news/article-2550859/Has-British-plumber-conquered-biggest-wave-surfed-Father-two-Devon-pictured-hurtling-monster-80ft-wall-water-Portuguese-coast.html"
}