{
    "title": "Heart and Seoul of fashion: Korean opportunities  | South China Morning Post",
    "text": "Style-hungry Hongkongers have developed a taste for fresh designs from Seoul, writes Divia Harilela There was a time when the rest of Asia looked to Japan for fashion trends. While the French and Italians were known for sophistication and luxurious craftsmanship, Tokyo brought an edgy street style inspired by areas such as Harajuku and Shinjuku. That has changed over the past decade in the wake of , or the Korean Wave, a tide of Korean television dramas and pop groups which gained popularity around the world. Much of Asia, including Hong Kong, couldn’t get enough of all things Korean, whether it was its perfectly groomed pop groups, or the clothes they wore. “Customers are always looking for something that is adventurous and new, and Korean fashion offers that,” says Tracey Cheng, merchandising manager at I.T. As with many trends, it started on the streets. Boutiques such as local chain JDC began stocking exports from Korea, and picked up on emerging Korean designers. Some online retailers such as chicystyle.com (an Asian version of Asos) kept selling out of cheap and chic styles inspired by Korean fashion. Unlike Japanese fashion trends, which are about creating your own style, Korean designs are subtle, with attention to cool details. Many designers take their inspiration from the West, rather than Asia. “Korean fashion is mainly inspired by the European and US design aesthetic. It differs from the other Asian [labels], who tend to derive their aesthetic from traditional Asian culture and fashion,” says Jeff Jun, managing director at Korean fashion retailer, Handsome Co. “We started selling this brand in 2010, and since then it’s been my favourite. It continually surprises us, season after season, with its fashion-forward concept, distinctive tailoring, colours and themes. Its reasonable pricing is the key to its success,” says Dorothy Hui, founder of Liger boutique in Causeway Bay. More recently, high-end brands have come to the fore. Many of these are already showcasing their work on an international platform, alongside established fashion houses at prominent fashion weeks. Among them is Lie Sang Bong, who was one of the first Korean designers to show at Paris Fashion Week. In 2002, he debuted East-meets-West looks that were inspired by Korean cultural motifs. They have been worn by Lady Gaga and Lindsay Lohan. The Juun J and Woogyoungmi brands have also shown in Paris, and feature casual yet utilitarian separates for men. “Although the trend in Hong Kong was more towards the contemporary, there are also designers working in a more luxurious direction,” says Lee. “Now our main goal is to bring in more luxurious Korean designers in order to broaden the Korean fashion market in Hong Kong.” So what is it about Korean designs that resonate with Asians? According to Justine Lee, a beauty executive and lover of Korean fashion, it all comes down to the aesthetic. “I think Korean fashion is a good mix of European style and sophistication and Asian sensibility and practicality. It feels comfortable and effortless. Many of the designs do not feel overly dressy, and I like that,” she says. Retailers point to superior quality and fit when compared to their Asian counterparts. The Koreans have become known for high quality and innovative fabrics, and an eye for detail whether it’s decoration, or experimenting with fashion-forward looks. “Most Korean designers like the inverted triangle shape – that is, volume or an oversized top and slim bottom. The workmanship is good, and their fit is suitable for Asia,” says Michael Mok, general merchandising manager for Joyce. I.T’s Cheng adds: “They have slimmer fits in the waist and slightly longer silhouettes (as they are a bit taller). “And in terms of style, it would be more about contemporary streetwear and funky style, but they emphasise details such as embroideries and studs on garments, in order to make them look more than just casual streetwear.” Designers to watch Margarin Fingers: launched in 2010, this line is all about fun graphics, colours and prints on cool separates. margarinfingers.com Steve J & Yoni P: selected as one of eight “leading fashion designers of Korea” by  Korea, the duo is known for high-end pieces injected with whimsy and funk. stevejandyonip.com Goen J: definitely on the sportier side, Goen J blends delicate fabrics and details with street wear shapes. Yohan Kim: this Balmain veteran’s structured silhouettes create a look that is all about sensuality and power. yohankim.com Kye: founded by Kathleen Kye, a Central Saint Martin’s graduate who adapts menswear lines to womenswear. kyefashion.com CY Choi: this label experiments with classic codes of menswear to create an avant-garde yet modern look. cychoi.com Low Classic: a high-street brand known for its minimal-yet-youthful designs. lowclassic.com ",
    "datetime": "2013-05-06T11:16:51+08:00",
    "url": "https://www.scmp.com/lifestyle/fashion-watches/article/1231301/heart-and-seoul-fashion-korean-opportunities"
}