{
    "title": "Heat wave blamed for 53 deaths in Montreal - Montreal | Globalnews.ca",
    "text": "Instructions: Want to discuss? Please read our Commenting Policy first. If you get Global News from Instagram or Facebook - that will be changing. Find out how you can still connect with us. This article is more than 5 years old and some information may not be up to date. Montreal public health officials say up to 53 deaths have been linked to a recent heat wave that engulfed southern Quebec. The muggy temperatures and blistering heat, which lasted from June 30 to July 7, broke records after it reached more than 40 degrees with the humidex some days. READ MORE: Heat wave smashes records around the world — a look at the sizzling temperatures In a report released Wednesday, health authorities confirmed majority of those who died in Montreal were men who lived alone. Most of them were older, and didn’t have access to air conditioning. They were members of vulnerable communities, such as people who suffered from mental or chronic illness and addiction. The majority who died from from heat-related complications lived in private dwellings, but public health says four lived in rooming houses and eight victims lived in private seniors’ residences. READ MORE: Quebec farmers hoping for rain after drought, heat wave threaten crops Public health also found most of the victims also lived in “heat islands,” which are spots in a city that are significantly warmer than surrounding rural areas because of human activity and development. The province said last week that up to 70 people died from heat-related complications across the province. Montreal public health also released recommendations to prevent and offer help to vulnerable residents during a heat wave. It says there needs to be greater collaboration with community organizations involved with rooming houses to check on up Montrealers when temperatures begin to rise. Health authorities recommend finding a more precise manner to identify neighbourhoods where door-to-door checks could help prevent deaths. The rising number of deaths also prompted Montreal public health to suggest fighting the heat island effect by planting more trees and vegetation. An investigation is underway into heat-related deaths and the report is expected to be completed by December. Get a roundup of the most important and intriguing national stories delivered to your inbox every weekday. Get a roundup of the most important and intriguing national stories delivered to your inbox every weekday. ",
    "datetime": null,
    "url": "https://globalnews.ca/news/4338998/heat-wave-blamed-53-deaths-montreal/"
}