{
    "title": "Here's why millions of Americans are binge-watching Korean dramas  - Vox",
    "text": "Filed under: It used to be that the TV series Americans were able to consume were all pretty much produced right here in the US. Acclaimed shows from other shores — even countries that spoke English — rarely showed up in America, and if they did, it was only sporadically on PBS. But in the last several years, that's been changing. More and more British, Canadian, and Australian series arrive here every day, and sites like Hulu bring in shows that aren't in English (like Hatufim, the Israeli show that served as inspiration for Homeland). And then there's DramaFever, an online video streaming service specializing in TV series and films from Asia. DramaFever has become one of the leading distributors of international content in the United States since its 2009 launch. \"we thought our audience was going to be korean-american — and we couldn't have been more wrong.\" DF says its total monthly unique viewers — which includes syndication partners like Hulu and YouTube — quadrupled from 2012 to 2013, growing from 2.5 million to 10 million. And it just keeps growing, currently sitting at 20 million. Big brands have noted this rapid growth, as Ad Week reports. Toyota, AT&T, Verizon, and Samsung have all purchased ads on DramaFever. The site's content is available in more places than ever and has expanded beyond Asian programming: it's signed deals with Hulu, AMC, and YouTube, and in December 2012, it began streaming programming from Spanish language broadcaster Telemundo. When DramaFever launched with just four employees, co-founders Suk Park and Seung Bak weren't expecting things to take off quite like they did. \"When we started five years ago, we thought our audience was going to be Korean-American,\" Park told me over the phone. \"But we couldn't have been more wrong.\" Indeed, 85 percent of DramaFever's audience, Park said, is non-Asian, with 45 percent being Caucasian and 25 percent being Latino. \"All types of ethnicities,\" Park told me, \"are seeking out foreign content\" because it \"speaks to them more than … traditional television.\"  (DramaFever) DramaFever carries a diverse library of content but is mostly known for its Korean dramas, more popularly known as K-dramas. K-dramas vary in story and setting, of course, but what they have in common is that each series is self-contained — meaning, one season long and telling a complete story — and usually takes as its central plot a chaste romance. In fact, a first kiss usually happens seven or eight episodes into the narrative, which usually contains around 16 to 20 episodes. \"What is focused on [in K-dramas] is relationships,\" Park said. \"Not really sex but how true lovers struggle to make romance a reality.\" \"Entertainment is a gateway to culture.\" Take, for example, DF's new drama Blade Man, which tells the love story of a video game executive and a game designer. It sounds pretty much like the setup for your typical meet cute, until you realize that the rich executive, played by Korean star Lee Dong-Wook, has a condition where his anger manifests as actual blades growing from his body. Then there's My Love From The Star — which is being remade by the American network ABC — which is about a famous actress who falls in love with a 400 year-old alien. And in a few weeks, DF will premiere Servant, which the streaming service is billing as a version of Sex and the City set during the time of Korea's Chosun Dynasty. Park admits that DramaFever's content differs from what Western audiences are used to. But that might be why his service is finding such success. According to Park, Millennials — who make up DF's largest audience — think it's important to explore cultural narratives that differ from their own. As a \"machine of empathy,\" Park thinks television is one way to open up and explore fresh narratives. \"Entertainment is a gateway to culture,\" he says.  Jung Ji-hoon and Krystal Jung in My Lovable Girl. (DramaFever) K-dramas differ from American soaps in ways other than their lack of sex. Park told me much of his site's content is \"deeply rooted in traditional Confucian values,\" like responsibility and respect. Most of DF's stories, says Park, explore the tension between loving someone and \"the responsibility that character feels to his family, career, and other types of relationships.\" Seventy percent of DramaFever's catalogue is from Asia, with more than half of that comprised of Korean titles. The rest is imported from Japan, Taiwan, and other Asian countries. DramaFever also airs the aforementioned Spanish-language content from Telemundo, and its children's channel includes animated programming from France and the United Kingdom. \"It's never too early to expose kids to different storytelling from around the world,\" says Park. A writer at Dramabeans, known as Javabeans, was quoted in CNN discussing how pop culture provides a \"depoliticized\" bridge between two disparate cultures. Dramas and pop culture bridge a gap that can't be achieved through official policy or political maneuvering. What people respond to is the universality of the themes, coupled with the unique perspective of this one particular culture. It's fresh, without being quite foreign. In cultivating Hallyu abroad, you've exported your cultural perspective in a warm, friendly package.  That K-dramas have bolstered South Korea's cultural capital is quite established. In May 2013, Park was invited to Los Angeles to participate in the Leaders' Meeting for Creative Economy. The meeting brought together South Korean government and entrepreneurs to discuss Korea's economic growth on the world stage. Park was there to discuss how DramaFever and similar initiatives were helping to bolster South Korea's global influence. \"We've always believed,\" he said in a press release, \"that through the distribution of Korean content we are increasing Korea's country brand and promoting its culture and global initiatives.\" In political terminology, what Park is talking about is called soft power — a term coined by Joseph Nye to refer to \"the ability to achieve goals through attraction rather than coercion.\" Unlike hard power, writes Nye, South Korea's soft power \"is not prisoner to … geographical limitations,\" meaning its cultural influence can easily exceed its borders, so long as a global demand for its products exists. And as DramaFever's numbers show, this demand is already there.  Kim Soo-hyun and Jun Ji-hyun in My Love From Another Star. (DramaFever) America's fascination with all things K dates back to the 90s, when the Korean Wave — called hallyu — made its way from its East Asian home and suddenly swept over much of the globe, shining a light on South Korea's unique pop culture. pop culture provides a depoliticized bridge between disparate cultures There's always talk about diversity in entertainment, and the upshot is usually that we could use more of it. Engaging with viewpoints different from our own is a necessary exercise, and in watching TV series and movies from other countries, we can imagine what it might be like to live there, even as we realize just how universal many of these stories truly are. For while many of DramaFever's narratives seem to push against Hollywood's most famous tropes, the site's PG stories might be closer to home than we think. As K-drama-obsessed Claire Carusillo notes in Vice, \"There's no nationalism in liking to look at attractive people while they look at each other and decide whether or not to make out.\" And as long as that's true, the US will have plenty of viewing options, beyond just the homegrown. Will you support Vox’s explanatory journalism? Most news outlets make their money through advertising or subscriptions. But when it comes to what we’re trying to do at Vox, there are a couple reasons that we can't rely only on ads and subscriptions to keep the lights on. \r\n\n\r\nFirst, advertising dollars go up and down with the economy. We often only know a few months out what our advertising revenue will be, which makes it hard to plan ahead.\r\n\n\r\nSecond, we’re not in the subscriptions business. Vox is here to help everyone understand the complex issues shaping the world — not just the people who can afford to pay for a subscription. We believe that’s an important part of building a more equal society. We can’t do that if we have a paywall. \r\n \n\r\nThat’s why we also turn to you, our readers, to help us keep Vox free.  If you also believe that everyone deserves access to trusted high-quality information, will you make a gift to Vox today? $5/month $10/month $25/month $50/month We accept credit card, Apple Pay, and\n              \n\n                Google Pay. You can also contribute via The day's most important news stories, explained in your inbox. Check your inbox for a welcome email. Oops. Something went wrong. Please enter a valid email and try again. ",
    "datetime": "2014-09-24T14:00:03-04:00",
    "url": "https://www.vox.com/2014/9/24/6832951/heres-why-millions-of-americans-are-binge-watching-korean-dramas"
}