{
    "title": "Here are the winners of the 2020 Soribada Best K-Music Awards |",
    "text": "The winners of the 2020 Soribada Best K-Music Awards are out. Presented by Korean music portal Soribada, the awards show is held annually in celebration of the best musicians in K-pop. This year marks its 4th edition, which happened over Thursday (13/8) at the Olympic Gymnastics Arena in Seoul. Hosted by Jun Hyun Moo and Jin Se Yeon, it saw the biggest artists of the year dominate the list such as TWICE, TXT, Red Velvet, and NCT Dream. BTS received their Daesang, Bonsang and Favourite Male Bias awards remotely. The awards show also featured a string of performances by some of the attending artists. Screenshot of TWICE performing 'More & More' (cr: HiTZ K-POP) Screenshot of Stray Kids performing 'God's Menu' (cr: Kplo K-Music Live [VOD]) Screenshot of Kang Daniel performing 'TOUCHIN' (cr: Kplo K-Music Live [VOD]) Here's a list of this year's winners: Daesang: BTS Artist of the Year Award: TWICE Music of the Year Award: Red Velvet Stage of the Year Award: Kang Daniel Bonsang: Im Young Woong, NCT Dream, Oh My Girl, GFriend, MAMAMOO, VICTON, AB6IX, Red Velvet, TWICE, IZ*ONE, ASTRO, Kang Daniel and BTS Real Fan Award: Kang Daniel Performance Awards: (G)I-DLE and The Boyz Global Artist Award: ASTRO Favourite Male Bias Award: BTS Favourite Female Bias Award: TWICE New Voice Awards: Kim Jaehwan, Kim Wooseok and Ha Sungwoon Hallyu Artists Awards: TXT and ITZY Global Hot Trend Awards: Stray Kids and IZ*ONE K-Wave Rising Trot Awards: Kim Soo Chan and Kim Dabi K-Wave OST Awards: Gaho K-Wave Music Icon Awards: ONEUS and Cosmic Girls K-Wave Rising Artist Awards: GWSN, Loona and Nature K-Wave Next Artist Awards: DKB and AleXa Artist Awards: CRAVITY, TOO and MCND K-Wave Producer Awards: Kim Do Hoon K-Wave Songwriter Awards: A Coma, Lee Han Gil Winners are determined by Soribada’s internal data, international mobile votes as well as ratings from professionals. Check out some of the most retweeted (mixed) fan reactions below: For 4 consecutive years, TWICE has won the prestigious DAESANG award at the 2020 Soribada Best K-Music Awards since 2017!They are the only girlgroup to receive the Daesang since the award show is created 👏#TWICE #트와이스 @JYPETWICE #TWICEatSOBA2020 pic.twitter.com/YW9u2EI0HK  You did a great job during Soribada voting season, ARMYs! With BTS, everything's worth it. Let's win more awards for them on the other award shows. Let's not settle for less because our boys deserves the BEST.Indeed, TEAMWORK MAKES THE DREAMWORK. 💜 pic.twitter.com/pkbbzpQboO  BTS won Soribada awards 2020 Daesang! They sent the acceptance speech by the VCR. By the way, they have the Dynamite teaser photo hair colors!! @BTS_twt pic.twitter.com/1b7Jtdymy4  CONGRATULATIONS TO GOT7 FOR WINNING THE MOST ROBBED ARTIST OF THE YEAR. NBTM CHARTED NO.1 ON SORIBADA CHART, DYE SOLD OVER 400K COPIES, 50 ITUNES #1, GOT7 ALWAYS IN THE TOP 3 ON SOBA VOTING, THEN THIS SNAKIE AWARD SHOW DIDN'T GIVE THEM A SINGLE AWARD? #GOT7 @GOT7Official  So you are telling me EXO, Baekhyun and EXO SC didn't won any award in Soribada award???? When EXO sold 800K+ albums, Baekhyun the only million seller after 20 years and EXO SC the best selling sun unit didn't even got Bonsang???? But of course what can you expect from that snake  - 2011 - 2023 Bandwagon Pte Ltd or sign in with your Bandwagon account ",
    "datetime": "2020-08-14T12:15:00+08:00",
    "url": "https://www.bandwagon.asia/articles/winners-of-the-2020-soribada-best-k-music-awards-bts-twice-nct-dream-red-velvet-txt"
}