{
    "title": "Historic Summit Fueled Push for K-12 Standards",
    "text": "Twenty-five years ago this month, President George H.W. Bush and the nation’s governors took an unprecedented step that poured political accelerant on the nascent movement for standards-based education reform: They proclaimed that the country needed to set educational goals on issues ranging from early-childhood education to adult literacy, and to hold itself accountable—somehow—for meeting them. That agreement was forged during a two-day summit in Charlottesville, Va., that brought the White House together with the chief executives of nearly every state to discuss a single policy issue, for only the third time in American history. The Sept. 27-28, 1989, gathering at the University of Virginia concluded in a haze of bipartisan camaraderie with Mr. Bush commending his future presidential opponent, Arkansas Gov. Bill Clinton, for his role in helping bring about consensus.  But big questions loomed amid the fanfare: Exactly what should those education goals be, and what steps should the federal government and states take to reach them? Who should foot the bill for any new policies directed at the goals? And, perhaps most important: How should the nation measure progress toward the goals, and who was best positioned to do that measurement?  Two and a half decades, four presidential administrations, and countless laws and marquee initiatives later, educators and policymakers are still searching for the answers. Questions remain even as a majority of states have taken concrete and sometimes controversial steps to realize the vision that emerged from the summit. “It was a very optimistic time: We really thought, as governors, that we could really make a difference, and we could do it over a relatively short period of time. The White House was right with us,” said Thomas H. Kean, an early leader in the standards movement who took part in the event as the Republican governor of New Jersey. “We haven’t had a moment like that since, on any subject.” At the same time, there were some clear fissures that emerged in Charlottesville and afterward, as policymakers struggled to find a framework for moving forward on the goals set after the summit.  There was disagreement over education funding; the right balance among federal, state, and local control in setting policy; and tension over whether schools could be held accountable for student achievement without policymakers also being held to account for providing certain supports, such as preschool programs for poor children.  Such tensions still reverberate, most recently in the contention over the Common Core State Standards Initiative. “The common core is a descendant” of Charlottesville and its aftermath, Mr. Kean said. “And so is the debate against it.” The 1989 summit, to its supporters, was an acknowledgment that thousands of school districts—and even 50 states—working alone, without national leadership, couldn’t confront the challenges enumerated by the landmark report A Nation at Risk, issued six years earlier. That report, which had helped spawn a wave of state-level reform efforts, particularly in the South, warned that the American education system was falling behind its international competitors, threatening the nation’s future prosperity. While the report’s premises were subject to dispute, its impact was great. The Charlottesville conference, which was attended by 49 of the nation’s governors, with the exception of Rudy Perpich, a Democrat from Minnesota, received front-page attention in major newspapers. But the work was only beginning when the president and the governors left Virginia.  After months of meetings—which generally included Mr. Clinton, at that time a leader of the education task force of the National Governors Association; and Roger B. Porter, Mr. Bush’s domestic-policy adviser—the goals became a centerpiece of President Bush’s State of the Union address in January 1990. By 2000, Mr. Bush told the country, every child in the United States would start school ready to learn, and the high school graduation rate would rise to at least 90 percent. Every American adult would be a literate and skilled worker. The nation would lead the world in math and science achievement. Schools would be safe and drug-free. President George H.W. Bush used his 1990 State of the Union address to champion goals spurred by the previous September’s education summit. By the year 2000, all children will start school ready to learn. WHERE WE STAND NOW: Twenty-eight percent of 4-year-olds attended state-funded preschool programs, according to the National Institute for Early Education Research’s most recent report on preschool participation, released in 2013. Meanwhile, many states are implementing kindergarten-readiness assessments intended to help teachers shape instruction, but those assessments vary in what they measure and how their results are used. By the year 2000, the high school graduation rate will increase to at least 90 percent. WHERE WE STAND NOW: The four-year graduation rate in the United States hit a historical high in the 2011-12 school year of 80 percent, according to a report released in April by the Institute of Education Sciences, the U.S. Department of Education’s research arm. By the year 2000, American students will leave grades 4, 8, and 12 having demonstrated competency in challenging subject matter, including English, mathematics, science, history, and geography, and every school in America will ensure that all students learn to use their minds well, so they may be prepared for responsible citizenship, further learning, and productive employment in our modern economy. WHERE WE STAND NOW: Twenty-six percent of 12th grade students scored at or above the “proficient” level in mathematics on the 2013 National Assessment of Educational Progress, or NAEP. The same year, 37 percent of 12th graders scored at or above the “proficient” level in reading. By the year 2000, U.S. students will be first in the world in mathematics and science achievement. WHERE WE STAND NOW: Twenty-nine nations and jurisdictions outperformed the United States in math by a statistically significant margin, according to the most recent Program for International Student Assessment, or PISA, administered in 2012. In science, 22 education systems scored above the U.S. average. By the year 2000, every adult American will be literate and will possess the skills necessary to compete in a global economy and exercise the rights and responsibilities of citizenship. WHERE WE STAND NOW: Policymakers continue to express concern that Americans lack the skills necessary to compete in a global economy. Advocates of the Common Core State Standards often cite workforce readiness as a key justification for the initiative. According to a 2013 report by the Organization for Economic Cooperation and Development, 17.5 percent of American adults scored at the lowest levels in literacy based on an international survey. By the year 2000, every school in America will be free of drugs and violence and will offer a disciplined learning environment conducive to learning. WHERE WE STAND NOW: Between 1995 and 2011, the percentage of students ages 12 to 18 who reported being afraid of attack or harm at school decreased from 12 percent to 4 percent, according to the 2013 Indicators of School Crime and Safety report from the Institute of Education Sciences and the Bureau of Justice Statistics. The percentage of students in grades 9-12 who reported that illegal drugs were offered, sold, or given to them decreased from 32 percent in 1995 to 26 percent in 2011, according to the same report. SOURCES: Institute of Education Sciences; Bureau of Justice Statistics; Program for International Student Assessment; National Institute for Early Education Research; Education Week  And, most critically: Every student would leave grades 4, 8, and 12 having demonstrated competency in English, mathematics, science, history, and geography. The goals reflected a “ ‘Field of Dreams’ optimism,” said Jal Mehta, an associate professor at the Harvard Graduate School of Education. “If we built the goals, then schools would meet them.” There was no clear path forward for bringing the goals to fruition, and no way to measure progress toward them, said Mr. Mehta, the author of The Allure of Order: High Hopes, Dashed Expectations, and the Troubled Quest to Remake American Schooling. But Michael Cohen, who played a key role backstage at the summit as the director of education policy for the NGA, said the goals were intentionally aspirational.  “People understood these goals were high, lofty, difficult to reach,” said Mr. Cohen, who later served in the U.S. Department of Education during the Clinton administration. And in 1990, the NGA’s education task force, led by then-Gov. Clinton, a Democrat, and Gov. Carroll A. Campbell of South Carolina, a Republican, released a blueprint for meeting the goals that had a significant impact on subsequent state efforts to improve education, Mr. Cohen said. What’s more, he said, savvy governors, including Mr. Clinton, knew that the need for assessment measures would stir the policy pot. “They were happy to be doing something that they hoped would usher in the next generation of testing. … Work on standards and testing and accountability has been a federal-state partnership since the beginning, and the beginning started at the summit,” said Mr. Cohen, who is now the president of Achieve, a Washington-based group that helps states bolster academic standards and played a key role in launching the common-core standards. But Linda Darling-Hammond, a professor of education at Stanford University, said policymakers have ultimately failed to pair standards with increased resources for schools and richer professional development for educators. That’s something that was happening in states such as Kentucky at the beginning of the standards movement but, in her view, it hasn’t been as widespread as it needs to be in the common-core era. “Just getting standards and attaching them to tests, which are attached to consequences, is not really enough,” Ms. Darling-Hammond said. Disadvantaged children, especially, need greater supports if they are going to meet more rigorous expectations, she said, which is something policymakers haven’t really addressed on a national level.  “The inequality question never got answered,” she said. The consensus that educational standards and accountability needed to be part of a national strategy to ensure that the United States remained economically competitive gave rise to a cascade of K-12 initiatives, each identified with successive presidential administrations. The first President Bush followed up the summit with America 2000, a plan that called for voluntary national standards and tests. Congress, which had been left out of the goals summit, never passed the proposal. The Bush administration nonetheless financed the development of voluntary standards in a range of subjects. That effort ultimately faltered in the mid-1990s, in part because of conservative opposition to the American history standards, and in part due to concern over the federal role in encouraging the standards’ development. Mr. Clinton, who was elected president in 1992, crafted Goals 2000, which borrowed ideas from Mr. Bush’s plan. The Clinton initiative provided grants to help states develop content standards and created a panel to sign off on model state and national standards. Standards-based education redesign was also encouraged through the 1994 reauthorization of the Elementary and Secondary Education Act, dubbed the Improving America’s Schools Act.  The standards panel was eliminated by Congress after Republicans took control following the 1994 elections. But by the time Mr. Clinton left office after two terms, nearly every state had set academic expectations, and many had begun to assess their students. In 2001, President George W. Bush picked up the ball with the No Child Left Behind Act, his overhaul of the ESEA, which put the federal government front and center in ensuring that assessments and federally mandated school improvement remedies were a feature of every state’s accountability system. And President Barack Obama later encouraged states to adopt the common-core standards through his signature Race to the Top grant competition and waivers from the mandates of the NCLB law. Standards-based education reform remains controversial. But the past four presidents—although of different parties—have each made a pivotal contribution to the standards movement, said Marc S. Tucker, the president of the National Center on Education and the Economy, a Washington research group. Mr. Tucker also writes an opinion blog for Education Week. “What began at Charlottesville was a long march of a bipartisan [movement] to fundamentally change the system,” said Mr. Tucker, who served as an unofficial consultant to the cadre of officials involved in developing the goals. “It had good results and bad, but it survived changes in administration in a way that few things did. It was not A Nation at Risk that did that. It was Charlottesville.” Charlottesville also is sometimes credited with helping to crack open the door to more federal involvement in K-12 education.  But the participants didn’t see the summit that way at the time, said Paul Manna, an associate professor of government at the College of William and Mary, in Williamsburg, Va., and the author of School’s In: Federalism and the National Education Agenda. “The governors were really looking at the summit as a way to advance some ideas about standards and advance their own position,” he said. Before the first President Bush called the summit, governors had collaborated on their own educational goals and improvement efforts through groups such as the NGA and the Southern Regional Education Board. Governors wanted political cover to move forward on standards-based reform, Mr. Manna said. And some sought more federal aid, especially for early-childhood education. But the governors didn’t want—or expect—the federal government to take more responsibility for student outcomes, he said. Washington, meanwhile, had been focused primarily on steering aid to disadvantaged students and students in special education, not on prodding states to measure what students needed to know and be able to do. While the White House may have used the summit to help the senior Mr. Bush make good on his 1988 campaign promise to be the “education president,” the administration expected leadership to come from the state level.  In fact, in selecting Charlottesville as the site for the meeting, Mr. Bush intended to send a clear signal that the states were the power center on K-12 policy, said Mr. Porter, a professor of business and government at Harvard University. The two previous presidential-gubernatorial summits—on the economy during the Great Depression, and on conservation in 1908—both took place in the White House. Mr. Porter suggested holding the 1989 education meeting there, too. “The president said, ‘I don’t want to do it in Washington. That will send the message that Washington is where the solutions will come from,’ ” Mr. Porter recalled. The increase in the federal footprint came years later, Mr. Cohen said, as policymakers—particularly in Congress—became frustrated with the pace of educational progress. The nation “didn’t seem to be getting the results we wanted,” he said. “We tightened the screws again and again,” first with NCLB and then with the Obama administration’s waivers. Soon after the summit, it became clear that there needed to be some entity to track the nation’s progress toward the goals, if the country was going to sustain the momentum. Also, Democratic governors in particular wanted a mechanism to hold the federal government—and themselves—accountable if there wasn’t going to be a major infusion of federal money to help meet the goals, something the Bush administration largely took off the table, Mr. Cohen said. To do that, the governors and the White House created the National Education Goals Panel, originally consisting of six governors and four members of the administration, along with several members of Congress who served ex officio.  But it was clear from the panel’s first report, issued in the fall of 1991, that a lack of clear assessment measures complicated the task. “The national goals panel had a [task] that was almost impossible to achieve,” said Roy Romer, a Democrat who participated in the summit as governor of Colorado and later chaired the goals panel. “We didn’t have national systems of measurement that were accurate,” and the goals themselves had “unrealistic expectations of students.” At a 15th-anniversary event commemorating the summit, Richard W. Riley, the former governor of South Carolina who later served as Mr. Clinton’s secretary of education, from 1993 to 2001, would put his finger on the limitations of the goals approach. “Even though we failed to achieve those goals, that failure taught us something about how hard it is to achieve education reform at the national level,” he said. “If you don’t put money and teeth behind the goals, not much is going to happen. Also, education improvement takes time.” How close is the nation to fulfilling the vision of the summit and the national education goals it spawned? The common core and its aligned tests are an obvious heir of Charlottesville, those who were involved with the summit say. Beyond sharing the aim of a national approach to a more rigorous education system, the common-core initiative also was spurred by a multistate partnership, with federal encouragement and assistance.  The common standards have been hit with conservative criticism. So were the policies promoting standards that the first President Bush pursued after the summit and that President Clinton advanced with his Goals 2000 initiative. That doesn’t mean the standards movement hasn’t come a long way since 1989, said James B. Hunt Jr., an early leader in the effort who served as governor of North Carolina from 1977 to 1985, and from 1993 to 2001. “I think we’ve got pieces of it,” he said. “We have set goals, and put in approaches to measure their progress and reward success and require changes if we’re not succeeding. I think all of the fuss about common core has sort of obscured that for now.” But Marshall S. Smith, who served in top posts in the Education Department during the Clinton administration and as an informal consultant to policymakers in developing the goals, said the political climate is markedly different now. “Even though the goals themselves were outrageous in their stretch, people came out of Charlottesville with a good feeling that the country could move on them,” Mr. Smith said. “I don’t think we have that sense across the country now.” Librarian Holly Peele contributed to this article.A version of this article appeared in the September 24, 2014 edition of Education Week as 1989 Education Summit Casts Long Shadow ",
    "datetime": "2014-09-24T02:44:08",
    "url": "https://www.edweek.org/teaching-learning/historic-summit-fueled-push-for-k-12-standards/2014/09"
}