{
    "title": "Hooray for Hallyu",
    "text": "Molly Mastantuono (Above, clockwise from top left: K-pop band BTS, the South Korean flag, K-beauty and Parasite director Bong Joon-ho. Center: K-pop band Blackpink.) Isabela Agra ‘20 never dreamed that her love of K-pop — the energetic and infectious music synonymous with South Korea — could harmonize with a business degree. The Liberal Studies major at Bentley taught her otherwise. Growing up in Sao Paulo, Brazil, Agra was always fascinated by cultures beyond her own. “I knew I wanted to go to college in another country,” she says. “A friend moved to the U.S. just as I was starting high school, and her older brother went to Bentley. He had great things to say, so it was tops on my list.” In her first year on campus, Agra chose to live in a defined community, an option for students with similar interests. Hers had a global theme: “All of us came from different places and wanted to learn about other countries and cultures.” She and two other students — one from Hong Kong, the other of Chinese American heritage — bonded over their shared love of K-pop artists like GOT7 and iKON. As the friendship grew, so did Agra’s interest in South Korea. She took Korean language lessons and, later, put the skills to use visiting one of those friends, who was studying in Seoul. Soon after arriving at Bentley, Agra chose a business major: Economics-Finance. But a first-year Global Studies course awakened her to further possibilities. “Every day, we’d talk about what was happening in the world, not only as it related to business, but also how it affected us personally,” she explains. “I realized I could harness my passion and curiosity for foreign cultures in a way that would complement my business degree.” That led Agra to Liberal Studies, an integrated double major where business students enhance their studies through concentrated liberal arts courses. The major gives students maximum flexibility to customize their education. It offers nine distinct concentrations — including Global Perspectives, Agra’s choice — and ends with an intensive research project that students design with support from a faculty adviser. Agra’s culminating project was a deep dive into South Korean culture, specifically Hallyu, which translates as “Korean wave.” Coined by Chinese journalists, the term refers to the global popularity of the nation’s music, films and consumer goods such as cosmetics and fashion. “It was the perfect topic, allowing me to touch on things such as globalization, media, and expressions and interpretations of cultures,” Agra notes. “I connected it to my Eco-Fi major by focusing on Hallyu’s economic impact.” Her research found that Hallyu isn’t a spontaneous cultural phenomenon, but rather the calculated result of targeted economic policies. That was a surprise, she says. “We mostly think of a nation’s culture as separate from its economic development.” In the mid-1990s, the South Korean government began leveraging its culture as way to revive a sluggish economy. From lifting its ban on foreign travel to investing in high-tech infrastructure and startup companies, the nation ultimately — and effectively — monetized cultural diplomacy: In 2019, Hallyu-related exports totaled $12.3 billion. Initially, Hallyu’s  popularity was confined to other Asian nations.  But social media extended its reach — as evidenced by recording artist Psy’s  “Gangnam Style,”  which became the first YouTube video to reach a billion views. Western audiences have since embraced other Hallyu musicians, most notably boy band BTS, the first  K-pop group to win a Billboard Music Award, and Blackpink, a girl group that recently collaborated with platinum-selling  Mexican American singer and actress Selena Gomez. But music is only one area where Hallyu is making its mark. Korean dramas are popular options on global streaming giant Netflix, while the black comedy Parasite took home four Oscars at the 2020 Academy Awards, including Best Film — the first non-English language movie to do so. Korean cosmetics, or K-beauty, also dominate global markets. All of these avenues, Agra says, are ways the South Korean government cultivates “soft power,” or the ability to influence other nations through collaboration instead of coercion. And, as her research made clear, soft power translates into hard currency. “After the Korean War, and throughout the 1980s and early ‘90s, South Korea’s economy was fairly stagnant,” she reports. “Today, thanks largely to Hallyu, it has the world’s 12th-largest economy.” Now back in Brazil and working for Johnson & Johnson, Agra plans to attend graduate school in — no surprise — South Korea. She’s confident that her Bentley degree will distinguish her from other candidates. “The Liberal Studies major lets you delve into subjects that may seem unrelated, but at the end of the day, they make your understanding of business more holistic and well-rounded,” she says. “My research was such an enriching experience, and it’s made me a better economist.” ",
    "datetime": null,
    "url": "https://www.bentley.edu/news/hooray-hallyu"
}