{
    "title": "Hopes for K-pop and Korean drama revival in China high after Mamamoo concert broadcast | South China Morning Post",
    "text": "The live broadcast of K-pop girl group Mamamoo at a Chinese festival last week adds to growing evidence that frozen ties between Chinese and Korean entertainment businesses are thawing and ‘hallyu’ might start flowing again By Park Jin-hai Hopes for a revival of hallyu – meaning “Korean wave” and referring to the spread of South Korea’s popular culture – in China are growing as Beijing moves to lift its ban on Korean cultural imports, including K-pop and K-dramas. After South Korea and China agreed to end disputes regarding the Terminal High Altitude Area Defence (THAAD) system, industry experts predict a thaw in frozen ties between Korean and Chinese entertainment businesses. The ban, a retaliatory measure against Seoul’s decision to deploy a US missile defence system, has been in place since July last year. As a change of turn, the performance of K-pop girl group Mamamoo at a Chinese festival was broadcast live last Wednesday, while a Chinese TV station ran a special broadcast about the upcoming 2018 PyeongChang Winter Olympics on the same day. Reflecting this positive mood, local drama production companies are planning future projects with China, which had been the biggest consumer of Korean entertainment products before the ban. “Contacts from China’s online video services … are asking about drama line-ups for next year. I see the Chinese market will be open to K-culture again,” says Hwang Ki-young, head of drama production division at South Korean talent agency iHQ, which produced the romantic comedy While You Were Sleeping. Park Sang-joo, director of Corea Drama Production Association, says: “I heard that China’s major online platforms bought two Korean dramas, but are waiting until the ban is lifted.” Despite China’s ban on Korean celebrities appearing on TV, the popularity of Korean stars seems far from waning. The private wedding of celebrity couple Song Joong-ki and Song Hye-kyo was broadcast live on Chinese social media platforms, hitting 200 million views on Weibo and Baidu. In March, China’s largest online video-sharing platforms Youku and Sohu covered a formal dinner held in Seoul to celebrate the end of shooting for actor Park Hae-jin’s TV series Man to Man. In June, G-Dragon’s solo album Kwon Ji Yong set a record in selling more than 760,000 copies on the day his album was released on QQ Music, the biggest music site in China. But others say it is too early to paint a rosy picture. “It is true that I can now see an amicable mood from officials of Chinese production companies,” Park says. “But they say Korea is in some sense jumping to conclusions and the strained relationship between the two countries has not recovered yet. I also believe the ban will last over a year and will not disappear all of a sudden.” Hwang says that if hallyu content re-enters the Chinese entertainment market, it will be very different from before because China has strengthened the competitiveness of its own cultural content. Also, a lot of Japanese content has filled the void that was left by the ban. “Up until the ban, the price for Korean cultural content had been on a steep rise. But since the market environment there has changed, we need to wait and see,” Hwang says. “Since China has always moved to protect its own content and limited the spread of Korean content, even if the market reopens, it will not be as widely open as before. It could take measures like reducing the import quota for Korean entertainment content.” ",
    "datetime": "2017-11-08T08:00:00+08:00",
    "url": "https://www.scmp.com/culture/music/article/2118754/hopes-k-pop-and-korean-drama-revival-china-high-after-mamamoo-concert"
}