{
    "title": "How K-Pop is making waves in India - The Week",
    "text": "If you are a millennial who does not reside under the proverbial rock, chances are that the words ‘BTS’ or ‘K-Pop’ would have popped up on your social media feed at least once in the recent times. Having exponentially gained traction over the past years, Korean Pop has now evolved into a phenomenon that has swept the world music scene, showing no signs of going anywhere anytime soon. India’s love affair with Korean culture has its epicentre in the northeastern parts of the country, specifically Manipur. When the separatist outfit known as the Revolutionary People’s Front took over the region, they banned all forms of Indian entertainment—including Hindi soaps, TV channels and Bollywood. This saw them turn to other sources for entertainment, and South Korean dramas and music soon found their way into the hearts of the people. Even now, years after the ban has been relaxed, Hallyu (the Korean wave) has a firm foothold in the northeastern society. While the reasons for this are still debated, many are of the opinion that the northeastern affinity towards Korean culture stems in part from their under-representation in the mainstream entertainment forms of their own country. Moreover, a similarity in appearance, cuisine and dressing style have all served to push the seven sisters closer to K-Pop. The rest of India probably had their first brush with K-Pop with the coming of the wildcard hit ‘Gangnam Style’ released by PSY in 2012. Breaking YouTube records and instantly attaining earworm status, Gangnam Style paved the way for future forays by K-Pop groups into the international scene. While groups like Girls Generation, EXO, Twice and SHINee have dedicated fan followings in India, recent phenomenon BTS (Bangtan Sonyeondan) seems to be the next big thing in international K-Pop. In 2017, the Indian edition of Rolling Stone magazine published an interview with BTS leader Kim Namjoon (stage name RM). Within minutes of its release, the Rolling Stone servers crashed due to overwhelming traffic on their website. Shortly afterwards, the hashtag #IndialovesBTS trended on Twitter, peaking at No 2 on the global trends list. In 2016, VH1 launched its segment KPopp’d on Saturdays. Popular music station 9XO soon followed suit, streaming several popular BTS songs on their channel. In other events, the 2017 World K-Pop Festival held in Changwon, South Korea, witnessed history being made—an Indian group, Immortal Army from Mizoram, carried home a trophy for the first time. Indian K-Pop fans have established their presence on social media as well. What is different about them is that they do not restrict themselves to drooling over posters or manically purchasing concert tickets. Most fan accounts systematically organise charity projects in the name of their chosen idols—a good example being how EXO-Ls (EXO fans) donated Rs 58,000 to an NGO in Mumbai. K-Pop Contest India, organised by the Korean Cultural Centre, started out six years ago in New Delhi, with barely 37 participants, and around 300 spectators. It is a testament to the growing popularity of K-Pop in India that the 2017 edition of the contest saw around 898 contestants, with regional rounds having to be held in around 11 cities to decide the final participants. Elsewhere, Christ University held its first Indo-Korean Utsav in July this year, with the Korean consul general in attendance. First hand reports say that the audience response was overwhelmingly positive, especially to student dance covers of popular K-Pop groups like BlackPink, BTS, and Momoland. Riya Cruze, a fashion student at NIFT, Hyderabad, says, “K-Pop is like a world unto itself. It is a lifestyle. From the music to the aesthetics and the message, it awakens a part of me that I never knew existed”. Samanya, who is now in her second year of engineering, agrees with her. “K-Pop has been a part of my life for more than five years now. I love how addictive the melodies are, and fandom is no joke. After a point, they become like family.” All these events point towards a definite acceleration in Indians embracing Korean culture—certainly a far cry from when two K-Pop idols (Suho and Minho of EXO and SHINee) roamed the streets of Mumbai unrecognised a few years ago. From the looks of it, K-Pop is here to stay. As Samanya says: “Once you fall into it, there’s no getting back up.” Copyright © 2023 All rights reserved ",
    "datetime": null,
    "url": "https://www.theweek.in/leisure/lifestyle/2018/10/22/the-spectacular-arrival-k-pop-subcontinent-india.html"
}