{
    "title": "How K-pop became a global phenomenon - Vox",
    "text": "Filed under: No country takes its fluffy pop music more seriously than South Korea. They call it Hallyu, the Korean wave: the idea that South Korean pop culture has grown in prominence to become a major driver of global culture, seen in everything from Korean dramas on Netflix to Korean skincare regimens dominating the cosmetics industry to delicious Korean tacos on your favorite local menu. And at the heart of Hallyu is the ever-growing popularity of K-pop — short, of course, for Korean pop music. K-pop has become a truly global phenomenon thanks to its distinctive blend of addictive melodies, slick choreography and production values, and an endless parade of attractive South Korean performers who spend years in grueling studio systems learning to sing and dance in synchronized perfection. Hallyu has been building for two decades, but K-pop in particular has become increasingly visible to global audiences in the past five to 10 years. South Korean artists have hit the Billboard Hot 100 chart at least eight times since the Wonder Girls first cracked it in 2009 with their crossover hit “Nobody” — released in four different languages, including English — and the export of K-pop has ballooned South Korea’s music industry to an impressive $5 billion industry. Now, with South Korea hosting the 2018 Winter Olympics in Pyeongchang at a moment of extremely heightened geopolitical tensions, K-pop has taken on a whole new kind of sociopolitical significance, as South Korea proudly displays its best-known export before the world. Vox explore K-pop’s elaborate music videos, adoring fans, and killer choreography for our Netflix series Explained. Watch now on Netflix.  During the Olympic opening ceremonies on February 9, 2018, athletes marched in the Parade of Nations to the accompaniment of a select group of K-pop hits, each playing into the image South Korea wants to present right now: one of a country that’s a fully integrated part of the global culture. The Parade of Nations songs all have significant international and digital presences, and each advertises the cross-cultural fluency of K-pop. Twice’s “Likey” is a huge recent hit for the group, and recently made it to 100 million views on YouTube faster than any other song by a K-pop girl group. (The video prominently features the girls on a fun field trip to Vancouver, marketing the idea that they’re at home all over the world.) Big Bang’s “Fantastic Baby” was one of the first K-pop hits to make inroads in American culture and was featured on Glee’s K-pop episode along with “Gangnam Style,” which also played during the Parade of Nations. Psy’s ubiquitous 2012 hit is part doofy comedy and part clear-eyed satire, made by a musician who’s part of a wave of South Korean musicians who’ve studied at American music schools. “Gangnam Style” spent five years racking up more than 3 billion views on YouTube, reigning as the most-viewed video in the platform’s history before being dethroned in 2017. As a whole, these songs and performers show us that K-pop stars can excel at everything from singing to comedy to rap to dance to social commentary. And their fun, singable melodies make it clear that the South Korean music industry has perfected the pop production machine into an effervescent assembly line of ridiculously catchy tunes sung by ridiculously talented people in ridiculously splashy videos. When Red Velvet sing, “Bet you wanna (bet you wanna) dance like this” in their single “Red Flavor,” they’re sending a message to the world that South Korea is modern but wholesome, colorful, inviting, and fun. And at the Olympics closing ceremonies, we saw live performances from two more K-pop icons: solo artist CL, formerly a member of the powerhouse girl group 2NE1, and multi-national band Exo. CL’s appearance was a testament to her success in achieving one of the holy grails for K-Pop — a crossover into US fame, or at least onto the Billboard Hot 100. CL has landed on the list twice since 2015. Exo, meanwhile, is arguably one of the two or three biggest K-Pop successes going right now. The band was a perfect fit for the Olympics — they’re multilingual and were formed with the intention of performing in Mandarin and Japanese as well as South Korea. And for several years, Exo was split into two subgroups, one performing mainly in Korea and one mainly in China. All of this made them a great choice to serve as a symbolic transition between nations, as Tokyo gets ready to host the 2020 Summer Olympics, followed by Beijing hosting the Winter Olympics in 2022. Prominently missing from the live performance roster at the Olympics was the most popular K-pop band in the universe at the moment: BTS. BTS became an uncontested US phenomenon in 2017, with two songs hitting the Billboard Hot 100, a huge performance at the American Music Awards, a New Year’s Eve performance in Times Square, and a remix of their latest single, “Mic Drop,” done by Steve Aoki. If it’s possible to ascribe a tipping point to a “wave” that seems to be endless, BTS might be it; it certainly seems that the all-boy group has gone as far as a South Korean band can go in terms of making inroads into American culture — they recently graced the cover of American Billboard magazine. But while the band was missing from the Olympics, their song “DNA” — the other of their pair of 2017 hits — did at least play during the opening ceremonies, much to the delight of fans. None of this is accidental. K-pop has become the international face of South Korea thanks to an extremely regimented, coordinated production system. More than any other international music industry, K-pop has been strategically designed to earworm its way into your brain — and to elevate South Korea and its culture onto the world stage. How did we get here? Through a combination of global political changes, savvy corporatization and media management, and a heck of a lot of raw talent being ground through a very powerful stardom mill. K-pop as we know it wouldn’t exist without democracy and television — specifically, South Korea’s reformation of its democratic government in 1987, with its accompanying modernization and lightening of censorship, and the effect this change had on television. Prior to the establishment of the nation’s Sixth Republic, there were only two broadcast networks in the country, and they largely controlled what music South Koreans listened to; singers and musicians weren’t much more than tools of the networks. Networks introduced the public to musical stars primarily through weekend music talent shows. Radio existed but, like the TV networks, was under tight state control. Independent music production didn’t really exist, and rock music was controversial and subject to banning; musicians and songs were primarily introduced to the public through the medium of the televised talent show, and radio served as little more than a subsidiary platform for entertainers who succeeded on those weekend TV competitions. Before the liberalization of South Korean media in the late ‘80s, the music produced by broadcast networks was primarily either slow ballads or “trot,” a Lawrence Welk-ish fusion of traditional music with old pop standards. After 1987, though, the country’s radio broadcasting expanded rapidly, and South Koreans became more regularly exposed to more varieties of music from outside the country, including contemporary American music. But TV was still the country’s dominant, centralized form of media: As of 1992, national TV networks had penetrated above 99 percent of South Korean homes, and viewership was highest on the weekends, when the talent shows took place. These televised talent shows were crucial in introducing music groups to South Korean audiences; they still have an enormous cultural impact and remain the single biggest factor in a South Korean band’s success. As Moonrok editor Hannah Waitt points out in her excellent series on the history of K-pop, K-pop is unusual as a genre because it has a definitive start date, thanks to a band called Seo Taiji and Boys. Seo Taiji had previously been a member of the South Korean heavy metal band Sinawe, which was itself a brief but hugely influential part of the development of Korean rock music in the late ‘80s. After the band broke up, he turned to hip-hop and recruited two stellar South Korean dancers, Yang Hyun-suk and Lee Juno, to join him as backups in a group dubbed Seo Taiji and Boys. On April 11, 1992, they performed their single “Nan Arayo (I Know)” on a talent show: Not only did the Boys not win the talent show, but the judges gave the band the lowest score of the evening. But immediately after the song debuted, “I Know” went on to top South Korea’s singles charts for a record-smashing 17 weeks, which would stand for more than 15 years as the longest No. 1 streak in the country’s history. “I Know” represented the first time modern American-style pop music had been fused with South Korean culture. Seo Taiji and Boys were innovators who challenged norms around musical styles, song topics, fashion, and censorship. They sang about teen angst and the social pressure to succeed within a grueling education system, and insisted on creating their own music and writing their own songs outside of the manufactured network environment. By the time Seo Taiji and Boys officially disbanded in 1996, they had changed South Korea’s musical and performance landscape, paving the way for other artists to be even more experimental and break even more boundaries — and for music studios to quickly step in and take over, forming an entire new studio system from the remnants of the broadcast-centered system. Between 1995 and 1998, three powerhouse music studios appeared: SM Entertainment (often referred to as SM Town) in 1995; JYP Entertainment in 1997; and YG Entertainment in 1998, created by one of the members of Seo Taiji and Boys, Yang Hyun-suk. Together, these studios began deliberately cultivating what would become known as idol groups. The first idol group in South Korea appeared on the scene in 1996, when SM founder Lee Soo-man created a group called H.O.T. by assembling five singers and dancers who represented what he believed teens wanted to see from a modern pop group. H.O.T. shared traits with today’s idol groups: a combination of singing, dancing, and rapping, and disparate personalities united through music. In 1999, the band was chosen to perform in a major benefit concert with Michael Jackson, in part because of their potential to become international pop stars — an indication that even in the ’90s, the industry was attuned to K-pop’s potential for global success. That potential can be seen in the studios’ eager promotion of multilingual artists like BoA, who made her public debut at the age of 13 in 2000 and in the ensuing years has become one of South Korea’s best-known exports thanks to a brand built on raw talent and multicultural positivity. All the while, K-pop as a whole was building its own brand, one based on flash, style, and a whole lot of quality. There are three things that make K-pop such a visible and unique contributor to the realm of pop music: exceptionally high-quality performance (especially dancing), an extremely polished aesthetic, and an “in-house” method of studio production that churns out musical hits the way assembly lines churn out cars. No song more perfectly embodies these characteristics than Girls’ Generation’s 2009 hit “Gee,” a breakout success that came at a moment when K-pop was starting to turn heads internationally due to a number of recent milestone hits — notably Big Bang’s “Haru, Haru,” Wonder Girls’ “Nobody,” and Brown Eyed Girls’ “Abracadabra.” “Gee” was a viral internet earworm, breaking out of typical K-pop fan spaces and putting Girls’ Generation within striking distance of US fame. The combination of cheeky, colorful concept, clever choreography, cute girls, and catchy songwriting makes “Gee” the quintessential K-pop song: It’s fun, infectious, and memorable — and it was all but algorithmically produced by a studio machine responsible for delivering perfect singing, perfect dancing, perfect videos, and perfect entertainment. The then-nine members of Girls’ Generation were factory-assembled into the picture-perfect, male-gaze-ready dolls you see in the song’s music video via extreme studio oversight and years of hard work from each woman — a combined 52 years of training in total, beginning in their childhoods. Through highly competitive auditions, starting around ages 10 to 12, music studios induct talented children into the K-pop regimen. The children attend special schools where they take specialized singing and dancing lessons; they learn how to moderate their public behavior and prepare for life as a pop star; they spend hours in daily rehearsals and perform in weekend music shows as well as special group performances. Through these performances, lucky kids can gain fan followings before they even officially “debut.” And when they’re old enough, if they’re really one of the lucky few, the studios will place them into an idol group or even, occasionally, launch them as a solo artist. Once an idol group has been trained to perfection, the studios generate pop songs for them, market them, put them on TV, send them on tour, and determine when they’ll next make their “comeback” — a term that usually signals a band’s latest album release, generally accompanied by huge fanfare, special TV appearances, and a totally new thematic concept. Because of the control they exert over their artists, South Korean music studios are directly responsible for shaping the global image of K-pop as a genre. But the industry is notoriously exploitative, and studio life is grueling to the point that it can easily cross over to abusive; performers are regularly signed to long-term contracts, known as “slave contracts,” when they are still children, which closely dictate their private behavior, dating life, and public conduct. The studios are also a breeding ground for predatory behavior and harassment from studio executives. In recent years, increasing public attention to these problems has given rise to change; in 2017, multiple studios agreed to significant contract reform. Still, as the recent suicide of Shinee artist Kim Jong-hyun revealed, the pressures of studio culture are rarely made public and can take a serious toll on those who grow up within the system. Despite all this, the cloistered life of a K-pop star is coveted by thousands of South Korean teens and preteens — so much so that walk-in auditions to scout kids for the studio programs are frequently held in South Korea and New York. In addition to studio auditions, a wave of new TV audition shows have sprung up in the past few years, giving unknowns a chance to be discovered and build a fan base. Often called idol shows or survival shows, these audition shows are comparable to American Idol and X-Factor. Competitors on these shows can make it big on their own or be grouped up — like the recently debuted group JBJ (short for the fan-dubbed moniker “Just Be Joyful”), consisting of boys who competed in the talent show Produce 101 Season 2 last year and then got put in a temporary group after fans started making composite Instagram photos of them all together. The band only has a seven-month contract; enjoy it while it lasts! These TV-sponsored idol shows have caused pushback from the studios, which see them as producing immature talent — and, of course, cutting into studio profits. That’s because a K-pop group’s success is directly tied to its live TV performances. Today there are numerous talent shows, along with many more variety shows and well-known chart TV countdown shows like Inkigayo and M Countdown, which factor into how successful — and therefore bankable — a K-pop idol or idol group is seen to be. Winning a weekend music show or weekly chart countdown remains one of the highest honors an artist or musical group can attain in the South Korean music industry. Because of this dependence on live performance shows, a song’s performance elements — how easy it is to sing live, how easy it is for an audience to pick up and sing along with, the impact of its choreography, its costuming — are all crucial to its success. Groups routinely go all-out for their performances: Witness After-School learning to perform an entire drumline sequence for live performances of their single “Bang!” as well as pretty much every live performance mentioned here. All of this emphasis on live performances make fans an extremely active part of the experience. K-pop fans have perfected the art of the fan chant, in which fans in live studio audiences and live performances will shout alternate fan chants over the musical intros to songs, and sometimes as a counterpoint to choruses, as a show of unity and support. This collectivity has helped ensure that K-pop fan bases both at home and abroad are absolutely massive, and intense to a degree that’s hard to overstate. Fans intensely support their favorite group members, and many fans go out of their way to make sure their favorite idols look and dress the part of world-class performers. K-Con, the largest US K-pop convention, has grown exponentially over the years and now includes both Los Angeles and New York. (There are also anti-fans who target band members — most notoriously an anti who attempted to poison a member of DBSK in 2006. But the less said about them, the better.) You might expect that in the face of all this external pressure, K-pop groups would be largely dysfunctional messes. Instead, modern-day K-pop appears to be a seamless, gorgeous, well-oiled machine — complete with a few glaring contradictions that make it all the more fascinating. Though government censorship of South Korean music has relaxed over time, it still exists, as does industry self-censorship in response to a range of controversial topics. South Korean social mores stigmatize everything from sexual references and innuendo to references to drugs and alcohol — as well as actual illicit behavior by idols — and addressing any of these subjects can cause a song to be arbitrarily banned from radio play and broadcast. Songs dealing with serious themes or thorny issues are largely off limits, queer identity is generally only addressed as subtext, and lyrics are usually scrubbed down to fluffy platitudes. Thematically, it’s often charming and innocent, bordering on adolescent. Despite these limitations, K-pop has grown over time in its nuance and sophistication thanks to artists and studios who have often either risked censorship or relied on visual cues and subtext to fill in the gaps. Case in point: the 2000 hit “Adult Ceremony” from singer and actor Park Ji-yoon, which marked the first time a K-pop hit successfully injected adult sexuality into fairly innocuous lyrics, representing a notable challenge to existing depictions of femininity in South Korean pop culture. The women of K-pop are typically depicted as traditional versions of femininity. This usually manifests in one of several themes: adorable, shy schoolgirls who sing about giddy crushes; knowing, empowered women who need an “oppa” (a strong older male figure) to fulfill their fantasies; or knowing, empowered women who reject male validation, even as the studio tailors the group’s members for adult male consumption. An idol group’s image often changes from one album to the next, undergoing a total visual and tonal overhaul to introduce a new concept. However, there are a few girl groups — 2NE1 and f(x) spring most readily to mind — that have been marketed as breaking away from this gender-centric mode of performance; they’re packaged as rebels and mavericks regardless of what their album is about, even while they operate within the studio culture. Yet the women of K-pop are also increasingly producing self-aware videos that navigate their own relationships to these rigid impositions. Witness Sunmi, a former member of Wonder Girls, tearing down her own carefully cultivated public image in her recent single “Heroine,” a song about a woman surviving a failed relationship. In the video, Sunmi transforms physically, growing more empowered and defiant as she faces the camera and finally confronts a billboard of herself. If songs for women in K-pop break down along the “virgin/mature woman” divide, songs for men tend to break down along a “bad boy/sophisticated man” line. Occasionally they even break down in the same song — like Block B’s “Jackpot,” the video for which sees the band posing as wildly varied members of a renegade circus, uniting to kidnap actress Kim Sae-ron into a life of cheerful hedonism. Male performance groups are generally permitted a broader range of topics than K-pop’s women: BTS notably sings about serious issues like teen social pressures, while many other boy bands feature a wide range of narrative concepts. But male entertainers get held to arguably even more exacting physical and technical standards than their female counterparts, with precision choreography — like Speed’s all-Heely dance routine below — being a huge part of the draw for male idol groups: If you’re wondering whether co-ed bands coexist in these studio cultures, the answer is, not really. Most of the time, co-ed groups tend to be one-off pairings of members from different bands for one or two singles, or novelty acts that are quickly split into gendered subgroups. The most famous actual co-ed band is probably the brother-sister duo Akdong Musician, a pair of cute kids who made it big on an audition show; and even they get split up a lot to pair with other singers. (See the “Hi Suhyun” clip above, which features Lee Hi and the sisterly half of AM, Lee Su-hyun.) It probably goes without saying that this traditional gender divide isn’t exactly fertile ground for queer idols to thrive. Despite a number of K-pop stars openly supporting LGBTQ rights, the industry aggressively markets homoeroticism in its videos but remains generally homophobic. But progress is happening here, too: South Korea’s first openly gay idol just appeared on the scene in early 2018. His name is Holland, and his first single debuted to a respectable 6.5 million views. Hip-hop tends to be a dominant part of the K-pop sound, particularly among male groups, a trend that has opened up the genre to criticism for appropriation. South Korea grapples with a high degree of cultural racism, and recent popular groups have come under fire for donning blackface, appropriating Native American iconography, and much more. Still, K-pop has increasingly embraced diversity in recent years, with black members joining K-pop groups and duo Coco Avenue putting out a bilingual single in 2017. Last but not least, I’d be remiss if I didn’t mention South Korea’s emergent indie music scene, which includes a thriving crop of independent rap, hip-hop, and, increasingly, R&B artists, as well as a host of grassroots artists who’ve made waves on SoundCloud. Taking stock of all these changes and paradoxes, we might be able to extrapolate a bit about what the future of K-pop looks like: even more diverse, with an ever-increasing number of independent artists shaking up the studio scene, even though most of them will still have to play within the system’s rigid standards. This gradual evolution suggests that part of the reason K-pop has been able to make international inroads in recent years is that it’s been able to push against its own rigid norms, through the use of modern themes and sophisticated subtexts, without sacrificing the incredibly polished packaging that makes it so innately compelling. That would seem to be a formula for continued global success — especially now that South Korea and its culture has the world’s attention. Hallyu may swell or subside, but the K-pop production machine goes ever on. And from here, the future looks fantastic, baby. Will you support Vox’s explanatory journalism? Most news outlets make their money through advertising or subscriptions. But when it comes to what we’re trying to do at Vox, there are a couple reasons that we can't rely only on ads and subscriptions to keep the lights on. \r\n\n\r\nFirst, advertising dollars go up and down with the economy. We often only know a few months out what our advertising revenue will be, which makes it hard to plan ahead.\r\n\n\r\nSecond, we’re not in the subscriptions business. Vox is here to help everyone understand the complex issues shaping the world — not just the people who can afford to pay for a subscription. We believe that’s an important part of building a more equal society. We can’t do that if we have a paywall. \r\n \n\r\nThat’s why we also turn to you, our readers, to help us keep Vox free.  If you also believe that everyone deserves access to trusted high-quality information, will you make a gift to Vox today? $5/month $10/month $25/month $50/month We accept credit card, Apple Pay, and\n              \n\n                Google Pay. You can also contribute via ",
    "datetime": "2018-02-16T10:00:02-05:00",
    "url": "https://www.vox.com/culture/2018/2/16/16915672/what-is-kpop-history-explained"
}