{
    "title": "How second wave of Covid-19 is different from first in symptoms, spread - India Today",
    "text": "Listen to Story The second wave of Covid-19 pandemic continues to stay strong in India. India has detected more than 20.65 lakh cases in the first half of April itself . This is the fastest rate of Covid-19 spread in India. The second wave of Covid-19 pandemic has several minute, yet differentiating characteristics in terms of symptoms, age-profile and spatial distribution.advertisementNEW HOMEGROWN VARIANTS During the first wave of the Covid-19 pandemic in India, local mutations did not play a major contributing role. But many experts believe that the current surge in Covid-19 cases is being pushed by homegrown mutant variants of SARS-CoV-2. Genome sequencing in Maharashtra attributed over 60 per cent of fresh cases to India-grown mutant variants of coronavirus.YOUNGER PEOPLE MORE VULNERABLE? Some experts and chief ministers such as Arvind Kejriwal of Delhi have claimed that the second wave of Covid-19 pandemic is affecting younger people more compared to the first wave seen in 2020.Arvind Kejriwal recently said more than 65 per cent Covid-19 patients in Delhi — one of the worst-affected places — are below 45 years of age. Arvind Kejriwal, however, did not provide a data-set comparing the second wave with the first. During the first wave of the Covid-19 pandemic in India, local mutations did not play a major contributing role. But many experts believe that the current surge in Covid-19 cases is being pushed by homegrown mutant variants of SARS-CoV-2. Genome sequencing in Maharashtra attributed over 60 per cent of fresh cases to India-grown mutant variants of coronavirus.YOUNGER PEOPLE MORE VULNERABLE? Some experts and chief ministers such as Arvind Kejriwal of Delhi have claimed that the second wave of Covid-19 pandemic is affecting younger people more compared to the first wave seen in 2020. Arvind Kejriwal recently said more than 65 per cent Covid-19 patients in Delhi — one of the worst-affected places — are below 45 years of age. Arvind Kejriwal, however, did not provide a data-set comparing the second wave with the first. During the first wave, government data in December 2020 suggested that while under-45 patients formed 60 per cent of all Covid-19 cases, the mortality rate was much higher among older people — 88 per cent. In the current wave of Covid-19 surge, states such as Maharashtra and Karnataka have reported near-50 per cent infections from among people below 45 years. However, there could be an explanation to this trend. Older and more vulnerable people have largely remained indoors as cases rose and they were also among the priority group for vaccination that has proven to reduce severity of the Covid-19 illness. Further, the younger ones are more mobile due to their greater engagement in economic activities.MORE CHILDREN GETTING INFECTED Government data earlier this month showed that about 80,000 children tested positive for Covid-19 in the five worst-affected states -- Maharashtra, Chhattisgarh, Uttar Pradesh, Karnataka and Delhi -- from March 1 to April 4. Since then, doctors have said more children are increasingly testing positive for Covid-19. But there is a note of caution coming from health experts. They say since most children were asymptomatic in the first wave of Covid-19 pandemic and the healthcare system was being prepared to deal with severe cases, a large number of children might have remained undiagnosed even if they contracted the coronavirus infection.ALSO READ: 14-day-old baby dies after testing Covid positive in Gujarat's SuratNEW SYMPTOMS Most symptoms of Covid-19 remain the same in the second wave as in the first including fever, chills, body ache, loss of smell and taste, and loss of breath or respiratory complications. Other symptoms which were not very common among Covid-19 patients in India last year are being reported with greater frequencies. These symptoms are pink eyes, loose motions and hearing impairment, which is a totally new sign detected in the second wave of Covid-19 pandemic.COVID-19 SPREAD, CONCENTRATION The first wave of Covid-19 was more widespread in geographical reach with hotspots spread all over the country. The second wave is more infectious but has been limited to fewer hotspots. The Lancet Covid-19 Commission by India Task Force members, published this week, said the second wave is clustered. While over 40 districts reported 50 per cent of all Covid-19 cases in India in the first wave, only 20 are currently reporting half the coronavirus infections. At its peak in the first wave in August-September 2020, Covid-19 pandemic saw 60-100 districts reporting 75 per cent of the cases in India. The report said only 20-40 districts are reporting 75 per cent of all cases in the second wave.VACCINE India is witnessing a second wave of Covid-19 pandemic when the country is concurrently running a vaccination drive. Till now, vaccines are available only for the 45-plus population. Demands are rising for opening up vaccination for all those who need it. To ramp up the vaccination drive, the government recently modified its vaccine policy to allow foreign developers and manufacturers entry in the Indian market. Earlier, every vaccine got approval only after a trial in India. This provision has been done away with to fast-track vaccine availability to Indians.Edited By: Prabhash Kumar DuttaPublished On: Apr 16, 2021--- ENDS --- ",
    "datetime": null,
    "url": "https://www.indiatoday.in/coronavirus-outbreak/story/coronavirus-india-second-wave-1791677-2021-04-16"
}