{
    "title": "How Korea became the world's coolest brand | Financial Post",
    "text": "South Korea — once a poor, war-torn country — is deliberately staking its future prosperity on the export of its culture, its television, its music and the likes of Psy and 'Gangnam Style' When Snoop Dogg flew to Seoul in January to film a music video with pop star Psy of “Gangnam Style” fame, he didn’t seem to realize just what South Koreans are willing to do to create a global phenomenon. Initially told that the shoot for the song “Hangover” would be “very relaxed,” the California rapper was instead subjected to a gruelling 18-hour shoot in more than 10 different locations without breaks. Six months later, on June 8, the music video got more than 10 million views on YouTube the day it was released. Today, it has been watched online more than 109 million times. Subscribe now to read the latest news in your city and across Canada. Subscribe now to read the latest news in your city and across Canada. Create an account or sign in to continue with your reading experience. Don't have an account?  Create Account When the Western world got its first taste of Psy and his horse-riding dance moves in 2012 — “Gangnam Style” is the most viewed video in YouTube history, with more than 2 billion views generating a reported US$8-million through the site in 2012 alone — some people wondered if his success was a pop culture fluke, a random burst of Korean lightning. But that phenomenon was decades in the making. It is one of the fruits reaped from South Korea’s compelling rise from one of the poorest, war-torn countries in the world to the economic and cultural powerhouse it is today. And it is deliberately staking its future prosperity on the export of its culture, its television, its music and the likes of Psy and “Hangover” and “Gangnam Style.” “Korea is throwing all of its weight and billions of dollars into making itself the number one exporter of pop culture in the world,” says Euny Hong, author of the new book The Birth of Korean Cool: How One Nation is Conquering the World Through Pop Culture (see excerpt on page WP3). “The idea is that if you create the supply, the demand will follow. That’s not an intuitive sales model.” Yet it seems to have worked. As the result of decades of diligence, careful planning and investment, South Korea, with a population of 50 million, now impacts more lives, per capita, than any other nation, says Wayne Arnold, global CEO of Lowe Profero. “There is not a country that has not had some influence from Korean culture, whether that’s in the form of K-pop or a Samsung phone,” Mr. Arnold says in an interview from his Singapore office. Brands like Samsung and Hyundai have transformed the country into one of the world’s major economies — annual sales for Samsung have grown from US$1.3-billion in 1977 to US$213-billion in 2013 — but K-pop, Korean popular culture for the cool, is South Korea’s other best-known export. The K-pop wave, called Hallyu, has been storming foreign shores for years, even if the only exposure that most North Americans have so far had to it is through “Gangnam Style.” South Korean television dramas (K-dramas, typically served up as mini-series) enjoy huge audiences in the unlikeliest regions. The Korean historical costume drama The Jewel in the Palace is so popular that Iranians reportedly organize their mealtimes around the show, Ms. Hong writes. Get the latest headlines, breaking news and columns. By signing up you consent to receive the above newsletter from Postmedia Network Inc. A welcome email is on its way. If you don't see it, please check your junk folder. The next issue of Top Stories will soon be in your inbox. We encountered an issue signing you up. Please try again And the K-pop and K-dramas often translate into a direct influence on consumer purchases. “For example, a YSL lipstick worn in the television series My Love from the Star sold out internationally,” soon after it appeared on the program, says Michael DeSimone, CEO of e-commerce solutions company Borderfree. “And many other luxury products prominently featured in the show also sold well.” The export of Korean cosmetics have increased six-fold in the last decade and are sent mostly to neighbouring Asian countries, Korean reports say. From cosmetics to Samsung tablets, the entire export economy seems to be at least heavily buoyed by a national brand that has in a breathtakingly short period of time become famous, above all, for being cool. In the early 2000s, Korean cultural content exports hovered around US$500-million. By 2011, that had mushroomed to more than $4-billion, according to Korea’s Culture and Information Service — and that was before “Gangnam Style” exploded on the scene. By 2012, Korea’s ministry of culture, sport and tourism estimated Hallyu’s economic asset value at US$83.2-billion, of which US$5.26-billion was thought to be attributable to its music industry. In 2011, Billboard announced its K-pop Hot 100 Chart. K-pop stars including Girls’ Generation, 2NE1 and Big Bang play sold-out concerts around the globe including in the U.K. and U.S. The artists mix English, Japanese and Mandarin into their songs purposefully as a way to connect to international fans. That kind of shrewd calculation for appealing to worldwide audiences is just a small element of an ambitious and disciplined Korean plan to set K-pop sweeping the planet. The Korean War, which ran from 1950 to 1953, devastated the country; in 1965, South Korea’s per capita GDP was less than that of Ghana’s. Now, however, South Korea is the world’s 15th-largest economy, with a GDP of US$1.3-trillion, according to the World Bank. And the country is banking on K-pop to continue thriving. The importance of the cultural industry to the nation’s economy is illustrated by, and may have been borne of a legendary anecdote. In 1994, South Korea’s then-president Kim Young-Sam read it reported that the export revenue of Steven Spielberg’s Jurassic Park, released a year earlier with a US$63-million budget, had matched that of the foreign sales of 1.5 million Hyundai cars. The Korean government transformed its focus, earmarking 1% of the national budget to spending on subsidies and low-interest loans to cultural industries, launching agencies to promote and expand K-pop exports, and setting up more cultural departments at universities. Domestic conglomerates or “chaebols,” including Samsung and Daewoo, started increasing their stakes in film financing and video production; Samsung recently sponsored the pop group Big Bang’s 2012 global tour. Today, the government has a US$1-billion investment fund to nurture popular culture, Ms. Hong writes. “If you look at the mountain of investment that the Korean government has put into the Korean wave, it’s like 20 or 30 times more than other nations do,” Mr. Arnold says. “Korea has, like many nations, struggled with its purpose in the world. It has a small population compared to the giants nearby whether that be Japan or Russia or China. What it has realized is that it can influence these populations by spreading its culture and its Korean way through music and television.” The South Korean brand also works because the country is advantageously seen as “non-offensive” — a political tabula rasa, Mr. Arnold adds. Korea combines easy-to-access entertainment with a “non-confrontational image … whereas with brands like the U.S., brands like Russia, brands like China, you have immediate polarization.” South Korea also takes very seriously the creation of its celebrities. Companies get budding stars to sign seven- to 13-year contracts and spend half of that time training them. The singers don’t make public appearances until their brand and performances have been perfected. Careful and painstaking effort goes into crafting their images. [np_storybar title=”Beyond Gangnam Style” link=””]South Korea’s musical stars and television dramas are beloved around the world. If your only exposure to K-pop has been Psy’s “Gangnam Style,” here are four insanely popular K-pop acts or K-dramas that you need to know about: Girls’ Generation This nine-member pop group has topped Forbes’ Korea Power Celebrity 40 list for several years, and made its U.S. debut on David Letterman’s show in 2012. My Love from the Star Obsessed fans in China have viewed My Love from the Star a stunning 14.5 billion times through one video-streaming platform. This K-drama is about a celebrity who falls in love with a 400-year-old alien from another planet. It’s wholesome. It involves ill-fated but undying love — like Twilight, with Korean aliens swapped for American vampires. Coffee Prince Coffee Prince, which is a huge K-drama hit in Latin America, is a Cinderella story about a poor young woman who disguises herself as a boy to work at a coffee shop. The rich shop owner falls in love with her without knowing that she’s a woman. And you thought your love life was complicated. Big Bang Big Bang, a five-member hip-hop boyband, just finished its first international tour. The A-list stars are ambassadors in Korea’s new tourism campaign. Each member has solo projects but they’re still planning to release a new album later this year. [/np_storybar] “They put so much emphasis on production value,” says Rosally Sapla, a New York-based marketing consultant who used to work with DramaFever, an online video site that distributes Korean dramas. “If it’s a K-pop video, it’s going to be in HD, there’s going to be a narrative to it. The fashion and choreography is going to be tight.” She says that a 2NE1 (pronounced “twenty-one”) show that she attended in New Jersey was one of the best concerts that she has ever attended. The cool draws outsiders in. The popularity in Japan of the Korean drama Winter Sonata led to a huge boost in Japanese tourism to Korea in the mid-2000s. Ingyu Oh, director of the Hallyu Studies Center at Korea University in Seoul, says there has been a sharp rise in positive responses to Korea’s image in surveys among young people abroad. In response, the Korean government has reduced visa barriers to incoming tourists and Korean universities are offering more courses for foreign students. But South Korea also sends its stars abroad as ambassadors. In November, thousands of fans swarmed actor Yoon Sang-hyun during his visit to Cuba, where they reportedly chanted: “Seo” — the name of his butler character in the K-drama series My Fair Lady. “The Korean government spent tax money translating these videos into other languages; they approached television networks and asked, ‘Will you air this?’” Ms. Hong says. “That’s not something a capitalist country does. Obama does not send someone to go to other countries to ask them to buy Law and Order episodes.” But then, America had already effortlessly cornered the market on cultural cool for almost a century. “Once you achieve it, you can’t put a price on it,” Ms. Hong says. “That is the most effective way to sell people not just your pop culture but your industry, your electronics, in Korea’s case.” Today, however, South Korea isn’t focused on peddling its cool to North America, but rather, to parts of the world where the greatest amount of growth potential lies. “Korea is going after underdeveloped markets. In the short run, this is insane,” Ms. Hong says. “Most people in Kazakhstan can’t afford a smartphone. But they do have access to the Internet and to K-dramas, and in five years or 10 years when these countries have people who can afford smartphones, they’re probably going to buy Samsung because they saw all of their K-drama stars using Samsung phones.” mleong@nationalpost.com twitter.com/lisleong Postmedia is committed to maintaining a lively but civil forum for discussion and encourage all readers to share their views on our articles. Comments may take up to an hour for moderation before appearing on the site. We ask you to keep your comments relevant and respectful. We have enabled email notifications—you will now receive an email if you receive a reply to your comment, there is an update to a comment thread you follow or if a user you follow comments. Visit our Community Guidelines for more information and details on how to adjust your email settings. To contribute to the conversation, you need to be logged in. If you are not yet registered, create your account now - it's FREE. 365 Bloor Street East, Toronto, Ontario, M4W 3L4 © 2023 Financial Post, a division of Postmedia Network Inc. All rights reserved. Unauthorized distribution, transmission or republication strictly prohibited. This website uses cookies to personalize your content (including ads), and allows us to analyze our traffic. Read more about cookies here. By continuing to use our site, you agree to our Terms of Service and Privacy Policy. ",
    "datetime": null,
    "url": "https://financialpost.com/news/retail-marketing/how-korea-became-the-worlds-coolest-brand"
}