{
    "title": "How Netflix, 'Squid Game' and Korea's 'K-Wave' Smashed an Emmys Barrier - CNET",
    "text": "Until Squid Game, no non-English show had ever been nominated for a major Emmy. Then Netflix and Korean pop culture blanketed the globe -- and won. Lee Jung-jae, playing the protagonist of Squid Game, won the Emmy for lead actor in a drama series, a first for a non-English-language show. Netflix made Emmys history this week with Squid Game. It couldn't have come at a better time. The Korean-language breakaway hit won two Emmy Awards on Monday night, the first non-English-language program to win top Primetime Emmys. Squid Game's Lee Jung-jae, who plays the debt-stricken protagonist in the thriller's brutal survival game, won the Emmy for lead actor in a drama series. Creator Hwang Dong-hyuk won for outstanding directing of a drama. (They're also the first Asian individuals to win those categories.) Until this year, a non-English-language project had never even been nominated in a major category. Actor Lee Jung-jae and Squid Game creator Hwang Dong-hyuk with their Emmy statues. The wins break a language barrier that's long thwarted some of the world's best television from getting Emmy recognition. But they're also a milestone at the intersection of two world-spanning phenomena: South Korea's cultural wave and Netflix's race for global domination. After building momentum for more than two decades, the K-wave crested into a flood just as Netflix was pouring itself into being available -- and actually appealing -- across nearly all the world's borders. The Emmys, unlike other top honors, have been elusive for international breakthroughs. Squid Game's wins underscore how the Emmys needed a globalizing US service bent on world ubiquity to break South Korea's cultural phenomenon into Hollywood's TV pantheon too. And unlike South Korea's cultural exports -- which include megahit boy band BTS, video games and addictive soap operas -- Netflix actually needs the boost. With unprecedented subscriber losses this year, Netflix is in the midst of its biggest crisis of confidence since the days when its main gig was mailing DVD rentals in red envelopes. The global cachet of South Korea pop culture, on the other hand, has never been better. Korea's global cultural influence stretches across TV, film, food, beauty and fashion, but nothing exemplifies its powerhouse status as much as K-pop music. On YouTube, nine of the top 10 most-viewed music videos in their first 24 hours are all K-pop, mostly BTS and Blackpink. BTS was the first K-pop group to reach No. 1 on the US Billboard 200; last year, it beat Taylor Swift with the most consecutive weeks at No. 1 on the digital singles chart. Squid Game itself is a testament to the global popularity of Korean TV: It is Netflix's most watched title ever, with more than 1.65 billion hours of viewing in its first 28 days. And Squid Game's Emmy wins come as South Korea is having a heyday in the highest echelons of film. Parasite's upset win of the best-picture Oscar in 2020 was followed the next year by Korea's Yoon Yuh-jung winning best supporting actress for the film Minari. Most recently, in May, South Korea's Park Chan-wook won the best director award at the Cannes Film Festival for his romantic mystery film Decision to Leave. But as other honors reflected Korea's widening cultural influence, the Emmys hadn't. That's partly because eligibility rules and voting dynamics basically shut out most non-English-language programming from the Primetime Emmys since they began. Unlike the Oscars, which don't hinge eligibility on the country of origin, the Emmys require any show with half its dialogue in a non-English language to be a coproduction between a US company and an international partner. That partnership must begin basically at the outset, starting in preproduction with the purpose of being on US television. By comparison, to vie for an Oscar, a film needs to screen in a commercial theater for one week in one of six US cities. Distributing a film in the US is no mean feat, and submitting a film for Oscar consideration is expensive. But the US has an existing framework of arthouse cinemas and a long history of exhibitors large and small putting subtitled films up on the big screen. Compared with getting an international, non-English-language show greenlit for US television, a single week of screenings is a relatively easier bar to clear. Even with a growing ecosystem of Spanish-language television in the US, the Primetime Emmys have remained a bastion of English-language recognition. In 2011, NBCUniversal-owned Telemundo made its first Primetime Emmy push, launching a nomination campaign for its hit drama La Reina del Sur. The bid failed to get any nods for the show, and no non-English programs have been nominated in the top drama categories since -- until Squid Game. But back in 2011, Netflix had yet to make its first original shows. Now, La Reina del Sur's second and upcoming third seasons are coproductions with Netflix. Until Netflix's aggressive worldwide expansion, no US media company was meaningfully investing in global TV content accessible to global audiences. Starting in 2016, Netflix opened its floodgates. Netflix was already operating in more than 60 countries when, in January 2016, it essentially took its service worldwide in a single launch. In a surprise move, Netflix more than tripled the number of countries where it streamed by adding 130 new markets all at once -- South Korea included. \"We're at the start of a global revolution,\" CEO Reed Hastings said at the time, concluding his keynote speech at the Consumer Electronics Show in Las Vegas with the news that Netflix had, essentially, just launched itself in every country around the world except China. \"You are witnessing the birth of a global TV network.\" Netflix announced its nearly global launch by surprise at CES in 2016. Launching Netflix in all those countries was the first step. But the longer, steeper climb was in localizing Netflix's service and programming to each of those new markets, all while breaking down barriers that isolated a program's appeal to the market it was made for. Localizing content meant originating and licensing productions in the new countries, for those countries. It took two years after launching in South Korea for Netflix's first Korean original show to start streaming in 2018. By last year, its Korean programming budget was $500 million, and Netflix planned more than 25 Korean titles this year, the most yet. To make those localized programs appealing across borders, Netflix embarked on a subtitling and dubbing extravaganza. Subs and dubs, as they're sometimes called, make programming accessible in other languages. Netflix hits like the Spanish series Money Heist and French show Lupin relied on cross-border appeal for their runaway popularity, but none more so than Squid Game. When Squid Game was released, it was subtitled in 31 languages and dubbed in 13 more, and 95% of Squid Game's viewership came from outside Korea. Money Heist, a Spanish series, is one of Netflix's most globally popular franchises. South Korea's cultural output has reached so many heights in recent years that the reception in Korea of Monday night's Emmys breakthrough was muted by comparison. But Netflix's role in Squid Game's historic Emmy wins comes at a critical time for the service. After winning the most Emmys of any network or platform last year, Netflix is wrestling this year with its deepest subscriber losses ever, especially in the US. Netflix's years of unflagging membership growth pushed nearly all of Hollywood's major media companies to pour billions of dollars into their own streaming operations. These so-called streaming wars brought about a wave of new services, including Apple TV Plus, Disney Plus, HBO Max, Peacock and Paramount Plus -- a flood of streaming options that's complicated how many services you must use (and, often, pay for) to watch your favorite shows and movies online. It also intensified competition to the toughest level Netflix has faced yet. Scoring Emmys doesn't necessarily unlock rewards for a service other than bragging rights. But after months of Netflix grappling with a crisis of confidence, Squid Game at least gave Netflix something historic to brag about. ",
    "datetime": null,
    "url": "https://www.cnet.com/culture/entertainment/how-netflix-squid-game-and-koreas-k-wave-smashed-the-emmys-barrier/"
}