{
    "title": "How Korean Pop Culture Took the World by Storm | Smart News|\n Smithsonian Magazine",
    "text": "Sections A new exhibition will explore the rise of South Korean fashion, movies, music and more Sarah Kuta Daily Correspondent This fall, the United Kingdom’s first major exhibition of Korean culture is coming to London’s Victoria and Albert Museum (V&A). “Hallyu! The Korean Wave” is an exploration of South Korea’s growing cultural influence around the world. It will feature some 200 objects, plus digital displays and other pop culture ephemera organized into four thematic sections. One section, titled “From Rubble to Smartphones,” will examine South Korea’s evolution from a war-torn country to a major international cultural influencer between the 1950s and the early 2000s. Another will use props, storyboards, posters and installations to explore the success of Korean films and TV series. This section will feature costumes from the recent streaming hit “Squid Game,” which became Netflix’s most popular show just four weeks after its release. Museum-goers will also be able to step inside an immersive recreation of the bathroom from Parasite, the first non-English-language film to win an Academy Award for Best Picture. Another section highlights the global popularity of K-pop music and the role of social media in helping artists reach fans around the world. Visitors can jam out to the 2012 hit song “Gangnam Style” while admiring Psy’s signature pink suit jacket. “The song and its quirky dance moves were an overnight sensation, and it became the first music video to reach one billion views on YouTube,” writes the museum in a statement. “The hugely successful video was an early reflection of hallyu’s international appeal that went on to launch a global phenomenon, inspiring parodies and cover versions across the world, several examples of which, filmed across multiple continents, will also feature in this introduction.” The final thematic section looks at Korean beauty and fashion, with a special emphasis on packaging design and contemporary designers. Hallyu means “Korean wave,” and the word describes the rising worldwide popularity of Korean culture over the last two decades. Today, South Korea is a “leading cultural powerhouse in the era of social media and digital culture today,” says Rosalie Kim, the exhibition’s curator, in the museum’s statement. “This phenomenon has been amplified by tech-savvy and socially conscious global fanbases, further raising the profile and relevance of hallyu around the world.” South Korea’s Ministry of Culture, Sports and Tourism is sponsoring the exhibition as part of a broader push to promote the country’s arts and creative industries, per the statement. As BBC Culture’s Christine Ro wrote in 2020, the Korean wave has been a “deliberate tool of soft power” wielded by the government to help revitalize the nation’s economy. “South Korea isn’t alone in this; many countries invest in cultural councils and exchanges partly to strengthen diplomatic aims,” wrote Ro. “But the South Korean government’s push for cultural power has had remarkably quick success.” “Hallyu! The Korean Wave” is on view at the Victoria and Albert Museum through June 25, 2023.  Get the latest stories in your inbox every weekday. Sarah Kuta\n| READ MORE Sarah Kuta is a writer and editor based in Longmont, Colorado. She covers history, science, travel, food and beverage, sustainability, economics and other topics. Explore Subscribe Newsletters Our Partners Terms of Use © 2023 Smithsonian Magazine\nPrivacy Statement\nCookie Policy\nTerms of Use\nAdvertising Notice\nYour Privacy Rights\nCookie Settings © 2023 Smithsonian Magazine\nPrivacy Statement\nCookie Policy\nTerms of Use\nAdvertising Notice\nYour Privacy Rights\nCookie Settings ",
    "datetime": null,
    "url": "https://www.smithsonianmag.com/smart-news/how-korean-pop-culture-took-the-world-by-storm-180980449/"
}