{
    "title": "How Streaming Platform Viu Is Riding The Korean Wave | The Drum",
    "text": "Advertisement July 3, 2020 | 4 min read Listen to article\n                 \n4 min Streaming platforms like Hong Kong-based Viu have been investing in drama content, particularly Korean drama (K-drama), amid increased interest across the world in Korean cultural properties. The ‘Korean Wave‘, or ‘hallyu‘ is credited with spreading a host of fashion and makeup trends. Korean dramas are often marked out by high production values, attractive casts and complex storylines. “The shows are melodramtic but they all resonate well with our viewers, who circulate them on social media,” says Virginia Lim, the chief content officer for Viu, speaking during The Drum‘s Can-Do Festival. “Viu has worked closely with the top five South Korean broadcasters (SBS, KBS, NBC, CJENM and JTBC) to secure more than 90% of Korean entertainment content. We bring to our viewers the freshest Korean content in as fast as four hours from Koreans telecasts with local language subtitling. It‘s our promise to bring to our viewers the most and best of Korean content.” As countries across Asia Pacific went into lockdown, a Media Partners Asia report on online video streaming found that overall average weekly viewing minutes across Indonesia, Singapore, the Philippines and Thailand increased by 60% between January and April this year. The same report found that Viu had a 274% increase. According to Lim, more than 50% of viewers are watching or have watched its original series Pretty Little Liars and Korean drama A World of Married Couple. A World of Married Couple has achieved the highest ratings in the history of cable TV in Korea. “‘A World of Married Couple’ was first premiered on Viu with subtitles in six languages and it has become the most-watched drama series on Viu since the lockdown started. Some of the shows currently trending on our platform include our very own Thai drama, My Bubble Tea and Korean dramas, like Good Casting, Oh My Baby, Sweet Munchies,” explains Lim. “Then in June, we launched the second season of The Bridge, a Viu original in collaboration with HBO Asia. In July, we will also be launching popular Korean dramas like To All the Guys Who Loved Me, Flower of Evil, Train and The Good Detective.” Even though production budgets have been slashed because of the coronavirus-related downturn, Viu is continuing to develop and monetise existing and potential relationships with brands to help them understand that in the streaming world, primetime can be anywhere. According to Lim, Viu uses content discovery strategies and machine learning to help brands to reach a specific audience defined by their interests, rather than the timeslot. For example, in Thailand, where the Viu original series My Bubble Tea was filmed, Viu worked with AP Honda to get the star actor Mean Phiravich to act as a rider to deliver bubble tea on a Honda motorcycle. “In Singapore, for example, our campaign with title sponsor FWD Insurance for our original No Sleep No FOMO highlighted the importance of insurance coverage as part of our travel plans. This ties in with exactly what No Sleep No FOMO is about – experiencing the unexpected,” explains Lim. “These are some examples that we had done. Another example is in Indonesia. Indonesia, the brand Ponds celebrated mother‘s day by highlighting how Indonesian women always radiate positive energy with an inspiring mom story placed with Glow, a Viu original series.” Post-pandemic, Lim says Viu will continue to invested in content and strive to become the content platform with the most – and best – Korean shows on the market. She points out that streaming was gaining ground on live television before the pandemic, and believes this will only continue. “The pandemic, if anything, may just have accelerated these changes in viewing habits. Online streaming is here to stay. Streaming will be the norm moving forward, if anything. Viewers today want to be able to access content when they want it, where they want it and not be controlled or limited by a fixed time slot schedule,” she says. Lim spoke with The Drum’s Shawn Lim as part of The Drum‘s Can-Do Festival, an online event celebrating the positive energy, innovation and creative thinking that can make the marketing community such a powerful force for good. You can watch the interview in full here. Sign up to watch forthcoming sessions and see the full can do schedule here. © Carnyx Group Ltd 2022 | The Drum is a Registered Trademark and property of Carnyx Group Limited. All rights reserved. ",
    "datetime": null,
    "url": "https://www.thedrum.com/news/2020/07/03/how-streaming-platform-viu-riding-the-korean-wave"
}