{
    "title": "How the K-Wave Hit Seoul’s Design Scene | Architectural Digest",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, select My Account, then View saved stories To revisit this article, visit My Profile, then View saved stories To revisit this article, select My Account, then View saved stories By Hannah Martin Photography by JeongMee Yoon At Seunjin Yang’s studio in Seoul’s once-industrial Seongsu-dong neighborhood, blown-up balloons hang like sausage links from the ceiling. To create his fantastical stools, chairs, and tables, the Korean designer applies eight coats of epoxy resin to each balloon, making them harden into forms sturdy enough to sit on. “Balloons are empty inside,” muses the designer, whose works gained a cult following when New York gallery the Future Perfect showed a suite of them in Los Angeles last spring. “I was fascinated by the idea that such a vulnerable material could be made solid.” Seunjin Yang in his studio. “I was fascinated by the idea that such a vulnerable material could be made solid,” he says of his resin balloon furniture. Yang, who used to share a studio with his Hongik University peer Kwangho Lee, is now a key figure of the burgeoning Seongsu-dong design community. “This is a country where art history could not grow deep,” he says, reflecting on the tumultuous colonial period and the Korean War. “Finally we’re seeing that being restored.” A balloon is an apt analogy for the South Korean capital itself, which has emerged as a massive cultural exporter, seemingly overnight. This Korean Wave, or hallyu—an initiative strenuously backed by the South Korean government—has landed a series of victories in the last year alone. Korean-American video artist Nam June Paik was the subject of a sprawling exhibition at the Tate Modern. Bong Joon-ho’s Parasite took the Palme d’Or at Cannes, a Golden Globe for Best Foreign Language Film, and both Bong and his film have been nominated for Oscars this year. Girl group Blackpink became the first K-pop band to play at Coachella. And boy-band sensation BTS became the first group since the Beatles to earn three U.S.  number one albums in a year (their hit video for “Boy With Luv” was also the fastest ever to reach 100 million views on YouTube). “They’re inspired by stone stacks, something Korean people make when they’re wishing for love, or luck on a test,” Ok Kim explains of her colorful side tables, which she regularly assembles into totems for display. (Two groups are pictured here.) “They always look precarious, but somehow they balance.” After studying wood craft at Pusan National University, Kim went to Hongik University for furniture design and apprenticed under a master artisan to learn ottchil, the Korean traditional lacquer method. She now gives the labor-intensive process a contemporary twist, hand-brushing coat after coat onto steel forms, then sanding away to reveal painterly patterns. A single table can take nearly four months to finish. Working with the lacquer feels autobiographical for Kim, who says, “I am Korean; these works show who I am.” Amid all that, a crop of experimental art-designers emerged across the rosters of Western design galleries such as Salon 94 Design, Cristina Grajales, R & Company, and the Future Perfect. It was more of a ripple at first—a foam-y chaise here, a balloon chair there—at fairs and in small exhibitions. But as the numbers reach a critical mass, the Western design world, collectors in particular, have started to connect the dots. “There’s a renaissance happening right now in Seoul,” explains Jillian Choi, a Korean-American art and design consultant. For the last two years she has worked alongside Say Hi To’s Kristen de la Vallière to curate a talks series for Design Salon Seoul, an annual design conference. “And the curiosity about Korea is growing, particularly from Europe and New York.” “It all started with matching materials together,” says Jeongwha Seo whose stool-like “material containers” and “structures for use” have been shown by Carwan Gallery. It was an accident, really, he explains. One day in 2013 he noticed a piece of volcanic rock placed, by chance, in a brass container. Interested in the material dialogue he began to try other combinations: acrylic and brass, basalt and teak, cork and cast aluminum, traditional rush (woven by artisans in Kanghwa island) and oxidized copper, a series that he has continued to this day. “Rather than focusing on the meaning of a single material I focus on the synergy between the two materials,” he explains. Based in Seongsu-dong, just across the street from Kwangho Lee, his Hongik University peer, he says “I see more and more furniture designers here in Seoul. I think now people are more willing to experiment.” It hasn’t always been so. South Korea’s economic and cultural boom (their GDP is now ranked 12th in the world) all happened in the course of a single generation. In 1910, after the 500-year reign of the Joseon dynasty, Korea’s last independent monarchy, the nation was annexed and harshly ruled by neighboring Japan. Even when, with the help of Allies, the nation obtained independence in 1943, it still reeled with internal struggles, and the Korean War, which lasted from 1950 to 1953, ultimately cleaved the nation into North and South. It was not until the 1988 Summer Olympics in Seoul that South Korea began to get its footing, using the event, much like Japan had in 1964, as its unofficial entree onto the global stage. “Japanese occupation tried to suppress all traces of Korean culture and language,” explains Elisabeth Agro, curator of American modern and contemporary crafts and decorative arts at the Philadelphia Museum of Art. She is currently working with Hyunsoo Woo, the museum’s curator of Korean art, on an upcoming show about contemporary Korean art, craft, and design. Agro did the math: For more than 70 years, Koreans were consumed with the hardships of occupation, war, and the fight for democracy. “That’s a long time to not engage with and celebrate their centuries-old traditions,” she says. When Sang-Hoon Kim, who graduated from Cranbrook Academy of Art in 2009, returned home and started working at his family’s Seoul foam factory, he thought his design practice (slick, digitally produced pieces in wood and metal) would have to go on hold. But he soon had an epiphany: “Foam is fun, interesting, and best of all [for me] free.” After-hours he began experimenting with the material, often used for mattresses, shoe soles, and the like. Soon he was carving it into abstract sofas and chairs—some blobby, like melted marshmallows; others clean-lined, like supersize kitchen sponges. After making a splash at Cristina Grajales Gallery’s 2018 booth for Design Miami, he’s now working on a finish to make the chairs suitable for the outdoors. Perhaps in light of that, many of the first Seoul-based designers to emerge in the West—most of them shown by the now-shuttered Gallery Seomi, which began exhibiting at Design Miami/Basel in 2009—used their work to revisit Korea’s rich history of craft. Ceramist Hun Chung Lee used clay from his studio just outside of Seoul to create modern interpretations of traditional moon jars as well as chunky, richly glazed tables and stools. Myung Sun Kang created sinuous furnishings using centuries-old mother of pearl inlay and lacquer techniques. “There’s a cultural exchange happening from both directions,” explains R & Company’s Zesty Meyers, who has been traveling to Seoul since the early 2000s and represents Hun Chung Lee and woodworker Bae Sae Wah. “You have the first generation of Koreans who are coming to the U.S. and Europe for school and bringing those ideas back home. Then you have galleries showing Korean works stateside for the first time.” Despite the urge to reinterpret traditions, some of today’s buzziest Korean talents say they’d rather look forward. “Our generation has to find the materials of our time,” explains Sang-Hoon Kim, who grew up in Seoul and studied at Michigan’s Cranbrook Academy of Art. He returned to his hometown to run his family’s foam factory, and has been making experimental furnishings with the squooshy industrial material, debuted in the U.S. by Cristina Grajales in 2018. “We don’t really have design history here, so we are making the scene; making Korean design.” “Our generation has to find the materials of our time. We don’t really have design history here. So we are making Korean design.” That certainly feels true back in Seoul’s Seongsu-dong, where a creative scene is putting down roots. More than a decade ago, after graduating from the nearby Hongik University, designer Kwangho Lee set up a studio in the neighborhood, where rent was cheap and spaces were big. “There’s this innate Korean quality of fastness,” he explains. “Wanting to learn something fast, show something fast.” As his creations—material experiments in weaving, and enameled copper—found an audience in the West via New York’s Salon 94 Design, he harnessed the creative momentum around him, helping peers find and share spaces in the neighborhood. “We stick together,” says Lee, who now keeps a studio across the street from his schoolmate, Jeongwha Seo, known for his nuanced material pairings shown by Carwan Gallery, and rents studio space upstairs to Jaewon Choi and Yoonjeong Lee, interior designers, and Eunkook Park, a painter, all Hongik graduates. Lee even set up an exhibition space called Supply Seoul nearby, where he showcases the works of rising local talents. “Jaeryo, if you translate it, means ‘material,’ ” says Nuri Kim, explaining the name of the firm she cofounded with fellow designer Sangwon Oh. The moniker is fitting. The two teamed up in 2018, dedicating themselves to different media. Kim has focused on ceramics, using both plaster-mold and hand-building techniques to create futuristic formations in clay. Oh, on the other hand, studied pulp and paper engineering and channeled that knowledge into a body of work in papier-mâché. “Seoul is so fast-paced,” says Kim, who is interested in beadwork and jewelry. “I’m constantly thinking about new ideas, what to do next.” One such newbie is Nuri Kim, who cofounded the firm Jaeryo alongside Sangwon Oh just two years ago. Her hand-built clay Nuage table was shown at Supply Seoul in 2018, a major boost to her young studio. “Jaeryo, if you translate it, means material,” says Kim, who focuses on ceramics, while Oh works mostly in papier mâché—a medium that, he explains, doesn’t have much of a history in Korea. “When it comes to paper, people only think of traditional hanji,” he says. That dialogue between old and new—often in the form of material experiments—plays heavily into the freshest iteration of Seoul-grown design. Take Jang Hea Kyoung, of FICT Studio, for example, who has created futuristic works out of scrap marble, model-making foam, and loess, a type of sediment often used as a building material in Korea. Then there’s Ok Kim, who apprenticed under a master artisan to learn ottchil, the centuries-old Korean natural lacquer method. She now applies it by hand to geometric steel forms, layer after layer, before sanding it away to reveal painterly patterns. FICT studio, run by Jang Hea Kyoung, stands for From Craft to Industry, an idea embodied by the designer’s far-reaching material experiments. Reinventing materials that have been undervalued, discarded, or traditionally used in Korea, she has found new life for marble scraps, blobby model-making foam, and loess, a sediment used as a traditional building material in Korea. “If you look around, it seems true that there are more and more friends running independent design studios like me in Seoul,” she explains. She chalks it up to a cultural shift from a society that values the interests of groups and organizations to one that values that values the individual. “The latent desire for personal expression, is finally being expressed.” “There’s an inventiveness, a curiosity in materiality and process,” says Choi. “You see things that are actually new.” Agro reasons that newness stems from designers who are “reinterpreting centuries-old craft traditions to invent contemporary designs. The work speaks to this century, yet still connects to their rich history.” It's interesting, though, that most Seoul designers don’t feel they’re doing anything all that different. They say the difference is all the attention from the West—a market for the first time. The galleries and collectors that are inquiring about their work, many of them say, are not local. But, according to Choi, that could change. “The entry point for design is through art,” she says. “And the art market in Seoul is quite established.” Any way you cut it, though, something is changing. As Yang explains it, “This was a country where the art history could not grow deep. There was a big decrease of art and culture. But now we’re seeing that being restored.” Only time will tell if the balloon, inflated so swiftly, will, like those hanging from the ceiling in his studio, maintain its shape. By Alia Akkam By Alia Akkam By Alia Akkam By Dan Avery Subscriptions Connect with AD © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Architectural Digest may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "datetime": "2020-01-20T13:00:00.000Z",
    "url": "https://www.architecturaldigest.com/story/seoul-south-korea-growing-design-scene"
}