{
    "title": "How K-pop became a global phenomenon – The Crow's Nest ",
    "text": "The Crow's Nest at USF St. Petersburg Pictured Above: BTS performed “ON” from their latest album “Map of the Soul: 7” at Grand Central Terminal for the Tonight Show. Courtesy of Jimmy Fallon on Instagram By Aya Diab Thanks to strong vocal abilities, impressive stage presence and well-choreographed dance performances, K-pop has become a global phenomenon. Hallyu, or the “Korean wave” is used to describe how South Korean culture ranging from K-pop and K-drama to Korean food and skincare came to prominence across the world. So how did K-pop conquer the world? In 1992, a South Korean band called “Seo Taiji and Boys” performed “I Know” live in a television talent contest. They introduced a new trend in the music industry back then: A mix of Korean lyrics, European pop and hip-hop and rap. But the judges didn’t like it, and the band was eliminated from the show. Little did they know that for the next 17 weeks, “I Know” smashed previous records and peaked at the top of the charts. That night in 1992, K-pop was born. Now, K-pop is a multi-billion dollar industry that contributes to a constant surge in tourism and increased appeal to South Korean products. “I like K-pop because of the hip-hop and R&B elements they incorporate into their own unique style,” said Camiya Williams, a freshman finance major on the Tampa campus. “I’ve always loved Asian media and music from other countries. But Korean music often takes influence from black culture that I find comfort in. There’s also a big emotional connection between fans and idols that I appreciate too.” BTS, or the Bangtan Boys, debuted in 2013 and is one of the most famous bands of South Korea. They are known as “record setters” as their albums sell out within minutes. In February 2020, a special episode featuring BTS on the Tonight Show Starring Jimmy Fallon aired where they performed “ON” at the Grand Central Terminal. As of June, BTS has sold more than 4 million albums, only in 2020, and the runner up is not even close. Their last album, “Map of the Soul,” topped the charts in South Korea, U.S. Billboard 2020 and the UK’s official album chart. BTS' 'Map of the Soul: 7' is their the fourth No. 1 in less than two years. https://t.co/Kr0g9FBcMe “I was introduced to K-pop back in December of 2019 by a friend,” Williams said. “The first group that I started to like was Twice, but I didn’t consider myself a K-pop fan until March because of BTS’ comeback.” Blackpink, a South Korean girl group, debuted in 2016. It’s taken them just four years to become one of the most popular girl bands in the world. In 2019, Blackpink was the first K-pop group to perform at Coachella and to reach more than 13 billion views on their YouTube channel. On Oct. 14, Netflix released “BLACKPINK: Light Up the Sky,” which tells a story of the “record-shattering Korean girl band.” The secret behind this craze over K-pop comes from different places. “I like K-pop and K-dramas because they have a message and storyline I look for,” said Thuy-Trang Tran, a sophomore health sciences major at the Tampa campus. “I was also looking for things that I felt represented in. Watching American TV (there was) no one I could relate to, so watching K-pop videos or K-dramas allowed me to feel like I matter – like I had a choice, or least people that looked like me.” Fans feel that K-pop gives them a space to belong and relate to. “I didn’t really mean to choose K-pop over other genres with a clear intent in mind but I think the main reason as to why I did was because of the sense of community that came with it,” Tran said. K-pop is thriving, but its worldwide fame may have brought many misconceptions and myths. “The biggest misconception about K-pop is that it’s a mindless trend that will die off soon and fans only consist of 13-year-old girls who want to marry the members,” Williams said. “K-pop existed before it got Western attention and will continue to exist after because it’s part of Korean culture.” Another major misconception isn’t about K-pop itself, but about its fans. “When the term K-pop gets brought up, the music isn’t what people diss, but the fans,” Tran said. “They think that the fans are crazy and too immersed in the group. When in reality the fans are just people trying to enjoy something and show others the things that brought them joy.” K-pop remains one of the most interesting – and questioned – industries of all time. Many claims about the “dark side” of K-pop emerged over the years and multiple investigations have been launched as scandals keep bringing unwanted attention to the industry. Despite the controversy, K-pop is still gaining popularity from all around the world. thanks alot of information Your email address will not be published. Required fields are marked * Comment * Name * Email * Website  Currently you have JavaScript disabled. In order to post comments, please make sure JavaScript and Cookies are enabled, and reload the page. Click here for instructions on how to enable JavaScript in your browser. ",
    "datetime": null,
    "url": "https://crowsneststpete.com/2020/11/08/how-k-pop-became-a-global-phenomenon/"
}