{
    "title": "How BTS' 'Love Yourself: Tear' became first K-pop album to top the Billboard 200",
    "text": "Jeon Jungkook was 11 years old when the first K-pop album, BoA’s self-titled English-language LP, broke into the Billboard 200 in April 2009. Just under a decade later, he’s one of the seven men who made history this week when his group BTS became the first South Korean act to top the American charts. Love Yourself: Tear, the first predominantly non-English album to hit No. 1 since Il Divo’s Ancora in 2006, is BTS’ sixth project to debut on the Billboard 200. Their 2015 record, The Most Beautiful Moment in Life, Pt. 2, was the first, peaking at No. 171, and each successive album has climbed further than the last. September’s Love Yourself: Her — which featured The Chainsmoker-penned “Best of Me” and resulted in a Steve Aoki remix of “Mic Drop” featuring Desiigner — landed at No. 7. The septet’s achievement comes after years of K-pop acts gaining sizable Stateside audiences, but failing to enter the mainstream U.S. music scene in earnest. In South Korea, America has long been considered the most important frontier of the pop culture phenomena known as the Korean Wave, or Hallyu. But while Korean acts were able to gain strong footholds throughout Asia and build up fanbases in other countries, making a long-term impact in the U.S. has previously proved elusive. Between BoA’s first album and BTS’ historic one, 20 additional Korean records, including five others by BTS, have appeared on the Billboard 200 — all by boy bands or girl groups, or from soloists who grew out of them. Several artists, including BoA, CL, and the Wonder Girls, have attempted to crossover with English-language music, but failed to make a long-lasting impact. Though the three groups are major stars throughout Asia, only BTS’ albums have stayed on the charts for longer than a week. So why has BTS been able to do so when other K-pop acts haven’t? Credit the power of BTS’ ARMY (Adorable Representative M.C. for Youth), one of the most dedicated followings in music. In 2017, BTS was the most tweeted-about celebrity on Twitter, and the most talked about Korean act on Tumblr, where they are bigger than Beyoncé, Harry Styles, and Taylor Swift. ARMY’s passion has helped propelled the act to the top of the Billboard 200. BTS has also stood out with an eclectic style of music — on Tear, they seamlessly jump between emo rap (“Fake Love”), Latin pop vibes (“Airplane pt. 2”), and bright EDM (“So What”) — and their socially aware brand of K-pop. Early K-pop acts like Seo Taiji & Boys and H.O.T. regularly addressed societal issues, but BTS is unique among their Korean peers, having sung about the stresses of economic disparity and political crises throughout their discography. Thanks to the ease of online translation services, BTS’ lyrics have helped attract fans from around the world — regardless of whether they understand Korean or not. Also powering the group’s Stateside popularity is their social media presence. BTS was one of the first K-pop acts to truly dedicate themselves to digital spaces and form a bond with fans there. As an act from a smaller Korean label — Big Hit Entertainment had success with pop ballad acts in the late ‘00s and early ‘10s, but had previously teetered towards bankruptcy — BTS was able to approach fans in a more intimate manner than groups from more traditional K-pop companies. Throughout their rise, the group has regularly posted moments of their daily lives, and frequently thank ARMY for their support. As they move further into the Stateside music industry with their latest release and an upcoming, sold-out North American leg of their world tour, there are many expectations regarding what BTS’ success means for K-pop and Hallyu (BTS was recently congratulated by South Korean President Moon Jae-in for helping Korean music top the Billboard 200.) Their rise will likely spur interest in other Korean artists and potentially lead to more regular appearances on charts (K-pop is already prominent on Billboard’s Social 50 and World Albums charts). But, like Psy, the South Korean star behind hit 2012 single “Gangnam Style,” the appeal of BTS and their music isn’t based around the language it’s performed in or the country that it’s (mostly) created in. It’s their ability to relate to fans their own age that’s landed them in a league of their own, and will help them stand as the undeniable kings of K-pop in the U.S. for years to come. ",
    "datetime": null,
    "url": "https://ew.com/music/2018/05/29/bts-k-pop-love-yourself-tear-billboard-200/"
}