{
    "title": "How Gentle Monster Rode the K-Pop Wave to $160 Million | BoF",
    "text": "Agenda-setting intelligence, analysis and advice for the global fashion community. SEOUL, South Korea — In 2011, the world was awash with Warby Parker clones: Brands that walked like Warby, talked like Warby and shilled like Warby. They capitalised on the buzzy start-up's direct-to-consumer, buy-a-pair-give-a-pair model and borrowed heavily from the company's visual identity with the hopes of capturing a slice of the eyewear market that Warby Parker had worked so hard to disrupt. Many of these clones were based outside the US, where Warby Parker lacked a presence. Several remain in operation today, including the German company Mercy Would, the Indonesian company Franc Nobel and the Australian company Bailey Nelson, which also sells in Canada, New Zealand and the UK. Hankook Kim, the founder and chief executive of the South Korean eyewear brand Gentle Monster, once thought of making a Warby Parker clone too. In 2011, Kim was running Camp Korea, an English summer camp in Seoul, when serial entrepreneur Jae W Oh — a partner in the organisation — took a shining to him. “He said, ‘Why don’t you come up with something and I’ll invest in it?’” Kim recalls. “When I first began looking into eyewear and researching the market, I found that it was a very union-controlled industry that was not explored as an artistic form.” Of course, he also found Warby Parker. “It was really growing. At that point, every company was introducing this new idea of easy, simple customer service that offered free try-ons, free returns,” he says. “It was something of a trend.” PSKIC25R5BGYVOD2HOUZMOCKJQ Gentle Monster's \"Sculptor\" glasses | Source: Courtesy While Kim certainly took cues from the American company with regards to customer service, he quickly realised that his brand, Gentle Monster, would need to be more than a copycat to survive. Especially in Asia, where consumers had an unmet desire for something completely different than their Western counterparts: ultra-oversize eyewear. “Here, having a small face is the biggest compliment,” Kim says. “There were no competitors for oversize glasses, which make heads look smaller.” That notion, combined with the need for a low-bridge fit to accommodate face shape — “eyewear was all about the Western facial structure” — meant that the Asian eyewear market was ripe for a different sort of shakeup. Backed by Oh, Kim soon discovered that Daegu, South Korea’s fourth-largest city, had been a manufacturing hub for eyewear behemoth Luxottica before production shifted to China. “There were a lot of good people still there,” he says. In 2012, armed with approximately $100,000 in funding, he bought out one Korean factory and another in China in order to manufacture acetate frames, which are illegal to produce in South Korea. “By owning the factory, we can maintain high quality with a cheaper price and control the shipping,” he added. At the same time, Kim began developing Gentle Monster's identity and aesthetic. The look was more Acne than Warby Parker, with coke-bottle-thick frames etched in gold and abstract cat-eye styles made with titanium rims. There's a strangeness to the designs, which start at a little above $200, with more intricate styles tipping over $500. The brand's physical retail experience was also unique. \"I wanted the products to look as if they were being exhibited,\" Kim says. And indeed, Gentle Monster's calling card has become its in-store concepts. For instance, on the first floor of its three-storey flagship in Seoul's Hongdae neighbourhood is the Quantum Project, a rotating installation that is transformed every 25 days. The most recent, \"Daydream Oasis,\" was a pool constructed out of egg-crate material, with silver fabric serving as the water and waves simulated with a wind machine. Before that came \"The Eaters,\" which featured mechanical heads chomping at bowls of colourful pasta. The artistic approach to retail has earned Gentle Monster plenty of write-ups on design-minded blogs, but it was its celebrity placements that gave the brand mass credentials. Conveniently, the company was just emerging as K-pop culture became a global phenomenon. (Psy's “Gangnam Style\" video was published on Youtube in July 2012, and has been viewed more than 2.6 billion times since.) In 2013 and 2014, the popular Korean actress Jun Ji-hyun wore Gentle Monster lenses on “My Love From the Star,” a 21-episode television series that was wildly popular in the country. Asian people are still influenced by celebrity, but in the US, I'm not so sure. Gentle Monster’s rise was almost as nearly as swift as that of “Gangnam Style.” By 2014, the company was generating $40 million in revenue, with a mix of wholesale and direct retail, primarily in Korea and China. In 2015, that number quadrupled to roughly $160 million. Gentle Monster’s projected revenue for 2016, with 10 direct-to-consumer retail stores now in its arsenal — seven in South Korea, one in Beijing, one in Hong Kong and one New York, with Shanghai and Los Angeles on the way — is $250 million. About 70 percent of the business is direct, with 30 percent coming from wholesale partners. WUEI3M2T5JDTBG4HIP344RVZEU Inside Gentle Monster's New York flagship | Source: Courtesy A good deal of that uptick has to do with expansion abroad, where Gentle Monster is now stocked by more than 450 stores including Harvey Nichols and Nordstrom. Kim quickly realised that there was a customer in the West just as eager to find low-bridge styles with unique designs and enlisted Won Lee — a Korean brand consultant living in New York — to be his US chief executive. In February 2016, the company opened its first US store on Grand Street in New York's SoHo neighbourhood. While the cavernous, 500-square-foot space was designed by hotshot architect Rafael de Cárdenas, it's a departure for the brand, which is used to having the room — literally and figuratively — to be a bit more grandiose. \"We didn't know construction law in the US very well,\" Lee explains. \"It's more flexible and easier in South Korea, with much lower costs.\" Gentle Monster’s next US outpost, an 11,000-square-foot space set to open in downtown Los Angeles by the end of 2016, will be more in line with those fantastical stores back in Asia. And there are talks of Miami and Dallas locations, with the goal of opening 10 more stores in the Western region — including Europe — by 2019. Even Stateside, Gentle Monster says it’s eager to attract the Asian millennial. “Students from FIT, NYU — that’s a big part of it,” Lee says. But the long-term goal, of course, is to reach an even broader audience. Gentle Monster started out as an optical company, but the goal is to make it a creatively disruptive corporation. Brand really is the genuine tool. That means less emphasis on celebrity placements. Lee says that having Kendall Jenner or Gigi Hadid photographed in Gentle Monster's lenses doesn't necessarily move the sales needle. \"Asian people are still influenced by celebrity, but here, I'm not so sure,\" Lee remarks. In fact, Kim says that the strategy now is to lessen Gentle Monster's association with K-pop, even in Asia. \"While it was beneficial to have all these celebrities wearing our glasses, in a branding sense it was problematic,\" he says. \"Today, for instance, our Instagram doesn't show too much of a celebrity presence.\" Indeed, what may propel Gentle Monster forward in the US and elsewhere is its unique design sensibility, which kept it from being seen as a copycat in the first place. After all, everything else is commoditised. Case in point: Warby Parker now offers a low-bridge fit. Perhaps, unsurprisingly, given his aggressive expansion moves, Kim’s ambitions reach far beyond eyewear. “Gentle Monster started out as an optical company, but the goal is to make it a creatively disruptive corporation,” Kim says. “Brand really is the genuine tool.” Related Articles: [ South Korea, Climbing the Ranks of Asia's 'A League' ] [ A Populist Approach at Seoul Fashion Week ] [ Inside Warby Parker’s First Offline Flagship ] © 2023 The Business of Fashion. All rights reserved. For more information read our Terms & Conditions The Business of Fashion has partnered with Soho House and Farfetch to give BoF Professional members access to two very special offers. Members of the industry index including Pierpaolo Piccioli and Francesca Bellettini connected over cocktails and canapes in Paris, celebrating new entrants including Pharrell Williams, Karol G and Sabato De Sarno. Pharrell Williams, Ashley Graham, Karol G and Naomi Campbell were among those who celebrated new entrants and longstanding members of The BoF 500 community during Paris Fashion Week. In addition to major fashion hubs like the US, UK, France and China, our latest additions to the BoF 500 come from emerging markets from Nigeria to Thailand. The essential daily round-up of fashion news, analysis, and breaking news alerts. Our newsletters may include 3rd-party advertising, by subscribing you agree to the Terms and Conditions & Privacy Policy.   ",
    "datetime": null,
    "url": "https://www.businessoffashion.com/articles/news-analysis/how-gentle-monster-road-the-k-pop-wave-to-160-million/"
}