{
    "title": "How a popular Korean soap opera is drawing Asian tourists to Quebec City | CBC News",
    "text": " A Korean soap opera shot last year in Quebec City is drawing waves of tourists from Asia to the provincial capital.  The series Goblin: The Lonely and Great God brought megastars of South Korean television to Old Quebec, incorporating features of its historic sites into the television drama's storyline.  With 250 million viewers across Asia, the soap opera's fans are now crossing the ocean to see the city for themselves.  \"We are surfing on a wave,\" said the Château Frontenac's co-ordinator of sales, marketing and public relations, Maxime Aubin.  A steady flow of visitors now seek out the lobby of Quebec City's signature hotel to have their photo taken with next to its antique mail box, which is featured in the soap opera's plot.  The hotel has also seen a five-fold increase in the number of Korean visitors reserving rooms — partly the result of a \"Goblin package\" that includes a stay at the hotel.  \"It creates a craze for the hotel itself. We have a lot more reservations from Koreans,\" Aubin said.  Tourism promoters have come up with other draws to further fan the newfound interest in the city, such as maple syrup-flavoured potato chips geared toward the Asian market and a map that marks the places in the city where the series was filmed.  Another must-see site for Goblin fans is an unassuming red door that leads into the Théâtre Petit Champlain in the Old City's Lowertown.  Although no one paid any attention to it a year ago, the door is a magical portal in the television series, allowing one of the main characters to step from his office in Korea into Old Quebec.  Now, dozens of tourists take their picture next to the door daily.  \"It's really either buses or families of Koreans that come and pose constantly every day in front of the door,\" said the theatre's director, Anne Dubé.  \"One time I thought to ask, while trying to be understood, 'Would you like to see the other side of the door?' The little family that was here said yes and entered the theatre — and were followed by about 30 Koreans,\" she said.  The Oclan Boutique across the street is also seeing a ripple effect from the attention the red door is attracting.  \"There are more people coming in front of our door to photograph the door, and sometimes they turn around to come in our place to buy things,\" said the shop's owner, Jean-François Renaud.    With files from Radio-Canada's Alain Rochefort and Marie-Maude Pontbriand Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636 It is a priority for CBC to create products that are accessible to all in Canada including people with visual, hearing, motor and cognitive challenges. Closed Captioning and Described Video is available for many CBC shows offered on CBC Gem.  ",
    "datetime": null,
    "url": "https://www.cbc.ca/news/canada/montreal/korean-soap-opera-quebec-city-1.4201193"
}