{
    "title": "How Mizoram fell in love with Korean pop culture | Eye News - The Indian Express",
    "text": "On February 10, when history was being made at the Academy Awards with South Korean film Parasite taking home four Oscars and becoming the first non-English language film to win the Best Picture Award, 11-year-old Rochanhlui Ralte woke up early, as usual, to catch a rerun of her favourite Korean series, Yellow Boots (2012), before getting ready for school. She likes this show, she says, because the lead actor is “pretty and funny”. She also enjoys Korean films because, “the actors are very handsome, and the lead actresses are usually poor, but they always get very lucky in the end.” Ralte lives in Aizawl, the capital of Mizoram. While most of the world seems to have caught the Korean culture bug with Parasite, in this north-eastern corner of India, it was around 2004 that the Korean hallyu (wave) hit the state. Stepping into Aizawl today is like stepping into any South Korean town. Youngsters, wearing bucket hats and spring dresses, look like they’ve emerged from the latest Korean fashion catalogues. They discuss Korean TV shows and movies, and Korean pop music (K-pop) bands such as Bangtan Boys (BTS) and iKon. “International mainstream media mainly focuses on people with white skin, light hair, and light eyes…people who don’t look like us. Even in Indian mainstream media, we struggled to find movie stars and musical artistes who we could relate to, visually. Korean television and K-pop changed that. Mizo teens now know that there’s a bright future for people with pan-Asian features in the world of entertainment,” says Aizawl-based poet and blogger, Jacqueline Zote, 30. C Lalmalsawma, chief technical officer, of the Mizo satellite channel LPS believes that the Korean wave in Mizoram began in 2004 with the 16-episode series called Full House, aired on a local channel. The show was a huge hit. Lalrindiki, 26, was one of those who was immediately hooked. “The main actress had a side ponytail and all the girls in our school donned a side pony that year,” says the Bachelor of education student. The Mizo cable company Zonet, founded in 2004, began broadcasting Korean shows with subtitles, alongside the popular Hindi serials of the time. According to its chief technician, K Lalhmunliana, the viewing figures for the Hindi and the Korean shows were approximately the same, until the latter began to be dubbed in Mizo. He says, “Businesses always strive for an advertising slot with Korean serials as these are the most watched shows. Advertising sponsors are ready to pay Rs 20,000 for Korean serials, but only around Rs 5,000-8,000 for English serials and films.” Annie Lalenmawii Khawlhring, 27, a banker based in Aizawl, enjoyed the show Pops in Seoul, which has been on the popular Korean channel Arirang since 1998. “It showed all the latest K-pop music videos, and my friends and I would put our phones near the TV speakers and record our favourite tracks.” More than the serials and movies, perhaps, it’s K-pop that has hooked Mizoram. Khawlhring, part of the BTS Army (fanbase) for more than five years, says, “My favourite quote these days is by Bong Joon-Ho, director of Parasite: ‘Once you overcome the one-inch tall barrier of subtitles, you will be introduced to so many more amazing films’. There are so many amazing encounters, experiences that await us once we come out of our comfort zones.” Being a part of the BTS Army has been one such experience. “It’s not just their music. They have the anti-violence Love Myself campaign with Unicef, whose message has saved so many lives. It gives us a sense of belonging, to love ourselves despite feeling unattractive or unsuccessful, to be at peace with what we are now and where we are now.” K-pop is also credited with helping the Mizo youth come to terms with varying shades of sexuality and gender. V Ratnamala, an assistant professor at Mizoram University in Aizawl, believes, “People now understand and feel comfortable discussing LGBTQI issues in Mizoram, a state otherwise known for its conservative Christian ethos.” William Lalramhmachhuana, an Aizawl-based lecturer, says, “There are two ways one can come out. One is by openly declaring their relationship, and the other is by signalling their preferred gender (and sexuality) through their physical appearance. While Korean serials don’t necessarily have any gay element in their stories, they have changed the way people look at physical appearances. Earlier, people only accepted a certain kind of hairstyle as ‘macho’, But, now, men colour their hair gray or blonde and experiment with all kinds of hairstyles with confidence as the public is slowly learning to accept them.” Not everyone appreciates Korean pop culture’s influence on the youth. Older people, for example, complain about the tight pants and vibrant hair colours embraced by youngsters as well as the “feminine nature” of K-pop singers which, they say, is imitated by Mizo boys to the detriment of their “masculinity”. Then, there are those, like the Zo Reunification Organisation (ZORO), who believe that Mizo cultural preservation and unity is hindered by the Korean wave. L Ramdinliana Renthlei, president of the ZORO Youth Wing, says, “While we are striving for unity of the Zo nation, Korean films have resulted in the youth showing contempt towards Mizo traditions and lifestyle.” Young fans of Korean culture, however, disagree. “Being a fan of K-pop and K-dramas for more than 10 years does not make me love my homeland less,” says Jorgina Ralte, 22, a college student, “It’s inspiring to listen to artistes sing about mental health and overcoming depression, which are still sensitive topics in their own country. It’s not about cultural conflicts for the K-pop fans, it’s about seeing the world beyond Mizoram. Seeing other cultures helps us value the qualities of Mizo culture such as unity and selflessness even more. We use Korean dramas and K-pop to escape the narrow confines of our state where people fuss over bikes and branded shoes.” Kimi Colney is an Aizawl-based journalist.  ",
    "datetime": "2020-03-14T11:40:11+05:30",
    "url": "https://indianexpress.com/article/express-sunday-eye/how-mizoram-fell-in-love-with-korean-pop-culture-6312033/"
}