{
    "title": "How Korean shows are adapted to become Netflix hits",
    "text": " Profile Sections tv Featured More From NBC Follow NBC News A man arrested in the killing of a Baltimore tech entrepreneur was suspected of raping a woman days before and was already under surveillance, police say September 28, 2023, 12:24 PM Michael Gambon, the actor best known for playing Dumbledore in the 'Harry Potter' films, dies at 82 September 28, 2023, 8:02 AM Morning Rundown: Biden impeachment inquiry's first hearing, Powerball jackpot nears $1 billion, and Kansas City's love story with Taylor Swift September 28, 2023, 7:36 AM U.S. soldier Travis King arrives back on American soil after being expelled from North Korea September 28, 2023, 4:04 AM Remains found in Colorado are identified as Suzanne Morphew, a mom who disappeared in 2020 September 27, 2023, 5:54 PM The mother of a man suspected of killing a Baltimore tech CEO urged him to surrender, fearing police would try to kill him September 27, 2023, 2:37 PM In a constant battle to stay relevant, streaming companies spend tens of billions of dollars each year on content, hoping to score their next breakout hit. Netflix has found its latest with the new zombie-infected Korean drama, or K-drama, “All of Us Are Dead.” And it's using what is proving to be a reliable recipe for success. Since premiering Jan. 28, the series has appeared in Netflix’s daily Top 10 lists in 94 countries — including No. 1 in the U.S. — and, for the past two weeks, was its most-watched show globally. Given the steady churn of releases, holding this top spot is no small feat. It speaks to audiences’ increasingly insatiable appetite for Korean content, both in the U.S. and internationally. It’s an appetite that Netflix and the Korean entertainment industry, which has been a major player in the world entertainment landscape for decades, have long been looking to capitalize on. “With Korean cinema, and with K-pop in particular, there is already a ready-made, built-in media template for thinking about how Korean stories can reach audiences, throughout different regions in East Asia and beyond,” Dan O’Neill, an associate professor of modern literature and media studies at the University of California, Berkeley told NBC News. “There’s already a built-in industry ambition to have this phenomenon be more than just a Korean phenomenon, and it’s backed by a lot of investment from the government and so forth.” For its part, Netflix has been funneling money into Korean content for years, recently upping the ante with an investment approaching $500 million in 2021 and, reportedly, an even larger sum this year. That investment has paid off with big hits like “Squid Game,” which became Netflix’s most successful series launch of all time; “My Name”; and “Hellbound,” among others. While the popularity of Korean dramas is nothing new — often cited as the driver behind the steadily rising global regard for Korean cultural productions, called the “Korean wave” — their status as megahits in the U.S. does signal a significant shift. Series by series, Korean dramas are toppling conventional wisdom about Americans’ interest in foreign-language productions. “All of Us Are Dead” — from creators Lee Jae-kyu, Kim Nam-su and Chun Sung-il — is about high schoolers at ground zero of a zombie apocalypse in the fictional South Korean city Hyosan. A group of fresh-faced actors — including stars Park Ji-hu, Yoon Chan-young, Park Solomon and Cho Yi-hyun — play the teenagers fighting for survival in their school’s corridors and classroom, as the infection rapidly consumes the city, along with their loved ones. The Korean drama is inspired by a popular 2009 webtoon, a genre of digital comic that originated in South Korea in the early aughts and is consumed via infinite scroll. In the intensifying race to release new content, webtoons have become fodder for Korean filmmakers and big-ticket items for streaming platforms. Netflix’s buzzy “Squid Game” and “Hellbound,” along with Apple TV+’s “Dr. Brain” and Disney+’s upcoming “Moving,” are all webtoon-inspired. “Adapting a popular webtoon for a TV show is a relatively easy way to guarantee success,” Areum Jeong, a Korean film expert at Sichuan University-Pittsburgh Institute, said. “When it’s announced that a popular webtoon will be adapted into a show, there is a lot of attention on who will be cast. These speculations become viral on social media and lead to viewership.” Another key to these shows' success is the high production value that’s become a hallmark of Korean entertainment, and K-dramas in particular. It’s one of the areas where Netflix and Korean content have been so symbiotic. “We pay a lot of attention to the visualization, the set, the music and making the storyline simpler, so it’s more approachable and easy to tune in for viewers who may not be K-drama fans before,” Don Kang, Netflix Korea’s vice president of content, said. There’s a term for what Kang is describing: the Netflix effect. For years, people have been using the term to describe how the platform launches productions and careers into infamy. But it also implies a certain aesthetic, a polish that only comes with a streaming giant’s almost unrivaled spending power. “All of Us Are Dead” follows the uber-successful K-drama model of combining Korean storytelling and high production value with a genre that lends itself to exploring themes on morality — like the zombie movie. The series is a heart-pounding combination of horror and character-building that delves into its subjects’ humanity right before they’re viciously cannibalized and reborn as flesh-hungry monsters. “The filmmakers grew up watching a lot of American cinema, as well as Japanese, so they’re well-versed in genre,” O’Neill said. “That’s their foothold into this, sort of, world cinema landscape. To be familiar with genre cinema — what people recognize at the lowest common denominator — that’s what they’re good at. And there’s a way in which Korean cinema blurs that boundary between art cinema and genre cinema in ways that other traditions have not been able to do.” “All of Us Are Dead” has the traits of a classic Hollywood zombie film. There are the usual metaphors around contagion, containment and survival, along with plenty of stomach-turning scenes. But the way it unfolds is more like a chamber drama than an action flick. As the students band together for mutual survival, making their way from classroom to classroom in the hopes of being rescued, they’re forced to weigh self-preservation against morality and the collective well-being. “These works share a commonality in questioning what humanity is, especially how human dignity can be performed or preserved in dystopian settings,” Jeong said. In the end, perhaps more unsettling than the undead creatures roaming the halls are the questions they raise about what it means to survive. How long Netflix will be able to beat back the competition, when it comes to both Korean content and fans flocking to the platform to consume it, remains to be seen. Kang said Netflix would be staying the course when it comes to its investment strategy: “We’ve invested more than 1 trillion won, so far, in Korean content. And we will continue to be committed to supporting local creators and introducing their shows globally.” But, as many people have pointed out, it’s more about the accessibility of a platform than it is about the name behind it. With the floodgates fully opened, it’s hard to imagine any one company, or sector, containing the Korean wave. “Netflix is not the only story in this,” O’Neill said. “It’s about social media. It’s about film culture, expanding through these new platforms, generating interest in many different ways that we can’t possibly anticipate.” Elaina Patton is a freelance entertainment and culture writer. © 2023 NBC UNIVERSAL ",
    "datetime": null,
    "url": "https://www.nbcnews.com/news/asian-america/korean-shows-are-adapted-become-netflix-hits-rcna16349"
}