{
    "title": "Hundreds die as heat wave bakes parts of India",
    "text": "© 2023 Copyright France 24 - All rights reserved. France 24 is not responsible for the content of external websites. Audience ratings certified by ACPM/OJD. Soaring temperatures have gripped parts of southern and northern India in an extreme heat wave which has killed more than 500 people and looks set to continue this week, officials said on Monday. Issued on: 25/05/2015 - 18:25Modified: 26/05/2015 - 07:34 The hottest place in India was Allahabad, a city in the northern state of Uttar Pradesh, which saw mercury rise to 47.7 degrees Celsius (117.8 Fahrenheit) on Sunday, while the capital Delhi recorded a high of 43.5C (110.3F). Most of the 539 recorded deaths have been of construction workers, the elderly or the homeless in the southern states of Andhra Pradesh and Telangana, said officials, but some deaths have also occurred in Uttar Pradesh, Odisha and West Bengal. The Indian Meteorological Department has issued a red warning to affected regions saying that the heat wave conditions are likely to continue over coming days.   Director of Andhra Pradesh’s Disaster Management Department K. Dhananjaya Reddy said 325 people had died of sunstroke or dehydration in the state in the last three days. “We are advising people not to go to work between 10 a.m. to 4 p.m.,” said Reddy. “We have also opened centres in different places specially in urban areas for the distribution of water and butter milk.” The government has cancelled the leave of all doctors as hospitals were being flooded with cases of heat-stroke, he said, adding that compensation of 100,000 rupees ($1,575) will be given to families of people who had died. While in the neighbouring state of Telangana, where 204 people have died, officials have advised people to stay indoors during peak afternoon hours, drink plenty of fluids and wear loose clothing. Taxi drivers in Kolkata - capital of West Bengal state where four deaths have been reported - refused to work between 11 a.m. and 4 p.m. after two cabbies died in their cars last week. The monsoon, predicted to hit southern India’s coastline on May 31, will bring some relief from the high temperatures, said weather officials. (REUTERS) Daily newsletterReceive essential international news every morning Take international news everywhere with you! Download the France 24 app The content you requested does not exist or is not available anymore. ",
    "datetime": "2015-05-25T16:25:07+00:00",
    "url": "https://www.france24.com/en/20150525-india-heat-wave-death-temperature-hot-climate"
}