{
    "title": "\n        Hyundai reveals it will open 14,005sq m Seoul duty-free store    ",
    "text": "By  Andrew Pentol \nin  Asia/Pacific, Brand News, Cosmetics, Downtown, Fashion & Leathergoods, Food & Confectionery, Fragrance, Gifts & Electronics, Jewellery & Watches, Latest News, Liquor & Wines, Product Focus, Retail News, Tobacco & New Gen\nJanuary 13, 2017 Comments Off on Hyundai reveals it will open 14,005sq m Seoul duty-free store Hyundai Department Store Group has revealed first to DFNIonline that it plans to open a new 14,005sq m duty-free store in the Convention and Exhibition Center (COEX) in Samsung-Dong (Kangnam area) in December. The company, which runs the Hyundai Department Store chain of department stores in South Korea, joined rivals Lotte Duty Free and Shinsegae in securing five-year licenses last December to operate downtown duty-free stores in Seoul. The small and medium-sized enterprise license went to TopCity with Busan Duty Free and Alpensia winning licenses for stores in Busan and Gangwon Province. Hyundai Duty Free merchandising manager Hyunjin Lee outlined to DFNIonline the attraction of the store location. “COEX attracts [high spending] Free Independent Travellers who are willing to experience medical services and Korean culture (K-Wave). This is because of the convenient transport infrastructure and various tourist attractions. “This place will grow into a worldwide landmark in a few years when there is a Hyundai Global Business Center, vast underground transit complex and Jamsil Sports Complex extension. We will provide a differentiated duty-free store with the best line-up of luxury boutiques and convenient customer lounges in a spacious store.” Lee added: “As a leading retail group in Korea, we have always been interested in new business areas. We would like to create a differentiated duty-free store that goes a step forward with upgraded service and facilities.” Focusing on high spending Free Independent Travellers rather than group tourists from China and Southeast Asia is the main goal for the first year of trading. “We will use the Hyundai Department Group global network to attract tourists from various countries.” With luxury items and Korean cosmetic products the most popular among Chinese tourists, Lee said Hyundai Duty Free would provide a wide selection of brands to suit their needs. “We also plan to develop Kangnam tourist attractions, cooperating with entertainment companies and local government.” Reflecting on Hyundai Duty Free’s license proposal itself, which was actually ranked first by the Korea Customs Service with 801.50 points ahead of rivals Lotte Duty Free and Shinsegae, Lee said: “The key elements we emphasised [to win the license] were how to attract foreign tourists, Chinese in particular, and our plan to secure letters of intent from luxury brands to work together, agree a memorandum of understanding with the government to invest in tourism infrastructure development and commitment to contribute $50m in social welfare funds. “The government gave [us] credit for our strong retail performance and good relationship with luxury brands, which are keys to success in duty-free. These are the results of our long-standing experience in the retail business.”  Tagged with: Hyundai Shinsegae ",
    "datetime": "2017-01-13T00:00:41+00:00",
    "url": "https://www.dfnionline.com/latest-news/retail/revealed-hyundai-open-new-14005-sq-m-duty-free-store-following-license-win-13-01-2017/"
}