{
    "title": "In A Post-THAAD World, K-Pop Focuses On New Markets Aside From China",
    "text": " Members of Boy band EXO (Baekhyun, Xiumin, Chen) attend the 2017 Asia Artist Awards on November 15,... [+] 2017 in Seoul, South Korea. (Photo by Han Myung-Gu/WireImage)  The spread of South Korean entertainment throughout Asia and much of the world has been going on for over two decades, and fans from around the globe have fallen in love with K-pop, K-dramas, K-beauty, Korean film and other cultural exports. With South Korea’s native population too small to sustain the industries at just over 51 million, localizing cultural exports and bringing them to other markets has been a major part of this. The Korean wave, or Hallyu, saw its biggest success in Japan, where stars like BoA, TVXQ!, Kara and Girls’ Generation embedded themselves into the local entertainment industry, and the past few years have seen a shift on K-pop’s part towards China. But that’s changing. With the Sino-Korean THAAD dispute still causing political strife, the lucrative financial relationship between Korean entertainment and Chinese financiers is seeing a lot of strain. As a result, Korean companies have begun to search elsewhere for audiences, looking towards old and new markets alike in attempts to revitalize the entertainment industries, most prominently K-pop. A return to focusing on Japan, aiming stateside, directing content towards Southeast Asian countries and leaning into Arabic-speaking audiences are all opportunities that K-pop companies are pursuing. Japan Korean singers have long since learned how to localize their sound and become part of the J-pop scene. But while K-pop is still popular in Japan, it was only within the last year or so that many of the newer acts shifted their attention to the country more fully, most noticeably TWICE, which features three Japanese members in its lineup and has topped J-pop charts, and EXO. Other groups like Gfriend and Seventeen, the latter of which has several Chinese members, recently announced plans to pursue the Japanese market. According to Jenna Gibson, the director of communication for the Korea Economic Institute of America (KEI), the chilling of relations between China and Korea may have been responsible for this shift. “You can see some signs that firms are shifting their focus in the wake of [the THAAD] dispute,” said Gibson. “EXO, for example, was very invested in the Chinese market. Obviously losing several Chinese members had an impact as well, but I find it interesting that they've recently released their first Japanese album [Countdown, on Jan. 31] and that the CBX subunit [Chen, Baekhyun, Xiumin] seems very focused on the Japanese market. I wonder if they would have started releasing so much Japanese content if China were still open to them.” EXO initially was a group formed of two smaller subunits, one Korean-oriented and one Mandarin-oriented, and has regularly released music in both languages. United States K-pop has been trying since the mid and late-2000s to break into the stateside market. While many have tried, only a handful have truly been able to make their mark, most recently BTS and their immense, unparalleled success. But that doesn’t mean that the States is getting ignored by the rest of K-pop: while China is closed off, more and more Korean acts are heading to the U.S. to tour. Boy bands are the most popular and groups like GOT7 and Monsta X have both announced tours in the States, even while neither have shows currently planned in China. Southeast Asia K-Pop is immensely popular throughout most of Southeast Asia and concerts in countries like Thailand, Malaysia, Singapore, and The Philippines are quite common. Although it has taken ever since 2008, when 2PM debuted with a Thai member, for K-pop to truly take on the market, it appears that we’re seeing a shift with the inclusion of more and more Southeast Asian artists in the industry, as companies move away from aiming primarily towards North American, Chinese, and Japanese audiences through their foreign-born, K-pop-trained stars. Not only do groups like Blackpink, NCT, CLC, and GOT7 each have Thai members, but the boy bands IN2IT and 14U each have a Malaysian and Indonesian member, respectively. Diversity isn’t only taking place in K-pop groups, but even solo acts from Southeast Asia are getting their chance to achieve success in the Korean industry: Filipina soloist Kriesha Chu earned a lot of attention following her appearance on the Korean television show K-Pop Star 6, and Singaporean singer Yu I Young, also known as Tasha, is planning to pursue a career as a soloist after previous attempts in girl groups. At the moment, there aren’t K-pop acts focusing on entering Southeast Asian countries but that’s expected to change soon; SM Entertainment’s limitless boy band NCT was formed with the intention to localize K-pop in a more direct way and there have been reports of a planned Southeast Asia unit. Middle East Korean dramas and K-pop have a long history in countries throughout the Middle East, and it’s not unheard of for K-pop acts to visit and perform in the region. But last year saw the boy band Varsity debut with an Arabic-speaking Muslim member, and the United Arab Emirates is increasingly becoming a K-pop hub: CJ E&M brought its KCON event to Abu Dhabi in 2016 and SM Entertainment recently announced that its label-wide SMTown concert will head to Dubai in April. EXO’s members even flew to the country in January to see their song \"Power\" played at the Dubai Fountain, the first time a K-pop song was played at the landmark. China isn’t going away, and many K-pop acts, such as EXO, Seventeen, Got7, NCT, and WJSN, have Chinese members and will continue to pursue that region. Other acts, including EXID and Super Junior, regularly release songs in Mandarin. The billion-strong market surrounding China is too important, and Korean entertainment entities are too popular in the country for local investors to do away with entirely. But while politics shape K-pop's fate in China, it just means K-pop’s going to look elsewhere and more fans from around the globe are going to be able to get a localized taste of Korean pop culture.  ",
    "datetime": null,
    "url": "https://www.forbes.com/sites/tamarherman/2018/02/28/in-a-post-thaad-world-k-pop-focuses-on-new-markets-aside-from-china/"
}