{
    "title": "Indiana sees drop in one type of drug, but increase in another",
    "text": "CLARKSVILLE, IN (WAVE) - Synthetic drug overdoses is down among Hoosiers. That's according to the Indiana Poison Center. One of the biggest problems with synthetic drugs, like spice and bath salts, is that they were sold in retail stores and online. \"I don't think anyone knew how dangerous they were until we saw so much of it,\" said Detective Major Darrell Rayborn of the Clarksville Police Department. The synthetic drugs have kept Clarksville police busy. Over the last few years, they've busted places like Happy Timez Smoke Shop, Julie's Needful Things, and Monroe's. All of them are now closed. \"We just shut them down, they are not here anymore,\" said Rayborn. There's a decline of these drugs across Indiana as well. State lawmakers passed the first ban on synthetic drugs in 2011. The drugs, which mainly come from overseas from countries like China, can have side effects like delusions, paranoia, chest pain, and seizures. The Indiana Poison Center reports an 86 percent decline in reported overdoses from bath salts since the ban went into effect. The number of Hoosiers overdosing on spice is also down by 61 percent. \"They are about gone we don't see much of the synthetic drugs anymore,\" said Rayborn. What Clarksville is seeing, is an increase in heroin. \"It's very addictive,\" said an undercover Clarksville Police narcotics detective. The undercover detective said users are graduating from lighter drug like spice and bath salts, and are looking for something more hard core. The price of heroin is relatively cheap. \"We're dealing with overdoses, death with overdoes and it doesn't look like it's going anywhere,\" said the detective. Because Louisville and southern Indiana have major interstates running through, that fuels the drug trafficking problem. Officials in Kentucky at Seven Counties and the Office of Drug Control Policy say they are also seeing a major decline in synthetic drugs. Both states continue to tweak the laws in order keep up with the ban against synthetic drugs. Copyright 2013 WAVE 3 News. All rights reserved. ",
    "datetime": "2013-07-24T01:42:00Z",
    "url": "https://www.wave3.com/story/22914100/indiana-sees-drop-in-one-type-of-drug-but-increase-in-another/"
}