{
    "title": "\n\tIndia’s unstoppable hallyu: Why K-dramas matter - The Hindu\n",
    "text": "To enjoy additional benefits CONNECT WITH US January 07, 2021 04:49 pm | Updated 05:38 pm IST - Hyderabad COMMents SHARE READ LATER Gone are the days when ‘K’ serials meant Indian tear-jerkers or confusing family dramas with complicated ‘memory loss’ plots and endless twists of reincarnation. The new K-drama lovers don’t just stop at watching the dramas: they pick up the language, explore the food and immerse themselves in the culture — of Korea. Also Read: Get 'First Day First Show', our weekly newsletter from the world of cinema, in your inbox .\nYou can subscribe for free here While the Korean wave or\n hallyu  dates back to the 1990s, increased penetration of the Internet and streaming services in the last few years has made South Korean stars like Hyun Bin and Ha Ji-won of\nSecret Garden , Son Ye-jin and Jung Hae-in of\nSomething In the Rain , Gong Yoo of\nCoffee Prince and Goblin , Lee Min-ho of\nBoys Over Flowers and Park Seo-joon of\nFight For My Way household names in India. Surging forward OTT platforms too have caught on to this trend and have picked up K-dramas like\nThe Uncanny Encounter ,\nIt’s Okay To Not Be Okay ,\nRun On ,\nPrivate Lives and\nStranger . A recent Netflix report states, “The viewing for K-dramas on Netflix in India increased more than 370% in 2020 over 2019.” Fans say Korean dramas are better than Indian soaps because the scripts are well-written, and every aspect of modern life, from romance and office politics to family dramas, makes an appearance. Hyderabad-based K Pavani, a 22-year-old chartered accountancy student often finds herself confusing her mother with Korean words while speaking in Telugu. She says, “I stay up at night to finish a series I started watching. It helps me go into a ‘la la land’, especially the romance. What they show is fiction and may never happen in real life, but it is still something you can believe has a possibility of happening.” A by-product of the K-drama craze is Indian curiosity towards Korean food, language and culture, among K-fans of all ages. Mumbai-based children’s book author and a mother of two teenagers, Lubaina Tyebji Bandukwala (50), says, “The script is such that the viewer gets involved with the lives of the protagonists. I love the storytelling. I just finished watching\nCrash Landing On You and and though the trapping was improbable, it all paled into insignificance once the relationship between the characters grew. I love the way they treat food and show cooking as an art of love.” With many productions — especially the smaller ones — turning to Netflix, veiwership seems to be on a steep rise. The TV series are now viewed widely across 190 countries.\nThe Korean Times also reported a rise in K-drama viewership during lockdown, making India among the top six countries contributing to views of K-pop and dramas. Ramya Boddupalli Ramya Boddupalli Twenty nine-year-old Ramya Boddupalli, a research consultant in New Delhi, says long-format Korean dramas are best suited to kill time. She started watching in June last year when she was in quarantine. She was introduced to it by her friends Mellisa Cyrill and Nishtha Vengurlekar who run Indo-Chingu, a page on Instagram that discusses and reviews K-drama. Ramya says, “I resisted it for the longest time. Finally in June, I caved in. I am someone who loves dissecting story plots. I also love to read analyses of shows.\nChingu  is the Korean word for friend.” Sandhya Ramesh (32), social media manager at a women’s health organisation in Mumbai says, “ I think the pandemic pushed us into all kinds of directions. For me, a gentle nudge from my friend let me into the world of Korean Drama, and in less than a month, I have already seen 14 shows (and counting). I have evangelised a few of my friends and have also got my parents hooked on to them. K-dramas offer an escape from our present.” Some fans have even made it a point to travel to South Korea to get the real feel. Like Sindhoo Dhana, a 28-year-old Chennai-based software business analyst, who has been watching K-dramas since 2008 and says, “My friends were surprised at how much I knew about the streets and place from the shows.” Hyderabad-based Cho Mi Young at her takeaway Go Gu Ryeo Hyderabad-based Cho Mi Young at her takeaway Go Gu Ryeo South Korean national Cho Mi Young (50) has made Hyderabad her home, and runs a guest house for working Korean nationals, The guest house canteen, called Go Gu Ryeo, specialises in Korean food. The moment she listed the canteen on food delivery apps, a suprisingly high number of enquiries poured in from locals. Most enquiries are about\n kimchi ,\nkimbab ,\nkatsu curry,\nkimchi stew etc. She says, “When orders are placed it is always with a reference to a show they are watching. After Korean fried chicken the dish that is asked for most is\nkatsu curry and Korean\n ramen.” Journalist-editor Vaani Sai is so passionate about K-drama and Korean culture that she ended up moving to Seoul, South Korea, to work as an English teacher. In the past year-and-a-half, the 23-year-old has immersed herself in travels through regions in South Korea such as Jeonju, Gyeongbokgung, and Pocheon Art Valley. “I was introduced to Korean culture as a teenager through K-pop and then K-dramas in 2010. A Korean-Canadian friend showed us some music videos during a sleepover and I decided to watch more at home the next day. At that point, those were the first ‘foreign’ pieces of entertainment I had been exposed to,” she says. Vaani Sai in Jeonju Vaani Sai in Jeonju Vaani continues, “I also noticed that Korean culture places high emphasis on the visuals and aesthetic, which really drew me in. Everything was always so literally beautiful in dramas or K-pop music videos, and it made me want to live that sort of life for myself leading to my decision to move to Seoul. I think I love K-dramas more now because it is fun to see something familiar on shows and claim ‘Oh! I’ve been there!’, or understand a nuanced joke because I have a deeper understanding of the language and history. I am living in my own sort of K-drama as I visit locations that have been used as sets or film locations. It is also exciting to see the entertainment scene change here and include more racially diverse characters as the demographic of Korea diversifies.” (\nWith inputs from Divya Kala Bhavani ) COMMents SHARE The Hindu MetroPlus\n\n/\n\nHyderabad\n\n/\n\nSouth Korea\n\n/\n\ntelevision\n\n/\n\ntelevision personalities\n\n/\n\nentertainment (general) BACK TO TOP Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. ",
    "datetime": "2021-01-07T11:19:50.000Z",
    "url": "https://www.thehindu.com/entertainment/indias-unstoppable-hallyu-why-k-dramas-matter/article33520502.ece"
}