{
    "title": "\n\tIndian vernacular, with a dash of Korean lingo - The Hindu\n",
    "text": "To enjoy additional benefits CONNECT WITH US October 13, 2021 01:59 pm | Updated 10:56 pm IST - Hyderabad COMMents SHARE READ LATER Culture trail The cast of K-drama series Hospital Playlist; (below) language trainer Era Kaundal The K-pop wave has finally spilled into the Oxford English Dictionary. Driven by the popularity of Korean culture — especially its drama, cuisine and music — 26 Korean words were recently included in the influential dictionary. A majority of the words are food-related thanks to the popularity of Korean food, highlighted often in K-drama productions, such as\nHospital Playlist, Let’s Eat, Wok of Love andItaewon Class.  The words include\nbanchan (a side dish of vegetables),\nbulgogi  (dish with sliced beef/pork),\ndongchimi (a type of radish kimchi),\njapchae  (dish of glass noodles),\nkimbap (dish with rice) and\nsamgyeopsal (dish using pork belly). A set-up of a Korean barbecue with various meats and vegetables A set-up of a Korean barbecue with various meats and vegetables The other words, such as\nskinship  (touch friendly),\nPC bang (gaming room) and\n daebak (goodness)  commonly figure in K-drama and music. In India, one of the most commonly used words, especially by K-drama fans, is\nommo, an equivalent of the English expression ‘Oh no!’ Hyderabad-based K Pavani, a 23-year-old chartered accountancy student often confuses her mother when she uses Korean words in their Telugu conversations. It was BTS (K-pop group) that got her swaying into the Hallyu trend. She says, “I use words such as\nsincha (really),\naneyong (hello), o\nmmo and\ndaebak all the time. My mother and non K-drama watchers give me puzzled looks, but I like the sound of the words.” Also Read |\nIndia’s unstoppable hallyu: Why K-dramas matter Does she drop Korean words with her friends too? She laughs, “When I am with someone who understands them, we enjoy a conversation laced with Korean words. Thankfully almost all of my friends watch K-drama so the conversation is fun. We do watch parties and spent a good amount of time dropping time comments on shows all of last year.” Delhi-based Korean language trainer Era Kaundal Delhi-based Korean language trainer Era Kaundal K-drama fans love addressing each other as\nchingu (friends) when seeking help with the watchlist and find themselves using words like\nkhamsamida (thank you) in conversations. For those who are new to K-drama, it is easy to connect with words such as\nAppa/babuji (father) and\nomoni (mother), as they are familiar to Indians. K-dramas have led to an increasing number of Korean language tutors such as @mykoreandic, @kunkorean, @hyd_korean_club on Instagram. Delhi-based Korean language trainer Era Kaundal (@eraindiekor) is quite active with Korean language classes on social media. She witnessed a spike in interest post November 2020 and was pretty amazed to find people asking her to breakdown simple English sentences into Korean. Era, who began with conducting Korean language classes online, says most K-drama watchers start taking an interest in the language because they want to learn more than the common phrases they hear. Most of her students are K-pop and K-drama fans in the age group of 17-30 years. Era, who is soon starting a basic online class, says, “The ones who follow me or write to me on social media are in the age group of 14-17 years who are looking at self tutoring. Working people tend to sign up for classes, as they want to learn for the sheer joy of being able to understand a new language.” Favourite phrases K-drama watchers also use words such as\nbaegopa (hungry),\nkhaja (let’s go)\nddaeng (wrong)\nmokkogalle  (eat)\najjusi (mister),\nalgesso (okay),\nmicchosso (crazy),\nshiro (no),\nottoke (how)\nyeppuda  (pretty) and\nodi (where).\n Some even use common Korean corporate titles such as\nSajangnim  (chief) and\nBujangnim  (general manger) for their pets. Many tutorials are linked to trending K-dramas that enable fans to relate to what they are watching. Right now, the popular survival drama series\nSquid Game is a part of many flash tutorials on social media. This apart, tutorials such as ‘guess the word’ and multiple choice quizzes on Korean vocabulary increase confidence in using Korean in conversations. K-fans also strive to learn Korean one word at a time via social media platforms so they can understand K-drama dialogues without subtitles. Mumbai-based lawyer Ramya Shanker explains, “Subtitles are often crude and distort the emotion or the mood of the story. As I learnt one word at a time from various online platforms or through basic conversation with like-minded K-drama watchers, I have signed up for classes.” Majority K-drama lovers feel dubbed and subtitles dilute or alter the meaning of original dialogues. Many tend to fall back on discussions on closed groups to get the right mood. The best way to enjoy K-drama is in the original language. Which holds true for other languge shows as well. Take for eg. the subtitled lyrics of Bollywood songs. The subtitles to the lyrics is completely senseless.” added Ramya. Ramya’s quotidian conversations have words and phrases such as\nGwenchana (are you fine),\nsaranghae (love you). She also calls a stray cat that visits her\nGoyangi . She explains, “\nGoyangi in Korean means cat, I love the word.” COMMents SHARE The Hindu MetroPlus\n\n/\n\nHyderabad\n\n/\n\nlifestyle and leisure\n\n/\n\nentertainment (general)\n\n/\n\nSouth Korea\n\n/\n\ntelevision\n\n/\n\nculture (general)\n\n/\n\nlanguage BACK TO TOP Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. ",
    "datetime": "2021-10-13T08:29:58.000Z",
    "url": "https://www.thehindu.com/society/korean-drama-culture-wave-across-india-in-everday-language-conversation-bts/article36979919.ece"
}