{
    "title": "Influencers Riding the TikTok Wave: $30K for a Sponsored Post? – The Hollywood Reporter",
    "text": "Subscribe for full access to The Hollywood Reporter Subscribe for full access to The Hollywood Reporter Fashion brands are flocking to the tween-heavy platform and reaching a Gen Z audience that is \"very highly engaged.\" By \n\n\tLindsay Weinberg author Meme lovers were surprised to see a familiar face on the American Music Awards red carpet in November. Brittany Tomlinson — known as “Kombucha Girl” after a TikTok video of her trying the drink was viewed by 40 million people on Twitter — stepped out in a custom-made black dress. The 22-year-old Texas native with 2.3 million TikTok followers tweeted “Dinner is served” about her first red carpet outing. As more young stars turn to the Chinese-owned shortform video platform — which now has an estimated 26.5 million monthly active U.S. users, 60 percent of them ages 16 to 24 — the fashion industry is discovering that the next wave of style influencers might just be TikTok creators. Related Stories\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tBusiness\n\t\t\t\n\n\n\n\t\n\t\t\n\t\t\t\t\tWME Owner Endeavor Looking at \"Strategic Alternatives\" for Company Assets\t\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tTV\n\t\t\t\n\n\n\n\t\n\t\t\n\t\t\t\t\tIn the Midst of War, This Israeli-Palestinian Couple Is Turning Their Relationship Into a TV Series For Tomlinson, the August kombucha post led to signing with UTA (the agency’s first in that area) and a move to L.A. in December. The recent Texas A&M grad, who has posted sponsored content with e.l.f. Cosmetics, says she’s interested in partnering with brands that “I have bought or wore before any of this all happened. I want to genuinely like the product.” As for TikTokers becoming the next fashion icons, she says, “It’s already happening with E-girls and E-boys and everybody wearing chains and the long-sleeved shirts. It’s already happening where people like Tana Mongeau and Billie Eilish are inspiring young girls and boys everywhere to not be so preoccupied with how you look.” In fact, internet-based E-girl and E-boy styles were some of the top Google searches of 2019 for “Fashion Style” and “Outfit Ideas.” Me trying Kombucha for the first time #foryoupage #foryou #fyp #AllBrandNew original sound – brittanyt445  According to CAA digital media agent Lydia Fotiadou, labels like Celine and Calvin Klein have “realized the importance” of the app and “TikTok creators are a growing area of interest” for the agency. Jill McDermott, co-founder of Michele Marie PR, adds that “TikTok influencers will be a huge focus” for the fashion publicity company in 2020. While she says Instagram is a place to court millennials, TikTok is an opportunity “to target Gen Z as well. This is the platform they love. Their followers are engaged and devoted, and conversion is expected to be high.” Marlee Martinez, founder of lifestyle, marketing and public relations company Valleymade & Co., adds that “TikTok stars have the ‘It’ factor at the moment. They connect with their young audience with humor, creativity and fashion statements. … These stars are appealing for brand placements as they use innovative storytelling to a large audience, which sells.”  Spring, a fashion brand development and PR agency, recently scored its first TikTok placement after it sent fashion influencer Chriselle Lim a bag from Sydney-based brand Aje, and Lim wore it in a TikTok video. Amy Neben, a partner at Select Management Group, says she’s signing native TikTokers and encouraging other clients to join the platform because “the audience on TikTok is very highly engaged.” Select recently signed its first native TikTok creator, Ben De Almeida, known as @Benoftheweek (2.4 million TikTok followers), who has since posted sponsored videos with NYX Cosmetics and Old Spice. According to Neben, De Almeida was getting “a lot of inquiries” from brands and needed someone to negotiate on his behalf. Sponsored TikTok videos typically earn a top creator no more than $20,000 or $30,000, though a Hollywood star like Will Smith could fetch up to six figures. how i go from RAT to THAT thanks to @nyxcosmetics #BornToGlow #Ad #BornToGlow – NYX Cosmetics  TikTok has created tools on its site to enable partnerships with lifestyle companies, including a beta program that allows some users to link directly from videos to shop websites to buy products, which Neben says is of “big” importance to brands. TikTok Creator Marketplace, launched in September, allows TikTok-approved agencies and brands to search for users using filters (such as follower count, content topics, audience analysis) to choose “the most relevant creators for their campaign,” according to a TikTok spokesperson. “Brands can view the most recent and popular videos with performance metrics under each creator’s profile to help them further understand a creator’s work.” Several fashion labels have started “challenges” or campaigns on TikTok to tap into audience engagement, including Ralph Lauren in August with the #WinningRL hashtag, MAC Cosmetics in September with #YouOwnIt and NARS in December with #HolidayBeat.  Neben notes, however, that so far, “brands are more familiar with Instagram — it’s a proven platform.” TikTok also presents some challenges for fashion companies because product exposure is fleeting, with posts running just 15 or 60 seconds. Says Greg Goodfried, co-head of UTA’s digital talent division, about the platform’s long-term prospects: “There’s a great unknown with TikTok. It’s very much a wait-and-see approach.” Updated Jan. 8 at 3 p.m. A version of this story first appeared in the Jan. 8 issue of The Hollywood Reporter magazine. To receive the magazine, click here to subscribe. Sign up for THR news straight to your inbox every day Sign up for THR news straight to your inbox every day Subscribe for full access to The Hollywood Reporter Send us a tip using our anonymous form. ",
    "datetime": "2020-01-07T10:00:00+00:00",
    "url": "https://www.hollywoodreporter.com/lifestyle/style/influencers-riding-tiktok-wave-30k-a-sponsored-post-1265284/"
}