{
    "title": "Insight: Work ethic, comic hero make Koreans hot shots in car design | Reuters",
    "text": "Discover Thomson Reuters By Norihiko Shirouzu, Hyunjoo Jin 9 Min Read (Reuters) - In today’s auto industry, where famed Japanese quality and durability are increasingly a given, design is king and, among designers, South Koreans are hot property. From General Motors’ bold Chevrolet Camaro to the quintessential British gentlemen’s Bentley, more top models carry the flair and signature of a group of designers from South Korea, which some have dubbed “Asia’s Italy” for its impact on car design, fashion and aesthetics. As competition in the industry becomes ever more cut-throat, partly as gaps in quality and technology narrow, automakers need bolder, edgier designs to differentiate. From a global talent pool, South Koreans stand out. Designers, including Sangyup Lee, Jinwon Kim and Jay Jongwon Kim, are gaining influence at automakers in the United States and Europe, and even at Toyota Motor, as well as, of course, at Hyundai Motor and Kia Motors. Theories for this Korean wave vary: from Hyundai’s rise and the nation’s work ethic, to a societal emphasis on external beauty - Korea has a thriving cosmetic surgery industry - and the impact of a 1990s comic book and TV series called “Asphalt Man”, which starred local heartthrob Lee Byung-hun as a young car designer. The aspiring fictional designer inspired “a lot of kids, including me, at the time,” said Sangyup Lee, who is in charge of exterior design and advanced design at Bentley’s main studio in Crewe, in northwest England. Four years ago, Lee led a Korean-Russian-Brazilian team that redesigned the new Camaro for launch by GM in 2009. He later moved to Volkswagen and then to the German group’s Bentley unit. Another member of the Camaro team was Steve Kim, a Korean native, who is a director at GM’s design studio in Seoul. The two used to work in the basement of Lee’s house in a Detroit suburb, often late into the night tossing around ideas and filling up sketchpads to conjure up the new Camaro. “KOREAN MAFIA” At GM, the Detroit automaker that bought failed Daewoo Motors in 2002, close to three dozen Koreans are among several hundred professionals working at the main U.S. studio in Warren, Michigan - and are dubbed the “Korean mafia” or “K-team”. Tim Lee, GM’s global manufacturing chief and China unit chairman, says most global brands are now equally capable on quality and technology. “What sets us apart? Great design and (economies of) scale,” he said, noting a successful automaker has to offer more car for the customer at affordable prices. At Toyota, Jinwon Kim led the design of the FJ-Cruiser, an edgy sport utility vehicle. Mercedes-Benz designer Hubert Lee, American-born but who grew up in Seoul, masterminded the styling of the CLS luxury coupe, and Jay Jongwon Kim is a rising talent at Opel, one of the design brains behind the Monza concept car that won plaudits at this year’s Frankfurt auto show. “Koreans are extremely good designers, well trained and disciplined,” said Chris Bangle, a former BMW design chief who now runs a design consultancy in Italy. Bumsuk Lim, a Korean native and a professor of car design at the Art Center College of Design in Pasadena, California - widely regarded as the Harvard of auto design - says the rise of Korean designers is a result of a turn in the global industry. “In most mature markets people have moved on and cars are generally nothing more than a means of transportation,” he said. “In Korea and, increasingly, China, people still dream of owning cars and they’re considered a status symbol,” making car design a desirable profession. In a typical class of 12-15 students at the Art Center, more than half are Asian, and half of those are Korean, noted Lim, who previously worked at GM and Honda Motor. GM’s Steve Kim noted that economic power shifts mean the next wave of designers is likely to emerge from China and Southeast Asia. A trailblazer for today’s Korean design talent was John Chun, a Korean War veteran who in the late-1960s designed Shelby Cobras, tricked-out performance variants of the Ford Mustang. Chun, who was also a consultant to Hyundai and worked for Tonka Toys, died in July, aged 84. A couple of decades later, Art Center’s Lim and Bentley’s Lee came of age, paving the way for the current generation of Korean designers, though Bangle, the ex-BMW design chief, said the world is still waiting for Korea to produce the likes of Japan’s Ken Okuyama, who designed the Ferrari Enzo, and Shiro Nakamura, Nissan Motor’s chief designer. Beyond an innate design talent, Koreans’ success owes much to the nation’s famed work ethic and tenacity, said Bangle, recalling how Jay Jongwon Kim, an industrial design student, turned up unannounced at BMW’s Munich studio one day in 2006. With no appointment, Kim paid his own way to Germany armed only with the address of BMW’s headquarters, a portfolio of designs and a hunger to succeed. Once he had located the design studio, Kim had to beg reluctant receptionists to call a designer whose name he had found on the Internet. The student, who barely spoke English, let alone German, was eventually allowed in and gave the first of half a dozen presentations that day, first at the MINI studio and then at the main BMW studio to Bangle and current BMW design chief Adrian Van Hooydonk. Six months later, Kim was back at BMW, this time with an appointment, to present to Bangle a scaled-down model of a design he had shown earlier. He gave a dazzling presentation, complete with lights and music, and was offered an internship on the spot. That led to a formal job offer seven months later, which was scuppered by the 2008 global financial crisis. Undeterred, Kim secured a position at Mercedes-Benz’s studio in Yokohama, and later moved to GM’s Opel, where his work on the Monza concept hints at the design language for Opel’s next generation of cars. A key member of GM’s “Korean mafia” in Michigan is Christine Park, who was lead interior designer for the Cadillac XTS full-size sedan launched last year to help revive the storied brand. Park, now Cadillac’s lead exterior designer, says the success of her compatriots coincides with the rise of Korea’s fashion and architectural industries as the economy has prospered. She says her parents and grandparents are part of Korea’s lost generation for whom life was a tough slog through Japanese occupation, World War II and the Korean War. “They had to worry about whether they had enough to eat day to day,” said the Korea native who was educated in California. Parents wanted their children to become lawyers, doctors or engineers, she added. “Now, art is very much celebrated,” making car design a more desirable career choice. Bentley’s Lee said Koreans are also playing catch-up with developed car markets as they lacked a “car culture.” The 44-year-old said that, unlike some of his peers today, his family did not have “a big garage full of hot-rod cars.” Similarly, Kim at Opel, the son of a rice miller, said he rarely saw cars on the streets of Buan when he was growing up. From the age of 12, Lee attended “art cram school” in the evenings in Seoul, determined to gain entry to Hongik University, a leading art school. He went on to study sculpture at Hongik and then car design at Art Center, before joining GM in 1999 after a stint at Porsche and Pininfarina, an independent Italian design studio. “We don’t have a strong automotive tradition in Korea, so most of us are very hungry and willing to work hard” to gain the knowledge and expertise in car design, Lee said. “That makes us flexible and versatile.” The biggest challenge for Korean designers now is consistency, moving from one-off hits to developing a lasting legacy that is “the definition of good designers,” Patrick le Quement, Renault’s design chief who retired in 2009 after 22 years, said in an email exchange. “Design is like F1 racing, it’s good to win a race, but it doesn’t mean you’ll become world champion. There are drivers who made a habit of winning and those that won occasionally, for lack of talent, concentration and dedication.” “I’m very impressed by the overall quality of young Korean designers. Consistency is the sign of real talent.” Editing by Ian Geoghegan Our Standards: The Thomson Reuters Trust Principles. All quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays. ",
    "datetime": null,
    "url": "https://www.reuters.com/article/us-autos-design-korea-insight-idUSBRE9AH12820131118"
}