{
    "title": "Inside ‘Hallyu! The Korean Wave’, The V&A’s Playful Exhibition Celebrating Korean Fashion & Culture | British Vogue",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, select My Account, then View saved stories To revisit this article, visit My Profile, then View saved stories To revisit this article, select My Account, then View saved stories By Fiona Bae As a teenager growing up in Korea, I wasn’t allowed to travel outside of the country for leisure until 1988. Japanese films and J-pop were banned until 1998, and Korea felt culturally deprived. I often wished I had been born in London or New York instead. So to see my favourite museum in London, the V&A, stage a first-of-its-kind exhibition celebrating the meteoric rise of Korean culture in the same month that I witnessed the remarkable success of Frieze Seoul is simply electrifying. With more than 200 objects and immersive experiences, Hallyu! The Korean Wave, lets you into the groovy, joyful and vibrant world of K-pop, K-film, K-beauty and beyond. Section one, “From Rubble To Smartphones”, provides historical context for the rapidly growing fascination with South Korean culture. You see a monumental 1986 video sculpture by artist Nam June Paik, who was ahead of his time in foreseeing the future of telecommunications. Paik would be proud of the way that young Koreans today have conquered the world with their digital savvy, absorbing everything cool and sharing it instantly. Whether through choreography, fashion, art or music, Koreans’ desire to express their personal taste has propelled the Korean wave to the forefront of the global consciousness. The Squid Game costumes are on display as part of Hallyu! By Hannah Coates By Hannah Jackson By Sunita Kumar Nair It’s remarkable how, within living memory, Korea has grown from one of the poorest countries in the ’60s to the cultural powerhouse we see today. The 1988 Seoul Olympic Games were a source of renewed national pride for Korea, and on show here is a volunteer guide uniform from the games. This uniform drew inspiration from the hanbok, the national costume, and still looks stylish today. In the later fashion section of the exhibition, the hanbok is a strong focus. The second section of the exhibition, “Setting The Scene” delves into K-drama and film. The iconic pink guard costumes and green tracksuit from hit Netflix series Squid Game are obvious crowdpleasers, as is the set recreation from Bong Joon-ho’s Oscar-winning film Parasite. Don’t miss a grooming kit and the handwritten letter from Park Chan-wook’s The Handmaiden, and prop photographs from indie film Minari. That said, there is an exciting new generation of female filmmakers in Korea, and it’s a shame not to see them celebrated more here. House of Hummingbird by Kim Bora is mentioned, but I left wishing there was more space. A view of Nam June Paik’s Mirage Stage. By Hannah Coates By Hannah Jackson By Sunita Kumar Nair As you move through the exhibition, the energy starts to build. In “Global Groove”, the unabashed celebration of the glamour and joy of K-pop and the fantasy that’s contained within its videos and staging is on full display. Entering the gallery through a corridor lined with dozens of light sticks – including ones for K-pop heroes Blackpink, BTS, Big Bang, NCT and Twice – makes you feel like you’re eagerly waiting for those idols to appear onstage. For K-pop fans, light sticks are a way to interact with bands during live shows, glowing in a colour associated with a group. These light sticks are a nod to an underground movement, driven by a tech-savvy and socially conscious fanbase who have felt empowered by K-pop and all it represents. For those eager to try out their own K-pop dance moves, the interactive dance challenge is a must. Enter a dedicated booth with an energetic K-pop soundtrack and find out if you’re a trainee, rookie or superstar. Your recorded moves become part of an evolving wall display, created in partnership with the Google Arts & Culture Lab. “Untitled G-Dragon: A Space Of No Name” by Gwon Osang. By Hannah Coates By Hannah Jackson By Sunita Kumar Nair A rising star in the Korean art world, sculptor Gwon Osang also presents a K-pop idol duelling with another version of himself in his sculpture “Untitled G-Dragon: A Space Of No Name”. Long before Jennie charmed Chanel, G-Dragon became a global style icon – adored by the late Karl Lagerfeld for his bold, androgynous looks. It is wonderful to see him celebrated here. Also not to be missed? The looks created for the V&A show by celebrated K-pop stylist and visual director Gee Eun, who has worked closely with G-Dragon and Blackpink in the past. In the exhibition catalogue, Gee Eun says, “[What’s] key for me is not just working with international labels but finding ways to bring what is most Korean to the contemporary world,” an ethos embodied within these works. K-pop is central to the exhibition. The final section, “Inside Out”, homes in on K-beauty and fashion, underlining their origins while showcasing the innovation that has led to new aesthetic standards. Remixing different inspirations is one of the key tenets of contemporary Korean style. Hallyu!, in particular, explores how new creatives are reimagining and playing with the silhouette of hanbok through design and styling. By Hannah Coates By Hannah Jackson By Sunita Kumar Nair “I wanted to mix traditional Korean garments with European ones, so I asked for the entire list of the European costumes and mannequins the V&A owns to figure out what to match,” says acclaimed stylist Suh Younghee of her contribution. For Hallyu!, she combines multiple layers of summer hanbok underskirts, underpants and under jackets with an 18th-century European hoop skirt to create a unique look called Beyond Underwear. Meanwhile, Tchai Kim, who pioneered the “fashion hanbok” movement to give an elevated status to traditional costumes (her dresses are most coveted for Korean brides), has transformed a cheollik, or men’s riding coat, into an exquisite women’s ensemble using luxurious silk. The Peony dress by Miss Sohee. You can glimpse into the future of K-fashion with works from young designers, too. Ji Won Choi’s hanbok-influenced leisurewear, made in collaboration with Adidas in 2019, has been worn by Beyoncé. Freshly graduated from Central Saint Martins, Sohee Park of Miss Sohee is being heralded as a new-gen couturier. Her sculptural silhouettes are carefully crafted and embroidered by hand using deadstock and recycled fabric. With so much flux and contrast in Korean culture, it is a challenging task to cover so many facets, and at times there is a lack of cohesion in the staging. However, throughout Hallyu!, there is an abundance of dynamic energy on display that echoes that of Korea itself. It will make you want to dance and sing – and it will make you want to remix like Koreans do. By Hannah Coates By Hannah Jackson By Sunita Kumar Nair Hallyu! The Korean Wave is at the V&A until 25 June 2023. Make, Break, Remix: The Rise Of K-Style by Fiona Bae is out now. By Hayley Maitland House Party! Actors, Models, Designers & Editors Star In A Glamorous Salute To Vogue House From Spooky Designs To Stiletto Shapes, Pro Manicurists Weigh In On The Best Halloween Nails The Best Beauty Advent Calendars 2023 Has To Offer British Vogue’s November 2023 Cover Story Is A Star-Studded Farewell To Vogue House Vogue’s First Ever Festive Calendar Has Landed Subscribe To The Vogue Daily Newsletter The Key Autumn/Winter 2023 Trends To Know Now By Hannah Coates By Hannah Jackson By Sunita Kumar Nair By Alice Cary More from Vogue Condé Nast Britain © 2023 Condé Nast ",
    "datetime": "2022-09-24T17:25:00.080Z",
    "url": "https://www.vogue.co.uk/arts-and-lifestyle/article/hallyu-korean-wave-exhibition-review"
}