{
    "title": "Interplay of charge density wave and multiband superconductivity in 2H-PdxTaSe2 | Scientific Reports",
    "text": "Thank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\n            the best experience, we recommend you use a more up to date browser (or turn off compatibility mode in\n            Internet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles\n            and JavaScript. Advertisement Scientific Reports\nvolume 6, Article number: 24068 (2016)\n            Cite this article 5562 Accesses 52 Citations 1 Altmetric Metrics details 2H-TaSe2 has been one of unique transition metal dichalcogenides exhibiting several phase transitions due to a delicate balance among competing electronic ground states. An unusual metallic state at high-T is sequentially followed by an incommensurate charge density wave (ICDW) state at ≈122 K and a commensurate charge density wave (CCDW) state at ≈90 K, and superconductivity at TC ~ 0.14 K. Upon systematic intercalation of Pd ions into TaSe2, we find that CCDW order is destabilized more rapidly than ICDW to indicate a hidden quantum phase transition point at x ~ 0.09–0.10. Moreover, TC shows a dramatic enhancement up to 3.3 K at x = 0.08, ~24 times of TC in 2H-TaSe2, in proportional to the density of states N(EF). Investigations of upper critical fields Hc2 in single crystals reveal evidences of multiband superconductivity as temperature-dependent anisotropy factor γH = , quasi-linear increase of , and an upward, positive-curvature in  near TC. Furthermore, analysis of temperature-dependent electronic specific heat corroborates the presence of multiple superconducting gaps. Based on above findings and electronic phase diagram vs x, we propose that the increase of N(EF) and effective electron-phonon coupling in the vicinity of CDW quantum phase transition should be a key to the large enhancement of TC in PdxTaSe2. Transition metal dichalcogenides (TMDCs) have been extensively studied for decades due to their rich electronic properties resulting from their low dimensionality. These systems have the layered structure and share the formula MX2, where M is a transition metal atom (M = Ti, Zr, Hf, V, Nb, Ta, Mo, W and Re), and X is a chalcogen atom (X = S, Se, and Te)1,2,3. Each layer consists of a hexagonal transition metal sheet sandwiched by two similar chalcogen sheets and the layers are coupled to each other by weak van der Waals force. Within the layers, they form strongly bonded, two dimensional X-X layers while M has either trigonal prismatic or octahedral coordination with X. Many of these compounds exhibit charge-density wave (CDW) and some of them manifest the competition/coexistence between CDW and superconductivity1,2,3. It is common in many of these compounds that superconductivity emerges in the vicinity of the CDW quantum phase transition induced by intercalation of variety of elements into the van der Waal gaps4,5,6,7,8,9 and by the application of pressure10,11 or gate voltage to the pristine compound12. The overall electronic phase diagram as a function of doping, gate voltage or pressure are thus analogous to those of high-TC cuprates, iron based superconductors and heavy fermion materials, suggesting possible role of the CDW quantum critical point on the creation of superconductivity. However, exact physical origin for stabilizing the superconductivity over the CDW state has not been well understood and should be further clarified in each TMDC system. The 2H-polymorph of tantalum diselenide (TaSe2) is yet another renowned CDW system, in which an unusual metallic state at high temperatures enters into an incommensurate-charge-density wave (ICDW) phase at TICDW ≈ 122 K, followed by a first order “lock-in” transition to a commensurate charge density-wave (CCDW) phase at TCCDW ≈ 90 K13,14,15. Angle-resolved photoemission spectroscopy (ARPES) and optical spectroscopy measurements have suggested the presence of pseudogaps for T > TICDW similar to that observed in high-TC cuprates16,17,18. Interestingly, in the temperature region, resistivity is known to change quite linearly with temperature17,18. Upon entering the ICDW phase, these pseudogaps become larger and finally evolves into real band-gaps in the CCDW phase. At the same time, two hole-like circular pockets around Γ and K points and one electron-like ‘dogbone’ centered on M point of the Brillouin zone (BZ)3,16 show drastic reconstruction at T = TCCDW, resulting in three times smaller BZ, characterized by doubly degenerate circular pockets and small rounded triangles in the K and M points of the new BZ, respectively16. While the origin of the CDW instability in 2H-TMDCs has been a topic of debate for many years, most recent studies indicate that the CDW formation in 2H-TMDCs is driven by periodic lattice distortion induced by strong momentum-dependent electron-phonon coupling rather than by the Peierls-type mechanism19,20,21,22,23. Inside the CCDW state, the 2H-TaSe2 exhibits yet another phase transition into a superconductor at TC ~ 0.14 K. This superconductivity arises by the conventional electron-phonon coupling. It has been known that chemical substitution of Te for Se and doping of Mo or W for Ta changed the 2H-TaSe2 into 3R polytypes24,25. In this case, an optimal TC is found to be 2.4 K, of which origin has been attributed to the three-layer stacking sequence of 3R-TaSe2 compared to two-layer stacking sequence in 2H-TaSe2. Meanwhile, the superconductivity can be further modulated by a specific doping of Fe or Ni into 2H-TaSe2 within the same 2H-structure26,27,28. In this case, only intercalation of Ni was found to show enhancement of TC up to 2.7 K26, suggesting that not only structural motif but also carrier modulation might be important for superconductivity. Therefore, to clarify the exact roles of structure and carriers on the delicate balance between the CDW and superconductivity, systematic doping/intercalation studies in each structural unit become necessary. In this report, we show that intercalation of Pd ion into 2H-TaSe2 in a broad doping ranges without altering the 2H structure enhances TC up to 3.3 K, the highest observable TC among the TaSe2 polytypes. With intercalation of Pd, the CCDW phase of 2H-TaSe2 is suppressed more rapidly than the ICDW transition while the TC increases continuously to form a dome-shape phase diagram and an optimal TC ~ 3.3 K for x = 0.08–0.09. We find that TC(x) increases in proportional to the density of states estimated from the Sommerfeld coefficient. Measurements of upper critical fields and specific heat below TC(x) show clear evidences of multiple superconducting energy gaps. These observations and comparison with other TMDCs uncover that the increase of density of states and thus electron-phonon coupling constant, regardless how it is driven by, e.g., structural modification or by carrier doping, could be important for the creation of multiband BCS superconductivity in the vicinity of the quantum phase transition of the CCDW state. Powder x-ray diffraction patterns of the PdxTaSe2 samples in Fig. 1 indicate that all the peaks can be indexed with the structure of 2H-TaSe2. Hence, the process of Pd intercalation does not change the structure of the mother compound. The refinement of the diffraction pattern was used to extract lattice parameters (a and c) at room temperature, as summarized in Fig. 1(b,c). Intercalation of atoms into the van der Waal gaps usually leads to expansion of a unit cell. With increasing Pd content, both a- and c-values increase systematically with x. The observed trend is similar to that observed in 1T-CuxTiSe24, 1T-PdxTiSe26, and 2H-CuxTaS25. The a- (c-) value of PdSe2 is larger (smaller) than that of 2H-TaSe229. Hence, if Pd ions are partly substituting Ta ions, TaSe2 would have exhibited the increase of a and decrease of c, which is in contrast to our results. Thus, the substitution of Pd for Ta doesn’t seem to happen, presumably due to a smaller ion size of Pd  pm) than Ta  pm). All this information supports that Pd ions are mostly intercalated into the layers with the van-der-Waals bonding. (a) Powder x-ray diffraction pattern of the Pd0.09TaSe2 sample and quantitative refinement confirming the 2H-polytype structure. Inset shows the crystal structure of the 2H-TaSe2. Variation of the (b) a-axis and (c) c-axis lattice parameters with Pd content (x). Standard deviations of the cell parameters are smaller than the points. In general, near the CDW transition temperature, resistivity and magnetic susceptibility curves exhibit an anomaly due to the opening of a partial or full gap at the Fermi energy (EF), which is often accompanied by the simultaneous decrease of the Fermi surface area and the variation of density of states N(EF). Hence, the evolution of CDW states with x, can be traced from the temperature-dependent resistivity and susceptibility measurements. Figure 2(a) presents the resistivity normalized by the value at 300 K (ρ/ρ300K). The undoped 2H-TaSe2, ρ(T) shows the metallic behavior near room temperature to low temperatures till it exhibits a hump near 115 K due to the formation of ICDW-state, being consistent with the former studies1,17. Below this transition, resistivity steeply decreases further to exhibit more metallic behavior. The two CDW transitions can be indeed identified from the dρ/dT curve, developing a minima near TICCDW ≈ 120 K and a maxima near TICCDW ≈ 90 K. The transition temperatures thus estimated are in good agreement with those obtained from neutron diffraction studies13,14,15. (a) Temperature-dependent resistivity normalized to the value at 300 K, ρ/ρ300K, of the PdxTaSe2 polycrystalline samples for 0 < x < 0.14. (b) dρ/dT curves of selected samples. Arrow marks at the minimum and maximum of dρ/dT indicate the ICDW and CCDW transition temperatures, respectively. (c) Top: temperature-dependent in-plane resistivity ρab of a PdxTaSe2 single crystal up to 460 K, with Tc ~ 3.2 K. Bottom: The dρab/dT curve exhibiting almost constant behavior demonstrates the T-linear dependence of resistivity at high temperatures at least up to 460 K. With increase of Pd content, the residual resistivity ratio (RRR) of PdxTaSe2 compounds decreases systematically compared to the undoped compound, indicating that the compounds thus evolve into a bad metal. Meanwhile, ρ300K of all the samples was located around 0.2–0.6 mΩ cm without showing systematic trend, due to the polycrystalline nature of the samples. With increase of x, the anomalies in dρ/dT (Fig. 2(b)) becomes broadened. Yet, the minima of dρ/dT curve could be identified up to x = 0.10 and the maxima of dρ/dT curve up to x = 0.07, allowing the determination of TICCDW and TCCDW. It is also clear from the dρ/dT curve in Fig. 2(b) that the maximum points indicating TCCDW decreases more rapidly with x while the minima points for TICDW decreases slightly. These behavior is summarized later in the electronic phase diagram. For all x, ρ(T) below 30 K follows a power law behavior (Tα) with α ≈ 2, being consistent with the Fermi liquid behavior. On the other hand, roughly above 140 K (i.e., at T > TICDW), where a pseudogap behavior was found in the mother compound17,18, it is interesting to note that ρ increases quite linearly with temperature as evidenced from the almost constant behavior in the dρ/dT curve (Fig. 2(b)). To further corroborates the intrinsic nature of this phenomenon, we have measured the in-plane resistivity, ρab, of a PdxTaSe2 single crystals (TC ~ 3.2 K) up to 460 K as shown in Fig. 2(c). The ρab curve indeed shows the linear T-dependence at least up to 460 K as evidenced by almost constant behavior of the dρab/dT curve. Note that the measurement was performed under Ar atmosphere to avoid the oxidation of sample while the transport data became unstable above 460 K, possibly due to unknown changes in the sample. The broad T-range of observing linear T-dependence (from ≈140 K to ≈460 K) is reminiscent of that observed in high TC cuprates. Moreover, the phenomenon itself that 2H-TaSe2 develops the pseudo-gap above TICCDW seems also similar to those observed in the high TC cuprates17,18. In conventional metals, the linear increase of ρ(T) can be realized in a temperature window above the Debye temperature due to the electron-phonon scattering, according to the Bloch-Grüneisen theory30. However, once the mean free path l at high temperatures reaches the interatomic spacing a, the resistivity should start to show saturation. This crossover resistivity is known as the Ioffe-Regel (IR) limit31,32,33. In a quasi 2D materials with cylindrical Fermi surface, ρ should saturate at , where d is interlayer spacing, kF is Fermi wave vector33. Taking d = 6.73 Å, half of the c-value, and l ≃ a for the PdxTaSe2 crystal,  μΩ cm. It is obvious from Fig. 2(c) that ρab continues to increase linearly at least up to 460 K clearly above 390 K where it should have saturated according to the IR limit. Thus, the linear increase of ρab curve cannot be simply understood by the conventional electron-phonon scattering scenario. Even in high TC cuprates, the IR criterion is also violated and ρab continues to increases linearly as high as 1100 K as a result of strong electronic correlation effect33. Therefore, the origin of the linear resistivity in the PdxTaSe2 single crystal could be worth being further explored, related with the similar conundrum existing in high TC cuprates. Figure 3 shows dc magnetic susceptibility (χ) of PdxTaSe2 samples in the normal-state for different x. A drop in the (χ) curve of pure 2H-TaSe2 is seen at TICCDW ≈ 120 K, in agreement with the resistivity data. TICDW could be also determined from the onset of the susceptibility drops as shown in the Fig. 3. A Curie-Weiss-like tail also appears in the low temperature, possibly due to a small local moment induced by Pd intercalation. Appearance of a similar Curie-Weiss-like tail has also been observed in the Cu and Pd intercalated system4,6. The sharpness of the drop decreases with increasing amount of Pd, and TICDW transition decreases to 107 K for x = 0.10. Due to the Curie-Weiss increase at low temperatures, the ICDW transition could not be identified in the χ(T) for x > 0.10. Inset shows the χ(T)curves for x = 0.09 and 0.10. The red solid lines illustrate how the ICDW transition temperatures have been determined. The arrows mark the TICDW for the undoped and x = 0.09 (inset) samples. We found that as the CCDW state is suppressed with increasing Pd content, the superconducting transition temperature increases continuously. This behavior is illustrated in the low-temperature ρ(T) and zero field cooled χ(T) data as shown in Fig. 4. For all x, the superconducting transition are clearly observed in resistivity while the onset of diamagnetic behavior is also observed in χ(T). With a small amount of Pd (x = 0.03), TC is enhanced more than 17 times than that of the pure compound. With further increase of Pd content, TC increases systematically and attains a maximum of about 3.3 K for x = 0.09 and then decreases to 2.83 K for x = 0.14. For x ≤ 0.05, the width of superconducting transition in ρ becomes broadened compared to the higher doping samples, possibly because the superconducting volume fraction (−4πχ) is less than 10% at 1.8 K (Fig. 4(a,b)). For x ≥ 0.06, the value of −4πχ at 1.8 K increases significantly and reaches to 120%, indicating the presence of bulk superconductivity. The shielding fraction larger than 100% is likely to come from the demagnetization factor of the specimen. For x > 0.09, −4πχ decreases again with increase of x to reach 77% for x = 0.14. Low temperature behavior of zero-field resistivity ρ (a) for x = 0.03 and 0.05, (c) for 0.06 ≤ x ≤ 0.08, and (e) for x = 0.09, 0.10, 0.12 and 0.14. Temperature dependence of zero-field cooled susceptibility indicating the superconducting volume fraction (−4πχ) measured at H = 10 Oe (b) for x = 0.03 and 0.05, (d) for 0.06 ≤ x ≤ 0.08, and (f) for x = 0.09, 0.10, 0.12 and 0.14. For better understanding of the superconducting states, we have measured the temperature-dependence and anisotropy of the upper critical fields, Hc2, of a PdxTaSe2 single crystal in a dilution refrigerator. Figure 5(a,b) show the T-dependence of the zero-field ρ and dc magnetization at H = 10 Oe of the same PdxTaSe2 single crystal used for Hc2 measurements. In Fig. 5(c,d), we have plotted the magnetic field dependence of ρab with H applied parallel and perpendicular to the ab-plane. It is clear that for H || ab, the resistive curve shifts parallel down towards the low temperature with increase of H. For H || c, the resistive transition broadens significantly and superconductivity is completely suppressed below 4 T. Figure 5(e) summarizes the temperature-dependence of estimated Hc2 for both field directions, i.e.  and , determined by the criterion of the 50% of normal state resistivity. It is noteworthy that  increases linearly down to the lowest measured temperature without any sign of saturation. This is in sharp contrast to what is seen in isotropic, single-band BCS superconductors in which Hc2(T) follows a linear dependence for temperatures close to TC, followed by a saturation, or a concave downward curvature at low temperature. Such linear temperature-dependence has been observed in the Fe-based superconductors34 and quasi-one dimensional superconductors35,36, indicating the multi-band effects. (a) Zero-field resistivity and (b) dc magnetization at H = 10 Oe for the PdxTaSe2 single crystal. Inset of (a) shows the normal state resistivity of the crystals. Magnetic field dependence of the resistive transition of PdxTaSe2 single crystal for (c) H || ab and (d) H || c. (e) Temperature dependence of the upper critical fields determined by the 50% of the normal state resistivity criterion. The solid lines show the fit to the two-band model based on equation (1). (f) Temperature dependence of the anisotropy factor  and the dotted line is a guide to the eye. The evidence of the multiband effect becomes more clear from the temperature dependence of  and the anisotropy factor . The  curve exhibits a positive curvature close to TC and then increases linearly with decreasing temperature. A positive curvature in the Hc2(T) curve has been often observed in numerous multi-gap superconductors such as YNi2B2C, MgB2, NbSe2 and NbS237,38,39,40 when their various FSs have different electron-phonon coupling parameters and Fermi velocities. The γH(T), shown in Fig. 5(f), also supports the multiband effects. For T close to TC, γH ~ 1.96, and it increases with decreasing temperature down to 2 K before it becomes saturated. This is quite similar to that observed in MgB241, which could be understood as an interplay between two major gaps with temperature; the gap in a cylindrical σ band dominates low-T behavior of Hc2, leading to a large anisotropy, while at T ≃ Tc, the gap in the π bands play more important role, strongly reducing the anisotropy. In order to have more quantitative understanding, we have analyzed the data using the two-band model for Hc2, which takes into account the orbital and Zeeman pair breaking effect in the dirty limit41. Assuming negligible interband scattering, the equation of Hc2(T) can be written as where a0 = 2(λ11λ22 − λ12λ21), a1 = 1 + (λ11 − λ22)/λ0, a2 = 1 − (λ11 − λ22)/λ0, λ0 = [(λ11 − λ22)2 + 4λ12λ21]1/2, h = Hc2D1/2ϕ0T, t = T/Tc, η = D2/D1, and U(x) = Ψ(x + 1/2) − Ψ(x). Ψ(x) is the digamma function, λ11 and λ22 are the intraband BCS coupling constants, while λ12 and λ21 are the interband BCS coupling constants, and D1 and D2 are the in-plane diffusivity of each band. As shown in Fig. 5(e), the experimental data can be well described within the framework of the two-band model. For , the best fit parameters are λ11 = λ22 = 0.8, λ12 = λ21 = 0.11, D1 = 0.29 and η = 5, and for the , λ11 = λ22 = 0.5, λ12 = λ21 = 0.45, D1 = 2.97 and η = 0.142. The obtained fitting parameters suggests that the intraband coupling is much stronger than the interband coupling. To obtain further information on the electronic and superconducting properties, we have measured the specific heat Cp. Figure 6(a) displays Cp/T vs T 2 curves for selected samples of x = 0.0, 0.03, 0.09, and 0.14. The data for x = 0.09 and 0.14 exhibit clear peaks near TC, supporting the bulk nature of superconductivity. The normal state specific heat at temperatures between TC and 10 K are well described by the relation Cp = γnT + βT 3, where γnT and βT3 term describes the Sommerfeld coefficient and phononic contribution, respectively. The electronic contribution for x = 0.09 was obtained by subtracting the phonon and Schottky contributions from the measured Cp data. In order to extract the Schottky contribution below 0.4 K, we employed a two level energy scheme. Inset of Fig. 6(a) shows the resultant, normalized electronic specific heat Cel/γnT as function of reduced temperature t = T/Tc for x = 0.09. It is found that Cel/γnT displays a hump-like feature around t = 0.2, which supports the presence of multiple superconducting gaps. (a) The Cp/T vs. T2 curve of the polycrystalline PdxTaSe2 samples for x = 0, 0.03, 0.09 and 0.14. The solid lines represent the linear fit to the data at temperature between TC and 10 K. Insets show the electronic specific heat Cel after subtracting phonon and low temperature Schottky contributions for x = 0.09 samples. The dashed (dark yellow) and solid line (red) denote the BCS α-model for the one-band (α = 1.76) and the two-band (α1 = 1.9(γ1/γn = 0.7) and α1 = 0.65(γ1/γn = 0.3)), respectively. Variation of (b) β and Debye temperature ΘD (c) normal state γN with x. (d) Estimated electron-phonon coupling constant λep using equation 2 and density of states at the Fermi energy N(EF) with x. We thus analyzed the Cp data using the BCS α-model, which was originally proposed to explain thermodynamic properties of a strongly coupled, single-gap superconductor under a semi-empirical approach42. However, later this model had been generalized to explain the multigap superconductors such as MgB243. In case of the two gaps, specific heat is determined from the two contributions, i.e. α1 [=Δ1(0)/kBTc] and α2 [=Δ2(0)/kBTc] with their relative weight γ1/γn and γ2/γn where γ1 + γ2 = γn and Δ(0) is the gap value at zero temperature. As evident from the inset of Fig. 6(a), the calculation for one-band α-model with α = 1.76 deviates significantly from the experimental data below t ≈ 0.5. We then calculated Cel/γnT, introducing two gaps and their appropriate weights. Values α1 = 1.9 (γ1/γn = 0.7) and α2 = 0.65 (γ2/γn = 0.3), produced the closest matching with our experimental data. The inset of Fig. 6(a) also shows the Cel/γnT vs t plot for an individual α with its weights. The estimated gap values also support the analysis of upper critical fields, thereby confirming the existence of at least two gaps with different magnitudes. By fitting the data at the normal state between TC and 10 K, we have evaluated the Sommerfeld coefficient γn and the phonon specific heat coefficient β, of which variations with x are summarized in the Fig. 6(b,c). It is surprising to find that γn systematically increases by more than 80% until it reaches a maximum at x = 0.09, and then decreases with further increase of x. Note that the evolution of γn with x is qualitatively similar to that of TC with x. On the other hand, β increases initially, stays almost constant up to x = 0.09, and decreases again about 15%. From the β value, we can estimate the Debye temperatures by the relation , where n is the number of atoms per formula unit (n = 3), and R is the gas constant. For phonon-mediated, one-band superconductors, the electron-phonon coupling constant (λep) can be also estimated from the inverted McMillan equation using ΘD and the superconducting transition temperatures44, Assuming the Coulomb pseudopotential μ* to be 0.15 empirically, we have determined the variation of λep with x as shown in the Fig. 6(d). Note that the estimated value of λep = 0.39 for the undoped compound is consistent with the reported value in literature3. In case of a multiband superconductor, application of the above equation that has been developed for one band superconductor should have its own limit. However, the obtained λep could qualitatively reflect the average of the eigenvalues in the electron-phonon interaction matrix45. We found that λep shows qualitatively similar variation with TC but changes within 10% except the initial steep increase from 0.39 for x = 0 to 0.60 for x = 0.03. With the value of γn and λep, the density of states at the Fermi level N(EF) can be calculated from the equation N(EF) = . Figure 6(d) shows the evaluated N(EF) with x. Similar to γn, N(EF) increases systematically with x from 1.64 states/eV f.u. for x = 0 to 2.16 states/eV f.u. for x = 0.09, and decreases again at higher doping above 0.09. Therefore, it is concluded that the Pd intercalation into the 2H-TaSe2 indeed resulted in the maximum values of γn and N(EF) near the optimal doping level of x = 0.09, similar to the evolution of TC. The increase of N(EF) as doping is increased toward an optimal doping has been previously found in TaSe2−xTex too. However, the structure of TaSe2−xTex has changed from the 2H to 3R structure with Te doping24 so that it was difficult to judge whether the structural change was essential or not to increase of N(EF) (or λep) and thus TC of BCS superconductivity in a broad class of TMDCs. The observation of qualitative proportionality between N(EF) and TC in PdxTaSe2 with the same structure indicates that the increase of N(EF) (or λep) becomes more fundamental to increase TC, regardless of the structural evolution in many TMDCs. We have summarized the electronic phase diagram in the 2H-PdxTaSe2 system as shown in Fig. 7. With Pd intercalation, the CCDW phase is suppressed dramatically compared to the ICDW phase. As the TCCDW is progressively suppressed, Tc(x) increases systematically. The phase diagram reveals a classic dome shape with an optimal TC for x = 0.08–0.09. Most importantly, the collapse of CCDW phase is almost coincident with the doping levels of showing an optimal TC, supporting clearly the competition between CCDW phase and superconductivity. On the other hand, TICDW slowly decreases from 122 to 106 K regardless of the superconducting dome, suggesting that there is no direct association with each other. The blue triangles represent TICDW determined from the normal state susceptibility data, the green squares represent TCCDW determined from the maximum of the dρ/dT curve in Fig. 2 and the red circles represent TC determined from the onset of diamagnetic susceptibility in Fig. 4. For clarity the TC value have been multiplied by 5 times. Related to this, it is worthwhile to discuss the distinct features of the phase diagram of 2H-PdxTaSe2 system with other systems with the same 2H structure. The presence of two CDW transitions is indeed unique in the 2H-TaSe2 because all other 2H compounds have shown only one incommensurate CDW transition. For example, both 2H-NbSe2 and 2H-TaS2 showed only the ICDW phase1,2,13. Furthermore, although either pressure or intercalation of Cu ions suppressed the ICDW phase and enhanced superconductivity in 2H-NbSe246 and 2H-TaS25, respectively, the collapse of the ICDW did not occur at the optimal TC in both cases. For 2H-NbSe2, the collapse point is located well below optimal TC while for 2H-TaS2, it is well above. Therefore, direct competition between ICDW and superconductivity doesn’t seem to happen in those other compounds with the 2H structure. Consistent with this, it has been recently claimed by theoretical calculations and inelastic x-ray scattering that the electron-phonon coupling of the soft acoustic mode could be mainly responsible for ICDW formation in 2H-NbSe2, while the optical phonon mode is coupled to the creation of superconductivity46. Our observation of very weak dependence of ICDW phase with superconductivity clearly supports that superconductivity is not related to the ICDW phase in 2H-PdxTaSe2 too, being similar to the case in 2H-NbSe246. This also implies in 2H-TaSe2 that a specific type of electron-phonon coupling required to stabilize the ICDW phase might be also different from that for inducing superconductivity. Furthermore, the strong competition of the CCDW with the superconductivity in turn suggests that a same type of phonon mode might be responsible for stabilizing both the superconductivity and CCDW in 2H-TaSe2. One interesting question to check is whether the increase of TC via the increase of N(EF) and λep as observed here could be generally applied to other TMDCs even with different structures and dopants. For this, we have compared previous experimental results of TC, γn, and θD, and calculated N(EF) and λep in various known TMDCs in the literature as summarized in Table 1. To our surprise, we find that although significant variation exists in N(EF) but not in λep within the doped 2H-TaSe2 and 2H-TaS2, N(EF) is almost proportional to TC in each system, regardless of their structural forms. Therefore, N(EF) seems to be the key factor rather the structural motif for determining TC magnitude. At the same time, when N(EF) is almost same, the variation of λep, albeit small, is still helpful in increasing Tc. Moreover, between the materials with a different parent compound such as 1T-CuxTiS2 and 2H-TaS2, the magnitude of λep was also important to determine the TC magnitude. Based on all these results, we conclude that TC is strongly dependent on N(EF) while it is also affected by λep. At present, what is a generic origin for the variation of N(EF) in the PdxTaSe2 system remains as an open question. One scenario is that N(EF) increases due to the proximity of the system to the quantum critical point of the CCDW state. If this scenario is true, it is expected that the collapse of multiple Fermi Surface in the CCDW across the quantum critical point could cause the increase of N(EF). Another scenario is that the Pd intercalation has provided the increase of partial Pd density of state by direct hybridization with the TaSe2 states near the Fermi level or by indirect lattice modulation. It might be worthwhile to check the feasibility of both scenarios in future studies. In conclusion, we have investigated the effect of Pd intercalation into the 2H-TaSe2 compound. Pd ion can be used as a suitable tuning parameter to explore the intricate balance between CDW and superconductivity in 2H-TaSe2. A dome shape TC(x) curve is observed with an optimal TC ~ 3.3 K for x = 0.08–0.09, constituting enhancement of TC of 2H-TaSe2 by a factor of 24. Pd intercalation drastically suppresses the CCDW phase and but does not have any strong effect on the ICDW transition in 2H-TaSe2. Analysis of specific heat data shows an evidence that Pd intercalation increase the effective electron-phonon coupling and density of states at the Fermi energy. Observation of qualitative proportionality between N(EF) and TC in PdxTaSe2 with the same structure suggests that the increase of N(EF) (or λep) becomes more necessary to increase TC. The temperature-dependence of Hc2, Cel and γH all confirm the presence of multi-gap superconductivity in the 2H-PdxTaSe2 compound. Polycrystalline samples of PdxTaSe2 for different values of x were synthesized via solid state reaction method. Stoichiometric amounts of Pd (99.98%), Ta (99.9%) and Se (99.999%) powder were mixed, grounded well and pelletized. The pellets were sealed in an evacuated quartz tube and then kept at 900 °C for 4 days. The obtained pellets were crushed, regrounded, pelletized again and resealed in an evacuated quartz tube. The pellets were reannealed for another 5 days at 900 °C. Single crystal of the PdxTaSe2 were grown by the chemical vapor transport method using SeCl4 as a transport agent. Millimeter-sized hexagonal shaped crystals were collected from the cold end of the quartz tube. The phase purity of the samples were determined by the powder x-ray diffraction using Cu Kα radiation at room temperature. Rietveld analyses of the powder diffraction pattern were performed using the fullprof suits. Resistivity was measured by the conventional four probe method using silver paste (Dupont 4929NTM) in a PPMSTM (Quantum Design) and a dilution refrigerator. Dc magnetic susceptibility was measured in a MPMSTM (Quantum design). Specific heat data were measured with PPMSTM and a dilution refrigerator by using a custom-made program employing the relaxation method with two relaxation times. To determine the actual composition of Pd in the samples, electron probe micro analysis (EPMA) was performed on the polycrystalline samples by considering the Pd metal as standard specimens. How to cite this article: Bhoi, D. et al. Interplay of charge density wave and multiband superconductivity in 2H-PdxTaSe2. Sci. Rep. 6, 24068; doi: 10.1038/srep24068 (2016). Wilson, J. A., Di Salvo, F. J. & Mahajan, S. Charge-density waves and superlattices in the metallic layered transition metal dichalcogenides. Advances in Physics 24, 117 (1975). Article \n    CAS \n    ADS \n    \n                    Google Scholar Wilson, J. A. & Yoffe, A. D. The transition metal dichalcogenides discussion and interpretation of the observed optical, electrical and structural properties. Advances in Physics 18, 193 (1969). Article \n    CAS \n    ADS \n    \n                    Google Scholar Rossnagel, K. On the origin of charge-density waves in select layered transition-metal dichalcogenides. J. Phys.: Condens. Matter 23 213001 (2011). CAS \n    ADS \n    \n                    Google Scholar Morosan, E. et al. Superconductivity in Cu x TiSe2 Nat. Phys. 2, 544 (2006). Article \n    CAS \n    \n                    Google Scholar Wagner, K. E. et al. Tuning the charge density wave and superconductivity in Cu x TaS2 . Phys. Rev. B 78, 104520 (2008). Article \n    ADS \n    CAS \n    \n                    Google Scholar Morosan, E. et al. Multiple electronic transitions and superconductivity in Pd x TiSe2 . Phys. Rev. B 81, 094524 (2010). Article \n    ADS \n    CAS \n    \n                    Google Scholar Fang, L. et al. Fabrication and superconductivity of Na x TaS2 crystals. Phys. Rev. B 72, 014534 (2005). Article \n    ADS \n    CAS \n    \n                    Google Scholar Gamble, F. R., DiSalvo, F. J., Klemm, R. & Geballe, T. H. Superconductivity in Layered Structure Organometalfic Crystals. Science 168, 568 (1970). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Gamble, F. R. et al. Intercalation Complexes of Lewis Bases and Layered Sulfides: A Large Class of New Superconductors. Science 174, 493 (1971). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Kusmartseva, A. F., Sipos, B., Berger, H., Forró, L. & Tutiš, E. Pressure Induced Superconductivity in Pristine 1T-TiSe2 . Phys. Rev. Lett. 103, 236401 (2009). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Sipos, B. et al. From Mott state to superconductivity in 1T-TaS2 . Nat. materials 7, 960 (2008). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Yu, Y. et al. Gate-tunable phase transitions in thin flakes of 1T-TaS2 . Nat. Nanotech. 10, 270 (2015). Article \n    CAS \n    ADS \n    \n                    Google Scholar Moncton, D. E., Axe, J. D. & DiSalvo, F. J. Study of Superlattice Formation in 2H-NbSe2 and 2H-TaSe2 by Neutron Scattering. Phys. Rev. Lett. 34, 734 (1975). Article \n    CAS \n    ADS \n    \n                    Google Scholar Moncton, D. E., Axe, J. D. & DiSalvo, F. J. Neutron scattering study of the charge-density wave transitions in 2H-TaSe2 and 2H-NbSe2 . Phys. Rev. B 16, 801 (1977). Article \n    CAS \n    ADS \n    \n                    Google Scholar Fleming, R. M., Moncton, D. E., McWhan, D. B. & DiSalvo, F. J., Broken Hexagonal Symmetry in the Incommensurate Charge-Density Wave Structure of 2H-TaSe2 . Phys. Rev. Lett. 45, 576 (1980) Article \n    CAS \n    ADS \n    \n                    Google Scholar Borisenko, S. V. et al. Pseudogap and Charge Density Waves in Two Dimensions. Phys. Rev. Lett. 100, 196402 (2008). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Vescoli, V., Degiorgi, L., Berger, H. & Forró, L. Dynamics of Correlated Two-Dimensional Materials: The 2H-TaSe2 Case. Phys. Rev. Lett. 81, 453 (1998). Article \n    CAS \n    ADS \n    \n                    Google Scholar Ruzicka, B., Degiorgi, L., Berger, H., Gaál, R. & Forró, L. Charge Dynamics of 2H-TaSe2 along the Less-Conducting c-Axis. Phys. Rev. Lett. 86, 4136 (2001). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Johannes, M. D., Mazin, I. I. & Howells, C. A. Fermi-surface nesting and the origin of the charge-density wave in NbSe2 . Phys. Rev. B73, 205102 (2006); Article \n    ADS \n    CAS \n    \n                    Google Scholar Johannes, M. D. & Mazin, I. I. Fermi surface nesting and the origin of charge density waves in metals. Phys. Rev. B 77, 165135 (2008). Article \n    ADS \n    CAS \n    \n                    Google Scholar Ge, Y. & Liu, A. Y. Effect of dimensionality and spin-orbit coupling on charge-density-wave transition in 2H-TaSe2 . Phys. Rev. B 86, 104101 (2012). Article \n    ADS \n    CAS \n    \n                    Google Scholar Weber, F. et al. Extended Phonon Collapse and the Origin of the Charge-Density Wave in 2H-NbSe2 . Phys. Rev. Lett. 107, 107403 (2011). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Dai, J. X. et al. Microscopic evidence for strong periodic lattice distortion in two-dimensional charge-density wave systems. Phys. Rev. B 89, 165140 (2014). Article \n    ADS \n    CAS \n    \n                    Google Scholar Luo, H. et al. Polytypism, polymorphism, and superconductivity in TaSe2−x Te x . Proc. Natl. Acad. Sci. USA 112, E1174 (2015). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Luo, H., Xie, W., Seibel, Elizabeth, M. & Cava, R. J. Superconductivity in 3R-Ta1−x M x Se2(M = W, Mo). J. Phys.: Condens. Matter 27, 365701 (2015). Google Scholar Li, L. J. et al. Growth and superconductivity of 2H-Ni0.02TaSe2 single crystals. Solid State Communications 150, 2248 (2010). Article \n    CAS \n    ADS \n    \n                    Google Scholar Whitney, D. A., Fleming, R. M. & Coleman, R. V. Magnetotransport and superconductivity in dilute Fe alloys of NbSe2, TaSe2, and TaS2 . Phys. Rev. B 15, 3405 (1977). Article \n    CAS \n    ADS \n    \n                    Google Scholar Dai, Z., Xue, Q., Gong, Y., Slough, C. G. & Coleman, R. V. Scanning-probe-microscopy studies of superlattice structures and density-wave structures in 2H-NbSe2, 2H-TaSe2, and 2H-TaS2 induced by Fe doping. Phys. Rev. B 48, 14543 (1993). Article \n    CAS \n    ADS \n    \n                    Google Scholar Gronvold, F. & Rost, E. The crystal structure of PdSe2 and PdS2 . Acta Cryst. 10, 329 (1957). Article \n    CAS \n    \n                    Google Scholar Ibach, H. & Lüth, H. Solid-State Physics 3rd ed. (Springer, Berlin, 2003). Ioffe, A. F. & Regel, A. P. Prog. Semicond. 4, 237 (1960). Google Scholar Mott, N. F. Conduction in non-crystalline systems IX. the minimum metallic conductivity. Philos. Mag. 26, 1015 (1972). Article \n    CAS \n    ADS \n    \n                    Google Scholar Gunnarsson, O., Calandra, M. & Han, J. Saturation of electrical resistivity. Rev. Mod. Phys. 75, 1085 (2003). Article \n    ADS \n    \n                    Google Scholar Khim, S. H. et al. Pauli-limiting effects in the upper critical fields of a clean LiFeAs single crystal. Phys. Rev. B 84, 104502 (2011). Article \n    ADS \n    CAS \n    \n                    Google Scholar Khim, S. H. et al. Enhanced upper critical fields in a new quasi-one-dimensional superconductor Nb2Pd x Se5 . New J. of Phys. 15, 123031 (2013). Article \n    ADS \n    CAS \n    \n                    Google Scholar Zhang, Q. et al. Superconductivity with extremely large upper critical fields in Nb2Pd0.81S5 . Sci. Rep. 3, 1446 (2013). Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Shulga, S. V., Drechsler, S.-L., Fuchs, G. & Muller, K.-H. Upper Critical Field Peculiarities of Superconducting YNi2B2C and LuNi2B2C. Phys. Rev. Lett. 80, 1730 (1998). Article \n    CAS \n    ADS \n    \n                    Google Scholar Suderow, H. et al. Pressure dependence of the upper critical field of MgB2 and of YNi2B2C. Phys. Rev. B 70, 134518 (2004). Article \n    ADS \n    CAS \n    \n                    Google Scholar Suderow, H., Tissen, V. G., Brison, J. P., Martinez, J. L. & Vieira, S., Pressure Induced Effects on the Fermi Surface of Superconducting 2H-NbSe2 . Phys. Rev. Lett. 95, 117006 (2005). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Tissen, V. G. et al. Pressure dependence of superconducting critical temperature and upper critical field of 2H-NbS2 . Phys. Rev. B 87, 134502 (2013). Article \n    ADS \n    CAS \n    \n                    Google Scholar Gurevich, A. Enhancement of the upper critical field by nonmagnetic impurities in dirty two-gap superconductors. Phys. Rev. B 67, 184515 (2003). Article \n    ADS \n    CAS \n    \n                    Google Scholar Padamsee, H., Neighbor, J. E. & Shiffman, A. C. Quasiparticle phenomenology for thermodynamics of strong-coupling superconductors. J. Low Temp. Phys. 12, 387 (1973). Article \n    CAS \n    ADS \n    \n                    Google Scholar Bouquet, F. et al. Phenomenological two-gap model for the specific heat of MgB2 . Europhys. Lett. 56, 856 (2001). Article \n    CAS \n    ADS \n    \n                    Google Scholar McMillan, W. L. Transition Temperature of Strong-Coupled Superconductors. Phys. Rev. 167, 331 (1968). Article \n    CAS \n    ADS \n    \n                    Google Scholar Mazin, I. I. & Antropov, V. P. Electronic structure, electron-phonon coupling, and multiband effects in MgB2 . Physica C 385, 49, (2003). Article \n    CAS \n    ADS \n    \n                    Google Scholar Leroux, M. et al. Strong anharmonicity induces quantum melting of charge density wave in 2H-NbSe2 under pressure. Phys. Rev. B 92, 140303(R) (2015) and reference there in. Article \n    ADS \n    CAS \n    \n                    Google Scholar Download references This work was financially supported by the National Creative Research Initiative (2010-0018300) through the NRF of Korea. B. H. Min was also partially supported by NRF-2015R1D1A4A01019960 and Brain Korea 21 plus project. Department of Physics and Astronomy, Center for Novel States of Complex Materials Research and Institute of Applied Physics, Seoul National University, Seoul, 151-747, Republic of Korea D. Bhoi, S. Khim, W. Nam, B. S. Lee, Chanhee Kim, B.-G. Jeon, B. H. Min, S. Park & Kee Hoon Kim You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar D.B., S.K. and S.P. prepared the polycrystalline samples. D.B. grew the single crystals. D.B., S.K. and B.H.M. characterized the samples. W.N. and B.S.L. measured the heat capacity in PPMS. C.K. and B.-G.J. performed the low temperature heat capacity and electrical resistivity in a dilution refrigerator. D.B. and K.H.K. analyzed the data and wrote the manuscript. K.H.K. devised the project and advised the research. All authors discussed the results and commented the manuscript. Correspondence to\n                Kee Hoon Kim. The authors declare no competing financial interests. This work is licensed under a Creative Commons Attribution 4.0 International License. The images or other third party material in this article are included in the article’s Creative Commons license, unless indicated otherwise in the credit line; if the material is not included under the Creative Commons license, users will need to obtain permission from the license holder to reproduce the material. To view a copy of this license, visit http://creativecommons.org/licenses/by/4.0/ Reprints and Permissions Bhoi, D., Khim, S., Nam, W. et al. Interplay of charge density wave and multiband superconductivity in 2H-PdxTaSe2.\n                    Sci Rep 6, 24068 (2016). https://doi.org/10.1038/srep24068 Download citation Received: 22 February 2016 Accepted: 17 March 2016 Published: 05 April 2016 DOI: https://doi.org/10.1038/srep24068 Anyone you share the following link with will be able to read this content: Sorry, a shareable link is not currently available for this article.  Provided by the Springer Nature SharedIt content-sharing initiative npj Quantum Materials (2022) Nature Communications (2021) npj Quantum Materials (2021) Scientific Reports (2021) Nano Research (2021) By submitting a comment you agree to abide by our Terms and Community Guidelines. If you find something abusive or that does not comply with our terms or guidelines please flag it as inappropriate. Advertisement Scientific Reports (Sci Rep)\n                \n\nISSN 2045-2322 (online) © 2023 Springer Nature Limited Sign up for the Nature Briefing newsletter — what matters in science, free to your inbox daily. ",
    "datetime": null,
    "url": "https://www.nature.com/articles/srep24068"
}