{
    "title": "Interview: 'Eat Your Kimchi' on the Next K-Pop Star and Learning How to Eat Korean | Asia Society",
    "text": "Unsupported Browser Detected.It seems the web browser you're using doesn't support some of the features of this site. For the best experience, we recommend using a modern browser that supports the features of this website. We recommend Google Chrome, Mozilla Firefox, or Microsoft Edge Martina and Simon Stawski, masterminds behind the popular YouTube channel Eat Your Kimchi, pose for a selfie. Since launching their YouTube channel in 2008, Seoul-based Canadian \"v-loggers\" Martina and Simon Stawski, also known as Eat Your Kimchi, have accumulated over 370,000 subscribers eager for weekly content that covers everything from \"How to Cook Jjajang Myeon!\" to \"McDonalds vs Taco Bell vs Lotteria.\" With frequent updates on the latest and trendiest in Korean pop music (K-pop), they've gathered a loyal following who tune in every week to see what this expat couple has been up to. We caught up with Martina and Simon for their predictions on the next big names in K-pop and an inside scoop on life as professional video bloggers in a foreign culture. You guys moved to South Korea in 2008 and, judging by the number of videos Eat Your Kimchi has made to document the weird and wonderful there, you also seem to love it. Can you tell us a little more about the experience of moving to a new country and adapting to its culture? What were some of the biggest obstacles and some of the biggest surprises? We came somewhat prepared for Korea. We had a bit of experience with Korea before coming here, having worked in hagwons (cram schools) in Koreatown. So, we came to Korea with a smattering of the language and an appetite for its food. We had very little knowledge of what living here was going to be like, though. We initially moved to Bucheon, but before coming to Korea we couldn't find any info on it at all, and we legitimately thought that we were going to be living out in the sticks. Turns out that Bucheon is a big, modern city. Ha! Partly because there was such a dearth of information on Korea, we decided to make lots of movies about what living here was like, so that people coming to Korea could be better informed. Learning how to eat at restaurants on our own was a challenge. The first time we ate samgyeopsal we just ventured out on our own, but we had no experience of grilling meat whatsoever, so we stared at everyone else and how they were cooking their meat as our meat burned to a crisp. Other than that, we didn't really have that many obstacles or surprises. We've been very happy here, and — apart from a few sucky situations from time to time — our experiences have been overwhelmingly positive.  What's the best part about being full-time v-loggers and having such an adoring fan base? Did you expect this amount of popularity when you first began? The best part about being able to do this full-time is really the freedom. We are our own bosses. We aren't funded or sponsored by anyone, and so with full independence comes artistic freedom. There's still a lot of responsibility since we publish a lot of content every week, but it's responsibility we put on ourselves, rather than from an overseer who will judge our performance. At the same time, even though we don't have bosses, we still kind of do. Our audience is our boss, and if they don't watch our videos, we don't have a job. Ha! We're just fortunate to have some of the kindest bosses we could ask for. They happen to like our videos, fortunately for us, and they keep on asking for more, which — to us — is incredibly surprising. We did not plan on being popular when we started. We were shocked when we had our first subscriber. We thought it was some anti-foreigner police squad spying on us. Why else would anyone be watching our videos?! Turns out that our first subscriber was actually a cool guy named Steve, who we became friends with. But still, to this day, we're amazed that anyone watches our videos. Where do you get the ideas for your skits? What would you say is the craziest thing you've seen or done in South Korea? We get very easily inspired, and have tons of ideas for videos we want to make. We just don't have enough hours in a week to do them all. The craziest thing we've done in Korea, I'd say, is dressing up like dragons and unicorns and having dance showdowns around Seoul. We thought that'd be a good idea...  Korean pop music is spreading internationally and of course, Psy's \"Gangnam Style\" took the world by storm. For those of us who are not familiar with \"K-pop\" and Korean culture, can you give us some insight as to how K-pop is received by the Korean society? Just like in any country, different people react to their nation's pop music differently. Some young people are into it. Some adults as well. Many people can't stand it and look towards alternative/indie artists instead. There's also the difference between Psy and K-pop, in that Psy is nothing like K-pop. He's not a young teenager looking at the camera longingly and singing about love. He's an older, rounder man, dancing in his videos, farting in his hands, and getting covered in garbage. He's very much anti-K-pop, in a way. But, that much being said, K-pop is very differently received by fans in Korea than pop music is received where we're from. Here in Korea, K-pop groups have \"official\" fan groups, where fans pay money for membership. Fan groups memorize fan-chants to sing along when the song is playing (for example, when the instrumental part of the track is playing and no one in the band is singing, fans will sing out the band members' names). There are even sasaeng fans here, aka Crazy Stalker fans, who follow the K-pop artists around in their daily lives, break into their houses, and just do crazy stalker stuff that would easily merit restraining orders in other parts of the world, though restraining orders aren't issued here, it seems. What is it like being able to interview Korean celebrities? We get this question a lot, especially from fans who ask us something along the lines of \"HOW DID YOU NOT PEE YOUR PANTS AND DIE FROM HAPPINESS?\" That always makes us chuckle. We don't view these K-pop artists through the perspective of fans. When we interview celebrities, we just think of them as people with interesting lives and insights into the industry, and so we want to speak with them about that. We do have some issues with management at times, though. We have to send in our questions beforehand and get them approved, and we sometimes have to cut out some really interesting questions. It's upsetting, but we understand from a marketing perspective that these bands have images to maintain. It just sucks when there are some really interesting points that we have to gloss over. YARGH!! What has made Kpop so popular with the international audience? Which artists should we be looking out for in the next few years? There are many factors that make K-pop so big, and it's impossible to attribute K-pop's success to just one of those points, since everyone has different reasons. One of the things that makes K-pop so accessible, though, is that K-pop is very much like Western pop in how it sounds. K-pop doesn't have its own sound. There's no genre in K-pop. Rock music usually has drums and guitars. Rap music has rapping. Folk music has acoustic guitars or banjos or whatnot. K-pop has nothing that sounds distinctly Korean or distinctly K-pop. It simply takes on what's popular at the time and re-appropriates it into its own sound. Dubstep is big now, so K-pop has taken on a lot of dubstep elements. In five years, if harpsichords make a miraculous comeback, K-pop will have harpsichords all over the place. So K-pop sounds like the music you might like, basically. At the same time, it's got really good-looking people dancing really well in really colorful sets and outfits and singing really nicely. It's a visual overload. And, quite frankly, K-pop is different. It's in another language! We've heard a few people say that what sucks about the pop music where they're from is that the lyrics are trite and boring. The same can be said about K-pop lyrics...but you won't understand them anyways if you don't speak Korean! Score! You can listen to K-pop music without being bothered by crappy lyrics! Ah. I could talk about this forever. These are just a few points. Some artists that we think are going to do well over the next few years: Girls Generation is making a strong push to be more internationally accessible. The YG label constantly has the North American market in its crosshairs. As for newer acts: I’d put my money on B.A.P. and EXO.     Asia Society takes no institutional position on policy issues and has no affiliation with any government.\nThe views expressed by Asia Society staff, fellows, experts, report authors, program speakers, board members, and other affiliates are solely their own. Learn more.   ",
    "datetime": null,
    "url": "https://asiasociety.org/blog/asia/interview-eat-your-kimchi-next-k-pop-star-and-learning-how-eat-korean"
}