{
    "title": "Interview: Producer Kyu Lee on Bringing Psy and 'Korean Wave' of Pop Culture to US | Asia Society",
    "text": "Unsupported Browser Detected.It seems the web browser you're using doesn't support some of the features of this site. For the best experience, we recommend using a modern browser that supports the features of this website. We recommend Google Chrome, Mozilla Firefox, or Microsoft Edge Kyu Lee. Kyu Lee grabbed attention last year for teaming up with Justin Bieber's manager Scooter Braun to bring Psy stateside, touching off the \"Gangnam Style\" phenomenon. Known in the media industry as \"Q,\" he connects A-list Korean stars and directors to the U.S., helping to bring Hallyu (the \"Korean wave\") to a wider audience. Born in Seoul, South Korea, Kyu immigrated to the U.S. at the age of two. He began his entertainment career with a ten-year stint at Sony Pictures Entertainment (SPE), where he rose to Executive Assistant to both the Vice Chairman of SPE and Chairman of Columbia Pictures Motion Picture Group. Kyu is also the founder and CEO of Kino 33 Entertainment. Asian Americans are becoming an important demographic in the U.S. culturally, politically and economically. What are your thoughts on this increasing influence, and how do you think it'll impact the entertainment industry? I think it's just the right time for us to finally have a presence, not just in Hollywood, but in mainstream entertainment. I've worked at Sony Pictures for ten-plus years and I've always wanted to be able to promote more Asian content and Asian talent in the mainstream market, using Sony as a platform. I've seen a lot of content, players, and talent come and go. I've seen a lot of projects that could have been not really happen the way they should have. But with the recent success that I've had with Psy, it opened up the gates a little bit wider for not just Koreans, but something other than Chinese, to really break into the market. So I think it's great, I think it's a perfect opportunity for us to really take advantage of the market and show what we have to offer rather than one-dimensional Karate Kids or Fast and the Furiouses or typecast roles. It's an opportunity for all of us to show the market that Asians can play more three-dimensional roles. And that's one of my responsibilities as a producer in this industry. 2013 has been a big year for Korean movie directors. Director Ji-woon Kim made his Hollywood debut with The Last Stand, Chan-wook Park's first English film Stoker came out and Joon-ho Bong will release his first English film, Snowpiercer, this year. Is this the movement we'll be seeing with Korean directors and will they find their footing in Hollywood? Absolutely. While I was at Sony, one of the projects I was involved with was a movie called Tae Guk Gi: The Brotherhood of War. It was directed by Je-kyu Kang and he's one of the first Korean directors to come to Hollywood, to try to set foot in here. But we're seeing a lot more of that now with Ji-woon Kim, who I actually work with now and Chan-wook Park and Joon-ho Bong. I know the studios have been really keen on looking for new talent outside of the U.S. They've had their radar on these directors and finally they had an opportunity where they could work with them. I think the timing just happened to be that everyone came at the same time but I don't think that was the purpose. There's a lot of talent out there in directors in Hollywood and also in Korea, so yes, I do see a lot more going forward. What are some projects that you're most excited about for 2013? I'm producing a film called Seoul Searching. The director is Benson Lee, who's also the director of Miss Monday, which won the Special Grand Jury Prize at the Sundance Film Festival. He also did the acclaimed documentary Planet B-Boy and directed a movie called Battle of the Year, which is being released by Sony Pictures in September. So his next film is called Seoul Searching and I'm the main producer of that project. I'm pretty excited about that. We're probably going to start shooting in the next couple of months, so [I'm] getting ready for that. What are the biggest trends and developments that we'll see with Hallyu in the future? It's really in the hands of people like Psy, the directors that we just mentioned, or myself. With the leverage, association, and the power that we have in the industry, now that we've all done projects together, it's our responsibility to be a leader in a way that when we do a project, you find a way to collaborate with more Korean staff, producers, talent, musicians, songwriters to help them gain more exposure. If we can open up the gate of opportunity to more Asian Americans or Asians from their native countries like Korea, Japan, or China, or in Southeast Asia, we need to spearhead that. I think if we do that, we'll get a little notoriety in the skills that we have. But without that, this will just be a fad and we'll have to start all over again. So it's really important for people like Psy or Ji-woon Kim, Byung-hun Lee, or myself to really instill more Asians into projects. What was your role in bringing Psy to the U.S.? Did his success take you by surprise? I was absolutely surprised. But I'm the one that found Psy, I brought him to the U.S., and Scooter and I, we jointly got him signed and released \"Gangnam Style\" in the U.S. So it was a joint effort. Scooter called me and asked me if I saw \"Gangnam Style\" and I said no, but let me check it out. He said he wanted to buy the rights to the song, but I said that's boring. I'll bring Psy, why don't you meet him and let's do something together, rather than just buy the rights to the song. From that, all hell broke loose. Korean entertainment companies are known for training and pushing out idol groups and singers who sometimes seem very similar to one another. Do you think the industry will break away from this manufactured K-pop mold with the success of Psy, a decidedly original entertainer? I think that's a loaded question. The training process, not just in entertainment, but in sports is all very similar in Korea. They're very structured, very fundamentally organized. They want to perfect their skills before they go on the stage or on the field. When you do so much repetition, sometimes that turns into robotics, and yeah, there's your talents that get plastic surgery and that kind of stuff, trying to build their image into a more glamorous, a more stylish feel. But I think times are getting better with SNS and the Internet, broadband, and so many different ways content is being distributed, and the content getting a bit more globalized and universal. Thanks to all these different collaborations going on around the world, it's really increasing exposure, notoriety, and ideas around the world. So I wouldn't say Korean entertainment is too structured or robotic, but I think it's getting a lot better. Asia Society takes no institutional position on policy issues and has no affiliation with any government.\nThe views expressed by Asia Society staff, fellows, experts, report authors, program speakers, board members, and other affiliates are solely their own. Learn more.   ",
    "datetime": null,
    "url": "https://asiasociety.org/blog/asia/interview-producer-kyu-lee-bringing-psy-and-korean-wave-pop-culture-us"
}