{
    "title": "Jonghyun and depression in South Korea",
    "text": "Published daily by the\n      \nLowy Institute The death of a K-pop star has focused attention on the high rate of suicide in South Korea. It was a difficult Christmas for the community dedicated to K-pop, the South Korean music genre that in recent years has become an international phenomenon. On 18 December 2017 the lead singer of influential K-pop band SHINee was found unconscious in a hotel, and was later declared dead in hospital. The singer, Kim Jong-hyun, better known as Jonghyun, had taken his own life. The tragedy shook the K-pop community, as singers, managers, and fans alike were forced to confront the reality of depression. Having spent almost ten years in the Korean music industry as a boy-band member, and later as a solo artist, Jonghyun was a part of K-pop’s sweeping global popularity. His band, SHINee, helped spread the Hallyu (Korean Wave), bringing Korean music and culture to an international audience. K-pop is recognised as one of Korea’s greatest exports. In 2016, global revenue from K-pop music sales, concert tickets, and merchandise totalled US$4.7 billion. SHINee is a part of SM Entertainment, one of the three major entertainment companies in South Korea, and their songs, such as “Lucifer” and “1 of 1”, have topped charts worldwide. Jonghyun was also a popular singer-songwriter whose hits include “She Is” and “Deja-Boo”. Having carved such a prominent role for himself in the music industry, Jonghyun’s suicide rattled fans and put a spotlight on depression in South Korea. The circumstances around the star’s death were highly publicised in both local and international media. A suicide note that he sent to a friend was published on Instagram, with the permission of Jonghyun’s family, and shared widely. It revealed his struggle with depression and life in the public eye. A memorial space was set up at Asan Medical Center, and K-pop idols were filmed entering the building to pay their respects. Fans were also welcome to visit the space and mourn together. Hundreds of fans and media crews flocked to the hospital on the day of Jonghyun’s private funeral, when his coffin was carried from the building by memebrs of boy bands SHINee and Super Junior. Jonghyun isn’t the only Korean idol to have suffered from depression. In his 2016 mixtape, Suga, from boy band BTS, referred to his own struggles with fame and identity. In 2017 ChoA, from girl group AOA, left her band due to battles with insomnia and depression. Even after treatment, ChoA has said she never really feels at peace. Rapper Woo Won-jae, who rose to fame on the hip-hop program Show Me the Money, stands out due to his dark lyrics which address his difficulties with depression and loneliness. Depression and suicide is a critical problem in South Korea, a country notorious for having the highest suicide rate in the OECD. South Korea has almost 30 suicides per 100,000 population, in comparison to an OECD average closer to 12. “It’s safe to say Koreans are quite used to this issue,” says Dongmin, a recent Korea University graduate. “They don’t make a big deal out of depression.” There is a perception in South Korea that everyone is suffering in some way, whether due to academic stress, unemployment, or work-related pressures. “Many people here in Korea suffer from depression, and some of them go to mental clinics to cure their illness,” Dongmin says, “but they don’t necessarily publicise it to their family and friends. It’s not an encouraged behaviour.” The stigma surrounding mental health only exacerbates the issue, as those struggling are unable to seek emotional support from their loved ones. Failing to discuss mental health issues with one another prevents Koreans from working together to raise awareness and promote change. Some people hope the highly public nature of Jonghyun’s death will lead to a change in the country, particularly within the music industry. Yet the challenge is long-standing. “There have been many public suicides which are gossiped about but then quickly forgotten,” says Dongamin. One of the most notable public deaths was of former South Korean president Roh Moo-hyun, who took his own life in 2009. To reduce the suicide rate in South Korea, dramatic change is required to break public taboos around the discussion and treatment of mental health. Recovery and treatment can only begin when Korea’s apathy is turned into action. If you or anyone you know needs help, in Australia call Lifeline on 13 11 14 or Beyond Blue 1300 224 636, or for readers overseas contact the suicide prevention organisations in your country. Stay informed with the latest commentary and analysis on international events from experts at the Lowy Institute and around the world. The Interpreter features in-depth analysis & expert commentary on the latest international events, published daily by the Lowy Institute. © Copyright 2023\n      \nLowy Institute ",
    "datetime": null,
    "url": "https://www.lowyinstitute.org/the-interpreter/jonghyun-depression-south-korea"
}