{
    "title": "Jongga, No. 1 kimchi brand in Korea since 1987, innovates the country’s essential food worldwide | South China Morning Post",
    "text": "•      Kimchi rides the Korean wave fuelled by the phenomenal success of K-pop (led by BTS) and K-drama (think Squid Game) to record impressive sales growth. The rise of the home cooking trend amid COVID-19 adds to its surging popularity •    Jongga kimchi, with its patented lactic acid bacteria that has been scientifically proven to prevent flu and viral infections, boosts immunity and increases wellbeing •     With its continuous innovation, Jongga has developed its competence as a global leader in kimchi by releasing a variety of kimchi products for different food lifestyles – vegan, halal, and kosher - that can be enjoyed by everyone in the world [Sponsored Article] A superfood loved around the world Fermented food is trending big time in this era of coronavirus. And kimchi, the essential Korean staple with its unique blend of sweet, salty, sour and spicy flavours, is the number one superfood that everyone needs right now. Made of fermented vegetables such as napa cabbage, radish and scallion with a wide variety of peppers and seasonings, kimchi is best known as a powerful probiotic loaded with good bacteria that do wonders for our gut health. High in fibre, vitamins and minerals, it boasts other fantastic health benefits, including invigorating the body, destroying harmful germs, and boosting the immune system. In fact, kimchi from Jongga, Korea’s number one kimchi brand, got certified as a space food for its microbiological and long-term storage properties. It kept the country’s first astronaut going in space onboard the Soyuz spacecraft in 2008. Kimchi's flu-busting properties were already proven in 2017 when an experiment carried out by Jongga demonstrated the high anti-viral effects of kimchi, leading the brand to patent the lactic acid bacterium and commercialise it. According to the Korea Food Research Institute, kimchi has been selected as one of the world’s top five healthiest foods by the American magazine Health. So, it comes as no surprise that the sales of kimchi worldwide have surged over the past two years, with people seeking to boost their immune systems with the help of this superfood that has also taken the culinary world by storm. There are many ways of eating this fermented veggie concoction - as it is and in pretty much anything. Jongga takes kimchi global The global popularity that kimchi enjoys today is thanks in no small part to Jongga, the first brand to introduce packaged kimchi products in response to the Korean government’s call to commercialise the country’s representative food ahead of the 1988 Seoul Olympics. In 1987, a team of experts came up with a standardised recipe and taste for kimchi that doesn’t change no matter when and where it’s eaten. They named the brand Jongga after the Korean tradition of passing recipes down from generation to generation. It conveys deep tradition, bringing the delights of Korean food to the people of Korea and beyond. Part of Daesang Corp, the 60-year-old Korea’s representative general food company at the forefront of the Korean food culture, Jongga uses innovative techniques to reinterpret Korea’s essential food, using only high-quality ingredients for its multitude of kimchi products. To keep the packaged kimchi in pristine condition, Jongga pioneered and patented a new technology in 1989 - a “gas absorber” that traps carbon dioxide in kimchi packaging, enabling it to take the pungent smell out of kimchi without compromising the taste or quality. The process also helps maintain the packaging form and effectively prevent damage in the distribution process as the kimchi makes its way around the world. The brand kept innovating and, in 1993, introduced canned kimchi so it could be easily eaten anytime, anywhere. In 2000, Jongga launched the convenient-to-store PET packaging to meet consumer needs, supercharging kimchi's popularity and sales worldwide. Based on the growing demand for various kimchi in the U.S. and European markets, three new types of kimchi using cabbage, kale, and carrots - vegetables which locals favour - were recently introduced by Jongga. ‘Mild Kimchi’ was also developed for those who don't like the spicy taste - an original version with salted seafood and a vegan one without salted seafood. Jongga increases international reach While it’s no surprise that domestic consumption of Jongga kimchi continues to increase, the soaring export figures bear witness to kimchi’s global celebrity and superfood status. In 2021, foodies and the health-conscious eagerly snapped up US$67 million worth of Jongga kimchi in over 40 countries where it’s available, including the Americas, Europe, Oceania, China, Japan and Singapore. This all-time-high figure represents a staggering 131 per cent increase from US$29 million in 2016. And in the first quarter of 2022, sales in Hong Kong increased dramatically by around 50 per cent compared to the same period last year, no doubt due to surging demand for the anti-viral food when the COVID-19 fifth wave gripped the city. The increase in exports to other parts of Asia and North America is equally notable, with sales in the U.S., particularly through large distribution channels such as Costco and Walmart, rising significantly. According to Jongga, over 90 per cent of kimchi buyers in the U.S. used to be local Koreans up till five or six years ago. But with Korean culture gaining influence, the brand is seeing more locals, including Asians, buying their share of kimchi in recent years. To satiate the American palate’s craving for kimchi, Daesang – Korea Plant Export No. 1 - has just completed and started operating a large-scale kimchi factory in Los Angeles, its 10th overseas production base and the first one outside of Asia in March. It looks like the world’s love affair with kimchi is getting hotter.  ",
    "datetime": "2022-06-21T00:00:11+08:00",
    "url": "https://www.scmp.com/presented/lifestyle/topics/jongga-kimchi/article/3181652/jongga-no-1-kimchi-brand-korea-1987"
}