{
    "title": "K Computer Simulates Global Seismic Wave Propagation",
    "text": "Since 1987 - Covering the Fastest Computers in the World and the People Who Run Them Since 1987 - Covering the Fastest Computers in the World and the People Who Run Them By John Russell March 17, 2016 Researchers at the Japan Agency for Marine-Earth Science and Technology (JAMSTEC) reported simulating global seismic wave propagation with a best-ever accuracy of 1.2 sec seismic period for a three-dimensional Earth model on Japan’s K supercomputer. Optimizing the code allowed them achieve sustained performance of 1.24 petaflops on the K computer, which is 11.84% of its peak performance. Their work is reported in the International Journal of High Performance Computing Applications (A 1.8 trillion degrees-of-freedom, 1.24 petaflops global seismic wave simulation on the K computer, Feb. 28). The study will help understand earthquake occurrence mechanisms and the Earth’s internal structures more precisely and is expected to make significant contributions to disaster prevention and mitigation. As noted in the abstract from their paper, the work was computationally challenging: “…Our seismic simulations use a total of 665.2 billion grid points and resolve 1.8 trillion degrees of freedom. To realize these large-scale computations, we optimize a widely used community software code to efficiently address all hardware parallelization, especially thread-level parallelization to solve the bottleneck of memory usage for coarse-grained parallelization. The new code exhibits excellent strong scaling for the time stepping loop, that is, parallel efficiency on 82,134 nodes relative to 36,504 nodes is 99.54%…” The research group was led by Dr. Seiji Tsuboi at Center for Earth Information Science and Technology (CEIST). In 2003, a similar study group achieved the computed theoretical seismograms with what was then a record-breaking 5 second frequency for realistic three -dimensional Earth with the Earth Simulator. Links to today’s press release and the paper are below: Press Release: http://www.jamstec.go.jp/e/about/press_release/20160317/\nPaper: http://komatitsch.free.fr/preprints/Tsuboi_IJHPC_2016.pdf More Off The Wire Be the most informed person in the room! Stay ahead of the tech trends with industry updates delivered to you every week! October 25, 2023 Everyone is looking to cash in on the GPU and AI craze, even a cannabis company.\r\n\r\nLast month, the Colorado based American Cannabis Company agreed to acquire HyperScale Nexus Holding Corp., and has created a business ar Read more… October 25, 2023 When planning an AI or HPC investment, applications are where the rubber meets the road and ultimately determine the benefits of any hardware investment. In addition, anyone concerned about computational performance must Read more… October 24, 2023 D-Wave Quantum Inc. (formerly D-Wave Systems) is once again facing delisting from the New York Stock Exchange because its stock price has dropped and hovered below $1 per share for 30 consecutive trading days. The compan Read more… October 24, 2023 The strain on data centers to deliver generative AI answers is mounting, and Lenovo is reverting to a server-client approach to offload some of that computing stress. \r\n\r\nLenovo is partnering with Nvidia to break up app Read more… October 24, 2023 Atom Computing, a developer of neutral atom-based quantum computers, today announced it has built a 1,225-site atomic array that contains 1,180 qubits. This follows building a 100-qubit system, named Phoenix, in 2021. Wh Read more… The AWS Batch team recently launched support for Graviton and Windows containers running on AWS Fargate resources. Combine that announcement with other recent additions such as larger task sizes and configurable local storage and Fargate becomes an even better serverless solution for your batch and asynchronous workloads. Read more… Organizations and developers face a variety of issues in developing and testing HPC and AI applications. Challenges they face can range from simply having access to a wide variety of hardware, frameworks, and toolkits to time spent on installation, development, testing, and troubleshooting which can lead to increases in cost. Read more… October 23, 2023 Optical networking inside and outside data centers is a way to create a sustainable large-scale computational infrastructure as artificial intelligence and other use cases come along.\r\n\r\nThe networking requirements and t Read more… October 25, 2023 When planning an AI or HPC investment, applications are where the rubber meets the road and ultimately determine the benefits of any hardware investment. In add Read more… October 24, 2023 Atom Computing, a developer of neutral atom-based quantum computers, today announced it has built a 1,225-site atomic array that contains 1,180 qubits. This fol Read more… October 19, 2023 The recent HPC + AI on Wall Street show presented a panel that brought together key vendors to discuss the current GPU Squeeze (shortage).   The \"Squeeze\" is  Read more… October 17, 2023 The first 5-year authorization of the U.S. National Quantum Initiative Act ended last month, and while no one expects the NQIA to be abandoned, it’s unclear w Read more… October 16, 2023 If you are waiting in a giant line for Nvidia's H100 GPUs, be advised that the next-generation H200 chip is already on its way.  The GPU maker earlier this mo Read more… October 12, 2023 A recent article on Tom's Hardware began with the headline \"China Wants 300 ExaFLOPS of Compute Power by 2025.\" Intrigued, further reading finds the following l Read more… October 11, 2023 Financial institutions need more compute capacity when trading spikes during the day, which could be available by just flicking a switch. Gone are the days of p Read more… October 10, 2023 We hear a lot about quantum computers – sometimes too much – but not as much about quantum networking which will also be a critical component in making wide Read more… October 6, 1995 Ithaca, NY --Visitors to this year's Supercomputing '95 (SC'95)\r\nconference will witness a life-and-death struggle between parasite and\r\nvictim, using virtual Read more… October 6, 1995 Surgery simulations to date have largely been created through the\r\ndevelopment of dedicated applications requiring considerable programming\r\nand computer graphi Read more… October 6, 1995 New York, NY -- U.S. President Bill Clinton has announced that he will\r\ndefinitely relax restrictions on exports of high-performance computers,\r\ngiving a boost  Read more… October 6, 1995 Amsterdam, the Netherlands -- SARA, (Stichting Academisch Rekencentrum\r\nAmsterdam), Academic Computing Services of Amsterdam recently announced\r\nthat it has pur Read more… October 6, 1995 Eagan, Minn. -- Cray Research Inc. has delivered a Cray J916 low-cost\r\ncompact supercomputer and Cray's UniChem client/server computational\r\nchemistry software  Read more… October 6, 1995 Sankt Augustin, Germany -- NEC C&C (Computers and Communication)\r\nResearch Laboratory at the GMD Technopark has wrapped up its first year\r\nof operation.\r\n Read more… October 6, 1995 Mountain View, Calif. -- Sun Microsystems, Inc. and Sybase, Inc.\r\nrecently announced the first benchmark results for SQL Server 11. The\r\nresult represents a n Read more… October 6, 1995 Mountain View, Calif. --  A study by the Palo Alto Management Group\r\n(PAMG) indicates the market for parallel processing systems will increase\r\nat more than 4 Read more… October 6, 1995 Ithaca, NY --Visitors to this year's Supercomputing '95 (SC'95)\r\nconference will witness a life-and-death struggle between parasite and\r\nvictim, using virtual Read more… October 6, 1995 Surgery simulations to date have largely been created through the\r\ndevelopment of dedicated applications requiring considerable programming\r\nand computer graphi Read more… October 6, 1995 New York, NY -- U.S. President Bill Clinton has announced that he will\r\ndefinitely relax restrictions on exports of high-performance computers,\r\ngiving a boost  Read more… October 6, 1995 Amsterdam, the Netherlands -- SARA, (Stichting Academisch Rekencentrum\r\nAmsterdam), Academic Computing Services of Amsterdam recently announced\r\nthat it has pur Read more… October 6, 1995 Eagan, Minn. -- Cray Research Inc. has delivered a Cray J916 low-cost\r\ncompact supercomputer and Cray's UniChem client/server computational\r\nchemistry software  Read more… October 6, 1995 Sankt Augustin, Germany -- NEC C&C (Computers and Communication)\r\nResearch Laboratory at the GMD Technopark has wrapped up its first year\r\nof operation.\r\n Read more… October 6, 1995 Mountain View, Calif. -- Sun Microsystems, Inc. and Sybase, Inc.\r\nrecently announced the first benchmark results for SQL Server 11. The\r\nresult represents a n Read more… October 6, 1995 Mountain View, Calif. --  A study by the Palo Alto Management Group\r\n(PAMG) indicates the market for parallel processing systems will increase\r\nat more than 4 Read more… © 2023 HPCwire. All Rights Reserved. A Tabor Communications Publication HPCwire is a registered trademark of Tabor Communications, Inc. Use of this site is governed by our Terms of Use and Privacy Policy. Reproduction in whole or in part in any form or medium without express written permission of Tabor Communications, Inc. is prohibited. ",
    "datetime": "2016-03-17T16:44:37+00:00",
    "url": "https://www.hpcwire.com/2016/03/17/k-computer-achieves-accurate-global-seismic-wave-propagation-simulation/"
}