{
    "title": "K Street descends on Kentucky  - POLITICO",
    "text": "McConnell is hoping to be majority leader if the GOP takes the Senate. | M.Scott Mahaskey/POLITICO By Anna Palmer 11/02/2014 05:34 PM EST Updated:\n11/02/2014 06:55 PM EST Link Copied LOUISVILLE, KY. — When Mitch McConnell rallied a crowd of supporters here a few days before the election, familiar faces greeted him — and not just Kentuckians. Washington lobbyists, many of them former McConnell aides, were packed in among members of his current Hill staff and local volunteers at a Best Western meeting room Saturday morning to hear “the boss,” as many still call him, whether they still work for him or not. “A lot of what you see is the ‘Mc-family,”’ said Hunter Bates, a former McConnell chief of staff who is a co-founder of Republic Consulting, a boutique lobbying firm with offices in Kentucky and Washington. ( Also on POLITICO: GOP gains steam) “It’s the extended McConnell family all coming together at crunch time both to do everything that we can to help, but also to celebrate what we believe will be his biggest and greatest victory in his career.” McConnell, hoping to be the next majority leader if Republicans take the Senate, is in the final stretch of a tight race against Democrat Alison Lundergan Grimes. Cutting checks won’t help him now, but volunteers on the ground can — knocking on doors to get out the vote. It’s become a veritable ritual: When leaders of either party find themselves in tight races, friends on the Hill and K Street parachute into a state with which they may have no other connection to help get voters to the polls. So while McConnell is making his closing argument to voters, including that he’s a Kentuckian through and through, he’s counting on Washington storming the Bluegrass State to get him across the finish line. ( POLITICO’s polling center) “At headquarters we’ve gradually run out of things to do. We’ve raised all the money we can raise. We’ve bought out all the TV time we can buy and radio time and dropped all the mailing pieces we can,” McConnell told the crowd Saturday. “It’s all in your hands.” The mass of McConnell supporters in the state this weekend spanned the gamut from his chief of staff, Sharon Soderstrom, to at least one former member of his security detail. Nearly all of McConnell’s current staff is here for the final push, including policy adviser and counsel Brendan Dunn and senior policy adviser Neil Chatterjee. Former McConnell staffers-turned-lobbyists and consultants are also out in force. Among the dozens who have traveled to Kentucky for the election are David Schiappa, former parliamentarian and floor manager for the Senate GOP, of the bipartisan lobbying firm the Duberstein Group; Megan Hauck, former McConnell health policy adviser, who co-founded the boutique firm Nathanson+Hauck; and Lanier Swann Hodgson, who handled conservative third party and business outreach for McConnell and now is director of state and federal affairs for UNC Health Care. ( POLITICO’s 2014 race ratings) Despite holding the rally at the “Worst Western,” a nickname many have given it for its lack of amenities, like working showers, the event has an almost family reunion-like feeling as volunteers fresh off their flights shake hands and hug others who’ve been here for weeks. Gone are the suits and ties and pearls. Those mainstays of the inside-the-Beltway Republican wardrobe have been replaced by “Team Mitch” T-shirts, jeans, sneakers and fleece jackets as they prep for a day of door knocking and attending chilly McConnell campaign events. “A lot of us have done it for every campaign,” said Jon Deuser, a former McConnell staffer and lobbyist at the Smith-Free Group, a small bipartisan lobbying firm. Deuser, who served as a driver to McConnell and later as a legislative aide, recalled how there were just six or seven D.C. staffers when he first volunteered on his 1990 reelection campaign. “It seems to have gotten bigger each time because the races have gotten bigger as he’s grown in seniority and up the leadership ladder,” Deuser said. Over his nearly 40-year career, McConnell has had close races before, including his 2008 race against Bruce Lunsford in which there was a similar “all hands on deck” call through the Kentucky Republican’s extended network. The feeling of a mini-Washington also comes from McConnell’s own campaign staff. His personal office chief of staff Josh Holmes stepped down from that position last August to focus exclusively on the GOP leader’s reelection. More recently McConnell spokesman John Ashbrook decamped for Kentucky this fall to help with the campaign’s messaging. Former McConnell chiefs of staff, including Bates; Billy Piper of Republican lobbying firm Fierce, Isakowitz & Blalock; and Kyle Simmons of the recently formed Simmons & Russell Group have also been informally advising senior campaign staff like Holmes with regular calls. Follow @politico  “It’s an all-hands-on-deck moment, and there’s just a lot of enthusiasm behind it,” said Steven Law, a former McConnell staffer who is a board member of the pro-McConnell super PAC Kentuckians for Strong Leadership. “One thing that you consistently hear from former McConnell staffers is how proud they are to have worked for him and the personal affection they have for him. People want to show up.” In a political environment where incumbents are regularly pilloried for their ties to Washington and lobbyists, McConnell was unapologetic for the wave of out-of-state supporters coming in to help him at the end. “I’m just grateful for the help,” McConnell said after a rally with Kentucky Republican Rep. Andy Barr in Mount Sterling. “I think this is a national race with a lot of interest from people not only inside the state but around the country.” Further, McConnell pushed back against his opponent, Grimes, for criticizing out-of-state United Mine Workers of America members coming to support him. “I think she shouldn’t demonize the UMWA people coming from Pennsylvania, West Virginia and Ohio,” McConnell said. And heading out on the campaign trail is hardly a Republican-only phenomenon. Democrats also have a history of flying across the country to help their former bosses, particularly when top party officials like former Senate Minority Leader Tom Daschle of South Dakota and current Senate Majority Leader Harry Reid of Nevada were in trouble. Daschle lost his 2004 reelection bid while Reid was able to fend off Republican Sharron Angle in 2010. “It’s one of those things that you work for the person because you believe in them and so with that when they are in for a tough reelection you want to do everything you can to make sure they get reelected,” said Penny Lee, a former senior adviser to Reid, who volunteered during his last campaign. “I have done everything from knock on doors to stuff envelopes to write thank-you notes. … It’s not necessarily the intellectual exercise that they need. They just need bodies.” While his campaign believes McConnell will win, it isn’t leaving anything to chance. A NBC/Marist poll out Sunday showed McConnell beating Grimes, 50 percent to 41 percent. For weeks D.C.-based McConnell volunteers have flown in to help staff campaign events, canvass and door knock in an unprecedented effort to beat Grimes. The jobs aren’t glamorous — most would spend this chilly weekend door knocking in key counties. The McConnell operation dedicated significant resources to design a sophisticated GOTV app that volunteers have downloaded to their phones. Others have helped bolster the crowds for McConnell’s seemingly endless series of campaign stops around the state. Malloy McDaniel of Blank Rome Government Relations helped organize a “Bluegrass Blitz” that coincided with McConnell’s coal bus tour. Downtowners like Justin Rzepka and Michael Dean of NCTA, Frank Cavaliere of Microsoft, Bill Bailey of the Walt Disney Co., Keith Murphy of Viacom and Myriah Jordan of Facebook all sported “Team Mitch” T-shirts as they smiled for an Instagram photo while in the state supporting McConnell. Over the past several weeks, others, like former McConnell chief of staff Piper, have been a near omnipresence on the campaign, traveling with McConnell on his coal bus tour, which focused heavily on Eastern Kentucky. “After working for him for almost 20 years, it was literally coming home again,” Piper said. “It’s so invigorating because it reminds you why you are trying to do what you are doing in Washington.” Follow @politico  Link Copied © 2023 POLITICO LLC ",
    "datetime": null,
    "url": "https://www.politico.com/story/2014/11/2014-kentucky-elections-mitch-mcconnell-alison-lundergan-grimes-112426"
}