{
    "title": "K-9 Officer made impact before shot in line of duty",
    "text": "CLARK COUNTY, INDIANA (WAVE) - He served for six years, doing the jobs of several different officers. Tuesday Indiana State Police found work a little more difficult after the loss of one of their own. K-9 Officer Kilo was shot and killed during a standoff in Sellersburg Monday.Kilo was known for major drug busts during his six years serving with ISP. \"Anytime that any of us would make a traffic stop out here and for some reason we would suspect drugs in the car or we would got to a house if Trooper Nathan Abbott and Kilo weren't already working I mean all we had to do was make that call and they were there for us,\" explained Master Trooper Mary Sanchez. While the mug shots of people arrested in the last six years thanks to Kilo are endless, Master Trooper Sanchez said he did much more than sniff out drugs. \"Kilo was also a tracking dog. It wasn't just about tracking suspects. Kilo would be called out to track missing people missing children.\"Those tracking skills ended Kilo's life. He was the first to go into a Sellersburg home after police said Josh Priddy, 31, broke in after a chase. Kilo found Priddy inside who police said shot and killed the dog.\"I'll be honest, I'm pretty tore up over this. This is upsetting.\" Clark County Assistant Prosecutor Jeremy Mull not only prosecuted cases brought to him after Kilo's busts, but his office helped ISP purchase Kilo in 2006. He saw first hand how kilo made the community safer. \"These dogs are just here to serve and to help and Kilo did that and he paid the ultimate price for that.\"As upsetting as the death is, Mull, like Kilo's fellow officers know, \"Ultimately I believe absolutely that Kilo saved several lives Monday. He did what he was trained to do. He didn't give it a second thought when he did it,\" said Master Trooper Sanchez.They just wish that made it easier to accept Kilo won't be there the next time they need that expert nose to track down what a human likely wouldn't find.ISP says they will hold a memorial service for Kilo, but those plans are pending.They hope to get a new K9 Officer. They already have a fund set up to purchase the dog. To donate send your money to: \"Kilo Memorial Fund\"CFK/ISPA Foundation1415 Shelby St.Indianapolis, IN 46203 Copyright 2013 WAVE News. All rights reserved. ",
    "datetime": "2013-06-25T23:03:39Z",
    "url": "https://www.wave3.com/story/22683787/k9-officer-made-impact-before-shot-in-line-of-duty/"
}