{
    "title": "K-boom! South Korea’s art and high culture lands in Britain with a bang | South Korea | The Guardian",
    "text": "After K-pop and kimchi led the way, a major UK exhibition and cultural season will celebrate the best of the country’s vivid art, music and style Kimchi, the fermented pickle, led the way, establishing a taste for colourful Korean food in Britain. It was followed by a youth wave of K-pop music hysteria. Then came those two international screen hits, Bong Joon-ho’s shocking 2020 Oscar winner Parasite and last year’s brutal television series Squid Game. Now the influence of South Korea is spreading just as quickly across highbrow culture, with the launch of a season of K-music and visual art in London and a major exhibition at the Victoria and Albert Museum about to offer a kaleidoscopic vision of South Korean creativity. The title of the V&A’s show, Hallyu! (“Korean Wave!”), sums it up. The exhibition, which opens on 24 September, will proudly display a jacket worn by the Gangnam Style singer Psy in his viral 2012hit, but will also place the current explosion of Korean energy in a wider cultural setting. Before that, from this Friday, the outside of the Coronet theatre, a large arts centre in Notting Hill, west London, will be entirely covered by the work of Choi Jeong-hwa, a specialist in inflatable art, as a way to announce the arrival of a late summer burst of Korean creativity inside the building. Choi’s sculpture will festoon the theatre’s facade with shapes made from balloons and wires, as well as recycled and found objects, and the artist’s work will also be on show inside the theatre itself. “The things I’ve seen in Korea in the last few years have blown my mind,” said Anda Winters, artistic director of the Coronet theatre. “There is such an exciting use of cultural traditions and skills, but always with a twist.” Winters’s passion for Korean contemporary arts stems from her first visit to Seoul more than 20 years ago: “I’ve seen so many changes, both economic and artistic – and, of course, everything has been influenced by the west. But they are still using the artefacts and objects and mannerisms from their own traditions,” she said. Much of the work showcased in the Coronet’s month-long season might be described as “avant garde”, except that both Korean street food and popular mass entertainment have already served as an advance guard, paving the way for a more sophisticated influx of leading Korean artists. In fact, two years ago, BTS, the superstar K-pop boy band, deliberately made a link with the fine art world by sponsoring 22 art installations in London, Buenos Aires, Berlin, New York and Seoul called Connect, BTS. For the project, British sculptor Sir Antony Gormley created Clearing, an installation for Brooklyn Bridge Park like a giant slinky toy of linked metal coils running along the bank of the East River. The growing significance of art and design from Seoul is examined in a new book by Fiona Bae, Make Break Remix: The Rise of K-Style, out next month. Featuring a series of interviews with key designers and commentators, it suggests that commercial creativity and independent contemporary art practice are both enjoying an unprecedented boom. Early next month, Seoul will acknowledge this new status in the cultural firmament when it hosts its first Frieze art fair. The Coronet has called its season Tiger Is Coming; a phrase chosen by the artist Choi to provoke interest in all the storytelling, computer-generated sound, art and dance going on inside the venue until October. Leenalchi, a new K-band sensation, will make their first live appearance outside Korea, with three performances timed to coincide with South Korea’s thanksgiving festival, Chuseok. The six-piece band, more like alt-pop in style and content than mainstream chart-toppers, draw on pansori, a musical storytelling tradition, as well as on dance and rap. Their recent track Let’s Live for Today was featured on the original version of the acclaimed Apple TV+ drama series Pachinko. Sign up to The Guide Get our weekly pop culture email, free in your inbox every Friday after newsletter promotion Music will also come from Tacit Group, a team of composers and media artists also making their London debut after performances in New York, Chicago and Denmark. They use mathematical codes to make immersive sound experiences that change each time they are played. A dance video series looking at the geography and nature of Jeju, an island on the southernmost tip of the Korean peninsula, will be screened, and there will be a performance of Body Concert, a piece from the award-winning Ambiguous Dance Company, directed by Boram Kim. The company appeared last year in Coldplay’s video for Higher Power. Another dance work, Body-go-Round, will be a “mixed reality performance” from Collective A, led by Cha Jinyeob, who was the director of choreography for the 2018 Pyeongchang Winter Olympics. Theatre will be represented by the award-winning company Dolpagu, who are to stage a show that explores gender and social class across generations. “I have wanted to bring all this work over to London for years,” said Winters, “and the whole world is certainly paying attention now.” ",
    "datetime": "2022-08-20T15:00:44.000Z",
    "url": "https://www.theguardian.com/global/2022/aug/20/south-korea-culture-fine-art-britain"
}