{
    "title": "K-craze: Korean dramas and culture are taking India by storm | Business and Economy News | Al Jazeera",
    "text": "As India locked down last year, locals turned to Korean dramas, leading to a jump in the sales of Korean food, makeup and music. New Delhi, India–  CS Mani, a 67-year-old Indian, isn’t someone you’d expect to become enthralled by a South Korean limited television series. But as he watched the finale of Crash Landing on You in his apartment in Mumbai, he couldn’t hold back his tears. “Didn’t you cry in the end? Episode 16? I cried rivers,” he told Al Jazeera, recalling the sweet-sad love story of a South Korean heiress and a North Korean army captain. “My wife thinks I’m mad,” Mani added. Mani is not mad. He’s just caught in the whirl of hallyu — the Korean wave, or South Korea’s pop-culture blitzkrieg. Considered something like Trojan horses for their growing soft power, South Korean cultural and pop culture exports have taken India by storm since the country went into one of the world’s strictest coronavirus lockdowns last year. Isolated and rendered listless by the fear of COVID-19, many Indians turned to online entertainment and fell in love with K-dramas. For most, the affair began with one of the 500 Korean offerings available on Netflix: Descendants of the Sun, Boys Over Flowers, Reply 1988, Kingdom, Sky Castle. That budding romance blossomed for many into a fondness for all things Korean: the food the stars ate, the clothes and jewellery they wore, the soju (Korean alcoholic beverage) they drank, the language they spoke and the beauty products they used. Demand for many of these products shot up in India, spurring Indian companies to invest more in acquiring and marketing them. In 2020, South Korean noodle brand Nongshim alone recorded sales of $1m. So far in 2021, Indians have consumed 178 percent more Korean instant noodles, ramyun, than they did in 2020, according to market research firm Euromonitor International. Interest in Korean language classes also accelerated. “Earlier when people used to take language courses it was linked with employability,” Rathi Jafer, who heads the Indo-Korean Cultural and Information Centre in the southern Indian state of Tamil Nadu, told Al Jazeera. “Now we have people learning the language because they want to understand what their icons are saying; what the singers are singing. They want to have a direct connect with Korea through the language.” Korean dramas exported to India tend to be well directed, have high production values and offer plots that conjure up worlds where the concerns are familial, familiar and mundane. That universal appeal is by design, says Dae Ryun Chang, a professor at Yonsei Business School in Seoul. He told Al Jazeera that while the language, setting and characters of K-dramas are distinctly Korean, the way they are crafted is “actually very multinational” and “meant to be palatable to international audiences”. Chhitra Subramaniam, senior vice-president at Kross Pictures, a South Korean multinational production company that remakes Korean films in India, told Al Jazeera that K-dramas’ appeal lies in their “emotional stickiness”. Some newly-converted K-drama fans who spoke to Al Jazeera cited coronavirus pandemic grief as the catalyst for their newfound interest in K-drama, saying they could no longer relate to American shows about spies and military operatives taking out enemies, or to cold, dysfunctional Scandinavian detectives hovering over dead bodies and chasing serial killers. In a phone interview, one fan said, “No matter what stressful situation I may be going through, Korean dramas make me laugh.” For Indians used to Bollywood masala and melodrama, K-dramas have it all: songs, a Mills & Boon romance often conducted in foreign locations, some light humour and all the tropes for which Indian commercial cinema is famous. There are love triangles, kidnappings, sudden bouts of amnesia, stern mothers, revenge for family honour and the biggest connection of all — living next door to a separated-at-birth brother/enemy nation. “There is a kind of appeal of South Korean culture … a kind of familiarity [with] all the aspects of South Korean culture which is what has made them [K-dramas] such a hit,” Sripriya Ranganathan, India’s ambassador to South Korea, told Al Jazeera. Consider the K-drama Sky Castle, where mothers and fathers go to extreme, often criminal lengths to make sure their children excel in education. “They [Koreans] are very, very focused on education … totally in tune with how we are in India. Anything is OK if it’s for the kid’s education. No cost is too much,” adds Ranganathan. With Indians binge-watching K-dramas, Netflix recorded a massive spike of 370 percent in viewership of K-dramas in 2020 over 2019, according to Euromonitor. And soon others, too, jumped in. India’s Zee Group-owned satellite service provider Dish TV launched a daily package for 1.3 rupees (less than 2 cents) where customers could access Korean dramas dubbed in Hindi. Popular streaming platform MX Player offered K-dramas dubbed in Hindi and two regional languages, Tamil and Telugu. While neither the Korean producers nor the streaming platforms were targeting 60-something senior citizens, Mani has been drawn into the cozy, heartwarming world of K-dramas and has binge-watched more than 70. He now begins his texts with “annyeonghaseyo” (hello in Korean). He says that he has picked up about 60 Korean phrases to get by if he were to ever find himself in Seoul, a city he describes as having “175,000 CCTV [closed-circuit television] cameras”. He added admiringly, “South Korea has the fastest internet in the world… Every car in Korea has to have a camera, and they love drinking and eating.” Martin Roll, a Danish author, brand strategist and consultant to several Korean conglomerates, told Al Jazeera that awareness is one of the key drivers of hallyu: Careful and effective insertion of “all possible touchpoints … where you touch a country, touch a brand … [and it] adds up to viewers’ perception … of Korea, of made in Korea.” Crash Landing on You revolves around a lonely, rich South Korean chaebol heiress (a chaebol is a large, family-owned conglomerate) who goes paragliding, gets caught in a storm and lands on the other side of the border. An upright, handsome North Korean army captain rescues her and decides to deliver her back home safely. En route, there are nosy neighbours, a weepy fiancee, greedy brothers, evil villains, two nations at war, but also lots of Korean food, fashion, music, talking rice cookers, Samsung phones, and beauty products around stars with chok chok (luminous) skin. It’s a story viewers could imagine being set in India or Pakistan. That may explain why so many Indians were riveted, Mani cried, and droves of people picked up sheet masks and snail serum from famous South Korean brands like Innisfree, Laneige, Etude, Sulwhasoo and The Face Shop from online stores like Amazon India and Nykaa. Amazon India told Al Jazeera that there has been a “growth of more than 3.5 times in the K-beauty category”, and both platforms credit the “surge in demand for Korean beauty products” not to any marketing or distribution plan, but to the rising popularity of K-dramas and K-pop. Some entrepreneurial Indians have also found value in riding the K-craze. South Indian playback singer Chinmayi Sripada — who has one million followers on Twitter — launched a K-beauty brand called Isle of Skin. Home-grown K-beauty brands like Pilgrim, launched in the midst of the pandemic last year, have become very popular. And young content creators have discovered that K-love doesn’t just help grow their online clout, but also their income. Moon, an 18-year-old student who regularly posts K-pop dance covers shot in a grungy corner of her room in Bengaluru, has 86,700 followers on Instagram. She collaborates with e-commerce sites like Walmart-owned Flipkart and others to sell K-fashion and K-pop merchandise. She recently charged Flipkart 10,000 rupees ($136) for a 25-second product promotion video, her artist manager told Al Jazeera. While South Korean companies like Samsung, LG, Kia Motors, Lotte, Hyundai electronics and others have long been operating in India — the top 20 Korean companies alone account for 95 percent of the $17.45bn bilateral trade, according to Indian government data — what’s new is the mainstreaming of hallyu. Underpinning it is a 2010 free trade agreement between the two countries in which India imports South Korean food items without tariffs, and beauty products with a 5 percent duty. Last year, Korean became one of the eight foreign languages that could be taught in Indian schools when New Delhi announced a new policy to regulate education across the country. But the obsession over everything Korean is growing at a speed and in directions unexpected. There are K-drama and K-pop fan clubs in towns and cities like Ahmedabad and Pune in the west, Dehradun in the north, Guntur in the south, Nagpur in the middle of the country, and Patna towards the northeast — towns where local languages are more popular than English. In early September, in the Mumbai suburb of Mulund, some BTS fans got together and raised money to book a bus shelter for a week which they plastered with massive posters of Jeon Jungkook, a BTS band member, to wish him well on his 24th birthday. Last year alone, Korea’s pop culture exports earned the country $10.5bn globally, says Yonsei Business School’s Chang, citing data from the Korea Foundation for International Culture Exchange in Seoul. Two Korean government ministries — culture, sport and tourism and foreign affairs — further boost that success with regular research on the status of hallyu in each country to identify where there’s potential to do more. For instance, the Korean Cultural Centre in Delhi, with the Korean embassy’s help, supports hallyu fan clubs’ activities and regularly conducts K-pop music and dance competitions where no marks are given for originality. Trophies and trips to Korea go to only those singers and dancers who copy Korean pop idols with precision, matching every move, every beat, even attire. In Chennai last year, the Korean consulate general picked five girls — winners of K-pop dance competitions — to launch an Indian K-pop girl band called Dream K-pop. They routinely post K-dance tutorials and covers of popular K-pop songs on their YouTube and Instagram handles. Hyunwoo Thomas Kim, chief executive of South Korean film and TV production company Kross Pictures, told Al Jazeera from his Los Angeles office that since Korea is a small country, “We have always been sort of pressed to think outside of Korea … we were meant to be exporters. It’s in our DNA.” Thomas arrived in India some six years ago with an interventionist’s zeal because, he says, Indian film directors and production houses had been, for years, brazenly remaking Korean hit films without permission or payment. Thomas didn’t like that, but he liked the size and appetite of the Indian market. He started big. His first Indian film was a remake of the Korean film Montage, and starred Bollywood superstar Amitabh Bachchan. Since then, Thomas has remade Korean films in Telugu and Tamil — and his next one, set to release soon, is a Bollywood film starring A-lister Sonam Kapoor. That’s not all. Apart from 10 films and five series for streaming platforms in the pipeline, he has also launched Korean video games and webtoons and claims close to four million subscribers already. “We are very profitable,” says Thomas. (Last year Kakao Entertainment, owned by Brian Kim, one of South Korea’s wealthiest people, picked up a 49 percent stake in Kross Pictures.) Sunny Moon, a consultant with Euromonitor’s Korea office, told Al Jazeera that the Korean government has analysed the growing popularity of K-dramas in India, and “we can expect more and more spread of K-food, beauty and other Korean products in the Indian market”. Danish consultant Martin Roll laughs when asked if South Korea has a world domination plan that we are unaware of. “They have a very fierce and competitive mindset when it comes to business strategy, and it has paid off really well,” he says. In the narrow, labyrinth lanes of Humayunpur, a small, low-income neighbourhood in Delhi where tall buildings are squeezed next to each other on tiny plots, Sang Hoon Lee runs his Kori’s Cafe & Restro. A Korean who studied for a few years in an Indian boarding school, Lee returned to India after finishing his graduation in Canada and mandatory military service in Korea. He opened his first restaurant, Kori’s, in Delhi in 2012 serving Korean fried chicken, among other things. It failed. He moved locations, changed the menu and opened another Kori’s, then another, and another. It was his seventh attempt in 2015, the Humanyunpur restaurant, that finally took off. There was no looking back, and he now has three more restaurants up and running and a fifth one in the pipeline. All offer Korean food, with a sprinkling of hallyu.          Follow Al Jazeera English: ",
    "datetime": null,
    "url": "https://www.aljazeera.com/economy/2021/9/15/k-craze-korean-dramas-and-culture-are-taking-india-by-storm"
}