{
    "title": "K-drama 'Vincenzo' slammed for using Chinese brand bibimbap | Philstar.com",
    "text": "MANILA, Philippines — The Song Joong-ki starrer \"Vincenzo\" earned the ire of Korean netizens over a scene that featured the stars with bowls of bibimbap in its March 14 episode. Joong-ki and his co-star Jeon Yeo-bin are seen digging into a bowl of the popular Korean dish of warm rice topped with sauteed vegetables, choice meat, egg, gojuchang (chili paste) and kimchi (pickled vegetable). The furor started when Korean netizens noticed that the stars were consuming bowls of Zihaiguo instant bibimbap. Zihaiguo is a Chinese brand that offers \"self-heating\" hotpot meals. \"If the network just sells placement to Chinese companies for quick money, wouldn't (foreign) people who watch this series think bibimbap's Chinese food? This is a serious issue … I know money is important but this is taking it too far,\" wrote a netizen as reported on Korea Times website. \"What is this Chinese bibimbap product placement? Now they (Chinese) are going to argue that bibimbap is a Chinese dish,\" another viewer wrote. This is not the first time that Korean netizens raised their concerns on their beloved dishes being allegedly claimed by China. They've also called the attention of state-run Chinese paper Global Times in November last year. The paper reported that the International Organization for Standardization (ISO) certification won by Beijing for pao cai (Chinese pickled vegetable) is \"an international standard for the kimchi industry led by China.\" RELATED: Ginger chicken soup wars: South Koreans upset anew after China claims samgyetang as its own Philstar.com is one of the most vibrant, opinionated, discerning communities of readers on cyberspace. With your meaningful insights, help shape the stories that can shape the country. Sign up now! ",
    "datetime": null,
    "url": "https://www.philstar.com/entertainment/korean-wave/2021/04/06/2089304/k-drama-vincenzo-slammed-using-chinese-brand-bibimbap"
}