{
    "title": "K-drama and K-pop’s Bae Suzy is also a Korean CF queen – but how does the Porsche-driving star of Netflix’s Start-Up and Dream High spend all that money? | South China Morning Post",
    "text": "So it should come as no surprise that the multi-hyphenate talent has amassed a massive fortune for herself. Seoulz estimates that the star is worth US$20 million in 2020. So just who is Bae Suzy, and how does she like to spend her money? Bae attended the School of Performing Arts Seoul before being scouted for idol-dom Bae started out as part of Miss A, before switching to acting Bae is a “CF queen” as one of the most in-demand brand ambassadors in South Korea Bae’s popularity among fans has led her to become one of South Korea’s most in-demand endorsers, earning her the title “CF queen”. She endorses multiple brands across different categories: Dior, Guess, Lancome and even Chumchurum soju (a Korean spirit) to name a few. She charges a hefty fee for ambassadorships: Bae has reportedly earned US$8.8 million from brand endorsements alone. Bae has an impressive real estate portfolio With her fortune, Bae has decided to make investments in real estate. She recently purchased a home for herself worth US$2.7 million. The four-bedroom, three-bathroom flat is located in Samseong, Seoul, one of the city’s most affluent areas. Aside from her home, she also owns a multistorey commercial building in Gangnam, Seoul worth US$3.19 million. She drives a Porsche 911, which she previously called her “dream car” Aside from building her dream house, Bae also drives a Porsche 911, which she previously named as her dream car. While the car comes with a hefty price tag of around US$140,000, it seems to be worth it: Bae reportedly loves cruising around in the car to “relieve stress”. Want more stories like this? Sign up  here. Follow STYLE on  Facebook,  Instagram,  YouTube and  Twitter . After studying with F(x)’s Sulli and Girl’s Day’s Hyeri, Bae joined JYP Entertainment, singing with Miss A, acting with Kim Soo-hyun, and endorsing fashion brands like Dior, Guess and Lancome ",
    "datetime": "2020-11-30T11:15:18+08:00",
    "url": "https://www.scmp.com/magazines/style/celebrity/article/3111878/k-drama-and-k-pops-bae-suzy-also-korean-cf-queen-how-does"
}