{
    "title": "K-EARTH, The Wave’s Jhani Kaye ready to explore new musical paths – Orange County Register",
    "text": "E-Edition Get the latest news delivered daily!  Get the latest news delivered daily! E-Edition Trending:  KFI's Bill Handel was tops in morning drive with listeners 12 and older.  Kevin Ryder, left, and Gene \"Bean\" Baxter were No. 1 with listeners in the 25-54 age range.  According to the latest Arbitron ratings, Ryan Seacrest was No. 1 among listeners ages 18-14.  Veteran newsman John Brooks recently retired from KFWB and KNX.  Program director Jhani Kaye, who has helmed the programming at K-EARTH and The Wave, says he's ready to explore other options.  It’s rare when a station program director becomes almost as well-known as the on-air talent, but that has marked the Los Angeles career of Jhani Kaye, first at Clear Channel, then, starting in 2006, at K-EARTH and KTWV. But now he feels ready to explore new passions, though he won’t reveal the details yet. Steve Carver, senior vice president for CBS stations in L.A. said in a recent announcement: “For the past seven years we have been fortunate to work alongside Jhani Kaye as he helmed the programming efforts at The WAVE and K-EARTH. He has made a number of important contributions that have distinguished the stations among its peers and been a valued member of the team. As he nears the end of his current agreement with CBS Radio, Jhani has elected to explore fresh challenges and new opportunities using his multifaceted talents and unmatched passion for music” Said Kaye: “I’m really going to miss our family here at K-EARTH/The WAVE. Luckily, I’m committed to CBS through the end of June and am devoting myself to a smooth transition for them.” We will interview Kaye as it gets closer to his departure. SURVEY SAYS It’s time for some new radio surveys, so here’s this week’s question: What is your favorite song to hear and your least favorite, regardless of format? Keep your answers brief and include your name. My email address is at the end of this column. BROOKS RETIRES Veteran newsman John Brooks recently retired from KFWB and KNX. He started at KFWB in 1979. Alan Oda recently interviewed Brooks for laradio.com. Here are excerpts: “I always hoped to be a bit irreverent and crazy like Hunter Thompson, yet true to the facts and accurate as Walter Cronkite and CBS News. There should always be an element of entertainment in news when it is appropriate because people are choosing to listen to your station, but you can’t cross the line into fantasy.” Pete Demetriou shared his high praise for his longtime colleague at KFWB and KNX. “There’s a hidden joke somewhere in Brooks’ stories that you figure out about five seconds after his reports. The man is solid and is one of the most prepared journalists ever. He’ll take everything thrown at him, yet sound so smooth on the air as if he’d spent 15 minutes rehearsing his report. “John has a depth of knowledge about everything – about politics, about history, about current events. He knows music, from classical to classic rock – he’ll pull up a song lyric from memory and apply it to his report when appropriate.” Demetriou adds that Brooks knows how to get the best out of his interviews. “He’s developed as a professional a way of making who he’s talking to become quickly comfortable and willing to answer anything he asks.” KSPA CHANGES Here is the new weekend music schedule for KSPA 1510 AM and 1450 AM: Saturday 11 a.m.-1 p.m. – “Car Pros” 1-3 p.m. – “Jazz at the Spa” 3-4 p.m. – “Forgotten Hollywood” 4-6 p.m. – “Big Band Jump” Sunday 11 a.m.-noon – “Car Pros” Noon-2 p.m. – “Sounds of Sinatra” 2-4 p.m. – “Radio Deluxe” 4-6 p.m. – “Jazz at the Spa” “Jazz at the Spa” features the big-band music of Matt Catingub. FEBRUARY RATINGS Morning drive, 6 a.m.-10 a.m., from Arbitron: 1. KBIG (MYFM) 2. KIIS 3. KOST 4. KFI 5. KAMP (AMP Radio) 6. KRTH 7. KPWR 8. KHHT 9. KLVE 10. KNX 11. KRCD 12. KROQ 13. KBUE 14. KTWV 15. KLAX 16. KCBS (Jack FM) 17. KKGO 18. KYSR 19. KSWD 20. KLOS 21. KPCC 22. KSPN 23. KXOL 24. KLYY 25. KFSH 26. KWIZ 27. KDAY 28. KHJ 29. KJLH 30. KUSC 31. KCRW 32. KDLD 33. KABC 34. KSSE 35. KFWB 36. KKJZ 37. KXOS 38. KRLA 39. KLAC 40. KTLK 41. KTNQ Morning drive, ages 12 and older: 1. Bill Handel (KFI) 2. Kevin & Bean (KROQ) 3. Ryan Seacrest (KIIS) 4. Valentine (KBIG) 5. Mark & Kristin (KOST) Ages 18-34: 1. Ryan Seacrest (KIIS) 2. Kevin & Bean (KROQ) 3. Carson Daly (KAMP) 4. Big Boy (KPWR) 5. Valentine (KBIG) Ages 25-54: 1. Kevin & Bean (KROQ) 2. Ryan Seacrest (KIIS) 3. Valentine (KBIG) 4. Renán “El Cucuy” Almendárez Coello (KLAX) 5. Don Cheto (KBUE) STATION BREAKS •Orange County Register business writer Jon Lansner is on KFWB/980 AM at 8:12 a.m. Fridays. •”The Pet Place Radio Show” airs at 7:30 a.m. Sundays on K-Mozart 1260 AM. •Orange County chef Jamie Gwen is on KFWB/980 AM 8-10 a.m. Sundays. •Mari Frank hosts two Monday morning shows on Irvine-based KUCI/889.9 FM starting at 8 a.m. The first is “Privacy Policy,” followed by “Prescriptions for Healing Conflict.” Topic: forgiveness More information: Mari@MariFrank.com. Freelance writer Gary Lycan is the Register’s radio columnist. Write: Show, The Orange County Register, P.O. Box 11626, Santa Ana, CA 92711. You can follow him on Twitter.com/radioocr. E-mail: garylycan@sbcglobal.net Copyright © 2023 MediaNews Group ",
    "datetime": "2013-03-21T19:07:00+00:00",
    "url": "https://www.ocregister.com/2013/03/21/k-earth-the-waves-jhani-kaye-ready-to-explore-new-musical-paths/"
}