{
    "title": "K-Edge chain catchers - 21 Days of Tour Tech - BikeRadar",
    "text": "The story behind the little company that started the craze By Ben Delaney Published: July 18, 2014 at 2:00 am  If you look closely at the bikes of the Tour de France, the majority have chain catchers, little devices that when used properly, prevent chains from dropping to the inside of the little chain ring. Recently, a host of companies have begun producing them, from component giants like SRAM and Campagnolo to bike companies like Canyon and Trek. But K-Edge can be credited for starting the modern wave of derailleur-mounted chain catchers. And the little company from Boise, Idaho, started not as a business plan, but as a solution between a now-married couple. In 2006, Kristin Armstrong was racing the UCI world championship time trial in Salzburg, Austria, where there were a couple of climbs on the course. Coming into the second climb, her legs spinning at 100rpm, she flicked her lever to shift into the little ring and dropped her chain. She was forced to stop. Although her mechanic was able to get the chain back on — and Armstrong went on to win the race, her first of two world titles — no one on her team wanted to see that happen again, including her then-boyfriend, Joe Savola. “I did the typical male chauvinistic thing; I lectured her and told  her that she needed to learn how to shift her bike,” said Savola, who married Armstrong in 2007. “That’s the old school way,  right? You need to have your bike set up right, and you need to learn how to  shift. Well, that’s sorta true. But with a TT bike, you have short chainstays, extreme angles, and with the great drivetrains out these days, you  can run big/big now.” Fast forward to 2008, when Armstrong and her support crew were preparing for the Olympic Games in Beijing, China. One of her mechanics, Nick Legan, remembers the chronology of events as they went over for some test runs. “At the Beijing road test event, we started  discussing how to prevent chain drop for TT bikes,” Legan said. “The course had a long  downhill before a sharp right hander that went quickly uphill. That front  shift, to the small ring, was really important. If you dropped a chain, and  some riders did at the Olympics, you were immediately out of contention.” Back in Boise, just a few weeks before the Olympics, Savola started scrambling. “I ordered a couple of Deda Dog Fangs, the Third Eye style mounts,” he said. “But to attach something like this to an oval tube, like on Kristin’s Cervélo P3, you can’t use the round clamp that comes with them. So I was  cutting off the clamps, and epoxying them to the frame. They would work for a couple  of hits, then it would come off.” Two weeks before leaving for the Beijing Olympics, Savola decided they  needed the device to come off the braze-on mount for the derailleur. “I’m searching the internet for anything  that exists, and I couldn’t find anything. A friend of mine who is now my partner, Eric Jensen, owns ACE Co Precision Manufacturing. Two weeks before Kristin left, we were at party. Over a beer and a hamburger, I ask Eric if he can build something.  He’s a cyclist, and he got it immediately.” Two days later, Jensen had a plastic prototype. Soon there were aluminium prototypes that Armstrong started testing. For the Olympics, Armstrong had two road bikes and two time trial bikes. Jensen made a dozen chain catchers, each tuned to a particular bike. They were anodized gold. In China, Legan was impressed. “It was awesome. Really well executed,” he said. “On the  first version it attached at the front derailleur and actually braced at the  bottom against the frame. We filed them to fit perfectly against the down  tube/seat tube area.” Armstrong won gold in Beijing, her first of what would eventually be two Olympic TT titles. Savola (left), Armstrong and Jensen were originally looking for a solution, not a business The next year, Legan was a mechanic for Slipstream Sports. He called Savola. “I ordered the first batch of K-Edges specifically  for Paris-Roubaix and the spring classics. They worked out really well. Competition for chain catchers at the time wasn’t  stellar, especially if you had a bike without a round seat tube. The only other  chain catchers I had seen were handmade by a Spanish mechanic. But he wasn’t  interested in selling them. Joe  used the team as a test bed and I fed him feedback. Eventually we got other  teams on board, High-Road for one. It’s a good product that performs as  promised, in the right hands.” Soon, Savola realized that there could be a business in all of this, so he, Armstrong and Jensen formed K-Edge. “That was really the start of the commercially  viable chain catcher,” he said. “In hindsight there had been a few people  making things. We didn’t invent them, but we were the first to commercialise  them.” There have been a few publicised cases of a chain catcher negatively affecting a pro racer, such as an incident at Paris-Roubaix years ago when Tom Boonen’s chain popped off, and got stuck under the chain catcher. He wrestled with it by the side of the pavé as the race passed him by, and was ultimately forced to wait for a spare bike from a team car. But these stories are well in the minority. Should they be adjusted perfectly, so that the chain physically cannot fall off the small ring to the inside, then why not use them? This is the conclusion that many pro teams and mechanics have reached. “For team mechanics, it makes sense,” Savola said. “They are the first ones who  get yelled at if a rider drops his chain, even if it was the riders fault. So it  was the team mechanics who first started requesting this.” Now chain catchers from many brands are a common sight Now Rotor, SRAM, Campagnolo, IFIFI and other have derailleur-mount-based chain catchers. (K-Edge has a design patent on the chain catcher, not a utility patent, so the doors are basically wide open for similar products.) A few bike companies are doing their own things, like Trek’s frame-mounted catcher and Canyon’s bottle-cage-mounted option. If these have affected K-Edge’s business, Savola isn’t sure. Computer mounts, like for Garmin Edge units, account for the lion’s share of their business. The new chain catcher piece from K-Edge is the SRM magnet chain catcher. Although co-branded with SRM, it also works with Quarq and other power meters that require a cadence magnet. This design eliminates the need to glue a magnet to the bike frame. Eagle-eyed Tour fans may have also seen K-Edge mounts for the Shimano video cameras being used by a select few Shimano-sponsored riders. And K-Edge is also doing some custom Pioneer mounts for Team Belkin. “We are here because of pro athletes,” Savola said. “Not because we’re  elitist, but because working together on new solutions like this is what we love to do.” The K-Edge SRM magnet chain catcher eliminates the need for mechanics to glue magnets onto frames Contributor Ben Delaney is a journalist with more than two decades of experience writing for and editing some of the biggest publications in cycling. Having studied journalism at the University of New Mexico, Ben has worked for Bicycle Retailer & Industry News, VeloNews and BikeRadar. He has also previously worked as Global Brand Communications Manager for Specialized. Ben covers all things road and gravel, and can be found logging big miles in the Rocky Mountains that nestle alongside his home in Boulder, Colorado. He has covered the most important bike races in the sport, from the Tour de France and Tour of Flanders, to the Unbound gravel race, and specialises in tech content, showcasing what the pros are riding and putting everyday equipment through its paces. Get Ritchley Comp Skyline Saddle when you subscribe to Cycling Plus magazine today. Plus, save 33% off the subscription price. Subscribe to MBUK and get a pair of Nukeproof waterproof socks as your welcome reward! Plus, save 30% off the shop price! Sign up to receive our newsletter! Thanks! You've been subscribed to our newsletter. Already have an account with us? Sign in to manage your newsletter preferences  Would you like to receive offers, updates and events from BikeRadar and its publisher Our Media Ltd (an Immediate Group Company)? Save 30% + Nukepoof waterproof socks(worth £35) when you subscribe to MBUK magazine Get a Ritchley Comp Skyline Saddle when you subscribe today plus, save 33% off the shop price!  ",
    "datetime": null,
    "url": "https://www.bikeradar.com/features/k-edge-chain-catchers-21-days-of-tour-tech/"
}