{
    "title": "K-pop supergroup BTS must perform military service | CBC News",
    "text": "Hit South Korean boy band BTS will not be given exemption from mandatory military service, the Defence Ministry has said, reaffirming its policy of no exceptions for pop stars. The decision is likely to fuel debate in South Korea, which remains technically at war with North Korea, about whether entertainers and athletes should have to do their full military service, of about 18 months, when they might be at the peak of their careers. \"Exempting pop culture artists from military service even though they have made a contribution to the country's reputation is not in line with the government's stance to uphold justice and fairness,\" the ministry said in announcing its decision on Thursday. The seven-strong BTS has spearheaded a wave of Korean pop, crowning their success with three No. 1 albums on the Billboard chart in less than a year, a 2019 Grammy nomination and concerts from New York to Saudi Arabia. Fans of the group have been trying for months to petition the government to extend exemptions to pop groups, but this recent decision has dashed those hopes. The band's oldest member, Kim Seok-jin, turns 27 in December, meaning he will have to register for his mandatory service in the near future. None of the band members, who range in age from 22 to 26, were available for comment on Friday. Korean men who turn 18 become eligible for a physical examination by the Military Manpower Administration, which can then lead to service. Women do not have to do military service. Authorities occasionally grants exemptions, for instance to athletes, but only if they have won gold medals at the Asian Games, or any medal at the Olympics. Also, classical musicians who have received awards at recognized international competition can skip their military service. Last year, Son Heung-min, who plays for the English Premier League side Tottenham Hotspur, was given an exemption but only after he helped the South Korean national team win gold at the Asian Games. The Defence Ministry said fewer than 45 people are exempt from service every year. South Korea has nearly 600,000 soldiers, most of them conscripted. Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636 It is a priority for CBC to create products that are accessible to all in Canada including people with visual, hearing, motor and cognitive challenges. Closed Captioning and Described Video is available for many CBC shows offered on CBC Gem.  ",
    "datetime": null,
    "url": "https://www.cbc.ca/news/entertainment/bts-must-perform-military-service-1.5369299"
}