{
    "title": "K-Pop fans brave Seoul's Christmas chill to buy BTS 'merch' | Reuters",
    "text": "Discover Thomson Reuters By Reuters Staff 3 Min Read SEOUL (Reuters) - In the early hours of a freezing Christmas Eve, 62-year-old Lee Myeong-sook queues up in Seoul’s ritzy Gangnam area for a chance to buy a t-shirt, or maybe even a toothbrush, branded with the logo of K-Pop boyband BTS. The rest of the district is all but deserted, but a huge line of fans of all ages and nationalities is building up around her outside the pop-up shop “House of BTS”, dedicated to the seven-piece behind “Boy With Luv” and other hits. K-Pop management agencies, including BTS’ Big Hit Entertainment, have been expanding their retail operations to capitalize on a merchandising boom - this is the band’s first outlet in Seoul with others popping up as far afield as Mexico. “I want to buy some cushions, dolls, badges, things like that today, and notebooks to give to my friends,” said Lee, who waited in line with her 35-year-old daughter. Branded jackets sell for 299,000 won ($257) alongside socks, sleep masks and other merchandise linked to the band which has spearheaded a wave of Korean pop music and become the first group since the Beatles to have three number one albums in the United States in less than a year. Analysts say demand for the gear is growing as the popularity of K-Pop bands spreads beyond the domestic market across other parts of Asia and into the West. Japanese fans outside the store told Reuters they had flown in because the Gangnam store “had more stuff” than the three BTS stores in their own country. About 1,500 fans or more visited the store during a single day last week. “I’m hoping to buy whatever I can,” said Rebecca Mould, 25, originally from the U.S. city of Boston, a BTS fan for about two years on her first visit to the store. “I already have a lot, so whatever else there is...” Big Hit - an unlisted company with investments from South Korea’s STIC Investments and China’s Legend Capital - has launched an app called Weply to sell “merch” to fans worldwide. It has also partnered with Line Friends, an affiliate of South Korea’s top internet firm Naver, to sell goods linked to the “BT21” animated characters designed by members of BTS. “The constant derivation of new products seem to contribute a lot (to sales),” said Han Sang-woung, analyst at Eugene Investment Co Ltd, who estimated agencies’ merchandise profit margins at around 20%. ($1 = 1,163.3600 won) Reporting by Joyce Lee and Hyunjoo Jin; Editing by Andrew Heavens Our Standards: The Thomson Reuters Trust Principles. All quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays. ",
    "datetime": null,
    "url": "https://www.reuters.com/article/us-christmas-season-kpop-bts-idUSKBN1YS0MM"
}