{
    "title": "K-Pop Is So Strict, It Fired Two Stars For Dating Each Other",
    "text": "By \n\n\tAmy X. Wang As the K-pop phenomenon — also known as the Korean Wave or hallyu — sweeps the globe at a unprecedented pace, there’s greater interest among new audiences in how exacting and meticulous the industry can be with its musicians. One illustrative case of that is the firing this week of two stars who breached a tacit rule about romantic relationships. HyunA and E’Dawn, two K-pop stars managed by Cube Entertainment, one of the South Korean entertainment companies that oversees the entire K-pop scene, revealed last month during a promotion of a joint new album that they have been dating for two years. Their promotion tour was quickly cut short and E’Dawn went on hiatus from his boy band Pentagon. On Thursday, Cube — which has denied any relationship between the couple whenever past rumors emerged — announced in a statement that “when we manage artists, we consider mutual trust and faith our top priority” and as a result, “we decided the trust is broken beyond repair, so we are expelling the two from our company.”  What may seem like extreme micromanagement to uninitiated music fans is actually par for the course in the K-pop scene. Because South Korea’s entertainment companies carefully design every aspect of their artists’ lives from their performances to their public personalities, unplanned romantic relationships are seen as off-course detriments to a group or star’s appeal. Some K-pop stars are required to sign contracts against dating anyone that their agencies deem inappropriate, or dating anyone at all. And there is some truth to the companies’ worries about artists stepping out of their image blueprints: Extreme fans sometimes feel invested enough in stars’ personal relationships so as to issue death threats. Such intense fan devotion is in a part a reflection of how committed most K-pop stars are themselves. “K-pop is not just music, but a total performance, a cultural movement and lifestyle turned into a seductive spectacle,” Suk-Young Kim, a UCLA critical studies professor who has written a book on the genre’s broadening appeal outside of Asia, tells Rolling Stone. She adds that K-pop idols’ “spectacular visual presentation” both on and off the stage, which requires a level of unerring rigor that is not seen in Western artists, is a big reason it’s become so fascinating for American fans. The case of HyunA and E’Dawn also highlights another major facet of K-pop, though: the collective power of its unceasing fan base. On Thursday, thousands of K-pop fans protested the two stars’ firing on social media — and the backlash was so swift and fierce that hours after its first announcement, Cube came out with another statement saying that the situation is not yet final. “We’re discussing the issue, but it’s not confirmed,” CEO Shin Dae-nam said. “We’ll have a board meeting next week to discuss the issue.” We want to hear it. Send us a tip using our anonymous form. Rolling Stone is a part of Penske Media Corporation. © 2023 Rolling Stone, LLC. All rights reserved. ",
    "datetime": "2018-09-14T17:52:31+00:00",
    "url": "https://www.rollingstone.com/music/music-news/k-pop-hyuna-edawn-dating-724284/"
}