{
    "title": "K-pop star reveals loneliness in suicide note",
    "text": "A top K-pop star wrote in a suicide note that he was \"broken from inside\" and \"engulfed\" by depression, it emerged Tuesday as his death sent shockwaves among fans worldwide. Kim Jong-Hyun, 27-year-old lead singer of the hugely popular K-pop boyband SHINee, was found in a hotel room in the South Korean capital Seoul in what police said was suicide. A coal briquette was burning on a frying pan -- a common method of self-killing in South Korea, an ultra-competitive society with one of the world's highest suicide rates. Kim's close friend, musician Nain9, released a suicide note on her Instagram account, saying he had asked her to publish the message in the event of his death. \"I am broken from inside. The depression that gnawed on me slowly has finally engulfed me entirely,\" it said, adding he \"couldn't defeat it anymore\". \"I was so alone,\" he went on. \"The act of ending is difficult. I've lived until now because of that difficulty.\" \"Please tell me I did a good job,\" he implored, ending the note with: \"You've worked hard. You've really gone through a lot. Goodbye.\" - Number Ones - The five-member SHINee debuted in 2008 and went on to lead the \"Korean Wave\" that saw South Korean pop culture develop a fan base across Asia and beyond. Known for peppy songs and carefully-choreographed dance numbers performed with military precision, SHINee have become one of the world's best-known K-pop acts. The band have released five albums that swept charts at home and abroad, with some of them reaching Number 1 on the US Billboard World Albums chart. Kim was seen as a model K-pop celebrity, who boasted flawless singing and dancing skills and rarely made headlines with the romantic relationships, drink-driving or drug use that derailed the careers of many other artists. He released his first solo album in 2015, topping the Billboard World Albums chart, and performed at solo concerts in Seoul only last week. K-pop stars undergo cut-throat competition and gruelling years-long training at the hands of their agents, who dictate everything from music style to diet and even mobile phone use. Many are also under pressure to maintain a squeaky-clean and wholesome image at all times. A master's thesis by a prominent Seoul actress in 2009 said that 40 percent of actors or actresses had considered suicide at least once due to a lack of privacy, online bullying or unstable incomes. Hundreds of Kim's tearful fans paid their respects at a mourning altar in the Seoul hospital where his body lay. \"I came here to say the last farewell... since we fans apparently couldn't be there for him when he needed help most,\" said Jung Min-Kyung, 19. \"I think our country has very high expectations of celebrities,\" she added. - 'Last farewell' - Social media was flooded by thousands of messages of mourning, and in the hours after his death it was the top trending topic on China's Twitter-like Weibo, with more than 140 million views. \"I really can’t believe that you’re gone,\" wrote one poster. \"Wish you can rest in peace in heaven, be an ordinary person in your next life and smile happily.\" China is a major K-pop market and songs written or performed by Kim packed the Korean top 10 charts on Xiami.com, one of the country's most popular music websites. In the Chilean capital Santiago, photos showed throngs of fans sobbing near a makeshift memorial outside the Korean embassy. Many other K-pop stars in the stable of SHINee's agents SM Entertainment -- which dominates K-pop -- cancelled public appearances to visit the mourning altar in Seoul. Kim's funeral would be held on Thursday, the firm said in a statement, adding: \"Other members of SHINee as well as other artists at our company are all mourning his death amid deep sorrow and shock.\" Seoul police said it seemed \"certain\" that Kim's death was a suicide and they planned to close the case without an autopsy as requested by his family. He was pronounced dead shortly after being moved to a hospital. Authorities were alerted by his sister, after he sent her text messages reading: \"This is my last farewell\" and \"Please let me go and say I did a good job.\" The Princess of Wales attended Lady Rose Windsor and George Gilman's wedding in 2008 without boyfriend Prince William in a mini wedding guest dress – throwback photos. In \"The Woman in Me,\" Britney Spears says she heard a different message when Justin Timberlake talked about their sex life back in 2002. 有安信，一定快！「CASH快線」小額貸款，一Click即批即過數！送高達$12000現金獎！ Israel demanded the resignation of the UN secretary-general on Tuesday over “shocking” comments in which he suggested that the Oct 7 attack was provoked by the “suffocating occupation” of the Palestinian territories. The Premier League has recommended that Everton face a 12-point deduction in its case against them for breaching profit and sustainability rules, the Telegraph has learnt. Chong Un Kim, 26, immigrated to the US in 1981 and her remains were found in a dumpster on Valentine’s Day 1988 保證內部回報率3.02-3.3% A woman whose confrontation with the police at a hospital went viral on TikTok has been sentenced to five weeks and five days in jail, coupled with a $600 fine. The 32-year-old is living in Florida, where he moved earlier this year after he was successfully sued for defamation in Israel The company — and other retailers — made a commitment in 2018, but backtracked soon after. 開立Preferred Banking戶口，獎賞總值高達HK$5,650 全新啟用Money Master可享三重獎賞！ Jesus Ayala, 18, and Jzamir Keys, 16, have been charged with murder over hit-and-run incident that killed Andreas Probst A Lebanese front is unlikely: it wouldn’t be in Iran’s interests, as it would probably spark US intervention, says Lina Khatib, director of the Soas Middle East Institute American intelligence officials have explained to their European counterparts why they failed to anticipate Hamas’s assault on Israeli villages, which was reportedly planned on telephone lines in hidden tunnels. 貸款額最高HK$200萬，以領先科技簡化申請流程，只需提交最少3份文件，最快10分鐘完成申請。資金最快即日批核即日過戶。 \"It's hard to fathom that there are people in the world who would target such innocence,\" Hilton wrote on Instagram. Energy company Lukoil last year took a public stand over Moscow’s invasion of Ukraine China has replaced Defense Minister Gen. Li Shangfu, who has been out of public view for almost two months, state media reported Tuesday.  Li is the second senior Chinese official to disappear this year, following former Foreign Minister Qin Gang, who was removed from office in July with no explanation offered.  Li, who became defense minister during a Cabinet reshuffle in March, hasn’t been seen since giving a speech on Aug. 29. Discover the ins and outs of the HKU part-time MBA through our info session. Engage with our alumni and learn from their personal journeys. Liverpool boss waxes lyrical about striker ahead of Toulouse encounter \"Can’t read and won’t follow the rules.\" Hamas is believed to have weaponised thousands of commercial drones with the help of Iran This Is Me...Now: Limited edition created by Jennifer Lopez What would you do if your child turned into a bridezilla? In 2020, 350 elephants mysteriously died in Botswana, with a further 35 dying in similar circumstances in Zimbabwe. Now scientists think they may have found the reason why Russian generals are throwing their troops forward in their assault on the eastern town of Avdiivka despite suffering heavy losses, Ukraine has claimed. ",
    "datetime": null,
    "url": "https://sg.news.yahoo.com/k-pop-star-bemoans-loneliness-suicide-note-043016343.html"
}