{
    "title": "K-pop’s “Next Level”: Notes from the Field | FSI",
    "text": "Stanford University Stanford’s Korea Program will celebrate twenty years since its founding with a two-day conference on May 19-20. The conference will focus on two broad issues that continue to confound and intrigue scholars: North Korea and the South Korean pop culture wave. Esteemed guests from around the world will gather to share thoughts on these two issues. While the Korea Program is used to visits by such dignitaries as Ban Ki-moon, a public appearance by Soo-Man Lee, founder and chief producer of SM Entertainment, is far rarer. While he invented the kiheoksa system — the all-under-one-roof company that shepherds young talent from anonymity to global stardom — Mr. Lee is more reticent, preferring that his stars speak to the power of his brand through their performances. So, when I received an invitation to interview him in his office as part of a K-pop documentary that will accompany the Stanford conference, I dropped everything and got on a plane to Seoul. In the last two weeks, I received far more than I bargained for. Mr. Lee opened his doors to our camera crew of three, and gave us access to himself, as well as to artists such as EXO’s leader Suho (who will be on campus for the May conference); NCT’s Mark, Johnny, and Jaehyun; and aespa (who just returned from a wildly successful appearance at Coachella). We toured recording studios and dance spaces and were given an opportunity, nearly unheard of, to enter the “Chamber of Secrets” of SM to see the sinipsaeng, K-pop megastars-in-training. These trainees are the chosen few who survived countless rounds of cutting and selection, and who have made it to the top by virtue of talent and sheer grit. In addition, we interviewed executives and creative culture technology entrepreneurs who are working at the cutting edge of the next level of Korean pop culture: the metaverse. The preliminary results of our fieldwork will be aired during the two-day conference, where Suho will speak on a panel and Mr. Lee will give a speech discussing future visions for K-pop. Audience members not able to attend in person (seating is extremely limited) can participate virtually through the streaming service provided by the Korea Program. Tune in to the Shorenstein Asia-Pacific Research Center's YouTube channel for the livestream. General inquiries\n650-723-4581 Learn more about how your support makes a difference or make a gift now © Stanford University, Stanford, California 94305. ",
    "datetime": null,
    "url": "https://fsi.stanford.edu/news/k-pop%E2%80%99s-%E2%80%9Cnext-level%E2%80%9D-notes-field"
}