{
    "title": "K-pop invasion: From a local trend to a global phenomenon, and beyond - Asia News NetworkAsia News Network",
    "text": "K-pop has spread around the world since the early 2000s, starting in the Japanese music market and spreading into East Asian countries until the mid-2010s. Choi Ji-wonThe Korea Herald \n\n\t\t\t\t\t\t\t\tView all posts by Choi Ji-won → The Korea Herald View all posts by Choi Ji-won → K-pop boy band BTS and British band Coldplay perform together during the 49th American Music Awards at the Microsoft Theater in Los Angeles on Nov.22, 2021. (Yonhap) August 15, 2022 SEOUL – In 2012, K-pop took a leap forward in the global music industry. In the summer, Psy set several unprecedented records on music charts and gained international stardom with his megahit “Gangnam Style.” Later on, the word “K-pop” was listed on the Oxford English Dictionary’s vocabulary list as “Korean pop music.” A decade has passed, and K-pop is no longer considered just a regional music genre that temporarily caught the eyes of a global audience. It has firmly set down its roots as a major subcultural genre, and is gaining prominence on the international scene as a new standard for the industry. This is not only in terms of its artistic value, but also for the surrounding system in which musicians are trained. K-pop has spread around the world since the early 2000s, starting with its domination of the Japanese music market –- which was then and still is now the world’s second-largest music market. It then spread out into East Asian countries until the mid-2010s. One of the key factors defining K-pop music and one that continues to show the genre’s potential for growth is its sensitivity to the changing environment and receptivity to new sources. “K-pop idol music has its roots in the early ‘gayo’ songs (a Korean term for popular music that people listen and sing along to). Its key distinction was the unique melodies formed through the melding of various global music trends, such as Western pop and J-pop, into an original yet contemporary sound,” pop music critic Jung Min-jae told The Korea Herald. Band Seo Taiji and Boys, which is considered to have set the foundation for the current K-pop music industry, debuted in 1992 with a completely new sound — mingling genres of hip-hop, R&B and dance pop. Hip-hop trio Seo Taiji and Boys (SeoTaiji Company)  Beyond sound, K-pop industry also showed exceptional vigilance in adapting and making use of technological advancements to develop a highly lucrative business model. In 2009, JYP Entertainment’s first attempt to go all-out on making a breakthrough in the US mainstream music market failed. But below the surface, K-pop was already extending its reach beyond Asian countries into Europe and even parts of the US through the internet. Such media-friendliness is an innate trait of K-pop that has made the genre global, according to pop music critic Kim Do-heon. “K-pop was fast to adapt to the evolution of digital technology and actively promoted music with a variety of self-produced video content, thereby expanding its fanbase in the global market,” said Kim. Gradually, K-pop gained recognition from the world as its own genre. The first K-pop concert in Europe, SM Entertainment’s 2011 “SM Town World Tour in Paris,” attracted some 14,000 fans during two days of sold-out shows. In 2012, Psy sent the world on a “Gangnam Style” craze, setting unanticipated records in global music charts and rankings. Over the past decade, K-pop has evolved and expanded in a different aspect. With the sensational boy band BTS at the lead, K-pop overcame the seemingly unbreakable walls of the mainstream American music industry. The septet made history and paved the path for fellow K-pop musicians in the US. It’s without a doubt that K-pop is one of the biggest alternative music genres in the mainstream market, and experts point out that the next step for K-pop in its globalization is to seek sustainability. The key to this, ironically, is for K-pop to lose its “Korean-ness,” according to critic Kim. “K-pop is not just a music genre, but the whole production system in which idol musicians and their music are carefully planned out and released into the market. This is something that can be adapted to any part of the world. It’s now meaningless to talk about how K-pop could be used as a means to spread Korean culture and is at a stage to discuss how the genre and the system can be applied to the unique environments of different regions,” Kim said.  “Gangnamg Style” hitmaker, singer-producer Psy (Herald DB)  In recent years, K-pop labels have increasingly conducted global auditions, in which they seek out trainees regardless of their racial and ethnic backgrounds. Many major K-pop labels, including SM Entertainment, Hybe and CJ Entertainment, have each announced plans to train and debut groups in the US this year. While past multinational acts have continued to be based in Korea and used Korean as their main language, these groups will be trained in the US to debut as a global group, according to related statements made by the companies. While the K-pop system is an established business model in itself, there is still room for improvement, with the issue of its openness to different cultures as the start. “The key to K-pop’s success was its ability to mix and mingle to form a new harmony. However, issues of cultural appropriation and exclusiveness persist even now. We’re already witnessing K-pop’s influence as a form of soft power that can bring together people of different backgrounds. To make K-pop a truly global music genre, it needs to become more accepting and understanding of other cultures. Hence, the less Korean K-pop becomes, the more successful it will be in settling into the global landscape,” said Lee Gyu-tag, a cultural studies professor at George Mason University Korea. Rather than seeking its way to the top, as K-pop has done in its race for globalization up to now, K-pop’s power may be in its unique ability to spread outward and interweave itself in the transnational environment, according to Lee Hye-jin, a professor of East Asian literature and pop culture at Semyung University. “It’s rare … to present joy to a large fandom through such a short period of time, and K-pop’s true value is that it can provide a shared experience for so many people around the world at the same time,” professor Lee Hye-jin said. This is also the direction in which K-pop must head in order to make a system where artists can prosper as musicians, and not as mere components of the industry.  BTS speaks at the White House to discuss Asian inclusion and representation and address anti-Asian hate crimes and discrimination on May 31. (AP)  Earlier in June, BTS announced a temporary break from group activities to focus on their individual lives and solo careers. In doing so, the members spoke about their mental and physical fatigue from the K-pop system, which “gives no room for people’s growth, and constantly forces us to make music,” as said by the band’s leader RM. While commerciality is an essence of all popular music genres, critic Jung said it is undeniable that K-pop is becoming more and more competitive, especially as groups need to give a maximum quality and quantity of performances within the legally set seven-year term. “These days, idol groups drop around two to three singles or EPs a year, and this is not easy, considering many Western pop musicians or established K-pop groups, such as Blackpink, drop one album every one or two years,” Jung said, adding such an environment allows no time for the artists to mature as musicians. Such a shift in trend at the industrial level is something that all related entities must work toward together. But in the long-term, critic Kim suggested it’s the labels and their training systems that must transform first for there to be fundamental progress. In order to make more room for artists’ creativity, Kim said the training system should not only focus on honing their talents on the stage, but on their maturity as individuals. BTS members, who have continued to push their boundaries as not just musicians but as influential individuals with powerful voices, have set fair precedents for the groups to come, Kim added. “Although there have still been limitations, I believe BTS members have shown a fair example for younger generation idols. They didn’t stop with writing lyrics and composing, but have grown into artists who can spread messages. K-pop now has to carry such messages. There has to be a philosophy, and rather than injecting certain ideas into the trainees, companies must develop a system in which the trainees can develop their own perspectives as individuals.” In commemoration of The Korea Herald’s 69th anniversary on Aug. 15, The Korea Herald has prepared a series of features delving into the phenomenon of Korean-made content influencing global contemporary culture and trends. Is it a one-off occurrence or is it here to stay? Can South Korea claim pride in the works of its creative minds as a nation? The Korea Herald expounds on the past and present of the Korean Wave and its prospects for the future. – Ed.                       ",
    "datetime": "2022-08-14T22:47:15+00:00",
    "url": "https://asianews.network/k-pop-invasion-from-a-local-trend-to-a-global-phenomenon-and-beyond/"
}