{
    "title": "K-pop Festa brings the Korean cultural wave to USC  – Annenberg Media",
    "text": "K-pop Festa’s headliner, Kim Sejeong, laughs and banters with emcee Maru Kim in between songs. (Photo by Michael Chow) After a year of planning, USC hosted the first ever K-pop concert held at an American university last Friday. K-pop Festa brought Hallyu, or the spread of Korean culture, center stage with an all-day event featuring performances by popular soloist Kim Sejeong and rookie boy group Kingdom, as well as an academic forum exploring the global K-pop phenomenon. The event was a collaboration between the Annenberg School of Communication, the East Asian Studies Center, the Korean Cultural Center in Los Angeles (KCCLA), the Korean Ministry of Culture, Sports, and Tourism and Korean Foundation for International Cultural Exchange (KOFICE). The idea to first bring a K-pop concert to campus began with Hye Jin Lee, a clinical assistant communications professor at Annenberg who organized the event. “I just wanted to have an event on campus that not only helps us to think about how K-pop is changing American pop culture in general, but to think about new ways to do music concerts on campus,” she said. Professor Hye Jin Lee gives welcoming remarks at the beginning of the concert, announcing that K-pop Festa is the first ever K-pop concert performed at an American college campus. (Photo by Michael Chow) As a former international student, Lee also wanted to hold a K-pop event to be more inclusive of USC’s international student population, who may not recognize western artists at typical USC concerts. Since K-pop is getting mainstream, she believed it could engage the entire USC community. “K-pop is not limited to international students or Asian American or Korean American diasporas,” Lee said. “It’s gradually more widely accepted, so I wanted to test it out, what it would be like to see K-pop concerts on campus.” That afternoon, USC Annenberg hosted an academic forum featuring a panel of graduate students and Dom Rodriguez, the Senior Vice President of SM Entertainment USA. The panel explored what makes K-pop universally appealing. “It’s everything that happens after the song is released that makes it special,” Rodriguez said. “In K-pop, every song has a journey.” Outside the panel, students and non-USC K-pop fans flocked to McCarthy Quad to line up for the concert early. Some hoped to find a friend so they could sneakily cut in line. Other students skipped classes to get in line at 1 p.m. By sunset, the line snaked around the Center for International and Public Affairs and tailed off midway through Alumni Park. Many fans waiting in McCarthy Quad use KCCLA’s merchandise fans as a way to shield their face from the sun. (Photo by Michael Chow) To Caleb Huang, a senior studying international relations, the length of the line was impressive. “When I started listening to K-pop, it was getting popular, but it still wasn’t as popular as it is today,” he said. “But when I went around the line to see how many people wanted to go in and watch the concert, it feels like here, in 2022, K-pop has come a long way since then.” For fans who didn’t want to wait, there was another way to skip the line: become a volunteer. Katelyn Hsu, a sophomore studying human biology and human development and aging, volunteered for the event after her friend’s professor mentioned the opportunity in class. “I’ve usually gone to K-pop events just to watch them perform,” Hsu said, “so I kind of wanted to see how a big event on this scale was managed.” Hsu’s duties included checking USC students’ QR codes and supervising the ADA seating section to ensure people seated needed accommodations. Before any spectators came inside, she could watch all of the performers warm up, including Sejeong. “It took me a second to recognize it was her warming up,” Hsu said. “I talked to the person next to me and she said, ‘Yeah, that’s Sejeong.’ It was surreal, to say the least.” The program for K-pop Festa’s concert kicked off past 6 p.m. with welcoming introductions from KCCLA and Professor Lee. Then, 12 U.S. finalists for the K-Pop Cover Dance Festival competed for a chance to go to the championships in Seoul. Each finalist was judged by Kingdom, who applauded them for their exceptional performances. Ultimately, the Chicago-based group Prism Kru won first place with their performance of “Maverick” by The Boyz. Chicago-based dance group Prism Kru won the K-pop Dance Cover Festival U.S.A. finals with their cover of “Maverick” by The Boyz. (Photo by Michael Chow) After much anticipation, the members of Kingdom emerged onstage in black and blue Joseon robes. Their set ranged from powerful and up-tempo songs to sentimental ballads, coupled with sharp dance moves and well-trained vocals. The energy of their performance was memorable, even to fans who only heard of them recently. “It was really cool to see Kingdom! I was excited to see their historical costumes, and their choreography was on point. Their movements and expressions were so powerful,” Hsu said. Members of Kingdom leap synchronously, demonstrating their sharp choreography. The boy group performed “Ascension,” “Eternity,” “Black Crown,” “The Song of Dann (Promise)” and “Blinder.” (Photo by Michael Chow) After Kingdom’s performance ended with “Blinder,” the anticipation in the crowd buzzed again. Students in the front row started chanting: “Kim Sejeong! Kim Sejeong!” Then, against a backdrop of a field of pink flowers, Sejeong emerged onstage to the crowd cheering. Rather than opening energetically, Sejeong sang a sweet rendition of “Flower Way.” Because she had been acting in K-dramas like “Uncanny Counter” and “Business Proposal” back-to-back, it had been months since Sejeong was last seen singing onstage. But for Huang, who has followed Sejeong since she was part of girl group I.O.I., it was as if she never took a break from singing. “I’m so used to seeing her on screens, like in music videos and on TV shows,” Huang said. “But seeing her sing in person was surreal, like I can’t believe I’m seeing her so up close.” Kim Sejeong sings “Love, Maybe” from the soundtrack of her drama, “Business Proposal.” She also sang “Flower Way,” “Skyline” and “Let’s Go Home.” (Photo by Chloe Chen) As Sejeong sang her versatile set of songs, her fans swayed and sang loudly along to the music, waving their flashlights and merchandise fans. Throughout the concert, Kingdom and Sejeong interacted with fans’ heart gestures and shouting. The emcee even encouraged them to say “fight on!” to the crowd. That moment was memorable for Hsu. “The idols obviously always can’t talk to everyone [in English],” she said, “so I think that was nice of them to try and be inclusive by acknowledging everyone as a USC Trojan.” Kim Sejeong and the K-pop Festa emcee enthusiastically throw up victory signs and tell the audience, “Fight On!” (Photo by Chloe Chen) These moments of genuine interactions between fans and artists are what makes K-pop so special. “K-pop Festa was definitely successful in showing the uniqueness of K-pop and the culture of fan and idol interactions in the K-pop fandom,” Huang said. Videos and pictures of these interactions were uploaded to Twitter and Instagram under trending phrases like “Kim Sejeong USC” and “Kingdom USC” that weekend. These posts helped Lee realize K-pop Festa’s impact. “The excitement from students and TikTok comments who were jealous that we were able to do it just got me like, ‘Wow, we were able to do something very meaningful,’” she said. Fans hold up signs, phones, cameras and light sticks to show their support for both Sejeong and Kingdom. (Photo by Michael Chow) In a time where anti-Asian hate crimes persist, Lee wanted to highlight the uniqueness of K-pop communities and celebrate Asian-ness. “K-pop is truly global in the sense that it involves labor from so many countries, but it’s also a cultural product from Korea and Asia,” she said. “This event was really for the students, especially for the ones…whose interest and whose culture have been ignored.” At the end of the night, illuminated by multicolored lights, Sejeong performed “Let’s Go Home” as a celebratory farewell to the crowd. Despite the upbeat encore, the farewell felt bittersweet to the fans. But unlike Sejeong, K-pop Festa itself has yet to go home. “I’m planning to do something again next year, but only if I get help,” Lee said. “We got to do this again, especially for prospective students going to USC.” 1 2 3 4 5 About Annenberg Media\n\n • \n\nContact Us • Get Involved uscannenbergmedia.com © 2023 USC Annenberg Media uscannenbergmedia.com © 2023 USC Annenberg Media ",
    "datetime": null,
    "url": "https://www.uscannenbergmedia.com/2022/09/30/k-pop-festa-brings-the-korean-cultural-wave-to-usc/"
}