{
    "title": "K-pop | Riding the Korean Wave - Telegraph India",
    "text": "Many fans will insist that they discovered BTS or Bangtan Sonyeondan at certain vulnerable moments of their life, and it was the emotionally honest and socially conscious lyrics that resonated with them\n                                                                    (Sourced by the correspondent) Throwback to the summer of 2012 and even the most uninitiated in Korean popular music, or K-pop as it has commonly come to be known, will remember it as the time when Gangnam Style ruled YouTube and the pop stage. Although PSY’s EDM infused critique of the upper-class Seoul neighbourhood of Gangnam catapulted K-pop into mainstream imagination, long-term enthusiasts knew that it was only the tip of an iceberg that the world at large was yet to discover. Make no mistake, K-pop has been around for a while. Building a global audience The Korean Wave or ‘Hallyu’ is a collective term used to refer to the global popularity of South Korea’s cultural import that encompasses everything from music to movies, drama to fashion, beauty to cuisine. The Wave, often synonymous with K-pop, began to gather momentum sometime in the late 1990s, with Seo Taiji and The Boyz, and was initially concentrated in east and Southeast Asia. Over the last 10 years, however, it has built a global audience. According to a report published by Korea Creative Content Agency in 2017, the export of K-pop has propelled the South Korean music industry to an estimated $5 billion. Recently, one act — BTS — has contributed a jaw-dropping $4.65 billion to the country’s gross domestic product. South Korea, for all intents and purposes, is the ‘king’ when it comes to the reach of soft power. I have to admit that I was a little late to the party. I was introduced to the genre only in early 2019 by a friend who is a self-proclaimed ‘otaku’ but had just discovered K-pop quite serendipitously. While casually scrolling through YouTube, she came across a striking video thumbnail depicting a few people sitting around a table amid menacing trees and fuchsia sky. She shared the video... soon we were both hooked. Heize is one of the most popular stars of K-pop\n                                                            (Sourced by the correspondent) One of the first questions that people ask a non-Korean speaking K-pop fan is, ‘How do you know what they are saying?’ Most don’t and for several reasons it doesn’t quite matter. Global fans have taken a leaf out of old-school silent cinema and experience the genre, initially at least, as a visual treat. Take a look, for example, at DPR Live’s Jasmine or We Don’t Talk Together by Heize. Intensely saturated and high- contrast frames are the backbone of the music videos and Dream Perfect Regime’s founder, Korean-Australian, Christian Yu — a former star in his own right — is a filmmaker/cinematographer to look out for. There is plenty for fashion buffs as well. Before Ariana Grande sported a monstrous ponytail for 7 Rings, Big Bang’s G-Dragon — aka the King of K-pop -—was seen wearing a 12-foot long shock of side-shaved hair, heavily-kohled eyes and a pinstriped suit for the cyberpunk-influenced music video of Fantastic Baby. The industry has been pushing the boundaries of fashion for a while with its emphasis on androgyny and fluidity. Male performers are often seen sporting chokers, crop tops and heavy eye-makeup and while such transgressions aren’t as common with females, f(x)’s Amber stands out with her feminine-neutral styling. Also, can you imagine a heterosexual male advertise red lipstick? G-Dragon did that back in 2013. Most Korean artistes combine streetwear with luxury that is easy to emulate and feed into the Asian ‘hypebeast’ scene. Not everyone can afford Supreme, Off White, Stussy or Yeezys, but when the basic structure is about oversized clothing, chunky sneakers, bucket hats and sleek accessories, you don’t even have to. Upside & downside Last year was significant for the Korean entertainment industry for a number of reasons. BTS made history by becoming the first act from the country to headline and sell out Wembley Stadium in London and G-Dragon was discharged from the military after completing his mandatory military service. Before Ariana Grande sported a monstrous ponytail for 7 Rings, Big Bang’s G-Dragon — aka the King of K-pop — was seen wearing a 12-foot long shock of side-shaved hair, heavily-kohled eyes and a pinstriped suit for the cyberpunk-influenced music video of ‘Fantastic Baby’\n                                                            (Sourced by the correspondent) But 2019 was also the year that brought out the vices of the industry. In what is considered as one of the biggest scandals in morally conservative South Korea, news broke in March that several Korean celebrities were allegedly involved in sex crimes, which included the distribution of explicit videos of women taken without their consent, prostitution, drug distribution and embezzlement. These revelations shone the spotlight on the pervasive use of spycams and systemic sexual abuse amidst a growing grassroots women’s rights movement, that was rebelling against a narrow definition of South Korean beauty standards. Korean beauty is a multi-billion-dollar industry built on the exploitation of self-worth. A nose job or a double-eyelid surgery is a typical high school graduation gift for a Korean teenager. Recurrent celebrity suicides — Sulli and Goo Hara took their life last year — highlight how pervasive depression is among performers, who often start training in their early teens, and how little industry insiders are willing to do to address it. Production agencies have a chokehold over their clients’ lives dictating everything from what they can eat to whom they can(not) date. BTS ‘luv’ As a conscious consumer it is impossible to deny the exploitation and fans aren’t blind to these problems. But K-pop’s global popularity coincides with a rise in social movements around the world and one act in particular has been sensitive to the needs of the youth. Many fans will insist that they discovered BTS or Bangtan Sonyeondan at certain vulnerable moments of their life, and it was the emotionally honest and socially conscious lyrics that resonated with them. The South Korean septet was laying bare their own struggles with self-love, bullying, and alienation, and was encouraging their dedicated fanbase, ARMY, to join them in their journey of self-acceptance. Artistically too, they were pushing the boundaries by thematically connecting their multiple releases through Hermann Hesse, Carl Jung as well as Greek mythology. Fans are of the opinion that it is important to distinguish K-pop from BTS which has become a genre in itself, occupying a position that neither Korean nor the Western music industry has been able to capture. No other band has a fanbase this extensive cutting across race, age and gender. Thus, while consumers are increasingly looking eastwards, the unresolved question remains whether Korean entertainment industry has broken the American monopoly over pop culture or not. As the BTS members go off to serve their mandatory military service (South Korea is technically still at war with North Korea), how K-pop fares in the meantime will determine the actual South Korean foothold over the entertainment world. Search operations were also underway at eight other flats including the residences of Mallick's former personal assistant, while he was the food minister ",
    "datetime": null,
    "url": "https://www.telegraphindia.com/entertainment/riding-the-korean-wave/cid/1754622"
}