{
    "title": "K-Pop Star Is Top Dream Career for Kids in South Korea – The Hollywood Reporter",
    "text": "Subscribe for full access to The Hollywood Reporter Subscribe for full access to The Hollywood Reporter Pre-teens strive to blow up like PSY - and have more potential than ever to do so - even with notoriously demanding industry training. By \n\n\tJeff Benjamin, Billboard K-pop singer Lee Seung-chul 2 - H 2014 As the Korean wave continues to push into new territory, the life of a K-pop star is more appealing than ever to South Korea’s youth. Reuters reports a recent survey that shows 21 percent of South Korean pre-teens hope to become a K-pop star when they grow up. The profession was the top dream career choice.  Today, the potential pay day for K-pop stardom is bigger than ever. South Korea’s National Tax Service recently revealed that the average annual income for singers rose more than 72 percent since 2010. The increase comes as musicians continue to make further strides in international markets. Reuters adds that the overseas revenues gathered from interest in Korea’s pop culture — led by music and television dramas — nearly doubled in five years time.  But, of course, a potentially huge gain means taking a potentially huge risk. Families spend hundreds for voice and dance lessons to even get their wannabe K-pop star kids first admitted into a Korean label agency like YG Entertainment, the house of PSY and 2NE1, or SM Entertainment where Super Junior and Girls’ Generation call home. Yet despite daily voice, dance, language and other classes — on top of their academic education, if they opt not to drop out of school — there’s no guarantee of an actual debut. Some leave agencies before they ever appear on stage while some wait years; singer G.Soul just released his debut EP after 15 years of training at JYP Entertainment, home to Wonder Girls and 2PM. Still, the possibility of finding fans worldwide is more of a reality than ever for Korean singers. This article first appeared on Billboard.com. Sign up for THR news straight to your inbox every day Sign up for THR news straight to your inbox every day Subscribe for full access to The Hollywood Reporter Send us a tip using our anonymous form. ",
    "datetime": "2015-02-03T03:16:27+00:00",
    "url": "https://www.hollywoodreporter.com/news/general-news/k-pop-star-is-top-769718/"
}