{
    "title": "K-pop star Minzy talks about breaking out after 2NE1   | Philstar.com",
    "text": "MACAU — At a recent press conference held in Studio City Hotel in Macau for Asia League Fest, Korean pop star Gong Minzy, or Minzy to her fans, shared some exciting news about her career and what is keeping her busy after the success of her debut EP called “Minzy Work 01 UNO.” In an exclusive interview with Philstar.com hours before her anticipated comeback in the international stage, this time as a solo artist, Minzy said her new look (wearing an all black sporty chic outfit during the interview) has something to do with her desire to tap into her more feminine and approachable inner self; something she was completely devoid of during her heyday as a member of hip-hop-centric girl group 2NE1. “During my 2NE1 days, I was doing more of hip-hop music with an edgy approach to project the fierce K-pop girl idol persona. Now, I’m doing my own thing, and I’m writing my own songs — and with this, I think I’ve taken a more balanced image as a woman and an artist,” Minzy explained. After eight successful years with her former group, taking a break from the music scene was not exactly on Minzy’s priority. What she did, in fact, stunned everyone in the K-pop fandom, when she released six tracks, including the hit single “Ni Na No,” a collaboration with South Korean-rapper Flowsik, the following year after 2NE1 broke up. Though the separation of one of South Korea’s most influential girl groups left everyone in disbelief, and caused so much heartache, they had it somehow coming as most Korean groups peak at their seventh or eighth year; some stay strong; others just move on. As for Minzy, moving on is not a bad thing. “Going solo was a decision I had to make. It’s about time that I pay attention to what I really want to do as an artist. I wanted to show a new level of growth and maturity, and I can only do that if I have enough creative freedom,” she said. Coming out from her comfort zone has proven to be one of the best decisions she had ever made as “UNO” entered and peaked at number 10 on the Gaon Album Chart last year, followed by the sellout “Flashlight,” which features another top South Korean artist, Jay Park. “Few weeks ago, I was in Manila as one of the performers for UAAP and now I got invited to perform for Asia League Fest along withother amazing and talented Asian artists, and I’m really thankful for that. Being able to perform for such diverse audience will allow me — and other artists — to really showcase the best of Asian talent,\" said Minzy. Philstar.com is one of the most vibrant, opinionated, discerning communities of readers on cyberspace. With your meaningful insights, help shape the stories that can shape the country. Sign up now! ",
    "datetime": null,
    "url": "https://www.philstar.com/entertainment/2018/10/03/1856923/k-pop-star-minzy-talks-about-breaking-out-after-2ne1-"
}