{
    "title": "K-pop fans 'powered up' at KWMF 2019 in Manila | Philstar.com",
    "text": "MANILA, Philippines — SM Mall of Asia Arena was once again filled with screaming fans and dancing lightsticks as it housed this year’s K-pop World Music Festival Sunday night. Five acts were lined up for Sunday’s music festival: Sohee, Kim Donghan, Elris, NCT 127 and Red Velvet. All shared that they were excited to meet Filipino fans—for the first or second time—as they heard that we are among the loudest and cheeriest fans in the world. Comedian and host Ryan Bang led the festival and had the audience—including K-pop fan \"momma\" and megastar Sharon Cuneta—laughing with his spiels and interaction with the K-pop acts. Here are some of the highlights of the festival: Donghan has returned to the country—his first when he was with his former bandmates from JBJ in a fanmeet in 2017—but this time he performed as a solo artist. He opened his set with “Sunset” and followed it with an equally fiery performance of “Goodnight Kiss.” He told Ryan that he likes fruits and enjoyed what the Philippines, a tropical country, has to offer. He would also want to swim in Philippine beaches.  Girl group ELRIS charmed the crowd with their bubbly tracks “Summer Dream,” “We, First” and “Pow Pow” during the group’s first visit in Manila. Leader Bella was unable to perform with the rest of the group due to an injury. But the setback did not stop members Hyeseong, Yukyung, Sohee and Karin from showcasing their sweet vocals and cutesy choreography to Filipino BLRIS. ELRIS, who debuted in June 2017 under Hunus Entertainment, asked their fans to support them in their future endeavors. ELRIS’ Sohee opened the night with her performance of “Mannequin” and “Spotlight.” The K-Pop Star 6 second placer capped off her stage performance with “Hurry Up” and her rendition of Gain’s “Bloom.”     NCT 127 was quick to heat up the KWMF stage with their heavy hip-hop, EDM-based debut track, “Firetruck.” The Seoul-based unit of NCT—known for their experimental style—proved they are one of the K-pop acts to watch out for with the strangely addictive “Cherry Bomb.” Chants of “I’m the biggest hit, I’m the biggest hit on the stage” and “If you’re happy and you know it clap your hands” filled the MOA Arena as NCT 127 performed their most popular single to date. Members Taeyong, Taeil, Johnny, Doyoung, Yuta, Jaehyun, Jungwoo, Mark and Haechan also delighted NCTzens—which included the Megastar and her daughter Miel—with their performance of the trap and Latin hybrid track, “Regular.” They capped off their second visit to Manila with their most recent releases: “Simon Says” and “Superhuman.” NCT 127 said they are overwhelmed with the amount of support they are receiving from Filipino NCTzens. The rising boy group has been gradually making their mark abroad, particularly in the stateside.  Girl group Red Velvet, the last act in the music festival, drew in the loudest cheers from fanboys and fangirls alike in SM MOA Arena as they opened their set with their 2017 summer hit “Red Flavor.” The arena danced with them with their second song “Power Up,” complete with three fangirls donning banana costumes while they sang along with the five-piece's “ba-banana-ba-ba-banana-bana-ba.” During a short question and answer with Ryan, leader Irene of Bae Joo-Hyun teased Filipino fans of a possible solo concert. Red Velvet also treated ReVeluv to a soulful live performance of “Moonlight Melody,” which they followed with the crowd favorite “Bad Boy.” Red Velvet ended their set and the music festival with their recent hit Really Really Bad Boy.  KWMF 2019 was organized by DNM Entertainment and All Access Production. Philstar.com is one of the most vibrant, opinionated, discerning communities of readers on cyberspace. With your meaningful insights, help shape the stories that can shape the country. Sign up now! ",
    "datetime": null,
    "url": "https://www.philstar.com/entertainment/korean-wave/2019/06/10/1925303/k-pop-fans-powered-up-kwmf-2019-manila"
}