{
    "title": "K-pop eyes 'next wave' of success in U.S. music industry",
    "text": " Profile Sections tv Featured More From NBC Follow NBC News A man arrested in the killing of a Baltimore tech entrepreneur was suspected of raping a woman days before and was already under surveillance, police say September 28, 2023, 12:24 PM Michael Gambon, the actor best known for playing Dumbledore in the 'Harry Potter' films, dies at 82 September 28, 2023, 8:02 AM Morning Rundown: Biden impeachment inquiry's first hearing, Powerball jackpot nears $1 billion, and Kansas City's love story with Taylor Swift September 28, 2023, 7:36 AM U.S. soldier Travis King arrives back on American soil after being expelled from North Korea September 28, 2023, 4:04 AM Remains found in Colorado are identified as Suzanne Morphew, a mom who disappeared in 2020 September 27, 2023, 5:54 PM The mother of a man suspected of killing a Baltimore tech CEO urged him to surrender, fearing police would try to kill him September 27, 2023, 2:37 PM Selling out more than a dozen concerts in North American arenas used to be something Korean artists only dreamed of, but nearly a year after becoming the first K-pop group to win a Billboard Music Award, boy band BTS has sold out 14 Canada and U.S. dates on its upcoming international tour. The septet are also scheduled to perform at the Billboard Music Awards on May 20 just two days after they released their third Korean-language album, “Love Yourself: Tear.” The world tour is scheduled to kick off in August in Seoul. The North American portion in the fall includes nine more shows than the boy band’s 2017 North American leg and is scheduled to follow a summer concert season that sees well over 20 K-pop acts planning to perform Stateside between concert tours and events like KCON. BTS is just one of an increasingly growing new wave of K-pop-affiliated musical acts attempting to break into the U.S. mainstream. Atlanta-born Eric Nam is one of the artists heading to the U.S. from Seoul. After college, the now 29-year-old left the States to compete on a South Korean talent search show in 2011. He has since carved out a niche as a bilingual musician and television personality. He’ll return to the U.S. this summer for his most-expansive North American K-pop concert tour ever, with 16 shows in 15 cities. Previously working with Gallant and Timbaland, Nam has straddled the Korean and American music scenes for a few years. But with his latest album “Honestly,” he has begun to explore in detail the differences between the two markets. “I think Korea is so focused on just the charts, and what’s going to chart and what’s not, and I’m sure it’s like that way in the States as well, to a certain degree,” Nam said. “But I enjoy working in the States a little bit more. Because it’s more about making music that is the right sound and the right fit to me, not so much just chasing the charts.” Korea’s pop music industry has a long history of trying to break into the U.S. In the late ‘00s and early ‘10s; soloists like BoA, Se7en, and Rain as well as girl groups including Wonder Girls and Girls’ Generation came to the U.S. to try their hands at an American audience. South Korean entertainment company SM Entertainment hosted a label-wide concert in 2011 that sold-out Madison Square Garden. And on an individual level, many of the acts saw limited success but failed to reach the mainstream. BoA, who has released more than a dozen records in various languages, debuted an English-language album in 2009 that broke into the Billboard 200 at No. 127  before falling off the chart the next week. She hasn’t released music aimed at the Stateside market since. Wonder Girls spent an extended amount of time in the U.S., even touring with the Jonas Brothers in 2009. Their English version of “Nobody” made it onto the Billboard Hot 100 in 2009 at No. 76 before also falling off after a week. The group disbanded in 2017. Many of the latest acts looking to crossover have signed with major labels. Kris Wu, who found prominence as part of boy band EXO before leaving in 2014 and has worked in China, appeared in the latest “xXx” film. His 2017 collaboration with Travis Scott hit No. 1 on the U.S. iTunes chart and he signed with Universal Music Group earlier this year. As much as we may be big, we have to be very humble and start from the ground up in the States. Another former boy band member making waves is Pacific Northwest-born Jay Park, who was once part of the boy band 2PM. After becoming one of South Korea’s most prominent hip-hop soloists, he signed with Roc Nation in July 2017. And Jessica Jung, who rose to fame as a member of Girls’ Generation, signed with the United Talent Agency (UTA) earlier this month. “K-Pop is a global genre that has seen massive growth in the U.S. recently,” David Zedeck, global head of music at UTA, said in a statement to NBC News. “From Wonder Girls charting on Billboard, to sold-out arena tours by SMTown, and BTS taking America by storm, we’re seeing the next wave in the evolution of K-Pop.” “Coming out of Girls Generation — one of the most successful K-Pop girl groups of all time — and broadening her exposure in Korean movies, brand campaigns and fashion lines, Jessica has a pre-existing fan base in multiple areas that will elevate the projects we line up for her,” he added. The popularity of K-pop is also enabling artists to pursue the American music industry even if they have not been a mainstay of South Korea’s music scene. In 2009, James Lee joined Royal Pirates, a California-based rock band that gained attention through YouTube covers of K-pop songs. They eventually debuted with their own original music in South Korea in 2013. Two years later, Lee suffered a near-fatal accident and lost the use of his arm, he said. He has since left the Korean music industry and, amid recovery, began a crowdfunding campaign in February to produce a new extended play and music video. In total, Lee has raised more than three times his original goal of $27,600. “Absolutely having a digital platform has allowed Asians to have more of a representation across the board,” Lee said. But even as excitement grows about the possibility of crossover success, Nam, the Atlanta-born musician, said that there should still be a realization that even the most popular acts in South Korea have failed to find the same level of success in the U.S. “We recognize that there have been acts in the past that are Asian or Korean who tried to go, ‘Hey, I’m a huge star in Korea, I’m a huge star in Asia so you guys need to respect me for being a huge star there,’” he said. “But I don’t know. As much as we may be big, we have to be very humble and start from the ground up in the States.” Follow NBC Asian America on Facebook, Twitter, Instagram  and Tumblr. © 2023 NBC UNIVERSAL ",
    "datetime": null,
    "url": "https://www.nbcnews.com/news/asian-america/k-pop-eyes-next-wave-success-u-s-music-industry-n874836"
}