{
    "title": "K-pop wave spills over into research and lifts Korean HE | Times Higher Education (THE)",
    "text": "Resources foracademics and university staff Everything you need for each stepof your study abroad journey The pop culture phenomenon known as Korean Wave, or Hallyu, first popped up in English-language academic study in about 2003. Today, a JSTOR search for the term turns up more than 260 book chapters and journal articles − a testament to the quickly rising popularity of this emerging field. Dal Yong Jin, the author of that initial 2003 study on Hallyu, told Times Higher Education that “Korean popular culture and digital culture have become global phenomena since the late 2000s, and the situation has continued to grow”. Professor Jin, graduate chair of the School of Communication at Simon Fraser University in Canada, said that the Oscar-winning film Parasite and the boy band BTS were among the “sensational achievements” that have “driven more interest in Hallyu studies and Korean studies in general”. “Due to the popularity of K-pop, many students in several academic fields – such as media studies, cultural studies, anthropology, sociology and area studies – want to study K-pop itself or, through it, Korean studies,” he said. The growth of K-pop, which has been a boon for South Korea’s economy, has also spilled over into the higher education sector. Interest in Korean-language study has risen worldwide − at US higher education institutions alone, it increased by 75 per cent from 2013 to 2016, while foreign language enrolments in general dropped 9 per cent, according to a 2019 report by the Modern Language Association. As a consequence, more international students now have the language ability, and the interest, to move to South Korea to study. From 2015 to 2019, the number of foreign students there jumped from 91,000 to 160,000, according to the country’s Ministry of Education. Chang Kim, a research fellow at The Cairns Institute, Australia, and executive director of the Korean Association of Human Resource Development, told THE that most universities in South Korea now offer Korean language courses via affiliated institutions. “In many cases, international students who are interested in Hallyu are enrolled in these language institutions to learn the Korean language and culture – and through the programmes, they are improving their understanding of Hallyu,” he said. Mr Kim said that some Korean universities had attempted to bring in additional income by opening bachelor’s and master’s courses in Hallyu. However, he warned against short-term moves to boost international student numbers. “We need to establish a robust curriculum model with clear educational goals from a mid- to long-term perspective,” he said. CedarBough Saeji, a visiting assistant professor at Indiana University, Bloomington, told THE that “it is impossible to underestimate how important K-pop has become, culturally”. “In online youth-culture spaces, K-pop content has become completely normalised,” Dr Saeji said. “It drives people to study Korean language by themselves while still in middle or high school, to search out communities of Korean speakers (such as a Korean-speaking church), to go on foreign exchange to Korea, to do their undergraduate [degree] in Korea, to major in Korean studies, to pick Korean as their foreign language and much more.” Dr Saeji calls herself a “Koreanist”, a term that Korean studies scholars have been using for decades. However, she says that K-pop studies may still be marginalised at some institutions. “In the West, there are still universities that look at the size of Korea (physically and also the population) and think of it as a ‘less important area of Asia’, so they advocate for hiring people to teach on China and Japan before Korea,” she said. “This is something that countless students are always complaining about online. I wish more university deans in North American universities would realise the popular interest in Korea.” She also emphasises that Hallyu studies are not a light-hearted field only about entertainment. “In fact, I'm teaching how mandatory military service drives the strict gender roles in K-pop,” she says. “My students learn recent history, social norms and how the worldwide music industry has changed due to electronic files and streaming.” In recent years, a darker side of the K-pop industry has emerged owing to “Nth Room”, a sexual abuse scandal, and reports of often punishing regimes for K-pop stars in training. Professor Jin cautioned that Hallyu scholars also had a responsibility to address more serious issues with students. “Due to severe competition and stress, some [K-pop] artists committed suicide,” he said. “Due to soaring interest in Korean culture, these news items, either positive or negative, are immediately received by global fans. Consequently, news media and scholars in Korean studies have to pay attention to these issues from various perspectives.” joyce.lau@timeshighereducation.com Print headline: From K-pop to Korean-language studies: Korean Wave is riding high Why register? Or subscribe for unlimited access to: Already registered or a current subscriber? Login Government policy and universities’ commitment to working with business cited as key factors for success in THE University Impact Rankings table Seoul National University students to contact counterparts at Kim Il Sung University - by fax Soul-searching is required by institutions if they want to survive the alarming decline in student numbers that will leave many classrooms empty, says Jayden Kim As a small fish in a very big pond, New Zealand can ill afford to turn its back on its giant neighbours, academics warn University withdraws Austrian role due to funding deficit but staff say longstanding post was well worth the small investment it entailed While admitting the much-protested model is dead in the US, Dartmouth’s Hanlon leads expert panel in setting out ways that similar language-culture teaching programmes could grow Language Policy Framework seeks to integrate the country’s 11 official languages into higher education Subscribe If you like what you're reading online, why not take advantage of our subscription and get unlimited access to all of Times Higher Education's content? You'll get full access to our website, print and digital editions. ",
    "datetime": "2020-04-13T00:01:00+01:00",
    "url": "https://www.timeshighereducation.com/news/k-pop-wave-spills-over-research-and-lifts-korean-he"
}