{
    "title": "K-Pop Girl Groups of the Past Decade: 10 Best (Critic’s Picks) | Billboard – Billboard",
    "text": "Billboard took a look back at the top Korean girl groups of the past decade for Girl Group Week 2017. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tTamar Herman Since the late ’90s, when the original K-pop girl groups S.E.S, Baby V.O.X and Fin.K.L dominated airwaves, Korea has produced a bevy of talented female acts. Since it’s Girl Group Week here at Billboard, it’s time to take a look back at the teams of women who have had the most impact on the K-pop industry over the past decade. 10. miss A From their unconventional debut single “Bad Girl Good Girl” to the aggressive bubblegum synth of their most recent track “Only You,” miss A has been one of the most forward-thinking K-pop acts. Paying homage to Destiny’s Child with their Independent Women Part III EP and its anthem of a single “I Don’t Need a Man,” this former quartet — Jia left in 2016 and the group hasn’t released anything together since 2015 — is one of of K-pop’s most empowering acts of the decade. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tEmerging Markets, Revenue Streams, Track IDs & Beyoncé: 10 Takeaways From ADE 2023\t\t\n\t\n\n\n\n\t07/12/2017  9. Apink Saccharine and lighthearted, this girl group has played it straight since 2011 and seen immense success because of it. While the Korean music industry saw a surge of more dominating, girl-power-focused female acts in the early 2010s, when Apink was starting out, the act stood out for their breezy pop tracks and innocent style. Though their international presence is less than that of some other acts on this list, Apink remains one of South Korea’s most popular girl groups and has had a softening influence on many newer K-pop groups, with younger acts (Lovelyz, Gfriend, April, etc.) veering toward lighthearted girlishness.  8. 4Minute With rapper HyunA at at its epicenter, 4Minute thrived on brash electropop songs during the first half of their career, before experimenting a bit with their sound later on for some funky hip-hop (“What’s Your Name?,” “Whatcha Doin’ Today?”) and melancholic pop ballads (“Cold Rain”). As their career approached its end, they dropped “Crazy,” one of the most dynamic songs K-pop has seen in the past decade, before ending with the Skrillex-crafted EDM swan song “Hate.”   7. f(x) f(x)’s effervescent brand of electronica and synthpop is both innovative and extremely accessible to non-K-pop fans, with albums like Pink Tape, Red Light and 4 Walls setting this quartet (formerly a fivesome) firmly apart from any other girl group K-pop has seen this decade. Unlike many Korean acts, f(x) has focused on full-length albums rather than EPs and filled them with decadent pop tracks.  6. Kara Back in the day, few acts could compare to Kara. With propulsive beats and layered synths, Kara reigned with hits like “Mister,” “Step” and “Lupin.” The girl group’s legacy rests on being one of the most impactful K-pop acts in Japan; with their addicting songs, Kara dominated Japanese charts and became the first female foreign act to hold a show at the Tokyo Dome. Breaking into the second largest music industry in the world was no small feat, and Kara was considered a leader of the Korean wave’s heyday of the early ’10s.   5. After School and subunit Orange Caramel There are few other acts in Korea who put their all into their performances the way After School did in the first few years of their career. Whether it was transforming into a marching band during promotions for their punchy electropop jam “Bang” or emoting the sorrow of sleek synthpop track “First Love” through interpretive pole dancing, few upped the stakes of K-pop presentation as much as this act. And what After School didn’t do, their quirky subunit Orange Caramel — featuring members Nana, Lizzy, and Raina — did. Becoming human sushi was all in a day’s work for this group, whose ethos rests on being bizarrely cute. Neither After School nor Orange Caramel have released any new music in Korea since 2014, but their impact is still felt.  4. Brown Eyed Girls Though they began in 2006 as a vocal act that hid its faces from the public, Brown Eyed Girls came out from behind the mics and has spent much of the last decade as K-pop’s most innovative musical act. With conceptually driven pop songs that exude power, the quartet — K-pop’s longest-running girl group without any member changes — is always happy to push the envelope a bit. They’ve done everything from promoting free speech in “Sixth Sense” to reveling in female sexuality with “Warm Hole,” but it was their arrogantly sexy 2009 hit “Abracadabra,” a new-wave electropop track, that carved out Brown Eyed Girls’ place in K-pop history.   3. Wonder Girls One of the most resilient groups in the industry before their break-up at the beginning of this year, Wonder Girls dominated South Korea with their modernized retropop sound. Hits like “Tell Me” and “Nobody” were some of K-pop’s first-ever viral successes, and, following a failed attempt at breaking into the U.S. market and some lineup changes, the group’s band-oriented Reboot in 2015 is one of the most impactful and successful rebrandings K-pop has ever seen. It resulted in late-in-career greats, with the synthpop slow burn “I Feel You” and the psychedelic “Why So Lonely” enabling Wonder Girls to end things on an extremely positive note.  2. 2NE1 The “I Am the Best” quartet dominated K-pop with their fierce charisma from day one with first single “Fire” in 2009. 2NE1’s hard-hitting hip-pop styling launched a career that brought the act to astronomical heights, and they paved the way for a more empowered side to K-pop girl groups. Between their pump-up jams and more vulnerable tracks, like “Ugly” and “Lonely,” 2NE1 endeared the singers to K-pop fans around the world. Though they struggled to move forward after peaking and were on hiatus between 2014 and their breakup track early this year, 2NE1’s final album, 2014’s Crush, was the highest-ranked Korean album on the Billboard 200 for two years until it was beaten last October by BTS’ Wings.  1. Girls’ Generation Going strong 10 years into their career, Girls’ Generation are undisputed K-pop royalty. Formerly a nine-member group, the eight women of Girls’ Generation are well into their 20s but still charm South Korea regularly with their tightly produced pop songs and vibrant femininity.  Living up to their name, Taeyeon, Tiffany, Sooyoung, Seohyun, YoonA, Yuri, Hyoyeon, Sunny and former member Jessica Jung shaped a generation of K-pop girl groups when the bubbly “Gee” became Korea’s undisputed hit of 2009. Since then, the Girls have stayed true to their classic sound, coming up with ebullient hook-driven singles (“Hoot,” “Oh,” “Party,” etc.) and redirecting K-pop’s sonic styling with hits like their slinky “Tell Me Your Wish (Genie)” and the legendary genre-blending whirlwind that is “I Got a Boy.” More recently, they’ve tried out a few more dramatic sounds, like EDM on “Catch Me If You Can” and bold brass on “You Think” but still maintained the refreshing attitude that made them Korea’s reigning pop queens. Though they’ve been around for years and members have pursued their own careers on the side — some act, some are solo artists — Girls’ Generation aren’t showing any signs of slowing down: The girl group is planning to drop a special album in August to commemorate their 10th anniversary.  Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2017-07-12T23:27:09+00:00",
    "url": "https://www.billboard.com/music/music-news/best-k-pop-girl-groups-decade-7865168/"
}