{
    "title": "K-Pop India: Get set to groove again in Gangnam Style - Hindustan Times",
    "text": "Subscribe Now! Get features like If you live in Delhi or any other metropolis and are still unaware of the burgeoning popularity of K-Pop in India, you must be living under a rock. The Korean pop culture made its way to India a few years back, mainly through PSY’s Gangnam Style, and is now receiving a shot in the arm with the finale of Changwon K-Pop World Festival India finale in Delhi. It’s here that the fans can witness electrifying performances and a close competition for the title. After gruelling selections throughout India, the finalists of the competition are now in the Capital for the grand finale. Dhwani Datt, an 18-year-old hotel management student from Mumbai, says she’s happy to have found team members who think alike. “I was selected for the grand finale last year, as part of another dance group, but we couldn’t win. This year, I have my own group named Elixir Crew, and the focus for all of us is to win. Getting the first position will be difficult because the competition is tough, but we will not lose hope.” Fans can also look forward to a live performance by the emerging K-Pop boy band, Snuper. The group consists of six boys-over-flowers, who are 22-25 years old, debuted in 2015; and have gained popularity in Korea, Japan and other Asian countries. The organisers are no stranger to the adrenaline rush and maddening fan following associated with K-Pop in India, and have hence invited the First Lady of South Korea, Kim Jung-sook, to the event, too. Kim Kum-Pyoung, director of Korean Cultural Centre, India, says: “The K-wave and K-pop have finally arrived in India after a long time of insignificant presence. We are going to witness the strong and enthusiastic fandom of K-pop in India, which will surprise Korean people as well.” So, if you haven’t heard a Korean pop song or seen a group dance on one, without knowing the Korean language, then head to this event, and witness a contagious energy. Catch It Live What: K-Pop India 2018 Grand Finale Where: Siri Fort Auditorium, August Kranti Marg When: July 9 Timing: 6.30pm Nearest Metro Station: Green Park on Yellow Line Interact with the author at Twitter/@HennaRakheja Henna Rakheja writes on city, art and culture, for the daily Entertainment & Lifestyle supplement, HT City.  ...view detail   ",
    "datetime": "2018-07-09T13:38:09+05:30",
    "url": "https://www.hindustantimes.com/art-and-culture/k-pop-india-get-set-to-groove-again-in-gangnam-style/story-42gCwkYddAaVfuOarx6WRK.html"
}