{
    "title": "K-pop diplomacy: Kim Jong Un 'deeply moved' after South Korean concert",
    "text": " Profile Sections tv Featured More From NBC Follow NBC News A man arrested in the killing of a Baltimore tech entrepreneur was suspected of raping a woman days before and was already under surveillance, police say September 28, 2023, 12:24 PM Michael Gambon, the actor best known for playing Dumbledore in the 'Harry Potter' films, dies at 82 September 28, 2023, 8:02 AM Morning Rundown: Biden impeachment inquiry's first hearing, Powerball jackpot nears $1 billion, and Kansas City's love story with Taylor Swift September 28, 2023, 7:36 AM U.S. soldier Travis King arrives back on American soil after being expelled from North Korea September 28, 2023, 4:04 AM Remains found in Colorado are identified as Suzanne Morphew, a mom who disappeared in 2020 September 27, 2023, 5:54 PM The mother of a man suspected of killing a Baltimore tech CEO urged him to surrender, fearing police would try to kill him September 27, 2023, 2:37 PM North Korean leader Kim Jong Un professed to be \"deeply moved\" after South Korean pop stars performed in his country's capital as part of a significant thaw in inter-Korean relations. \"We should hold culture and art performances frequently,\" Kim told the performers, according to South Korean reporters traveling with the artists. Video and photos from the event showed Kim applauding and waving at the artists, including some K-pop performers. His wife, Ri Sol Ju, and hundreds of other citizens watched the rare performance, sometimes waving in time with the music. After the two-hour performance, the North Koreans gave a thunderous standing ovation. The group of some 160 South Korean artists flew to Pyongyang on Saturday for two performances in the North Korean capital. Sunday's concert entitled \"Spring Is Coming\" was held in the 1,500-seat East Pyongyang Grand Theater, and showcased an elite lineup of performers, including veteran vocalists Cho Yong-pil, rock star Yoon Do-hyun and the popular K-pop girl band Red Velvet. The performance came just weeks before Kim is due to meet with South Korean President Moon Jae-in on April 27, highlighting lessening tensions between the rivals after years of friction over the North's nuclear program. The North Korean concertgoers — most of the men in dark suits but some women in colorful traditional \"hanbok\" dresses — waved their hands from their seats when the South Korean stars sang the popular \"Our wish is unification.\" Kim \"said that he was deeply moved to see our people sincerely acclaiming the performance, deepening the understanding of the popular art of the South side,\" according to KCNA. Images captured by South Korean journalists showed Kim shaking hands with the performers and stopping to pose for a group picture. After the concert, Kim referred specifically to Red Velvet, a K-pop sensation hugely popular in South Korea. \"There had been interest in whether I would come and see Red Velvet. I had initially planned to attend a performance the day after tomorrow but I came here today after adjusting my schedule,\" Kim was quoted as saying. \"I thank you for this kind of gift to Pyongyang's citizens.\" Red Velvet member Seulgi said she cried when North and South Koreans together sang \"Our Wish is Unification.\" Another member, Yeri, said she was \"very\" nervous when she exchanged handshakes with Kim, but added that it was \"an honor\" to do so. Technically in a state of war since a 1953 armistice, the two Koreas are divided between North Korea, officially the Democratic People's Republic of Korea, and South Korea, officially the Republic of Korea. The concerts came after years of U.S.-North Korea tensions, with the North conducting ballistic missile launches and testing a hydrogen bomb last year, and President Donald Trump engaging in fiery rhetoric with Kim. But in a surprise announcement on March 8, South Korean officials announced that Trump would hold talks with Kim. South Korean pop singers performed in the North during a past era of detente, but it was the first time a North Korean leader had attended a South Korean performance in the North's capital. Sunday's performance coincided with the start of annual joint South Korean-U.S. military drills, which have previously been met with denunciations by the North, but which were delayed and shortened this year so as not to overshadow the Olympic detente for the recent Winter Games in PyeongChang, South Korea. © 2023 NBC UNIVERSAL ",
    "datetime": null,
    "url": "https://www.nbcnews.com/news/world/k-pop-diplomacy-kim-jong-un-deeply-moved-after-south-n861936"
}