{
    "title": "K-pop star Koo Hara left 'pessimistic' note: police | Reuters",
    "text": "Discover Thomson Reuters By Hyonhee Shin, Minwoo Park 2 Min Read SEOUL (Reuters) - K-pop singer Koo Hara left a “pessimistic” note, police said on Monday, a day after the former member of top South Korean girl group Kara was found dead. “A handwritten note that was pessimistic about her life was found on a living room table,” Lee Yong-pyo, commissioner of the Seoul Metropolitan Police Agency, told reporters. Fans mourning Koo’s death flocked to her funeral home on Monday, while her colleagues canceled their schedules and relayed condolences. Koo, 28, was discovered at her home in southern Seoul by her maid at around 6 p.m. (0900 GMT) on Sunday, Lee said. Better known as Hara in other parts of Asia, Koo had spoken out against cyber bullying. In June, a month after she was found unconscious at her home and hospitalized, she said on social media that it was difficult to fight depression and vowed to respond sternly to malicious online comment. “It is so sad that she had to suffer from vicious, inhumane comments at such a young age just because she was a celebrity,” 20-year-old student Kim Nam-gun told Reuters, one of about two dozen fans who gathered at the funeral home. Koo debuted with five-member band Kara in 2008. They helped fan the global K-pop wave, building large fan bases in Japan, China and other countries. After her deal with a South Korean management agency was terminated, Koo launched a solo career in Japan and held a concert there this month. Another K-pop star, Sulli, a former member of girl group f(x) and a close friend of Koo’s, was found dead at her home in October. Sulli, 25, whose real name was Choi Jin-ri, had also spoken out about cyber bullying. Reporting by Hyonhee Shin; Additional reporting by Minwoo Park, Youngseo Choi and Sangmi Cha; Editing by Emelia Sithole-Matarise Our Standards: The Thomson Reuters Trust Principles. All quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays. ",
    "datetime": null,
    "url": "https://www.reuters.com/article/us-southkorea-kpop-idUSKBN1XZ0UZ"
}