{
    "title": "K-pop stars Nichkhun and Xander on newer idol groups: Don’t stress yourselves too much | Philstar.com",
    "text": "MANILA, Philippines — Behind impeccably choreographed dance steps, catchy tunes and charming fan services, there are massive expectations placed on idols of the ultra-competitive K-pop industry.  That’s why 2PM’s Nichkhun Horvejkul and former U-Kiss member Alexander Lee Eusebio—both part of the so-called second-generation K-pop—have this to say to younger idols: don’t stress yourselves too much. “The young kids keep getting better and better,” Nichkhun said during the exclusive press conference of tvN’s \"One Night Food Trip\" Friday. The Thai-American celebrity added: “I just want to tell them now this is a very stressful time for them because a lot of [groups] are coming out within a year and just a lot more competition and you know I just hope for the best for them.” Currently, K-pop is dominated by groups such as EXO, BTS and Bigbang despite the group’s hiatus due to South Korea’s mandatory military enlistment policy. Newer groups such as Blackpink, Twice, Seventeen, GOT7, among others are also contributing to one of the country’s major exports. Both Nichkhun and Alexander noted that there was lesser competition during their time. “It would be just us (2PM and U-Kiss), Shinee, 2AM.” Alexander, for his part, advised newer K-pop stars to “stay true to themselves and don’t be mayabang (arrogant).” He added that he is proud of the boy group BTS, who recently performed at the 2018 Billboard Music Awards and bagged the Top Social Artist recognition for two years in a row. 2PM was formed in 2008 under JYP Entertainment. Aside from Nichkhun, the current members are Jun.K, Taecyeon, Wooyoung, Junho and Chansung. U-Kiss, on the other hand, was established by NH Media in 2008. The group is known for their breakthrough hits such as \"Man Man Ha Ni\" and \"Bingeul Bingeul.\" Alexander left the group in 2011 and has since become a solo artist. READ: What should Filipino viewers expect from tvN’s ‘One Night Food Trip’ Philstar.com is one of the most vibrant, opinionated, discerning communities of readers on cyberspace. With your meaningful insights, help shape the stories that can shape the country. Sign up now! ",
    "datetime": null,
    "url": "https://www.philstar.com/entertainment/korean-wave/2018/06/24/1827227/k-pop-stars-nichkhun-and-xander-newer-idol-groups-dont-stress-yourselves-too-much"
}