{
    "title": "K-Pop Idols and Body Image: It Is Time to Cut Artists Some Slack | Billboard – Billboard",
    "text": "Oh My Girl member JinE ended her K-pop career, which included more than five years of training, to deal with an eating disorder. The news brings up some important questions about K-pop idols and… By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin At the end of October, news came out of the K-pop world that JinE, from the eight-member girl group Oh My Girl, was leaving the industry after spending more than a year focusing on treatment for an eating disorder. The reveal arrived at a time when body image, along with physical and mental health, are becoming increasingly discussed topics among artists and fans in the K-pop scene. Explore\t\t\n\t\n\nSee latest videos, charts and news\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tB.A.P\t\t\n\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tBTS\t\t\n\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tOh My Girl\t\t\n\t\t\t\t\t\n\n\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news After nearly five years of training with Korean entertainment agency WM Entertainment, JinE (full name Shin Hyejin) debuted in 2015 as a member of the impressive rookie act Oh My Girl whose sophomore single, “Closer,” was named one of the best K-pop songs of the year by Billboard. While promoting “Closer,” JinE shared an initial diagnosis of anorexia.  The petite, 5’3″ star shared she lost between 17 to 20 pounds as the group dieted together for promotions — a common practice among K-pop groups who want to look their best as they appear on cameras and social media at all hours of the day, but also as a response to Korean society’s expectations for idols to be thin and attractive. JinE shared that she developed vomiting symptoms and esophagitis, and despite needing hospital care, the singer assured fans she was healthy. 2016 brought three more EP releases and increased visibility for Oh My Girl, but the 22-year-old was indefinitely pulled from promoting with the group after her symptoms returned. Then last month, WM and JinE announced she would leave the group and company, with the star expressing gratitude for the support she received but the desire for a different lifestyle.  The conversation about K-pop stars’ body images and weights are being scrutinized more than ever, with strong opinions on both sides. While some argue that K-pop is a visually focused industry and those ideal body standards come with the territory of success, others say that it’s time to end the stigma that performers must have “ideal” bodies and rethink topics like dieting.  A tiny bit of research on the subject shows just how extreme K-pop stars take their bodies. From Nine Muses’ method to only eat what they fit in a small cup to IU’s week-long, 300-calorie daily diet of an apple, sweet potato and protein shake, idols speak about their intense (and dangerously unhealthy) dieting seemingly as a point of additional buzz. Even when the results are concerning, the focus tends to lean toward the visual outcome rather than the star’s health. BTS‘ Jimin became malnourished in an effort to be “one of the better-looking guys.” B.A.P‘s Himchan fractured a rib due to a sudden weight loss. Super Junior’s Shindong spoke about how fitting into skinny jeans was “the epitome of success” for him. The fewer calories one eats, the more applause they get and the more attractive they are to fans, but at what cost?  Even putting aside the obvious and significant health and psychological risks that come with an eating disorder — more significant than any successful album or viral hit — an important conversation comes as to why it’s now an ideal time to finally cut these stars a break. It’s no secret that the K-pop industry yearns to grow past not only South Korea but Asia at large, as the “Korean wave” continues to make inroads in important markets like America, South and Latin America, Australia and Europe. The fans in other parts of the world most likely have completely different standards of beauty, and the “normalized” version of what is beautiful to a K-pop star in Korea may not be an actual reality elsewhere.  Furthermore, the Korean companies that are giving the chances to those artists who do not fit the stereotypical beauty standards, and are prioritizing health, should be applauded for focusing on talent and well-being rather than appearances. These companies see something past looks and give a much-needed chance to help talent shine in a critical music industry. If a hundred domestic fans are supposedly not happy with what they see, an artist can find thousands of others elsewhere who see them as perfect. As BTS prepares for its biggest international awards show performance to date at the American Music Awards this weekend, keep in mind that the group found much of its success and fervent fandom outside of Korea before finally making it big at home, too. Many would argue that some members of BTS do not fit Korea’s typical beauty standard and yet here they are, creating Beatles-esque mania at LAX. Being a K-pop idol means being someone fans look up to, and that can, and certainly should, include individuals who don’t fit the same mold as other singers. As K-pop continues to be for everyone regardless of language and culture, shouldn’t its singers also be for everyone regardless of weight, looks, height and other surface-level attributes? Who’s to say that an idol who doesn’t have the perfect “S- or X-line” body doesn’t have the requirements to be a top star? Technology makes comments and critiques — both good and bad — more accessible, but we’ll undoubtedly continue to lose more of our favorite stars if we don’t start highlighting the importance of diversity in body and beauty standards. We might not be able to change said beauty standards — that would require unpacking centuries of cultural and societal history — but we can cut our idols some slack and stop putting their weights under a microscope.  Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2017-11-17T00:32:14+00:00",
    "url": "https://www.billboard.com/music/music-news/kpop-body-image-diets-eating-disorders-essay-8030059/"
}