{
    "title": "K-pop idols and Covid-19: Chungha tested positive amid South Korea’s third wave and Kara’s Gyuri did earlier this year – plus 5 more stars who caught coronavirus | South China Morning Post",
    "text": "Up10tion Two members of K-pop boy band Up10tion tested positive, their talent agency Top Media announced – Bitto at the end of November and Kogyeol last week. Thankfully, the rest of the members tested negative. Since Up10tion performed on MBC’s Show! Music Core and SBS’s Inkigayo, other music artists who appeared on the music TV programmes also got tested after the news about Bitto. Gyuri In a statement made through her agency, Park said that she tested negative and publicly apologised for her actions, expressing her “deep regret”. Everglow Yiren and Sihyeon of Everglow were reported to have tested positive after the girl group took part in TV show Yoo Hee-yeoul’s Sketchbook in late November. Two days before Everglow’s appearance on the show, Yiren apparently came into contact with another person confirmed to have the virus, although she didn’t find out about it until later. The rest of Everglow, along with the staff who took part in the show, all got screened. The group’s four other members tested negative. Lee Chan-won Lee Chan-won, a singer who appeared on the popular music reality TV show Mr Trot, admitted to testing positive last week. His agency, New Era Project, announced that Lee went into self-quarantine. Since Lee had recently taken part in TV Chosun’s Ppong School, other celebrities who appeared on the programme, as well as some of the broadcaster’s other series got tested, too. Basketball-star-turned-entertainer Seo Jang-hoon and singers Lee Juck and Yoon Jong-shin, who share the same stylist as Lee, went into self-quarantine as a precaution. Want more stories like this? Sign up  here. Follow STYLE on  Facebook,  Instagram,  YouTube and  Twitter . For more great stories on Korean entertainment, artist profiles and the latest news, visit K-post, SCMP's  K-pop hub. Everglow’s Yiren and Sihyeon tested positive after appearing on Yoo Hee-yeoul’s Sketchbook, while Up10nation’s Bitto and Kogyeol had other music artists on SBS’ Inkigayo and MBC’s Show! Music Core scrambling to get screened ",
    "datetime": "2020-12-09T08:00:14+08:00",
    "url": "https://www.scmp.com/magazines/style/celebrity/article/3113112/k-pop-idols-and-covid-19-chungha-tested-positive-amid"
}