{
    "title": "K-pop superstar group BTS hopes global appeal can boost Seoul YouTube tourism campaign | South China Morning Post",
    "text": "K-pop superstar group BTS is hoping to encourage more global travellers to visit the South Korean capital, Seoul, through YouTube, Facebook and Instagram promotional videos. The seven-member boy band – now on a world tour – filmed seven tourism commercials for release on the media platforms, with the first shown on Monday morning on Seoul’s official YouTube channel. The films, produced in collaboration with the local government, are also being broadcast on television channels –― KBS World aired in 58 million households in 117 countries and tvN Asia Channel, which is available to 9 million households in nine Southeast Asian countries. The members of BTS, as honorary ambassadors for Seoul for the second successive year, have filmed commercials and a music video. The music video titled With Seoul mesmerised fans to the extent that Seoul’s official tourism website crashed. Last month the band claimed the No 1 spot on the Billboard 200 Albums chart with “Love Yourself: Answer”. The promotional videos feature seven themes: Delicious Seoul, Relaxing Seoul, Extreme Seoul, Historic Seoul, K-Wave Seoul, Fashionable Seoul and Exclusive Seoul. “Delicious Seoul” portrays Jungkook strolling through Dokkaebi Night Market where there are scores of popular food trucks, and the group introduces different dishes that will tingle one’s taste buds. “Relaxing Seoul” is introduced by Ji-min, who visits Seoul's city wall and highlights people relaxing while kayaking on the Han River, which runs through the capital. “Extreme Seoul”, promoted by RM, introduces extreme sports and festivals where members are shown rock climbing on Mount Bukhan and being sprayed with water during the Waterbomb Festival, as well soaking up the atmosphere of the street-cheering culture that Seoul has to offer during major sporting events. In “Historic Seoul”, Jin gives a glimpse of the country’s culture and history by portraying traditional martial arts and showing how to make traditional pottery at Namsan Beacon Fire Station. In “K-Wave Seoul”, BTS member J-Hope teaches the latest K-pop dance moves and shows people free-styling at K-starROAD as well as introducing the Korean wave’s culture and products. “Fashionable Seoul” shows BTS member Suga introducing street fashion and culture as well as recommending the K-Beauty experience. In “Exclusive Seoul”, BTS member V wears and shows off the luxurious Korean traditional clothing “hanbok” and introduces exclusive traditional Korean food dining destinations. The promotional videos are part of Seoul’s goal to attract 50 million tourists by 2023. The city believes the video clips will greatly help the city attract global travellers thanks to the boy band’s huge popularity worldwide. “BTS has risen to international stardom and we have selected the group as our honorary ambassadors, so we will be better able to appeal to the world with Seoul’s hot tourism content,” said Joo Yong-tae, director of the tourism and sports bureau at the local government. Want more stories like this? Sign up  here. Follow STYLE on  Facebook,  Instagram and  Twitter The band, now on a world tour, films seven social media commercials for use on Facebook and Instagram to attract 50 million travellers to the city by 2023 ",
    "datetime": "2018-10-23T11:00:43+08:00",
    "url": "https://www.scmp.com/magazines/style/people-events/article/2169759/k-pop-superstar-group-bts-hopes-global-appeal-can"
}