{
    "title": "K-Pop debate rages in Muslim Malaysia | Vancouver Sun",
    "text": "While the West has become a target of the Islamic extremists, the Far East has faced far less criticism and outrage. But an event last week — somewhat overlooked in the West because of the Paris attacks — has sparked fresh, heated debate over the clash of cultures, this time between one of Asia’s most-westernized countries and another where the mainstream culture remains staunchly observant to its majority Muslim faith. Subscribe now to read the latest news in your city and across Canada. Subscribe now to read the latest news in your city and across Canada. Create an account or sign in to continue with your reading experience. Don't have an account?  Create Account The trigger for the controversy appeared innocent enough: South Korean pop-group B1A4, five male performers in their early 20s, was performing in Malaysia in front of its fans, mostly girls. During the show, the singers invited several fans onstage to meet the group. Three fans wearing head scarves were invited to act out scenes from a Korean drama. During the skits, the girls shared hugs with the singers; one girl was cuddling with one idol while another received a kiss on her forehead. A video of that was posted onto YouTube on Jan. 10. It quickly went viral in Malaysia, triggering outrage among the country’s religious conservatives. Malaysia — which has civil laws strictly outlining what’s not appropriate in terms of public displays of affection — moved quickly. The country’s Federal Territories Islamic Religious Department, charged with maintaining religious moral standards, said last Wednesday the three girls will be given a week to turn themselves in. If they do not do so, warrants for their arrest will be issued, the department’s director said. The concert’s organizers are also being investigated. Start your day with a roundup of B.C.-focused news and opinion. By signing up you consent to receive the above newsletter from Postmedia Network Inc. A welcome email is on its way. If you don't see it, please check your junk folder. The next issue of Sunrise will soon be in your inbox. We encountered an issue signing you up. Please try again The YouTube video remained up as of Friday, when it had garnered 468,504 views and countless angry responses. The furor exposes the extent to which Korean pop culture (popularly dubbed K-Pop) has swept traditionally conservative Southeast Asia and the complexities within Malaysian society in terms of religion’s role in government. The movement known as Hanryu — or Korean Wave — has seen Korean pop music and television drama dominate the airwaves in many markets. While K-Pop has a growing and loyal following among young Europeans and North Americans, places like China, Japan, Australia, Vietnam, The Philippines, Thailand and Malaysia have borne the brunt of this cultural phenomenon. Different countries have had different reactions to this onslaught of pop-culture glitter. Chinese fans have, for the most part, embraced it. Japan is so taken by its impact that Tokyo launched a counter-offensive in its “Cool Japan” movement to promote its own pop cultural assets. But it is in Southeast Asia — especially in Muslim countries like Malaysia — where the rise of such pop cultural influence has drawn the most opposition from social conservatives. Malaysia’s own definition of its relationship with the Muslim faith has been complex. Government leaders often tinker with their wording when it comes to the question whether Malaysia is an official Islamic state. What is not up for debate, however, is that Islam plays a dominant role in Malay culture, where more than 60 per cent of the population is Muslim. That’s why Malaysian law, while derived from British common law, has a distinct local flavour. And it is also why the state has agencies that work to preserve the adherence to Islamic norms in Malaysian society. Read more: http://www.vancouversun.com/business/Chuck+Chiang+debate+rages+Muslim+Malaysia/10739662/story.html#ixzz3cn3346UE Postmedia is committed to maintaining a lively but civil forum for discussion and encourage all readers to share their views on our articles. Comments may take up to an hour for moderation before appearing on the site. We ask you to keep your comments relevant and respectful. We have enabled email notifications—you will now receive an email if you receive a reply to your comment, there is an update to a comment thread you follow or if a user you follow comments. Visit our Community Guidelines for more information and details on how to adjust your email settings. To contribute to the conversation, you need to be logged in. If you are not yet registered, create your account now - it's FREE. 365 Bloor Street East, Toronto, Ontario, M4W 3L4 © 2023 Vancouver Sun, a division of Postmedia Network Inc. All rights reserved. Unauthorized distribution, transmission or republication strictly prohibited. This website uses cookies to personalize your content (including ads), and allows us to analyze our traffic. Read more about cookies here. By continuing to use our site, you agree to our Terms of Service and Privacy Policy. ",
    "datetime": null,
    "url": "https://vancouversun.com/news/staff-blogs/k-pop-debate-rages-in-muslim-malaysia"
}