{
    "title": "K-Pop Ends 2016 With a Generational Shift as Girl Groups Disband – Billboard",
    "text": "Ask anyone, and it seems like 2016 wasn't quite filled with sunshine and sparkles. It was no different for fans of Korean girl groups, thanks to the onslaught of devastating group breakups. Rather… By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tTamar Herman Ask anyone, and it seems like 2016 wasn’t quite filled with sunshine and sparkles. It was no different for fans of Korean girl groups, thanks to the onslaught of devastating group breakups. Rather than fading away over a few years, almost an entire generation of Korea’s girl groups went by the wayside overnight, as major players, including 2NE1 and Kara, sank into the rearview. Explore\t\t\n\t\n\nSee latest videos, charts and news\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\t2ne1\t\t\n\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\t4Minute\t\t\n\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tKara\t\t\n\t\t\t\t\t\n\n\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news The death knells began in January, when Kara came to an end after three members didn’t renew their contracts with DSP Media. The quintet released their first song in 2007, and rose to fame as figureheads of the Korean Wave — the phenomena of Korean pop culture spreading internationally — during the early 2010s. Their infectious synth-pop hits, like “Wanna” and “Mister,” helped the group lead K-pop’s push into Japan, the second largest music market in the world. They became the first Korean girl group to headline concert at the Tokyo Dome in 2013, and tickets reportedly sold out in five minutes. Kara’s presence in the first half of the decade was undeniably impactful, and their conclusion set the tone for 2016, when it seemed like many of K-pop’s most prominent girl groups said their final, relatively quiet, farewells.   K-pop’s next shake up came in April, when 2NE1’s Minzy left the group. The youngest of the foursome, Minzy didn’t renew her contract with YG Entertainment, and set off to pursue a solo career. The move came two years after the group went on hiatus, following an instance where member Park Bom drew criticism for importing prescription drugs from the United States, despite their illegality in South Korea. Even though it was a lengthy absence, 2NE1’s immense popularity seemed infallible and though Minzy’s departure this year came as a shock to many, it appeared to mostly signal the start of a new era for the group. This was 2NE1; the quartet that turned K-pop’s idea of “girl group” inside out with empowering messages and bold performances. Surely it was not the end.  However, fans’ enduring belief in 2NE1 was destroyed in November, when YG Entertainment quietly announced through a notice on the company’s website that the group would be no more. (The announcement has since been removed.) The news came after the remaining three members informed fans that they’d be releasing new music, and was met with confusion. CL and Dara, the only members to remain under YG, each expressed regret about not being able to deliver a new album, but 2NE1’s legacy appeared to be cut short before the long-awaited music could be released. Since their debut in 2009, the fierce group had a revolutionary career and became one of the most dominant acts with hits like “I Am The Best” and “Lonely.” Their final album, 2014’s Crush, appeared at no. 60 on the Billboard 200. The K-pop industry’s seven-year-long contracts was the immediate factor behind 2NE1’s disbandment but the so-called “seven-year curse” affected several other female acts, including Kara’s little sister group Rainbow. The group reached their peak in 2010 and 2011 with hits “A” and “To Me” but were never truly able to find their place amidst the cutthroat industry. Their final single, the retro-tinged pop/rock song “Whoo,” came out in February, but the group survived until October, when their contracts with DSP Media expired.   Another loss came from 4Minute, who made their way in the K-pop scene with subversive dancepop. The group released “Hate” in January ahead of their contracts expiring with Cube Entertainment but the empowering swan song didn’t save the group. In June, 4Minute officially disbanded with only member and soloist HyunA remaining signed to the label. (Labelmates BEAST also left Cube this year, leaving major gaps in the company’s roster.) While 4Minute never became as internationally renowned as some other K-pop acts — including HyunA herself after she appeared in Psy’s “Gangnam Style” video — they had numerous hits in South Korea and their 2015 EP Crazy, with its electronic and hip-hop title track, topped the World Album Chart. While there were plenty of groups that went the way of the past, the generational shift isn’t entirely complete. Secret and miss A lost members this year but are still around, while Girls’ Generation and Wonder Girls are still some of K-pop’s most stalwart acts. But the winds are shifting, and the departing acts did leave openings for newer girl groups to fill in the void. Some of the year’s most popular K-pop songs came from rising acts like Blackpink, Gfriend and Twice, ensuring that 2017 will see clashes as contenders face off to be crowned the top girl groups of this ascendant generation.  Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2016-12-23T19:43:01+00:00",
    "url": "https://www.billboard.com/music/music-news/k-pop-2016-generational-shift-girl-groups-break-up-7633214/"
}