{
    "title": "K-Pop Brand SM Entertainment Reorganizes Leadership After Shareholder Concerns",
    "text": "SEOUL, SOUTH KOREA - AUGUST 17:  SMTOWN President Kim Young-Min speaks the welcoming address for ... [+] media at the SMTOWN Coexartium on August 17, 2015 in Seoul, South Korea. S.M. Entertainment is one of the largest South Korean entertainment companies, operating multiple aspects of entertainment industry including celebrity management, music production, film production etc.  (Photo by Chung Sung-Jun/Getty Images) South Korean media player SM Entertainment announced changes to its corporate structure today (July 31) following intense scrutiny from investors regarding its financial stability and profitability. Recent weeks have seen several shareholders of the company, known primarily as one of K-pop’s “Big 3” labels and home to the likes of EXO, NCT and Red Velvet, publicly air grievances regarding the state of SM's finances. Concerns raised by KB Asset Management and Korea Investment Value Asset Management (KIVAM) earlier this summer revolved around the company's multiple cost inefficient ventures, as well as it never issuing dividends since being listed on KOSDAQ even while paying millions of dollars to Like Production, a firm owned by SM Entertainment founder and executive producer Lee Soo-man, for consulting fees. As a response to the deadline of July 31 set by KIVAM, which owns 5.05% of SM's stock, SM announced that it had rearranged its executive branch. Moving forward, Kim Young-min, formerly co-CEO of SM Contents & Culture (SM C&C), and Nam So-young will serve as a new pair of co-CEOs spearheading SM Entertainment Group while SM C&C will be run by Namkoong Cheol, previously CFO of SM C&C, with Kim Dong-joon. Previously, Nam served with Han Se-min as heads of SM Entertainment, while Kim Dong-joon and Kim Young-min spearheaded SM C&C. Han will serve as CEO of SM Life Design Group, and subsidiary KeyEast Entertainment will remain headed by Shin Pil-soon and Park Sung-hye as co-CEOs. Despite shareholders demands, the only immediate movements being made are those in corporate positions, while the company says it will reassess its current business practices moving forward. KB's request that unprofitable ventures, particularly SM's food and beverage-related ventures, should be shut down seemingly led to SM's reported decision to look into divesting some of its businesses, including the SMTOWN Coex Artium complex in Seoul. Opened in 2015, it houses a museum, cafe, theater, and stores that fans of SM Entertainment artists can visit. The entertainment company also stated that it will not merge with Like Production. KB, which reportedly owns 7.59% of SM Entertainment's shares, objected to payments made to the firm and raised concern over the fact that royalties paid to it amounted to 46% of SM's business profits. Like Production is solely owned by Lee Soo-man, and according to SM a merger is impossible but the company will look into reviewing the situation. In June, when the issue was first raised, a statement from SM declared that, \"The producing contract between SM Entertainment and Like Production is one of the important parts regarding global content competitiveness and growth...The producing contract were based on review by external consulting firms, through case studies and analysis of global peer groups. With the contract, SM Entertainment has been leading K-Wave and K- Pop phenomena.\" SM also reportedly currently has no plans to institute dividends as per its longterm policies, but stated that it will consider options, including distributing profits or buying back shares, to provide shareholders return on their investments. SM Entertainment's stock prices closed the day out at 35,400 KRW, around $29.78 USD, after opening at 34,400 KRW, or $28.94.  ",
    "datetime": null,
    "url": "https://www.forbes.com/sites/tamarherman/2019/07/31/k-pop-brand-sm-entertainment-reorganizes-leadership-after-shareholder-concerns/"
}