{
    "title": "K-Pop’s Big China Problem – Foreign Policy",
    "text": "New flash points in the crisis have emerged—with no offramps in sight. | Israel spurns the secretary-general as calls for a humanitarian cease-fire rise. | The Iron Dome may not be so ironclad if Hezbollah joins the war. | Azerbaijan’s dramatic takeover has serious consequences for Armenia, Turkey, Iran, and beyond. | Argument:\n                            \n\n                                K-Pop’s Big China Problem Create an FP account to save articles to read later and in the FP mobile app. Sign Up ALREADY AN FP SUBSCRIBER? LOGIN  As the U.S.-China trade war enters its second year with no sign of a deal, one heavily export-reliant Asian economy finds itself caught squarely in the middle: South Korea. The United States and China are South Korea’s two largest trading partners, with more than 25 percent of Korean exports going to China and another 12 percent to the United States. Korea’s economy is already suffering significantly due to the slowdown in the global supply chain. As the U.S.-China trade war enters its second year with no sign of a deal, one heavily export-reliant Asian economy finds itself caught squarely in the middle: South Korea. The United States and China are South Korea’s two largest trading partners, with more than 25 percent of Korean exports going to China and another 12 percent to the United States. Korea’s economy is already suffering significantly due to the slowdown in the global supply chain. But aside from semiconductors, smartphone chips, and petrochemicals, the fate of South Korea’s most famous export—K-pop, or Korean pop—hangs in the balance. Korean wave (hallyu) products like K-pop and K-dramas became enormously popular in China earlier this decade, driven by relatively open international exchange and the growth of a sizable urban middle class with disposable income. But they suffered an equally dramatic fall when South Korea’s decision to cooperate with the United States to build the THAAD missile defense system, which China sees as a threat to its security, resulted in an abrupt ban on hallyu imports for two years—leaving Chinese fans to take overseas trips to see their favorite idols. The ban has since eased a little, but even after the thaw, no major Korean group has been invited to perform in the country. Hallyu’s fate looks shaky as China becomes increasingly paranoid about foreign influence and censorship tightens by the month. But if Seoul pisses off Beijing again—say, if Korean companies stop selling memory chips to Huawei—a complete ban on hallyu will be harder this time around. This is because an increasing number of K-pop idols are Chinese. Unlike Hollywood, whose efforts to incorporate Chinese stars, such as in the dire film The Great Wall, have largely flopped, Korean labels have pushed hard to draw talent out of China. The Korean music industry started recruiting Chinese idol trainees toward the end of the last decade, hoping that Chinese idols and Mandarin-language songs would help win over China’s growing consumer class. This tactic was pioneered by SM Entertainment, South Korea’s largest and most infamously exploitative K-pop agency, which debuted a Mandarin-speaking subunit of its hit boy group Super Junior in 2008. The first generation of Chinese starlets in Seoul came into an idol talent system often as ruthless and focused as Olympic training back in China. Much as in midcentury Hollywood and the studio system, the Korean pop industry is dominated by a handful of agencies that recruit and train young talent. Once they’ve signed exclusive contracts with an agency—typically seven to 10 years—trainees move into company dormitories and spend the next several years undergoing a rigorous program of training in singing, dance, public speaking, and languages before—if they are fortunate—they’re selected to debut as part of an idol group. In such an environment, exploitation abounds, and financial and legal disputes are common. So it was hardly surprising when SM’s bid at localization got off to a rocky start. Only a year after his debut, Super Junior-M member Han Geng sued SM for unfair distribution of profits and left the group. But perhaps the most instructive example has been the saga around SM’s 12-piece boy band EXO, which debuted in 2012 to phenomenal popularity across Asia and singlehandedly blew open the door for Korean idol culture in China thanks to the group’s Mandarin-language subunit, EXO-M, which sang Chinese-language versions of the groups’ hits and made overnight sensations out of Chinese members Lu Han aka Luhan and Wu Yifan aka Kris. The honeymoon, however, was short-lived. Citing unfair treatment and profit distribution, three of EXO’s Chinese members—Kris, Luhan, and Huang Zitao aka Tao—all left the group in 2014 and 2015. A bitter legal battle followed, with settlements reached only in 2016. While the exact details of the settlements were never disclosed, SM has maintained management rights until the end of the artists’ contracts and remains entitled to a percentage of the stars’ earnings in China. The EXO brouhaha brought about a paradigm shift in the way Korean entertainment agencies handle their Chinese idols. On returning to China, the ex-EXO members enjoyed an absolutely staggering windfall as hometown heroes in their newly K-pop-crazy country. Although SM was still making a tidy profit off its estranged idols’ activities per the settlements (the agency’s cut is thought to be around 10 percent but was never disclosed), the company saw an opportunity to make even more money without the legal or public relations headaches. In 2015, SM essentially released two of its biggest Chinese stars back to their home country, setting up solo studios in China for Zhang Yixing aka Lay, the remaining Chinese member of EXO, and Song Qian aka Victoria, the popular Chinese leader of the girl group f(x). From that time on, Lay and Victoria started to appear more and more infrequently with their groups in Korea, instead pursuing highly lucrative solo careers in China. In 2017, SM rival agency JYP Entertainment followed suit, setting up a Chinese studio for Jackson Wang, the charismatic Hong Kong-born member of the agency’s top moneymaker, the boy group Got7. It’s hardly surprising that these famously ruthless agencies were willing to change their tack so quickly; the Chinese market was simply too big to risk losing—a reality that soon became painfully clear. After the THAAD sanctions hit in 2016, Korea’s hallyu-linked sectors saw their balance of payments surplus shrink by nearly half, from $520 million to $270 million. But those agencies that had set up studios for their Chinese idols were able to maintain a handsome revenue stream from China—especially SM, which has seen its bet on Lay pay off as he becomes one of China’s richest and most popular celebrities, with dozens of product endorsements and 47 million followers on Weibo, China’s Twitter-like social network. Lay’s most recent EP, Honey, recorded an enormous 1.87 million preorders on the Chinese digital platform QQ Music in just over three minutes of going on sale last month. That’s why, as well as pursuing promising markets in Southeast Asia, Latin America, the United States, and Europe, SM has doubled down on its China strategy despite the blow struck by THAAD. When it comes to China, SM’s future hopes rest squarely on WayV, the China-based subunit of SM’s new concept “boy brand” NCT. Unlike the other three subunits of the group (NCT 127, NCT Dream, and NCT U), WayV makes no explicit connection to SM Entertainment or NCT in its name or promotional materials, and the group is managed by a China-based subsidiary called Label V. But it’s unclear if this latest bid at localization in China will succeed. Having relied on Korean expertise for over a decade, China is starting to develop its own idol-making infrastructure. In 2018, the Chinese online streaming services iQiyi and Tencent Video both came out with wildly popular idol competition shows anchored by celebrity judges who were mostly current or former K-pop idols (Lay and Jackson on Idol Producer, Tao on Produce 101). Many of the contestants, too, had trained in South Korea or were co-managed by South Korean agencies. Yet on these shows, references to South Korea were conspicuously absent; none of the judges mentioned their current or former K-pop groups, and contestants talked about having trained “abroad” rather than in Korea. The fear, from the perspective of the K-pop industry, is that the new generation of Chinese idols will have no connection to Korea whatsoever. The first season of Idol Producer, which was watched by more than 100 million people—more than the entire population of South Korea—succeeded in minting China’s newest favorite “soft boy” superstar, the now 20-year-old Cai Xukun. Although, in the pre-THAAD era, Cai had trained in South Korea as part of the Chinese-Korean co-production Super Idol, he no longer has any connection to the country, financial or otherwise. And with 25 million followers on Weibo, his popularity far eclipses that of the members of WayV, none of whom have more than half a million followers on the social networking site. (JYP’s recently debuted Chinese outfit Boy Story, which is produced in collaboration with Tencent, has only barely broken the half-million mark on Weibo.) Having leapfrogged to its current state of maturity in only a matter of years thanks to South Korean expertise, China’s idol industry now seems poised to cast off its Korean connection completely. Much like the decoupling of the Chinese internet from the rest of the world a decade ago, we will probably start to see a Chinese idol industry take shape that is self-contained and populated with only the most politically palatable artists—artists like Lay, who in 2016 accepted the newly created title of publicity ambassador for the Changsha branch of the Communist Youth League of China. As the sudden purges of cultural figures like Fan Bingbing and popular shows like The Rap of China and Story of Yanxi Palace have shown in the last couple of years, the Chinese Communist Party (CCP) fears anything and everything that appears to exercise outsize influence over the hearts and minds of Chinese people—especially young Chinese people, whom the party sees as mindless trend-chasers. The incubation of a homegrown idol industry that we are seeing now is therefore not merely a reaction to a temporary geopolitical conflict but a reflection of a long-term and sustained effort to lock down control over a sector of youth culture. In the next few years, expect K-pop in China to be supplanted by a new wave of idol music that puts the “CCP” in “C-pop.”  Read More Celebrities’ crimes are pushing South Korea’s reckoning with misogyny. | Stars like Luhan are huge with fans but sit uncomfortably with macho ambitions. | Sometimes blowing your paycheck can be a rational choice. | You’re on the list! More ways to stay updated on global news: By submitting your email, you agree to the Privacy Policy and Terms of Use and to receive email correspondence from us. You may opt out at any time. The focus on the stalled land war obscures major successes in Crimea and the Black Sea. Concerns about a refugee crisis, financial strains, permanent displacement, and possible militancy in Sinai worry leaders in Cairo. The culture of intelligence agencies paved the way for disaster. Regional war could revive the nuclear specter that haunted the world in 1973. By painting Sikh separatists as a bigger security threat than they are, the BJP government can mobilize its base in advance of the 2024 election. | | | | | Sign up for World Brief By submitting your email, you agree to the Privacy Policy and Terms of Use and to receive email correspondence from us. You may opt out at any time. ",
    "datetime": null,
    "url": "https://foreignpolicy.com/2019/07/30/k-pops-big-china-problem/"
}