{
    "title": "K-wave idols acting out – but fans still love them anyway: Part 1",
    "text": "Where else would you be able to get a Pharrell Williams sweatshirt for only S$39 after discount? One Korean star is well-known for his role as a gentle, sensitive shy musician with anime-like looks in mega-hit drama “Boys Over Flowers”, but he was questioned by police in July for allegedly beating up his ex-girl friend and breaking her ribs. Another dashing K idol described himself as “blissfully” in love with his young wife, but within half a year he had allegedly begun an affair with an even younger model who was arrested for blackmailing him for $5million. Under the veneer of flawless skin, painfully stylish clothes and unwavering smiles, 2014 has been a year of non-stop scandals in the Korean entertainment industry – from drug and physical abuse arrests to shock relationships and artistes suing their management companies or getting thrown out of their bands. We run through 2014’s biggest K-wave shakeups and ask Singaporean fans how they feel when cracks start to appear on their idols’ seemingly perfect public lives. In Part 1, we break down the three biggest abuse scandals and find out if these Hallyu stars have shone less brightly since then. 1. Physical abuse scandal: Kim Hyun Joong – ‘We were just playing around’ Boys over Flowers star Kim Hyun Joong, called the next Bae Yong Jun for his sensitive new age guy looks, has commented about love and respect regarding the girl of his dreams. That carefully cultivated image was destroyed when he was accused by an ex-girlfriend of physical abuse in August this year. She alleged that over the course of two months, he broke her ribs and repeatedly assaulted her, leaving her with bruises all over her body. Kim’s camp immediately denied the allegations but later sent out a statement claiming that he had “accidentally” broken her ribs during a fight. This was met by skepticism from netizens, who saw it as a move to limit damage to his reputation. Finally, in September, he made a public apology, admitting that he had hurt her “both mentally and physically.” “I have done what a man should never do and feel very ashamed. This matter is completely my fault,” wrote Kim, 28. His ex-girlfriend accepted his apology and decided to drop assault charges. Singaporean fans were divided about the physical abuse allegations, but most admitted that they saw him in a new, less flattering light. “After watching Boys over Flowers, I thought of Hyun-Joong oppa (older brother) as a kind of angel, like a perfect man. I don’t want to believe that this is true, that he hit a woman. If he really did, then of course he’s wrong,” said administrative officer Ginnie Teo, 27, who travelled around Asia to attend Kim’s fan meetings for the past two years and is thinking of withdrawing her support. “I really hope he’s sorry, but of course I feel very disappointed,” she added. “I will support him no matter what, through thick and thin,” said local fan Hazel Yeo, 34, who told Yahoo Singapore that she left messages of support on his fan pages and was slammed for it. “I’m sure that he will weather this storm and come back stronger than ever. I don’t believe the allegations.” 2. Drug abuse scandal: Park Bom – 'I needed the pills for medical reasons' 2NE1 member Park Bom, 30, has been plagued with scandals since the start of her career with the successful girl-band. First there were speculations about plastic surgery, then about her fabricating her age and lip-syncing on stage. In July this year, Park was accused of “smuggling” amphetamines from the United States into South Korea by mail four years ago. The case had supposedly been “covered up” because she was a star but brought back to light again by Korean publication Segye Ilbo. Park’s entertainment company, YG Family, issued a statement “clarifying” the issue. In an open letter, CEO Yang Hyun Suk explained that Park had witnessed the death of a soccer team-mate when she was a teenager in the United States and had suffered from depression after the incident. The amphetamines, Yang claimed, were prescription medicine from a university hospital in the States to treat her trauma. Park had asked her mother and grandmother to mail the “medication” to her in Seoul. “Thankfully, the hospital provided medical records and prescriptions for the investigation, and the case was wrapped up with no further issues,” wrote Yang. While most 2NE1 fans Yahoo Singapore spoke to said they accepted her explanation and would continue being loyal supporters, some said that she had lost their respect. “Why would she need to bring in the amphetamines from the US? If she was truly suffering from depression, she should just see a doctor in Seoul, where she is based. I think it’s fishy,” said undergraduate Nur Dianah, 22, who added that fans should be objective and less naïve. “The accident happened years ago. And if she is truly still suffering from depression, I think she needs to get some real treatment or take a break from singing to focus on her health,” she added. “When Bom was asked why her face is so round and bloated like she did plastic surgery, she claimed that it was due to a medical condition. And now, she says she takes these drugs also for medical reasons,” said bank executive Rina Tan, 29. “I like her music, but I don’t think she has much integrity as a person,” she said. 3. Blackmail and adultery scandal: Lee Byung Hun – 'No comment' Lauded for his acting chops and successful crossover to Hollywood, Lee Byung Hun was held up as a shining example of the “Korean wave”. His popularity increased even more when he married up and coming actress Lee Min Jung, 32, in a fairytale ceremony in 2013. Now, he is embroiled in a blackmail and adultery scandal, which could cost him his career and marriage. In September 2014, Lee, 44, made a police report claiming two women were blackmailing him using a “compromising\" video. One was K-pop girl group member Da Hee and another was model Lee Ji Yeon. The two girls were arrested, charged and face jail – but the tide has turned against Lee as investigations into the blackmailing continue. First, there was shock that he was apparently cheating on his wife of just a year. Police documents showed that the two girls made frequent trips to Lee’s home, where they would sit and drink alcohol together in the absence of his wife. It was allegedly during one of these drinking sessions that the two girls took a video of Lee using lewd and sexual language on them and tried to blackmail him for a whopping $5 million.  Model Lee Ji Yeon has claimed through her lawyer that she and Lee were having an affair and that she had decided to film the video when he broke up with her after 3 months. “In her emotionally hurt state, she blackmailed him with the video,” said her lawyer. Photos, allegedly from model Lee’s Instagram account showing lavish Hermes gifts and personalized bottles of wine from the actor, were also dug up by netizens. One photo of an extremely rare bottle of Dragonback wine from an Argentinian wine estate coincided with a trip Lee made to the same vineyard around the same time. While Lee’s camp has staunchly denied allegations of an affair, he has faced significant backlash online from angry fans, especially after his wife posted a photo of clouds captioned “Only God Knows.” Fans here said they were “shocked” by the news. “I am a fan of his acting, but it looks like he has some really big personal issues,” said housewife Goh TY, 45, who has been supporting Lee since his “All In” drama days.“I will still watch his shows as his personal life is his own affair, but I feel really sorry for his wife. They looked so happy together.” “Looks like his move to report the girls to the police has backfired on him,” said teacher Darren Lim, 31, who enjoys Lee’s fighting and action movies. “Unfortunately they are the ones who are going to have to serve out jail sentences and he’ll get off scot free. I’m not surprised, though – stars are human too, and they can be ugly too. We just don’t see it on the outside.” In Part 2 of K-wave idols acting out, we bring you up to speed on K-celebrities coming out about their relationships and their fan reactions – everything from murder and suicide threats to overwhelming positive support. The Princess of Wales attended Lady Rose Windsor and George Gilman's wedding in 2008 without boyfriend Prince William in a mini wedding guest dress – throwback photos. In \"The Woman in Me,\" Britney Spears says she heard a different message when Justin Timberlake talked about their sex life back in 2002. 最强理財裝備- 恒生Mobile App 可以FPS 過數、 24/7唱外幣、手機入票等◦完成指定任務仲可以抽東京機票！ Israel demanded the resignation of the UN secretary-general on Tuesday over “shocking” comments in which he suggested that the Oct 7 attack was provoked by the “suffocating occupation” of the Palestinian territories. The Premier League has recommended that Everton face a 12-point deduction in its case against them for breaching profit and sustainability rules, the Telegraph has learnt. Chong Un Kim, 26, immigrated to the US in 1981 and her remains were found in a dumpster on Valentine’s Day 1988 保證內部回報率3.02-3.3% A woman whose confrontation with the police at a hospital went viral on TikTok has been sentenced to five weeks and five days in jail, coupled with a $600 fine. The 32-year-old is living in Florida, where he moved earlier this year after he was successfully sued for defamation in Israel The company — and other retailers — made a commitment in 2018, but backtracked soon after. 有業界No.1自願醫保，唔驚！FWD尊衛您醫療計劃！全數保障一系列住院同手術費用！ Jesus Ayala, 18, and Jzamir Keys, 16, have been charged with murder over hit-and-run incident that killed Andreas Probst A Lebanese front is unlikely: it wouldn’t be in Iran’s interests, as it would probably spark US intervention, says Lina Khatib, director of the Soas Middle East Institute American intelligence officials have explained to their European counterparts why they failed to anticipate Hamas’s assault on Israeli villages, which was reportedly planned on telephone lines in hidden tunnels. 齊齊玩網上小遊戲，加深認識《憲法》及《基本法》，更有機會換領餅店、咖啡店、超市禮券或書券等，立即行動！ \"It's hard to fathom that there are people in the world who would target such innocence,\" Hilton wrote on Instagram. Energy company Lukoil last year took a public stand over Moscow’s invasion of Ukraine China has replaced Defense Minister Gen. Li Shangfu, who has been out of public view for almost two months, state media reported Tuesday.  Li is the second senior Chinese official to disappear this year, following former Foreign Minister Qin Gang, who was removed from office in July with no explanation offered.  Li, who became defense minister during a Cabinet reshuffle in March, hasn’t been seen since giving a speech on Aug. 29. DBS私人貸款助你今日重整債務，累積財富第一步，網上成功申請仲送你高達$20,300現金券，立即申請！ Liverpool boss waxes lyrical about striker ahead of Toulouse encounter \"Can’t read and won’t follow the rules.\" Hamas is believed to have weaponised thousands of commercial drones with the help of Iran This Is Me...Now: Limited edition created by Jennifer Lopez What would you do if your child turned into a bridezilla? In 2020, 350 elephants mysteriously died in Botswana, with a further 35 dying in similar circumstances in Zimbabwe. Now scientists think they may have found the reason why Russian generals are throwing their troops forward in their assault on the eastern town of Avdiivka despite suffering heavy losses, Ukraine has claimed. ",
    "datetime": null,
    "url": "http://sg.entertainment.yahoo.com/blogs/singapore-showbiz/k-wave-idols-acting-out-%E2%80%93-but-fans-still-love-them-anyway--part-1-072848223.html"
}