{
    "title": "K-wave hits Manila: NCT 127, Red Velvet, Elris, Kim Dong Han to perform in June event | Coconuts",
    "text": "Coconuts The K-wave is real and will be sweeping Manila in June when the K-Pop World Music Festival is set to happen at the Mall of Asia Arena in Pasay City. Organizer DnM Entertainment announced today that K-pop groups such as Neo Culture Technology (NCT) 127, Red Velvet, Elris, as well as JBJ’s Kim Dong Han, and Elris’ Sohee (who was a solo artist prior to joining Elris) will be performing at the event to be held on June 9.   Ticket prices have yet to be revealed, but fans are already ecstatic over the news. Josephine Alonzo Hood wrote in all caps: “SELLING MY INTERNAL ORGANSSSS WAAAAHHHHH NCT127 AND RED VELVET MAMSH!!!!!!!” Rafael Soriano said: “Torn between paying tuition fee or for this ticket.” Apple Shine Ruiz Tipon said she was tearing up. Fans are especially excited to see Red Velvet and NCT 127. Netizen Andrea Fermil is just among the many fans ecstatic about the prominent K-pop groups. Red Velvet and NCT 127 are two of the biggest K-pop groups today. Red Velvet is a five-member girl group known for songs like the sultry R&B hit Bad Boy and the pop song  Power Up. They first made their debut in 2014 with the song Happiness. They are one of the 40 most powerful Korean celebrities this year, earning the 5th spot on the list by Forbes Korea. NCT 127, on the other hand, is a 10-member boy group. It’s the Seoul-based sub-unit of the South Korean boy group NCT, which landed the top spot on Billboard’s Emerging Artists chart in May 2018 — the first K-Pop group to do so. Are you ready for this star-studded concert? Leave a comment below or tweet us @CoconutsManila. You must be logged in as a Coconuts User to comment. Get the best of Coconuts delivered to your inbox! Support local news and join a community of like-minded “Coconauts” across Southeast Asia and Hong Kong. Copyright © 2023 Coconuts Media Limited. All Rights Reserved. Terms Of Service Privacy Policy ",
    "datetime": null,
    "url": "https://coconuts.co/manila/lifestyle/k-wave-hits-manila-nct-127-red-velvet-elris-kim-dong-han-to-perform-in-june-event/"
}