{
    "title": "K-wave sweeps Asean youth off feet | Borneo Bulletin Online",
    "text": "Azlan Othman K-pop, Korean dramas and Korean food were the top three answers that sprang to the minds of ASEAN youths when asked for their perception of Korea. This was the findings of a survey when the ASEAN-Korea Centre (AKC) on Wednesday hosted a roundtable discussion on the mutual perceptions of ASEAN and Korean youth. The focus and theme of the discussion centred around ‘Enhancing Mutual Perceptions for a Sustainable Partnership’. The survey quizzed over 3,300 people in the 19-34 age bracket – comprising 1,800 youth living in nine ASEAN countries (Brunei Darussalam, Cambodia, Indonesia, Laos, Malaysia, Philippines, Singapore, Thailand and Vietnam), over 500 ASEAN youth living in South Korea, and 1,000 Korean youth about their perception of one another. The ASEAN youth were asked, ‘What comes to your mind when you think of ‘Korea?’ and each respondent was asked to provide three answers. Experts from the ASEAN Secretariat, ASEAN Foundation, National Institute for International Education, Korea JoongAng Daily and Channel News Asia exchanged views on the key findings of the ‘Survey on Mutual Perceptions of ASEAN and Korean Youth’ conducted by the AKC in 2021. The survey aimed to identify ASEAN and Korean youth’s current perception of each other, as well as some of the changes that have taken place since 2017, when a similar survey was conducted. It also explored the future direction of people-to-people exchanges and next-generation programmes in the post-pandemic era. Taking note that face-to-face exchange programmes in the past two years of the pandemic have been limited, the discussion placed particular focus on the role of the media and social media in shaping youth’s perception. The survey indicated that most youth accessed information and contents on ASEAN and Korea either through social media, the Internet or via TV programmes. The roundtable explored how Korean and ASEAN media and social media can contribute to deepening mutual understanding, and shaping a positive perception towards each other. Youth of both regions continue to emphasise the importance of exchange and cooperation among non-government entities for continued development of ASEAN-Korea relations. The roundtable also touched on ways to enhance mutual understanding through people-to-people exchanges and education to take place. Borneo Bulletin is the leading English daily in the country. It was first published by Brunei Press. Today, Borneo Bulletin has become the foremost source of information on local and foreign affairs, and the region’s business news. © 2013 Borneo Bulletin Online - The Independent Newspaper in Brunei Darussalam, Sabah and Sarawak ",
    "datetime": "2022-01-28T04:03:51+0800",
    "url": "https://borneobulletin.com.bn/k-wave-sweeps-asean-youth-off-feet-2/"
}