{
    "title": "KCON aims to ride the 'Korean wave' to pop-culture dominance - Los Angeles Times",
    "text": "British production duo LDN Noise had an atypical arc toward becoming two of K-pop’s most in-demand arrangers. So when the duo took the stage at last year’s L.A. KCON conference — a celebration of South Korean pop culture — to talk about their writing process, fans weren’t quite prepared for how candid they’d be. “They actually isolated and played the raw tracks” from their recording sessions, said Angela Killoren, chief operating officer of CJ E&M America, which produces KCON. Fans used to the digital sheen and commercial machinations of most K-pop (including LDN Noise-produced hits by Exo, Red Velvet and NCT 127) had never heard these songs disassembled before. For the record: 9:25 a.m. Aug. 9, 2018An earlier version of this article stated that the KCON events at the Hammer Museum — a concert and a screening of director Hwang Dong-hyuk’s film “The Fortress” — were on the same evening. The concert was Wednesday and the film screening is to take place Thursday. “Audiences absolutely loved that,” Killoren said. For a genre that thrives on fan friendliness and ultra-professionalism, it was a rare look behind the curtain at how the music actually gets made. It’s the kind of thing that happens only at KCON, which is now L.A.’s (and New York’s) definitive showcase for the thriving scene. Since its founding in 2012 in Southern California, KCON has grown to draw 128,000-plus fans for concerts, workshops, panels and meetups (it hits Staples Center and the Hammer Museum this weekend). It’s especially notable this year, as K-pop has finally hit one particular mainstream commercial milestone. In May, the mega-popular group BTS scored the genre’s first Billboard 200-topping album. Clearly, South Korean pop culture (also known as hallyu) shows no signs of abating in America. Now the question is how to take it everywhere else and let fans go even deeper into it. When Killoren and her team founded the event, they saw it as a one-stop shop for fans to see major K-pop acts that didn’t often tour. The genre had a devoted underground following in the U.S., and the team sensed there was pent-up demand for an event like this. “We understood the hunger there. The first KCON was an oasis in the desert. There was just nothing there before,” Killoren said. “But the number of people who attend now, nobody expected.” Accordingly, as top artists such as BTS started touring more, KCON began a subtle but meaningful shift. In recent years, the focus has turned to showcasing emerging acts, many making their U.S. debuts. There are, of course, still huge acts like Twice and Wanna One on the bill this year. But imagine if Coachella lopped off the top line of its headliners and the festival then got even more popular. “K-pop fans are fans of the whole genre, so they’re excited to see new acts. I think we had to build the confidence so that they’d trust us,” Killoren said. “Labels send artists here to test-drive the audience. Before, we had to convince people what KCON even was. Now it’s a situation where labels lobby us, asking, ‘What can I do to get our artists there?’” Interestingly, that shift to emerging acts has also been good for the music. Killoren cites an especially notable crop of solo female performers like Chung Ha and Ailee (a relative rarity in a genre built on sprawling, single-gender groups or male balladeers and rappers), and sounds ranging from K-EDM to super-modern hip-hop that could contend in an Atlanta strip club. After the “BTS bounce,” there’s no question that K-pop has the potential to reach all corners of U.S. pop culture. But KCON also has newer, deeper aims. For the first time, the fest was slated to present at the Hammer Museum in Westwood. On Wednesday, Ailee, Roy Kim and Echae Kang were to perform. Then on Thursday the venue is to host a screening of director Hwang Dong-hyuk’s film “The Fortress,” a historical epic about China’s 1636 invasion of Korea. K-pop aesthetics are indeed informing some contemporary visual art, and Korean cinema has long been lauded for its risk-taking and beauty (see 2016’s “The Handmaiden” from Park Chan-wook, which KCON screened at MoMA, the Museum of Modern Art, in New York). As KCON’s reach and reputation grows, it’s a natural occasion to partner up and showcase the depth of contemporary Korean art beyond its much-adored pop music. “When you have something unique, its not a passing fad,” Killoren said. “We want to broaden the sphere of influence, to be part of the larger cultural conversation.” In the coming years, KCON organizers see even more room to grow behind the scenes. Just as fans now want to know about the choreographers behind their favorite dance moves, the K-pop creative universe wants to open itself up to new influences and connections. KCON is for the fans, but the music and culture business as a whole now wants to see behind the scenes too. “I’m not saying we’re going to take down South by Southwest, but we do want to help globalize this industry,” Killoren said of the annual conglomeration of film, interactive media and music festivals in Austin, Texas. “Movies, drama, beauty — this Korean wave can be a bridge to other cultural mashups. In such a fractured media landscape, there are more threads to tie together.” ♦ ♦ ♦ ♦ ♦ ♦ ♦ ♦ ♦ ♦ KCON Where: Los Angeles Convention Center, 1201 S. Figueroa St., and Staples Center, 1111. S. Figueroa St. When: Friday-Sunday Cost: Prices vary by concerts and various convention events Info: www.kconusa.com/ It's a date Get our L.A. Goes Out newsletter, with the week's best events, to help you explore and experience our city. You may occasionally receive promotional content from the Los Angeles Times. Follow Us August Brown covers pop music, the music industry and nightlife policy at the Los Angeles Times. Music Oct. 25, 2023 Music Oct. 25, 2023 Music Oct. 25, 2023 Sports Oct. 25, 2023 For the record: 9:25 a.m. Aug. 9, 2018: An earlier version of this article stated that the KCON events at the Hammer Museum — a concert and a screening of director Hwang Dong-hyuk’s film “The Fortress” — were on the same evening. The concert was Wednesday and the film screening is to take place Thursday. Entertainment & Arts Oct. 24, 2023 Oct. 24, 2023 Entertainment & Arts Oct. 24, 2023 Oct. 24, 2023 Entertainment & Arts Oct. 24, 2023 Subscribe for unlimited accessSite Map Follow Us MORE FROM THE L.A. TIMES ",
    "datetime": "2018-08-08T19:20:00",
    "url": "https://www.latimes.com/entertainment/music/la-et-ms-kcon-preview-20180807-story.html"
}