{
    "title": "KCON 2014 Day 1: G-Dragon, IU, B1A4 & More Rock Los Angeles – Billboard",
    "text": "K-pop stars like G-Dragon, IU, B1A4, Teen Top, VIXX, Lee Seung Gi and more all made showings at KCON's deafening concert in Los Angeles. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin Saturday morning, the Los Angeles Memorial Sports Arena and its surrounding area was turned into a K-pop heaven with panels, workshops and a marketplace dedicated to all things “Hallyu” (aka Korean wave). Throughout the first day of the convention, fans got to meet Ricky Luna (producer of Taeyang’s “Ringa Linga”) at the Into a Music Producer’s Mind panel, learned the choreography to G-Dragon’s “Crooked” at the Dance All Day tent and saw artists like VIXX, IU, B1A4 come say hi at fan events. But it was all leading up to the night’s grand finale with a five-act concert that would be filmed for South Korea’s K-pop music program show “M COUNTDOWN,” likened to a modern-day “TRL” but with live performances instead of music videos. Last year, KCON grew to two days of festivities, but ended the second day with a concert. This year, the K-pop fest split the 10 artists up for a concert each night, promising longer sets with each act performing five songs versus last year’s three. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tSXM Festival 2024 Announces Phase 1 Lineup: Kevin Saunderson, Loco Dice & More\t\t\n\t\n\n\n\n\t08/10/2014 Danny Im, ’90s/’00s veteran K-pop star and “Danny From L.A.” host, acted as MC for “M COUNTDOWN” on a circle stage that had general-admission fans surrounding him on all sides; though the north side looked a little emptier, perhaps from fans not realizing how far the stage extended.  Girls’ Generation, SPICA & More: See KCON Day 2’s Lineup And while K-pop has become South Korea’s hottest export, KCON isn’t just about the music with the concert bringing out famous drama actor/singer Lee Seung Gi to join Im onstage for a few words. “I hope there will be many more moments when we can meet,” the “Return” singer told the audience, in impressive English, while emphasizing his excitement that fans were spreading Korean culture. Lee and Im hyped up the crowd with a video montage of the acts performing that night — to deafening screams — before rising boy band VIXX took the stage. VIXX opened up the concert with “Voodoo Doll,” their dark 2014 single, that kicked off the hit-heavy concert. From the opening number, it was clear KCON and the artists had actively planned to perform to every part of the audience on this atypical circle stage; the sextet even performed a full song on the less-filled north side. Despite a quick technical issue where one member’s microphone went out mid-rap, the fans were screaming loud for this rookie group – especially when the boys whipped out a slew of sexy body rolls. (And that wouldn’t be the last time fans got treated to body rolls. More on that later.) The show sped into a faster pace by quickly transitioning into IU for her first American performance. The 20-year-old began with her K-Pop Hot 100 No. 1 “The Red Shoes,” moving through the big band-inspired number in a lacy, long-sleeve dress, red lipstick and, of course, red heels. IU looked calm moving through the jazzy number as well through the orchestral “You and I.”  IU Playlist: Her Biggest Hits Including “The Red Shoes,” “You and I” and More “It’s my first time having a stage in L.A. so I’m really nervous,” she told the audience, before adding that she’s “not good in English,” when she actually was quite natural-sounding. The stage lights dimmed and two enormous disco balls hung from the stage as she performed the easy-breezy “Friday” while walking around the stage to wave to concertgoers. The biggest surprise of the night came when Teen Top member Niel emerged from the bottom of the stage to handle the bridge, usually sang by Jang Yi Jeong of boy band HISTORY. IU’s surprises didn’t end there with a whole cheerleader team coming to accompany her on a rocky version of “Hey.” Decked out in school boy-inspired outfits, boy band B1A4 hit the stage next for a goofy performance with on-point choreography of their One Direction-esque single “What’s Happening.”  The guys turned down the funny charms to perform their synthy ballad “Lonely,” before revving it right back up for “Solo Day,” that came complete with heel-clicking choreography. At one point, the boys whipped out super soakers to spray the much-delighted fan girls and boys while probably terrifying the pit photographers. B1A4 is currently planning a world tour and if this was a preview of what a full concert is like, attendees are in for a really fun show. Relive KCON 2013 With These 15 Big Moments Teen Top was next with the boy band following up their KCON 2013 performance that saw them premiere their K-Pop Top 10 hit “Rocking.” Perhaps to showcase their growth since last year – that included concluding a world tour – the guys kicked off with the dance track looking extremely rested and serving an extremely polished performance. While the screams were huge upon their arrival to the stage, the sextet unleashed a slew of body rolls that set the stadium into a tizzy. The guys served on-point choreography throughout hits like “Miss Right” and “Crazy,” and, appropriately enough, later told the audience they wanted to express how happy they were through dancing – which was really just a few heel clicks, but still cute enough to elicit a banshee screams.  The concert looked great visually, but there were so many different points for the artists to look that if concertgoers wanted to watch from one of the four huge screens hanging in each corner of the stadium, their view was more than likely obstructed by multiple hanging wires or speakers. With that, some of the camera choices were odd with the broadcast at times moving to odd shots of members who were not singing or panning to audience members at moments when they were checking their phones. But little did that matter when it came time for headliner G-Dragon. While some fans in the upper rows were sitting for the other acts (Who could blame them? They had been in the SoCal sun for nearly 12 hours), it felt like most of the stadium rose for the BIGBANG member as the stadium chanted his name. Go Inside a G-Dragon Show With Exclusive Videos From His Last Tour The singer/rapper kicked off his set with the knocking hip-hop track “One of a Kind,” smiling while moving through his raps and, at one point, spanking one of his female backup dancers – likely making fans wonder if he could get away with that in Korea. While G-Dragon also performed at KCON 2013 (and brought out Missy Elliott to premiere their collaboration), he hadn’t released his “Coup D’Etat” EPs and, thus, he kept this setlist focused on his newer material. He moved into EP tracks like the fizzy EDM banger “GO,” the melancholy piano-pop track “Who You?” and his take on British rock with “Crooked” – all to deafening screams. With bigger lights and loads of smoke shooting from the stage, G-Dragon undoubtedly had the most pyrotechnical set of the night and the 25-year-old looked elated, taking in the arena-sized love he was receiving. He asked the crowd, “What’s my name?” when everyone obviously knew it, but the dude was lapping in his moment before humbly adding, “It’s great to be here.”  GD ended the set with his party-jam single “Crayon” that had the whole crowd shouting the addictive hook, “Get your cray on!” over the pounding beat. Confetti shot from the stage, flying down from the ceiling as the other Day 1 performers made their way back to the stage. All the artists gave respectful bows to G-Dragon upon seeing him, to which he returned, as they waved goodbye to fans one last time. B1A4 left the stage last cutely waving at the fans who were left even hungrier for Day 2 of KCON 2014. Look out for stories and video interviews with some of your favorite K-pop stars coming to Billboard’s K-Town column soon. Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2014-08-10T23:45:49+00:00",
    "url": "https://www.billboard.com/music/music-news/kcon-2014-day-1-g-dragon-iu-b1a4-more-rock-los-angeles-6214282/"
}