{
    "title": "KCON comes to NYC, proving the K-Pop wave is growing even stronger | PIX11",
    "text": "PIX11 Please enter a search term. Please enter a search term. by: James Ford Posted: Jul 5, 2019 / 08:22 PM EDT Updated: Jul 7, 2019 / 01:10 PM EDT by: James Ford Posted: Jul 5, 2019 / 08:22 PM EDT Updated: Jul 7, 2019 / 01:10 PM EDT FAR WEST SIDE — It’s based in a country nearly 7,000 miles away, but it’s a phenomenon that’s gotten red hot here in the U.S., especially in the New York City region, and is only getting hotter. Now, K-Pop — South Korean popular music and culture — has come to the Tri-state, in a big way. KCON NY has been coming to our region for the past five years, but it’s grown at such a rate that this year, for the first time, it’s being held in not one, but two very large venues, one of which is the World’s Most Famous Arena. The two-and-a-half day convention is at the Jacob Javits Convention Center on Friday evening, as well as during the day on Saturday and Sunday. Then, on Saturday and Sunday night, some bold-faced names in the K-Pop world will perform in concerts at Madison Square Garden. Even though the festivities officially began Friday night, fans started showing up late Thursday afternoon — July 4th fireworks be damned. Their all night vigil resulted in their being the first in line to pick up pre-paid tickets to KCON, and to be first in at least one other line: to gain admission to a Friday evening event, called Club KCON, in which the music, dance steps, and fashion of the K-Pop group ATEEZ was the centerpiece. The band itself was expected to appear at the event. “It’s worth anything, honestly,” said Alison Andaluz, a fan who’d been waiting since Thursday evening, at the front of the line. “You don’t get this every day, you know?” Because it’s such a unique event, KCON draws an audience from far and wide. “We’re from Orlando,” said Mailyn Stiffler, who was on line with her two high school friends Sana Sheik and Taylor Battie. “We flew in yesterday,” said Battie. PIX11 News encountered fans from as far away as San Francisco, West Palm Beach, Florida, and North Carolina. All were present to get access to Korean bands who, said fans, speak to their own issues through themes and lyrics in the music. “Depression, insomnia, dealing with bullies,” were among the topics that one fan who’d arrived Friday morning said were themes in some of her favorite K-Pop songs. She was among hundreds of people waiting in line all morning until the ticket pick-up area opened early Friday afternoon. When it did, a most unusual ritual took place again and again. Groups of fans, as well as individuals, kept screaming, shrieking, shouting, and hugging one another, even though most of them were total strangers. “I’m shaking, because I finally get to meet them,” said Kyra Elessar, a fan who’d shown up from Florida, who had just gotten tickets to see her favorite boy band, ATEEZ. “I’m just overcome with emotion, basically.” She said that she’d been following the band since their debut. The stranger-hugging ritual is the result of the way ticketing is done at KCON. Tickets for special events with particular K-Pop acts are distributed randomly to convention attendees, unless they’ve bought the highest priced admissions packet. So attendees often end up with tickets for bands in which they have less interest than others. The way the ritual works is that one fan seeks out another attendee who may have a ticket for a K-Pop group that the first fan wants to see. If the attendee they consult has gotten a ticket for the preferred group, and the first fan has a ticket for a group the other attendee wants to go to, they trade. Both people end up happy. Often, friendships form that way at KCON NY. The overall appeal for the thousands who attend is access. Most Americans are familiar with the K-Pop superstar group BTS, now that they’ve topped many music charts, have appeared on SNL, Good Morning America, and won Billboard Music Awards. A ticket to a BTS concert in New York can sell for hundreds of dollars, and while the three to four hour performance may be phenomenal, when it ends, fans have had very little actual exposure to the now-world famous band. At KCON, for the same price or less, it’s two-and-a-half days of exposure — up close — with some significant names in K-Pop, including (G)I-DLE, The Boyz, SF9, and TXT. “We have artist engagement,” said Vanessa Augsbach in an interview with PIX11News. “It’s really hard to do that if you’re not from Korea,” where all of the bands live, and have higher regular exposure to their fans. “KCON is the one place where you get to do that,” Augsbach said. She also pointed out that the convention is about all things Korean pop-cultural, including pavilions of beauty products and vendors, food, art and animation, and other aspects of one of the fastest growing economies in modern history. KCON NY 2019 runs through Sunday night at the Jacob Javits Center and MSG. Organizers said that tickets are still available. Submit Δ Copyright 2023 Nexstar Media Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Although we’re still several weeks away, Black Friday is approaching fast, so it’s a good idea to get ahead of the curve and check out early deals. Amazon sells nearly every consumer product you can think of. And if you’re looking to save, this is a great time to shop. If you have a Squishmallow fan in your household, act fast because there’s a Squishmallow Advent this year that’s going to sell out soon.  ",
    "datetime": "2019-07-05T20:22:32+00:00",
    "url": "https://pix11.com/news/local-news/manhattan/kcon-comes-to-nyc-proving-the-k-pop-wave-is-growing-even-stronger/"
}