{
    "title": "KCON's cumulative audience tops 1 million | Yonhap News Agency",
    "text": "All Headlines North Korea Sports Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies URL is copied. SEOUL/LOS ANGELES, Aug. 19 (Yonhap) -- KCON, the world's largest Korean pop music and culture convention launched, has attracted more than 1 million fans over the past eight years, its organizer said Monday. According to CJ ENM, the organizer of KCON, the convention's cumulative audience reached 1,069,000 over the weekend when the Korean wave, also called \"hallyu,\" festival was held in Los Angeles. KCON 2019 LA was held for four days from Thursday at LA Convention Center and Staples Center, drawing a record 103,000 K-pop fans, CJ Group said. The latest audience figure marked 10-fold growth over the inaugural KCON held in Irvine, California, in 2012 with the attendance of 10,000 fans, it noted. This photo, provided by CJ ENM, shows a KCON concert held at Staples Center in Los Angeles. (PHOTO NOT FOR SALE) (Yonhap)  CJ ENM has hosted KCON in North, Central and South America, Europe, the Middle East, Asia, Southeast Asia and Oceania for the last eight years in an effort for the global spread of K-lifestyle. KCON is divided into two parts -- K-pop concerts and convention programs. KCON events held in the U.S. accounted for 60 percent of the cumulative audience. During KCON 2019 LA, CJ ENM, the Ministry of SMEs and Startups, KOTRA and other agencies jointly hosted a K-collection sales promotion event and exhibition at LA Convention Center for 40 selected Korean small and medium-sized companies. Notably, 28 beauty-related companies took part in the LA event seeking to expand their overseas sales. CJ ENM said a total of 257 SMEs from Korea have participated in KCON LA over the past six years, while noting it increased K-beauty and K-food content, in particular, this year. This photo provided by CJ ENM shows a KCON convention held at LA Convention Center in Los Angeles. (PHOTO NOT FOR SALE) (Yonhap)  The highlight of KCON 2019 LA was the K-pop concerts held at Staples Center on Saturday and Sunday featuring a total of 14 K-pop groups. \"With the cumulative audience topping 1 million, KCON has grown into the world's largest hallyu festival. KCON will continue to make efforts for mutual prosperity with small and medium-sized companies and the globalization of K-culture,\" a CJ ENM official said. KCON, which was held in Japan in May and New York in July this year, will also be held in Bangkok from Sept. 28-29. ycm@yna.co.kr(END) All News National North Korea Economy/Finance Biz Culture/K-pop Sports Images Videos Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies Korea in Brief Useful Links Festival Calendar Weather Advertise with Yonhap News Agency ",
    "datetime": "2019-08-19T15:49:59+09:00",
    "url": "https://en.yna.co.kr/view/AEN20190819005600315"
}