{
    "title": "KCON LA Recap: SHINee Steals the Show | Billboard – Billboard",
    "text": "Celebrating its fifth anniversary, KCON LA was bigger and better than ever. Beginning Friday, thousands of K-pop fans from around North America descended on Los Angeles to participate in the… By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tTamar Herman Celebrating its fifth anniversary, KCON LA was bigger and better than ever. Beginning Friday, thousands of K-pop fans from around North America descended on Los Angeles to participate in the convention and see their favorite stars. By day, KCON LA Presented by Toyota was filled around the clock with panels of industry insiders, screenings of popular films and television shows, and a wide array of Korean-oriented booths featuring everything from complimentary makeovers to exploring 4D technology. But the nighttime was all about the music. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t08/01/2016\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tExplore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news While Friday night had a special Klub KCON event featuring just two stars (soloists Dean and Amber of f(x)), Saturday and Sunday’s M Countdown concerts, held at the sold-out Staples Center, were what fans waited all year to see.  KCON pulled out all the stops for its first night of the anniversary event. To get things started while people found their seats, Eluphant hyped up the crowd during an absolutely lit opening set. While unknown to most of the concertgoers, the hip-hop duo’s hyperactive energy set the tone for much of the night. After their departure, the arena filled with applause as Quincy Jones came onstage to present a scholarship to a student studying at Berklee College of Music. The hourlong opening segment came to a conclusion with the arrival of actor Lee Min Ho as he segued from ceremony into the main event. The screams of delight erupting from the crowd to see one of the most popular Hallyu, or “Korean Wave,” stars in person was just the first batch of that evening’s deafening cheers. 5 Songs by Girl Groups Slaying the K-Pop Summer Moments before 8 o’clock, the current sweethearts of South Korea I.O.I arrived to kick things off for real. A temporary group brought together by a Korean television show and only established for a year, the 11 young women won over the crowd with their infectious “Dream Girls” and a suggestive performance of their EDM-virus “Pick Me.” To say that the latter is addictive would be underestimating the catchiness of its hook: it’s downright dangerous. The clear fan favorites of the bunch were English-speaking rapper Jeon Somi and vocalist Kim Chungh as they thanked fan for coming out to support I.O.I. The crew of schoolgirls brought things to a close with the romantic ballad “When the Cherry Blossoms Fade,” ending their first (and what is likely their last) group appearance in the US.  The sweet song brought on stage the night’s MCs, f(x)’s Amber and SHINee’s Key. The pair would perform later in the evening but playfully greeted fans before announcing a special video message. Members of EXO, Wonder Girls, and soloists Lee Hi and Crush praised Dean, the singer-songwriter whose alt R&B descended on the Korean music world last year. Appearing after the mass of I.O.I members, the handsome 23-year-old looked a bit small on the large Staples Center stage but his smattering of fans welcomed him with shrieks of delight. It took two songs- “Bonnie and Clyde” and “I’m Not Sorry” for Dean to achieve rock star status as the audience roared with delight at his every move and sang along to his crooning. Korean Boy Band GOT7 Discusses Breaking Records, Selling Out Shows & Dabbing Dean’s short set was replaced by the six women of GFriend, the athletic sweethearts who can do no wrong in South Korea. Walking through the pit protected by security, the girl group greeted their American fans for the first time with smiles and waves before performing their latest, the fluttering “Navillera.” The group, which debuted last year and gained renown following a dance video going viral, made their complex routines seem easy as vocalists Eunha and Yoojoo wowed the audience with their outstanding belts mid-choreo. By their final song, “Rough” with its ballet-inspired routine, anyone in the crowd who hadn’t been aware of GFriend already had clearly joined the throngs cheering on the group’s animated performance. Three soloists arrived next, beginning with Block B’s frontman and rapper Zico eliciting screams for his tropical hip hop track, “Boys and Girls.” Fellow member U-Kwon helped out with some smooth vocals, balancing Zico’s hardhitting raps.The pair received a warm welcome from the crowd, but little compared to what would greet them the rest of their groupmates later that night.  After finishing the song, U-Kwon left the stage and a split second later Dean had returned to perform his award-winning “Pour Up” with Zico. Collaborative songs are a dime a dozen in South Korea, but the opportunity to see the two men was too much to handle for some concertgoers, who cried out in response demanding more from the pair. Luckily, Amber skateboarded onto stage to fill the void with a performance of her colorful funk pump up anthem “Shake That Brass” with I.O.I’s Chungha filling in the power vocals for Girls’ Generation’s Taeyeon. 8 Most Promising K-Pop Debuts From the First Half of 2016 As a member of one of Korea’s most versatile girl groups and a constant defyer of the norms of the K-pop world, Amber had some of the biggest reactions of the night as she performed “Shake That Brass” but it wasn’t until things toned down a bit that she got serious with the English-language “Borders.” While known as f(x)’s rapper, Amber showed off her softer side with the airy track and brought fans closer through the inspiring message of the song. Next up were the surprise stars of KCON LA 2016. Turbo has been around since 1995 but is better known to the average 2016 K-pop fan as the group with frontman Kim Jong Kook, a star of the popular Korean television show Running Man. But the 20-minute set reaffirmed Turbo’s reign as kings of the genre. The special performance began with GFriend and boy band Astro to the stage to cover two of Turbo’s biggest hits. The trio appeared and sung their 2015 single “Again” followed by older hits “Twist King” (joined by GFriend and Astro), “Loveable,” and “Reminiscence” (which many newer K-pop fans knew thanks to Super Junior’s Kyuhyun releasing a cover of the song in 2012). By the time they finished their performance, just about every member of the crowd was cheering along with the legendary team and dancing to the beat, regardless of if they knew the music or not.  If Turbo was the breakout act (can you breakout after 20 plus years in the industry?) Block B was exactly what KCON had wanted and were welcomed as if they were headliners. Their position late in the lineup and the crowd’s frenzied screams emphasized the group’s dramatic rise in popularity since last year’s KCON LA performance, where they performed second. Between recent hits from both the group and individual members, Block B has come a long way since facing an uncertain future in 2013 after suing their company and setting up their own label. Block B showed their versatility through a range of songs beginning with the sentimental “Toy” and ending with a rock version of “Very Good,” killing it with slick vocals and spitfire raps. If they were to come back for a third year in a row as headliners, it’s highly unlikely anybody in the roaring crowd that night would be upset. Ailee Talks New Jersey Homecoming, Haters & What Empowers Her at KCON New York 2016: Exclusive But for this year at least the first night of KCON LA was brought to its zenith with SHINee. The quintet has been popular since their inception in 2008 and, even though they had just been in LA a few months before at another festival, their fans came out in droves. Beginning with their concert intro track “Into The SHINee World,” the quintet soon had the whole crowd singing along to last year’s house-pop single “View.” SHINee had the audience swaying as the five men earnestly performed polished versions of “An Encore” off of their Odd album and “Beautiful” from 2013’s Dream Girl – The Misconceptions of You before initiating near-riot levels of cheers with their amped up EDM finale “Everybody” and the matching body-popping choreography. These five never disappoint and the short but sweet set left the KCON audience clamoring for more even as all of that night’s performers arrived on stage to wave goodbye.  But, luckily for many of the fans, there was another day of con and concert before KCON LA 2016 came to an end. Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2016-08-02T00:32:27+00:00",
    "url": "https://www.billboard.com/music/music-news/kcon-la-gfriend-dean-block-b-shinee-7454451/"
}