{
    "title": "\n\tKCR opens Wave Rock tech park Phase 2 in Hyderabad - The Hindu\n",
    "text": "To enjoy additional benefits CONNECT WITH US July 15, 2014 04:57 pm | Updated December 15, 2016 04:36 am IST - HYDERABAD: COMMents SHARE READ LATER HYDERABAD. 15/07/2014:The chief minster of Telangana K. Chandrasekhar Rao speaking at the inauguration of phase 2.1 and launch of phase 2,2 of Wave Rock IT Park at Gachibowli in Hyderabad on Tuesday.-Photo: Mohammed_Yousuf - Reiterating Telangana government’s commitment to turn Hyderabad into a world class smart city, the Chief Minister, K.Chandrasekhar Rao, on Tuesday assured all possible support to the Information Technology (IT) sector looking to invest here. Mr.Rao who inaugurated the second phase of Tishman Speyer and ICICI Venture’s Wave Rock at Nanakramguda, said the new government was putting in place all required steps to ensure the growth of IT sector in the city. Shortly, the government would be coming up with single window clearance facility to ensure fast and efficient clearances for investors, he said while promising all support to Tishman Speyer’s plans to develop Technocity, an integrated green city at Tellapur. “Our chasing cell would ensure that investors are brought straight to me and after required processes, hand over all clearances at the earliest for them to start work,” Mr.Rao said. The Chief Minister also declared zero tolerance for corruption and promised initiatives to ensure law and order and a peaceful working environment. IT Minister K.T.Rama Rao said factors such as political instability and lack of decisive leadership among others hampered the growth of Hyderabad. “Now there is a decisive leadership and political stability and we will ensure the city’s growth in the field of IT,” he said. Appreciating Tishman Speyer for the new block, Mr. Rama Rao said he looked forward to the firm adding more such iconic workspaces to the landscape of Telangana. Phase 2.1 of Wave Rock, developed with an investment of around Rs.200 crore, adds approximately 7 lakh square feet of IT workspace and accommodates nearly 7,000 IT professionals. Companies such as DuPont and Capgemini have already taken space in this phase while Phase 2.2 — to be developed at Rs.250 crore — was launched on Tuesday. Tishman Speyer is investing Rs.1,050 crore in the Wave Rock project, which once completed, would be spread over a total of 2 million square feet. Jerry Speyer, Chairman and Co-Chief Executive Officer, Tishman Speyer welcomed the government announcement on single window clearance and said they would continue to work on Tellapur Technocity project. Later speaking to presspersons, Mr.Speyer said they were heartened by the positive signals from Prime Minister, Narendra Modi and Chief Minister, K.Chandrasekhar Rao. “Our plans for pan India is to expand business and we hope things would be done here quickly and efficiently,” he said. The company was looking at all the large cities and was optimistic of taking up new things there, he said adding,” we invest where we can do more than one project”. COMMents SHARE Hyderabad\n\n/\n\nconstruction and property\n\n/\n\nIT Enabled Services BACK TO TOP Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. ",
    "datetime": "2014-07-15T11:27:08.000Z",
    "url": "https://www.thehindu.com/news/national/telangana/KCR-opens-Wave-Rock-tech-park-Phase-2-in-Hyderabad/article11268675.ece"
}