{
    "title": "KCR’s gamble pays off, pink wave echoes in Telangana - India Today",
    "text": "Listen to Story A resounding pink wave echoed in Telangana on Tuesday (December 11) as K Chandrasekhar-led Telangana Rashtra Samithi (TRS) registered an impressive victory in the state. KCR's party dominated proceedings since counting began at 8 am and maintained its lead thereon. The Congress-led People's Alliance or Praja Kutami (an alliance of Congress, TDP, TJS and CPI) failed to pose any challenge to the KCR's party, which will form the next state assembly. While KCR, his son KT Rama Rao (KTR) and nephew T Harish Rao registered thumping victories from their respective constituencies, prominent Congress leaders including K Jana Reddy, A Revanth Reddy, Komatireddy Venktat Reddy, DK Aruna, J Geeta Reddy, Poonam Prabhakar and party president Uttam Kumar Reddy's wife Padmavati Reddy lost from their respective constituencies. Congress' key alliance partner Telegu Deasam Party also suffered deep cuts in at least 12 seats, mainly from the key Greater Hyderabad Municipal Corporation region.  TDP MLA candidate from Kukatpally, Nandamuri Suhasini, who happens to be the granddaughter of party founder NTR also faced defeat by TRS. Meanwhile, Asaduddin Owasi-led AIMIM successfully retained all its seats except one in Rajender Nagar to TRS. The Bharatiya Janata Party also met with a similar fate in Telangana as four of its sitting MLAs including K Laxman and G Kishan Reddy lost their seats to TRS candidates. In contrast, the saffron party won 5 seats in 2014 election. However, only T Raja Singh from the BJP managed to retain his seat. Reacting to the outcome, senior TRS leader KTR thanked people for the mandate and said: \"Grateful, indebted and Humbled. Thanks Telangana for keeping the faith in KCR Garu and giving us another opportunity to serve you.\" CM K Chandrasekhar Rao's was congratulated by several leaders including West Bengal Chief Minister Mamata Banerjee, Biher Chief Minister Nitish Kumar, Karnataka Chief Minister Kumar Swamy and Andhra Pradesh opposition leader Jagan Mohan Reddy. TDP chief and Andhra Pradesh CM N Chandrababu Naidu also congratulated KCR. It seems that KCR's gamble to dissolve the state assembly months before its tenure has paid off. Opposition cries foul Shocked by the defeat, Congress chief Uttam Kumar Reddy alleged EVM tampering and approached election commission. \"Going by the distorted trends, there is strong suspicion that EVM machines have been manipulated. We demand 100 per cent counting of VVPAT paper trails must be taken up in all constituencies,\" said Reddy. Rubbishing the claims, TRS MP K Kavitha slammed leaders from opposition Congress party for accusing them of EVM tampering. \"The losing party always says the EVMs have been tampered with, this is absolutely false. Even the Chief Election Commissioner [CEC] in a press meeting yesterday said that it is not possible to tamper EVMs. People have given victory to TRS, what Congress is claiming is false,\" she said.\nALSO READ | TRS set to form government in Telangana with thumping majority\nALSO WATCH | TRS crosses majority mark in Telangana\n\nEdited By: Meghna SenPublished On: Dec 11, 2018--- ENDS --- ",
    "datetime": null,
    "url": "https://www.indiatoday.in/elections/story/kcr-s-gamble-pays-off-pink-wave-echoes-in-telangana-1407529-2018-12-11"
}