{
    "title": "Keys to the Kingdom - Language Magazine",
    "text": "/ forever Sign up with just an email address and you get access to this tier instantly. / year Pay now and you get access to exclusive news and articles for a whole year. / month By agreeing to this tier, you are billed every month after the first one until you opt out of the monthly subscription. Saudi Arabia has poured billions of dollars into generous five-year scholarships for Saudi students studying in the U.S. The scholarships are all-inclusive for up to five years and cover full tuition, fees, housing, and health benefits for students and family members, and are topped off with round-trip tickets back home each year. Saudi Arabia now outpaces China as the fastest-growing source of international students in the U.S. Saudi student growth over the last ten years has been nothing short of astronomical, and there is no other scholarship initiative in the world that comes close to the size and scope of what is happening in Saudi Arabia. In 2003, there were fewer than 2,500 Saudi students in the U.S. at universities and colleges, but then in 2005, a new scholarship initiative grew out of a meeting between Crown Prince (now King) Abdullah and President George Bush. The crown prince ascended the throne in 2005, and by the next year, in 2006, there were 11,116 Saudi students enrolled in the U.S. under the King Abdullah Scholarship Program. Caryle Murphy, in her book A Kingdom’s Future: Saudi Arabia Through the Eyes of its Twentysomethings, reports that there are “more than 145,000 young Saudis now studying in 30 countries around the world” and “almost half are in the U.S., where for the 2012-13 school year, 71,026 Saudis are enrolled in language institutions, colleges, and universities.” Murphy adds that the King Abdullah Scholarship Program finances most of the Saudis in the U.S., with only 3,153 Saudi students paying their own way and another 6,600 on employers’ scholarships. Almost 95% of Saudi scholarship students begin with a year of English language training before starting their academic fields of study, according to the Saudi Arabian Cultural Mission (SACM) to the U.S., the agency that administers the scholarship. Saudi students make up the largest block of enrollments in many intensive English language programs across the country. For instance, the Center for English Language and Culture at Western Michigan University in Kalamazoo enrolled a record 267 students in fall 2012, and nearly half were from Saudi Arabia. Some intensive English language programs report even higher percentages of Saudi students. While surely IEPs welcome the incredible enrollment growth and the full year of scholarship funding that the Saudi scholarship program provides (and universities welcome the four years of out-of-state tuition from the Saudi students who successfully complete the intensive ESL programs), there are obvious instructional, organizational, and diversification challenges that come with such a large population from any one country. Before the current Saudi wave lifted enrollments, IEPs rode a Korean wave, and a sustained Japanese swell before them, and, surprising to some, an Iranian surge before that. Each large enrollment wave is culturally, linguistically, and educationally unique. New strategies, programs, and policies are needed in IEPs to ensure academic success and meaningful English language acquisition among the Saudi students coming in record numbers. Since 2006, the American English and Culture Program (AECP) at Arizona State University has been a popular destination for Saudi students. In the very first year of the King Abdullah Scholarship Program, over 50 Saudi students enrolled in the university’s IEP. Immediately, the language program provided ten hours of free tutoring to all Saudi students, staffed by a veteran ESL instructor who had taught English for several years in Saudi Arabia. Study skills and learning strategies were introduced with the free assistance. Graduate students in the MA-TESOL program at ASU were hired as language assistants to provide extra language practice, cultural exchange, and a warm and supportive environment for learning outside of the classroom. Soon, curricular changes followed. Two of our first Saudi scholarship students complained that the AECP provided a number of business English classes but no ESP courses in engineering. The next semester, we offered an English for Engineering elective, the first of a new menu of elective classes for students preparing for science and technology fields of study at Arizona State University. Bridge courses and concurrent enrollment courses were also made available to help Saudi students. Enrollments soared. Word of mouth doubled the Saudi scholarship numbers the next year. By 2010, there were 248 Saudi students in the intensive ESL program, out of a student body of 969 total students from 52 countries. Continued growth has meant continued changes, and that includes marketing strategy modifications. Over the last three years, the numbers of Saudi students in the AECP has continued to grow, but the overall percentage of Saudi scholarship students has remained just below 30%. For the 2012-2013 academic year, the AECP reached a total of 1,341 international students from 53 countries, with Saudi scholarship students accounting for 373 of the total enrollments. Maintaining diversity in the classroom is extremely important in an IEP where students are practicing their English with one another. Some IEPs have capped Saudi student enrollments once their classrooms have become mostly Arabic-speaking and monocultural. To promote diversity, the ASU language program revised its marketing strategy: no Saudi agents (and no agent commissions for Saudi agents) for the last three years, while more than doubling marketing dollars and marketing efforts in other countries to bring in higher numbers of students from different language and cultural backgrounds. Even with planning for and promoting greater country diversity as a way of off-setting a sizeable Saudi student population, students from around the world do not all start learning English in IEPs at the same language level. The AECP offers six levels of English language training, and the majority of Saudi students begin their English language learning at the first or second levels (the beginning levels), while most of our Asian students, for example, begin at intermediate levels of English. Once Saudi students rise to the intermediate and advanced language levels of the program, they are joined by students from dozens of other countries in a dynamic multi-cultural classroom. The AECP has found it difficult, however, to recruit enough “beginning level” students from other countries to provide the diversity desired at the earliest stages of language learning for the Saudi scholarship students. This is where the graduate MA-TESOL students have played a valuable role. For more than 25 years, the AECP provided a strong Conversation Partners program, but it had mostly been utilized by students in the upper levels of the language program. So, two years ago, a new conversation program, Conversation Groups, was implemented to help lower level students and primarily Saudi scholarship students to use English outside of the classroom and to make friends. Hundreds of students at lower language levels have been placed in small conversation groups of three or four students for weekly or semi-weekly conversation practice outside the classroom, facilitated by graduate students. The language program now hires more than 15 native-speaking graduate students each year for this and other purposes. There is now a continuum of weekly conversation opportunities that includes Conversation Groups, Conversation Partners, Conversation Club, and many community opportunities for friendship, language practice, and cultural exploration through events like the Lunch Chat, an indoor picnic in the ASU Honors Cafeteria every session where students get to eat all they want and talk all they want for one hour. Over 500 students show up for Lunch Chat!\nIn a similar way, the ASU intensive English program now offers a Beginning Reading Theater as well as an advanced version, where students read an ESL reader and watch a movie with the same title, like Anne of Green Gables, Lincoln, Les Miserables, and King Kong. Last year, small reading groups were begun at the beginning levels with students reading the book Aladdin in simple ESL reader form with the assistance and support of language assistants and helpers. Many Saudi students tell us that reading and writing are their weakest language skills, so we purchased $20,000 worth of new ESL readers at all language levels and donated them to the main ASU library, near our language program offices, so that students would build academic and study skills, like going to the library and checking out materials, as well as building the reading, vocabulary, and grammar skills that are reinforced and developed through regular and extended reading. Many other program refinements and enhancements have been developed with our Saudi student population in mind. One such area was with the attendance and tardy policy. Classes start on time, attendance is taken, and minutes missed from class will affect grades and overall performance. We have fewer absence problems with higher expectations and tighter program policies and, of course, very clear communication about policies. Grading policies have been carefully reviewed and revised, too. Students must earn grades of “C” or better to be promoted to the next level, and students must have grades of “A” or “B” to pass the most advanced level and must be able to write research papers, give PowerPoint presentations, participate in group work, and give a poster session presentation in public. Professional development has been at the heart of providing quality education for all of our students, and every session (every eight weeks), we devote a half-day to professional development workshops, presentations, and training. For the last twelve years, faculty in the AECP have had at least one half-day cultural workshop each year focusing on a country and the language, culture, and education system of that country. Over this time, Saudi Arabia has been our focus three times. We bring in a panel of experts, sometimes former students, and we learn together how best to serve a certain student population. At the end of the Saudi workshops, we have enjoyed full Middle Eastern meals, including a variety of baklava for dessert. The faculty also has formed reading circles, and each member of the program was given the book Understanding Arabs: A Guide for Modern Times by Margaret K. Nydell. Other books and materials have been given to all faculty members to help them better serve Saudi students. Serving Saudi students is now something we feel we are good at doing; however, we still make mistakes and are still learning how best to serve this dynamic community. Over the years, the Saudi government has invested greatly in its students so they can enroll in our intensive ESL programs. The best thing we can do is to take the profits generated by this sizeable scholarship and reinvest them in the success and futures of our Saudi students. Mark D. Rentz is director of the American English and Cultural Program at Arizona State University. Language Magazine is a monthly print and online publication that provides cutting-edge information for language learners, educators, and professionals around the world. LanguageMagazine 2023 ",
    "datetime": null,
    "url": "https://www.languagemagazine.com/keys-to-the-kingdom/"
}