{
    "title": "  KFC launches Spicy Korean Burger",
    "text": "KOREAN FLAVOUR: Ahmad Zaki (second left), Rohan St George (third right), CEO of KFC & Pizza Hut Restaurants; and Ling Mee Jiuan (right), senior vice president, KFC Malaysia, share the delightful moment with the K-Pop dancers at the official launch. KUALA LUMPUR: KFC Malaysia has created another Korean masterpiece that comes in the form of a burger. Introducing the Spicy Korean Burger, which is set to bring out the Korean star in everyone! Featuring a blend of seven chilies from around the world and a special spicy Korean glaze, the burger promises customers, especially the youth, an unforgettable ‘burger’ experience! “The current Korean wave and the amazing feedback on the Spicy Korean Crunch have inspired us to create this special burger sensation. The Spicy Korean Burger will give you a chance to experiment with the different offerings from KFC. The youth and young adults who are always on the go will surely love this latest addition, as well as those with adventurous taste-buds and not forgetting Korean fanatics,” said Datuk Ahmad Zaki Zahid, managing director of QSR Brands (M) Holdings Sdn Bhd, operator of KFC Malaysia at the launch of the product at KFC Pavilion. The key to what makes this burger so special is the tingling spiciness of the crispy chicken fillet, coupled with its mouth-watering glaze. These ‘stars’ are then sandwiched in between KFC’s burger bun, fresh lettuce and cheese. Burger lovers who crave for more spice will definitely get what they bargain for in every bite of the Spicy Korean Burger. Well known over the years for their Original Recipe and Hot & Spicy fried chicken, KFC is no stranger when it comes to chicken burgers. From the truly classic all-time favorite Colonel Burger to the ever popular and well-loved Zinger (now available in three versions), customers can expect much more from KFC as they are always on the lookout for what’s hot and what’s trending as sources of inspiration. The Spicy Korean Burger is poised to add more choices to KFC’s already colourful burger range. ",
    "datetime": "2013-05-20T08:16:11+08:00",
    "url": "https://www.theborneopost.com/2013/05/20/kfc-launches-spicy-korean-burger/"
}