{
    "title": "Kim's cheer squad 'charm offensive' | Reuters",
    "text": "Discover Thomson Reuters By Reuters Staff 4 Min Read PYEONGCHANG, South Korea (Reuters) - They cheer, dance and sing in perfect unison. But these are not your ordinary cheerleaders. Charm offensive North Korea’s “Army of Beauties”, an all-female cheerleading team, have fascinated and perplexed South Koreans since the squad arrived at the Olympic winter games in Pyeongchang. The 229 cheerleaders are part of a roughly 400-strong delegation of artists, musicians and 22 athletes sent from the North amid a thaw in cross-border tensions over Pyongyang’s weapons programs. While South Korea saw an opportunity for “reconciliation and unity,” Japan urged the world not to be naive about the North’s “charm offensive.” Culture clash The cheerleaders have been a fixture at games played by the unified Korean women’s ice hockey team, which features 12 players from the North. But they struggled to connect with young South Koreans at the team’s first game – an 8-0 shutout by Switzerland. The North Koreans in red jumpsuits and singing old pop songs contrasted with mini-skirted dancers from the South who got the crowd bopping to rap, rock and K-pop music. Some fans were unnerved when the squad put on a man’s mask in perfect unison.“They were fresh but a bit weird to me,” said university student Kang Gwang-mo. “Unify the Motherland” The squad made a surprise appearance at a South Korean men’s hockey game, cheering at their first Olympic event not featuring a Northern athlete. Unlike the women, the men’s team was not a South-North combination. The 150 cheerleaders sported white, red and blue outfits, waved flags showing the outline of an undivided Korean peninsula, and shouted encouragement such as “Unify the Motherland” and “Win, win, our athletes win.” The Czech Republic edged out South Korea 2-1. Détente on ice North Korean figure skating pair Ryom Tae Ok and Kim Ju Sik won over the home crowd’s hearts despite falling well short of a medal. Ryom, 19, said she was nervous before their skate, but the sight of the cheerleaders and applauding South Korean fans “encouraged me a lot.” Marching songs The squad’s appearances outside the Olympic venues have been tightly controlled. One day they visited a beach and had lunch at a local restaurant. They also put on joint performances with a North Korean marching band that played a mix of Korean folk music and marching songs. Police kept spectators and journalists from getting too close. “They didn’t look free even during their free time, which looked strange,” said Heo Soo, a 27-year-old South Korean after watching a performance. “WE ARE ... ONE!” The squad was the only show at the Jeongseon Alpine Centre on a day when high winds wreaked havoc on the women’s slalom. Long after the race was postponed, the cheerleaders and a group of blue-capped, pro-unification South Koreans stayed on, cheering and singing as other spectators shot videos and pictures. “WE ARE…” yelled the North Koreans, sporting sunglasses and all dressed in red ski jackets and white and red hats. “ONE!” replied the smaller group of South Koreans. Fake Kim and the “goal” The united Korean team scored a historic first Olympic goal in their 4-1 loss to Japan. It sent the crowd and cheerleaders into a frenzy. Later in the game, the cheerleaders were briefly wowed by the apparent, sudden arrival of their leader, Kim Jong Un. He turned out to be an Australian impersonator who identified himself only as Howard. Some squad members immediately averted their gaze as he smiled and waved. Others struggled to stifle a quick laugh. In North Korea, anyone impersonating a member of the ruling family would be considered blasphemous. The North Korean cheer squad is expected to attend the closing ceremony of the Pyeonchang Games on Sunday. Reporting by Hyunjoo jin, James Pearson, Gabrielle Tetrault-Farber, Mark Trevelyan, Yiming Woo, Writing by Darren Schuettler, editing by Our Standards: The Thomson Reuters Trust Principles. All quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays. ",
    "datetime": null,
    "url": "https://www.reuters.com/article/us-olympics-2018-northkorea-cheerleaders-idUSKCN1G71EY"
}