{
    "title": "\r\n             KOCCA: Korea Creative Content Agency - TV Shows | Screenings | C21Media        ",
    "text": "KOCCA: Korea Creative Content Agency - TV Shows South Korean content has been selling around the world for a long while but last year saw a boost in demand, according to Kocca’s Do Hyoung Lee, who talks us through the content export agency’s 21-title playlist on C21’s Digital Screenings.  It’s no secret that South Korean dramas and formats are hot property and have been for some time now. Scripted shows like The Good Doctor (from Korean public broadcaster KBS) and entertainment formats such as The Masked Singer (MBC) and I Can See Your Voice (CJ ENM) have travelled to all corners of the globe in recent years, either in their original form or as IP for local production.  Do Hyoung Lee, general director at the broadcasting division of the South Korean government’s Korea Creative Content Agency (Kocca), says the origins of the K-format boom can be traced back to 11 years ago.  “Korean formats started to get noticed in China in early 2010 and have since seen remarkable achievements in the global market,” he says. “Following the success of The Good Doctor and The Masked Singer, another K-entertainment show called I Can See Your Voice broadcast in the US on Fox and became the most watched programme among those on air in that time period.  “This achievement led to the BBC, the UK’s public broadcaster, deciding to air its own adaptation of the show as its first ever Korean format.”  According to Kocca data gathered from nine of South Korea’s domestic broadcasters, 102 K-formats have been exported to 204 channels in 65 countries over the past decade. And these figures don’t include subsequent seasons based on the same format.   “The influence of K-formats is getting bigger as they have been exported to markets that didn’t import them before, such as North America and Europe, now accounting for 34% of format exports,” Lee says.  “The proportion of sales now coming from outside Asia has increased from 25% to 48%,” adds the exec, underscoring the impact of The Masked Singer and I Can See Your Voice.  But things have moved on from even these relatively recent titles, according to Lee. He speaks of a “New Korean Wave” of 2020, the year when South Korean movie Parasite won four Oscars, for Best Picture, Best Directing, Best International Feature Film and Best Writing (Original Screenplay).   “The New Korean Wave has continued with Korea’s TV content, particularly K-dramas. For example, Crash Landing on You was one of 2020’s hottest dramas,” Lee says. The series aired on CJ-owned cable channel TVN in South Korea and on Netflix worldwide, and has emerged as the highest-rated TVN drama ever and the third highest-rated South Korean TV drama in cable TV history.  “Furthermore, Korean zombie movie #Alive was ranked number one on the Netflix global movie chart in the US, France and Australia, while K-pop documentary Blackpink: Light Up the Sky reached number six in its first week of streaming,” adds Lee.  One factor driving the New Korean Wave is the growth of streaming platforms. Global players like Netflix have been busy commissioning Korean content, offering “lavish investment in production,” says Lee, allowing shows from the country to reach “new limits.”   Streamers have also allowed K-content to embrace certain themes and tones that wouldn’t be allowed by traditional broadcasters in Korea. For instance, Netflix Korean original Extracurricular was “the drama touching Koreans’ hearts the most in 2020,” says Lee, but it could never have been produced for local broadcast or cinema release “given its rating and shocking subject matter,” the exec says.  Furthermore, apocalyptic horror Sweet Home, another Netflix Korean original series, “clearly displays the hottest trends of Korea’s recent TV content, such as the expansion of genres and subjects, new types of series blurring the line between TV dramas and movies, and global content based on super IP,” says Lee.  Another consequence of the rise of streaming is increased demand for shortform and midform content. “Since [South Korean streamer] Kakao TV and Netflix have recently presented more premium midform dramas with 20- or 30-minute episodes, like Daughter-in-Law and Lovestruck in the City, it is expected for shortform and midform to get more popular,” Lee says.   Over the past few years, the keen-eyed might have also noticed a trend for K-dramas to be adapted from popular webtoons, particularly in the shape of the edgier series ordered by cable channels and streamers. Recent examples include Netflix’s Love Alarm, Strangers from Hell, All of Us are Dead and Sweet Home; Itaewon Class on JTBC; Cheese in the Trap on TVN; and Extraordinary You on MBC.  “In the content industry, where the biggest deals are about obtaining IP, one of the most attractive products is obviously the webtoon,” says Lee. “They have unique characters, fast-paced storylines and subjects appealing to the younger generation. Webtoons are the number-one choice of millennials, preferring this form of video and storytelling with no limitations to subject and content, which gives rise to strong fan communities.  “Plus, under the current economic circumstances, a webtoon is regarded as one way of reducing risk. With a sharp eye for visualisation and editing, a webtoon is highly likely to get a greenlight for investment and production in 2021.   “Another attractive option is the web novel. There has been growing competition among platforms such as Kakao Page and Naver Series for the exclusive rights to web novels as the basis for webtoons, dramas and movies.”  Korean content is certainly booming at the moment, driven in part by these new sources of IP, but the country isn’t resting on its laurels and is instead reaching out to international buyers with new documentaries, dramas, entertainment formats, reality shows and animation.  “Since the Covid-19 pandemic, online promotion and marketing has become ever more important. With fewer opportunities for finding new buyers, it has also been needed to increase the number of clients,” says Lee. “Against this background, Kocca has made efforts for companies looking to expand overseas exports by promoting them with major online media.”   As such, for its Digital Screenings playlist, Kocca has “selected shows based on their content competitiveness, their capacity for export and their willingness to promote overseas,” Lee notes.  The playlist comprises 21 programmes from 16 South Korean companies. For buyers seeking factual fare, from public broadcaster KBS comes astronomy documentary 23.5 (4×50’), while the Korean/Italian/Brazilian coproduction The Pandemic (4×60’), from MBC, adds some Covid-19 topicality to the slate.  Other factual titles on the list include gender biology doc Love Machine (2×50’), from EBS; Back to the Books (4×60’), from Young & Contents; and wildlife series Chaser of Wildlife, CASAD (4×52’), from Wildtale. More natural history is on offer in The Last Wildlife (2×50’), from Hong Pictures, while 1,600 shortform episodes of animal behaviour programming from pet-themed channel Happy Dog TV are also in the mix.   South Korea is riding high in the entertainment format sector, and plenty of buyers around the world will be keen to check out the new K-formats on offer. Titles include survival show Law of the Jungle (436×70’), from SBS Contents Hub, and SBS K-Pop VR ZON (150×5’).  The playlist also features well-travelled talent show I Can See Your Voice (12×60’), from CJ ENM, and music gameshow Lotto Singer (16×120’), from SBS-owned Format East and The Masked Singer creator Wonwoo Park.  For buyers seeking entertainment content with a reality twist, check out Heart Signal, a suspenseful romance reality show from Channel A that follows the lives of eight housemates. The same broadcaster is also behind Good People, centring on eight law students chosen to work at a renowned law firm for a month.   On the scripted front is Penthouse S1: War in Life (21×70’), from SBS Contents Hub Co, while JTBC Studios has a remake of the BBC’s Doctor Foster called The World of the Married (16×70’) available to license. JTBC Studios is also behind crime drama The Good Detective (16×70’) and Graceful Friends (17×70’), described as the Korean version of Desperate Housewives, this time with a male twist.  Fresh drama from Channel A includes telenovela Lie After Lie, while AK Entertainment’s female-led web series Mensore can be presented as an 11×12’ series or a 1×95’ movie. With a more comedic tone, Bubble Up (10×12’) is another shortform web series, this time from Yoon & Company. Last, but by no means least, comes an animated series from Hong Dang Moo called Ppoppoppo Friends (100×25’), which has been a children’s hit in South Korea for the past 40 years.  Plenty of new shows for buyers to see via C21’s Digital Screenings this week, then, and an opportunity for international buyers to surf the New Korean Wave. Extraordinary Attorney Woo, the latest drama phenomenon from South Korea, has transformed the fortunes of a local TV channel and is set to wow audiences at Mipcom.  Having spent the summer firmly planted in the global top 10 of Netflix’s most watched non-English-language originals, Extraordinary Attorney Woo has lived up to its name since launching on ENA in South Korea in June.  The series has delivered the Skylife-owned satellite channel’s highest ever ratings, transforming its fortunes overnight since it debuted. Extraordinary Attorney Woo is also the seventh highest-rated drama in Korean cable television history and the sixth highest-rated TV drama by the number of viewers, with a final episode that pulled in almost 4.5 million viewers in August.  Starring Park Eun-bin, the show follows a rookie female attorney with autism spectrum disorder who is hired by a major law firm in Seoul. Being different from her neurotypical peers, her manner of communication is seen by them as odd, awkward and blunt. However, with each legal case and through her intelligence and photographic memory, she becomes an increasingly competent attorney.\nREAD MORE Jessie K.M Jeong, vice president and chief operating officer at South Korean cultural export agency KOCCA, looks ahead to the upcoming BCWW event in Seoul and explores trends in the production and distribution of K-content.  How will BCWW 2022 be different from previous editions of the event?\nBCWW 2022, unlike its previous edition which was conducted as an online market in 2019 due to the spread of Covid-19, will be organised in an offline format in conjunction with online markets. This year’s event will be attended by 168 local and international content companies as well as 609 buyers from 31 countries.  On its 22nd anniversary, BCWW 2022 aims to provide sustainable and lucrative network and business opportunities for stakeholders involved in the broadcasting industry at both home and abroad under the theme ‘Play the New Content, Dive into the BCWW.’ The event will also feature conferences addressing current trends in the broadcasting industry, presentations on emerging content, IP pitching and various other programmes.  BCWW 2022 will be a foundation for exploring newly emerging content and more effective content businesses that could complement the limits and challenges of online markets.  After two years of Zoom meetings, how important will it be to have BCWW in the real world?\nBroadcasting content markets not only serve as commercial platforms for purchasing or selling content but also as social platforms for interactive engagements and networking.\nREAD MORE Do Hyoung Lee, general director of broadcasting at Korean cultural agency Kocca, explains the ongoing demand for South Korean content while introducing 18 new shows to the international buying community.  South Korean drama has been a global phenomenon for many years now, with wave after wave of hit shows spreading out from Asia and reaching the US and Europe in recent years.  But things have certainly moved on from the good old days of Winter Sonata, the KBS hit that put Korean drama on the global map almost 20 years ago. Things have changed even from the more recent crossover hits like The Good Doctor, another KBS show from 2013 that was successfully adapted for ABC in the US in 2017 and travelled the globe.  Since then, the streaming boom – both within South Korea and internationally – has changed the landscape for Korean drama in a number of ways. Over to Do Hyoung Lee, general director of broadcasting at South Korean cultural agency Kocca, to explain how.  “The popularity of Korean drama has continued globally this year, just as it did in 2020,” he says. “As competition has been getting more fierce among domestic and foreign online streaming services, such as Netflix, Disney+, Wavve and TVing, demand for Korean drama has increased and there has been more investment in production. This trend has stimulated the diversity of Korean drama.”\nREAD MORE South Korean governmental agency Korea Creative Content Agency (KOCCA), which oversees and coordinates the promotion of the Korean content industry, is this week showcasing new content from the country via C21 Digital Screenings, while general director Dohyoung Lee gives his analysis of the international boom in K-content.  Exports of South Korean television content have been on a steady upward curve ever since the early days of the Korean Wave almost 20 years ago, when dramas like KBS2’s 2002 hit Winter Sonata made such an impact on the global market.  Fast forward to today and more of the world is watching even more K-content. Just look at some of the biggest US shows in recent years. ABC’s adaptation of another KBS2 series, The Good Doctor, was the only global hit coming out of the 2017/18 season in the US. And on the unscripted side, the global success of talent show The Masked Singer has been a phenomenon over the past two years, following its debut on Fox in the US in 2019.  Dohyoung Lee, general director at the Broadcasting Division of KOCCA, is certain these two recent K-content hits have driven demand for more programming from South Korea.\nREAD MORE ",
    "datetime": null,
    "url": "https://www.c21media.net/screenings/koccatvshows/programming/484092/"
}