{
    "title": "KOCIS holds 2022 K-wave Festival, attracts global audience of 252,865 : Korea.net : The official website of the Republic of Korea",
    "text": "HOT TOPICS Korean-language test to be held up to 8 times abroad in 2024 Korean Red Cross builds temp homes for Turkish quake victims Food Clothing and Fashion Traditional Decorative Knots, Maedeup: Donated Works by Lee Bu-ja Jinju Namgang Yudeung Festival Culture Dec 10, 2022 Ten outstanding Honorary Reporters of Korea.net on Dec. 10 take a commemorative photo with Kim Geun-ho (center), director-general of the Overseas Culture Promotion Bureau at the Korean Culture and Information Service, at the 2022 K-wave Festival hosted at Exhibition Hall 2 of the Korea International Exhibition Center, aka KINTEX, in Goyang, Gyeonggi-do Province. By Xu Aiying  Photos = Kim Sunjoo Goyang, Gyeonggi-do Province  The 2022 K-wave Festival, which honors and shares content on Korea made by foreign creators with Hallyu fans worldwide, was held on Dec. 10 with great success. An estimated 252,865 Hallyu fans around the globe watched the event live on Korea.net's YouTube channel. \n\r\nThe Korean Culture and Information Service (KOCIS), an affiliate of the Ministry of Culture, Sports and Tourism, hosted the festival at Exhibition Hall 2 of the Korea International Exhibition Center, aka KINTEX, in Goyang, Gyeonggi-do Province. At this year's event, prizes went to the top 10 Honorary Reporters and top eight K-influencer teams comprising nine members for their activities to promote Korean culture. Talk Talk Korea, a KOCIS-sponsored international online contest of Korea-related content, also announced this year's grand prize and other winners in all eight themes.  Through creation of Korean cultural content in a variety of ways, the winners reflected on the past year and described their experiences of introducing Korea to the world.\nMinnath Azeez of Sri Lanka, one of this year's top 10 Honorary Reporters, said in her acceptance speech, \"I found the Honorary Reporter program by chance, but looking back, it's one of the best decisions I've ever made,\" adding, \"As an Honorary Reporter, I could connect with Honorary Reporters around the world and interview many people.\"  Azeez's interviews with artists around the world who use Korean culture in their works recorded the highest number of views in Korea.net's Honorary Reporters section in English. Second Vice Minister of Culture, Sports and Tourism Cho Yongman on Dec. 10 gives a congratulatory speech at the 2022 K-wave Festival hosted at Exhibition Hall 2 of the Korea International Exhibition Center, aka KINTEX, in Goyang, Gyeonggi-do Province. Vanessa Hernandez Gusmao of Mexico, a K-influencer who was honored for outstanding activity, said, \"I'm not that close to Korean culture, but I thank my concerned family and friends for always making videos with me,\" adding, \"I'll keep working hard to promote Korean culture through my content.\"  Her self-produced video shows her directly using and introducing Korea's advanced technology such as electronic devices and video games, drawing a heated response. Laura de la Portilla Fernandez, head of the Cuban team Only One, which won the Korean music category for presenting traditional Korean music with a unique Cuban rhythm, said, \"We are a group of Cuban girls who love Korea and got together through music,\" adding, \"We like Korean culture, especially music like K-pop, ballads and traditional minyo (folk) songs.\" Second Vice Minister of Culture, Sports and Tourism Cho Yongman said in a congratulatory message, \"In major world cities, people learn the Korean language and Hangeul, enjoy Korean food and experience traditional Korean games,\" adding, \"The interest and efforts of people like you who promote to the world the appeal of Korean culture have greatly contributed to our culture taking root in the global village.\"  \"Our government will support your activities and widely publicize the values of freedom and solidarity along with all of you.\"  Honorary Reporter from Mexico and minyo singer Nancy Gonzalez (left) and K-influencer and pansori singer Laure Mafo on Dec. 10 give a congratulatory performance at the 2022 K-wave Festival.  The event also saw congratulatory performances by Solji, lead singer of the K-pop girl group EXID, traditional minyo master Choi Eun-bi, Honorary Reporter from Mexico and minyo singer Nancy Gonzalez and K-influencer and pansori (solo lyrical opera) vocalist from France Laure Mafo.  Hallyu fans around the world watching the festival online via YouTube communicated in real time in languages like English, Arabic, Spanish and Indonesian through comment windows. The number of people who simultaneously watched the broadcast peaked at 4,998.  xuaiy@korea.kr Significance of President Yoon's visit to Saudi Arabia ",
    "datetime": null,
    "url": "https://www.korea.net/NewsFocus/Culture/view?articleId=225691"
}