{
    "title": "Korean snacks enjoy growing popularity overseas | Yonhap News Agency",
    "text": "All Headlines North Korea Sports Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies URL is copied. By Kim Han-joo SEOUL, Jan. 5 (Yonhap) -- South Korean snacks are increasingly gaining huge popularity in the global market as more consumers are addicted to new flavors and opted to pick up more Korean products in line with the Korean Wave, industry officials said Sunday. Exports of local snack products were tallied at US$43.14 million in 2018, up from $41.6 million tallied a year earlier, according to data compiled by the Korea Agricultural Trade Information. Last year's tally was not available at the moment, but the figure is surely to have surpassed the previous year's performance. The growing preferences for newly developed Korean snacks are part of ongoing interest in South Korea and its pop culture, K-pop, dubbed the Korean Wave. This undated photo, provided by Orion Corp., a major confectionery company in South Korea, shows its flagship snack, Kkobuk Chip. (PHOTO NOT FOR SALE) (Yonhap)  For years, major Korean confectionery companies have increasingly set their sights on a wider market after seeing robust growth in the United States, China and Southeast Asia. Orion Corp., a major confectionery company here, said its relatively new flagship snack, Kkobuk Chip, is enjoying huge popularity in the U.S. and China. More than 60 million packs of Kkobuk Chip, four-layered crispy chips, were sold in China in the year after it debuted in 2017, the company said. Kkobuk Chip is also being marketed as Turtle Chips in retailer Costco outlets in major cities, Orion said. Orion's latest overseas drive comes as the snack has been enjoying popularity among local consumers, with the product's accumulated sales surpassing 100 billion won ($85.8 million). The company attributed the popularity of Kkobuk Chip to the crispiness that comes from four thin chips overlapping each other which was the outcome of eight years of R&D with a 10 billion-won budget. Another major player, Lotte Confectionery Co., said its long-time best-seller, Pepero, remained one of the best-selling Korean snacks overseas. The outbound shipments of Pepero reached $50 million in 2017, showing solid growth in Singapore, China and Russia, Lotte Confectionery said. This undated photo, provided by E-Mart Inc., shows people shopping for one of the company's private-label (PB) snacks, at its outlet in Manila. (PHOTO NOT FOR SALE) (Yonhap)  Private label snack products by the country's major retailers have also gained huge popularity in Southeast Asia. E-Mart Inc., the country's leading discount chain operator, said its stores dedicated to selling the company's budget private label products, named E-Mart No Brand, will open its second outlet in the Philippines. The second outlet will be located in the city of San Pedro, in addition to the first outlet in the capital city of Manila, company officials said. \"The top eight best-selling items are all snacks, with snack sales accounting for 40 percent of the Manila outlet,\" said Kong Jae-hoon, an E-Mart official. Another major player, GS Retail, said it is making inroads into 17 Asian countries after successfully opening its convenience store chain GS25 in Vietnam. PB snacks with flavors, such as \"injeolmi\" -- Korean traditional rice cake made with bean flour -- and \"tteokbokki\" -- Korean rice cakes in a spicy sauce -- are best-sellers in the Vietnamese outlets, GS Retail said. khj@yna.co.kr(END) All News National North Korea Economy/Finance Biz Culture/K-pop Sports Images Videos Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies Korea in Brief Useful Links Festival Calendar Weather Advertise with Yonhap News Agency ",
    "datetime": "2020-01-05T09:45:01+09:00",
    "url": "https://en.yna.co.kr/view/AEN20200103002100320"
}