{
    "title": "Korean CJ ENM Gets in Shape for Global Role",
    "text": " By \n\n\tPatrick Frater Asia Bureau Chief  Make no mistake: CJ ENM is on the move. The South Korean conglomerate that has done as much as any company to build out the nation’s entertainment ecosystem is actively looking to expand its “production capability and competency.” That’s the word from Kang Ho-sung, CEO of the cluster of film, TV and music companies that now share the CJ ENM banner. Kang gave a rare, extensive interview to Variety on Aug. 21 in downtown Los Angeles on the sidelines of CJ ENM’s KCON LA pop culture convention, which brought in close to 100,000 fans from across the U.S. Despite the palpable teen spirit that KCON brought to two packed concerts at Crypto.com Arena, Kang describes CJ ENM’s current mission in terms that are both humble and loftily ambitious. “Our core bread-and-butter business is as a content provider. Our biggest goal is to create premium well-made content and expand it globally,” Kang says. Since the beginning of 2020, CJ ENM has dramatically raised its profile in Hollywood by buying a minority stake in David Ellison’s Skydance Media and a majority interest in Endeavor Content, which this week unveiled a company rebrand and new moniker as Fifth Season. It has also put a marker down in the metaverse with an investment in “digital humans” purveyor Hyperreal. Late last month, CJ ENM announced the appointment of Steve W. Chung, a former Fox executive, as the group’s chief growth officer. Significantly, he is to be based in Los Angeles, not Seoul. At home, CJ ENM has thrown out its previous playbook, ditching outright ownership and control for partnerships that bring in capital, accelerate growth and share risk and rewards. In 2020, it spun off its TVing streaming platform and recapitalized it in an alliance with tech giant Naver and broadcaster-producer JTBC. TVing has since merged with smaller rival Seezn while retaining Seezn’s helpful connections with KT Corp., formerly known as Korea Telecom. To ramp up production of K-content still further, the conglomerate has launched CJ ENM Studio, a TV production cluster headed by ace film producer-director JK Youn. It has built the largest virtual production studio in Asia and struck a joint venture deal in Japan for its Studio Dragon television production arm. “Our primary goal is to maximize content production capability and competency,” says Kang. That is expected to help TVing in its quest to overtake Netflix in Korea and become the country’s biggest streamer. But Kang says there is no plan to halt external program sales by the group’s many production units: “Our dual-pronged approach in content means we are not going to limit ourselves. We want to utilize external content platforms as well.” Studio Dragon is still renegotiating its deal to supply Netflix, and CJ ENM has formed an alliance with Paramount Global. Paramount+ was recently launched in Korea as a component of TVing, while CJ ENM shows are also playing on Paramount’s FAST service Pluto TV. Given the efforts to establish two-way production flows between Korea and Endeavor Content and the seemingly insatiable current demand for K-content, Kang sees CJ ENM as heading to the level that corporate founders Jay and Miky Lee only dreamed of. “Our multi-studio structure will give us a solid foundation to create more global projects and expand to the global stage,” says Kang. Over its quarter-century in business, CJ ENM has had to invent the Korean film business almost from scratch. And it nurtured music fandom in Korea by launching a TV music channel (Mnet) and related awards show (MAMAs). In the past eight years, the group has industrialized the Korean TV production sector through the creation of Studio Dragon, a hub studio with quality control, finance and marketing functions surrounded by a corona of hot shops representing 300 creatives. Studio Dragon this year is making 32 shows for local broadcasters and international streamers and expects to raise that number to 50 in 2023. The film business nevertheless remains a key reference point. “The promise we made [when starting in multiplexes] was a signal to the industry that we were going to build a certain amount of screens, that we were going to make good movies and we’re going to secure screens [to distribute them on]. That translated into a predictability that allowed [third-party] financial firms to start investing in the movie industry,” says Kang. “We also made sure that profits from cinemas were reinvested into the production environment. It was a virtuous circle.” Kang was not a CJ staffer in the group’s early years, but rather a media lawyer able to closely observe the transformations. By 2019, thanks to consistently strong local film performances and enviably high per capita attendance rates, South Korea was the world’s fourth-largest box office market — ahead of many more populous countries. Along the way CJ has produced or financed films including “Old Boy,” “Snowpiercer” and the multi-Oscar-winning “Parasite.” But the impact of COVID on the theatrical industry halted the momentum that CJ’s film operations might have expected to enjoy following “Parasite.” COVID, the Korean wave and the arrival of international streamers in Korea, instead, hastened CJ ENM’s moves in TV, streaming and music — and accelerated a push to be present in entertainment outside Asia. Still, as far back as the mid-1990s, the sibling founders of CJ Entertainment saw for themselves a global role and kicked off their plans with a $300 million minority investment in the fabled DreamWorks SKG mini studio. It has taken more than two decades for the Lees’ ambition to come close to fruition. But its leaders are determined to get the group into the right shape to seize the opportunity presented by the unprecedented worldwide mania for Korean contemporary culture. “The reason why we started with DreamWorks was because we wanted to learn what the global standards were and to adopt them,” says Kang. A Variety and iHeartRadio Podcast The Business of Entertainment ",
    "datetime": "2022-09-07T20:00:00+00:00",
    "url": "https://variety.com/2022/biz/news/korea-cj-enm-global-1235362489/"
}