{
    "title": "Korea Brand Entertainment Expo 2017 kicks off in HCM City",
    "text": "More than 100 Korean companies and 400 foreign enterprises are taking part in the three-day Korean Brand & Entertainment Expo 2017 (KBEE 2017), which opened in HCM City on Wednesday. HCM CITY — More than 100 Korean companies and 400 foreign enterprises are taking part in the three-day Korean Brand & Entertainment Expo 2017 (KBEE 2017), which opened in HCM City on Wednesday. The expo aims to promote Việt Nam – Korea relations through cultural and commercial exchanges. It is part of the activities to celebrate the 25th anniversary of diplomatic relation between the two nations. The Korea Brand & Entertainment Expo, one of the biggest events organised by the Korea Trade & Investment Promotion Agency (KOTRA), promotes the Korean Wave and products to foreign consumers and businesses. This event features famous celebrities from the two countries, including Song Ji Hyo of iKON (Korea), who is the official ambassador of KBEE 2017 HCMC; SNUPER (Korea) and singer Noo Phước Thịnh, who appear as special guests; and KRUNK, an iconic artist from YG who is a special ambassador of the programme. The exhibition consists of four main activities: business-matching with trade and investment promotion activities; and experimental programmes with activities such as a home-shopping show for Korean products, a Korean wave make-up demonstration by Korean artists, and a Korean style make-up show. In addition, there is K-wave in which KBEE ambassadors and famous Korean artists take part in fan meetings and fan-signing events as well as promote Korean products to Vietnamese consumers; and K-pop music performances by Korean stars, all of which promise to be an exciting environment for Vietnamese audiences. Held in Thailand for the first time in 2010, the Korean Brand & Entertainment Expo has been held in many countries, and is one of the largest events promoting Korean brands and entertainment to global consumers. — VNS The 2017 APEC Summit is shining the spotlight on Việt Nam and highlights its economic development. It has also produced comments about simplifying the nation’s laws to encourage more business. Two large fairs featuring industrial and agricultural products in the Mekong Delta and the northern delta opened on Wednesday evening, attracting hundreds of visitors. Investment opportunities in the food processing industry and technology transfer from foreign investors will be among the key topics to be discussed at a conference in HCM City on November 15. Brand Finance, the world’s leading independent branded business valuation and strategy consultancy, has valued Việt Nam nation brand at US$203 billion. The industrial production index (IIP) of HCM City in the first 10 months recorded the highest year-on-year growth at 7.75 per cent over the past five years. Representatives from Spanish energy company Repsol on Tuesday met with leaders of the Bình Sơn Refinery and Petrochemical Co Ltd (BSR) to seek opportunities to invest in the Dung Quất Refinery. As many as 800 domestic and foreign investors, property businesses and experts are expected to attend the first annual Vietnam Real Estate Forum, which will be held on November 15. Hà Nội will give investment licences to a series of large projects by the year-end after the capital city has synchronously implemented solutions on improving investment and business environment, the People’s Committee said. The Republic of Korea (RoK) will provide US$1.5 billion in official development assistance (ODA) for Việt Nam for 2016-2020 via the Korea Economic Development Cooperation Fund (EDCF). Copyrights 2012 Viet Nam News. All rights reserved.\r\n                    Add:79 Ly Thuong Kiet Street, Ha Noi, Viet Nam. Editor_In_Chief: Nguyen Minh\r\n                    Tel: 84-24-39332316 - Fax: 84-24-39332311 - E-mail: vnnews@vnagency.com.vn\r\n                    Publication Permit: 141/GP-BTTTT. ",
    "datetime": null,
    "url": "http://vietnamnews.vn/economy/417215/korea-brand-entertainment-expo-2017-kicks-off-in-hcm-city.html"
}