{
    "title": "\"Korean Wave\" Comes to BU | BU Today | Boston University",
    "text": "CAS senior lecturer Jaemin Roh teaches a Korean language class. Photo by Cydney Scott In little more than a decade, South Korea has become a major exporter of pop culture, fueled by the popularity of Korean pop (K-pop) music and videos on YouTube and serialized TV K-dramas. Teenagers and college students are largely responsible for the growing embrace of all things Korean, popularly referred to as the “Korean Wave,” so it’s no surprise to see signs of it around BU. But here the phenomenon isn’t just about pop culture, it’s also about language, literature, and theology, and it’s just the latest example of the long and deep history between Koreans and the University. “Korean culture is cool” right now, says Eugenio Menegon, a College of Arts & Sciences associate professor of history and former director of the BU Center for the Study of Asia. The total enrollment for Korean language classes at CAS has grown from 127 in the academic year 2008–2009 to 312 in 2014–2015. “It’s an astounding growth” of 146 percent since 2008, says J. Keith Vincent, a CAS associate professor of Japanese and comparative literature and chair of the modern languages and comparative literature department. He points to a recent Modern Language Association report that found that nationwide, Korean language courses had grown by 45.3 percent since 2009, so the program grew at more than three times the already impressive national rate, Vincent says. To accommodate that demand, the department has increased the number of faculty teaching Korean. Jaemin Roh (CAS’04, SED’11), a CAS senior lecturer in Korean, had been the only full-time faculty member in Korean studies until she was joined three years ago by Yoon Sun Yang, a CAS assistant professor of Korean and comparative literature. Also on the faculty now are CAS lecturer Jungsoo Kim, who is head of the Korean language program this year, as well as three part-time lecturers. And Wiebke Denecke, a CAS associate professor of Chinese, Japanese, and comparative literature, will be incorporating Korean into her classes. The department now offers four years of Korean language classes, along with classes in Korean literature, cinema, culture, and society—a total of 15 classes this semester alone. And that’s not counting classes that incorporate Korea into a wider consideration of Asia. Part of the increased interest in Korean culture can be attributed to the growing number of Korean students at BU. There are more than 60 Korean students in the Class of 2019, comprising just under 2 percent of the class—a 50 percent increase from 2005. The language program is set up to accommodate those already proficient in Korean, but who want to take advanced courses, those with little or no knowledge of the language, and “heritage speakers,” who are familiar with conversational Korean, but cannot read or write it. “We have a lot of Korean heritage students and some whose parents were diplomats or businessmen, but haven’t lived in Korea for a long time. They’re not fluent in any measure, but just talk to their families,” says Roh. “And then some Korean-Americans who have never even visited Korea, but speak some of the language and are kind of embarrassed that they don’t speak it so well and want to get in touch with their history.” For some students, the courses offer new insight into their personal history. They may discover that their family was riven by the partition of Korea into two countries, North and South, after the Korean War or that the war affected their parents and others in ways that are not talked about within the family. “That’s an eye-opening moment for them,” Roh says. “They didn’t think about it at all, but taking this class and learning to connect it to their lives has some meaning.” Serialized TV K-dramas, which have become enormously popular in China, India, and Southeast Asia, have gotten many students from other Asian countries interested in Korean culture and language as well, Roh says. “You don’t know how many testimonies I have heard,” she says. “‘My mom converted me to Korean drama.’ ‘But your mom is not Korean, is she,’ I’ll ask. ‘No, she’s Malaysian.’” The boom in K-culture at BU can also be traced to the BU miXx KPop Cover Dance Crew, whose videos have a wide following. K-pop music and videos by artists like pop star PSY (a former BU student whose “Gangnam Style” was a global hit) have become popular with young people around the world, and were the impetus for a few BU students to start miXx about three years ago. Within months, dozens of students were turning out to audition. The group’s stunningly energetic re-creations of K-pop stars’ videos, featuring elaborate synchronized dance routines, often in costume, with dozens of students involved, and locations around campus subbing for the original settings, can be viewed on YouTube.  In the video above, BU miXx members perform a cover of “Keep Your Head Down.” “Our mission is to spread awareness of Korean culture in the sense of K-pop, dramas, anything in Korean pop culture,” says Elly Hu (CAS’16), former miXx president. “If you’re discovering K-pop alone, it’s not as much fun. When you have other people, you may not be able to record a dance video, but at least you have other people to talk to about the stuff. It’s really just making that community and having that in-person experience.” This year, the group plans to invite guest speakers knowledgeable about the K-pop industry to campus and bring well-known K-pop dancers to teach workshops, says current president Eunice Her (Questrom’16). Other student organizations on campus include the BU Korean Student Association, with between 300 and 400 members currently, and BU Liberty in North Korea, which works to improve human rights conditions in North Korea and to support North Korean refugees. Protestant religious denominations have long flourished in Korea, especially after the Korean War, when Christians fled Communist North Korea. That influence can be seen at the School of Theology, which has more than 30 Korean students—roughly 10 percent of those enrolled—now working on a master’s degree. Most of them plan to pursue careers in the ministry or in social services when they return home. While the Korean Wave may be a recent phenomenon, it’s just the latest development in a relationship with BU that dates back to the 19th century. “The reputation of BU in Korea is very strong because of 100 years plus of steady back-and-forth” interaction, says Dana L. Robert, Truman Collins Professor of World Christianity and History of Mission and director of STH’s Center for Global Christianity and Mission. Korean students began coming to BU early in the 20th century. STH’s Boston Korean Diaspora Project documents the relationships and achievements that resulted from the influx of Koreans to the Boston area and to BU from 1920 to 1965. Robert points to the Koh family as an example. Kwang Lim Koh, who taught at the School of Law in the 1950s, was the first Korean ever to teach at an American law school and later served as Korean ambassador to the United States. His wife, Hesung Chun Koh (GRS’53,’59), was the fourth Korean woman to earn a doctorate from an American college or university. One of the couple’s sons, Howard Koh (SPH’95), is a former School of Medicine and School of Public Health professor and former assistant secretary for health in the Obama administration. Their other son, Harold Koh, was the dean of Yale Law School from 2004 to 2009. And Daniel Arrigg Koh, Howard’s son, is currently Boston Mayor Martin J. Walsh’s chief of staff. Given BU’s longtime ties to Korea, it’s not surprising that the BU alumni network there is among the most active of any such BU group in the world. There are approximately 2,000 alumni in Korea, and 300 or more are active members of the BU Alumni Association of Korea (BUAAK), says Yoona Lee, Development and Alumni Relations assistant director of international alumni networks. ”What’s really interesting about this group is that each July, they actively engage current Korean students on campus,” says Lee. “Most international students go back home during the summer, and the BUAAK invites students, they have a very nice dinner, and sometimes work it as a networking opportunity, so students can find a summer internship or even jobs after graduation.” “Many Koreans have a favorable impression of Boston, especially its cultural identity as a cornerstone of American history and tradition,” says Young-Jae Han (Questrom’79), chairman of the BU Asian Alumni committee, former president of BUAAK, and chairman and CEO of NOROO Holdings Co., Ltd. “The dramatic increase in the number of Korean students at BU after 1988—when Korea began to more actively turn its attention to the global stage, particularly after the 1988 Seoul Olympics—can be seen as a major proof of students’ recognition of BU’s high-quality education and sincere care for the international student body,” Han says. “Korean Wave” Comes to BU Joel Brown\t\t\t\t\t\t\n\t\t\t\t\t\tis a staff writer at BU Today and Bostonia magazine. He’s written more than 700 stories for the Boston Globe and has also written for the Boston Herald and the Greenfield Recorder. \t\t\t\t\t\t\n\t\t\t\t\t\t\tProfile Boston University moderates comments to facilitate an informed, substantive, civil conversation. Abusive, profane, self-promotional, misleading, incoherent or off-topic comments will be rejected. Moderators are staffed during regular business hours (EST) and can only accept comments written in English. Statistics or facts must include a citation or a link to the citation. Cool article. It’s always good to raise more awarenes, especially due to our crazy neighbors up north continually up to their shenanigans and tainting our name. They wouldn’t be tainting your name if you stopped reporting lies about them in your media. Those are some really interesting statistics! I was considering giving up on my research paper on Korean architecture because I couldnt find sources, so thank you for the inspiration! To accomodate the increased interest, we should get more books on Korean culture in Mugar(*cough* architecture! cough cough). Have you tried contacting Alice Tseng at the Department of the History of Art and Architecture? She has done a lot of work on Japanese architecture and cities as of late, but she may be able to point you in the right direction, in terms of sources. Good luck! I think there is a problem with the percentage growth quoted in this article.  The growth in Korean course enrollments is impressive but it isn’t 246% over the time period give.  Perhaps 145%?  Maybe a typo? Thanks for pointing that out. 246% was the total, not the growth. We have corrected in the text. Yay! Korean culture rocks! 대한민국만세 <333333 Thank you BU TODAY for publishing this article!  We learned a lot from this article about to what extent Korean culture and BU Korean alumni associations are impacting BU.  The Koh family members you mentioned in this article are the true role models for both Koreans in Korea as well as Korean-Americans.\nWe have shared this story in our research group face book (https://www.facebook.com/awship)! Great post! Don’t forget to also link BU Liberty in North Korea’s facebook page too! Thanks :) https://www.facebook.com/LiNKatBU I have definitely been noticing the surge in popularity of Korean culture, and I don’t even live in Boston! My friend, Caroline, spends most of her money on K-pop albums and I have another friend who is self-studying the Korean language. I’ve also noticed the influence isn’t limited to media like music and TV shows, even Korean beauty products are becoming more well-known. “There are more than 60 Korean students in the class of 2019.” Do you mean 600..? Howard and Harold Koh have a longer history in public service than indicated in this article. Howard also served as Public Health Commissioner in Massachusetts. Harold was Asst. Secretary of Human Rights in the State Dept. during the Clinton Administration, as well as Legal Counsel to the State Dept. under Barack Obama. Your email address will not be published. Required fields are marked *  Boston University’s Alumni Magazine News, Opinion, Community Pioneering Research from Boston University ",
    "datetime": null,
    "url": "https://www.bu.edu/articles/2015/korean-wave-comes-to-bu/"
}