{
    "title": "\r\nKorea marks BOP surplus for Hallyu-linked sectors on global success of games, K-pop",
    "text": "Most Popular G-Dragon booked for drug use South Korea, Qatar agree to elevate ties, forge $4.6b industry partnership Former Olympic hero battles rumors surrounding her groom-to-be S. Korea goes all out to contain lumpy skin disease Yoon pitches S. Korea's investment appeal to Middle East Yoon meets Park, honors father in gesture of conservative unity 4-meter deep sinkhole injures 1 in central Seoul [News Focus] A year after Halloween crowd crush, legislation remains stalled Olympic medalist ‘tricked’ by fiance-turned-stalker Braving wind and high water to celebrate Dokdo Day Start your day with a roundup of key stories from The Korea Herald with news and comment on all that’s happening in Korea. Published : March 3, 2019 - 16:00 Link copied South Korea logged a record-high balance of payments surplus for Hallyu-related products and services last year, owing to the global success of Korea-made video games and K-pop, statistics from the Bank of Korea showed Sunday.Hallyu, or the Korean Wave, refers to the proliferation of Korean cultural content overseas, including K-pop, food, TV programs and movies as well as PC and mobile games produced by Korean firms.According to the Bank of Korea Economic Statistics System, Korea’s BOP surplus for Hallyu products and services surged 73 percent on-year to $2.43 billion in 2018. The growth was attributed to the rising popularity of Korean games and music abroad. The balance of payments, or BOP, is an economic indicator that represents the difference between all the money a country earns from exports and the money it spends on imports during a given period. A surplus means exports exceed imports, while a deficit means imports exceed exports. Korea’s Hallyu-related BOP marked a surplus for the first time in 2012 and hit a record high of $1.51 billion in 2016. However, the surplus dropped to $1.4 billion the next year, when Korea decided to deploy an advanced US missile-defense system and China retaliated with a ban on Hallyu content. Strong exports of Korea-made games were the main factor in the recovery of the country’s Hallyu-related BOP surplus last year.The country’s BOP surplus for the communications, computer and information services sector, which includes game downloads and purchases from overseas locations, stood at $2.11 billion in 2018 -- nearly double the 2017 figure of $1.13 billion.The BOP surplus for music, video and related services was $320 million last year, as compared with $277 million the previous year. That growth was achieved on the heels of the explosive popularity of K-pop boy group BTS.  The music and video content-related BOP surplus doubled from $245 million in 2015 to $520 million in 2016. But the figure nearly halved on-year in 2017 due to China’s Hallyu ban.By Sohn Ji-young (jys@heraldcorp.com) The Korea Herald by Herald CorporationCopyright Herald Corporation. All Rights Reserved.  ",
    "datetime": "2019-03-03T15:24:34+09:00",
    "url": "https://www.koreaherald.com/view.php?ud=20190303000151"
}