{
    "title": "Korean Music Shows: How They Became the Center of K-Pop Fan Culture | Billboard – Billboard",
    "text": "When people talk about America's impact on K-pop, they're usually talking about the music. But it's also likely that American TV largely influenced the multi-medium's emphasis on visuals, whereby… By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tCaitlin Kelley When people talk about America’s impact on K-pop, they’re usually talking about the music. From boy bands to hip-hop to rock, the origin of K-pop’s sound is thoroughly American. But it’s also likely that American TV largely influenced the multi-medium’s emphasis on visuals, whereby dance, fashion and “concepts” are inextricably tied to the definition of K-pop. Explore\t\t\n\t\n\nSee latest videos, charts and news\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tBTS\t\t\n\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tLifestyle\t\t\n\t\t\t\t\t\n\n\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news According to Dr. Suk-Young Kim, a professor at the University of California, Los Angeles, MTV was first imported to Korea around the same time as the birth of K-pop. “In the mid-’90s when [father of modern K-pop] Seo Taiji and the Boys became sensational hits, that’s when music videos also started gaining traction in the Korean consumer market,” she explains to Billboard over the phone. (Notably, one of the Boys, Yang Hyun-suk, later founded YG Entertainment, the Big 3 company that jump-started the careers of chart-topping K-pop acts like Psy, BIGBANG and 2NE1.)   “It’s played a very significant role of visualizing K-pop through … fashion statements [and] good looks, and it really played a role of a mother to give birth to this visual culture before YouTube became the main language,” Kim continues. “Music videos were first disseminated over the top of the chart TV shows, because some of the shows had segments featuring [new] music videos, and I think it really visualized the music.” But Korean music television diverged from MTV later in the decade, as the music video request format of Total Request Live gained prominence in America and Gayo Top 10, the country’s longtime preeminent music chart show, was cancelled. “[Gayo] actually predates TRL as it first aired in 1981 and would have the top 10 songs of the week,” says Paul Han, co-owner of the English-language K-pop blog allkpop. “The show ended in 1998 and was replaced by the more familiar Music Bank for current K-pop fans.” Coincidentally, Music Bank and Inkigayo, the first manifestations of modern Korean music show culture — in which several such countdown shows, with differing chart methodologies, air exhaustively throughout the week — both started around the same time as TRL.  Today, there are six main music shows in Korea — SBS’s Inkigayo, MBC’s Show! Music Core, KBS’s Music Bank, Mnet’s M! Countdown, MBC Music’s Show Champion and SBS MTV’s The Show — each designated for one day of the week, from Tuesday to Sunday. Korean music shows largely focus on “live” performances (at least half of them are pre-recorded) instead of music videos — closer to the model of TRL’s 2017 reboot — with some small interview segments sandwiched between different acts. K-pop acts dominate these shows, where they promote their latest singles for varying lengths of time — an established group like Shinee might promote each single for two weeks, while a younger group like Pristin might release three singles a year, promoting them every day for about a month each. The constant exposure offered by these music shows is the bread and butter of many acts’ marketing in an oversaturated field. The shows are integral to creating the ubiquity necessary for fans to be completely immersed in the music. And that level of immersion is the reason why K-pop fans are as devoted as they are.   The demanding schedule of these shows does take its toll. Promotion days require hours upon hours of prepping, rehearsals and shooting — and it’s not like idols (K-pop speak for “stars”) can skip a day. “They really have to show up in every single cable and terrestrial channel for the sake of not getting any disadvantage,” says Dr. Kim. “If you show up at MBC and SBS and not show up at KBS, [you might] build a bad relationship with one particular broadcasting system.” But the shows do have their perks. Winners receive a trophy in front of their peers, then perform an encore of their winning song. Every show is different, in that they all have their own rules for calculating winners, so the music show scene doesn’t feel static. The majority of the shows place the most emphasis in the breakdown of their total scores on digital sales. Inkigayo counts YouTube views as 35 percent of its score, while Show! Music Core pre-selects a committee of 200 people on their homepage to determine 10 percent of artists’ total scores. The sheer diversity of these algorithms makes the simplicity of TRL’s pre-revival voting system — which allowed fans to vote on their favorite clips by email and phone — seem almost frivolous by comparison. Korean music show awards tap into the gratification factor for fans who vote daily. The presence of a physical trophy and encore stage adds a viscerally satisfying element to fan and idol efforts to land the No. 1 spot on the music show charts. “On TRL they didn’t have all the artists gather and then award a trophy at the end to the winner,” says Han. “It’s just much more satisfactory to receive a big trophy with all of your peers around. In a way, it’s sort of like a mini-music award show every week, and only one can be the winner.”  But Dr. Kim is more skeptical of music show wins. She says that there’s a possibility of the system of chart wins being rigged. The recommended lists on digital music sites could be one of the culprits. “So, for example, [let’s say] I am the owner of [South Korean music download site] MelOn Music Charts, and I found you as an idol and you haven’t even debuted yet,” Dr. Kim offers. “So, I decide to invest in your career, invest for your album. So the terms of your contract would be, when your album is released, it’s going to be primarily put on my online music site for a certain period of time.” The idea is that music on recommended lists is more likely to sell, and those increased sale scores place select idol groups closer to victory. “So, winning the top of the charts doesn’t really mean that much,” says Dr. Kim. “The way I read it is, perhaps the song had the heaviest investment from these big shoulders.”  Don’t tell that to BTS’s fandom, called ARMY, though. One of the biggest stories in BTS’ mythology as self-made former underdogs is that their first-ever win for “I Need U” at “The Show” in May 2015 was the major turning point in their career, propelling them to success. “Before that, their album sales were good but didn’t rival the top groups,” says Han. “After the [2015] release of The Most Beautiful Moment in Life, Part 1 and their first music show win, you started to feel the BTS momentum building up.” It’s a well-documented fact that the members of BTS were long plotting how to reach the top on Korean music shows. “Do you think we can reach No. 1?” the K-pop phenom’s leader, Rap Monster, asks his members during “Skit: Expectation!” on The Most Beautiful Moment in Life Pt. 1. Suga responds, “Well, not getting caught up on being No. 1 or whatever. I really like the album itself. The album is good. I like the songs.” Then Rap Monster utters his mission statement: “I can’t be satisfied by the album now. We have to get No. 1.” So, when they won almost two years after their June 2013 debut, it was a big deal for the fans and members of BTS. “When artists win on these music shows, it’s very much a milestone for the artists,” says Robin Jun, senior content editor at Soompi. “An artist’s first music show win is something that they definitely remember. And the fans remember it too.” Recently, international ARMYs, including the fandom’s American arm, mobilized to help BTS score the highest-charting hit for a K-pop group in Hot 100 history, with current single “DNA” (now at a peak of No. 67, on the chart dated Oct. 14) — organizing through social media posts breaking down each music chart’s formula. This brand of highly coordinated fan efforts might have been new territory for Western fandom, but it’s the norm for K-pop fans who watch music shows. “Fans have passion and they want their idols to win,” says Han over email. “Album sales, digital sales, streaming all help in the point system of Korean music shows so that only drives consumerism even further. You see some fans doing bulk-buying — buying hundreds of albums — just so it will help their idols secure a win.”   “Teenage groups in Korea tend to be very… tech-savvy, so I think they had their fair amount of training through these music chart shows in Korea,” says Dr. Kim. “In that sense, I think this fan culture could be somewhat contagious. Korean fans have cultivated a certain kind of fandom and fan culture, and I guess foreign fans are, to a certain extent, emulating that.” By contrast, TRL, which was absent for the bulk of the social media revolution, has an uphill battle ahead of it in establishing its place in a multimedia world that has edged out TV sets. One way MTV is grappling with the exceedingly digitized music landscape on the 2017 resurrection of the program is by hiring legit YouTube pros — Gigi Gorgeous, Gabbie Hanna and Eva Gutowski — as social media correspondents. But this pivot to social media comes at the expense of the show’s video countdown, which was removed from the show’s reboot, and a good deal of its accompanying musical identity. For their part, rather than compete with social media, Korean music shows have maintained their focus on the music by incorporating YouTube views into the algorithm for artists’ total scores, while capitalizing on the online video giant’s potential for international circulation. Music shows’ embrace of social media has played a large role in the way fans rally around their faves. “It’s now become a sort of competition between fandoms because there has started to be this movement of just breaking records,” says Jun. “Like, who can [get] to, say, 10 million views the fastest? Or who can get the most views in 24 hours? And that was kind of started when they added the YouTube component to music show charts.” Korean music shows’ activity on YouTube is tied to K-pop’s growing globalization, known as the Hallyu wave. Given the amount of resources it takes to produce one performance on a music show (Soompi estimates outfits alone often add up to $2,500-$4,200 for just one show), it would be wasteful for idols’ performances to be “one-time, disposable consumption item[s],” as Dr. Kim puts it. “YouTube is how you circulate yourself internationally,” she says. “Especially since 2011, music chart shows have had their eye on putting their content on YouTube for global circulation.”  Beyond YouTube, Korean music shows also reach overseas fans through more direct means. “They’re not only creating music shows shown in Korea with a creative consideration for international participation,” says Dr. Kim, “but they’re actually bringing those music chart shows overseas and creating a live concert out of them.” Music Bank has gone on world tours almost every year since 2011, organizing concerts with multiple K-pop acts in cities like Paris and Mexico City. KCON (Korean wave convention) is an even bigger venture that spans multiple cities each year, regularly stopping in Los Angeles. Organized in part by M! Countdown, the lineups are treated like a music festival while the convention seeks to showcase “every element of Hallyu encompassing pop music, TV dramas, movies, fashion, food, and beauty.” Amid Korean music shows’ contribution to the globalization of K-pop, idols’ faces increasingly appear on billboards in New York’s Times Square, a domain once dominated by TRL. Fans purchase advertising spots to celebrate important dates for their idols. In August, ARMYs celebrated youngest BTS member Jungkook’s 21st birthday on several panels, while NCT’s Taeyong was in NYC when his own face was projected on his birthday in July. #?? ?? ????? ???? ????– ?? ?????– #NCT127 #TAEYONG A post shared by NCT 127 Official Instagram (@nct127) on Jun 30, 2017 at 12:29am PDT  Now that BTS has made a significant breakthrough in the American market, time will tell how the return of TRL will further complicate notions of cultural exchange between America and Korea. After all, TRL’s official Twitter account recently tweeted that the show — which has a long history of uplifting American boy bands like *NSYNC — is “watching” the K-pop seven-piece. Soon enough, the rest of the country may be too. now watching @BTS_twt all night https://t.co/GObNBeKo2H — TRL (@TRL) September 30, 2017  Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2017-10-09T17:43:33+00:00",
    "url": "https://www.billboard.com/music/music-news/korean-music-shows-mtv-trl-bts-history-7990486/"
}