{
    "title": "Korean wave: Made in Korea, gorged and loved in India - Hindustan Times",
    "text": "Subscribe Now! Get features like It was in December 2019, that Torsha Sen, on a friend’s recommendation started watching the cult Korean Drama (K-drama), The Heirs, starring one of the most popular South Korean actors, Lee Min-Ho. “Once I was done with the show, I organically switched to watching Crash Landing On You (CLOY). I was blown by the content, the way these shows were packaged and the culture. It had me hooked and how! Almost overnight, I became a fan of actor Hyun Bin fan. Eventually the pandemic lockdown happened, and I ended up watching more than 50 Korean shows,” said Sen. Sen, a Mumbai-based art manager’s love for the Korean culture inspired by the world of K-Dramas, motivated her to start Art Poure, through which she started cooking and delivering home-made Korean food across Mumbai. “There were no options for Korean food during the lockdown. I started researching and posted recipes on my social accounts and this eventually led to Art Poure. From Ramen, Gimbaps, Bulgogi, Corn Dogs, Kimchi Bokkeumbap to home-made bottled Kimchi, you name it, you have it.” Just like Sen, it was the pandemic induced lockdown that led to establishing new Hallyu (Korean wave) converts in large numbers as people binge watched on K-dramas, fuelled by their impressive presence on OTT platforms. Popularity of shows such as CLOY, Goblin, Heirs to K-pop bands like BTS, iKon, BlackPink and many more, has brought in an army of fans, absorbing, and consuming every aspect of the Korean culture and creating a demand for their goods. For instance, Korikart, an online store that sells Korean products in India, witnessed a phenomenal spike in sales during the pandemic. “The brand has seen a spike in sales owing to the pandemic and has witnessed 300 percent growth in sales since March 2020. It is currently reporting over 40-50 percent, month-to-month growth. The pandemic had its downside but for Korikart it also came with a silver lining since the work-from-home scenario gave people exposure to try K-drama, K-pop as well as K-products and that worked in Korikart’s favour,” said Seo Youngdoo, CEO and founder Korikart. The brand during its initial launch, targeted K-pop and K-drama fans in India. “We can definitely say that the popularity of K-pop and K-dramas has opened up the market for us and lots of avenues for Korean products. Thanks to the Korean wave, we are getting orders from across India. Apart from cities like Delhi, Mumbai, Bengaluru, we have also seen a major consumption pattern from smaller cities like Chandigarh, Jaipur, places in UP and Northeast such as Assam, Tripura, Mizoram, Sikkim, Meghalaya, Nagaland, Arunachal due to their familiarity with Korean culture and K-pop,” said Youngdoo. A survey conducted by market research firm Euromonitor mentions that, according to the Ministry of Commerce and Industry of India, “the rise in consumption of Korean food in India after the 2020 lockdown can be correlated to the viewership of K-dramas and K-pop. Korean noodles in India witnessed a growth of 162 percent in terms of volume in 2020 and are expected to grow by 178 percent in 2021.” “In 2020, Covid-19 induced lockdown accelerated the popularity and acceptance of Korean culture in India through dramas available on several video streaming platforms as well as the Korean music bands whose craze here is legendary. Korean food exports hit a record high, greatly boosted by social media posts from Asian celebrities and the popularity of the film Parasite. What broadly started as a fad following of K-pop, K-movies and K-dramas is burgeoning into fan culture, especially among the nation’s urban youth. After music and films, K-food and cuisine is getting essential makeovers and reaching the larger Indian market. K-cuisine is all rage especially on social media in the form of food challenges such as Mukbang,” said Hwang Il-Yong, director of Korean Cultural Centre India. Restaurants and online food shopping platforms which offer Korean food items have been gaining popularity over the years but the local enquiries for dishes such as Korean fried chicken, Korean style Ramyeon, Kimchi, gimbap, kimchi-jjigae started flooding in after the first lockdown, owing to the consumption of Korean content online. “Earlier this year, Urban Platter, a popular food delivery platform in Mumbai, ran out of Ramyun noodles, Gochujang (hot chili paste) and Gochugaru (red chili pepper flakes) due to surge in orders. Influenced by K-dramas, Urban Platter sees over 2,000 individual units of Korean food items being sold monthly,” said Yong. The effect of Hallyu has widened the dictionary of culinary terms for K-food beyond Kimchi. Mushrooming of Korean restaurants across cities, is testament to the rising popularity of the cuisine. “Popularity of Korean food has risen due to different factors. The viewership of K-pop and K-drama has spiked in India as the COVID-19 pandemic forces people to spend more time at home. A growing interest in Korean pop-cultures such as K-pop music and Korean TV shows and movies among Indian consumers has undoubtedly contributed to the growth of Korean cuisine. Diners are also seeking exciting new culinary experiences and on-trend flavors. Korean cuisine is now rising as a new Asian taste in the global food scene,” said Rani Lee of Seoul Restaurant, Delhi. Korean cuisine is also getting its fair share of customisation to suit the Indian palate and is being served with a desi twist. “What we have noticed significantly is that the Korean food has also been localised and customised by Indian fans according to their taste palate. New food items have been evolved such as Kimchi curry, Kimchi Pakora, Chana Dal Tikki(customized from Gamja-jeon, Korean style potato pancake),” said Hwang Il-yong. Influence When K-pop sensation BTS, released Butter in the month of May 2021, it smashed all records and went on to become the most streamed track on Spotify in the first 24-hours and most viewers for premiere of a music video on YouTube. The millions of BTS die-hard fans popularly known as BTS ARMY (Adorable Representative M.C. For Youth), were credited for this success. And in this the Indian leg of the ARMY took the lead with making Butter, Spotify India’s biggest debut. The popularity of K-pop can also be witnessed at the ‘All India K-POP Contest’, organised annually by the Korean Cultural Centre India (KCCI). The pandemic took the competition online, that was hosted in 20 cities. “We want to provide the chance and platform for Indian youth to express their passions and to mingle with others as well. K-Pop in India is not just Korean one, it is Indian culture has been shaped by Indian youth. In the first round of our contest, which was open to all we received 3,686 entries from across the country,” said Yong. This rising popularity has also led to many taking up to learn the Korean language. “After bingeing on dramas over the lockdown, I started using Korean words like saranghaeyo, annyeonghaseyo in my conversations with my friends. And, then I just wanted to learn the language. I have started using Duolingo app to learn more. I plan to take this further and maybe apply to Korean language studies,” said Shilpi Mazumdar, a marketing manager in Delhi. At King Sejong Institute(KSI), that supports Korean language and culture around the world, first half of 2020 had 703 students at their four centres enrolled in 40 courses. In 2021, across six centres, 2,749 students were enrolled in 60 courses. The online Korean language hobby classes by KCCI that opens up with 1,200 seats, gets filled within minutes for every semester of three months. Oh, the world of Korean beauty Glass skin, face sheets, snail mucin and more, K-beauty has taken off as a rage in India. Jamsu, a DIY Korean beauty hack of dunking the face into ice cold water went viral on the internet and even celebrities like Katrina Kaif were seen indulging in this hack. The past few years have see a boom in the K-beauty industry with Korean cosmetic brands getting a breakthrough in the Indian market. “People want to invest in personal care and are open to exploring new global beauty regimes. This has opened several innovation opportunities for brands in the segment, with K-beauty leading the pack. In fact, the pandemic has accelerated adoption. At Pilgrim, we witnessed a 2X increase in sales in the last 9 months with our K-Beauty range (Jeju) driving maximum sales. We saw 30 percent of our overall sales come from Northeast India with Guwahati leading the pack. In metros, Bengaluru and Delhi registered maximum sales. Both our ranges, K-Beauty and French Beauty were most popular among the age group of 20-35, who drove 60 percent of our revenue,” said Anurag Kedia, co-founder and CEO, Pilgrim. Author Tweets @NamyaSinha Follow more stories on Facebook and Twitter Namya Sinha writes and reports on pop culture, lifestyle, food, and trends. ...view detail   ",
    "datetime": "2021-09-03T17:32:32+05:30",
    "url": "https://www.hindustantimes.com/lifestyle/art-culture/korean-wave-made-in-korea-gorged-and-loved-in-india-101630670553337.html"
}