{
    "title": "Korean Wave on Omani shores",
    "text": "Muscat – Korean culture has taken over the world by storm. Korean language, cuisine, fashion, music, TV series and movies have a significant influence on youngsters in many parts of the world. Referred to as the Korean Wave, it has spread far and wide since its origins in 1990s, influencing teenagers and young adults from Asia to Africa to Europe.\nThis global phenomenon reached Omani shores, too, some time ago and is now deeply entrenched in some sections of youngsters, both citizens and residents, who embrace many aspects of Korean culture. It’s not uncommon to find millennials watching K-drama, dancing to K-pop tunes, even actively learning Korean.\nThe heightened emphasis on delivering high-quality products has enabled Korean brands and the entertainment industry to provide premium quality products and content to the rest of the world and attract new customers.\nKnown for affordability and fast fashion, Korean clothes have evolved rapidly and now compete with some of the top international brands. Bold yet balanced, colourful yet tasteful, Korean fashion has created popular trends. The clothes of popular K-pop and K-drama artists are influencing the rest of the world, redefining fashion standards, breaking barriers and making South Korea a fashion destination for many.\nThe influence of Korean fashion is reflected in the way the youth of Oman are dressing, as can be seen at popular hang-outs of hipsters. Ankle-length pants, baggy pants, oversized shirts and bucket hats – all influenced by Korean fashion trends – are in clear display.\nFatma al Saadi was inspired to adopt Korean fashion because of its simplicity and uniqueness. “The beauty of their fashion is that it immediately makes you think of Korea, and their contemporary style is rarely seen in western films and pop music,” she said.\n“I also feel that Korean culture has a few similarities to Omani culture,” Fatma claimed.\nBesides fashion, youngsters in Oman are increasingly developing a keen interest in K-drama and films. Korean series and films, including Train to Busan, Crash Landing on You, Parasite and Squid Game, have been lapped up by young people in Oman and created viewership records. Striking a balance between good visuals and emotional appeal, Korean content taps on a wide variety of unexplored themes and underlying traditional values.\nIsha Mehta, a resident of Oman from India, is ‘hooked’ to Korean culture. “I love the detailing in direction, plots, brilliant casting and original soundtracks in their movies and dramas. It inspired me to learn the language so that I can know more about their culture,” Isha said.\n\nOften seen as the international face of South Korea, K-pop has been dominating the pop music industry around the world. Strategically orchestrated as unshakeable earworms, K-pop is known for its seamless tunes, synchronised choreography and extreme attention to detail. K-pop has skyrocketed in popularity in recent years. Bands like BTS, Blackpink and Bigbang have broken records and have become a vehicle for elevating South Korea and its culture on the global stage.\nFatima Fouda, an Egyptian resident in Muscat, said, “I have been following K-pop for a few years now. Their songs don’t just have deep meaning, but can also instantly lift my mood and make me happy. When I first started listening to BTS, even though I didn’t understand the language, the music and vibe drew me in.”\nYouth across the sultanate are coming together in their love for Korean culture. With fan pages solely dedicated to Korean culture enthusiasts in Oman, it has become a driving force for people to feel closer to one another, forming communities and developing strong parasocial relationships.\n(Contributed by Aashna Sanghani) Muscat – Korean culture has taken over the world by storm. Korean language, cuisine, fashion, music, TV series and movies have a significant influence on youngsters in many parts of the world. Referred to as the Korean Wave, it has spread far and wide since its origins in 1990s, influencing teenagers and young adults from Asia to Africa to Europe. This global phenomenon reached Omani shores, too, some time ago and is now deeply entrenched in some sections of youngsters, both citizens and residents, who embrace many aspects of Korean culture. It’s not uncommon to find millennials watching K-drama, dancing to K-pop tunes, even actively learning Korean. The heightened emphasis on delivering high-quality products has enabled Korean brands and the entertainment industry to provide premium quality products and content to the rest of the world and attract new customers. Known for affordability and fast fashion, Korean clothes have evolved rapidly and now compete with some of the top international brands. Bold yet balanced, colourful yet tasteful, Korean fashion has created popular trends. The clothes of popular K-pop and K-drama artists are influencing the rest of the world, redefining fashion standards, breaking barriers and making South Korea a fashion destination for many. The influence of Korean fashion is reflected in the way the youth of Oman are dressing, as can be seen at popular hang-outs of hipsters. Ankle-length pants, baggy pants, oversized shirts and bucket hats – all influenced by Korean fashion trends – are in clear display. Fatma al Saadi was inspired to adopt Korean fashion because of its simplicity and uniqueness. “The beauty of their fashion is that it immediately makes you think of Korea, and their contemporary style is rarely seen in western films and pop music,” she said. “I also feel that Korean culture has a few similarities to Omani culture,” Fatma claimed. Besides fashion, youngsters in Oman are increasingly developing a keen interest in K-drama and films. Korean series and films, including Train to Busan, Crash Landing on You, Parasite and Squid Game, have been lapped up by young people in Oman and created viewership records. Striking a balance between good visuals and emotional appeal, Korean content taps on a wide variety of unexplored themes and underlying traditional values. Isha Mehta, a resident of Oman from India, is ‘hooked’ to Korean culture. “I love the detailing in direction, plots, brilliant casting and original soundtracks in their movies and dramas. It inspired me to learn the language so that I can know more about their culture,” Isha said. Often seen as the international face of South Korea, K-pop has been dominating the pop music industry around the world. Strategically orchestrated as unshakeable earworms, K-pop is known for its seamless tunes, synchronised choreography and extreme attention to detail. K-pop has skyrocketed in popularity in recent years. Bands like BTS, Blackpink and Bigbang have broken records and have become a vehicle for elevating South Korea and its culture on the global stage. Fatima Fouda, an Egyptian resident in Muscat, said, “I have been following K-pop for a few years now. Their songs don’t just have deep meaning, but can also instantly lift my mood and make me happy. When I first started listening to BTS, even though I didn’t understand the language, the music and vibe drew me in.” Youth across the sultanate are coming together in their love for Korean culture. With fan pages solely dedicated to Korean culture enthusiasts in Oman, it has become a driving force for people to feel closer to one another, forming communities and developing strong parasocial relationships. (Contributed by Aashna Sanghani) Launched on October 10, 2009, Muscat Daily is now the largest selling broadsheet newspaper in the Sultanate of Oman with 33,500 daily copies and 28,000 subscribers.. Muscat Daily provides unrivalled national news coverage from Oman, the region and internationally. © 2021 Apex Press and Publishing. All Rights Reserved. Powered by Mesdac ",
    "datetime": "2022-03-19T17:36:49+00:00",
    "url": "https://www.muscatdaily.com/2022/03/19/korean-wave-on-omani-shores/"
}