{
    "title": "Korean TV Dramas in U.S., Europe Focus – The Hollywood Reporter",
    "text": "Subscribe for full access to The Hollywood Reporter Subscribe for full access to The Hollywood Reporter Korean TV dramas and entertainment programs have long been a hot commodity across Asia. By Lee Hyo-won, Georg Szalai \n\n\tApril 5, 2016 3:44am On March 27, Wolmido Island off the coast of Incheon, South Korea, hosted a feast featuring 3,000 fried chickens and 4,500 cans of local beer. It was a corporate event for the 6,000-odd employees of a Chinese cosmetics company, part of a weeklong themed trip inspired by the smash hit Korean TV soap My Love From Another Star. Chicken and beer are the daily staples of the series’ heroine, who, as the title suggests, falls in love with a beautiful (though anti-social) alien. Since it began broadcasting in China in 2014, the fantasy romance from Seoul Broadcasting System (SBS) has been credited for a 200 percent spike in annual Korean beer exports to the middle kingdom.  Korean TV dramas and entertainment programs have long been a hot commodity across Asia and have inspired cult followings across South America, the Middle East and even parts of Africa. International sales of Korean shows generated $180 million for broadcasters and producers in 2009 and have since enjoyed an annual average growth rate of 13.8 percent, according to the Korea Communications Commission. Now the U.S. and European industries are looking to catch the Korean wave. Last month, ITV Studios licensed Korean supernatural cop drama Who Are You for a remake, the first time a Korean fiction series has been licensed for the U.K. The original series stars So E-Hyun as an elite policewoman who, after awakening from a six-year coma, finds she can see and speak with ghosts. She’s teamed up with a skeptical junior detective (played by TaecYeon). The ITV deal was the latest European license for a Korean drama struck by by Eccho Rights, the Swedish rights group that has found a lucrative side business in selling shows form new boom territories (South Korea, Turkey) to European broadcasters. Eccho previously signed a deal with Endemol Shine in Italy to develop a local version of Korean series Ice Adonis, about a woman who is betrayed by her stepsister and loses everything. The show has already been successfully adapted for Ukrainian TV, where it was a ratings hit in 2015. “Korean dramas have storylines that are quite original. They are not afraid to make surprising twists and turns, and they are very cleverly done in general,” said Nicola Soderlund, managing partner at Eccho Rights. “The pacing also helps. They are not as slow as is very often the case in other territories.” In 2014, ABC greenlit an adaptation of My Love From Another Star, handing out a remake script commitment with a penalty attached. Park Ji-eun, creator of the original series, was on board to executive produce, but the show didn’t make the cut for the following TV season.  ? The same was true for ABC’s planned remake of time travel thriller Nine: Nine Time Travels, CBS’ medical drama based on the Korean series Good Doctor and CW’s U.S. version of Oh My Ghostess, a rom-com series with a supernatural twist (shy girl gets possessed by spirit of virginal ghost determined to get laid). “It’s not surprising that these American remakes aren’t immediately happening,” said Korean pop culture critic Kim Bong Seok. “Korean dramas remain a niche genre outside of the country. Series like My Love From Another Star feature elements of fantasy that appeal to Asian viewers, while their conservative depictions of romance and family values and the toned-down violence resonate with Middle Easterners. The melodrama seems to strike a chord with telenovela-watching South Americans.” For an American audience, however, Korean TV can be an acquired taste. “Korean dramas focus…less on the over-sexualization you see in Western entertainment, and there is much less violence,” said Park. A full season for a Korea show is often just 16 episodes, which can also make it a challenge for American networks looking to stretch a narrative to fit their 26-episode season. “The milestone to say the Korean industry has achieved global status is getting some remake done in the U.S. None of them really passed the initial pilot stage,” said Suk Park, co-founder and president of DramaFever, a video streaming site specializing in Korean TV series that has licensing deals with all three major Korean TV networks. “In Western countries, [the audience for Korean dramas is] still much more of a pure online base.”  Angela Killoren, COO at CJ E&M America, explained: “The real popularity of K drama started from just the original dramas being made accessible online. Then people started hearing about these incredible numbers — millions of people a month out of the U.S. and all these countries outside Korea watching, and people were very intrigued.” And that has led to interest in remakes. But that audience watching Korean shows online is already substantial — and growing. According to a November 2014 consumer research report by Korea Creative Content Agency USA, approximately 18 million people were watching Korean dramas in the U.S. through DramaFever. Earlier this year, Warner Bros. acquired the streaming site, buying out previous owner Japan’s SoftBank. Viki, another streaming service specializing in Korean drama, recently picked up U.S. rights to another hit series, Descendants of the Sun, which DramaFever also offers. The larger-than-life romance, currently airing on Korean Broadcasting System 2 , has sold to 32 territories and counting, including the U.K., France, Italy, Germany and Spain. John Duncan, co-director of UCLA’s Center for Korean Studies, sees a parallel between the growth in online niche markets for Korean series in the U.S. and the similar 1980s U.S. subculture around Japanese animations. “Kids today, even in remote parts of the U.S. where there aren’t Koreans, are downloading Korean films and dramas,” he told The Korea Times.  “Here in Hollywood, the hunt is on for new stories,” Killoren said. “There are these stories coming out of Korea showing that they do have global appeal, which has people looking. And a lot of people we talk to in TV, when they watch them, they say they are also into these dramas and binge-watch. One of the writers we work with, she started really getting into this drama herself and said, I need to adapt this.” Added Park: “Everyone [in the business] is looking for different stories. There is sort of a sense of general fatigue and that the same stories have been told the same way over and over again.”? Why hasn’t there been a major remake of a Korean drama in the U.S. yet? “A lot of people are watching the originals, but people also watch a lot of stories in their own language, and that becomes this source of remakes potentially,” said Killoren. “That said, there is a lot of competition, and a lot of things go into development and don’t necessarily come out. We’re still waiting for our first real Korean drama to hit the main stage, but we are pretty hopeful that that’s going to happen very soon.” Korea’s non-scripted television has been more successful. NBC picked up Grandpas Over Flowers, a senior citizen travelogue reality show, making it the first non-scripted Korean format to be adapted by a U.S. network. William Shatner, Henry Winkler, George Foreman, Jeff Dye and Terry Bradshaw signed on to star in the U.S. version, entitled Better Late Than Never, and traveled through major cities in Asia. Parts of the U.S. show were shot in Korea last summer. The actors visited traditional “jjimjilbang” spas and viewed the demilitarized zone separating North and South Korea before moving on to Japan and Hong Kong. “Hollywood is always looking all over the for fresh ideas and proven shows,” said Keo Lee, development executive at 3AD, a film and TV production company that is trying to bring Korean formats to the U.S. “Because of the cultural and industry differences, it is a challenge to adapt shows. It’s not easy, but multiple parties are trying, and sooner or later it’ll happen.”  Sign up for THR news straight to your inbox every day Sign up for THR news straight to your inbox every day Subscribe for full access to The Hollywood Reporter Send us a tip using our anonymous form. ",
    "datetime": "2016-04-05T03:44:45+00:00",
    "url": "https://www.hollywoodreporter.com/news/general-news/korean-tv-dramas-us-europe-879850/"
}