{
    "title": "Korean Wave in ASEAN keeps going strong - World - The Jakarta Post",
    "text": "Please Update your browser Your browser is out of date, and may not be compatible with our website. A list of the most popular web browsers can be found below.\n          Just click on the icons to get to the download page.  Or continue login with The Korean Wave, known widely as Hallyu, keeps making headlines with the presence of boy band BTS and girl bands Blackpink and Twice. It dominates the Youtube charts, with BTS reaching total views of 5.45 billion followed by Blackpink with 2.98 billion. According to the 2018 Korea Foundation’s Global Hallyu Status Report, the number of Korean Wave fans reached 89.2 million in 113 countries. Some 70 million of them were in Asian countries. Jang Won-ho, dean of the University of Seoul’s College of Urban Sciences and director of the Center for Global Culture and Social Empathy, explained that the amount of Korean content exports to ASEAN countries had increased from US$800 million in 2015 to $1.3 billion in 2017. East Asian countries China and Japan still dominate the market with Korean content exports of $2.9 billion in 2015 and $3.3 billion in 2017. “ASEAN is the second-largest market after East Asia, five times bigger than the North American market and 10 times that of Europe,” Jang said. “We can say Hallyu has attained great popularity in ASEAN. The same can be said about the fandom of Hallyu.” The fandom of Kpop — which is part of the Korean Wave — has been known to be loyal in promoting their artists through good causes such as donating to disaster victims. ASEAN-Korea Center (AKC) secretary-general Lee Hyuk said during his keynote speech at the one-day ASEAN-Korea Media Forum to Bring the ASEAN Wave to Korea in Seoul on Wednesday that the Korean Wave had served as a firm foundation for the robust ASEAN-Korea partnership over the decades. “This year, marking the 30th Anniversary of the ASEAN-Korea Dialogue Relations, the center now seeks to go beyond the ‘one-way’ Korean Wave and bring ‘two-way’ ASEAN-Korean Waves through the active socio-cultural exchanges between ASEAN and Korea,” he said.  “ASEAN is the second-largest market after East Asia, five times bigger than the North American market and 10 times that of Europe.”  The forum was attended by 30 representatives from ASEAN and the media — including members of the Asia News Network (ANN) — to get together to explore greater partnership for promoting ASEAN-Korea exchanges. Apart from Lee, Korea Herald CEO & publisher Kwon Choong-won, Malaysian Ambassador to Korea Dato’ Mohd Ashri Muda and executive director of the 2019 ASEAN-ROK Commemorative Summit Preparatory Office Suh Jeong-in also delivered their remarks. “The ASEAN-Korea Center will continue to work with media stakeholders in bringing the peoples of the two regions closer and foster their mutual understanding,” Lee said. Kim Youn-sung, director of the Star Collabo platform planning team, shared his experience on the production of hit dramas such as Mr. Sunshine, Descendants of the Sun and Goblin — which are popular in ASEAN countries, including Indonesia. “There is an increasing demand [for Korean dramas] in the ASEAN market. We can collaborate well [with ASEAN countries] and the AKC can be the hub for cultural exchanges for both parties,” he said. “I believe in the coming years, [collaborative] content from ASEAN countries will be accepted by Korean people.” However, the mainstream media had been reluctant to provide Hallyu content for their readers. “When Kpop groups like TVXQ, Super Junior and Big Bang started having concerts in ASEAN countries, then the mainstream media started to cover Kpop,” said June Wong, chief special projects officer of Malaysian-based The Star. Herself a Korean drama fan and an ARMY (nickname for BTS fans), Wong shared how the mainstream media was losing to social media when it came to the Korean Wave. She added that covering Kpop did not provide revenue to the media industry, which was another hurdle. But Bae “Kenny” Kihyung, senior producer of KBS World Channel and Content, said the popularity of the Korean Wave coincided with the growing acceptance of social media networks. “The growth of social media has created the environment for the global phenomenon of Kpop,” he said. “The Korean Wave industry keeps an ecosystem where it can continuously spread globally. It’s just like Korean dramas — such as Winter Sonata which was popular in 2002 — that has continued gaining popularity with the recent hit Descendants of the Sun, which was popular globally in 2016,” Bae added. The ASEAN-Korea Media Forum was a kick-off event of the festivities that the AKC is planning throughout this year, which marks the 30th Anniversary of ASEAN-Korea Relations and the 10th anniversary of its establishment. Under the theme “My ASEAN”, the AKC will host events including the ASEAN Week in June, the ASEAN Train in October and the ASEAN-Korea Export-Import Fair in November. © 2016 - 2023 PT. Bina Media Tenggara ",
    "datetime": null,
    "url": "http://www.thejakartapost.com/news/2019/04/25/korean-wave-in-asean-keeps-going-strong.html"
}