{
    "title": "\"Korean Wave\" dalam K-Pop dan K-Drama, Apakah Kamu \"Korbannya\"?  Halaman all - Kompas.com",
    "text": "\"Korean Wave\" dalam K-Pop dan K-Drama, Apakah Kamu \"Korbannya\"? Tim Redaksi KOMPAS.com - Sebanyak empat negara meneliti cara usaha kecil/menengah (UKM) dan start up Korea Selatan yang memasuki pasar Indonesia dan Malaysia, bahkan mampu meningkatkan market share produk-produknya. Keempat negara tersebut adalah Amerika Serikat, Korea Selatan dengan Pusan National University, Malaysia, dan Indonesia dengan Sekolah Bisnis Manajemen (SBM) Institut Teknologi Bandung (ITB). Ketua Kelompok Keahlian Bisnis Strategy and Marketing SBM ITB, Reza Ashari Nasution mengungkapkan penjelasannya. Baca juga: Korean Wave Berhasil Promosikan Budaya Korea Penelitian yang mereka jalankan menggunakan studi literatur, wawancara, dan analisis big data dari 500.000 entry data di berbagai macam platform media sosial. “Hasil analisis data diperkirakan selesai Februari-Maret 2020,” tutur Reza, yang dihubungi di Bandung, Jumat (24/1/2020). Saat ini, sambung Reza, yang baru dipublikasikan adalah hasil dari penelitian dengan metode wawancara dan studi literatur. \"Korean wave\" atau yang biasa disebut budaya pop Korea seperti K-Pop dan K-drama menjadikan anak muda Indonesia sebagai \"korban\". Mereka dengan mudah menjadi konsumen yang membeli  produk skincare, kosmetik, pakaian hingga makanan asal Korea. Baca juga: Terlena Pusaran Korean Wave Korean wave atau Halyu, kata Reza, memang menawarkan budaya dan gaya hidup masyarakat Korea. Rupaya, budaya dan gaya hidup itu mudah dicerna, dan mirip dengan keseharian anak muda di Indonesia. Kondisi inilah yang lalu menginspirasi dan membuat orang Indonesia berkeinginan untuk meniru. “Ada akultrasi budaya dari Korea yang diemulasi oleh anak muda di Indonesia,” ungkap dia. Hal ini juga berpengaruh positif terhadap penjualan produk-produk Korea seperti skincare, kosmetik, makanan, hingga pakaian. Baca juga: 4 Brand Skincare untuk Tampilan Kulit Glass Skin Ala Korea Apalagi, kata Reza, artis yang mereka tonton menjadi brand ambassador dari produk tersebut. Saat dicoba, produk yang anak muda Indonesia beli kualitasnya bagus dan cocok. Hal ini membuat Korean wave dan produk Korea menjadi saling menguatkan. Namun di sisi lain, tidak ditemukan adanya pengaruh dari image elektronik Korea seperti LG, Samsung, dan Hyundai dalam keputusan anak muda Indonesia membeli sesuatu. Ini berbeda jauh dengan pengaruh K-Pop, K-Drama, dan berbagai budaya pop Korea Selatan, terhadap daya beli konsumen-nya. Hal serupa terjadi di Malaysia. Peneliti dari Multimedia University Malaysia, Robert Jeyakumar Nathan angkat bicara. Baca juga: Serum dengan Kandungan Herbal Korea untuk Haluskan Kulit Menurut Robert, Korean wave berimbas positif pada penjualan skincare dan kosmetik Korea di Malaysia. Produk-produk tersebut kini kian eksis di Negeri Jiran. Penelitian ini akan dilanjutkan pada tahun 2020. Ke depan, penelitian ini bisa dimanfaatkan dan menjadi bahan pembelajaran UKM Indonesia agar bisa ikut go international.                Dapatkan informasi dan insight pilihan redaksi Kompas.com Periksa kembali dan lengkapi data dirimu. Data dirimu akan digunakan untuk verifikasi akun ketika kamu membutuhkan bantuan atau ketika ditemukan aktivitas tidak biasa pada akunmu. Segera lengkapi data dirimu untuk ikutan program #JernihBerkomentar. ",
    "datetime": "2020-01-24T11:11:56+00:00",
    "url": "https://lifestyle.kompas.com/read/2020/01/24/181156720/korean-wave-dalam-k-pop-dan-k-drama-apakah-kamu-korbannya?page=all"
}