{
    "title": "Korean wave brings tsunami of delicacies to town - SHINE News",
    "text": "Following the popularity of K-dramas and K-pop hits, Korean barbecue seems all the rage in the city. Along with barbecue having a moment, are you up on all the delicacies the K-wave is crashing down on Chinese shores? Halu Korean Bistro has all the answers for those curious about authentic Korean flavors, which has taken up residence on the first level of the cocktail bar Ars & Delecto on Jinxian Road. It encapsulates a feeling of coziness with down-to-earth elegance. Jeff Lao from Ars & Delecto wanted to bring in the Halu team, because he wanted something that's more relatable and grounded. Pork belly served with kimchi \"The change is mainly driven by the fact that we felt like going back to the core of our passion for doing food and beverages, and that is to enjoy delicious meals and tasty drinks with great people,\" Lao said. Chef Rosie Choi's menu takes traditional cooking methods and seasonings and presents the results in novel ways. The mission is to keep the authentic flavor profiles of Korean dishes, which are essentially what the Korean owners of Halu have been missing away from their home cities. Spicy whelk salad In essence, they are introducing a more diverse Korean food culture. \"I hope to showcase the charm and depth of authentic Korean food through our brand, rather than just seeing it as a trend,\" said Halu partner Joonsam Park. The menu offers items like Korean fried chicken, tteokbokki (Korean rice cakes) and pajeon (Korean-style pancakes) as well as a variety of flavorsome soups and noodles. Spicy whelk salad is a delicious appetizer to start the meal. A mixture of finely chopped vegetables and fresh pear are mixed together with steamed whelk in a savory and spicy dressing made of chili paste, rice vinegar and garlic. Live octopus hotpot Pork belly served with kimchi is a crowd-pleasing meat dish. The meat is boiled and steamed until tender and served thinly sliced. At the table, each person dips the meat in a special sauce and eats it with pear kimchi, which gives it an extra burst of flavor and crunchy texture. The homemade kimchi is supposed to be eaten fresh without fermentation. A Korean meal always includes either a stew or soup, and the live octopus hotpot makes a lasting impression. The staff brings a live octopus and puts it in the pot, which some make think is cruel, but others say it's the freshest seafood imaginable. Info Opening hours: 5pm-11pm (closed on Mondays) Tel: 131-2289-2212 Address: 1/F, 222 Jinxian Rd Average price: 170 yuan In Focus Metro Nation World Sport Economy Tech Auto Company Property Finance Event Art & Culture Travel Lifestyle Taste Entertainment Wellness MENTAL Book Education iDEALShanghai 沪公网安备 31010602001940号 Copyright 2019 ©  Shanghai Daily  All Rights Reserved. 沪公网安备 31010602001940号 About Us Contact Us Feedback Privacy Policy Terms of Use ",
    "datetime": null,
    "url": "https://www.shine.cn/feature/taste/2108274127/"
}