{
    "title": "Korean Symphony Orchestra kicks off Asian tour in Bangkok",
    "text": " PUBLISHED : 17 Oct 2013 at 00:00 NEWSPAPER SECTION:  Life K-classic will resound in Bangkok early next month as the epic centre of the Korean wave, the Korean Symphony Orchestra, will start its Asian tour with a performance at the National Theatre Bangkok on Nov 2 at 7pm. The Korean Symphony Orchestra will perform at the National Theatre on Nov 2 at 7pm. The concert will open with June-Hee Lim's Dancing Arirang, adapted from the traditional Arirang folk song for the orchestra led by chief conductor Hee-Chuhn Choi. Arirang embraces the sweet and the bitter of the nation through the vicissitudes of Korea's history with its beautiful and lyrical melody, and the music continues to be loved as the pivot that binds together not just people inside Korea but also all ethnic Koreans scattered around the world. The programme will include Piano Concerto No. 1, which was written by Franz Liszt, the greatest virtuoso in his time, to maximise and develop the expression of the instrument. The piece requires a performer with excellent technique and expression. It will be performed by Tae-Hyung Kim, who will join the Korean Symphony's Asian tour as a soloist. He is a leading young pianist loved by a large number of Korean fans of classical music. Making the grand finale of the concert will be Tchaikovsky's most-touted Symphony No. 5. It is dubbed the greatest masterpiece of all six Tchaikovsky symphonies. Pierced throughout with a dark and pathetic mood, the work is well-known for its beautiful and splendid expression of the gloominess through the combination of luxurious and colourful orchestration with rich and romantic melodies. The leading orchestra of Korea will give only two performances during their first Asian tour, which kicks off in Bangkok on Nov 2 and concludes in Singapore on Nov 4. This concert tour is to commemorate the 55th anniversary of diplomatic relationships with Thailand and the opening of the Korean Cultural Centre in Bangkok and the 50th year of Korean settlement in Singapore. There is no admission fee, but reservations should be made by calling the Korean Cultural Centre on 02-651-0165 by Oct 25. A limited number of tickets are also available at the door from 6pm on the concert day. Pianist Kim Tae Hyung Conductor Hee-Chuhn Choi By subscribing, you accept the terms and conditions in our privacy policy. ",
    "datetime": null,
    "url": "https://www.bangkokpost.com/life/arts-and-entertainment/375078/korean-symphony-orchestra-kicks-off-asian-tour-in-bangkok"
}