{
    "title": "Korean Wave in India hits Gen Z",
    "text": "The Korean wave is spreading in India, and it has given a platform for Gen Z to demonstrate their talent through a variety of events held around the country. On February 4, 2022, the Department of Political Science of Jesus and Mary College, University of Delhi, organized a K-pop dance competition titled \"Hop. Drop. K-pop.\" under their departmental fest – Politologue 2022. Politologue is the annual Fest of the Department of Political science, Jesus, and Mary College. Under this, they hold various academic and cultural events. One such event is the K-pop singing and dancing competition. The Hallyu wave is a big hit and with the greater integration of Indo-Korean cultures, K-pop events have garnered huge popularity. The K-pop event at Jesus and Mary College began in the academic year 2017-2018 under the guidance of Aishwarya Titus (president in the academic year 2017-2018) and has proven to be a success in previous years. The event not only had the biggest turnout in terms of volunteers, entries, and audience, but it was also one of the most anticipated. This year's event is being held in online mode, given the circumstances. The organizers received many entries, which were screened for the audience along with some amazing guest performances. Dr. Aakansha Natani, Professor from the Political Science Department, said: The Inter College K-pop Dance competition is judged by qualified Korean and Western dance professionals. This time around, the judges were Sam Rz and Raman Ray. Sam Rz is the leader of RE-CREATORZ Crew. He was the 2010 Ne-Hi Solo Popping winner on national TV. He was also the All Underground Hip-Hop runner-up in 2012, Mumbai. In 2014, he won the Pop and Smack Red Bull event (Mumbai). RE-CREATORZ Crew is a dance group based in New Delhi. The RE-CREATORZ Crew has had remarkable achievements, such as in 2018, winning third prize at K-pop Fest Delhi. The group has also performed in the presence of South Korean President Moon Jae-In at the Oberoi Hotel in New Delhi. Sam Rz judged the competition with another judge, Raman Ray, who has around seven years of dancing experience. His dance styles are Hip-Hop freestyle, lite feet, house, afro, and open style choreographies. He is a part of the professional crew RAWR. They have been 2-time winners of the world of dance team division and winners of different IIT competitions like IIT Kharagpur, IIT Guwahati, and IIT Kanpur. Judge Sam Rz said: Judge Raman Ray said: Guest performances were also presented by talented K-poppers who had previously won K-Pop competitions. RE-CREATORZ Crew, WE ARE FAMILY Crew, OFFSYDE, and vocalist Srija Paul were among the guest performers that got the audience dancing with their charismatic skills. In previous years, Jesus and Mary College, University of Delhi, has held an Inter College K-Pop singing competition in offline settings, with numerous guest performances by talented groups such as K-Pop Contest India Winners LOKALZ Crew. The participants in the competition were enthusiastic and versatile, with outstanding dancing moves and flawless outfits. Sarah Lalsanhim took first place, Ishita Mahajan placed second, and Yashashvi Deshwal gained third place. One amongst Jesus and Mary College's K-pop event organizers shared her experience of being a part of such a major event. Silvi Mary Sunil, K-pop event organizer and host, said: We also had the opportunity to speak with the winners, and this is what they had to say about their incredible experience as K-pop fans and competitors in such a prominent competition. Sarah Lalsanhim, who won the 1st position, said: Ishita Mahajan, who won the 2nd position, said: Yashashvi Deshwal, who won the 3rd position, said: The K-pop Dance Competition brought a large number of participants to the K-pop event. If you haven't had a chance to see the performances, check out the YouTube video below, which features the performances of the competition's winners. Starting with the winner Sarah Lalsanhim performing Step Back by GIRLS ON TOP, 2nd placed Ishita Mahajan performing Next Level by Aespa. Also, Yashashvi Deshwal performing on K-pop Mashup with tracks such as BTS- Butter, BLACKPINK- How you like that, TWICE- The feels, EXO- Love Shot, ITZY- Wannabe, ENHYPEN- Fever, RED VELVET- Red flavor, NCT127- Kick it, EVERGLOW- Bon bon Chocolat, GIDLE- Hann, MAMAMOO- Egotistic. Check out their performance!  In India, the Korean Wave has taken off and has a huge and dedicated following. With a massive fan base of K-pop and Korean dramas in India, it suffices to say that talented Korean artists' works such as the Oscar-winning film Parasite, Descendants of the Sun, Squid Game, and most recently, All of Us Are Dead, have influenced India's pop-cultural transition. Furthermore, many Korean Pop fans are waiting for the outbreak to end so that more Korean Pop concerts can be held in India. India already has a huge Korean Pop fan base such as BTS Army and Blinks. Shreya Lenka of Odisha was also recently revealed to be a K-pop Trainee under DR MUSIC, a Korean entertainment agency, and she may become India's first-ever K-pop idol. In recent years, Korean Pop concerts with Korean artists such as KARD and Jang Han-byul, as well as K-pop-inspired groups like Z-Stars, consisting of Z-Girls and Z-Boys, have been held in India. Desi fans are always on the search for opportunities to showcase their love for the genre, and they hope to see more of these events in the future to feel closer to their dreams. The Hallyu wave had a big influence on Generation Z, and it's still encouraging a lot of young people to explore Korean content. Quick Links   ",
    "datetime": "2022-02-10T01:36:47+00:00",
    "url": "https://www.sportskeeda.com/pop-culture/news-korean-wave-india-hits-gen-z"
}