{
    "title": "Korean star Ahn Jae Wook next to wed as photos reveal Won Bin's lush green wedding | The Straits Times",
    "text": "SEOUL - What a romantic, green summer wedding Korean stars Won Bin and Lee Na Young had last Saturday. Photos released on their management company's Facebook page on Sunday showed the lush meadow setting for their wedding at his hometown of Jeongseon in Gangwon Province outside Seoul. She was in a summery lace gown while he wore a double-breasted suit. It was a strictly family-and-friends affair as the small crowd of guests looking on in one photo showed. In a statement, Eden9 Entertainment said that under a clear blue May sky, the couple walked out in a green wheat field to exchange marriage vows, receiving the blessings of their parents. South Korean stars are hurrying to get hitched, it appears. Reports at the weekend said 43-year-old Ahn Jae Wook, one of the first Korean Wave stars, was to marry yesterday in a private ceremony. The actor-singer reportedly announced the wedding date on his official homepage last March and shared photos of his engagement to musical actress Choi Hyun Joo in Phuket. Choi, a graduate in vocal music at the Ewha Womans University in Seoul, is reportedly nine years his junior. Reports said they met last year on the set of a stage musical in which they played a couple. Ahn, who won fans starring in the 1997 drama Wish Upon A Star, had at that time returned to acting after undergoing surgery in Las Vegas in February 2013 for a stroke. Meanwhile, reports yesterday said actress Yoon Jung Hee, 34, married in Bali last Friday. Her beau is not from show business. She is a former Miss Korea finalist before becoming an actress, starring in TV series such as Dear Heaven (2005). Join ST's Telegram channel and get the latest breaking news delivered to you. Read 3 articles and stand to win rewards Spin the wheel now MCI (P) 066/10/2023. Published by SPH Media Limited, Co. Regn. No. 202120748H. Copyright © 2023 SPH Media Limited. All rights reserved. ",
    "datetime": "2015-06-01T16:52:35+08:00",
    "url": "https://www.straitstimes.com/lifestyle/entertainment/korean-star-ahn-jae-wook-next-to-wed-as-photos-reveal-won-bins-lush-green"
}