{
    "title": "\n\tKorean fashion designer Lie Sang Bong on K-wave - The Hindu\n",
    "text": "To enjoy additional benefits CONNECT WITH US May 18, 2016 05:10 pm | Updated 06:14 pm IST - Bengaluru COMMents SHARE READ LATER Top Korean fashion designer Lie Sang Bong Lie Sang Bong is one of the most eminent South Korean fashion designer in the world. His clothes are worn by the likes of Lady Gaga, Beyoncé, Juliette Binoche and Yuna Kim. The senior designer blends an array of influences like Korean poetry, calligraphy and architecture, cubism, Bauhaus design to create clothes using techniques like laser cutting, embroidery and digital printing. Lie has also designed limited-edition cell phones and uniforms for the A1 Grand Prix Korean national team in 2008. In the past, Lie has also occupied the position of President of Council of Fashion Designers of KOREA (CFDK) and cultural ambassador of Seoul. In an email interview, he elaborates on how the K-wave has taken over the entire world. How much is the Korean fashion industry pegged at? According to the Korean Fashion Industrial Research Centre, Korea’s fashion market grew 2.3 per cent (about 550M dollars) in comparison to 2014 to 2015, with the total market value of 28.4 trillion dollars. Unlike earlier in Korea where fashion used to be a necessity, today higher incomes allow a consumer to utilise fashion to express oneself. Who are the major takers of Korean fashion? How important is Indian market for designers like you or for smaller labels and designers in Dongdaemun market? Korea’s Fashion Business & Fashion week has now changed to a ‘Title Sponsorship’ system, and is sponsoring major international select shops, fashion media outlets, and fashion consultants to visit Korea and witness its fashion scene. Chinese retailers have become a major player in the international wholesale market in the past few years for both designer and Korean mass brands. India is one of the fastest growing markets that many designers are interested in. I am always fascinated with beautiful and rich culture of India. I have visited it more than three times and would love to show my collection there one day. What is the reason behind the popularity of K-beauty and K-fashion? In India, there are Korean film clubs, people follow K-serials and K-pop. I think that the main reason is ‘K-wave’. They admire Korean stars, and they love to follow their makeup and clothes and style. This has been helped by Korean Government which is supporting the ‘K-Wave’ for the past 10 years. There is exceptional interest in K-pop, K-star, K-drama, K-movie, K-food, K-beauty and K-fashion and people are listening to Korean songs, buying leading brands of Korea and even following Korean street fashion. Social media has further helped the cause. People actually visit Myeong-dong and Garosugil to observe Korean fashion and style. What has been the journey of South Korean fashion industry? When I was Korea’s PR ambassador, inviting the press and organising meet-ups was the only way to promote. However today, international press voluntarily comes to Korea to analyse and research more about our fashion industry. We have so many Korean designers who are well-known internationally through their fashion shows and boutiques. Korean designers have challenges to face in the Korean market and are going overseas to cities like London and New York to explore fashion further. But they don’t forget Korean aesthetic. Because Korea has retained its traditional aspect and experimented with modern ethos, it has been able to gain the respect it has today in the fashion world. COMMents SHARE leisure (general)\n\n/\n\npeople\n\n/\n\ncelebrity\n\n/\n\nfashion\n\n/\n\nbeauty\n\n/\n\nlifestyle and leisure\n\n/\n\nThe Hindu MetroPlus BACK TO TOP Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. ",
    "datetime": "2016-05-18T11:40:42.000Z",
    "url": "https://www.thehindu.com/features/metroplus/fashion-designer-lie-sang-bong-on-korean-fashions-growing-popularity/article8616311.ece"
}