{
    "title": "\r\n\tKorean stars coming to PH festivals, says ambassador | ABS-CBN News\r\n",
    "text": "Home\n > \nLife Posted at Mar 08 2019 12:54 PM | Updated as of Mar 08 2019 01:10 PM Share MANILA — Korean stars may be coming to a festival near you. South Korean Ambassador to the Philippines Han Dong-man bared on Thursday plans to bring Korean artists to local festivals in an effort to strengthen cultural ties between the country and South Korea. \"We have many plans in local areas. You have wonderful festivals,\" Han said in a press conference at the Mall of Asia Arena for the 2019 K-POP Friendship Concert in Manila. \"We will combine your local festivals with also K-pop... bringing Korean artists in the local areas,\" said Han. The K-POP Friendship Concert in Manila is among activities lined up this year in celebration of the 70th anniversary of bilateral relations between the Philippines and South Korea. Relations between the two countries began after the Philippines provided military assistance to South Korea during its war with North Korea in 1949. An orchestra concert in June will be held to honor Korean War veterans, the ambassador said, mentioning former president Fidel Ramos, who fought in the Korean War. The Philippine government will likewise hold events in Korea such as exhibits on Philippine mythological creatures, said National Archives of the Philippines Executive Director Victorino Mapa Manalo. \"We hope to develop with them a kind of cultural gain,\" Manalo said. Share US police launch manhunt for gunman who killed at least 22 October 26, 2023 Pumpkins for Halloween emojis? October 26, 2023 NAIA expects Undas influx to begin on Friday October 26, 2023 Palace: No suspension of work, classes on Oct. 31 October 26, 2023 USAID to fund development of 9 PH secondary cities October 26, 2023 BRAND NEWS BRAND NEWS How Filipinos can future-proof their finances Swedish home furnishing store accessible anywhere in PH Eye protection, 200MP flagship camera with HONOR 90 5G Strategies for stress-free holiday shopping An environment that energizes, supports businesses A mix of tech, entertainment, sports at JRU and UPD How to slow down bone loss as you age Lady guard honored for exemplary act BPO employees green up La Mesa Nature Reserve's forest When a photo booth becomes a holiday surprise Power couples' secrets to everyday confidence Where power and prestige meet Productivity meets fun with this realme tablet A celebration of togetherness and traditions Property builder offers 'Your Best Home Yet' Achieve a different kind of aura with this smartphone This app introduces new investment tools for Filipinos Smartphone photography: Meet the new challenger Food prep tips to help manage diabetes diet Kathryn, Min Bernardo share their stories in a vlog NBA teams up with tech innovator The impact of education expenses on Filipino families Anne Curtis' go-to gadget for nighttime photography Tips for a budget-friendly vacation Celebrity Fabio Ide's secret to a fit and healthy body Mall chain celebrates 65 years with deals, treats Property developer celebrates triple wins New smartphone series debuts with Anne Curtis Reclassified furniture: From dining to learning Jollibee Group reinforces sustainability with Cargill © 2023 ABS-CBN Corporation. All Rights Reserved. AboutCareersPrivacyTermsContact UsAdvertise With Us ",
    "datetime": null,
    "url": "https://news.abs-cbn.com/life/03/08/19/korean-stars-coming-to-ph-festivals-says-ambassador"
}