{
    "title": "Korean Fashion Welcomes a New Guard, Rivaling the Traditional Fashion Capitals - The Fashion Law",
    "text": "image: Ader Error “Korea is now what Japan used to be in the ‘90s. It has incredible popular culture. It’s a shout out and attention-grabbing in a way that’s very interesting.” This is what Vetements’ creative director, Demna Gvsalia declared last year when his brand debuted a capsule collection during Seoul Fashion Week. And he is right. In light of the increased attention being paid in the West to all things Korean (think: K-Pop, Korean skincare, television, technology, etc.), it seems only appropriate that Korean designers have been making a play for Western consumers. It is not unlike how K-pop stars, such as G-Dragon and CL have been Westernizing their songs (think: including English language choruses) in order to expand upon their audience base. And it is working. With Seoul emerging as an international style capital in its own right, the young talent coming out of Korea is proving that they can, in fact, compete on a global scale. Labels, such as Wooyoungmi and JUUN.J, for instance – favorites among K-pop mega stars, such as BigBang members G-Dragon and Taeyang – are stocked alongside their American and European menswear counterparts on Matches, FarFetch, Yoox, and Opening Ceremony’s e-commerce sites. These labels have also permeated the wardrobes of Western tastemakers, such as Rihanna, Kanye West, and a hand full of other musicians and fashion industry street style stars, further solidifying their influence outside of Korea. In addition, a new guard is beginning to make waves, as well. Younchan Chung’s label, The-sirius, for instance – which consists largely of neutral-hued garments with a futuristic aesthetic of modern, minimalist elegance – has drawn international attention, in part thanks to Chung being honored with the International Fashion Showcase designer award by the British Fashion Council in 2016. Noah Nam and his collection Nohant has amassed quite the following – in Korea and beyond, as has 87 MM, the brand founded by veteran runway models Wonjoong Kim and Jiwoon Park, which aims to eschew overly-trendy runway garments in favor of season-less wares; and Jiyeun Won and Jooho Lee’s R.Shemiste label and its revamps of classic ’90s styles and silhouettes. Hyein Seo And do not overlook Hyein Seo, who rose to fame in the U.S. after participating in VFILES’ Fall/Winter 2014 show during New York Fashion Week; Kanghyuk – whose eponymous founder graduated from the Royal College of Art in 2016 and has since landed collaborations with buzzy LA-based concept store H.Lorenzo and London’s Machine-A; and Ader Error, which has been described as the Korean answer to “it” brand of the moment, Vetements. Together, these brands are all helping to not only keep Korean fashion – an industry that has already brought in billions of dollars from pop-cultural exports to the West – firmly on the map but to elevate it even further in the eyes of international consumers. Demand for Korean culture, including fashion, stems from K-creatives’ “fearless affinity for adapting and honing in on what consumers want. It’s a huge asset to their growing, international influence,” per Janne Chung, one of the founders of Fig, a New York-based creative production studio and e-commerce store that is pioneering young international designers. Ader Error, Hyein Seo, thisisneverthat, 87MM, Gentlemonster, Mischief, and 99%IS- are some of the brands that have had a strong hand as of late in making Korean fashion a worldwide phenomenon, per Chung. And speaking of Ader Error, which has been getting a lot of traction in the West, Chung says, “From the beginning, Ader Error had very distinctive voice because they created sophisticated and engaging photography and styling catered to a global audience.” “They set the bar really high in creating imagery that was playful and unique,” she notes. “Their satirical and playful deconstruction of classic silhouettes really speak to the younger customer that is craving 90’s nostalgia. And by staying anonymous, they have kept the brand’s focus on their product and unique image.” And while it is easy to point to K-pop as the driving force behind the ever-increasing level of attention being paid to Korea’s fashion offerings – “The growing, global influence of K-Pop stars and its influencers all help in delivering a new perception of Korean fashion to the international consumer,” says Chung – there is much more to it than that. Ader Error “The rising popularity of Korean dramas and the Korean beauty industry are also an integral part of boosting the Korean wave internationally,” Chung told TFL. “But I think the biggest force behind Korea’s momentum is their leadership investing in technological innovation. South Korea is ranked No.1 for the world’s fastest internet connection speed. With Korea’s lightning speed product development, they are able to compete in a fast-paced environment where product cycles are short and attention spans of the consumer are fleeting.” She elaborated further, saying: “With their technological advancement, they are able to produce and execute at a speed that allows them to adapt immediately and stay on trend thus providing a strong foundation for international commerce and influence.” Add to that what designer Woo Young Mi calls Korean designers’ shared “ability to consistently offer something new and bold” – and a consumer base that vastly outsizes that of the U.S., France, Italy, and the U.K. combined (as in addition to native Korea consumers, Chinese are now buying their luxury products there and by 2020, Chinese luxury consumers will spend $29 billion at South Korea luxury retailers) – and you have a fashion capital to reckon with. Join our mailing list Stay up to date with The Fashion Law ",
    "datetime": "2017-08-14T14:57:35+00:00",
    "url": "https://www.thefashionlaw.com/korean-fashion-welcomes-a-new-guard-rivals-traditional-fashion-capitals/"
}