{
    "title": "Korean Wave: cosa insegna il successo dell’industria culturale coreana - Agenda Digitale",
    "text": "Media e soft power La Korean Wave ha fatto della Corea del Sud una potenza mediale: come si è formata, perché i prodotti funzionano, i numeri dei diversi settori, il ruolo di identità e tecnologia, perché riesce a sfruttare le piattaforme senza esserne fagocitata Pubblicato il 18 Apr 2022  Il processo di espansione industriale e culturale conosciuto come Korean Wave – Hallyu in coreano – ha ormai un buon ventennio di storia alle spalle, ma dagli anni Dieci ha assunto un particolare rilievo sulla scena mediale. La sorpresa dell’Oscar a “Parasite”. Il k-pop protagonista della musica mondiale. Infine, Squid Games, che ci ha fatti vergognare per due motivi: ha dimostrato che si può realizzare un prodotto con una forte identità e conquistare il pubblico globale, e che un’industria audiovisiva può usare Netflix anziché farsi usare. Squid Game, ecco perché la serie è un fenomeno socio-culturale  È arrivato il momento di andare a lezione dalla Corea? Un caso di industria della comunicazione che, dall’incontro con le piattaforme globali, è uscita, almeno apparentemente, più forte e capace di governare crescita e internazionalizzazione. Infatti, la strategia coreana non è semplicemente “resistere e consolidarsi”, come con successo sembra fare il Giappone, ma è quella di espandersi e diventare una potenza mediale sui mercati internazionali, se necessario anche grazie a un matrimonio di convenienza con le piattaforme-mondo[1]. Vediamo come. Indice degli argomenti La Corea del Sud è da tempo un esportatore netto di prodotti della cultura di massa: audiovisivo, musica, videogiochi. Secondo la Korean Creative Content Agency, una struttura governativa che sostiene le industrie creative nazionali, nel 2018 il Paese ha esportato contenuti e prodotti d’intrattenimento per 9,6 miliardi di dollari[2] e ne ha importati per 1,2 miliardi[3]: un significativo saldo positivo. E dal 2014 al 2018 il valore dell’export è quasi raddoppiato, mentre quello delle esportazioni leggermente diminuito: due dati che indicano la crescente competitività dell’industria creativa coreana a livello globale. Alcune considerazioni balzano subito all’attenzione. La prima è che la Corea cresce a vendere prodotti software e audiovisivo nel settore mediale e creativo in una fase della globalizzazione in cui l’internazionalizzazione è guidata dalla vendita di servizi. L’apparente contraddizione è risolta dalla scomposizione dell’export secondo il tipo di prodotto[4]: due terzi del valore (6,4 miliardi) è infatti costituito da videogiochi. Poiché il consumo di videogiochi si sta spostando rapidamente e in modo deciso verso l’online gaming su piattaforme (YouTube Gaming e Twitch/Amazon), le industrie creative coreane si collocano vantaggiosamente all’inizio di una supply chain che alimenta le piattaforme-mondo, partecipando in modo significativo all’estrazione di valore dal consumo globale di videogiochi. La Corea è il quarto mercato al mondo per i videogiochi, subito dopo la Cina, gli Stati Uniti e il Giappone[5]: l’esperienza di un vasto consumo interno unita al contatto con i grandi brand giapponesi e americani del settore hanno fatto crescere un’eccellenza produttiva. Un’eccellenza che, nel corso degli anni Dieci, ha saputo sfruttare la sinergia con l’espansione delle piattaforme. La musica costituisce, insieme al cinema e alle serie, la dimensione più immediatamente visibile della Korean Wave e del suo impatto sulla cultura di massa nei circuiti di consumo mediale globalizzati. E nel comparto musicale, che nel 2018 valeva ancora uno scarso 6% delle esportazioni delle industrie creative, il rapporto tra industria nazionale e piattaforme è ancora più stretto. Infatti, la crescita della penetrazione internazionale del K-pop negli anni Dieci segue una curva sovrapponibile a quella della diffusione delle piattaforme a livello mondiale. E si tratta di una crescita imponente: nel 2007, il valore delle esportazioni dell’industria musicale coreana era di quasi 14 milioni di dollari, un niente rispetto al valore globale dei consumi musicali, che nello stesso anno superavano i 18 miliardi di dollari. Nove anni dopo, nel 2018, a fronte di un valore di mercato quasi pari al 2007, i ricavi dalle esportazioni sono saliti a 564 milioni di dollari. La spiegazione la troviamo, ancora una volta, nell’espansione planetaria delle piattaforme, che il K-pop ha saputo sfruttare a proprio vantaggio. Anche il consumo di musica nel mercato mondiale, infatti, è ormai mediato dalle piattaforme e questo cambia le regole con cui le industrie musicali nazionali possono accedere ai consumatori. Nel 2020, la distribuzione online di musica ha rappresentato il 62% del mercato della musica registrata (esclusi quindi gli eventi dal vivo), ripartito tra video musicali su piattaforme come YouTube, streaming a pagamento e streaming gratuito finanziato dalla pubblicità.[6] Se guardiamo al tempo speso nel mondo per l’ascolto di musica online, YouTube non ha rivali, con più del 50%. Se invece consideriamo lo streaming basato su abbonamenti, nel primo trimestre 2020 al primo posto troviamo Spotify – l’unica piattaforma globale “europea” – con il 32% del mercato, seguita da Apple Music (18%), Amazon (14%), la cinese Tencent Music (11%) e infine Google/YouTube Music (6%): cinque piattaforme detengono l’81% dei 400 milioni di abbonati a servizi streaming musicali nel mondo, 93 milioni in più rispetto allo stesso periodo del 2019.[7] La storia della produzione musicale nella cornice della cultura di massa ha visto molti intrecci di culture diverse e contaminazioni felicemente creative: la musica caraibica e quella latino-americana, per fare un esempio, hanno trovato attenzione nell’industria e ricevuto diffusione mondiale, stimolando inoltre sperimentazioni e meticciati espressivi. La traiettoria del K-pop, che lo ha portato in un paio di decenni a conquistare il pubblico dell’Asia orientale e poi a scavalcare la distanza culturale dal pubblico della Generazione Z in America e in Europa, ha però specificità che è importante sottolineare. Innanzitutto, dietro al K-pop c’è un’industria nazionale solida, in grado di progettare e guidare l’innovazione del proprio prodotto. I gruppi di giovanissimi che costituiscono le icone della musica coreana provengono da un processo severo di selezione e formazione[8], che ricorda le modalità di creazione delle star a Hollywood negli anni Trenta e Quaranta: in alcuni casi, l’addestramento dei talenti dura anche sei o sette anni prima del lancio sul mercato.[9] La conquista della scena internazionale è frutto di una scelta consapevole di innovazione e contaminazione culturale da parte di un apparato industriale capace di progettare, al punto da pianificare il dosaggio accorto di parole coreane e inglesi nei testi delle canzoni, in una precisa strategia di “esotismo” diretta al pubblico nordamericano. All’interno di questa visione dell’internazionalizzazione, le piattaforme globali sono strumento di distribuzione e di visibilità: come dimenticare “Gangnam style”, il primo vero successo planetario del K-pop, che negli anni Dieci ha segnato un traguardo a suo modo epocale, raggiungendo per la prima volta nella storia di YouTube un miliardo di visualizzazioni, a oggi peraltro triplicate? Per il K-pop le piattaforme sono anche strumento di radicamento e creazione di un pubblico che diventa community. I BTS, la boyband coreana oggi più famosa, che nel 2020 per due settimane è stata in testa alla top ten americana, utilizzano i social per stringere i legami con i fan in tutto il mondo, contribuendo a educare anche il pubblico culturalmente più distante, appassionandolo alla sperimentazione coreana dell’ibridazione musicale tra Asia e Occidente. Sulla scia di questa seduzione del pubblico internazionale, l’industria coreana osa coinvolgere risorse creative americane ed europee nella sperimentazione di una sorta di K-pop fuori dalla Corea.[10] Per individuare le ragioni del successo coreano in molteplici comparti delle industrie creative dobbiamo seguire la traccia dell’innovazione di prodotto, che si incrocia con quella dell’ibridazione culturale. Anche nella produzione audiovisiva troviamo la capacità di combinare con autonomia Asia e Occidente e di far valere questa contaminazione come vantaggio competitivo nei mercati internazionali, a cominciare dalla Cina, il grande mercato mediale poco oltre i confini coreani. Per gran parte degli anni Dieci, le serie prodotte in Corea del Sud hanno dominato la scena dei media cinesi, sia in televisione sia, soprattutto, sui mega-portali video, come iQiyi. Le serie coreane hanno rappresentato per il pubblico cinese l’apertura di spazi d’immaginario impensati, mostrando come sia possibile accogliere la cultura occidentale senza farsene passivi recettori. Per anni, lo stile coreano in Cina ha dettato legge, suggerendo persino nuovi modi di cucinare. Poi ovviamente i media cinesi hanno imparato a produrre per conto proprio con la qualità e l’innovazione richiesti da un pubblico largamente composto da nativi digitali. In Cina per iQiyi, nel resto del mondo per Netflix: la Corea è ormai un produttore di serie che le piattaforme streaming portano ovunque con l’inconfondibile profilo della Korean Wave. Videogiochi, musica, audiovisivo: in tutti questi settori l’industria coreana dipende certamente dalle piattaforme per l’internazionalizzazione, ma sembra essere in grado di negoziare e difendere una posizione non subalterna. Quali elementi strutturali fondano questa resistenza del sistema nazionale mediale e questa sua capacità di volgere a proprio vantaggio i meccanismi dell’economia delle piattaforme? Il sistema mediale coreano è innanzitutto un sistema, capace di sviluppare progettualità e sinergie, grazie a un mix particolare di intervento statale e di iniziative di mercato. Questa è del resto la chiave di tutto lo sviluppo industriale e tecnologico coreano, dagli anni Settanta in poi.[11] Le liberalizzazioni nel settore dei media, negli anni Novanta, hanno dato impulso allo sviluppo senza indebolire la capacità di sostenere e orientare dello Stato. La progettualità e il sostegno si basano su una visione integrata dello sviluppo delle industrie creative. La Korean Creative Content Agency promuove la crescita del cinema, della serialità, dell’animazione, dei videogiochi, dell’industria musicale, ma anche quella della moda (che sta aggressivamente conquistando[12] visibilità internazionale) e delle tecnologie relative alla comunicazione e ai media. La Korean Wave è un’unica ondata, non un insieme di percorsi settoriali. È stata l’attenzione al cinema mondiale, promossa attraverso festival annuali, a stimolare la qualità dell’industria cinematografica nazionale, sperimentando storie e linguaggi innovativi. A sua volta, ciò ha dato una scossa alla piatta produzione di soap opera coreane, trasformando il prodotto seriale in un contenuto in grado di riconquistare l’attenzione del mercato interno e di proporsi su quello internazionale.[13] La specificità culturale del prodotto mediale coreano, ossia la sua rivisitazione della cultura di massa occidentale partendo dall’identità nazionale, è quella di aver incrociato i diversi elementi cercando una sintesi non al ribasso, per omologarsi con facilità al gusto del consumatore globalizzato, ma al rialzo. La forza del cinema coreano, come della musica pop e della serialità, è la sua persistente diversità, ben visibile all’interno di un linguaggio e di forme espressive comprensibili da parte del pubblico internazionale. Si è già detto che per la Cina e il resto dell’Asia orientale, questa diversità persistente, pur nell’ibridazione con la cultura occidentale, è un elemento che facilita l’accoglimento, perché rideclina la modernità occidentale all’interno dei comuni parametri di civiltà est-asiatica. Una civiltà a propria volta integrazione tra elementi diversi, come il confucianesimo, il taoismo e il buddismo, e in Giappone anche lo shintoismo, già incrociati con l’Occidente fin dal Diciannovesimo secolo. Per il resto del mondo, la diversità coreana è la scoperta di un’universalità differente, da accogliere con la curiosità e la partecipazione con cui in America del Nord la Generazione Z sta metabolizzando il K-pop. La seconda lezione coreana è che l’innovazione non si fa senza una base tecnologica e industriale adeguata. Dietro al successo creativo del cinema e delle serie vi è anche la forza di player globali della competizione tecnologica come Samsung e LG, la disponibilità di fibra ottica e gli investimenti nel 5G che fanno della Corea uno dei paesi più avanzati al mondo, la diffusa cultura tecnico-scientifica che sorregge attività d’avanguardia diverse come la produzione di microprocessori e quella di videogiochi, la ricerca nella realtà virtuale per l’intrattenimento e nell’intelligenza artificiale anche per i media. La terza lezione è che se perdi il mercato interno sei fuori dai giochi anche a livello globale. La Corea aveva le tecnologie, le competenze e le risorse per non cedere il mercato nazionale alle piattaforme statunitensi senza combattere. Facebook e WhatsApp hanno trovato in Kakao un concorrente senza ambizioni di espansione globale, ma ben radicato nelle abitudini del consumatore locale, offrendo servizi di messaggistica e contenuti video, musicali e gaming. A metà 2020, Kakao aveva 45 milioni di utenti in Corea[14] su 52 milioni di abitanti, mentre Facebook nello stesso periodo si fermava a 16 milioni[15]. Sempre nel 2020, il motore di ricerca coreano Naver ha surclassato Google, grazie alla preferenza del 59% degli utenti a fronte del 33% che ha scelto di utilizzare Google.[16] Naver ha anche un proprio sistema di pagamenti, una piattaforma streaming, servizi social e tecnologici per le imprese, si è lanciato nell’applicazione dell’intelligenza artificiale in vari prodotti, tra cui un traduttore automatico: è di fatto un’affermazione concreta di sovranità sul mercato nazionale dei servizi ad alta intensità tecnologica. Il mondo delle piattaforme in Corea ha imparato a parlare coreano. La qualità del prodotto, sostenuta dall’intero ecosistema mediale, ha consentito all’industria nazionale di riprendersi anche il box office. Nel 1993, prima della controffensiva della Korean Wave, la quota di mercato per i film coreani era precipitata al 15,9%, ma è salita fino al 63,8% nel 2006.[17] È ormai un dato strutturale che più della metà del box office vada a film di produzione nazionale, elemento essenziale per finanziare la crescita dell’industria e proiettarla sui mercati mondiali: nel 2016 ben 679 film coreani, nuovi o di catalogo, sono stati esportati nei mercati asiatici e occidentali.[18] La Corea sta conquistandosi uno spazio non subalterno, assertivo nel nuovo ordine globale disegnato dalle piattaforme-mondo, perché sta costruendo su un lungo percorso di accumulazione di competenze, risorse e strutture industriali. Se l’innovazione è una curva di apprendimento, la Corea l’ha percorsa dall’inizio e l’ha faticosamente risalita. È una potenza tecnologica, inventatasi con tenacia e progettualità nel corso di decenni, che a un certo punto ha capito di doversi proiettare verso il soft power. Non è la Cenerentola dei media che conquista di colpo il Principe del mercato mondiale. Certo, niente è per sempre. La Corea è diventata talmente strategica nel nuovo ordine globale della produzione mediale che per le piattaforme-mondo è indispensabile inserirla nei loro ecosistemi. I 500 milioni di dollari che Netflix sostiene di aver investito nel 2021[19] in quell’industria audiovisiva costituiscono una massa gravitazionale potenzialmente in grado di attrarre verso la piattaforma progetti e risorse creative. Il coeso complesso tecno-industriale costruito dalla Corea in questi decenni ha però la robustezza sistemica necessaria per resistere a tentativi di scardinamento e per negoziare con le piattaforme-mondo un armistizio di comune convenienza. A condizione che nel medio-lungo periodo la Corea non si trovi a essere un caso eccezionale e dunque isolato o con pochi altri simili, la cui resistenza, nel tempo, può essere travolta dalla potenza finanziaria crescente delle piattaforme-mondo. _____________________________________________________________________________________- Valuta la qualità di questo articolo    La tua opinione è importante per noi!    Argomenti Canali Speciale PNRR L'approfondimento 01 Feb 2023 di Mirella Castigli l'analisi 10 Mar 2023 di Francesco Gargallo di Castel Lentini e  Stefano Gazzella Prossimo Articoli correlati Articolo 1 di\n3 I tuoi contenuti, la tua privacy! Su questo sito utilizziamo cookie tecnici necessari alla navigazione e funzionali all’erogazione del servizio.\nUtilizziamo i cookie anche per fornirti un’esperienza di navigazione sempre migliore, per facilitare le interazioni con le nostre funzionalità social e per consentirti di ricevere comunicazioni di marketing aderenti alle tue abitudini di navigazione e ai tuoi interessi. Puoi esprimere il tuo consenso cliccando su ACCETTA TUTTI I COOKIE. Chiudendo questa informativa, continui senza accettare. Potrai sempre gestire le tue preferenze accedendo al nostro COOKIE CENTER e ottenere maggiori informazioni sui cookie utilizzati, visitando la nostra COOKIE POLICY. Cookie Center Tramite il nostro Cookie Center, l'utente ha la possibilità di selezionare/deselezionare le singole categorie di cookie che sono utilizzate sui siti web. Per ottenere maggiori informazioni sui cookie utilizzati, è comunque possibile visitare la nostra COOKIE POLICY. COOKIE TECNICI I cookie tecnici sono necessari al funzionamento del sito web perché abilitano funzioni per facilitare la navigazione dell’utente, che per esempio potrà accedere al proprio profilo senza dover eseguire ogni volta il login oppure potrà selezionare la lingua con cui desidera navigare il sito senza doverla impostare ogni volta. COOKIE ANALITICI I cookie analitici, che possono essere di prima o di terza parte, sono installati per collezionare informazioni sull’uso del sito web. In particolare, sono utili per analizzare statisticamente gli accessi o le visite al sito stesso e per consentire al titolare di migliorarne la struttura, le logiche di navigazione e i contenuti. COOKIE DI PROFILAZIONE E SOCIAL PLUGIN I cookie di profilazione e i social plugin, che possono essere di prima o di terza parte, servono a tracciare la navigazione dell’utente, analizzare il suo comportamento ai fini marketing e creare profili in merito ai suoi gusti, abitudini, scelte, etc. In questo modo è possibile ad esempio trasmettere messaggi pubblicitari mirati in relazione agli interessi dell’utente ed in linea con le preferenze da questi manifestate nella navigazione online. ICT&Strategy S.r.l. – Gruppo DIGITAL360 - Codice fiscale 05710080960 - P.IVA 05710080960 - © 2023 ICT&Strategy. ALL RIGHTS RESERVED Mappa del sito Clicca sul pulsante per copiare il link RSS negli appunti. Clicca sul pulsante per copiare il link RSS negli appunti. ",
    "datetime": "2022-04-18T08:57:41+02:00",
    "url": "https://www.agendadigitale.eu/cultura-digitale/korean-wave-cosa-insegna-il-successo-dellindustria-culturale-coreana/"
}