{
    "title": "Korean wave: K-Insider Challenge, K Cinema & Drama online event achieves over 1 million views - Asian Community News",
    "text": "Asian Community News - Community News NEW DELHI: “K-Insider Challenge, K Cinema & Drama” online event – a virtual platform designed for providing a meeting place for Korean culture fans in India registered over 1 million views on KCCI`s SNS channels. This was announced by Korean Cultural Centre India (KCCI) that created this platform. A total of 172 contestants submitted their videos to the “K-Insider Challenge, K Cinema & Drama” event. It was started with the “Kimchi Introduction” event, which had over 1 million cumulative views of all posts by 132 participants, and followed by the “K Beauty” event that exceeded 2 million views with 419 participants. K-Beauty event carried introductory content about Korean beauty products, Korean style makeup, and skincare tips during the 12-day participation period. The video content on the “K Cinema & Drama” event described the scenes from Korean movies and dramas and the cumulative number of views of all videos exceeded 1 million. With the question, the charming points of Korean films and especially Korean dramas, the participants, Madhura Jadhav from Mumbai said that not only the main character but also the surrounding people also grew up together with their own life stories. Linchika Teronpi living in Assam said, “It has very various and specific fields, characters, and subjects from daily families and human relationships stories to school life, romance, history, fantasy, and science fiction, but it is not limited to a specific region or class culture stories, it evokes universal sympathy.” Riyan Zimik said the Korean drama said that the vivid and three-dimensional depiction of people who pursue their own happiness while having their own anguish. Especially, the kings and ordinary lower-class people depicted in historical works will arouse our sympathy. In particular, Related Article: K-Dramas are here to conquer Indian audience. Are you ready to watch them? Ankita who is an MA student in Thane said that the Korean drama that allowed her to endure difficult times after the corona pandemic, Korean dram is her savior on her handwriting letter of thanks to the Korean Cultural Centre. Hwang Il-yong, director of the Korean Cultural Center India (KCCI) said, “In a situation where offline events and promotions are difficult due to the Covid 19 pandemic crisis, we regularly run an online event called K-Insider Challenge. Following Kimchi, K-beauty, and K-drama, we plan to continue to expand to other fields like K-fashion, etc. in the future.” https://www.youtube.com/watch?v=1ldg-4zPdmk&list=PLgz7Y00kpzlyaFKScGsEQuV1PKJHl8lMd  Prev Post Narad Jayanti Special: Journalism must aim at public welfare: Sunil Ambekar Next Post Indian Chef Shines: Wins Champion of Change award Japanese all-girls pop group Momoiro Clover Z marks 15th anniversary with Epic Tokyo… Japanese giants Panasonic, NEDO, JICA join hands to support IT-enabled e-rickshaw… 577th Hangeul Day special this time at Korean Cultural Centre India on Oct 9 Korean Festival 2023 Kickstarts with Spectacular Gala Night Celebrating Cultural… Leave A Reply Cancel Reply Your email address will not be published.     Recent Posts Japanese all-girls pop group Momoiro Clover… India to host skill evaluation test, job… Gujarati Garba meets Japanese & Korean… ASCI implements guidelines for “Dark… Japanese giants Panasonic, NEDO, JICA join… Japan Science & Technology agency… Assam-Japan Gateway 2023 event in Guwahati… Data Protection for India’s FinTech… KCCI New Delhi student Srija Paul wins… Golf Wellness Club comes up at DIA Park… Galaxy of top journalists to gather at Web… Flow of business travellers to Korea… Trending News Japanese all-girls pop group Momoiro Clover Z marks 15th… India to host skill evaluation test, job fair for job… Gujarati Garba meets Japanese & Korean Elegance at… Popular Articles Kunna Dash, President of India Japan Friendship Center,… Nine luxury hotels offer 400 rooms as paid quarantine… K-pop band BTS beats 4-Oscar winning filmmaker Bong Joon-ho… Welcome, Login to your account. Recover your password. A password will be e-mailed to you. ",
    "datetime": "2021-07-08T13:08:23+00:00",
    "url": "https://www.asiancommunitynews.com/korean-wave-k-insider-challenge-k-cinema-drama-online-event-achieves-over-1-million-views/"
}