{
    "title": "Korean consulate to bring a bit of Seoul to Auckland - NZ Herald",
    "text": "Share this article The South Korean Consulate is planning to bring a little bit of Seoul to Auckland in an effort to quench the thirst for all things Korean. Consul General Baekwan Hong says a range of activities are being organised following reports of the increasing popularity of Korean culture among New Zealanders. \"Going to Korea and experiencing its culture in person is the best way to understand Korea,\" Hong said. \"However not all people can do this, so instead our consulate will bring traditional and modern aspects of Korea to Kiwis.\" Among the events being organised in the coming months include K-pop and taekwondo workshops, Korean cooking classes at schools, a Korean film festival and turning part of the Glenfield Night Market into a Korean food street. The number of New Zealanders heading to Korea has been increasing year on year, with 33,088 going there last year - up from 28,426 two years before. Massey University sociologist Paul Spoonley has described South Korea as a \"modest version of London in the swinging sixties\" and a magnet for young Kiwis. Hong believed its popularity among New Zealanders was also because of the Korean Wave, or hallyu, fuelled by Korean dramas and K-pop. \"K-pop songs have hit the top of the Billboard charts a few times and Korean dramas are on Netflix,\" he said. \"Accordingly, many NZ-born Koreans or Kowis have become proud of having a Korean heritage and are choosing Korea as their OE destination.\" Professor Spoonley said it was \"great to see\" these Korean-themed events being planned for Auckland. \"It underscores how diverse the city has become and sends a message to everyone – Korean Aucklanders and others – that there are more options in terms of cultural experiences,\" Spoonley said. But while the events would raise the profile of Korea and Korean culture, Spoonley believed the number of young Korean New Zealanders will continue heading to Seoul. \"Seoul is now a global city which offers exciting options for those who want to experience Koreanness – and while these events are a taster, they do not replace the real thing,\" said Spoonley. \"It is also common for the children of migrants to experience their parent's 'home'. We call it 'OE'.\" Paul de Jonge, founder and operator of the Auckland Night Markets, said about 15 Korean food stalls will feature in Glenfield on September 30 and October 7. The stalls will be selling traditional favourites like bulgogi and tteokbokki, to fusion food such as kimchi burgers. \"It will probably be just like what you find on the streets of Seoul, except that it's on Auckland's North Shore,\" de Jonge said. There are about 30,000 people who identify as Koreans living in New Zealand, and 21,000 of them live in Auckland. More than four in 10 of those in Auckland live in the Upper Harbour, Devonport-Takapuna and Waitemata local board areas. • K-Fest and K-Pop contest - Sep 29, Victory Convention Centre, from 10am • Korean Food Night Market - Sun Sep 30  & Oct 7, 5:30-11pmGlenfield mall car park, 48 Downing St, Glenfield • K-Pop Dance Workshops by Rina Chae and Street Candee - starting Mon Oct 8, Ellen Melville Centre (City Central) and Northcote Citizen Centre, and in participating schools from September • Korean Film Festival in Auckland - Oct 11 to 14, eight free Korean movies Academy Cinemas. • Auckland Symphony Orchestra playing Gayageum Concerto (traditional Korean string instrument) - Sun Oct 21 and 28, Mon Oct 29 (kids concert) • Taekwondo Workshop - Sep and Oct in participating schools • Little Cooks K-Food Cooking Class - in 12 participating schools • Korean Traditional Games - in 10 participating schools • Korean Language Week, Sep 24 – 28 Share this article Let us know about inspirational Kiwis and stories in your town, city and region. ",
    "datetime": null,
    "url": "https://www.nzherald.co.nz/nz/korean-consulate-to-bring-a-bit-of-seoul-to-auckland/EOSKNV5HWIGZCG6RYL73NSZKZU/"
}