{
    "title": "Korean Beauty Trend: Men Wearing Makeup on the Rise | Glamour",
    "text": "By Beth Shapouri Johnny Depp has always been a trendsetter when it comes to guyliner. Guard your makeup bag, guys be might coming for it. Driven by the trend of male TV stars wearing cosmetics in South Korea, the men there are all about makeup at the moment. And since Asia has become the big driver of skin care trends across the globe, it could only be a matter of time before that reach extends to other beauty realms as well. In other words, average, everyday dudes in makeup might just become a global thing. The Vancouver Sun cites findings from the Euromonitor that indicate the male grooming market in Korea is now a $1 billion per year industry. That kind of spending helps support the theory that men-in-makeup is poised to be the next K-Pop trend to hit it big. Likely due to a phenomenon known as the Korean Wave—in which Korean pop culture influences global pop culture—male grooming is also on the rise in surrounding areas like  Malaysia and Taiwan. The question is will this trend of carefully manicured men wearing eyeliner, mascara, foundation, and more really reach the U.S.? It's possible. TheFaceShop, a Korean beauty store with a line dedicated to men, has recently hit several states, continuing the beauty-world penetration of all things Asian. So don't be shocked if your boyfriend, brother, and gym-spotter start asking for eyeliner tips in the not-so-distant future. More from Glamour.com: Want to know what's trending in beauty now? Check the Lipstick Index: By Alex Kessler By Misty Copeland By Daniel Rodgers By Sheryl Lee Ralph More from Glamour See More Stories © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Glamour may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "datetime": "2015-12-14T13:30:00.000Z",
    "url": "https://www.glamour.com/story/headsup-your-boyfriend-might-s"
}