{
    "title": "Korean food with a twist | South China Morning Post",
    "text": "A new wave of restaurants puts an international twist on the popular cuisine There is a reason why Moyo doesn't open until dinner time. For owner Francesco Lee Miong-hion, his restaurant, right across from the PMQ, is a place for his guests to moyo , or \"get together\" in Korean, to enjoy nice food and good time. It's not a place for the lunch crowd to gobble down their meal and dash back to the office, although that's probably a more lucrative trade. Born and raised in Italy to a family of restaurant owners, Lee wants his two-month-old shop to stand out from the rest by injecting traditional Korean dishes with a touch of Italian influence. With his co-owner and chef - two Koreans he met in Milan as students - they have created a menu of dishes that reflect both worlds of their upbringing. Think bruschetta topped with kimchi, tomato and olive oil, and a creamy tiramisu jazzed up with layers of green tea and red bean paste. The carbonara rice cake here actually deserves the name because egg yolks and real cheeses - Parmigiano Reggiano and pecorino, instead of cream - are used to finish the dish. Four of their house-made kimchis can be ordered as a starter platter, and the fifth, which is fresh and crunchy, is paired with the brown bossam dish to contrast the tender braised pork. They are yet to obtain a liquor licence, but Lee is eager to share with his guests some lesser-known tipples the Moyo team found on a recent trip to Korea. 36 Aberdeen Street, Sheung Wan, tel: 2858 2777. Open: Tuesday-Sunday 6pm-midnight  Started by Korean chef Kim Byeong-jin and girlfriend Sugar Fung Wing-lam, this two-month-old shop is fast to catch on the trend in Seoul of adding cheese to every possible dish. That explains the hour-long nightly queue of diners waiting to sample some of the most talked about dishes on the internet without the need to leave Hong Kong. The menu comprises mainly street foods, including fish cake soup, seaweed roll and fried chicken in five different flavours. However, the most popular dishes are the kimchi fried rice with scrambled egg - also known as volcano rice - and grilled back ribs, both of which are served on a hot skillet and come with a generous amount of mozzarella. The tender ribs take three days to prepare and are flavourful, thanks to a 10-ingredient marinade spiced up with gochujang (chilli paste) and pear. A waiter will grill the cheese with a fire torch on your table, before he swiftly wraps the melted cheese around each piece of meat. In the rice dish, the gooey cheese adds flavours and texture. A culinary arts graduate from the Gyeongju University and a chef of 10 years, Kim says Koreans love cheese because it lessens the discomfort spicy food brings to the stomach and, for those who can't take the heat, cuts through the intensity. Although he tries hard to stay true to authentic recipes, he did need to tone down the heat level for local tastes. 1F Kimberley Street, Tsim Sha Tsui, tel: 2386 2315. Open: 12.30pm-2.30pm, 6.30pm until sold out  This Korean-Mexican fusion joint is a dream come true for owners John Chang Hyun-kyu and Baek Ah-young. While Chang, an investment banker, wanted to be a cook when he was younger, Baek has always wanted to become an entrepreneur. Driven by their shared passion for food - the couple cook a lot at home for their two children - they started TaKorea in a basement shop on Wellington Street in January. Inspired by the food truck trend in Los Angeles, California, and using their own home recipes, the US-educated couple have whipped up a simple menu featuring three core items: baap (rice) bowls, burritos and tacos. Each comes with plenty of vegetables and a choice of topping. There are three meat choices - kalbi beef ribs with barbecue sauce, boneless fried chicken thigh and spicy pork collar with gochujang, as well as a vegetarian option of eggplant in a sweet ginger sauce. Tasty, healthy and nutritious are the attributes they insist on and most ingredients and sauces are prepared in-house. One of the dishes in which they take pride is their homemade kimchi, which follows Baek's mother's much-loved recipe. Kimchi fried rice, a main ingredient of the burrito, where it's wrapped inside a warm flour tortilla alongside sour cream and cheese; and beef- or pork-topped kimchi fries, are just two of the ways it's incorporated. Also on the menu are snacks, including K-pop fried chicken and caramelised sweet potato, Baek's childhood favourite and a quick treat to please the sweet tooth. B/F, 55 Wellington Street, Central, tel: 2362 1999. Open: Monday-Saturday 11.30am-9.30pm  With the restaurant's name translated as \"trend\" and cocktails called Gangnam Sour and Bloody Kimchi (kimchi-infused vodka), you know U-Hang is not just another typical Korean establishment. A sister restaurant of Sanche in Central, which opened in November, U-Hang continues owner Mina Cha Min-jung's attempts to steer away from the traditional. Korean-Canadian Do Yong-soo, former executive sous-chef for Liberty Exchange, is in charge of the kitchen. The 27-year-old says the restaurant leans towards American-style Korean food which is booming in the US, but offers more than that. Its \"crossover cooking\" style combines different cuisines, ingredients and techniques to create interesting dishes, but still allows the true essence of Korean cuisine to shine through. The menu changes seasonally and features a weekly special. On the brunch menu is kimchi pork eggs benedict, a sumptuous tower of braised pork belly, spinach seasoned with fish sauce, and hollandaise made with clarified butter and a drizzle of sesame oil. There are also bulgogi beef tacos, and the kimchi mayo-topped U-Hang burger. Do says he presents all the flavour profiles of a typical Korean dish in a new way. \"There's more fun to it. I just want to give it a little bit of a tweak here and there. Some of the dishes are really classy as it is,\" he adds. The chef's salad, for example, is a version of a Caesar salad in which fish sauce replaces anchovies and mustard is mixed with  (fermented soya bean paste) to create the sauce. Shop 6-6A Hang Sing Mansion, 58-60 High Street, Sai Ying Pun, tel: 2549 6788. Open: 11am-10.30pm ",
    "datetime": "2015-03-11T22:30:30+08:00",
    "url": "https://www.scmp.com/magazines/48-hours/article/1734325/korean-food-twist"
}