{
    "title": "Korean wave hits the art world: K-pop stars collaborate on major artist projects",
    "text": "The boy band BTS is claimed to add $4.65bn to the South Korean economy every year Photo: Taeseong Kim South Korea’s best-selling boyband, BTS, has launched a series of five major public art projects across the globe involving collaborations between some of the world's most significant artists and curators. Connect BTS will take place across five cities, with each project free to the public and to be \"extensively documented online\" according to a press release, which further states that each artist commission is the result of a curator who has \"resonated with BTS's philosophy\". The first project in the series, an immersive audio-visual work by the Danish artist Jakob Kudsk Steensen opens today at London's Serpentine Galleries. Organised by the Serpentine's curators Kay Watson and Ben Vickers, Catharsis (until 15 March 2020) shows a digital simulation of a re-imagined ancient forest and can be experienced at the Serpentine or via a dedicated website. Other projects in the series include Fly with Aerocene Pacha (21 January–22 March 2020) by the Argentinian artist Tomás Saraceno, which will attempt to break several world records for the first fully solar powered piloted free-flight. The work will launch in Salinas Grandes, Argentina’s great salt lake, with the resulting film of the work to be shown in Buenos Aires until 22 March. Not to be outdone, the British artist Antony Gormley will create a vast \"drawing in space\" at New York’s Brooklyn Bridge Park Pier 3. New York Clearing (2020) will consist of \"a single line made up of 18km of square aluminium tubing that loops and coils without beginning or end\". It will be on show from 4 February to 27 March. Jakob Kudsk Steensen installation at the Serpentine Galleries in London Photo: Hugo Glendinning Two further projects will also take place. The first involves two separate shows at Seoul’s Dongdaemun Design Plaza (DDP) by the British artist Ann Veronica Janssens and the Korean artist Yiyun Kang. The second is a group performance by 17 artists at Gropius Bau in Berlin. Visitors to each of the shows can access special introductory videos recorded by the band talking about the individual artworks. CONNECT, BTS has been led by Daehyung Lee, who serves as its artistic director. Lee, an independent Korean curator, organised his country's pavilion at the 2017 Venice Biennale. As the art world continues to devise new ways to appeal to broader audiences, this partnership  opens up novel, potentially lucrative avenues for cross-disciplinary collaboration. \"BTS has created a movement involving an audience of millions worldwide,\" says Lee. \"Their ability to speak meaningfully to people of different cultural backgrounds, social classes, ethnicities, genders and identities speaks in turn to modern art’s long-standing goal to transcend imagined boundaries. Picture a concert with thousands of fans moving in unison, each in their own world yet part of a collective experience. Amplified across five cities, riding the momentum of the group’s following.\" Their following is indeed significant. Regarded as the most successful boyband in the world, the popularity of BTS (a septet formed in Seoul in 2013) reportedly draws in tourism that is estimated to add $4.65bn to the South Korean economy every year, approximately 0.3% of the country's GDP. Accordingly, this project—and the artists and institutions involved—will now enjoy exposure to BTS’s 21.9 million Instagram followers and 23.6 million Twitter followers (known colloquially as the \"Army\"). For comparison, the Musée du Louvre has 3.6 million followers on Instagram, while Ai Wei Wei has a mere 563,000 and considerably less youth appeal. In a statement, BTS says \"contemporary art and music are also two different worlds. This project is especially meaningful to us because it truly represents diversity and creates a collective, positive message for the world that we value. Through this project, we hope to return the great amount of love and support from our fans, Army, and all audiences.” UPDATE: 14 January. This article was updated to say that BTS's Twitter following is 23.6 million not 18 million ",
    "datetime": "2020-01-14T13:10:39.121Z",
    "url": "https://www.theartnewspaper.com/2020/01/14/korean-wave-hits-the-art-world-k-pop-stars-collaborate-on-major-artist-projects"
}