{
    "title": "Korea builds on next wave of Hallyu",
    "text": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Best Tax Software Best Tax Software for Small Businesses Tax Refunds SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  As the Korean wave, or Hallyu, continues to sweep across  the world, lucrative foreign investments from France to China  could spark the next rush for the country's pop culture, analysts  say. Luxury goods maker LVMH is the latest company  to bet on South Korea's \"cool\" – its private  equity arm unveiled plans last week to invest up to $80  million in YG Entertainment, who manages K-Pop stars  including superstar rapper Psy. The investment is the largest by a global fund  and will help accelerate YG's move into fashion. The firm,  one of Korea's top talent agencies, aims to launch a  clothing label with Samsung Group and to enter the  cosmetic business with China's Huanya Group. Read MoreWhat do South Korea and India have  in common? YG shares have surged 25 percent since  LVMH's interest first emerged earlier this month, bringing the  firm's market capitalization to $730 million and underscoring the  power of Hallyu in corporate Korea. \"Right across the board, with consumer and cultural  products [in South Korea] there is a huge outward wave of  interest coming from the outside, which is turning into money,\"  said Tony Michell, managing director at Korea Associates Business  Consultancy. \"From an advertising point of view K-Pop stars in Southeast  Asia have become hot property, and we think it gives a kind of PR  effect to Korea, as behind that comes everything related to  Korean fashion and that goes from cosmetics and other things  positioned in the dramas or associated with Korea,\" he  added. Read MoreChoinomics - Breakthrough for South  Korea? Korea's \"cool\" factor reached fever pitch in  2012 when pop sensation Psy released the mega-hit 'Gangnam  Style,' a catchy rap song with horse dance moves that became a  worldwide hit. The video has garnered over 2 billion views  to date online, making Psy the most famous K-Pop  singer globally and raising the genre's  profile. Since then, there has been renewed interest in all other  aspects of Korean culture, spanning music, TV shows, video games,  fast food and consumer products. Some experts are tipping the start of the next  wave of Hallyu, this time driven by China. According to CLSA,  China's Tencent's decision in March to invest half a billion  dollars in CJ Games, a unit of Korean media firm CJ E&M, is a  big deal for the firm and a ringing endorsement for  K-culture. Read MoreFood and fashion:How K-drama is  influencing Asia The investment gives China's largest online-games and  social-networking company a 28 percent stake in CJ Games, one the  most successful game developers in Korea. \"Hallyu will continue to gain momentum and CJ E&M is at the  forefront of this wave,\" Seungjoo Ro, an analyst at CLSA, said  in a report this week. \"Demand is high in China and will unlock  much awaited earnings expansion for CJ's media and films.\" Strong government support CLSA says the Korean craze looks sustainable for now, thanks to  the strong support from the government, which has invested  billions in the K-Pop phenomenon, including launching a $1  billion investment fund to support the pop industry in 2005. Read MoreThis is big business in Korea (and it's  not K-pop) The country last year raked in $5 billion from its pop-culture  exports, and the government aims to double this figure by 2017.  Meanwhile, inbound tourist arrivals jumped 8.3  percent on year to a record 12.2 million visitors in  2013, statistics from the Korea Tourism Organization (KTO) show. \"Currently, the government's budget for culture/media is around  5.3 trillion won ($5.2 billion), or about 1.4 percent of  government spending. The goal is to increase this budget to 7.8  trillion won by 2017, or 2 percent of the government's budget,\"  Ro said. \"This will make Korea the second highest cultural  spender behind France,\" he added. Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2023 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis. Data also provided by ",
    "datetime": "2014-08-27T22:27:05+0000",
    "url": "https://www.cnbc.com/2014/08/27/korea-builds-on-next-wave-of-hallyu.html"
}