{
    "title": "Korean Wave hits AFM as home-grown content grabs global attention ",
    "text": " By \n\n\tPatrick Frater Asia Bureau Chief After enduring long-lasting COVID restrictions, many of the Korean executives attending the AFM this week will be making their first U.S. business trip in more than two years. In the time that they were away, the Korean entertainment scene has undergone a transformation. The changes have proved tricky for some and beneficial for others. But, whether for defensive or aggressive reasons, many Korean companies are now in the process of reshaping their businesses. They are preparing for a future in which Korean entertainment is no longer a sideshow appreciated and accepted principally within Asia. During the pandemic period, “Parasite,” BTS and “Squid Game” were carried by streaming platforms — music and video — to global audiences far more effectively than traditional media with its old-fashioned and geographically delineated gatekeepers. Fans of Korean entertainment interact directly with new TV shows, online concerts and music groups in ways that are instant and measurable. The Korean Wave has reached places as varied as the U.S. Midwest, Latin America and India — where media buyers had arguably underserved their audiences, especially screen-based younger generations unafraid of subtitles or music in foreign languages. The Korean entertainment sector that has been the least helped by the pandemic reset is the film business. As with other countries, South Korea sustained production shutdowns. But more damaging was the impact of film releasing and exhibition, which really only kicked back into high gear in May, when health restrictions were officially droppled, and is faltering again. As releases of local titles, which typically accounted for a 50% market share, were delayed or cancelled, box office slumped in both 2020 and 2021. That created lasting financial damage to large parts of the film ecosystem, especially producers, local distributors and exhibitors. Sales agents and studios were buoyed by library titles and demand from streamers seeking to build deeper and more representative Korean content offerings. Korean sales agents were the stars of October’s rights market in Busan: “I didn’t talk to sellers from anywhere else other than Korea all the time I was in Busan,” says a prominent buyer from Thailand. But their slates had far fewer genuinely new titles than in a pre-COVID year. Many titles on offer had shot in 2020 or 2021 and were in prolonged post-production, awaiting a suitable Korean release date. That phenomenon may continue through to AFM, though in-person meetings at the Loews Santa Monica will likely be with the non-Asian buyers who did not attend Busan. Korean sales agents already report full diaries. Interest in what Korean film sellers have on offer and in preparation is likely to be further juiced by the wider K-culture phenomenon. “The huge interest in K-Pop and TV drama is definitely helping sales for Korean companies,” says Danny Lee, who heads sales operations Contents Panda, the sales arm of studio Next Entertainment World. “I don’t think there are any more barriers between film, TV drama and K-pop. It’s all linked together and kinda helps our sales.” That’s because many Korean entertainment firms have changed their businesses and strategies to fit the new circumstances: diminished theatrical values; more onscreen and behind-the-camera talent with global name recognition; currently insatiable demand for TV content (scripted drama especially, but also Korean formats and unscripted shows); and richer budgets. And, seemingly, almost any project that can attach a current or former K-pop star. Korean film production companies have diversified into TV. Korean TV producers have diversified (shingle Barunson is launching a rights sales unit at AFM) or scaled up. Some, including CJ ENM, JTBC and the J Contentree-backed SLL, hugely so. Music and talent firms have moved into TV production and the technology of fandom. And Korean tech leaders Naver and Kakao have spent millions to bolster their prowess in search engines and social media with investments that develop the fast-growing webtoon and online literature sectors. Korean streamers TVing, Wavve and Coupang Play are expanding program commissioning and hatching deals that potentially give them a chance to rival the established market leader Netflix, or at least keep newcomers Apple, Amazon and HBO at bay. So, while rights sales may be the order of the day in the Loews corridors, such deals could be the tip of a dealmaking iceberg as cool South Korea positions itself for a long-term global entertainment role. A Variety and iHeartRadio Podcast The Business of Entertainment ",
    "datetime": "2022-11-02T05:08:00+00:00",
    "url": "https://variety.com/2022/film/asia/korean-wave-afm-1235420475/"
}