{
    "title": "Korean Cosmetics Concept Store in Shinjuku, Skin Garden Offers Up to 50% Discount for 'Obon Yasumi' | Business Wire",
    "text": "Skin Garden, a K-cosmetics shop located in Shinjuku, is on sale. It offers discount for its PB brand 'Skin Garden' as well as a wide range of Korean brand cosmetic products to care for sun-damaged skin until August 31 2015. (Photo: Business Wire) Skin Garden, a K-cosmetics shop located in Shinjuku, is on sale. It offers discount for its PB brand 'Skin Garden' as well as a wide range of Korean brand cosmetic products to care for sun-damaged skin until August 31 2015. (Photo: Business Wire)  TOKYO--(BUSINESS WIRE)--Skin Garden (http://www.skingarden.jp/), \n      a K-cosmetics shop located in the central area of the Korean wave \n      shopping district in Shinjuku, Tokyo, announced that it has started \n      summer sale event on August 14.  From August 14 to August 31, Skin Garden offers discount from as little \n      as 20% up to 50% for its PB brand ‘Skin Garden’ as well as a wide range \n      of Korean brand cosmetic products, such as large-sized gels, face masks \n      and body cooling products to care for sun-damaged skin. Japan enjoys a summer holiday period called ‘Obon Yasumi’ across the \n      country from August 11 to 20. Japanese go on summer vacations most \n      frequently and enjoy various holiday cultures during this period. Targeting customers that enjoyed vacation during Obon Yasumi, Skin \n      Garden offers a drastic price cut on products to care for skin damaged \n      by the hot summer sun and a selected range of related merchandizes for \n      sale. The discount event focuses on products to soothe and moisturize \n      sun-burnt or sun-damaged skin. “Skin Garden is the largest Korean cosmetics concept store in Japan \n      where customers can purchase a wide range of trendy items including \n      Korean cosmetics in a single spot,” said a Skin Garden insider. “This \n      summer sale is an opportunity for customers to buy Korean cosmetic \n      products as well as great skincare items for the hot summer season at \n      discounted prices.”  Skin GardenYoungun Park, +82 70-8768-7946park98@skingarden.jp  Skin Garden, Korean Cosmetics Concept Store in Shinjuku, offers discount for 'Obon Yasumi'. It offers discount for its PB brand 'Skin Garden' as well as various Korean brand cosmetic products. Skin GardenYoungun Park, +82 70-8768-7946park98@skingarden.jp  ",
    "datetime": null,
    "url": "https://www.businesswire.com/news/home/20150820005455/en/Korean-Cosmetics-Concept-Store-in-Shinjuku-Skin-Garden-Offers-Up-to-50-Discount-for-Obon-Yasumi"
}