{
    "title": "\r\n\tKorean wave hits iQiyi as 2021 comes to a close | ABS-CBN News\r\n",
    "text": "Home\n > \nEntertainment Posted at Sep 23 2021 01:18 PM | Updated as of Sep 24 2021 06:26 AM Share MANILA — The Korean wave has arrived on iQiyi. The China-based streaming platform recently announced it would release a number of South Korean shows and movies on its service during the last quarter of 2021. iQiyi’s Hallyu season began earlier this month with the premiere of “Yumi’s Cells,” starring Kim Go-eun (“Goblin”) and Ahn Bo-hyun (“Itaewon Class”). Adapted from a popular webtoon of the same title, “Yumi’s Cells” follows Yumi (Kim), an office worker, and the cells that drive her emotions. Yumi’s love cells fall into a coma after a breakup until she meets a game developer (Ahn). Jinyoung of the K-pop boy group GOT7 and Minho of SHINee will also have special appearances in the show. On October 23, iQiyi will drop “Jirisan,” which follows an experienced national park ranger (Jun Ji-hyun) and a rookie ranger (Ju Ji-hoon) as they uncover the secrets of the Jirisan National Park. “Jirisan” marks another project involving Jun, Ju and writer Kim Eun-hee, who all worked together in the zombie series “Kingdom.” In November, “IDOL: The Coup,” “Let Me Be Your Night,” “Royal Secret Inspector Joy” and “Melancholia” will be available on the platform. “IDOL: The Coup” features EXID’s Hani as a member of a struggling K-pop group, while “Let Me Be Your Night” follows the story of a famous idol (Lee Jun-young from “Imitation”) who suffers from sleepwalking. The period piece “Royal Secret Inspector Joy” will see Ok Taecyeon (“Vincenzo”) play a royal inspector during the Joseon dynasty. On his missions, Ok’s character teams up with an unhappy wife, played by Kim Hye-yoon (“Sky Castle”). “Melancholia,” meanwhile, features Im Soo-jung (“Chicago Typewriter”) and Lee Do-hyun (“18 Again”) as a math teacher and genius student, respectively. The series depicts scandals and corruption in a prestigious high school. “Goblin” actor Lee Dong-wook is set to star in the action series “Bad and Crazy,” which will arrive on iQiyi in December. In “Bad and Crazy,” Lee plays a corrupt police supervisor who encounters a “crazy good guy” played by Wi Ha-joon (“Squid Game.”) In the same month, iQiyi will premiere “The Man’s Voice,” which follows the romance between a convenience store worker (played by Song Ji-eun) with the ability to hear the voices of cats, and an attractive officer (played by Choi Tae-joon) who asks her to take care of his cat. iQiyi also recently added the thriller film “Midnight” to its catalogue. The movie follows a hearing-impaired girl (Jin Ki-joo) who becomes the next target of a serial killer (Wi Ha-joon) after helping one of his victims (Kim Hye-yoon). Wi also stars in the film “Shark: The Beginning” as a mixed martial arts champion who helps a bullying victim (played by Kim Minseok) who is put in a juvenile correction facility after an accident. iQiyi has yet to announce when it will release “Shark: The Beginning” but noted that it would be out before the year ends. RELATED VIDEO Share ABS-CBN, DILG ink partnership for 'BIDA' anti-drug campaign October 26, 2023 'Sea of Asia': DOJ coins new term as it pushes environmental case vs China October 26, 2023 DILG suspends BFP personnel tagged in ‘promotion for sale’ October 26, 2023 Richard Gutierrez renews contract with ABS-CBN October 26, 2023 China's youngest-ever crew of astronauts blasts off to space station October 26, 2023 © 2023 ABS-CBN Corporation. All Rights Reserved. AboutCareersPrivacyTermsContact UsAdvertise With Us ",
    "datetime": null,
    "url": "https://news.abs-cbn.com/entertainment/09/23/21/korean-wave-hits-iqiyi-as-2021-comes-to-a-close"
}