{
    "title": "Korea Tourism Organization treats Indian fans to K-Food, K-Pop, K-Drama and more - Hindustan Times",
    "text": "Subscribe Now! Get features like Looking at the rising Hallyu or Korean wave in India, the Korea Tourism Organization (KTO) has come up with a unique series of virtual Korean experiences, social media contest and special offers on Korean products for the Indian audiences. KTO has partnered with multiple brands for the event which aims to create an experience that can be enjoyed by the travellers and Korea lovers from the comfort of their homes as the Covid-19 pandemic travel restrictions continue to halt their vacation plans. The KXperience virtual event, which will run until November 15, will offer a perfect Korean escapade comprising of K-Food, K-Pop, K-Beauty, K-Drama and Korean product discount offers. \"We have noticed the increasing trend for Hallyu wave in India, especially during the pandemic, when K-Drama, K-Food and K-pop engaged many Indians. So, we thought of coming up with a series of events which could keep Indian travellers and Hallyu lovers connected with Korea, till the time travel restrictions are lifted and they are able to travel to the destination,\" Young-Geul Choi, Director, Korea Tourism Organization, New Delhi office, said in a statement. To add on to the experience, KTO is also organising K Challenge, to be hosted on a microsite platform conceptualised and executed by BookMyShow. Under the challenge, the fans can watch the KXperience videos on www.kxperience.bookmyshow.com and make their own versions and post on Facebook/ Instagram/ Twitter/ YouTube using #KXperience to win prizes. Anil Makhija, COO - Live Entertainment & Venues, BookMyShow said they are thrilled to collaborate with KTO to bring the taste of Korean culture to Indian homes. \"As the K-wave craze continues to swell in India, we are thrilled to extend this unique experience to our customers and give them an opportunity to witness renowned artists across Korea through compelling categories hosted on the microsite,\" he said. Follow more stories on Facebook and Twitter   ",
    "datetime": "2021-09-21T13:02:51+05:30",
    "url": "https://www.hindustantimes.com/lifestyle/art-culture/korea-tourism-organization-treats-indian-fans-to-k-food-k-pop-k-drama-and-more-101632208826609.html"
}