{
    "title": "Korean wave: A cultural aggression and its impact - Modern Diplomacy",
    "text": "Authors: Nodir Boboev & Yihan Zhang The Shanghai Cooperation Organization (SCO) started in 2012 as a multiple organization of its original member-states such as China, Russia, Kazakhstan, Uzbekistan, Tajikistan and Kyrgyzstan. The main goals of the SCO range from promoting good neighborly relations and mutual cooperation in spheres of economy, education, energy etc. to the maintenance of regional peace, security and stability.  During the Astana summit on June 8-9th, for the first time since its formation the Shanghai Cooperation Organization officially extended full membership to India and Pakistan. The inclusion of these two states has not only add the number of the members from six to eight states and geographical expansion of two continents (Eurasia) and three oceans (Indian, Pacific and Arctic Oceans) but also has given all of the members equally new economic opportunities. SCO includes 8 member-states, four observer-states and six dialogue-partner states, altogether with the population of 3 bl., that is, closer to half the world’s population and nearly 20% of the world’s GDP. Besides it increases number of nuclear-weapon states from two to four which bring a significant change in the balance and prestige of the organization. Obviously, the entry of India and Pakistan into the SCO certainly turns this organization into a full-fledged and powerful Eurasian League. India and Pakistan both are strategically important actors in the region. According to Asian Development Bank (ADB) in 2017-18 India’s growth rate in the next fiscal will reach 7.4 -7.6%, staying ahead of China. India is one of the regional powers with estimated population of 1.3 bl. massive economy inclusion of which creates meaningful opportunities for China as well as other regional economies. And equally Pakistan’s significance is bound to the security issues of the region in general and Afghanistan in particular. It can ease the fight with terrorist and extremist groups in Afghanistan and provide stability at the regional level. In this regard, to bring both India and Pakistan into the SCO is strategically vital for the Organization in achieving its goals in the Eurasian realm. Both China and Russia are the main drivers of the SCO. China’s role is more in the field of economy and finance rather than military-strategic power. China is the wealthy and most rapidly developing country of the SCO, capable of competing with the West in the economic sphere. Also from the perspective of demography, China is the leading member state. Russia is more of a political and military-strategic role, as the geographical position of Russia is equally important in this regard. By joining together with the huge population of India, whose economy is growing steadily, combined with the giant geopolitical and strategic power of Russia and the economic scope of China, makes the SCO one of the most influential regional blocs capable of counterbalancing any such kind of organization in the region and around the globe as well. Frankly, India’s relation with Russia relatively is good likewise China’s with Pakistan. Russia’s consistent on inclusion of India into the organization finally got approved by China with the condition of Pakistan be included too. This move has brought a sort of balance between the two strong players in the SCO. However the support of China and Russia for their respective friends should not be allowed to spill into the organization in order to avoid any further escalation or division in the organization. As for the stance of other members of the SCO on the inclusion of India and Pakistan is concerned, they have not been so explicit or differing. They have formally put force behind the decision which otherwise was initiated the two main actors of the grouping, i.e. Russia and China. In other words, these member states either are comfortable with India and Pakistan or they have kept on with their opinions of difference if there are any. The possibility of difference in the club cannot be ignored as the late Uzbek President Islam Karimov had openly shared his reservations about the possibility of India and Pakistan joining the SCO. It is true that they need to demonstrate their wisdom and tactics. The dynamics of current relations between India and Pakistan as the latest move to expand the SCO are highly vital to understand the prospective role of new SCO. There can be two-pronged explanation of recent developments involving these two nuclear powers. Firstly, India-China-Pakistan relations have their peculiar dynamics. The “Belt and Road Initiative” agenda sits at the top of this triangular relationship for now. Like other regions China is trying to expand its “B & R” project in South-Asia region but India is unwilling and at times openly opposing China’s initiative in the whole region. India has categorically raised its voice against the CPEC project similarly it overlooks China’s invitation to participate in the B & R forum summit in last May. Territorial disputes between China and India also lurk beneath the surface. For instance, the current disputes in Sikkim region in which the Indian forces stop the Chinese construction work on a road in territory claimed by China. In spite of Beijing’s demands, New Delhi has yet to withdraw its forces. The historic triangle of the strategic rivalry and friendship between China, India and Pakistan is another major factor. Even if China has tried to remain neutral in Indi—Pakistan rows, India always considers China to be its rival and friend of Pakistan. Secondly, Indo-Russia, Indo-US and Russia-Pakistan relations are likely to have major impact on India’s position in the SCO. At times when Russia’s relations with the US have reach a new low, India is increasingly cozying up to the US. India’s bonhomie with Washington might not go down well with Moscow and Beijing as the two great powers have been skeptical of the US influence in this region. On the other hand Russia and Pakistan have started to improve their relations. In fact India has shown its reservation about Russia’s military cooperation with Pakistan. Yet, Moscow for its own strategic concerns has ignored New Delhi’s uneasiness. In light of these observations, it can be argued that Pakistan might have advantage over India in the SCO in the near future. Its relations with both China and Russia are on positive note. As Pakistan has been a strategic partner of China since the early 1950s, Russia seems to be comfortable with Pakistan’s role of undermining the US presence in Afghanistan. If India’s relations with the US go to the level that Russia and China are disturbed, India’s influence in the SCO will further be undercut. However, Pakistan’s role in view of the cross-border extremism can have serious impact on its relations with other members of the SCO, for example if Pakistan—based or Pakistan—endorsed elements are linked to any episode of violence in China’s Xingjian region or Tajikistan or even India, the organizational calculus will go against Pakistan. It will be helpful for India if Pakistan gets pressurized by the SCO for its role in cross-border extremist activities. In the meantime, the SCO members might be in a better position in urging Pakistan to change its policy towards the regional proxies if the SCO could make any break- through on this count it will be a major gain for this organization. The SCO will have to focus on three major areas of cooperation. First of all, it should work for the collaboration between member states, especially India and Pakistan, in maintaining stability and security in the region. Terrorism and Afghanistan are major issues in this respect. Pakistan can play pivotal role in this regard. Secondly, India and Pakistan disputes should be effectively kept under check so that no crisis boils into an active war. The SCO will have to encourage both members to resolve bilateral disputes peacefully. Finally, the US influence which has been obvious in the form of its presence in Afghanistan and increasing relations with India will have to be managed properly. (*) Yihan Zhang, international educator Date: Authors: Ifaz Mahmud Mahi and Md. Obaidullah Hallyu! The Korean wave, often known as the K-wave, is the surge in global popularity of South Korean culture from the 1990s. It displays South Korea’s rich and vibrant popular culture, which has an impact on the global creative industries of film, theater, music, fandom, beauty, and fashion. Owing to the increase in internet and social media use, such as Facebook, YouTube, and other platforms, the wave initially began in Southeast and South Asia later expanding globally. Anyway, one percent of South Korea’s budget went for cultural organizations in 2014, and the country also raised $1 billion for popular culture. Since 2020, the Korean wave has been headed by K-pop, with standout bands such as BTS and Blackpink, followed by K-dramas. Korea’s culture started to advance in the 1980s. In 1986, Fox, Warner Brothers, Walt Disney, and other companies opened their distribution office in South Korea. However, by 1994, the local film industry’s proportion of the market had fallen. In order to expand its media industry and attract investors, the South Korean Ministry of Culture established a cultural industry bureau. Later in 2000, S. M. Entertainment’s boy band H. O. T. became the first modern K-pop act to give an international performance, with a sold-out show in Beijing, while My Sassy Girl was a box office blockbuster across East Asia in 2001. Subsequently, Hallyu 2.0, the second wave, adopting digital and social media, with a broader focus on Korean pop music, video games, and animation, started to emerge around 2007. Since Psy’s “Gangnam Style” video went viral and became the first YouTube video to surpass one billion views in 2012–2013, Korean culture products have become more and more popular. Furthermore, the story continued with the third and current generation of the Korean wave. Hallyu 3.0, which began in the mid-2010s targeting more regions. The rise and spread of K-pop groups such as BTS, Blackpink and new YouTube contents like Mukbang videos have become characteristic of Hallyu 3.0. Netflix invested a figure reaching $700 million from 2015 to 2020 in South Korea. After the COVID-19 pandemic, Korean variety shows picked up more interest among foreigners, K-dramas and Korean games. BTS, Blackpink and Psy were the most popular in K-pop category outside of South Korea during the pandemic. In 2017, Korean Netflix original movie Okja was funded by Netflix. Afterwards, in 2019 Parasite won several awards at international film festivals, for instance, by winning two Academy Awards in 2020 for Best Picture and Best International Film. According to Netflix streaming statistics for Asia in 2020, Blackpink: Light Up the Sky overtook other Netflix documentaries as the most popular in various nations. Additionally, “Alive” recently attracted a sizable fan base in the Korean film category.  According to Duolingo’s report of 2020, Korean has become the second fastest growing language on the platform and the seventh most popular language of study. Victoria and Albert Museum, further, will conduct an exhibition from September 2022 to June 2023 which will showcase the unprecedented rise of Korean wave at a global stage. Korean popular culture, meanwhile, offers a blend of western and Asian values which increases its chance of being accepted in countries that are attracted to western culture and share similar values. As a result, K-dramas and movies are the second most popular Korean cultural export in Bangladesh. Not to mention Squid Game, which has ranked first on Bangladesh’s viewership list. Korean dramas show family ties such as caring for their children, taking care of their old parents, sibling love and quality romantic love stories for the audiences to enjoy. Needless to say, these cultural values are similar to Bangladeshi cultural values which are working as a supporting element to accept Korean culture by the Bangladeshi youths. K-pop plays another vital role in hallyu in Bangladesh, undoubtedly.  Korean music themes and lyrics are designed to attract the Audience. Many of their songs are indicated to issues regarding friendship, love, determination and how to overcome the depression of any kind which is attractive to youth not just in Bangladesh but all over the world. But in recent years K-pop has become more known to Bangladeshi young generation because of the internet and social media. Consequently, there raised a lot of online business to sell K-pop idol’s t-shirt, badge, ring, bag or ornaments for girls. Even the famous band BTS will come to Bangladesh in 2022. Continuous consumption of Korean pop culture and growing interest in Korean culture seems to have a huge lingual influence on the young generation of Bangladesh. Most of the members of their fanbase use the Korean words like ‘Oppa’, ‘Kul’, ‘Chingu’ etc more or less in their everyday language. Through the influence of Korean culture, Bangladeshi youths are adopting the Korean language which is an indication of initiating cultural hybridization. Another huge impact of Korean wave in Bangladesh is the beauty and fashion follower. Korean people are very conscious about fairness. Their fashion style attracts the attention of young people. A lot of Korean beauty shops are opening in Bangladesh where many of the shops in a shopping mall or online stores are already highly demanding. Korean fashionable dresses are also becoming popular among the youths in Bangladesh and males try to follow the fashionable dressing of k-pop idols. Then comes the case with Korean food, particularly Korean style ramen. The availability of Korean ramen and ramen sauce in Bangladeshi shops is noteworthy. Whereas the average Bangladeshi adult will almost always opt for a local product, in contrast, a younger generation are more likely to pick up the packet of Korean ramen. The hybridity of Korean popular culture is appealing to the Bangladeshi consumers because they can relate to their own cultural ethos, and it also contains western culture elements. Korean wave offers a perfect mixture of both western and traditional Korean culture in their products which represents the glocalization process. In the case of Bangladesh, it can be seen that the people of Bangladesh are also becoming a part of South Korea’s glocalization process. The Bangladeshi youth are obsessed with Korean dramas, movies and songs in lieu of listening Bengali songs or watching Bengali dramas. Expert says, k-dramas demonstrate unrealistic view of human life, which may augment viewers’ expectations from others or relationships, and it can lead to the anxiety and depression. Moreover, this Korean culture can be considered as cultural aggression in Bangladesh as we are going through a cultural crisis for the last few years. After 2000s, Indian culture entered here rapidly and we saw the terrific impact of it, not to mention, child committed suicide for PAKHI dress in 2014. The fanbase of BTS or Korean culture are rising and people are following them blindly specially girls, forgetting our own culture. It’s time to rethink about the abysmal impact of k-wave, it should be controlled, and our culture must be spread, or else we will face horrific consequences in the long run. Share post: Popular Each template in our ever growing studio library can be added and moved around within any page effortlessly with one click. © 2023 moderndiplomacy.eu. All Rights Reserved. ",
    "datetime": "2022-08-27T09:00:52+00:00",
    "url": "https://moderndiplomacy.eu/2022/08/27/korean-wave-a-cultural-aggression-and-its-impact/"
}