{
    "title": "Korea's S.M. Entertainment: The Company That Created K-Pop",
    "text": "This story appears in the August 11, 2013 issue of Forbes Asia. Subscribe to Forbes Asia By Andrew Salmon For a look inside \nS.M. Entertainment\n 's K-pop marketing machine, stop by the Lotte Young Plaza department store in central Seoul this summer. For two months South Korea's top record label and music talent agency is branding the six-story building with a giant banner of its latest act, EXO, a boy band aimed at the Korean and Chinese markets. S.M. has taken over the basement with a pop-up store selling everything from bags, clothing, folders and postcards to collector's edition CDs of Girls' Generation, Super Junior and the company's other groups. Some fans buy multiple copies of the same Girls' Generation CD, which are packaged with different covers for each of the nine members.  S.M. kicked off the K-pop phenomenon in the 1990s. With its boot-camp-style training for the performers and production-line approach to the music, it perfected the model for churning out acts that storm Top 40 charts and pack concert halls across Asia and beyond. An S.M. report lays out the industrial scale of the enterprise. For spots in its groups, it receives 300,000 applicants in nine countries every year. Its training facility in Gangnam is 2,550 square meters. It collaborates with 400 songwriters worldwide and samples some 12,000 songs a year. From 2010 through last year its artists played to a total audience of 2.5 million. Its YouTube page gets 1,000 views a second. One key to its success: It was the first Korean label to market \"bands as brands,\" says Bernie Cho, an ex-\nMTV\n executive and now president of Seoul entertainment agency DFSB Kollective. The S.M. model is immensely profitable. Last year net income almost doubled, to $38 million, on an 82% jump in revenue, to $225 million. The company, which went public in 2000, now boasts a market capitalization of $660 million--much bigger than its closest rival, YG Entertainment, the label of global superstar Psy. All this puts S.M. on FORBES ASIA's version of the music charts this year--for the second year in a row it makes our list of the best 200 listed companies in the Asia-Pacific region with an annual revenue of under $1 billion. The man behind S.M. Entertainment is 61-year-old Lee Soo-Man. He was a moderately successful folk and rock singer, and later a deejay, but his real talent proved to be business. While studying computer engineering at California State University, Northridge in the early 1980s, he had a front-row seat for the music revolution launched by a new cable-TV channel, MTV, which was forcing bands to be visual as well as musical. In 1995 he started his record label and talent agency, using his initials for the name. From the start he saw S.M. as an outfit that would build acts rather than simply sign them. He stepped down from the board in 2010 but remains the largest shareholder, owning a 21.3% stake that's worth $160 million. Citing their busy schedules, Lee and the top executives declined to be interviewed for this story. The first K-pop group to roll out of the S.M. factory was the boy band H.O.T. in 1996. It popularized an upbeat, catchy style of dance music that had been coming into vogue, overtaking the folk, rock and protest songs of yore. More superstars followed: the first K-pop girl group S.E.S., BoA, TVXQ, Super Junior and Girls' Generation. The process that produces these bands is formidable. \"My day would start at 7 a.m.,\" recalls Brian Joo, 32, a Korean-American who was one-half of S.M.'s rhythm \" blues duo Fly to the Sky, now in hiatus. \"We did dance with two different choreographers, vocal training, how to speak to the camera, how to approach people.\" Any faults meant extra work: Joo, who was \"a little chubby,\" had to stay late for extra dance sessions. Like South Korea's manufacturing conglomerates, Lee realized that profits beckoned abroad. As the hallyu, or Korean Wave, of pop culture washed across Asia, S.M. jumped in, becoming the first Korean label to join with overseas players, notably Japan's Avex Group. Mark Russell, author of Pop Goes Korea , says that was key to breaking into a music market 20 times as big as South Korea's. Today S.M. maintains overseas offices in Japan, China, Hong Kong, Thailand and the U.S., and language lessons are an important part of S.M.'s training programs. Seven years ago South Korea, with its advanced broadband and mobile phone infrastructure, became the first country where digital music sales surpassed physical sales. But booming digital sales hammered pricing as online music outlets aggressively slashed prices in an effort to kill piracy. So with music-sales earnings evaporating, S.M. began deploying its artists more widely. Helped by their squeaky clean images, the K-pop singers signed on for product placements, TV appearances, roles in musicals and endorsement deals. Concert revenues and merchandizing became a bigger part of the business. The past year has been bumpy for S.M.--though not bumpy enough to offset a stellar five-year track record that puts it on our list again. The stock is down 23% in 12 months, and this year's first-quarter profits dropped 30% from the year-earlier quarter. Kim Shi-Woo, who covers S.M. for Korea Investment \" Securities, blames the weaker yen and a lack of major S.M. events in Japan--K-pop's biggest overseas market--during the period. He says more concerts and other events are planned for the rest of the year. Indeed, analysts expect net income for 2013 to rise 22% over last year, to $40.2 million, according to an average of estimates collected by \nBloomberg\n Finance. Revenue is seen increasing 11%, to $166 million. Samsung Securities sees S.M. rolling out a strong lineup of new acts, while new television and telecom services will provide new sales channels. Yet the manufactured quality of S.M.-style K-pop irks some. \"The artistic side is what is lacking right now,\" says Hahn Dae-Soo, a legendary folk and rock singer sometimes called Korea's John Lennon. Joo, who left S.M. after his five-year contract expired, agrees. \"Musically, we wanted to be seen as artists. We did not want to be teenyboppers doing bubblegum pop.\" But Joo, who this year started his own label and considers Lee Soo-Man a father figure, says: \"No other label will train you to that extent. S.M. knew exactly how to find an artist's inner talent. That's what S.M. did for me.\" While the pretty boys and girls of K-pop enjoy enormous popularity around Asia, that has not been replicated in lucrative Western markets. \"K-pop can be a niche, but I don't think it will break through in the West. They try too hard, they are too rigid,\" says Daniel Tudor, author of Korea: The Impossible Country. \"I feel that K-pop is too controlled; the big companies see music too much as a product.\" There are other complaints. \"Like the chaebols, S.M. is very secretive at the top; they don't talk much,\" says Tudor. \"Their business practices in the past have been questionable--contracts for young people who perhaps don't know what they are getting into.\" Indeed, S.M. has been hit by a number of lawsuits and defections from artists over the years. Lee himself may be refocusing. Industry observers say the mogul, who is believed to own a California vineyard, is now as fascinated by wine as by music. Of the big three labels (the third is unlisted JYP Entertainment), S.M. is considered the most formulaic, and it's unclear whether it will--or can--diversify into rock, rap and electronica. But it retains massive strengths. \"The Korean market is hungry for non-K-pop forms of music,\" says Russell. \"S.M. has a very clear niche, and if they want to go beyond that, it's tricky, but I think they'll do very well with what they have.\" While the 65-year-old Hahn may be critical of S.M.'s music, he acknowledges the company's contributions. \"I wish I'd had Lee Soo-Man when I was in my 20s and 30s!\" he says. He credits Lee with making music pay. \"Before Lee it was, Music is my life, I don't care if I'm rich or poor.' Now you can love music and be a millionaire!\"  ",
    "datetime": null,
    "url": "https://www.forbes.com/sites/forbesasia/2013/07/31/koreas-s-m-entertainment-the-company-that-created-k-pop/"
}