{
    "title": "KTO Hallyu tourism report reveals most influential Korean stars on social media in the Philippines",
    "text": "The Korea Tourism Organization (KTO) has released a comprehensive research on Hallyu, or Korean Wave, tourism market in different countries around the world including surveys of Korean culture preference. Korean Wave, which started as a Korean pop culture craze such as dramas and K-pop, has recently represented the overall Korean culture, the report said. It added that the scale and influence of the ripple effect of the Hallyu tourism market is increasing. A section in the report centers on the analysis of Hallyu singers and actors on social media, focusing on the buzz they generated like online posts and mentions, and the degree of their online influence in the last year. Data from keyword analysis were collected for one year from August 2018 to July 2019 from news media, Facebook, Instagram, Twitter, YouTube, images, forums and blogs. The social media analysis covered 22 countries and regions: Philippines, Japan, US, Canada, China, Hong Kong, Taiwan, Mongolia, Thailand, Singapore, Malaysia, Vietnam, Indonesia, India, UAE, Turkey, Kazakhstan, Germany, France, UK, Russia and Australia. In the Philippines, the overall rankings based on buzz generated and influence online showed that the top five hallyu stars are BTS, EXO, BLACKPINK, GOT7 and iKON. The report said BTS, for example, generated about 28 million buzz (posts or mentions online) and were mentioned in about 1,000 news articles in the country. Ranking sixth to 10th places are Seventeen, NCT, TWICE, Super Junior and actress Song Hye-kyo. Korean stars on the 11th to 20th places are Mamamoo, actor Song Joong-ki, SHINee, Lee Min Ho, boy band ASTRO, actor Ji Chang Wook, VIXX, Lee Jong-suk, Suzy and Gong Yoo. IU placed 21st followed by Park Shin-hye, Kim Soo-hyun, Infinite, Jun Ji-hyun, Ha Ji-won, Rain, Lee Byung-hun, Hyun Bin and Bae Yong-joon. In different regions, the lists of overall top 5 hallyu stars by amount of buzz and online influence are dominated by boy bands (BTS and EXO copped all the first two places) and BLACKPINK, the only girl group. They are: Southeast Asia (Philippines, Thailand, Singapore, Malaysia, Vietnam and Indonesia) - BTS, EXO, GOT7, BLACKPINK and NCT East Asia (Japan, China, Taiwan and Hong Kong) - BTS, EXO, GOT7, NCT and Super Junior Americas (US and Canada) - BTS, EXO, GOT7, NCT and SHINee Europe - BTS, EXO, GOT7, BLACKPINK and NCT Middle East - BTS, EXO, Super Junior, BLACKPINK and iKON ",
    "datetime": null,
    "url": "https://mb.com.ph/2020/07/22/kto-hallyu-tourism-report-reveals-most-influential-korean-stars-on-social-media-in-the-philippines/"
}