{
    "title": "L.A.'s record-breaking heat wave is about to end; Southland, rejoice - Los Angeles Times",
    "text": "The sweltering heat wave gripping Southern California is about to crash. Temperatures are expected to drop roughly 10 degrees on Thursday, giving residents across the region their first substantial break from triple-digit heat in days. That means inland areas should see temperatures in the mid-80s, and the beaches will see highs in the mid-70s, according to the National Weather Service. Temperatures are expected to fall by a few degrees more on Friday, where they’ll remain through the weekend. The respite couldn’t come at a better time. Tuesday’s intense heat helped cities to topple or tie a number of longtime high-temperature records. The oldest was in downtown Los Angeles, where the 1889 record of 103 degrees was tied, according to the National Weather Service. Records were also met in Camarillo, Santa Ana, Long Beach and at UCLA. The high of 99 recorded in Santa Barbara on Tuesday beat that city’s 1979 record by nine degrees. Even as the heat wave started to wane on Wednesday, moist air could create more thunderstorms and lightning on the order that wreaked havoc on some Inland Empire communities the day before. Any thunderstorm that does develop is likely to be slow-moving and produce heavy rain, creating the potential for flash flooding, says the National Weather Service. And as remnants of Hurricane Odile move north from Baja California, as much as 2 inches of rain could drop in Southern California’s deserts. But the development of an onshore flow should start to cool the region this afternoon, forecasters said, meaning the period of record-breaking heat will also likely come to a close. Before nightfall, many areas of Southern California will likely be three to six degrees cooler than at the same time Tuesday. Twitter: @JasonBretWells Twitter: @JosephSerna Start your day right Sign up for Essential California for news, features and recommendations from the L.A. Times and beyond in your inbox six days a week. You may occasionally receive promotional content from the Los Angeles Times. Jason Wells no longer works for the Los Angeles Times. Previously, he covered regional breaking news on the L.A. Now desk. Prior to his current assignment, he was managing news editor for Times Community News North. He’s a Central California native and graduated from San Diego State University. Follow Us Joseph Serna is the deputy editor of culture and talent at the Los Angeles Times and helps oversee its career training and recruitment efforts. California Oct. 25, 2023 California Oct. 25, 2023 California Oct. 25, 2023 California Oct. 25, 2023 California California Travel & Experiences Company Town Climate & Environment California Oct. 25, 2023 California Oct. 25, 2023 California Oct. 25, 2023 California Oct. 25, 2023 California Oct. 25, 2023 Subscribe for unlimited accessSite Map Follow Us MORE FROM THE L.A. TIMES ",
    "datetime": "2014-09-17T19:25:00",
    "url": "https://www.latimes.com/local/lanow/la-me-ln-los-angeles-heat-wave-end-20140917-story.html"
}