{
    "title": "La K-Wave avanza imparable: cómo hizo la cultura pop coreana para convertirse en la nueva sensación mundial | EPU",
    "text": " Las claves de un fenómeno que supo capitalizar las flamantes formas de consumo globales y consolidar una nueva cosmogonía. El hallyu (esta polifacética, pop e indestructible ola), en su punto cúlmine. En poco tiempo, Occidente bailará al compás de Corea del Sur: se sabe acá, allá y en todos lados. Su avanzada cultural (paulatina, silenciosa, consecuente) viene marcando el ritmo desde hace unos años. Y no se trata de un fenómeno pasajero, tampoco de un invento de periodistas, ni de youtubers, ni de generadores de opinión. Ni mucho menos de un envión canchero para sacar algún tipo de rédito. Tampoco es una moda. No y no. En su reverso, el futuro es indefectiblemente coreano. Desde hace un tiempo son punta de lanza en el desarrollo de tecnología, telecomunicaciones y automóviles, pero ahora también destacan en mercados como la música, el cine, los videojuegos, la gastronomía, el lifestyle y el beauty. Si “Gangnam Style” fue la canción que abrió la puerta a un consumo singular (¿quién no hizo el pasito de PSY?), la “BTS Week” en The Tonight Show con Jimmy Fallon fue la materialización de una idea (el corazón del show business estadounidense rendido a sus pies) y el Oscar a “Mejor película” de Parasite fue el broche de oro (por primera vez, Hollywood premió a una película de “habla no inglesa”): la k-wave viene pisando fuerte. K-WAVE, LA NUEVA SENSACIÓN COREANA Un repaso rápido dirá que el género k-pop maneja el uno por ciento de todo el PIB de Corea del Sur, que Netflix está cada vez más poblado por productos coreanos (desde k-dramas hasta El juego del calamar, de lo más visto en la historia de la plataforma), que Faker es el único jugador en la historia de los e-sports en haber ganado el Campeonato Mundial de League of Legends en tres ocasiones, que Jungkook fue el artista principal en la inauguración de Qatar 2022, que se convirtieron en el país “más innovador del mundo” (según Bloomberg, a propósito del aumento de registros de patentes, además de su desempeño en I+D y manufactura), que son un cluster importantísimo en la moda global y que representan un enorme porcentaje del mercado mundial del beauty. Y por acá, incluso, en este lado del charco, la media sanción del Día Nacional del Kimchi, el trabajo de divulgación permanente del Centro Cultural Coreano (con sus concursos, festivales, cursos, libros, talleres y más), el desarrollo de restaurantes temáticos en Capital Federal (Fa Song Song, Mr. Ho, Koi Dumplings, Bi Won, Una Canción Coreana y siguen las firmas), los karaokes del barrio de Flores y hasta la reciente aparición pública de Fabiola Yáñez, la primera dama argentina, vestida en un hanbok, un típico vestido coreano. Por allá, en Seúl, divisan que su “marca país” ya no tiene que ver estrictamente con una producción concreta (ni celulares, ni coches, ni nada de eso) sino que se mueve a paso firme sobre el desarrollo estratégico de una penetración cultural, de una producción de artefactos artísticos con sabor local y proyección for exporty de un sentimiento de confianza ungido en un cambio completo de mindset: Corea quiere, Corea puede. Y entre los mil tentáculos que se expanden de este monstruo asiático que no para de crecer, la industrialización del k-pop, un género musical que aporta a su economía unos 10 mil millones de dólares, que se yergue como uno de los bastiones de ese “trademark” y que tiene a BTS, Blackpink y EXO como sus principales mascarones de proa. Algunos motivos: la democracia de las redes sociales, la militancia activa de sus fans y el hype de los medios masivos, que primero encontraron “novedad” y después un “hit indestructible”. Corea del Sur es, esencialmente, una fábrica de estrellas. De hecho, según registros del Instituto de Investigación de Hyundai, solo BTS, corazón de la k-wave, factura anualmente unos 5.000 millones de dólares y, por caso, la cifra araña casi el 0,5% del PIB de Corea del Sur. EL FENÓMENO DESDE ADENTRO “La música ahora es ‘más rápida’, sí, pero en diez años ese ciclo puede ser más rápido aún. Es un ciclo que se repite: hace diez o veinte años salía menos música que ahora, pero lo bueno va a durar para siempre y va a seguir siendo popular”, advierte el productor Ki-joon Seo, desde adentro del negocio del k-pop. Por lo demás, Ki-joon Seo es responsable del sello Gangnam Indie Records, compuso más de 80 hits para artistas de diversos estilos y mantiene una prestigiosa carrera dentro de la composición de original soundtracks para k-dramas. A la sazón, el caso de Cherry Bullet es otro de los ejemplos exitosos dentro de la k-wave. En apenas cuatro años, este convoy de chicas ya se convirtió en una de las bandas más pujantes de la movida. “El nuestro es un trabajo en el que siempre tenemos que demostrar. Tenemos que practicar mucho para nuestros shows en vivo”, reconoce Haeyoon, líder de la banda, secreteando algún misterio dentro de la cosmogonía de los idols coreanos. El imaginario del k-pop es uno de los más coloridos, más sexis y más populares del momento. En esa misma sintonía, los jóvenes miembros de DKZ se mueven milimétricamente coreografiados. “Podemos tener el amor de muchas personas y el cariño de muchos países”, cuenta Jong Hyeong sobre el oficio de ser un popstar a tiempo completo. “Nos cuesta tener una vida privada, pero de todas maneras sentimos mucho amor”, suma Jae Chan. Ellos, entre otros miles de artistas nacidos en los últimos años, son parte de esta embajada musical y permanente que es el k-pop. CENTRO DE BELLEZA COREANA Haciendo un close-up sobre beauty, otro de sus hits, Myeong-Dong se erige como la calle más repleta de tiendas de cosméticos del mundo, pero es el modernísimo Dongdaemun Design Plaza (DDP) el que comprime el core del negocio con la presencia de aceleradoras, especialistas en brand y creativos detrás del segmento. Allí, además, se emplaza regularmente la Seoul Fashion Week, uno de los eventos más importantes de la moda a nivel internacional. “Este lugar es una oportunidad para pequeñas y medianas empresas”, cuentan desde el DDP. “Antes nos enfocábamos en el producto, ahora nos enfocamos en la experiencia”, devela Ki Jung-Gu, manager general del Seoul Business Agency (SBA), uno de los principales colaboradores del DDP y uno de los players más importantes dentro del k-beauty. “Los datos de cosméticos y fashion que tenemos van a llevarnos a lo más alto del mundo.” Sin ir más lejos, solo en Corea del Sur, el mercado de la belleza factura unos 3,5 millones de dólares mensuales. Aquí, entre las musas de piel, flota una perfección ascética. ¿El factor de su éxito? “La calidad de los productos y el contenido en expansión de la cultura coreana. Eso ayudó a darle centralidad al k-beauty”, sigue el hombre de la SBA sentado en un salón del DDP, este fuerte futurista ubicado en el petitero barrio de Dongdaemun. MÁS ALLÁ DE PARASITE En cuanto al cine, Corea del Sur está viviendo el momento más álgido de su historia. Lo que comenzó como una rareza dentro de festivales (mención aparte para el Festival Internacional de Cine de Mar del Plata y el Bafici, que siempre apostaron por contenido surcoreano) hoy se ensancha como uno de los países más prolíficos dentro de la producción audiovisual internacional. Entre esas historias, la de A Taxi Driver es una de las más elegidas en la plataforma Netflix y, a nivel mundial, lleva recaudados alrededor de 90 millones de dólares. “Para vender una película necesitamos definir regiones, distribución y categorías para maximizar la venta”, dice Ahn Jung-won, directora de negocios exteriores de Showbox, la principal productora de cine, k-dramas y webtoons de Corea del Sur. Por estos días, expandieron su negocio con el remake de productos originales: A Hard Day a Filipinas, Peace Breaker a China, The Restless a Francia, Memoirs of Murders a Japón, Your Eyes Tell a Japón. Y se vienen más: Greta (¡con dirección de Neil Jordan, el de El juego de las lágrimas!) a los Estados Unidos, The Medium a Tailandia y Moon Man a China. “En América latina, la popularidad de la k-wave ayudó a que la gente se interese en los k-dramas”, explica Ahn Jung-won. “Ahora estamos filmando dos k-dramas y desarrollando otros 40. Nuestro deseo es diversificar nuestro contenido”, cierra. Así las cosas, el hallyu (esta polifacética, pop e indestructible ola coreana) encuentra en la actualidad su punto más extraordinario. En ese sentido, artistas, marcas y Estado se entrelazan, comparten todo lo que pueden compartir y ensamblan todo lo que pueden ensamblar: son engranajes simétricos de un plan de expansión cultural, de una capitalización efectiva de las flamantes formas de consumo y de la consolidación de una nueva cosmogonía, la coreana, que en brevísimo quedará sentadita a la mesa de los grandes.   Sus obras y kimonos serán exhibidos en una reconocida galería de arte a fines de octubre y principios de noviembre. Protagonizó un acto de valentía sin precedentes en el paracaidismo mundial al realizar el primer vuelo totalmente autónomo sobre el emblemático castillo de Neuschwanstein, del cual Disney se inspiró, a 200 km/h. ",
    "datetime": "2022-12-03T12:00:00+00:00",
    "url": "https://elplanetaurbano.com/2022/12/la-k-wave-avanza-imparable-como-hizo-la-cultura-pop-coreana-para-convertirse-en-la-nueva-sensacion-mundial/"
}