{
    "title": "LG Electronics expands hallyu content on its smart TV streaming service | Yonhap News Agency",
    "text": "All Headlines North Korea Sports Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies URL is copied. SEOUL, Oct. 15 (Yonhap) -- LG Electronics Inc. said Thursday that more content on the Korean Wave of popular culture can be watched on its smart TVs via its streaming service as the company tries to attract more consumers in major markets amid the pandemic-driven stay-at-home trend. LG Channels will now have more content related with the Korean Wave, known as hallyu, after the South Korean tech firm signed a partnership with NEW ID, a digital content distributor under local entertainment powerhouse Next Entertainment World (NEW). LG Channels is LG's free content streaming service set up in 2015. People can watch various channels on the company's smart TVs connected to the internet even without a set-top box. Starting this month with Europe, LG smart TV owners can also enjoy free channels including YG TV, which offers exclusive content from YG Entertainment, home to K-pop stars like BLACKPINK and BIGBANG, according to LG. \"LG Channels offers premium digital content and multi-broadcast channels together with a diverse array of quality content choices available free-of-charge on LG Smart TVs in the U.S., Canada, Europe and Latin America,\" said Lee Sang-woo, senior vice president of content service business at LG Electronics' home entertainment unit. \"Easy to access and discover, the newly expanded content to European markets builds on LG's objective to diversify content based on evolving trends.\" This photo provided by LG Electronics Inc. shows the company's OLED TV showing the YG TV channel of its streaming service. (PHOTO NOT FOR SALE) (Yonhap)  LG, the world's second-largest TV vendor, said the number of viewers and their time spent consuming content on LG Channels have quadrupled compared to last year. In particular, the company said the number of LG Channels users soared in Europe and South America, where it started the streaming service last year. In South Korea, LG Channels shows 112 free channels. The service offers 278 channels and more than 2,000 movies in the United States, where the largest number of LG Channels users reside. kdon@yna.co.kr(END) All News National North Korea Economy/Finance Biz Culture/K-pop Sports Images Videos Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies Korea in Brief Useful Links Festival Calendar Weather Advertise with Yonhap News Agency ",
    "datetime": "2020-10-15T11:21:47+09:00",
    "url": "https://en.yna.co.kr/view/AEN20201015004300320"
}