{
    "title": "Light-hearted look at Korean-Kiwi culture - NZ Herald",
    "text": "Share this article Students Young You and Andy Song, who play siblings  in Kimchigook. Photo / \nGreg Bowker A sitcom about the cultural clash between two Korean students who come to New Zealand and their Kiwi counterparts has started filming and will be screened to millions worldwide. Producers of Kimchigook - New Zealand's first locally produced Korean drama sitcom - are hoping to ride the hallyu, or Korean Wave, to reach millions of K-drama fans. Takapuna Grammar School head boy Andy Song, 17, stars as lead character Chigook Kim, and Young You, 16, a Year 11 Tauranga Girls' College student, plays his sister, Marie. Chigook was sent by his parents to New Zealand, where his sister was studying, after failing to unleash his true potential back home. In the five-part comedy series, the siblings stay with their uncle's family in New Zealand. \"The story looks at the funny side of culture clashes between Kiwi and traditional Korean culture and practices,\" said series director, Tony Keam, a former TV news anchor at KBS, Korea's largest television station. Mr Keam said the sitcom would be a light-hearted way to introduce both cultures, and would promote New Zealand as a study and holiday destination. Filming locations will be in Auckland and Rotorua, including at popular tourist attractions such as Te Puia. Kimchigook will screen in New Zealand through two World TV channels broadcasting on Sky 300 and 301 and also in South Korea, Los Angeles, Mongolia and Canada in October. Mr Keam said the Korean-language programme would have English subtitles, and had the potential to reach more than 50 million viewers. Kimchigook • First locally produced Korean sitcom, shot in Auckland and Rotorua.• Five-part series to air on Sky and in South Korea, Los Angeles, Mongolia and Canada in October.• 50 million-plus potential viewers.• $50,000 budget.• Will have English subtitles. Share this article Let us know about inspirational Kiwis and stories in your town, city and region. ",
    "datetime": null,
    "url": "https://www.nzherald.co.nz/nz/light-hearted-look-at-korean-kiwi-culture/FA3S4AHFETIC5UDF6RSJDNPT5Q/"
}