{
    "title": "LIGO spots gravitational waves for third time | Nature",
    "text": "Thank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\n            the best experience, we recommend you use a more up to date browser (or turn off compatibility mode in\n            Internet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles\n            and JavaScript. Advertisement Nature\n\n                         (2017)Cite this article 115 Accesses 231 Altmetric Metrics details Detection made from another black-hole merger — but physicists are now keen to see such waves from different types of event. It’s starting to become routine. Gravitational waves — ripples in the fabric of space-time — have for the third time been picked up passing through Earth, as the result of a distant merger between two massive black holes. The detection, announced by researchers on 1 June, was made in January by the twin detectors of the Laser Interferometer Gravitational-Wave Observatory (LIGO) in Louisiana and Washington state. The observatory made its historic first detection of gravitational waves to global fanfare in September 2015, confirming Albert Einstein’s prediction of the phenomenon made 100 years before. A second signal came three months later, on Boxing Day. Researchers estimate that the bodies in the latest collision were slightly lighter than those in the first event: one had the mass of 31 Suns and the other 19. (The black holes in the second discovery were even more lightweight, at 14 and 8 solar masses.) But the latest merger is the most distant detected so far. The gravitational waves it produced took somewhere between 1.6 billion and 4.3 billion years to reach Earth — most probably around 2.8 billion years. The results are published in Physical Review Letters1. The latest detection brought no surprise: it is more of the same — which is still a good thing, says Bruce Allen, managing director of the Max Planck Institute for Gravitational Physics (MPIGP) in Hanover, Germany, which is part of the LIGO collaboration. “It’s very similar to the first one we saw, and that is good for our scientific credibility,” he adds. Stuart Shapiro, who works on computer simulations of gravitational waves at the University of Illinois at Urbana–Champaign, agrees. With this detection, “we truly have moved into the age of gravitational-wave astronomy”, says Shapiro, who is not involved in the experiment. The event does offer one possible novelty: it yielded some hint about the way the black holes spin around their axes, which can reveal their origins. But researchers say that, in this instance, the information is largely inconclusive. Astrophysicists are now eager for LIGO to discover gravitational waves from other types of phenomenon, beyond black-hole mergers — for example, from the merging of neutron stars. As they presented the latest results at a press conference, LIGO researchers said that they are working on the analysis of at least six other ‘candidate events’, but declined to provide details. Midnight call The detection came about a month into an observation run that began on 30 November, following a nearly year-long shutdown of the detectors for maintenance and sensitivity upgrades — although the improvements that followed the upgrades were less dramatic than the team had hoped. The first LIGO scientist to spot the event on the morning of 4 January was Alexander Nitz, a gravitational-wave astronomer at the MPIGP. At the time, the Washington detector was being recalibrated, so its data were considered potentially unreliable. Nitz was using the data flowing in from the Louisiana detector to test a data-analysis algorithm that he had written. Normally, such tests are used to assess how a detector responds to background noise from the environment; researchers expect to find true gravitational-wave signals only when looking at data from two detectors simultaneously. But one event that was picked up by Nitz’s algorithm made him do a double-take. “The moment I saw that, I think everything stopped for me,” Nitz says. The plot had the hallmarks of the accelerating sinusoidal wave that is typical of two objects in the process of merging. Nitz immediately checked the Washington data, and found the same pattern. He then sent out an alert to the rest of the collaboration. “He woke us up in the middle of the night, which is what we love to do,” says David Shoemaker, a physicist at the Massachusetts Institute of Technology in Cambridge and spokesperson for the LIGO Scientific Collaboration. Spinning results The hint of information about the black holes' spins in the latest event has prompted much discussion among the collaboration about how much insight could be gleaned from it. In a typical pair of orbiting black holes, each object spins on its own axis, just like the planets in the Solar System. The two spins may (or may not) be aligned with each other, or with the axis of the orbital motion. An alignment of spins is a strong hint that the two black holes have existed together since their birth, each being the remnant of a star in a binary, or two-star, system, which could have existed anywhere in a galaxy. Conversely, a misalignment suggests that the two objects formed independently and then began orbiting each other at a later time. Simulations by Simon Portegies Zwart2, an astrophysicist at Leiden University in the Netherlands, suggest that this is what would happen if the black holes lived inside a dense stellar cluster. The data from the latest event slightly favour this cluster scenario, says LIGO co-deputy spokesperson Laura Cadonati, a physicist at the Georgia Institute of Technology in Atlanta. “Misaligned spins is exactly what one would expect from a cluster origin of the black-hole binaries,” Portegies Zwart says. “It is, in my opinion, exciting that the spins have now been found.” Finding that typical black-hole binaries have misaligned spins would indeed provide evidence for the cluster origin of these binaries, says Daniel Holz, a LIGO member at the University of Chicago in Illinois. That “would be fantastic”, he says, “even though it means some of my previous work would be of less interest”. (Holz co-authored work last year suggesting that the cluster scenario was less likely than the binary-star origin3.) Both Holz and Allen, however, warn that the data are still consistent with aligned spins, and that it would be premature to draw any firm conclusion. “I think, until we can observe spins and mass distributions of 100 or so of these systems, we won’t be able to say where they come from,” Allen says. The good news is that the data from LIGO will keep pouring in, Shapiro adds. Its current run is expected to continue until at least late August, after which a new round of sensitivity upgrades will begin. Some time this summer, LIGO's sister observatory Virgo should come online in Italy, and a fourth interferometer is due to start operations in Japan perhaps as early as next year. “The collective detections to date point the way to what will become a booming enterprise in the coming years.” Simulation of the binary black-hole coalescence GW170104 #FFFFFF transparent 100% 356 930839825001 AQ~~,AAAAAFNl7zk~,OmXvgxJOvrFZYqSlJuZl7DkhsNbEfjvA 5456004719001 true true true Abbott, B. P. et al. Phys. Rev. Lett. 118, 221101 (2017). Article \n    ADS \n    CAS \n    \n                    Google Scholar Portegies Zwart, S. F., Baumgardt, H., Hut, P., Makino, J. & McMillan, S. L. W. Nature 428, 724–726 (2004). Article \n    ADS \n    \n                    Google Scholar Belczynski, K., Holz, D. E., Bulik, T. & O’Shaughnessy, R. Nature 534, 512–515 (2016). Article \n    ADS \n    CAS \n    \n                    Google Scholar Download references You can also search for this author in\n                        PubMed Google Scholar The black-hole collision that reshaped physics 2016-Mar-23 Gravitational waves: How LIGO forged the path to victory 2016-Feb-16 Gravitational waves: 6 cosmic questions they can tackle 2016-Feb-09 Nature Special: Gravitational waves Reprints and Permissions Castelvecchi, D. LIGO spots gravitational waves for third time.\n                    Nature  (2017). https://doi.org/10.1038/nature.2017.22093 Download citation Published: 01 June 2017 DOI: https://doi.org/10.1038/nature.2017.22093 Anyone you share the following link with will be able to read this content: Sorry, a shareable link is not currently available for this article.  Provided by the Springer Nature SharedIt content-sharing initiative Special Advertisement Nature (Nature)\n                \n\nISSN 1476-4687 (online)\n    \n\nISSN 0028-0836 (print) © 2023 Springer Nature Limited Sign up for the Nature Briefing newsletter — what matters in science, free to your inbox daily. ",
    "datetime": null,
    "url": "https://www.nature.com/articles/nature.2017.22093"
}