{
    "title": "Locked out of China, South Korea's K-pop stars head to US | CNN",
    "text": "China’s loss is America’s gain. At least that’s according to the legions of Korean pop music fans in the US, who are proving to be unlikely beneficiaries in a long-running diplomatic spat between China and South Korea. “China is South Korea’s biggest trading partner and many Chinese are big fans of Korean pop culture,” said Ellen Kong, CEO of Elf Asia, a Hong Kong promotion company specializing in K-pop. “But the impact of THAAD has been substantial,” she added, referencing China’s staunch opposition to the US backed missile shield now housed in South Korea. “It’s meant China is no longer a viable market for K-pop touring acts.” The result according to industry insiders, has been a marked upswing in K-pop acts touring in the US. “Around 8 years ago or so, it was very rare for K-pop artists to tour in the US, but now it has become quite common,” said Paul Han, co-founder of allkpop, a site for K-pop gossip and news, which has 10 million monthly readers worldwide. Bigger than Bieber? K-pop group BTS beats US stars to win Billboard Music Award “Back then, K-pop fans in the US used to say, ‘I wish I could go to Korea to attend their concert,’ but now since a lot of K-pop artists are now having concerts in New York and LA, it’s more like ‘I wish I lived closer to those cities’ or ‘I wish they would come to my city, instead of the same cities all the time’” added Han. In 2013, there were seven concert tours in the US, 14 in 2014 and 2015, then 20 in 2016. So far, there have been 14 in 2017 alone, including the recent tour announced by K-pop icon G-Dragon, from the extremely popular boy band Big Bang. And, for the first time a K-pop band has won a Billboard Music Award. BTS won the Top Social Artist Award on May 21. The seven-member band toured three cities in the U.S. in March and April and finish off their sold-out world tour in Japan this July. Q&A with SHINee: The Princes of K-pop “With groups unable to tour in China due to the fallout relating to the THAAD crisis, I believe we’re going to see another record year for groups touring across the US this year,” said CEO of Koreaboo, Flowsion Shekar, a popular content platform specializing in K-pop with a reach of over 50 million. Despite China’s foreign ministry repeatedly denying that the country has placed restrictions on South Korea, the topic was outlined as an agenda item in diplomatic talks between the two countries during a visit to Beijing on Friday and Saturday by Lee Hae-chan, South Korea’s special envoy. “The relationship between South Korea and China is quite strained,” said Lee on Thursday before his departure. “I believe the discussion will be focused to resolve economic, Korean wave, tourism interactions.” Korean wave is a phrase commonly used to describe popular Korean culture and music. Not that North American K-pop fans are complaining. North Carolina teenager Kylie Grant is just one of thousands of fans for whom the arrival of mainstream K-pop acts couldn’t have come sooner. Why South Korean companies, entertainers are getting cold shoulder in China “It was a once in a life-time opportunity I knew I would regret if I didn’t take,” said Grant, 19, who recently purchased tickets to K-pop boy band SHINee in Dallas. “My friends and family thought it was crazy at first, but after some convincing they all said it was kind of amazing that I would fly across the country just to see a concert.” The tour was SHINee’s first in North America, taking in Dallas, Los Angeles and Canada. At the weekend, the K-pop powerhouse performed in Hong Kong, and on June 11 in Taipei. “‘The thought of going to see our fans that have been supporting us from so far away made my heart flutter a bit,” said band member Lee Tae-min, 23, known as “Taemin.” In Dallas and Los Angeles, Lee and the rest of SHINee band members spoke English between the songs, sharing how much they appreciated fans learning Korean and their own love for American food, like In-N-Out burgers. Unlike the now typical mercurial K-pop bands, SHINee has been around for almost a decade, constantly evolving their look and sound. Fans, known as “Shawols,” are drawn to SHINee for their dance choreography, along with their unique mix of R&B, electronica, rap and rock. In the last year, several K-pop bands disbanded for various reasons, including scandal. But, one of the reasons for SHINee’s longevity, said Shekar, is the group’s “zero controversy … Every member has held a pristine reputation and have earned themselves an incredible reputation with Korean and international fans.” Los Angeles-based production company SubKulture Entertainment was able to almost sell out SHINee’s US concerts by targeting fans online, like Grant who discovered SHINee through YouTube. K-pop's growing pains: Why Asia's biggest bands are splitting up “Our customer base, like most millennials are very Internet savvy and acquire most of their information about K-pop via social media (Twitter, Facebook, Instagram, Snapchat, etc.), which is where we like to focus the majority of our marketing efforts,” said Subkulture Entertainment CEO Derek Lee. But now in their 20s, SHINee members are growing out of their “boy band” and “Princes of K-pop” monikers. They are also near the age of military enlistment for South Korean males, a destiny that threatens to tear other bands like Big Bang apart. And while SHINee declined to talk about the military, they do plan to perform in the US again sometime soon. “We hope that through our tour, K-pop and K-pop concerts will continue to leave a mark on a market as big as the US,” said Taemin. © 2023 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network. ",
    "datetime": "2017-05-22T01:15:35Z",
    "url": "https://www.cnn.com/2017/05/21/asia/shinee-kpop-bands-touring-us/index.html"
}