{
    "title": "Longitudinal spin separation of light and its performance in three-dimensionally controllable spin-dependent focal shift | Scientific Reports",
    "text": "Thank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\n            the best experience, we recommend you use a more up to date browser (or turn off compatibility mode in\n            Internet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles\n            and JavaScript. Advertisement Scientific Reports\nvolume 6, Article number: 20774 (2016)\n            Cite this article 1814 Accesses 34 Citations Metrics details Spin Hall effect of light, which is normally explored as a transverse spin-dependent separation of a light beam, has attracted enormous research interests. However, it seems there is no indication for the existence of the longitudinal spin separation of light. In this paper, we propose and experimentally realize the spin separation along the propagation direction by modulating the Pancharatnam-Berry (PB) phase. Due to the spin-dependent divergence and convergence determined by the PB phase, a focused Gaussian beam could split into two opposite spin states and focuses at different distances, representing the longitudinal spin separation. By combining this longitudinal spin separation with the transverse one, we experimentally achieve the controllable spin-dependent focal shift in three dimensional space. This work provides new insight on steering the spin photons and is expected to explore novel applications of optical trapping, manipulating and micromachining with higher degree of freedom. Spin Hall effect of light (SHEL), a typical manifestation of photonic spin-orbit interaction, has aroused researchers’ enormous interest after its theoretical prediction1 and first experimental observation2. As an analogy to spin Hall effect of electronic system, SHEL has potentials to reveal novel optical applications. It has been demonstrated that a light beam presents transverse separation of the opposite photonic spin states (circular polarizations) during its propagation, when the spin and orbital angular momenta (SAM and OAM) are mutually coupled. To trigger SHEL, a variety of methods and devices have been proposed for inducing spin-orbit coupling of a light beam, such as, refracting and reflecting at the interfaces of media2,3,4 or metamaterial5,6,7, propagating along a coiled trajectory in glass cylinder8, tilted reference frame with respect to the propagation direction9,10, symmetry-breaking vector beam11,12,13 and photonic graphene14, etc. Traditionally, the reported SHEL can be divided into two categories according its physical mechanism: one arising from the so called Imbert-Fedorov (IF) effect15,16,17, which describes the spin-dependent shift of light reflected or refracted at the media surface; the other one from the purely geometric nature of tilted reference frame, named geometric spin Hall effect of light9,10. Recently, it was reported that the Pancharatnam-Berry (PB) phase can also be employed to realize the enhanced spin separation of light18,19, which could be observed directly without using weak measurement technology2. However, all the reported SHEL merely demonstrated the transverse separation of spin states as far as we know. And it seems there is no indication for the existence of the longitudinal SHEL, i.e. the spin separation along the propagation direction of light. In this paper, we experimentally realize the longitudinal spin separation of light by modulating the PB phase. After passing through a polarization-transporting system, a focused Gaussian beam splits into two beams with opposite spin states and focuses at different distances, representing the longitudinal spin-dependent focal shift. Combining this longitudinal spin separation with the transverse one, we experimentally achieve the controllable spin-dependent focal shift in three dimensional space. Let us first briefly analyze the geometric phase produced by the variation of polarizations, i.e. PB phase. It was point out that when a light beam undergoes a polarization transformation along a close cycle on the Poincaré sphere, it acquires an additional geometric phase, named PB phase20,21,22. The PB phase is related to the solid angle subtended by the corresponding geodesic triangle on the Poincaré sphere. A simple example should make the PB phase easier to understand. For a light beam with polarization state A, assuming it is linearly polarized along x axis, its polarization state eA (the unit vector of polarization state A) is described by eA = ex, where ex denotes the unit vector along the x axis. Generally, this light beam can be considered as a composition of two spin states L and R, corresponding to the left-handed (LH) and right-handed (RH) circular polarizations, respectively. Namely, , where eL and eR respectively denote the unit vectors of LH and RH polarizations, meeting  and , where ey denotes the unit vector along the y axis. After passing through an optical system (e.g. wave plate, or polaroid), as shown in Fig. 1, the polarization state of the light beam is changed into B. If B is another linear polarization state and its polarization direction along angle θ, it meets eB = cos θex + sin θey, where eB is the unit vector of polarization state B. This light beam could be also decomposed in two spin states L and R, i.e. . Obviously, after polarization transformation from A to B, the LH and RH components are appended phase −θ and θ, respectively, which can be considered as the PB phase. Schematic of spin separation and Pancharatnam-Berry (PB) arising from polarization transformation. A focused Gaussian beam with linear polarization A passes through an inhomogeneous optical system, changes its polarization state to B and then splits into a pair of spin states attached with additional different PB phase ΦL and ΦR. By properly selecting the PB phases, the two spin states would focus at different location. Insert: Schematic illustration of polarization transformation in the Poincaré spheres. In the whole process of the polarization transformation, for the RH polarization state, it can be considered to experience a cyclic polarization change (see the red arrows in the left-bottom of Fig. 1): from R to A by directly projecting, then transporting to B and finally projecting back to R. The PB phase is equal to minus half the solid angle Ω subtended by the geodesic triangle R → A → B → R. The sign of Ω depends on the order of polarization transformation20. In this case, the PB phase is equal to θ. Similarly for the LH polarization state, it experiences the polarization changes as L → A → B → L (see the blue arrows in the left-bottom of Fig. 1) and obtains a PB phase −θ. In a general case, for arbitrary polarization states A and B, the PB phase can also be generated by the polarization transformation. Supposing the polarization transformation between A and B is achieved through an inhomogeneous wave plate or subwavelength grating19,23, B becomes a space-variant polarization state, e.g. eB(x, y) = cos θ(x, y)ex + sin θ(x, y)ey. Accordingly, the PB phase gets a space-variant distribution, which can modulate the wave front and tune the propagation of light. It is therefore convenient to control the propagations of the two spin states by designing the space-variant PB phases. To consist with our experimental condition, a light beam linearly polarized along the angle of θ0 (i.e. eA = cos θ0ex + sin θ0ey), which represents the most common laser beam, is selected as the input beam. And then the input vector field can be described by EA = E0eA, where E0 is the complex amplitude distribution. The LH and RH components of this linear polarized beam have the initial phase −θ0 and θ0, respectively. Namely. . We denote the PB phases acquired by LH and RH states as ΦL(x, y) and ΦR(x, y), respectively. For simplicity, we neglect the loss during polarization transformation and the light beam after varying its polarization state could be expressed as Equation (1) indicates that the optical system converts the input beam EA to the linearly polarized EB with the polarization direction along an angle (ΦR − ΦL)/2 + θ0, appending an additional phase retardation (ΦR + ΦL)/2. Meanwhile, the intensity profile of the light beam is not changed during this conversion. There are many methods to change polarization state from A to B, such as via inhomogeneous wave plate or subwavelength grating19,23 and even optical systems18,24,25. It has to be emphasized that the phase term (ΦR + ΦL)/2 is mainly originated from the phase retardation of optical elements during the polarization variation. In general optical systems, this phase term is a constant and hard to control. For convenient, we set that (ΦR + ΦL)/2 = 0 and make ΦL = −ΦR = Φ(x, y) + θ0. Then the polarization transformation process could be simplified as where EB = E0(cos Φex − sin Φey) denotes a space-variant linear polarization with its local polarization direction along the azimuth angle −Φ. Equation (2) indicates that the input beam EA is converted to EB and decomposed into two spin components with different PB phases Φ(x, y) and −Φ(x, y). To separate these two spin components, Φ(x, y) need to be selected as a special distribution. One of the most typical selection of PB phase is the phase factor of a tilted plane wave, e.g. Φ = kx x, as reported in ref. 19. With the modulation of the PB phase, the two spin components obtain two mutually conjugate tilted phases (i.e.  and ) and would separate transversely with each other during propagating. This type of transverse separation is considered as a giant SHEL which can be conveniently controlled by the PB phase. Another typical selection of Φ is the phase factor of a spherical wave, i.e. Φ = αr2, where r denotes the radial coordinate and α is a nonzero constant. In this case, the two output spin states would carry phase factors of converging and diverging spherical waves , respectively. If α > 0, the LH and RH polarization states are divergent and convergent, respectively. Whereas if α < 0 they go the opposite. To experimentally realize the spatially inhomogeneous polarization transformation, a Sagnac interferometer24,25 is employed. A linearly polarized Gaussian beam (from Ar+ laser, with wavelength of λ = 514.5 nm) with a waist diameter about 300 μm is input to the interferometer, with its intensity distribution shown in Fig. 2(a). To ensure the interferometer only changes the polarization of the input beam without the variation of intensity profile, a pair of imaging lens are set at the input and output places with the conjugate imaging distances. In the interferometer, a spatial light modulator (SLM) is used to control the PB phase during the polarization transformation. Here, we design a PB phase with α = 1.65 × 108 m−2 and the polarization directions of the output beam (EB) are depicted as the red arrowheads in Fig. 2(a), representing clear radial-variant polarization. Considering EB is space-variant linearly polarized, we use an analyzer to determine the polarization distribution, as shown in Fig. 2(b), where the top and bottom display to some extent the intensity distribution of  and  for horizontally (ex) and vertically (ey) polarized components, respectively. Spin-dependent divergence and convergence. (a) Input beam with polarization direction marked with red arrowheads. (b) Horizontally and vertically polarized components of EB. (c) Output beam (top) and the corresponding distribution of Stokes parameter s3 (bottom). (d) Side view of experimentally recorded beam propagation. Subsequently, the LH and RH components would obtain diverging and converging phase factors, representing defocusing and focusing propagations, respectively. To monitor the propagating process of light, the output field is recorded by a CCD camera, which is moved to different locations step by step. Figure 2(d) shows the experimental result of the side view of beam propagation within 70 mm in the x-z plane. After polarization transformation, the Gaussian beam experiences focusing with the minimum beam spot at z = 35 mm. To confirm the polarization of the output beam, the Stokes parameter s3 is measured by introducing a λ/4 plate and an analyzer26. The measured result at the propagation distance z = 35 mm is shown in the bottom of Fig. 2(c), where the blue (s3 = −1) and red (s3 = 1) regions represent LH and RH polarizations, respectively. It is clearly seen that the focusing spot is RH polarized, in accordance with the expectation. This phenomenon represents another type of spin-dependent separation similar as our previous work25: one spin state is weakened while the other one is enhanced and manifests itself. It is important to note that the total integrated intensity for each spin state is not changed during propagation and the total spin angular momentum is still conserved in any propagation plane. However, the spin-dependent divergence and convergence lead to the huge unbalance of the energy density between the two spin states. Namely, there still exists weak (divergent) LH polarized field superimposed with the focused RH component. As a result, the Stokes parameter s3 in Fig. 2(c) is not exactly equal to 1 for the focused beam. However, the divergent LH state is too weak (several orders of magnitude weaker than that of RH state) to influence the focused RH state. Actually, higher value of |α| could result in more convergent RH component and more divergent LH component. And then, the value of s3 of output beam is much closer to 1, namely, a more pure RH state would be formed. Likewise, if it is expected to focus the LH spin state, the constant α should be set as a negative value. And more importantly, the focusing distance f can be changed with the value of |α| according to where k is the wave vector and w is the initial beam radius. As a matter of fact, the radial-variant polarization in Fig. 2 can play a greater role in the longitudinal separation of spin states. Here, we set E0 as a focused Gaussian profile [with the phase factor , α0 > 0]. After the similar PB phase modulation as demonstrated in Fig. 2, the focused Gaussian beam would split into a pair of spin states associated with additional divergent and convergent phase factor , respectively. According to the analysis in the above section, the convergent phase factor will speed up the focusing process of the Gaussian beam, while the divergent one will make it slow down. Therefore, the two spin states [with the phase factors  and  will separately focus at different distances. The performance of this spin-dependent focal shift would resemble a novel “longitudinal SHEL”, namely, the longitudinal spin separation. Figure 3 depicts the experimental verification of the longitudinal spin separation. The input Gaussian beam has a diameter about 360 μm and the convergent phase factor is realized by a lens with focal length of 38 mm (the calculated α0 is 1.55 × 108 m−2), as shown in Fig. 3(a). In the Sagnac interferometer, we design a phase factor of spherical wave with α = 0.75 × 108 m−2 on the SLM. Subsequently, the LH and RH components of the beam after the Sagnac interferometer would attach the phase factors of spherical wave  and , respectively, where α1 = 0.8 × 108 m−2 and α2 = 2.3 × 108 m−2. According to Eq.(3), these two spin components would be focused at z = 66.4 mm and 26.1 mm, respectively. The measurement result of the propagation process of the output beam is depicted in Fig. 3(b). It is evident that the Gaussian beam splits longitudinally into two focusing spots at different distances (about 25 mm and 65 mm, respectively) which are nicely in accord with the calculations. To confirm the polarization states of the double-focusing beam, the Stokes parameters s3 at z = 25 mm and 65 mm are measured, as displayed in the right of Fig. 3(c,d), respectively. It is shown that the two focusing spots at z = 25 mm and 65 mm are RH and LH polarized, respectively, which indicates the realization of a longitudinal spin separation. Longitudinal separation of spin states. (a,b) Side view of the propagations of a focused linearly polarized Gaussian beam before and after polarization transformation. (c,d) Output beam (left) and the corresponding s3 distribution (right) at z = 25 mm and 65 mm. Note that, the separation distance is mainly determined by the parameter α. However, to realize the longitudinal spin separation, the divergent phase factor arising from the PB phase can not offset the convergence of the input focused Gaussian beam. Namely, it must satisfy α < α0. Otherwise, the second focusing in Fig. 3(b) will be never formed and the corresponding spin state will be drowned out by the light field. For a fixed focused Gaussian beam, the controllability of the spin separation can be realized by changing the parameter α of the PB phase. Here, we define the spin separation Δf = f(α0 − α) − f(α0 + α) as the distance between the focusing spots (at the locations of the maximum intensities) of LH and RH components [as shown in Fig. 4(a)], where the negative value means that the RH polarized focusing spot is farther than the LH one. Figure 4(b) depicts the curve of spin separation versus α. It can be seen that when |α| is smaller than a critical value αc (determined by the beam size and the initial convergent phase factor), Δf increases with α monotonously. Once α exceeds this critical value, the waist position of the Gaussian beam with phase factor  would rapidly move back to z = 0 plane as α increasing. As a result, the separation is sharply reduced. When α is a small value [e.g. point A in Fig. 4(b)], the separation is too small to be distinguished as shown in Fig. 4(c) and make it difficult to determine the locations of the two focal points. However, it might provide a novel technology to extend the focal depth of an image system27. While if α is set as a large value [e.g. point B in Fig. 4(b)], the second focusing spot is too wide and weak [see Fig. 4(d)] to manifest itself. Therefore, to realized a visible longitudinal spin separation, the parameter α need to be selected in an appropriate range (generally, α/α0 is around 0.5). Properties of longitudinal separation of spin states. (a) Calculated s3 at x–z plane. (b) Curve of Δf vs. α/α0 for the experimental parameters. (c,d) Intensity (top) and s3 distributions (bottom) at x–z plane of points A and B in (b), respectively. Inserts in (b): transformed polarization distributions corresponding to points A and B. The polarization of the modulated Gaussian beam also presents a propagation-varied polarization, as shown in Fig. 4(a). For example, the polarization is changed from RH polarization (at the first focal plane) to linear one (at the distance that the two components have the same intensity profile) and then to LH one (at the second focal plane), similar to the polarization distribution of transverse SHEL. Due to the focusing effect, the two spin states can manifest themselves at different distances. Considering that the PB phase can be selected as any expected phase, we can conveniently control the propagation of output beam. The transverse and longitudinal separations of spin states can be achieved simultaneously by employing the portfolio of the phase factors of plane and spherical waves. At this point, we can realize the separation of spin states with three degrees of freedom (along x, y and z axes, respectively). For a focused Gaussian beam, if setting the PB phase as we can control the spin-dependent separation along x, y and z axes arbitrarily by appropriately setting the three parameters kx, ky and α, respectively. And the sign of the above three parameters could reverse the shift directions of the LH and RH components. It can be concluded that the LH and RH components are focused at the coordinates (xL, yL, zL) and (xR, yR, zR), respectively, where , xL,R = kxzL,R/k and yL,R = kyzL,R/k. To experimentally verify the three dimensional spin separation, we set kx = ky = 5.0 × 104 m−1 and α = 0.75 × 108 m−2 and the input beam is chosen as the focused Gaussian beam used in Fig. 3. After polarization transformation, the horizontally and vertically polarized components of EB are shown in Fig. 5(a). By observing the propagation process, we can find the beam is focused at z = 25 mm and 65 mm. According to the corresponding s3 depicted in Fig. 5(b), we obtain that the two focusing spots are RH and LH polarized, respectively. It also can be obviously seen the two spin states leave the initial beam centre [marked by white crosses as shown in Fig. 5(b)] along opposite directions, performing the transvers shift both along x and y axes. To depict the propagation process, an axis, denoted as x′ axis, is built with the orientation from the coordinate (x1, y1) of the first focusing spot to the coordinate (x2, y2) of the second one. It is measured that x1 = y1 = −0.1 mm and x2 = y2 = 0.25 mm. The propagation process in view of x′–z plane is shown in Fig. 5(c)], which evidently shows that two focusing spots respectively appear at z = 25 mm and 65 mm, with opposite transverse shifts along x′ axis. Spin-dependent separation in three dimensional space. (a) Horizontally and vertically polarized components of EB. (b) Distributions of s3 at z = 25 mm and 65 mm. (c) Side view of the propagation in x′–z plane. The above assumption that the input beam is a focused one is a much common setting in the actual situation: passing through a lens. And it has to be emphasized that the longitudinal spin separation of light occurs whether the polarization transformation happens after or before this lens, because the spin-dependent divergence and convergence can work in the both cases. Generally, we can firstly transform the polarization of a beam and then focus it via a lens. For the PB phase described by Eq. 4, it provides the general idea to simultaneously focus two spin states to spots at customizable longitudinal and transverse locations. Actually, the similar polarization-dependent focal shift has been reported with different methods27,28 and the potential applications are also valid for the scheme proposed in this paper. For example for the optical trapping of three-dimensional structures29, we can focus one vortex beam with an object lens into two different spatial locations in three-dimensional space to drive and rotate different micro-objects. It needs to be emphasized that the longitudinal spin separation is actually an overall effect of the inhomogeneous transverse SHEL. As depicted in Fig. 4(a), the secondary wave of an arbitrary point at the output plane z = 0 (e.g. point R1, or R2) would transversely split into a pair of spin states, where the photons with LH and RH polarizations travel in the directions of the first and second focal points, respectively. As a result, the photon energy of LH and RH components are gathered in the two focal points, respectively and exhibit the longitudinal spin separation. Importantly, the inhomogeneous transverse spin separation is induced by the nonuniform gradient of the PB phase, i.e. the phase gradient is not a constant. It is naturally to deduce that a PB phase with nonuniform gradient, rather than the phase factor of a spherical wave, can also lead to the some level of convergence of spin states at different spatial locations and represents the spin separation in three dimensional space. This inhomogeneous spin-separation effect is very similar to the polarization-dependent shift of a light beam of finite transverse extent30. It is considered that the spatial or angular shift for a reflecting Gaussian beam is the weighted sum of the subtle shifts of different plane wave components, which are also inhomogeneous and give rise to the deflection of the reflection. Nevertheless, in our scheme, we provide more flexibility and controllability for the inhomogeneous spin separation (angular shift) by employing the PB phase. The second thing to be emphasized is that the separation scales of the spin states demonstrated in this paper is far greater than that of the traditional SHEL and can be considered as a macro effect of light. During the spin-dependent focal shift in longitudinal direction or in three-dimensional space, the variation of the spin direction of light might give rise to SHEL, however, of which the magnitude was too tiny to stand out from the macro effect. Thus for the spin separation along the longitudinal axis, the measurement is done at the millimeter scale accuracy, which is comparable to the focal depth. In conclusion, we experimentally realize the longitudinal spin separation by modulating the PB phase. A beam with linear polarization changes its polarization into a space-variant one and splits into two spin states with space-variant PB phase. The separation of the pair of spin states can be achieved and controlled by modulating the PB phase. Due to the spin-dependent divergence and convergence caused by setting the PB phase as a phase factor of a spherical wave, the focused Gaussian beam splits into two opposite spin states and focuses at different distances, representing longitudinal spin separation. The performance of the longitude spin-dependent focal shift represents a novel manifestation of the spin-dependent separation and adds an extra freedom for spin splitting. By combining this longitudinal spin separation with the transverse one, we experimentally achieve the controllable spin-dependent separation in three dimensional space. This work provides new insight on steering the spin photons and is expected to be explored novel applications on optical trapping and micromachining with higher degree of freedom. How to cite this article: Liu, S. et al. Longitudinal spin separation of light and its performance in three-dimensionally controllable spin-dependent focal shift. Sci. Rep. 6, 20774; doi: 10.1038/srep20774 (2016). Onoda, M., Murakami, S. & Nagaosa, N. Hall Effect of Light. Phys. Rev. Lett. 93, 083901 (2004). Article \n    ADS \n    PubMed \n    \n                    Google Scholar Hosten, O. & Kwiat, P. Observation of the Spin Hall Effect of Light via Weak Measurements. Science 319, 787–790 (2008). Article \n    ADS \n    CAS \n    \n                    Google Scholar Bliokh, K. Y. & Bliokh, Y. P. Conservation of Angular Momentum, Transverse Shift and Spin Hall Effect in Reflection and Refraction of an Electromagnetic Wave Packet. Phys. Rev. Lett. 96, 073903 (2006). Article \n    ADS \n    PubMed \n    \n                    Google Scholar Qin, Y., Li, Y., He, H. & Gong, Q. Measurement of spin Hall effect of reflected light. Opt. Lett. 34, 2551–2553 (2009). Article \n    ADS \n    PubMed \n    \n                    Google Scholar Wang, H. & Zhang, X. Unusual spin Hall effect of a light beam in chiral metamaterials. Phys. Rev. A 83, 053820 (2011). Article \n    ADS \n    \n                    Google Scholar Luo, H., Wen, S., Shu, W., Tang, Z., Zou, Y. & Fan, D. Spin Hall effect of a light beam in left-handed materials. Phys. Rev. A 80, 043810 (2009). Article \n    ADS \n    \n                    Google Scholar Yin, X., Ye, Z., Rho, J., Wang, Y. & Zhang, X. Photonic spin Hall effect at metasurfaces. Science 339, 1405–1407 (2013). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Bliokh, K. Y., Niv, A., Kleiner, V. & Hasman, E. Geometrodynamics of spinning light. Nat. Photonics 2, 748–753 (2008). Article \n    ADS \n    CAS \n    \n                    Google Scholar Aiello, A., Lindlein, N., Marquardt, C. & Leuchs, G. Transverse angular momentum and geometric spin Hall effect of light. Phys. Rev. Lett. 103, 100401 (2009). Article \n    ADS \n    PubMed \n    \n                    Google Scholar Korger, J., Aiello, A., Chille, V., Banzer, P., Wittmann, C., Lindlein, N., Marquardt, C. & Leuchs, G. Observation of the geometric spin Hall effect of light. Phys. Rev. Lett. 112, 113902 (2014). Article \n    ADS \n    PubMed \n    \n                    Google Scholar Ling, X., Yi, X., Zhou, X., Liu, Y., Shu, W., Luo, H. & Wen, S. Realization of tunable spin-dependent splitting in intrinsic photonic spin Hall effect. Appl. Phys. Lett. 105, 151101 (2014). Article \n    ADS \n    \n                    Google Scholar Liu, Y., Ling, X., Yi, X., Zhou, X., Chen, S., Ke, Y., Luo, H. & Wen, S. Photonic spin Hall effect in dielectric metasurfaces with rotational symmetry breaking. Opt. Lett. 40, 756–759 (2015). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Zhang, Y., Li, P., Liu, S. & Zhao, J. Unveiling the photonic spin Hall effect of freely propagating fan-shaped cylindrical vector vortex beams. Opt. Lett. 40, 4444–4447 (2015). Article \n    ADS \n    PubMed \n    \n                    Google Scholar Nalitov, A., Malpuech, G., Terças, H. & Solnyshkov, D. Spin-Orbit Coupling and the Optical Spin Hall Effect in Photonic Graphene. Phys. Rev. Lett. 114, 026803 (2015). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Fedorov, F. I. Theory of total reflection. Dokl. Akad. Nauk SSR 105, 465 (1955). MathSciNet \n    \n                    Google Scholar Imbert, C. Calculation and experimental proof of the transverse shift induced by total internal reflection of a circularly polarized light beam. Phys. Rev. D 5, 787 (1972). Article \n    ADS \n    \n                    Google Scholar Bliokh, K. Y., Shadrivov, I. V. & Kivshar, Y. S. Goos-Hänchen and Imbert-Fedorov shifts of polarized vortex beams. Opt. Lett. 34, 389–391 (2009). Article \n    ADS \n    PubMed \n    \n                    Google Scholar Ling, X., Zhou, X., Shu, W., Luo, H. & Wen, S. Realization of tunable photonic spin Hall effect by tailoring the Pancharatnam-Berry phase. Sci. Rep. 4, 5557 (2014). Article \n    ADS \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Ling, X., Zhou, X., Yi, X., Shu, W., Liu, Y., Chen, S., Luo, H., Wen, S. & Fan, D. Giant photonic spin Hall effect in momentum space in a structured metamaterial with spatially varying birefringence. Light Sci. App. 4, e290 (2015). Article \n    ADS \n    \n                    Google Scholar Pancharatnam, S. Generalized theory of interference and its applications. Proc. Indian Acad. Sci. A 44, 247 (1956). Article \n    MathSciNet \n    \n                    Google Scholar Berry, M. V. The adiabatic phase and Pancharatnam’s phase for polarized light. J. Mod. Opt. 34, 1401–1407 (1987). Article \n    ADS \n    MathSciNet \n    \n                    Google Scholar Bhandari, R. & Samuel, J. Observation of topological phase by use of a laser interferometer. Phys. Rev. Lett. 60, 1211 (1988). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Niv, A., Biener, G., Kleiner, V. & Hasman, E. Manipulation of the Pancharatnam phase in vectorial vortices. Opt. Express 14, 4208–4220 (2006). Article \n    ADS \n    PubMed \n    \n                    Google Scholar Liu, S., Li, P., Peng, T. & Zhao, J. Generation of arbitrary spatially variant polarization beams with a trapezoid Sagnac interferometer. Opt. Express 20, 21715–21721 (2012). Article \n    ADS \n    PubMed \n    \n                    Google Scholar Liu, S., Wang, M., Li, P., Zhang, P. & Zhao, J. Abrupt polarization transition of vector autofocusing Airy beams. Opt. Lett. 38, 2416–2418 (2013). Article \n    ADS \n    PubMed \n    \n                    Google Scholar Soskin, M. S., Denisenko, V. & Freund, I. Optical polarization singularities and elliptic stationary points. Opt. Lett. 28, 1475–1477 (2003). Article \n    ADS \n    PubMed \n    \n                    Google Scholar Liu, X., Cai, X., Chang, S. & Grover, C. Cemented doublet lens with an extended focal depth. Opt. Express 13, 552–557 (2005). Article \n    ADS \n    PubMed \n    \n                    Google Scholar Schmid, D., Huang, T., Hazrat, S., Dirks, R., Hosten, O., Quint, S., Thian, D. & Kwiat, P. Adjustable and robust methods for polarization-dependent focusing. Opt. Express 21, 15538–15552 (2013). Article \n    ADS \n    PubMed \n    \n                    Google Scholar Lee, S. & Grier, D. Holographic microscopy of holographically trapped three-dimensional structures. Opt. Express 15, 1505–1512 (2007). Article \n    ADS \n    PubMed \n    \n                    Google Scholar Götte, J. & Dennis, M. Generalized shifts and weak values for polarization components of reflected light beams. New J. Phys. 14, 073016 (2012). Article \n    ADS \n    \n                    Google Scholar Download references This work was supported by the 973 Program (2012CB921900), the National Natural Science Foundations of China (61205001, 61377035, 11404262, 61522507 and 11304250) and the Fundamental Research Funds for the Central Universities (3102015ZY057). Key Laboratory of Space Applied Physics and Chemistry, Ministry of Education and Shaanxi Key Laboratory of Optical Information Technology, School of Science, Northwestern Polytechnical University, Xi’an, 710129, China Sheng Liu, Peng Li, Yi Zhang, Xuetao Gan, Meirong Wang & Jianlin Zhao You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar S.L. initiated the work and performed the most experiments. Y.Z. and P.L. supervised the finding of the present work and assist in the experiments. X.G. and M.W. were responsible for scientific explanation for the finding and revision. J.Z. reviewed the study results and supervised the project. All authors reviewed the manuscript. The authors declare no competing financial interests. This work is licensed under a Creative Commons Attribution 4.0 International License. The images or other third party material in this article are included in the article’s Creative Commons license, unless indicated otherwise in the credit line; if the material is not included under the Creative Commons license, users will need to obtain permission from the license holder to reproduce the material. To view a copy of this license, visit http://creativecommons.org/licenses/by/4.0/ Reprints and Permissions Liu, S., Li, P., Zhang, Y. et al. Longitudinal spin separation of light and its performance in three-dimensionally controllable spin-dependent focal shift.\n                    Sci Rep 6, 20774 (2016). https://doi.org/10.1038/srep20774 Download citation Received: 13 October 2015 Accepted: 07 January 2016 Published: 17 February 2016 DOI: https://doi.org/10.1038/srep20774 Anyone you share the following link with will be able to read this content: Sorry, a shareable link is not currently available for this article.  Provided by the Springer Nature SharedIt content-sharing initiative Light: Science & Applications (2022) Applied Physics B (2020) Frontiers of Optoelectronics (2019) Scientific Reports (2018) By submitting a comment you agree to abide by our Terms and Community Guidelines. If you find something abusive or that does not comply with our terms or guidelines please flag it as inappropriate. Advertisement Scientific Reports (Sci Rep)\n                \n\nISSN 2045-2322 (online) © 2023 Springer Nature Limited Sign up for the Nature Briefing newsletter — what matters in science, free to your inbox daily. ",
    "datetime": null,
    "url": "https://www.nature.com/articles/srep20774"
}