{
    "title": "\n        Lotte Duty Free extends supplier support during Covid-19 crisis    ",
    "text": "By  Alison Farrington \nin  Downtown, Latest News, Retail News\nApril 1, 2020 Comments Off on Lotte Duty Free extends supplier support during Covid-19 crisis Lotte Duty Free has expanded its support to small and medium-sized partners in Korea Lotte Duty Free has extended its ‘win-win’ support programme to small and medium-sized brand partners in Korea during the Covid-19 crisis. Lotte Duty Free confirmed in a statement it is to shorten its payments cycle, effective 1 April, by increasing the number of payments to small and medium-sized domestic partners from once a month to twice a month. Under this new arrangement, more than 400 partner companies will benefit, the retailer said. The new terms are intended to support brand partners that are having difficulty securing cash liquidity due to the worsening business environment caused by Covid-19. The price of goods will amount to a total of KRW 150 billion (US$122 million) to be paid April through June. Financial support measures for SME partners will also be expanded, building on Lotte’s previous endeavours to support new brands to market. In July last year, Lotte launched a KRW 50 billion ‘win-win’ fund to support low interest rate financing for SME partners. Previously, the primary trading partners that deal directly with Lotte were the target, but as the damage from SME partners increases due to the influence of Covid-19, Lotte said it wanted to expand the scope of application to second-tier trading partners. An additional support plan of KRW3.5 billion was prepared for SME brands sold at Lotte. This funding will be used to strengthen marketing activities for each brand to improve sales and to improve the environment of brand locations. In addition, Lotte said it plans to make the K-Wave launch system a regular event. The product fair first held last year was created to discover outstanding SMEs and through this exposure, Lotte offers online and offline store entry opportunities, promotional video production, and marketing activities. The 15 brands selected last year have now entered Lotte Internet Duty Free, and nine of them are preparing to enter downtown locations. CEO of Gap Lotte Duty Free said, “With the Covid-19, the entire duty-free industry is in a difficult situation, but we have expanded our support to small and medium-sized partners in order to work together with the government and the business community to overcome the crisis.” Tagged with: Korea Lotte Duty Free ",
    "datetime": "2020-04-01T12:39:28+01:00",
    "url": "https://www.dfnionline.com/latest-news/lotte-duty-free-extends-supplier-support-covid-19-crisis-01-04-2020/"
}