{
    "title": "\n        Lotte opens new Bangkok downtown duty-free store    ",
    "text": "By  Andrew Pentol \nin  Asia/Pacific, Brand News, Cosmetics, Downtown, Fashion & Leathergoods, Food & Confectionery, Fragrance, Gifts & Electronics, Jewellery & Watches, Latest News, Liquor & Wines, Product Focus, Retail News\nJune 16, 2017 Comments Off on Lotte opens new Bangkok downtown duty-free store Lotte Duty Free has accelerated its overseas expansion with the opening of a new downtown duty-free shop in Bangkok Thailand. Phase one is now operational and a grand opening is scheduled for the second half of the year. The store is located on the second and third floors of the Show DC mall in downtown Bangkok and will eventually span 9,354sq m. It is a 30-minute drive from Bangkok Suvarnabhumi airport. It will combine K-Pop Hallyu culture with Korean fashion and cosmetics and feature a Star Avenue Hallyu cultural experience space. Consumers can have their pictures taken with Korean Wave stars and promotional videos will be aired on large LED devices to provide information. These will provide information on Lotte Duty Free and major Korean tourist attractions. Once the store is fully operational, it will comprise around 300 toy, cosmetics, fashion, electronics, and liquor and tobacco brands. A special “Thai Zone” will also offer local products giving a flavour of Thailand.” This latest opening in Bangkok is the company’s second overseas opening in 2017. This follows the launch of its Da Nang airport duty-free in Vietnam in May. Lotte Duty Free Co CEO Jang Seon-wook said: “As Bangkok is a major tourist destination for tourists from all over the world, Lotte Duty Free is expected to be a good stepping stone to become the world’s no.1 company.” Lotte Duty Free will continue to offer differentiated services, We will do our utmost to expand and diversify our global business.” The new outlet will feature a Star Avenue entertainment space  Tagged with: Bangkok Lotte Duty Free ",
    "datetime": "2017-06-16T11:48:35+01:00",
    "url": "https://www.dfnionline.com/latest-news/retail/lotte-opens-new-bangkok-downtown-duty-free-store-16-06-2017/"
}