{
    "title": "Loving life at the U Asia Campus – @theU",
    "text": "Just before her high school graduation in the summer of 2018, Sarah Higashi and her friends attended the Korean Wave Concert K-CON in Los Angeles and happened upon the University of Utah Asia Campus information booth. A year later, she boldly chose to go to South Korea after learning she could earn a U.S. diploma while gaining valuable global experience in the culture that had sparked her interest. Born and raised in Irvine, Higashi had planned to attend the University of California at Irvine, but her experience at Korean Wave changed her path. “K-pop was very popular in Irvine, California,” said Higashi. “In high school, I learned about BTS from a friend and immediately became a fan. I went to BTS concerts three times in the U.S. The lyrics of their songs especially touched my heart. I was often stressed about my school grades and concerned about going to college. It was a great comfort to be able to get rid of such stress for a while just listening to BTS songs.” Before coming to South Korea, Higashi’s only knowledge of the country was about K-pop. However, as she started her campus life, her interest in Korean culture has gradually expanded away from K-pop. “Now, my interest in K-pop has decreased. Instead, I am embracing in local Korean culture, such as eating seaweed soup on a birthday morning,” said Higashi. “While my hometown of Irvine is famous for surfing at its many beautiful beaches, I tried surfing for the first time in my life on Songjeong Beach, in Busan. Haedong-Yonggungsa Temple, which faces the sea, was also impressive. I also enjoyed visiting the handprints of famous movie stars at Biff Square in Nampo-dong. I spent last year at my boyfriend’s grandfather’s house in Ulsan, during the Chuseok (Korean Thanksgiving) holiday, and the time the whole family spent together was very warm. I felt like I became a part of the family while making holiday food together and holding ancestral rites.” Sarah shares her daily life in South Korea with her American friends through social media and has adopted the role of Korean cultural evangelist. Over 800 followers clicked on Sarah’s photos taken at Korean tourist attractions such as palaces, zoos, amusement parks and aquariums. About 60 international students from 11 countries, including China, Russia and Malaysia, attend the U Asia Campus. Sarah is busy because they want to meet with her every day. “I am working as a school ambassador and I know a little bit of Korean, so many foreign friends ask me to show them around Seoul. People ask me to go to Hongdae, or Gangnam, most are only interested in the Korean Wave, such as K-pop. I let them know that there are many things to see and enjoy in South Korea besides celebrities. K-pop is only a tiny part of Korean culture,” said Higashi. It has already been two years since she first met her Korean boyfriend in a writing class in 2019. Last summer he joined the military and she became the so-called “Gomshin,” the Korean term for a girlfriend waiting for her boyfriend to complete military service. Knowing the exact date of discharge from the military, she goes to her boyfriend’s unit in Anyang, two hours away from Songdo, Incheon, whenever she has a chance to soothe her sadness over his vacancy. “He will be discharged on July 31 next year. I visited him last week and he looked happy because he will be a corporal soon. I hope we study together at school soon,” said Higashi. Sarah changed her major twice in a year and a half, finally finding an academic home in Health, Society and Policy. She wanted to know what to pursue in her career, so she took various classes and decided. Earlier this spring, she took a leave of absence from school as university lectures were converted to fully online classes due to COVID-19. She returned to her hometown and worked for a pharmaceutical company for six months. She plans to study at the U Asia Campus for the next two years and then wrap up her undergraduate life at the U’s Salt Lake Campus. Her goal is to go to graduate school, study more in regulatory sciences and then enter a biopharmaceutical company to work. “Eventually, I want to stay in South Korea and help Korean biopharmaceutical companies when products get approved by the FDA. My boyfriend’s family is here and my relationship with South Korea through the U Asia Campus is precious to me,” said Higashi. Learn more about how the U’s Salt Lake City students can attend the U Asia Campus in Incheon, South Korea. 201 PRESIDENTS CIRCLE\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\tSALT LAKE CITY, UT 84112 801-581-7200 © 2023 THE UNIVERSITY OF UTAH ",
    "datetime": null,
    "url": "https://attheu.utah.edu/facultystaff/loving-life-at-the-u-asia-campus/"
}