{
    "title": "Lucy Pet’s K-9 Wave Maker Heads to Toronto | Pet Age",
    "text": " Pet Age Staff//May 10, 2017 Lucy Pet’s K-9 Wave Maker Heads to Toronto  Pet Age Staff\n//May 10, 2017 For the first time ever, Canadian dogs will get the chance to yell “surf’s up” and head over to Lucy Pet’s Gnarly Crankin’ K-9 Wave Maker. Back by popular demand after a wildly successful appearance in the 2017 Rose Parade, Lucy Pet’s Wave Maker will cross the U.S. border for the first time to attend Toronto’s Woofstock Festival.\nAll Toronto area pet parents can bring their dogs to Woodbine Park on May 27 from 10 a.m. to 6 p.m. EST and May 28 from 10 a.m. to 5 p.m. EST to see if they have what it takes to surf the Lucy Pet Wave Maker.\nThe Lucy Pet Crankin’ K9 Wave Maker is a one of a kind portable invention designed exclusively for Lucy Pet by American Wave Machine. It consists of a 75-foot trailer filled with 19,000 liters of water (5,000 gallons) and an automatic wave generator. \n\n\n\nIn addition to determining if a dog is a surfer “dude” or surfer “chick,” they will have the chance to win prizes and social media fame all across Canada.\n“We are really excited to bring Lucy Pet’s Gnarly Crankin’ K-9 Wave Maker up north and across the Canadian border to make new friends,” Lucy Pet’s Joey Herrick said. “After so much success in the U.S. last year, we wanted to share the experience with Canadian pet parents too. Participating in Woofstock, named the Best Festival in Canada, is the perfect opportunity to do just that. We can’t wait!” All Toronto area pet parents can bring their dogs to Woodbine Park on May 27 from 10 a.m. to 6 p.m. EST and May 28 from 10 a.m. to 5 p.m. EST to see if they have what it takes to surf the Lucy Pet Wave Maker.\nThe Lucy Pet Crankin’ K9 Wave Maker is a one of a kind portable invention designed exclusively for Lucy Pet by American Wave Machine. It consists of a 75-foot trailer filled with 19,000 liters of water (5,000 gallons) and an automatic wave generator. \n\n\n\nIn addition to determining if a dog is a surfer “dude” or surfer “chick,” they will have the chance to win prizes and social media fame all across Canada.\n“We are really excited to bring Lucy Pet’s Gnarly Crankin’ K-9 Wave Maker up north and across the Canadian border to make new friends,” Lucy Pet’s Joey Herrick said. “After so much success in the U.S. last year, we wanted to share the experience with Canadian pet parents too. Participating in Woofstock, named the Best Festival in Canada, is the perfect opportunity to do just that. We can’t wait!” The Lucy Pet Crankin’ K9 Wave Maker is a one of a kind portable invention designed exclusively for Lucy Pet by American Wave Machine. It consists of a 75-foot trailer filled with 19,000 liters of water (5,000 gallons) and an automatic wave generator. \n\n\n\nIn addition to determining if a dog is a surfer “dude” or surfer “chick,” they will have the chance to win prizes and social media fame all across Canada.\n“We are really excited to bring Lucy Pet’s Gnarly Crankin’ K-9 Wave Maker up north and across the Canadian border to make new friends,” Lucy Pet’s Joey Herrick said. “After so much success in the U.S. last year, we wanted to share the experience with Canadian pet parents too. Participating in Woofstock, named the Best Festival in Canada, is the perfect opportunity to do just that. We can’t wait!” In addition to determining if a dog is a surfer “dude” or surfer “chick,” they will have the chance to win prizes and social media fame all across Canada.\n“We are really excited to bring Lucy Pet’s Gnarly Crankin’ K-9 Wave Maker up north and across the Canadian border to make new friends,” Lucy Pet’s Joey Herrick said. “After so much success in the U.S. last year, we wanted to share the experience with Canadian pet parents too. Participating in Woofstock, named the Best Festival in Canada, is the perfect opportunity to do just that. We can’t wait!” “We are really excited to bring Lucy Pet’s Gnarly Crankin’ K-9 Wave Maker up north and across the Canadian border to make new friends,” Lucy Pet’s Joey Herrick said. “After so much success in the U.S. last year, we wanted to share the experience with Canadian pet parents too. Participating in Woofstock, named the Best Festival in Canada, is the perfect opportunity to do just that. We can’t wait!”  Share this! While inflation is slowing, it is still a concern. The huge year-over-year (YOY) increases in the monthly Cons[...] October 17, 2023 The U.S. Food and Drug Administration (FDA) is investigating certain lots of pet food products manufactured by[...] October 13, 2023 Press release: Post Holdings\r\nPost Holdings, Inc., a consumer packaged goods holding company, recently announc[...] October 12, 2023 Press release: BSM Partners\r\nVeterinarians and animal nutritionists from BSM Partners, the largest pet care re[...] October 10, 2023 According to John Gibbons, the Pet Business Professor, total pet spending grew to $102.71 billion in 2022, up [...] October 10, 2023 According to the 2023-2024 National Pet Owners Survey conducted by the American Pet Products Association, 65.1[...] October 3, 2023 Sign up for the latest pet industry news, trends and insights. Wild Delight has added a 14-pound bag to its popular Bugs N’ Berries bird seed blend line. This pr[...] The Blooming Chicken Coop is the perfect versatile solution for the diligent chicken-owner, featurin[...] HomeoPet and HomeoVet are your trusted partners for natural animal health, offering a range of veter[...] Ideal for active households with carpeting and large area rugs, the BISSELL Revolution HydroSteam Pe[...] TOP’s Parrot Food has kicked off its 20th anniversary by introducing a redesigned lineup of packag[...] ZYMOX Avain Care for All Birds is a new Topical Solution and Topical Spray that supports healthy ski[...] A full HD bird cam, the TX-165 features a short lens focus and large viewing angle that allows users[...] Relax and rehydrate your birds with Zoo Med’s Avian Electrolytes. Full of electrolytes, antioxidan[...] Trends and Products: Good Pet Grooming 1/10/2023 Trends and Products: Pet Ailments, Health Solutions 1/10/2023 Trends and Products: Play Time 1/9/2023 Trends and Products: Waste Management 1/9/2023 Trends and Products: Snoozing in Style 1/9/2023   How Is My Site?  View Results The most requested trade magazine in the pet industry, Pet Age is a media brand that appeals to the pet supply, merchandising and service market by delivering timely and critical content. Get our free Pet Age e-alerts & breaking news notifications! Subscribe for access to the latest digital and special editions. © 2023 BridgeTower Media. All rights reserved. Use of this website is subject to its Terms of Use | Privacy Policy | Your California Privacy Rights/Privacy Policy | Do Not Sell My Info/Cookie Policy ",
    "datetime": null,
    "url": "https://www.petage.com/lucy-pets-gnarly-crankin-k-9-wave-maker-is-headed-to-woofstock-toronto-north-americas-largest-outdoor-dog-festival/"
}