{
    "title": "Luhan and 4 other K-pop and K-drama stars who shine in China | South China Morning Post",
    "text": "Interest in ﻿K-pop, K-drama and K-culture has been growing rapidly over the past few years, with BTS – the hugely successful boy band – riding on the crest of the “Korean wave”, or hallyu, the term for Korean entertainment and culture’s global popularity. BTS’ albums have topped the charts abroad, with the seven-member group, featured on the cover of Time magazine, adding new concert dates to its extended sold-out 11-month world tour, in the US, Brazil, France, Britain and Japan – where it ends this weekend – to meet demand. A number of other K-pop celebrities have been able to widen their appeal abroad, too – particularly in China. Check out five stars who have made it big on the Chinese mainland: Luhan (former EXO member) Born and raised in Beijing, Luhan, a former member of the popular South Korean-Chinese boy band EXO, has enjoyed huge success as a singer and actor in his home country. In 2017, Luhan, 29, whose real name is Lu Han, was ranked the “‘second highest earning celebrity in China”, according to figures from Chinese media outlet EToday. He ranked only behind leading Chinese actress Fan Bingbing. Luhan was reported to have earned 181.6 million yuan (US$26.4 million), according to EToday figures. His main earnings came from his starring role in the 2017 drama Fighter of the Destiny, and his album sales, including his hit debut solo release “Reloaded”. He has also appeared in the hit Chinese films 20 Once Again, and The Witness, both released in 2015, and Time Raiders (2016). According to the terms of the contract he signed with SM Entertainment, the company responsible for managing his former group EXO, Luhan is prevented from working in Korea or Japan. However, regardless of these restrictions on his employment, he has achieved astonishing success in China. Hwang Chi-yeul The Korean born star made his debut in the music business in 2007, with a release of a single and album, but Hwang, 36, continued to struggle to make a lasting impact in show business until his appearance on the Korean variety television show, I Can See Your Voice, in 2015. This led to a dramatic increase in his popularity at home and abroad – with his influence extending to China’s music scene, largely thanks to the success of his second mini-album, “Star”. in 2016 he revealed on the Korean television talk show, Happy Together, that he had annual earnings of 300 million won (US$255,000). His singing talent has seen him increase his popularity on the Chinese mainland through his appearance in the Chinese reality television show, I Am a Singer Season 4, which saw him finishing third in the final. T-ara The K-pop girl group T-ara, which was formed in 2009, first gained popularity in China after singing a cover version of the signature song of Chinese duo Chopstick Brothers, Little Apple, in 2014. The response to their song saw them embark on their debut tour on the mainland, named the “Great China Tour” in 2015, which was a huge success, with sold-out concerts wherever they performed. T-ara, which is now a four-member group – after launching as a five-piece and the departure of various members over the years – continues to have a big following on the Chinese mainland. The group, previously managed by the Korean company, MBK Entertainment, has now reportedly signed a deal with the Chinese management company Longzhen, worth 50 million won Chae Yeon Chae Yeon, 40, whose real name is Lee Chae-yeon, made her show business debut in 2003. She began to gain a following among Chinese audiences in 2007, after she appeared regularly on a television programme shown on the provincial satellite television station, Hunan TV. In 2008, she released a Chinese song, My Love, and has followed this success with the release of a further six albums. She has also boosted her appeal by acting in various local Chinese television dramas. Entering her 40s, Chae Yeon revealed on Happy Together that she earns of between 300,000 won and 400,000 won each time she performs two or three songs on TV. She also earns millions of won from her many appearances in television commercials. She says she has the Korean group Clone to thank for her early success in China, because one of its members invited her to visit China when the group was giving a concert. Park Hae-jin Actor Park Hae-jin, 36, started his acting career in 2006 and has enjoyed growing success after appearing in numerous Korean drama series, including 2013’s My Love from the Star, Doctor Strange (2014), Cheese in the Trap (2016) and Man to Man (2017). In 2011, Park appeared in a Chinese television drama series for the first time, Loose Money Married Mind, on Hunan TV. His huge success in Chinese productions has led to the issuing of a limited edition set of Chinese stamps, showing Park’s face; these stamps are produced only for the 100 most influential celebrities in China. These stamps cost 698 yuan (US$100) while a phone card showing a photograph of his face costs 120 yuan. Park has also appeared in numerous advertisements for Chinese cosmetic brands, is a brand ambassador in the country and also supports environmental projects, including tree planting awareness campaigns to highlight the problem of desertification in China’s western regions. Want more stories like this? Sign up  here. Follow STYLE on  Facebook,  Instagram,  YouTube and  Twitter Beijing-born Luhan – once a member of boy band EXO – is among a growing number of K-pop and K-drama singers and actors who enjoy mainland success ",
    "datetime": "2019-07-12T10:00:10+08:00",
    "url": "https://www.scmp.com/magazines/style/people-events/article/3018192/luhan-and-4-other-k-pop-and-k-drama-stars-who-shine"
}