{
    "title": "Mach 1,000 shock wave lights supernova remnant | Astronomy.com",
    "text": "In the case of Tycho’s supernova remnant, astronomers have discovered that a reverse shock wave racing inward at Mach 1,000 — 1,000 times the speed of sound — is heating the remnant and causing it to emit X-ray light. “We wouldn’t be able to study ancient supernova remnants without a reverse shock to light them up,” said Hiroya Yamaguchi from the Harvard-Smithsonian Center for Astrophysics (CfA) in Cambridge, Massachusetts. Astronomer Tycho Brahe witnessed the Tycho supernova in 1572. The appearance of this “new star” stunned those who thought the heavens were constant and unchanging. At its brightest, the supernova rivaled Venus before fading from sight a year later. Modern astronomers know that the event Tycho and others observed was a type Ia supernova, caused by the explosion of a white dwarf star. The explosion spewed elements like silicon and iron into space at speeds of more than 11 million mph (5,000 km/s). When that ejecta rammed into surrounding interstellar gas, it created a shock wave — the equivalent of a cosmic “sonic boom.” That shock wave continues to move outward today at about Mach 300. The interaction also created a violent “backwash” — a reverse shock wave that speeds inward at Mach 1,000. “It’s like the wave of brake lights that marches up a line of traffic after a fender-bender on a busy highway,” said Randall Smith from CfA. The reverse shock wave heats gases inside the supernova remnant and causes them to fluoresce. The process is similar to what lights household fluorescent bulbs, except that the supernova remnant glows in X-rays rather than visible light. The reverse shock wave is what allows us to see supernova remnants and study them hundreds of years after the supernova occurred. “Thanks to the reverse shock, Tycho’s supernova keeps on giving,” said Smith. The team studied the X-ray spectrum of Tycho’s supernova remnant with the Suzaku spacecraft. They found that electrons crossing the reverse shock wave are rapidly heated by a still uncertain process. Their observations represent the first clear evidence for such efficient “collisionless” electron heating at the reverse shock of Tycho’s supernova remnant. The team plans to look for evidence of similar reverse shock waves in other young supernova remnants. Get newsletters, updates and special offers via email from Astronomy.com! \"*\" indicates required fields Δ Astronomy leads the astronomy hobby as the most popular magazine of its kind in the world. Get information about subscriptions, digital editions, renewals, advertising and much, much more. Count me in @ 2023 Kalmbach Media. All Rights Reserved. Why Sign In? Subscribers can access their digital magazine issues, and registered users can participate in our Community forums and galleries. ",
    "datetime": "2013-11-26T00:00:00+00:00",
    "url": "https://www.astronomy.com/science/mach-1000-shock-wave-lights-supernova-remnant/"
}