{
    "title": "Magnetic domain walls as reconfigurable spin-wave nanochannels | Nature Nanotechnology",
    "text": "Thank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\n            the best experience, we recommend you use a more up to date browser (or turn off compatibility mode in\n            Internet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles\n            and JavaScript. Advertisement Nature Nanotechnology\nvolume 11, pages 432–436 (2016)Cite this article 8537 Accesses 220 Citations 86 Altmetric Metrics details In the research field of magnonics1,2,3,4,5,6,7, it is envisaged that spin waves will be used as information carriers, promoting operation based on their wave properties. However, the field still faces major challenges. To become fully competitive, novel schemes for energy-efficient control of spin-wave propagation in two dimensions have to be realized on much smaller length scales than used before. In this Letter, we address these challenges with the experimental realization of a novel approach to guide spin waves in reconfigurable, nano-sized magnonic waveguides. For this purpose, we make use of two inherent characteristics of magnetism: the non-volatility of magnetic remanence states and the nanometre dimensions of domain walls formed within these magnetic configurations. We present the experimental observation and micromagnetic simulations of spin-wave propagation inside nano-sized domain walls and realize a first step towards a reconfigurable domain-wall-based magnonic nanocircuitry. You have full access to this article via your institution.  In the last few years, the scientific community in the field of magnonics has made huge efforts to realize concepts to use spin waves for data processing. Quite recently, remarkable progress has been made, leading to prototype building blocks of a spin-wave-based logic8,9,10. Despite this progress, most concepts are based on sample layouts that are limited regarding their further optimization. Previous studies on spin-wave propagation on the nanoscale have relied on confinement in geometrically patterned waveguides11, but these lack the flexibility for manipulating the propagation path that is required for reprogrammable devices. On the microscale, this dynamic control of spin waves in two-dimensional structures has been realized, but it is based on the continuous application of external fields and thus requires high energy consumption. Here, we will present a possible way to overcome these challenges. Spin waves impinging on domain walls are either reflected or phase-shifted when transmitted, depending on their wavelength and the nature of the domain wall12,13,14,15,16. Additional studies have been devoted to the domain wall dynamics, which was found to be on the order of 10 MHz (ref. 17). However, the possibility to send spin waves along a domain wall has only been addressed in one numerical study for out-of-plane magnetization and with a very specific domain wall that is difficult to realize in experimental scenarios18. Here, we experimentally explore the intrinsic spin-wave eigenmodes that are quantized across the width of a domain wall and possess a well-defined wave vector along the wall that enables information transport. By targeting this class of largely unknown spin-wave modes, we focus on the potential of using domain walls as nanometre-scaled spin-wave channels to open new perspectives for the energy-efficient control of spin-wave propagation in two dimensions. The top part of Fig. 1a shows a schematic of a 180° Néel wall. The magnetic moments rotate within the sample plane, giving rise to magnetic volume charges ∇·M, with opposite sign on the two sides of the domain-wall centre. The red curve in Fig. 1a illustrates these volume charges calculated by means of micromagnetic simulations. The charges generate a strong magnetostatic field Hdemag (blue curve in Fig. 1a) oriented antiparallel to the magnetization in the centre of the domain wall, resulting in a locally decreased effective magnetic field. Because spin-wave resonances depend on the effective field, locally decreased fields can form potential wells for localized modes19,20. Here, a potential well is created across the domain wall with a width of a few tens of nanometres. This width strongly depends on various parameters of magnetic materials and can be tuned towards even smaller sizes. In this Letter, we demonstrate experimentally and numerically that such a potential well leads to spin-wave modes that are strongly localized to the domain-wall width and travel freely along the wall. Moreover, and in contrast to the vast majority of experimentally realized scenarios, no energy-consuming external bias fields are needed to promote spin-wave propagation in the preferred geometry10 along the domain wall. a, Schematic illustration of a 180° Néel wall carrying a spin wave. The divergence of the magnetization ∇·M across the width of the wall shows opposite sign on the two sides of the domain wall centre and results in a strong magnetostatic field Hdemag oriented antiparallel to the magnetization direction. This potential well confines the spin-wave propagation into the narrow region of the wall. b, SEM image of the investigated Py structure and the microwave antenna for the external excitation of spin dynamics. Inset (lower right): magnetic field sweep used to initialize the domain configuration. c, The black–white contrast of the Kerr microscopy image confirms the formation of a Landau-like domain pattern. Arrows indicate the magnetization direction in the domains. Figure 1b presents a scanning electron microscopy (SEM) image of the structure used in the experiment. A 40-nm-thick Ni81Fe19 (permalloy, Py) film is patterned into a spin-wave waveguide that is 5 μm wide at one end and gradually broadens until it reaches a constant width of 10 μm. This variable width stabilizes the desired remanence state. A microwave antenna is positioned at the beginning of the 10-μm-wide part of the waveguide. Oscillating magnetic fields hrf generated by microwave currents in this antenna allow for the local excitation of spin waves with well-defined frequencies. To reproducibly prepare the aforementioned remanence state with the domain wall parallel to the long axis of the waveguide, we applied a sinusoidal, exponentially decaying magnetic field Hini,x parallel to its short axis, as depicted in the bottom right inset in Fig. 1b. We used magneto-optical Kerr microscopy to confirm the magnetic state of the waveguide. The overlay in Fig. 1c shows a Kerr image, with the black–white colour code representing the magnetization component along the y direction. A Landau-like domain pattern is formed with a 180° Néel wall in the centre separating two domains with opposite magnetization. Additional micromagnetic simulations (discussed in the following) confirm the Néel-type character of the domain wall, with the magnetic moments rotating in the sample plane as is expected for the material parameters and thickness of the Py film21. Experimentally, spin dynamics were studied by micro-focus Brillouin light scattering (BLS) spectroscopy22. To analyse the spectrum in the different areas of the waveguide, we measured the spin-wave intensity as a function of the excitation frequency at two different positions: inside the domain wall and in the domains. These measurements were performed in the 10-μm-wide bottom part of the waveguide at a distance of 1 μm from the antenna. Figure 2a summarizes the results and clearly shows two distinct spectra. Inside the domain wall (square symbols), the maximum intensity was observed at the lowest possible detection frequency of 500 MHz, whereas in the domains (triangular symbols) the highest intensities can be found at frequencies around 2.8 GHz. a, Spin-wave spectra measured by BLS microscopy inside the domain wall (squares) and the domains (triangles), respectively. The measurement clearly shows different excitation spectra depending on the probing position. b, Line scans of the spin-wave intensity across the width of the Py waveguide for the two excitation frequencies that yielded maximum spin-wave intensity inside the domain wall (squares) and in the domain (triangles). The data exhibit two spatially separated spin-wave modes with the low-frequency mode strongly localized at the domain wall position. c, Two-dimensional intensity distribution of spin waves propagating along the nanochannel formed by the domain wall in the centre of the waveguide. To analyse the nature of these different spin-wave modes, we detected their intensity profile across the width of the waveguide. Measurements were carried out at the excitation frequencies where the maximum intensity was observed within the wall and the domains. Figure 2b summarizes the results. The modes show a clear spatial separation, with one mode strongly confined at the position of the domain wall (squares). In contrast, the higher-frequency mode (triangles) is spread throughout the domains at both sides of the wall and almost vanishes at the domain-wall position. Thus, the potential well formed by the domain wall can be used to confine spin waves in a certain frequency range on the nanoscale. The slightly different intensity profiles detected at 2.8 GHz in the two domains are attributed to a misalignment of the domain wall relative to the centre position. This asymmetry leads to different lateral confinement conditions in the domains and, consequently, to a relative shift of the excitation spectra. However, quantization due to confinement in micrometre-sized waveguides has already been studied extensively22,23,24. Here, we focus on the spin-wave mode inside the nanochannel formed by the domain wall. Its localization becomes even more evident from the two-dimensional BLS measurement presented in Fig. 2c. Solely at the position of the domain wall, the signal of the mode propagating away from the antenna is detected, revealing the channelling character of the domain wall. To obtain a deeper insight into the propagation characteristics within the wall, micromagnetic simulations were carried out25. The studied system was a 5-μm-long, 1-μm-wide and 10-nm-thick Py rectangle. This reduction in size compared with the experiment allowed for a sufficiently fine discretization to be achieved, as required to simulate the nano-sized domain wall without affecting its character, which is mainly determined by the material parameters and not by the different dimensions. Therefore, the comparison between experiment and simulation is still valid for spin-wave modes within the domain wall. Figure 3a shows the equilibrium magnetization configuration. The red–blue colour codes the magnetization component mx along the short axis of the rectangle, and the arrows indicate the magnetization direction. The microstructure exhibits a flux-closure Landau domain pattern with a 180° Néel wall separating two domains with opposite magnetization. a, Simulated domain configuration of a rectangular Py thin-film element. The red–blue colour represents the in-plane magnetization component mx parallel to the short axis of the rectangle, and the arrows display the net magnetization direction in the domains. b, The x component of the resulting effective field. The image clearly shows that strong fields are present along the domain walls. c, Amplitude profiles of different spin-wave modes excited locally at the position indicated by the green dot. The red–blue colour represents the out-of-plane component of the magnetization mz. Green bars indicate the spin-wave wavelengths that can be extracted from the data. d, Dispersion relation of spin waves mostly confined to the domain wall. The magnitude of the effective magnetic field calculated from this remanence state is presented in Fig. 3b with the red–blue colour representing the field component Hx along the short axis of the rectangle. The data show strong effective fields across the domain wall oriented antiparallel to the magnetization direction. An out-of-plane field pulse was used to locally excite spin dynamics at the domain-wall position at a distance of 1.6 μm from the bottom edge (green dot in Fig. 3c). The subsequent analysis yields the spin-wave spectrum and dispersion relation, which is discussed in the next paragraph. To illustrate the mode profiles of the spin-wave resonances, we simulated the response to a continuous microwave excitation at four different frequencies. In Fig. 3c, the normalized z component of the magnetization, mz, is plotted for a given time once the system reaches a steady state. The time evolution of the spin-wave amplitudes, showing their propagating nature, are provided in the Supplementary Information for two distinct frequencies. For the lower frequencies of 0.52, 1.28 and 2.16 GHz, the spin-wave modes are strongly localized inside the domain wall. However, a general trend is that the strong localization within the wall becomes weaker with increasing frequency. For modes with high frequencies, for example 5.68 GHz, the radiation from the wall indicates the onset of the spin-wave band in the domains and loss of the channelling effect. Although the strong localization of the low-frequency spin waves inside the domain wall is in good agreement with the experiment, the domain modes appear at higher frequencies in the simulation. In general, the spin-wave eigenmodes shift to higher frequencies when reducing the domain size, which therefore allows the guiding of spin waves inside the wall, even for higher frequencies and smaller wavelengths. In addition to the spatial and spectral characteristics, the micromagnetic simulations also shed light on the spin-wave dispersion. The wavelength for a given frequency—illustrated by the green bars in Fig. 3c—can be determined by a Fourier analysis of the dynamic magnetization along the domain wall. Figure 3d shows the resulting positive dispersion that enables the transport of information via spin waves propagating within the domain wall. Even though the spin waves are confined transverse to the wall on a length scale given by the domain wall width, the dispersion is mainly dominated by dipolar energy. For the first three modes shown in Fig. 3c, the dynamic part of the dipolar energy originating from the spin waves is larger than the dynamic exchange energy by a factor of three to five. The observation of well-defined wave vectors along the propagation path is a crucial precondition for numerous concepts that rely on the interference of spin waves12,26,27 and highlights the potential of domain walls in magnonic circuits for data processing. To evaluate the localization of the numerically calculated mode excited at 0.52 GHz, we extracted its intensity profile across the domain wall. The result is shown by the black dashed line in Fig. 4, yielding a signal with a full-width at half-maximum (FWHM) of ∼40 nm. Figure 4 also shows the effective magnetic field Heff (blue solid line) extracted at the same position. A direct comparison of the two curves shows the strong confinement of the spin precession to the area of the potential well formed by the domain wall. Spin-wave intensity across the domain-wall width determined from experiment (squares) and simulation (dashed line) for 0.52 GHz. The dotted line represents a Gaussian fit to the measured data that is the convolution of the actual spin-wave signal with the focal spot size of the BLS microscope. This fit with a FWHM of 340 nm mainly reflects the spot size, which is expected to be on the same order for confocal microscopes and thus suggests a confinement of several tens of nanometres. In accordance with this consideration, the micromagnetic simulation shows a strong lateral confinement of 40 nm for the spin-wave modes within the wall. The solid blue line is the magnitude of the effective magnetic field indicating the width of the potential well for the simulated magnetization configuration. We also analysed the localization from the experimental results shown in Fig. 2. The data plotted as red squares in Fig. 4 is well reproduced by a Gaussian fit (red dotted line) with a FWHM of 340 nm. To compare this value to the simulation, we have to take into account that the detected BLS signal does not directly reflect the spatial distribution of the observed spin-wave mode, but is the convolution of the spin-wave signal with the shape of the probing laser spot. The FWHM extracted from the data is already on the order of the focal spot size expected for the confocal microscope used in our study, thus confirming the strong lateral confinement revealed by micromagnetic simulations. Finally, we demonstrated the intriguing flexibility of spin-wave nanochannels based on domain walls by actually controlling the spin-wave propagation path. In contrast to waveguides based on geometric confinement, a domain wall can be manipulated easily by several means, including magnetic fields, charge or spin currents. Such manipulations open a new perspective for the control of spin-wave transport in two-dimensional nanostructures and towards the realization of reconfigurable magnonic circuits. We controlled the position of the domain wall via external magnetic fields applied along the long axis of the waveguide. Depending on the polarity of the field, the growth of either the left or the right domain was favoured, resulting in a shift of the domain wall. Figure 5 shows BLS scans across the width of the waveguide at four small magnetic fields of −0.15, −0.05, 0.05 and 0.23 mT. The measurements show that the detected spin-wave mode is shifted, together with the domain wall, by the applied field. The overall left–right asymmetry is attributed to the initial displacement of the domain wall, even in the absence of external fields. Spin-wave intensity measured across the waveguide for different external magnetic fields applied parallel to the long axis of the waveguide for 0.52 GHz. The measurements show that the domain wall can be easily shifted with small applied fields over micrometre distances in both directions, therefore allowing for fine control of the spin-wave channel position. Inset: displacement of the spin-wave propagation path as a function of applied field, yielding a proportionality constant of 5.57 μm mT–1. In fact, the spin-wave propagation path can be moved over a distance of 2 μm within a field range of only ΔH = 0.38 mT. The inset in Fig. 5 illustrates this displacement as a function of field with a proportionality constant of 5.57 μm mT–1. These data establish a novel mechanism to control spin-wave transport in two dimensions. Moreover, they pave the way for reconfigurable but non-volatile magnonic nanocircuitry. In future scenarios, artificial pinning centres—for instance induced by ion implantation28,29—might be used to enable switching between stable remanence states, with different domain-wall configurations acting as nanochannels to guide spin-wave propagation in logic devices. Furthermore, multiple domain walls with a separation of a few tens of nanometres can form in materials with perpendicular magnetic anisotropy18, which allows for an even higher integration density of these spin-wave nanochannels. In summary, we have experimentally demonstrated the channelling of spin waves in nanometre-wide magnetic domain walls with a width of ∼40 nm. Micromagnetic simulations allowed for further analysis of the propagation characteristics. The spin-wave modes propagating inside domain walls exhibit a well-defined wave vector along their propagation path, enabling data transport and processing using wave properties. Finally, we have demonstrated a major advantage of domain-wall-based magnonic waveguides: manipulating the domain configurations with tiny fields below 1 mT allows us to shift the propagation path over a distance of several micrometres. These observations pave the way for the realization of reconfigurable, non-volatile magnonic circuitry by switching between different remanence states and, thus, for the realization of energy-efficient and programmable spin-wave logic devices on the nanoscale. A bilayer of 3 nm Ti (for adhesion) and 40 nm Py was deposited on a SiO2 substrate by electron-beam evaporation. Using electron-beam lithography and liftoff techniques, micrometre-sized spin-wave waveguides were patterned, with the major part having a width of 10 μm, gradually reducing to 5 μm towards one side in order to stabilize the magnetic domain configuration. In a second step, a 100-nm-thick and 1.6-μm-wide gold antenna was positioned at the beginning of the 10-μm-wide part of the waveguide by means of electron-beam lithography, electron-beam evaporation and subsequent liftoff. A microwave current flowing through the antenna generated an oscillating magnetic field that coupled to the magnetization and allowed the excitation of spin waves with well-defined frequencies. The spin-wave intensity was recorded locally by means of BLS microscopy at room temperature. BLS is the inelastic scattering of photons and magnons. Light from a continuous-wave, single-frequency 532 nm solid-state laser was focused on the sample surface using a high-numerical-aperture microscope lens, yielding a spot that could be approximated by a Gaussian profile with a FWHM of ∼320 ± 50 nm. The frequency shift of the inelastically scattered light was analysed using a six-pass Fabry–Perot interferometer TFP-2 (JRS Scientific Instruments), providing an accessible frequency range from 500 MHz to a few hundred gigahertz. The magnetization dynamics is described by the Landau–Lifshitz–Gilbert equation of motion: where γ is the gyromagnetic ratio, m = M/MS the normalized magnetization vector, α is the Gilbert damping parameter, and Heff is the total effective field comprising the exchange, anisotropy, magnetostatic and external magnetic fields. The simulations were performed by numerically solving equation (1) using the GPU accelerated MuMax3 finite-difference code25. Simulations were performed for a rectangular element (5 μm long, 1 μm wide and 10 nm thick). This structure was discretized into cells with edge lengths Δx = 2.44 nm, Δy = 1.90 nm and Δz = 10 nm, respectively. The following material parameters for Py were used: saturation magnetization MS = 830 kA m–1, exchange constant A = 1.3 × 10–11 J m–1 and zero crystalline anisotropy K = 0 J m–3. The Gilbert damping parameter was set to α = 0.007. The magnetization dynamics was excited by an out-of-plane field pulse with a Gaussian shape and 20 nm FWHM, which was applied inside the domain wall at a distance of 1.6 μm from the bottom edge of the rectangular element. The time evolution of the field pulse was a sinc function, chosen such that the cutoff frequency in the Fourier transform was 40 GHz. The Fourier transform of the magnetization dynamics was calculated over a period of 25 ns for each cell. The sum over all nodes provided the integral spectrum of the given configuration. The mode profiles of the individual resonances were determined by a backward windowed Fourier transform to calculate the dispersion relation. Kruglyak, V. V. & Hicken, R. J. Magnonics: experiment to prove the concept. J. Magn. Magn. Mater. 306, 191–194 (2006). Article \n    CAS \n    \n                    Google Scholar Neusser, S. & Grundler, D. Magnonics: spin waves on the nanoscale. Adv. Mater. 21, 2927–2932 (2009). Article \n    CAS \n    \n                    Google Scholar Khitun, A., Bao, M. & Wang, K. L. Magnonic logic circuits. J. Phys. D 43, 264005 (2010). Article \n    \n                    Google Scholar Kruglyak, V. V., Demokritov, S. O. & Hillebrands, B. Magnonics. J. Phys. D 43, 264001 (2010). Article \n    \n                    Google Scholar Lenk, B., Ulrichs, H., Garbs, F. & Münzenberg, M. The building blocks of magnonics. Phys. Rep. 507, 107–136 (2011). Article \n    \n                    Google Scholar Grundler, D. Reconfigurable magnonics heats up. Nature Phys. 11, 438–441 (2015). Article \n    CAS \n    \n                    Google Scholar Chumak, A. V., Vasyuchka, V. I. & Hillebrands, B. Magnon spintronics. Nature Phys. 11, 453–461 (2015). Article \n    CAS \n    \n                    Google Scholar Vogt, K. et al. Spin waves turning a corner. Appl. Phys. Lett. 101, 042410 (2012). Article \n    \n                    Google Scholar Chumak, A. V., Serga, A. A. & Hillebrands, B. Magnon transistor for all-magnon data processing. Nature Commun. 5, 4700 (2014). Article \n    CAS \n    \n                    Google Scholar Vogt, K. et al. Realization of a spin-wave multiplexer. Nature Commun. 5, 3727 (2014). Article \n    CAS \n    \n                    Google Scholar Urazhdin, S. et al. Nanomagnonic devices based on the spin-transfer torque. Nature Nanotech. 9, 509–513 (2014). Article \n    CAS \n    \n                    Google Scholar Hertel, R., Wulfhekel, W. & Kirschner, J. Domain-wall induced phase shifts in spin waves. Phys. Rev. Lett. 93, 257202 (2004). Article \n    \n                    Google Scholar Bayer, C., Schultheiss, H., Hillebrands, B. & Stamps, R. Phase shift of spin waves traveling through a 180° Bloch-domain wall. IEEE Trans. Magn. 41, 3094–3096 (2005). Article \n    \n                    Google Scholar Kim, S.-K. et al. Negative refraction of dipole-exchange spin waves through a magnetic twin interface in restricted geometry. Appl. Phys. Lett. 92, 212501 (2008). Article \n    \n                    Google Scholar Macke, S. & Goll, D. Transmission and reflection of spin waves in the presence of Néel walls. J. Phys. Conf. Ser. 200, 042015 (2010). Article \n    \n                    Google Scholar Pirro, P. et al. Experimental observation of the interaction of propagating spin waves with Néel domain walls in a Landau domain structure. Appl. Phys. Lett. 106, 232405 (2015). Article \n    \n                    Google Scholar Saitoh, E., Miyajima, H., Yamaoka, T. & Tatara, G. Current-induced resonance and mass determination of a single magnetic domain wall. Nature 432, 203–206 (2004). Article \n    CAS \n    \n                    Google Scholar Garcia-Sanchez, F. et al. Narrow magnonic waveguides based on domain walls. Phys. Rev. Lett. 114, 247206 (2015). Article \n    \n                    Google Scholar Jorzick, J. et al. Spin wave wells in nonellipsoidal micrometer size magnetic elements. Phys. Rev. Lett. 88, 047204 (2002). Article \n    CAS \n    \n                    Google Scholar Sebastian, T. et al. Nonlinear emission of spin-wave caustics from an edge mode of a microstructured Co2Mn0.6Fe0.4Si waveguide. Phys. Rev. Lett. 110, 067201 (2013). Article \n    CAS \n    \n                    Google Scholar Rave, W. & Hubert, A. Magnetic ground state of a thin-film element. IEEE Trans. Magn. 36, 3886–3899 (2000). Article \n    \n                    Google Scholar Sebastian, T., Schultheiss, K., Obry, B., Hillebrands, B. & Schultheiss, H. Micro-focused Brillouin light scattering: imaging spin waves at the nanoscale. Front. Phys. 3, 35 (2015). Article \n    \n                    Google Scholar Demidov, V. E., Demokritov, S. O., Rott, K., Krzysteczko, P. & Reiss, G. Self-focusing of spin waves in permalloy microstripes. Appl. Phys. Lett. 91, 252504 (2004). Article \n    \n                    Google Scholar Schultheiss, H. et al. Observation of coherence and partial decoherence of quantized spin waves in nanoscaled magnetic ring structures. Phys. Rev. Lett. 100, 047204 (2008). Article \n    CAS \n    \n                    Google Scholar Vansteenkiste, A. et al. The design and verification of MuMax3. AIP Adv. 4, 107133 (2014). Article \n    \n                    Google Scholar Lee, K. S. & Kim, S. K. Conceptual design of spin wave logic gates based on a Mach–Zehnder-type spin wave interferometer for universal logic functions. J. Appl. Phys. 104, 053909 (2008). Article \n    \n                    Google Scholar Schneider, T., Serga, A. A., Hillebrands, B. & Kostylev, M. Spin-wave ferromagnetic film combiner as a NOT logic gate. J. Nanoelectron. Optoelectron. 3, 69–71 (2008). Article \n    \n                    Google Scholar Fassbender, J., Ravelosona, D. & Samson, Y. Tailoring magnetism by light-ion irradiation. J. Phys. D 37, R179 (2004). Article \n    CAS \n    \n                    Google Scholar Fassbender, J. & McCord, J. Magnetic patterning by means of ion irradiation and implantation. J. Magn. Magn. Mater. 320, 579–596 (2008). Article \n    CAS \n    \n                    Google Scholar Download references The authors acknowledge financial support from the Deutsche Forschungsgemeinschaft within programme SCHU 2922/1-1. K.S. acknowledges funding from the Helmholtz Postdoc Programme. A.K. thanks C.M. Schneider for providing the computational resources. Helmholtz-Zentrum Dresden–Rossendorf, Institute of Ion Beam Physics and Materials Research, Bautzner Landstraße 400, Dresden, 01328, Germany K. Wagner, A. Kákay, K. Schultheiss, A. Henschke, T. Sebastian & H. Schultheiss Technische Universität Dresden, Dresden, D-01062, Germany K. Wagner & H. Schultheiss You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar K.W., T.S., A.H. and H.S. designed the experiment. K.W. and T.S. prepared the samples. K.W. performed the BLS microscopy measurements and analysed the experimental data. K.W. and A.K. performed and evaluated the micromagnetic simulations. All authors interpreted and discussed the results and co-wrote the manuscript. Correspondence to\n                H. Schultheiss. The authors declare no competing financial interests. Supplementary information (PDF 210 kb) Supplementary Movie 1 (MOV 379 kb) Supplementary Movie 2 (MOV 244 kb) Reprints and Permissions Wagner, K., Kákay, A., Schultheiss, K. et al. Magnetic domain walls as reconfigurable spin-wave nanochannels.\n                    Nature Nanotech 11, 432–436 (2016). https://doi.org/10.1038/nnano.2015.339 Download citation Received: 02 August 2015 Accepted: 16 December 2015 Published: 01 February 2016 Issue Date: May 2016 DOI: https://doi.org/10.1038/nnano.2015.339 Anyone you share the following link with will be able to read this content: Sorry, a shareable link is not currently available for this article.  Provided by the Springer Nature SharedIt content-sharing initiative Scientific Reports (2023) Scientific Reports (2023) Journal of Superconductivity and Novel Magnetism (2023) Scientific Reports (2022) Communications Physics (2022) You have full access to this article via your institution.  Advertisement Nature Nanotechnology (Nat. Nanotechnol.)\n                \n\nISSN 1748-3395 (online)\n    \n\nISSN 1748-3387 (print) © 2023 Springer Nature Limited ",
    "datetime": null,
    "url": "https://www.nature.com/articles/nnano.2015.339"
}