{
    "title": "Magnetic coherent tunnel junctions with periodic grating barrier | Scientific Reports",
    "text": "Thank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\n            the best experience, we recommend you use a more up to date browser (or turn off compatibility mode in\n            Internet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles\n            and JavaScript. Advertisement Scientific Reports\nvolume 6, Article number: 24300 (2016)\n            Cite this article 2373 Accesses 8 Citations 1 Altmetric Metrics details A new spintronic theory has been developed for the magnetic tunnel junction (MTJ) with single-crystal barrier. The barrier will be treated as a diffraction grating with intralayer periodicity, the diffracted waves of tunneling electrons thus contain strong coherence, both in charge and especially in spin. The theory can answer the two basic problems present in MgO-based MTJs: (1) Why does the tunneling magnetoresistance (TMR) oscillate with the barrier thickness? (2) Why is the TMR still far away from infinity when the two electrodes are both half-metallic? Other principal features of TMR can also be explained and reproduced by the present work. It also provides possible ways to modulate the oscillation of TMR and to enhance TMR so that it can tend to infinity. Within the theory, the barrier, as a periodic diffraction grating, can get rid of the confinement in width, it can vary from nanoscale to microscale. Based on those results, a future-generation MTJ is proposed where the three pieces can be fabricated separately and then assembled together, it is especially appropriate for the layered materials, e.g., MoS2 and graphite and most feasible for industries. The tunneling magnetoresistance (TMR) was first studied theoretically and observed experimentally by Jullière in 1975 with magnetic tunneling junctions (MTJs) at low temperatures1. However, it can hardly be observed at room temperature until the MTJs with amorphous aluminum oxide (Al-O) barrier were fabricated in 19952,3. From then on, the TMR effect has been applied in magnetic sensors and memory devices and thus received considerable attention for the last twenty years4,5,6. Nevertheless, the Al-O-based MTJs can only exhibit a TMR ratio up to 80% because the Al-O barrier is amorphous and thus give rise to strong incoherent tunneling process6. This low TMR ratio seriously limits the feasibility of spintronics devices7. Butler et al.8 predicted theoretically that, if MgO is used to prepare the MTJ barrier, the TMR can acquire a very high value. The prediction was verified soon by S. S. P. Parkin et al.9 and S. Yuasa et al.10. Since then, the MgO-based MTJs have been widely investigated over the last decade11,12,13,14,15,16,17,18,19. Apart from the high TMR ratio, the MgO-based MTJs manifest many novel physical properties because the MgO barrier can be prepared into an ultrathin single-crystal film, especially by using molecular beam epitaxy (MBE)10,16. Of those novel properties, it is the most distinguished and puzzling that the parallel resistance (RP), antiparallel resistance (RAP) and TMR all oscillate with the barrier thickness, which is radically different from the case of the conventional MTJs with amorphous Al-O barrier where no oscillation is found20,21. The oscillation was first observed by Yuasa et al.10 in the study of a series of Fe(001)/MgO(001)/Fe(001) MTJs with barrier thickness varying from 1.2 nm to 3.2 nm and then reproduced by many research groups16,17,18,19. The experiments10,16,17,18,19 reveal that RP always exhibits only one period of oscillation. For RAP and TMR, the situation is somewhat different: They always exhibit a basic period of oscillation, too; but in some cases they can exhibit a secondary period of oscillation which is longer than the basic one, as reported in refs 16,19. Furthermore, the experiments indicate that the basic periods for RP, RAP and TMR are nearly the same. Finally, the amplitude of TMR is discovered to be 20% ~ 40% when the long period occurs, it becomes about 100% otherwise. Quite regrettably, the TMR oscillations can neither be explained by the above theory proposed by Butler et al., just as pointed out in refs 16,18, nor by other ordinary methods, such as ab-initio band structure22, Landauer formula23 and non-equilibrium Green’s function quantum transport calculations24,25. The physical mechanism for those oscillations has not been clarified as yet, to our knowledge. In order to interpret this puzzle, we would like to present a microscopic theory for the MTJ with single-crystal barrier. In this theory, the tunneling process will be regarded as the scattering of the electron wave by the periodic potential of the barrier. Physically, such scattering is identical to the diffraction of light through an optical grating. After the diffraction, the current of electrons, as the total scattering section, has the effect of space coherence. As will be seen in the following, it is this effect of space coherence that leads to the oscillations of RP, RAP and TMR with the barrier thickness. To begin with, let us consider a MTJ consisting of a thin single-crystal barrier. Physically, we will treat the barrier as a periodic potential, instead of the trapezoidal one as is used in the previous works26,27,28,29,30 where Al-O-based MTJs are involved. For the Al-O-barrier, it is amorphous so that the barrier potential is statistically smoothed by the disorders in the barrier. It is, therefore, rational to model the Al-O-barrier as a trapezoidal potential. But now, the barrier is single-crystal, the periodicity becomes fundamentally important because a periodic structure will cause strong effect of coherence to the electrons passing through it. As to the ferromagnetic (FM) electrodes, we will treat them, as usual, with the free-electron model26,27,28,29,30. Suppose that the atomic potential of the barrier is v(r) and that the total number of the layers of the barrier is n. Then, the periodic potential U(r) of the barrier can be written as where Rh is a two-dimensional lattice vector of the barrier: Rh = l1a1 + l2a2, with a1 and a2 being the primitive vectors of the atomic layers and l1 and l2 the corresponding integers. The a3 is the third primitive vector of the barrier, with l3 the corresponding integer. Letting ez = a1 × a2/|a1 × a2|, we shall set ez point from the upper electrode to the lower one, which is antiparallel to the direction of the tunneling current. Now, let us consider the case that the two FM electrodes are magnetically parallel. Suppose that a spin-up electron tunnels from the upper FM electrode into the lower one and occupies the spin-up state. The incident electron can be described by the plane wave as follows, where k denotes the wave vector. Physically, this incident wave will be diffracted coherently by the periodic potential of the barrier. As a result, the out-going waves arriving at the lower FM electrode, i.e., the so-called transmitted waves, will manifest strong effects of coherence. In order to elucidate the effects of coherence, we would employ the Bethe theory and the two-beam approximation, which are standard methods for the Laue case of transmission through a perfect, parallel-sided crystal plate31. According to those methods, the transmitted wave function ψ↑(r) can be obtained as follows, where Schematically, this diffraction process can be illustrated as in Fig. 1. In deriving equation (3), we have supposed that the two FM electrodes are the same. Here, kh is the normal projection of the incident wave vector k on the plane spanned by a1 and a2. As to v(Kh), it represents the Fourier transform of v(r):  where Ω is the volume of the primitive cell of the barrier: Ω = (a1 × a2) · a3 and Kh a planar vector reciprocal to the intralayer lattice vectors Rh. Physically, each incident wave vector k will correspond to one reciprocal vector Kh such that the magnitude of the planar vector kh + Kh is minimal. By using the out-going wave ψ↑(r), the transmission coefficient for the spin-up to spin-up tunneling can be calculated as follows, The diagrammatic sketch of the diffraction process where the incident electron is spin-up. where kz = k · ez, , , r = x1a1 + x2a2 + dez with d being the width of the barrier and Sh is the cross sectional area of the barrier. To perform the integral above, we have employed the so-called Born-von Karman boundary condition. It is easy to know that the term  arises physically from the interference between the component waves exp(ip+ · r) and exp(ip− · r), it will oscillate with the barrier width d if  and  are both real. Similar statements hold for the other three terms in the square brackets of equation (6). It will be seen in the following that it is just those interference terms that are responsible for the oscillations of RP, RAP and TMR. From T↑↑, the conductance G↑↑ of zero bias voltage at zero temperature can be written as26,27,28 where e denotes the electron charge, θ the angle between k and ez, φ the angle between kh and a1 and kF↑ the Fermi wave vector of the spin-up electrons: with m being the electron mass and μ and Δ the chemical potential and half the exchange splitting of the FM electrodes, respectively. The other three conductances, G↑↓, G↓↑ and G↓↓, can be obtained similarly. With them, one can obtain GP = G↑↑ + G↓↓, GAP = G↑↓ + G↓↑, ,  and TMR = GP/GAP − 1 = RAP/RP − 1. From now on, we shall apply the above formalism to the case of MgO-based MTJs. The lattice of MgO crystal is simple cubic, viz., a1 ⊥ a2, a2 ⊥ a3, a3 ⊥ a1 and a1 = a2 = a3, therefore, ez ‖ a3. It can be easily seen that (Qh, 0, 0) should be chosen for the incident vector k with φ ∈ [−π/4, π/4] where Qh = 2π/a1. Analogously, the (0, Qh, 0), (−Qh, 0, 0) and (0, −Qh, 0) should be chosen for the k with φ ∈ [π/4, 3π/4], [3π/4, 5π/4] and [5π/4, 7π/4], respectively. Due to the planar symmetry, the contributions to the tunneling current from the four intervals of the angle φ are the same. Therefore, it is enough for us to consider the interval [−π/4, π/4]. As a result, there are only four model parameters needed for the application of the present theory to the MgO-based MTJs: the magnitude of the reciprocal vector Kh (Kh = (Qh, 0, 0)), the Fourier transform of the periodic potential of the barrier v(Kh), the chemical potential μ and half the exchange splitting Δ of the FM electrodes. According to the data in ref. 32, Kh = 2π/a1 = 2.116 × 1010 m−1. In order to determine v(Kh), let us first discuss which property of material the parameter v(Kh) can be correlated with. As pointed out in ref. 31, the two-beam model is almost exactly the same as the nearly free electron approximation for solids, the main difference between them lies in that the aim of the former is to establish the wave vectors and amplitudes of the diffracted beams rather than to establish the energy levels of the system as does in the latter. What is the most important is that both of them contain v(Kh). As well-known, v(Kh) is proportional to the energy gap of bands in the nearly free electron approximation. That is to say, the parameter v(Kh) should be approximately proportional to the energy gap, in physics. Since the energy gap of MgO crystal is about 8 eV33, we shall set v(Kh) = 16 eV in this paper for the comparison of the theory with the experiments. As to the other two parameters, μ and Δ, they are both independent of the MgO barrier and thus should be determined by the FM electrodes. For different FM electrodes, they will get different values. The typical case is Fe electrodes, its μ is 11.1 eV34. As to the Δ, it can be figured out from the μ and the spin polarization by using Hubbard model. According to the data of refs 35, 36, 37, it can be estimated to be about 8.2 eV, i.e., Δ ≈ 8.2 eV. Therefore, we shall in this paper let the chemical potential μ take on values from 10 eV to 13 eV and the exchange splitting Δ take on values from 7 eV to 10 eV, so as to compare the theoretical results with the experiments on MTJs with different FM electrodes. First, we would like to investigate the dependence of RP, RAP and TMR on the thickness d of MgO barrier. The results are shown in Figs 2 and 3 where μ and Δ are fixed respectively to be 11 eV and 9 eV. In Fig. 2, Δ varies from 7 eV to 10 eV. By contrast, μ will vary from 10 eV to 13 eV in Fig. 3. Here, the barrier width d has been extended from discrete values to continuous real numbers through equation (6). As stated above, the most fundamental feature discovered by the experiments is that all the RP, RAP and TMR oscillate with the barrier thickness. Both Figs 2 and 3 show that this feature is confirmed by the theoretical results, clearly and completely. Within the framework of the present theory, the mechanism for the oscillations can be analyzed as follows: When some of the wave numbers  and  change from real to imaginary, the transmission coefficient T↑↑ will change from oscillating to damping with the barrier thickness. As a result, there will exist two kinds of integral regions for the channel of T↑↑: On the first kind of region, T↑↑ contains oscillating term  or . On the other kind of region, it contains neither  nor . For the other three channels, i.e., T↑↓, T↓↑ and T↓↓, the situations are the same. We find through the numerical analysis that the oscillation of RP origins basically from the oscillating term of  that belongs to the channel of T↑↑. Similarly, the oscillation of RAP origins basically from the oscillating term of  that belongs to the channel of T↓↑. As mentioned above, the oscillating terms of  and  stand for the interference between the waves of q+ and q− and that of  and , respectively. Physically, this interference arises from the diffraction of the tunneling electrons by the periodic potential of single-crystal barrier. That is to say, it is the coherent diffraction of electrons by the periodic potential that is actually the physical mechanism for the oscillations. Thickness dependence of TMR, RP and RAP with the variation of Δ. (a) TMR, (b) RP and (c) RAP as functions of barrier thickness d where Kh = 2.116 × 1010 m−1, v(Kh) = 16 eV and μ = 11 eV. The curves A, B, C and D correspond to Δ = 10 eV, 9 eV, 8 eV and 7 eV, respectively. The data corresponding to the discrete layers of the grating barrier are marked with open symbols: curve A is marked by open circle, curve B is marked by open square, curve C is marked by open triangle and curve D is marked by open star. Here, the inset is an enlarged view of the curves C and D. Thickness dependence of TMR, RP and RAP with the variation of μ. (a) TMR, (b) RP and (c) RAP as functions of barrier thickness d where Kh = 2.116 × 1010 m−1, v(Kh) = 16 eV and Δ = 9 eV. The curves A, B, C and D correspond to μ = 10 eV, 11 eV, 12 eV and 13 eV, respectively. The data corresponding to the discrete layers of the grating barrier are marked with open symbols: curve A is marked by open circle, curve B is marked by open square, curve C is marked by open triangle and curve D is marked by open star. Now, we proceed to interpret the details of the oscillations. As mentioned above, the oscillations of RP and RAP origin from the terms of  and , respectively and thus  and  are their frequencies of oscillation. With the changes in the incident wave vectors k↑ and k↓, both  and  will vary and thus form two frequency bands for GP and GAP, respectively. Obviously, the periods of oscillations depend on the structures of the frequency bands, which can be described by the spectral densities  and , where H(x) is the Heaviside function. The numerical results for  and  are shown respectively in Fig. 4(a,b), which correspond to the cases of Fig. 2. The situations for Fig. 3 are similar. Spectral densities. (a)  and (b)  as functions of the oscillating frequency ω where Kh = 2.116 × 1010 m−1, v(Kh) = 16 eV and μ = 11 eV. The curves A, B, C and D correspond to Δ = 10 eV, 9 eV, 8 eV and 7 eV, respectively. Here, the dashed lines denote the von Hove singularities, the inset is an enlarged view of the curves C and D. Figure 4(a) demonstrates that  can be approximated as a narrow peak plus a straight segment. As well-known, the peak will provide principally one frequency, say ω0, to GP. In addition, it is easy to know by direct integration that the function with a finite high-frequency band and a linear spectral density will look as if it has merely two frequencies on the domain where its variable is quite large: one is the band bottom, the other is the band top. So does the present case, the straight segment will contribute two frequencies to GP, but one of them is zero because  vanishes at the right endpoint of the segment. The rest nonzero one, say ω1, is equal to the frequency of the left endpoint of the segment. In sum, there will exist mainly two frequencies for the oscillations of GP, i.e., ω0 and ω1. However, as indicated by Fig. 4(a), ω0 and ω1 are very close to each other. This implies that the modulation frequency of the resultant oscillation is rather small. Or equivalently, the modulation period will be much longer than the basic period which is about 4π/(ω0 + ω1), as can be seen from Fig. 2(b). For the experiments up to now16,18, the varying range of the barrier thickness is approximately 1.2 nm, which is too narrow for the modulation period to be observed. That explains why only one single period for RP has been reported by the experiments16,18. As to , it can be further simplified as follows:  where ,  and θ are all the functions of ω. From this formula, one can easily know that, when Δ > v(Kh)/2,  will get a von Hove singularity, which is at the band top where θ = π/2. The corresponding results are depicted in the curves A and B of Fig. 4(b). In this case,  can also be approximated as a peak plus a straight segment, the peak comes from the singularity. Of course, the singularity contributes one frequency, say ωs, to GAP. The straight segment will, as before, contribute principally two frequencies, say ωl and ωr, to GAP where ωl and ωr are equal to the frequencies of the left and right endpoints of the segment, respectively. Therefore, there exist now mainly three frequencies, ωs, ωl and ωr. In the case of narrow band, e.g., the curve A, the three frequencies are nearly the same, so only one single period can be observed experimentally for RAP. In the case of wide band, e.g., the curve B, only ωs and ωr are close to each other, but ωl is far away, the three frequencies will be seen as two in the experiments. When Δ ≤ v(Kh)/2, there is no von Hove singularity in . In this case,  is nearly a linear function of ω, as shown in the curves C and D of Fig. 4(b). If Δ = v(Kh)/2,  where ωM is the maximal frequency of the band. Otherwise, . This implies that there are mainly two frequencies in GAP when Δ = v(Kh)/2 and one frequency when Δ < v(Kh)/2. All in all, there can exist one or two periods for RAP, which is in agreement with the experiments16,18. Finally, the TMR, as the ratio of RP and RAP, will exhibit mainly one or two periods. Within the range of present parameters, the basic period of TMR distributes on the interval of [0.28 nm, 0.31 nm], which is in agreement with the experimental data, from 0.28 nm to 0.32 nm10,16,17,18,19. In particular, the numerical results show that the basic periods of RP, RAP and TMR are nearly the same, with the relative error less than 4.1%, which is also in agreement with the points of view of refs 16,18. As for the amplitudes, equation (9) indicates that the amplitude of GP will increase with the sum . From equation (5), it can be seen that the sum  increases with the parameter μ + Δ. Therefore, the amplitude of GP will increase with the parameter μ + Δ. Numerical analysis shows that, the larger the amplitude of GP, the larger the amplitude of RP, which means that, the larger the parameter μ + Δ is, the larger the amplitude of RP will be. Similarly, the smaller the difference μ − Δ, the larger the amplitude of RAP. Those properties are shown clearly in Figs 2 and 3. Experimentally, the amplitude of TMR is about 100% in the case with only one period and 20% ~ 40% in the case with another long period16,18,19. Evidently, those facts are included in the present theoretical results, as displayed in Figs 2 and 3. Secondly, we would like to investigate the influence of the parameter v(Kh). The theoretical results are shown in Fig. 5 where v(Kh) is set sequentially as 12 eV, 16 eV and 20 eV while μ and Δ are fixed to be 11 eV and 10 eV, respectively. Figure 5(a) demonstrates that both the amplitude and period of GP increase with decreasing v(Kh). That is because the sum  in equation (9) will increase, but the difference  in the interference term of  decrease, with decreasing v(Kh). Similar statements and analyses are valid for GAP, too. The distinction between GP and GAP lies in their direct-current components: For GP, the direct-current component is weakly dependent on the variation of v(Kh). Nevertheless, that of GAP increases strongly with the increase of v(Kh). As a consequence of those results, the amplitude and period of TMR will both increase with decreasing v(Kh), which is depicted in Fig. 5(c). As has been pointed out above, the parameter v(Kh) is approximately proportional to the energy gap of bands. Therefore, if the MgO barrier is replaced by a semiconductor with smaller (or larger) energy gap, both the amplitude and period of TMR will become larger (or smaller). This demonstrates that the oscillation of TMR can be modulated through the gap of barrier, both in frequency and in amplitude. Here, it should be emphasized, in particular, that the barrier with a small gap is especially favourable for the TMR to get a large amplitude. Now, consider the layered semiconductor MoS2, its intralayer gap is about 1.9 eV38. So, if a MTJ has MoS2 as the barrier, its TMR is very believable to acquire a much higher amplitude than those of the MTJs with MgO barrier, which can be used to verify the present theory in the future. Thickness dependence of GP, GAP and TMR with the variation of v(Kh). (a) GP, (b) GAP and (c) TMR as functions of barrier thickness d where Kh = 2.116 × 1010 m−1, μ = 11 eV and Δ = 10 eV. The curves A, B and C correspond to v(Kh) = 12 eV, 16 eV and 20 eV, respectively. The data corresponding to the discrete layers of the grating barrier are marked with open symbols: curve A is marked by open circle, curve B is marked by open square and curve C is marked by open triangle. Thirdly, we shall discuss the TMR for the MTJ using half-metallic electrodes where the spin is fully polarized. In conventional theories1,8,26,27,28,29,30, the TMR will become nearly infinite near zero bias and at low temperature when both electrodes are fully spin-polarized, just as pointed out in ref. 39. Physically, that is because, in conventional theories, the energy of each tunneling electron is conserved and thus there will exist no spin-down state for the incident spin-up electron to occupy, i.e. GAP = G↑↓ = 0. Unfortunately, this result is contrary to the experiments up to now17,40,41,42 where the TMR is much far away from infinity. In two-beam approximation, the electron waves pass directly from the barrier into the lower electrode, unchanged except that the barrier wave vectors become the lower-electrode wave vectors31. Evidently, such treatment belongs physically to the so-called sudden approximation43. As a result, the energy of the tunneling electron can be non-conserved. For example, the transmitted component waves with p+ and q+ acquire an energy of v(Kh) and those with p− and q− lose an energy of v(Kh), as can be seen from the equations (3, 4, 5). Due to this nonconservation, the incident spin-up electrons can transit into the spin-down band of the lower electrode, with a probability of 50% or so, if v(Kh) > Δ − μ, which is depicted in Fig. 6. That implies G↑↓ ≠ 0 if v(Kh) > Δ − μ. In other words, when v(Kh) > Δ − μ, the TMR will still be finite other than infinite, i.e., TMR = G↑↑/G↑↓ − 1  Δ − μ or not. As stated above, the energy gap of MgO is 8 eV, it is rather large and thus can satisfy quite easily the condition: v(Kh) > Δ − μ. That may be the physical reason why the TMR for the experiments up to now17,40,41,42 is much far away from infinity. Of course, if the barrier could be fabricated by the single crystal with an energy gap small enough, the TMR would tend to infinity. As such candidates, people can naturally consider the common semiconductors, such as Ge, InN, InAs, MoS2, etc. Here, we would, in particular, suggest the α graphite44,45 which are stacked by graphene planar layers. As well-known, the graphene layers are linked just through a weak van der Walls interaction, so the interlayer conductivity is much little and thus can be neglected and regarded as insulating. Observe that graphene is a zero-gap semiconductor, with the conduction and valence bands meeting at the Dirac points. If a thin film of the multilayer of graphene cleaved out of α graphite is used as the barrier, one has v(Kh) = 0 immediately. Therefore, the condition v(Kh) < Δ − μ can always be satisfied, which means that, if a MTJ forms of two half-metallic electrodes and a graphite barrier, its TMR can approach infinity. It is both a prediction to verify the present theory and a suggestion for manufactories to assemble MTJs in a simple way. This simple way is also suitable for the MoS2 nano-film, which has been discussed above. The diagrammatic sketch of the diffraction process for the antiparallel case where the two electrodes are both half-metallic. Here, v(Kh) > Δ − μ, the incident spin-up electron can transit into the spin-down band of the lower electrode. Finally, there is another radical difference between the usual theories1,8,26,27,28,29,30 and the present one. For the former, the transmission coefficient decreases exponentially with the barrier width so that the tunneling will disappear thoroughly as the barrier gets quite thick, e.g., thicker than 50 nm. For the latter, the tunneling electrons will move within a periodic potential constructed by the barrier. As well-known, the waves will be formed into band structure within a periodic potential and thus can be transported very far away. Back to the present case, according to the two-beam approximation, the tunneling electrons will form two narrow bands within the periodic barrier, which arise respectively from the states near the two Fermi surfaces of the upper FM electrode. Just as in the Laue case of electron diffraction, it is not difficult to know that there always exist a large amount of travelling waves in those two bands even if the thickness of the periodic barrier goes into the range of 1 μm ~ 1 mm. This means that the oscillating GP, GAP and TMR can be maintained for the MTJ with a barrier thicker than 1 μm. Nowadays, single-crystal semiconductor sheets of thickness ranging from 1 μm to 1 mm can be readily made in industries. Those analyses suggest that the width of crystalline barrier can get rid of the confinement of nanoscale and goes into microscale, not theoretically but also technologically. As a consequence, a MTJ with the periodic grating barrier of thickness within 1 μm ~ 1 mm can be simply synthesized by direct sandwiching of a single-crystal semiconductor sheet between two FM electrodes rather than by MBE growing of the barrier. It is a novel design of MTJ that will work on electron diffraction, take advantage of the coherence of tunneling electron waves, be more appropriate for the materials with a layered, planar structure, such as MoS238 and graphite44,45, and, in particular, be most feasible for industries. In summary, this paper has developed a new spintronic theory. Physically, it is founded on the optical diffraction theory and thus particularly suitable for the MTJs with a single-crystal barrier which plays a role of periodic optical grating. In consequence, there will appear strong coherence among the diffracted waves of tunneling electrons. It is just this coherence that is responsible for the oscillations of the RP, RAP and TMR with the barrier thickness. As such, the theory can well interpret the experiments on the MgO-based MTJs: (1) There exists nearly a common period among the RP, RAP and TMR in all the cases. (2) The RAP and TMR can show another long period of oscillation in some cases. (3) The amplitude of TMR is about 100% in the case that there is only one period and is 20% ~ 40% in the case that there is another long period. In particular, the theory shows that, the smaller the in-plane energy gap of the barrier material, the larger the amplitude and period of the TMR will be, which implies that MoS2 and graphite would be more favorable than MgO as a barrier for MTJs. Besides, the present theory can explain the puzzle why the TMR is still far away from infinity when the two electrodes are both half-metallic and suggests further a possible way to enhance the TMR so that it could tend to infinity. Finally, a future-generation MTJ is proposed, it is a triplet of two FM electrodes plus a single-crystal barrier, the three members can be fabricated separately and then assembled together and encapsuled in a unit, the barrier can vary from nanoscale to microscale in width. We believe that such an architecture can take advantage of the coherence of tunneling electrons, is especially appropriate for the layered materials, e.g., MoS2 and graphite and most feasible for industries. By the way, there are many important and interesting effects that are highly correlated with the oscillations of TMR, such as bias effect10,18, temperature effect9, impurity effect46, etc. The studies of these effects are in progress and will be published in future. How to cite this article: Fang, H. et al. Magnetic coherent tunnel junctions with periodic grating barrier. Sci. Rep. 6, 24300; doi: 10.1038/srep24300 (2016). Julllière, M. Tunneling between ferromagnetic films. Phys. Lett. 54A, 225–226 (1975). Article \n    ADS \n    \n                    Google Scholar Miyazaki, T. & Tezuka, N. Giant magnetic tunneling effects in Fe/Al2O3/Fe junction. J. Magn. Magn. Mater. 139, L231–L234 (1995). Article \n    CAS \n    ADS \n    \n                    Google Scholar Moodera, J. S., Kinder, L. R., Wong, T. M. & Meservey, R. Large magnetoresistance at room-temperature in ferromagnetic thin-film tunnel-junctions. Phys. Rev. Lett. 74, 3273–3276 (1995). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Han, X. F., Oogane, M., Kubota, H., Ando, Y. & Miyazaki, T. Fabrication of high-magnetoresistance tunnel junctions using Co75.Fe25 ferromagnetic electrodes. Appl. Phys. Lett. 77, 283–285 (2000). Article \n    CAS \n    ADS \n    \n                    Google Scholar Han, X. F. & Miyazaki, T. Effects of annealing on high-magnetoresistance tunnel junctions using Co75.Fe25 ferromagnetic electrodes. J. Mater. Sci. Technol. 16, 549–553 (2000). CAS \n    \n                    Google Scholar Wei, H. X., Qin, Q. H., Ma, M., Sharif, R. & Han, X. F. 80% tunneling magnetoresistance at room temperature for thin Al-O barrier magnetic tunnel junction with CoFeB as free and reference layers. J. Appl. Phys. 101, 09B501 (2007). Article \n    CAS \n    \n                    Google Scholar Han, X. F., Ali, S. S. & Liang, S. H. MgO(001) barrier based magnetic tunnel junctions and their device applications. Sci. China-Phys. Mech. Astron. 56, 29–60 (2013). Article \n    CAS \n    ADS \n    \n                    Google Scholar Butler, W. H., Zhang, X.-G., Schulthess, T. C. & MacLaren, J. M. Spin-dependent tunneling conductance of Fe/MgO/Fe sandwiches. Phys. Rev. B 63, 054416 (2001). Article \n    ADS \n    CAS \n    \n                    Google Scholar Parkin, S. S. P. et al. Giant tunnelling magnetoresistance at room temperature with MgO (100) tunnel barriers. Nat. Mater. 3, 862–867 (2004). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Yuasa, S., Nagahama, T., Fukushima, A., Suzuki, Y. & Ando, K. Giant room-temperature magnetoresistance in single-crystal Fe/MgO/Fe magnetic tunnel junctions. Nat. Mater. 3, 868–871 (2004). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Ikeda, S. et al. Tunnel magnetoresistance of 604% at 300 K by suppression of Ta diffusion in CoFeB/MgO/CoFeB pseudo-spin-valves annealed at high temperature. Appl. Phys. Lett. 93, 082508 (2008). Article \n    ADS \n    CAS \n    \n                    Google Scholar Fuchs, G. D. et al. Spin torque, tunnel-current spin polarization and magnetoresistance in MgO magnetic tunnel junctions. Phys. Rev. Lett. 96, 186603 (2006). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Kubota, H. et al. Quantitative measurement of voltage dependence of spin-transfer torque in MgO-based magnetic tunnel junctions. Nat. Phys. 4, 37–41 (2008). Article \n    CAS \n    \n                    Google Scholar Deac, A. M. et al. Bias-driven high-power microwave emission from MgO-based tunnel magnetoresistance devices. Nat. Phys. 4, 803–809 (2008). Article \n    CAS \n    \n                    Google Scholar Jia, X. T., Xia, K. & Bauer, G. E. W. Thermal spin transfer in Fe-MgO-Fe tunnel junctions. Phys. Rev. Lett. 107, 176603 (2011). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Matsumoto, R. et al. Oscillation of giant tunneling magnetoresistance with respect to tunneling barrier thickness in fully epitaxial Fe/MgO/Fe magnetic tunnel junctions. Appl. Phys. Lett. 90, 252506 (2007). Article \n    ADS \n    CAS \n    \n                    Google Scholar Ishiwaka, T., Hakamata, S., Matsuda, K. I., Uemura, T. & Yamamoto, M. Fabrication of fully epitaxial Co2MnSi/MgO/Co2MnSi magnetic tunnel junctions. J. Appl. Phys. 103, 07A919 (2008). Article \n    CAS \n    \n                    Google Scholar Marukame, T. et al. Giant oscillations in spin-dependent tunneling resistances as a function of barrier thickness in fully epitaxial magnetic tunneling junctions with a MgO barrier. Phys. Rev. B 81, 134432 (2010). Article \n    ADS \n    CAS \n    \n                    Google Scholar Wang, W. H. et al. Coherent tunneling and giant tunneling magnetoresistance in Co2FeAl/MgO/CoFe magnetic tunneling junctions. Phys. Rev. B 81, 140402(R) (2010). Article \n    ADS \n    CAS \n    \n                    Google Scholar Song, J. O., Lee, S. R. & Shin, H. J. Influence of thickness and band structure of insulating barriers on resistance and tunneling magnetoresistance properties of magnetic tunnel junctions with Al-oxide and Ti-alloyed Al-oxide barriers. Curr. Appl. Phys. 7, 18–20 (2007). Article \n    ADS \n    \n                    Google Scholar Chen, Y. T., Jen, S. U., Tsai, T. L., Huang, C. Y. & Yao, Y. D. Magnetostriction and tunneling magnetoresistance of CoFeB/AlOx/Co/IrMn junctions. J. Appl. Phys. 103, 07A901 (2008). Article \n    CAS \n    \n                    Google Scholar Autès, G., Mathon, J. & Umerski, A. Theory of resonant spin-dependent tunneling in an Fe/Ag/MgO/Fe(001) junction. Phys. Rev. B 80, 024415 (2009). Article \n    ADS \n    CAS \n    \n                    Google Scholar Itoh, H., Ozeki, J. & Inoue, J. Effects of disorder on tunnel magnetoresistance in Fe/MgO/Fe junctions. J. Magn. Magn. Mater. 303, E205–E207 (2006). Article \n    CAS \n    ADS \n    \n                    Google Scholar Sahadevan, A. M. et al. Biaxial strain effect of spin dependent tunneling in MgO magnetic tunnel junctions. Appl. Phys. Lett. 101, 042407 (2012). Article \n    ADS \n    CAS \n    \n                    Google Scholar Loong, L. M. et al. Strain-enhanced tunneling magnetoresistance in MgO magnetic tunnel junctions. Sci. Rep. 4, 6505 (2014). Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Slonczewski, J. C. Conductance and exchange coupling of two ferromagnets seperated by a tunneling barrier. Phys. Rev. B 39, 6995–7002 (1989). Article \n    CAS \n    ADS \n    \n                    Google Scholar Li, F. F. et al. Bias dependence and inversion of the tunneling magnetoresistance in ferromagnetic junctions. Phys. Rev. B 69, 054410 (2004). Article \n    ADS \n    CAS \n    \n                    Google Scholar Ren, Y., Li, Z. Z., Xiao, M. W. & Hu, A. Oscillation effect and sign-change behaviour of the bias-dependent tunnelling magnetoresistance in ferromagnetic junctions. J. Phys.: Condens. Matter 17, 4121–4134 (2005). CAS \n    ADS \n    \n                    Google Scholar Davis, A. H. & Maclaren, J. M. Spin dependent tunneling at finite bias. J. Appl. Phys. 87, 5224–5226 (2000). Article \n    CAS \n    ADS \n    \n                    Google Scholar Moodera, J. S. & Kinder, L. R. Ferromagnetic-insulator-ferromagnetic tunneling: Spin-dependent tunneling and large magnetoresistance in trilayer junctions. J. Appl. Phys. 79, 4724–4729 (1996). Article \n    ADS \n    \n                    Google Scholar Cowley, J. M. Diffraction Physics 3rd edn (Elsevier, Amsterdam, 1995). Donnay, J. D. H. & Ondik, H. M. (eds) Crystal Data Determinate Tables (US Department of Commerce, Washington, DC, 1973). Miao, G. X. et al. Inelastic tunneling spectroscopy of magnetic tunnel junctions based on CoFeB/MgO/CoFeB with Mg insertion layer. J. Appl. Phys. 99, 08T305 (2011). Article \n    CAS \n    \n                    Google Scholar Ashcroft, N. W. & Mermin, N. D. Solid State Physics (Cengage Learning, Fort Worth, 1976). Tedrow, P. M. & Meservey, R. Spin polarization of electrons tunneling from films of Fe, Co, Ni and Gd. Phys. Rev. B 7, 318–326 (1973). Article \n    CAS \n    ADS \n    \n                    Google Scholar Moodera, J. S. & Mathon, G. Spin polarized tunneling in ferromagnetic junctions. J. Magn. Magn. Mater. 200, 248–273 (1999). Article \n    CAS \n    ADS \n    \n                    Google Scholar Sicot, M. et al. Polarization of Fe(001) covered by MgO analyzed by spin-resolved x-ray photoemission spectroscopy. Phys. Rev. B 68, 184406 (2003). Article \n    ADS \n    CAS \n    \n                    Google Scholar Ganatra, R. & Zhang, Q. Few-Layer MoS2: A Promising Layered Semiconductor. ACS Nano 8, 4074–4099 (2014). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Fabian, J., Matos-Abiague, A., Ertler, C., Stano, P. & Žutić, I. Semiconductor spintronics. Acta Phys. Slovaca 57, 565–907 (2007). Article \n    CAS \n    ADS \n    \n                    Google Scholar Tezuka, N., Ikeda, N., Mitsuhashi, F. & Sugimoto, S. Improved tunnel magnetoresistance of magnetic tunnel junctions with Heusler Co2FeAl0.5Si0.5 electrodes fabricated by molecular beam epitaxy. Appl. Phys. Lett. 94, 162504 (2009). Article \n    ADS \n    CAS \n    \n                    Google Scholar Liu, H. X. et al. Giant tunneling magnetoresistance in epitaxial Co2MnSi/MgO/Co2MnSi magnetic tunnel junctions by half metallicity of Co2MnSi and coherent tunneling. Appl. Phys. Lett. 101, 132418 (2012). Article \n    ADS \n    CAS \n    \n                    Google Scholar Yamamoto, M. et al. Effect of defects in Heusler alloy thin films on spin-dependent tunnelling characteristics of Co2MnSi/MgO/Co2MnSi and Co2MnGe/MgO/Co2MnGe magnetic tunnel junctions. J. Phys.: Condens. Matter 22, 164212 (2010). ADS \n    \n                    Google Scholar Schiff, L. I. Quantum Mechanics 3rd edn (McGraw-Hill, New York, 1968). Chung, D. D. L. Review graphite. J. Mater. Sci. 37, 1475–1489 (2002). Article \n    CAS \n    ADS \n    \n                    Google Scholar Castro Neto, A. H., Guinea, F., Peres, N. M. R., Novoselov, K. S. & Geim, A. K. The electronic properties of graphene. Rev. Mod. Phys. 81, 109–162 (2009). Article \n    CAS \n    ADS \n    \n                    Google Scholar Shin, I. J., Min, B. C., Hong, J. P. & Shin, K. H. Effects of Ru diffusion in exchange-biased MgO magnetic tunnel junctions prepared by in situ annealing. Appl. Phys. Lett. 95, 222501 (2009). Article \n    ADS \n    CAS \n    \n                    Google Scholar Download references This work is supported by the State Key Program for Basic Research of China (2014CB921101), the Nature Science of Foundation of Jiangsu province (BK20130866), the National Natural Science Foundation of China (61574079, 51471085, 51331004), the University Nature Science Research Project of Jiangsu province (14KJB510020), the NUPTSF (NY213025, NY215083). Nanjing University of Posts and Telecommunications, Nanjing, 210023, China Henan Fang & Zhikuo Tao Department of Physics, Nanjing University, Nanjing, 210093, China Mingwen Xiao, Wenbin Rui & Jun Du Collaborative Innovation Center of Advanced Microstructures, Nanjing University, Nanjing, 210093, China Jun Du You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar M.X. and H.F. conceived the project. H.F. carried out the calculations. M.X. led the analysis. H.F., M.X. and J.D. wrote the paper. H.F., W.R. and Z.T. contributed to the preparation of the figures. M.X. supervised the study. The authors declare no competing financial interests. This work is licensed under a Creative Commons Attribution 4.0 International License. The images or other third party material in this article are included in the article’s Creative Commons license, unless indicated otherwise in the credit line; if the material is not included under the Creative Commons license, users will need to obtain permission from the license holder to reproduce the material. To view a copy of this license, visit http://creativecommons.org/licenses/by/4.0/ Reprints and Permissions Fang, H., Xiao, M., Rui, W. et al. Magnetic coherent tunnel junctions with periodic grating barrier.\n                    Sci Rep 6, 24300 (2016). https://doi.org/10.1038/srep24300 Download citation Received: 27 April 2015 Accepted: 23 March 2016 Published: 11 April 2016 DOI: https://doi.org/10.1038/srep24300 Anyone you share the following link with will be able to read this content: Sorry, a shareable link is not currently available for this article.  Provided by the Springer Nature SharedIt content-sharing initiative By submitting a comment you agree to abide by our Terms and Community Guidelines. If you find something abusive or that does not comply with our terms or guidelines please flag it as inappropriate. Advertisement Scientific Reports (Sci Rep)\n                \n\nISSN 2045-2322 (online) © 2023 Springer Nature Limited Sign up for the Nature Briefing newsletter — what matters in science, free to your inbox daily. ",
    "datetime": null,
    "url": "https://www.nature.com/articles/srep24300"
}