{
    "title": "Making big waves: How K-pop swelled into cultural superpower - Asia News NetworkAsia News Network",
    "text": "Not only is K-pop a tool behind the country’s national branding, but it can also be an olive branch. Park Jun-heeThe Korea Herald \n\n\t\t\t\t\t\t\t\tView all posts by Park Jun-hee → The Korea Herald View all posts by Park Jun-hee → K-pop group BTS pose during 76th United Nations General Assembly held in New York on Sept. 20, 2021 (Big Hit Music) November 17, 2022 SEOUL – The Washington Post called it a “cultural force” — from welcoming the US presidential couple to representing the country at the Olympic Games — K-pop has become pervasive now beyond the realm of the entertainment industry. K-pop idol groups have communicated with the world through song, and their milestones at both local and international levels indicate Korea might have found a new resource for diplomacy. In a recent exclusive interview with The Rolling Stone, RM of BTS opened up about becoming a social figure and taking part in international events. “A K-pop group spoke at the UN and met presidents. I think I was really confused about ‘who am I.’ Am I a diplomat, or what?” he questioned. Although RM said he felt dubious about his role, it’s no secret that K-pop is not a one-off act. At the heart of the growing Hallyu fever, or Korean Wave, Korean pop music isn’t just a musical genre. It has become part of South Korea’s statecraft in recent years, with its horizon swelling to cultural and public diplomacy. The former Moon Jae-in administration’s appointment of BTS as a special presidential envoy last year was a watershed moment. Unlike the traditional formula that envoys can only be accredited to those who rank between ambassadors and high-ranked officials, Moon gave BTS the political power to deliver Korea’s messages to the international community. BTS embraced their new diplomatic role by attending the 76th United Nations General Assembly as South Korea’s official delegation. The group performed “Permission to Dance” and delivered speeches on behalf of youth and future generations. “K-pop has garnered many people’s interest in learning the language and visiting the country. It may help at first, but it’s the Korean people, culture, society and foremost the government’s responsibility to bring that interest to the next step,” said Lee Hye-jin, a communications professor at the University of Southern California. Piggybacking on the growing interest in South Korea, a Modern Language Association report showed that the Korean language uptake in US universities rose by 14 percent between 2013 and 2016. The surge in data also showed that the language-learning desire is a crucial part of a globalized fan base with wanting to connect to K-pop idols on a deeper level. According to the survey on National Image 2021 commissioned by the Korean Culture and Information Service, 80.5 percent of foreigners had a positive image of Korea in 2021, showing a 2.4 percent increase compared to 2020. The respondents justified their answers by identifying Korea’s culture, like K-pop, as a “salient” force behind their positive image of the country. Exo and CL of the now-disbanded 2NE1 highlighted South Korea’s aesthetics at the Pyeongchang 2018 Olympic Games closing ceremony, where the two singers performed songs based on ideas of inclusion and harmony. Kai of Exo performed solo while donning a flowing hanbok, traditional Korean attire. K-pop group Exo poses with Harry Harris, former US ambassador to South Korea, and Ivanka Trump, former White House adviser, during a cocktail reception at the Blue House in 2019. (Screenshot captured from Twitter) In 2019, Exo greeted then-US President Donald Trump, his daughter Ivanka Trump and son-in-law Jared Kushner during a cocktail reception before a dinner banquet at the Blue House. The Ministry of Culture, Sports and Tourism launched a “K-Culture” initiative in 2020 aiming to diversify Korean content and boost the different cultural industries, including K-pop. K-pop kept on making big waves. Since diplomacy develops based on bilateral relations, K-pop representatives reached out to foreign audiences, countries, intergovernmental and international organizations. In July, the seven bandmates of BTS were officially named as public relations ambassadors for the 2030 Busan World Expo bid and held a free concert in the port city to support the bid. BTS also helped South Korea bid for the AFC Asian Cup 2023 in a video highlighting why the country could be a great host for the event, although the nation failed to win the bid. Now, K-pop’s influence is not only about topping Billboard charts but attracting more players to the table. South Korean conglomerate giants are teaming up with idols to jump on this bandwagon in an effort to continue to raise the Korea’s international profile. This file image shows a special collaboration between BTS and South Korean cosmetic company Amore Pacific. (Amore Pacific) For example, cosmetic giants are using K-pop idols to help position K-beauty as a brand name in the global beauty industry, which was long monopolized by European and US companies. Amore Pacific partnered with BTS for a special limited edition set featuring three scents inspired by the group’s mega-hits. Sulhwasoo, a premium brand under the beauty giant, recently named Rose of Blackpink its global ambassador. “Since Amore Pacific is a company that represents K-beauty and BTS is an artist that represents K-pop, it could be seen as a collaboration between a singer and company that represent the country,” an official at Amore Pacific told The Korea Herald. “Rose is young, but she has worked hard to become a singer, and Sulwhasoo aims to go global, so her image was compatible in terms of that, apart from the fact that Blackpink is a famed K-pop idol,” the official added. According to Korea International Trade Association, 70 percent of foreign buyers think Korea’s global reputation has positively influenced purchase decisions. This file image shows a special collaboration between BTS and South Korean cosmetic company Amore Pacific. (Amore Pacific) Not only is K-pop a tool behind the country’s national branding, but it can also be an olive branch. When Korea-China relations hit rock bottom regarding the deployment of THAAD, an advanced US missile defense system, Exo accompanied then-President Moon to the opening ceremony of the Korea-China Economic and Trade Partnership in 2017. During the event, Moon expressed hopes to make South Korea and China “true friends” by expanding cultural exchanges. In 2018, Red Velvet and Girls’ Generation Seo-hyun flocked to Pyongyang – an event nobody might’ve imagined in this century — to perform in front of high-profile North Korean audiences, among which was North Korean leader Kim Jong-un. “Each country has its preferences in terms of which K-pop idols they favor, so national marketing has become crucial depending on which leader the country is meeting and what kind of event or business will take place,” said Lee of the University of Southern California. Lee added that, for example, if Japan-Korea ties need to thaw, BoA, one of the first Korean artists to foray into the Japanese music market successfully, could be a good diplomatic resource for the government. But Lee expressed worry only a handful of K-pop idols can fulfill their jobs as public diplomats. “Blackpink’s Lisa comes from Thailand, and so if the group goes to represent Korea, it could potentially be a strange situation with Thailand people and government. Since K-pop is becoming multinational, with an increase in foreign members, this mix could pose a dilemma for the Korean government regarding which K-pop groups to use.”                       ",
    "datetime": "2022-11-17T01:07:33+00:00",
    "url": "https://asianews.network/making-big-waves-how-k-pop-swelled-into-cultural-superpower/"
}