{
    "title": "Making change via K-Pop and Thai-Y",
    "text": "PUBLISHED : 4 May 2022 at 04:00 NEWSPAPER SECTION: Oped WRITER: \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tVitit Muntarbhorn K-Pop and artistic ripples through films and other forms of entertainment from South Korea have been conquering the world in recent years, as part of soft power and smart power. Called Hallyu or the Korean Wave, this phenomenon is looked upon with envy by other countries aspiring to empower their image through the arts. As Thai policymakers and entertainment industry leaders seek to tap into this process, what are key lessons to be learned from the Korean Wave? And does Thailand enjoy a comparative advantage for artistic empowerment on some fronts? In essence, K-Pop is associated with groups of youths singing very synchronised songs and dancing. The groups are extremely well-rehearsed and the tunes are very catchy, often blending different genres, ranging from general pop/bop music with an easy singalong to jazz, rap and hip hop, vested with their own flavour. A clever marketing tool is to sing songs with English titles but with the lyrics mostly in Korean. Members of the groups are well-groomed and cosmopolitan. Two of the most popular groups -- BLACKPINK (all girls) and GOT7 (all boys) both have members from other countries, including Thailand. Recently, the most popular Korean band -- BTS -- has branched out to offer songs entirely in English as a kind of global, musical Esperanto. The outward impact of that influence in artistic and musical terms (as well as finance and economics) is matched lucratively by the inbound lure of South Korea as the genesis of such culture, acting as a positive pull factor for tourism and goodwill for the country. Looking back, it is easy to forget that there was a war between North and South Korea in the early part of the 1950s and that parts of South Korea were decimated by its impact. Anyone who visited the country before the 1980s can probably attest to the fact that there was a drab atmosphere not only architecturally, such as all those grey apartment blocks with huge numbering tattooed on the side of the buildings, but also culturally and politically. The most significant regressive factor was the presence of a dictatorship and its accompanying authoritarian rule. The country was fortunate to have elections in 1987 and it discarded authoritarianism. Since then, it has enjoyed a democratic wave with elected presidents. It was this democratisation process that also allowed for the arts to flourish. Importantly, it was respect for freedom of expression and other human rights as a bedrock of democracy which enabled K-Pop to burgeon. Leadership and a national commitment to open up political and civic spaces have been critical to the nurturing of the Korean Wave. In particular, when Kim Dae-jung was elected as president in 1998, he channelled government money to help the arts, while safeguarding the people's rights and freedoms to create. Thus the empowerment through K-Pop and other forms of culture began to take root. However, the progress enjoyed by South Korea -- now one of the world's ten biggest economies of the world -- is not without challenges. The country is faced with an ageing population. The suicide rate is high. The position of gay people and others who are gender diverse is still precarious as seen by the difficulties faced by such groups in the country's armed forces. There are thus possibilities to learn from other settings which are more liberal on these matters. By contrast, when Thailand's political record is reviewed, it is all too evident that the country has been hampered by coups and the remnants of such actions which block the quest for democracy and concomitant rights, in particular freedom of expression. It should not be passed unnoticed that while the recent success of a Thai rapper at the Coachella festival in the US has been admired on many fronts, she had previously been scorned for her critiques of the power base. Her popularisation of mango and sticky rice on the festival stage in the Californian desert has spread the fame of the delicious Thai dessert. Yet, it is also being exploited by some political elements in Thailand which are antithetical to freedom of expression. For Thai culture to truly empower, its authoritarian streak should be cast off. Political pluralisation of society is essential for the soft power and smart power now being touted by Thai leaders. Despite those constraints, there have been constructive developments in some aspects of Thai arts in their modernity. A novel success is the popularisation of the Y Series or Thai-Y from Thailand which is concerned with gay relationships and LGBTIQ diversity. The series I Told Sunset About You has garnered many local and regional awards. It is a series which is both creative and well packaged. Filmed mainly in Phuket, with a storyline based on adolescent self-discovery, it is beautifully told and matched with great music. The current hit series The Miracle of Teddy Bear tells a story of gay love (with a teddy bear transformed into a human person to help a troubled youth), but much more than that. It is about learning to respect individuals, irrespective of what they are, and to address the challenges faced by families when there are gaps in understanding gender diversity. It also has a message for democracy! The channel airing this series should be commended for showing the series during weekend prime time so that the general public can share and learn about empathy for each other and treat all persons without discrimination. Propitiously, the Thai-Y series is thus becoming increasingly popular in Asia and beyond, with lessons learned for South Korea and elsewhere as part of universal cross-cultural fertilisation. Vitit Muntarbhorn Chulalongkorn University Professor Vitit Muntarbhorn is a Professor Emeritus at the Faculty of Law, Chulalongkorn University, Bangkok, Thailand. He has helped the UN in a number of pro bono positions, including as the first UN Special Rapporteur on the Sale of Children, Child Prostitution and Child Pornography; the first UN Special Rapporteur on the Situation of Human Rights in the Democratic People’s Republic of Korea; and the first UN Independent Expert on Protection against Violence and Discrimination based on Sexual Orientation and Gender Identity. He chaired the UN Commission of Inquiry (COI) on Cote d’Ivoire (Ivory Coast) and was a member of the UN COI on Syria. He is currently UN Special Rapporteur on the Situation of Human Rights in Cambodia, under the UN Human Rights Council in Geneva (2021- ). He is the recipient of the 2004 UNESCO Human Rights Education Prize and was bestowed a Knighthood (KBE) in 2018. His latest book is “Challenges of International Law in the Asian Region” Vitit Muntarbhorn is a Professor Emeritus at the Faculty of Law, Chulalongkorn University, Bangkok, Thailand. He has helped the UN in a number of pro bono positions, including as the first UN Special Rapporteur on the Sale of Children, Child Prostitution and Child Pornography; the first UN Special Rapporteur on the Situation of Human Rights in the Democratic People’s Republic of Korea; and the first UN Independent Expert on Protection against Violence and Discrimination based on Sexual Orientation and Gender Identity. He chaired the UN Commission of Inquiry (COI) on Cote d’Ivoire (Ivory Coast) and was a member of the UN COI on Syria. He is currently UN Special Rapporteur on the Situation of Human Rights in Cambodia, under the UN Human Rights Council in Geneva (2021- ). He is the recipient of the 2004 UNESCO Human Rights Education Prize and was bestowed a Knighthood (KBE) in 2018. His latest book is “Challenges of International Law in the Asian Region” By subscribing, you accept the terms and conditions in our privacy policy. ",
    "datetime": null,
    "url": "https://www.bangkokpost.com/opinion/opinion/2304362/making-change-via-k-pop-and-thai-y"
}