{
    "title": "Making te reo Māori cool: what language revitalisation could learn from the Korean Wave",
    "text": "Senior Lecturer in Māori Language Revitalisation, Auckland University of Technology Rachael Ka'ai-Mahuta works for Te Ipukarea Research Institute at the Auckland University of Technology (AUT). She receives funding from Ngā Pae o te Māramatanga.  Auckland University of Technology provides funding as a member of The Conversation NZ. Auckland University of Technology provides funding as a member of The Conversation AU. View all partners Editor’s note: this article marks Māori Language Week/Te Wiki o te Reo Māori. You can read the full article in Māori here. Earlier this year, I met an Aucklander whose teenage passion for K-pop sparked an interest in the Korean language and culture in general, and led to them learning Korean as a second language. It made me wonder what lessons could be learnt for the revitalisation of the Māori language. Specifically, given the importance of teenagers in those revitalisation efforts, what can we learn from the way the so-called “Korean Wave” is subverting the English language as the language of popular culture? There is already work being done in this area. The central argument of Dr Hinurewa Poutu’s PhD research in 2015 concerned the need to create opportunities for Māori to be considered “cool” by adolescents. As she stated at the time: English tends to be used socially, as there aren’t enough opportunities to hear Māori in social situations or to learn Māori expressions for gossiping with your friends, courting, playing. For most kids, te reo Māori is used in formal contexts only. Five years on, AUT’s Te Ipukarea Research Institute is leading a project looking at how the Māori language can be better supported in the lives of adolescents. Funded by Ngā Pae o te Māramatanga, this research is based on the idea the Māori language of adolescence forms the building blocks of non-formal adult language. In other words, it is about the informal language of friendship, humour, relationships, emotions and mental health that sets a pattern for everyday use later in life. Our preliminary findings show the potential strategic importance of the adolescent age group for Māori language revitalisation. Teenagers are trendsetters – as such, they can have an impact on (and be influenced by) the perceived value of the Māori language and therefore its status. However, a previous study by Te Ipukarea found there are few Māori language resources and not much Māori language content (novels, TV, music, games) aimed at this age group. Read more:\n      K-pop fans are creative, dedicated and social - we should take them seriously This is especially true when compared to the resources available to younger age groups, such as early childhood learners. When it comes to what is considered “cool”, of course, the influence of entertainment, social media and pop culture on adolescents is clear. After meeting the K-pop-loving Korean language graduate, I began to imagine what it might look like if the Māori language revitalisation movement tapped into that age-group: trendsetting, fandom-building teens. The Korean Wave is challenging the dominance of English as the lingua franca of pop culture. The rise in popularity of K-pop, K-dramas (which Netflix has acquired and invested in) and films such as  Parasite (winner of the 2020 best picture Oscar, the first “foreign language” film to do so) with non-Korean audiences shows language is no longer the barrier it once was. These forms of entertainment have simply become part of the wider popular culture. Take Korean group BTS (also known as the Bangtan Boys) – currently among the biggest pop acts in the world, consistently breaking records and garnering a huge worldwide fan base. Read more:\n      Māori loanwords in NZ English are less about meaning, more about identity BTS can sing in English but choose to release the majority of their music and other content (a variety show, a travel show, movies, behind-the-scenes footage) in Korean. This year they released Learn Korean with BTS, underscoring the link between the Korean Wave and the uptick in numbers learning the Korean language. There are obvious differences between Korean and Māori. Māori is still a recovering, minority language, while Korean has over 50 million speakers in South Korea alone. However, if young people in Aotearoa are inspired by Korean pop culture to learn the Korean language, it at least provides an insight into what the Māori language revitalisation movement can learn from the Korean Wave. Read more:\n      Kia ora: how Māori borrowings shape New Zealand English The Korean Wave is actually the result of a hugely successful strategic push by the Korean government to export its culture to the world and boost its “soft power”. In other words, Korea set out to be the coolest culture in the world. With that in mind, strategically resourcing the production of Māori language content for pop culture needs to be a priority in any plan to capture the adolescent age group. I hope that one day Māori language music will consistently enter the charts, my Netflix list will be full of Māori language dramas, and a Māori language film will be promoted and celebrated the way Parasite has been. Copyright © 2010–2023, The Conversation ",
    "datetime": null,
    "url": "https://theconversation.com/making-te-reo-maori-cool-what-language-revitalisation-could-learn-from-the-korean-wave-145833"
}