{
    "title": "MAMA in Hong Kong goes on despite China’s ban on South Korean actors and singers | South China Morning Post",
    "text": "The eighth Mnet Asian Music Awards (MAMA) will happen this Friday with more international acts expected to perform in the stead of absent YG Entertainment South Korean K-pop artists By Kim Jae-heun The eighth Mnet Asian Music Awards (MAMA) hosted by Entertainment conglomerate CJ E&M will take place in Hong Kong this Friday despite toughened regulations on hallyu (Korean wave), in China. China has reportedly prohibited all hallyu content in the country and banned Korean stars from appearing on Chinese TV shows in retaliation against South Korea’s decision to deploy a U.S. missile defence system in South Korea. Not only were the new Korean drama series not approved to air by the Chinese government, but even Korean celebrities already featured in Chinese advertisements or on their entertainment shows were either replaced or edited out. As CJ E&M is hosting its biggest music festival in Hong Kong for the fifth time and its show will be aired live all over the world, only one question remains - whether the Chinese government will air the awards in its territory. “It has been 20 years since we started the hallyu business and there has always been some sort of a little problem all the time,” said Mnet’s head of music content business Shin Hyung-kwan during the press conference at CJ E&M building in Mapo, western Seoul, Thursday. “We had difficulties when there was a change in Japanese TV industry regulations that would downsize the Korean content market, but we sorted it out. “We are overcoming the situation again with our partners in Hong Kong and our festival will proceed without a big problem,” said Shin. He said that the communication between international partners had been a bigger problem previously when they were hosting global music festivals in countries such as Thailand, Taiwan, Japan and even the United States, while Hong Kong meets all the requirements in terms of location and cultural diversity to host the MAMA. YG artists will not participate MAMA has been YG Entertainment artists’ favorite stage as global star Psy opened the festival last year and YG’s most successful bands, including BIGBANG and 2NE1, held special performances at CJ E&M’s annual music event. However, YG Entertainment announced that none of its bands or soloists will participate in this year’s MAMA due to their overseas schedules. A YG official added that as BIGBANG prepares to release its full length M.A.D.E album in December and Psy as well as Sechs Kies return with new music, the three-day schedule abroad would be too much of a burden on the artists. As for the newly debuted BLACKPINK, who has the most votes so far for the MAMA Rookie Award, YG said their girl band will not attend the global event either, as CJ E&M has not invited them properly and it is too late for them to join now. However, CJ E&M refutes those claims. “We have asked YG artists to join our festival in advance, but we received reply that none of them will attend due to the schedule abroad. We respect their choice,” said the festival director Kang Hee-jeong. Quincy Jones, Timbaland, Wiz Khalifa to attend MAMA Meanwhile, Kang hinted that this year’s MAMA invited many established international musicians, like Quincy Jones, Timbaland and Wiz Khalifa to AsiaWorld-EXPO in Hong Kong where some 10,000 audience members are expected to fill the venue. Quincy Jones, well-known for his music production with the late singer Michael Jackson, will participate at MAMA as a speaker at an event called “Creators’ Forum,” where he will share his experiences with the American music market. Popular American rapper Timbaland will also join the forum to speak about his experience and will perform a special collaboration on stage with Korean-American pop-singer Eric Nam. World famous producer and rapper Wiz Khalifa, who wrote the megahit-song “See You Again” for the movie “Furious 7” in 2015, is also expected to perform. The special collaboration between JYP singer Suji of MISS A and Baekhyun of EXO is another surprise performance that CJ E&M is preparing. “A song ‘Dream’ by Suji and Baekhyun this January received much love, but it was never performed live on stage. The couple’s first performance will be held at this year’s MAMA and I expect a lot from them,” Kang said. ",
    "datetime": "2016-11-28T11:15:45+08:00",
    "url": "http://www.scmp.com/news/hong-kong/article/2049712/mama-hong-kong-goes-despite-chinas-hallyu-ban"
}