{
    "title": "Marvel Comics Rides K-Wave With New South Korean Superhero Taegukgi | Geek Culture",
    "text": "With the K-wave phenomenon spreading across the globe, Marvel Comics is leaping on the trend with a new South Korean superhero in the latest February issue of the comic series “Taskmaster”. “Taegukgi“, named after the Korean flag makes his first appearance in the third issue of “Taskmaster” written by Jed Mackay and illustrated by Alessandro Vitti. The issue delves into Taskmaster’s trip to South Korea following the death of Maria Hill in an attempt to clear his name before confronting Taegukgi. Taegukgi’s abilities are still yet to be fully unveiled even though he seems to take punches quite easily. His powers will likely be explored further in the next issue. With so many popular South Korean superheroes like Amadeus Cho (Brawn) and Cindy Moon (Silk) already in the fray, Taegukgi definitely won’t be the last project Marvel Comics is working on to ride on the K-wave. Zheng Yi is perpetually looking for the Time Stone to juggle his love for toys, anime, comics, gaming and photography. He probably needs the Space Stone next for his collection… Maybe we all need a little bit of time off from superhero films. A crossover of epic proportions. From wartime heroics or his modern-day espionage, dive headfirst into the world of Nick Fury. We are a collective bunch of geeks who love to share our passion with the rest of the world. Just like the Beholder we have adopted as our mascot, we have both depth and width of geeky topics we cover. By visiting this page, you declare yourself one of us! If you have grown up with a steady diet of all things related to video games, Star Wars, Star Trek, sci-fi, gadgets, toys, Transformers one way or another, this will be your second home. Copyright © 2013-2023 Geek Culture LLP.Privacy Policy | Work With Us | Join Us ",
    "datetime": "2021-02-18T02:15:00+00:00",
    "url": "https://geekculture.co/marvel-comics-rides-k-wave-with-new-south-korean-superhero-taegukgi/"
}