{
    "title": "MBC Korean Music Wave in Singapore 2013 cancelled - TODAY",
    "text": "Entertainment SINGAPORE — The MBC Korean Music Wave in Singapore 2013 has been cancelled —  just 10 days before the event, billed as the biggest-ever K-Pop concert, is due to be held. Girls' Generation's TaeTiSeo would probably have made colourful emcees at the MBC Korean Music Wave in Singapore. Photo: SM Entertainment SINGAPORE — The MBC Korean Music Wave in Singapore 2013 has been cancelled —  just 10 days before the event, billed as the biggest-ever K-Pop concert, is due to be held. In a statement posted tonight (Nov 6) on the event’s Facebook page, concert organiser Fatfish Entertainment said it was cancelled “due to unforeseen circumstances including contractual difficulties with our co-producer, MBC”. “This is an unexpected turn of events and we are ascertaining how this cancellation will affect our financial position,” it added. This announcement came about a week after Fatfish issued an apology for requesting for donations for the concert’s fan-supported projects, including food and transport subsidies. In that Facebook post, which appears to have been deleted, the company announced that it would “no longer wish to continue with the fan-support projects”, and apologised to the Munhwa Broadcasting Corporation (MBC), one of South Korea’s largest TV stations, and the artists “if our actions have affected their reputation”. The three-hour extravaganza, jointly organised by MBC and Singapore-based Fatfish Entertainment and presented by StarHub, was to have been held at the Gardens By The Bay on Nov 16. Fatfish had previously announced that the concert would be hosted by Korean girl group Girls’ Generation’s Taeyeon, Tiffany and Seohyun (TaeTiSeo), and feature acts including SHINee, EXO, 2PM, 2AM, F.T. Island, B1A4, TeenTop, B.A.P, Kara, Sistar, Miss A, IU and 4Minute. In a statement tonight, Ms Wang Li-Na, Head of Consumer Marketing, StarHub, said: “We were very disappointed to learn this evening, from the concert promoter, Fatfish Entertainment, that the MBC Korean MusicWave concert has been cancelled. We are currently in talks with them to find out more.” Fatfish’s post on Facebook attracted hundreds of comments from disappointed fans, who bought tickets ranging from S$168 to S$688, less than an hour after the statement was posted. “It’s so unprofessional of you to announce at such a short notice when the event is just 10 days away ... Ticket prices were unreasonably sky-high, which caused you guys to have poor sales,” said fan Mira Jamil. Fatfish Entertainment says it is currently seeking professional advice on how the company can refund ticket holders and other creditors. In September, organisers of The 1 World Festival — also citing “unforseen circumstances” — announced that it would be cancelled just two days before opening night on Sept 20. Read more of the latest in Subscribe to get daily news updates, insights and must reads delivered straight to your inbox. By clicking subscribe, I agree for my personal data to be used to send me TODAY newsletters, promotional offers and for research and analysis. Copyright 2023 © Mediacorp Pte Ltd. All rights reserved. We know it's a hassle to switch browsers but we want your experience with TODAY to be fast, secure and the best it can possibly be. To continue, upgrade to a supported browser or, for the finest experience, download the mobile app. Upgraded but still having issues? Contact us ",
    "datetime": null,
    "url": "https://www.todayonline.com/entertainment/music/mbc-korean-music-wave-singapore-2013-cancelled"
}