{
    "title": "Meet the stars riding the crest of hallyu, the Korean wave in fashion, art, film and music | Culture | The Guardian",
    "text": "The K-pop idol who broke free to go independent, the designer whose fantasy gowns are loved by celebs, and the sculptor who works with thousands of online photos: why South Korea is at the forefront of pop culture right now Gochujang fried chicken at a gastropub in London. Girl band Blackpink front row at Paris fashion week. Hour-long queues for BTS merchandise in Las Vegas. Ariana Grande dressed in a glittery emerald two-piece from Miss Sohee. Over the past few years, Korea’s soft power has rocketed in the west. Park Chan-wook was named best director at Cannes film festival in May for his Palme d’Or winner Decision to Leave, while the Emmy-nominated Squid Game remains the most watched season ever on Netflix, with the show’s actor Jung Ho-yeon becoming the first solo east Asian cover star of American Vogue. K-pop groups Blackpink and BTS have a record number of subscribers to their YouTube channels. The origins of what is called hallyu (the Korean wave) can be seen in the black-and-white photograph above, featured in a Victoria & Albert exhibition that opens this month. Showing a farmer ploughing with his cow in front of a lone apartment complex in Gangnam in 1978, the rural fields are bewildering to reconcile with the neighbourhood’s now futuristic landscape of skyscrapers and restaurants with robot servers. “We wanted to open with the historical preamble of how, in such a short period of time, Korea went from nought to 100,” says Rosalie Kim, the curator of the V&A’s Hallyu! The Korean Wave, which charts the rapid ascent of Korean culture across cinema, art, music and fashion. When I began attending boarding school in rural New England in the US in 1999, I met people who still thought of Korea as a war, not a country. My resigned teenage self could never have imagined that one day, my non-Korean friends would be recapping the latest hit K-dramas before I’d heard of them, or that I’d be shopping for Gotchu hot sauce at my hipster grocery store in Brooklyn. It was when I began working as a travel and culture editor for CNN in Korea that I first noticed a true uptick of global interest. Whenever we published articles on Korean culture – topics ranging from K-pop to architecture to gaming – many would go viral. This consistent popularity encouraged me to continue working on my novel on the side. Every time I faltered, fearing that no one would be interested in a novel in English set in contemporary Korea, I would take heart by remembering the CNN page views. Ten years later, I was astonished when my published book was covered by media from South Africa to Italy to Singapore. The Korean wave, meanwhile, shows no signs of stopping, with its new stars breaking the mould of commercial and conventional mainstream success. In the male-dominated field of Korean cinema, female director Bora Kim’s quietly luminescent low-budget debut, House of Hummingbird, swept awards at festivals around the world and also introduced the country to one of its brightest young acting talents, Park Ji-hu. Singer Lim Kim left the highly regimented K-pop system to discover her own original brand of music that mixes hip-hop and traditional Korean instrumentals. With every news headline hailing the unstoppable rise of hallyu, I think of what a different world my daughters will grow up in. One where, in many industries, being Korean draws cultural power, instead of being something that needs to be defined and fought for from scratch. And even though I have barely got over my incredulity, I also feel like nothing will surprise me now. Frances Cha is a journalist and the author of If I Had Your Face (Penguin). Sohee Park In a brightly lit studio in north London, you will find moodboards on walls, embellishments scattered across desks, and stuffed toys perched neatly on shelves – it is here where designer Sohee Park’s beautiful world exists. At just 26, Sohee Park is the founder and creative director of her own company, Miss Sohee. She made her fashion week debut in Milan this year, following support from Dolce and Gabbana. It was a dream come true: “I was literally shaking when I was presenting my work to them but they were so chill.” Park’s glamorous designs are full of what she calls that “Miss Sohee drama” – her couture gowns, beloved by celebrities, are voluminous and fantastical, decorated with intricate embellishments. She is also launching a ready-to-wear collection with Net-a-Porter. Business is booming. Park graduated from Central Saint Martins in London two years ago. When she posted her graduate collection, created in lockdown, she didn’t expect it to go viral. “My biggest worry was whether I could get a job after graduating, and my parents were telling me to return to South Korea,” she says. After the online recognition came hard work. Her company had yet to be built, so she slowly began to assemble a team. Fashion wasn’t always on the cards for Park. “Growing up, I always envisioned this world inside my head and, for me, the way to express that was through painting and drawing.” But everything changed when she saw a Chanel couture show on television during high school. “I was mesmerised; that’s when I opened my eyes to fashion.” She began skipping classes to go to the library and look through fashion magazines. Park attended Central Saint Martins when she was 19 after convincing her parents to let her go. “I wasn’t scared when I arrived, I felt like I was flying.” On the rise of Korean culture, Park says: “It doesn’t necessarily mean that art and fashion have got better over time, but rather the accessibility of what people can see has changed. The world has diversified and so we are simply seeing more exposure to work that was already great to begin with.” As the director of a fast-moving fashion company, Park is finding her feet: “I’m still in the process of discovering our potential.” A self-avowed workaholic, she hasn’t taken a proper holiday since 2020. “There is way too much to do!” she laughs. “And if I ever have a really nervous moment”, she says, “I just tell myself that I’m back in my room, in my pyjamas and that none of this is really happening. Hibaq Farah Lim Kim “From a young age, I’ve always been someone who does what she wants,” says Lim Kim, 28, speaking from Seoul. Born in South Korea, Kim moved to Canada for middle school, then later to the US. There, as she sang and danced along to late 2000s North American pop, she began to dream of becoming a singer. In 2011, aged 18, Kim auditioned as part of a singer-songwriter duo for Superstar K3, one of the biggest South Korean music competitions. She came third. “It was tough,” she says. “It was the first time I’d ever experienced that kind of system. It moved so fast.” Kim soon signed with a major K-pop label – what is now Mystic Story. She moved to Seoul and began the heavily regimented training schedule that has traditionally created South Korea’s biggest pop stars, called idols. Kim received lessons in dancing, singing and social media before debuting as a solo artist in 2013. Everything was in place for Kim to become South Korea’s next K-pop idol. She released three successful albums over three years – but something wasn’t right. “I felt like I was in a cage,” Kim explains. “At some point I thought: ‘This isn’t right for me.’” So, in 2016, Kim chose not to renew her contract and instead made a bid for creative freedom as an independent artist. It was a bold and exceptionally rare move for an emerging K-pop star. After three years of musical exploration with underground producers, Kim released Generasian. The explosive 2019 EP mixes hip-hop, pop and traditional Korean instrumentation. With it, Kim broke free from her earlier idol persona to forge her own distinctive sound. “For so long I was showing something that people wanted to see, but I had so much more to offer,” she says. Generasian was also an opportunity for Kim to address social issues, such as gender inequality, racism and mental health. “I also wanted to show a real side to Asian culture,” says Kim. “Not just the side western people think they know.” On the song Yellow, she tackles the racism she faced in North America, while on Sal-Ki she raps: “I’m raising my voice to be heard.” K-pop has changed radically since Kim was part of the industry and she has been delighted by the international success of groups such as BTS and Blackpink. “I never thought K-pop could go this big,” she says with a laugh. The global embrace of K-pop has had a trickle-down effect for many alternative South Korean musicians – herself included. “It’s given chances to so many different artists on the worldwide market and it’s been amazing to see the greater diversity in music globally. Things have changed, even since Generasian, and that’s for the better.” Katie Goh Lim Kim is featured in Make Break Remix: The Rise of K-style by Fiona Bae, published by Thames & Hudson on 22 September.  Park Ji-hu Before Park Ji-hu became an actor, she wanted to become a broadcaster. “At the end of my primary school year, I was approached on the street by an acting tutoring centre,” the 20-year-old says, “and I thought it would be worth joining just so it would bring me one step closer to becoming a broadcaster. That’s how this all started!” One of the most exciting young actors currently working in South Korea, Park is calling in from Seoul where she is wrapping up filming for Little Women, an upcoming Korean television series inspired by Louisa May Alcott’s novel.Her priorities changed when Park saw a casting call for what would be the internationally critically acclaimed 2018 film House of Hummingbird. “Filming that made me want to pursue acting with absolute certainty,” she says. At just 14, this would be her first leading role in a film. Her performance as Eunhee gained her international recognition, including an award for best new actress at the Tribeca film festival. Sign up to Inside Saturday The only way to get a look behind the scenes of the Saturday magazine. Sign up to get the inside story from our top writers as well as all the must-read articles and columns, delivered to your inbox every weekend. after newsletter promotion She has since starred as a lead in the Netflix coming-of-age zombie apocalypse hit series All of Us Are Dead, in which she plays student On-jo. “I am a huge fan of zombie movies,” she says – “and so I was extra passionate when I was auditioning.” The show became the most watched Netflix series globally for three weeks, and is the third most popular foreign-language series in the platform’s history. “My friends definitely teased me about how calm and collected I came across on camera compared to the clumsy and upbeat person they know me as,” says Park. “I would not be able to fight back zombies!” she laughs, “I would rather gather all the food and drink and hide somewhere and not even think about coming out!” Park represents a new generation of young South Korean actors, who – because of the accessibility of streaming platforms and a growing global appreciation for the country’s entertainment – are taking centre-stage globally. This doesn’t feel like pressure to Park however. “I never ever imagined this before, I’ve gotten a lot of supportive messages from my fans from all over on social media and I appreciate it so much – it is truly so moving,” she says. So, what does the future look like for Park? More action films, she hopes, but also experimenting with different genres. “As an actress, I just want to learn how to do my job well,” she says. “I’m a long way from my goal but I’m working my way up there! Hibaq Farah Kim Bora Growing up in Seoul, Kim Bora wanted to go to art school, so signed up to study film and theatre. Then she discovered a love of film-making – and a talent for it. The Recorder Exam, a short film Kim made at New York’s Columbia University, won a prize from the Directors Guild of America. Her 2018 debut feature, House of Hummingbird, became one of most successful independent Korean film of all time, winning more than 50 film festival awards. For Kim, a creative breakthrough came when she attended a class at Columbia where people had “talked about how to be vulnerable without being scared”. She had started having dreams about her childhood and began thinking about using film to explore her memories, in fictional form. Her films portray the agony of childhood and the emotional turbulence of everyday family life, and make incisive observations on gender politics. The Recorder Exam follows the nine-year-old Eunhee as she prepares for her final performance in music class; House of Hummingbird picks up with her at 14, navigating a burgeoning love life and a patriarchal family life. Both films show a South Korea aspiring to, and struggling under, the demands of rapid development and globalisation, with nods to the 1988 Seoul Olympics and the 1994 collapse of the capital’s Seongsu Bridge. While some of the most memorable Korean screen exports are associated with impressive plot twists and slick violence, Kim’s films are quieter, meditative and emotionally stirring. She is inspired by films that “look at life as it is”, that explore “the complexity of human beings”; stories in which no one is entirely bad or good. Teenagers go through “so many collective emotions of shame, of loneliness, and despair”, she says. House of Hummingbird sought to touch on these. At many screenings, audience members cried. Financiers doubted whether audiences would be interested in a story about a 14-year-old girl; they were proven wrong. “People ask about Korean films all the time wherever I go,” Kim says. She can tell that there’s “huge respect” for them. South Korea “is a dynamic society. When you come to Korea, and especially Seoul, you can feel the city’s soul. It’s alive.” Kim believes South Korea, like many other countries, is feeling the convulsive political shifts of recent years. “Social media has a huge impact on my country”; she finds that people feel lonelier, and society more disconnected and polarised. Her films – she is working on a big-budget science fiction feature – are her way to offer a way forward: “Even if the world looks very negative, I want to talk about love and connection.” Rebecca Liu Gwon Osang There are currently more than 100bn images on Google image search. On Instagram alone, more than 95m photographs are uploaded every day. This ever-swelling sea of flat digital images inspires sculptor Gwon Osang’s surreal work. Pop culture and the baroque meet in his glossy hyperreal figures, which are made up of thousands of printed photographs of subjects ranging from K-pop stars to wild animals. Many of these images are downloaded from the internet before being cut and pasted on to a hollow papier-mache base, offering a newly physical perspective on the online realm. “Google has really inspired me,” Gwon says from his home in Seoul. Gwon, one of the most exciting artists in contemporary sculpture, is interested in interrogating fame and celebrity in the age of the internet. A huge sculpture of the K-pop superstar G-Dragon shows him duelling with another version of himself. “I wanted to make a sculpture that deals with human beings’ internal conflict of interest,” Gwon says. To create the sculpture, Gwon gathered online portraits that spanned 10 years of the star’s career. “With these portraits I try my utmost to reflect on a celebrity’s image in public,” he explains. He also photographed G-Dragon’s cat, which was sent to his studio for a one-day shoot. The classical poses of Gwon’s sculptures often pay homage to the great sculptors of history from a range of traditions. “Whether it’s Oriental art or western art, it doesn’t matter,” he says. Yet his unusual working technique developed out of a desire to move beyond traditional methods of sculpture. While a student in Seoul in the early 2000s, Gwon found that working with stone, marble and bronze required messy, labour-intensive and often prohibitively expensive methods of production. “I have a love for sculpture and I started to think to myself: ‘How can I make this a lot easier?’” Since then Gwon has received widespread recognition in his home country and abroad. When he staged a solo exhibition at Manchester Art Gallery back in 2008, he was “seen mainly as an Asian artist rather than a Korean artist”. “At the time, nobody knew about K-pop and K-culture at all,” he says. “However these days, people in western culture have started to separate out Asian countries.” Louise Benson Hallyu! The Korean Wave opens at the Victoria & Albert Museum, London, on 24 September. ",
    "datetime": "2022-09-17T10:55:42.000Z",
    "url": "https://www.theguardian.com/culture/2022/sep/17/hallyu-south-korean-wave-fashion-art-film-television-music"
}