{
    "title": "Meet Lee Hi, the K-R&B Artist and Korean Makeup Star  | Vogue",
    "text": "To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. By Monica Kim Lee Hi stands 5 feet 1, with round, doll-like cheekbones and a slick of pigment always on her lips. Contained within her demure frame is an enormous voice, raspy yet powerful as it scales up and down experimental beats—one reason why she has emerged as a leading figure in Korea’s rising R&B scene. For years, K-pop has dominated the narrative, but thanks to singers like Lee, who is the costar of a recent documentary about the rise of the genre from Red Bull Sound Select and American R&B artist Gallant, the soundscape is shifting. Her delicate, fine-tuned visuals play no small part in that. Born Lee Ha-yi, the 21-year-old famously came to public attention in 2012, when she was the runner-up on season one of K-Pop Star, a popular TV program that was Korea’s answer to American Idol. “It was there that my dream of being a singer really awakened,” she says, recalling a childhood spent sifting through her parents’ stockpile of CDs, which included D’Angelo, Maxwell, Brownstone, Erykah Badu, India Arie, and Alicia Keys. “And, of course, I admired Michael Jackson and Beyoncé, the Jackson 5 and Destiny’s Child,” she says. “Then there are artists I listen to now, like H.E.R., Teyana Taylor, SZA, Kehlani, Dvsn—really, a lot of singers still influence me today.” Now Lee is an influencer in her own right—not just in the music industry, but also in beauty—showcasing her makeup skills on Instagram and through collaborations with the likes of MAC, for which she developed a limited-edition shade of deep red lipstick. “I’ve loved beauty since I was young, that wide range of colors and lipsticks—I love playing with lots of color,” she says. “After I became a singer, I started to focus on my skin and expressions, too, like the composition and shape of my eyebrows and other delicate details.” A bit of a beauty chameleon, Lee lacks an exact signature look—she’ll easily trade a liquid cat-eye and matte red lip for soft nudes—but there are a few elements she can’t live without. “Filling in your eyebrows with a gel to seal them; a natural curl and mascara on the top and bottom lashes; and contouring powder,” she says. “As with all things, the base is the most important, so you have to apply foundation meticulously.” In true K-beauty spirit, the rest of her routine is equally pointed and precise: A morning shower, followed by a cotton pad of essence swiped across the face. Then lip balm, hair oil, and a single sweep of a cushion brush from roots to end. After applying cream to her face and letting her hair dry, oil goes on her facade once more. Last but not least, two types of body lotion: one for a quick self-administered acupressure massage, constrained to the neck, back, forearms, legs, feet, and sides; the second, a simple moisturizing cream applied head to toe—and more lip balm for good measure. “It’s my must-have item,” she says. “In my clothes, wallet, inside my bag, I carry it around everywhere.” With Lee hard at work on her next album, odds are “everywhere” will soon include North America, where R&B first originated and where she will no doubt be welcomed with open arms. “K-R&B is indebted to the U.S.,” she says, “but there is a certain sensibility and feeling that only Korean people have . . . [we] add a unique sensitivity to it—[that’s how] the new genre called K-R&B was born.” By signing up you agree to our User Agreement and Privacy Policy & Cookie Statement. By Twiggy Jalloh By Lauren Mechling By Kiana Murden By Fiorella Valdesolo By Kiana Murden More from Vogue See More Stories © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices CN Fashion & Beauty ",
    "datetime": "2017-12-22T14:00:00.000Z",
    "url": "https://www.vogue.com/article/lee-hi-k-beauty-k-randb-singer-red-bull-sound-selects-gallant-documentary-korea"
}