{
    "title": "Melihat Sejarah Singkat Hallyu/Korean Wave - Kompasiana.com",
    "text": "Tugas Kuliah Selanjutnya Tutup Awal mula kehadiran hallyu alias Korean wave, di tahun 1997 korea selatan mengalami krisis global, membuat , nilai perekonomian Korea Selatan melemah dan turun hingga 7%. Hal tersebut membuat pemerintah korea selatan mencari jalan keluar agar ekonomi Kembali pulih. Pemerintah mencoba untuk mengandalkan industri makanan sebagai jalan alternatif. Namun kenyataannya hal tersebut tidak banyak membantu perekonomian Korea Selatan jadi membaik. Pemerintah Korea Selatan akhirnya menyadari bahwa negaranya terlambat dalam modernisasi. Kala itu pasar industri asia masih kuasai oleh produk kebudayaan dari Amerika Serikat, Jepang dan Cina. Korea Selatan kemudian mencoba untuk mengekspor produk budaya bersamaan dengan produk manufaktur dan makanan, kemudian produk kebudayaan Korea Selatan ditempatkan bersama produk-produk kebudayaan dari negara lain di Pasar Asia. Seiring dengan berjalannya waktu, produk kebudayaan Korea Selatan semakin banyak digemari.  Kebudayaan korea selatan mulai digandrungi sekitar tahun 1990-an di Tiongkok. Munculah istilah Hn li () atau Hallyu () diadopsi oleh media Cina setelah album musik pop Korea (H.O.T.) dirilis di Tiongkok. Tahun 2002-2005 drama-drama Korea yang populer di Asia termasuk Indonesia antara lain Endless Love, Winter Sonata, Love Story from Harvard, Glass Shoes, Stairway to Heaven, All In, Hotelier, Memories in Bali, dan Sorry I Love You yang merupakan serial drama melankolis.  Di Indonesia sendiri keberadaan drama Korea yang semakin diterima masyarakat. Muncul pula kegemaran akan Boy Group dan Girl Group seperti dari SM Entertainment. Yaitu TVXQ, Super Junior, Girls' Generation/SNSD dan EXO. Penyanyi Rain mulai dikenal lewat serial drama Full House yang ditayangkan di stasiun televisi Indonesia. Sejak itu, penggemar K-pop dan drama Korea mulai umum dijumpai. Kebudayaan Korea Selatan dapat dengan mudah diterima oleh masyarakat yang kebudayaannya sudah menjadi suatu adat yang ada di Asia, contohnya seperti nilai-nilai harmonis, komunitas, moralitas yang kuat, dan rasa hormat yang tinggi terhadap keluarga. Korean Wave menjadi fenomena di seluruh dunia, yang mana efeknya sekarang tidak hanya minat terhadap kebudayaan Korea Selatan saja namun juga ketertarikan terhadap gaya busana, kuliner, musik dan perfilman ala Korea Selatan. Menurut data google trends menunjukkan lima negara dengan penyebaran K-Wave paling intensif yakni Taiwan, Vietnam, Jepang, China, Hongkong dan Indonesia. Sementara itu, pengaruh K-Wave juga terlihat semakin meningkat di AS, Turki, Uni Emirat Arab, Kazakhstan dan India. Bahkan pengaruh K-Wave juga mulai dikenal di negara-negara seperti Perancis, Inggris, Rusia, Uzbekistan dan Brasil.  Kemunculan Hallyu yang cepat, berdampak pada pariwisata yang tentu saja dengan semakin banyak turis yang mendatangi korea selain berimplikasi terhadap bertambahnya devisa negara juga dapat sekaligus lebih mendekatkan secara emosional antara korea dengan turis.  ",
    "datetime": "2021-07-17T21:00:25+0700",
    "url": "https://www.kompasiana.com/egysetyaramadhan/60f2e279152510625d5ffbb3/melihat-sejarah-singkat-hallyu-korean-wave"
}