{
    "title": "Metropolis Japan",
    "text": "September 11, 2018 By Patrick St. Michel Several dozen young women pull out specially-designed light sticks the moment the chorus to BTS’ “Fake Love” starts playing in Daikanyama Unit. The light sticks are only a hint of the dedicated paraphernalia meant to represent a wide array of Korean pop outfits — there are multiple other devices, all a far cry from the basic offerings you’d find at Don Quijote. Some in attendance have a variety on display… A frequent sight at TodakTodak, a party devoted to all things K-pop. “That event the other day at Unit was the most memorable for me,” says DJ Kiki, one of the founders of this and another K-pop party, called Liar Liar. “Just being able to hear K-pop played out of those speakers was wonderful.” Pop songs and artists from South Korea have become big business, and in recent years have even generated buzz in the West. Spurred by the dizzying numbers of Girls’ Generation, the viral stampede of Psy’s 2012 hit “Gangnam Style” and, most recently, the genre-blurring stylings of BTS (who made history by being the first Korean act to top Billboard’s album chart), Korea’s music industry has made huge strides globally. However its impact remains strongest in Asia, as evident here in Japan. Korean pop culture first made major inroads into the country in the early noughties, powered by the popularity of the drama “Winter Sonata.” Soon after, artists such as BoA and TVXQ made successful crossovers into the Japanese market by singing songs in the Japanese language. But K-pop truly arrived at the start of this decade, when group’s like Girls’ Generation and KARA smashed into fame with original Korean songs (followed up by Japanese versions). “It was Girls’ Generation’s ‘Gee’ that shocked me first,” Kiki says, adding that it led him to get into even more female groups such as T-ara and 2NE1.  When diplomatic relations between Japan and South Korea soured a few years later, interest in Korean culture dipped and stayed low for a time. However, over the past two years, it has enjoyed a third wave of popularity, especially with teenage Japanese girls. “I feel like it has spread from K-pop fans via hashtags, social media and just word of mouth,” Kiki says. “Even people who aren’t interested in K-pop idols’ activities are getting into the music.” In 2018, it’s pretty easy to indulge in K-pop fandom in Tokyo. With neighborhoods full of stores carrying goods for nearly every major K-pop idol and parties like TodakTodak, now is a great time to get into Korean music. Get off at Shin-Okubo Station on the Yamanote Line to see just how back in fashion it is. The neighborhood, known as Tokyo’s Koreatown, is experiencing a boom in popularity, with lines stretching out of restaurants and packs of people hitting up cosmetics retailers. Many stores devote themselves to selling K-pop goods, ranging from stickers and keychains to jumbo-sized photos of performers (right now, BTS and TWICE dominate this corner). Simply walk down the main street and you’ll pass dozens of these shops, though Idol Park stands out among the pack (plus they have a cafe on top). Shin-Okubo also hosts plenty of K-pop live shows. The main venue is Show Box, which hosts many up-and-coming Korean acts alongside a mix of local idol groups and the occasional Western performer. While it isn’t a stop for the biggest names from Korea — they usually go to Tokyo Dome, and good luck getting those tickets — this venue allows for the chance to experience K-pop in a more intimate setting.  The other common way to take part in Korean pop in Tokyo is through K-pop Cover Dance Events. Kiki recalls this being the dominant form of gatherings for the community before 2016, and it remains popular. Kepodan is one of the longest running events, holding gatherings every few months wherein fans come together and recreate their favorite choreography in a live setting. It’s a good chance to really see the passion these fans have for their idols. For Kiki, the lack of events celebrating the sound of K-pop alone inspired him to help launch TodakTodak in March 2016. “The goal was to listen to the music with good sound quality from a loud system.” Both this event and Liar Liar are normally held at the Akihabara club Mogra and attract a dedicated following that has made the venue start to feel a little more smooshed (this also made the recent Unit event stand out). Kiki also points to the occasional Nestal party at Shibuya’s Womb as another K-pop party with a great atmosphere. These days though, Kiki notes, you don’t even need to head to a K-pop-only party anymore to hear sounds from Korea. “Even outside of those events, I’ll hear more DJs who mix f(x) and SHINee naturally into their sets.” The fact that K-pop is becoming more widespread doesn’t discourage Kiki from making more events — future installments of both are on the horizon (albeit with no date locked in yet). That means you’ve still got plenty of time to get your light sticks in order. A Metropolis x Black List Tokyo Halloween party in two parts Tokyo’s alt and Goth expert shares her top haunts to check out this Halloween A showa-era date spot from the 1950s Explore The Mint Ginza: a rooftop oasis with dining, music and greenery The ultimate solution for hair removal in Tokyo A one-stop beauty and anti-aging salon Featuring the return of Violently Cute, Agefarre and Fatboy Slim Shaking up Tokyo’s bar scene with the man behind the city’s best cocktail bars ",
    "datetime": "2018-09-11T04:04:42+00:00",
    "url": "https://metropolisjapan.com/k-pop-revival/"
}