{
    "title": "Mizoram’s Immortals Army wins best dance prize at K-pop World Festival - Hindustan Times",
    "text": "Subscribe Now! Get features like A seven-member group from Mizoram won the award for the best dance performance on Friday at the K-pop World Festival 2017 in Changwon, South Korea. The all-boys group called Immortals Army competed against 12 teams from Nigeria, Russia, Madagascar, Malaysia, USA, Vietnam, Singapore, Indonesia, Canada, Turkey, Peru, and Hungary to clinch the prize. The finalists at the festival were selected after qualifying rounds were held in 71 countries. The K-pop World Festival is an annual music and dance competition which was initiated in 2011 by South Korea’s ministry of Foreign Affairs and is hailed as one of the biggest K-pop events in the world. The group performed to the song Blood, Sweat and Tears by the popular K-pop band BTS to take home $ 7,000 prize money. The boys were presented the award by the renowned K-pop girls’ band Twice. The group of seven boys- Vanlaltanpuia, Vanlalruata, Laltanpuia, Zothantluanga, Vanlalhruaia, Zomuansang and Lalrammawia- were adjudged the best in the India round of the K-pop festival. Organised by the Korean Cultural Centre in July this year, the boys beat 423 teams from all over India. “It’s a proud moment to see India present talents to the world with K-pop and it shows the K-wave in India is getting bigger,” said Kim Kum-pyoung, director of Korean Cultural Centre India. In last year’s edition, Priyanka Mazumdar from Assam won the Excellent Vocal Award. List of Winners of K-pop World Festival 2017 Grand Prize : Tifani Arifa, Alphiandi (Indonesia) Best Performance award (Performance): Immortals Army (India) Best Performance award (Vocal): Akif (Singapore) Twitter popular award: Sinem Kadioglu (Turkey ) Audience favourite award (Performance): KINGSMAN (Malaysia) Audience favourite award (Vocal): Ana Lucia (Peru) Excellent Performance award (Performance): One Piece (Canada) Excellent Vocal award (Vocal) : Sinem Kadioglu (Turkey) Monami Gogoi works as a content producer at Hindustan Times. She works with the online team and writes on current events. ...view detail   ",
    "datetime": "2017-09-30T12:55:54+05:30",
    "url": "https://www.hindustantimes.com/art-and-culture/mizoram-s-immortal-army-wins-best-dance-prize-at-k-pop-world-festival/story-JjopLzUsiqhzmud4LX7BjP.html"
}