{
    "title": "MLPD K-9 has died - Sierra Wave: Eastern Sierra NewsSierra Wave: Eastern Sierra News",
    "text": " Officer Dan Casabian and his K-9 Brutus on a successful mission. ** NEWS  RELEASE ** MLPD ANNOUNCES THE DEATH OF RETIRED K-9 BRUTUS The Mammoth Lakes Police Department regrets to announce the passing of Brutus, the K-9 that served the Mammoth Lakes community from 2004 through 2009.  Brutus was put down on January 16, 2014 at the age of 11 years due to chronic back problems. Brutus was a Czech Shephard born in Checkslovakia in March 2002.  Following a fundraising effort that raised over $20,000 in 2004, Brutus was purchasaed from Alderhorst International in Riverside after being hand-selected for Mammoth Lakes by Alderhorst ownerhand Dave Reaver.  The MLPD was looking for a well mannered and well tempered pólice dog trained in both patrol/apprehension and narcotics detection.  Mr. Reaver recommended Brutus because he believed he would  be the best fit for Mammoth Lakes. Officer Dan Casabian was Brutus’s K-9 handler partner.  They worked together for five years during which Brutus was involved in several notable incidents. He tracked and located an attempted murder suspect after a more than one mile search.  He searched for and located many firearms and other evidence that was discarded or hidden by fleeing felons.  He searched and located large amounts of drugs from drug dealers.  Brutus was also responsible for the recovery of large amounts of illegal drug money.   But most of all, Brutus protected the men and women of the MLPD and members of the community. Brutus was retired in 2009 and spent the rest of his life with Officer Casabian and his three children.  Officer Casabian said, “Protecting his family was just as important as protecting his community.  He will be greatly missed by all.  He was my partner, best friend, and family member.  Rest in peace, buddy!” Of. CASABIAN and Family- Very sorry for the loss of BRUTUS. When a friend leaves, he leaves an empty space that the arrival of another friend cannot fill. Maybe some day another doggie will be so lucky as BRUTUS to share his life with you and your family. Our prayers… Read more » Thank you for your service, Brutus. very sad news. My thoughts to the MLPD, Ofc Casabian and his family. RIP Brutus may you run through the fields of heaven. Guess he didn’t need a search warrant. Condolences to the Casabian family. RIP, Brutus. Your job was well done. I’m more bothered about the death of a dog than the death of a human.   Enter your email address to subscribe to the news and receive notifications of new posts by email. Email Address Subscribe    © 2023 Sierra Wave: Eastern Sierra News. All Rights Reserved. KSRW · 1280 N. Main St. Suite J · Bishop, CA 93514 · 760-873-5329 | Privacy Policy\nProjectFansler.com KSRW · 1280 N. Main St. Suite J · Bishop, CA 93514 · 760-873-5329 | Privacy Policy\nProjectFansler.com Terms of Use and Conditions ",
    "datetime": "2013-01-29T16:19:35-08:00",
    "url": "https://sierrawave.net/mlpd-k-9-has-died/"
}