{
    "title": "mm-band surface acoustic wave devices utilizing two-dimensional boron nitride | Scientific Reports",
    "text": "Thank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\n            the best experience, we recommend you use a more up to date browser (or turn off compatibility mode in\n            Internet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles\n            and JavaScript. Advertisement Scientific Reports\nvolume 12, Article number: 20578 (2022)\n            Cite this article 1441 Accesses Metrics details The simple structure, low power consumption, and small form factor have made surface acoustic wave (SAW) devices essential to mobile communication as RF filters. For instance, the latest 5G smartphones are equipped with almost 100 acoustic wave filters to select a specific frequency band and increase communication capacity. On the arrival of the newest communication standard, 5G, mm-band up to 39 GHz is supposed to be utilized, whereas the conventional SAW filters are limited to below 3 GHz, leaving a critical component missing. Here, we show an emerging 2D material—hexagonal boron nitride—can become a key enabler of mm-band SAW filter. Our study, based on first principles analysis and acousto-electric simulation, shows the operating frequency of SAW devices can reach over 20 GHz in its fundamental mode and 40 GHz in its interface mode with high electromechanical coupling coefficient (K2) and low insertion loss. In addition to the orders of magnitude improvement compared to the conventional SAW devices, our study provides a systematic approach to utilizing van der Waals crystals with highly anisotropic acoustic properties for practical applications. Widely adopted in various electronic systems, including communications1,2, sensors3,4,5, and quantum information systems6,7, the surface acoustic wave (SAW) devices rely on the simple principle of the electromechanical resonances from the piezoelectricity2. SAWs on a piezoelectric material, induced by a set of interdigital transducer (IDT) electrodes with a period λ, propagate along the surface from one end, whereas another set of IDT electrodes, paired to detect the SAWs, convert the acoustic waves into the electric signal. Only signals around the resonance frequency can pass, and the paired IDTs serve as a bandpass filter. Their decisive advantage lies in the purely passive wireless readout capability embedded into a small form-factor8; they do not consume the battery. The fundamental resonance frequency (fr) is determined by fr = vSAW/λ, where vSAW is the speed of acoustic wave propagation at the surface, and this surface acoustic wave mode is called Rayleigh mode. LiNbO39,10,11, LiTaO312, ZnO3,4,5,13,14,15, AlN16,17,18,19, and AlScN20,21 are the piezoelectric materials commonly used or actively studied. Ideally, the operating frequency could increase by reducing λ, but it cannot get shorter boundlessly. With nanoscale IDTs near the lithography limit, reliability issues arise due to the fabrication margins. As such, the operation frequency of the traditional SAW devices has been staggering under a few GHz. The harmonics of fr (f = n‧fr, where n = 2, 3, 4, etc.) can provide resonances at higher frequencies, but significant insertion losses are the challenge. For instance, Zheng et al. recently reported a LiNbO3 SAW transducer with λ = 160 nm. The Rayleigh mode was 15 GHz, whereas a higher-order mode was 30 GHz (longitudinal bulk mode) with –40 dB insertion loss11. Büyükköse et al. demonstrated a 16.1 GHz ZnO SAW device with λ = 260 nm using the 4th order Rayleigh mode with -70 dB insertion loss13. Wang et al. showed a 33.7 GHz AlScN/diamond/Si multilayer SAW device with λ = 240 nm using the 3rd order Rayleigh mode with –20 dB insertion loss. In their work, the rare-earth Sc was to increase the electromechanical coupling, and the diamond substrate was to improve the sound velocity. They also reported a 17.7 GHz AlN/diamond/Si SAW device with λ = 500 nm and –20 dB insertion loss using Sezawa mode17,20—an interfacial higher-order mode between low and high sound velocity materials22. A fundamental solution for a higher operating frequency is adopting a high vSAW material, as it can be achieved with the same λ. Yet, the weak electromechanical coupling can be an issue. Usually, a material with high sound velocities, like a diamond, tends to be rigid since the acoustic wave speed is proportional to the crystal bonding strength. A rigid material requires more electric energy to induce the same mechanical variations, implying a low electromechanical coupling coefficient, K223. This article presents mm-band SAW devices enabled by an emerging low-dimensional piezoelectric material, hexagonal boron nitride (h-BN). As a close cousin to graphene, h-BN has a very high in-plane sound velocity due to its strong covalent bonding between boron and nitrogen (Fig. 1a), which is similar to the strong carbon-to-carbon covalent bonding in graphene and diamond24. While graphene and diamond lack piezoelectricity due to their single elemental nature, h-BN maintains it along the in-plane direction25. As such, h-BN is uniquely positioned to provide a basis for a superior SAW device. For a practical RF filter beyond Ka-band (26.5–40 GHz), there are two possible approaches to utilizing h-BN. One is to excite the SAWs directly on h-BN, as illustrated in Fig. 1b, and the other is to adopt extra piezoelectric layers to stimulate the SAWs on h-BN, as shown in Fig. 1c. In the second case, the Sezawa mode is the primary target. The two approaches and their opportunities are explored in the following via acousto-electric simulations based on first principles analysis. (a) Similarity of atomic structure of h-BN and graphite. h-BN has a polar bonding between two different elements, whereas those of graphite are non-polar. Schematics of SAW devices (b) utilizing h-BN as piezoelectric layer and (c) utilizing interfacial mode between piezoelectric material and h-BN. A good electromechanical coupling is essential for actuating and sensing the acoustic wave on h-BN. Although h-BN has been actively studied, the experimental and theoretical data from the literature were insufficient for the acousto-electric simulations. First principles analysis based on density functional theory (DFT) and density functional perturbation theory (DFPT)26,27 was adopted to obtain a complete set of parameters for the acousto-electric simulations. Quantum Espresso DFT suite was used with pseudopotentials and plane wave basis. Norm conserving local density approximation (LDA) with Perdew-Zunger (PZ) exchange correlation was adopted28. The electron energy cutoff was set up as 120 Ry with the first Brillouin zone sampling of 6 \\(\\times\\) 6 \\(\\times\\) 4 Monkhorst–Pack grids29. AA′ stacking of h-BN was assumed since it gives the energy minimum among three stable structures in the five possible stacking arrangements30. A recent experimental report on a high-quality single-crystalline multilayered h-BN (Ref.31) also supports that AA′ stacking is the most stable. The obtained equilibrium lattice constants a and c are 2.48 and 6.45 Å, respectively, showing excellent agreement with the experimental study. The piezoelectric properties were determined as differential quantities per geometric perturbation around the equilibrium position. The highly anisotropic piezoelectric properties of h-BN are expected from the dissimilar bonding natures between the strong in-plane covalent bonds and the weak out-of-plane van der Waals forces27. This can be seen by the drastic difference between the in-plane and out-of-plane sound velocities. Extracted from the phonon dispersions, they are 19,600 m/s for in-plane and 3850 m/s for out-of-plane—in-plane is nearly five times higher. Our study reveals that this asymmetric acoustic propagation is a crucial factor in SAW devices utilizing van der Waals crystals. In a SAW device, the induced acoustic waves propagate at an effective velocity. This velocity is essentially an average of all possible propagation of elastic excitations within the film, including the multiple reflections at the interfaces. Unlike the bulk crystals, van der Waals crystals have an inherent large anisotropy in the acoustic wave velocities, and how those are averaged strongly influences device operations. Using the DFT and DFPT, elastic stiffness constants (Cij) and optical dielectric constants were also calculated. Cij are the response of a crystal to an externally applied crystallographic deformation where i, j = 1, 2, 3, 4, 5, and 6 (1 = xx, 2 = yy, 3 = zz, 4 = yz, 5 = zx, 6 = xy). Cij was calculated from the energy-strain relation by adding four independent compressive and shear strains considering the crystal symmetry— ± 1% and ± 2% of deformation along the crystal axes32. The obtained elastic stiffness constants agree well with the theoretical and experimental results (Table 1)24,33. As expected, due to the weak van der Waals interactions, the components involved with the perpendicular axis to the basal plane are very small compared to those with the parallel axes. The macroscopic optical dielectric constants, parallel (\\({\\varepsilon }_{\\infty }^{\\| }\\)) and perpendicular (\\({\\varepsilon }_{\\infty }^{\\perp }\\)) to the basal plane, were obtained by Lyddane-Sachs-Teller relations (\\({\\omega }_{\\mathrm{LO}}^{2}/{\\omega }_{\\mathrm{TO}}^{2}={\\varepsilon }_{0}/{\\varepsilon }_{\\infty }\\)) using the static dielectric constants (\\({\\varepsilon }_{0}^{\\| }\\) and \\({\\varepsilon }_{0}^{\\perp }\\)) and the optical phonon frequencies—longitudinal (ωLO) and transverse (ωTO)34. The calculated \\({\\varepsilon }_{\\infty }^{\\| }\\) and \\({\\varepsilon }_{\\infty }^{\\perp }\\) were 4.86 and 2.87, respectively. The in-plane direction has a higher value than the out-of-plane direction because the weak van der Waals interactions along the out-of-plane direction are less polarizable than the in-plane covalent bonding35. Finally, piezoelectric tensor elements, the quantities related to Born effective charge (\\({Z}^{*}\\)), were calculated as the derivatives of the forces (F) with respect to the electric field (E) created along the direction α and β(\\({Z}_{\\alpha \\beta }^{*}=\\partial {F}_{\\beta }/\\partial {E}_{\\alpha }\\))36. All calculated quantities are compared favorably with the experimental and theoretical observations from the literature (Table 2)33,35,37. The acousto-electric simulation was performed based on the finite element method (FEM). Many studies have used this approach in SAW filter design, and the excellent predicting ability has been demonstrated10,11,12,13,14,15,17,20,22. The piezoelectric effects, the relations among stress (T), strain (S), electric field (E), and electric displacement field (D), are represented by the piezoelectric constitutive relations as2 where cE, e, and εrS correspond to a material’s stiffness, coupling coefficient, and relative permittivity in their tensor form, respectively. ε0 is the vacuum permittivity. For the analysis of the SAWs, the nonlinear equations are solved using the finite element method, and COMSOL Multiphysics 6.0 was used for this study. Perfectly matched layers (PMLs) were applied at the boundaries unless they were periodic to prevent errors from the multiple reflections. Using the properties from the DFT and DFPT calculations, the structure utilizing h-BN as a piezoelectric material (Fig. 1b) were investigated. The structure consists of h-BN, electrodes, and SiO2, which is a commonly used substrate for the h-BN transfer process38. For the periodic unit cell shown in Fig. 2a, eigenmode analysis was performed first. With conventional bulk crystals, a normalized thickness, kh, where k is the wave number and h is the thickness of the piezoelectric layer, is used to analyze the eigenmodes and phase velocities. However, the wave propagation velocity on an h-BN layer is a mixed value between the fast in-plane velocity and slow out-of-plane velocity, and is a function of hh-BN, the thickness of the h-BN film. To see the effect of the mixing of the asymmetric sound velocities by the thickness variation, the electrodes’ period (λ = 2π/k), thickness, and width were fixed as 150, 10, and 20 nm, respectively. Frequency characteristics of h-BN/SiO2 layered structure. (a) Displacement field distribution (in nm) of a unit cell with 4 nm thick h-BN at Rayleigh mode frequency (23 GHz). (b) khh-BN dispersion curves of phase velocity and electromechanical coupling coefficient (K2). (c) Comparison of Rayleigh modes with different IDT metals. (d) Electrical input admittances vs. frequency near Rayleigh mode of delay line simulation with input and output IDTs. (e) Displacement field distribution of delay line simulation at Rayleigh mode. (f) Insertion loss (S21) of h-BN/SiO2 SAW filter from delay line simulation. Figure 2b presents the khh-BN dispersion curves of the phase velocity and the electromechanical coupling. The electrode material is Al. There is an optimum hh-BN to maximize the phase velocity and the electromechanical coupling. The electromechanical coupling (K2) can be determined using resonance frequencies (fr) and anti-resonance frequency (fa) from the input admittance curve23 using the relation given as As the thickness decreases, the phase velocity increases because the fast in-plane contribution gets stronger. However, below 4 nm of hh-BN, the trend is reversed. The phase velocity decreases as the film gets thinner even though the fast in-plane portion increases. This is due to the loss of the piezoelectric volume. In the simulation, the height and width of the IDT electrodes, which are not piezoelectric but add total mass, were fixed. Thus, as hh-BN decreases, the piezoelectric portion in the total volume decreases. Interestingly, K2 increases as hh-BN becomes smaller than 4 nm, implying that the h-BN film becomes more piezoelectric. Yet, the loss of total piezoelectric volume dominates the trend, resulting in the reduced phase velocity. As such, 4 nm turned out to be the optimal thickness, with the highest phase velocity of 3470 m/s and K2 of 1.05%. The eigenfrequency of Rayleigh mode reached up to 23 GHz with Al electrodes. The displacement field distribution at the optimum case is shown in Fig. 2a. Electrode materials and structures also affect the SAW generations. The trend is clear; the lighter the electrode, the higher the frequency due to the mass loading effect, which often significantly affects nanoscale acoustic devices39. Figure 2c compares the operation frequencies of Au, Pt, Pd, Cu, Ni, and Al electrodes with the same structure. Due to the large density, the lowest eigenfrequency with Au stayed at 15 GHz despite its high electrical conductivity − 35% less than the Al electrode. Naturally, the electrodes’ thickness is also of interest since it can influence the resonance frequency by changing the amount of the passive mass. Thus, the adopted IDT thickness was 10 nm of Al considering the electrical conductivity and the mass of metal electrodes. It is worth mentioning that a severe dependence on the electrode materials seems unusual in bulk piezoelectric crystals, and this is due to the weak mechanical strength of the h-BN layer. To analyze the insertion loss of the h-BN/SiO2 structure, a delay line system with input and output IDTs was studied. The insertion loss is a major figure of merits of SAW filters since they are passive devices and represented by the scattering parameter (S-parameter) component S21. Each IDT comprised 25 pairs of electrode fingers. A small sinusoidal signal (amplitude 1 V) with frequency f was applied to the input IDT, and the electric signal at the output IDT was obtained. The input admittance curve (Fig. 2d) indicates the eigenfrequency at 23 GHz—almost identical to the result of the periodic cell study. From the displacement field distribution in Fig. 2e, the propagation of acoustic waves between the input and output IDTs can be clearly seen, and the concentrated acoustic energy near the top surface is the distinctive feature of the Rayleigh mode. As shown in Fig. 2f, the insertion loss of only − 1 dB at 23 GHz is very promising. It should be noted that the structure is with only 25 pairs of IDT fingers, whereas actual SAW filters have a few hundred of them. The small number of IDT fingers was inevitable for the computational efficiency, but in an actual h-BN SAW implementation, even a lower insertion loss is expected by adopting more fingers. As such, the result suggests the h-BN/SiO2 SAW device has a solid potential to realize a high-performance high-frequency bandpass filter. One issue revealed is the weak electromechanical driving force due to the thin film for high acoustic velocity. As the frequency goes above 25 GHz, the SAW device faces a significant insertion loss. Ironically, this degradation stems from the strong in-plane bonding and the high sound velocity—the very advantage of h-BN. The strong bonds appear as high vibrational energy and high sound velocity along the basal plane (steeper slopes in phonon dispersion). At the same time, this also means a rigid material; the required energy to excite enough elastic vibrations get higher. Adopting a faster sound velocity substrate, such as a diamond, can improve the resonance frequency. As well-known, a crystalline diamond has the highest sound velocity. In fact, in our previous study, a similar scale SAW device with h-BN on a diamond substrate showed an operating frequency above 44 GHz. However, K2 was still as low as 0.56% at the same time40. The AlN and AlScN SAW filters mentioned above also adopted diamond substrates to boost the resonance frequencies17,20. However, it may be very challenging to obtain a largescale crystal quality diamond and incorporate it into a mass fabrication process. Multilayer SAW devices composed of h-BN and conventional piezoelectric materials possess another opportunity to take advantage of the fast in-plane sound velocity of h-BN. In this structure (Fig. 1c), the h-BN layer with high in-plane sound velocity provides the acoustic waves channel, while a bulk piezoelectric crystal with strong electromechanical coupling supplements the weak mechanical driving force of h-BN. In this case, the interfacial Sezawa mode from the slow-on-fast structure can support a resonance at a higher frequency than the fundamental Rayleigh mode22. This higher-order mode is essentially analogous to the surface electromagnetic waves generated in the total reflection at the interface between two media. As mentioned above, a diamond can play the same role, but the recent development of the wafer-scale crystalline growth of h-BN provides a clear advantage31,41. LiNbO3, LiTaO3, ZnO, and AlN are the conventional piezoelectric materials chosen to induce the Sezawa modes on h-BN. In this study, widely used Y-cut X propagating LiNbO3 and LiTaO3 (Y-X LiNbO3 and LiTaO3) are adopted due to their high SAW velocities and strong couplings23,42. Since the induced vibration near the IDTs should reach the interface with the underlying h-BN, the top layer’s thickness also affects the device’s performance. 30 nm of bulk piezoelectric layers turned out to be ideal for exciting the interfacial modes. The calculated input admittance and S21 with the same input and output IDTs are shown in Fig. 3. The key results are also summarized in Table 3. In the input admittance (Fig. 3a), the Sezawa modes (the second peaks) appear at higher frequencies than the Rayleigh modes (the first peaks) in all studied materials except for the AlN. The Sezawa modes easily reach up to 40 GHz or above with the same λ (150 nm). Considering the current lithography limits, there is room for further improvement if the IDT period is reduced. The results clearly demonstrate SAW filters for Ka-band (26.5–40 GHz) and beyond are possible by the adoption of h-BN as the fast acoustic channel and the judicious design of the multilayer structures. The best material for this is LiTaO3. The S21 of LiTaO3/h-BN/SiO2 structure was the lowest at –20 dB, with a 40 GHz operation frequency (Fig. 3b). LiNbO3 showed the highest operating frequency of 46 GHz, but a little more insertion loss of –28 dB. LiNbO3 and LiTaO3 are commonly used piezoelectric materials due to their high K2, but their operating frequencies have been under 1 GHz. The synergistic combination of the fast acoustic channel and the high electromechanical coupling enabled the SAW device for the extremely high frequency range. Frequency characteristics of piezoelectric material/h-BN/SiO2 SAW filters. (a) Electrical input admittance and (b) Insertion loss (S21) of the multilayer structures. 30 nm LiNbO3, LiTaO3, ZnO, and AlN are placed on h-BN/SiO2 (hh-BN = 4 nm). Regarding the insertion loss, low insertion loss (< –5 dB) h-BN SAW filters are possible up to 20 GHz by using either the Rayleigh modes or the Sezawa modes. However, some level of insertion loss is unavoidable in Ka-band. Since no reported SAW device is operating at this high frequency, a direct comparison is difficult. The previous studies demonstrated SAW filters under or near 30 GHz by Sezawa modes with the measured insertion loss ranges from −20 to −70 dB11,13,17,20. Besides, our study’s –20 dB insertion loss is with only 25 pairs of IDT fingers, but the real SAW filters usually have hundreds of IDT fingers. As mentioned above, the SAW design and simulation by the FEM showed good agreement in many studies, but implementing the real-scale device into the simulation is very difficult due to the computational limits. The usual techniques, such as acoustic reflectors, which can reduce the insertion loss, were not included in our simulation. In an actual device, the acoustic engineering with more IDT fingers may improve the performance further. Among the investigated materials, ZnO demonstrated only Sezawa mode around 39 GHz without a clear sign of Rayleigh mode (Fig. 3b). A very weak resonance, however, can be found in the S21 chart (the wiggling around 17 GHz). This absence of Rayleigh mode is possibly due to the low K2. In fact, the weak coupling is not purely of ZnO but of the multiplayer structure and the acoustic impedance between ZnO and h-BN. In a separate simulation with only ZnO, the Rayleigh mode was clearly distinguished. Although the ZnO/h-BN structure showed the highest K2 of the Sezawa mode around 39 GHz, its transmission envelope turned out to be inappropriate as a bandpass filter. The insertion loss of ZnO/h-BN was also substantial, about –38.8 dB. As for AlN, the studied structure displayed no resonance feature because of the low K2. AlN and h-BN are very rigid, so the applied input signal (peak-to-peak 1 V) seems insufficient to excite the acoustic waves. Since the signal from the antenna is expected to be at a low power level, the high required voltage for operation is unideal for an RF filter, which eliminates the material from the candidate list. The displacement field distributions of each device’s Rayleigh and Sezawa modes are shown in Fig. 4 (except for AlN since they are absent). The Rayleigh modes (Fig. 4a–c) show the acoustic energy localized near the top surface where the waves propagate. In contrast, the Sezawa modes (Fig. 4d–f) show the excitations penetrated down to the interface and even into substrate layers (h-BN and SiO2). Distribution of displacement field (in nm) of piezoelectric material/h-BN/SiO2 delay line model. (a–c) Rayleigh mode with energy concentrated on the surface for LiNbO3/h-BN/SiO2, LiTaO3/h-BN/SiO2, and ZnO/h-BN/SiO2, respectively. (d–f) Sezawa mode with energy penetrated down to the interface and substrate for LiNbO3/h-BN/SiO2, LiTaO3/h-BN/SiO2, and ZnO/h-BN/SiO2, respectively. The phase velocities of the multilayer structures were analyzed similarly; the λ is fixed at 150 nm, and only hh-BN was changed. As shown in Fig. 5, the phase velocities of the Rayleigh modes increase in all structures as hh-BN increases. However, the phase velocities of the Sezawa modes tend to saturate after a certain hh-BN. LiNbO3/h-BN and LiTaO3/h-BN show the maximum phase velocities of 7087 and 6079 m/s, respectively, with 12 nm of hh-BN, whereas ZnO/h-BN shows the maximum phase velocity of 5879 m/s with 7 nm of hh-BN. Beyond these thicknesses, the phase velocities either saturate or slightly decrease as the in-plane contribution of h-BN diminishes. In LiNbO3/h-BN, the higher-order modes disappear at hh-BN = 1 nm due to the weak piezoelectric effects of too thin h-BN. Characteristics of phase velocities depending on the hh-BN with khh-BN dispersion curves (the λ is fixed at 150 nm). Phase velocities vs. h-BN thickness for Rayleigh and Sezawa modes of (a) LiNbO3/h-BN/SiO2, (b) LiTaO3/h-BN/SiO2, and (c) ZnO/h-BN/SiO2 multilayered structures. Boron is a material known for its high isotope ratio. We adopted the natural ratio of boron isotopes (20% of 10B and 80% of 11B) in all our calculations. Nitrogen’s isotope rate is negligible (99.6% of 14N). This large portion of B isotopes works as mass defects in phonon transport due to the increased phonon scattering, which implies the fast decay of SAWs. By isotopically purifying B, the propagation of SAWs on h-BN can be improved, having insertion loss better. Actually, this isotope effect was observed experimentally in long optical phonon propagation (4 µm) on an isotopically purified h-BN film43. In addition, h-BN with 11B can have a slightly higher in-plane sound velocity since the binding energy of 11B is higher44. As such, isotopically purifying h-BN can further improve the operating frequency. The h-BN growth technique is rapidly developing, and high-quality, single-crystalline wafer-scale h-BN has become obtainable recently31,41. In addition, h-BN is a van der Waals crystal that can be grown layer-by-layer. As such, the accurate thickness control is also an advantage45,46. Since the sputtering can be easily performed on any type of substrate, few difficulties are expected in fabricating the proposed multilayer structure. As for the IDTs, fabricating tens of nanometer scale metal lines is routine work with the current lithography technology47. For instance, Ref.20 demonstrated a SAW device of 30 nm IDT finger width, and the resolution limit of the EBL process is below 10 nm48. Thus, our study provides a convincing path toward a high-frequency SAW filter with an order of magnitude improvement from conventional devices. In summary, the SAW devices based on h-BN were studied based on the first principles analysis and acousto-electric simulations. We demonstrated that a SAW filter based on h-BN could become an unconventional promoter for the next-generation RF filter technology. The SAW devices adopting h-BN as a piezoelectric material can operate above 20 GHz with nearly zero insertion loss. The multilayer structure utilizing h-BN as a high-speed acoustic channel can operate even higher by its interfacial excitations. The strong electromechanical coupling, integrated into the high in-plane sound velocity, provides an operation beyond Ka-band (> 40 GHz) by the Sezawa mode, with a high K2 (> 5%) and considerably low insertion loss of − 20 dB. These are the highest operating frequencies ever researched by stacking conventional piezoelectric materials, including LiNbO3, LiTaO3, and ZnO. Thus, our result strongly suggests the exceptional properties of h-BN can be a swift channel toward the essential part of future communication technology. The data that support the plots within this paper and other findings of this study are available from the corresponding authors upon reasonable request. Ruppel, C. C. W. Acoustic wave filter technology-A review. IEEE Trans. Ultrason. Ferroelectr. Freq. Control 64, 1390–1400 (2017). Article \n    PubMed \n    \n                    Google Scholar Hashimoto, K. -Y. Surface Acoustic Wave Devices in Telecommuniations: Modelling and Simulation Ch. A (Springer, 2000). Fu, Y. Q. et al. Advances in piezoelectric thin films for acoustic biosensors, acoustofluidics and lab-on-chip applications. Prog. Mater. Sci. 89, 31–91 (2017). Article \n    CAS \n    \n                    Google Scholar Xuan, W. et al. Fast response and high sensitivity ZnO/glass surface acoustic wave humidity sensors using graphene oxide sensing layer. Sci. Rep. 4, 1–9 (2014). Google Scholar Wu, J. H. et al. Ultrathin glass-based flexible, transparent, and ultrasensitive surface acoustic wave humidity sensor with ZnO nanowires and graphene quantum dots. ACS Appl. Mater. Interfaces 12(35), 39817–39825 (2020). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Satzinger, K. J. et al. Quantum control of surface acoustic-wave phonons. Nature 563, 661–665 (2018). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Frisk Kockum, A. Electrical control of quantum acoustics. Nat. Electron. 5, 325–326 (2022). Article \n    \n                    Google Scholar Scholl, G. et al. Wireless passive SAW sensor systems for industrial and domestic applications. In: Proceedings of the 1998 IEEE International Frequency Control Symposium 595–601 (1998). Dogheche, E., Remiens, D., Shikata, S., Hachigo, A. & Nakahata, H. High-frequency surface acoustic wave devices based on LiNbO3 diamond multilayered structure. Appl. Phys. Lett. 87, 1–3 (2005). Article \n    \n                    Google Scholar Zhang, S. et al. Surface acoustic wave devices using lithium niobate on silicon carbide. IEEE Trans. Microw. Theory Tech. 68, 3653–3666 (2020). Article \n    \n                    Google Scholar Zheng, J. et al. 30 GHz surface acoustic wave transducers with extremely high mass sensitivity. Appl. Phys. Lett. 116, 123502 (2020). Article \n    CAS \n    \n                    Google Scholar Naumenko, N. F. High-velocity non-attenuated acoustic waves in LiTaO3/quartz layered substrates for high frequency resonators. Ultrasonics 95, 1–5 (2019). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Büyükköse, S. et al. Ultrahigh-frequency surface acoustic wave transducers on ZnO/SiO2/Si using nanoimprint lithography. Nanotechnology 23, 315303 (2012). Article \n    PubMed \n    \n                    Google Scholar Su, R. et al. Enhanced performance of ZnO/SiO2/Al2O3 surface acoustic wave devices with embedded electrodes. ACS Appl. Mater. Interfaces 12(37), 42378–42385 (2020). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Fu, S. et al. High-frequency surface acoustic wave devices based on ZnO/SiC layered structure. IEEE Electron Device Lett. 40, 103–106 (2019). Article \n    CAS \n    \n                    Google Scholar Gao, A. et al. AlN MEMS filters with extremely high bandwidth widening capability. Microsyst. Nanoeng. 6, 74 (2020). Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Wang, L. et al. Enhanced performance of 17.7 GHz SAW devices based on AlN/diamond/Si layered structure with embedded nanotransducer. Appl. Phys. Lett. 111, 253502 (2017). Article \n    \n                    Google Scholar Rodríguez-Madrid, J. G. et al. Super-high-frequency SAW resonators on AlN/diamond. IEEE Electron Device Lett. 33, 495–497 (2012). Article \n    \n                    Google Scholar Kirsch, P., Assouar, M. B., Elmazria, O., Mortet, V. & Alnot, P. 5 GHz surface acoustic wave devices based on aluminum nitride/diamond layered structure realized using electron beam lithography. Appl. Phys. Lett. 88, 1–4 (2006). Article \n    \n                    Google Scholar Wang, L. et al. High performance 33.7 GHz surface acoustic wave nanotransducers based on AlScN/diamond/Si layered structures. Appl. Phys. Lett. 113, 093503 (2018). Article \n    \n                    Google Scholar Wang, W. et al. High performance AlScN thin film based surface acoustic wave devices with large electromechanical coupling coefficient. Appl. Phys. Lett. 105, 133502 (2014). Article \n    \n                    Google Scholar Hadj-Larbi, F. & Serhane, R. Sezawa SAW devices: Review of numerical-experimental studies and recent applications. Sensors Actuators A Phys. 292, 169–197 (2019). Article \n    CAS \n    \n                    Google Scholar IEEE Standard on piezoelectricity. ANSI/IEEE Std. 176–1987 (1988). Bosak, A. et al. Elasticity of hexagonal boron nitride: Inelastic x-ray scattering measurements. Phys. Rev. B 73, 041402 (2006). Article \n    \n                    Google Scholar Duerloo, K.-A.N., Ong, M. T. & Reed, E. J. Intrinsic piezoelectricity in two-dimensional materials. J. Phys. Chem. Lett. 3, 2871–2876 (2012). Article \n    CAS \n    \n                    Google Scholar Hamann, D. R., Wu, X., Rabe, K. M. & Vanderbilt, D. Metric tensor formulation of strain in density-functional perturbation theory. Phys. Rev. B 71, 035117 (2005). Article \n    \n                    Google Scholar Zhang, K., Feng, Y., Wang, F., Yang, Z. & Wang, J. Two dimensional hexagonal boron nitride (2D-hBN): synthesis, properties and applications. J. Mater. Chem. C 5, 11992–12022 (2017). Article \n    CAS \n    \n                    Google Scholar Hamdi, I. & Meskini, N. Ab initio study of the structural, elastic, vibrational and thermodynamic properties of the hexagonal boron nitride: Performance of LDA and GGA. Phys. B 405, 2785–2794 (2010). Article \n    CAS \n    \n                    Google Scholar Monkhorst, H. J. & Pack, J. D. Special points for brillouin-zone integrations. Phys. Rev. B 13, 5188 (1976). Article \n    MathSciNet \n    \n                    Google Scholar Constantinescu, G., Kuc, A. & Heine, T. Stacking in bulk and bilayer hexagonal boron nitride. Phys. Rev. Lett. 111, 036104 (2013). Article \n    PubMed \n    \n                    Google Scholar Ma, K. Y. et al. Epitaxial single-crystal hexagonal boron nitride multilayers on Ni (111). Nature 606, 88–93 (2022). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Menéndez-Proupin, E. et al. Computer simulation of elastic constants of hydroxyapatite and fluorapatite. J. Mech. Behav. Biomed. Mater. 4, 1011–1020 (2011). Article \n    PubMed \n    \n                    Google Scholar Ohba, N., Miwa, K., Nagasako, N. & Fukumoto, A. First-principles study on structural, dielectric, and dynamical properties for three BN polytypes. Phys. Rev. B 63, 115207 (2001). Article \n    \n                    Google Scholar Lyddane, R. H., Sachs, R. G. & Teller, E. On the polar vibrations of alkali halides. Phys. Rev. 59, 673 (1941). Article \n    CAS \n    MATH \n    \n                    Google Scholar Laturia, A., Van de Put, M. L. & Vandenberghe, W. G. Dielectric properties of hexagonal boron nitride and transition metal dichalcogenides: from monolayer to bulk. npj 2D Mater. Appl. 2, 1–7 (2018). Article \n    CAS \n    \n                    Google Scholar Gonze, X. & Lee, C. Dynamical matrices, born effective charges, dielectric permittivity tensors, and interatomic force constants from density-functional perturbation theory. Phys. Rev. B 55, 10355–10368 (1997). Article \n    CAS \n    \n                    Google Scholar Geick, R., Perry, C. H. & Rupprecht, G. Normal modes in hexagonal boron nitride. Phys. Rev. 146, 543–547 (1966). Article \n    CAS \n    \n                    Google Scholar Lee, H. C. et al. Review of the synthesis, transfer, characterization and growth mechanisms of single and multilayer graphene. RSC Adv. 7, 15644–15693 (2017). Article \n    CAS \n    \n                    Google Scholar Chen, Z. et al. Ultrahigh-frequency surface acoustic wave sensors with giant mass-loading effects on electrodes. ACS Sens. 5, 1657–1664 (2020). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Yoon, S. H., Baek, C. -K., Kong, B. D. Mm-wave surface acoustic wave filter based on hexagonal boron nitride. In 2021 IEEE 21st International Conference on Nanotechnology (NANO), 138–141 (2021). Chen, T.-A. et al. Wafer-scale single-crystal hexagonal boron nitride monolayers on Cu (111). Nature 579, 219–223 (2020). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Morgan, D. Surface Acoustic Wave Filters: With Applications to Electronic Communications and Signal Processing (Academic Press, 2007). Google Scholar Giles, A. J. et al. Ultralow-loss polaritons in isotopically pure boron nitride. Nat. Mater. 17, 134–139 (2018). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Liu, S. et al. Single crystal growth of millimeter-sized monoisotopic hexagonal boron nitride. Chem. Mater. 30, 6222–6225 (2018). Article \n    CAS \n    \n                    Google Scholar Kang, K. et al. Layer-by-layer assembly of two-dimensional materials into wafer-scale heterostructures. Nature 550, 229–233 (2017). Article \n    PubMed \n    \n                    Google Scholar Haigh, S. J. et al. Cross-sectional imaging of individual layers and buried interfaces of graphene-based heterostructures and superlattices. Nat. Mater. 11, 764–767 (2012). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Chen, Y. Nanofabrication by electron beam lithography and its applications: a review. Microelectron. Eng. 135, 57–72 (2015). Article \n    CAS \n    \n                    Google Scholar Vieu, C. et al. Electron beam lithography: Resolution limits and applications. Appl. Surf. Sci. 164, 111–117 (2000). Article \n    CAS \n    \n                    Google Scholar Download references This work has been supported by the Samsung Research Funding and Incubation Center of Samsung Electronics (SRFC-IT2102-01) and National Research Foundation (NRF) grant funded by the Korea government (Ministry of Science and ICT) (NRF-2021R1F1A1048580). Department of Electrical Engineering, Pohang University of Science and Technology (POSTECH), Pohang, 37673, Republic of Korea Seok Hyun Yoon & Byoung Don Kong Department of Convergence IT Engineering, Pohang University of Science and Technology (POSTECH), Pohang, 37673, Republic of Korea Chang-Ki Baek You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar B.D.K. conceived the idea and supervised the study. S.H.Y. performed DFT calculations and SAW filter simulation and design. C.-K.B. provided advice on the simulation and the structure of the devices. All the authors participated in the discussions and contributed to the manuscript. Correspondence to\n                Byoung Don Kong. The authors declare no competing interests. Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Open Access  This article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if changes were made. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit http://creativecommons.org/licenses/by/4.0/. Reprints and Permissions Yoon, S.H., Baek, CK. & Kong, B.D. mm-band surface acoustic wave devices utilizing two-dimensional boron nitride.\n                    Sci Rep 12, 20578 (2022). https://doi.org/10.1038/s41598-022-24852-9 Download citation Received: 27 September 2022 Accepted: 21 November 2022 Published: 29 November 2022 DOI: https://doi.org/10.1038/s41598-022-24852-9 Anyone you share the following link with will be able to read this content: Sorry, a shareable link is not currently available for this article.  Provided by the Springer Nature SharedIt content-sharing initiative By submitting a comment you agree to abide by our Terms and Community Guidelines. If you find something abusive or that does not comply with our terms or guidelines please flag it as inappropriate. Advertisement Scientific Reports (Sci Rep)\n                \n\nISSN 2045-2322 (online) © 2023 Springer Nature Limited Sign up for the Nature Briefing newsletter — what matters in science, free to your inbox daily. ",
    "datetime": null,
    "url": "https://www.nature.com/articles/s41598-022-24852-9"
}