{
    "title": "More People Learning Korean after ‘Squid Game’ TV Show",
    "text": "Print No media source currently available A company offering online language-learning services says more people are learning Korean after the launch of a popular Korean TV show on Netflix. The language-learning company, Duolingo, reported the sharp increase in Korean learners. In Great Britain, 76 percent more people than usual signed up to learn Korean. In the U.S., the number increased by 40 percent after the show started two weeks ago. The nine-part show is another example of Korean popular culture that has found success in the West. It comes after pop songs by the music group BTS and the international success of the movies Parasite and Minari. Parasite won the Academy Award for Best Picture in 2020. Korean culture is making a connection with English speakers. Recently, the Oxford English Dictionary added 26 new words that come from the Korean language, including “hallyu,” which means Korean wave. “Hallyu” is how people are describing the success of Korean pop culture outside of Asia. Sam Dalsimer is a spokesman for Duolingo. In an email to the Reuters news agency, he said, “What happens in pop culture and media often influences trends in language and language learning.” Dalsimer noted that as Korean film, music and television get more popular, more people will want to learn the language. South Korea’s president Moon Jae-in welcomed the additions to the dictionary and the interest in the language. He called the Korean alphabet an example of South Korea’s “soft power.” The Korea Foundation for International Cultural Exchange said there are about 77 million people around the world who speak Korean. Duolingo said about 8 million people are trying to learn Korean through its service. That is second only to Hindi.  South Korea’s King Sejong Institute teaches the language around the world. The cultural institute is named after the South Korean king credited with inventing the Korean alphabet. Fourteen years ago, only 740 students in three countries were learning Korean through the organization. Now, it teaches 76,000 students in 82 countries. Milica Martinovic is one of the institute’s students in Russia. She said she started learning Korean so she could understand popular music and television shows in Korean. Catarina Costa is a 24-year-old from Portugal. She lives in Toronto, Canada. She is studying Korean online through a website called TalkToMeInKorean.com. When she first started studying two years ago, many of her friends did not understand her interest. Now they do. “People are fascinated when I say that I am learning Korean,\" Costa said. Sun Hyun-woo started TalkToMeInKorean. He said there are now 1.2 million people studying the language in 190 countries using his website. He said even before the success of BTS and Korean TV shows and movies, thousands of people wanted to learn the language, but they were doing it alone. \"Now they are part of a 'global phenomenon'; learning Korean has turned into a much cooler pastime,\" he said. I’m Dan Friedell.  Dan Friedell adapted this story for Learning English based on a report by Reuters. Mario Ritter, Jr. was the editor. What is a language you would like to learn, aside from English? Tell us in the Comments Section and visit our Facebook page. ___________________________________________________________________   trend – n. something that is currently popular or fashionable institute – n. an organization created for a particular purpose (such as research or education) fascinate – v. to cause (someone) to be very interested in something or someone phenomenon – n. an event or interesting happening that can be observed and studied and that is not easy to explain or understand cool – adj. often used to show approval in a general way; popular with young people  ",
    "datetime": null,
    "url": "https://learningenglish.voanews.com/a/more-people-learning-korean-after-squid-game-tv-show/6269166.html"
}