{
    "title": "\r\n\tMore than Seoul: Travel Weekly\r\n",
    "text": "History and tradition beyond South Korea's capital  SEOUL, South Korea -- This country is roughly the size of Kentucky, enabling me to pack a lot into my recent one-week visit to this mountainous, beautifully scenic nation occupying the southern half of the Korean peninsula.The 500-day countdown to the 2018 Winter Olympics officially kicked off during my September visit, a much-heralded event that the government and proud citizens hope will bring global recognition and a fair share of prestige.I was greeted with the same timeless welcome that awaits Olympic-goers to this gracious country, a fascinating fusion of innovative technology and deeply embraced traditions. (View a slideshow here.)Most visitors begin in this city. Seoul is a densely built metropolis of surprises and contradictions: teahouses and Starbucks, ubiquitous signs of the K-pop music wave, countless restaurants (Koreans love to eat), boutiques and malls filled with designer brands (they also love to shop), Unesco-listed palaces and city walls built in the 14th century that snake up the guardian mountains that surround it. Stuck-in-time neighborhoods of wooden houses that follow the traditional architecture called hanok are overshadowed by ambitious architectural high-rises. At the city's heart is the unmissable spaceship-like Dongdaemun Design Plaza, also called the DDP, the collaboration of renowned Iraqi-British architect Zaha Hadid and the Korean studio Samoo. The capital city's population of 10 million (25 million if you count the greater metropolitan area) is a mix of Christian and Buddhist, with strong underpinnings of the teachings of Confucius. Theirs is a millennia-old history that is impressive and tumultuous, and a current history that is unique by any standards, thanks to its unpredictable sibling to the north.\"Even if you have to crawl on your knees,\" goes an old Korean saying, \"get yourself to Seoul.\" Although more than 8 million international visitors arrived during the first half of 2016, a substantial hike from 2015's poor showing (partially due to the result of the respiratory MERS outbreak), Korea must contend with fierce competition from other Asia-Pacific destinations such as Hong Kong and Thailand. With Chinese and Japanese making up 59% of visitors to Korea, local authorities are aiming to attract more travelers from the West.\"Korea is underappreciated and relatively unknown to most Americans, apart from possibly Seoul,\" said Catherine Heald, CEO and co-founder of New York-based Remote Lands, best known for personalized luxury itineraries for independent travelers. \"Very few American visitors ever go beyond Seoul, while in fact, Korea is an incredible country with an amazing history, rich culture and surprising beauty.\"It is indeed an irresistible package for those who, like me, have already experienced other regions of Asia, and one I had long wanted to visit. Honored to be invited by the Korea Tourism Organization, I met with Sang-hoon Na, the executive director of the group's New York office, who told me, \"Americans have yet to fully discover Korea as a travel destination, and that's where we come in, working toward building this momentum to increase awareness of Korea in the travel industry and to the American public.\" After we discussed the country's impressive list of attributes, Na closed on a topic close to his heart. \"I have always thought that Korea's most valuable asset is its people,\" he said. \"They are dynamic, passionate and warm.\" Despite a long history of invasion and occupation, South Korea has exhibited an impressive economic expansion over the last 60 years. Known for its spectacular rise from post-Korean War poverty to global power, it is now the fourth richest economy in Asia (after China, Japan and India, according to the International Monetary Fund) and the 11th largest in the world. The Bloomberg Innovation Index ranks it as No. 1 in 2016. With almost no natural resources, much of the nation's development is due to the country's rigorous educational system and highly motivated people.To the newly arrived visitor, much of Seoul may appear Westernized and homogenized, with household names of megamanufacturer Hyundai and electronics giant Samsung gracing office buildings and big-budget museums (the Samsung Art Museum is a stunner, designed by Mario Botta, Jean Nouvel and Rem Koolhaas).But there is also much to enjoy that is quintessentially Korean, such as K-wave (short for Korean Wave and locally nicknamed hallyu), the culture phenomenon that took root here in the 1990s and today encompasses music, films, TV dramas and soap operas, video games, cartoons and fashion. There is no overstating the popularity of the young, meticulously managed stars of K-pop music in Asia, and they are now reaching audiences farther afield.Consider taking a crash course in the K-wave phenomenon at the K-Style Hub, a four-story tourism and promotion facility in the Jung-gu district. I had my photo taken with virtual images of the K-pop celebs (I chose Psy, the King of K-pop, whose catchy \"Gangnam Style\" is YouTube's most viewed video), and checked out the interactive exhibits about the country's burgeoning medical tourism -- Korea is fast becoming the heart of medical and cosmetic surgery tourism in Asia, where requests abound for nose jobs and double-eyelid surgery to make eyes appear larger.  Korea's local cuisine is a revered element of everyday life. Restaurant options in Seoul are myriad and cheap, and markets are great and varied. At Gwangjang Market you can graze your way along hundreds of generations-old stands, sampling delicious snacks like deep-fried mung-bean pancakes (bindaetteok), the market's specialty. I passed up the pig's trotters, intestines and pickled baby octopus. Long alleys are lined with grandmotherly vendors selling massive vats of their homemade spicy pickled cabbage known as kimchi. It is the country's signature dish and accompanies every meal, including breakfast. It has recently earned recognition abroad for its health benefits and anti-aging powers. Korean food, in general, is painstakingly prepared from market-fresh products that follow the seasons, yet a love for all things American explains the growing number of Western fast-food chains.The local cuisine's rich diversity includes both the more elaborate royal cuisine and temple-style fare, which is spare, simple and aesthetically presented. It is served during temple stays as well as at a few specialized restaurants in Seoul.  I had glimpsed some of the privileged lifestyle of the Joseon Dynasty during a morning visit to Gyeongbokgung Palace, with its changing of the guard in traditional costumes, and Changdeokgung (prebook for the secret garden). They represent two of the five magnificent Joseon residences of decorative and colorfully painted Korean architecture.Korea House is an unrivaled setting that illustrates how such royalty may have once dined during the 500-year Joseon Dynasty era. Tables covered with more than a dozen dishes of traditional specialties are complemented by waiters dressed in the traditional high-waisted, spun-silk dress called a hanbok. I was hesitant about the hour-long performance of \"Sim Cheong\" in the 150-seat hall (it can be booked separately), expecting a kitschy display for tourists. But the costumes, musicians and dancers were all top-notch, and the folkloric storytelling, with some commentary in English, was easy and fun to follow.  \"It is such a pity that not many Americans know that we have more to offer than Seoul, kimchi and 'Gangnam Style,'\" Yoon-Sun Cho, Korea's newly appointed minister of tourism, sports and culture, told me during our meeting to discuss tourism. The conversation turned to the issue of safety and security; we both acknowledged how the country's reputation was overshadowed by the unresolved situation with North Korea. Cho spent many years working and studying in New York, where she witnessed the 9/11 attacks; she offered that such an experience might discourage the American traveler \"to consider Korea as a tourism destination, as it is often shown on U.S. media simply as a dangerous country which is vulnerable to threats.\"That evening in my hotel room, I watched CNN's breaking news coverage of a bomb explosion back home in a New York neighborhood just blocks from my apartment building. I emailed my friends who lived there, the very ones who had voiced reservations about my trip to Korea. We later acknowledged that there are no guarantees regarding safety these days. \"The truth is that people here have a normal and peaceful life on this small but beautiful and peaceful peninsula\" Cho said.  Hearing my plans to visit the nearby Demilitarized Zone (DMZ) the next day, she promised I'd be surprised at \"the high ecological and biodiversity value that will provide you with a profound, inspirational and extraordinary experience.\"Cho was right, of course. An over-150-mile-long buffer established in 1953, the DMZ is the country's most visited site after Seoul, just 35 miles away but a distance of light-years politically and culturally. On either side of the truce line is a more-than-mile-wide stretch of no man's land where military activity is forbidden; it has become a pristine refuge for wildlife, left untouched over the course of six decades, and thus an unlikely destination for ecominded tourists. As a first impression, it jars a visitor with the experience that awaits -- and the reason 3 million visitors come here each year -- a chance to peek at the notoriously secretive North Korea, a self-proclaimed \"socialist fairyland,\" and learn something about the Korean War of 1950 to 1953, a military memory still vivid to the U.S., which lost more than 33,870 soldiers in combat.Tightly organized bus tours are the only way to visit this heavily restricted area; most visitors choose half-day tours that include a number of sites, such as an infiltration tunnel discovered in 1978, one of 10 built to launch surprise attacks into South Korea; the Freedom Bridge, where South Koreans walked to freedom; and the Dora Observatory, where it is possible to peer through binoculars into the Democratic People's Republic of Korea, as North Korea is known. A full-day tour includes the Joint Security Area, where the Korean Armistice Agreement was signed in 1953 and which most consider the day's highlight. Educational and surreal, my day at the DMZ was one of the most interesting moments of my trip.  Things were considerably more upbeat at the site of the 2018 Winter Olympiad in the ski-resort town of Pyeongchang (Pyeong means \"peace\" and Chang means \"prosperity\"), located almost 112 miles east of Seoul in the Taebaek Mountains. South Korea's Games will be the first of three straight Olympiads to be held in Asia, joining the Tokyo Summer Games in 2020 and the Beijing Winter Games in 2022. Korea hopes to surpass the success it enjoyed with the 1988 Seoul Summer Olympics and the men's 2002 World Cup soccer championship, which were co-hosted with Japan.After two failed bids to bring the 2018 Olympic Games to this former agricultural province, the third time in 2011 was the charm, and South Korea beat out Germany and France in a landslide. Nearly 90% of the construction work is already completed in and around Pyeongchang, and a new high-speed KTX rail line that will reduce travel time to Seoul from three hours to one. The nearly two-square-mile Alpensia Resort, dubbed the Alps in Asia, will be the site of the opening ceremony and the nerve center of the games. Opened in 2010, it is home to the five-star InterContinental and four-star Holiday Inn. Organizers are hoping the games will encourage tourism, burnish the country's image, foster economic development and nurture talent for Korea to become a leading winter-sports destination.  \"If the 1988 Seoul Summer Olympic Games were a coming-out party for Korea,\" Cho told me, \"then I hope the Pyeongchang Games, to be hosted 30 years later, will serve as an opportunity to promote Korea as a culturally advanced country.\"While the skiing and ski jump competitions will take place in and around Pyeongchang, all the ice sports competitions will be held nearly 40 miles east in the coastal city of Gangneung. In preparation for the Winter Olympics and intended to be transformative of the region, Pritzker Prize-winning American architect Richard Meier created his first project in South Korea, the 15-story, 150-room Seamarq Hotel, overlooking the East Sea. It may well be the most architecturally significant of all the new construction happening in the Olympic zone.Curious to find a glimpse of the old Korea that can still be found in the mountainous countryside, I drove south to the province of Andong and the small but well-known historical village of Hahoe. More than 200 residents still live in this cluster of centuries-old wooden homes built during the Joseon Dynasty. Dirt roads meander past small garden plots and a school playground, while rice fields stretch as far as the eye can see. The village had its moments of fame when the U.K.'s Queen Elizabeth II visited in 1999, followed by U.S. president George Bush in 2005. We arrived at night at a small, modest inn reminiscent of the old-style ryokans of Japan, with thin but comfortable bedding on the floor, kept toasty by an underfloor heating system still used today. We woke up to the fresh morning air. When the mist lifted, it revealed a pine forest across the road and a view of the river that wraps around Hahoe on three sides.Gyeongju lived up to its reputation as a \"museum without walls,\" but a tight schedule limited us to just two highlights of this once flourishing capital of the Silla Dynasty (57 B.C. to 935). Bulguksa Temple is commonly considered Korea's most famous (and most visited) and the crowning glory of sophisticated Silla architecture. We joined busloads of Korean visitors and school groups to wander amid a timeless scenario of garden-lined ponds, stone pagodas and national-treasure bridges. The impressive sitting Buddha at the heart of the Seokguram Grotto has long been regarded as a protector of the country. Surrounded by deities and guardians and protected by a vaulted dome, it is a showcase of workmanship and engineering as outstanding today as it was at its creation in the eighth century.  With a flight to the subtropical island of Jeju departing the following day, we continued on to Busan, South Korea's second-largest city, for some whirlwind sightseeing (though it was also chosen for its proximity to its airport). From my hotel room's floor-to-ceiling windows at the Park Hyatt Busan, I could take in the Marine City neighborhood-in-progress, high-rise-backed sandy beaches and the suspension Diamond (Gwangan) Bridge, a city icon since its completion in 2003. The Park Hyatt has a prominent presence in Seoul, but this 33-story sister property designed by Pritzker-prize winner Daniel Libeskind has been a stunning addition to this coastal city since its opening in 2013.Busan is known for its port, growing in popularity as a cruise line port of call and for its bounty of seafood, which is on display in its busy Jagalchi Fish Market, the largest in the country. An early morning visit is reminiscent of Tokyo's Tsukiji.I passed on the Guinness Book of Records-accredited world's largest department store, with more than 680 stores and an ice-skating rink, in exchange for a somber visit to the United Nations Memorial Cemetery in Busan. The burial ground of U.N. soldiers of the Korean War from the 16 countries that sent combat troops, the U.S. presence looms large, although just 36 Americans are buried here. The rest were returned to the U.S. for interment.South Koreans talk about the island of Jeju, the country's largest, as if it were the promised land. And it promises a lot as the preferred domestic holiday destination, popular with the Chinese and Japanese as well as honeymooners, nature lovers, families, beach buffs and frazzled seekers of R & R. Volcanic -- it boasts the world's longest lava tube and the dormant volcano Hallasan, the country's highest peak -- Jeju is also semitropical and commonly dubbed the Korean Hawaii, and it offers plenty of natural wonders to keep outdoor enthusiasts busy. Walkers following the Olle Trails have 26 routes to choose from. The routes link up to circle the entire island, but they differ in length and difficulty. Coastal treks can bring you to Sunrise Peak and a cove where Jeju's famous haenyeo, or female divers, show up most days to sell the day's catch of sea urchins, conch or baby octopus. Now a dying breed, often in their 60s and 70s, they dive without equipment and are able to hold their breath for up to two minutes.From this idyllic escapist island, it was just an hour's flight to Seoul and my connecting Asiana flight back to New York. As for the 13.5-hour flight back to the U.S., it was spent enjoying a repeat loop of meal-nap-film, with lots of catch-up reading while in the lap of business class. Travel to the Far East has never been so comfortable. ",
    "datetime": null,
    "url": "https://www.travelweekly.com/Asia-Travel/More-than-Seoul"
}