{
    "title": "Mother of police chase suspect says he's 'more of a danger to himself'",
    "text": "LOUISVILLE, KY (WAVE) - A multi-county pursuit of a stolen tractor trailer cab ended shortly before 4 p.m. Friday on westbound Interstate 64 near Blankenbaker Parkway when the driver stopped the vehicle, jumped out and ran before numerous law enforcement officers tackled him.The scenario was upsetting, but familiar, to the suspect's mother. Two hours after Jeffersontown police took her son into custody Friday afternoon, Robyn Odell would need a visit from a WAVE 3 News crew to learn that 44-year-old Erik Atwell was facing charges of receiving stolen property, wanton endangerment, fleeing and evading and resisting arrest. \"It's almost like I'm numb inside,\" Odell said. \"I can't believe here we go again.\" The charges are similar to those Atwell began racking up 10 years ago; coinciding, his mother said, with a diagnosis of paranoid schizophrenia. \"The truck that we were chasing was stolen last evening,\" Jeffersontown Police Chief Rick Sanders said. \"From an area around Oxmoor Mall.\" Atwell had been a once been a long-haul trucker. \"I know that it sounds crazy  but he probably believes its somebody he knows,\" Odell said. \"And that he had permission.\" Police said he didn't. Louisville Metro officers began tailing the vehicle about 3 p.m. Friday, when the truck's owner called 911 to report that he'd spotted his stolen vehicle, Chief Sander said. \"They pursued the vehicle to I-264, I-71, the Gene Snyder and I-64 back to Blankenbaker,\" Thousands watched the pursuit unfold live on WAVE 3 News as our Air 3 helicopter tracked the pursuit eastbound on I-64 into Shelby County. The driver exited at the Simpsonville off-ramp and got back onto I-64 headed westbound for Louisville. \"We felt comfortable, actually watching this live from your cameras, staying behind this guy and apprehending him,\" Chief Sanders said. The pursuit ended on the right shoulder of I-64 West, between the Snyder and Blankenbaker Parkway exits. The driver bolted from the cab and began running. \"I don't know if he ran out of gas or just decided these guys (pursuing officers) aren't gonna stop,\" Chief Sanders said. \"He didn't get very far until they made a pretty good tackle, and he did resist arrest at that point.\" Odell's brother was watching the takedown on television and apprised her of it by telephone. \"He has done so well for four months now, thought maybe we were finally gonna have a year of peace and serenity,\" Odell said. Atwell had disappeared late last September, his mother said. She'd filed a Missing Persons report with Louisville Metro detectives and his car turned up in Oklahoma City about a week later. Atwell himself wouldn't resurface until seven weeks later, in Amarillo, Texas. Odell sent him a bus ticket so that he could return to her home in Hurstbourne's Oxmoor Woods subdivision Thanksgiving Day. Police took Atwell to the University of Louisville Hospital following Friday's arrest. He was treated for cuts and abrasions and sent to Louisville Metro Department of Corrections and charged with receiving stolen property over $10,000, fleeing or evading police, assault of a police officer, operating on a suspended or revoked operator's license, wanton endangerment and resisting arrest. He's being held on no bond, pending a Jail Court arraignment at 9 a.m. Saturday. \"We're just happy that it ended well,\" Chief Sanders said. \"Nobody was hurt, no cars were wrecked.\" Odell also is relieved. But wary. \"If he doesn't get back on his medicine and get regulated, he will be doing one odd thing after the other,\" she said. Copyright 2014 WAVE 3 News. All rights reserved. ",
    "datetime": "2014-03-22T08:55:32Z",
    "url": "https://www.wave3.com/story/25044087/mother-truck-theft-chase-suspect-is-more-of-a-danger-to-himself/"
}