{
    "title": "Mountain Wave K-9 Ava retiring after successful career",
    "text": "KOIN.com Please enter a search term. Please enter a search term. by: Jennifer Dowling and KOIN 6 News Staff Posted: Apr 15, 2018 / 10:46 PM PDT Updated: Apr 18, 2018 / 02:24 PM PDT by: Jennifer Dowling and KOIN 6 News Staff Posted: Apr 15, 2018 / 10:46 PM PDT Updated: Apr 18, 2018 / 02:24 PM PDT HILLSBORO, Ore. (KOIN) — Ava has had a decorated tenure with Mountain Wave Search and Rescue. But after 10 years and nearly 100 rescue missions, Ava is calling it a career, trading in searches for walks, games and plenty of treats. Becky Irving has been partners with Ava since Ava was 16 weeks old. She said she had two other search and rescue dogs before Ava. She said she had to guide those two during missions. But not for Ava. “I don’t have to help her,” Becky said of Ava. “She figures it out and gets it done.” And she got it done for years. In 2012, Ava found a missing bow hunter on a snowy day in Ripplebrook. When she found him, his fire had gone out and he was running out of wood. “He was happy to see a dog come and get him,” Becky said. Ava’s most notable find came just over a year ago. It was typical Ava. A toddler had gone missing in Portland in February, 2017. Ava was the second search dog deployed on that day — the first had tracked the toddler’s scent, but the trail had gone cold. Ava then took over, figured it out and got it done. “All of a sudden (Ava) just started dragging me so I’m trying to keep up,” Becky told KOIN 6 News last year. “She whipped around the corner of the building into this blackberry pile and basically I think she tried to avoid (the toddler) … As she did that, I looked down and there he was.” The toddler was found hidden in the blackberry bushes. Mountain Wave S&R gave Ava a big steak as a reward. “It’s an amazing way to go out for a dog who’s retiring to have such an incredible find,” Becky recalled. Ava’s work is not done yet, though. She still has to teach her apprentice, Quint, a black Belgian sheepdog. Quint is fast, but could use some of that innate skills that made Ava so good. “His nickname is Q flash,” Becky said, “and that’s because he’s like a bolt of lightning.” Still, Becky is going to miss Ava as her partner. “I have a bond with this dog,” Becky said, “I don’t have to ask her, she just knows.” Happy retirement Ava! pic.twitter.com/H4g2xP6hx4— Mountain Wave SAR (@MountainWaveSAR) April 16, 2018 Copyright 2023 Nexstar Media Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Although we’re still several weeks away, Black Friday is approaching fast, so it’s a good idea to get ahead of the curve and check out early deals. Amazon sells nearly every consumer product you can think of. And if you’re looking to save, this is a great time to shop. If you have a Squishmallow fan in your household, act fast because there’s a Squishmallow Advent this year that’s going to sell out soon. ",
    "datetime": "2018-04-16T05:46:21+00:00",
    "url": "https://www.koin.com/news/oregon/mountain-wave-k-9-ava-retiring-after-successful-career/"
}