{
    "title": "Myanmar has been obsessed with Korean culture for two decades and now, the wave is hitting - CNA",
    "text": "Asia Asia Dance group ALFA rehearse their performance in Yangon ahead of their planned original release in December. (Photo: Jack Board) YANGON: Zay Linn Htike remembers as a boy waiting to watch his family’s favourite Korean drama series at home. It was called Autumn In My Heart, a program that swept Myanmar close to two decades ago. “We didn’t have a generator. So if there was an electricity blackout, my mother grabbed me and went to another house, where people gathered and enjoyed Joon Suh and Eun Suh with the help of generator,” he recalled. “We were that crazy about Korean television series.” It was the early 2000s and Myanmar was living under the relative darkness and isolation of military rule. At that time there were only two television stations - both state run. “Back in the day it was 24-hour news and propaganda and nationalistic songs and then they’d have a one-hour belt of Korean shows. It was prime time. It was the only option,” said Jin Park, the general manager of MKCS Global, a major distributor of Korean entertainment content in Myanmar. Korean dramas flourished in the vacuum. And their huge popularity at that time laid the foundation for the surge of Hallyu - or Korean Wave - that Myanmar is starting to experience now. Zay Linn Htike is part of a generation that has grown up under the influence umbrella of Korean entertainment. He now goes by the moniker ‘Jay’ and is the leader of Myanmar super K-Pop group ALFA. At a small studio in northern Yangon, Jay and his bandmates are rehearsing their latest dance moves. Each of the six members sports a hairstyle that would not be out of place on the streets of Seoul. Today, they are performing dances to K-pop smash hits from the likes of global sensations BTS and EXO. But soon they will release their own original music, written and choreographed by Koreans, but with Myanmar lyrics and sensibilities. “When I was falling in love with Korean music, I started practicing dance. What I did was pause and play the album alternately, and imitate the way they danced,” Jay said. ALFA has built up a strong local following in Yangon and the group performs regular mini-concerts. Each of the members won their place in the group through a talent-search competition run by music and talent group JBJ Entertainment. “In the future, the Korean wave in Myanmar has a huge potential for development. I feel strongly that it has just started,” said JBJ music producer, Lee Geonhak. He says he has been amazed by the keenness of his local colleagues to embrace Korean culture and language. Some have been practising their speaking skills for years. “They are learning Korean language by watching Korean dramas. I was surprised to see that. And some friends know more about Korean idols or Korean culture than me. That also makes me surprised,” he said. Formally too, more people in Myanmar are taking the TOPIK, the proficiency test for Korean language. In 2016, 1826 took the test, a number that jumped to 3393 last year. On a basic level, the understanding of Korean expressions, food and culture is pervasive, according to Jin Park. And Hallyu has for many years successfully promoted Korea in a positive light in the minds of locals, he believes. “Korea is like a dreamland for people here,” he said. ‘Hello’ and ‘thank you’ in Korean, everyone knows. Everyone has watched at least one show.” How this was able to happen, some might call inevitable. But those close to the industry all trace it back to one woman - Jin Park’s mother. REACHING HEARTS After her family first moved to Myanmar in 1989, Eum Yun-Hee embraced the Burmese culture and language and ten years later was helping teach a small group students how to speak Korean. “She started a Korean language institute and somehow ended up teaching at a big TV station. The CEO’s daughter was one of my mum’s students and got close to the family,” Jin Park said. Together with celebrated local actress Grace Swe Zin Htaik, Eum, for the first time, began facilitating bringing in Korean programmes into Myanmar. “She was the bridging between the Korean culture, the scripts and the Myanmar consumer. She brought in the contacts and I introduced her here,” Grace said. With her team of language students, and a Masters Degree in Burmese in her repertoire, Park was in charge of subtitling the programs. The richness of the language is one of the reasons the stories were so embraced by Myanmar viewers, according to Grace. The structure of both languages are similar, meaning direct translation was made easier. “When the series came in, the translation was so touching. She is well read and she has a rich vocabulary,” she said. “It’s why Chinese series didn’t have success in the past. The choice of words didn’t reach the hearts of the consumer.” “The ideologies were mostly centred around family passion. Myanmar people are deeply feeling about family values. The conflicts were familiar to us and we became curious about the food, the beauty and the clothes. We tried to eat bulgogi and kimchi. The younger generation were excited,” she said. There was little incentive at the time for Korean producers to push their content into such a small and obscure market. While there was a strategy to extend reach into more mature markets like Thailand and Vietnam, Myanmar was completely off the grid. “The Korean side have only very recently started to show interest in Myanmar. For developed countries, they need to know what their returns are and Myanmar was a market they didn’t even know where it was,” Jin Park said. “The channels saw potential but not profit wise. For the Myanmar side it was convincing them to try it out. “It had to be someone like my mum who lived here, had her life here, spoke the language and understood both cultures. She became the mediator for both sides. It was luck and at the same time the opportunity wouldn’t have been there if there wasn’t someone like her.” ‘WE DON’T FORCE OUR CULTURE’ The Korean government uses Hallyu as a projection of soft power throughout the world, even though most of the entertainment industry in the country is privatised. The Myanmar experience is an example of that type of positive cultural projection. But officials say it is meant to be an unforced mutual exchange. “Culture is spontaneous. It’s not a policy area,” said OH Youna, First Secretary at the Embassy of the Republic of Korea in Myanmar. “We don’t force our culture on other countries,” she added. Investment in Myanmar still remains limited. But officials confirmed that more Korean firms have been looking at opportunities there in recent times, given the current National League for Democracy government’s efforts to improve the ease of doing business. There are already 200 Korean firms doing business in the republic, a segment of 1,000 different investment projects worth some US$250 million. It’s still at a very incipient stage compared to other ASEAN nations. There is a lot of space to develop and grow,” OH Youna said. But the momentum derived from the Korean wave is something that cannot be denied. The administration of President Moon Jae-in has set its sights more directly on Southeast Asia under its New Southern Policy and the Korean leader has already visited all ten member states since his election in 2017. And there is a special connection and common experience felt between the people of Korea and Myanmar, the embassy officials explained: A feeling that was perhaps reflected back in the dramas had made so much impact on Myanmar people. “Korea has also been through a dictatorship and now has a mature democracy. The government is also making progress on its peace process. Although the peace process is different in the two countries, they can be sympathetic and learn from each other,” she said. On the entertainment front, Korean television content has fallen far from its all pervasive days under military rule. While certain programs like variety hit Running Man still have a cult following among young people, drama series from the Philippines in particular now dominate local screens. Still, MKCS distributed more than 150 titles in Myanmar in 2018, the equivalent of 3,300 hours of content, according to the company. K-pop has taken its place, a phenomenon that locally-grown groups like ALFA can dream of making a career out of. It is a new wave that Myanmar has been awaiting for two decades. “It is not only in Myanmar, it is happening worldwide,” Jay said. “So, it is amazing for me.” Additional reporting by Kyaw Ye Lynn. Be among the first to know the Breaking news This service is not intended for persons residing in the E.U. By clicking subscribe, I agree to receive news updates and promotional material from Mediacorp and Mediacorp's partners. Copyright© Mediacorp 2023. Mediacorp Pte Ltd. All rights reserved. We know it's a hassle to switch browsers but we want your experience with CNA to be fast, secure and the best it can possibly be. To continue, upgrade to a supported browser or, for the finest experience, download the mobile app. Upgraded but still having issues? Contact us ",
    "datetime": null,
    "url": "https://www.channelnewsasia.com/asia/myanmar-has-been-obsessed-with-korean-culture-kpop-847656"
}