{
    "title": "Myanmar Inks Four Agreements With S.Korea to Cooperate on Education, Environment, Tech",
    "text": "Myanmar State Counselor Daw Aung San Suu Kyi and South Korean President Moon Jae-in pose for a photo at the ASEAN-ROK Commemorative Summit in Busan, South Korea. / Myanmar Ministry of Foreign Affairs YANGON—Myanmar signed four Memorandums of Understanding (MOUs) with South Korea on cooperation on fisheries; technical and vocational training; the environment; and development of digital economy, higher education, smart cities and connectivity during State Counselor Daw Aung San Suu Kyi’s trip to Busan earlier this week. The State Counselor visited the city from Nov. 25-27 to attend the ASEAN-ROK Commemorative Summit and 1st Mekong-ROK Summit, which are a part of Korea’s New Southern Policy to deepen relations, including economic ties, with Southeast Asian nations. Daw Aung San Suu Kyi held a bilateral meeting with South Korean President Moon Jae-in during the ASEAN-ROK Commemorative Summit on Tuesday. After the meeting, three MOUs were signed between the two countries— “Cooperation in Fisheries”, “Cooperation in the Field of Technical and Vocational Education and Training” and “Comprehensive Environmental Cooperation”. Another MOU on development cooperation was signed between South Korea and five ASEAN countries including Myanmar at a ceremony to mark the 2019 International Development Cooperation Day. Under the latter agreement, South Korea and five ASEAN countries (Myanmar, Cambodia, Laos, Vietnam and the Philippines) pledge to strengthen cooperation in the areas of digital economy, higher education, eliminating explosive remnants of war, smart cities and connectivity. During the meeting with Daw Aung San Suu Kyi, Moon pledged to enhance the Seoul-Naypyitaw partnership, with a particular focus on expanding cooperation on culture, education, agriculture, fisheries, environment, infrastructure and rural development as well as fostering people-to-people contacts, according to a press release from the Myanmar Ministry of Foreign Affairs. The two sides also discussed the possible recruitment of more workers from Myanmar under Korea’s Employment Permit System, the involvement of young Myanmar fans of Korean popular culture in the K-Wave Academy, and the launch of a solar power station in Mann Aung, Rakhine State. During the trip, Daw Aung San Suu Kyi delivered keynote speeches at the ASEAN-ROK Culture Innovation Summit and the ASEAN-ROK CEO Summit. She also held roundtable talks with Korean students learning the Burmese language at the Busan University of Foreign Studies, and with Myanmar students at Pukyong National University. She also met with Myanmar nationals residing in South Korea and answered questions from Myanmar workers. During the 1st Mekong-ROK Summit, South Korea and the five Mekong nations including Myanmar adopted the Mekong-Han River Declaration, pledging to increase cooperation in seven areas; culture and tourism, human resources development, agriculture and rural development, infrastructure, information and communications technology, the environment, and nonconventional security. In the joint declaration the six countries stated they would collaborate to apply information and communications technologies in education, emerging industries, forest conservation and other areas. In September, Moon visited Myanmar as part of his tour of the region to build closer ties with ASEAN countries. During his trip, Myanmar and Korea signed a total of 10 MOUs and a framework agreement. These included government-to-government, government-to-business and business-to-business collaborations. South Korea is one of Myanmar’s largest Asian economic partners; as of October, it was the sixth-largest foreign investor overall, with US$3.97 billion (5.99 trillion kyats) invested in 179 enterprises, according to the Directorate of Investment and Company Administration, the Myanmar government’s investment agency. ... Subscribe here for daily updates.  Founded in 1993 by a group of Myanmar journalists living in exile in Thailand, The Irrawaddy is a leading source of reliable news, information, and analysis on Burma/Myanmar and the Southeast Asian region. From its inception, The Irrawaddy has been an independent news media group, unaffiliated with any political party, organization or government. We believe that media must be free and independent and we strive to preserve press freedom. © 2023 Irrawaddy Publishing Group. All Rights Reserved © 2023 Irrawaddy Publishing Group. All Rights Reserved ",
    "datetime": "2019-11-28T11:35:55+00:00",
    "url": "https://www.irrawaddy.com/news/burma/myanmar-inks-four-agreements-with-s-korea-to-cooperate-on-education-environment-tech.html"
}