{
    "title": "N.J. man fined $32K for illegal GPS device that disrupted Newark airport system - nj.com",
    "text": "The FCC said an aircraft tracking system at Newark Liberty International Airport experienced interference from a GPS jamming device used by a Readington man  who claimed he was simply trying to hide his whereabouts from his employer. The FCC fined the driver $31,875. NEWARK — The Federal Communications Commission has fined a Readington man nearly $32,000 after concluding he interfered with Newark Liberty International Airport's satellite-based tracking system when he used an illegal GPS jamming device in his pickup truck to hide his whereabouts from his employer. Disrupting satellite signals can hinder air traffic controllers’ ability to receive accurate information about a plane’s location in the air and on the runway. In what is known as a notice of apparent liability posted on its website last Friday, the FCC imposed the civil penalty on Gary Bojczak, who lives in the Whitehouse Station section of Readington in Hunterdon County. Bojczak does not have a listed phone number and could not be reached for comment. A LinkedIn page for a man with the same name says he has been a chief engineer for a construction firm. The FCC said in its notice that its enforcement division received a complaint last August from the Federal Aviation Administration that the satellite-based tracking system at Newark Liberty was experiencing interference. Known as a ground-based augmentation system, or GBAS, the tracking system uses satellite navigation technology to provide aircraft with precise location information to aid in takeoffs, landings and movements around the airport. System interference blocks the transmission of that data. An investigator from the FCC’s enforcement division went to Newark Liberty on Aug. 4, 2012. Using radio monitoring equipment, he located a red Ford F-150 pickup on airport property that was emanating signals within a restricted frequency band used by the augmentation system. “The signals emanating from the vehicle were blocking the reception of GPS signals” used by the air traffic control system, the FCC said in its notice. “Mr. Bojczak claimed that he installed and operated the jamming device in his company-supplied vehicle to block the GPS … system that his employer installed in the vehicle,” the FCC decision stated. Bojczak surrendered the jamming device, the agent shut it off and the signal ceased, according to the decision. Satellite technology, now common, is widely viewed as the future of air traffic control. Proponents say it allows jets to take off, land and taxi at airports more closely, yet more safely and efficiently, thanks to precise data on their location and movement. Satellite technology is the basic component of the FAA’s planned NextGen national air traffic control system to replace an antiquated radar-based system. Implementation of NextGen is a multiyear, multibillion project in its infant stages. In 2008, Newark Liberty became the first airport in the country to adopt satellite technology to help improve on-time performance, under an agreement between the Port Authority of New York and New Jersey, which operates the airport, and the hub’s largest carrier, Continental Airlines (now United Airlines). Houston’s Bush International Airport has begun using a similar system, developed by Honeywell. Interference from GPS systems in vehicles traveling along the New Jersey Turnpike near the airport have caused problems for the system in the past, even forcing its suspension at one point, said Mary Clark, a spokeswoman for United Airlines. “The Port Authority, Honeywell and FAA invested considerable resources to discover the source of GPS interference and have made adjustments to the system to overcome the impacts of these devices passing by on the turnpike,” Clark said in a statement. Referring to last August’s case, she said the incident “occurred on the airport in close proximity to the equipment and caused it to go ‘offline’ as designed.” Clark said last night that no flights were ever in danger. The use of onboard GPS devices to track the movement of company vehicles is increasingly common, said Jeff Bader, president of the Association of Bi-State Motor Carriers, a regional trucking group. “It’s the wave of the future,” Bader said. •Half of nation's airport delays traced to problems in this region • Satellite air traffic control to be tested at Newark Liberty If you purchase a product or register for an account through a link on our site, we may receive compensation. By using this site, you consent to our User Agreement and agree that your clicks, interactions, and personal information may be collected, recorded, and/or stored by us and social media and other third-party partners in accordance with our Privacy Policy. Use of and/or registration on any portion of this site constitutes acceptance of our  User Agreement (updated 4/4/2023),  Privacy Policy and Cookie Statement,  and Your Privacy Choices and Rights  (updated 7/1/2023). Cookie Settings/Do Not Sell My Personal Information © 2023 Advance Local Media LLC. All rights reserved (About Us). The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Advance Local. Community Rules apply to all content you upload or otherwise submit to this site. YouTube’s privacy policy is available here and YouTube’s terms of service is available here. Ad Choices ",
    "datetime": "2013-08-09T00:28:00Z",
    "url": "https://www.nj.com/news/2013/08/man_fined_32000_for_blocking_newark_airport_tracking_system.html"
}