{
    "title": "National Institute of Korean Medicine shows a new trend in Korean Medicine in Times Square, New York",
    "text": "Korean wave towards K-medicine, from K-food, K-pop and K-movies SEOUL, South Korea, Nov. 7, 2022 /PRNewswire/ -- The National Development Institute of Korean Medicine (NIKOM) said a promotional video showing the value of Korean Medicine will be played on the electronic display of the Nasdaq building in Times Square, New York on November 11. The promotional video will be played for 15 minutes, from 12:30 p.m. to 12:45 p.m., conveys a message that anyone in the world can use Korean Medicine easily in a fun way. It shows the value and role of Korean Medicine in the daily lives of modern men using the currently trending concept of SNS. It highlights how foreign tourists can experience Korean Medicine directly through herbal foot baths or oriental medical treatments, in addition to sightseeing in famous tour spots in Korea. Interest in Korean Medicine -- Korea's traditional medicine -- is increasing amid the unprecedented interest in Korea after a lot of cultural content captivated the world in quick succession, including the boyband \"BTS,\" the film \"Parasite\" and the drama series \"Squid Game.\" Korean Medicine is solidifying its foothold in development by conducting numerous clinical research studies through scientific, standardization and modernization policies based on Korea's traditional medicine. With its safety and effectiveness proven, the number of people who come to Korea for medicinal purposes has been increasing every year. NIKOM, presenting the value and excellence of Korean Medicine to the world, is expecting the promotional video to arouse the interest of people who are unfamiliar with Korean Medicine. The video is also posted on the website, YouTube and Facebook channels of NIKOM for anyone interested in Korean Medicine. Moreover, an online event will run to share the video with more people. Some of those who record video footage of the electronic display and post it on their SNS accounts or share the video posted on the YouTube channel will be given gifts through a raffle. For details, check the Facebook channel (https://www.facebook.com/hanuikm/). Director Jeong Chang-hyun of NIKOM said, \"Korean Medicine is developing every day through continuous research,\" adding \"We hope the video will bring people interested in Korean culture closer to Korean Medicine.\" Meanwhile, NIKOM is taking initiative in cultivating the Korean Medicine industry and exhibiting the excellence of Korean Medicine to the world as a public agency under the Ministry of Health and Welfare. View original content to download multimedia:https://www.prnewswire.com/news-releases/national-institute-of-korean-medicine-shows-a-new-trend-in-korean-medicine-in-times-square-new-york-301668665.html SOURCE NIKOM ",
    "datetime": null,
    "url": "https://finance.yahoo.com/news/national-institute-korean-medicine-shows-150000372.html"
}