{
    "title": "Netflix's 'Squid Game' Is Part of a 'K-Wave' Years in the Making",
    "text": "Jump to        Netflix's \"Squid Game,\" a Korean-language series about hundreds of people who participate in deadly games for a cash prize, is the streaming giant's biggest TV series ever. The company said on Tuesday that it was watched by 142 million members in its first month, well ahead of its No. 2 show, \"Bridgerton.\" \"Squid Game\" highlights how far ahead Netflix is in international content compared to streaming rivals, but it's not just the Netflix effect that turned the show into a phenomenon. Alvin Foo, a Netflix marketing exec, attributed the show's success partly to the \"K-wave,\" or a surge in popularity of South Korean content that also includes the Oscar best picture winner \"Parasite\" and the music group BTS. This week, \"My Name,\" another South Korean series, is among Netflix's most popular titles. This Korean wave has been about \"30 years in the making,\" said Robert Ji-Song Ku, an associate professor of Asian and Asian-American studies at the State University of New York at Binghamton. Ku, who was born in South Korea, said that the roots of it can be traced back to the 1990s, when the region aggressively tried to become a \"soft power\" in culture after facing a financial crisis, easing up on censorship as a result. \"There was an effort to turn music, cinema, and TV into exportable commodities,\" he said. \"The Korean wave begins in the '90s in places like China and Japan. From 2000 onward, there was a steady but increased consumption of Korean pop culture, starting in neighboring Asian nations and branching out.\" The period birthed young Korean filmmakers — such as \"Parasite\" director Bong Joon-ho and \"Oldboy\" director Park Chan-Wook — who found international fame and were \"bold in the way they approached genre to convey the complexities of Korean society,\" said Jason Bechervaise, a Seoul-based professor in the entertainment and arts management department at Korea Soongsil Cyber University. Another reason \"Squid Game\" became such a phenomenon, according Foo, the Netflix marketing exec, is that it's about \"widening economic inequality,\" which \"strikes a chord around the world.\" Ku noted that there is an \"increasing economic gap\" in South Korea that both \"Squid Game\" and \"Parasite\" tackle. Netflix was quick to capitalize on Korean content and it committed $500 million to the region this year. Other companies, such as Amazon and Disney, are also ramping up their efforts. And that won't be the only competition. Local studios \"will have to respond in order to compete,\" Bechervaise said. \"The industry is entering a new phase with streamers coming in and this will ultimately shape how the industry will look for the coming decade or more,\" Bechervaise said. \"There are local players like Showbox and there are American content providers like Netflix, and with Korean content in such demand, it's going to get extremely competitive.\" Ku thinks that the Korean wave is only going to grow. He noted that the Korean actor Seo Jun Park is starring in Marvel Studios' upcoming movie \"The Marvels.\" And he thinks that Korean game and talk shows that are big with audiences throughout Asia will grow in popularity on Netflix and other streaming platforms. \"The wave is always evolving,\" he said. \"It started out like the Gremlins. A cute little thing and then water was thrown on it. This is just the beginning of a tsunami.\" Disclosure: Mathias Döpfner, CEO of Business Insider's parent company, Axel Springer, is a Netflix board member. Read next ",
    "datetime": null,
    "url": "https://www.businessinsider.com/squid-game-part-of-k-wave-years-in-the-making-2021-10"
}