{
    "title": "New themed cruises let you ride the K-pop wave and go on cycling expeditions | The Straits Times",
    "text": "Think that cruises are for retirees and seniors? New, niche cruises might just change your mind and have you hopping aboard a ship soon. Much like the current trend of themed cafes geared towards specific interests such as cycling, cats and books, cruise operators and event organisers are designing onboard experiences that revolve around specific interests such as cooking, Korean culture and electronic dance music to woo a wider audience. Here are five ways to cruise without snoozing. For K-POP fans: Korean NANTA @ Sea on SuperStar Gemini  Organised by Star Cruises and supported by Korean media company Hannah Press, the Embassy of the Republic of Korea in Singapore and Korea Tourism Organisation, this Korean-themed cruise will offer a basic Korean language class, K-pop line dancing class, and art and craft sessions focusing on crafts such as Korean paper fans and paper dolls, amongst other Korea-themed programmes. Also catch Broadway hit Nanta (Cookin'), which combines food with percussion and comedy. The ship sails to Kuala Lumpur, Malacca, Penang and Langkawi. When: Nov 14 to Jan 2, 2015Tickets: $578 to $997 per person (varies according to length of trip and destination)Info: www.starcruises.com For cycling enthusiasts: Cycling Expeditions with Star Cruises  Star Cruises has offered two cycling expeditions over the past two years to destinations such as Phuket, Penang and Langkawi. The cruise comes with conditioning classes conducted by a professional trainer onboard, free cycling jerseys and workshops on safety. For information on upcoming cruises, go to www.facebook.com/groups/tourdestarcruises. For party animals: It's The Ship by The LiveScape Group  Billed as Asia's first music festival on a ship, this five-day, four-night event boasts a line-up of over 40 international and regional DJ and electronic dance music acts such as Basement Jaxx, Dash Berlin and Chvrches. Organised by Malaysian company The LiveScape Group, the cruiseliner will dock at Langkawi on Nov 23 for a beach party headlined by American rapper Lil Jon. The cruise liner, Voyager of The Seas by Royal Caribbean International, will boast five stages for an ultimate party experience. When: Nov 21 to 25 (registration closes on Nov 1)Tickets: US$538 (S$684) to US$1,568 for quad-sharing, US$628 to US$1,858 for triple-sharing, and US$728 to US$2,548 for twin-sharing. (Prices include meals and access to 80 per cent of the ship's facilities. Excludes alcoholic beverages)Info: www.itstheship.com For wine lovers: Sunset Wine Cruise with Blue Star Yachting  Enjoy a packaged deal that includes a champagne and red and white wines, paired with food such as cheese cubes, on these three-hour weekday sunset cruises. The charter yacht company is partnering wine distributor Wine Directions to offer a selection of Australian and New Zealand wines such as Tarrawarra Estate Pinot Noir 2010. Besides providing the tipple, \"wine host\" Arjen Blom from Wine Directions will share information about the wines during the ride. The 37-seater catamaran sails down Lazarus and St. John's islands and plies along the Sentosa Cove area on the way back, just in time to catch the fireworks show, Wings of Time, at Sentosa. When: Weekdays, 6 to 9pmTickets: $2,050 (for 23 people) to $2,550 (for 37 people) for three-hour cruises, wine packages are an additional $90 (for a selection of four wines) to $120 (for a selection of five wines) per personInfo: www.bluestaryachting.net For aspiring chefs: Culinary School by SilverSea Cruises  These L'Ecole des Chefs Voyage cruises are hosted by SilverSea's culinary trainer, Chef David Bisland, and are designed by Relais & Chateaux, a global association of 500 prestigious hotels and restaurants. Enjoy cooking demonstrations, private lunches with the chef and cooking competitions. A special \"Market to Plate\" segment is offered at certain destinations, where guests will be taken to a market to shop for fresh ingredients, followed by a cooking class onboard the ship or on a Relais & Chateaux property. For information on upcoming cruises, go to www.silversea.com. nabilahs@sph.com.sg Join ST's Telegram channel and get the latest breaking news delivered to you. Read 3 articles and stand to win rewards Spin the wheel now MCI (P) 066/10/2023. Published by SPH Media Limited, Co. Regn. No. 202120748H. Copyright © 2023 SPH Media Limited. All rights reserved. ",
    "datetime": "2014-10-17T06:00:00+08:00",
    "url": "https://www.straitstimes.com/lifestyle/travel/new-themed-cruises-let-you-ride-the-k-pop-wave-and-go-on-cycling-expeditions"
}