{
    "title": "New kits for nat'l football teams unveiled | Yonhap News Agency",
    "text": "All Headlines North Korea Sports Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies URL is copied. SEOUL, Feb. 6 (Yonhap) -- New uniforms for the South Korean national football teams were released on Thursday, featuring designs inspired by the global popularity of the country's pop culture and by a mythological guardian animal. Nike unveiled the new home and away kits for South Korea, with hallyu, or the Korean wave, the phenomenon of Korean culture's popularity, at the forefront. The home kit is highlighted by a wavy pattern made up of the trigrams from the South Korean national flag, Taegeukgi. The trigrams are also featured on the names and numbers on the back of the shirt. Pink on the upper body section transitions into red through the torso and the shorts. The word \"Korea\" appears on the socks below Nike's famous swoosh. This photo provided by Nike on Feb. 6, 2020, shows new home (R) and away kits for the South Korean national football teams. (PHOTO NOT FOR SALE) (Yonhap)  The away kit features a white tiger print on the jersey and socks. Nike said all the stripes in the print were hand-painted by its design team. \"A sacred creature believed to be a guardian animal in Korean mythology, the white tiger symbolizes courage and power,\" Nike explained. \"Complemented by metallic gold swoosh and crest applications, the kit is intended to feel a bit luxurious.\" The company said it took a scientific approach to designing these new kits, analyzing data on more than 300 footballers and football-specific movements. The design team used 4D visualization tools to determine how the kits will perform on players' bodies in terms of stretching, draping and fit. Nike said the new kits are \"55 percent faster wicking, 13 percent more breathable and with 10 percent more stretch than Nike's previous kits.\" According to Nike, South Korea's extended collection, which will also include overalls, sunglasses and women's apparel, will be available across Nike shops and its online store starting in April. jeeho@yna.co.kr(END) All News National North Korea Economy/Finance Biz Culture/K-pop Sports Images Videos Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies Korea in Brief Useful Links Festival Calendar Weather Advertise with Yonhap News Agency ",
    "datetime": "2020-02-06T14:14:56+09:00",
    "url": "https://en.yna.co.kr/view/AEN20200206007300315"
}