{
    "title": "New wave buoy off Pearl Harbor to measure ocean conditions | University of Hawaiʻi System News",
    "text": "On June 6, the Pacific Islands Ocean Observing System (PacIOOS) deployed a new wave buoy near the entrance to Pearl Harbor, approximately 1.5 miles offshore. The wave buoy provides accurate information on wave height, direction and period, and also measures surface currents and sea surface temperature. Wave buoy data benefit the entire community and are important to make well-informed and safe decisions. Real-time wave information improves surf and ocean observations, and enhances wave modeling and surf forecasting. All wave buoy data are available online and free of charge. “County, state and federal agencies, such as the U.S. Coast Guard, U.S. Navy and NOAA’s National Weather Service, incorporate wave buoy data into their daily operational decision-making processes. Many commercial and recreational ocean users, community members, and researchers, also rely on the data,” said Melissa Iwamoto, director of University of Hawaiʻi at Mānoa PacIOOS. “We are therefore extremely excited to offer a new observing asset to augment the existing network and better serve our community of users.” The wave buoy off Pearl Harbor is the first PacIOOS wave buoy with the capability to measure surface currents at 10 minute intervals. Currents data, along with wave information, will help to enhance marine safety, navigation and harbor operations on Oʻahu’s south shore, in particular in the waters around Pearl Harbor. The location of the buoy has been issued as a notice to mariners and will be included on nautical charts; however, the buoy is constantly in motion and can drift from its charted position. To keep the buoy and its sensors operational, vessel operators and other ocean users are asked to maintain a stand-off distance of at least 300 feet to avoid collisions and damage to the buoy. Boaters, kayakers and stand-up paddlers are asked to refrain from tying to the equipment and to avoid fishing near the buoy. The Hawaiʻi Natural Energy Institute at UH Mānoa provided the initial support to purchase this buoy with funding from the Office of Naval Research. The buoy joins a network of 15 real-time wave buoys across the Pacific Islands, owned and operated by PacIOOS. Data management for the PacIOOS wave buoys is made possible through long-term partnerships with the U.S. Army Corps of Engineers and the Coastal Data Information Program. Learn more about other PacIOOS wave buoys. Hawaiʻi fishermen can win prizes for reporting catches of newly released pāpio If required, information contained on this website can be made available in an alternative format upon request.\nGet Adobe Acrobat Reader About\nCalendar\nCOVID-19 Updates\nDirectory\nEmergency Information\nFor Media\nMyUH\nWork at UH English Gagana Samoa Kapasen Chuuk Tiếng Việt ภาษาไทย Ilokano Tagalog Cebuano Kajin Majôl 简体中文 繁體中文 日本語 한국어 Español ʻŌlelo Hawaiʻi ",
    "datetime": null,
    "url": "https://www.hawaii.edu/news/2017/06/09/pearl-harbor-wave-buoy/"
}