{
    "title": "New Tides for KCON as Korean Cultural Wave Grows – The Hollywood Reporter",
    "text": "Subscribe for full access to The Hollywood Reporter Subscribe for full access to The Hollywood Reporter KCON was where BTS held its first stateside performance, back in 2014. However, with K-pop's exponential growth, the convention now finds itself having to share the spotlight with Korean groups launching their own North American tours. By \n\n\tSara Merican Outside the Los Angeles Convention Center on Aug. 18, fans gathered for spontaneous dance sessions, while others handed out homemade fan art, posters and photo cards featuring their favorite pop stars. A little further down, around 20 food trucks lined a street, selling Korean and fusion fare: rice cakes tossed in red chili pepper paste, barbecued meat smoking on grills in the sweltering late-afternoon heat. Downtown L.A. was flooded with all things Korean last weekend, as a record-breaking 103,000 fans congregated for KCON LA. The hybrid convention-concert celebrating K-pop, which this year expanded to four days, started in 2012 with around 10,000 fans turning out for a one-day symposium in L.A. What seemed like a niche subculture back then has now morphed into a global cultural phenomenon, with sold-out international concerts, legions of fans, highly active online communities, and social media engagement rates that far surpass acts like Beyoncé and Taylor Swift. CJ ENM, the Korean conglomerate behind KCON, has now expanded the conventions to New York and beyond — Mexico, Australia, Japan, Thailand, among others. Related Stories\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tTV\n\t\t\t\n\n\n\n\t\n\t\t\n\t\t\t\t\t'In Love and Deep Water' Trailer Sees Love Blossom Amid Murder in Yuji Sakamoto's Netflix Drama\t\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tMovies\n\t\t\t\n\n\n\n\t\n\t\t\n\t\t\t\t\t'Perfect Days' Star Koji Yakusho on the Making of Wim Wenders' Oscar Contender “Up until BIGBANG, 2NE1 and Psy [became] huge, I didn’t imagine that K-pop could be as big as it is right now,” says Peter Chun, the former U.S. business director for (Psy’s former label) YG Entertainment and founder of recently launched K-pop content aggregation and community app, theQoos. “Now, BTS and BLACKPINK do Coachella, Stephen Colbert, late night shows, Good Morning America, Ellen, all in one month. When Girls’ Generation was on David Letterman [in 2012], it was the biggest deal in the world. Now [even more] groups are doing all these shows. The door has finally broken down.” With this exponential growth, however, KCON now finds itself having to share the spotlight. Previously, it served as the prime destination in the United States for Korean groups to perform and break into the North American market, but numerous bands have since launched their own North American tours in the past few years. For example, it was at KCON in 2014 that BTS held its first official stateside performance; this May, it topped Billboard‘s monthly Boxscore chart with the top-grossing tour, selling out shows in stadiums worldwide, including the Rose Bowl, New York’s Citi Field and London’s Wembley Stadium. Meanwhile, this year, girl group BLACKPINK performed at Coachella, while next month’s iHeartRadio Music Festival will feature Korean male group MONSTA X.  There is perhaps no better illustration of the genre’s proliferation than the fact that the same weekend that KCON LA was happening at the L.A. Convention Center and Staples Center, just 3.5 miles away, upstart Asian hip-hop festival Head in the Clouds was taking place at the L.A. State Historic Park. The one-day event, presented by label and management company 88Rising, is in its second year and featured a mix of underground global Asian artists like Dumbfoundead and Rich Brian with K-pop artists such as iKON and GOT7 member Jackson Wang. Chun adds, “You would never expect that they could do two big festivals at one time. So it’s growing, for sure.” KCON digital media manager Vanessa Augsbach notes another change in the K-pop landscape: Bands are globally focused from the beginning. For example, ATEEZ and TXT (the latter is under the same label as BTS, Big Hit Entertainment) toured in the U.S. almost within a year of their debuts. “In 2012, it was unthinkable for a new band to immediately go on an international tour,” she says, adding that she does not see these individual artist tours in America as competition for KCON, but instead as a healthy part of the K-pop ecosystem. “Having so many concerts grows our fan base, the number of people who would be interested in going to an event like KCON.” Indeed, with rising attendance each year — including its KCON New York edition, which began in 2015 and saw an unprecedented 53,000 attendees last month — KCON is not facing a diminished relevance but instead a different one. “These acts that used to be on KCON are doing their own world tours,” says Warner Records A&R consultant Eddie Nam, who is founder and CEO of L.A.-based EN Management, which reps Eric Nam (his brother), Epik High and Tablo. “I don’t think that diminishes what KCON’s impact is. Because it’s not just even about the music side. They have a whole convention side, a community and all that.”  This year’s edition featured boy bands like SEVENTEEN and Stray Kids, as well as female groups like MAMAMOO and ITZY. The list of performers and bands chosen for each KCON is based off of data indicating interest and popularity, gleaned from tens of thousands of official KCON survey responses submitted each year. Organizers say that almost half of KCON LA attendees hail from outside Southern California, with only 7 percent from Los Angeles itself. Most are female, with around two-third under age 24. Around a quarter of attendees are white, 19 percent are Hispanic and 42 percent Asian American (with a large proportion of Chinese and Filipino descent). The convention also featured fan meet-ups, artist engagement sessions, panels on K-pop and mental health and beauty workshops. “The way they scaled, kept the level up, expanded into different cities, really shows the power of K-pop and how international it has become. You can look at it as a cornerstone of this industry and of the live-touring industry for sure.” Nam says. “Think about how many important people come — curious managers, A&Rs and agents — because they are like, I need to see what this is about. When they see 15,000 to 20,000 screaming fans for hours, I’m sure they just see huge opportunities…. It’s exciting times.” Sign up for THR news straight to your inbox every day Sign up for THR news straight to your inbox every day Subscribe for full access to The Hollywood Reporter Send us a tip using our anonymous form. ",
    "datetime": "2019-08-25T18:41:56+00:00",
    "url": "https://www.hollywoodreporter.com/lifestyle/lifestyle-news/new-tides-kcon-as-korean-cultural-wave-grows-1233968/"
}