{
    "title": "New Orleans Rapper K. Gates Is Not Kevin Gates, and He's Not Having Sex with His Cousin",
    "text": "Photos courtesy of K. Gates/the Wave New Orleans rapper K. Gates (born Kwame Gates) hustled for years before getting his first taste of mainstream success in 2009 with the song \"Black and Gold (Who Dat),\" the unofficial theme song of the Saints football franchise as they headed to their first and only Super Bowl win. During that same year, fledgling Baton Rouge rapper Kevin Gates (born Kevin Gilyard) was on his way back to prison—coincidentally around the same that Baton Rouge's favorite son Lil Boosie (who rhymed with Kevin Gates on the 2008 single \"Get in the Way\") was also incarcerated on drug charges. Following his release from jail in 2011, Kevin Gates signed to Young Money, and then with Atlantic Records in 2013. Kevin Gates has since gone on to far more national acclaim than K. Gates. He has also become notorious on the internet for owning up to some kinky sexual preferences. Most recently, when he found out the woman he was dating was a cousin of his, he unapologetically announced that he would continue fucking her. All of this Kevin Gates drama has made New Orleans's original K. Gates very tough to google. I got in touch with him—now going by the equally ungoogleable stage name the Wave—to talk about how the rise of pervy Kevin Gates has affected his own life and career. (Unfortunately, neither Kevin Gates or his management replied to my interview requests.) VICE: Is it safe to say that being mistaken for Kevin Gates has caused you some problems?\nK. Gates: Correct. That's why I actually had to change my name to the Wave. But Kevin Gates is actually inspired by me. He's named after me—he's a fan of mine and he took the name. His name is Kevin Gilyard, and over the years he's always been in contact with me. I just recently found out \"Gates\" wasn't his government name. How do you know he took your name?\nWell, he used to always tap me and quote my lyrics and whatnot. I don't listen to his music, but when we see each other he'll rap my lyrics to me. When we first met, he asked if we were related—because he was trying to see if we were related, I was assuming \"Gates\" was his government name. When I found out it wasn't, years later, it's like, Why would you even ask that, knowing it's a name you took? It was crazy. He's a weird guy. When did you change your name to the Wave?\nSome time in 2014, around the time of his first scandal, when he came out as a proud ass eater. People first started knowing him in the mainstream when he admitted to eating booty, and saying that was gangsta, and that real men eat booty, and all that. When he was recently called out about dating his cousin his response was just, \"Well, the pussy's good. Why stop?\"\nHe's definitely a character. He will do whatever. The morality line doesn't exist. When he came out and said, \"I eat ass\" I was just like, \"golly.\" \"Golly, I gotta change my name\"?\nRight. But really, I just didn't want the confusion, not with the accolades or the negativity. I would get run up on in the street, people thinking that his song is my song, or that his negative publicity was attributed to me. I didn't want the positive attributions nor the negative ones. I wanted all the accolades that came with my talents, and my gifts, with the message I am trying to put across. Even though I built the name of Gates off my area, I just had to separate myself from that and rebrand myself, because he branded himself with that name and got a major label deal. That's really why I did it—not because of the ass eating or any of that. I changed the name because he signed a major deal with Atlantic, and in my aspirations to sign a major label deal, I thought the record corporations wouldn't attach themselves to two of the same name because it would be brand confusion. It would take too much energy to differentiate when we trying to sell T-shirts and tickets to shows. I didn't want to confuse the consumer. I would think after your huge \"Black and Gold\" song it would be hard for you to let go of that name.\nNot at all. I have plenty of names. K Gates is an alias I made up before I started rapping. People know me as the Wave, as Hurricane Gator, as Shake Gates.But right now I am using the Wave as my stage name, and I got co-signed by the original Wave, Max B—I got Max B on my new project stamping me as the Wave. My website is embracethewave.com. I'm on Instagram as IAmTheWave and on Twitter I'm @EmbraceTheWave. So what are your career plans with your new name and fresh start?\nThe project I put out last year under the Wave, Million Dollar Day, won album of the year at the New Orleans hip-hop awards. I'm also a filmmaker and I'm about to put out a film called Florida Keys, which is about the street culture of Florida. We got Rick Ross on there, Young Jeezy, Meek Mill, Iceberg—we went through every city in Florida and showed the diversity of the music and the party scenes. I put out another film called Murda Capital about New Orleans, which is a ghetto classic down here. We released them digitally in the streets, independently, through mom-and-pop shops, and to the bootleggers. Now we're releasing them through iTunes. I'm also about to release a project in 2015 called A Hundred Million Dollar Day, which remixes songs from Million Dollar Day plus with a bunch of new songs. Did you make any attempts to get Kevin Gates to change his name? Couldn't you sue him or something?\nNah, I ain't about all that. And at the time I thought that was his government name. How you gonna sue someone out their government name? I just thought it was a weird coincidence. And he's from right up the street in Baton Rouge, though he started telling people he was from New Orleans, and he had my neighborhood tatted on his arm like he was from there. Then I started thinking it was a case of identity theft, but I didn't put any energy toward it after that. I definitely have a sense of humor about it. God planned everything and I trust God. Maybe I wasn't supposed to be K. Gates—that ain't even my name. I'm not tripping. I'm glad I could inspire him to flourish and bring attention to Louisiana. I been around way worse characters than Kevin Gates. He's just entertaining. It's entertainment, it's funny. I heard it and I laughed. The thing with his cousin might not even be true! He's grasped the concept of entertainment real good with his music, his performances, his side antics to get media attention. I am happy that he's grasped that and he's creating opportunities for New Orleanians. He's employed many New Orleanians. A lot of people on his staff I know personally, and I am glad he's given them the opportunity to see the world and make some money. New Orleans columnist Michael Patrick Welch is the author of several books, leader of several bands, and the husband of several goats. Follow him on Twitter. By signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content. ",
    "datetime": null,
    "url": "https://www.vice.com/en/article/wd4mjy/k-gates-is-not-fucking-his-cousin-815"
}