{
    "title": "New K-pop song 'Likey' bringing Vancouver fresh wave of international attention | CTV News ",
    "text": "FOLLOW ON Advertisement Megan Devlin\nWeb Journalist, CTV Vancouver @MegDevlinn\nContact Just one day after K-pop band Twice released their latest single, fans have been spotted snapping selfies at the iconic spots in downtown Vancouver featured in the music video. 'Likey' is the nine-member group's latest viral sensation. The music video features familiar locations in Gastown, Stanley Park, White Rock and elsewhere in Metro Vancouver while the women dance, eat ice cream and even feed Canada geese. Amber Sessions from Tourism Vancouver says the video should prove to be a boon for tourism. She estimates it could be worth hundreds of thousands of dollars in marketing value for the city. \"The markets that [the video] is really reaching are many of our key travel markets which are Korea, Japan and China,\" Sessions told CTV News. \"It's really exciting.\" Along with showing K-Pop fans in Asia what Vancouver is like, the video could also bolster the genre's popularity in Canada. K-Pop aficionado and UBC student Jaydan Hwang hosts a radio show called K-Pop Café on CiTR, the university's campus radio station. He sees the band's latest colourful video as a savvy way to expand their fanbase.  \"I think people will be watching the music video and going 'oh, this is Vancouver,'\" he told CTV News. \"I'm pretty sure more people in Vancouver will be able to hear about it… I think it's a good way to promote their songs.\" Since the 'Likey' video was released on Oct. 30, over 16 million people have watched the love letter of sorts to the city. On Tuesday CTV visited the award-winning public space, “Alley Oop,” used in the video and found fans already posing for photos in the same spot.  Twice's members hail from Korea, Taiwan and Japan. Hwang says having members of different nationalities is a smart marketing move to appeal to more people. \"Having a member who's from another country is a way that makes foreign fans feel more friendly towards them,\" he said. \"The biggest advantage is having promotion in their own language.\" Twice's members busting moves in photogenic alleyways around Vancouver is emblematic of the K-pop genre, which Hwang says is known for its music videos, choreography and addictively catchy tunes. 'Likey' is a song off the group's first full-length album, Twicetagram, about the struggle of maintaining a beautiful social media image while trying to elicit a like from a crush. English subtitles translate the lyrics as \"inside the small screen I wanna be the prettiest… When you see this, make a smile, and press hard on that cute red heart down there.\" Twice's members go by Momo, Dahyun, Chaeyoung, Sana, Jeongyeon, Mina, Tzuyu, Nayeon and Jihyo. The group was formed in 2015 through survival competition TV show in Korea called Sixteen. Originally the group was going to have seven members, but Tzuyu was added as an audience pick and Momo by their record executive. With a report from CTV Vancouver's Penny Daflos  Advertisement Use of this Website assumes acceptance of Terms & Conditions and Privacy Policy | Accessibility © 2023All rights reserved. Back to top ",
    "datetime": "2017-10-31T18:25:00-07:00",
    "url": "https://bc.ctvnews.ca/new-k-pop-song-likey-bringing-vancouver-fresh-wave-of-international-attention-1.3658070"
}