{
    "title": "Next Wave #943: K Trap | Clash Magazine Music News, Reviews & Interviews",
    "text": "When K Trap first came to the UK drill scene, he was an enigma. Sporting a black balaclava, his identity was a mystery. But coming in backed by the production of Carns Hill will always give you a leg up in drill. So, armed with magical beats, K Trap poured his soul onto them and spoke about the trials and tribulations he had gone through on the roads. The first song to hit the street was ‘How' in 2017, and the harshness of his delivery caught attentions instantly. Speaking on his mode of operation, he says he’ll “only do something that I’m comfortable with.” ‘How’ was followed up with the cult classics ‘David Blaine’ and ‘Paper Plans’ later that year. ‘Watching’ came out in 2018 and included the epic one-liner: “I copped me a lil pump, way before I turned Gucci Gang.” Most recently he released his third project, ‘No Magic’, this past summer, which saw him taking off his mask and revealing his identity. “At first I wasn’t sure about music,” he says by way of explanation regarding the mask. “I was living another life too. Slowly but surely things started to progress for me in music and looked more promising. Taking off the mask was always going to be the next step once I was two feet in the music.” Now that K Trap is unmasked, we are able to put a face to the name. But there is no difference in terms of his in-your-face lyricism and his trap-themed bars. The only thing is that with each project he is taking things to another level, and with his debut album on the way in 2020, the stratosphere is the limit for this rising rap star. His message for his fans? “2020, just look out!” Where: South London What: UK drill Get 3 Songs: ‘Watching’, ‘Mask Off’, ‘Big Mood’ Fact: The streets know the meaning, he says, of the title, ‘No Magic’. – – –  – – – Words: Denzil Bell Photography: Joel Smedley Fashion: Zarina Shukri – – – Join us on the ad-free creative social network Vero, as we get under the skin of global cultural happenings. Follow Clash Magazine as we skip merrily between clubs, concerts, interviews and photo shoots. Get backstage sneak peeks, exclusive content and access to Clash Live events and a true view into our world as the fun and games unfold. Buy Clash Magazine   ",
    "datetime": "2020-01-22T15:23:31+00:00",
    "url": "https://www.clashmusic.com/next-wave/next-wave-943-k-trap/"
}