{
    "title": "Nickelodeon Hops on K-Pop Wave With 'Make It Pop'",
    "text": " Profile Sections tv Featured More From NBC Follow NBC News A man arrested in the killing of a Baltimore tech entrepreneur was suspected of raping a woman days before and was already under surveillance, police say September 28, 2023, 12:24 PM Michael Gambon, the actor best known for playing Dumbledore in the 'Harry Potter' films, dies at 82 September 28, 2023, 8:02 AM Morning Rundown: Biden impeachment inquiry's first hearing, Powerball jackpot nears $1 billion, and Kansas City's love story with Taylor Swift September 28, 2023, 7:36 AM U.S. soldier Travis King arrives back on American soil after being expelled from North Korea September 28, 2023, 4:04 AM Remains found in Colorado are identified as Suzanne Morphew, a mom who disappeared in 2020 September 27, 2023, 5:54 PM The mother of a man suspected of killing a Baltimore tech CEO urged him to surrender, fearing police would try to kill him September 27, 2023, 2:37 PM With its new “Make it Pop” show, Nickelodeon is hoping to ride the K-pop wave to win back an audience that’s generally more interested in cat videos and memes. The show, which is airing in a 20-day burst rather than a once-a-week series, centers around three teenage girls attending an East Coast prep school who decide to form a band, despite a variety of typical teen sitcom hurdles. The three leads, Megan Lee, Louriza Tronco, and Erika Tham, are all of Asian descent, and the show emphasizes its K-pop inspiration in it’s music and styling. Hallyu, the wave of Korean pop culture, is cresting all over the world, prompting a renewed interest in the language, retooling how women approach make-up, and now influencing the programming decision of cable networks. The Korean rapper Psy’s “Gangnam Style” video was the first to reach one billion views on YouTube, and introduced the polished, virulent form of Korean pop music to a global audience. Some K-pop fans were skeptical of Nickelodeon’s intentions when creating the show, and an online petition to cancel the show reached over 9,000 signatures. The show was not without some hiccups before it was even launched. Lee sued her label last year to end her contract. It’s yet to be seen whether audiences will find the show to be a genuine addition to the K-pop pantheon, or merely a hollow facsimile. The show airs on Nickelodeon at 7 p.m. or can be streamed from the Nickolodeon website. Michael D. Nguyen is a writer and digital strategist living and working New York City. His interests include culture, fashion, comedy, pop culture, popcorn and fashion comedy. Follow him @mic_nguyen. © 2023 NBC UNIVERSAL ",
    "datetime": null,
    "url": "https://www.nbcnews.com/news/asian-america/nickelodeon-hops-k-pop-wave-make-it-pop-n337411"
}