{
    "title": " Nighttime heat waves quadruple in Pacific Northwest  |  UW News ",
    "text": "Environment  |  News releases  |  Research  |  Science July 19, 2013 UW News Nighttime heat waves are becoming more frequent in western Washington and Oregon. And if you don’t sleep well in hot weather, this might be a good time to buy a fan, since records show that on average heat waves tend to strike around the last week of July. University of Washington research shows that the region west of the Cascades saw only three nighttime heat waves between 1901 and 1980, but that number quadrupled to 12 nighttime heat waves in the three decades after 1980, according to a paper published in the July issue of the Journal of Applied Meteorology and Climatology. Nighttime heat waves are when the daily low is in the top 1 percent of the temperatures on record – in Seattle above around 61.5 F – for at least three nights in a row. “In general, minimum daily temperatures have been warming faster than maximum temperatures, so we’re not surprised to see a trend in the minimum events,” said corresponding author Karin Bumbaco, a research scientist at the Joint Institute for the Study of the Atmosphere and Ocean. “Still, we were surprised to see this significant increase in the frequency of nighttime heat waves.” She and co-author Nicholas Bond, both with the Office of the Washington State Climatologist, began the investigation after fielding questions during the July 2009 heat wave, which broke temperature records and led to a local run on fans and air conditioners. People wanted to know how that event compared with others in the history books. The two ran the numbers with the help of Oregon State University’s Kathie Dello at the Oregon Climate Service. They studied temperature readings west of the Cascade Mountains in Washington and Oregon from 1901 to 2009, looking for instances where the daytime high or nighttime low temperature hit the top 1 percent of readings for at least three consecutive days. Nighttime heat waves of three days or more between 1901 and 2009. The colors represent different ways of processing the historical readings.K. Bumbaco / UW The 2009 scorcher set records in daytime temperature, but it was the string of warm nights that stood out, Bumbaco said. By their definition it was a three-day daytime heat wave in the Pacific Northwest – but included eight consecutive hot nights, the longest seen in the observational record. “It was hard to cool down at night, there wasn’t much relief at all,” Bumbaco said. Researchers also found a clue to suggest why we’re seeing more hot nights. It’s well known that Pacific Northwest heat waves occur when breeze off the ocean is replaced with air flow from the east, which warms up as it flows down the western slope of the Cascade Mountains. But they found another trait for nighttime heat waves. The records show that nighttime heat waves happen during high humidity, where water vapor in the air serves as a blanket to trap heat. “Forecasters already do a good job at predicting when heat is coming into the region, but this might help differentiate between hot days versus hot nights,” Bumbaco said. Predictions are that climate change will bring longer, more extreme and more frequent heat waves during the day and night. The paper found no significant trend in the historical record of daytime events. Though it was not part of the study, the recent late-June 2013 hot spell included just two extremely hot days, but readings at SeaTac Airport showed it qualified as yet another nighttime heat wave, Bumbaco said. The study also includes a preliminary look at health effects from heat waves, which in the U.S. account for about 1,500 deaths each year. It found a 50 percent increase in the number of regional hospitalizations coded as being related to heat on dates the authors identified as heat waves. The most heat-related hospital admissions were during the 2009 heat wave and during a 2006 event that had the warmest nights on record. This corroborates other studies suggesting that nighttime heat has the most impact on human health. Northwesterners are unlikely to draw sympathy from people across the country who are weathering triple-digit summer temperatures. But there is reason for concern. Because the region has mild temperatures people are not acclimatized to extreme heat and, perhaps most importantly, most people do not own air conditioners in their homes. The research was funded by the State of Washington through the state climatologist’s office. ### For more information, contact Bumbaco at kbumbaco@uw.edu or 206-543-3145. Read more news releases 6 days ago 1 week ago 1 week ago If you're trying to subscribe with a non-UW email address, please email uwnews@uw.edu for assistance. © 2023 University of Washington  |  Seattle, WA ",
    "datetime": null,
    "url": "https://www.washington.edu/news/2013/07/19/nighttime-heat-waves-quadruple-in-pacific-northwest/"
}