{
    "title": "Nonlinear acousto-magneto-plasmonics for ultrafast switching",
    "text": "The thermodynamic properties of magnetic materials can be controlled on ultrafast timescales by means of pressure, temperature, and magnetic fields, leading to applications in data recording and telecommunications. In dynamic processes, we usually excite a solid sample of these materials using laser pulses of femtosecond duration, which are partially absorbed by the material and lead to a transient increase in temperature. In most cases thermal effects play a major role, such as in thermally assisted magnetic data recording, where most of the energy is dissipated in heating the recording medium to enable magnetic switching using a weaker magnetic field. However, recent studies have shown that we can avoid heating and subsequent degradation of the medium using non-thermal switching mechanisms based on magnetic and acoustic effects, which may help significantly reduce energy consumption. For example, we can control nonlinear optical signals generated by ultrashort laser pulses either by changing the layer thicknesses of complex metal–ferromagnet multilayer structures or by tuning their magneto-plasmonic properties, which involves reversing the magnetization direction of the ferromagnetic material by an external magnetic field. Alternatively, we can induce and control changes in the magnetization direction using ultrashort acoustic pulses generated by thermal expansion of samples triggered as a result of the absorption of an ultrashort laser pulse. The most common way to study the influence of a magnetic field on surface plasmon polaritons (SPPs)—electromagnetic surface waves—is by exciting a thin metal–ferromagnet multilayer film with a collimated laser beam through a dielectric prism in the Kretschmann configuration. Magnetically induced modulation of the SPP wave vector is achieved by reversal of the direction of magnetization in a thin ferromagnetic layer using a small external magnetic field1, 2 and manifests itself as a small angular shift in the dip in reflectivity from the film surface: see Figure 1(a). However, the linear magnetic contrast (the ratio of the difference to the sum of the reflectivities for opposite magnetization directions) is only 0.01. This makes the potential application of linear magneto-plasmonics extremely challenging. However, in an analog of this experiment with collimated ultrashort laser pulses, we extended the potential of magnetic modulation via nonlinear magneto-plasmonics: see Figure 1(b). Owing to the presence of an additional silver layer, our structure also enabled the propagation of SPPs at second-harmonic generation (SHG) frequency, which gave us the ability to enhance magnetic control in nonlinear surface magneto-optics.3, 4 At a certain angle of incidence, we were able to double the intensity of SHG by reversing the magnetization in cobalt, which provided a magnetic contrast of 0.33. Using this method, combining nonlinear magneto-plasmonics in hybrid multilayer structures with femtosecond time-resolved pump–probe spectroscopy enables us to explore the dynamics of various laser-induced phenomena on ultrafast timescales in the Kretschmann configuration. Other surface plasmon excitation and detection techniques are based on nanostructured metal surfaces: see Figure 2(a).2,5 Such techniques can be used to overcome the intrinsic limitation of the Kretschmann configuration regarding the total thickness of multilayer structures, which should be thin enough—typically below 50nm—to enable evanescent coupling between electromagnetic waves at glass–metal and metal–air interfaces. The freedom to tailor the individual thicknesses of gold–cobalt bilayer structures on sapphire enabled us to investigate the dynamics of acoustic generation and propagation in gold using ultrafast plasmonic interferometry: see Figure 2(b).6 An ultrashort optical pump pulse was absorbed in a 30nm-thick cobalt layer that acted as an acoustic transducer, generating an ultrashort acoustic pulse by thermal expansion. This acoustic pulse propagated through a 220nm-thick layer of gold and was converted into a tensile pulse upon reflection from the gold–air interface. We monitored acoustically induced changes in electron density within the 13nm penetration depth of ultrashort SPP probe pulses by ultrafast plasmonic interferometry and revealed the signatures of the nonlinear propagation of large-amplitude acoustic pulses in gold.6 Such pulses have been shown to induce the precession of ferromagnetic resonance (FMR) in ferromagnetic samples via a magneto-elastic effect.7, 8 The key feature was the suppression of thermal effects by pumping one side of the sample material and probing magneto-acoustic interactions at the opposite (non-excited) side of the sample using an experimental geometry similar to that shown in Figure 2(b). These examples of ultrafast laser-induced acousto-plasmonic and magneto-elastic interactions have stimulated interest in the physics of more complex structures such as that shown in Figure 3. In addition to magneto-acoustic, acousto-plasmonic, and magnetically controlled nonlinear generation of light at interfaces, we are considering adding a monolayer of quantum dots (QDs) coupled to metal surfaces.9 The use of semiconductor QDs could help explore the potential of nonlinear optics in studying plasmon-assisted coupling between QDs and FMR precession. The spatial extent of acoustic pulses in gold (∼10nm) is so small that magneto-optical and QD layers can be acoustically stimulated at different times, which would allow us to disentangle magneto-elastic coupling and acoustically induced dynamics in QDs using femtosecond time-resolved pump–probe experiments. Independently of whether SPP-mediated coupling mechanisms between a thin ferromagnetic film and a monolayer of semiconductor QDs can be clearly identified, these dynamic studies are sure to enrich our understanding of ultrafast nonlinear interactions on the nanoscale.10 We are also aiming to optimize the geometry of our gold–cobalt–silver structures to achieve a magnetic contrast of 1. This would enable us to produce a nonlinear magneto-plasmonic switch where nonlinear optical emissions are controlled by the magnetization direction in the ferromagnetic nanolayer. We also envisage switching the magnetization direction in ferromagnetic nanostructures using ultrashort acoustic pulses on a picosecond timescale in the absence of an external magnetic field,11 which would open the door to ultrahigh-speed non-thermal data recording and telecommunications applications. The author is grateful to all his co-authors for valuable contributions and to the Région Pays de la Loire for funding. Vasily Temnov holds a PhD (2004) from the University of Duisburg–Essen and has worked at the Institute of Molecules and Materials of Le Mans, CNRS 6283, since 2011. Since 2015 he has also been a visiting lecturer at the Fritz Haber Institute in Berlin with the support of the Alexander von Humboldt Foundation. ",
    "datetime": null,
    "url": "https://spie.org/news/6039-nonlinear-acousto-magneto-plasmonics-for-ultrafast-switching"
}