{
    "title": "Nonstop flights expected to unlock M’sians appetite for Jeju | TTG Asia",
    "text": "Malaysia’s AirAsia X first Kuala Lumpur-Jeju connections from December 12 spell good news to outbound agents as the lack of direct flights previously had made Jeju a hard sell for agents. So while South Korea enjoys rising popularity among Malaysian travellers lured by K-wave and Korean restaurants available in big cities, Jeju has been sidelined, despite it being “very affordable”, said an agent. For the first eight months of the year, the number of Malaysians who visited South Korea totalled 176,140, a five per cent growth compared with the corresponding period. Adam Kamal, manager at Aidil Travel, said: “Opening a new destination in South Korea will attract repeat visitors who have already visited other parts of (the country). The flights are also timely as it coincides with the school holidays and winter season in South Korea. Malaysians are crazy about winter in South Korea.” Vickie Yong, director, Airlink Travel & Tour, added: “It will be good for FIT travel. We can sell open jaw, combining Jeju with a domestic flight either to Incheon or Busan and back to Kuala Lumpur. Malaysians like to shop, so combining with Incheon for shopping makes sense.” Nanda Kumar, managing director, Hidden Asia Travel & Tours, said Jeju is a “very affordable” destination, and works well for honeymooners and incentive travellers. He added that the flight schedule – with departures on Monday, Tuesday, Wednesday and Saturday – is ideal for the standard four-day incentive packages. AirAsia X CEO, Benjamin Ismail, shared that for the full year, the airline is targeting an 80 per cent load factor and 110,000 passengers for flights to Jeju. First Hyatt Centric branded hotel in South-east Asia grows from strength to strength GTEF 2023 unveils new ideas on sustainable tourism Explore Asia’s best beachfront destinations with BWH Hotels TTG AsiaSeptember-October 2023 TTG Travel Awards 2022 All Rights Reserved ",
    "datetime": null,
    "url": "https://www.ttgasia.com/2017/10/12/nonstop-flights-expected-to-unlock-msians-appetite-for-jeju/"
}