{
    "title": "North Korea Threatens Citizens with Execution for Watching South Korean TV — Radio Free Asia",
    "text": "UPDATED at 10:00 A.M. EST on 2019-01-28 The North Korean government is threatening residents along the border with South Korea with possible execution for being caught watching South Korean media, RFA sources say. The regime has reportedly held lectures in South Hwanghae province, in the western part of the country, describing severe penalties for the possession of items from wealthy, democratic South Korea. “In the new year, police officials began hosting lectures all over the province,” said a source from South Hwanghae in an interview with RFA’s Korean Service on Monday. “The lectures consisted of threats that strictly demand that residents abstain from watching decadent video materials of capitalism and the possessing things like fliers and USB sticks that have found their way in from the South,” said the source. Activists in South Korea have been known to release balloons laden with money, food, fliers and USB flash drives containing media files, hoping they will land in the North and be found and distributed.  But access to South Korean TV doesn’t always require the discovery of a downed balloon. “In a recent lecture, they told us they are aware that a growing number of people are able to manipulate the frequencies [of their televisions] to watch South Korean TV programs,” the source said. “They said that regardless of any individual’s status, those caught in violation could be executed by firing squad. [They want to] instill fear,” the source added. The source said that in the areas closest to South Korea, such as in Kangryong and Pyoksong counties, frequencies can be manipulated such that South Korean TV can be seen clearly. “Since relations between North and South have smoothed recently, people who used to be afraid of watching South Korean TV are secretly doing this at dawn, when electricity is provided,” the source said, adding, “Law enforcement authorities are being puzzled by the increasing number of such cases.” “The authorities have been focusing on South Hwanghae because it is relatively close to the DMZ,” the source said. “They believe that the people living in the border regions are more likely to turn into an opposition force, posing a threat to the system,” said the source. “If they don’t effectively impose control, they are strictly enforcing these measures in those regions,” the source said. Meanwhile in North Korea’s Kangwon province, bordering the eastern part of the DMZ, a resident described yearly efforts by law enforcement to stop citizens from watching South Korean TV. “Every year [they] set up a system that orders people to refrain from even looking at any South Korean materials [they find] and report it to the regime,” the source said. “[The government] uses jamming signals to prevent South Korean TV and radio signals,” said the source. “But people still are taking the risk of secretly watching South Korean TV because they provide accurate information,” the source said. South Korean TV programs make the people resentful of the North Korean regime, the source said. “When they watch South Korean dramas on a USB drive or an SD card, they can see the lifestyles of South Koreans,” the source said, adding, “they begin to realize and feel in their bones that our country has real problems, and we become more critical of the government.” The source suggested that residents are not taking the regime’s warnings seriously. “The central government keeps repeating the same old-fashioned ideas in these lectures,” the source said. “But amid the growing awareness [of the outside world] and changing perceptions, citizens are starting to laugh at the regime sticking to its old ploys and silly propaganda.” The punishments laid out for watching South Korean media have not been consistently applied over the years. In 2015, RFA reported that five university students were denied diplomas and were sentenced to forced labor for watching a South Korean drama. In April, the Asahi Shimbun reported that six teenagers from Ryanggang Province were sentenced to forced labor for publicly dancing to K-pop songs and distributing them to others. But the regime has punished offenders to the full extent of the law. In 2014, ten senior members of the regime were executed on Kim Jong Un’s orders for watching South Korean dramas, as were three housewives in 2015 for distributing them. In 2017, the U.K.-based Express reported that the maximum penalty for watching foreign movies or dramas was increased from two years to ten. Dubbed by experts as the Korean Wave, South Korean cultural exports have taken neighboring Japan and China by storm, while making inroads throughout Southeast Asia. K-Pop and K-Drama enthusiast communities also exist in Europe and the Americas. The Korea Creative Content Agency’s (KCCA) said in their 2018 Content Industry Forecast Report, that South Korean cultural exports totaled $7.5 billion in 2018. Reported by Hyemin Son for RFA’s Korean Service. Translated by Dukin Han. Written in English by Eugene Whong.   Add your comment by filling out the form below in plain text.  Comments are approved by a moderator and can be edited in accordance with RFAs Terms of Use.  Comments will not appear in real time. RFA is not responsible for the content of the postings. Please, be respectful of others' point of view and stick to the facts.      ",
    "datetime": null,
    "url": "https://www.rfa.org/english/news/korea/north-korea-hallyu-01252019171246.html"
}