{
    "title": "North Korean Youth Hooked on Popular TV Series From South  — Radio Free Asia",
    "text": "A South Korean soap opera glamorizing 1990s-era teen pop culture has become the latest underground entertainment trend in North Korea as young people secretly watch smuggled copies of the serial drama despite the risk of severe punishment, including execution, if caught by the authorities.“Reply 1997,\" the South Korean television series produced last year, is so popular in North Korea that it has young people trading jokes about its name and imitating expressions by its characters, according to North Korean sources.   North Korea imposes a strict ban on all foreign media, and harsh punishments, including death, could be imposed on anyone caught watching “Reply 1997,” one of many popular South Korean soap operas smuggled into the country through China on DVDs and other electronic storage devices. The drama is a nostalgic coming-of-age story that jumps between the present day and the main characters’ high school days 15 years ago. It was a hit in South Korea for its depiction of extreme fan culture behind idol groups during a peak in the K-pop era of South Korean music.  Striking a chordIt has struck a chord among young people in reclusive North Korea curious about life south of the border, sources said.  In some circles the show is so popular that those who haven’t watched it are considered behind the times, one source in North Hamgyong province said. “Young people not watching ‘Reply 1997’ are treated as stragglers,” he told RFA’s Korean Service, speaking on condition of anonymity. He added that the show had spawned a well-known joke about its title, and that most people got copies of the series on USB-based flash memory drives, which are easier to hide from the authorities than DVDs. “It’s hard for authorities to crack down on copies of ‘Reply 1997’ distributed on small 16GB USBs,” he said. 'Openly circulated'A source in Yanggang province also speaking on condition of anonymity said copies of the show are “openly circulated” among young people and that it has become trendy to repeat lines and expressions spoken by the characters in the show. The story is full of jokes based on 1990s references and slang from South Korea’s second-largest city Busan, where the story is set.  The drama sometimes uses subtitles to clarify the references—a feature helpful to viewers in North Korea, where the language spoken has diverged somewhat from that spoken in the South in the decades that the two sides have been at war.Flash drives and DVDsFlash drives containing the whole “Reply 1997” series can be bought for about U.S. $20, another source in North Hamgyong said. DVD copies of the show are cheaper, at about U.S. $10 or higher for a set of 12 disks, but are harder to hide from the authorities, he said.  North Korean authorities have long tried to forbid South Korean soap operas, movies, and music into the country in an attempt to keep unwanted foreign influences from seeping into the Hermit Kingdom. Earlier this month, authorities publicly executed some 80 people in a wave of capital punishments across seven cities, many of them for watching foreign media, South Korean media reported. Despite such punishments, more and more music and videos from South Korea have slipped through the country’s information blockade in recent years, as “Korean Wave” cultural exports from the South grew increasingly popular in other Asian countries. Reported by Sung Hui Moon for RFA’s Korean Service. Translated by Doeun Han. Written in English by Rachel Vandenbrink. Add your comment by filling out the form below in plain text.  Comments are approved by a moderator and can be edited in accordance with RFAs Terms of Use.  Comments will not appear in real time. RFA is not responsible for the content of the postings. Please, be respectful of others' point of view and stick to the facts.      ",
    "datetime": null,
    "url": "https://www.rfa.org/english/news/korea/tv-show-11262013194642.html"
}