{
    "title": "North Korean soldiers face punishment for calling South Korea by its official name — Radio Free Asia",
    "text": "The North Korean military will severely punish two soldiers for referring to South Korea by an abbreviation of its official name, which is essentially a political statement that recognizes the legitimacy of the government in Seoul, military sources in the North told RFA. The official name for North Korea is the Democratic People’s Republic of Korea (DPRK), whereas South Korea is officially the Republic of Korea (ROK). But the “Korea” part of their names are different words — Choson in the North and Hanguk in the South. While both names have been used by previous governments in the peninsula’s history, in the current political climate the use of one name or the other has become almost a political declaration. North Koreans call the South, “South Choson,” and South Koreans call the North, “North Han.” In conversation, the two North Korean soldiers referred to South Korea as “Hanguk,” an indiscretion that is likely to bring a harsh reprisal from military leaders, sources said. “There was an incident in a unit under the 9th Corps, where several soldiers used the term ‘Hanguk’ to refer to the South,” a military source from the northeastern province of North Hamgyong told RFA’s Korean Service Nov. 16. “Two soldiers were ordered to appear for a self-criticism meeting in front of the rest of the unit,” said the source, who requested anonymity for security reasons. Such meetings are common in North Korea. They can consist of workers, government officials and even neighborhood residents. The participants are expected to snitch on each other for their thought crimes in front of their peers and adjudicators, who usually dole out light punishments for the offenses. But the punishment for these soldiers will likely be much more severe than is typical, the North Hamgyong source said. “This is the first time they will punish soldiers for this kind of crime since the enactment of the Law on Elimination of Reactionary Thought and Culture,” said the source, referring to the new draconian law passed within the last year. “The authorities are likely going to make an example out of them,” the source said. The soldiers had used the offending term while on duty as they were discussing South Korea’s rapid development from an impoverished country at the conclusion of the Korean War to one of the world’s leading economies only decades later, according to the source. “They are facing punishment now because one of the soldiers working with them was secretly an agent for the Defense Security Command and he reported them,” the source said. In recent years, North Koreans have grown increasingly aware of the differences between the two countries thanks in part to South Korea’s rapidly expanding popular cultural influence, globally referred to as the Korean Wave. The latest South Korean dramas and K-Pop hits make their way to the North on smuggled flash drives and SD cards. Once there it is ravenously consumed on the sly by trendy young North Koreans, who show off to each other by adopting South Korean slang terms and spellings, and even the distinct dialect of the South Korean capital. The North Korean government has been actively fighting against what it calls an “infiltration of capitalist culture,” sentencing people to hard labor or even death for possessing or distributing copies of foreign media. “Within the military, the young soldiers are being swept up in the [South] Korean Wave, and the authorities consider this behavior to be a reactionary act by those lacking faith in the socialist system,” the North Hamgyong source said. “Three or four years ago, when inter-Korean relations were good, calling the South by its official name, the Republic of Korea, was not such a big deal,” said the source. “But these days, authorities are quick to jump on people for uttering even a singly problematic word in passing, so everyone, especially officials of the regime, are walking on eggshells trying not to make a mistake by saying the wrong thing,” the source said. New recruits showing up for their mandatory seven-year stints in the armed forces are screened for ideological infractions even before they arrive for training, according to the source. “Not only are their belongings searched, they are also interrogated about how many times they have watched South Korean dramas and movies before they even enlist,” the source said. “If they honestly confess, then they only have to go to educational sessions. But if they did not confess and are caught later, they will be punished.” When soldiers do something wrong, it is not uncommon for their superiors to also be punished. Different arms of the military in North Hamgyong are blaming each other for the two soldiers’ choice of words, creating a tense situation, another North Hamgyong military source told RFA. “In relation to the two soldiers of the 9th Corps that called the South by a problematic term, the head of the operations division of the staff department, who oversees the division command’s censorship committee, once even tried to inspect the computer in the office of the propaganda director at the political department,” the second source said. “He said he was cracking down on illegal videos. The director protested and a fight almost broke out,” said the second source. The 9th Corps is deployed near the border with China and is therefore under more scrutiny because of the relative ease its soldiers can procure media from South Korea, according to the second source. But despite the repeated crackdowns, South Korean media has had a major effect on how the soldiers see what is supposed to be their sworn enemy. “The soldiers realize that the South is indeed more advanced than we are. Not only economically, but in every major aspect. Crackdowns and punishments can only do so much to stop them from wanting to know more,” the source said. Translated by Dukin Han. Written in English by Eugene Whong. Add your comment by filling out the form below in plain text.  Comments are approved by a moderator and can be edited in accordance with RFAs Terms of Use.  Comments will not appear in real time. RFA is not responsible for the content of the postings. Please, be respectful of others' point of view and stick to the facts. North Korea has an autoimmune disease: a desperately painfully slow, long term, wasting, chew itself to pieces from the inside, ideologically driven auto immune disease.      ",
    "datetime": null,
    "url": "https://www.rfa.org/english/news/korea/hanguk-11182021214931.html"
}