{
    "title": "Number of global 'hallyu' fans crosses 100 million landmark | Yonhap News Agency",
    "text": "All Headlines North Korea Sports Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies URL is copied. SEOUL, Jan. 15 (Yonhap) -- The popularity of \"hallyu,\" or the Korean Wave, seems to have continued unabated across the world despite yearlong coronavirus restrictions, as the number of global hallyu fans topped the 100 million milestone last year, a public foundation said Friday. The number of members of hallyu fan clubs in 109 countries worldwide, excluding South Korea, rose to 104,770,000 as of September last year, marking an on-year rise of 5.5 percent, or 5.4 million, from 99,320,000, according to the Korea Foundation, a public diplomacy organization based in Seoul. This photo provided by CJ ENM shows \"KCON:TACT SEASON 2,\" an online hallyu festival held Oct. 16-25, which was viewed by 4.4 million people. (PHOTO NOT FOR SALE) (Yonhap)  The foundation regards organizations of global enthusiasts of Korean singers, actors, culture and food, taekwondo clubs and Korean culture societies at universities as hallyu fan clubs. By continent, Africa and the Middle East saw the strongest growth in the popularity of hallyu, with the number of hallyu fans there quadrupling to 1.2 million in 2020, the foundation noted. The number of hallyu fan club members in America also soared 31 percent from 12.1 million to 15.8 million, while Europe registered growth of 25 percent from 15 million to 18.8 million, it said. In Asia and Oceania, however, there was a decrease of 4 percent from 71.8 million members to 69 million, it added. By country, Russia topped the list as its hallyu fan club membership swelled by 4.07 million from 11.61 million to 15.68 million, accounting for 75 percent of the entire global annual growth. In the United States and Canada, there was also robust membership growth of 660,000 and 950,000, respectively, last year, the foundation noted. It attributed the steady growth of hallyu to a string of examples of overcoming the limitations of the Korean language, which has been a stumbling block to its worldwide expansion. Language plays a major role in the spread of pop culture content in music, movies and dramas, which are the major genres of the Korean Wave. In this file photo released by AFP, \"Parasite\" director Bong Joon-ho (2nd from R) accepts the best picture award for the film during the 92nd Oscars at the Dolby Theatre in Los Angeles on Feb. 9, 2020. (PHOTO NOT FOR SALE) (Yonhap)  But the South Korean dark comedy thriller \"Parasite\" won four Academy Awards, including best picture, in early 2020, becoming the first movie not in English to do so and heightening the possibility of success of Korean language films in global markets. Then, K-pop superstar BTS' Korean song rose to the top of the Billboard Hot 100 chart, while as many as 10 Korean dramas were included among the world's 100 most popular TV programs announced last year by Netflix, which has 195 million paid subscribers. In addition, the utilization of paid online concerts based on advanced mobile technologies, buildup of webtoon platforms, popularity of new characters such as Pinkfong, expansion of cultural hallyu content and brisk activities of hallyu fan clubs have all contributed to the sustained popularity of the Korean Wave, the foundation said. This image, provided by Big Hit Entertainment, shows a concept photo of BTS' new album \"BE,\" released on Nov. 20, 2020. The South Korean megastar made history with the album's title song \"Life Goes On,\" which on Nov. 30 became the first-ever non-English song to debut at No. 1 on the Billboard Hot 100 chart in the music chart's 62-year history. (PHOTO NOT FOR SALE) (Yonhap)  It said there are still a host of challenges to overcome, such as downturns in hallyu in China and Japan and the excessive concentration of European hallyu fans in Russia. \"The Korean Wave continued its growth last year by optimizing the use of online (methods) despite COVID-19-related restrictions on travel and private-sector and government-level exchanges,\" Lee Geun, president of the Korea Foundation, said. \"The government and the private sector should join hands to support the steady growth of hallyu, which is also an important asset of public diplomacy,\" Lee said. ycm@yna.co.kr\n(END) All News National North Korea Economy/Finance Biz Culture/K-pop Sports Images Videos Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies Korea in Brief Useful Links Festival Calendar Weather Advertise with Yonhap News Agency ",
    "datetime": "2021-01-15T11:07:55+09:00",
    "url": "https://en.yna.co.kr/view/AEN20210115003700315"
}