{
    "title": "\r\n\tOnline reality show seeks to groom Pinoy K-pop trainees | ABS-CBN News\r\n",
    "text": "Home\n > \nEntertainment Posted at Jul 13 2018 04:41 PM | Updated as of Jul 14 2018 08:03 AM Share MANILA — Filipinos aspiring to become K-pop idols are now a step closer to fulfilling their dreams. Streaming platform Viu and Globe Telecom on Friday launched their co-produced online reality show \"Hello K-Idol,\" which will pit Filipino hopefuls for a chance to turn their K-pop dreams into reality. The 10 male contestants, aged between 18 to 27, were selected following on-ground and online auditions. The final winner will be awarded a four-month all-expense paid scholarship to learn K-pop vocal and dance under a prestigious talent school in Korea. Over a period of 10 weeks, the contestants will train under singer Morissette Amon, Philippine-based Korean dancer Dasuri Choi, and Philippine-based Korean singer Jinho Bae. Serving as special mentors to the contestants are Jung Joonyoung, host of the Korean variety show \"2 Days & 1 Night,\" and Yook Sungjae, member of K-pop boy group BtoB. Online personality Kring Elenzano-Kim will host the program. At the media launch for the show held at the ABS-CBN Vertis Tent in Quezon City, the two special mentors agreed that Filipinos have the potential to become K-pop idols. \"I think it's possible since there are a lot of foreigners working as artists in Korea,\" Joonyoung said in Korean. \"A lot of Filipinos are really good at singing and dancing, and actually I saw [videos] in YouTube,\" Sungjae said. Most non-Korean artists in the K-pop industry come from China, Thailand, and Japan. Sungjae, who also rose to fame in the country for his role in the popular drama \"Goblin,\" vowed to work hard as a mentor. \"As a K-pop artist, I will try harder to become a good mentor to K-pop idols,\" he said. In the South Korean entertainment industry, artists undergo months or years of rigorous training prior to their \"debut\" or formal introduction to the public. While the show does not guarantee the winner's debut, Viu Philippines Country Head Arianne Kader-Cu said she is hopeful that the winner gets a chance to achieve such feat. \"They really have the drive so hopefully one day, they will be in a Korean group. That's our vision,\" she said. \"Hello K-Idol\" will be available for streaming on Viu. The premiere date has yet to be announced but the show is expected to run from July to September this year. Share US police launch manhunt for gunman who killed at least 22 October 26, 2023 Pumpkins for Halloween emojis? October 26, 2023 NAIA expects Undas influx to begin on Friday October 26, 2023 Palace: No suspension of work, classes on Oct. 31 October 26, 2023 USAID to fund development of 9 PH secondary cities October 26, 2023 © 2023 ABS-CBN Corporation. All Rights Reserved. AboutCareersPrivacyTermsContact UsAdvertise With Us ",
    "datetime": null,
    "url": "https://news.abs-cbn.com/entertainment/07/13/18/online-reality-show-seeks-to-groom-pinoy-k-pop-trainees"
}