{
    "title": "Optically reconfigurable magnetic materials | Nature Physics",
    "text": "Thank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\n            the best experience, we recommend you use a more up to date browser (or turn off compatibility mode in\n            Internet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles\n            and JavaScript. Advertisement Nature Physics\nvolume 11, pages 487–491 (2015)Cite this article 9602 Accesses 138 Citations 26 Altmetric Metrics details Structuring of materials is the most general approach for controlling waves in solids. As spin waves—eigen-excitations of the electrons’ spin system—are free from Joule heating, they are of interest for a range of applications, such as processing1,2,3,4,5, filtering6,7,8 and short-time data storage9. Whereas all these applications rely on predefined constant structures, a dynamic variation of the structures would provide additional, novel applications. Here, we present an approach for producing fully tunable, two-dimensionally structured magnetic materials. Using a laser, we create thermal landscapes in a magnetic medium that result in modulations of the saturation magnetization and in the control of spin-wave characteristics. This method is demonstrated by the realization of fully reconfigurable one- and two-dimensional magnonic crystals—artificial periodic magnetic lattices. There are two general approaches in designing the properties of a material: changing its chemical composition and structuring. Structuring has been used to control mechanical10, optical11, and even magnetic properties12,13. Periodic variation of the magnetic material’s parameters allows the realization of magnonic crystals with novel properties not found in the unstructured material. For example, the dispersion relation of spin waves can be controlled to achieve new schemes for spin-wave-based computing1,2,3,4,5,14,15,16,17. The spin-wave dispersion relation depends on many parameters, such as the geometry of the spin-wave waveguide (film thickness and waveguide width), external magnetic field Hext, and saturation magnetization MS. In fact, all of these parameters have already been used to fabricate magnonic crystals6,7,8,12,13,18,19,20: arrays of metallic stripes, etched grooves or antidots, biasing magnetic field or periodic variation of the saturation magnetization using ion implantation. However, all available methods for the fabrication of such spintronic devices result in spatially constant magnetic materials. J. Topp et al. have shown that the parameters of magnetic materials can be changed locally after the rather time-consuming fabrication of the spintronic device21—but the functionality of the device stays the same. Here, we present an alternative method for structuring and use it for the manipulation of spin waves—namely fully tunable light patterns (computer-generated holograms), in which optically induced thermal patterns/landscapes modify the spin-wave dispersion relation and, hence, the propagation. Thus, the proposed optically reconfigurable magnetic material allows the functionality of a magnetic element to be tuned on demand; the same element can be used as a conduit, a logic gate or a data buffering element. The set-up used for the realization of the light patterns consists of a continuous wave laser as light source, an acousto-optical modulator for temporal intensity control, and a spatial light modulator for spatial intensity control (see Fig. 1a). To study the influence of the thermal gradient induced by the intensity patterns on the spin waves, we use a 5-μm-thick ferrimagnetic yttrium iron garnet (YIG) waveguide grown on a 500-μm-thick gadolinium gallium garnet (GGG) substrate (see Fig. 1b). In the structure, GGG is almost transparent, whereas YIG absorbs about 40% of the green light used in the experiment. To increase the efficiency of the heating we use a black absorber coated on top of the YIG. Moreover, this absorber increases the contrast of the thermal landscape in YIG owing to its approximately one order of magnitude smaller thermal conductivity22 compared to YIG (refs 23, 24). Thus, the heat pattern inside the spin-wave waveguide is created mainly through thermal diffusion at the YIG/absorber interface. a, Schematic of the set-up for realization of thermal landscapes. The intensity of a continuous wave laser (wavelength 532 nm) is controlled by an acousto-optical modulator (AOM). A spatial light modulator (SLM) generates the light pattern/hologram by modifying the phase fronts of the incoming laser beam to achieve the desired intensity distribution in the focal plane of lens L5 on the magnetic sample. Holograms are calculated using a variation of the Gerchberg–Saxton algorithm (see Methods), resulting in arbitrary patterns covering an area of 8 × 1.5 mm2 with approximately 500 mW maximum integral power on the sample. A CCD camera after a beam sampler (BS) is used to observe the intensity distribution. b, Schematic of the sample structure consisting of a GGG/YIG/absorber multilayer system. The optical properties of our sample are as follows. The GGG is almost transparent, whereas YIG absorbs about 40% of the used light, and 30% is transmitted through GGG/YIG and finally absorbed by the absorber layer. Spin waves are excited and detected by microstrip antennas. A typical thermal landscape is shown on the waveguide (colour coded: red—maximum temperature, blue—minimum temperature). c, Thermal profile of the absorber taken with the infrared camera (top panels) after illuminating the sample for 5 ms from the GGG side (left panel) and the absorber side (right panel). The inset shows the illumination (green arrows) and the position of the infrared camera. The grey lines in the IR picture mark the positions of cross-sections of the thermal landscapes (bottom panels). Determination of the background temperature is done by averaging the minimum values of the heat profile cross-section between the sharp peaks. d, Measured spin-wave transmission characteristic (solid blue line) in the thermal landscape schematically shown in c (magnonic crystal with five periods, lattice constant 740 μm) and reference data (red) without the projected pattern. Four bandgaps for the magnonic crystal are clearly observed in the transmission characteristic. The heat landscape modulates the saturation magnetization MS, which is one of the key parameters defining the spin-wave properties. To determine the dependence of MS on the temperature T, the Néel model formalism is used25. The saturation magnetization decreases with increasing T and vanishes at the Curie temperature (559 K for YIG). However, in the range from 298 K to 398 K, it is almost linear and the following approach can be used (MS, 298 K ≍ 140 kA m−1 is the saturation magnetization at room temperature TRT = 298 K): where η = 313 A K−1 m−1. To demonstrate the viability of our approach, we realize several one-dimensional magnonic crystals on a single sample: an array of parallel stripes oriented perpendicular to the spin-wave propagation direction is projected onto the sample. The lattice constant a = 740 μm is shown schematically in Fig. 1b. An infrared camera synchronized to the pulsed laser illumination measures the resulting temperature distribution from the absorber side. The left panel in Fig. 1c shows the thermal profiles after 5 ms of heating and a repetition time of 100 ms with the laser impinging on the GGG side. As well as a pronounced temperature background, a small local temperature increase by the stripes is seen. However, this temperature profile is different from that inside the YIG, because the infrared camera measures the temperature mainly due to the absorption of YIG. To obtain the relevant structured temperature distribution inside YIG caused by the absorber, we perform another experiment with the laser impinging from the absorber rather than the GGG side (Fig. 1c, right panel): distinct peaks are visible in the temperature profile. As the 50-μm-thick absorber is in direct contact with the YIG and has low thermal conductivity, the measured thermal landscape describes qualitatively well the thermal landscape in YIG. In the created one-dimensional thermal landscape, we expect the following spin-wave behaviour. First, spin waves are excited at the input antenna, where the YIG temperature is 301 K. Then, these waves propagate to the region of the magnonic crystal (with a background temperature of 309 K). During propagation, a smooth wavelength transformation takes place owing to conservation of the spin wave frequency26. Thus, almost no reflection occurs in this region. In contrast, the temperature peaks inside the magnonic crystal region cause stronger reflections owing to a larger mismatch of the spin-wave impedance. Finally, after the spin waves have passed through the magnonic crystal area, the wavelengths are smoothly transformed back to their original values (at 301 K where the output antenna is located). A vector network analyser is used to measure the transmitted spin-wave power as a function of frequency f. The reference transmission in the presence of only the background temperature profile (red line) and the transmission through five thermal barriers (blue line) are shown in Fig. 1d. The presence of four bandgaps is clearly visible as dips in the transmission characteristic. To understand this transmission characteristic, a closer look at the spin-wave dispersion relation—the dependence of the spin-wave angular frequency ω = 2πf on its wavenumber k—is necessary. The dispersion relations calculated for different temperatures (see Methods) are shown in Fig. 2b. No spin-wave propagation occurs at the point k = 0 rad cm−1 (known as ferromagnetic resonance—FMR). Increasing T decreases MS(T)—thus ω(k) shifts to lower frequencies. a, Transmission difference through a 1D magnonic crystal with five layers extracted by subtraction of the reference measurement from the transmission characteristics in Fig. 1d (using a dB scale). Zero dB corresponds to an unaffected transmission signal compared to the reference measurement. Maximal suppression of the transmission difference is observed for the fundamental bandgap and reaches almost 20 dB. The full-width at half-maximum of the bandgaps is around 6–8 MHz. b, Dispersion relation of the backward volume magnetostatic spin waves—see Methods—for different temperatures according to Fig. 1c. The green curve, corresponding to the background temperature, is used to define the frequency bandgaps. The inset shows the hologram intensity distribution (CCD camera) and the thermal profile on the sample (IR camera), respectively. The ferromagnetic resonance (FMR) is around 6.99 GHz. The drop in transmission near this frequency (see a) is due to the not perfectly fitting falling edge of the transmission characteristics for the reference and magnonic crystal measurement in Fig. 1d. To analyse the influence of the thermal landscape on the spin-wave properties, the transmission difference (calculated by subtraction of the reference measurement on a dB scale) is shown in Fig. 2a. Four bandgaps are observed in the frequency range from 6.91 to 6.99 GHz. In defining the frequencies of the bandgaps, we use a background temperature of 309 K, rather than the temperature at the positions of the antennas. As expected, the frequencies of the bandgaps correspond to the wavenumbers kn = nπ/a, where n is the number of the bandgap. To demonstrate the flexibility of the proposed approach, the transmission of magnonic crystals with different lattice constants is depicted in Fig. 3a. As different magnonic crystals can be programmed simply into the laser hologram, only a single YIG sample is used—in contrast to all existing static methods. In this two-dimensional map, 27 different lattice constants between 400 and 1,200 μm are investigated and the normalized transmission is plotted as a function of frequency f and lattice constant a. It is worth noting, that with changing a the density of the laser stripes varies, resulting in a modification in the background temperature. The measured Tbackground is shown in Fig. 3b and is taken into account for the theoretically determined dependencies of the bandgap frequencies (dashed white lines in Fig. 3a). A very good agreement between theory and experiment is observed. a, The measured spin-wave transmission is normalized to the reference (grey-scale map; white, same as the reference; black, suppressed transmission) for different lattice constants of the magnonic crystal. For all lattice constants the bandgaps are well pronounced. Measurements are compared to theoretically expected frequencies for bandgaps with number n (white dashed lines). The ferromagnetic resonance (FMR) corresponds to n = 0. b, Dependence of the background temperature on the lattice constant, a, caused by heat diffusion (using pulsed heating). Because Tbackground is a mean value, the error bars correspond to the standard deviation. The contrast of the thermal landscape decreases for smaller lattice constants owing to the increased hologram energy density. An empirical fit function for the background temperature is Tbackground(a) = T0 + T1 exp(−a/δ), with the parameters T0 = (305 ± 1) K, T1 = (22 ± 1) K and δ = (485 ± 44) μm. To calculate the transmission suppression of spin waves through a magnonic crystal, a transfer matrix approach is used (see Methods): in contrast to conventional step-like variations (for example, film thickness in ref. 12), a generalized approach was used to describe smooth variations of the magnetic properties (magnetization MS in our case). Figure 4 shows a comparison between the resulting theoretical transmission suppression (solid line) and the experimental data (dashed line). The calculations qualitatively predict the frequency dependence as well as the expected suppression of the transmitted spin-wave signal. However, the theoretical model does not describe parasitic losses in the regions between the bandgaps due to heat-dependent damping. A transfer matrix approach is applied to spin-wave propagation through the one-dimensional heat-induced magnonic crystal to calculate the transmission suppression as a function of spin-wave frequency (see Methods). The dashed line corresponds to the experimental data shown in Fig. 2a. The theoretical calculation is presented as a solid line. The potential of the proposed technique is demonstrated further by realizing different two-dimensional thermal landscapes. In Fig. 5a, the hologram intensity distributions (monochrome panels), temperature patterns and the crystal’s transmission characteristics are shown and compared with the case of the one-dimensional magnonic crystal. In these structures, an additional lattice constant appears for the wave propagating along the shifted stripes (a/4 for middle panel and a/2 for the bottom panel), forming a waveguide. As a result, specific bandgaps disappear for the two-dimensional structures as compared with the one-dimensional-crystal: for the pattern in the centre panel we observe the disappearance of the second bandgap, whereas the first and third bandgaps vanish in the bottom panel. To explain this behaviour qualitatively, we perform a fast Fourier transformation (see Fig. 5c) of the effective hologram intensity shown in Fig. 5b (only the axis oriented along the spin-wave propagation direction is analysed). The Fourier transformation of the distribution of MS in coordinate space gives the spin-wave spectrum in wavenumber-space (and consequently in frequency-space), and in Fig. 5c the existence/absence of each band gap is clearly visible. a, Measured spin-wave transmission characteristics for different lattice shifts. The centre of the stripes is moved in the z-direction (for the coordinate system see Fig. 1b). The inset shows the hologram intensity and the temperature distribution, respectively. b, These two-dimensional thermal patterns can be described by an effective one-dimensional thermal landscape or intensity profile, Ieff, of the hologram. The mean value of Ieff in the y-direction of the hologram intensity distribution (normalized to maximum) as a function of the z coordinate. c, The fast Fourier transformation of Ieff assigns the spacing between the stripes to wavenumbers and, thus, to the number of the corresponding bandgap (pronounced peaks in the plot). Again, theory and experiment are in good qualitative agreement. Indeed, both the experiment and the calculations show vanishing bandgaps due to interference of reflected spin waves for specified lattice shifts. Finally, we would like to discuss the rate of material variation, which is limited by the dynamics of the heating process—the transfer of heat from the absorber to the YIG film. This involves thermal diffusion and limits the dynamics to a 10 ms scale (see Supplementary Methods). The ultimate limitation for faster thermal variation of YIG itself lies in the picosecond timescale for nm-thick magnetic layers and fs-duration laser pulses—see experiments on the ultrafast magnetization dynamics27,28. Moreover, spin waves might be controlled optically in the picosecond range by non-thermal effects29,30. We aim to reach these timescales in future studies, opening access to so-called dynamic media and novel physical phenomena4. Furthermore, the optically reconfigurable magnetic media proposed here open a wide range of opportunities for the novel field of spin caloritronics, addressing the interplay between magnonic, phononic and electronic systems of solid bodies31. In particular, those media can be used for the formation of two-dimensional spin current density distributions induced by the spin Seebeck effect32 in magnetic film/normal metal bilayers with complex thermal gradients. Yttrium iron garnet (Y 3Fe5O12) is often the material of choice in spintronics because of its small Gilbert damping parameter8. Spin waves can propagate several millimetres in this material. Furthermore, the rather high Curie temperature of YIG of 559 K (ref. 25) allows the creation of thermal landscapes for the control of spin-wave propagation. In our experiments we used a 5-μm-thick YIG spin-wave waveguide of 1.5 mm width. Initially, the sample is a YIG/GGG/YIG multilayer system. We remove one YIG layer by hot orthophosphoric acid etching12. About 10% of the used green light (wavelength 532 nm) is absorbed in the 500-μm-thick GGG substrate and about 40% in the YIG (obtained by Fourier transform infrared spectroscopy measurements), with about 30% being transmitted through both layers. To optimize the heat confinement in YIG, a lacquer based on nitrocellulose/acrylic paint and containing carbon black nanoparticles (CI 77266, CAS 1333-86-4) is used. It absorbs all of the light transmitted through GGG/YIG. The thickness of the absorber is around 50 μm (determined via surface profilometry). The heat conductivity of YIG is around 5–6 W K−1 m−1 at room temperature23,24. In contrast, the thermal conductivity of the black polymer–nanoparticle compound is approximately one order of magnitude smaller22. Measurements of magnonic crystal characteristics at different YIG temperatures (uniform temperature profile) showed that there are no magnetostriction effects arising due to the difference in the thermal expansion coefficients of the absorber and the YIG layer. Moreover, in doped YIG, photomagnetic effects are observed because of highly anisotropic photosensitive ions33. As our sample is not doped, photomagnetic effects are negligible. The external magnetic field, created by a permanent neodymium magnet, saturates the magnetization of YIG and is aligned in-plane and in the propagation direction of the spin waves (BVMSW geometry). Using several optical components, a continuous wave laser (Coherent Verdi V2) with a maximum power of 2.2 W and 532 nm wavelength creates a thermal profile on the sample. An acousto-optical modulator (Isomet 1205C) for temporal modulation of the laser controls the heating (6 ms) and cooling time (94 ms) of the thermal landscape. The heating pattern is generated by reconstructing a hologram on the sample. A spatial light modulator (Holoeye Pluto VIS) modifies the phase fronts of the incoming laser beam using a liquid-crystal-on-silicon display. A combination of a Galilean and a Keplerian telescope (L1–L4 in Fig. 1a) expands and confines the laser beam. Finally, a Fourier lens reconstructs the hologram on the sample. Twenty-three percent (23%) of the input laser power is available for the heating process. To minimize the speckle phenomena, the intensity pattern consists of 31-μm-wide spots separated by 124 μm (seven spots per stripe). The spatial resolution of the heat pattern induced by the hologram is of the order of ten micrometres and mainly limited by thermal diffusion effects. Taken together, the focusing optics and the SLM resolution define the minimal structure size. The optical patterns can be changed on a timescale of tens of milliseconds (SLM repetition rate of 60 Hz, but faster modulation in the kHz regime using modern digital mirror devices is possible), and switched on and off on a timescale of roughly 80 ns (rise time of the AOM). A vector network analyser (Anritsu MS4644B) measures the transmitted power (respectively, the scattering parameter S21) of the spin waves in a frequency range from 6.85 to 7.10 GHz, which is divided in 501 steps with a spacing of 0.5 MHz. The frequency is constant for every laser pulse. The excitation power of the microwave signal is set to −10 dBm to avoid nonlinearities. The experimental transmission characteristics show small oscillations with a period of approximately 2 MHz due to parasitic effects between the antennas. Thus, we use a FFT filter to smooth the raw data. The reference data of the complete spin-wave frequency range is determined via a single-shot measurement between two laser pulses. Thus, the FMR shifts to slightly higher frequencies owing to the onset of the cooling process (decreasing Tbackground). Thermal pictures are recorded with an infrared camera (FLIR SC-655). Calculated phase patterns are used to modify the laser beam through a spatial light modulator. The well-known Gerchberg–Saxton algorithm (GSA) is an iterative method to generate such holograms with a computer. The GSA iterates between the front and back focal planes of the Fourier lens. In each plane, constraints on the intensity (uniform intensity in the front focal or SLM plane and target intensity in the back focal plane) are applied. At each iteration step, the spatial phase is kept as a free parameter. Further details of this method can be found, for example, in refs 34, 35. The resulting intensity pattern consists of spots, which are iteratively balanced in their intensity by a variation of the Gerchberg–Saxton algorithm (ref. 36). The experimental feedback is provided by a CCD camera (Thorlabs DCU224M) that measures the intensities. If some spots are more pronounced than others, the iterative algorithm—based on the mean intensity value—balances out the inequality of the intensity and thus of the thermal landscape inside the spin-wave waveguide. The external magnetic field is aligned in-plane and in the propagation direction of the spin waves. The type of waves in this geometry is called backward volume magnetostatic spin waves (BVMSWs). The BVMSW dispersion relation—also accounting for the effective anisotropy—can be approximated by8: where ωH = γμ0Hext, ωM(T) = γμ0MS(T), ωani = γμ0Hani and d is the YIG film thickness. Here, γ = 2π ⋅ 28.0 GHz T−1 is the electron gyromagnetic ratio, μ0 = 4π ⋅ 10−7 N A−2 the permeability in vacuum, Hext = (143 ± 1) kA m−1 the external applied magnetic field (Hall probe measurement), and Hani ≪ Hext, MS the effective anisotropy field (a fitting parameter in our case). The temperature dependency of Hani is neglected owing to its small influence. A special point of the dispersion relation at k = 0 rad cm−1 is known as the ferromagnetic resonance (FMR) frequency: A series expansion of equation (1) for small wavenumbers k (kd ≪ 1) leads to the linear approximation: where ωFMR(T) is the ferromagnetic resonance and the group velocity, which is negative. Transfer matrices are used to describe the propagation of electromagnetic signals through media. They may thus be applied to model, for example, the propagation of spin waves in a magnonic crystal designed with sharp grooves etched into the YIG layer12. Here, for comparison of the experimental data against the theory, a transfer matrix approach is generalized for smooth one-dimensional thermal landscapes. The basis of the calculation is the thermal profile recorded with an infrared camera from the absorber side. The power of the laser impinging from the same side was adjusted to 30% of the maximum power. This corresponds to the amount of laser light transmitted through GGG/YIG without the absorber. Owing to the modified energy density of the stripes, the background temperature has to be adjusted to the value at which the maximum amount of laser power impinges on the black layer. We divided the thermal pattern into N very narrow ranges with constant temperature. The step width Δx is about 45 μm. For each step j = 1, …, N two transfer matrices  are computed: Here, Γj is the reflection coefficient given by (where Z is the wave impedance): characterizes the spin-wave propagation over the distance Δx, including the temperature-dependent wavenumber k obtained from equations (2)–(4) (ω = const ∀j): Equation (5) contains the reflection at the next temperature step: Multiplication of all the -matrices, obtained through the discretization of the heat pattern, results in the transfer matrix of the thermal landscape : The matrices are multiplied from the left side for signal propagation to the right direction. In the last step N, the propagation matrix  is applied. The power transmission coefficient Ptr is finally obtained from the diagonal elements of : The transmission suppression in Fig. 4 is shown in decibel units. The conversion is as follows: Khitun, A., Bao, M. & Wang, K. L. Magnonic logic circuits. J. Phys. D 43, 264005 (2010). Article \n    ADS \n    \n                    Google Scholar Chumak, A. V., Serga, A. A. & Hillebrands, B. Magnon transistor for all-magnon data processing. Nature Commun. 5, 4700 (2014). Article \n    ADS \n    \n                    Google Scholar Vogt, K. et al. Realization of a spin-wave multiplexer. Nature Commun. 5, 3727 (2014). Article \n    ADS \n    \n                    Google Scholar Chumak, A. V. et al. All-linear time reversal by a dynamic artificial crystal. Nature Commun. 1, 141 (2010). Article \n    ADS \n    \n                    Google Scholar Klingler, S. et al. Design of a spin-wave majority gate employing mode selection. Appl. Phys. Lett. 105, 152410 (2014). Article \n    ADS \n    \n                    Google Scholar Lenk, B., Ulrichs, H., Garbs, F. & Münzenberg, M. The building blocks of magnonics. Phys. Rep. 507, 107–136 (2011). Article \n    ADS \n    \n                    Google Scholar Krawczyk, M. & Grundler, D. Review and prospects of magnonic crystals and devices with reprogrammable band structure. J. Phys. Condens. Matter 26, 123202 (2014). Article \n    \n                    Google Scholar Serga, A. A., Chumak, A. V. & Hillebrands, B. YIG magnonics. J. Phys. D 43, 264002 (2010). Article \n    ADS \n    \n                    Google Scholar Chumak, A. V. et al. Storage-recovery phenomenon in magnonic crystal. Phys. Rev. Lett. 108, 257207 (2012). Article \n    ADS \n    \n                    Google Scholar Lee, J-H., Singer, J. P. & Thomas, E. L. Micro-/nanostructured mechanical metamaterials. Adv. Mater. 24, 4782 (2012). Article \n    \n                    Google Scholar Busch, K. et al. Periodic nanostructures for photonics. Phys. Rep. 444, 101–202 (2007). Article \n    ADS \n    \n                    Google Scholar Chumak, A. V., Serga, A. A., Hillebrands, B. & Kostylev, M. P. Scattering of backward spin waves in a one-dimensional magnonic crystal. Appl. Phys. Lett. 93, 022508 (2008). Article \n    ADS \n    \n                    Google Scholar Obry, B. et al. Microscopic magnetic structuring of a spin-wave waveguide by ion implantation in a Ni81Fe19 layer. Appl. Phys. Lett. 102, 022409 (2013). Article \n    ADS \n    \n                    Google Scholar Urazhdin, S. et al. Nanomagnonic devices based on the spin-transfer torque. Nature Nanotech. 9, 509–513 (2014). Article \n    ADS \n    \n                    Google Scholar Schneider, T. et al. Realization of spin-wave logic gates. Appl. Phys. Lett. 92, 022505 (2008). Article \n    ADS \n    \n                    Google Scholar Jamali, M., Kwon, J. H., Seo, S., Lee, K. & Yang, H. Spin wave nonreciprocity for logic device applications. Sci. Rep. 3, 3160 (2013). Article \n    \n                    Google Scholar Ding, J., Kostylev, M. & Adeyeye, A. O. Realization of a mesoscopic reprogrammable magnetic logic based on a nanoscale reconfigurable magnonic crystal. Appl. Phys. Lett. 100, 073114 (2012). Article \n    ADS \n    \n                    Google Scholar Gubbiotti, G. et al. Brillouin light scattering studies of planar metallic magnonic crystals. J. Phys. D 43, 264003 (2010). Article \n    ADS \n    \n                    Google Scholar Neusser, S. & Grundler, D. Magnonics: Spin waves on the nanoscale. Adv. Mater. 21, 2927–2932 (2009). Article \n    \n                    Google Scholar Chumak, A. V., Neumann, T., Serga, A. A., Hillebrands, B. & Kostylev, M. P. A current-controlled, dynamic magnonic crystal. J. Phys. D 42, 205005 (2009). Article \n    ADS \n    \n                    Google Scholar Topp, J., Heitmann, D., Kostylev, M. P. & Grundler, D. Making a reconfigurable artificial crystal by ordering bistable magnetic nanowires. Phys. Rev. Lett. 104, 207205 (2010). Article \n    ADS \n    \n                    Google Scholar Ebadi-Dehaghani, H. & Nazempour, M. in Smart Nanoparticles Technology (ed. Hashim, A.) (InTech, 2012). Google Scholar Schreier, M. et al. Magnon, phonon, and electron temperature profiles and the spin Seebeck effect in magnetic insulator/normal metal hybrid structures. Phys. Rev. B 88, 094410 (2013). Article \n    ADS \n    \n                    Google Scholar Rezende, S. M., Rodríguez-Suárez, R. L., Lopez Ortiz, J. C. & Azevedo, A. Thermal properties of magnons and the spin Seebeck effect in yttrium iron garnet/normal metal hybrid structures. Phys. Rev. B 89, 134406 (2014). Article \n    ADS \n    \n                    Google Scholar Stancil, D. D. & Prabhakar, A. Spin Waves: Theory and Applications (Springer, 2009). MATH \n    \n                    Google Scholar Obry, B., Vasyuchka, V. I., Chumak, A. V., Serga, A. A. & Hillebrands, B. Spin-wave propagation and transformation in a thermal gradient. Appl. Phys. Lett. 101, 192406 (2012). Article \n    ADS \n    \n                    Google Scholar Kirilyuk, A., Kimel, A. V. & Rasing, T. Ultrafast optical manipulation of magnetic order. Rev. Mod. Phys. 82, 2731–2784 (2010). Article \n    ADS \n    \n                    Google Scholar Koopmans, B. et al. Explaining the paradoxical diversity of ultrafast laser-induced demagnetization. Nature Mater. 9, 259–265 (2010). Article \n    ADS \n    \n                    Google Scholar Kimel, A. V. et al. Ultrafast non-thermal control of magnetization by instantaneous photomagnetic pulses. Nature 435, 655–657 (2005). Article \n    ADS \n    \n                    Google Scholar Satoh, T. et al. Directional control of spin-wave emission by spatially shaped light. Nature Photon. 6, 662–666 (2012). Article \n    ADS \n    \n                    Google Scholar Bauer, G. E. W., Saitoh, E. & van Wees, B. J. Spin caloritronics. Nature Mater. 11, 391–399 (2012). Article \n    ADS \n    \n                    Google Scholar Uchida, K. et al. Observation of the spin Seebeck effect. Nature 455, 778–781 (2008). Article \n    ADS \n    \n                    Google Scholar Kimel, A. V., Kirilyuk, A., Hansteen, F., Pisarev, R. V. & Rasing, T. Nonthermal optical control of magnetism and ultrafast laser-induced spin dynamics in solids. J. Phys. Condens. Matter 19, 043201 (2007). Article \n    ADS \n    \n                    Google Scholar Gerchberg, R. W. & Saxton, W. O. A practical algorithm for the determination of the phase from image and diffraction plane pictures. Optik 35, 237–246 (1972). Google Scholar Ripoll, O., Kettunen, V. & Herzig, H. P. Review of iterative Fourier-transform algorithms for beam shaping applications. Opt. Eng. 43, 2549–2555 (2004). Article \n    ADS \n    \n                    Google Scholar Waller, E. H. & von Freymann, G. Multi foci with diffraction limited resolution. Opt. Express 21, 21708–21713 (2013). Article \n    ADS \n    \n                    Google Scholar Download references The authors wish to thank the Nano Structuring Center (NSC) of the TU Kaiserslautern for support with the sample preparation. Financial support by DFG priority program SPP 1538 ‘Spin Caloric Transport’ (project VA 735/1-2) is gratefully acknowledged. Department of Physics and State Research Center OPTIMAS, University of Kaiserslautern, Fraunhofer-Platz I, 67663 Kaiserslautern, Germany Marc Vogel, Andrii V. Chumak, Erik H. Waller, Thomas Langner, Vitaliy I. Vasyuchka, Burkard Hillebrands & Georg von Freymann Fraunhofer-Institute for Physical Measurement Techniques IPM, Fraunhofer-Platz 1, 67663 Kaiserslautern, Germany Georg von Freymann You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar M.V. and G.v.F. devised and planned the project. M.V. realized the experimental set-up, performed the measurements and analysed the data. A.V.C. advised on the theory and together with M.V. wrote a first draft of the manuscript. E.H.W. supported the hologram generation. V.I.V. and T.L. prepared the samples. V.I.V., B.H. and G.v.F. led the project. All authors discussed the results and contributed to writing the manuscript. Correspondence to\n                Marc Vogel. The authors declare no competing financial interests. Supplementary Information (PDF 512 kb) Reprints and Permissions Vogel, M., Chumak, A., Waller, E. et al. Optically reconfigurable magnetic materials.\n                    Nature Phys 11, 487–491 (2015). https://doi.org/10.1038/nphys3325 Download citation Received: 17 November 2014 Accepted: 26 March 2015 Published: 18 May 2015 Issue Date: June 2015 DOI: https://doi.org/10.1038/nphys3325 Anyone you share the following link with will be able to read this content: Sorry, a shareable link is not currently available for this article.  Provided by the Springer Nature SharedIt content-sharing initiative Scientific Reports (2023) Scientific Reports (2022) Communications Physics (2021) Nature Reviews Materials (2021) Nature Communications (2019) Focus Advertisement Nature Physics (Nat. Phys.)\n                \n\nISSN 1745-2481 (online)\n    \n\nISSN 1745-2473 (print) © 2023 Springer Nature Limited Sign up for the Nature Briefing newsletter — what matters in science, free to your inbox daily. ",
    "datetime": null,
    "url": "https://www.nature.com/articles/nphys3325"
}