{
    "title": "Original ‘Oldboy’ Gets Remastered, Rescreened for 10th Anniversary in South Korea – The Hollywood Reporter",
    "text": "Subscribe for full access to The Hollywood Reporter Subscribe for full access to The Hollywood Reporter Park Chan-wook's vengeance thriller, which Spike Lee has just remade starring Josh Brolin, was instrumental in kicking off the Korean New Wave. By \n\n\tLee Hyo-won SEOUL – A digitally remastered version of Oldboy will be released in South Korean theaters on Nov. 21, exactly 10 years after its original release in 2003. Under the auspices of its director, Park Chan-wook, the film’s visuals have been revamped with color correction and elimination of scratches and dust. The editing and audios remain the same.  Q&A: Korea’s Park Chan-wook on Making His Hollywood Debut ‘Stoker’ “It’s very old, as it was made during the analog age. It was a pity to see dusty, streaked prints being screened all over the world. I’ve wanted to make a digital version for a long time,” Park was quoted as telling Yonhap News.  Considered a crown jewel of Korean New Wave cinema, Oldboy won the Grand Prix at the 2004 Cannes Film Festival with high praise from jury head Quentin Tarantino, and it helped establish Park’s reputation in the international film scene. Spike Lee is helming the U.S. remake of Oldboy. Based on a Japanese graphic novel, it is the second installment in Park’s Vengeance Trilogy. It is about a middle-aged man who is held captive inside a motel room, oblivious of the reasons why. When released 15 years later, he embarks on a vengeful quest for his captor’s motives. Related Stories\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tRelated Story\n\t\t\t\n\n\n\n\t\n\t\t\n\t\t\t\t\tKorea's Park Chan-wook on Making His Hollywood Debut 'Stoker' (Q&A)\t\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tRelated Stories\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tRelated Story\n\t\t\t\n\n\n\n\t\n\t\t\n\t\t\t\t\t'Oldboy' Stars Talk Differences Between Two Versions of Film Sign up for THR news straight to your inbox every day Sign up for THR news straight to your inbox every day Subscribe for full access to The Hollywood Reporter Send us a tip using our anonymous form. ",
    "datetime": "2013-11-18T01:06:29+00:00",
    "url": "https://www.hollywoodreporter.com/news/general-news/original-oldboy-gets-remastered-rescreened-656858/"
}