{
    "title": "Oxford English Dictionary rides the K-wave with a big Korean update | KNKX Public Radio",
    "text": "If you're looking for a way to describe your newfound love for K-dramas after watching Squid Game, you might say you're riding theKorean wave. The South Korean survival drama has exposed millions to Korean culture and is considered Netflix's biggest-ever original series launched. It's #1 in over 90 countries and for many people is their first experience with hallyu, or South Korean pop culture and entertainment. South Korean culture has made its mark in the U.S. recently through a boom in Korean skincare products as well as McDonald's BTS meal. Now it has inspired an update in the Oxford English Dictionary. The OED recently added 26 South Korean words and revised 11. Jieun Kiaer, associate professor in Korean language and linguistics at the University of Oxford, said the words were included because they are so widely used. \"But what is so significant about this,\" she said, \"is that there's been no precedent before that 26 words from one language, one year entered into OED.\" Hallyu is more than just dramas and music. It also includes food. Newly added food entries include banchan, kimbap and japchae. Terms such oppa and unni have been revised to reflect the changes in their meanings as South Korean culture has spread beyond its borders. Oppa, which was generally used by a female speaker to address an older brother, friend or boyfriend, has been revised to also refer to an attractive South Korean man. And unni is used by a female speaker to refer to an older sister or female friend; it has been revised to also refer to anyone of any gender addressing their favorite Korean actress or singer. He’s the type of guy who loves skinship huh?😏😏#CHANSUNG #찬성 #2PM  pic.twitter.com/4qUcI4Gp13 Not every new entry in the OED update is a Korean word. Fighting, a phrase often heard in K-dramas and variety shows, was added as an interjection to express encouragement and support. Skinship is a combination of the English words skin and kinship and is used to express affectionate physical touching between parents and children, friends or lovers. K-drama fans might use the term to describe scenes between romantic leads and K-pop fans use it to describe how their favorite group's members are interacting with each other. So the next time you watch a K-drama like Squid Game, you might spread the word by telling everybody how daebak it is. You can find the words in the new OED update here. Tien Le is an intern on NPR's News Desk. Copyright 2022 NPR. To see more, visit https://www.npr.org.  ",
    "datetime": "2021-10-14T21:13:17",
    "url": "https://www.knkx.org/2021-10-14/oxford-english-dictionary-rides-the-k-wave-with-a-big-korean-update"
}