{
    "title": "Pakistan's K-pop tribe keeps growing. Just what about Korean content makes it so alluring? - Comment - Images",
    "text": "Whenever I log on to my Netflix account, majority of the time, a Korean drama is almost always listed in the streaming service's category of ‘Most Popular Shows.’ In the K-pop realm, BTS too, could drop a single any time of the day and it would inevitably break the internet. Recently, my sister took to ardently devoting an hour every day to watching an episode of a popular K-drama claiming it was 'too difficult not to miss'. With her not being the only one, I notice South Korean pop culture is slowly engulfing the globe like a tidal wave and growing popular in Pakistan as well.  The phenomenon of the Korean Wave or Hallyu as it is called in Korean, is an umbrella term for Korean television dramas, fashion, food and music; the power of Korean culture encompasses the popularity of these facets and is interlinked with each other. Owing to the exemplar attached to hard work and perfection in Korean society, the South Korean music industry is worth a whopping $5 billion showcasing its multi-talented musical sensations as the best in their league. It is thus evident why K-pop (or South Korean pop music) has quickly emerged as one of the most successful music genres in the world to date, with pop groups working tirelessly in studios to synchronise dance routines, practice their vocals to reach world-class perfection and offer a unique blend of melodious, addictive tunes that are taking the world by storm. A photo posted by Instagram (@instagram) on Mar 22, 2015 at 11:21am PDT  A boy band consisting of up to seven, sometimes 11, attractive performers clad in eccentric attire, dancing to perfectly coordinated choreography on stage while singing, is hallmark of what a South Korean pop group looks like. A girl group consists of the same, if not less, identifiable traits. BTS is one of the major K-pop groups to come out of South Korea under the music label BigHit Entertainment achieving universal status as the 'world's most popular boyband' in current times. Two of the band's songs bagged a place on the Billboard Hot 100 list in 2017 and gave audience-packed performances worldwide. Their newest single 'Dynamite' got fans through quarantine, signifying their undying devotion to their socially-active fandom, better known as ARMY. Other known bands such as Blackpink, a South Korean girl group formed under YG Entertainment, is also climbing the ladder to fame recently coveting the status of commanding the fourth largest YouTube fan base in the world according to Bangkok Post.  The rapid rise of social media has played a huge role bolstering these groups onto the world-stage as their intricately crafted pop-culture industry makes its way into the consumerist media. Particularly emphasising the power of raw talent, K-pop presents a uniqueness and depth to mainstream music that takes the viewer through a kaleidoscope of a sleek aesthetic and talent rarely seen anywhere else on the planet. And that's essentially what makes BTS and K-pop in its entirety, stand out from the crowd. A consensus among general K-pop fans around the world regarding what they like about Korean pop music points to the music group's positive influence on the listeners. According to an article in Al Jazeera, BTS's ARMY fandom 'resonates with the band's messages about inclusivity, positivity, and self-empowerment, constantly voicing young people's struggles.' The devotion has propelled unflinching social activism from the fans assisting in raising awareness of campaigns such as the Black Lives Movement, encouraging donations to charities, and standing up against injustice. Moreover, the conscious urgency the band is known for in choosing what would sensibly and safely appeal to their young audience especially in a day and age rife with political and socioeconomic turmoil, puts them above those who normally wouldn't. \"I think anyone who's ever truly ventured into BTS beyond what the mainstream narrative about them being a \"pop boyband is would find it very easy to fall in love with them, their music, and their spirit,\" said Sidra* when asked about the sort of influence the pop group has had on her.  “What attracted me to them, in particular, was how they would use this medium to not only talk about important themes of mental health, class inequality, privilege, self-love, but also their personal struggles as rising but struggling artists and humans, utilising so many different genres to do so. And it's rare, if not completely new, to see artists use their platform to advocate for sincerity and while being the embodiments of that same message,\" she went on to say. She spoke with zeal about the 'transparency' the boy band inculcates in their persona, both inward and outward, which beautifully translates into their music. June 21 saw the release of We are Bulletproof: The Eternal from their 2020 album Map of the Soul:7 which sketches each of the members' struggles at the time of their debut, ending with an ode to their fans in the form of a thousand purple lights - signature of their adoration for BTS. Uriba, another K-pop enthusiast, claims their music feels like a comforting nudge from a friend inspiring her to love herself more. \"After the release of their Love Yourself album, I felt my struggles entangle with theirs. Not loving yourself enough is, after all, something everybody has dealt with. The lyrics of the song prompt me to go back to it every time I feel bad about my body or something or the other. Their kindness and hard work motivate me to work hard and be better.\"  The K-drama industry is similarly driven by the notion of a society that lauds utmost vigor and sets its sights on delivering their finest on-screen. Most recently so, a K-drama called It's Okay to Not be Okay, released on June 20 on Netflix with subtitles, has drawn popularity around the globe and successfully entered the list of highest-rated Korean dramas in television. The series has been praised for highlighting the perils of mental health and depression as it follows the tale of a community health worker and a successful children's author who find emotional solace together amidst the shadows of their harrowing pasts. In Pakistan, the growing fame of Korean dramas is gradually but undoubtedly gaining prominence. Often complete with an enriched original soundtrack, breath-taking cinematography and poignant dialogue, romantic K-dramas offer the viewer food for the soul with a dose of platitude. With the onset of the COVID-19 pandemic, Netflix has become one of the prime drivers of K-drama viewership. According to Entertainment Weekly, k-dramas are particularly popular among Asian viewers for their congeniality as well as the peculiar sense of comfort they provide.  \"I think K-dramas have an oddly satisfying quality of bringing even the most theoretically absurd ideas to life, but also showing heart wrenching depictions of mundane and everyday struggles, in a way that will leave you with so many brewing emotions,\" Ramsha* told me. \"What makes them my go-to choice is how fast-paced they are and how well they are able to craft a story to instantly grab the viewer's attention in the first fifteen minutes of the show.\" \"Not to say there still aren't many traditional tropes that are weaved in. But if, like me, you grew up on Pakistani and Indian soap operas only to realise how damaging and toxic it is to see the same damsel in distress, misogynistic, and toxic depictions of women, you'll be able to compartmentalise well,\" she went on. Any form of entertainment consumption comes with its own set of pros and cons, as it is with consuming any form of media. Despite the contrast in cultures, a few overlapping themes are reason enough to want to reach out to newer forms of entertainment. Interestingly, a desire for the unfamiliar and a sense of progressiveness is a common characteristic that prevails in Korean pop culture fans, even in Pakistan. Just like k-dramas, K-pop has been generally viewed to stem out of the audience's own genuine appreciation of the industry itself - whether in regards to fashion, music or lifestyle.  “I think people in general are iffy about Korean content; whether it's how the idea of anything becoming mainstream is synonymous to it losing \"credibility\", a general disregard for the industry as a whole and a disinterest in exploring it, or their xenophobia in seeing Korean representation taking over several facets of the global industry,” noted Areesha*. “In K-dramas, whether you are looking for comedic representations of commonplace struggles, or high-anxiety plots that leave you sleepless for weeks, you'll find them wrapped in palatable storylines, phenomenal acting, and beautiful camera work. Much like a party favour chocolate box, there is something for everyone in BTS’s discography, with fans from so many different age groups, socioeconomic classes, ethnicities, gender orientations, and sexualities finding strength and comfort in their music,” she explained. As American satirist P. J. O'Rourke put it, “Popular culture has become engorged, broadening and thickening until it's the only culture anyone notices.” The blanket of globalisation, especially during the pandemic, is increasingly blurring the lines of difference, broadening the sphere of global popular culture, while signalling a glimmer of hopeful homogeneity. Perhaps the Korean Wave suggests a chance for the mainstream - in Pakistan and the world - to rupture itself, making way for newer and more unified forms of entertainment. Compunode.com Pvt. Ltd. (www.compunode.com).Designed for Dawn. ",
    "datetime": "2020-10-08 13:53:21+05:00",
    "url": "https://images.dawn.com/news/1185806"
}