{
    "title": "Parents in Kashmir Worry That K-pop’s Influence Will Lead to Cultural Erasure. Teens Are Fully Embracing the Hallyu Wave - Muslim Girl",
    "text": "Muslim Girl There is a place in Kashmir, called Srinagar, known as Zero Bridge, that connects the residency road area directly to Rajbagh. Rajbagh is a bustling hub for coaching centers, where many teenagers go for their academic studies. When I was traveling there, I witnessed a handful of girls wearing outfits that resembled Korean fashion. Throughout Kashmir, Korean fashion is trending. This is hardly surprising given the global spread of South Korea’s cultural influence.  The popularity of Korean Cinema is growing and Korean dramas are enjoying worldwide viewership. Korean culture includes a vast range of offerings, starting with television dramas, video games, and pop music. This phenomenon is known as the Korean wave, or Hallyu, a term coined in the 1990s as Korean shows began growing in popularity in China. K-Pop and K-Cinema gave birth to Korean fashion, a trend that is conquering the fashion industry globally with its striking combination of bold colors, statement prints, and baggy silhouettes. Today, Korean fashion is even accepted and embraced in Kashmir, India. Teenage girls can be seen wearing sportswear and streetwear with color-blocked clothes, baggy silhouettes, puffed-up vests, anoraks, and leather. I decided to interview some of the girls and found that the majority of them were influenced by social media K-pop culture and Korean drama. Once they dove into the world of K-pop and K-drama, they became fans of the attire and were soon emulating it. Kashmiri local garment sellers became aware of this new trend and soon after, they began selling similar clothes. I also decided to explore the influence of South Korean customized culture on traditional Kashmiri culture. Here’s what I learned from the Kashmiri teens embracing the K-pop scene — and how some of them found themselves expressing their Muslim identities through Korean streetwear. 19- year-old Maryam Shafi embraced Korean fashion when she watched an Instagram reel. Maryam liked the baggy and unconventional dressing the girl in the reel was wearing. “I became obsessed with the culture, the clothes, and the makeup. I soon bought Korean cultural clothes.” Maryam felt comfortable on the first day of wearing such clothes, although some people initially pointed or stared at her Korean-stylized dress. According to Maryam, she felt safe as it covered her body properly — unlike the other types of clothes she used to wear. Although some people initially pointed or stared at her Korean-stylized dress, Maryam said she felt safe as it covered her body properly — unlike the other types of clothes she used to wear. This trend started to grow after the 2019 internet blockade and started to spread its wings among young teenage girls. Korean pop culture is listened to and loved by teenagers all around Kashmir; teenagers have developed a love for the Korean language over the last couple of years. Many parents do not love this new era of trendy fashion. They believe this might change the native fashion of the valley and is a threat to Kashmiri culture and tradition. Oveesa Farooq, a  professor at Women’s College Srinagar said, “I have two little daughters who are just school students. I see them watching Korean drama for the entire day; I personally don’t like it. I always suggest them to watch something more of their own culture which will help this new generation to know about Kashmiri culture and tradition.” Many parents do not love this new era of trendy fashion. They believe this might change the native fashion of the valley and is a threat to Kashmiri culture and tradition. Naseema Nazir, a 55-year-old mother, recalls when Kashmiri culture was found in every street.  “Our fashion represented our valley,” she says. But now Nazir sees more Western clothing and other new styles of fashion. “Some of them make no sense and some are oversize,” she remarks. “I see a change in our traditional Pehran. There is a sense of modern touch to it. It’s a sort of new pattern of Pehran unlike what I was used to seeing,” Naseema added. 20-year-old Farhana Bashir Shah loves to watch Korean drama. She is a big fan of K-pop Culture. Her favorite band is BTS, and she greatly enjoys their music. She, like many Kashmiri teens, finds herself enamored with Korean culture. Farhana says, “I keep myself updated whenever there is a new song from BTS. I like everything related to Korean culture. The way their food looks, the way they eat with chopsticks, and much more. I do find myself wearing baggy clothing just because I like it and it suits me. My family has no problem with my fashion sense.” I keep myself updated whenever there is a new song from BTS. I like everything related to Korean culture. The way their food looks, the way they eat with chopsticks, and much more. 17-Year-old Zaira from Srinagar recalls searching for the boy band BTS after a friend recommended them to her. “I learned and listened to a lot more K-Pop after that,” she laughs. Zaira thinks the main motive for listening to K-pop, particularly BTS is, “self-love.” She proudly shows off her room, saying “Now I have my room flooded with BTS posters!” “As a teenager, I think today self-love is much more important than anything else. It’s very important to maintain the balance of accepting your limitations and then working towards them. BTS and their journey inspire this. We should not only just listen to their music, but also embrace the message they are sending,”   Zaira explains. 20-year-old Sadaf Khan was scrolling through various Instagram reels. When she saw one of the clips of the K-cinema movie Parasite, Sadaf became interested in it. She researched the movie, read some reviews, and decided to watch it. Before this, Sadaf had never seen a foreign-language movie. “So far, I have seen around 25 Korean movies, all with subtitles. I’m left with some kind of emotion all the time I watch Korean cinema. It made me think about the different situations in that movie. I haven’t felt much emotion after I watch Hollywood movies,” Sadaf offers. Korean movies overtly portray women as cute, wide-eyed young girls, with a tendency to pout in an exaggerated manner when they’re being made fun of, to which the heroes are quick to diffuse the situation, while a sentimental piano plays in the background. There is a Hallyu wave in India. Many people are aware of K-pop and are listening to the songs. The turnout for Korean movies is huge in India. In schools and colleges, you can hear girls talking about K-pop or humming tunes. Since 2019, more people have become aware of K-pop. On the streets, you can see girls wearing BTS shirts or boys wearing G-Dragon (Big Bang) caps. “It’s good to know that Kashmiris have started accepting other cultures since Kashmiri women have only been restricted to traditional dressing in the past. “It’s good to know that Kashmiris have started accepting other cultures since Kashmiri women have only been restricted to traditional dressing in the past. For the last several years, women have started to express themselves more and more and Korean culture is the beginning of such change,” 19-year-old Sundus shares. One thing is clear: despite Kashmir being a sensitive and conflict zone region, it continues to keep up with international trends. In Kashmir, girls are using their sense of style as a form of self-expression and freedom.  Previous post Vogue France Features a Hijabi on Its Cover for the First Time Next post 4 Gen Z Muslims Reflect on the Post-9/11 World They Were Born Into Sign up for our to receive exclusive content straight to your inbox and stay up to date with the latest news. ",
    "datetime": "2022-09-08T12:00:00+00:00",
    "url": "https://muslimgirl.com/parents-in-kashmir-worry-that-k-pops-influence-will-lead-to-cultural-erasure-teens-are-fully-embracing-the-hallyu-wave/"
}