{
    "title": "\r\n\tPark Seo Joon asked: 'Why do you think K-dramas are so popular?' | ABS-CBN News\r\n",
    "text": "Home\n > \nEntertainment Posted at Oct 29 2020 01:34 PM Share A post shared by 박서준 (@bn_sj2013) on Mar 29, 2020 at 11:46pm PDT  MANILA – When he first visited the Philippines in 2019, South Korean actor Park Seo Joon said he did not expect to have a lot of Filipino supporters. One year later, he told Sam Oh in an interview with Smart K-Life that he feels the same way seeing how the Korean wave has been sweeping over the Philippines. “It was surprising because I don’t take on a project expecting popularity and love. I’m also fascinated because our languages are different. I don’t I really feel it until now, it still doesn’t feel real. It’s also amusing but most of all, I’m very grateful,” he said in Korean. When asked why he thinks K-dramas became so popular even outside South Korea, he said: “I’m no analyst so I’m not sure. But if I were to venture a guess, I’d think that anyone in the world can relate to the human emotions and feelings of the situations that arise on these K-dramas. I also think the actors and crew of K-dramas have improved a great deal which leads to better programs.” But for the 31-year-old actor, it’s the interest of fans that is the biggest factor. “If there was no interest from people, we would be easily forgotten” he said. On a lighter note, Park also shared during the interview with Oh his favorite Korean food as well as some tips or advice on skin care and fashion. “For food, based on a show I did where I ran a restaurant abroad, I found that bibimbap is the most popular. It’s one of the tastiest dishes as a Korean. But I think foreigners also like that it’s a complete and healthy meal so I would recommend that,” he said. For skin care, Park said the most important thing to know is one’s skin type. “I don’t wear makeup often but when I do, I think removing it well is important. This is basic stuff that everyone knows, so I don’t know if I have any tips,” he said. He also talked about fashion trends, saying, “I think it’s best to know your body type and dress the way you like. If you can dress to reflect your interests, I think that’s good too.” Park’s interview was part of Smart Communication’s announcement that he is its latest international endorser following Hyun Bin and Son Ye Jin of “Crash Landing On You.” Like the two, Park is also set to visit the Philippines in the future when travel restrictions ease up. Park is notable for starring in the dramas \"She Was Pretty,\" \"Hwarang,\" \"Fight For My Way,\" and \"What's Wrong with Secretary Kim.\" Most recently, he starred in the series \"Itaewon Class.\" Share US police launch manhunt for gunman who killed at least 22 October 26, 2023 Pumpkins for Halloween emojis? October 26, 2023 NAIA expects Undas influx to begin on Friday October 26, 2023 Palace: No suspension of work, classes on Oct. 31 October 26, 2023 USAID to fund development of 9 PH secondary cities October 26, 2023 © 2023 ABS-CBN Corporation. All Rights Reserved. AboutCareersPrivacyTermsContact UsAdvertise With Us ",
    "datetime": null,
    "url": "https://news.abs-cbn.com/entertainment/10/29/20/park-seo-joon-asked-why-do-you-think-k-dramas-are-so-popular"
}