{
    "title": "\r\n\tPark Seo Joon wants to meet Filipino fans anew | ABS-CBN News\r\n",
    "text": "Home\n > \nEntertainment Posted at Oct 04 2020 03:28 PM Share A post shared by 박서준 (@bn_sj2013) on Mar 29, 2020 at 11:46pm PDT  If travel and mass gathering restrictions ease up, one country that South Korean actor Park Seo-Joon would like to visit again is the Philippines. The 31-year old actor, known for recently starring in the series \"Itaewon Class,\" made the statement in an interview with local lifestyle publication Metro.Style. \"If this situation will be resolved as soon as possible, if there are still people who support me, I hope we can meet up soon,\" Park said in the video, addressing his Filipino fans. \"I'm also hoping for that and I hope you stay healthy until then,\" he added. A post shared by 박서준 (@bn_sj2013) on Sep 25, 2020 at 11:59pm PDT  Park recounted his previous promotional activity in the Philippines, which he described as an \"amazing experience\" because of the immense support shown by Filipino fans. \"I went to the Philippines for a promotion before. When I am in Korea, I don't feel the support that much. But when I went there (Philippines), I had an amazing experience,\" he said. A post shared by 박서준 (@bn_sj2013) on Dec 31, 2018 at 7:05am PST  In September 2019, Park held a fan meet at the Mall of Asia Arena after he was picked as a celebrity endorser for homegrown clothing brand Bench. Aside from \"Itaewon Class,\" Park is notable for starring in the dramas \"She Was Pretty,\" \"Hwarang,\" \"Fight For My Way,\" and \"What's Wrong with Secretary Kim.\" The COVID-19 pandemic has prompted countries to impose travel restrictions and prohibit mass gatherings, leading also to the cancellation and postponement of concerts and fan meets by \"Korean wave\" artists in the Philippines. Share US police launch manhunt for gunman who killed at least 22 October 26, 2023 Pumpkins for Halloween emojis? October 26, 2023 NAIA expects Undas influx to begin on Friday October 26, 2023 Palace: No suspension of work, classes on Oct. 31 October 26, 2023 USAID to fund development of 9 PH secondary cities October 26, 2023 © 2023 ABS-CBN Corporation. All Rights Reserved. AboutCareersPrivacyTermsContact UsAdvertise With Us ",
    "datetime": null,
    "url": "https://news.abs-cbn.com/entertainment/10/04/20/park-seo-joon-wants-to-meet-filipino-fans-anew"
}