{
    "title": "Park Hae-jin arrives in Madame Tussauds Singapore | Macau Business",
    "text": "SINGAPORE – Media OutReach – 15 July 2021 – DAEBAK! K-drama actor Park Hae-jin will arrive at Madame Tussauds Singapore this week. He will be standing alongside Song Seung-heon and Bae Suzy in the new K-Wave zone where fans can meet the heartthrob actor for a limited period only!  To celebrate his arrival, guests can now get immersed in the Korean culture and wear a hanbok proudly sponsored by CCM Rental in the K-Wave zone over three weekends – 24, 25, 31 July, 1, 7, 8 and 9 August! It will be fun, comfortable, fancy, and great for photoshoot with your favourite Korean celebrities.    The Hanbok Experience Bundle is priced at $40/pax. The bundle will be launched exclusively with Klook which will be on sale between 16 to 22 July and can be purchased using the SingapoRediscovers Vouchers. The bundle will also be available on Madame Tussauds Singapore’s website for visits from 23 July onwards.  The bundle will include ticket to 5 different experiences  (Madame Tussauds, Images of Singapore, Ultimate Film Star Experience, Spirit of Singapore Boat Ride, and Marvel Universe 4D), Hanbok Rental, an exclusive cherry blossom designed reusable mask and a Digital Photo.    Park Hae-jin made his television debut in the 2006 weekend drama ‘Famous Chil Princesses’ and rose to be a prominent actor known for his roles in dramas such as ‘My Love from the Star’, ‘Doctor Strange’, and ‘Bad Guys’. He also took home the Daesang at the 2020 MBC Drama Awards for his starring role in ‘Kkondae Intern’.  “We are happy to have Park Hae-jin joining the rest of the stars at the new K-Wave zone. We believe that his figure will definitely be a great addition and we will continue to bring in more stars throughout the year,” says Alex Ward, General Manager of Madame Tussauds Singapore.    Madame Tussauds Singapore is SG clean certified, and hanboks would be sanitized with TrueSteam™ technology on LG Styler after each use.  Come and enjoy the brand-new K-wave zone with the SingapoRediscovers Vouchers. Enjoy free island admission till end of September!  For high res images: https://bit.ly/MTSGkwavemeediakit  Madame Tussauds SingaporeTwitter: @MTsSingapore Instagram: @MTsSingapore Facebook: @MadameTussaudsSingaporeHashtag: #MadameTussaudsSG  The ultimate celebrity experience and the world’s best known and most popular wax attraction. There are currently 23 Madame Tussauds attractions around the world.  Each of the attractions is unique and tailored to the host city and visitor demographic to feature both local as well as international figures.  The result of 200 years of expertise and painstaking research every figure takes Madame Tussauds’ gifted sculptors a minimum of three months to make, and costs more than $300K (Singapore dollars). Most contemporary figures are also produced following sittings with the celebrities themselves.   ",
    "datetime": "2021-07-14T17:00:00+00:00",
    "url": "https://www.macaubusiness.com/park-hae-jin-arrives-in-madame-tussauds-singapore/"
}