{
    "title": "Pentax K-3 Review",
    "text": "Ricoh's flagship APS-C camera, the 24-megapixel Pentax K-3 is jam-packed with clever technology, yet it's also affordably priced and among the very smallest enthusiast DSLRs. As well as overhauled imaging, autofocus, and metering, it also boasts an industry-first system that lets you choose whether resolution or moire-resistance are more critical for any given shot. But can its unique advantages tempt you away from mainstream rivals Canon and Nikon? (And should you upgrade, if you're already a Pentaxian?) Find out in our Pentax K-3 review! Top-notch image quality; Great ergonomics in a compact body; Unique on-demand low-pass filtering; Broad sensitivity range; Large and bright viewfinder for an APS-C camera; Dual card slots; Optional Wi-Fi remote control AE Lock button is poorly located; Below-average battery life for a DSLR; Rather dated-looking menu system; Requires a different battery grip accessory than its predecessors; Less third-party support than some rivals Available since November 2013, the Pentax K-3 digital SLR is priced at US$1,300 body-only in the US market. Body-only, that's just US$100 more than the launch price for the Pentax K-5 II, and the exact same price at which the Pentax K-5 IIs first shipped. This seems eminently reasonable, considering that the Pentax K-3 is a complete overhaul, where the earlier cameras were relatively modest updates. (To put things in perspective, the K-3 is actually priced US$300 below the launch price of the Pentax K-5, just three years earlier.) 4.5\nout of 5.0 Overview, Hands-on and Technical Info by Mike Tomkins, with Geek's Guide by Dave Etchells\nPosted 10/07/2013 Updates:11/06/2013: Image Quality Comparison Analysis\n12/26/2013: Field Test Blog Part I: Initial thoughts02/06/2014: Field Test Blog Part 2: Time for some more exciting glass!04/28/2014: Field Test Blog Part 3: Off to the races! Last edited: 12/21/2016 --- UPDATE: 12/21/2016:\nThe Pentax K-3 was long the flagship of Ricoh's DSLR camera line, at least unless you wanted to step up to a pricey medium-format camera. Those days are over: The full-frame Pentax K-1 is here to occupy the middle ground between Ricoh's APS-C and medium-format models! As well as offering a much larger sensor than the K-3, the Pentax K-1 also boasts much higher resolution, a far broader sensitivity range, a much bigger viewfinder with helpful on-demand overlays, a more sophisticated autofocus system, and built-in GPS and Wi-Fi radios to help keep tabs on where your photos were shot, then get them online as quickly as possible. The K-1 also won a Camera of Distinction award for \"Best Professional DSLR\" in our 2016 Camera of the Year Awards. For all the details, read our Pentax K-1 review, or to see how the sub-frame Pentax K-3 stacks up against the full-frame K-1, check out our side-by-side comparison here: Pentax K-3 vs. Pentax K-1. --- Since the launch of the Pentax K-7 in 2009, the company's flagship models have been among our favorite enthusiast-grade digital SLRs. Pentax's most recent iterations -- the simultaneously-launched K-5 II and K-5 IIs -- were very much evolutionary models, with only relatively minor changes from their shared predecessor. The Pentax K-3, unlike its recent precessors, is revolutionary -- and not just because it's the first in the series to be made under the watch of Ricoh, the Pentax brand's new owner. Not only does the Pentax K-3 feature significant changes inside and out, it also includes an industry first: on-demand low-pass filtering which lets you choose whether ultimate resolution or resistance to moiré are more important for any given shot. The attention-grabbing, mechanical alternative to an optical low-pass filter has clearly grabbed all the headlines, and deservedly so, but there's plenty else besides that makes the Pentax K-3 an exciting upgrade. Perhaps most obviously, there's a brand-new body that -- while it retains the spirit of the design first introduced with the K-7 -- makes some significant changes to the controls for the first time in several generations. The 24.3-megapixel Pentax K-3 also packs 50% more pixels into its APS-C sized image sensor, increasing linear resolution by almost a quarter. Yet thanks to a new PRIME III image processor, it simultaneously increases performance. Pentax claims a whopping 8.3 frames per second at full resolution, for as many as 60 JPEG or 23 raw frames. And despite the significant resolution increase, the K-3 still offers a maximum sensitivity of ISO 51,200 equivalent. Pentax has gifted its newest APS-C flagship with a brand-new, much finer-grained metering sensor with 86,000 RGB pixels, not to mention a much more capable 27-point autofocus sensor. All but two of the K-3's focus points are cross-types, sensitive to detail on both the horizontal and vertical axes. And at the center of the array, three points provide for autofocus with apertures as bright as f/2.8. If you prefer focusing manually, you'll find a new focus peaking function in live view mode to be a very handy addition. The Pentax K-3 also boasts double the shutter life of its predecessor, along with an improved image stabilization system that should better fight image blur. And on its rear panel, you'll find both a brighter pentaprism optical viewfinder with greater magnification, and a larger, higher-resolution LCD monitor. Both storage and connectivity options have been refreshed, too. The Pentax K-3 provides dual SD card slots with support for high-speed UHS-1 cards, and supplements its high-def video output with a new USB 3.0 SuperSpeed data connection, helping you get all your images and movies off the camera in the shortest possible time. And speaking of movie capture -- long an area in which Pentax has lagged its rivals -- this, too, has received a total overhaul. The Pentax K-3 now uses more efficient H.264 video compression, allows single autofocus during movie capture, and provides a much more generous selection of movie frame rates. It also allows program, priority, and manual exposure control for movies. And the existing stereo microphone jack has been supplemented with a headphone jack for levels monitoring, plus a fine-grained audio levels control. You can even opt for a stereo levels display during video capture, should you wish! Clearly, a lot has changed. The good news is that almost everything we loved about earlier Pentax flagships has been retained for the K-3. It still sports a solid magnesium-alloy body with great ergonomics, and despite an enthusiast-friendly control layout, it's still barely any larger than the typical consumer SLR. The Pentax K-3 is also still freezeproof and fully weather-sealed. And as you'd expect, it retains enthusiast-friendly features such as a 100% pentaprism viewfinder, twin control dials, a built-in flash sync terminal, and support for an optional portrait/battery grip. Alongside the Pentax K-3, the company also launched several new accessories, most of which hit the market at the same time as the camera body. The Pentax D-BG5 battery grip replaces the earlier D-BG4 that was compatible with the Pentax K-7, K-5, and K-5 II / IIs models. It's priced at around US$230 list. There's also a new weather-sealed HD Pentax-DA 55-300mm F4-5.8ED WR lens, priced at about US$450. Finally, a Pentax-branded, Wi-Fi capable Flucard SDHC card had yet to go on sale as of December 2013, but will ship for US$100 in a 16GB capacity. Not only will this allow wireless data transfer, it will also let you control your camera remotely (including live view feed) from your PC, or from recent Android / iOS smart devices. In the past, Pentax has also offered limited-edition silver-bodied variants of its flagship DSLRs, and it did so for the Pentax K-3, as well. There was a slight change in strategy, though. Previously, you've typically had to wait many months after launch to get your hands on a silver Pentax SLR. This time around, the Pentax K-3 Premium Silver Edition shipped immediately alongside its black-bodied sibling. It was sold in a bundle with a silver D-BG5 battery grip, and an exclusive leather strap. Just 2,000 units were offered worldwide, and with a pricetag of only US$1,600, they cost an almost insignificant US$70 more than the black version plus battery grip. At that price, it's not surprising that these didn't hang around on store shelves, with stock vanishing almost instantly. If you still want to buy the silver Pentax K-3, you'll need to look to the second-hand market unless you're very lucky in finding remaining stock. (And if you have that kind of luck, may we suggest picking up a lottery ticket at the same time?) Now that we're done with the introductions, let's take a closer look at the Pentax K-3! Place your order with trusted Imaging Resource affiliate Adorama now: Or with Amazon: Or with B&H Photo Video: Walkaround. Just like its predecessors, the Pentax K-3's body is constructed of magnesium alloy over a steel chassis -- and that's mag-alloy on all sides, unlike some rivals. (The Nikon D7100, for example, has magnesium alloy panels top and rear, but polycarbonate plastic panels on the front, bottom, and sides.) The K-3 is still fully dust and weather-sealed, and now sports a total of 92 different seals, up from 77 in the K-5 II. That difference is likely down to the need to seal new controls and connectivity, rather than to an increase in the already-impressive water resistance. And like its predecessor, the Pentax K-3 is also freezeproof to 14°F / -10°C, while at the upper end of the range it's possible to shoot in temperatures of 104°F / 40°C. Although it's still pretty compact as rugged, control-and-feature-rich enthusiast SLRs go, the Pentax K-3 has grown in size just slightly compared to its predecessors. With dimensions of 5.2 x 3.9 x 3.1 inches (131 x 100 x 77mm), it's grown in height by around 3% (0.1 inches / 3mm), and in depth by some 5% (0.2 inches / 4mm). It's also grown in heft, with a weight of 28.2 ounces (800g) when loaded with battery and Secure Digital card, up 5% from the 26.1 ounces (760g) of its predecessor. Seen from the front, the Pentax K-3 looks a lot like its predecessors, the K-7, K-5, K-5 II, and K-5 IIs, but it's actually a brand-new body. (And that's big news, because really, there have only been very minor changes to the body design since it first debuted in 2009.) Relatively few of the changes can be seen from the front of the camera. The handgrip has been subtly reprofiled, with a taller and deeper cutout to help give your fingers purchase, and there's a small hump beneath the K-3 badge on the opposite side of the body. This doesn't really affect grip much unless you're using a pancake lens, in which case it gives a slightly more secure two-handed grip. Its main purpose, though, is to house a new headphone jack, as you'll see in the left-side view below. There's also a single-hole port for the microphone, just below and to the right of the P in the Pentax logo (as seen from the rear of the camera). It's still a mono mic, but the new position should result in slightly better reception of sound from subjects in front of the camera. Previously, it sat on the top deck. The only other changes are very subtle. The Shake Reduction badge beneath and to the right of the lens mount is now black and gold, rather than red and silver. If you deploy the flash strobe, you'll also find that -- while its specifications are unchanged -- it's a new unit, with ever so slightly smaller surface area, and a linear Fresnel lens rather than a circular one. On the top deck, the changes are more obvious. For one thing, you can see that the increase in body depth is largely down to a deeper thumb grip at the top right corner of the rear panel, which again helps to make for a slightly more secure and comfortable grip. The Mode dial has also been reworked, with its Movie position dropped, and the previous User position replaced by three separate user modes, U1 thru U3. (That, sadly, means that while you now have direct access, you lose two modes, since earlier models allowed five user modes to be accessed through the single User position.) More importantly, the physical metering mode switch beneath the Mode dial is gone, replaced instead with a switch that either enables or disables the central lock button for the Mode dial. It's a thoughtful change that caters both to fans of the existing, locking Mode dial, and those who prefer a free-spinning dial. When turned clockwise to unlock the dial, it simultaneously lowers the lock button, so you can easily feel whether or not the dial is locked. We saw something similar in the Olympus E-M1, which lets you toggle the mode dial lock each time you press the center button, so this is clearly answering a perceived need from photographers. Another top-deck change is that the monochrome LCD info display has been revisited, with several new indications added. These include both the metering mode and AF point selection, since there are no longer physical controls that show the status of either function. The K-3 also boasts dual card slots, and the info LCD can show to which of these you're currently writing, and in which file format. More subtle changes include the absence of the microphone port, previously located in front of the hot shoe, and the diopter adjustment slider on top of the viewfinder. (We'll come back to that in a moment.) Pentax has also relocated the focal plane marking to the right side of the pentaprism hump. (Previously, the marking was just to the right of the info LCD.) The bulk of the changes, though, are to be found on the rear panel. Starting at top left, the Delete button now doubles as a Metering button when in Record mode. You simply hold it down and roll the front or rear dial to change metering modes, and the result can be confirmed either in the viewfinder, on the info LCD, or (if active) on the main LCD. The change does mean that you can't confirm the metering mode without powering the camera on, but it also means you're less likely to forget to check it when you glance at the info LCD. One slight quirk, though, is that you can't change the metering mode when you're viewing the Control Panel display. (The same is also true when you're in the menu system, or in Playback mode.) Moving across to the viewfinder, it looks little-changed, although its optics and internal coatings have been reworked for a slightly larger, brighter image. If you look just right of the viewfinder, though, you'll see a new diopter adjustment dial, which replaces the previous adjustment slider that sat on top of the viewfinder. The new dial has around 20 detents that help you make small, reasonably precise adjustments, although I'm not an eyeglass-wearer, and so can't comment on their efficacy. The adjustment range is unchanged, though, so if you were happy with the correction provided by the earlier cameras, you should be OK here too. Want to learn more about the Pentax K-3's pentaprism viewfinder?\nClick here to see our viewfinder test results. The change does mean that the viewfinder eyepiece frame, which is still removable, has been changed. It no longer has a cutout at its top surface for the linear slider of the earlier cameras. You can still use existing eyepieces -- for example, the O-ME53 viewfinder loupe -- they'll just have a cutout for a control that isn't there. Just beneath the diopter adjustment dial is a new Live View / Movie Record button. This works in concert with another new control that sits near the top right corner of the LCD, the Still / Movie switch. Together, these make for a quicker and more intuitive way to switch between still capture through the viewfinder, still capture in live view mode, and movie capture. The addition of the Still / Movie switch, though, means that Pentax has also had to remove the physical AF point selection switch. We'll come to its replacement in a moment. I'm happy to say that the Still / Movie switch is much easier to turn than the AF point selection dial was, even when shooting single-handed. The AF button, which used to sit in the center of the AF point selection dial, has now moved to the top right corner of the camera, much where the AE Lock button used to be. I'm fine with that change, but less happy with the new location for the AE Lock button, which is very close to the corner of the camera body, and right above the hump for the rear grip. It's not the easiest or most comfortable location to reach, and while I learned to live with it, I'm still not happy with its new location. There's also a brand-new button at the bottom right of the corner. As I've already alluded to, the Pentax K-3 has dual flash card slots, and this button is used in Playback mode to switch between the two, letting you choose from which card to view images and movies. In Record mode, the same button is used to toggle the Four-way controller between its primary and secondary functions -- either the functions marked on each of the four arrow buttons, or autofocus point selection. (If you're using 27-point autofocus, the button doesn't do anything in Record mode.) Once again, there are also a number of more subtle changes. To accommodate a slightly larger, higher-resolution 3.2-inch LCD monitor, the controls to its right are a little tighter-spaced, especially the Info and Menu buttons. The change isn't huge, though, and I didn't find them any harder to identify by touch. The Four-way controller with its central OK button has also been tuned somewhat. For one thing, the Up Arrow button, which doubles as a Drive mode selector, is now also labeled as a Self-timer button. And all four Arrow buttons now have raised triangular bevels at both ends, making it easier to tell when your finger is centered on the button, and letting you press the corners of adjacent buttons together. That lets you make a diagonal selection, so that for example you can scroll diagonally in an image when using playback zoom. The new LCD, incidentally, is a gapless type as used in the K-5 II and K-5 IIs. I don't have access to either of those cameras at the moment, but compared to the display on my K-5, it's a little brighter and richer. It also has noticeably better contrast and less glare. It's no more or less prone to fingerprints than it was, though -- which is to say, not terribly so. I found it perfectly fine for outdoor viewing under even fairly bright light, although like any LCD it will wash out under direct sunlight. Finally for the rear panel, Pentax has moved the IR port downwards slightly, and closer to the Four-way controller, while the card access lamp has moved upwards a bit. There's also now a slight bevel at the rightmost edge of the LCD display, so the controls stand proud from the screen just slightly. And of course, since Pentax is now a Ricoh brand, the logo beneath the LCD monitor acknowledges this fact. (But the Pentax name still gets prime billing on the front of the camera.) On the left hand side, there are again several changes. Key among these are a reworked Focus Mode switch, and a new AF Mode button. The focus mode switch now has only autofocus or manual focus options, and it's easier to turn than in the past. To switch between single-servo and continuous-servo autofocus, which was previously accomplished using the Focus Mode switch, you must now hold down the new AF Mode button while turning the front dial. If you turn the rear dial while holding down the AF Mode button, you access the various point selection options, replacing the now-absent AF Point Selection dial. Options include 27-point, 9-point, Select, and Spot. In single-servo mode, Select allows you to choose any single point from which to focus. In continuous-servo mode, you can choose a single point to focus, and then optionally allow the camera to roam to any of eight surrounding points, any point within a 5 x 5 grid, or any point on the autofocus sensor. (And for the 3x3 or 5x5 roaming options, you can move the center point around the array.) A couple of other changes on the left side include a new headphone jack, as alluded to earlier, plus a rearrangement of the connectivity options. The USB port -- now a SuperSpeed or USB 3.0 Micro B type -- sits at the top, above the HDMI and DC Inputs. The HDMI port is now a Type-D Micro connector, and the 8.3 volt DC Input is unchanged. The rubber flap which covers all of these ports now has a bigger lip that makes it easier to pull open, but I found it quite a bit more fiddly to close, requiring me to carefully press at numerous points along its length before it would seat nicely. The right side of the camera is little-changed externally, although the two compartment covers are now slightly longer. The reason for that change: dual SD card slots beneath the card compartment cover. The front slot is the primary, and the rear slot is the secondary. Both will accept SDHC and SDXC cards for higher capacity, and UHS-I cards for higher speed. And of course, the compartment door is still weather-sealed. Beneath sits the wired remote terminal connector door, which is unchanged from that in the earlier cameras. And finally, the bottom of the camera looks nearly identical. There's still a locking battery compartment door, unlocked by pulling out the metal lock hasp out with a fingernail, and then rotating it 90 degrees. You may notice a subtle change in the size of several screw holes on the Pentax K-3's base, though. This change prevents use of the existing portrait grip -- doubtless because it doesn't quite fit the redesigned body. It's a bit of a shame to lose compatibility with the existing grip, but in fairness, it's lasted us through three generations since the original K-7, so I can't gripe too much. Pentax revolutionizes low-pass filtering. In a truly revolutionary move, Pentax has developed a solution for variable, on-demand low-pass (anti-aliasing) filtering in digital cameras, the first implementation being in their new K-3 DSLR. This is such an important development that we're going to devote a little time to explaining how they do it, and why it's so significant. Low-pass filters, aka anti-aliasing (AA) filters are an important part of digital imaging of which most people have little understanding. Recently, there's been a move afoot in the photo industry to eliminate them, which we at IR consider ill-advised. They're very necessary in some situations, yet in others needlessly reduce resolution and sharpness. Clearly, what's needed is a way to have a low-pass filter when you need it, and do away with it when you don't. That's exactly what Pentax has just made possible for the first time, in their new K-3 SLR. Take a deep dive into the K-3's selective low-pass filter! Sensor. The Pentax K-3 is now based around a 24.35-megapixel image sensor, up from the 16.3-megapixel chip used in the K-5, K-5 II, and K-5 IIs. With 50% more pixels, the new chip theoretically yields around a 22% increase in linear resolution. Maximum image size is 6016 x 4000 pixels. The new sensor is still a CMOS chip with Bayer RGBG filter array, but it's fractionally smaller than the previous generation. Dimensions are 23.5 x 15.6mm, down from 23.7 x 15.7mm. Total resolution is 24.71 megapixels, well above the 16.9 megapixels of the previous-gen chip. As in the Pentax K-5 IIs, the Pentax K-3 doesn't include an optical low-pass filter. It does, however, add an on-demand mechanical antialiasing function. More on that in a moment. (Or read the \"Geek's Guide to On-Demand Low-Pass Filtering\" by IR publisher Dave Etchells, for the full story.) Click to read detailed Pentax K-3 technical information Before I get down to my thoughts on the Pentax K-3, a little background would probably be appropriate. When I'm reviewing cameras, I'm pretty brand-agnostic: What the camera can do for me is far more important than the badge on the front. I can't afford to own everything I get to review, though, or to keep changing allegiance to a new lens mount. For the last few years, I've used Pentax's flagship DSLRs as my daily shooters, after the original Pentax K-7 brought me into the fold back in 2009. A couple of years later, I upgraded to the K-5, but I skipped the subsequent K-5 II, as it was a fairly modest update. When I first heard news of the Pentax K-3, I was thrilled. There's a lot I love about my K-5, but there are areas in which I wanted to see the company make some improvements -- especially autofocus -- and with the K-3, it seems to have done so. As well as the new AF system, I also found the prospect of better metering, dual flash card slots, a better and wider-aspect LCD monitor, and a brighter viewfinder to be particularly appealing. And the promise of greater all-around performance doesn't hurt, either. Check out my initial impressions of the K-3 In the first part of my Pentax K-3 Field Test, I shot exclusively with the 18-135mm kit lens that can be purchased in a bundle with the camera body. In part, I did so because that's the one lens K-3 shooters are most likely to own, and we always try to ensure we cover kit lenses for that reason -- even if they're not the most exciting optics available. It also didn't hurt that I happened to own a copy of the same lens myself, meaning I could shoot side-by-side with my K-5, with no fussing and changing lenses back and forth. With a consumer camera, the kit lens might very well be the only lens you'll shoot with, but that's almost certainly not the case with an enthusiast SLR like the Pentax K-3, though. For that reason, I was keen to get out and shoot with some of my nicer lenses. Sadly, I didn't have duplicates of these, so shooting side by side with these meant an exceptional amount of switching lenses between bodies. Check out how the K-3 handled some classic Pentax lenses! And finally, we come to the last section of my Field Test -- and my decision whether to buy the Pentax K-3 for myself. This section has been a while coming, for which I apologize -- every time I've gone to return to shooting and writing, something else has come up. Just one example: The subject I'd chosen for my planned autofocus and burst performance testing didn't cooperate. I'd been intending to shoot with the K-3 and K-5 side by side at a local drag racing strip to get a good sense for how the two cameras' performance compared. Come the day, heavy rains had flooded the pit lane and the track day was canceled. Check out how the K-3 AF performed at the go-cart track! The K-3 sports 8 more megapixels than the K-5, so we were eager to see how image quality would improve and how it would handle noise at higher ISOs. We compare the K-3 to the Nikon D7100, Olympus E-M1 and Sony A77 (among others). NOTE: These images are best quality JPEGs straight out of the camera, at default settings including noise reduction and using the camera's actual base ISO (not extended ISO settings). All cameras in this comparison were shot with our very sharp reference lenses. Pixel peep to your heart's content! Image quality on the screen and printed output don't always mesh. Our print quality analysis gives you a definitive answer to the question: \"How large can I print my photos as I push ISO?\" Stepping up to a 24MP sensor, the Pentax K-3 sets a much higher resolution benchmark than the K-5 II and IIs at 16MP, and the results show in the print quality department at ISOs 100-400, allowing a full print size higher at each setting. The results from ISO 800 and up however tell a different story, as there is virtually no discernible difference in print quality between the K-3 and its lower-resolution siblings. So if you are considering the K-3 and will be making sizable prints from the fruits of your labors, it will be at the lower ISOs that you will see the biggest difference in image quality as compared to the K-5 II and IIs. Check out how the K-3 print quality holds up at higher ISOs Inside and out, new is the name of the game for Ricoh's flagship APS-C DSLR, the Pentax K-3. The weather-sealed, magnesium alloy body is brand-new, and so is the high-res 24.3-megapixel image sensor, paired to a speedy new PRIME III image processor that's capable of 8.3 frames-per-second burst shooting. There's also a much finer-grained metering sensor, and the K-3 brings the first major overhaul of Pentax's phase-detect autofocus system in a decade. Pentax has also gifted the K-3 with dual high-speed SD card slots, swift USB 3.0 transfer, an overhauled movie mode complete with levels monitoring, and even -- via an optional accessory -- support for wireless live view shooting. The most exciting new feature, though, is the Pentax K-3's impressively-clever on-demand optical low-pass filtering system. In the quest for ultimate resolution, Pentax's rivals have simply removed the low-pass filter altogether, unleashing finer details at the risk of moiré and aliasing artifacts. The Pentax K-3 gives you the best of both worlds, instead. It forgoes the low-pass filter for maximum detail when shooting subjects like portraits or landscapes, but cleverly uses the camera's Shake Reduction system to emulate a low-pass filter for moiré-prone subjects like fabric, bricks or mesh. Read the conclusion for our final verdict!  The Pentax K-3 retail box ships with the following items:   $1080.95\n(35% more) 24.2 MP Also has viewfinder 7% larger K-3 vs D7200 $1198.00\n(42% more) 24.3 MP Also has viewfinder 15% larger K-3 vs A77 II $619.00\n(13% less) 24.2 MP Also has viewfinder Similar size K-3 vs T6s $934.95\n(25% more) 24.2 MP Also has viewfinder 11% larger K-3 vs 80D $613.62\n(14% less) 24.24 MP Also has viewfinder 18% smaller K-3 vs K-70 $996.95\n(30% more) 20.9 MP\n(17% less) Also has viewfinder Similar size K-3 vs D7500 $549.99\n(27% less) 24.2 MP Also has viewfinder Similar size K-3 vs 77D $1649.00\n(58% more) 20.2 MP\n(21% less) Also has viewfinder 22% larger K-3 vs 7D Mark II $598.00\n(17% less) 24.3 MP Also has viewfinder 15% larger K-3 vs A68 $829.99\n(16% more) 24.35 MP Also has viewfinder Similar size K-3 vs K-3 II $549.00\n(27% less) 24.2 MP Also has viewfinder Similar size K-3 vs T6i $1598.45\n(56% more) 20.9 MP\n(17% less) Also has viewfinder 26% larger K-3 vs D500 $699.99 24.2 MP Also has viewfinder Similar size K-3 vs T7i $1199.00\n(42% more) 32.5 MP\n(25% more) Also has viewfinder 10% larger K-3 vs 90D $998.99\n(30% more) 24.32 MP Also has viewfinder Similar size K-3 vs KP $549.98\n(27% less) 18 MP\n(35% less) Also has viewfinder Similar size K-3 vs T6 $898.45\n(22% more) 24.2 MP Also has viewfinder 21% smaller K-3 vs D5600 $496.95\n(41% less) 24.2 MP Also has viewfinder 11% smaller K-3 vs D3400 $549.00\n(27% less) 24.2 MP Also has viewfinder 29% smaller K-3 vs SL2 $469.00\n(49% less) 24.1 MP Also has viewfinder Similar size K-3 vs T7 Follow Imaging Resource ",
    "datetime": null,
    "url": "https://www.imaging-resource.com/PRODS/pentax-k3/pentax-k3A.HTM"
}