{
    "title": "\r\n\tPH is 4th country 'tweeting most' about K-content | ABS-CBN News\r\n",
    "text": "Home\n > \nEntertainment Posted at Sep 06 2022 02:35 PM | Updated as of Sep 06 2022 04:24 PM Share MANILA — The Philippines is among the countries \"tweeting most\" about South Korean pop culture, Twitter said Tuesday, showing how the Korean wave has swept the Southeast Asian nation. The Philippines ranks fourth among the countries in the world with the most Twitter users posting about K-content, the social network said in a report, which is based on \"English and Korean-langauge tweets globally from Jan. 1 to Aug. 18, 2022.\" Home country South Korea topped the list, followed by Thailand and the United States at second and third place, respectively. Indonesia, meanwhile, ranked fifth. The other countries are: 6. India\r\n7. Malaysia\r\n8. Brazil\r\n9. Japan\r\n10. United Kingdom\r\n11. Mexico\r\n12. Canada\r\n13. France\r\n14. Vietnam\r\n15. Spain\r\n16. Singapore\r\n17. Italy\r\n18. Turkey\r\n19. Germany\r\n20. Peru In the Philippines, \"Snowdrop\" is the most \"tweeted about\" K-drama so far this year, Twitter said. Set in 1987, \"Snowdrop,\" which aired from December 2021 to January 2022, tells the story of a university student and North Korean spy who meet and fall in love. It stars actor Jung Hae-in and Jisoo of the K-pop girl group Blackpink. The coming-of-age drama \"Twenty-Five Twenty-One\" and zombie horror \"All Of Us Are Dead,\" which both ran earlier this year, ranked second and third, according to Twitter. The other \"most tweeted about\" K-dramas in the Philippines this year are: 4. Business Proposal\r\n5. Our Beloved Summer\r\n6. Extraordinary Attorney Woo\r\n7. Semantic Error\r\n8. Anna\r\n9. The Red Sleeve\r\n10. Forecasting Love and Weather Over the past decade, the number of tweets about K-content have increased by 546 percent, Twitter said. The social network said K-pop idols landing roles in TV dramas, like Kim Se-jeong in \"Business Proposal,\" helped drive further interest in K-content. \"K-pop communities on Twitter are passionate and we’re now seeing that strong culture of fandom growing and including a wide variety of K-content,\" said Kim Yeon-jeong, head of Twitter's Global K-pop and K-content partnerships. In 2021, the Philippines ranked third among the countries with the most number of K-pop fans on Twitter. RELATED VIDEO Share MPL Season 12: Blacklist ends 6-game drought vs. ECHO October 26, 2023 Google shows off generative AI productivity, cybersecurity tools October 26, 2023 Maryland show reimagines PH mythical creature 'manananggal' October 26, 2023 UK, PH greenlight prisoner transfer agreement October 26, 2023 Biden: 'Ironclad' ang defense commitment ng US sa Pilipinas October 26, 2023 © 2023 ABS-CBN Corporation. All Rights Reserved. AboutCareersPrivacyTermsContact UsAdvertise With Us ",
    "datetime": null,
    "url": "https://news.abs-cbn.com/entertainment/09/06/22/ph-is-4th-country-tweeting-most-about-k-content"
}