{
    "title": "Photos: South Korean teens dream of becoming the next K-pop star | PBS NewsHour",
    "text": "Subscribe to Here’s the Deal, our politics\n                 newsletter for analysis you won’t find anywhere else. Thank you. Please check your inbox to confirm. Ariel Min\n\n\n                    Ariel Min Leave your feedback Kim Si-yoon doesn’t keep the schedule of a typical 9-year-old. Up by 7:30 a.m. for school, followed by hours of voice training lessons, piano lessons, dance lessons and a private English tutor session, she is on a determined path to K-pop stardom. And in South Korea, Kim is not alone. DEF Dance Skool in Seoul, where Kim takes her dance classes, is just one of thousands of schools in the country that nurture the next generation of K-pop stars. In 2013, DEF had approximately 1,000 students, half of whom are trying to break into the top agencies. Kim Si-yoon, center, takes part in a dance class at DEF Dance Skool in Seoul Nov. 11, 2014. Photo by Kim Hong-Ji/Reuters A recent survey of pre-teens in South Korea showed that 21 percent of kids wanted to be K-pop stars like Psy when they grow up — making it the most popular career choice. In college, pop music is one of the most coveted majors. Korean pop culture, often dubbed Hallyu (Korean word for “Korean Wave”) has been around since the late 1990s, born with popular TV dramas, reality shows and the music industry that constantly produces boy bands and girl groups who have been hits across much of South East Asia. In the past few years, reality shows looking for the next K-pop stars have been the craze, usually starring top judges from the “Big Three” talent management companies. Reuters photographer Kim Hong-Ji followed the aspiring wannabe 9-year-old, as well as a popular girl group named “Gfriend” as they prepare and perform a big show. Kim Si-yoon plays the piano during a lesson in Seoul Nov. 20, 2014. Photo by Kim Hong-Ji/Reuters Left: Kim Si-yoon and Yoo Ga-eul take a selfie at a restaurant in Seoul Nov. 15, 2014. Right: Kim Si-yoon and Yoo Ga-eul look at a smart phone as they take a short break at DEF Dance Skool in Seoul Nov. 7, 2014. Photos by Kim Hong-Ji/Reuters Kim Si-yoon attends a private English lesson in Seoul Nov. 20, 2014. Photo by Kim Hong-Ji/Reuters Kim Si-yoon plays a toy guitar at her house in Seoul Nov. 20, 2014. Photo by Kim Hong-Ji/Reuters Kim Si-yoon and her mother pray before dinner at their house in Seoul Dec. 16, 2014. Photo by Kim Hong-Ji/Reuters Kim Si-yoon, right, and Yoo Ga-eul dance in front of their mothers as they play at a playground in Seoul Nov. 15, 2014. Photo by Kim Hong-Ji/Reuters Yoo Ga-eul plays in a playground in Seoul Nov. 15, 2014. Photo by Kim Hong-Ji/Reuters Kim Si-yoon puts on her makeup as she arrives with her mother to take part in a dance class late at night at DEF Dance Skool in Seoul Dec. 16, 2014. Photo by Kim Hong-Ji/Reuters Members from South Korean girl group GFriend receive a makeover as SinB, second to right, and Yuju, right, look on at a beauty salon in Seoul Dec. 23, 2014. Photo by Kim Hong-Ji/Reuters Various cosmetics are laid out at a beauty salon in Seoul Dec. 23, 2014. Photo by Kim Hong-Ji/Reuters Friend rehearse in Seoul Dec. 23, 2014. Photo by Kim Hong-Ji/Reuters GFriend perform during a dress rehearsal of The Show in Seoul Jan. 20, 2015. Photo by Kim Hong-Ji/Reuters Fans of South Korean girl group GFriend react as they perform during “The Show” in Seoul Jan. 20, 2015. Photo by Kim Hong-Ji/Reuters GFriend perform during “The Show” in Seoul Jan. 20, 2015. Photo by Kim Hong-Ji/Reuters Left: Members of GFriend take a selfie after their performance in “The Show” in Seoul January 20, 2015. Right: A member of the group signs autographs on their album in Seoul Jan. 20, 2015. Photo by Kim Hong-Ji/Reuters The group leaves the studio after the taping of “The Show” in Seoul Jan. 20, 2015. Photo by Kim Hong-Ji/Reuters Left:\n                Kim Si-yoon, second from the right, and Yoo Ga-eul, right, take part in a singing lesson at DEF Dance Skool in Seoul Nov. 15, 2014. Photo by Kim Hong-Ji/Reuters Ariel Min\n\n\n                    Ariel Min Visit CANVAS, PBS NewsHour's art hub. Support Provided By:\nLearn more Subscribe to Here’s the Deal, our politics\n                 newsletter for analysis you won’t find anywhere else. Thank you. Please check your inbox to confirm. © 1996 - 2023 NewsHour Productions LLC. All Rights Reserved. Sections About Stay Connected Subscribe to ‘Here's the Deal,’ our politics newsletter Thank you. Please check your inbox to confirm. Learn more about Friends of the NewsHour. Support for NewsHour Provided By ",
    "datetime": "2015-02-04T15:38:25-04:00",
    "url": "https://www.pbs.org/newshour/world/kpop"
}