{
    "title": "Physics - Phonons Hum a Magnetochiral Tune",
    "text": "When you look at the left and right hand of a person, they look the same. However, from the symmetry point of view those two hands are not identical; they are actually a mirror image of each other. When mirror images behave differently, we call that chirality. Certain materials are chiral in that left-handed and right-handed light propagates differently through them. Magnetic fields can also induce chiral effects through their interaction with charged particles. When a chiral material is subjected to a magnetic field, an additional effect arises that results in directionally dependent optical properties. This so-called magnetochiral effect (MChE) is not limited to light, as it can also occur for particles, such as electrons, and even for quasiparticles like magnons (vibrations of magnetic spins). However, the effect has been difficult to produce with phonons (vibrations of atoms), in part because these lattice oscillations within a material have a very weak coupling to magnetic fields. Now, Toshihiro Nomura from the Helmholtz-Zentrum Dresden-Rossendorf in Germany and colleagues have demonstrated, for the first time, an MChE for phonons [1]. This work might inspire future applications, such as an acoustic diode or a one-way thermal barrier. The first documented report of chirality effects in materials was made by French scientist François Arago at the beginning of the 19th century, who found that the axis of linearly polarized light gets rotated when passing through quartz crystals [2]. This rotation—called natural optical activity—is due to a small but measurable difference in the speed of left-handed and right-handed circularly polarized light inside quartz. A similar effect—called magnetic optical activity (or Faraday rotation)—arises in all transparent materials when a magnetic field is applied parallel to the direction of light propagation. The magnetochiral effect is a combination of natural and magnetic optical activity that results in one-way, or “nonreciprocal,” behavior. This means that optical properties such as the index of refraction or absorption are different for light traveling parallel and antiparallel to the magnetic field—irrespective of the light’s polarization. Natural and magnetic optical activity have been known for more than a century, but researchers only observed MChE for the first time in 1997 [3]. More recently, the effect was isolated for electron transport in a chiral material exposed to a magnetic field [4]. The concept of MChE can also be extended to quasiparticles—emergent entities within a strongly interacting many-body system—such as phonons, magnons, and plasmons (oscillations in plasma). The fact that MChE has been demonstrated for magnons [5] might not be surprising, as magnons are “magnetic.” But phonons have less of a magnetic connection. To overcome this challenge, Nomura et al. [1] have used a chiral material, copper oxoselenite ( Cu2OSeO3), which, because of the strong coupling between its chiral crystal symmetry and its magnetism, represents a good candidate for phonon MChE. In their experiment, the researchers utilized single crystals of  Cu2OSeO3 that were either left handed or right handed. In each case, they fitted each side of the crystal with a transducer—a piezoelectric device that converts electrical signals to ultrasonic waves and vice versa. One transducer generated acoustic waves with wave vector   k, while the other one detected these phonons after they traveled through the crystal. For temperatures below 60 K and magnetic fields around 0.1 T, the team observed a difference of as much as 0.01% in the speed of sound waves traveling in the “forward” ( +k) vs “backward” ( −k) direction. If the crystal was left handed and the magnetic field pointed in the forward direction, then the   +k waves went faster than the   −k waves (Fig.  1). Flipping the direction of the magnetic field or changing the handedness of the crystal resulted in the   −k waves being faster. If both magnetic field and chirality were switched, then the   +k waves were again faster. These dependencies on field and chiral directions imply that the observed nonreciprocity is a manifestation of a phononic magnetochiral effect. In order to explain the observed behavior, the authors invoked a process of magnon-phonon hybridization. Two quasiparticles can hybridize when their dispersion relations (their frequency vs momentum curves) cross. For  Cu2OSeO3, this crossing occurs for frequencies around 3 GHz, at which point, excitations of the crystal become a mixture of phonons and magnons. The experiments were performed at relatively low frequencies (less than 1 GHz), where the hybrid quasiparticles are predominantly phonons. Nevertheless, the hybridization is strong enough that these low-frequency phonons “inherit” some magnon properties. Specifically, magnons in  Cu2OSeO3—as shown in previous work [6]—exhibit a magnetochiral nonreciprocity, which is then transferred to phonons in a way that depends on the frequency of the sound wave. The team verified this picture by showing that the frequency dependence of the magnetochiral effect in phonons matched the predictions from a hybridization model. Since phonons are involved in the transmission of sound and heat, this effect could potentially be used to construct diodes that would inhibit the passage of sound or heat in one direction (see 25 August 2009 Focus story). The field of phononics [7] is devoted to the control of phonons with diodes and other specially designed nanostructures, such as thermal logic gates and thermal transistors. Given the rather small sound speed difference (less than 0.01%) in  Cu2OSeO3 and the relatively narrow range of magnetic field values and temperatures where the effect is observed, it is hard to imagine that this will immediately make a substantial difference for researchers in phononics. Nevertheless, this type of effect can be expected for any chiral-lattice magnet, so the search is on to find those that exhibit MChE at or close to room temperature. Fortuitously, there already exist several candidates, like FeGe and Co-Zn-Mn alloys (known for their twisted magnetic states, or “skyrmions”), which might be nanostructured in order to enhance the desired effects on phonons. This research is published in  Physical Review Letters. Ivica Živković holds a Ph.D. in physics from the University of Zagreb, Croatia. After his postdoctoral research at the Swiss Federal Institute of Technology (EPFL), he worked at the Institute of Physics, Zagreb. Later, he joined the Laboratory for Quantum Magnetism at EPFL as a senior scientist. His work is focused on various aspects of magnetism, with recent interests including skyrmions, spin-liquids, single-molecule magnets, and geometrically frustrated systems. T. Nomura, X.-X. Zhang, S. Zherlitsyn, J. Wosnitza, Y. Tokura, N. Nagaosa, and S. Seki Phys. Rev. Lett. 122,  145901 (2019) Published April 10, 2019 A detailed experimental analysis explains the forces by which a spinning magnet can cause another magnet to levitate in midair. Read More » Irradiating a uniaxial magnetic system with a specific sequence of microwave pulses can induce in the system quantum oscillations that cause the material’s spins to flip back and forth. Read More » Using a “bad” acoustic mirror, physicists demonstrate a phonon beam splitter, a device that could one day be used to make phonon-based quantum logic gates. Read More » T. Nomura, X.-X. Zhang, S. Zherlitsyn, J. Wosnitza, Y. Tokura, N. Nagaosa, and S. Seki Phys. Rev. Lett. 122,  145901 (2019) Published April 10, 2019 A homogenous mixture of two self-propelling species first forms a polar vortex and then spontaneously demixes, thanks to a difference in speeds and other competing effects. If ultralight dark matter particles exist, they can contribute no more than 70% of the dark matter between Earth and a set of monitored pulsars. Enzymes that span the cell membranes of an octopus of the genus Pareledone have acquired mutations that enable them to catalyze reactions well at low temperatures. More Recent Articles » Sign up to receive weekly email alerts from Physics Magazine. Use of the American Physical Society websites and journals implies that the user has read and agrees to our  Terms and Conditions and any applicable Subscription Agreement. ",
    "datetime": "2019-04-10",
    "url": "https://physics.aps.org/articles/v12/40"
}