{
    "title": "Physics - Paving the Way to Space-Based Gravitational-Wave Detectors",
    "text": "The announcement in February 2016 that the Laser Interferometer Gravitational-wave Observatory (LIGO) had detected gravitational waves from the merger of two black holes stunned and electrified much of the physics and astronomy communities  [1]. However, while all eyes were turned toward LIGO, the LISA Pathfinder (LPF)—a technology demonstration mission for the Laser Interferometer Space Antenna (LISA) gravitational-wave detector  [2]—was quietly but convincingly paving the way toward the next revolution in gravitational-wave astronomy more than 1.5 million kilometers away from Earth. After a six-month program that began with the launch of the spacecraft in early December 2015, the team behind LPF has now announced the first results from the mission  [3]. Following a 50-day journey to Lagrange Point 1 of the Sun-Earth system, LPF settled into orbit to begin a series of spacecraft acceptance tests and an observing campaign to measure the limits with which two test masses can achieve free fall. LPF was designed to test many of the key technologies needed by LISA. LISA will target a much lower gravitational-wave frequency band than LIGO, from about 100  𝜇Hz to 1 Hz. This regime is sensitive to gravitational waves from mergers of intermediate to massive black holes in the range of  104 to  107 solar masses, as well as from mergers of black holes that have an extreme mass ratio (in which one black hole is much more massive than the other). But it necessitates a space-based platform to avoid low-frequency noise sources arising on Earth, which easily overwhelm the signal from such waves. These mergers will provide the most stringent tests of General Relativity in the strong-gravity regime. A gravitational wave physically manifests itself as a strain,  ΔL∕L, on two separated, free-falling test masses: For masses separated by a distance  L, a passing gravitational wave will dynamically stretch and compress, through one cycle of the wave, the distance between the masses along one direction perpendicular to the propagating wave, by an amount  ΔL, while simultaneously compressing and stretching the distance by an equal amount in the other perpendicular direction. By measuring the time that light takes to travel between two sets of separated test masses, the time-dependent strain can be recorded. To meet its astrophysics goals, LISA demands a length  L of 2 million kilometers and a sensitivity to a displacement  ΔL of approximately  5×10−11 m at frequencies in a range near 100 mHz  [2]. LPF is a single spacecraft whose test masses are separated by less than a meter. As such, it is completely insensitive to gravitational-wave strains, but it probes the limits of displacement sensitivity required by LISA, which will consist of three spacecraft configured in a triangle and located much further from Earth. The basic concept behind LPF is simple: place the two test masses in a spacecraft in free-fall and measure the residual time-dependent longitudinal displacement between the two masses over periods of days to weeks. From this measurement, infer the relative residual acceleration between the two masses and thus any difference in the forces acting on them. Since the test masses, which are roughly cubic in shape and made of a gold­–platinum alloy, are free-falling objects, each is free to move in three translational and three angular degrees of freedom. Their longitudinal displacement is sensed and controlled using laser heterodyne interferometry, a technique that mixes two laser beams of slightly different frequency—as opposed to a single beam—to measure the displacement with high resolution. The remaining degrees of freedom are measured using a series of capacitors located on the spacecraft. Specifically, capacitive electrodes surround each test mass, sensing proximity to the test masses and applying control voltages to gently nudge the test masses in displacement and angle to the desired position. By applying forces at frequencies outside the measurement band and limiting the amount of “control authority” exercised on the test masses, these forces do not disturb the free fall of the test masses in the frequencies of interest to LISA. However, controlling the test masses alone is not sufficient. LPF relies on “drag free” control of the spacecraft to keep it out of the way of the test masses. By reading out the position of the spacecraft relative to one of the test masses, the spacecraft’s attitude (its orientation relative to the reference frame defined by the test masses) is adjusted using thrusters capable of producing micronewton forces to precisely maintain the attitude relative to the test masses. The true complexity comes from the exquisite sensitivity with which LPF must sense the relative longitudinal displacement of the masses and to a lesser extent the auxiliary degrees of freedom. LISA places extreme requirements on minimizing the residual forces that can disturb the test masses. Any force acting on the test masses causes displacements that can mask a gravitational-wave signal. An abbreviated compendium of forces that LPF contends with includes: forces from trapped molecules in the volume surrounding the test masses, which can buffet the masses (viscous damping); electrodynamic forces caused by the accumulation of charge on the test masses originating from cosmic rays; control forces imposed by the feedback loop actuators that hold the test masses to a specified position; photon-pressure forces from variations in laser power; and even forces associated with the dynamic gravitational field gradients arising from the motion of the spacecraft. The results reported by the LPF team are, quite simply, a tour de force in precision measurement. LPF greatly exceeds the mission requirements set for “differential acceleration noise” (essentially the frequency-dependent residual acceleration between the masses). But by far the most impressive result is that LPF exceeds the LISA noise requirement over the high-frequency range above 10 mHz and comes close (within 25% of the requirement) over much of the low frequency range. These results bode extremely well for the future LISA mission. Although LISA will use different techniques for performing interferometry, the LPF experiments firmly establish that the precision needed by LISA for measuring test-mass displacements are well in hand, setting the stage for the next era in gravitational-wave detectors. This research is published in  Physical Review Letters. Correction (8 June 2016): An earlier version of this Viewpoint incorrectly stated the unit of the lower bound of LISA’s target frequency band as mHz. The correct unit is  𝜇Hz. David Reitze holds joint positions as the Executive Director of the LIGO (Laser Interferometer Gravitational-wave Observatory) Laboratory at the California Institute of Technology (https://www.ligo.caltech.edu) and as a Professor of Physics at the University of Florida. He received a Ph.D. in physics from the University of Texas at Austin in ultrafast laser spectroscopy in 1990 and has worked extensively in the area of experimental gravitational-wave detection for the past 20 years. He is a Fellow of the American Physical Society and the Optical Society of America. M. Armano et al. Phys. Rev. Lett. 116,  231101 (2016) Published June  7, 2016 If ultralight dark matter particles exist, they can contribute no more than 70% of the dark matter between Earth and a set of monitored pulsars. Read More » Interstellar magnetic fields perturb the trajectories of cosmic rays, making it difficult to identify their sources. A new survey of gamma radiation produced when cosmic rays interact with the interstellar medium should help in this identification. Read More » Black holes may be less unique than previously thought, as the expansion due to a cosmological constant can hold apart a pair of holes and allow them to mimic a single black hole. Read More » M. Armano et al. Phys. Rev. Lett. 116,  231101 (2016) Published June  7, 2016 If ultralight dark matter particles exist, they can contribute no more than 70% of the dark matter between Earth and a set of monitored pulsars. A homogenous mixture of two self-propelling species first forms a polar vortex and then spontaneously demixes, thanks to a difference in speeds and other competing effects. Enzymes that span the cell membranes of an octopus of the genus Pareledone have acquired mutations that enable them to catalyze reactions well at low temperatures. More Recent Articles » Sign up to receive weekly email alerts from Physics Magazine. Use of the American Physical Society websites and journals implies that the user has read and agrees to our  Terms and Conditions and any applicable Subscription Agreement. ",
    "datetime": "2016-06-07",
    "url": "https://physics.aps.org/articles/v9/63"
}