{
    "title": "Physics - Free-Falling Interferometry",
    "text": "At nanokelvin temperatures, Bose-Einstein condensates (BECs) of dilute atomic gases are quantum to the core. In a paper in Physical Review Letters, researchers from the QUANTUS Collaboration now report for the first time their results of an experiment where a Bose-Einstein condensate of rubidium atoms is formed on a microchip, released from a height, coherently split, and brought to interference under microgravity in free fall [1]. This has all been accomplished in an autonomous capsule dropped from a  110-meter-high tower at the Center of Applied Technology and Space Microgravity (ZARM) in Bremen, Germany, which offers one of the best microgravity environments on Earth, with residual accelerations at the level of  10-6g. In drop-tower experiments, the entire “laboratory” is mounted in a capsule: lasers, vacuum chamber, electronics, optical components, magnetic coils, detectors, fast information processing units, and more (Fig. 1). All that is placed into a narrow cylinder and dropped as a whole in an evacuated tube, which then crashes into a receptacle at the bottom of the tower. The experiment starts when a cold ensemble of rubidium atoms is loaded into a magneto-optical trap on a chip. The laser-cooled atoms are then transferred into a magnetic trap where the thermal cloud is evaporated across the phase transition to Bose-Einstein condensation. Even in this quantum-degenerate ensemble, the weakly repulsive interaction between the atoms necessitates further cooling to about  1 nanokelvin and shielding from undesired  B fields by adiabatic transfer to an insensitive Zeeman state. All that takes as little as  2.7 seconds, about the time of three heart beats and yet sufficiently long for the capsule to fall nearly  36 meters before the “real” experiment starts—even though the atoms still have two thirds of the tower to fall. Another  1.8 seconds can be used for all subsequent manipulation and interference of the atomic cloud. An atom interferometer generates two output branches of interfering partial BECs that can be seen in absorption imaging, just before the capsule hits the ground. And this is the result: a combination of cutting edge technology to realize quantum coherence over macroscopic distances and times in a free-falling capsule. One might wonder why one would possibly want to undertake such an incredible effort, involving a large crowd of bright scientists, a unique infrastructure, substantial running costs, and engineering at the edge of modern technology, just to learn what we knew from earlier experiments: very cold atomic ensembles behave really strangely and are truly nonclassical when properly prepared. There are at least two reasons that I can see. We often say that quantum physics is both a mind-boggler and the basis for future and emergent technologies. The new experiment by this research team is a perfect example of that. Quantum mechanics makes us scratch our heads because objects that we tend to approximate as little billiard balls when looking at interactions, may actually appear widely delocalized when we give them time to expand their wave function without any further perturbation or measurement. Wave-particle duality in quantum mechanics has attracted a large number of modern demonstrations with atoms and molecules [2,3]. Such experiments are important because they force us to think about the profoundly nonclassical nature of matter, including the fact that even large objects may not possess a well-defined position in space. One goal, therefore, is to apply quantum superposition to objects with the highest mass, the largest clouds of atoms, the lowest or the highest temperature, the longest coherence times, and so forth. This helps us to test if quantum mechanics remains the optimal theory under all circumstances and why it becomes seemingly obsolete at truly macroscopic scales. In that respect, the experiment at Bremen is among the “classics” of quantum experiments. It shows quantum coherence over truly macroscopic scales: each atom in the expanding ultracold atomic cloud individually delocalizes by millimeters and maintains its quantum phase for longer than  0.7 seconds. These are distances and time scales of everyday experience, and I would not be surprised to see this experiment in a textbook rather soon. Such dimensions are impressive but also potentially useful. It has been known for almost four decades, since the first studies with neutrons [4], that matter-wave interferometers can be very subtle sensors for rotation, gravity, and various other forces and fields. While the best available atomic quantum sensors can already compete with laser-based or classical devices, they may fulfill their utmost potential once they are separated from the most common noise sources on Earth. Free-falling matter-wave interferometers bear promise as ultrasensitive force sensors and probes to test general relativity theory with quantum bodies. Future experiments in drop towers or vehicles in outer space may lead to precision experiments in geodesy, explorations of the equivalence principle or gravity waves—just to name a few. All these devices exploit the quantum-mechanical separation of atomic wave functions. Their sensitivity grows with the area enclosed between the interferometer arms and the signal-to-noise ratio that can be achieved. In many modern implementations, the atomic wave function is controlled by a number of laser pulses, which can be precisely timed. In this case, the enclosed area is determined by the momentum recoil that can be imparted at each beam splitting laser stage as well as by the free evolution time between the pulses. While the laser wave vector  k=2π/λ enters linearly, the time between the pulses enters quadratically in the phase. Both parameters—area and time—are currently being improved by a number of pioneers in various places: this includes, for instance, work towards a large atomic fountain interferometer [5], the realization of an atomic sensor in zero- g parabolic flights [6], large-area multiphoton beam splitters [7,8], and interferometers [9]. The experiment at ZARM reported by Müntinga et al. is an important achievement because it combines many highly delicate pieces into an experiment of both extreme finesse and ruggedness: in the blink of an eye, it drives atomic clouds to temperatures that are rare in our Universe, and it does all that while the entire experiment is reliably and repeatedly crashed from heights that none of the experimentalists would ever survive. The machine runs autonomously and demonstrates that hands-off microgravity experiments have achieved a technology readiness that calls for further work on sounding rockets, the international space station, or a dedicated satellite. While interaction time and area are key issues, one may also want to factor in signal-to-noise. Although by far the highest beam flux may be achieved in supersonic atomic beams, atomic Bose-Einstein condensates offer the important advantage of ultralow temperatures and ultralow atomic velocities—the best one can possibly realize on Earth and in space. This allows one to minimize the lateral expansion of the atomic cloud to a size that still fits in the machine during the free-fall time. But even so, the experimental team had to implement a trick that had been known before and which now became crucial in the exploit of long interference times. Delta-kick cooling [10] relies first on the expansion of different atomic velocity classes into a spatial distribution that can be subsequently compressed by a pulsed and spatially inhomogeneous control potential. This allowed the Bremen team to realize clouds as cold as a  1 nanokelvin and enabled them to contain the cloud in the observation region. Since the first demonstrations of BEC with dilute atomic gases in 1995 [11], more than one hundred groups have joined the global effort to better understand and exploit fundamental quantum phenomena in a truly mesoscopic system. This comprises, for example, investigations of how BEC physics interfaces with condensed matter physics, quantum information, and quantum sensing. The consortium united in the new ZARM experiments has been busy in this field for some time, and has already shown they could repeatedly produce a BEC under microgravity [12]. Their new work goes a step further: they produce even colder atom clouds and demonstrate the first matter-wave interference experiment in the technologically highly demanding environment of a drop tower. While the drop tower implements a close-to-perfect zero- g environment, it is not a zero rotation arrangement. A free-falling cloud will be deflected eastwards. The rotation of the Earth has already proven to be an important factor in earlier precision experiments [9], but it could be overcome in a genuine space experiment, that is, if we neglect subtle effects such as general relativistic frame dragging, which are another motivation for atom interferometry in space. So what remains to be done? A look at the experimental fringes presented by Müntinga and colleagues indicates that future precision metrology still requires future work and substantially more repetitions of similar experiments. But drop-tower experiments are rare: ZARM Bremen is still a unique European test facility, which currently allows three repetitions per day. Significant upgrades in signal-to-noise—more specifically signal—would be required to turn this demonstration device into a working sensor. Yet it is a perfect test case for preparing experiments that many colleagues may hope to see in orbit soon. Markus Arndt is a Professor of Physics at the University of Vienna and head of the Quantum Nanophysics Group. After his Ph.D. with Antoine Weis and Theodor W. Hänsch at MPQ Garching and LMU Munich he spent two years with Jean Dalibard at the ENS Paris where he worked on ultracold atoms, atom optics, and atom interferometry. In 1997 he joined Anton Zeilinger as a postdoc in Innsbruck to jointly start the field of macromolecule interferometry. He moved to Vienna in 1999 where he has worked ever since. His current interests cover matter-wave interferometry, molecular quantum optics, quantum-enhanced molecule metrology, molecular sources, detectors, and cooling methods as well as the interface between quantum physics and biology. H. Müntinga et al. Phys. Rev. Lett. 110,  093602 (2013) Published February 25, 2013 Measurements indicate that intense x-ray pulses can change the electronic structure of a material on femtosecond timescales, a finding that could improve imaging of light–matter interactions. Read More » The 2023 Nobel Prize in Physics honors the field of attosecond physics, which offers a nonblurry view of the fast-moving electrons inside atoms and molecules. Read More » Researchers have turned an optical lattice into a ratchet that moves atoms from one site to the next.  Read More » H. Müntinga et al. Phys. Rev. Lett. 110,  093602 (2013) Published February 25, 2013 If ultralight dark matter particles exist, they can contribute no more than 70% of the dark matter between Earth and a set of monitored pulsars. A homogenous mixture of two self-propelling species first forms a polar vortex and then spontaneously demixes, thanks to a difference in speeds and other competing effects. Helical bacteria and corkscrew rods can both undergo handedness reversals that could be useful in future robotic systems. More Recent Articles » Sign up to receive weekly email alerts from Physics Magazine. Use of the American Physical Society websites and journals implies that the user has read and agrees to our  Terms and Conditions and any applicable Subscription Agreement. ",
    "datetime": "2013-02-25",
    "url": "https://physics.aps.org/articles/v6/23"
}