{
    "title": "Picture Gallery: Shinsegae Duty Free Myeong-dong aims to be a “tourism hub” : The Moodie Davitt Report -The Moodie Davitt Report          ",
    "text": "SOUTH KOREA. First pictures of Shinsegae Duty Free’s new duty free shop in Myeong-dong, Seoul, illustrate the ambition that underpinned the project. As reported, Shinsegae Duty Free opened the store on 18 May. It occupies floors 8 through 12 of Shinsegae Department Store’s main branch with a sales area of 15,138sq m. “Shinsegae Duty Free Myeong-dong store will become a major tourist landmark in Seoul as well as a tourism hub in Northeast Asia with our distinguished shopping contents and innovative space that embodies Shinsegae’s creative stories,” Shinsegae Duty Free CEO Sung Young-mok said. “We will make the best use of our location, which is in close proximity to Myeong-dong, Namdaemun market and Namsan Mountain, to achieve the goal of ten million foreigners visiting Myeong-dong as soon as possible. And we will do our utmost to develop tourism infrastructure to transform Seoul into a global metropolitan hub like Manhattan in New York and Ginza in Tokyo.” As Sung mentions, the Myeong-dong store is close to Seoul’s famous traditional markets in Namdaemun and Myeong-dong (described as Korea’s most popular tourist destination), helping Shinsegae Duty Free attract foreign visitors. The stunning 7.5m wide, 4.5m tall swing ride, called Mirror Carousel, takes centre stage K Character Shop introduces a variety of new character products, including Pororo  The retailer plans to offer “a new paradigm” in the duty free industry through a combination of introducing certain luxury brands for the first time to the Korean channel; extensive cultural space dedicated to the Korean Wave; and displaying world-renowned artworks. “Shinsegae Duty Free Myeong-dong store offers the best line-up of luxury brands in the industry,” the company claimed. About 70 luxury watch labels, including Audemars Piguet, Vacheron Constantin, Jaeger-LeCoultre and Omega, have opened shops while four major global Jewellery brands – Cartier, Bvlgari, Tiffany & Co. and Van Cleef & Arpels – are to join the line-up in the second half of this year. The new store houses high-end designer brands such as Gucci, Bottega Veneta and Saint Laurent. It also introduces Moncler, J.Lindeberg, Emporio Armani and MCM’s sunglasses collection for the first time to Korean duty free. Of the total 600 brands, cosmetics houses make up over 200, the largest beauty range among all Seoul duty free shops, according to Shinsegae. The line-up includes famous Korean brands such as Sulwhasoo, Whoo and Hera plus famous international names, including Byredo and Italian hand-made beauty brand Santa Maria Novella. Addiction, a beauty brand that has become highly popular online in Korea, opens a store corner for the first time. And specialised sections such as Hair Zone and Beauty Device Zone introduce a wide range of beauty-related products. Shoppers can also find various men’s fashion brands that are rarely found in other duty free stores, Shinsegae claimed. These include Emporio Armani, Hugo Boss and the multi-brand fashion shop Men’s Collection. The company said its offer targets a broader demographic than rival stores’ offers, which are usually focused on female customers of certain age groups. In an effort to cater to all family members, the store introduces the latest IT devices such as smart toys, instant cameras, portable massagers and drones plus character shops to cater to young customers. Traditional Korean crafts and high-quality merchandise made by selected small and medium-sized companies introduce shoppers to traditional Korean traditional culture.  Shinsegae Gift Shop features a wide range of traditional crafts hand-made by artisans. These include Korean traditional ornaments, dishes and traditional boxes plus local brands such as I’m shopping, Hanskin and Too Cool for School. BUILDING THE KOREAN WAVE The retailer is also committed to introducing the so-called Korean cultural wave to foreign tourists via three major K culture attractions. • K Beauty Zone offers more than 60 Korean cosmetics brands,\n• A traditional gift shop (below) featuring traditional craftworks made by artisans  • K Character Shop, featuring sought-after characters and introducing a variety of new character products such as Kakao Friends, LINE Friends, Pororo plus character goods from YG Entertainment, the leading K Pop entertainment group.   ART ATTRACTIONS Shoppers can view around 100 world-renowned artworks, including pieces by internationally acclaimed artists such as Alexander Calder and Hennry Moore. A 7.5m wide by 4.5m tall swing ride, called Mirror Carousel, takes centre stage on the 10th floor. The gigantic swing ride, created by experimental Belgian artist Carsten Höller, features 360-degree LED displays and is expected to become a popular attraction for locals and international visitors.  Sky Park which is connected to the shops on the 11th floor, displays a range of artworks to help create a relaxing shopping experience. They include ‘Organism’ by sculptor Seung-hwan Kim and ‘River of Memories’ by sculptor John Bae. Sky Park can be transformed into a theme park and adapted to various seasonal concepts such as KungFu Panda. Hallyu (Korean Wave) celebrities are honoured in ‘Popcorn Hall’ on the 10th floor of the Mesa building, next to the Myeong-dong store, which offers a range of attractions including K Pop star performances, animation and games. COMMITMENT TO KOREAN CULTURE AND COMMERCE From early 2017, the 4th and 5th floors of the Mesa building will house ‘Artisan Workshops’ and ‘Design Innovation Center’, introducing traditional and modern Korean culture. Shinsegae Duty Free said it is committed to developing the city’s tourism infrastructure by transforming Namdaemun market into a globalised market, utilising its Hallyu food alleys and nighttime tour offerings. The Myeong-dong store provides a VIP lounge and a one-to-one personal shopping assistant service (previously only available at department stores) to its VIP customers. The retailer plans to enhance this offer and attract more high-end customers through a fashion & beauty consulting service featuring famous stylists and make-up artists. Shinsegae Duty Free also plans to open a premium Champagne tasting bar for VIP customers in the second half of this year. For the convenience of group tourists, the store operates four exclusive elevators and parking spaces that can accommodate 100 tour buses. Follow The Moodie Davitt Report on Linkedin:  Share this article: The beauty brand’s fragrance and cosmetic lines feature natural ingredients and are developed in collaboration with dermatologists and paediatricians. Read More The exhibition is a celebration of the late Nam June Paik’s work using the latest in virtual reality and multi-media technology. Read More The high-impact pop-up was unveiled on 8 August and runs until 8 November, featuring the brand’s signature scents and various interactive elements. Read More We present highlights from this week’s Moodie Davitt Report WeChat Official Account, with an impressive and ever-increasing follower base currently standing at 3,972. Read More ",
    "datetime": "2016-05-27T07:12:50+00:00",
    "url": "https://www.moodiedavittreport.com/picture-gallery-shinsegae-duty-free-myeong-dong-aims-tourism-hub/"
}