{
    "title": "Pop culture boosting harmony in East Asia | East Asia Forum",
    "text": "Author: Seiko Yasumoto, University of Sydney Media can only become regional or global in a broadcasting regime that enables content to move freely beyond national borders. Regional broadcasting, which was restricted in the 1980s in Japan, South Korea and Taiwan, now allows for the legitimate transfer of content across national borders. Within this framework, Japanese interaction with its East Asian neighbours can be viewed from two perspectives: politics and popular culture. The two are not mutually exclusive, but are driven by different forces. Much has been written about Japanese past military transgressions. These writings fall within the ambit of regional and global politics. While never condoning this history, popular culture is helping to mitigate the regional tensions these events have led to. The impact of popular culture on human interaction is proving an important stimulus to regional harmony. In the late 20th century, Nobel Peace Prize laureate Kim Dae-jung, who rose from political imprisonment to become president of South Korea, began the process of liberalising South Korean media, shifting the relationship between politics and culture. Between 1998 and 2004, then-president Kim implemented the ‘four steps’ of media liberalisation. These policies opened up flows of regional media in and out of South Korea in four progressive stages. The outcomes contributed to regional harmony, particularly between South Korea and Japan. The implementation of the four steps unlocked cultural flows in the region, enabling the emergence of the so-called ‘Korean Wave’, which swept over East Asia with global impact. An iconic component of the Korean Wave is the South Korean television drama Winter Sonata, first broadcast in South Korea in 2002. The drama generated significant fandom in Japan, inspiring Japanese fan visits to South Korea. The fandom surrounding the principle male actor, Bae Yong-joon, has been sustained — a number of Japanese fans travelled to Seoul last July to catch a glimpse of Bae on his wedding day. Fandom has several manifestations that propagate and consolidate the enjoyment of popular culture products. The adoring audiences create new societies, in both local and regional contexts, as communication and ideas flow back and forth across geographical boundaries. This process creates a hybrid group where a variety of ideas, thoughts and feelings meet in cohesion, highlighting the fundamental human commonalities between members. In this context, the importance of Japanese popular culture has been recognised by past prime ministers Junichiro Koizumi and Taro Aso, as well as incumbent Prime Minister Shinzo Abe. They have all made significant contributions to cultural dialogue, bringing popular culture into mainstream political and academic analysis. Particularly significant is part of a 2007 policy speech by Abe regarding ‘The Japanese Cultural Industry Strategy’. In the speech, Abe proposes enhancing ‘the competitiveness of areas that represent the good traits and uniqueness of Japan, such as animated film, music and Japanese food, and present them to the world’. The traditional role of media — and its often symbiotic relationship with governments and censorship regimes — has been progressively challenged in Asia from the mid-to-late 20th century. The power of blogging and social networks is dramatically changing perceptions of Japan and stimulating cultural flows. Examples of Japanese manga and anime are now readily accessible online, contributing to a dilution of historical barriers. Japan conveys cultural messages through various media products — not only through manga, anime and television dramas, but also through the merchandising of media products. Who can deny the warmth and regional and international appeal of Japanese fantasy characters? Examples include the titular spirit in Hayao Miyazaki’s anime My Neighbour Totoro and Hello Kitty, who first appeared in 1974 and is still prominent in the global market. Manga is a rich source of inspiration for adaptations of texts, moving Japanese stories to regional and global arenas. Hana Yori Dango (Boys Over Flowers) by Yoko Kamio is a prime example. The series has been remade into TV dramas, anime, film and theatre productions in many Asian countries, spreading as far as Indonesia and the Philippines. If it is the young that will create the world of tomorrow, then there are encouraging signs for harmony in East Asia. Surveys of university students from South Korea, Taiwan and Japan studying in Australia at the University of Sydney indicate emerging patterns of reconciliation and mutual respect. The trend is especially pronounced with women. Similar surveys conducted with university students in South Korea, Taiwan and Japan have consolidated these findings. The appreciation of the value of cultural transfers, beyond the economics, is now acknowledged. Fandom is an important component of this process. Another aspect contributing to regional harmony is the tourist industry. Popular culture is a stimulus for travel into and outwards from Japan. When compared with France, the major global destination for international tourists, Japan is a smaller player — but unlike France, Japan’s tourism sector is exhibiting exponential growth. Some 20 million tourists visit Japan annually, with 70 per cent from East Asia. Visitors from China, South Korea and Taiwan will make a significant contribution to regional harmony and understanding, as will Japanese tourists in these countries, through the process of cross-cultural engagement. Popular culture can contribute to healing East Asia and instilling mutual respect and understanding. Though regional political issues remain, popular culture, along with multilateral trade, is creating a new form of citizenship, where the commonality of enjoyment of content transcends politics. Seiko Yasumoto is a senior lecturer of Japanese media and cultural studies at the University of Sydney.  Δ  Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. If the university students who have been exposed to other cultures could be our top business and government leaders, then we could have more peaceful relationships throughout the world; however, I am only seeing this as a dream not as reality. You have still a number of people who don’t want this to happen because it affects their own selfish political, social, and economic agendas. I agree that tourism helps to expose people of other cultures to the country to which they have  traveled.  At least it might break down some stereotypes, if not prejudices, that the traveler might have about the country he/she is visiting. But for it to really have an impact travel in a foreign country should allow for real interactions between the traveler and the host country. Home visits, if not overnight home stays, would be even better. Study or work abroad for a year or more is an amazingly powerful way to enhance cultural understanding and in the long run possibly promote peace. As a young college graduate I lived and taught English in Japan for two years. It changed my life for the better in ways too numerous to mention. Back in the 50s and 60s due to economic prosperity, a lot of Americans went overseas to visit other countries; however, you wonder how many of them got to know the culture at the ground level instead of staying at 5 star hotels. In addition, you had many American state department employees being stationed in other countries; however, I doubt if many of them ever learn from being out with the people on the streets and it didn’t stop the American government from overthrowing countries that tried to carry out economic and social reforms that threatened American business interests.  Remember the Dulles brother? Maybe all high school/college students should be mandated to go overseas for a year or two as part of the educational curriculum. Can you explain what is home visits?  I look it up and the only definition I receive was a visit to the home by the doctor?  Thanks. ‘Home visit’ in this context means that a local family invites a tourist(S) to come to their home for a few hours.  It affords the tourist(S)the opportunity to meet and interact with residents of the country.  The residents opportunity to meet foreigners. Some places offer a ‘home stay:’ the chance to stay with a family for 1-2-3 nights.  This allows for even more exposure to local people, lifestyle, etc.  My wife and I did that with Japanese students doing to Calif to study English.  We had a young person stay with us for a week.  It had its challenging moments but overall was a good experience Thank you for your reply, Mr. Solomon.  July – September 2023\nFor electronic copies of back issues, links to the individual articles and to subscribe to the hard copies, see the EAFQ page. ",
    "datetime": "2016-07-09T12:00:08+00:00",
    "url": "https://www.eastasiaforum.org/2016/07/09/pop-culture-boosting-harmony-in-east-asia/"
}