{
    "title": "Portugal's Monster: The Mechanics Of A Massive Wave : The Two-Way : NPR",
    "text": "By Scott Neuman American surfer Garrett \"GMAC\" McNamara rides what could be, if confirmed, the biggest wave conquered in history as a crowd watches Monday in Nazare, Portugal. The photos and video are heart-stopping — the tiny figure of extreme surfer Garrett McNamara balancing on his board as he slides down what's being billed as a record-breaking, 100-foot wall of water. Perhaps just as amazing as McNamara's feat Monday is the sight of the monster swell itself rearing up and then exploding onto the rocky coastline in Nazare, Portugal. \"In Nazare,\" the Hawaiian surfer told Time, \"the ocean is known as a place of death, not of riding waves.\" It's where he set the world record in 2011 for the biggest wave ever surfed and where he married his wife in November. Nazare's giant waves are generated by factors peculiar to that part of the European coast, says Micah Sklut, forecaster and CEO at Swellinfo.com, a surf forecasting site. \"You get big storms in the North Atlantic in the wintertime that push swells toward Europe,\" says Sklut, who is himself a surfer. The sheer size of the wave McNamara rode was triggered by a \"massive storm\" that day off Ireland, he says. But Nazare's rare undersea geography — a deep canyon that points like an arrow toward the town — is what creates the ideal conditions for the kind of waves in the video. \"Normally, what happens is that the open-ocean swells, as they approach the coastline, they're going to be slowed down by the ocean bottom as it gets shallower,\" Sklut says. \"But at Nazare, for example, the ocean swells get focused in this submarine canyon and have much more energy.\" At its deepest, the Nazare Canyon is some 16,000 feet from the ocean's surface, according to the Portuguese Hydrographic Office. By contrast, the Grand Canyon in Arizona is about 6,000 feet deep at its lowest point. \"So, first you've got really deep water, and then as it approaches the shore it gets very shallow, and that enables the waves to climb really, really big all of a sudden,\" Sklut says. Similar conditions exist in other \"big wave\" spots — Teahupoo, Tahiti; the Banzai Pipeline on the North Shore of Oahu, Hawaii; the Cortes Bank about 100 miles from Los Angeles and Mavericks on Northern California's coast. Hendrik Tolman, an ocean wave expert at the National Center for Environmental Prediction, compares the canyon's effect to a lens focusing light and says there's \"no hard upper limit\" to the size that waves can get. He notes there have been observations of waves offshore that were well over 110 feet. American surfer Garrett \"GMAC\" McNamara rides what could be, if confirmed, the biggest wave conquered in history as a crowd watches Monday in Nazare, Portugal.\n                \n                    \n                    To Mane/Barcroft Media /Landov\n                    \n                \nhide caption American surfer Garrett \"GMAC\" McNamara rides what could be, if confirmed, the biggest wave conquered in history as a crowd watches Monday in Nazare, Portugal. While Tolman agrees that McNamara's wave was \"very, very high,\" he and some other wave experts are circumspect about whether it actually hit 100 feet. Because there was no instrumentation at Nazare to scientifically measure the wave from trough to crest, McNamara and his team are relying on an old surfer's yardstick — comparing the apparent size of the wave to the size of the people in photos. \"That's not very accurate,\" Tolman says. \"You can see the peak of the wave, but you can't see the bottom of the trough very well.\" When it comes to finding and riding such giants, Sklut says two things are key: better wave forecasting and Jet Skis. If you look closely at the video of McNamara or other extreme surfers, you'll often see a Jet Ski peeling away just as a surfer starts a run down the wave face — a technique known as a \"tow-in\" that was pioneered by surfer Laird Hamilton and some friends in the early 1990s. McNamara sits next to his wife, Nicole, after a surf session in Nazare a day after riding the massive wave.\n                \n                    \n                    Patricia De Melo Moreira/AFP/Getty Images\n                    \n                \nhide caption McNamara sits next to his wife, Nicole, after a surf session in Nazare a day after riding the massive wave. \"If you think of a 100-foot wave, breaking in say 100 feet of water, that's a pretty fast wave, which is why you use Jet Skis to get on to them,\" says Tim Janssen, a surfer who is a physical oceanographer at Theiss Research in La Jolla, Calif. \"Absolutely, 1,000 percent, they would not be riding these waves without a Jet Ski,\" Sklut says. \"These waves are moving so fast and there's so much water that it would be virtually impossible to paddle into a wave like Garrett rode without a Jet Ski.\" Then there's the wipeout. Hamilton has called it \"the moment where you totally relinquish any true control over what you're doing.\" \"There's no place really in life that does it quite like that — when you do fall and you do get hit by [the water], you're just at the mercy of the wave and it dictates,\" he said in 2010. \"And sometimes those are the most thrilling rides of all. Unfortunately.\" Janssen says a wipeout on a wave that size probably feels \"exponentially heavier than anything that normal people surf.\" Surviving takes training in such things as holding your breath. Surfers such as Hamilton and McNamara can hold it for two minutes plus, Sklut says. When it comes to wiping out in big surf, \"you kind of have to let it do what it wants to do and try to relax,\" he says, though he admits he has never surfed anything close to the really big ones. \"On a personal level, I cannot even relate,\" Sklut says. \"I wouldn't go near that. I don't need that much of a rush.\" A previous version of this story misidentified Hendrik Tolman as an ocean wave expert at NOAA's Climate Prediction Center. He works for the National Center for Environmental Prediction. Sponsor Message Become an NPR sponsor ",
    "datetime": null,
    "url": "https://www.npr.org/sections/thetwo-way/2013/01/31/170753700/portugals-monster-the-mechanics-of-a-massive-wave"
}