{
    "title": "Prashant Kishor, the man who created Modi wave, is Nitish's deputy  - India Today",
    "text": "Listen to Story Prashant Kishor first hit the national headlines in India in 2014 with his election strategy for Narendra Modi, the BJP’s prime ministerial candidate. Having achieved some success with election strategy-making in Africa, 2014 Lok Sabha election was the first big stage for Prashant Kishor. He had an experience with working for Modi in Gujarat in 2012 assembly election. The 10-year anti-incumbency against the UPA was successfully converted into a groundswell for Modi-fied BJP. A year later, Prashant Kishor was working for Nitish Kumar, the Bihar Chief Minister, who had snapped a nearly two-decade alliance with the BJP after Narendra Modi was projected as the prime ministerial candidate. Bihar went to polls in 2015 and Prashant Kishor’s strategy ensured that the BJP was defeated by JD (U)-RJD-Congress grand alliance. He has remained a trusted aide of Nitish Kumar since then. Though, he failed to repeat his twin successes later. Now, JD (U) president Nitish Kumar has appointed Prashant Kishor his deputy in the party. He is the vice-president of the JD (U), effectively the second most powerful person in the party, bypassing a string of senior leaders. Prashant Kishor is known for floating a new platform ahead of every big election. He formed a non-profit organisation, Citizens for Accountable Governance (CAG) ahead of 2014 Lok Sabha election which used the reports of other CAG (the Comptroller and Auditor General) to highlight the issues of corruption against the then UPA government. Such issues helped build political environment in Narendra Modi’s election campaign and the BJP. The CAG of Prashant Kishor turned almost defunct after 2014 Lok Sabha election. He came up with another platform ahead of Bihar assembly election in 2015. He regrouped with the members of CAG to float a policy group, I-PAC (Indian Policy Action Committee). Prashant Kishor had broken up with Narendra Modi by then. I-PAC joined hands with Nitish Kumar for 2015 assembly election. Prashant Kishor is understood to be the brain behind what appeared as unthinkable political coalition between Nitish Kumar and Lalu Prasad of the RJD in Bihar. The Congress, which was in alliance with the RJD, was also taken on board. The grand alliance proved too formidable for Narendra Modi-led BJP’s campaign in Bihar assembly polls to scale. The grand alliance won 178 of 243 seats and the BJP won 53. Prashant Kishore also worked with the Congress in 2017 for Punjab and Uttar Pradesh assembly elections. His success in Punjab in bringing back the Congress to power after two successive electoral losses failed to register in the view of party’s failure in Uttar Pradesh, where the BJP swept the polls winning 317 seats. However, the Congress was not contesting in too many seats in UP and he had developed differences with the party leaders over his poll strategy in the state. Interestingly, Prashant Kishor floated an online platform earlier this year for 2019 Lok Sabha election. Called, the National Agenda Forum, it was launched in July and is aimed at setting agenda for 2019 election and projecting leading options for the prime ministership. Based on 10-point agenda, the National Agenda Forum called for voting for different leaders. The website shows Narendra Modi leading the race with 48 per cent votes followed by Congress president Rahul Gandhi at 11.2 per cent and Samajwadi Party president Akhilesh Yadav (9 per cent). Prashant Kishor’s appointment as JD (U) vice-president came two days after his claim that if election were to happen today, the BJP is in lead. He also said, Modi is a big risk taker and exhibits courage [while] Rahul is more status-quo-ist. --\nAge is an issue of mind over matter, if you don't mind, it doesn't matter....\n(Mark Twain) Also read: Nitish elevates Kishor as JD(U)'s vice presidentEdited By: Neha VashishthPublished On: Oct 16, 2018--- ENDS --- ",
    "datetime": null,
    "url": "https://www.indiatoday.in/india/story/prashant-kishor-the-man-who-created-modi-wave-is-nitish-s-deputy-1369031-2018-10-16"
}