{
    "title": "Profits give energy drink a boost | Phnom Penh Post",
    "text": "Anne Renzenbrink | Publication date 06 November 2013 | 06:12 ICT Shortly after the Thai manufacturer of energy drink Carabao announced expansion plans in Cambodia, a South Korean energy drink producer said it expects sales figures in the Kingdom to surge this year, according to a report. The Korea IT Times reported yesterday that South Korean company Dong-A ST, which makes the popular canned energy drink Bacchus, made 29 billion won ($27.3 million) from the product in Cambodia last year. The amount represents 24 per cent of overseas sales figures for the beverage. At the end of this year, the company expects to have sold 100 million cans, or about eight cans per person in Cambodia, the report said. This stands in contrast to 20 million won worth of Bacchus sales in 2009, according to the Korea IT Times. \nAn official for Cambodian distributor of Bacchus, Cam Gold Co, was quoted as saying that next year sales will exceed 35 billion won.\nReached yesterday, Phalla Srin, sales manager for Cam Gold Co, said sales were on the rise, but declined to provide exact figures as he was not authorised to. \nOne can of Bacchus costs around 2,500 riel. \nSrin said that the general popularity of South Korean products in Cambodia, sometimes referred to as the Korean Wave in the region, “is a part of our increase in sales volume”, adding that Bacchus was the most popular energy drink in Cambodia.\nThe Post reported in June that South Korean cosmetic products were in demand in Cambodia as consumers seek to mimic fashions and looks captured in the lifestyles of South Korea’s K-Pop music stars.\nDong-A ST did not reply to an email sent yesterday.\nLast month, the Thai newspaper The Nation reported that Carabao Tawandang, the Thai-based manufacturer of Carabao Dang energy drinks, plans to open a factory in Cambodia. The company could not be reached for comment to confirm\nthe plans.\nWhether Bacchus or Carabao, drink companies are finding a welcome market in the country.\n“Energy drinks have become increasingly popular in the evening because students buy them for their evening class,” Re Narith, a 17-year-old drink seller in a local restaurant in Phnom Penh, said. He added that Bacchus sells better than a variety of juices as well as Coca-Cola.\nAccording to data from the Ministry of Commerce, Cambodia imported about 720,000 litres of alcohol and non-alcoholic drinks in the first half of this year, a 51 per cent drop from nearly 1.5 million litres in the same period of 2012. This stands in contrast to 20 million won worth of Bacchus sales in 2009, according to the Korea IT Times. An official for Cambodian distributor of Bacchus, Cam Gold Co, was quoted as saying that next year sales will exceed 35 billion won. Reached yesterday, Phalla Srin, sales manager for Cam Gold Co, said sales were on the rise, but declined to provide exact figures as he was not authorised to. \nOne can of Bacchus costs around 2,500 riel. \nSrin said that the general popularity of South Korean products in Cambodia, sometimes referred to as the Korean Wave in the region, “is a part of our increase in sales volume”, adding that Bacchus was the most popular energy drink in Cambodia.\nThe Post reported in June that South Korean cosmetic products were in demand in Cambodia as consumers seek to mimic fashions and looks captured in the lifestyles of South Korea’s K-Pop music stars.\nDong-A ST did not reply to an email sent yesterday.\nLast month, the Thai newspaper The Nation reported that Carabao Tawandang, the Thai-based manufacturer of Carabao Dang energy drinks, plans to open a factory in Cambodia. The company could not be reached for comment to confirm\nthe plans.\nWhether Bacchus or Carabao, drink companies are finding a welcome market in the country.\n“Energy drinks have become increasingly popular in the evening because students buy them for their evening class,” Re Narith, a 17-year-old drink seller in a local restaurant in Phnom Penh, said. He added that Bacchus sells better than a variety of juices as well as Coca-Cola.\nAccording to data from the Ministry of Commerce, Cambodia imported about 720,000 litres of alcohol and non-alcoholic drinks in the first half of this year, a 51 per cent drop from nearly 1.5 million litres in the same period of 2012. Reached yesterday, Phalla Srin, sales manager for Cam Gold Co, said sales were on the rise, but declined to provide exact figures as he was not authorised to. One can of Bacchus costs around 2,500 riel. Srin said that the general popularity of South Korean products in Cambodia, sometimes referred to as the Korean Wave in the region, “is a part of our increase in sales volume”, adding that Bacchus was the most popular energy drink in Cambodia. The Post reported in June that South Korean cosmetic products were in demand in Cambodia as consumers seek to mimic fashions and looks captured in the lifestyles of South Korea’s K-Pop music stars. Dong-A ST did not reply to an email sent yesterday. Last month, the Thai newspaper The Nation reported that Carabao Tawandang, the Thai-based manufacturer of Carabao Dang energy drinks, plans to open a factory in Cambodia. The company could not be reached for comment to confirm\nthe plans. Whether Bacchus or Carabao, drink companies are finding a welcome market in the country. “Energy drinks have become increasingly popular in the evening because students buy them for their evening class,” Re Narith, a 17-year-old drink seller in a local restaurant in Phnom Penh, said. He added that Bacchus sells better than a variety of juices as well as Coca-Cola. According to data from the Ministry of Commerce, Cambodia imported about 720,000 litres of alcohol and non-alcoholic drinks in the first half of this year, a 51 per cent drop from nearly 1.5 million litres in the same period of 2012. Cambodia and China signed several high-level cooperation documents on October 17, during Prime Minister Hun Manet’s visit to Beijing for the 3rd Belt and Road Forum for International Cooperation from October 17-18.\nOn the sidelines of the forum, Manet also met with several Chinese investors ASEAN-International Wholesale Market, also known as Deum Kor Thmey – Cambodia’s largest wholesale marketplace – is set to open by the end of the year. Presently, approximately 70 per cent of traders have completed their registrations.\nLocated along Win-Win Blvd in Kork Roka commune of Phnom Penh’ Prime Minister Hun Manet on October 24 inaugurated the National Techo Santepheap Hospital, the Kingdom’s largest state-of-the-art medical facility. It was constructed in just over a year, and financed by the government.\nManet described how the hospital was designed to serve the public health in Angkor International Airport Investment (Cambodia), the developer of the new Siem Reap-Angkor International Airport (SAI), has taken steps to enhance passenger transportation services at the airport.\nThe company has granted exclusive operating rights within designated airport areas to the Tourist Transport Association for Siem Reap Siem Reap Angkor International Airport (SAI) welcomed its first flight on October 16, marking a significant milestone in Cambodia’s tourism development post-Covid-19.\nDuring the reception for the inaugural commercial flight to SAI, Vongsey Vissoth, Deputy Prime Minister and Minister in charge of the Council of ASEAN has denounced the reported bombardment of a camp for displaced people in Myanmar’s Kachin State. The attack occurred about ten days ago and purportedly resulted in the deaths of 28 civilians, including at least 12 children.\n“We, the member states of the Association of Southeast The vending machine in many developed economies is a regular fixture in transport hubs, office buildings and petrol stations. Nearly every conceivable consumer good has ",
    "datetime": null,
    "url": "https://www.phnompenhpost.com/business/profits-give-energy-drink-boost"
}