{
    "title": "Putting the 'popular' into K-pop",
    "text": "We’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. This was published 9 years ago Add articles to your saved list and come back to them any time. Barom ''Rome'' Yu was a typical Wollongong teenager, into surfing and music. He studied drums at Wollongong High School of the Performing Arts and played in a heavy metal band in his spare time. Also a keen breakdancer, he left Sydney for Seoul four years ago ''to find his roots''. Four months later Yu had signed with Yedang Entertainment to be the leader of its first boy band, C-CLOWN. Asian pop is on the rise, and Australians, such as Yu, are on the crest of that wave. He first realised Korean pop was making an impact in Australia when he started being recognised on the streets of Sydney. \"Where I was still in Australia, only Koreans knew about the whole K-pop scene\": Barom Yu.Credit: Gabriel Wilder ''When I was still in Australia, only Koreans knew about the whole K-pop scene,'' he says. ''And [now] when I make visits [home] I realise that so many people are actually getting into K-pop. Walking down the streets of the city, someone would recognise me, they would come up and ask me if I'm Rome from C-CLOWN, so I was, like, 'Wow, I can't believe our name reached all the way to Australia'.'' K-pop has spread much further than that: last month Stevie Wonder played live at the Mnet Asian Music Awards in Hong Kong; on Wednesday, teen pop sensation Lorde declared she wanted to work with K-pop teen sensation Lee Hi and on Friday Time listed the Girls' Generation breakout hit I Got a Boy in its Top 5 songs of 2013. Because C-CLOWN was Yedang's first idol band, Rome says it took its members a while to find their footing, but once the training system kicked in, they worked day and night. ''Our team went out at 9am to the practice rooms and then we went back home at, like, 5am - and that was every day … Every day.'' He says the musical education he received at Wollongong had served him well; most idol bands do not write their own songs - some are not allowed to do so - but Yedang gave his group composition training, along with the usual voice, dance, acting and language classes, and Yu and C-CLOWN member T.K. co-write its songs. This creative input makes the peculiar terms of their seven-year contracts - the long hours, no girlfriends, no sneaking out after work, sharing a tiny flat with five other guys - a bit easier to bear. But, in any case, Yu is eyeing the future. ''Honestly, I can tell you I'm doing this because I want to make my own brand in photography and filmmaking. I always liked filmmaking and dancing and I always wanted to put the two together as one. I guess K-pop is a way to get exposure to the whole world.''  Copyright © 2023 ",
    "datetime": "2013-12-06T16:00:00+00:00",
    "url": "https://www.smh.com.au/national/putting-the-popular-into-k-pop-20131206-2ywju.html"
}