{
    "title": "Pyeongchang Olympics: Closing Ceremony Ends Biggest Winter Games Ever – WABE",
    "text": "Final hours of the On-Air Campaign. Give now! Bill Chappell\n| NPR February 26th, 2018 The 2018 Winter Olympics’ closing ceremony is being held on Sunday at the Pyeongchang Olympic Stadium. Christian Hartmann / REUTERS The Winter Olympics closes the door on the Pyeongchang 2018 Games, with a big party and a last farewell from the 2,920 athletes who competed on ice and snow in South Korea. The number of athletes set a new record; so did the number of nations — 92 – represented. Pyeongchang organizers promised that the Olympic Stadium, which seats 35,000, will be “filled with the roar of compliments and the applause of friendship.” The two-hour ceremony started at 8 p.m. on Sunday night in South Korea – 6 a.m. ET Sunday in the U.S. It began with a segment called “Countdown: Dream for Tomorrow,” featuring performers paying tribute to the athletes. Even as it celebrates the achievements of the past three weeks, the ceremony also looks ahead to Japan — Tokyo is slated to host the Summer Olympics in 2020 — and to China. In 2022, Beijing will become the first city to host both the Summer and Winter Olympic Games. At Pyeongchang Olympic Stadium, the order of entry is the same as in the opening ceremony, when the U.S. entered the Olympic Stadium 26th. Visiting delegations are ordered according to the alphabet of the host nation. The host delegation always enters last. Team USA follows countries whose names begin with “M” — so, after Malta and Mongolia – and before the Bs, such as Bermuda and Belgium. Cross-country skier Jessie Diggins is the U.S. flag bearer. Ceremony Program Guide and Timeline: Opening acts: first 16 minutes It all starts with a montage of the achievements and notable moments of the Winter Games in Pyeongchang, in a four-minute video piece. Then, the Korean national flag and anthem are presented, followed by a six-minute meditation and celebration of hallyu — the “Korean Wave” that represents the country’s progress on the international economic and cultural scene in recent decades. In this section, guitarist Yang Taehwan, 13, plays a variation on “Winter” from Vivaldi’s The Four Seasons. And then, from the program: “On the sloped stage reflecting the image of a guitar, loop dancers perform a mesmerizing dance that defies gravity. Geomungo players perform together with the band Jambinai. Korean dancers present a modern interpretation of a traditional dance while a solo dancer performs Spring Dance of Nightingale.” … which leads to “The Light of Harmony and Solidarity: The lighting of the Prayer Pagoda unites everyone in the spirit of harmony and solidarity.” This section of the ceremony features a unique musical instrument called the geomungo, which dates to the 4th century. From the program guide: “The round front plate of the instrument represents the sky, and the flat bottom part represents the earth; the instrument’s five Notes — gung, sang, gak, chi, and wu — symbolize the Five Elements. It has been traditionally played from a sitting position, but now it can be played from a standing position. Made of paulownia wood with twisted silk strings, the geomungo used in the Closing Ceremony are also carved with the traditional arabesque design.” Parade of nations Starting 16 minutes into the program, the Parade of Nations celebrates the athletes who competed and tried to live their dreams over the past 17 days. The oldest athlete at these Olympics: Canadian curler Cheryl Bernard, 51. The youngest: Chinese halfpipe skier Wu Meng, 15. Remembering those not here At 36 minutes in, the ceremony continues a tradition that started at the Rio 2016 Games, of providing a moment for everyone present to remember those who cannot join us. In the Korean version, called “A Journey to Remember,” there are three sections: “Turtle and Kkoktu: Along with kkoktu puppets, the Turtle embarks on a journey across life and death. With the Turtle in the middle of the procession, the kkoktu puppets holding dandelions enter first, and they are followed by the dancing kkoktu puppets. “The Time Tunnel: The Turtle journeys through the Time Tunnel, the boundary between life and death. “Eternal Remembrance: The kkoktu puppets dance and bid farewell to the Turtle who is on his way to the heavens. Soon, the Turtle flies free into the sky.” Victory ceremonies, and more From 8:43 p.m. – 9:03 p.m. KT, the Olympics holds two medal ceremonies, announces new members of the International Olympic Committee athletes’ commission and recognizes volunteers. Medals are presented for the men’s and women’s mass start cross country ski races, in which Iivo Niskanen of Finland and Marit Bjoergen of Norway accepted gold. Second hour: K-pop time We can’t explain it better than the ceremony guide, although we could quibble with the second point: “The singer CL enters the stage singing her song, ‘The Baddest Female’, with 20 dancers holding torches, representing passion and the venturing spirit. She also sings 2NE1’s hit song ‘I Am the Best’ to convey the message that everyone is a winner.” The first song asks, “Where all my bad girls at?” We’ll consider that rhetorical, because CL seems to have all the answers. The crowd is into this. The transition begins The Greek national anthem is played, and the national flag of Greece is raised. This is part of the tradition of retracting the Olympic spirit from one host and extending it to another (or at least, we think that sounds good). Next, the Olympic flag is lowered and the Olympic anthem is performed. Next time in China In 2022, Beijing will become the first city to host both the Summer and Winter Olympic Games. It’s traditional for the host cities to focus on the next edition of the games they just held, so rather than touting Japan, China gets a boost here. Beijing’s section of the program includes some reminders that China has pandas. Whales are also repping China, it turns out. The video montage ends with Chinese President Xi Jinping issuing a message of warm welcome. Then graphics in the stadium show Olympics past — and everything is assembled into an invitation to come to China. And that brings us to: Speeches Lee Hee-beom, the president and CEO of the Pyeongchang Organizing Committee, speaks; so does IOC President Thomas Bach. It’s been fascinating to watch the way South Korea and North Korea have interacted in the cause of the Pyeongchang Games, from the visit of Kim Yo Jong to cheer squads and athletes and staff. Bach says, “We are embracing these new horizons.” To prove he’s down with these horizons, Bach takes a break to pose for one of the most improbable photo ops ever: alongside a North Korean, the Tongan Olympian Pita Taufatofua (shirtless, as is his wont, on this 26-degree night), and an assemblage of colorful mascots. Bach then declares the Winter Games “closed.” He adds, “Thank you all, and bye-bye to Korea.” Not all of these North-South interactions have taken place only at a high level: We spoke to a South Korean police officer last night who was very excited because she got the chance to speak with North Korean people visiting Pyeongchang. She described them as very polite and nice to talk to. EXO Time The band EXO was listed to perform earlier in the program; not sure if it’s a printing error or a schedule change, but they’re here now and doing their thing. Building on a traditional gong and an electronic drum, EXO’s Kai sings against a backdrop of drawings by the artist Seonglip. The rest of EXO “appear riding on four-wheelers and singing their song ‘Growl’ with 43 dancers” — as you do. After that, they do “Power,” with its eponymous refrain. If you’re curious: “Chrome-plated four-wheelers equipped with searchlights represent the future of K-pop as the genre lights a way for the world.” “Farewell from a snowflake” Yes, there is a segment in the ceremony titled “Farewell from a Snowflake.” Internet, start your engines. As part of a gift from Pyeongchang, 10 Soohorang white tiger mascots follow a large present that’s escorted by a snowmobile (yes, a snowmobile). We like this kind of stuff — maybe you do, too: “The surface is decorated with embossed carvings of traditional patterns, and each edge is also decorated with the traditional accessory called norigae.” Then we see the return of the five children from the opening ceremony: When the children open the present, it reveals a snow globe. The organizers capitalized it: “Snow Globe” — an obvious ploy to get everyone on board with this imagery. Aside: Personally, we find it unsettling to see multiple iterations of Soohorang all over the place. We enjoy being convinced of the Olympic mascot’s mythic and unique status. The snowflake, it turns out, is lit: 400 performers come in holding LED balls in their hands, followed by giant balloons that refer to the globe. In case you’re starting to understand things, there are also balloons that resemble Winter Olympics athletes. None of this is quite as restful and calm as we had imagined in reading it. The show is building toward a conclusion, rather than tapering. Party time From the program: “With the EDM thumping under the brightly lit sky, DJ Raiden begins the party on the ground, joined by all the athletes for the finale of the ceremony. Raiden is followed by Martin Garrix, and the performers present the LED balls to the athletes. Raiden re-enters as DJ and continues the final segment of the closing.” The athletes get out on the floor and dance. And that wraps things up. With the Olympic flame extinguished, the athletes leave the stadium and say “Annyeong” to the Pyeongchang Winter Games. Jan 18, 2022 Jan 18, 2022 Jan 17, 2022 WABE’s mission is simple: “Inform, inspire, reflect and empower our greater Atlanta community. ” We do that through the news, information, and entertainment we bring you via radio and TV, on your phone, in your car, on your smart speaker, or online at the new WABE.org—anywhere and everywhere throughout greater Atlanta. And we can only do this with your help. Please consider becoming a member of WABE today. 2015 – 2023 90.1 FM WABE 2015 – 2023 90.1 FM WABE ",
    "datetime": "2018-02-26T07:16:17+00:00",
    "url": "https://www.wabe.org/pyeongchang-olympics-closing-ceremony-ends-biggest-winter-games-ever/"
}