{
    "title": "Pyeongchang's heartwarming cuisine",
    "text": "Associate Professor of Hospitality Management, Colorado State University Soo Kang does not work for, consult, own shares in or receive funding from any company or organisation that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.  Colorado State University provides funding as a member of The Conversation US. View all partners As a middle schooler growing up in South Korea, I still vividly remember the 1988 Seoul Olympic Games. At the time, the country was a burgeoning democracy, and South Koreans were proud of hosting an international mega event. I’ve since become a hospitality professor and researcher in the U.S. And thanks to the growing popularity of Korean culture (dubbed the “Hallyu” or “Korean Wave”), I tend to get asked a lot about Korean food. Now, 30 years later, South Korea’s second Olympic Games – and its first Winter Games – are being held in Pyeongchang in Gangwon province (or Gangwon-do). Coincidentally, I recently received a message from a former student who was planning to visit Pyeongchang because her cousin, Jacqueline Wiles, will be competing for the U.S. alpine ski team. She wanted to know more about the foods she should try. “Lucky you,” I thought, “because there are almost too many to name.” With its beautiful landscapes and relaxed beach towns, Gangwon-do is known as one of the best and most convenient winter escapes for many Seoulites. Located along the eastern coast of the peninsula in northeast South Korea, the region faces the East Sea. But about three-quarters of the province is covered by mountainous forest, which means there’s very little farmland. The province is divided into two regions: Yeongseo in the west and Yeongdong in the east, where Pyeongchang is located. Such an environment – surrounded by mountains but bordering the sea – creates the conditions for cuisine that’s unique to the region. Dishes tend to include some combination of potato, corn, buckwheat or seafood. (In Korea, people from Gangwon-do are actually called “folks from Potato Valley.”) In the Yeongdong region, seafood is a main fare. At the Jumunjin Fish Market, the largest fish market on South Korea’s east coast, vendors sell red snow crab, octopus, mackerel, sole, flounder and a whole medley of sashimi. Nearby restaurants will cook seafood by request, either steaming, boiling, grilling, frying, or even including it in a soup or stew. In the Yeongseo region – with its rocky terrain – potato, millet, corn, buckwheat and mountain vegetables are the main ingredients in most dishes. Potatoes will be used for pastas, pancakes, dumplings or snacks. Overall, the province’s food is simple, healthy, and can appeal to a global palate. The cooking method – which accentuates the natural flavors and aromas of the ingredients – is also rather uncomplicated. The following are a sampling of several delicious dishes that are typical of the region. Gamja ongsimi – a potato dumpling soup – is a vegetarian option. The potatoes are grated, drained, squeezed, and mixed with potato starch. Then it’s boiled in a broth with vegetables. This is a popular winter dish. A soft tofu called Chodang sundubu is another vegetarian option. During the congealing process – which goes through several steps – salt water from the East Sea is used. This is a soft, light version of tofu, perfect for a soup or stew. But my favorite way of eating it is eating fresh – after steaming it with a bit of soy sauce and sesame oil. It’s so light and soft that it’s almost like eating ice cream. Dakgalbi (spicy stir-fried chicken with vegetables) and makguksu (buckwheat noodle) are two dishes – usually served together – that are popular in Chuncheon, the capital of Gangwon-do. The dakgalbi is seasoned and deboned chicken stir-fried with sliced rice cake, sweet potato, perilla leaves and cabbage. In restaurants, the spicy, sweet and meaty dish is usually served on the same tableside hot grill that it’s been cooked on. Its companion, makguksu, is a buckwheat noodle served either in a chilled broth or with a sauce. The harmony of heat and coldness showcase the yin and yang of this frugal but filling meal. Finally, there’s osam bulgogi, which is spicy stir-fried squid and pork bulgogi. Bulgogi – pork marinated in a sweet and spicy sauce – is one of the most well-known Korean dishes, and popular with many foreigners. But the Gangwon-do version mixes squid with the pork. Freshly caught from the East Sea, the squid transforms the dish into a surf and turf. The PyeongChang Organizing Committee has built a “K-Food Dome” near the Olympic Plaza, where tourists will have the opportunity to sample the local fare. No matter what they choose, they’ll be able to enjoy warm, hearty food – the perfect end to a day spent in the frigid mountains. Copyright © 2010–2023, The Conversation ",
    "datetime": null,
    "url": "https://theconversation.com/pyeongchangs-heartwarming-cuisine-90525"
}