{
    "title": "Rain Makes Grand Return With Sixth Album ‘Rain Effect’ – Billboard",
    "text": "K-pop veteran Rain bounces back with new album \"Rain Effect,\" led by blazing singles \"30Sexy\" and \"La Song.\" By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJessica Oak Singer/actor Rain — a pioneer of the “Hallyu Wave” (aka Korean Wave) — has released his hotly-anticipated sixth full-length album “Rain Effect,” reassuring fans and critics he hasn’t missed a beat during his four-year absence from the spotlight spending two fulfilling Korea’s mandatory military service. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tRain\t\t\n\t\t\t\t\t\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news Despite being in the hot seat for a highly-publicized relationship with superstar actress Kim Tae Hee, as well as public backlash after being investigated for violating service regulations (which was later dismissed), Rain re-solidifies his position in the K-pop firmament with this latest offering. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t01/07/2014 “Rain Effect,” released under Cube Entertainment (Beast, 4Minute, G.NA), dropped Jan. 2 along with accompanying music videos for double lead singles “30Sexy” and “La Song.” “30Sexy” is an electrifying dance jam charged with knocking hip-hop drumbeats and sticky synths, in which Rain surely seduces women confidently gushing about being 30 and sexy. In the music video, the singer is slickly dressed, exuding his tantalizing charisma while flashing hip-thrusting action.  Meanwhile, “La Song” is a hypnotic, Latin-flavored dance cut that moves Rain away from his typical musical motifs. It’s a bombastic production with a full-on banging beat, trombone-driven melody and a repetitive chorus highlighted by grungy vocals and rapping. The video features Rain in a grimy neighborhood, flaunting his fancy footwork.  Among 10 tracks, all co-written and co-composed by Rain, other notable tracks include woozy club banger “Where are You Going, Oppa,” featuring HyunA, and a sweet serenade to his beautiful woman, titled “Marilyn Monroe.” The album pours out Rain’s sonic experimental tendencies as well as his oozing pride and confidence as a 13-year K-pop veteran. Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2014-01-08T00:40:58+00:00",
    "url": "https://www.billboard.com/music/music-news/rain-makes-grand-return-with-sixth-album-rain-effect-5862358/"
}