{
    "title": "Rayleigh-wave dispersion reveals crust-mantle decoupling beneath eastern Tibet | Scientific Reports",
    "text": "Thank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\n            the best experience, we recommend you use a more up to date browser (or turn off compatibility mode in\n            Internet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles\n            and JavaScript. Advertisement Scientific Reports\nvolume 5, Article number: 16644 (2015)\n            Cite this article 4281 Accesses 32 Citations Metrics details The Tibetan Plateau results from the collision of the Indian and Eurasian Plates during the Cenozoic, which produced at least 2,000 km of convergence. Its tectonics is dominated by an eastward extrusion of crustal material that has been explained by models implying either a mechanical decoupling between the crust and the lithosphere, or lithospheric deformation. Discriminating between these end-member models requires constraints on crustal and lithospheric mantle deformations. Distribution of seismic anisotropy may be inferred from the mapping of azimuthal anisotropy of surface waves. Here, we use data from the CNSN to map Rayleigh-wave azimuthal anisotropy in the crust and lithospheric mantle beneath eastern Tibet. Beneath Tibet, the anisotropic patterns at periods sampling the crust support an eastward flow up to 100°E in longitude and a southward bend between 100°E and 104°E. At longer periods, sampling the lithospheric mantle, the anisotropic structures are consistent with the absolute plate motion. By contrast, in the Sino-Korean and Yangtze cratons, the direction of fast propagation remains unchanged throughout the period range sampling the crust and lithospheric mantle. These observations suggest that the crust and lithospheric mantle are mechanically decoupled beneath eastern Tibet and coupled beneath the Sino-Korean and Yangtze cratons. The convergence of Indian and Eurasian plates started ca. 50 Myr ago and resulted in the formation of the Tibetan Plateau. Since the beginning of this collision, the Tibetan crust has doubled its thickness1 and the Tibetan Plateau has been elevated by 4–5 km2,3. The main tectonic features of the Tibetan Plateau are summarized in Fig. 1. Within the plateau interior, the crust flows roughly eastward with speeds that increase toward the east and then flows southward around the eastern end of the Himalaya4,5. Mechanisms invoked to explain this eastward extrusion imply major strike-slip faults2,3,6. Fission-track thermochronology7 and magnetotelluric imaging8 in this region further support the hypothesis that the eastward crustal flow plays a key role in the tectonics and deformation of the Tibetan Plateau. These deformation characteristics have been attributed to the ductile channel flow in a weak lower crust9,10,11. Crustal flow is not uniform beneath the southeastern Tibetan Plateau12 and it may be linked with mechanical conditions in the periphery. These observations are best explained assuming a mechanical decoupling between the crust and the lithospheric mantle. Despite the high elevation of this region, estimations of crustal thickening in the eastern margin of Tibet4,5,9,13 do not show strong evidence for significant shortening of the upper crust14. This observation was interpreted as the consequence of a ductile flow of the lower crust implying, again, a mechanical decoupling between the crust and lithospheric mantle9. Alternatively, it has been suggested that crustal deformation results from lithospheric flow as a whole, involving a mechanical coupling between the crust and the mantle. The mechanical coupling hypothesis is supported by comparisons between the observed surface deformation inferred from GPS and Quaternary fault slip rate data and the mantle deformation inferred from several SKS shear-wave splitting datasets15,16, which suggest a coherence between crust and mantle deformation. Discriminating between the mechanical coupling or decoupling between crust and lithospheric mantle requires additional information that can constrain the deformation within the crust and lithospheric mantle. Simplified tectonic map of eastern Tibet. Names of tectonic units are highlighted in black (Sino-Korean and Yangtze Cratons, Ordos and Sichuan Basins, Tibetan Plateau, Cathaysia and Indochina Blocks) and important tectonic features are highlighted in purple (Chuan-Dian Fragment, Eastern Himalayan Syntaxis, Longmen Shan, Qaidam Basin, Qinling, Red River Fault Zone, Songpan-Ganze Block and Tenchong). Thick black lines show the SKS-splitting measurements. Blue arrows represent the absolute plate motion in the region. The background color indicates the topographic relief. This figure is generated using the Generic Mapping Tools45 and GIMP 2.6. Seismic data provides key information on the structure and deformation of the lithosphere. Seismic tomography allows imaging crustal fault systems and structures at depth, therefore bringing information on the regional dynamics. Regional traveltime tomography17,18 and surface-wave tomography19,20,21,22 displayed very low velocity anomalies in the crust and upper mantle in western Sichuan and in the Tengchong volcanic area, indicating a possible rotation of the crustal channel flow along the western edge of the rigid Sichuan Basin9,10,11. Because it can be related to rock deformation through lattice preferred orientation (LPO), seismic anisotropy is a key observation to understand the deformation of the Tibetan lithosphere. Shear-wave splitting studies13,23,24,25 have revealed a complex anisotropic pattern, with a dramatic change in the fast polarization direction across the Chuan-Dian Fragment, which is consistent with a weak coupling between the lower crust and the upper lithospheric mantle. However, shear-wave splitting data cannot resolve the radial variations of seismic anisotropy and therefore cannot locate unambiguously the deformation at depth. By contrast, radial and lateral variations in seismic anisotropy can be assessed by surface-wave data, which sample different depth ranges depending on their periods26. The mapping of isotropic and anisotropic surface-wave velocity anomalies at selected periods is based on the measurements and inversion of a collection of dispersion curves. These maps can then be linked to appropriate depth ranges through phase-velocity sensitivity kernels (Supplementary Figure S14). The presence of layers with different anisotropic patterns, as observed in various regions27,28, indicates the succession of different episodes or mechanisms of deformation. Here, we build maps of the fundamental-mode of Rayleigh-wave phase velocity for the eastern Tibetan Plateau and the western margins of the Sino-Korean and Yangtze cratons using teleseismic data from the China National Seismic Network29, following a two-step method (see Supplementary Information for details). First, we used the cross-correlation approach to measure the interstation phase velocity dispersion curves28, resulting in a set of dispersion curves for 531 interstation paths. A special effort was made on the quality of the measurements to prevent scattered waves, multi-pathing or off-great-circle propagation from biasing our measurements. We then invert this collection of dispersion curves for maps of both isotropic and anisotropic anomalies of Rayleigh-wave phase velocity at selected periods27,28,30,31. Resolution tests are discussed in Supplementary Information. Our preferred models are displayed in Fig. 2 for periods of 20 s, 40 s and 80 s. Models for other periods are shown in Supplementary Figures S15 and S16. These models show variations in Rayleigh-wave phase-velocity anomalies with both horizontal location and period. (a–c) Maps of isotropic (color code) and azimuthal anisotropic (black bars) Rayleigh-wave phase velocity at selected periods, (a) 20, (b) 40 and (c) 80 seconds. The direction and length of the bars denote the direction of fast propagation and amplitude of anisotropic anomalies, respectively. (d–f) Depth sensitivity kernels at (d) 20, (e) 40 and (f) 80 seconds, with the color-shaded area indicating the depths range of maximum sensitivity. The depth of the Moho beneath eastern Tibet and beneath the western margins of the Sino-Korean and Yangtze cratons are also indicated. The model used to calculate the sensitivities is the continental AK135 model46. This figure is generated using the Generic Mapping Tools45 and GIMP 2.6. In the period range 20–40 s, the isotropic structure (background color in Fig. 2) is dominated by an east-west dichotomy, with slow velocities in the western part of the model and fast velocities in its eastern part. The strongest relative velocity anomalies are found at the period of 40 s, with fast anomalies of up to 2% (relative to regional average) beneath the Sichuan Basin and slow anomalies of up to −2.5% in the eastern Songpan-Ganze block and around the eastern margin of the Qaidam Basin. North and south of the Sichuan Basin, seismic velocities are faster than average, but with a small amplitude, typically around 1%. The east-west dichotomy is still present, but much attenuated at periods of 80 s and longer. The isotropic part of the model thus reveals clear differences in the lithospheric structure of the main units of the region, in agreement with previous seismological models based on regional traveltime tomography17,18, surface-wave tomography at a local scale11,19,20,21,22 and surface-wave tomography at larger scales32,33,34. The anisotropic pattern, represented by black bars in Fig. 2, does not substantially change in the period range 20–40 s. At these periods, the direction of fast propagation bends around the border of the Tibetan Plateau. In the northern part, the anisotropic fast direction is almost EW and rotates towards a NS direction around 100°E. North of 34°N, the direction is NW-SE and turns to slightly NE-SW south of this latitude. Interestingly, this change is well correlated with the contrast in isotropic velocity. In the eastern part of our model (east of 104°E longitude), covering the western borders of the Sino-Korean and Yangtze cratons, the direction of fast propagation is again NS. Note that this trend is observed up to 60 s period. At periods of 80 s and longer, the fast axis of anisotropy is mostly NW-SE throughout the area covered by our model, except in its northern part (36°N and north), which is again dominated by an EW direction of fast propagation. Interestingly, the NW-SE trend south of 36°N latitude is consistent with the regional Absolute Plate Motion (APM) determined with a fixed European plate and various reference frames35,36,37. Good agreement can be seen among the fast axes of polarization of the SKS measurements13,24,25,38, surface-wave tomography21,22 and the direction of fast propagation predicted by the anisotropic part of our models. In some regions, the SKS measurements seem mostly sensitive to the mantle deformation, as expected; but in some parts of our models (e.g., 34°N and 96°E), we also see a match between the crustal anisotropy and the SKS splitting results. Our models have strong implications for the structure and dynamics of the lithosphere beneath Tibet. The main findings and interpretations in terms of crustal and lithospheric dynamics are summarized in Fig. 3. The most striking result in our isotropic model is the strong velocity contrast between central Tibet and the Sino-Korean and Yangtze cratons in the period range 20–40 s. We interpret this dichotomy as a change in the crustal thickness. Beneath Tibet, thickness of the crust reaches 80 km, whereas it is only 35–40 km beneath the Sichuan Basin1,5,32,33,34,39. Therefore, at 20–40 s, the Rayleigh waves sample the lithospheric mantle in Sino-Korean and Yangzte cratons, whereas they still sample the crust, which is seismically slower, beneath Tibet. Because we use an average regional model for each period, it is difficult to interpret the local variations of the velocity perturbations in terms of absolute velocities. However, the amplitudes of the anomalies (±2.5%) are consistent with the velocity contrast measured by surface-wave tomography at similar depths32,33. In the period range of 20–40 s, the fast velocity anomalies observed north of 28°N may be related to the Central Asian Orogenic Belt, i.e. the boundary between the Tibetan Plateau and the Tarim and North China cratons40,41. Sketch of the flow in the region, displaying the average anisotropic patterns at different periods (blue - 20 s, sampling the crust; green - 40 s, sampling around the Moho; and orange - 80 s, sampling the lithospheric mantle) and proposed flow (arrows with the same color code). This figure is generated using the Generic Mapping Tools45 and GIMP 2.6. The anisotropic pattern in our model provides important clues on the dynamics of the Tibetan Plateau. Based on GPS, geologic and shear-wave splitting data, it has been argued that the lower crust and the lithospheric mantle in this region are coupled15. Modeling of quasi-Love wave11 found evidence for vertically coherent deformation in Tibet. Other studies9,10,42 arrived at the opposite conclusion, proposing that the lower crust is animated by a ductile flow. Because the anisotropic pattern we observe at the periods of 80 s and longer, which, in this area, sample the lithospheric mantle, strongly differs from that in the period range 20–40 s (sampling the lower crust), our model strongly supports a mechanical decoupling. Following the decoupling hypothesis, crustal material extruded from Tibet flows clockwise around the Eastern Himalayan Syntaxis into southeastern Tibet and Yunnan Province and across the Red River Shear Zone. Again, this is consistent with the rotation of the anisotropy observed in our models (in the period range 20–40 s) and the drastic change in anisotropy along the Red River Shear Zone. By contrast, in the western margins of the Sino-Korean and Yangzte cratons, where the Moho is shallower (35–40 km), the anisotropic pattern remains unchanged throughout the period range 20–60 s, suggesting that in this region, the crust and lithospheric mantle are mechanically coupled and experience a NS flow (Fig. 2). The anisotropic anomalies we observe give further constraints on the continuity of the crustal flow along the eastern boundary of Tibet. Using GPS measurements, a gap is found in the flow at the latitude of the Sichuan Basin4. Our results, however, display a continuous flow with a slight change of direction beneath central Tibet (Fig. 2), in agreement with the dynamic stress model43, geodetic and seismic data12, geological observations7 and magnetotelluric imaging8. The change in the direction (a slight clockwise rotation) of the fast axis may be linked to the Sichuan Basin, known to be the remnant of a cratonic, stiff, core9. Due to lower temperatures and chemical differences, this region may be stiffer than the surrounding crust, thus diverting the crustal flow. It is interesting to note that anisotropic maps at periods sampling the Tibetan crust (20–40 s) are consistent with SKS-splitting studies13,24,25,38, suggesting that in this region, the SKS waves are mostly sensitive to the middle and lower crust. At latitudes of 38°N and higher, the anisotropy is roughly EW. In the central part of our model (roughly 28°N and 100°E), the anisotropy is NS. North of the Sichuan Basin, EW fast axis of anisotropy is found, whereas it rotates to NS west of the Sichuan Basin. This is in agreement with the previous SKS-splitting measurements in the region13,24,25,38. At periods of 80 s and longer, the anisotropic pattern is, on the other hand, consistent with the Absolute Plate Motion35,36,37 for this region. Our Rayleigh-wave phase-velocity model highlights important structural changes and dynamic processes in the eastern Tibetan lithosphere and its surroundings. Isotropic anomalies map the main units of this region, including the Yangtze and Sino-Korean cratons and the Tibetan crust and clearly identify the boundary between these units, which is associated with a step in the Moho depth. Lateral and vertical patterns of anisotropy provide more details on the tectonic evolution of the region. Our anisotropic maps resolve two different anisotropic layers beneath eastern Tibet, supporting a mechanical decoupling between the crust and lithospheric mantle in this region. By contrast, the vertical continuity of the anisotropic pattern beneath the Yangtze and Sino-Korean cratons indicates that the crust and lithospheric mantle are mechanically coupled in these cratons. The mechanical coupling or decoupling may be controlled by regional tectonic stress, rock properties and physical conditions (such as temperature) which influence the rheology of the lithosphere. Additional modeling, in particular geodynamical numerical experiments, should help to clarify this point. To build anisotropic maps of the fundamental-mode Rayleigh-wave phase velocity beneath eastern Tibet, we followed a two-step method, which consists in first measuring a collection of dispersion curves between pairs of stations and then inverting the collection of curves for maps of isotropic and anisotropic phase-velocity anomalies at selected periods. The dataset is a collection of selected broadband waveforms recorded at 32 seismic stations from the China National Seismic Network29. The stations are fairly evenly distributed in our study region, thus providing more or less even sampling of the region. The two-station method, which we employ to measure the dispersion curves between two stations, requires that the angle between the great circles connecting a given pair of stations and that connecting this pair and the earthquake epicenter are not too large. In this study, we set an upper limit of 10° for this angle. Epicentral distances are between 2° and 170° and all interstation distances are in the range of 250–2,500 km. Following these criteria, we extracted 46,490 surface-wave records from 467 events. For each of the 531 station pairs, we measured a phase-velocity dispersion curve for the fundamental Rayleigh mode using the cross-correlation approach of the two-station technique. This approach allows for the measurement of dispersion curves in a broad period range, in our case, between 10 and 200 s. For each selected event, the vertical-component displacements recorded at the two stations of each pair are cross-correlated. To minimize the effects of noise and interferences, the cross-correlation function is first filtered with a frequency-dependent Gaussian band-pass filter. The cross-correlation is then transferred into the frequency domain and its complex phase is used to calculate the phase velocity. All dispersion curve fragments for a specific station pair are then assembled and averaged to construct a single dispersion curve between the two stations and outliers are discarded. After deriving the dispersion curves for the 531 interstation paths, we invert them for both isotropic and anisotropic (2ψ and 4ψ) Rayleigh-wave phase-velocity maps at selected periods. At each point of the model, the total velocity anomaly can be parameterized with 5 coefficients: one for the isotropic phase-velocity variation, δCiso, 2 for the 2ψ-anomaly, A2ψ and B2ψ and 2 for the 4ψ-anomaly, A4ψ and B4ψ: In our models, the amplitude of the 2ψ anisotropy is larger than that of the 4ψ anisotropy by a factor 2 to 5 (see Supplementary Information Figure S8). Furthermore, inverting for the 4ψ terms does not alter the patterns of isotropic and 2ψ anisotropy anomalies (left and middle columns in Figure S9). For information, the right column in Figure S9 plots the 4ψ anisotropy inferred from our preferred models. It is worth noting that previous studies using the same method27 found that the 4ψ terms, while having an amplitude comparable to that of the 2ψ terms, do not significantly improve the χ2 and are therefore not needed to explain the data. Geographically, the model is parameterized on a triangular grid of knots44, with a grid spacing of 80 km. Due to variable data coverage depending on the period, the size of the grid is different at each period. Good coverage (which is obtained for periods longer than 30 s) allows for small grid spacing leading to a grid of 425 knots at 80 s. When coverage is poor (for periods shorter than 30 s), the grid covers a reduced area (e.g., 306 knots at 20 s). Each dispersion curve yields the average phase velocity along the path linking the two stations as a function of period and the total average velocity anomaly along this path may be written as the integral of local anomalies at each grid knot sampled by the given path, where the local anomalies δC(φ, θ) are weighted with respect to the sensitivity kernels Ki(φ, θ). The kernel provides the contribution at each knot on a specific path to the total velocity anomaly. Waveform data for this study are provided by the Data Management Centre of China National Seismic Network at Institute of Geophysics, China Earthquake Administration (SEISDMC, doi:10.7914/SN/CB)29. Figures were generated with the Generic Mapping Tools45. How to cite this article: Legendre, C. P. et al. Rayleigh-wave dispersion reveals crust-mantle decoupling beneath eastern Tibet. Sci. Rep. 5, 16644; doi: 10.1038/srep16644 (2015). Xu, L., Rondenay, S. & Van Der Hilst, R. D. Structure of the Crust beneath the southeastern Tibetan Plateau from teleseismic Receiver Functions. Physics of the Earth and Planetary Interiors. 165, 176–193 (2007). Article \n    ADS \n    \n                    Google Scholar Tapponnier, P., Peltzer, G. & Armijo, R. On the mechanics of the collision between India and Asia. Geol. Soc., London, Sp. Pub. 19, 113–157 (1986). Article \n    ADS \n    \n                    Google Scholar Avouac, J.-P. & Tapponnier, P. Kinematic model of active deformation in central Asia. Geophys. Res. Lett. 20, 895–898 (1993). Article \n    ADS \n    \n                    Google Scholar Zhang, P.-Z. et al. Continuous deformation of the Tibetan Plateau from Global Positioning System data. Geology. 32, 809–812 (2004). Article \n    ADS \n    \n                    Google Scholar Wittlinger, G., Farra, V., Hetényi, G., Vergne, J. & Nábělek, J. Seismic velocities in southern Tibet lower Crust: a Receiver Function approach for eclogite detection. Geophys. J. Int. 177, 1037–1049 (2009). Article \n    ADS \n    \n                    Google Scholar Molnar, P. & Tapponnier, P. Active tectonics of Tibet. J. Geophys. Res. 83, 5361–5375 (1978). Article \n    ADS \n    \n                    Google Scholar Enkelmann, E. et al. Cenozoic exhumation and deformation of northeastern Tibet and the Qinling: Is Tibetan lower Crustal flow diverging around the Sichuan basin? Geol. Soc. of Am. Bull. 118, 651–671 (2006). Article \n    ADS \n    \n                    Google Scholar Bai, D. et al. Crustal deformation of the eastern Tibetan Plateau revealed by magnetotelluric imaging. Nat. Geo. 3, 358–362 (2010). Article \n    ADS \n    CAS \n    \n                    Google Scholar Royden, L. H. et al. Surface deformation and lower Crustal flow in eastern Tibet. Science. 276, 788–790 (1997). Article \n    CAS \n    \n                    Google Scholar Clark, M. K. & Royden, L. H. Topographic ooze: Building the eastern margin of Tibet by lower Crustal flow. Geology. 28, 703–706 (2000). Article \n    ADS \n    \n                    Google Scholar Chen, X. & Park, J. Anisotropy gradients from Ql surface waves: Evidence for vertically coherent deformation in the Tibet region. Tectonophysics. 608, 346–355 (2013). Article \n    ADS \n    \n                    Google Scholar Liu, Q. Y. et al. Eastward expansion of the Tibetan Plateau by Crustal flow and strain partitioning across faults. Nat. Geo. 7, 361–365 (2014). Article \n    ADS \n    CAS \n    \n                    Google Scholar Sol, S. et al. Geodynamics of the southeastern Tibetan Plateau from seismic anisotropy and geodesy. Geology. 35, 563–566 (2007). Article \n    ADS \n    \n                    Google Scholar Burchfiel, B., Zhiliang, C., Yupinc, L. & Royden, L. Tectonics of the Longmen Shan and adjacent regions, central China. Int. Geol. Review. 37, 661–735 (1995). Article \n    ADS \n    \n                    Google Scholar Flesch, L. M. et al. Constraining the extent of crust-mantle coupling in central Asia using GPS, geologic and shear wave splitting data. Earth Planet. Sci. Lett. 238, 248–268 (2005). Article \n    ADS \n    CAS \n    \n                    Google Scholar Bendick, R. & Flesch, L. Reconciling lithospheric deformation and lower Crustal flow beneath central Tibet. Geology. 35, 895–898 (2007). Article \n    ADS \n    \n                    Google Scholar Li, C., Van Der Hilst, R. D. & Toksöz, M. N. Constraining P-wave velocity variations in the upper Mantle beneath southeast Asia. Phys. Earth Planet. Inter. 154, 180–195 (2006). Article \n    ADS \n    \n                    Google Scholar Li, C., Van Der Hilst, R. D., Meltzer, A. S. & Engdahl, E. R. Subduction of the Indian Lithosphere beneath the Tibetan Plateau and Burma. Earth Planet. Sci. Lett. 274, 157–168 (2008). Article \n    ADS \n    CAS \n    \n                    Google Scholar Priestley, K., Debayle, E., McKenzie, D. & Pilidou, S. Upper Mantle structure of eastern Asia from multimode surface waveform tomography. J. Geophys. Res. 111, B10304 (2006). Article \n    ADS \n    \n                    Google Scholar Yang, Y. et al. Rayleigh wave phase velocity maps of Tibet and the surrounding regions from ambient seismic noise tomography. Geochem. Geophys. Geosyst. 11, 18pp (2010). Article \n    \n                    Google Scholar Pandey, S. et al. A 3D shear-wave velocity model of the upper Mantle beneath China and the surrounding areas. Tectonophysics. 633, 193–210 (2014). Article \n    \n                    Google Scholar Pandey, S. et al. Depth-variant azimuthal anisotropy in Tibet revealed by surface wave tomography. Geophys. Res. Lett. 42, 4326–4334 (2015). Article \n    ADS \n    \n                    Google Scholar Lev, E., Long, M. D. & Van Der Hilst, R. D. Seismic anisotropy in eastern Tibet from shear wave splitting reveals changes in lithospheric deformation. Earth Planet. Sci. Lett. 251, 293–304 (2006). Article \n    ADS \n    CAS \n    \n                    Google Scholar Wang, C.-Y., Flesch, L. M., Silver, P. G., Chang, L.-J. & Chan, W. W. Evidence for mechanically coupled Lithosphere in central Asia and resulting implications. Geology. 36, 363–366 (2008). Article \n    ADS \n    \n                    Google Scholar León Soto, G. et al. Significant and vertically coherent seismic anisotropy beneath eastern Tibet. J. Geophys. Res. 117, 22pp (2012). Article \n    \n                    Google Scholar Cupillard, P. et al. RegSEM : a versatile code based on the Spectral Element Method to compute seismic wave propagation at the regional scale. Geophys. J. Int. 188, 1203–1220 (2012). Article \n    ADS \n    \n                    Google Scholar Deschamps, F., Lebedev, S., Meier, T. & Trampert, J. Azimuthal anisotropy of Rayleigh-wave phase velocities in the east-central United States. Geophys. J. Int. 173, 827–843 (2008). Article \n    ADS \n    \n                    Google Scholar Legendre, C. P., Deschamps, F., Zhao, L., Lebedev, S. & Chen, Q.-F. Anisotropic Rayleigh wave phase velocity maps of eastern China. J. Geophys. Res. 119, 4802–4820 (2014). Article \n    ADS \n    \n                    Google Scholar Zheng, X.-F., Yao, Z.-X., Liang, J.-H. & Zheng, J. The role played and opportunities provided by IGP DMC of China National Seismic Network in Wenchuan earthquake disaster relief and researches. Bull. Seismol. Soc. Am. 100, 2866–2872 (2010). Article \n    \n                    Google Scholar Legendre, C., Chen, Q.-F. & Zhao, L. Lithospheric structure beneath the East China Sea revealed by Rayleigh-wave phase velocities. J. of Asian Earth Sci. 96, 213–225 (2014). Article \n    ADS \n    \n                    Google Scholar Legendre, C. P., Zhao, L., Huang, W.-G. & Huang, B.-S. Anisotropic Rayleigh-wave phase velocities beneath northern Vietnam. Earth, Planets and Space. 67, 28 (2015). Article \n    ADS \n    \n                    Google Scholar Lebedev, S. & Nolet, G. Upper mantle beneath southeast Asia from S velocity tomography. J. Geophys. Res. 108, 2048 (2003). ADS \n    \n                    Google Scholar Friederich, W. The S-velocity structure of the east Asian Mantle from inversion of shear and surface waveforms. Geophys. J. Int. 153, 88–102 (2003). Article \n    ADS \n    \n                    Google Scholar Legendre, C. P., Zhao, L. & Chen, Q.-F. Upper-mantle shear-wave structure under East and Southeast Asia from Automated Multimode Inversion of waveforms. Geophys. J. Int. 203, 707–719 (2015). Article \n    ADS \n    \n                    Google Scholar DeMets, C., Gordon, R., Argus, D. & Stein, S. Current plate motions. Geophys. J. Int. 101, 425–478 (1990). Article \n    ADS \n    \n                    Google Scholar DeMets, C., Gordon, R. G., Argus, D. F. & Stein, S. Effect of recent revisions to the geomagnetic reversal time scale on estimates of current plate motions. Geophys. Res. Lett. 21, 2191–2194 (1994). Article \n    ADS \n    \n                    Google Scholar DeMets, C., Gordon, R. G. & Argus, D. F. Geologically current plate motions. Geophys. J. Int. 181, 1–80 (2010). Article \n    ADS \n    \n                    Google Scholar Wüstefeld, A., Bokelmann, G., Barruol, G. & Montagner, J. Identifying global seismic anisotropy patterns by correlating shear-wave splitting and surface-wave data. Phys. Earth Planet. Inter. 176, 198–212 (2009). Article \n    ADS \n    \n                    Google Scholar Griot, D.-A., Montagner, J.-P. & Tapponnier, P. Phase velocity structure from Rayleigh and Love waves in Tibet and its neighboring regions. J. Geophys. Res. 103, 21215–21232 (1998). Article \n    ADS \n    \n                    Google Scholar Molnar, P. & Tapponnier, P. Cenozoic tectonics of Asia: Effects of a continental collision. Science. 189, 419–426 (1975). Article \n    ADS \n    CAS \n    \n                    Google Scholar Rowley, D. B. Age of initiation of collision between India and Asia: A review of stratigraphic data. Earth Planet. Sci. Lett. 145, 1–13 (1996). Article \n    ADS \n    CAS \n    \n                    Google Scholar Klemperer, S. L. Crustal flow in Tibet: geophysical evidence for the physical state of Tibetan Lithosphere and inferred patterns of active flow. Geol. Soc., London, Special Publications. 268, 39–70 (2006). Article \n    ADS \n    \n                    Google Scholar Clark, M. K., Bush, J. W. M. & Royden, L. H. Dynamic topography produced by lower Crustal flow against rheological strength heterogeneities bordering the Tibetan Plateau. Geophys. J. Int. 162, 575–590 (2005). Article \n    ADS \n    \n                    Google Scholar Legendre, C. P., Meier, T., Lebedev, S., Friederich, W. & Viereck-Götte, L. A shear wave velocity model of the European Upper Mantle from automated inversion of seismic shear and surface waveforms, Geophys. J. Int. 191, 282–304 (2012). Article \n    ADS \n    \n                    Google Scholar Wessel, P. & Smith, W. H. New version of the Generic Mapping Tools. Eos Trans. AGU. 76, 329 (1995). Article \n    ADS \n    \n                    Google Scholar Kennett, B., Engdahl, E. & Buland, R. Constraints on seismic velocities in the Earth from traveltimes. Geophys. J. Int. 122, 108–124 (1995). Article \n    ADS \n    \n                    Google Scholar Download references Two anonymous reviewers are acknowledged for their constructive comments that greatly improved this manuscript. The authors thank S. Lebedev who provided insight and expertise that greatly assisted this research and Y.-C. Wang and C.-J. Chou for assistance with the measurements of the dispersion curves. This work was funded by an Academia Sinica Career Development Award (AS-098-CDA-M02), the National Science Council of Taiwan under grants NSC-101-2116-M-001-035 and NSC-101-2116-M-001-001-MY3 and by Ministry of Science and Technology (MOST) of Taiwan under grants MOST 103-2116-M-001-026-MY3. Cédric P. Legendre Present address: Department of Geosciences, National Taiwan University, No. 1, Sec 4, Roosevelt Rd., Taipei, 10617, Taiwan Legendre Cédric P., Deschamps Frédéric, Zhao Li and Chen Qi-Fu contributed equally to this work. Institute of Earth Sciences, Academia Sinica, 128 Academia Road, Sec. 2, Nangang, 11529, Taipei, Taiwan Cédric P. Legendre, Frédéric Deschamps & Li Zhao Key Laboratory of Earth and Planetary Physics, Institute of Geology and Geophysics, Chinese Academy of Sciences, Beijing, 100029, China Qi-Fu Chen You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar C.P.L. performed the measurements and inversions, F.D., Z.L. and Q.F.C. contributed to the interpretations and the writing and revision of the manuscript. The authors declare no competing financial interests. This work is licensed under a Creative Commons Attribution 4.0 International License. The images or other third party material in this article are included in the article’s Creative Commons license, unless indicated otherwise in the credit line; if the material is not included under the Creative Commons license, users will need to obtain permission from the license holder to reproduce the material. To view a copy of this license, visit http://creativecommons.org/licenses/by/4.0/ Reprints and Permissions Legendre, C., Deschamps, F., Zhao, L. et al. Rayleigh-wave dispersion reveals crust-mantle decoupling beneath eastern Tibet.\n                    Sci Rep 5, 16644 (2015). https://doi.org/10.1038/srep16644 Download citation Received: 23 April 2015 Accepted: 16 October 2015 Published: 09 November 2015 DOI: https://doi.org/10.1038/srep16644 Anyone you share the following link with will be able to read this content: Sorry, a shareable link is not currently available for this article.  Provided by the Springer Nature SharedIt content-sharing initiative Scientific Reports (2022) Science China Earth Sciences (2022) Communications Earth & Environment (2021) Acta Geophysica (2019) Acta Geophysica (2019) By submitting a comment you agree to abide by our Terms and Community Guidelines. If you find something abusive or that does not comply with our terms or guidelines please flag it as inappropriate. Advertisement Scientific Reports (Sci Rep)\n                \n\nISSN 2045-2322 (online) © 2023 Springer Nature Limited Sign up for the Nature Briefing newsletter — what matters in science, free to your inbox daily. ",
    "datetime": null,
    "url": "https://www.nature.com/articles/srep16644"
}