{
    "title": "Reciprocal and unidirectional scattering of parity-time symmetric structures | Scientific Reports",
    "text": "Thank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\n            the best experience, we recommend you use a more up to date browser (or turn off compatibility mode in\n            Internet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles\n            and JavaScript. Advertisement Scientific Reports\nvolume 6, Article number: 20976 (2016)\n            Cite this article 2823 Accesses 33 Citations 1 Altmetric Metrics details Parity-time  symmetry is of great interest. The reciprocal and unidirectional features are intriguing besides the  symmetry phase transition. Recently, the reciprocal transmission, unidirectional reflectionless and invisibility are intensively studied. Here, we show the reciprocal reflection/transmission in -symmetric system is closely related to the type of  symmetry, that is, the axial (reflection)  symmetry leads to reciprocal reflection (transmission). The results are further elucidated by studying the scattering of rhombic ring form coupled resonators with enclosed synthetic magnetic flux. The nonreciprocal phase shift induced by the magnetic flux and gain/loss break the parity  and time-reversal  symmetry but keep the parity-time  symmetry. The reciprocal reflection (transmission) and unidirectional transmission (reflection) are found in the axial (reflection) -symmetric ring centre. The explorations of symmetry and asymmetry from  symmetry may shed light on novel one-way optical devices and application of -symmetric metamaterials. Parity-time  symmetric quantum system may possess entirely real spectrum although being non-Hermitian1,2,3,4,5,6,7,8,9,10,11,12,13.  symmetric system is invariant under the combined  operator in the presence of balanced gain and loss. In the past decade, -symmetric system has attracted tremendous interests as it possesses unintuitive but intriguing implications. Due to the similarity between the paraxial wave equation describing spatial light wave propagation and the temporal Schrödinger equation for quantum system, the complex refractive index distribution satisfying n*(x) = n(−x) mimics -symmetric potentials V*(x) = V(−x), -symmetric systems are proposed and realized in coupled optical waveguides through index guiding and a inclusion of balanced gain and loss regions14,15,16,17. A number of novel and non-trivial phenomena are found, such as power oscillation17, coherent perfect absorbers18,19,20, nonreciprocal light propagation21 in coupled waveguides, and recently the -symmetric microcavity lasing22,23,24 and gain induced large optical nonlinear25,26,27,28,29 in coupled resonators. The spectral singularity30,31,32,33,34,35,36 and invisibility37,38,39,40,41,42,43 in -symmetric system are hot topics, where reciprocal transmission and unidirectional reflectionless in -symmetric metamaterial are intriguing features for novel optical devises. These devices are useful for light transport, control and manipulation44,45,46,47. The symmetric scattering properties are usually attributed to certain internal symmetry of a scattering centre. For instance, the parity  symmetry, or time-reversal  symmetry of a scattering centre leads to symmetric reflection and transmission48 (-symmetric system without unequal tunnelling amplitude is Hermitian, otherwise, only reciprocal reflection or transmission holds49). Here, we report reciprocal reflection, similar as reciprocal transmission, are both related to the  symmetry of a scattering centre: The axial (refection)  symmetry, with respect to the input and output channels, induces reciprocal reflection (transmission). Recent efforts on photonic Aharonov-Bohm effect enable photons behaving like electrons in magnetic field. Effective magnetic field for photons can be introduced in coupled waveguides by bending the waveguides50, periodically modulating the refractive index51, and the photon-phonon interactions52; or in coupled resonators by magneto-optical effect53, dynamic modulation54, and off-resonance coupling paths imbalance55,56. In this work, we focus on the -symmetric structure with balanced gain and loss threading by synthetic magnetic flux, where photons feel a nonreciprocal tunnelling phase between neighbour resonators. The nonreciprocal tunnellings and balanced gain and loss break the  and  symmetry but keep the  symmetry of the scattering centre. The axial (reflection)  symmetry will lead to reciprocal reflection (transmission) and unidirectional transmission (reflection). Our findings provide new insights of  symmetry and the symmetric/asymmetric scattering, which are instrumental for the applications of -symmetric metamaterial for light transport and one-way optical devises. The symmetric scattering properties of a -symmetric structure are closely related to the classification of -symmetry. The parity operator  is the spatial reflection operator,  is the time-reversal operator. In Fig. 1a,b, we schematically show two types of  symmetry. The Hamiltonian of the scattering centre is -invariant, i.e., . The input and output leads are connected to the -symmetric scattering centre at sites L and R. If the connection sites under the parity operation satisfies , , the system is called axial  symmetric (Fig. 1a). If the connection sites under the parity operation satisfies , , the system is called reflection  symmetric (Fig. 1b). The red plane indicates the up-to-down (left-to-right) spatial reflection correspondence of axial (reflection)  symmetry. Two semi-infinite input and output leads (solid grey) are connected to the -symmetric structures (black sphere) at sites L and R (yellow circle). (a) The axial  symmetry, defined as self-correspondence of L, R under parity operation. (b) The reflection  symmetry, defined as reflection-correspondence of L, R under parity operation. The axial (c) and reflection (d) -symmetric rhombic ring configurations with enclosed magnetic flux Φ are schematically illustrated. The  symmetry axes are in dash dotted red. The red (green) site represents the gain (loss). In order to address the reciprocal and unidirectional scattering behavior. We study the reflection and transmission of a scattering centre for the left side and right side inputs, respectively. The Hamiltonian of the scattering system is H = HL + Hc + HR with HL (HR) being the Hamiltonian of the left (right) lead. We denote the two scattering states as  and  for the input with wave vector k. The forward going and backward going waves are in form of . Combining with the reflection and transmission coefficient, we assume the scattering state wave function on the leads (not at the spectral singularities, see Methods) of left side input as, where rL and tL represent the reflection and transmission coefficients for the left side input with wave vector k. Similarly, the wave function on the leads of right side input is in form of where rR and tR represent the reflection and transmission coefficients for the right side input with wave vector k. As shown in Fig. 1a, this type of -symmetric scattering centres have connection sites under parity operation satisfying , . In the axial -symmetric configuration, the  symmetry is defined as ,  in the leads, and as  in the centre. The whole scattering system is axial -symmetric with respect to the leads. The axial  symmetry results in symmetric relations on the scattering coefficients as (see Supplementary Information Note 1 for details), From equations (3,4), we notice the reflection probabilities for the left and right side inputs are the same, i.e., In other words, the axial  symmetry leads to the reciprocal reflection. Notice that we have reciprocal reflection  at any transmission zero tL,R = 0, where one-way pass through is possible. Furthermore,considering the waves with vectors k and −k, the reflection and transmission coefficients further satisfy , , , and . As shown in Fig. 1b, this type of -symmetric scattering centres have connection sites under parity operation satisfying , . In the reflection -symmetric configuration, the  symmetry is defined as ,  in the leads, and as  in the centre. The whole scattering system is reflection -symmetric with respect to the leads. The reflection  symmetry results in symmetric relations on the scattering coefficients as (see Supplementary Information Note 2 for details), From equations (6,7), we notice the transmission probabilities for the left side and right side inputs are the same, i.e., This indicates the reflection  symmetry leads to the reciprocal transmission, as observed in Bragg gratings and other -symmetric structures45,46,47. Notice that we have reciprocal transmission  at any reflection zero rL,R = 0, where unidirectional reflectionless is possible37,38,39,40,41,42,43. Furthermore, considering the waves with vectors k and −k, the reflection and transmission coefficients further satisfy , , , and . We show that in the present of  symmetry, the reciprocal reflection or transmission in a scattering centre is protected when the axial or reflection  symmetry holds even though the  and  symmetry are absent. Moreover,  symmetry structure may exhibit unidirectional scattering behavior. We use a rhombic ring structure (Fig. 1c,d) to elucidate the results. The scattering centre encloses with an effective magnetic flux , photons moving along the rhombic ring structure in clockwise (counterclockwise) direction will acquire an additional direction-dependent phase factor  , thus photons tunnelling is nonreciprocal except when , . This is an effective photon Aharonov-Bohm effect creating by synthetic magnetic field50,51,52,53,54,55,56. The phase factor  is an analytical function of  with period of 2π, it is sufficient to understand the influence of magnetic flux on the scattering by studying  in the region . To realize a synthetic magnetic field, two ring resonators are coupled through an auxiliary off-resonant ring resonator. The auxiliary resonator introduces optical paths imbalance when coupling to two primary resonators, the auxiliary resonator can be effectively reduced and create a coupling phase factor between two primary resonators. The coupled resonators under synthesized magnetic field is described by a magnetic tight-binding Hamiltonian55,56, where ϕ = Φ/4 is a nonreciprocal phase shift induced by the magnetic flux in the tunnelling constant. In Fig. 1c, the Hamiltonian of the scattering centre is , where γ is the gain/loss rate. The balanced gain and loss are the origin of the non-Hermiticity realized in the optical systems14,15,16,17,23,24,25,26,27. The configuration is axial -symmetric with the parity operator acting on the rhombic ring sites defined as , , , . In Fig. 1d, the Hamiltonian of the scattering centre is , the parity operator  is defined as , , , , and the configuration is reflection -symmetric. In the system, the magnetic flux is inverted meanwhile the gain and loss are switched under the  or  operation. However, the system is invariant under the combined  operator, i.e., the presence of non-trivial magnetic flux as well as balanced gain and loss both break the  and  symmetry but keep the  symmetry of the system. The scattering centre is actually a two-arm Aharonov-Bohm interferometer. Light wave propagates through two pathways (A and B) between the connection sites −1, 1 and interfere with each other. The interference generates the output which varies as the enclosed magnetic flux. The effective magnetic field is gauge invariant and the magnetic flux acts globally, thus the reflection and transmission are not affected by the nonreciprocal phase distribution in the tunnellings for fixed magnetic flux. In the following, we discuss the reflection and transmission of the -symmetric rhombic ring structures in details. The reflection and transmission coefficients for the axial -symmetric rhombic ring structure (Fig. 1c) are calculated from the Schrödinger equations (see Methods), yielding The reflection and transmission probabilities are functions of the magnetic flux Φ, gain/loss rate γ, and wave vector k. They satisfy  (see Fig. 2a,d),  (see Fig. 2b,c), and  (see Fig. 2e,f). In the absence of non-trivial magnetic flux Φ, or gain/loss γ, the system is -symmetric (reflection--symmetric for Φ absence, i.e., left to right by mirror imaging; inversion--symmetric for γ absence, i.e., left to right by 180° rotation), the reflection and transmission are both reciprocal. The non-trivial magnetic flux Φ together with balanced gain and loss γ break the  symmetry. The symmetric transmission in the -symmetric system at  is broken, i.e., the transmission is unidirectional at . Moreover, the axial  symmetry protects the symmetric reflection, therefore, the reflection is reciprocal but the transmission is unidirectional. The white curves in Fig. 2 show the reflection/transmission zeros. At , we have tL = 0 or tR = 0 with total reflection . This indicates that we only have a non-zero transmission for the right side or left side input, thus the axial -symmetric rhombic ring structure allows one-way pass through. (a–c) The reflection and transmission probabilities , ,  at γ = 1/2 as functions of Φ and k. (d–f) The reflection and transmission probabilities , ,  at Φ = π/2 as functions of γ and k. The insert in (a) schematically illustrates the axial -symmetric rhombic ring structure. The white curves are the reflection and transmission zeros. At k = π/2 and Φ = 0, 2π, the reflections in (a) are 1, the transmissions in (b,c) are 0. Photons circle in the scattering centre either in a clockwise direction or in a counterclockwise direction, we schematically illustrate the two pathways in Supplementary Fig. 1. The phase difference between two pathways affects the interference in the scattering centre, thus the transmission varies as the effective magnetic flux induced phase difference. The phase difference between clockwise direction and counterclockwise direction of transmission pathways is Φ for the left side input (Supplementary Fig. 1c) or −Φ for the right side input (Supplementary Fig. 1d). The transmission pathways are not equivalent in the presence of gain/loss, the interference of phase difference being Φ is different from the interference of phase difference being −Φ. Therefore, the unidirectional transmission is enabled in the presence of nonreciprocal tunneling phase factor  attributed to non-trivial magnetic flux (Φ ≠ nπ, ). In Fig. 3, we plot the reflection and transmission probabilities for an axial -symmetric rhombic ring structure (Fig. 1c) at several set parameters. Figure 3a is for a system with balanced gain and loss in the absence of magnetic flux, i.e., γ = 1/2, Φ = 0. The gain/loss, being non-Hermitian, plays the role of on-site potentials and is the origin of unidirectional behavior. However, the presence of balanced gain and loss alone does not ensure unidirectional scattering. We notice the reflection and transmission in Fig. 3a are both reciprocal. The scattering is unitary even though the system is non-Hermitian (the balanced gain and loss of this rhombic ring structure  can be reduced to an anti-Hermitian interaction  by composing , and the non-Hermiticity of the scattering centre only arises from the anti-Hermitian interaction between , which is proved to have unitary scattering57). By introducing magnetic flux to the system, the  and  symmetry is destroyed but the  symmetry holds. The interference between light waves from the loss arm and the gain arm generates unidirectional transmission for non-trivial magnetic flux. Figure 3b is for a system in the presence of non-trivial magnetic flux, i.e., γ = 1/2, Φ = π/2. The unidirectional transmission zero happens at , i.e., at k ≈ 0.420π, , ; at k ≈ 0.580π, , , which indicates a one-way pass through. Figure 3c is for a Hermitian scattering centre in the presence of non-trivial magnetic flux, i.e., γ = 0, Φ = π/2, we have Hermitian scattering without unidirectional behavior. (a) γ = 1/2, Φ = 0, (b) γ = 1/2, Φ = π/2, (c) γ = 0, Φ = π/2. In the rhombic ring structure under axial  symmetry (Fig. 1c), the reflection and transmission coefficients rL, rR, tL, tR diverge at the spectral singularities30. When k = π/2, we have the reflection and transmission coefficients  and . We notice the spectral singularities are at . When Φ = π, we have the reflection and transmission coefficients  and . The spectral singularities are at . At the spectral singularities, the scattering states are in form of a self-sustained emission ,  and a reflectionless absorption ,  (see Method)58. The transfer matrix of the scattering centre is , ,  with matrix-element M22 vanishes59. Now, we turn to discuss the rhombic ring structure under reflection  symmetry. The configuration is shown in Fig. 1d. Supplementary Fig. 2 schematically illustrates the pathways of photons. The connection sites are linked by two same pathways. In the presence of magnetic flux Φ, photons travelling from left lead to right lead in clockwise direction and counterclockwise direction acquire additional phases +Φ/2 and −Φ/2 in the two pathways (Supplementary Fig. 2c), respectively. The situation is unchanged for photons travelling inversely from right lead to left lead (Supplementary Fig. 2d). Equivalently, the upper and lower pathways are undistinguishable. Therefore, only relative phase difference Φ matters (affecting the transmission coefficient) and the transmission is directionless. The reflection and transmission coefficients are calculated as (see Methods) The reflection and transmission coefficients are functions of the magnetic flux Φ, gain/loss rate γ, and wave vector k. They satisfy  and . Figure 4 implies a reciprocal transmission (Fig. 4a,d) and unidirectional reflection (Fig. 4b,c,e,f). In this configuration, the scattering with both reflection and transmission being reciprocal happens in the absence of gain and loss (γ = 0), that is when the system is -symmetric. In the presence of gain and loss (γ ≠ 0), the reflection probability is unidirectional, but the reflection  symmetry protects the reciprocal transmission. Due to the presence of gain and loss, the probability of the total reflection and transmission after scattering is not unitary, being balanced gain and loss rate dependent. The white curves in Fig. 4 show the reflection and transmission zeros. At k = π/2 and Φ = 0, , . At the reflection zeros, , , and , the system exhibits unidirectional reflectionless with reciprocal transmission. (a–c) The reflection and transmission probabilities , ,  at γ = 1/2 as functions of Φ and k. (d–f) The reflection and transmission probabilities , ,  at Φ = π/2 as functions of γ and k. The insert in (a) schematically illustrates the reflection -symmetric rhombic ring structure. The white curves are the reflection and transmission zeros. At k = π/2 and Φ = 0, 2π, the transmissions in (a) are 1, the reflections in (b,c) are 0 as marked by black crosses. In Fig. 5, we plot the reflection and transmission probabilities for a reflection -symmetric rhombic ring structure (Fig. 1d) at several set parameters. Figure 5a,b are for balanced gain and loss rate γ = 1/2 with two different magnetic flux Φ = 0 and π/2, respectively. The reciprocal transmission and unidirectional reflection are clearly seen. In Fig. 5a, the unidirectional reflectionless happens at k ≈ 0.27π, 0.73π, , , . In Fig. 5b, the unidirectional reflectionless happens at k ≈ 0.072π, 0.928π, , , ; or at k ≈ 0.310π, 0.690π, , , . In the absence of gain and loss γ = 0, the reflection and axial -symmetric rhombic ring configurations reduce to an identical system. In Fig. 5c, we plots the reflection and transmission probabilities of a scattering centre in the absence of both gain and loss and magnetic flux, i.e., γ = 0, Φ = 0, we observe Hermitian scattering behavior of reciprocal reflection and transmission similar as γ = 0, Φ = π/2 shown in Fig. 3c. Notice that no spectral singularity emerges in the scattering of reflection -symmetric rhombic ring system. The system with Φ = 0 leads to input with wave vector k = π/2 both sides invisible that rL = rR = 0, tL = tR = 1 (black crosses in Fig. 4a–c); The system with Φ ≠ 0 leads to input with vector k = π/2 both sides opaque that rL = rR = 1, tL = tR = 0. For the input with wave vector k = π/2, the scattering behavior is very sensitive to the magnetic flux. (a) γ = 1/2, Φ = 0, (b) γ = 1/2, Φ = π/2, (c) γ = 0, Φ = 0. We investigate the reciprocal and unidirectional scattering of -symmetric structures. We show an insightful understanding of the symmetric scattering behavior, that is associated with the type of  symmetry, defined as the  symmetry of the connection sites on the -symmetric structures. We find that the axial (reflection)  symmetry leads to reciprocal reflection (transmission). The transmission (reflection) is unidirectional affected by the magnetic flux and gain/loss, this is because the magnetic flux induced nonreciprocal phase and the gain/loss break the  or  symmetry of the scattering centre. The results are further elucidated using a -symmetric rhombic ring structure with enclosed effective magnetic flux describing by tight-binding model. The physical realization of such scattering centre is possible in optical systems such as coupled waveguides array and coupled resonators. Notice that our conclusions are also applicable to the system with nonreciprocal tunnelling being unequal tunnelling amplitude60. We believe our findings may shed light on coherent light transport and would be useful for applications of quantum devices with inherent symmetry, in particular, for novel unidirectional optical device designs that not limited to optical diodes using synthetic -symmetric metamaterial. The input and output leads are described by two semi-infinite tight-binding chain. The left lead is , the right lead is , where  (aj) is the creation (annihilation) operator of the site j, the tunnelling between sites is uniform and set unity. The Hamiltonian of the scattering system is H = HL + Hc + HR. The eigenstate of the scattering system is set . For the axial -symmetric configuration shown in Fig. 1c, the Hamiltonian of the scattering system is . The Schrödinger equations  on the scattering centre yield four independent equations For the reflection -symmetric configuration shown in Fig. 1d, the Hamiltonian of the scattering centre is . Correspondingly, four independent equations from the Schrödinger equations  on the scattering centre are in form of where ϕ = Φ/4. The Schrödinger equations on the leads give the energy Ek = −2cosk for the input with wave vector k. Notice that k = π/2 in the reflection -symmetric rhombic ring with Φ = 2nπ  results in  and the transmissions are 1. Otherwise, k = π/2 in system with   leads to f−1 = f1 = 0 and the transmissions are 0. To calculate the reflection and transmission coefficients, we set the left side input wave functions equation (1) as and the right side input wave functions equation (2) as Substituting , , ,  of equations (24, 25, 26, 27, 28, 29, 30, 31) into equations (16, 17, 18, 19) and eliminating , , we get equations of rL, tL, rR, tR for the axial -symmetric rhombic ring configuration. Through directly algebraic calculation and simplification, we obtain the reflection and transmission coefficients rL, tL, rR, tR as functions of k, Φ, γ given in equations (10, 11, 12). Using the same procedure, we get the reflection and transmission coefficients for the reflection -symmetric rhombic ring configuration. After substituting , , ,  of equations (24, 25, 26, 27, 28, 29, 30, 31) into equations (20, 21, 22, 23) and eliminating , , we get equations of rL, tL, rR, tR. Through directly algebraic calculation and simplification, we obtain the reflection and transmission coefficients rL, tL, rR, tR as functions of k, Φ, γ given in equations (13, 14, 15). The scattering coefficients diverge at the spectral singularities, to calculate the scattering states, we have the wave functions of equation (1) replaced by , . Substituting , , ,  into equations (16, 17, 18, 19) of the axial -symmetric rhombic ring configuration, we obtain the coefficients satisfying ,  at the spectral singularities that i) k = π/2, ; and ii) Φ = π, . These indicate the scattering states are a self-sustained emission and a reflectionless absorption. How to cite this article: Jin, L. et al. Reciprocal and unidirectional scattering of parity-time symmetric structures. Sci. Rep. 6, 20976; doi: 10.1038/srep20976 (2016). Bender, C. M. & Boettcher, S. Real spectra in non-Hermitian Hamiltonians having symmetry. Phys. Rev. Lett. 80, 5243–5246 (1998). Article \n    ADS \n    MathSciNet \n    CAS \n    MATH \n    \n                    Google Scholar Bender, C. M., Brody, D. C. & Jones, H. F. Complex extension of quantum mechanics. Phys. Rev. Lett. 89, 270401 (2002). Article \n    MathSciNet \n    PubMed \n    MATH \n    CAS \n    \n                    Google Scholar Mostafazadeh, A. Pseudo-Hermiticity versus symmetry: The necessary condition for the reality of the spectrum of a non-Hermitian Hamiltonian. J. Math. Phys. 43, 205–214 (2002). Article \n    ADS \n    MathSciNet \n    MATH \n    \n                    Google Scholar Znojil, M. Spiked potentials and quantum toboggans. J. Phys. A: Math. Gen. 39, 13325–13336 (2006). Article \n    MathSciNet \n    MATH \n    \n                    Google Scholar Znojil, M. Scattering theory with localized non-Hermiticities. Phys. Rev. D 78, 025026 (2008). Article \n    ADS \n    MathSciNet \n    CAS \n    \n                    Google Scholar Klaiman, S., Günther, U. & Moiseyev, N. Visualization of branch points in -symmetric waveguides. Phys. Rev. Lett. 101, 080402 (2008). Article \n    ADS \n    MathSciNet \n    PubMed \n    MATH \n    CAS \n    \n                    Google Scholar Jin, L. & Song, Z. Solutions of -symmetric tight-binding chain and its equivalent Hermitian counterpart. Phys. Rev. A 80, 052107 (2009). Article \n    ADS \n    CAS \n    \n                    Google Scholar Joglekar, Y. N., Scott, D., Babbey, M. & Saxena, A. Robust and fragile -symmetric phases in a tight-binding chain. Phys. Rev. A 82, 030103(R) (2010) Article \n    ADS \n    CAS \n    \n                    Google Scholar Gong, J. & Wang, Q.-H. Geometric phase in -symmetric quantum mechanics. Phys. Rev. A 82, 012103 (2010). Article \n    ADS \n    MathSciNet \n    CAS \n    \n                    Google Scholar Scott, D. D. & Joglekar, Y. N. -symmetry breaking and ubiquitous maximal chirality in a -symmetric ring. Phys. Rev. A 85, 062105 (2012). Article \n    ADS \n    CAS \n    \n                    Google Scholar Gong, J. & Wang, Q.-H. Time-dependent -symmetric quantum mechanics. J. Phys. A: Math. Theor. 46, 485302 (2013). Article \n    MathSciNet \n    MATH \n    \n                    Google Scholar Zhu, B., Lü, R. & Chen, S. symmetry in the non-Hermitian Su-Schrieffer-Heeger model with complex boundary potentials. Phys. Rev. A 89, 062102 (2014). Article \n    ADS \n    CAS \n    \n                    Google Scholar Wang, X., Liu, T., Xiong, Y. & Tong, P. Spontaneous -symmetry breaking in non-Hermitian Kitaev and extended Kitaev models. Phys. Rev. A 92, 012116 (2015). Article \n    ADS \n    CAS \n    \n                    Google Scholar El-Ganainy, R., Makris, K. G., Christodoulides, D. N. & Musslimani, Z. H. Theory of coupled optical -symmetric structures. Opt. Lett. 32, 2632–2634 (2007). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Makris, K. G., El-Ganainy, R., Christodoulides, D. N. & Musslimani, Z. H. Beam dynamics in symmetric optical lattices. Phys. Rev. Lett. 100, 103904 (2008). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Guo, A. et al. Observation of -symmetry breaking in complex optical potentials. Phys. Rev. Lett. 103, 093902 (2009). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Rüter, C. E. et al. Observation of parity-time symmetry in optics. Nature Phys. 6, 192–195 (2010). Article \n    ADS \n    CAS \n    \n                    Google Scholar Chong, Y. D., Ge, L., Cao, H. & Stone, A. D. Coherent perfect absorbers: Time-reversed lasers. Phys. Rev. Lett. 105, 053901 (2010). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Longhi, S. -symmetric laser absorber. Phys. Rev. A 82, 031801(R) (2010). Article \n    ADS \n    CAS \n    \n                    Google Scholar Hasan, M., Ghatak, A. & Mandal, B. P. Critical coupling and coherent perfect absorption for ranges of energies due to a complex gain and loss symmetric system. Ann. Phys. (NY) 344, 17–28 (2014). Article \n    ADS \n    CAS \n    MATH \n    \n                    Google Scholar Regensburger, A. et al. Parity-time synthetic photonic lattices. Nature 488, 167–171 (2012). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Jing, H. et al. -symmetric phonon laser. Phys. Rev. Lett. 113, 053604 (2014). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Feng, L., Wong, Z. J., Ma, R.-M., Wang, Y. & Zhang, X. Single-mode laser by parity-time symmetry breaking. Science 346, 972–975 (2014). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Hodaei, H., Miri, M.-A., Heinrich, M., Christodoulides, D. N. & Khajavikhan, M. Parity-time-symmetric microring lasers. Science 346, 975–978 (2014). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Peng, B. et al. Parity-time-symmetric whispering-gallery microcavities. Nature Phys. 10, 394–398 (2014). Article \n    ADS \n    CAS \n    \n                    Google Scholar Peng, B., Özdemir, S. K., Chen, W., Nori, F. & Yang, L. What is and what is not electromagnetically induced transparency in whispering-gallery microcavities. Nat. Commun. 5, 5082 (2014). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Chang, L. et al. Parity-time symmetry and variable optical isolation in active-passive-coupled microresonators. Nature Photon. 8, 524–529 (2014). Article \n    ADS \n    CAS \n    \n                    Google Scholar Jing, H. et al. Optomechanically-induced transparency in parity-time-symmetric microresonators. Sci. Rep. 5, 9663 (2015). Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Zhang, J. et al. Giant nonlinearity via breaking parity-time symmetry: A route to low-threshold phonon diodes. Phys. Rev. B 92, 115407 (2015). Article \n    ADS \n    CAS \n    \n                    Google Scholar Mostafazadeh, A. Spectral singularities of complex scattering potentials and infinite reflection and transmission coefficients at real energies. Phys. Rev. Lett. 102, 220402 (2009). Article \n    ADS \n    PubMed \n    CAS \n    \n                    Google Scholar Longhi, S. Spectral singularities and Bragg scattering in complex crystals. Phys. Rev. A 81, 022102 (2010). Article \n    ADS \n    CAS \n    \n                    Google Scholar Mostafazadeh, A. Optical spectral singularities as threshold resonances. Phys. Rev. A 83, 045801 (2011). Article \n    ADS \n    CAS \n    \n                    Google Scholar Ghatak, A., Nathan, J. A., Mandal, B. P. & Ahmed. Z. Spectral singularity and reflectionlessness in non-Hermitian (complex) Ginocchio potential. J. Phys. A: Math. Theor. 45, 465305 (2012). Article \n    MathSciNet \n    MATH \n    \n                    Google Scholar Mostafazadeh, A. Nonlinear spectral singularities for confined nonlinearities. Phys. Rev. Lett. 110, 260402 (2013). Article \n    ADS \n    PubMed \n    CAS \n    \n                    Google Scholar Mostafazadeh, A. Nonlinear spectral singularities of a complex barrier potential and the lasing threshold condition. Phys. Rev. A 87, 063838 (2013). Article \n    ADS \n    CAS \n    \n                    Google Scholar Ramezani, H., Li, H.-K., Wang, Y. & Zhang, X. Unidirectional spectral singularities. Phys. Rev. Lett. 113, 263905 (2014). Article \n    ADS \n    PubMed \n    CAS \n    \n                    Google Scholar Lin, Z. et al. Unidirectional invisibility induced by -symmetric periodic structures. Phys. Rev. Lett. 106, 213901 (2011). Article \n    ADS \n    PubMed \n    CAS \n    \n                    Google Scholar Feng, L. et al. Experimental demonstration of a unidirectional reflectionless parity-time metamaterial at optical frequencies. Nature Mater. 12, 108–113 (2013). Article \n    ADS \n    CAS \n    \n                    Google Scholar Longhi, S. Invisibility in non-Hermitian tight-binding lattices. Phys. Rev. A 82, 032111 (2010). Article \n    ADS \n    CAS \n    \n                    Google Scholar Longhi, S. A unidirectionally invisible -symmetric complex crystal with arbitrary thickness. J. Phys. A: Math. Theor. 47, 485302 (2014). Article \n    ADS \n    MathSciNet \n    MATH \n    \n                    Google Scholar Mostafazadeh, A. Invisibility and symmetry. Phys. Rev. A 87, 012103 (2013). Article \n    ADS \n    CAS \n    \n                    Google Scholar Mostafazadeh, A. Unidirectionally invisible potentials as local building blocks of all scattering potentials. Phys. Rev. A 90, 023833 (2014). Article \n    ADS \n    CAS \n    \n                    Google Scholar Mostafazadeh, A. Active invisibility cloaks in one dimension. Phys. Rev. A 91, 063812 (2015). Article \n    ADS \n    CAS \n    \n                    Google Scholar Lin, Z., Schindler, J., Ellis, F. M. & Kottos, T. Experimental observation of the dual behavior of -symmetric scattering. Phys. Rev. A 85, 050101(R) (2012). Article \n    ADS \n    CAS \n    \n                    Google Scholar Kalish, S., Lin, Z. & Kottos, T. Light transport in random media with symmetry. Phys. Rev. A 85, 055802 (2012). Article \n    ADS \n    CAS \n    \n                    Google Scholar Ahmed, Z. Reciprocity and unitarity in scattering from a non-Hermitian complex -symmetric potential. Phys. Lett. A 377, 957–959 (2013). Article \n    ADS \n    MathSciNet \n    CAS \n    MATH \n    \n                    Google Scholar Mostafazadeh, A. Generalized unitarity and reciprocity relations for -symmetric scattering potentials. J. Phys. A: Math. Theor. 47, 505303 (2014). Article \n    MathSciNet \n    MATH \n    \n                    Google Scholar Li, X. Q., Zhang, X. Z., Zhang, G. & Song, Z. Asymmetric transmission through a flux-controlled non-Hermitian scattering center. Phys. Rev. A 91, 032101 (2015). Article \n    ADS \n    CAS \n    \n                    Google Scholar Cannata, F., Dedonder, J.-P. & Ventura, A. Scattering in -symmetric quantum mechanics. Ann. Phys. (NY) 322, 397–433 (2007). Article \n    ADS \n    MathSciNet \n    CAS \n    MATH \n    \n                    Google Scholar Longhi, S. Aharonov-Bohm photonic cages in waveguide and coupled resonator lattices by synthetic magnetic fields. Opt. Lett. 39, 5892–5895 (2014). Article \n    ADS \n    PubMed \n    \n                    Google Scholar Fang, K., Yu, Z. & Fan, S. Photonic Aharonov-Bohm effect based on dynamic modulation. Phys. Rev. Lett. 108, 153901 (2012). Article \n    ADS \n    PubMed \n    CAS \n    \n                    Google Scholar Li, E., Eggleton, B. J., Fang, K. & Fan, S. Photonic Aharonov-Bohm effect in photon-phonon interactions. Nat. Commun. 5, 3225 (2013). Article \n    ADS \n    CAS \n    \n                    Google Scholar Fang, K. & Fan, S. Effective magnetic field for photons based on the magneto-optical effect. Phys. Rev. A 88, 043847 (2013). Article \n    ADS \n    CAS \n    \n                    Google Scholar Fang, K., Yu, Z. & Fan, S. Realizing effective magnetic field for photons by controlling the phase of dynamic modulation. Nature Photon. 6, 782–787 (2012). Article \n    ADS \n    CAS \n    \n                    Google Scholar Chong, Y. D. & Liang, G. Q. Optical resonator analog of a two-dimensional topological insulator. Phys. Rev. Lett. 110, 203904 (2013). Article \n    ADS \n    PubMed \n    CAS \n    \n                    Google Scholar Hafezi, M. Synthetic gauge fields with photons. Inter. J. Mod. Phys. B 28, 1441002 (2014). Article \n    ADS \n    MathSciNet \n    \n                    Google Scholar Jin, L. & Song, Z. Hermitian scattering behavior for a non-Hermitian scattering center. Phys. Rev. A 85, 012111 (2012). Article \n    ADS \n    CAS \n    \n                    Google Scholar Zhang, X. Z., Jin, L. & Song, Z. Self-sustained emission in semi-infinite non-Hermitian systems at the exceptional point. Phys. Rev. A 87, 042118 (2013). Article \n    ADS \n    CAS \n    \n                    Google Scholar Zhang, G., Li, X. Q., Zhang, X. Z. & Song, Z. Transmission phase lapse in the non-Hermitian Aharonov-Bohm interferometer near the spectral singularity. Phys. Rev. A 91, 012116 (2015). Article \n    ADS \n    MathSciNet \n    CAS \n    \n                    Google Scholar Zhang, X. Z. & Song, Z. Momentum-independent reflectionless transmission in the non-Hermitian time-reversal symmetric system. Ann. Phys. (NY) 339, 109–121 (2013). Article \n    ADS \n    MathSciNet \n    CAS \n    MATH \n    \n                    Google Scholar Download references This work is partly supported by the National Basic Research Program (973 Program) of China (Grant No. 2012CB921900). L.J. also appreciates the support of Nankai University Baiqing Plan foundation (Grant No. ZB15006104). X.Z.Z. also appreciates the support of National Natural Science Foundation of China (Grant No. 11505126) and PhD research startup foundation of Tianjin Normal University (Grant No. 52XB1415). Z.S. also appreciates the support of CNSF (Grant No. 11374163). Nankai University, School of Physics, 300071, Tianjin, P. R. China L. Jin, G. Zhang & Z. Song Tianjin Normal University, College of Physics and Materials Science, 300387, Tianjin, P. R. China X. Z. Zhang You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar L.J. conceived the idea, carried out the study. Z.S. supervised the project. L.J. wrote the manuscript with helpful suggestions from X.Z.Z., G.Z. and Z.S. All authors discussed the results and reviewed the manuscript. Correspondence to\n                L. Jin. The authors declare no competing financial interests. This work is licensed under a Creative Commons Attribution 4.0 International License. The images or other third party material in this article are included in the article’s Creative Commons license, unless indicated otherwise in the credit line; if the material is not included under the Creative Commons license, users will need to obtain permission from the license holder to reproduce the material. To view a copy of this license, visit http://creativecommons.org/licenses/by/4.0/ Reprints and Permissions Jin, L., Zhang, X., Zhang, G. et al. Reciprocal and unidirectional scattering of parity-time symmetric structures.\n                    Sci Rep 6, 20976 (2016). https://doi.org/10.1038/srep20976 Download citation Received: 05 November 2015 Accepted: 14 January 2016 Published: 15 February 2016 DOI: https://doi.org/10.1038/srep20976 Anyone you share the following link with will be able to read this content: Sorry, a shareable link is not currently available for this article.  Provided by the Springer Nature SharedIt content-sharing initiative Nonlinear Dynamics (2021) By submitting a comment you agree to abide by our Terms and Community Guidelines. If you find something abusive or that does not comply with our terms or guidelines please flag it as inappropriate. Advertisement Scientific Reports (Sci Rep)\n                \n\nISSN 2045-2322 (online) © 2023 Springer Nature Limited Sign up for the Nature Briefing newsletter — what matters in science, free to your inbox daily. ",
    "datetime": null,
    "url": "https://www.nature.com/articles/srep20976"
}