{
    "title": "Red Velvet’s ‘Russian Roulette’ Brings K-Pop Group to New Peak on World Digital Songs | Billboard – Billboard",
    "text": "With a return to their \"red\" side, Red Velvet also return to the top of the charts thanks to their latest release 'Russian Roulette.' By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin With a return to their “red” side, Red Velvet also return to the top of the charts thanks to their latest release Russian Roulette. Red Velvet & Bobby Kick Off K-Pop’s Wave of September Releases As opposed to showing off their “velvet,” ballad-leaning tendencies like on “One of These Nights” earlier this year, the cutesy-quirky girl group went in a synth-pop direction for their Russian Roulette EP with its title track bringing them to a new peak on Billboard‘s World Digital Songs chart. “Russian Roulette” debuts at No. 2 on World Digital Songs, marking the best entry for the quintet to date. The girls had previously charted as high as No. 3 with their 2015 singles “Ice Cream Cake” and “Dumb Dumb.” While those aforementioned 2015 releases brought straight-forward, in-your-face bubblegum, “Russian Roulette” brings a different flavor, incorporating 8-bit- and arcade-inspired sounds into the mix. The new The group brings repetitive, nearly robotic-like hooks that are just as addicting as their past bangers.Russian Roulette also brings the K-pop outfit to the World Albums chart, where they debut at No. 2 on the chart. So far, Red Velvet has sent all of their EPs and albums to the chart including 2016 EP The Velvet (which peaked at No. 8), 2015 EP Ice Cream Cake (No. 2) and their first full-length album The Red from 2015 (which reigned at No. 1). Red Velvet Talk First U.S. Performance, Their New Member: Exclusive It’s also a new peak for the group on the Heatseekers Albums chart where the EP starts at No. 18. The Heatseekers chart sees much less K-pop entries compared to World Albums and the new peak indicates promise in an increasingly interseted U.S. audience. Previously, the group had sent both Ice Cream Cake and The Red releases to the tally, both of which peaked at No. 24. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t09/14/2016 Watch Red Velvet bring “Russian Roulette” to life in the live performance below: Daily newsletters straight to your inbox Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2016-09-14T23:50:31+00:00",
    "url": "https://www.billboard.com/pro/red-velvet-russian-roulette-world-digital-songs-albums-chart/"
}