{
    "title": "Red Velvet & Bobby Kick Off K-Pop’s Wave of September Releases | Billboard – Billboard",
    "text": "After a few weeks of quiet, K-pop woke up this week in a big way through some sweet synthpop and swaggering rap. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tTamar Herman Like the lazy final days of summer, the Korean music scene slowed down a bit last month as artists prepped for the onslaught of September. While acts like CL, EXO, I.O.I, VIXX, NCT Dream, BlackPink, and Girls’ Generation all released new music last month, August was relatively quiet ahead of September, which is traditionally one of the K-pop scene’s busiest seasons. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news Blackpink’s Major Debut: New K-Pop Girl Group Lands No. 1 & 2 on World Digital Songs Chart Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t09/07/2016 Things went into full swing on Sept. 6 (Sept. 7 in South Korea) when the ladies of Red Velvet and iKON’s Bobby released brand-new music to usher in the upcoming rush of releases from some of K-pop’s most popular acts.  8 Most Promising K-Pop Debuts From the First Half of 2016 Following up last year’s brassy hit “Dumb Dumb,” the doll-esque quintet returned to slay the hearts of fans with their bubblegum technopop single. While a bit more saccharine than their typical sound, “Russian Roulette” was accompanied by a bubbly, athletic-themed music video that offered fun times for all as a murderous ode to The Simpsons’ impish duo Itchy and Scratchy and killing your friends for the sake of love. Or just for fun, it’s not quite clear. Red Velvet Explores Their Velvety Side With ‘One of These Nights’ The single is the title track off of their latest EP, an upbeat “red”-oriented album that followed March’s smoother The Velvet. The paired album concepts play up the dichotomy of the group’s name; “Red” usually characterizes their more upbeat pop releases while “Velvet” embodies their smoother R&B sound, both of which are characteristic of Red Velvet’s increasingly diverse musicality and style.   The same day as Russian Roulette came out, rapper Bobby released the first single from his collaborative MOBB project with WINNER’s Song Mino. After gaining fame through television appearances and a variety of collaborations, “Holup!” is Bobby’s first solo track since he debuted as a member of iKON last year. The song is a hip-hop banger that livens things up through Bobby’s gruff rap style and his bombastic lyrics. Built to liven up a party, “Holup!” features wailing horns and a pounding, building beat that will have everyone dancing. It’s the first song from the MOBB collaboration and will be followed by Song Mino’s solo “Body” on Sept. 8, the pair’s “Hit Me” and “Full House” the next day. While the pair are from different groups, they’re both housed under YG Entertainment. It is the first intergroup project since WINNER debuted in 2014 and iKON joined the scene in 2015.  “Holup!” and “Russian Roulette” went to the top of the U.S. iTunes K-pop chart, battling it out for the top spot upon their releases, but it’s unclear whether either song will be able to dominate for long with the overflow of K-pop this September. Along with Red Velvet and MOBB, this week will also see a return from Brown Eyed Girls’ Gain with her End Again EP on Sept. 9. After making waves last year with her religiously colored Hawwah, all eyes are on the controversial soloist to see what she does next. SHINee Talk Upcoming Projects & How EDM Is Influencing K-Pop Artists at KCON LA 2016  The following week will see new music from the charismatic boy band 2PM as they drop their sixth album, Gentlemen’s Game, on Sept. 13 following last year’s No. 5. And retro-pop with an orchestral twist will likely come into play on Sept. 19 when INFINITE releases their first Korean album of 2016, their sixth EP INFINITE Only.  The rest of the month will be filled with comebacks from high profile K-pop boy bands like SHINee, GOT7, BTOB, B1A4, must-watch rookies KNK, and ‘90s icons Sechs Kies. And, although they haven’t announced any dates, BTS has been teasing fans with cinematic videos for their Wings project. Korean Boy Band GOT7 Discusses Breaking Records, Selling Out Shows & Dabbing  And while the month is pretty testosterone-dominated, girl groups like T-ara, who was declared the winners of Billboard’s Fan Army Face-Off earlier this month, sweet APink, DIA (who are teasing fans with a Harry Potter-inspired concept), and quirky Crayon Pop all announced upcoming returns. Soloists Ailee and Secret member Song Jieun also reportedly have plans for new music over the next few weeks, but with K-pop’s fast-paced release calendar it’s likely that September will hold a few surprises. Here’s to a busy month! Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2016-09-07T16:32:57+00:00",
    "url": "https://www.billboard.com/music/music-news/red-velvet-bobby-k-pop-september-releases-7502685/"
}