{
    "title": "Red Velvet Discuss Their Musical Identity and Headlining SXSW’s K-Pop Night Out – Billboard",
    "text": "Red Velvet spoke Billboard to discuss their latest album 'Rookie,' headlining K-pop Night Out at SXSW, and what they'd like to pursue in the future. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tTamar Herman Hours before making their SXSW debut at the fifth annual K-pop Night Out showcase, Red Velvet lounged about The Belmont after finishing their sound check. The headliners for the event, the K-pop quintet is one of the genre’s most prominent young acts, and artistic innovators leading a new wave of Korean girl groups. Later that night, they’d press through technical difficulties — and member Irene leaving the stage temporarily to fix an audio issue — to perform some of their recent hits (“Russian Roulette,” “Rookie,” “Dumb Dumb”) and two B-sides (“Something Kinda Crazy,” “Fool”), all of which evoked riotous cheers from the crowd. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tRed Velvet\t\t\n\t\t\t\t\t\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news Propelled by their infectious “Red” pop songs and their “Velvet” R&B tunes and ballads, Red Velvet’s seen multiple tracks and albums appear on a variety of Billboard charts since their debut in 2014. Their most recent EP Rookie, which showcased the group’s versatility through songs like the whimsical “Happily Ever After” and the ethereal “Body Talk,” peaked to No. 1 on the World Albums chart upon its release in February. Irene, Wendy, Seulgi, Joy, and Yeri sat down with Billboard to discuss their music, performances at SXSW, and what they’d like to pursue in the future. Welcome to the U.S.! How does it feel to be here at SXSW? Seulgi (through translator): It’s our first time coming to Texas, and we’re especially honored to perform at SXSW. Today we will deliver the best performance possible to captivate our fans. Red Velvet’s only here for a short while since you’re performing at KCON Mexico tomorrow, but is there anything you want to do while you’re here? Yeri (through translator): I looked up online to see what there is to do in Texas and I want to eat steak if there’s time. [Laughs.]  You recently released Rookie, and the single is doing really well in Korea. How does it feel? Irene (through translator): “Rookie” is still receiving a lot of love and ranking high on Korean charts, even though we finished promoting it in February, so we’re really happy for all of the love from our fans.  Wendy: We compare our lover to a rookie and we want to mesmerize people with our song. People actually loved our song and we’re very thankful about it [still charting well in Korea]. Why do you think people like Red Velvet’s funky, quirky style so much? Seulgi: I think, and actually heard from our fans, that listeners get energized by our songs. And because of our various music styles, everyone can find something they enjoy regardless of their age and gender. You’re under SM Entertainment, which houses other popular girl groups (Girls’ Generation and f(x)). What differentiates Red Velvet from other SM acts? Wendy: Each of us has our own talents and that adds up to [us] as one and that’s what becomes a group, as Red Velvet. We make up songs that are different than theirs. I don’t know how to explain this. Even though we do the same genres, it’s different. If you listen to it, you can feel it within your heart that it’s different. But each of us has different talents and we have different ways that we sing our music styles, and that adds up to one thing and that makes up Red Velvet. Red Velvet definitely already has a clear musical identity, but are there any other styles or concepts you’d like to try? Wendy: Girl crush, kind of? Can you explain the idea of a ‘girl crush’ musical concept? W: Oh that’s like a Korean thing? [Laughs.] I want us to wear a suit with a fedora hat. You can kind of think of [Girls’ Generation’s] “Mr.Mr” but more manly. So agendered, maybe? Wendy: Yes. But then the vocal style would be sexy. You know what I’m saying?  Joy (through translator): For me, maybe something like Christina Aguilera’s “Candyman.” Seulgi:- Beyoncé! Like “Single Ladies” or “Run the World (Girls).” I was especially very moved by the stage performances of “Run the World.” Beyonce is absolutely the best. I want to try new styles inspired by her. How about your favorite Red Velvet songs? Yeri: “Rookie” is the best so far. Joy: I like “Russian Roulette” the most. Seulgi: “Rookie” was the most fun project until now for me. Wendy: “Ice Cream Cake,” because that’s when Yeri came in. (Yeri [in English]: Ooh! Thank you.) Irene: “Wish Tree,” our seasonal song that’s a good fit for the Christmas season. Please listen to it. It’s a great song.  Though Sistar’s Hyolyn is also performing, you’re the only K-pop idol group performing at SXSW alongside some hip hop and rock acts. How do you think K-pop fits into SXSW? Yeri: We heard that we are the only idol group performing at SXSW this time. It’s such an honor to share the stage with the such legendary acts like Tiger JK and Yoonmirae. We will do our best to show our distinctive, youthful sound and energetic style. You’re even headlining, so that’s pretty exciting! Wendy: I think we’re like the decorations at the end. [Laughs] The sprinkles on top. What else can we look forward to from Red Velvet throughout the rest of the year? Yeri: About a month has passed since we completed our Rookie album activities, so there are no plans yet for our next album but we’re focusing on individual projects. We are also hoping to meet more of our overseas fans. Anything else you’d like to say to Billboard’s audience? Yeri: Our “Rookie” song is very fun so please check it out. It’s very addictive and you will be able to easily sing along. We want to come to meet our fans more often. Thank you so much for loving Red Velvet. We love you.  Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2017-03-20T18:45:05+00:00",
    "url": "https://www.billboard.com/music/music-news/red-velvet-headlining-sxsw-k-pop-night-out-interview-7728798/"
}