{
    "title": "Red-Hot Korean Celebrity Suzy Bae Makes Special Appearance at Madame Tussauds Hong Kong to Unveil World-First Wax Figure of Herself",
    "text": "HONG KONG, CHINA--(Marketwired - Sep 13, 2016) - Best known for her roles in the recent hot Korean TV drama Uncontrollably Fond, movie Architecture 101 and song Bad Girl, Good Girl, popular Korean star Suzy Bae is ready for a red-carpet entry to Madame Tussauds Hong Kong. Followed by Korean heartthrob Kim Soo-hyun, model-turned-actor Lee Jong-suk and few red-hot Korean celebrities, Suzy Bae will be the first female Korean star arriving our attraction. Madame Tussauds Hong Kong also invited a few of Suzy's lucky fans to meet Suzy in the ceremony. Despite capturing hearts across Asia, Suzy remained personable as ever, flashing a warm smile and greeting media at the unveiling ceremony in Cantonese. Sporting a white backless mini dress with high heels, the extremely lifelike wax figure shows off the celebrity's impeccable fashion-model physique. Bae revealed that her wax figure's dynamic pose expresses her active spirit and youthful personality, whereas her ''heart'' sign is meant to impart a positive attitude among visitors. Madame Tussauds Hong Kong also custom made a mini figure for Suzy as souvenir. Suzy Bae said: \"I am extremely proud to have a wax figure of myself and excite to be the first female Korean star placed with top celebrities around the world at Madame Tussauds Hong Kong. Appreciate the professional studio team gave me a memorable experience and spent a lone time for sitting process with me to ensure the final wax figure to be perfection. Ms. Jenny You, General Manager of Madame Tussauds Hong Kong, said: \"Korean popular culture is trend-setting and highly popular. The arrival of the first female Korean star, Suzy Bae at Madame Tussauds Hong Kong will definitely strengthen the star power of our K-Wave zone.\" Madame Tussauds Hong Kong's K-wave Zone, the first K-pop themed zone in Madame Tussauds worldwide, is also home to other Korean celebrities including: Siwon Choi, member of Super Junior; U-Know Yun-ho and Max Changmin from TVXQ!, often dubbed \"Beast Idol\"; Nichkhun Horvejkul, singer and rapper from boy band 2PM; and Bae Yong-joon, best known for his role in the drama Winter Sonata. Image  Suzy Bae and her world-first wax figure. http://release.media-outreach.com/i/Download/5607 http://release.media-outreach.com/i/Download/5608 Madame Tussauds Hong Kong presents Suzy with a custom-made mini figure. http://release.media-outreach.com/i/Download/5609 Logo http://release.media-outreach.com/i/Download/1452 Image Available: http://www2.marketwire.com/mw/frame_mw?attachid=3055214 Image Available: http://www2.marketwire.com/mw/frame_mw?attachid=3055217 Image Available: http://www2.marketwire.com/mw/frame_mw?attachid=3055220 ",
    "datetime": null,
    "url": "http://finance.yahoo.com/news/red-hot-korean-celebrity-suzy-115541117.html"
}