{
    "title": "Remembering Kim Jong-hyun, Shining Star of K-pop – Chicago Maroon",
    "text": "It is often with a tinge of embarrassment that people like me announce their love for K-pop, always caveating their confession with explanations like “I came across such-and-such boy-band when I was in middle school,” or “it was all the rage those days.” Liking K-pop seems to announce certain things you privilege in music consumption that may deserve criticism: ostensibly formulaic hits and very attractive people of all gender expressions who dance and smolder at the camera and their ever-attentive fans. The criticism isn’t totally unfounded, either; Korean entertainment companies have long micromanaged their fledgling artists, enforcing a brutal performance training regime long before the so-called idols’ debut, and limiting the artists’ agency in all aspects ranging from their love lives to the artistic freedom they could wield in producing their albums. What these companies produce are pure commodities of a particular, fail-safe ilk that would capture the imaginations of young people everywhere, using chart-topping hits and appearances on variety shows to secure their patronage. There has not been enough reporting on how much the K-pop market has been deftly exploited for the gain of companies like SM Entertainment. I bring all this up to contextualize just how much a loss to music it is that one of its brightest and most ambitious stars, Kim Jong-hyun, committed suicide just days ago on December 18, at the age of 27. The K-pop star, better known as Jonghyun, debuted with the contemporary R&B and pop quintet Shinee (stylized as SHINee and pronounced “shiny”) back in 2008, when the Internet had suddenly become an indispensable tool for any self-respecting music lover. I was a sad Twilight-reading middle-schooler in sweltering Hong Kong, and when I came across their first EP Replay (the first one to sing in the video is Jonghyun), I was completely hooked. Prior to being into Shinee I hadn’t truly explored music, or become cognizant of its effects on me. Yet as I read more interviews and reviews of their EPs and albums, I began learning about music and the music industry itself—especially individual members’ musical influences. Jonghyun, who insisted on playing an instrumental role in producing and penning Shinee’s music, openly talked about how much he liked Stevie Wonder. I got into R&B that way. Shinee was one of the SM Entertainment-backed groups that kickstarted the hallyu wave (lit. Korean Wave), ensuring Korea’s status as an influential exporter of cultural commodities almost a decade later. It most certainly helped that the Korean entertainment industry provided the funds for the level of advertising needed for such a venture, and to give SM Entertainment any more credit than being the sponsors for the five singers’ debut is to ignore the sheer amount of talent Jonghyun and his cohort have. I’m not just talking about their singing and dancing abilities: Shinee has consistently put out relatively more interesting projects than the rest of first-wave hallyu idols, including “View,” penned by Jonghyun, that brought house to K-pop. Jonghyun produced almost single-handedly his first solo album, which I still consider one of the most interesting pop projects of 2016. All this is also to say that Jonghyun, the rest of Shinee, and their experimentation with genre were imperative to the vocabulary I developed for music criticism. Jonghyun died in part due to an industry that refuses to allow artists to develop for their own selves, an industry that commands the attention of young consumers everywhere because every move made by a K-pop idol is calibrated for maximum profit. So here is a description of Jonghyun that I hope will not be overshadowed by the specter of capital: He was a singer-songwriter, composer, and producer. He loved The Neptunes and James Brown. He loved funk and experimenting with genres in whatever ways he could to produce music that could sell records but also express individuality. He was a quiet supporter of LGBTQ+ rights in Korea, which earned him the wrath and ire of the ultra-conservative. He was anxious about cameras, but loved his radio show. At the end of his life, his success made him lonely and self-loathing, but he was truly loved by many. May he rest in peace. Your donation will support the student journalists of University of Chicago. Your contributions go towards our annual website hosting costs and equipment costs. Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email *  Dee Thomas\t\t\t\t\t\t\t\t\t / \t\t\t\t\t\t\t\t\tSep 20, 2022 at 2:47 pm I became aware of this talented young man this year. I was at a loss, because there was no information. His music is beautiful and relevant. It will fit in as the years go by. He was ahead of his time. I wished I could have met him. ",
    "datetime": null,
    "url": "https://chicagomaroon.com/25225/arts/remembering-kim-jong-hyun-shining-star-k-pop/"
}