{
    "title": "Resmi Dibuka, Korean Wave Berlangsung 4 Hari di Sleman City Hall",
    "text": "Advertisement Advertisement Harianjogja.com, SLEMAN—Menyemarakkan milad ke-25, Solopos Media Group menyapa generasi muda Jogja melalui Korean Wave di Sleman City Hall (SCH), Kamis hingga Minggu (22-25/9/2022). Terdapat banyak kegiatan dan perlombaan menarik yang bisa diikuti para pencinta budaya Korea. Mengangkat tema Greet The Cultures, Be The Citizens of The World, gelaran ini merupakan yang kedua kalinya setelah Korean Wave pertama diselenggarakan pada Mei 2022 lalu di Solo Grand Mall. Selain menampilkan aneka aktivitas berbau Korea, acara ini juga dimeriahkan dengan sejumlah stan makanan maupun fashion. Advertisement Senior Manager Solopos Media Group, Alfari Kunto, menjelaskan Korean Wave menampikan semua yang berkaitan dengan budaya korea. “Kami juga ingin mengenalkan budaya korea yang tidak hanya biasa dilihat oleh anak muda sekarang,” ujarnya dalam pembukaan Korean Wave, Kamis (22/9/2022). Ia menilai budaya Korea memiliki pendukung fanatik di Indonesia, sehingga diharapkan Korean Wave ini dapat berjalan dengan meriah dan dinikmati masyarakat luas. “Daripada anak muda keluar tidak jelas, diarahkan ke sini agar ikut memeriahkan,” katanya. General Manager SCH, Deni Sastra Wijaya, mengapresiasi dan merasakan sebuah kehormatan menjadi tuan rumah Korean Wave. “Salah satu festival budaya terbesar di Jogja dan Jawa Tengah. Event kolaborasi ini merupakan langkah bersama memberikan ruang bagi remaja dan penggemar budaya korea untuk berkreasi dan berekspresi,” ungkapnya. SCH sebagai salah satu pusat perbelanjaan di Jogja saat ini sudah dikenal dengan istilah mall of event dan mall of community. “Kami selalu memberi support dan tempat untuk rekan-rekan komunitas apapun untuk bisa berekspresi di tempat ini, dengan harapan dapat mengembangkan diri mereka, termasuk saat ini komunitas k-pop,” kata dia. Kepala Dinas Pemuda dan Olahraga (Dispora) Sleman, Agung Armawanta, menuturkan budaya Korea sudah lama masuk di tengah mayarakat Indonesia. Ia mendukung kegiatan ini karena menjadi wadah generasi muda berekspresi melalui budaya Korea. Korean Wave juga mengundang keluarga berbelanja di SCH sehingga menggerakkan perekonomian. BACA JUGA: Ada Kenaikan Harga, Berikut Daftar Terbaru Tiket Head In The Clouds Jakarta 2022 Ia mengingatkan juga generasi muda harus tetap menjaga dan melestarikan budaya tradisionalnya sendiri. “Jangan sampai warna lokalnya tergerus hilang,” ujarnya. Beberapa perlombaan meramaikan Korean Wave seperti dance cover competition, sing cover competition, hangeul competition, fandom fanchant competition, mukbang competition, dan masih banyak lagi, dengan total hadiah senilai Rp10 juta. Tak hanya perlombaan, beberapa kegiatan juga meramaikan Korean Wave, seperti demo kopi dari Homwok Kopi, talkshow tentang makanan Korea dan norabang atau karaoke ala Korea menggunakan DJ performance. Cek Berita dan Artikel yang lain di Google News Advertisement Advertisement Advertisement Advertisement Advertisement  Advertisement Advertisement Advertisement Advertisement Advertisement ",
    "datetime": null,
    "url": "https://m.harianjogja.com/jogjapolitan/read/2022/09/22/512/1112594/resmi-dibuka-korean-wave-berlangsung-4-hari-di-sleman-city-hall"
}