{
    "title": "Riding high on K-Wave- The New Indian Express",
    "text": "While the central government is strongly pushing the message of an Aatmanirbhar Bharat, it cannot be denied that there’s still an innate longing for products from abroad. Published: 22nd  January 2021 09:28 AM  |  \n      \n         Last Updated: 22nd  January 2021 09:28 AM\n\n  |  A+A A- Korean skincare and Ramen Noodles are a hit with Indian K product enthusiasts While the central government is strongly pushing the message of an Aatmanirbhar Bharat, it cannot be denied that there’s still an innate longing for products from abroad. That being said, Indians are increasingly looking East, rather than the West, for their retail fix. We spoke to Seo Young-doo, CEO and Founder, Korikart, a Delhi-based e-commerce brand that imports a huge range of products from Korea and does not involve any middlemen which helps them to offer the best price to its customers. South Korean culture and brands have become popular, with especially young people. How big is India’s market share in this global phenomenon?\nIf we specifically talk about Korean cosmetics, according to a survey conducted by Rakuten Insight, about 39 per cent of Indian respondents who were women said that their skincare routine consisted of 25 per cent of K-beauty products. What areas in India have the most demand for Korean products? \nAlthough the major consumption is seen in cities like Delhi, Mumbai and parts of South India, small cities in North East such as Assam, Meghalaya, Sikkim, Arunachal Pradesh, Tripura, Mizoram, and Nagaland are fond of Korean beauty products mainly due to their familiarity with Korean culture and K-Pop stars. As the Korean Wave makes its way across India, we expect the smaller cities of the country to be responsive to K-beauty products as well. Places in Bihar, Uttar Pradesh are also getting influenced by Korean Wave as we have observed growing consumption in these areas. What K-products see the highest volumes in sales?\nKorean skincare products and Ramen Noodles are among the most favourite products with Indian K-products enthusiasts. Our innovative Vitamin Shower Filter is also very popular in India. The product not only removes water impurities, but also balances moisture and adds fragrance. How do Korean products compete in a market that is going Vocal for Local?\nWhile vocal for local is a hit in India, with boycott on Chinese products, the Korean market with the growing popularity of K-pop in India, is further strengthened with Korean products in India. In the beginning of the pandemic, growth was slow, but now Korikart is gaining momentum with 40-60 per cent growth on a monthly basis. Follow The New Indian Express channel on WhatsApp O\n    P\n    E\n    N Comments  Disclaimer : We respect your thoughts and views! But we need to be judicious while moderating your comments. All the comments will be moderated by the newindianexpress.com editorial. Abstain from posting comments that are obscene, defamatory or inflammatory, and do not indulge in personal attacks. Try to avoid outside hyperlinks inside the comment. Help us delete comments that do not follow these guidelines. The views expressed in comments published on newindianexpress.com are those of the comment writers alone. They do not represent the views or opinions of newindianexpress.com or its staff, nor do they represent the views or opinions of The New Indian Express Group, or any entity of, or affiliated with, The New Indian Express Group. newindianexpress.com reserves the right to take any or all comments down at any time. The Morning Standard | Dinamani |  Kannada Prabha |  Samakalika Malayalam | Cinema Express  |   Indulgexpress  |  Edex Live  | Events Xpress Contact Us | \nAbout Us | Privacy Policy | \nTerms of Use | Home |  Nation |  World |  Cities |  Business |  Columns |  Entertainment |  Sport |  Magazine |  The Sunday Standard Copyright - newindianexpress.com 2023. All rights reserved. Website Designed, Developed & Maintained by Express Network Private Ltd. ",
    "datetime": null,
    "url": "https://www.newindianexpress.com/cities/delhi/2021/jan/22/riding-high-on-k-wave-2253507.html"
}