{
    "title": "Riding the South Korean wave",
    "text": "K-pop powerhouses BTS and Blackpink dominate the US market, opening doors for other Asian artists PUBLISHED : 28 Dec 2021 at 04:00 NEWSPAPER SECTION:  Life WRITER: \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSuwitcha Chaiyong Looking back on the year in music, the global phenomenon BTS helped propel the fan base expansion of K-pop groups into the United States. BTS, the seven-member boy band, continues to break recording history and open new frontiers for Asian artists. In March, IFPI, the organisation that represents the recorded music industry worldwide, named BTS as its Global Recording Artist of the Year 2020. The septet won over Taylor Swift, Drake, The Weeknd and Billie Eilish, who ranked second to fifth place respectively. The boy band was the first Asian artist to win the IFPT Global Recording Artist of the Year Award. In May, BTS's second English-language single, Butter, debuted at No.1 on the US Billboard Hot 100 chart. In September, the septet was appointed by South Korean President Moon Jae-in as the \"Special Presidential Envoy for Future Generations and Culture\" at the United Nations General Assembly. More than 1 million viewers watched the group speak about youth and climate change issues and perform their song, Permission To Dance, which features sign language as their choreography at the UNGA Hall in New York. BTS then joined with British group Coldplay to release My Universe. The song also debuted at No.1 on the Billboard chart. In November, BTS made history again after winning Artist of the Year at the 2021 American Music Awards, becoming the first Asian act to win this prestigious award. They also took home two other awards -- Favorite Pop Duo or Group and Favorite Pop Song. Also in November, BTS was nominated for top Pop Duo/Group Performance at the Grammy Awards. On Nov 28-29 and Dec 2-3, BTS held their onsite concert, \"BTS PTD On Stage -- LA\" at SoFi Stadium in Los Angeles. Billboard Boxscore reported that this four-day concert earned US$33.3 million (1.1 billion baht) and sold over 214,000 tickets, ranking it as the second-biggest act playing at a single venue in US history after Bruce Springsteen. Each member of BTS also made a massive impact with their solo activities. After setting up individual Instagram accounts, lead vocalist Kim Tae-hyung, or V, set a new record for the fastest time to reach 1 million followers -- 43 minutes. Recently, Jin's hot single Super Tuna landed at No.12 in the Billboard Hot Trending Songs chart. Super Tuna boosted sales of nautical dog toys at Target stores in the US after the toy appeared as props in the video. Blackpink has raised awareness about climate change. Not to be outdone, K-pop girl group Blackpink gained attention from the American media and audiences. Although group activity was quiet in 2021, group members remained in the limelight due to their solo activities. While Jisoo became a leading actress in the TV series Snowdrop, Rosé and Lisa released solo albums. In March, Rosé launched a music video for her single On The Ground from the solo album R, which garnered 41.6 million views and became the most viewed YouTube music video in 24 hours by a solo K-pop artist. That record was then broken by her Thai bandmate, Lalisa \"Lisa\" Manoban, after she dropped the album Lalisa, which features the lead single of the same title. The music video gained 73.6 million views in 24 hours. Also, the track Lalisa debuted at No.2 on the Billboard Global 200 chart and Billboard Global 200 Excl. US Chart. Both Rosé and Lisa were nominated for the best K-pop category at the MTV Europe Music Awards. Lalisa 'Lisa' Manoban danced in a Thai traditional dress and wore rad klao headgear.  Photos © Blackpink YouTube Channel The Lalisa video drew criticism from conservatives for featuring the singer in a Thai traditional dress and rad klao headgear. However, fans responded by purchasing the rad klao in droves, silencing critics. Meatballs in Buri Ram province also became a popular item after Lisa said in an interview that she missed the food of her hometown. Lisa's reputation caught the attention of Prime Minister Gen Prayut Chan-o-cha, who commended the star for her success. Many state agencies sought Lisa's help in promoting the country. The Tourism Authority of Thailand tried to get Lisa to perform at the Phuket New Year countdown event. But her label, YG Entertainment, refused over scheduling conflicts. In October, as advocates for the United Nations Conference on Climate Change, Blackpink delivered a speech about the climate crisis in three languages -- English, Korean and Thai -- on the Dear Earth channel on YouTube. Aespa participated at Macy's Thanksgiving Day Parade in the US. Photo © SM True Thailand Lisa made headlines again after testing positive for Covid-19. Other group members tested negative. On Dec 4, she was released from self-quarantine. Apart from music, Blackpink members served as ambassadors for French luxury brands. While Lisa is the face of Celine, Rosé works with Saint Laurent, Jennie signed with Chanel, and Jisoo with Dior. Other Korean music labels tried to dovetail BTS and Blackpink's success by cracking the US market. In July, SM Entertainment revealed that the music label will produce a TV reality singing competition programme to search for new members of a new group called NCT Hollywood, which would debut in the US. However, the idea received negative feedback from fans of the 21-member boy band NCT. Fans were worried that their favourite members in NCT would be overlooked and abandoned after NCT Hollywood debuts. Fans of NCT resisted plans for the NCT Hollywood reality show. Photo © SM True Thailand Thai singer Sitala Wongkrachang of H1-Key faced a backlash from Thai anti-government elements and K-pop fans, accusing her of supporting a dictatorship in Thailand. The hashtags #banSitala and #BanLuknang began trending on Twitter. Sitala participated in rallies for the People's Democratic Reform Committee several times and listed her late father, the famous actor and political activist Sarunyu Wongkrachang, as her role model. South Korean entertainment agency GLG said in a statement that they would not change members of H1-Key: \"We cannot hold Sitala accountable on the basis of her father's past decisions and actions that were beyond her responsibility\". GLG also explained: \"Sitala names her father as her role model based upon the role of her father as a parental figure, actor and director and not on his political views and actions.\" In a competitive market like K-pop, it is difficult to have media coverage for new emerging groups. However, analysts will keep a close eye on H1-Key's debut single. There is a chance for them to win people over with their songs. Sitala Wongkrachang faced a backlash from Thai anti-government elements and K-pop fans.  Photo © Grandline Group Next year, the four-member girl group Aespa seems poised to be crowned the next K-pop queens. This year, the group won Record of the Year and Best Female Group at the Melon Music Awards. Their stunning visuals, catchy music and magnetic stage presence are a big attraction for old and new fans. Among boy bands, Enhypen, with their energetic and charismatic performances, is seen as an emerging potential powerhouse. In 2022, more K-pop groups will be going on tour. After their LA concert, BTS tweeted \"See you in Seoul, March 2022\". Another K-pop sensation, Twice, added two more dates in the US to the \"Twice 4th World Tour III\", where they will perform in five cities -- Los Angeles, Oakland, Fort Worth, Atlanta and New York. In Thailand, boy band Victon will hold two fan meetings at the Thunder Dome in Muang Thong Thani on Feb 26 at 1pm and 6pm. Tickets are currently available. By subscribing, you accept the terms and conditions in our privacy policy. ",
    "datetime": null,
    "url": "https://www.bangkokpost.com/life/arts-and-entertainment/2238855/riding-the-south-korean-wave"
}