{
    "title": "Riding The K-Wave? Here Are Some Korean Dishes You Must Try - News18",
    "text": "Curated By:  Swati Chaturvedi News18.com Last Updated: August 30, 2022, 15:16 IST New Delhi, India The most important part about Korean dramas is the food If you are an ardent fan of K-Dramas, you know Koreans love their food. Most of us love to watch the drama, plot twists and conventional love stories with cup of Ramyun noodles and a pair of chopsticks. From cheese hotteok to colourful gimbap roll, Korean dishes are the flavour of the season and are here to stay. We bring you three recipes which can be prepared in no time. Time to ride the K-wave! Ingredients Tofu Sushi rice Kimchi Gochujang Spring onions Basil Lemon Peanut Coriander Method: Add sushi rice, kimchi, springs onion, basil, lemon, peanuts, and coriander into a bowl. Mix well and keep it aside to use as stuffing. Cut a tofu block into four equal triangles and fry, giving a little rest once a while, till golden brown. After frying, extract a piece of tofu from the triangle, leaving space for stuffing to be filled inside. Repeat the process for all components and fill the Korean mix in all the pieces of tofu. Garnish with fresh greens and add kimchi salad by the side. Ingredients Refined flour Dried yeast Baking powder Salt Cheese King Chilli Gochujang paste Oil Spring onion Coriander Onion Tofu Kimchi Method: Add refined flour, dried yeast, baking powder, salt, and water to a bowl to form a dough for the pancake. Rest the dough for 3 hours until double in size. Cut king chili, spring onion, coriander, and onion in a separate bowl, and add cheese and cottage cheese (paneer) to the bowl. To make a hotteok, flatten the dough and put the filling in the center. Seal the dough by forming a small round and let it rest. On a hot plate, place the round dough and gently flatten it with a spatula or a slicer. Cook the bread on both sides until golden brown. Cut the hotteok into four pieces and serve hot with a side salad. Ingredients Sushi rice Nori sheet Carrot Takwan Gari Tofu Kimchi Gochujang Spinach Banana Leaf Wasabi Oil Soy Kikkoman Method: On a sushi mat, place a nori sheet and spread sushi rice on it. Place carrots, takwan, spinach, and gochujang paste with kimchi in the center of the nori sheet. Very lightly fry tofu and place it on top of the kimchi salad. Roll the gimbap gently and seal it tightly by applying water to the end of the sheet. Serve with gari, wasabi and soy by the side. Read all the Latest Lifestyle News and Breaking News here ",
    "datetime": "2022-08-30T15:16:32+05:30",
    "url": "https://www.news18.com/news/lifestyle/riding-the-k-wave-here-are-some-korean-dishes-you-must-try-5853019.html"
}