{
    "title": "Riding the K-pop wave - Taipei Times",
    "text": "When Tom Tsai (蔡曜竹) collected the pay from his part-time jobs this summer, the 18-year-old shunned instant gratification for an investment in his future. He spent all NT$8,000 (US$262) of his earnings on a class teaching Korean pop music (or “K-pop”) performance techniques. “I’ve never come such a long way by myself to do something related to my dreams,” the Taichung native told me in a music rehearsal studio in central Taipei. Tsai bears an uncanny resemblance to local singer-songwriter Crowd Lu (盧廣仲), plays the erhu, piano and guitar and wants to write his own songs. It’s easy to imagine him thriving in Taiwan’s indie music scene. But Tsai, who does not (yet) dance or speak Korean, wants to be a K-pop idol. Photo: Davina Tham, Taipei Times Attracted by the international success of K-pop acts, young and aspiring performers are increasingly looking to K-pop training centers and auditions to make their dreams of stardom come true. This shift is also bringing changes to the development of Taiwan’s Mandopop industry. KOREA RISING Full disclosure: I’ve been a K-pop fan for the past 10 years. I’ve bought albums and concert videos, waited at the airport to greet a boy band arriving on tour and stood outside the Seoul offices of SM Entertainment (one of K-pop’s Big Three management agencies) in hopes of a celebrity sighting. Photo: Davina Tham, Taipei Times But this wasn’t always the case. Throughout my youth in Singapore in the 1990s and early 2000s, Taiwanese Mandopop and idol dramas had seemed like the be-all-and-end-all of East Asian pop culture. Back then, Taiwanese musicians like Mayday, Jay Chou (周杰倫) and S.H.E, all of whom debuted at the turn of the 21st century, ruled the airwaves. Taiwanese productions like the idol drama Meteor Garden (流星花園), which aired in Singapore in 2001, set new standards for popular entertainment by capturing tween and teen imaginations. But since then, Taiwan’s Mandopop artistes and broadcast content have lost their sheen somewhat. Instead, K-pop has gradually eclipsed regional competitors to rise to an unprecedented level of worldwide popularity. In the last two years in particular, led by boy band BTS and girl group Blackpink, K-pop has made inroads into the American mainstream, with sold-out concert tours and appearances at music award ceremonies, Coachella and late-night talk shows. Photo: Davina Tham, Taipei Times This is a potent draw for those with big dreams, like Ashley Chang (張祺璦), a Taipei American School student whose stage confidence belies her tender 13 years. In a typical trajectory from fan to aspirant, Chang’s affection for the K-pop boy band Exo drove her to learn more about the K-pop industry and ask her parents for singing and dancing lessons. “I realized that [K-pop] is more worldwide, which gives me more chance to shine brighter,” Chang said. In contrast, she added, local artistes did not seem to get as much overseas exposure. YOUNG AMBITION Photo: Davina Tham, Taipei Times K-pop inspires rabid devotion through its artful engineering of performers called “idols” — a term that aptly evokes fan worship, but also a kind of transcendence. More than a genre, K-pop is best understood as an ecosystem of music, TV dramas, variety shows, social media interaction and advertising tie-ups that feed into each other. At the center of it all is the idol, scouted for his or her beauty, performing talents, screen presence and discipline — with that last being the most essential. Despite the appearance of glamor, life as a K-pop trainee is punishing, with all-or-nothing stakes. In South Korea, the journey can start as early as elementary school. Hopefuls who pass cutthroat auditions and receive trainee contracts with record labels must observe company rules and grueling practice schedules. They relinquish many of the freedoms of youth, like after-school hours, mobile phones and even living with their own family. And despite the sacrifices, there is no guarantee they will debut as idols. Photo courtesy of Alfa Music International “That’s the power that idols give us,” Tsai said when I asked why he wanted to join the K-pop industry. “It’s not easy to have that perseverance. They’re an aspiration when it comes to learning.” Eager to taste the highs and lows of trainee life, I attended one day of a K-pop singing and acting class organized by the Dr Korea K-pop Star Professional Education and Training Center (韓國專業演藝培訓中心) in August. That was where I met Tsai, Chang and 20 other aspiring idols, aged 12 to 28. Our oldest classmate was a petite, fair-skinned nurse who moonlighted as lead vocalist of a rock band. Another was a lanky 24-year-old policeman serving in Taipei’s Xinyi District (信義), who delivered a passionate rendition of Celine Dion’s That’s the Way It Is for his audition taping. Our teacher, Song In-mi, was a South Korean musical actress and teacher at Born Star Training Center (BSC) New York — the US outpost of a South Korean performing arts school established in 2008. BSC New York’s Web site touts the company’s memoranda of understanding with South Korean record labels and its association with several former students who have since debuted as idols. The NT$8,000 that Tsai had scraped together got him into one out of two days of the class, which cost NT$15,000 in total. Performance techniques aside, students were also paying for the possibility of a recommendation to JYP Entertainment (another of the Big Three agencies) through BSC New York, if they performed well in class. Song led us through a series of vocal and improvisation exercises, the most complex of which involved singing scales while clapping, snapping and stomping on different beats. While far from the polished routines of real K-pop idols, it previewed the ruinous outcome if I were to actually attempt dancing and singing at the same time. Fortunately, Song also valued a good attitude. She disseminated a set of rules including axioms like: “life is the audition” and “break down to break through.” We chanted rule number 11 (“I am powerful and limitless”) together to psych ourselves up for the rest of the day. Queenie Liu (劉思妤), who co-founded Dr Korea in April last year with business partner Janice Hung (洪嘉翎), told me that the company had helped three students pass auditions and become trainees in Seoul. She declined to reveal their names or agencies, citing an industry practice of keeping trainees’ identities confidential until debut. Liu added that the success of Chou Tzu-yu (周子瑜), a Taiwanese member of top girl group Twice, had contributed to the rise in popularity of local K-pop training centers. Chou, who was reportedly scouted from a dance school in Tainan, made her K-pop debut in 2015. But the unpredictability of the entertainment industry is not lost on most teenagers and their parents, who try to hedge risks by making sure they remain on-track for paper qualifications and more conventional careers. Tsai’s parents, though supportive of his interests, were worried about his ambitions. While he’d planned to take a gap year to concentrate on auditions and K-pop lessons, they insisted that he prioritize his studies and attend college in Chiayi, studying art and design while pursuing music only on the side. As a college student, Liu, the co-founder, had made regular appearances on a local variety show. Now, she rued the lack of professional skills development for budding entertainers. She attributed K-pop’s success to an purposeful alignment of education and industry in South Korea, citing how performing arts high schools and colleges maintain relationships with management agencies to recruit and nurture talent. “The entertainment industry can actually be very professionalized,” Liu said, but “Taiwan currently does not have any such systematic training... and Taiwanese students do not have a formal channel” to pursue their ambitions. Dr Korea was her attempt to fill the gap. IN THE STUDIO One local record label explicitly adopting K-pop’s training and production methods is Alfa Music International (阿爾發音樂), the company that produced Jay Chou’s 2000 debut album. “South Korea really does have its unique areas in music arrangement, production and dance,” Alfa’s vice-chairperson Daniel Chang (常立欣) said. “We want to bring K-pop’s training methods and spirit to Taiwan. We’re not trying to imitate K-pop, but we hope to borrow from it... to improve our standards.” Chang told me that one fundamental difference in K-pop was how songs were composed by groups of songwriters who specialized in specific parts, like a hook or chorus. He said this team-based, assembly-line approach lowered barriers to entry and raised the production speed of high-quality pop songs. “You don’t need to be a Jay Chou, like really a genius, or a JJ Lin (林俊傑),” Chang said, naming two Mandopop exemplars of the singer-songwriter who composes alone. Alfa Star Academy (阿爾發星光學院) — the label’s two-year-old training center — is modeled after such industry practices. Through music and dance classes in Taipei as well as experiential trips to Seoul that give students a taste of trainee life, the academy scouts for Alfa’s own stable of talent. Over one week in August, about 40 middle-schoolers filled a basement of rehearsal rooms for a K-pop summer camp at Alfa’s offices in Neihu District (內湖). I watched as the students — all girls, except for two bemused boys whose parents had registered them without their knowledge — moved in formation and popped their hips to a dance track. But not everyone is swayed by this vision of the future of pop music. “Music is not a canning factory. It’s not a standardized production process,” said Jian  Miao-ju (簡妙如), a National Chung Cheng University College of Communication professor and co-editor of Routledge’s upcoming volume, Made in Taiwan: Studies in Popular Music. While K-pop’s trainee system was a proven way to produce idols, it did not necessarily translate to other genres and cultural contexts, Chien said. In Taiwan, for example, there remained a longstanding preference for singer-songwriters. “Pop music reflects local society and the tastes of local audiences,” she added. “I don’t see it as a monolithic commodity that can be compared for competitiveness at an international level.” And while the heyday of Taiwan’s Mandopop from the 1990s to 2000s may be over, independent rock bands like Elephant Gym (大象體操) and Sunset Rollercoaster (落日飛車) have flown the flag overseas more recently. “Taiwan’s independent music has been flourishing vigorously in recent years, and the level of vitality is to the extent that even South Korean and Chinese fans are envious,” Chien told me. For his part, Chang remained optimistic about the future of Mandopop, especially in Taiwan’s free and creative environment. “Given our soil that’s fertile for creativity, if we can bring in South Korea’s strengths, I think our pop music still has a chance,” he says. “At least in the Chinese-language market, we can still be in a position of leadership.” Last week the New York Times published Oriana Skylar Mastro’s “This is what America is getting wrong about China and Taiwan.” The piece was a fairly typical example of the well-worn genre claiming that peace can be achieved by selling out Taiwan, arguing that the US should “try to understand China’s deep sensitivities about Taiwan” and that it “should recommit — clearly and unequivocally — to the idea that only China and Taiwan can work out their political differences.” \r\n Yes, Skylar Mastro actually argues that the people with the knife at their throat should be allowed to “work out Deep inside his tribe’s sacred rainforest on the Indonesian holiday island of Bali, Indigenous guide Putu Willy Suputra looks on in disbelief as a group of tourists video themselves mimicking monkeys by swinging on a long, woody vine.\r\nSuputra is a member of the 20,000-strong Adat Dalem Tamblingan Indigenous community who have lived in northern Bali since the 9th century and want rights to curb tourism and protect their rainforest and lake.\r\n“These types of things really hurt me,” the 27-year-old said. “That liana will definitely die.”\r\n“If we go into this forest, it is enough to walk, see, hear and leave a Tainan’s Sanye Creek (三爺溪) isn’t by any stretch of the imagination a tourist attraction. For years, it was the worst-polluted tributary of one of Taiwan’s most degraded rivers. These days, however, it makes for pleasant cycling, especially if you’ve an aversion to traffic and gradients.\r\nThis 14.4km-long waterway also looks and smells a good deal better than you’d expect, if you were to research its postwar history. Alternatively known as Sanyegong Creek (三爺宮溪) or Sanlaoyegong Creek (三老爺宮溪) — names which suggest there’s a temple on its bank — its source is somewhere in Yongkang District (永康). That part of Tainan is Last month, Bill Gates surprised some people by saying that planting trees isn’t one of his responses to climate change. Speaking at the New York Times Climate Forward Summit on Sep. 21, the billionaire described relying on tree-planting efforts to roll back global warming as “complete nonsense.”\r\nGates is right. Even if humanity was to utilize all suitable land and plant a trillion trees — a goal endorsed by the World Economic Forum, World Wildlife Fund, Wildlife Conservation Society and other organizations — new woodlands wouldn’t by themselves come close to countering global carbon dioxide emissions. \r\nThe Microsoft founder went on ",
    "datetime": "2019-10-22T00:00:00+08:00",
    "url": "https://www.taipeitimes.com/News/feat/archives/2019/10/22/2003724396"
}