{
    "title": "S. Korea's kimchi exports hit new high in 2021 | Yonhap News Agency",
    "text": "All Headlines North Korea Sports Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies URL is copied. SEOUL, Jan. 9 (Yonhap) -- South Korea's exports of kimchi hit an all-time high last year thanks to its growing popularity, data showed Sunday. Outbound shipments of the spicy Korean traditional side dish came to a record US$159.9 million in 2021, resulting in a trade surplus of $19.2 million in the sector, according to the data from the Ministry of Agriculture, Food and Rural Affairs. It is the first time in 12 years that South Korea registered a surplus in the kimchi trade. Kimchi is a traditional Korean side dish normally made of fermented cabbage, salt and hot peppers and is eaten with almost all meals. Exports of kimchi grew 18 percent on average per year in the past five years, and the number of import countries increased to 89 in 2021 from 61 countries in 2011. The agriculture ministry attributed the increase in kimchi exports to growing awareness of the fermented dish amid the growing popularity of \"hallyu,\" the Korean wave of pop culture. K-pop and the broader Korean Wave have resonated with young people around the world, burnishing South Korea's image as a cool country, home to K-pop phenomenon BTS and \"Gangnam Style,\" South Korean rapper Psy's 2012 megahit song. Experts said the Korean Wave generated by K-pop and TV dramas could turn fans in foreign countries into active consumers of South Korean products. Packages of kimchi products are displayed at a supermarket in Seoul in this file photo taken on April 21, 2021. (Yonhap)  jwc@yna.co.kr\n(END) All News National North Korea Economy/Finance Biz Culture/K-pop Sports Images Videos Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies Korea in Brief Useful Links Festival Calendar Weather Advertise with Yonhap News Agency ",
    "datetime": "2022-01-09T12:56:27+09:00",
    "url": "https://en.yna.co.kr/view/AEN20220109001200320"
}