{
    "title": "S. Korean president promotes Islam-friendly 'hallyu' products | Yonhap News Agency",
    "text": "All Headlines North Korea Sports Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies URL is copied. KUALA LUMPUR, March 12 (Yonhap) -- South Korean President Moon Jae-in on Tuesday sought to promote his country's products that are now permissible to the Islamic population for the first time. In a business fair held in the heart of Kuala Lumpur to introduce some 150 halal-certified South Korean products, the South Korean president said the goods will help provide new growth opportunities to both South Korea and Malaysia. South Korean President Moon Jae-in (R) shakes hands with Ha Ji-won, a famous South Korean actress, in a special business fair held in Kuala Lumpur on March 12, 2019 to introduce some 150 halal-certified, hallyu-themed South Korean products. (Yonhap)  \"Malaysia is without a doubt a global leader of halal products and South Korea is the origin of 'hallyu' that the entire world envies,\" Moon told the exhibition attended by some 500 people, including officials from 23 South Korean companies with some 150 halal-certified products. Hallyu refers to the Korean Wave of South Korean pop culture around the world. The products on display included Korean foodstuff, hallyu content and industrial goods, including cosmetics. \"When the globally competitive South Korean hallyu is combined with the products of Malaysia, the hub of the halal industry, sweeping the global halal market will become a possibility,\" Moon said. The South Korean president arrived in the capital earlier in the day on a three-day state visit, becoming the first South Korean leader to do so in nine years. He is currently on a three-nation tour that will later take him to Cambodia. His trip began in Brunei. Moon noted the global market for halal products was expected to grow to over US$3 trillion in 2022. \"Should South Korea and Malaysia jointly explore this vast halal market, it will create a new model of economic cooperation where both will win,\" he said. \"I hope this exhibition today will be our first step in opening such a new opportunity.\" bdk@yna.co.kr(END) All News National North Korea Economy/Finance Biz Culture/K-pop Sports Images Videos Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies Korea in Brief Useful Links Festival Calendar Weather Advertise with Yonhap News Agency ",
    "datetime": "2019-03-12T17:26:03+09:00",
    "url": "https://en.yna.co.kr/view/AEN20190312008900315"
}