{
    "title": "Salt and potassium intake among adult Ghanaians: WHO-SAGE Ghana Wave 3 | BMC Nutrition | Full Text",
    "text": "Advertisement BMC Nutrition\nvolume 6, Article number: 54 (2020)\n            Cite this article 4040 Accesses 6 Citations 1 Altmetric Metrics details Though Ghana has high hypertension prevalence, the country lacks current national salt consumption data required to build and enhance advocacy for salt reduction. We explored the characteristics of a randomly selected sub sample that had valid urine collection, along with matched survey, anthropometric and BP data (n = 839, mean age = 60y), from the World Health Organization’s Study on global AGEing and adult health (WHO-SAGE), Ghana Wave 3, n = 3053). We also investigated the relationship between salt intake and blood pressure (BP) among the cohort. BP was measured in triplicate and 24 h urine was collected for the determination of urinary sodium (Na), potassium (K), creatinine (Cr) and iodine levels. Hypertension prevalence was 44.3%. Median salt intake was 8.3 g/day, higher in women compared to men (8.6, interquartile range (IQR) 7.5 g/day vs 7.5, IQR 7.4 g/day, p  30 kg/m2) compared to a healthy BMI (18.5–24.9 kg/m2) (10.04, IQR 5.1 g/day vs 6.2, IQR 5.6 g/day, p <  0.01). More than three quarters (77%, n = 647) of participants had salt intakes above the WHO maximum recommendation of 5 g/d, and nearly two thirds (65%, n = 548) had daily K intakes below the recommended level of 90 mmol. Dietary sodium to potassium (Na: K) ratios above 2 mmol/mmol were positively associated with increasing BP with age. Population-based interventions to reduce salt intake and increase K consumption are needed. Peer Review reports Cardiovascular diseases (CVDs) remain a major contributory factor for mortality and morbidity worldwide, accounting for 17.9 million deaths in 2016, and representing a third of all deaths globally [1]. While Low- and Middle-Income Countries (LMICs) already share the greatest impact of CVD-related deaths, with rates of 300–600 deaths per 100,000 population, these are predicted to increase, causing premature, avoidable loss of lives [2]. Hypertension is a major risk factor for CVD and accounted for more than 50% of CVD-specific deaths in 2012 [3]. It has been estimated that the burden of hypertension will increase to approximately 1.56 billion people globally by 2025, with larger populations of hypertensives living in LMICs [3,4,5]. Hypertension is a common condition in Ghana, where its prevalence has increased more than two-fold over just two decades (1988–2007) [6]. A recent nationally representative study among participants largely 50 years and older, in Ghana, reported the prevalence of hypertension to be 58.9% in adults with about one-fifth of those with hypertension being aware of having the condition [7]]. Reducing population-level prevalence of hypertension by 30% by the year 2030 is identified by WHO as one of the nine voluntary global targets to reduce non communicable diseases (NCDs) [8]. Salt reduction has been identified by the WHO as one ‘best buys’ approach to reduce overall CVD risk through lowering of (BP) [9]. Increased consumption of salt (> 2 g Na/day, equivalent to 5 g salt/day) together with insufficient potassium (K) intake (< 3.5 g/day) are strongly associated with a number of NCDs including hypertension [10,11,12,13,14]. Several systematic literature reviews, meta analyses and randomized-controlled trials have shown that reduced sodium (Na) consumption results in a decline in blood pressure in both hypertensives and normotensive adults [12, 14,15,16,17], which saves lives [18]. In view of this, ‘WHO’s SHAKE the Salt Habit’ resource has emphasized the importance of measuring and monitoring population salt consumption patterns in order to inform stakeholders about strategies to reduce salt intake and evaluate the effect of any implemented salt reduction programmes [19]. Though Ghana is committed to the World Health Assembly’s target of 30% relative reduction in the population salt intake by 2025 [10], the country has made slow progress towards achieving the target due to other competing public health priorities and limited resources [20]. Few studies have been conducted to assess salt intake in the Ghanaian population [21]. A lack of recent, nationally representative data on population salt consumption among adults has further been a disincentive for advocacy around salt reduction efforts [22]. The current study was undertaken to obtain a reliable estimate of population salt intake and salt use behaviour, and to assess the relationship between salt and K intake with blood pressure (BP) in Ghanaian adults. This study is a nested sub study of WHO’s Study on global AGEing and adult health (WHO - SAGE) Wave 3 Ghana, which collected 24 h urine samples for analysis of Na and K [23]. WHO - SAGE is a longitudinal cohort study conducted in six LMICs (China, Ghana, India, Russia, Mexico and South Africa) with the aim to examine the ageing process and address health inequalities among adult populations [24]. Participants were sampled based on a design used in the 2003 World Health Survey with primary sampling units (households) stratified by region and location (urban/rural) The study design randomly selects 24 households from an enumeration area (twenty 50+ year households and four 18-49 year households). In the 50+ year households, all participants are selected and compares with a smaller number of participants selected from the 18-49 year households, details of which are described elsewhere [25]. WHO SAGE Ghana Wave 3 data collection was completed over a period of 1 year (July 2018–June 2019) with n = 1100 24 h urine samples collected nationwide. Out of 5570 participants recruited for WHO - SAGE Ghana Wave 3, 1102 (20%), were randomly selected to provide urine samples (nested sub study). Of these, 76.7% (n = 844) had successful (BP) data and 88.6% (n = 976) had complete urine samples. However, fewer participants (n = 839) had a complete urine collection, accompanied with survey, anthropometric and valid BP data (Fig. 1). Study flow chart Field worker teams consisted of 3–5 interviewers per team who visited participants in their homes and workplaces to conduct interviews. All field workers were trained by the central WHO SAGE team with standardized survey materials [24]. Surveys were conducted in the participants’ preferred home language with the use of the computer assisted personal interview (CAPI) method. The WHO/Pan American Health Organization (PAHO) protocol was utilised in the determination and collection of Na, K and Cr in the 24 h urine collections. In collecting urine samples, 5-l urine bottles containing 1 g thymol as preservative, were given to participants to collect 24 h urine. The collection procedure was thoroughly explained to participants. In brief it is as follows: 1) void the ‘first urine’ and note the time but include the ‘last urine’ 2) keep the bottles to yourself and collect only your own urine 3) collect all urine passed within the 24 h and 4) keep collected urine in a cool place [26]. The 24 h urine was collected, thoroughly mixed, volumes recorded, 3 aliquots of 5 ml were generated and samples kept in cold boxes and transported to the Noguchi Memorial Institute for Medical Research of the University of the Ghana (NMIMR-UG). Urine samples were considered valid if the volume was ≥300 ml [27, 28]. Additionally, iodine was assessed for analysis because Ghana had a universal iodine programme in place. Analysis were undertaken by NMIMR-UG, that followed the WHO/PAHO protocol for quantitative analysis of Na, K, Cr in urine samples [26]. Urine samples for iodine analyses were stored at − 20° and batch analysed using the Sandell-Kolthoff method with ammonium persulfate digestion and microplate [29]. Creatinine excretion in this population was much lower than that reported for many other populations, from which Cr cut-off values have been determined to indicate completeness of 24 h urine collection [28]. Because of this, only urine volume was used to indicate whether urine samples were considered to represent completeness. This approach has been used in other multi-country studies including; the International Population Study on Macronutrients and Blood Pressure [INTERMAP] and the International Study of Sodium, Potassium, and Blood Pressure [INTERSALT] [27]. In the first enumerator areas (EAs) sampled within the Accra region, some calculated salt values were unfeasibly high (> 40 g/d, n = 40,) due to unacceptable storage conditions [30]. A follow-up validation study conducted in n = 67 participants included the collection of repeated 24 h urine samples from the same participants in one EA (Alajo; n = 19), while an additional two non-urine EAs from the larger survey sample were visited as a comparator (Mataheko; n = 24 and Nima; n = 24). A second laboratory (Liberty Medical Laboratory, Accra) also performed duplicate analyses in the validation study. Values for Dosise EA (n = 23) were excluded after the validation study because they were confirmed as being unfeasible, and the validation study values replaced original measures for the case of Alajo (n = 16; 3 barcodes of urine samples in validation study were excluded because they could not be matched with those of the original study) (Supplementary Table 1). Sodium (mmol/l) in the 24 h urine sample was converted to salt (g/d) using the formula: Na mmol/l × 24 h volume (litres) × 23.1 (molecular weight of Na)/390 (390 mg Na per 1 g Nacl (salt). From this variable, participants were categorised as having low ( 9 g/day) salt intake. K (mmol/l) in the 24 h urine sample was converted to K (mmol/d) using the formula: K (mmol/l) × 24 h volume (litres) [31]. The ratio Na (mmol/L) to K (mmol/L) was created (Na:K) and categorised as low ( 5). BP was measured by field workers with wrist worn BP devices with positional sensors (Omron R6, Japan) [32] that have been validated by the European Society of Hypertension International Protocol [32,33,34]. After being seated with legs uncrossed for 5 min, three BP readings were taken on the left wrist (1 min between each measurement) while the wrist was placed precisely at the level of heart. The last two readings were averaged as a measure of the participant’s BP. Hypertension classification was based on the European Society for Hypertension Guidelines (2018) which defines hypertension as systolic ≥140 and/or diastolic ≥90 mmHg [35]. BP readings in the database were determined valid if: Systolic (SBP) > Diastolic (DBP); and SBP was between 80 and 270 mmHg; and DBP was between 40 and 180 mmHg; and SBP minus DBP (Pulse Pressure, PP) > 13 mmHg. Mean Arterial Pressure (MAP) is the average arterial pressure throughout one cardiac cycle, systole, and diastole. MAP was calculated using the formulae: MAP = SBP + 2 (DBP)/3 [36]. Hypertension status was measured as self-reported treatment or having a measured BP ≥ 140/90 mmHg. Hypertension awareness was based on self-reported previous diagnosis of hypertension in those with BP ≥ 140/90 mmHg. Treatment was determined from self-reported medication use for hypertension within the last 2 weeks. Hypertension control was determined by self-reported medication use within the last 2 weeks and a measured BP less than 140/90 mmHg. Individuals with no current medication use and a measured BP < 140/90 mmHg were categorized as non-hypertensive. Weight was measured with calibrated scales, while height was measured with a portable stadiometer. Data were also collected on health indicators such as tobacco, alcohol use, salt use behaviours and previous disease conditions. Physical activity levels were measured using the Global Physical Activity Questionnaire [37]. For salt use behaviour questions, responses such as ‘always’ and ‘often’ were combined to represent ‘frequent use’, whilst ‘sometimes’ and ‘rarely’ were combined to represent ‘infrequent use’. Prior to taking part in the study, study measures were explained to participants in their home languages and written informed consent was obtained. The study complied with the Declaration of Helsinki with ethical approval from the WHO Ethics Committee (RPC 149) and the University of Ghana Medical School Ethics and Protocol Review Committee (MS-Et/M.03 - P 3.1/2005–2006). Data were analysed using Stata Statistical Software: Release 15 (Stata Corp LLC, 2017; College Station, USA). Data distribution was checked visually and with the Shapiro Wilks test for normality. Descriptive statistics of frequencies, percentages and median (interquartile range, IQR) were used to describe participants’ characteristics. Categorical variables were evaluated using frequencies, Pearson’s Chi-Square and Fisher’s Exact tests. Comparison between groups for non-parametric data was examined using Mann-Whitney U and Kruskal-Wallis tests and Spearman’s Rho was used to test for correlations. Linear regressions were used to evaluate the associations between variables. To test regression slopes for equality between the three salt level groups and between the three Na:K ratio groups, the interaction terms of groups with age was added into the models. To test if a difference in the group’s coefficients (i.e. slope) was present, the F test was applied. If significant, post-estimation was pursued to identify which group differed from the others. Table 1 compares sociodemographic characteristics of the nested sub study sample with those included in the total Wave 3 survey collection. Hypertension prevalence in the nested sub study was 44.3% (n = 370) with 41.4 and 46.1% for men and women respectively. Of those with hypertension, 59.7% were aware of their condition (n = 222) of which 69.1% (n = 154) were receiving prescribed antihypertensive medication. Of those being treated for hypertension, 51% (n = 77) had controlled BP (ie BP ≤ 140/90). Among participants with both urine, survey data and BP data (n = 839), median intake of salt was equivalent to 8.3 g/day (IQR 7.5) (mean = 10.2 g ± 7.2). Salt intake was higher in: (1) women compared to men; median 8.6 (7.5)g/day vs 7.5 (7.4)g/day, p  30 kg/m2) compared to a desirable BMI (18.5–24.9 kg/m2); median 10.04 (5.1)g/day vs 6.2 (5.6)g/day, p  10 g/d, n = 321) and 16.3% consuming more than three times the recommended level (> 15 g/d, n = 137). More men than women (27.1% (n = 73) vs 19.9% (n = 122); p = 0.02) and older participants than younger ones (24.8% (n = 164) vs 12.1% (n = 21); p <  0.01) achieved the WHO’ salt recommendation of ≤5 g salt/day (Supplementary Tables 2 and 3). According to groupings by salt intake (low,  9 g/d), those with higher salt intakes were significantly younger, had higher BMI, a higher urinary K excretion, a higher urinary Na: K and lower urinary iodine concentrations. However, BP and hypertension status did not differ between the groups (Table 2). In response to the salt behaviour questions (Supplementary Table 4), 12.8% (n = 107) of participants reported that they frequently (always and often) added salt to food at the table with significantly greater numbers of younger (27.3%, n = 28, p = 0.02) and rural (61%, n = 61, < 0.01) dwellers responding affirmatively to this question. More than three quarters (80.1%, n = 671) of the surveyed population reported that they frequently added salt to food at home during cooking while 60.9% (n = 508) perceived themselves to consume the right amount of salt. While 19.9% (n = 126) did not know that a high salt diet could cause a serious health problem, 48.5%, (n = 394) of the participants reported actively doing something on a regular basis to control their salt intake. Of those who knew a high salt diet could cause a serious health problem, 58.9% (n = 378) did something on a regular basis to control their salt intake. Almost two-thirds (65%, n = 548) of participants did not meet the daily K recommendation of ≥90 mmol [38], with those in the lowest salt intake group having the lowest urinary concentrations. While 42.6% (n = 141) of urban participants met the guidelines for K intake, this was the case for only 28.6% (n = 101) of participants residing in rural areas (p <  0.01). Only 7.6% (n = 63) achieved the recommended Na: K ratio of ≤1 mmol [38]. There was a strong positive correlation between 24 h urinary Na and K concentrations (Spearman’s rho = 0.71, p <  0.01). Linear regression indicated that urinary Na excretion accounted for more than half the variability in urinary K excretion (R2 = 0.51, F (1, 832) = 861, p = < 0.01). Urinary K excretion increased by 0.71 mmol/day for each mmol/day increase in urinary Na such that Na: K ratio was significantly higher in the high salt group compared to the low salt group (median 2.3 (1.9)g/day vs 1.7 (1.9)g/day, respectively, p <  0.01). The high Na: K group had a significantly higher BMI than those in the lowest Na: K group (median 28.1, IQR 8.2 vs 24.8, IQR 7.0, p = 0.01) and had higher number of participants who reported doing something on regular basis to control their salt intake than those in the lowest Na: K group (61.5%, n = 15 vs 42.7%, n = 166, p <  0.01) (Table 3). Excluding all participants on treatment for hypertension (n = 154), a Spearman’s rank order correlation showed no association between Na excretion, K excretion or Na: K ratio and SBP, DBP or PP. We also found no significant difference between the regression slopes of SBP, DBP or PP with age in low ( 9 g/d, n = 302) salt groups (Fig. 2). However, there was an association between BP and the age regression slope according to urinary Na: K ratio. Compared with low Na: K ratio ( 5) had a significantly steeper slope with age for both SBP and DBP (p = 0.01 and p  9 g/d), univariate analysis showed a significant relationship between age, father’s education, diabetes, K and physical activity with SBP while sex, age and father’s education were associated with DBP. Slope of systolic, diastolic, pulse pressure and MAP with age in low ( 9 g/day, n = 302) salt groups excluding those on bp medication Slope of systolic, diastolic and pulse pressure with age in low ( 5 mmol/mmol, n = 34) Na: K groups excluding those on bp medication In a nationally representative sample of adult Ghanaians (50 years and older), we report that 24 h urinary Na excretion equated to a median salt intake of 8.3 g/day, with more than three-quarters of participants having salt intakes in excess of the WHO recommendation of < 5 g/day. This is considerably higher than median salt consumption values of 6.8 g and 7.2 g/day reported by recent studies from South Africa [31, 39], a country that has adopted mandatory salt reduction policies. Surprisingly, salt intake in the current study was higher in women than men, which is in contrast to findings of other studies [40, 41], and warranting further investigation. Our data provides much-needed information required to inform strategies to meet the WHO global voluntary target for NCD prevention of 30% reduction in mean population intake of salt, with the aim of achieving a target of less than 5 g per day by 2025 [8]. The only other available information on 24 h urinary Na excretion in Ghana was collected over a decade ago when salt intake was estimated to be 6.0 g/day [42]. Over this time, the Ghanaian food environment has changed dramatically [43, 44] with the emergence of energy dense, nutrient poor, processed convenience foods such as instant noodles, salty snacks (eg, potato, corn, and tortilla chips), visible fat (e.g. butter, margarine, oils, dressings and gravies), ready-made baked foods (e.g. cookies, cakes, pies and pastries), desserts such as puddings and cheesecake, and sweetened products (e.g. sugar, syrup, ice cream, candy, and carbonated and noncarbonated sweetened drinks). Additionally, frequent consumption of highly salted foods, such as fish and meat, remains part of the traditional Ghanaian cuisine, and salt use in cooking remains high [42, 45]. It is noteworthy that more than three quarters of participants in the current study reported adding salt to food during cooking. Poor salt use behavior is widespread in the Ghanaian population; a previous study involving 12 villages in Ghana in 2006 reported that 98% of participants added salt to food during cooking, while about half (52%) added salt to food at the table [21]. In comparison to South Africans, Ghanaians reported adding salt to food during cooking more frequently [45], presumably because mass media public health campaigns to lower salt use, such as Salt Watch in South Africa have not yet occurred in Ghana [46]. Further, Ghana’s national salt iodization programme, along with accompanying major public health campaigns on iodine consumption [47,48,49,50] may partially be responsible for an increase in discretionary salt intake. However, lack of information on sources of salt provided from discretionary and non-discretionary sources, as in processed foods, prevents further hypothesis in this regard. Despite the current study not including a dietary assessment component, a recent systematic review of dietary sources of salt in LMICs identified that bread, meat and meat products, bakery products, instant noodles, salted preserved foods, milk and dairy products, and condiments were major sources thereof [51]. In some LMICs, bread alone may contain as much as 1.36 g salt per 100 g bread [52]. For many African countries, bread has become a staple food, such as in some regions of Democratic Republic of Congo, where bread has replaced cassava [53]. The nutrition transition taking place in Sub Saharan Africa and its transformation of dietary patterns from a reliance on traditional staples to an increased intake of energy dense, nutrient poor foods (and often Na rich) foods may partly be responsible for the observed high salt intake reported by this study. In support of this, the Ghana Demographic and Health Survey 2014 reported that more than a third (36%) of participants consumed salted dried fish [54], while in the Ghana National Iodine Survey Report 2015, consumption of bouillon cubes was frequent and widespread with nearly half (48.8%) of the participants having consumed this item at least 6 times a week [55]. Awareness of excessive salt intake was low in the current study. Sixty one percent of participants believed that they were meeting the salt recommendation guidelines, but only 22.3% actually achieved this. Estimations of dietary salt intake using dietary recall methods usually indicates a reduced daily intake compared to 24 h urinary collections [56,57,58]. The tendency to under-estimate salt consumption is high as many people are unaware of the recommendation for salt consumption, unable to determine the salt content of everyday foods such as bread and cereals, or that of composite meals [59,60,61]. In Ghana, there are no salt reduction strategies in place such as: mandatory or voluntary levels of salt permitted in processed foods; regulations for food labelling to indicate salt content in products, or front-of-pack signposting for high salt warnings. In addition, the Ghanaian food composition tables are outdated and incomplete in the case of Na [62], making it difficult to assess food contributors to total salt intake. In view of this, regular monitoring and evaluation of the food environment and food consumption patterns are warranted. Potassium excretion, although low (median 63.8 mmol /day, IQR 74.8, with 65% not meeting the recommended daily intake of K), was higher than that reported by other studies in the region [31, 39]. The K content of the food items obtained from the 2010–2011 Ghana Food Balance Sheet indicated that K supply per capita per day was about 9086 mg/day (233 mmol/day), approximately 2.6-fold larger than the WHO recommended level (> 90 mmol/day) with yams, cassava and plantains constituting the bulk of K supply [63, 64]. However, food balance sheets represent apparent, rather than actual food consumption, and thereby provide an overestimation of intake. Hypertension prevalence in the current study was high (50 + y, 52.6%; 18-48y, 14.5%), with less than two thirds (60%) of participants classified as hypertensives being aware of the condition (i.e. diagnosed), of which 69.1% were being treated with antihypertensive medication, half of which had BP levels considered to be controlled (< 140/90 mmHg). Surprisingly, we found no association between urinary Na, K or N:K ratio with BP in contrasts to findings from other comparable studies [65,66,67] but in agreement with others [31, 68]. A possible reason may be the day to day variability in salt intake, which results in a high intra-individual variability in urinary Na excretion. Though 24 h Na excretion is considered to be the gold standard method for determination of population Na intake, repeated 24 h collections over periods provide more accurate estimating an individual’s habitual salt intake [69, 70]. However, this approach is typically impractical for large population studies such as the one reported here. Similarly, no difference was found between the slopes of SBP, DBP or PP with age according to three categories of salt intake, namely low (5 g/day), medium (5-9 g/day) and high (> 9 g/day). However, high and medium urinary Na: K had steeper slopes of BP with age as compared with those in the low Na: K category. A national survey (WHO SAGE Wave 2 South Africa) conducted in 2015 reported similar findings [31]. This association was first explored in the INTERSALT study, the largest multinational study on 24 h urinary excretion and BP with 10,079 adults across 48 centres worldwide [66]. This implies that a simultaneous increase in K and a decrease in Na will be beneficial in reducing BP with age and ultimately hypertension incidence [38, 66]. As such, strategies such as taxes on high-salt products, labelling and effective communication, voluntary salt commitments by food industries and legislations for Na reduction are warranted. Similarly, to increase K intake, nutrition promotion of K rich fruits and vegetables may be needed, along with policies that make these foods more accessible and affordable. A strength of the study is the use of a large nationally representative sample of participants aged 50+ years, in keeping with the aim of WHO SAGE studies. This design on the other hand, may limit generalization to the entire population. Another potential limitation is the recruitment strategy which resulted in more women than men. Women are known to be more likely to volunteer to participate in surveys than men [71], and this has been observed in other 24 h urine collection studies [31, 39]. Akan is the largest ethnic group in Ghana that is well distributed across the entire country [54] which is why this group was proportionally larger than other ethnic groups in the sample. Additionally, the cross-sectional analysis limits the ability to evaluate the influence of dietary Na and K intake on BP over time. The choice of urine volumes as a sole determinant of completeness of 24 h urine collections requires explanation. Presently, there is no universally accepted standard for determining completeness of 24 h urine collections. The International Consortium for Quality Research on Dietary Sodium/Salt (TRUE), recommends the use of para-aminobenzoic acid (PABA) as being the preferred method [72] but experiences using PABA in African communities is limited and experiences from South Africa [73] suggest that participants may forget or choose not to take their PABA tablets during the urine collection period, thus rendering this method impractical . The TRUE consortium recognized a need to establish further additional measures of assessing 24 h urinary completeness beyond PABA. A systemic review found that no single exclusion criteria (24 h urinary creatinine excretion, creatinine index  25 mmol for women and  30 mmol for men [28]. The applicability of these creatinine excretion reference values across different ethnic groups has recently been questioned [74]. While the TRUE authors concluded that a creatinine index < 0.7 may best increase the sensitivity of eliminating incomplete urine sampling, they go on to promote the use of similar methodologies used by the INTERSALT and INTERMAP studies as the preferred method to determine 24 h urinary completeness in population based studies [27, 75]. These were as follows: samples that fell outside of the collection time of 22–26 h; participants’ indication that the collection was incomplete and that they had spilled ‘more than a few drops’ of urine; or if total urinary volume was < 250 ml. Given that creatinine is generally variable and largely dependent on muscle mass and protein intake [74], and the reference cut-off values in African populations have not been widely validated, we opted to use 24 h urinary volumes ≤300 ml as the measure for incomplete collections. The generally low creatinine excretion values found across the entire cohort suggest a possible low dietary protein intake, but a lack of dietary data precludes further consideration in this regard. This nationwide study of Ghanaians, using 24 h urinary collections, reported a high intake of salt, accompanied by a low K intake. Increasing urinary Na: K ratio was associated with increasing BP with age. Given the high prevalence of hypertension in the study, our findings identify a need for population-wide strategies to reduce dietary salt intake whilst, at the same time, increase K intake in Ghana. The datasets used and/or analyzed during the current study are available from the corresponding author on reasonable request. Cardiovascular diseases Sodium Potassium Creatinine Low- and Middle-Income Countries Non communicable diseases World Health Organization Surveillance, Harness industry, Adopt Standards for marketing and labelling, Knowledge and Environment Blood Pressure Study on global AGEing and adult health Computer Assisted Personal Interview Pan American Health Organization Noguchi Memorial Institute for Medical Research of the University of the Ghana International Population Study on Macronutrients and Blood Pressure International Study of Sodium, Potassium, and Blood Pressure Enumerator Areas Systolic Blood Pressure Diastolic Blood Pressure Pulse Pressure Mean Arterial Pressure Inter Quartile Range Body Mass Index The International Consortium for Quality Research on Dietary Sodium/Salt Para-aminobenzoic acid Cardiovascular diseases (CVDs) https://www.who.int/newsroom/factsheets/-detail/cardiovasculardiseases(cvds). Accessed 12 Jul 2019. WHO. Global status report on noncommunicable diseases 2010. Geneva: WHO; 2011. Google Scholar Erratum. A comparative risk assessment of burden of disease and injury attributable to 67 risk factors and risk factor clusters in 21 regions, 1990–2010: a systematic analysis for the Global Burden of Disease Study 2010. Lancet. 2013;381(9874):1276. Google Scholar Kearney PM, Whelton M, Reynolds K, Muntner P, Whelton PK, He J. Global burden of hypertension: analysis of worldwide data. Lancet. 2005;365(9455):217–23. Article \n    PubMed \n    \n                    Google Scholar Hypertension. https://www.who.int/newsroom/factsheets/detail/hypertension. Accessed 07 Aug 2019. Centre for Health Information Management. Outpatient morbidity in health facilities, Ghana. Accra: Ghana Health Service; 2008. Google Scholar Sanuade O, Boatemaa S, Kushitor M. Hypertension prevalence, awareness, treatment and control in Ghanaian population: Evidence from the Ghana demographic and health survey. PLoS ONE. 2018;13(11):e0205985. https://doi.org/10.1371/journal.pone.0205985. WHO: About 9 voluntary global targets. Global Monitoring Framework for NCDs. https://www.who.int/nmh/ncd-tools/definition-targets/en/. Accesed 22 Feb 2020. WHO and World Economic Forum. From burden to \"best buys\": reducing the economic impact of non-communicable diseases in low- and middle-income countries. Geneva: World Economic Forum; 2011. Google Scholar Salt Reduction. https://www.who.int/news-room/fact-sheets/detail/salt-reduction. Accessed 06 Aug 2019. Institute of Medicine (US). Panel on Dietary Reference Intakes for Electrolytes and Water. In: DRI, dietary reference intakes for water, potassium, sodium, chloride, and sulfate. Washington, DC: National Academies Press; 2005. Google Scholar He FJ. How far should salt intake be reduced? Hypertension. 2003;42(6):1093–9. Article \n    CAS \n    PubMed \n    \n                    Google Scholar He FJ, Li J, Macgregor GA. Effect of longer-term modest salt reduction on blood pressure. Cochrane Database Syst Rev. 2013;346:f1325325. https://doi.org/10.1136/bmj.f1325. Strazzullo P, D'Elia L, Kandala NB, Cappuccio FP. Salt intake, stroke, and cardiovascular disease: Meta-analysis of prospective studies. BMJ (Online). 2009;339(7733):1296. Google Scholar Graudal NA, Hubeck-Graudal T, Jurgens G. Effects of low sodium diet versus high sodium diet on blood pressure, renin, aldosterone, catecholamines, cholesterol, and triglyceride. Cochrane Database Syst Rev. 2017;2017(4). Dickinson HO, Mason JM, Nicolson DJ, Campbell F, Beyer FR, Cook JV, et al. Lifestyle interventions to reduce raised blood pressure: a systematic review of randomized controlled trials. J Hypertens. 2006;24(2):215–23. Article \n    CAS \n    PubMed \n    \n                    Google Scholar Dietary Guidelines Advisory Committee. Adults and sodium: what is the relationship between sodium and blood pressure in adults aged 19 years and older? Washington, D.C: Department of Health and Human Services and Department of Agriculture; 2010. Google Scholar Cobb LK, Anderson CAM, Elliott P, Hu FB, Liu K, Neaton JD, et al. Methodological issues in cohort studies that relate sodium intake to cardiovascular disease outcomes: a science advisory from the american heart association. Circulation. 2014;129(10):1173–86. Article \n    CAS \n    PubMed \n    \n                    Google Scholar WHO. 'SHAKE' the salt habit. Geneva: WHO; 2016. Google Scholar Sookram CDM, Phori PM, Varenne B, Alisalad A. WHO’s supported interventions on salt intake reduction in the sub-Saharan Africa region. Cardiovasc Diagn Ther. 2015;5(3):186–90. PubMed \n    PubMed Central \n    \n                    Google Scholar Cappuccio FP, Kerry SM, Micah FB, Plange-Rhule J, Eastwood JB. A community programme to reduce salt intake and blood pressure in Ghana [ISRCTN88789643]. BMC Public Health. 2006;6. Chockalingam A, Balaguer-Vintro I, Achutti A, De Luna AB, Chalmers J, Farinaro E, et al. The world heart federation's white book: impending global pandemic of cardiovascular diseases: challenges and opportunities for the prevention and control of cardiovascular diseases in developing countries and economies in transition. Can J Cardiol. 2000;16(2):227–9. CAS \n    PubMed \n    \n                    Google Scholar Charlton K, Ware LJ, Menyanu E, Biritwum RB, Naidoo N, Pieterse C, et al. Leveraging ongoing research to evaluate the health impacts of South Africa's salt reduction strategy: A prospective nested cohort within the WHO-SAGE multicountry, longitudinal study. BMJ Open. 2016;6(11). Kowal P, Chatterji S, Naidoo N, Biritwum R, Fan W, Ridaura RL, et al. Data resource profile: the World Health Organization study on global AGEing and adult health (SAGE). Int J Epidemiol. 2012;41:1639–49. Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar World Health Organization. National Report of the World Health Survey in Ghana, 2002–2004. Geneva: WHO; 2006. Google Scholar Protocol for population level sodium determination in 24hr urine samples. https://www.paho.org/hq/dmdocuments/2013/24h-urine-Protocol-eng.pdf. Accessed 15 Jan 2020. Elliott P. Sodium intakes around the world. Background document prepared for the forum and technical meeting on reducing salt intake in populations (Paris 5-7th October 2006). Geneva: WHO; 2007. Google Scholar Stolarz-Skrzypek K, Kuznetsova T, Thijs L, Tikhonoff V, Seidlerová J, Richart T, et al. Fatal and nonfatal outcomes, incidence of hypertension, and blood pressure changes in relation to urinary sodium excretion. J Am Med Assoc. 2011;305(17):1777–85. Article \n    CAS \n    \n                    Google Scholar Ohashi T, Yamaki M, Pandav CS, Karmarkar MG, Irie M. Simple microplate method for determination of urinary iodine. Clin Chem. 2000;46(4):529–36. Article \n    CAS \n    PubMed \n    \n                    Google Scholar RibeiroI KCB, Nolasco EL, VanelliI CP, Mesquita HL, Corrêa JOA. Urine storage under refrigeration preserves the sample in chemical, cellularity and bacteriuria analysis of ACS. J Bras Patol Med Lab. 2013;49(6). Ware LJ, Charlton K, Schutte AE, Cockeran M, Naidoo N, Kowal P. Associations between dietary salt, potassium and blood pressure in south African adults: WHO SAGE wave 2 Salt & Tobacco. Nutr Metab Cardiovasc Dis. 2017;27(9):784–91. Article \n    CAS \n    PubMed \n    \n                    Google Scholar Topouchian JA, El Assaad MA, Orobinskaia LV, El Feghali RN, Asmar RG. Validation of two automatic devices for self-measurement of blood pressure according to the international protocol of the European Society of Hypertension: the Omron M6 (HEM-7001-E) and the Omron R7 (HEM 637-IT). Blood Pressure Monitoring. 2006;11(3):165–71. Article \n    PubMed \n    \n                    Google Scholar O'Brien E, Pickering T, Asmar R, Myers M, Parati G, Staessen J, et al. Working group on blood pressure monitoring of the European Society of Hypertension International Protocol for validation of blood pressure measuring devices in adults. Blood Pressure Monitoring. 2002;7(1):3–17. Article \n    PubMed \n    \n                    Google Scholar Takahashi Y, Sasaki S, Okubo S, Hayashi M, Tsugane S. Blood pressure change in a free-living population-based dietary modification study in Japan. J Hypertens. 2006;24(3):451–8. Article \n    CAS \n    PubMed \n    \n                    Google Scholar Williams B, Mancia G, Spiering W, Rosei EA, Azizi M, Burnier M, et al. 2018 practice guidelines for the management of arterial hypertension of the European society of cardiology and the European society of hypertension ESC/ESH task force for the management of arterial hypertension. J Hypertens. 2018;36(12):2284–309. Article \n    CAS \n    PubMed \n    \n                    Google Scholar Selvarag S, Elbez Y, Sorbets E, Feldman LJ, Eagle KA. Pulse pressure and risk for cardiovascular events in patients with atherothrombosis: from the REACH registry. J Am Coll Cardiol. 2016;67(4):392–403. Article \n    \n                    Google Scholar WHO: Global Physical Activity Questionnaire. https://www.who.int/ncds/-surveillance/steps/resources/GPAQ_Analysis_Guide.pdf. Guideline: Potassium intake for adults and children. 2012. http://apps.who.int/iris/bitstream/10665/77986/1/9789241504829_eng.pdf?ua=1&ua=1 Accessed 21 Aug 2019. Swanepoel B, Schutte AE, Cockeran M, Steyn K, Wentzel-Viljoen E. Sodium and potassium intake in South Africa: an evaluation of 24-hour urine collections in a white, black, and Indian population. J Am Soc Hypertens. 2016;10(11):829–37. Article \n    CAS \n    PubMed \n    \n                    Google Scholar Seko C, Odani K, Wada S, Yoshii K, Segawa H, Kitaoka K, et al. Characteristic dietary habits associated with high values of estimated 24-hours urinary sodium excretion and sodium-to-potassium ratio assessed by age group among the residents of a rural town in Japan. Clin Exp Hypertens. 2020;42(5):449–59. Article \n    CAS \n    PubMed \n    \n                    Google Scholar Morrissey E, Giltinan M, Kehoe L, Nugent AP, McNulty BA, Flynn A, et al. J. Sodium and Potassium Intakes and Their Ratio in Adults (18–90 y): Findings from the Irish National Adult Nutrition Survey. Nutrients. 2020;12:938. Article \n    CAS \n    PubMed Central \n    \n                    Google Scholar Kerry SM, Emmett L, Micah FB, Martin-Peprah R, Antwi S, Phillips RO, et al. Rural and semi-urban differences in salt intake, and its dietary sources, in Ashanti, West Africa. Ethn Dis. 2005;15(1):33–9. PubMed \n    \n                    Google Scholar Monteiro CA, Moubarac JC, Cannon G, Ng SW, Popkin B. Ultra-processed products are becoming dominant in the global food system. Obes Rev. 2013;14(S2):21–8. Article \n    PubMed \n    \n                    Google Scholar Andam KS, Tschirley D, Asante SB, Al-Hassan RM, Diao X. The transformation of urban food systems in Ghana: findings from inventories of processed products. Outlook Agric. 2018;47(3):233–43. Article \n    \n                    Google Scholar Menyanu E, Charlton KE, Ware LJ, Russell J, Biritwum R, Kowal P. Salt use behaviours of ghanaians and south africans: A comparative study of knowledge, attitudes and practices. Nutrients. 2017;9(9). Wentzel-Viljoen E, Steyn K, Lombard C, De Villiers A, Charlton K, Frielinghaus S, et al. Evaluation of a mass-media campaign to increase the awareness of the need to reduce discretionary salt use in the South African population. Nutrients. 2017;9(11). Ghana: Stakeholder Campaign On the Use of Iodated Salt. http://allafrica.com/-stories/-201110060238.html. Accessed 05 May 2020. Intensify Universal Salt Iodization Campaign—Official. http://www.ghananews-agency.org/print/36. Accessed 04 Apr 2020. ICCIDD. Progress of Household Consumption of Iodated Salt in Some African Countries. Iodine Defic Disord Newsl. 2008;31:71–8. Google Scholar Combatting IDD in Ghana. http://www.ign.org/newsletter/idd_nl_may06_ghana.-pdf. Accessed 04 Apr 2020. Menyanu E, Russell J, Charlton K. Dietary Sources of Salt in Low- and Middle-Income Countries: A Systematic Literature Review. Int J Environ Res Public Health. 2019;16(12). Nwanguma BC, Okorie CH. Salt (sodium chloride) content of retail samples of Nigerian white bread: implications for the daily salt intake of normotensive and hypertensive adults. J Hum Nutr Diet. 2013;26(5):488–93. Article \n    CAS \n    PubMed \n    \n                    Google Scholar Will Cassava Remain a Staple Food in the Congo? http://www.fao.org/docrep/-U3550t/. Accessed 8 Mar 2020. Ghana Demographic and Health Survey. http://www.statsghana.gov.gh/docfiles/-publications/2014%20GDHS%20%20Report.pdf. Accessed 10 Mar 2020. National Iodine Survey Report 2015. https://www.ghanahealthservice.org/-downloads/Iodine_Survey_Report.pdf Accessed 28 Mar 2020. Keogh JB, Lange K, Hogarth R, Clifton PM. Foods contributing to sodium intake and urinary sodium excretion in a group of Australian women. Public Health Nutr. 2013;16(10):1837–42. Article \n    PubMed \n    \n                    Google Scholar Villani AM, Clifton PM, Keogh JB. Sodium intake and excretion in individuals with type 2 diabetes mellitus: a cross-sectional analysis of overweight and obese males and females in Australia. J Hum Nutr Diet. 2012;25(2):129–39. Article \n    CAS \n    PubMed \n    \n                    Google Scholar Margerison C, Riddell LJ, Wattanapenpaiboon N, Nowson CA. Dietary sources and meal distribution of sodium and potassium in a sample of Australian adults. Nutr Diet. 2013;70(4):294–9. Article \n    \n                    Google Scholar Chariton K, Yeatman H, Houweling F, Guenon S. Urinary sodium excretion, dietary sources of sodium intake and knowledge and practices around salt use in a group of healthy Australian women. Aust N Z J Public Health. 2010;34(4):356–63. Article \n    \n                    Google Scholar Sarmugam R, Worsley A, Flood V. Development and validation of a salt knowledge questionnaire. Public Health Nutr. 2014;17(5):1061–8. PubMed \n    \n                    Google Scholar Consensus Action on Salt and Health Salt and Your Health—TNS Public Opinion Survey Summary report. http://www.actiononsalt.org.uk/Docs/39307.pdf. Accessed 07 Mar 2020. Stadlmayr B, Charrondière UR, Burlingame B. Development of a regional food composition table for West Africa. Food Chem. 2013;140(3):443–6. CAS \n    PubMed \n    \n                    Google Scholar Food and Agriculture Organization. Food balance sheets: a handbook, Economic and Social Development Department, Food and Agriculture Organization of the United Nations, Rome, Italy; 2012. Google Scholar Yawson DO, Adu MO, Ason B, Armah FA, Boateng E, Quansah R. Ghanaians might be at risk of excess dietary intake of potassium based on food supply data. J Nutr Metab. 2018. https://doi.org/10.1155/2018/5989307. Aburto NJ, Hanson S, Gutierrez H, Hooper L, Elliott P, Cappuccio FP. Effect of increased potassium intake on cardiovascular risk factors and disease: Systematic review and meta-analyses. BMJ (Online). 2013;346(7903). Rose G, Stamler J, Stamler R, Elliott P, Marmot M, Pyorala K, et al. Intersalt: an international study of electrolyte excretion and blood pressure. Results for 24 hour urinary sodium and potassium excretion. Br Med J. 1988;297(6644):319–28. Article \n    \n                    Google Scholar Stamler J, Chan Q, Daviglus ML, Dyer AR, Van Horn L, Garside DB, et al. Relation of dietary sodium (salt) to blood pressure and its possible modulation by other dietary factors the intermap study. Hypertension. 2018;71(4):631–7. Article \n    CAS \n    PubMed \n    \n                    Google Scholar Charlton KE, Steyn K, Levitt NS, Zulu JV, Jonathan D, Veldman FJ, et al. Diet and blood pressure in South Africa: intake of foods containing sodium, potassium, calcium, and magnesium in three ethnic groups. Nutrition. 2005;21(1):39–50. Article \n    CAS \n    PubMed \n    \n                    Google Scholar Olde Engberink RHG, Van Den Hoek TC, Van Noordenne ND, Van Den Born BJH, Peters-Sengers H, Vogt L. Use of a single baseline versus multiyear 24-hour urine collection for estimation of long-term sodium intake and associated cardiovascular and renal risk. Circulation. 2017;136(10):917–26. Article \n    CAS \n    PubMed \n    \n                    Google Scholar Lerchl K, Rakova N, Dahlmann A, Rauh M, Goller U, Basner M, et al. Agreement between 24-hour salt ingestion and sodium excretion in a controlled environment. Hypertension. 2015;66(4):850–7. Article \n    CAS \n    PubMed \n    \n                    Google Scholar Markanday S, Brennan SL, Gould H, Pasco JA. Sex-differences in reasons for non-participation at recruitment: Geelong Osteoporosis Study. BMC Res Notes. 2013;6(1). Campbell NRC, He FJ, Tan M, Cappuccio FP, Neal B, Woodward M, et al. The International Consortium for Quality Research on Dietary Sodium/Salt (TRUE) position statement on the use of 24-hour, spot, and short duration (&lt;24 hours) timed urine collections to assess dietary sodium intake. J Clin Hypertens. 2019;21(6):700–9. Article \n    \n                    Google Scholar Charlton KE, Steyn K, Levitt NS, Peer N, Jonathan D, Gogela T, et al. A food-based dietary strategy lowers blood pressure in a low socio-economic setting: a randomised study in South Africa. Public Health Nutr. 2008;11(12):1397–406. Article \n    PubMed \n    \n                    Google Scholar John KA, Cogswell ME, Campbell NR, Nowson CA, Legetic B, Hennis AJM, et al. Accuracy and usefulness of select methods for assessing complete collection of 24-hour urine: a systematic review. J Clin Hypertens. 2016;18(5):456–67. Article \n    CAS \n    \n                    Google Scholar Stamler J, Elliott P, Dennis B, Dyer AR, Kesteloot H, Liu K, et al. INTERMAP: background, aims, design, methods, and descriptive statistics (nondietary). J Hum Hypertens. 2003;17(9):591–608. Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Download references The authors thank all participants for their contributions. We acknowledge the support of Noguchi Memorial Institute for Medical Research of the University of the Ghana and Liberty Medical Laboratory, Accra for the analysis of urinary electrolytes. The content of this manuscript is solely the responsibility of the authors and does not necessarily represent the official views of the World Health Organization or the funding bodies. This work is supported by an agreement with the CDC Foundation with financial support provided by Bloomberg Philanthropies, and a Partnerships & Research Development Fund (PRDF) grant from the Australia Africa Universities Network. SAGE is supported by WHO and the Division of Behavioral and Social Research (BSR) at the National Institute on Aging (NIA), US National Institutes of Health, through Interagency Agreements with WHO [OGHA 04034785; YA1323–08-CN-0020; Y1-AG-1005-01] and a Research Project Grant [R01AG034479]. LW is supported by the South African DSI-NRF Centre of Excellence in Human Development. School of Medicine, Faculty of Science, Medicine and Health, University of Wollongong, Northfields Avenue, Wollongong, NSW, 2522, Australia Elias K. Menyanu & Karen E. Charlton Neuroscience Institute, National Research Council, Padova, Italy Barbara Corso, Nadia Minicuci & Ilaria Rocco School of Health and Society, Faculty of Social Sciences, University of Wollongong, Northfields Avenue, Wollongong, NSW, 2522, Australia Joanna Russell SAMRC/Wits Developmental Pathways for Health Research Unit, University of the Witwatersrand, Johannesburg, South Africa Lisa J. Ware DSI-NRF Centre of Excellence in Human Development, University of the Witwatersrand, Johannesburg, South Africa Lisa J. Ware Department of Community Health, University of Ghana, Accra, Ghana Richard Biritwum Chiang Mai University Research Institute for Health Sciences, Chiang Mai, Thailand Paul Kowal World Health Organization (WHO), Geneva, Switzerland Paul Kowal School of Public Health and Community Medicine, University of New South Wales; The George Institute for Global Health, Sydney, NSW, 2052, Australia Aletta E. Schutte Hypertension in Africa Research Team, North-West University, Potchefstroom, 2520, South Africa Aletta E. Schutte Illawarra Health and Medical Research Institute, Wollongong, NSW, 2522, Australia Karen E. Charlton You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar Authors contributions were as follows: KC, PK and LW designed the study; RB implemented the research; NM, BC and EM managed the data and conducted the analysis; EM, KC, JR, AES wrote the paper. KC takes responsibility of the content of this paper. All authors read and approved of the final manuscript. Correspondence to\n                Karen E. Charlton. The study obtained approval from the WHO Ethics Committee (RPC 149) and the University of Ghana Medical School Ethics and Protocol Review Committee (MS-Et/M.03 - P 3.1/2005–2006). Participants provided written informed consent following explanation of the study procedure in their home language. Not applicable. The authors declare that they have no competing interests. Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Na, K, Cl and Cr of original and repeat data in the same participants in Alajo EA. Table S2. Urine results for electrolytes, creatinine and iodine by sex (urine data considered valid if volume > 300 ml), WHO-SAGE Ghana Wave 3. Table S3. Urine results for electrolytes, creatinine and iodine by age (urine data considered valid if volume > 300 ml), WHO-SAGE Ghana Wave 3. Table S4. Salt knowledge, attitudes and behaviour and fruits and vegetable consumption by age category, sex and location (n = 837), nested sub study; WHO-SAGE Ghana Wave 3. Open Access This article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if changes were made. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit http://creativecommons.org/licenses/by/4.0/. The Creative Commons Public Domain Dedication waiver (http://creativecommons.org/publicdomain/zero/1.0/) applies to the data made available in this article, unless otherwise stated in a credit line to the data. Reprints and Permissions Menyanu, E.K., Corso, B., Minicuci, N. et al. Salt and potassium intake among adult Ghanaians: WHO-SAGE Ghana Wave 3.\n                    BMC Nutr 6, 54 (2020). https://doi.org/10.1186/s40795-020-00379-y Download citation Received: 04 May 2020 Accepted: 04 September 2020 Published: 29 September 2020 DOI: https://doi.org/10.1186/s40795-020-00379-y Anyone you share the following link with will be able to read this content: Sorry, a shareable link is not currently available for this article.  Provided by the Springer Nature SharedIt content-sharing initiative Advertisement ISSN: 2055-0928 By using this website, you agree to our\n            Terms and Conditions,\n            Your US state privacy rights,\n            Privacy\n                statement and\n            Cookies policy.\n            \n                Your privacy choices/Manage cookies we use in the preference centre. © 2023 BioMed Central Ltd unless otherwise stated. Part of\n            Springer Nature. ",
    "datetime": null,
    "url": "https://bmcnutr.biomedcentral.com/articles/10.1186/s40795-020-00379-y"
}