{
    "title": "Samsung Brings Famed K-Drama and K-Pop Content for Indian Consumers on its ‘My Galaxy’ App – Samsung Newsroom India",
    "text": "Samsung Newsroom's videos will no longer be supported on Internet Explorer. Please try a different type of web browser.  This site uses cookies. By continuing to browse the site you are agreeing to our   use of cookies. As a part of its commitment to offer enriching consumer experience to its users, Samsung India today announced a wide range of popular Korean content on its ‘My Galaxy’ app, which is an entertainment hub for Samsung users.    International blockbuster K-drama titles Jugglers, Queen for Seven Days and Manhole will now be exclusively available on the ‘My Galaxy’ app for Samsung consumers in India, in partnership with KBS Media. That’s not all, Samsung consumers will also get access to over 750 K-pop songs of top artists and bands such as BTS, Exo, BTOB, MONSTA-X among others.  “We value the interests and taste of our consumers and there is absolutely no doubt about the growing popularity of K-pop culture in India. Keeping in mind the evolving entertainment needs of Indian millennials, we are delighted to bring K-content on our ‘My Galaxy’ App. Samsung customers can now access K-pop music and exclusive K-drama on their favorite Samsung smartphone. We are confident that the famed K-content will resonate well with our young consumers,” said Pramod Mundra, Senior Director, Samsung India, commenting on the growing trend of Korean content consumption amongst Indian millennials.    K-pop and K-drama have become the drivers of interest in Korean culture globally. Even in India, the Korean wave is starting to gain prominence, especially among millennials. There has been special interest in Korean culture among youngsters from the age group of 18-24 years across metros and Tier 1 cities. ‘My Galaxy’ app continues to provide Samsung consumers in India the most distinctive content to meet their growing entertainment needs.  The Korean content streaming on the ‘My Galaxy’ app includes:  Jugglers – A rom-com drama, it is the story of equation between a secretary and her boss and how it completely flips outside office.  Queen for 7 days – A historical drama, it portrays the story of a queen who is on the throne for seven days and her love story with King LeeYeok and Lee Yung.    Manhole – This Korean drama captures the journey of Pil. The lead actor time travels to stop his crush of 28 years from getting married.  K-Pop – Korean pop music videos from top artists such as BTS, EXO, BTOB, MONSTA-X with over 750 songs (over 45 hours of content).  To watch the drama series and access the music bank, download the ‘My Galaxy’ app (www.tinyurl.com/hvfdx2d)  Besides K-content, ‘My Galaxy’ app offers a unique all-in-one experience including videos, music, games, news and personalized offers and updates. Currently there are over 20 million ‘My Galaxy’ app users in India. TAGSK-dramaKorean ContentMy GalaxyMy Galaxy AppSamsung India Corporate > Others Download For any issues related to customer service, please go to samsung.com/in/support for assistance.\n                                For media inquiries, please contact corpcommindia@samsung.com. Check out the latest stories about Samsung SAMSUNG Copyright© 2010-2023 SAMSUNG All Rights Reserved. Sitemap ",
    "datetime": null,
    "url": "https://news.samsung.com/in/samsung-brings-famed-k-drama-and-k-pop-content-for-indian-consumers-on-its-my-galaxy-app"
}