{
    "title": "Sandy Pirates Invade Big Corona Beach - Newport Beach News",
    "text": "Hundreds of landlubbers flocked to Corona del Mar State Beach over the weekend to watch sand sculpted into castles, marine life and treasure chests. More than two dozen teams participated in the 56th Annual Corona del Mar Sandcastle Contest on Sunday. This year’s theme was “Pirates of the Pacific.” For some it was their first time participating in the competition, but others are seasoned sand sculptors, like Brooke James and her family team of Sand and Deliver. She’s been creating sandy art since she was a kid, along with her father, Paul, and mother, Robin Weigand. They started joining sandcastle competitions around southern California about 21 years ago, when she was a teen. “This is one of my favorite (contests),” she said of the CdM event. The sand, weather and atmosphere make the annual Newport Beach event one of the best the family has ever participated in, they all agreed. Paul James usually comes up with the master plan before they get to the beach, “but I throw in my two cents,” Brooke James added. This year, Brooke James’ boyfriend David Turner also joined in. Together the team of four earned first place for most unique sandcastle for their “Castle of Doom” sculpture, named after they had some structural challenges early on in the day. Buccaneers from K-Wave Radio took the top prize of the Commodore’s Award for best overall creation. Imperial Beach Posse won both for best display of theme and the people’s choice awards. Judges this year were Newport Beach City Manager Dave Kiff, Mayor Kevin Muldoon, City Councilwoman Diane Dixon, and NB Chamber of Commerce Commodore Club members Dorothy Larson and Marie Case. A Captain Jack Sparrow impersonator also attended the event. The event was hosted by the Newport Beach Chamber of Commerce’s Commodore’s Club and sponsored by the UPS Store and the Los Angeles Rams. For more information, visit newportbeach.com. Log in to leave a comment                      Newport Beach Independent Newspaper Newport Beach Magazine Newport Beach Country Club Magazine Coastal Real Estate Guide (NB,LB, CDM) California Business Journal (partner) Laguna Beach Independent Newspaper Laguna Beach Magazine Laguna Beach City Guide On The Menu Laguna Beach Montage Magazine Monarch Beach Resort Magazine Pacific Coast Magazine (SoCal) Omni Escapes Hotel Magazine View our entire portfolio here  ",
    "datetime": "2017-10-05T01:56:23+00:00",
    "url": "https://www.newportbeachindy.com/sandy-pirates-invade-big-corona-beach/"
}