{
    "title": "SBS PopAsia: the answer to Eurovision",
    "text": "We’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. This was published 9 years ago Add articles to your saved list and come back to them any time. Australia has a love affair with Eurovision not witnessed in many countries outside the EU, as shown by the massive Australian audience that tuned into this year's broadcast. Something about the sparkles and over-the-top cheesiness draws us in. I'm backstage at the Hanoi Opera House for the second Asia-Pacific Broadcasting Union's TV Song Festival, for SBS PopAsia. It's my second time hosting it too, but it's not the second time I've thought to myself that a \"proper\" AsiaVision (as many wanted to call the ABU's precursor) would be epic, because as spectacular as Eurovision is, Asian Pop is a whole other kettle of awesome. South Korean boy band Big Bang defeated British boy band One Direction for the best fans award at last year's MTV Italy TRL Awards. By \"proper\" I mean it would have to be competitive. At present the ABUs are a goodwill, voluntary showcase with participants from 15 of the Asia-Pacific Broadcasting Union's member nations. There have been several attempts at an AsiaVision in the past, but I don't think the timing has ever been as ripe as now. Australia's own pop star Dami Im is a sign of things to come. What really brought Asian pop to the forefront in Australia and among many Western audiences was Gangnam Style. Nearly a record 2 billion views on YouTube as I write this. The whole world has been introduced to a whole new Asian pop universe it never knew existed. SBS PopAsia was the first in Australia to play Gangnam Style on radio and TV – a month before it exploded – but we never anticipated the way it would turn into the international phenomenon it is today and introduce everyone to the amazingly wacky world of K-Pop. The market for K-Pop, J-Pop and C-Pop globally is huge and the audience is unrivalled in its devotion and buying power. The bands and artists inspire devotion that makes Beliebers look tame. At last year's MTV Italy TRL Awards, South Korean boy band Big Bang defeated British boy band One Direction for the best fans award. Everyone knows how devoted the One Directioners are, so the thought that they were out-voted by another set of fans is pretty mind-blowing. South Korea's answer to One Direction's Harry Styles (left): Big Bang's T.O.P. (right)* corrected. Globally, Japan is the second largest music market in the world, beaten only by the United States. J-Pop girl band of the moment AKB48 consistently sells at least 1 million copies of their new single on the first day of release. Their latest single, Heart Ereki, marks their 14th consecutive million-selling single. Even Queen Beyonce, who is now wowing Australian audiences, waited a whole week to sell half a million copies of B'Day. The Asian pop phenomenon is also starting to make inroads in the notoriously difficult US market. Following Big Bang's success in Europe, MTV's global music brand, MTV Iggy, crowned fellow K-Pop idols 2NE1 best new band. Australians Justice Crew are among the PopAsia competitors. Recently US fashion magazine Complex crowned Big Bang's leader G-Dragon the biggest Asian pop star in the world – “if we pretend that Gangnam Style never happened”. They noted that his unique personal style has “piqued the curiosity of American tastemakers”. With the tastemakers term used liberally, Justin Bieber was recently snapped hanging out with the K-Pop star and talk abounds of a collaboration. As for Australia, ARIA nominees Justice Crew, who are Australia's entry to the ABUs this year, are huge fans of K-Pop and have been known to indulge the passion when they visit PopAsia studios. We also returned home from Hanoi to hear that South Korea's Dami Im had just won The X Factor. Yes, I take her victory as a sign that Australians are ready for more PopAsia, too. Australia is well represented in the Asian Pop stakes with a number of home-grown talents starting to make waves overseas. The most well known is Sydney boy Rome, who is one part of boy band C-Clown – a rookie group that has already had a No. 1 album in South Korea. Other Aussies catching the K-Wave include Kevin from boy band Z:EA and Peter and Young Sky from One Way – who also pen music for other K-Pop stars. When we break the bare facts down to numbers we can't go past the fact that Asia has a population of nearly 5 billion. Europe has nearly 740 million and the entire continent goes crazy every year in support of their home-grown talent. Can you imagine how that would look among 5 billion? Judging by this year's Song Fest, we are well on our way to finding out. This year's line-up features some star power and plenty of rock and pop. South Korea's Sistar, Japan's May'n and Australia's Justice Crew lend their star power to the show, delighting with their hit singles, tight choreography and in Justice Crew's case, acrobatic feats. Sri Lanka's adorable twin boys Sarith and Surith bring on the showmanship, playing an electric guitar using a violin bow. Indonesia's Shella and Putri deliver a powerful ballad wearing gorgeous, flowing costumes reminiscent of the sorcerers in Japanese animation. Then the girls go wild when popular Vietnamese band the Pentatonic rocks it out for the final performance. In a nutshell, this year's ABU Song Fest has the cheese, the sparkly costumes, the happy pop tracks, the dramatic ballads and even the surprising rock acts that fans of Eurovision are looking for. And although it's not a competition (yet), we can amuse ourselves by playing a round of \"what if?\" The Asia-Pacific Song Festival, hosted by SBS PopAsia's Jamaica Dela Cruz, airs at 7pm on Saturday, November 9, on SBS 2.  Copyright © 2023 ",
    "datetime": "2013-11-07T07:59:10+00:00",
    "url": "https://www.smh.com.au/entertainment/tv-and-radio/sbs-popasia-the-answer-to-eurovision-20131107-2x47a.html"
}