{
    "title": "Se7en, Sangchu Jailed for Massage Parlor Excursion",
    "text": "Korean pop stars reprimanded for military ill-discipline, actor Rain cleared By \n\n\tPatrick Frater Asia Bureau Chief HONG KONG – South Korea’s Ministry of National Defense announced Thursday that it will punish three celebrities and five support staff serving in the military. They were found guilty of visiting illegal massage parlors that provide adult services while on official leave to perform at a concert. The army named them as K-pop singing star Se7en (pictured, real name Choi Dong-wook) and Sangchu (aka Lee Sang-chul, part of singing duo Mighty Mouth). It also cited five publicists for using cellphones while away from their barracks and an eighth person for leaving his post. Choi and Lee were given 10-day military jail sentences and will have their mandatory military service extended, but the offenses will not be counted as criminal. The five other were given four-day jail sentences.  The celebrity-soldiers were filmed late at night in June by a TV crew from the news show “Scene 21.” First they tried to enter a Chinese-run establishment, then a Thai massage parlor.  “We’ve judged that they were there just to get massages, not for sexual trafficking, but they were handed military prison sentences because they violated several military regulations,” the military said in a statement. Superstar-singer-actor, Rain (“Speed Racer,” “Ninja Assassin,” “I’m a Cyborg But That’s OK”) was also shown in the news footage, but the Defense Ministry said he had not done anything worthy of discipline. He completed his military service two weeks ago. Earlier this month the Defense Ministry said that it has now abolished the Defense Media Agency, otherwise known as the ‘celebrity corps,’ a unit that had been home to stars and performers while they served their military service. Its 15 members will be reassigned to other units beginning Aug. 1. “The promotional support brigade was set up to promote the military and raise the morale of soldiers, but due to the unpleasant issues that have occurred, the military’s image has only been tarnished,” read an official army statement. A Variety and iHeartRadio Podcast The Business of Entertainment ",
    "datetime": "2013-07-26T14:38:03+00:00",
    "url": "https://variety.com/2013/biz/asia/se7en-sangchul-jailed-for-massage-parlor-excursion-1200568540/"
}