{
    "title": "Seo Taiji Pulls Inspiration From New Wave & Tim Burton on Comeback Album ‘Quiet Night’ – Billboard",
    "text": "The K-pop legend returns after five years with an album to appeal to today's youth and the 30- to 40-year-olds. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin Following his groundbreaking start with Seotaiji and the Boys in the ’90s, Seotaiji has remained an important musical figure in Korean music with his experimental rock- and metal-inspired albums. The 42-year-old introduced Quiet Night, his ninth solo album and first in five years, via “Sogyeokdong,” a collaboration with IU on vocals that revealed K-pop legend’s new sonic muse as ’80s-inspired new wave and synth-pop. The track acted as an accessible, dreamy first taste to the LP that feels like a deep exploration into the world of old-school synthesizer sounds. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t10/27/2014\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tExplore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news The album opens with the intro track “Into” that mixes jingle bells with shimmering synths before leading into Seo Taiji‘s solo version of “Sogyeokdong.” While his version is just as dreamy at IU’s, the take lacks a bit of the warmth that IU’s honeyed harmonies offer, perhaps due to the effects added on to his vocals or different key. Still, it’s a big treat to get two different takes of one of the best songs to come out of Korea this year.  Quiet Night then moves into second single “Christmalo.Win” that feels like the type of track Tim Burton would feature on his next film. Possibly taking an inspiration from Burton’s beloved 1993 film The Nightmare Before Christmas, the track mentions aspects of Christmas and Halloween (Santa, trick-or-treating and Christmas wine) with even a few Halloween Town-esque voices cackling and squawking over the spastic synth-rock production. The twisted-holiday theme is kept in the epic, nine-minute accompanying video that features a little girl in a world of witches, devils and haunted pumpkins looking to find Santa Claus.   Album closer “The Christmas Miracle” is the last reference towards holidays on the album as the longest song of the album concluding the disc with a soothing mix of piano, woodwinds, jinging bells and synth squishing. But that’s not before other spectacular synth standouts including “90s ICON,” a rushing, woozy mix of ominous synths and strong piano melodies centered around a chorus where Seo Taiji’s vocal tiptoe from note to note. The new-wave influence is probably best heard in “Fighter of the Forest,” that appearas to include a sample of Matt Wilder‘s “Break My Stride,” a top 5 hit on the Billboard Hot 100 in the early ’80s. With the K-pop market flooded with K-pop idols and hip-hop stars, Seo Taiji asfound a way to tap into the youth consciousness while still providing music that can be enjoyed by an older generation, taking the latter back to a time when maybe they too were inundated and in love with pop music.   Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2014-10-28T01:07:45+00:00",
    "url": "https://www.billboard.com/music/music-news/seo-taiji-quiet-night-album-new-wave-nightmare-before-christmas-6296837/"
}