{
    "title": "Seoul, South Korea: The next big Asian city for Kiwi travellers | Stuff.co.nz",
    "text": "Kiwis love to travel. At any one point, it's estimated there are more than a million of us living overseas or taking a holiday. Asia has long been one of our main playgrounds, with the likes of Singapore, Hong Kong and Tokyo forming a golden triangle of easy exploration. But this weekend marks the start of an exciting new era for travellers. Air New Zealand returns to South Korea, with direct services to Seoul. The last time the national carrier flew to Korea the Spice Girls were telling us what they really, really want and Titanic had just hit cinemas. In other words, a long time ago. READ MORE: * Kiwi life: 'I settled here to live in a land that did things differently' * Insider tip: Seoul * Tourists ride 'Korean medical wave' A lot has changed; Seoul has a new soul that will be a hit with New Zealanders. Think green spaces, ancient traditions, and hyper-modernity all blended with a delightful dash of Korean culture. Here's what you can't miss. KIWIS LOVE K-WAVE South Korean culture is exploding in popularity around the world, and it's known as the \"K-wave\". Let me explain. Almost everyone on the planet is familiar with the dance in Gangnam Style - but few realise the song is referring to a district in Seoul. Gangnam is all about fashion, beauty, parties, shopping and flash cars. It's a little like what Ponsonby is to Auckland, although \"Oppa Ponsonby Style\" doesn't quite have the same ring. Gangnam is ground-zero of K-wave - it's the Hollywood of Korea. Alongside the pop stars are thousands of beauty shops selling everything from snail secretion facials to face masks laced with salmon sperm DNA - apparently, great for regeneration. Airbnb has started offering Experiences, where locals offer tours or workshops for travellers. Many of these are beauty courses - such as making natural skincare or even a beauty session with a TV presenter who promises to take five years off your face in just two hours. And Kiwis seem to be loving it, with Airbnb reporting Australia and New Zealand is their most popular market for those seeking out K-wave experiences. A visit to Gangnam is unmissable - not just for the shopping or beauty - but to get an insight into the cutting edge of Seoul (with the emphasis on cutting). Gangnam is also the plastic surgery capital of the world, with around 400 clinics in the district. CRAZY CAFES My eyes can't quite figure out what's going on - I've just stepped into a parallel universe, that happens to serve coffee. It's called Cafe Yeonnam-Dong, and it's a little like walking through a cartoon. The eatery is designed in a black and white comic-strip theme, that tricks the eyes into thinking everything is two-dimensional. It's not until you see a person walking through, that you realise it's not some elaborate computer generation. Seoul has no shortage of other fun places to eat, like Urban Space, where you can sip your latte in a pool of plastic balls next to giant teddy bears and unicorns. The food at these places is pretty pedestrian, so here's what to do when it's time for some serious gluttony. SEOUL'S SIZZLING SIDE Let's get one thing straight: the best Korean food is full of carbs. We're talking dumplings, crispy pancakes, barbeque pork, Korean mixed rice (Bibimbap), a kaleidoscope of noodle dishes, and did I mention, dumplings. If you've got a metabolism like me, you probably put on weight just reading that. But, don't worry - you'll do a serious amount of walking to offset your frequent frying. An excellent place to start is Namdaemun Market, home to around 10,172 stalls, likely selling enough knick-knacks to construct a spaceship. And dotted around this kingdom of trinkets are hundreds of food stalls. Save yourself time and get an expert to guide you around. We found a Night Market Food Tour on Airbnb's Experiences - and it did not disappoint. We started with Korean doughnuts, then a visit to Seoul's dumpling lady - who became world-famous after staring in a Netflix series. Next, we entered uncomfortable territory: wiggling octopus legs. This is called San-nakji, where the tentacles continue to move long after death. It can be a little dangerous because the suction cups on the legs can stick to your throat if they're not adequately chewed. And nobody wants to spend too much time chewing on wriggling legs, so they often just gulp it down. Therein lies the problem. I was dared by our group to eat the largest piece, to which our guide quickly interjected: \"I wouldn't recommend that for a first-timer.\" For some reason that still eludes me, I decided to reject that advice and put the biggest wriggler in my mouth. I had 12 minutes and 38 seconds of chewing, all of which was filled with sincere regret, then relief that nothing clung on. Much-more tasty delights soon followed, including a stop at a restaurant dedicated to crispy pancakes. Also, don't miss a Korean BBQ - where you grill meat on your table, then mix it with vegetables and noodles. WALK OF DOUBT My blood pressure is going up just writing this - Korea's tallest tower is also home to the world's tallest glass-floor observation deck. The Lotte Tower can be seen from all corners of the city; its super-sleek design a striking contrast to the temples, palaces and medieval villages far below. If your idea of fun is transparent floors, you'll want to head straight to level 123 where you can look down on ant-like humans almost half a kilometre below. If you prefer your fun lined with concrete, at the base of the tower, you'll find an enormous indoor theme park. A NIGHT TO REMEMBER Hotels don't come cheap in South Korea - but thankfully there's a much more affordable option. Koreans love Airbnb, with more than 45,000 rental options nationwide. We stayed in a Hanok, a traditional style of housing; part of the 600-year-old Bukchon Village. Our house was like a miniature palace, with lavish furnishings and a central courtyard that everything was constructed around. Our next few nights were spent in an eco-apartment, with plants and creepers hanging from the furniture, lights, bed rails and even stairs. It's designed to bring a sense of nature into an otherwise clinical space, and I loved it. Both options were nothing like a hotel. CALM MEETS CHAOS Koreans love to escape the chaos of 10 million people, with special spaces designed to calm the mind. The city has a new Skygarden, built on a former highway, complete with 24,000 plants - similar to New York's High Line. There's also an 11-kilometre vein of greenery which runs through the city - called the Cheonggyecheon Stream. The river was once covered by a highway - but it has all been demolished and restored as part of a significant urban renewal project that is hugely popular with locals. There are also five royal palaces scattered throughout the city that all exude a quiet calm of the Middle Ages. For every temple, shrine, palace or ancient village Seoul has - there's an equal amount of cutting edge design. You'll find the tallest gold-clad building in the world - simply called Building 63. The Dongdaemun Design Plaza looks like an enormous spaceship landed in the city, and it contains a design museum with an equally mind-bending interior. The Starfield Library even has bookshelves that curve three storeys to the top of the roof. The biggest challenge is fitting everything in. After 10 days, we'd only just scratched the surface. Getting there: Air New Zealand has just started direct services to Seoul, with connections across the domestic network. These will run three to five times a week depending on the season. See: airnz.co.nz Carbon footprint: A return journey for one passenger in economy class from Auckland to Seoul would generate 2.66 tons of CO2.  To calculate and offset your carbon emissions head to airnewzealand.co.nz/sustainability-customer-carbon-offset. Staying there: Airbnb has no shortage of options for every budget. See: airbnb.co.nz Playing there: Airbnb has more than 600 Experiences throughout the city, from K-Beauty to food tours. For K-wave Experiences: airbnb.co.nz/kwave For general Experiences :airbnb.co.nz/experiences The author's trip was supported by Air New Zealand and Airbnb. BE IN TO WIN WITH AIR NEW ZEALAND Visit the Air New Zealand marquee at the Night Noodle markets to enter a competition with the chance to win economy flights for two to one of Air New Zealand's non-stop Asia destinations. The Auckland Night Noodle Markets will be held at Victoria Park from 29 November to 08 December from 4pm. See nightnoodlemarkets.nz. © 2023 Stuff Limited ",
    "datetime": "2019-11-23T16:00:00.000Z",
    "url": "https://www.stuff.co.nz/travel/destinations/asia/117521595/seoul-south-korea-the-next-big-asian-city-for-kiwi-travellers"
}