{
    "title": "Seoul to start branding K-Beauty, announced at Newsis",
    "text": "September 16, 2021 07:35 ET\n\n\r\n            | Source:\r\n            \nNewsis\n\n\n\n\n\nNewsis\n\r\n                  Seoul,  KOREA, REPUBLIC OF Seoul,  KOREA, REPUBLIC OF SEOUL, South Korea, Sept.  16, 2021  (GLOBE NEWSWIRE) -- At the 'City Seoul, Branding K-beauty' conference of '2021 NEWSIS K-Expo', which was broadcast on YouTube from 5 pm KST on 16th of September, overseas panels who participated online and domestic panels who participated offline came up with plans for K-Beauty to grow along with the Korean Wave after the Covid-19 pandemic. James Chang, CEO of Lazada Singapore, emphasized, \"We would like to meet more Southeast Asian customers and introduce a variety of products by introducing K-beauty.\" It is all because he is focusing on the Korean Wave. Looking at the market share of beauty products in Southeast Asia, South Korea surged from 8.9% in 2016 to 11% last year. Lazada introduced 'Laz Korea', a Korean product specialty store, and introduced Hallyu star 'Hyun Bin' as a publicity ambassador. Jan Geweise, a senior researcher at the Consumer Business Insights team at Statista, a German market research institute, said, \"The potential of the Korean beauty industry is very large after the pandemic; K-beauty exports will continue to grow.\" Domestic beauty experts ordered industry innovation measures to prepare for the post-pandemic. They also poured out policy suggestions for the Seoul Metropolitan Government and the government. Jinpyo Lee, Head of Strategic Division in Amorepacific Group said, \"Just as we created a new category called 'cushion' and spread a new makeup method and culture that is different from the existing ones, we planted an image of leading K-beauty innovation to consumers around the world through innovative products.\" \"From now on, the Seoul Metropolitan Government should organize and share information on areas of common interest, such as eco-friendliness, and gather wisdom to create a place where Beauty Seoul can succeed and provide continuous support.\" Creator Risabae, who has 2.24 million YouTube subscribers, said, \"In the past, overseas viewers mainly responded to cover makeup videos of domestic and foreign celebrities, but now they are showing a lot of interest in everyday makeup styles. I feel a growing interest in K-beauty styles that bring out their natural beauty.\" Kyung-ah Han, secretary general of the Visit Korea Committee, said, \"If you pick 10 brands that first come to mind when you think of 'South Korea', Samsung is the first, but 6 cosmetic brands are included in the top 10. Products, exports, and sales are important, but if we provide tourists with opportunities to experience K-beauty, we will be able to secure loyal customers.\" Jae-ran Lee, president of the Foundation of Korea Cosmetic Industry Institute, also said, \"The Korean cosmetic industry is developing innovative products in a short time and leading the global trend as the Korean Wave. I hope that it will develop in a way that meets the needs of overseas customers by continuing to produce innovative products that combine eco-friendliness and hyper-personalization.\" Dae-woo Park, head of the Seoul Economic and Job Planning Office, said, \"Seoul is the largest place in the country with the largest share of sales in the Hair&Skin beauty industries in the country. The city of Seoul plans to foster and support the beauty industry and create a city full of beautiful charm by converging excellent infrastructure.\" Newsis K-Expo started in 2019 and this is the 3rd time. It is an event to explore the sustainability of the Korean Wave, encompassing not only culture such as music, TV dramas, and movies, but also industries such as beauty, F&B, and tourism. K-pop group 'Seventeen' won the Korean Wave Culture Awards. Hugel, Lotte World Tower, Amorepacific, OB Beer won the Korean Wave Corporate Awards. K-pop group 'Loona' and 'Kingdom' held a celebratory performance. Contact : Kim, Jeong-Hwan, ace@newsis.com +82-2-721-7436 A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/a661dd3a-91c2-40d6-bc0e-79f0fd3901a3 The photo is also available at Newscom, www.newscom.com, and via AP PhotoExpress. ",
    "datetime": null,
    "url": "https://www.globenewswire.com/en/news-release/2021/09/16/2298328/0/en/Seoul-to-start-branding-K-Beauty-announced-at-Newsis-K-Expo-2021.html"
}