{
    "title": "September 2014: Most Viewed K-Pop Videos in America, Around the World | Billboard – Billboard",
    "text": "Girls' Generation-TTS and 2PM show their worldwide popularity while BTOB and Orange Caramel trend stateside in the most viewed K-pop videos in America and around the world. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin K-pop fans around the world and in America began their fall showing plenty of support for Korean idols, producers and singer-songwriters’ latest videos on YouTube. Like we do every month, let’s dig into the numbers of the most viewed K-pop videos in America and around the world. Explore\t\t\n\t\n\nSee latest videos, charts and news\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tAilee\t\t\n\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tKim Dong Ryul\t\t\n\t\t\t\t\t\n\n\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news Most Viewed K-Pop Videos in America & Around the World: August 2014 Girls’ Generation and 2PM proved their global popularity with the female outfit’s splinter trio Girls’ Generation-TTS and the boy band winning over international audiences with their latest music videos. TTS’ “Holler” and 2PM’s “Go Crazy!” were the No. 1 and No. 2 most viewed K-pop videos in America and around the world, respectively, with the rest of the ranking mixed past this Top 2. The members of Girls’ Generation and 2PM have undoubtedly been leaders in the Korean wave. Notable moves on the American ranking come from New Jersey-bred singer Ailee in snagging the third most-watched vid with “Don’t Touch Me.” She comes out over videos like T-ara‘s “Sugar Free” and Teen Top‘s “Missing” that also rank high on the global chart. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t10/08/2014 Notably, boy band BTOB and quirky female trio Orange Caramel rank on the U.S.-based chart, but not on the global chart. BTOB is still an act on the rise in Korea, but could perhaps be garnering a supportive fanbase stateside based on the reaction to their “You’re So Fly” vid. Meanwhile, this is the second time Orange Caramel landed on the American chart, but not the global chart, with “The Gangnam Avenue” ranking at No. 7. Their “Abing Abing” video was the eighth most watched K-pop video in America in May 2014. Elsewhere, a new version of Super Junior‘s “Mamacita” video — a fun, six-minute “drama version” — ranks on both lists as does the bizarre video for “11” by Hitchhiker, a producer under SM Entertainment (home to Super Junior, Girls’ Generation, TVXQ! and more). Ladies’ Code‘s touching tribute video to their late members EunB and Rise was the ninth most-watched video globally, according to YouTube. Check out September’s full rankings below with an accompanying playlist. Most Viewed K-Pop Videos in America – September 2014:  1. Girls’ Generation-TTS, “Holler”2. 2PM, “Go Crazy!”3. Ailee, “Don’t Touch Me”4. T-ara, “Sugar Free”5. Super Junior, “Mamacita” (Drama Version)6. BTOB, “You’re So Fly”7. Orange Caramel, “The Gangnam Avenue”8. Teen Top, “Missing”9. Hitchhiker, “11”10. Kim Dong Ryul, “How I Am” Most Viewed K-Pop Videos Around the World – September 2014: 1. Girls’ Generation-TTS, “Holler”2. 2PM, “Go Crazy!”3. T-ara, “Sugar Free”4. Ailee, “Don’t Touch Me”5. Hitchhiker, “11”6. Super Junior, “Mamacita” (Drama Version)7. Teen Top, “Missing”8. Kim Dong Ryul, “How I Am”9. Ladies’ Code, “I’m Fine Thank You”10. EXO’s Tao, “Do You Know” (Jo Sung Mo Remake) Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2014-10-09T02:08:36+00:00",
    "url": "https://www.billboard.com/music/music-news/most-viewed-k-pop-videos-mvs-america-global-september-2014-6274347/"
}