{
    "title": "\n        Sharing information is key as Ritter Sport and Heinemann mark 50-year partnership    ",
    "text": "By  Chris Madden \nin  Food & Confectionery, Latest News, Retail News\nNovember 15, 2018 Comments Off on Sharing information is key as Ritter Sport and Heinemann mark 50-year partnership Ritter Sport has announced new exclusive releases as Heinemann reports record sales A five-decade partnership between Gebr Heinemann and Ritter Sport is driving record sales for the retailer – and the two companies have more new releases on the horizon. The two companies first began working together in 1968 and this week owners Alfred T Ritter and Claus and Gunnar Heinemann have paid tribute to the close working relationship between the two family-owned companies. It is a relationship which has helped Heinemann to record its highest ever sales in Frankfurt, Istanbul, Amsterdam and Hong Kong. But as they look to the future the brands are planning to develop their offering further. For next year Ritter Sport will release its first inflight exclusive product, Play with Me. The set of four minis and a small game provides both snacks and entertainment for travellers in mid-air.  “For us, Gebr Heinemann is a reliable and effective partner in the travel retail sector and we have achieved growth together,” Ritter enthused. “The company has supported us in our efforts to become more established in the travel retail sector. The global structure and the international retail expertise of Gebr Heinemann offer the basis for this.” Ritter Sport began creating travel retail exclusives in 2007 and next year the brand will add to its line with a 397g Choco Cubes bag and Chocolate World, a collection of four 16g minis. The new products are an example of how the companies are “jointly facing the growing challenges in the travel retail market with special products and innovative campaigns.” “In an increasingly competitive international business environment made up of major corporations, our two family businesses provide evidence that [companies] with traditional values can still be successful as global players,” said Claus Heinemann.  “This maxim has now bound our two companies together for five decades and has proven profitable for both parties.” His cousin Gunnar added: “Whether small or large, crunchily chocolatey, crispy, fruity or nutty – I have loved the wide variety of chocolate squares since I was a child. The brightly coloured bars have occupied a permanent place in my life ever since.  “So I am particularly delighted to note that Ritter Sport’s chocolate creations have also occupied a permanent place in our product range for half a century.” The brands say that a “transparent exchange of information” is at the heart of their success and believe their union enables both solid growth prospects and stronger openings in new markets. Tagged with: Gebr Heinemann Gebr Heinemann Retail ",
    "datetime": "2018-11-15T01:37:50+00:00",
    "url": "https://www.dfnionline.com/latest-news/sharing-information-key-ritter-sport-heinemann-mark-50-year-partnership-15-11-2018/"
}