{
    "title": "Signatures of new d-wave vortex physics in overdoped Tl2Ba2CuO6+x revealed by TF-µ+SR | Scientific Reports",
    "text": "Thank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\n            the best experience, we recommend you use a more up to date browser (or turn off compatibility mode in\n            Internet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles\n            and JavaScript. Advertisement Scientific Reports\nvolume 5, Article number: 14156 (2015)\n            Cite this article 1204 Accesses 7 Citations Metrics details The spontaneous expulsion of applied magnetic field, the Meissner effect, is a defining feature of superconductors; in Type-II superconductors above the lower critical field, this screening takes the form of a lattice of magnetic flux vortices. Using implanted spin-1/2 positive muons, one can measure the vortex lattice field distribution through the spin precession and deduce key parameters of the superconducting ground state and thereby fundamental properties of the superconducting pairing. Muon spin rotation/relaxation (µSR) experiments have indeed revealed much interesting physics in the underdoped cuprates, where superconductivity is closely related to, or coexistent with, disordered or fluctuating magnetic and charge excitations. Such complications should be absent in overdoped cuprates, which are believed to exhibit conventional Fermi liquid behaviour. These first transverse field (TF)-µ+SR experiments on heavily-overdoped single crystals reveal a superfluid density exhibiting a clear inflection point near 0.5Tc , with a striking doping-independent scaling. This reflects hitherto unrecognized physics intrinsic to d-wave vortices, evidently generic to the cuprates and may offer fundamentally new insights into their still-mysterious superconductivity. Charge doping of the CuO2 planes tunes the occurrence of superconductivity in the high-temperature hole-doped cuprate superconductors between the limits of an undoped insulating antiferromagnet and a possible conventional Fermi liquid at high dopings. It is appealing to try to understand how the unconventional superconductivity evolves out of these more conventional electronic ground states. However, hole doping is typically effected chemically, in the best case via the composition of a distinct, well-separated subunit of the layered crystal structure, to leave the planes themselves little altered structurally and the dopant site well-shielded when a hole is promoted to the planes. One such example is oxygen doping in the CuO chain layer of YBa2Cu3O7−δ (YBCO). Unfortunately, compositional tuning is limited by (thermodynamic) phase stability and can seldom be used to traverse the entire superconducting phase diagram in a single system. In this context overdoped cuprates, those nearer the apparent Fermi liquid regime, are rare and, moreover, relatively few have highly-ordered CuO2 planes. For example, doping by cation substitution in LaxSr2−xCuO4 (LSCO) introduces substantial disorder directly adjacent to the CuO2 planes1. In contrast, Tl2Ba2CuO6+x (Tl-2201) offers tunability throughout the overdoped regime with highly-ordered, isolated and flat CuO2 planes, doped via dilute interstitial oxygen in the distant TlO layers2, although Cu/Tl substitution in this layer3,4 may contribute an offset in doping. The overdoping also appears to eliminate a predicted electron Fermi surface (FS) pocket at the Γ point, leaving only a single, large, FS sheet5. Pure -wave symmetry of the superconducting order in Tl-2201 has been conclusively established by observation of half-integer flux quanta at crystal boundaries in films6; line nodes are evident in microwave7,8,9 and thermal transport10 measurements; and the admixture of another pairing symmetry is unlikely because it would require spontaneous breaking of the crystal symmetry. However, some μSR measurements have suggested an additionial transition at low temperatures within the vortex state11,12,13, which has been interpreted in terms of a multiple-component order parameter. Here, we extend μSR studies of the vortex state of the cuprates deep into the overdoped regime with the first transverse-field muon spin rotation (TF-μ+SR) results on single-crystalline Tl-2201, in the form of high-quality single crystal mosaics at a range of dopings. Our measurements were performed at low magnetic fields, in a doping regime free from competing charge density wave order14,15 and are thus sensitive to the intrinsic structure of d-wave vortices. We show that the unusual temperature dependence is real and generic to the cuprates, but also demonstrate that it is a signature of d-wave vortex physics rather than a multicomponent order parameter. Figure 1 shows an example of the data and time domain fit at 10 K on a Tc = 56 K mosaic. Fits on all mosaics at all fields and temperatures converged very well and fully reproduce the data. Fourier transforms corresponding to the field distribution are also shown for a selection of temperatures; the additional peak just above the cusp is attributed to muons stopping outside the sample and precessing about the applied field and is accounted for in the fits. The high-field (high-frequency) cutoff in the lineshape is indistinct, precluding a quantitative analysis of the in-plane coherence length , but the in-plane magnetic penetration depth , which controls the linewidth, may be reliably extracted. Varying the fit parameters indicated that the absolute  is accurate to within ~10%, while its temperature dependence is robust; after a few global fits with different choices of  we chose a fixed value, , for all remaining fits. Example of μ+SR data. (a) Complex TF-μ+SR time spectrum (red circles: real part; blue triangles: imaginary part) in a rotating reference frame (RRF) at 0.1 T and 10 K on the  K Tl-2201 mosaic, including time-domain best fit, the residual errors of which are shown in (b) for the first 4 μs where the statistics are highest. (c) Fourier transforms at several temperatures. The relatively sharp peak at 13.55 MHz arises from muons stopping outside the sample. One strength of TF-μ+SR in a Type-II superconductor is its ability to determine the absolute λ and its inverse square, which is proportional to the density of superconducting carriers16. Circumstances are not yet as good for Tl2Ba2CuO6+x as for high-quality YBCO; in particular, only small improvements of global χ2 minimization distinguish the broadening due to vortex lattice disorder, σd, which should scale with , from T-independent broadening due to nuclear magnetic dipoles and crystal defects, σ0. The amplitude AB of the background signal due to muons stopping outside the sample is also known only from the best fit; like σ0, it can be subtly coupled to λ−2. These uncertainties do not alter the temperature dependence and have been incorporated into the quoted ~10% uncertainty in . Figure 2 shows the vortex-state , which is proportional to the superconducting carrier density, for the six mosaics measured and Table 1 reports the zero-temperature penetration depth  from linear extrapolations of . A highly unusual T-dependence, common to all dopings, is immediately apparent. The extent of this similarity is more striking when  is normalized to its extrapolated T = 0 value and plotted against reduced temperature T/Tc—the relative temperature dependence is identical. The most intriguing feature, exhibited in all six mosaics, is upward curvature between  and an inflection point around 0.5Tc. This unusual temperature dependence is robust and evident in any measure of the linewidth, but is absent in zero-field (Meissner state) microwave surface resistance at higher and lower dopings8,9, the former included for comparison. The intrinsic T-dependence of the superconducting carrier density (or ) in a single-gap s- or d-wave superconductor exhibits downward curvature over the entire temperature range 0–Tc. (a) Temperature dependence of fitted  at H = 0.1 T for all Tl-2201 mosaics; A and B denote two different mosaics with the same Tc. Absolute microwave data (curve) at zero field on a Tc = 25 K crystal at 2.497 GHz9, included for comparison, follow a qualitatively different form. Curves are provided for two mosaics as a guide to the eye. (b) Normalized values  vs. reduced temperature T/Tc for all Tl-2201 mosaics. All dopings exhibit essentially the same temperature dependence and differ from the microwave results (solid curve). μSR reports of the cuprates’ temperature-dependent in-plane penetration depth typically exhibit the shape associated with a pure d-wave order parameter17,18. However, this has not been the case in all data. Upward curvature in the μSR penetration depth can be recognized in relatively disordered overdoped LSCO11; at high dopings in cleaner YBa2Cu3O7−δ19, in lightly underdoped YBa2Cu4O812; and in optimally and overdoped Bi2Sr2CaCu2O8+δ13. This unusual temperature dependence has appeared most clearly near and above optimal doping18,19, with some limited evidence that it strengthens on overdoping13. It is most evident at relatively low applied fields20,21. With no phase transition expected at the fields and temperatures in question, no such feature unambiguously visible in most published data or any microwave penetration depth studies and based on a small number of data points in many of these cases, it has not been widely accepted as a real effect. Its now-confirmed appearance in a variety of systems and its particularly conspicuous appearance in Tl-2201, implies that it is real and generic, at least to high doping ranges. The contrast with zero-field microwave data argues against the few interpretations floated thus far, instead pointing toward an origin in an unexpected property of the cuprates’ vortex state. We first briefly dispense with some alternative explanations before returning to vortex physics. First, multiband superconductors, those with more than one band crossing the Fermi level, can exhibit unconventional temperature dependence in the vortex state22; a two-component order parameter, e.g. d + s, with separate order parameters on distinct Fermi surface sheets, has been advanced to explain the LSCO11 and YBa2Cu4O812 results. However, Tl-2201 has only one FS sheet and the pure d-wave symmetry and dissimilar microwave penetration depth at both lower and higher dopings7,9 exclude such an origin. Second, the remarkable scaling seen in Fig. 2 argues against an electronic phase transition within the superconducting dome, such as an extension of the pseudogap crossover temperature T*. Third, dilute paramagnetic impurities would yield an additional broadening scaling with H/T, contrary to the observed T dependence. Some type of magnetically frozen state might account for the observed temperature dependence (since μ+SR is a local probe, macroscopic phase separation would not affect the superconducting component’s lineshape). However, one would not expect the onset of a competing magnetic phase to track Tc with doping23. Furthermore, higher fields should enhance any competing magnetic order24, particularly in the vortex cores25, but in YBCO they instead suppress the exotic upward curvature in the temperature dependence of the linewidth11,20. Proximity-induced chain superconductivity has been advanced as an explanation for the inflection point in YBCO19, but this cannot explain its appearance in chain-free Tl-2201. Having excluded several alternative explanations, we return to physics of the vortex phase, which would be absent in the Meissner-phase microwave experiments and previous work on Tl-2201 powder26 and may thus offer a natural explanation. First, the resistive upper critical field of Tl-2201 (actually the irreversibility field27,28) exhibits unusual upward curvature29 and stays very close to Hc2(T), far from the required temperature regime at the low fields relevant here. A dimensionality crossover within the frozen vortex state, as in the much more anisotropic Bi2Sr2CaCu2O813,30, would produce a symmetric lineshape and the reduced field inhomogeneity would narrow the linewidth at high temperatures, in contrast to our results. Trapping of vortices by preferred pinning sites at low temperature has been advanced to explain the inflection in YBCO20, but the linewidth changes in Tl-2201 would require very significant disorder and change the lineshape significantly. This is not seen in the FFT spectra; moreover, allowing the temperature-independent σ0 broadening to vary produced no systematic trend with temperature. To further exclude vortex disorder, it will be essential to quantify it independently using, for instance, small-angle neutron scattering or scanning probe techniques. Another relevant feature of the vortex state is the symmetry of the vortex lattice itself. An unusual square vortex lattice, as found in optimally and overdoped LSCO31,32 and in YBCO33, produces a broader but qualitatively similar field distribution with a more pronounced low-field tail. However, the vortex lattice in fully-oxygenated YBCO gradually transforms from triangular to square as the field increases from 4 to 11 T, while strong upward curvature in the second moment of the TF-μ+SR lineshape is strongest at much lower fields ~0.1 T34 and is completely suppressed by 4 T18, excluding this interpretation, at least for YBCO. The μSR data for the Tc = 56 K Tl-2201 mosaic were fit to a simple square vortex lattice model as a trial, but no crossover, in the form of a systematic improvement in the quality of fit, was evident. We are thus drawn to the conclusion that the upward curvature must arise from some fundamental property intrinsic to the d-wave vortices themselves. In this scenario, the difference between the zero-field microwave measurements and these vortex-state μSR results arises because the measurements probe different phases. In microwave measurements, only the surface contributes, while the bulk is shielded. In μSR, however, vortices also contribute and these can overlap and interact in certain field and temperature regimes. The scaling with Tc and absence in underdoped samples point to an explanation in terms of the electronic structure expected for a vortex in a d-wave superconductor. Theoretical calculations35,36 show that such vortex cores shrink with increasing magnetic field due to an enhanced transfer of quasiparticles between neighbouring vortices. This effect has been observed in YBCO by μSR18,19,37, with the core size rapidly shrinking and saturating at fields above H ~ 4 T. At low fields where the vortices are well separated, the quasiparticle transfer is minimal and the vortices are expected to behave essentially as if they were isolated. A vortex in a d-wave superconductor is fourfold symmetric at low temperatures, with extended low-energy quasiparticle states along the 45° (nodal) directions in the CuO2 plane. With increasing thermal population of the higher energy states, the vortex core size grows and calculations show that above ~0.5Tc the fourfold-symmetric magnetic field profile about the vortex core becomes nearly cylindrical38. As previously stressed25, λab as measured by μSR may be regarded as the in-plane magnetic penetration depth only in the  and  limit, but is otherwise an effective length scale partially influenced by changes to the field profile outside the vortex core by extended quasiparticle states. Consequently, below ~0.5Tc and at low fields the temperature dependence of λab is expected to be influenced by the evolving quasiparticle states that extend far beyond the vortex core. At higher temperatures, where the fourfold symmetry of the vortex is essentially gone, the behavior of λab should closely resemble that of the magnetic penetration depth, unless the vortex lattice melts. Since the vortex core radius is directly proportional to the gap magnitude39, which in turn is proportional to Tc in overdoped cuprates, the scaling with Tc is naturally explained. The inflection point near 0.5Tc being less prominent or absent in underdoped cuprates is likely due to the stabilization of competing charge-density-wave (CDW) order localized in the vicinity of the vortex cores. STM measurements on optimally- and slightly overdoped Bi2Sr2CaCu2O8+δ40,41 and nuclear magnetic resonance (NMR) measurements on underdoped YBCO24,42 show static CDW order in the vortex core region, where superconductivity is suppressed. While this induced static CDW order is observed only at low temperatures in optimally and slightly overdoped samples, in underdoped YBCO with p ~ 0.12, NMR shows that static CDW order occurs over much of the temperature range below Tc. The occurrence of static CDW order in the vortex core region constitutes a significant modification of the electronic structure of the d-wave vortex43 and consequently the loss of the inflection point in the temperature dependence of λab is not surprising. The CDW competes with superconductivity14,15, so it will preferentially inhabit—and likely gap out—the regions of momentum space in the nodal direction at the Fermi surface to maximally avoid competition between the two orders. As a result, the extended quasiparticle core states along the nodal directions will become bound. This should lead to isotropic s-wave-like vortex behaviour throughout much of the underdoped side of the phase diagram, while the behaviour seen in the overdoped regime reflects the intrinsic physics of d-wave vortices without such complications. Supplementary Fig. S2 online shows that the fit parameters, based on an s-wave model, fail at the lowest temperatures (beginning well below the inflection point). The s-wave model’s inability to reproduce the observed field distribution provides evidence of its failure to adequately describe the vortex phase, particularly at low temperatures. Finally, our use of mosaics with similar Tcs has important implications for techniques relying on μSR for values of the zero-temperature penetration depth. Mosaics grown and annealed under very similar conditions, having the same or similar Tc, exhibit quite different absolute penetration depths, as shown in Fig. 3 for Tc = 46 K. The normalized linewidths , however, are almost identical. Mosaics with Tcs of 46 K (“A”) and 72 K were prepared several years before the 46 K (“B”) and 75 K mosaics. The crystal growth was still being optimized when the early mosaics were assembled, demonstrating that suppression of Tc by disorder is not equivalent to its suppression by carrier overdoping. That the zero-temperature  can apparently increase by ~30% due to increasing crystalline perfection means that the λab(0) values in Table 1 should not be regarded as intrinsic. A variety of other techniques rely upon μSR to obtain absolute penetration depth values, but our work indicates that in the overdoped regime, the values are only valid for  and even then are highly susceptible to disorder and must be treated with caution. Fitted values of  vs.T for the earlier (A) and later (B) Tc = 46 K mosaics. Inset: same data in normalized form. The nature of superconductivity in the cuprates remains one of the most important open questions in condensed matter physics and the overdoped regime proffers the promising prospect of understanding the normal state from which high-temperature superconductivity emerges. However, our μ+SR data indicate exotic physics survives to high dopings. A striking universal temperature dependence unambiguously confirms an unusual upturn in the in-plane penetration depth, now seen in at least four distinct material families, establishing that it is new physics generic to the cuprates. Fundamental differences from zero-field microwave measurements of nominally the same quantity9 imply it is intrinsic to the d-wave vortices themselves. Aside from the substantial impacts of this result on vortex physics and what light this may shed on cuprate superconductivity, there are important ramifications for other techniques. μSR is uniquely suited to extracting the absolute penetration depth from the vortex phase and the values thus obtained underpin results of other techniques which can’t measure λ in absolute terms or at all. While the μSR temperature evolution should be robust16, the absolute values are model-dependent. Our data indicate that a more complex model is required when d-wave vortices are present, which will necessitate revisiting some previous results. First, however, the details and origin of the exotic temperature dependence must be conclusively confirmed. Sensitive scanning probe microscopies may provide insights into the current and quasiparticle distribution in the vortex cores, while confirmation that this is a vortex state phenomenon awaits Meissner-state field distribution measurements, such as low-energy μSR44 or β-NMR45. The regimes in which these d-wave vortices manifest their unique d-wave physics may provide crucial new insight on the cuprates’ order parameter and still-mysterious pairing. Single crystals of Tl-2201 were grown in gold-sealed alumina crucibles by an encapsulated copper-rich self-flux method as described elsewhere46. The oxygen content (which determines hole content and Tc) was set by annealing under controlled oxygen partial pressures and temperatures47; two different annealing schemes were employed depending on the desired oxygen content46. Crystals were assembled in mosaics on substrates of aluminized mylar or GaAs to minimize the background signal, with the crystallographic c-axis perpendicular to the substrate (parallel to the applied field). In this geometry, the applied field is shielded by supercurrents running within the ab-plane, thus the in-plane penetration depth λab governs the field distribution. The large number of small crystals to be mutually aligned precluded measuring the superconducting transition of every individual crystal, but care was taken to construct each mosaic from a small number of annealing batches, each drawing crystals from only one growth run and Tc was measured on a selection of crystals sampled from each annealing run. Examples of magnetization data on three mosaics are included in Supplementary Fig. S1 online. Quoted uncertainties in Tc reflect transition widths of individual crystals, as determined by DC magnetization in applied fields of 0.1–0.2 mT and the expected variation within the mosaic based on the crystals sampled. These fields were used because the lower critical field Hc1 in this material is quite low. Spin-polarized positive muons from the M15 muon channel at TRIUMF were injected into the mosaics at an energy of 3–4 MeV in one of several different μ+SR spectrometers. While a range of magnetic fields were used, the lowest field for which the rotating reference frame transformation worked reliably was 0.1 T and this field was used for all data presented here. In muon spin rotation/resonance/relaxation (μSR)16,48, implanted muons settle into specific preferred crystallographic sites, where their spins precess around the local magnetic field  with frequency , where the muon gyromagnetic ratio  MHz/T. The precession is detected via a decay positron (in the case of μ+) emitted preferentially along the muon’s spin direction. The experimental β+ decay asymmetry reflects the precession of the ensemble of ~107 randomly implanted muons and thereby the distribution of the local magnetic field. A Fourier transform of the time spectrum, which can be useful for visualizing the field distribution characteristic of the vortex state, shows a low-field cutoff corresponding to the midpoint of a triad of near neighbor vortices, a van Hove cusp from saddle points in the vortex lattice and a high-field tail and cutoff corresponding to the maximum Bloc in the vortex cores. However, fitting is best performed on the original time spectra: statistics decay with the muon lifetime (2.197 μs) and mixing high- with low-statistics data (as in an FFT) is undesirable, but later times determine the frequency resolution and thereby the reliability of fit parameters. All λab values were therefore extracted from fits in the time domain to the lineshape described in Ref. 49 as calculated numerically for a triangular vortex lattice with λab and  as fitted parameters. A test with a square vortex lattice used the same approach. How to cite this article: Brewer, J. H. et al. Signatures of new d-wave vortex physics in overdoped Tl2Ba2CuO6+x revealed by TF-µ+SR. Sci. Rep. 5, 14156; doi: 10.1038/srep14156 (2015). H. Eisaki et al. Effect of chemical inhomogeneity in bismuth-based copper oxide superconductors. Phys. Rev. B 69, 064512, 10.1103/PhysRevB.69.064512 (2004), arXiv:cond-mat/0312570. Article \n    ADS \n    CAS \n    \n                    Google Scholar J. L. Wagner et al. Multiple defects in overdoped Tl2Ba2CuO6+δ: effects on structure and superconductivity. Physica C 277, 170, doi: 10.1016/S0921-4534(97)00062-2 (1997). Article \n    ADS \n    CAS \n    \n                    Google Scholar Y. Shimakawa . Chemical and structural study of tetragonal and orthorhombic Tl2Ba2CuO6 . Physica C 204, 247 doi: 10.1016/0921-4534(93)91006-H (1993). Article \n    ADS \n    CAS \n    \n                    Google Scholar D. C. Peets et al. Tl2Ba2CuO6+δ brings spectroscopic probes deep into the overdoped regime of the high-Tc cuprates. New J. Phys. 9, 28, 10.1088/1367-2630/9/2/028 (2007), arXiv:cond-mat/0609250. Article \n    ADS \n    CAS \n    \n                    Google Scholar M. Platé et al. Fermi surface and quasiparticle excitations of overdoped Tl2Ba2CuO6+δ . Phys. Rev. Lett. 95, 077001, 10.1103/PhysRevLett.95.077001 (2005), arXiv:cond-mat/0503117. Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar C. C. Tsuei et al. Pure order-parameter symmetry in the tetragonal superconductor Tl2Ba2CuO6+δ . Nature 387, 481, doi: 10.1038/387481a0 (1997). Article \n    ADS \n    CAS \n    \n                    Google Scholar D. M. Broun et al. In-plane microwave conductivity of the single-layer cuprate Tl2Ba2CuO6+δ . Phys. Rev. B 56, R11443, 10.1103/PhysRevB.56.R11443 (1997). Article \n    ADS \n    CAS \n    \n                    Google Scholar S. Özcan et al. Electrical transport measurements in the superconducting state of Bi2Sr2CaCu2O8+x and Tl2Ba2CuO6+δ . Phys. Rev. B 73, 064506, 10.1103/PhysRevB.73.064506 (2006), arXiv:cond-mat/0508621. Article \n    ADS \n    CAS \n    \n                    Google Scholar D. Deepwell et al. Microwave conductivity and superfluid density in strongly overdoped Tl2Ba2CuO6+δ . Phys. Rev. B 88, 214509, 10.1103/PhysRevB.88.214509 (2013), arXiv:1312.6459 [cond-mat.supr-con]. Article \n    ADS \n    CAS \n    \n                    Google Scholar D. G. Hawthorn et al. Doping dependence of the superconducting gap in Tl2Ba2CuO6+δ from heat transport. Phys. Rev. B 75, 104518, 10.1103/PhysRevB.75.104518 (2007), arXiv:cond-mat/0502273. Article \n    ADS \n    CAS \n    \n                    Google Scholar R. Khasanov et al. Experimental evidence for two gaps in the high-temperature La1.83Sr0.17CuO4 superconductor. Phys. Rev. Lett. 98, 057007, 10.1103/PhysRevLett.98.057007 (2007), arXiv:cond-mat/0606175. Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar R. Khasanov et al. s-Wave symmetry along the c-axis and s + d in-plane superconductivity in bulk YBa2Cu4O8 . J. Supercond. Nov. Magn. 21, 81, doi: 10.1007/s10948-007-0302-z (2008), arXiv:0705.0577 [cond-mat.supr-con]. Article \n    CAS \n    \n                    Google Scholar T. Blasius et al. Evidence for a two-stage melting transition of the vortex matter in Bi2Sr2Ca1Cu2O8+δ single crystals obtained by muon spin rotation. Phys. Rev. Lett. 82, 4926, 10.1103/PhysRevLett.82.4926 (1999), arXiv:cond-mat/9903232. Article \n    ADS \n    CAS \n    \n                    Google Scholar G. Ghiringhelli et al. Long-range incommensurate charge fluctuations in (Y,Nd)Ba2Cu3O6+x . Science 337, 821, 10.1126/science.1223532 (2012), arXiv:1207.0915 [cond-mat.str-el]. Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar J. Chang et al. Direct observation of competition between superconductivity and charge density wave order in YBa2Cu3O6.67 . Nat. Phys. 8, 871, 10.1038/NPHYS2456 (2012), arXiv:1206.4333 [cond-mat.supr-con]. Article \n    CAS \n    \n                    Google Scholar J. E. Sonier, J. H. Brewer & R. F. Kiefl, μSR studies of the vortex state in type-II superconductors. Rev. Mod. Phys. 72, 769, 10.1103/RevModPhys.72.769 (2000). Article \n    ADS \n    CAS \n    \n                    Google Scholar J. Sonier et al. New muon-spin-rotation measurement of the temperature dependence of the magnetic penetration depth in YBa2Cu3O6.95 . Phys. Rev. Lett. 72, 744, 10.1103/PhysRevLett.72.744 (1994). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar J. E. Sonier et al. Field induced reduction of the low-temperature superfluid density in YBa2Cu3O6.95 . Phys. Rev. Lett. 83, 4156, 10.1103/PhysRevLett.83.4156 (1999), arXiv:cond-mat/9906452. Article \n    ADS \n    CAS \n    \n                    Google Scholar J. E. Sonier et al. Hole-doping dependence of the magnetic penetration depth and vortex core size in YBa2Cu3Oy: Evidence for stripe correlations near 1/8 hole doping. Phys. Rev. B 76, 134518, 10.1103/PhysRevB.76.134518 (2007). Article \n    ADS \n    CAS \n    \n                    Google Scholar D. R. Harshman et al. Nodeless pairing state in single-crystal YBa2Cu3O7 . Phys. Rev. B 69, 174505, 10.1103/PhysRevB.69.174505 (2004). Article \n    ADS \n    CAS \n    \n                    Google Scholar M. Amin, M. Franz & I. Affleck . Effective “penetration depth” in the vortex state of a d-wave superconductor. Phys. Rev. Lett. 84, 5864, 10.1103/PhysRevLett.84.5864 (2000), arXiv:cond-mat/9912196. Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar M. Zehetmayer . A review of two-band superconductivity: materials and effects on the thermodynamic and reversible mixed-state properties. Supercond. Sci. Technol. 26, 043001, doi: 10.1088/0953-2048/26/4/043001 (2013), arXiv:1402.3956 [cond-mat.supr-con]. Article \n    ADS \n    \n                    Google Scholar C. Niedermayer et al. Common phase diagram for antiferromagnetism in La2−xSrxCuO4 and Y1−xCaxBa2Cu3O6 as seen by muon spin rotation. Phys. Rev. Lett. 80, 3843, 10.1103/PhysRevLett.80.3843 (1998). Article \n    ADS \n    CAS \n    \n                    Google Scholar T. Wu et al. Magnetic-field-induced charge-stripe order in the high-temperature superconductor YBa2Cu3Oy . Nature 477, 191, 10.1038/nature10345 (2011), arXiv:1109.2011 [cond-mat.supr-con]. Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar J. E. Sonier . Muon spin rotation studies of electronic excitations and magnetism in the vortex cores of superconductors. Rep. Prog. Phys. 70, 1717, doi: 10.1088/0034-4885/70/11/R01 (2007), arXiv:0802.2942 [cond-mat.supr-con]. Article \n    ADS \n    CAS \n    \n                    Google Scholar Y. J. Uemura et al. Magnetic-field penetration depth in Tl2Ba2CuO6+δ in the overdoped regime. Nature 364, 605, doi: 10.1038/364605a0 (1993). Article \n    ADS \n    CAS \n    \n                    Google Scholar B. Lundqvist et al. Vortex dynamics in a thin film of Tl2Ba2CuO6 . J. Low Temp. Phys. 117, 1441, doi: 10.1023/A:1022554019336 (1999). Article \n    ADS \n    CAS \n    \n                    Google Scholar D. N. Zheng et al. Upper critical field and irreversibility field of over-doped Tl2Ba2CuO6+δ superconductors. Physica C 341-348, 1373, doi: 10.1016/S0921-4534(00)00892-3 (2000). Article \n    ADS \n    CAS \n    \n                    Google Scholar A. P. Mackenzie et al. Resistive upper critical field of Tl2Ba2CuO6 at low temperatures and high magnetic fields. Phys. Rev. Lett. 71, 1238, 10.1103/PhysRevLett.71.1238 (1993). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar C. Bernhard et al. Anisotropy and dimensional crossover of the vortex state in Bi2Sr2CaCu2O8+δ crystals. Phys. Rev. B 52, R7050, 10.1103/PhysRevB.52.R7050 (1995). Article \n    ADS \n    CAS \n    \n                    Google Scholar R. Gilardi et al. Direct evidence for an intrinsic square vortex lattice in the overdoped high-Tc superconductor La1.83Sr0.17CuO4+δ . Phys. Rev. Lett. 88, 217003, 10.1103/PhysRevLett.88.217003 (2002), arXiv:cond-mat/0204278. Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar J. Chang et al. Spin density wave induced disordering of the vortex lattice in superconducting La2−xSrxCuO4 . Phys. Rev. B 85, 134520, 10.1103/PhysRevB.85.134520 (2012), arXiv:1204.2152 [cond-mat.supr-con]. Article \n    ADS \n    CAS \n    \n                    Google Scholar J. S. White et al. Magnetic-field-induced nonlocal effects on the vortex interactions in twin-free YBa2Cu3O7 . Phys. Rev. B 84, 104519, 10.1103/PhysRevB.84.104519 (2011), arXiv:1108.2176 [cond-mat.supr-con]. Article \n    ADS \n    CAS \n    \n                    Google Scholar R. Khasanov et al. Multiple gap symmetries for the order parameter of cuprate superconductors from penetration depth measurements. Phys. Rev. Lett. 99, 237601, 10.1103/PhysRevLett.99.237601 (2007), arXiv:0708.2374 [cond-mat.supr-con]. Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar M. Ichioka, A. Hasegawa & K. Machida . Vortex lattice effects on low-energy excitations in d-wave and s-wave superconductors. Phys. Rev. B 59, 184, 10.1103/PhysRevB.59.184 (1999). Article \n    ADS \n    CAS \n    \n                    Google Scholar M. Ichioka, A. Hasegawa and K. Machida . Field dependence of the vortex structure in d-wave and s-wave superconductors. Phys. Rev. B 59, 8902, doi: 10.1103/PhysRevB.59.8902 (1999), arXiv:cond-mat/9901339. Article \n    ADS \n    CAS \n    \n                    Google Scholar J. E. Sonier et al. Expansion of the vortex cores in YBa2Cu3O6.95 at low magnetic fields. Phys. Rev. B 56, R729, 10.1103/PhysRevB.59.R729 (1999), arXiv:cond-mat/9806064. Article \n    ADS \n    \n                    Google Scholar M. Ichioka, N. Hayashi, N. Enomoto & K. Machida . Vortex structure in d-wave superconductors. Phys. Rev. B 53, 15316, 10.1103/PhysRevB.53.15316 (1996), arXiv:cond-mat/9512001. Article \n    ADS \n    CAS \n    \n                    Google Scholar J. E. Sonier . Investigations of the core structure of magnetic vortices in type-II superconductors using muon spin rotation. J. Phys.: Condens. Matter 16, S4499, 10.1088/0953-8984/16/40/006 (2004), arXiv:cond-mat/0404115. Article \n    ADS \n    CAS \n    \n                    Google Scholar J. E. Hoffman et al. A four unit cell periodic pattern of quasi-particle states surrounding vortex cores in Bi2Sr2CaCu2O8+δ . Science 295, 466, 10.1126/science.1066974 (2002), arXiv:cond-mat/0201348. Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar G. Levy et al. Fourfold structure of vortex-core states in Bi2Sr2CaCu2O8+δ . Phys. Rev. Lett. 95, 257005, 10.1103/PhysRevLett.95.257005 (2005), arXiv:cond-mat/0503219. Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar T. Wu et al. Emergence of charge order from the vortex state of a high-temperature superconductor. Nat. Commun. 4, 2113, 10.1038/ncomms3113 (2013), arXiv:1307.2049 [cond-mat.supr-con]. Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar D. F. Agterberg & J. Garaud . Checkerboard order in vortex cores from pair density wave superconductivity. Phys. Rev. B 91, 104512, 10.1103/PhysRevB.91.104512 (2015), arXiv:1412.5101 [cond-mat.supr-con]. Article \n    ADS \n    CAS \n    \n                    Google Scholar O. Ofer et al. Absolute value and temperature dependence of the magnetic penetration depth in Ba(Co0.074Fe0.926)2As2 . Phys. Rev. B 85, 060506(R), 10.1103/PhysRevB.85.060506 (2012). Article \n    ADS \n    CAS \n    \n                    Google Scholar M. D. Hossain et al. Low-field cross spin relaxation of 8Li in superconducting NbSe2 . Phys. Rev. B 79, 144518, 10.1103/PhysRevB.79.144518 (2009). Article \n    ADS \n    CAS \n    \n                    Google Scholar D. C. Peets, R. Liang, M. Raudsepp, W. N. Hardy & D. A. Bonn . Encapsulated single crystal growth and annealing of the high-temperature superconductor Tl-2201. J. Cryst. Growth 312, 344, 10.1016/j.jcrysgro.2009.10.042 (2010), arXiv:0910.3457 [cond-mat.supr-con]. Article \n    ADS \n    CAS \n    \n                    Google Scholar C. Opagiste et al., Phase diagram of the Tl2Ba2CuO6 compounds in the T, p(O2) plane. Physica C 213, 17, 10.1016/0921-4534(93)90753-D (1993). Article \n    ADS \n    CAS \n    \n                    Google Scholar J. H. Brewer . Muon spin rotation/relaxation/resonance. in Encyclopedia of Applied Physics. Vol. 11 (ed G. L. Trigg ) 23–53, 10.1002/3527600434.eap258 (VCH Publishers, 1994). Article \n    \n                    Google Scholar J. E. Sonier et al. Shrinking magnetic vortices in V3Si due to delocalized quasiparticle core states: Confirmation of the microscopic theory for interacting vortices. Phys. Rev. Lett. 93, 017002 10.1103/PhysRevLett.93.017002 (2004). Article \n    ADS \n    CAS \n    \n                    Google Scholar Download references This work was supported by the Canadian Institute for Advanced Research and the Natural Sciences and Engineering Research Council of Canada. The authors are indebted to Ch. Bernhard, D.M. Broun, M. Franz and K. Machida for stimulating discussions, D. Deepwell and D.M. Broun for microwave data, M.D. Le and A.C. Shockley for critical reading of the manuscript and the TRIUMF CMMS staff for their assistance. A portion of this work was supported by IBS-R009-G1. Department of Physics and Astronomy, The University of British Columbia, V6T 1Z1, Vancouver, BC, Canada Jess H. Brewer, Scott L. Stubbs, Ruixing Liang, D. A. Bonn, W. N. Hardy & Darren C. Peets Canadian Institute for Advanced Research, M5G 1Z8, Toronto, Ontario, Canada Ruixing Liang, D. A. Bonn, W. N. Hardy & J. E. Sonier Department of Physics, Simon Fraser University, V5A 1S6, Burnaby, BC, Canada J. E. Sonier Department of Chemistry, The University of British Columbia, V6T 1Z1, Vancouver, BC, Canada W. Andrew MacFarlane Center for Correlated Electron Systems, Institute for Basic Science, Seoul National University, Seoul, 151-747, Korea Darren C. Peets You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar This study was conceived, planned and supervised by J.H.B., D.A.B., W.N.H. and R.L. Crystals were grown, annealed and characterized by D.C.P. and R.L., then aligned into mosaics by S.L.S., J.H.B. and R.L. μ+SR experiments were performed by S.L.S. and J.H.B. and J.H.B. was pestered by D.C.P. and W.A.M. into analysing the data. The data were interpreted and the manuscript written by W.A.M., D.C.P., J.H.B. and J.E.S. The authors declare no competing financial interests. This work is licensed under a Creative Commons Attribution 4.0 International License. The images or other third party material in this article are included in the article’s Creative Commons license, unless indicated otherwise in the credit line; if the material is not included under the Creative Commons license, users will need to obtain permission from the license holder to reproduce the material. To view a copy of this license, visit http://creativecommons.org/licenses/by/4.0/ Reprints and Permissions Brewer, J., Stubbs, S., Liang, R. et al. Signatures of new d-wave vortex physics in overdoped Tl2Ba2CuO6+x revealed by TF-µ+SR.\n                    Sci Rep 5, 14156 (2015). https://doi.org/10.1038/srep14156 Download citation Received: 11 December 2014 Accepted: 19 August 2015 Published: 16 September 2015 DOI: https://doi.org/10.1038/srep14156 Anyone you share the following link with will be able to read this content: Sorry, a shareable link is not currently available for this article.  Provided by the Springer Nature SharedIt content-sharing initiative Journal of Superconductivity and Novel Magnetism (2020) By submitting a comment you agree to abide by our Terms and Community Guidelines. If you find something abusive or that does not comply with our terms or guidelines please flag it as inappropriate. Advertisement Scientific Reports (Sci Rep)\n                \n\nISSN 2045-2322 (online) © 2023 Springer Nature Limited Sign up for the Nature Briefing newsletter — what matters in science, free to your inbox daily. ",
    "datetime": null,
    "url": "https://www.nature.com/articles/srep14156"
}