{
    "title": "Six things to see at Hallyu! The Korean Wave - The Face",
    "text": "Aespa \"Next Level\" MV, 2021 © SM Entertainment The V&A’s new immersive exhibition celebrates our collective obsession with Korean music, film and design. Here are the six pieces to hone in on when visiting. Words: Kyle MacNeill8th December 2022 We’ve long been surfing the Korean Wave on the silver screen, small screen and even smaller screen. In the last two decades, K‑pop has become huge thanks to endlessly-stanned groups like BTS, EXO and Blackpink, generating a cool $10bn for South Korea every single year. Then there’s Korean film – including mega crossover hits like Parasite, The Housemaid and Oldboy – and K‑drama, from Squid Game to the equally dystopian Dr. Brain and a heck of a lot of flesh-munching zombie flicks in between. It’s all part of Hallyu, meaning, literally, wave or flow of Korea, which describes this recent international spread and interest in Korea’s pop culture. Actively pursued by the Korean government, which allocates a significant chunk of funding each year to its cultural sector, Hallyu’s upgraded to its 3.0 era and we’re all into K‑fashion’s high-end streetwear, we’ve applied ourselves to the gorgeous luminosity of K‑beauty and eaten vats of kimchi. Whack a ​‘K’ in front of any potential creative export and it’s probably already struck gold; it’s why THE FACE has been obsessed, tracking our infatuation with the country’s unstoppable cultural domination. Now, we’ve been gifted with an IRL experience thanks to the V&A’s new Hallyu! The Korean Wave exhibition. Open now until 25th June 2023, it’s an exceptional showcase spanning music, film, technology, style and art in bright, loud, maximalist fashion. From reconstructed bathrooms to painted sculptures that have elicited actual liquid tears, here are the six pieces you cannot miss. An entire K‑pop room Who’s your bias? Here’s a chance to decide in an entire room dedicated to the world of K‑pop. Don’t miss the No Filter video, which showcases all-singing, all-dancing, hard-to-believe-they’re-not-real idols, ETERN1TY, generated by AI. Elsewhere you’ll find the costumes worn by Aespa and Ateez in the music videos for Next Level and Fireworks. If you still want more, there’s a booth where you can learn dance moves to PSY’s That That for pure TikTok gold. \"What you see is the unseen - Chandeliers for Five Cities\" by Kyungah Ham © Kyungah Ham. Courtesy of the artist and Kukje Gallery. Photo by Chunho An What You See is the Unseen /​Chandeliers for Five Cities Kyungah Ham​’s hand-embroidered chandeliers are woven using gossamer silk thread and are the result of a secret, ongoing collaboration between artists in North and South Korea. First inspired by finding a North Korean propaganda flyer lying on the street of her parents’ Seoul neighbourhood in 2008, the artist started smuggling her designs to artisans living in the north who would embroider them with super fine stitching before smuggling them back. The artworks represent Korea’s unique, divided political situation. Untitled G‑Dragon, A Space of No Name Osang Gwon​’s larger-than-life-size painted sculpture is based on Raphael’s 1518 renaissance painting St. Michael Vanquishing Satan. The sculptor has depicted Korean rapper G‑Dragon as both St. Michael and Satan in three metres of glittering beauty. If you needed proof that this artwork is moving; a visiting G‑Dragon superfan literally wept at the sight of it. Original costumes from Squid Game Oh Squid Game how we miss you! It’s somehow already been a year since the K‑drama rewrote the rulebook and amassed 1.65 billion viewing hours during its first month on Netflix, getting us all hooked on its gruesome premise and rich characterisation. Now, there’s a chance to see the original highlighter-pink and forest-green costumes – much better than last year’s many Hallyuween efforts – in all their glory. Make sure you don’t bump into The Recruiter on your way out… A recreation of the Parasite bathroom Ask the gallery assistant where the bathroom is and you might be led here: an IRL recreation of the bathroom from Parasite, that insanely good, anxiety-inducing Best Picture winner. The installation feels like a portal into the hit Hallyuwood film; the distinctive tiled stairs leading up to a knackered toilet (the best place to get signal!), flickering lightbulb and mass of bric-a-brac goods all transport you straight to the Kim’s family home. Miss Sohee’s Peony Dress Seoul-born, London-based designer Miss Sohee is one of the most exciting fashion forces right now thanks to her couture gowns and backing from the likes of Zendaya and Taylor Hill. It’s little wonder, then, that she features here; her Peony Dress is a masterclass in puffy silhouettes and artistic flamboyance, showcased in all its rhubarby glory as part of the exhibition’s fashion section. Catch its blooming beauty next to streetstyle from the likes of Kye and D‑Antidote, contemporary versions of the traditional Korean outfit hanbok and a behind-the-scenes look at pieces worn by BTS. Things to read, watch and listen to each week. 0% Spam. 100% The Face. ",
    "datetime": null,
    "url": "https://theface.com/culture/hallyu-korean-wave-seoul-culture-victoria-albert-museum-london-squid-game"
}