{
    "title": "Sixth Annual KCON Heads to East & West Coasts This Summer: Exclusive | Billboard – Billboard",
    "text": "Thousands of American fans descended on KCON in 2016, and this year the “world’s largest Korean culture convention and music festival” returns to the Los Angeles and New York markets in an… By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tTamar Herman Thousands of American fans descended on KCON in 2016, and this year the “world’s largest Korean culture convention and music festival” returns to the Los Angeles and New York markets in an expanded form. Billboard has learned that KCON USA will head to the Prudential Center in Newark, NJ on June 23-24 for KCON NY, and the LA Convention Center on August 18-20 for KCON LA. In its sixth year, the Korean pop culture convention and music event expands to host three headlining concerts in LA, one more than held at KCON LA in 2016. KCON NY will still have two concerts, but will also see expanded content as both US-based KCONs highlight Korean music, movies, television, K-beauty cosmetics, Korean food, e-sports, and “all things Hallyu” through a wide range of programming and events.  Hallyu, or the Korean wave, refers to the rise in popularity of Korean entertainment and culture internationally, propelled largely in part by K-pop and Korean television shows. The phenomena is strong in the US, where 118,000 fans attended KCON NY and LA in 2016. As one of the purveyors of K-pop events and conventions throughout the world, parent company CJ E&M has promoted Hallyu through past KCONs in the US, France, the United Arab Emirates, Japan, and Korea, with 350,000 attendees participating in the events worldwide over the past six years. 2017 sees the Korean cultural festival expanding to Latin America for the first time with the two-day KCON Mexico later this month.  In the past, KCON NY and LA have brought some of Korea’s most popular celebrities stateside, with performances from K-pop stars like Girls’ Generation, BTS, SHINee, Super Junior, Dean, Red Velvet, G-Dragon, AOA, TWICE, and many, many more musical acts. The lineup for KCON NY and KCON LA 2017 have yet to be announced, but with an additional concert there will be even more opportunities for American fans of Korean music fans to see their favorite stars. “Our core events in Los Angeles and New York have built the strong foundation for KCON’s rapid global expansion in the past few years,” said HK Shin, President of CJ E&M Music Division. “Each successful launch reinforces the idea that Korean pop culture is a worldwide phenomenon of which we are at the forefront.” Update (6/15/17): KCON 2017 LA will have two concerts as per past years. Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2017-03-02T17:31:04+00:00",
    "url": "https://www.billboard.com/music/music-news/kcon-east-west-coast-ny-la-dates-7709385/"
}