{
    "title": "Skin Garden: Demand for Korean Brand Moisturizers Is Growing at Remarkable Rate in Tokyo | Business Wire",
    "text": "Skin Garden, a K-cosmetics shop located in the central area of the Korean wave shopping district in Shinjuku, Tokyo (Photo: Business Wire) Skin Garden, a K-cosmetics shop located in the central area of the Korean wave shopping district in Shinjuku, Tokyo (Photo: Business Wire)  TOKYO--(BUSINESS WIRE)--Skin Garden (http://www.skingarden.jp/), \n      a K-cosmetics shop located in the central area of the Korean wave \n      shopping district in Shinjuku, Tokyo, announced that the sales of \n      moisturizing products have increased remarkably.  This is because Japanese customers are queuing up for Korean brand \n      moisturizers to care for their skin that has become dry due to change of \n      the season. “Recently, the sales of Skin Garden ‘Hydro-gel Eye Patch’ and ‘Soothing \n      Moisture Gel,’ which are Skin Garden’s PB brands, and Korean cosmetics \n      brands’ mask sheets and moisturizing skin care products have increased \n      sharply,” said an insider of Skin Garden, a leading Hallyu cosmetics \n      shop in Japan. “The technological power of Korean cosmetics providing \n      rich nourishment and moisturizing effect at a reasonable price range \n      must have been a key to capturing the heart of meticulous Japanese \n      consumers.” Offering a wide range of trendy items at reasonable prices, Skin Garden, \n      a K-beauty select shop, is much loved by Japanese consumers.  Skin GardenYoungun Park, +82 70-8768-7946park98@skingarden.jp  Sales of moisturizing products at Skin Garden, a K-cosmetics shop, have increased. Japanese customers are queuing up for Korean brand moisturizers to care for their skin. Skin GardenYoungun Park, +82 70-8768-7946park98@skingarden.jp  ",
    "datetime": null,
    "url": "https://www.businesswire.com/news/home/20150923006380/en/Skin-Garden-Demand-for-Korean-Brand-Moisturizers-Is-Growing-at-Remarkable-Rate-in-Tokyo"
}