{
    "title": "Skrillex riding high on K-pop wave | The Straits Times",
    "text": "Grammy Award-winning music producer and DJ Skrillex has been riding high on the K-pop wave recently with his new hit single Dirty Vibe. The electronica hip-hop ditty, a collaboration with fellow American music producer Diplo, also happens to feature rapping by K-pop megastars G-Dragon from BigBang and CL from girl group 2NE1. The track itself has attracted more than 5.2 million views on YouTube since it was dropped in March, and a music video starring G-Dragon and CL made its premiere two days ago. The K-pop collaboration is set to continue as Skrillex, 26, says he and his crew plan on \"coming back to Asia a lot more and putting out more stuff here\". Speaking to Life! just before his headline set at annual ravefest ZoukOut last Saturday night, he says: \"I'm working on CL's solo record right now, me and Diplo are doing a lot of stuff for her, and it's the same with G-Dragon... for his new music.\" He adds that \"Asia is right at the tipping point where music is going to be like (huge)\", but hopes Asian music producers and DJs are getting more play and featuring more at international music events. He says: \"The biggest thing lacking in Asia right now in the festival scene is that you play all these festivals, and you see all these things going on, but there's not enough local input. I want to see more Asian DJs and artists... especially in Asia, where there seems to be a more communal culture, even for underground music.\" Skrillex, whose real name is Sonny Moore, grew up in Los Angeles and was first introduced to electronica at age 12 through an unexpected way - watching a heavy metal music programme on MTV. He recounts: \"So (the band) Korn was hosting it, and I was a big Korn fan, still am. The guitarist Munky selected the song Come To Daddy by Aphex Twin and I immediately bought the EP. And it was like Warp Records, Autechre, Squarepusher, Prefuse 73, Aphex Twin. Those are the records I grew up with in electronic music.\" Not that he started making electronic dance music straight away. At age 16, he left school to join post-hardcore American band From First To Last as the lead singer, recording two studio albums with the band before leaving to pursue a solo career in 2007. A self-taught music producer, he started performing under the name Skrillex - taken from the screen name he used for his social media devices and chat programmes - and released a string of EPs in 2010 and 2011. Those EPs gave him a slew of hit songs, including Bangarang, Scary Monsters And Nice Sprites, First Of The Year and Summit, and cemented him as a music producer who made the genre of dubstep more accessible to a mainstream audience. In 2012 and last year, he won six Grammys, including awards for Best Dance Recording and Best Dance/ Electronica Album. This year, he released his first full-length album, Recess, which has received rave reviews from critics. He has also broken into Hollywood, scoring for films such as Spring Breakers (2012), and contributing to sound design in Transformers: Age Of Extinction (2014). Skrillex, whose music is often a genre-defying blend of hip-hop, reggae, dub, house, techno, electronica and random music samples, says science-fiction theories are among his inspirational drivers in music. He says: \"Science fiction inspires what I think can be tangible one day. It's the reason why we have iPhones with FaceTime - because someone created that in a book or movie... it inspires things we want to use in technology. \"Music is pure imagination and when you dream up a song, you dream up your own world.\" Electronic dance music is all the rage now, dominating the festival circuit, and Skrillex predicts that the genre is not going away any time soon. He says: \"Electronic music will go away only when computers go away. It's like the tool we use to communicate, and as far as people want to express themselves and the tools get better... that is what will decide the future of music.\" melk@sph.com.sg Join ST's Telegram channel and get the latest breaking news delivered to you. Read 3 articles and stand to win rewards Spin the wheel now MCI (P) 066/10/2023. Published by SPH Media Limited, Co. Regn. No. 202120748H. Copyright © 2023 SPH Media Limited. All rights reserved. ",
    "datetime": "2014-12-18T09:30:47+08:00",
    "url": "https://www.straitstimes.com/lifestyle/entertainment/skrillex-riding-high-on-k-pop-wave"
}