{
    "title": "SM Entertainment founder Lee Soo-man on K-pop future, running business",
    "text": " Related Stories It's been more than 3 decades since Soo-man Lee founded SM Entertainment, one of South Korea's music agencies known for bringing K-pop to the world. The entertainment company, originally founded as SM Studio in 1989, became one of the first to kickstart the global Hallyu wave — better known as the Korean wave. But Lee's music was not always based off Korean pop music. \"I became a singer when I was 19. Although I was famous, I realized that the audience was really quiet when I sang because I sang folk songs,\" he told CNBC's Chery Kang in an interview for The CNBC Conversation. \"But when foreign bands come to [South Korea to] perform, they completely took over the stage and fans went wild. When I went to check out the concert, it seemed like the fans were more enthusiastic than in mine,\" said Lee, who is founding chairman of the company. Lee said that's when he began to think about taking South Korea's pop music to the world. \"As I studied in the U.S., I learned a lot and thought it would be nice to promote Korean songs and singers overseas. That's the start [of SM Entertainment].\" Over the years, the 70-year-old developed a system he calls \"culture technology\" — through which he recruited and nurtured talent in a systematic way of casting, training, producing, and management. The system is behind the song production of SM Entertainment's K-pop top bands — such as Super Junior, Girls' Generation and Red Velvet. \"There is a written 'culture technology' manual somewhere in my office,\" he said, explaining that it combines both culture and technology in a \"logically formulized\" way. \"The manual will allow employees to learn and transfer 'know-how' out of it. Because I'm an engineer, it is to be understood by logic. It lays out formulas,\" Lee said, sharing that he has a Master's degree in computer engineering. \"So, I can say that I am an engineer rather than an artiste.\" Even as SM Entertainment's music continues to go global, Lee says it's important to continually innovate and stay ahead of the competition in the music industry. \"We need to be at that world class level, and we are focusing on what's missing and what kind of distinctions we can make\" from other genres of music,\" he told CNBC. Lee works with producers and songwriters from the U.K. and U.S. on accompaniments, track songs, kick drum and bass, which he adapts to South Korean and Asian culture. As for the significance of China's influence in the K-pop industry, Lee admits that money will have a \"powerful influence,\" but said he remains confident creativity that comes from producing will have \"infinite value.\" The issue of mental health is something that remains a focus for his company, Lee says. \"'Be humble, be kind and be the love' is what we teach our talents and people in SM … Things are a lot better now and global management companies are trying to learn about it.\" Lee also said his company is \"connecting them to counselors and doctors so that they can get help anytime. We may not have the same economies of scale like CNBC, but we learned these things are very important.\" As for the future of K-pop, \"I think the metaverse that everyone is talking about these days is the future,\" Lee says. SM Entertainment established a metaverse world called SM Culture Universe, and launched its first metaverse girl band, Aespa in 2020. The group is made up of four real-life members – Karina, Winter, Ning Ning, and Giselle – and their corresponding virtual counterparts. \"SM Entertainment is building 'Play-2-Create'… people can discover their creative side and create in the metaverse. They will realize, 'Oh, I can create. I can make music. I can create dance moves. I can make clothes. I can style artists.'\" To realize the concept of \"Play-2-Create,\" the company partnered with metaverse companies like The Sandbox earlier this year. Players can create NFTs and games surrounding \"K-content\" in SMTOWN LAND, a virtual land in The Sandbox under SM Entertainment. NFTs are non-fungible tokens which are unique digital assets, like artwork and sports trading cards, that are stored using blockchain technology. Lee believes that any country can create something as successful as K-pop, but the metaverse will be key. \"You cannot create a genre by copying K-pop. Everyone will view it as K-pop. Now, you need to show it in the metaverse.\" \"I think we just need to let the fans become producers and consumers at the same time. Let them create… Young people will have the huge satisfaction of creation and will end up creating massive amounts of intellectual property and content.\" For those aspiring to become K-pop artists some day, Lee has this piece of advice: \"Self-assessment is very important.\" \"Without looking at yourself in the mirror, you have no idea what you'd look like when dancing, even if you danced really hard … It is when you can see and feel what you don't do well that you learn.\" Don't miss: CEO of multimillion-dollar company Casetify shares his No. 1 ‘super underrated’ business tip Like this story? Subscribe to CNBC Make It on YouTube! Get Make It newsletters delivered to your inbox Learn more about the world of CNBC Make It © 2023 CNBC LLC. All Rights Reserved. A Division of NBC Universal ",
    "datetime": "2022-12-05T01:24:39+0000",
    "url": "https://www.cnbc.com/2022/12/05/sm-entertainment-founder-lee-soo-man-on-k-pop-future-running-business.html"
}