{
    "title": "\r\n\tSmash-hit TV drama sustains 'Korean wave' across Asia  | Media | Campaign Asia\r\n",
    "text": "HONG KONG - A Korean TV series titled 'My Love From the Star' has made an impact far beyond its home country, benefitting brands from luxury handbags to fried chicken. The only people unhappy with the show's success and what it bodes for the future may be traditional broadcasters. Following K-pop stars into a position of influence, Korean drama has ramped up its influence across Asia, demonstrating the power of product placement in popular TV programmes. The show, known in English as ‘You Who Came From The Star’ or 'My Love From The Star', in Korean as ' 별에서 온그대' and in Chinese as '來自星星的你', is a romantic drama series produced by HB Entertainment. It aired on SBS (Seoul Broadcasting System) starting in December and concluded its run of 21 episodes on 27 February. The plot centers on an alien, played by Kim Soo-hyun (金秀賢), who crash-landed on earth 400 years ago in the Joseon Dynasty. Having lived for four centuries on this planet (in a handsome, ageless physical form), the alien falls in love with a famous actress, played by actual famous actress Jun Ji-hyun (全智賢), in the modern era. A star-crossed-lovers plot ensues, hurried along by the alien's sudden opportunity to finally return home.  The series has done well ratings-wise in Korea, and is being broadcast in Malaysia on Astro's One HD. Hong Kong's Media Asia Entertainment plans to make a movie version. In China, streams of the show on iqiyi.com have been accessed an astonishing 14.5 billion times, according to the Wall Street Journal. In Hong Kong, Campaign Asia-Pacific's own observations in offices, buses and MTR trains indicate that the show is an enormous hit across a wide age range. Most of Hong Kong's viewers seem to be accessing the show on PPTV and consuming it exclusively on smartphones and tablets. Campaign spoke with a number of media and marketing executives—some of whom are die-hard fans of the drama—to understand why this one stands out from the crowd, which brands have benefited from it and why its extensive product placement hasn't put off viewers. “Mobility in watching TV dramas is the key,\" said Kelvin Lee, account manager of Cheil Hong Kong. \"As office workers like us often work late, how could we follow the fixed TV timetable on [local broadcast channel] TVB? I normally catch up on TV dramas on my iPad when resting in bed, or watch it for 15 minutes during a lunch break.\" Alice Lee, general manager of Media Palette Hong Kong, echoed that point of accessibility. “As people can watch the drama anywhere, anytime, this would be easy to create the talk of the town,\" she said, adding that the show also deftly mixes a love story with unconventional treatments of alien life and crime. \"Social media also magnifies the peer pressure to make the drama spread widely,” she said.  Jordan Lau, head of business development at the Hong Kong Economic Journal, who previously worked at a local TV station and in 4A agencies, said traditional media coverage has helped the show. For example, Apple Daily devoted extensive coverage to the show—something it does not do for local programming on TVB. People also like watching American dramas, but there is no such broad-based media coverage to boost their popularity, Lau said. Brand impact The series contains extensive product placement, which the lead character's profession as a popular actress enables. Brands including Samsung, Mercedes, YSL, Line, CK rings, Prada, UGG, Burberry, TopShop, Laneige, Canon, Balmain, and Korean eyewear brand Gentle Monster feature in the programme. A runway show for the fashion brand Chloe even takes place within the show itself. Online, fans take to detailing the brands Jun Ji-hyun is seen wearing. “I have a friend who follows the actress using a YSL lipstick [that appeared in the show] and uploaded her photos on Instagram,\" said Samantha Wong, account executive of Cheil Hong Kong. “Most of my friends are starting to use Line too, besides using WhatsApp, as we like to download the Line icons. They even have a 'sticker' for Jun Ji-hyun.” The drama features more attractive clothes and houses than the TV dramas in Hong Kong, she added. “I guess the drama needed all the sponsors, because it was more expensive to have an A-list cast,\" commented a Korean marketing manager who preferred not to be named. Kelvin Lee said fans appreciate that the product placement in Korean dramas is done in a natural way that fits the storyline. “They are good at packaging their stories,\" he said. Alice Lee agreed. “Product placement needs to fuel into the program in a subtle, yet aware way,\" she said. \"A mutual understanding and communication between the production and brands are vital.\"  The drama's success has left at least one media executive in Hong Kong envious. Ray Wong, CEO of PHD Hong Kong, said Hong Kong's TV stations should review why they cannot produce dramas of such a high standard. “Local TV dramas are often filmed in studio rather than on nice locations, their background music is boring with not much variety and the restriction of product placements in Hong Kong is much stricter than in many developed countries,\" he said. \"The Television and Entertainment Licensing Authority should relax its restrictions, as good and relevant product placements could tie in well with the story as well as showing the product benefits effectively.” Bandwagon effect In addition to the brands directly involved in the production, others have capitalised either passively (such as providers of fried chicken, which the main character loves) or actively. An example of the latter is travel agent EGL Tours, which is offering packages to visit some of the show's locations. Other companies, like shopping mall Harbour City, have sought to bask in the halo of the show by featuring it in their social-media platforms. Top news, insights and analysis every weekday Sign up for Campaign Bulletins Who doesn't love enjoying a nice sweet treat. But would you use one to brush your teeth with before bed? From next year, Mickey Mouse the legendary rodent, will no longer be owned by Disney. With the chains of IP law beginning to unshackle, what does this mean for the future of the brand's beloved character? This tarot-reading Havas creative pines to visit the ancient pyramids of Egypt, get off Instagram so she can embrace a digital detox, and is busy trusting the process. A Mindshare China loyalist of over 24-years, Low is instrumental for commercial gains as well as client and staff retention. Terms & Conditions / Contact Us © Haymarket Media Ltd. ",
    "datetime": null,
    "url": "https://www.campaignasia.com/article/smash-hit-tv-drama-sustains-korean-wave-across-asia/373967"
}