{
    "title": "So whatever happened to pop music’s Korean Invasion? - The Globe and Mail",
    "text": "This article was published more than 9 years ago. Some information may no longer be current. South Korean rapper Psy performs his massive K-pop hit Gangnam Style live on NBC's Today show in September, 2012.Jason DeCrow/The Associated Press Has K-Pop become a K-Flop? Eighteen months ago, there was lots of talk in the press about the Korean Wave and how it was about to inundate North American airwaves with a flood of South Korean popular music, or K-Pop. In 2012, Girls' Generation, a smile-intensive, nine-member singing and dancing group, packed Madison Square Garden, charmed David Letterman, and was profiled in The New Yorker and The Wall Street Journal. Another K-Pop girl group, the Wonder Girls, were in a made-for-TV movie on Nickelodeon. And the hip-hop oriented acts 2NE1 and Big Bang were included with One Direction and fun on American MTV's \"Best Band Style 2012\" list. But the brightest K-Pop star by far was Psy, the husky, bespectacled rapper behind the mega-smash Gangnam Style. A huge hit around the globe, it topped the charts in nine countries and totted up over a billion YouTube views by year's end. It was clearly the K-Pop hit of 2012. Gangnam Style was also the biggest-selling K-Pop hit of 2013, which leaves some people wondering what happened to that Korean Invasion we were supposed to be getting. Although K-Pop acts continued to dominate the charts throughout Asia, their presence in North America was a bit anemic. Of last year's 10 best-selling K-Pop singles in America, only six were actually released in 2013. Two, including Gangnam Style, were from 2012, one was from 2011, and one – Right Now, also by Psy – was from 2010. Further, only one Korean artist, stylist rapper G-Dragon, managed to crack the Billboard album charts, inching up to 182 on the Hot 200. Certainly, when compared to the British Invasion of the sixties or even the Australian Invasion of the eighties, K-Pop has had minimal impact in North America. But pop stardom worked differently in the days before YouTube, and best-selling singles may not be the best metric for assessing K-Pop's impact. \"K-Pop lives and breathes online,\" observes Jeff Benjamin, a New York-based writer and critic who covers K-Pop for Billboard. \"That's why it's been able to cross into mainstream consciousness.\" He notes that Gangnam Style remains a huge YouTube hit, with a view count that has passed 1.8 billion. \"It never lost that much steam.\" Psy, in general, had a great year. Gentleman, the follow-up to Gangnam Style, garnered over 600 million YouTube views, and he maintained a considerable presence on this side of the Pacific, including a slot co-hosting the MuchMusic Video Awards in Toronto in June. By comparison, many K-Pop acts spent 2013 as before, releasing albums in Asia, putting videos on YouTube, and acting as if any North American attention they earned was merely gravy. Some of this may have to do with the changing shape of the world music market. However much the music industry might insist that the future is downloads, the big money in terms of artist royalties remains in CDs. At the moment, the United States remains the world's biggest music market overall. But when the sales figures are restricted to CDs only, Japan – where downloading hasn't caught on – becomes the top market. To take advantage of this market, many K-Pop acts re-record their Korean hits in Japanese, or create new material for that market. Girls' Generation, for example, has released two albums in Japan and one in South Korea in the last 14 months, with an overlap of only one song. Both Japanese albums went straight to No. 1 on Japan's Oricon album charts. The group also released its first Chinese-language single, Find Your Soul, in December. That may explain why the group's last effort for the North American market, The Boys, came out in 2011. They've been busy elsewhere. It's also worth remembering that breaking through in North America has never been easy. Touring Canada and the U.S. involves travelling many more miles than trying to cover South Korea and Japan, or even Europe, and even the British and Australian acts that broke through in previous decades did so only after months of effort. By contrast, says Benjamin, \"K-Pop stars don't extensively tour, and that keeps expectation super high.\" The idea is to turn concerts into special, must-see events, which can then be remarketed through concert DVDs. Although the approach builds deep fan loyalty, it's one that takes time. This reality isn't lost on the businessmen and producers behind K-Pop. As Lee Ho-yang, who concocted hits for K-Pop acts T-ara, 4minute and Beast, told The Korea Times last year, it will take more than a mega-hit like Gangnam Style to conquer North America. \"America is a huge market with very diverse musical tastes and challenges,\" he said. \"It's all but impossible to sweep it all with one shot.\" Perhaps it's a mistake, then, to think of the Korean Wave as a massive tsunami. Instead, it seems more like a steady flow, rising slowly but steadily seeping in. And it will likely be a deeper presence here in 2014. Psy, once again, should be leading the way. He has a closing-credits cameo in the upcoming Liam Neeson film, The Nut Job, and will be releasing his first North American album later this year, featuring cameos by Snoop Dogg and Steven Tyler. Girls' Generation, whose clip for I Got a Boy won the Best Music Video prize at the inaugural YouTube Awards, is planning concerts in the U.S. this summer. And Benjamin has high hopes for the 12-member boy band EXO, whose video Growl was the third most-popular K-Pop video on YouTube last year, after Psy and Girls' Generation. \"There seems to be a lot of potential for them in America,\" he says. Follow us on Twitter: @globeartsOpens in a new window Report an error Editorial code of conduct © Copyright 2023 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO ",
    "datetime": "2014-01-08T15:06:32-0500",
    "url": "https://www.theglobeandmail.com/arts/music/so-whatever-happened-to-pop-musics-korean-invasion/article16243927/"
}