{
    "title": "Soft power | How the Korean Wave is making a splash in the entertainment industry",
    "text": "My Account Follow us on: Powered By Find & Invest in bonds issued by top corporates, PSU Banks, NBFCs, and much more. Invest as low as 10,000 and earn better returns than FD Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now  AMBAREESH BALIGA Fundamental, Stock Ideas, Multibaggers & Insights Subscribe CK NARAYAN Stock & Index F&O Trading Calls & Market Analysis Subscribe SUDARSHAN SUKHANI Technical Call, Trading Calls & Insights Subscribe T GNANASEKAR Commodity Trading Calls & Market Analysis Subscribe MECKLAI FINANCIALS Currency Derivatives Trading Calls & Insights Subscribe SHUBHAM AGARWAL Options Trading Advice and Market Analysis Subscribe MARKET SMITH INDIA Model portfolios, Investment Ideas, Guru Screens and Much More Subscribe TraderSmith Proprietary system driven Rule Based Trading calls Subscribe   Curated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas Subscribe Curated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas Explore STOCK REPORTS BY THOMSON REUTERS Details stock report and investment recommendation Subscribe POWER YOUR TRADE Technical and Commodity Calls Subscribe INVESTMENT WATCH Set price, volume and news alerts Subscribe STOCKAXIS EMERGING MARKET LEADERS 15-20 High Growth Stocks primed for price jumps Subscribe Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free ",
    "datetime": null,
    "url": "https://www.moneycontrol.com/news/photos/trends/entertainment/how-the-korean-wave-is-making-a-splash-in-the-entertainment-industry-7766831.html"
}