{
    "title": "Soju is becoming more popular in Singapore, thanks to the Korean wave - CNA Luxury",
    "text": "Experiences Experiences Experiences Experiences Obsessions Obsessions Obsessions High Time Supplement People People People People Remarkable Living Remarkable Living Remarkable Living Remarkable Living Experiences Experiences With the growth of Korean dining and K-pop culture in Singapore, the Korean spirit has been gaining popularity among drinkers here. Bartender Uno Jang (right) of Jigger & Pony shows how to make a Soju Bomb. (Photo: Jigger & Pony) Soju, the quintessential Korean spirit, had a much later start than Japanese sake in Singapore’s F&B scene. The spirit only began to make its presence felt here in recent years, thanks to the Korean diaspora, the growth of Korean eateries, and the boom of K-pop culture. On the big screen, it was most notably seen in the Oscar-winning South Korean film, Parasite. Jinro, which is produced by HiteJinro, South Korea’s largest manufacturer of soju, is the most popular brand in Korean restaurants and bars here. You can find Jinro’s soju variants in major supermarkets like Cold Storage and FairPrice, too.          \n     \nFor the uninitiated, soju is a colourless spirit distilled from starches like potatoes or sweet potatoes – it was traditionally distilled from grains like rice, barley, or wheat. Soju is sometimes confused with the Japanese shochu, although people who make such a mistake aren’t far off the mark. Apart from stricter production rules for shochu, both spirits are basically the same: They are distilled from the same kind of ingredients, and their names in hanja and kanji – the Korean and Japanese scripts for Chinese characters respectively – mean “burned alcohol”, a reference to the distillation method.\n     \nShochu’s 25 percent alcohol by volume (ABV) is generally higher than its Korean counterpart, which usually hovers between 16 percent ABV and 24 percent ABV for popular brands such as those from Jinro, although it’s not rare to find premium sojus with 45 per cent ABV. Should soju only be drunk neat? Can you turn it into a cocktail? Can it be paired with food? We talk to soju purveyors to find out what you need to know about enjoying the spirit. YOU DON’T HAVE TO DRINK IT NEAT\nSojus are usually drunk neat, but they can also be turned into cocktails, such as somaek or Soju Bomb, a concoction of soju and beer. “Most Koreans were first taught how to drink soju or other Korean spirits by their parents at home,” said Uno Jang, a South Korean and principal bartender of Jigger & Pony. “Most people drank it as shots during that time, but since then there have been some changes in drinking habits as people began drinking soju with mixers like beer, tonic, or soda. Others drink Coke on the side as a chaser.”\n     \nKristin Lim, co-owner of modern Korean eatery Joo Bar in Bugis, noted that flavoured sojus, which entered the market here in 2015, helped boost the popularity of the spirit among her diners.\n     \n“Many customers started drinking more fruit-flavoured sojus as they were slightly lower in ABV, sweeter, and – to some drinkers – more palatable on their own,” said Lim, who opened her establishment in 2014. She carries Jinro’s sojus and also offers Yakult-soju, which has “a tangy taste and goes perfectly with just about anything”.  NOT ALL SOJUS TASTE ROUGH\nJang likened the taste of soju to vodka. “Both are usually made from grains, and the liquid is clear and smooth. They are also best consumed cold,” he said.\n     \nLim said many Korean dramas featured scenes of actors drinking soju while making “that characteristic throaty sound as they down a glass”.\n     \n“Somehow this seemed to give the impression of soju as a very strong-tasting drink with a bit of a rough finish,” she added. “The general tasting notes for soju are actually clean and mild, with some sweet notes. If you stick with the well-known brands like Jinro, you can’t go wrong.”\n     \nLeonard Tan, director of Amber Nectar, the sole distributor of Jinro in Singapore, noted that Jinro has developed a patented bamboo filtration technology that filters its soju four times – the Chamisul Fresh is one such product – which removes odours and other impurities.\n     \n“Notably, we noticed an increasing appreciation of unflavoured sojus like Chamisul Fresh and Jinro is Back [the original Jinro soju first introduced in 1924, now presented in a clear blue bottle] among consumers,” he said. SOJU DISTILLED FROM STARCHES IS NOT INFERIOR Traditionally, soju was distilled from rice grains but a rice shortage in the 1960s prompted the South Korean government to ban the use of rice for alcohol production. Soju producers then switched to using starches. Although the ban was lifted in 1999, many modern soju producers continued using the alternative ingredients, which are also cheaper than rice grains.\n     \n“Soju drinkers have gotten used to the spirit produced [with starches],” said Tan. “Hence using a mix of starches to make soju has become the new normal today.”     \nJang highlighted that sojus made from ingredients other than rice are not inferior.\n     \n“[The ingredient used] is also dependent on the history of soju production in relation to its geographical location. Some regions in South Korea are not suitable for rice cultivation, so they make soju with other ingredients like millet, sorghum, or sweet potato,” said Jang. “I believe they are just different, not wrong or inferior.” SOJU WORKS BEST WITH GRILLED MEATS\nSoju is often coupled with Korean BBQ. Lim said: “Soju pairs well with pork belly and grilled meats in general. It’s traditionally been known to cut through grease and oil very well, so much so that they even use leftover soju to wipe down the oily tables in Korean BBQ restaurants.” Somaek or soju with beer is perfect when drunk with crispy fried chicken, she added.       \n     \nTan said the unflavoured Chamisul Fresh is versatile enough to be paired with local dishes like sambal stingray, satay, and BBQ chicken wings.\n     \nPairing food with soju is pretty much a casual affair – there’s no need to put on your sommelier cap.\n     \nJang noted that Korean cuisine is usually served as a set, and not a multi-course, meal. Thus, multiple food and alcohol pairings aren’t needed. “All the dishes are served at the same time except desserts,” he said. “People usually pair their set meal with one type of Korean spirit or wine. They generally do not drink different types of spirits or wines at a meal, unlike in French cuisine.” FINISH YOUR FIRST SHOT IN ONE GO\nIf you want to impress your Korean friends, especially your business partners, you’d do well to observe the drinking rules of soju. Those familiar with the etiquette of drinking Japanese sake would know that you should never pour your own drink but let a companion do it. Ditto for soju.  \n     \nAccording to Tan, the oldest person in the group should pour the first shot of soju into everyone’s glasses, after which another member of the group should pour a shot for the server. You should also use both hands when pouring or receiving a glass as a sign of respect.\n       \n“The first shot of soju should always be downed in one go, but it’s acceptable to sip [the subsequent shot],” said Tan. “[When drinking with seniors], one should turn his head and avoid eye contact, as well as cover his mouth when drinking to show greater regard for the elders.” Copyright© Mediacorp 2023. Mediacorp Pte Ltd. All rights reserved. We know it's a hassle to switch browsers but we want your experience with CNA to be fast, secure and the best it can possibly be. To continue, upgrade to a supported browser or, for the finest experience, download the mobile app. Upgraded but still having issues? Contact us ",
    "datetime": null,
    "url": "https://cnaluxury.channelnewsasia.com/experiences/where-drink-soju-singapore-188951"
}