{
    "title": "Song Hye Kyo Shares Her Thoughts On Her Responsibility As A Hallyu Star | Soompi",
    "text": "Song Hye Kyo opened up about being a Hallyu (Korean wave) star. Actress Song Hye Kyo is a living witness who has walked the same path as Korean dramas, which are a central part of Hallyu. At the same time Korean dramas swept through Japan and China, Song Hye Kyo became recognized overseas for various dramas ranging from KBS2’s “Autumn in My Heart” in 2000 to tvN’s “Encounter” that ended earlier this year. It is partly due to the steady creation of quality content that “K-dramas” emerged as a brand in itself, but the stellar actors played a central role in its rise. The term Hallyu came to be, and Song Hye Kyo was one of the first actors to be included in it. In fact, Song Hye Kyo proudly topped the K-drama category in the “Hallyu Diagnosis, We Asked 100 Experts” survey conducted by Sports Seoul last month. When asked about how she’s doing recently, the actress answered, “I’ve been meeting up with people I couldn’t meet when I was busy shooting a drama, and I’m resting while going on vacation. I’m also reviewing offers for my next project.” Asked about what the title “Hallyu star” meant to her, she replied, “I think it serves to promote a new image and culture of Korea. It is a proud title that can also be a heavy burden.” Song Hye Kyo is well-known for promoting Korea overseas. She has been contributing guidebooks to Korean independence movement sites overseas like Shanghai with Professor Seo Kyung Duk and donated 10,000 copies of Korean and Chinese guidebooks to the Hangzhou Temporary Government Memorial Museum to mark the 100th anniversary of the establishment of the Provisional Government of Korea. She is also focusing her efforts on providing Korean language services to world-famous museums including the Museum of Modern Art in New York and the Museum of Toronto. Song Hye Kyo mentioned her interest in language and history while talking about how she changed through Hallyu. She said, “My interest in language has grown. While communicating with overseas fans, I thought that the first thing they needed was a language [that could be mutually understood], and I’m continuing to do my best to learn [languages]. My interest in history has increased as well. As I have been working overseas, I feel a lot of responsibility as a Korean actor. I am making various efforts to convey our history and culture.” There were times when Song Hye Kyo was moved by the enthusiastic response from fans. she said, “I feel honored and grateful that people of various nationalities love me and my work. That’s also my driving force.” Then she added, “I was surprised to learn later that overseas fans were doing volunteer work together as ‘Song Hye Kyo’s fans’ and making joint donations. I’m so grateful, and it remains a memory I’m very proud of.” When asked about her expectations about the future growth of Hallyu, the actress stated, “It would be important to make various new points of contact based on a cultural understanding of each other. I think we can expand Hallyu through active exchanges, such as working with local production companies and artists.” Song Hye Kyo has also engaged in activities in China. She participated in Chinese films such as “The Grandmaster” (2013) and “Love and Let Love” (2017) and attended the Hong Kong Gold Merit Film Awards as an award presenter this year. Later, she signed with Wong Kar Wai’s film production company Jet Tone Films. The actress also expressed her desire to “work with more Chinese directors, actors and actresses in the future.” To her fans all over the world, she said, “I’m always grateful that I’m receiving lots of love. I’ll do my best to return that love with good projects and acting.” Start watching her latest drama “Encounter” with English subtitles below! Watch Now Source (1) ",
    "datetime": "1557200569",
    "url": "https://www.soompi.com/article/1322654wpp/song-hye-kyo-shares-her-thoughts-on-her-responsibility-as-a-hallyu-star"
}