{
    "title": "South Korean festival hits London – everything from K-pop to kimchi | London | The Guardian",
    "text": "Trafalgar Square event on Sunday 9 August includes modern Korean pop band f(x) as well as traditional food and fashion London is to host its first ever South Korean festival on Sunday 9 August with live performances and food, fashion and games stalls, to help foster better understanding of the nation as it approaches its 70th year of independence. The festival at Trafalgar Square will feature a K-pop concert, traditional handcraft workshops, trade zones and Korean animation screenings. Kevin Kim, 19, moved to London from South Korea seven years ago. He works at a Korean supermarket in New Malden in Surrey and while stacking boxes of bean paste and anchovy sauce at the store he explained how perceptions of South Korea have changed. “My friends at school didn’t know much about South Korea, but it changed after Psy’s Gangnam Style, and then they became more interested in our culture, music and food,” Kim said, in reference to the music video viewed more than 2.38bn times. Kim said there are still misconceptions about his country, with the most common being that some people he speaks to do not distinguish between people from differing east Asian countries. He said the South Korean festival could be a good thing for raising awareness of his home country, which on 15 August will celebrate Gwangbokjeol or Restoration of Light Day, marking its liberation from Japan in 1945. On Sunday, the festival will feature a performance by pop group f(x) who have been described as the Korean Spice Girls and world champion breakdancers Jinjo crew, while various designs of hanbok or traditional Korean dress will be showcased at a fashion show. Sitting at her restaurant in London’s West End just as staff lunch was to be served, Judy Joo, an American-Korean celebrity chef, told the Guardian: “Koreans are known as the drama queens of Asia – they wear their hearts on the sleeves. What you see is what you get in Korea.” Joo, who will be doing a live cooking demonstration, said she was looking forward to the event of Sunday that will be a chance to “open up people’s eyes, ears and mouths to try things”. Joo will be making a Bloody Mary cocktail with kimchi, which she described as the spaghetti sauce of the east with each Korean grandmother traditionally having her own recipe, made with vegetables and a variety of seasonings left to ferment for months underground in jars. Instead of adding vodka to the beverage Joo will be using soju, which she said is “actually the number one alcohol in the world but nobody [here] has ever heard of it”. The increasing popularity of Korean drama, cinema and food, along with ubiquitous Korean technology companies such as Samsung often seen sponsoring large sporting events, are all part of “hallyu” – or the Korean wave of contemporary culture – according to Sylvia Park, chairman of the British Korean Women’s society. “When I came to London during the early 1970s representing the Korea Tourist Board, promoting Korea to the UK and Ireland, there were not many Koreans living here. It was difficult to get more than hundred altogether,” Park said. “There was only one Korean restaurant. Now there are roughly 200 in the UK with about half being in London.” Park told the Guardian there are now about 20 Korean schools throughout the UK. Around 45,000 Koreans live in the UK, with 20,000 living in Kingston in London, making it the largest Korean community in Europe. Kingston is currently hosting its own Korean festival with art exhibitions, dance performances and its own jangmadang or marketplace. New Malden is now often referred to as Little Seoul, with signs embossed with Korean lettering, Korean cafes, and Korean karaoke lounges. “Over the years London has become more open to Koreans. Londoners know more about Korea than in the past, largely because more information is available,” Park says. “When someone mentions Korea now Londoners do not think – and this especially applies the younger generation – of the Korean war.” “The fact that we are hosting an event in the premier site in London shows how far Korea has come in terms of its relationship with the UK and the way that it as a destination has grabbed the imagination of the UK public,” said Ramy Salameh from the Korean Tourism Organisation. Closer cultural and technological links between the UK and South Korea are being pushed and a memorandum of understanding was signed in 2013 by Francis Maude, the then minister for the Cabinet Office, and Choi Mun-kee, the minister of science, ICT and future planning for the Republic of Korea. Korea has been very clever on capitalising on making certain aspects of its culture popular in global markets, according to Salameh. “Yet if you go to Korea, its society still retains that very gentle culture but mixed with this super dynamic 21st century high technology, which makes it the most wired-up country. It has the fastest Wi-Fi on the planet.” He added that Koreans are living the rest of the world’s future, “so you know what they’re doing now is what we can expect in another five or ten years”. Salameh said when he first began his job, people could not put a finger on the map to where South Korea was, “but now you’ve got to this point in a short space of time where you can explain to people that Gangnam is actually a district in Seoul.” ",
    "datetime": "2015-08-06T14:53:41.000Z",
    "url": "https://www.theguardian.com/uk-news/2015/aug/06/south-korean-festival-london-k-pop-kimchi-trafalgar-square"
}