{
    "title": "South Korea inspects its EXPO 2017 pavilion, will showcase latest energy technology",
    "text": "By Yerbolat Uatkhanov in EXPO 2017 on 25 April 2017 ASTANA – President and Chief Executive Officer of the Korea Trade-Investment Promotion Agency (KOTRA) Jaehong Kim and Astana EXPO 2017 national company Chairman Akhmetzhan Yessimov agreed to cooperate on the event during an April 19 visit to the expo site. Kim visited the site to check on construction of the Korean pavilion. President and CEO of Korea Trade-Investment Promotion Agency Jaehong Kim with Astana EXPO 2017 Chairman Akhmetzhan Yessimov “The Korean pavilion at Astana EXPO 2017 will be a memorable place for visitors and they will have an opportunity to experience the latest Korean technologies and culture with the accompaniment of the Energy Seed,” said the KOTRA president and CEO. Astana EXPO 2017 is the first international exhibition hosted by a Commonwealth of Independent States (CIS) country. It will be held June 10 to Sept. 10 under the theme Future Energy. One-hundred-and-fifteen countries have confirmed their participation and are expected to showcase the latest in energy technology. Korea is expected to have one of the largest pavilions under the theme of Future Energy, Smart Life. The main concept of the Korean pavilion follows a timeline of how one becomes an energy-efficient citizen by developing new renewable energy technology, constructed closely by the Energy Seed, the core source of all energy. South Korea will also promote Korean culture through K-Wave performances and events. \nThe Korean pavilion is expected to enhance relations and energy-related industry relationships with CIS countries, known for their abundant natural resources. Get The Astana Times stories sent directly to you! Sign up via the website or subscribe to our Twitter, Facebook, Instagram, Telegram, YouTube and Tiktok! ",
    "datetime": "2017-04-25T04:29:45+00:00",
    "url": "https://astanatimes.com/2017/04/south-korea-inspects-its-expo-2017-pavilion-will-showcase-latest-energy-technology/"
}