{
    "title": "South Korean government’s Hallyu department announces plans to support Hallyu expansion - Entertainment - The Jakarta Post",
    "text": "Please Update your browser Your browser is out of date, and may not be compatible with our website. A list of the most popular web browsers can be found below.\n          Just click on the icons to get to the download page.  Or continue login with The Ministry of Culture, Sports and Tourism’s new Hallyu department on Thursday announced detailed plans to support the Korean Wave in a press briefing in Seoul. Before the new department was launched in June, the ministry has only had task forces and committees conducting Hallyu-related projects. Three main strategies -- diversifying Hallyu content, fostering other industries through Hallyu content, and creating a sustainable environment for the growth of Hallyu -- were introduced by the Culture Minister Park Yang-woo during the briefing. “Hallyu content gave us confidence that we can also lead the global cultural industry,” Park said. “But now Hallyu is standing at the crossroads, it is time for the government to apply a wise supporting policy that does not interfere unnecessarily with the private sector.” The ministry declared a “new Hallyu era,” which will grow based on connecting other industries with Hallyu content, following the Hallyu 1.0, Hallyu 2.0 and Hallyu 3.0 eras, which correspond to times when Korean TV dramas, K-pop and Korean culture were considered the main driving forces of the growth. To diversify the country’s Hallyu content, the government especially emphasized that it would support the esports industry. As its first project, the Culture Ministry will organize an esports competition in November. “We are currently planning to hold the competition at KSPO Dome in Olympic Park. But we will watch the coronavirus situation and if we are unable to hold an offline competition we will still organize the event online,” Hallyu department official Kim Hyun-hwan said. Read also: South Korea's culture ministry launches Hallyu department “There was a pattern for how Hallyu stars rose. For instance, the drama becomes popular first then the main cast members gain fame. We see that the same thing can happen to the gaming industry. With support, (Korean) esports players can also be global stars.” Park also said it would foster other industries like beauty, agriculture and fashion through connecting them with Hallyu contents. As one of its main tasks, it plans to create outlets where people can experience K-beauty products in locations like Gangnam and Myeong-dong, which are popular with foreign tourists. The ministry plans to promote these places with Hallyu content. The government said it would connect Hallyu with service-based businesses like tourism, health care and education as well. The ministry added that now that there was a separate department solely for supporting Hallyu, it will become a control tower and oversee diverse Korean Wave-related projects that have been undertaken by different departments and ministries. For instance, it said it will work with the Foreign Ministry to resolve the situation with China, which banned Korean culture in 2016 after South Korea decided to deploy the US anti-missile defense system THAAD. Concerning criticisms that some of the government’s new plans are redundant, as private sector businesses are already engaged in similar activities, the government said it was intentional. “We are not trying to do anything new. For instance, we do know that connecting different businesses like food and K-pop is being done by CJ at KCON. But we see that there are parts that we can support and improve on. We will work on making the current business better,” the official said. “If it is already doing well without support, we will not intervene.” TJP Documentaries: Citayam Fashion Week Sees Youth Reclaim Jakarta's Public Space TJP Documentaries: Viral Chef Vindy Lee Takes Our Indonesian Snacks Etiquette Challenge TJP Documentaries: The Tragic Victims of Robot Trading and Binary Option Scams © 2016 - 2023 PT. Bina Media Tenggara ",
    "datetime": null,
    "url": "http://www.thejakartapost.com/life/2020/07/17/south-korean-governments-hallyu-department-announces-plans-to-support-hallyu-expansion.html"
}