{
    "title": "South Korean showbiz industry booms as world embraces film, TV, music",
    "text": " By \n\n\tPatrick Frater Asia Bureau Chief The third decade of the millennium looks quite different for the Korean entertainment scene compared with just a few years earlier. In March 2020, “Parasite,” a Korean-made film noir made history by winning three Oscars, including best picture. The following year, Korean veteran Youn Yuh-jung took the Oscar for best supporting actress in “Minari,” while in 2022 “Squid Game” leading man Lee Jung-jae looks poised for Emmy accolades. K-pop has broken out to become a phenomenon that tops charts, fills global stadiums and airwaves, and the social media warriors of group BTS, who call themselves “ARMY” would even claim to have had a small influence at the last U.S. presidential election.  In TV and streaming, Disney and Apple are now major investors in Korean programming. They proudly tout their K-cred at the same time they find themselves in a race to catch up with global, regional and even Chinese operators such as Netflix, Viu and Tencent’s WeTV, respectively, to lock in and leverage some of the world’s most exportable IP.  “To see this as new is to reveal your own cultural bias,” says Jeong Taesung, a former CEO of Korean film behemoth CJ Entertainment and who is now running his own startup in Southeast Asia. “Korea has been making inventive, high-quality films and TV productions for more than 20 years now, as everybody in Asia has known for years. K-pop idol groups were conceived more than two decades ago. And BTS has been around for the best part of a decade.” That is a macro view that Asian film, TV and music audiences would largely understand. In many East Asian territories, data shows that Korean content has steadily grown to be bigger than English-language films and TV. Several streamers that misjudged that trend and were unable to adjust in time went out of business even before the COVID upheavals of 2020. Since then, beneath the surface, the pandemic era has forced further changes. These have made the Korean music and TV industries more digitally sophisticated and fit for their increasingly global role. “Arguably, what the Korean industry has done differently is to use digital tools to make its content more discoverable,” says Jeong. For the music business, COVID was a disaster, and put a hard stop to the concert business and the myriad in-person fan events that were typical of Korean contemporary music sector. “This was a crisis for K-pop. But we were able to recover from that and turn it into an opportunity,” says Kim Hyun-soo, head of CJ ENM’s music operations. “We were able to do non-[in-person] concerts. Generation MZ [millennials and Gen Z] is very used to the digital environment, so we invited them into our digital world. From that experience we were able to enhance the fandom of K-pop culture, which in turn led to an increase in consumption.”  Kim says that the rapid pivot to digital presentation helped cross-border artist collaboration and increased the globalization of K-pop among consumers. “The KCON events previously only connected with U.S. fans. But during the pandemic, we leveraged our studios and connections with broadcasting and held online events with different bands all over the world in one digital space. “Similarly, we used our YouTube channel to announce that there’s going to be an online event. We were able to see fans all over the world react immediately. So, in some sense, it was more efficient and effective because everything was done online.” Hybe Corp., the agency behind BTS, is a master of digital promotion. It constructed its Weverse portal to support the band’s unprecedented fan outreach efforts. The unit now leverages technology, ecommerce and music, and brashly describes itself as “the “No.1 global fandom platform.” But it is so successful that rival agencies want to use it. And at the end of July, the solo set of BTS member J-Hope at Lollapalooza (another first) earned 14.9 million streaming views and around 180 million likes on Weverse. As with music concerts, the onset of the pandemic badly rattled film and TV production in Korea. Although TV and music were quick to adapt, but with theaters closed or restricted, local movies remained on ice until May, when major local titles returned to the release calendar. Korean theatrical film is currently operating at around 70% of pre-pandemic levels. The beneficiaries of the two-year hiatus were Hollywood films, which returned to theaters months before Korean titles, and video streaming. In the TV sector, producers used to working mostly on location had to move indoors. “We never stopped producing content, but we had to start shooting in the studios. We’d find ways to leverage effects, and changed storylines to avoid location shooting,” says Kim Yong Kyu, CEO of Studio Dragon, Korea’s largest TV producer. But Kim says the upheaval forced on production was nothing compared revision of the downstream business. “There were more changes in the past three years than the previous 15 years that I worked in this industry. The largest change was distribution. It’s fair to describe it as revolution,” says Kim. “Before COVID, [TV] distribution was divided into two sides, local and international. Once we’d sold our content overseas, we’d just sit and wait for the results. Now we see our content playing all over the world [and get to see how it is working].” Korean content has become a must-have for any streaming platform with global ambitions or hopes of cross-border success in East Asia — that group includes Netflix, Amazon, Apple, Disney, WBD, China’s WeTV and iQiyi, pan-Asian pioneer Viu and Korea’s own Tving and Waave. The trend-setter was Netflix, which made an early strategic shift from licensing and co-producing into production of originals. The move, underlined by a commitment to spend nearly $500 million on K-content in 2021, quickly bore fruit in terms of its market leadership within wealthy Korea. Shows such as “Kingdom” made the streamer’s subscriptions a stickier prospect, especially around Asia.  Korean shows also have what Vivek Couto, managing partner at consultancy and research firm Media Partners Asia, calls the “best travelability.” His firm reported that last year in Southeast Asia, Korean drama shows accounted for 31% of audience time spent on premium services and 4% were spent on Korean unscripted shows, compared with 15% for U.S. TV, 7% for U.S. movies and 12% for Chinese drama. The raging success has not been lost on Korean producers, Netflix’s streaming rivals and Korean lawmakers (who want Netflix to pay more tax). Apple felt it needed a Korean series – “Dr. Brain,” based on a Korean webtoon  and helmed by film ace Kim Jee-woon – for its local launch as a streamer last year. Disney, which had never previously been a significant film or TV producer in Korea, launched Disney+ in the country in November, and is now busily building a slate of K-series, including “Grid,” “Link: Eat, Love, Kill,” “Soundtrack #1,” “Rookie Cops” and “Snowdrop,” starring Blackpink member Jisoo. In presenting a slate of content from Hybe Corp., the Burbank studio even appears to have a junior role in a relationship with the master of fandom. Korean corporations, too, have rallied to scale up and operate on a size that befits their newfound influence. Hybe conducted its IPO at the height of the pandemic in September 2020 and barely six months later paid $1 billion to acquire Scooter Braun’s Ithaca Holdings. In June, producer and distributor Showbox brought in $105 million from Silicon Valley investor Maum Capital to help it diversify away from film into series, games and the metaverse. CJ ENM, the group behind “Snowpiercer,” “Parasite,” TV channels tvN and Mnet, and the Studio Dragon powerhouse, has gone the furthest. In addition to a string of new alliances with key Asian players, CJ ENM bought control of Endeavor Content’s scripted TV business, massively boosting its English-language capabilities. It reinvented in-house streamer Tving, recapitalized it with the help of Naver and JTBC, and endowed it with a mission to become the leading Korean video purveyor. Tving now incorporates Paramount+ in Korea and will merge with the much smaller Seezn, which is helpfully backed by cellular operator Korea Telecom. If that hydra-like growth spurt were not enough, the group has also launched a third production pole, CJ ENM Studio, under the leadership of J.K. Youn, one of Korea’s most iconic film director-producers (“Haeundae,” “Ode to My Father”). “The traditional theatrical release business fell to rock bottom under COVID while the digital platforms grew hugely. That has encouraged people in the film industry, filmmakers and actors, to step across to operations like this,” Youn says. “Where Korea once had a clear divide between film and TV, the two sectors have recently had a lot of exchange and learned plenty.” Studio Dragon’s Kim says that genre and format lines are now so blurred that “there are no trends” in TV and streaming, and that “the only thing that matters is story.”  A Variety and iHeartRadio Podcast The Business of Entertainment ",
    "datetime": "2022-08-18T16:00:47+00:00",
    "url": "https://variety.com/2022/tv/asia/south-korean-tv-music-1235344251/"
}