{
    "title": "South Korean children navigate rocky road to K-pop stardom | Reuters",
    "text": "Discover Thomson Reuters By Ju-min Park 4 Min Read SEOUL (Reuters) - Nine-year-old Kim Si-yoon has no time to throw tantrums. She wakes up at half-past seven for school, followed by hours of voice training, dance lessons and cram school before crashing into bed at midnight. Kim is a wannabe K-pop star. Thousands of Korean children dream of becoming household names like rapper Psy, whose 2012 “Gangnam Style” video was a global YouTube hit, often putting up with punishing schedules in the hope of one day making it big in the music industry. A new generation of younger and prettier music idols is further influencing impressionable minds, with a recent survey of pre-teens showing 21 percent of respondents wanted to be K-pop stars when they grow up, the most popular career choice. Kim, a third-grader at elementary school, said she recognized the sacrifices needed to realize her dream. “It is tough. So I am trying to have fun and when I make efforts, I can perform better,” she said, as she prepared to run through a sample dance routine, despite a bad cold. For her performance, she wore a diamond-patterned pinafore with black leggings, topped off with a trendy K-pop baseball cap. Kim’s desk is decorated with photos of her favorite boy and girl bands. A microphone is propped up beside her pens and pencils, and a pink guitar rests on her bedroom wall. A treasured pair of black high heels with a white floral print lies in her closet. Her stay-at-home mom drives Kim around Seoul each day, determined to see her own thwarted ambition of becoming a singer fulfilled by her daughter. “Competition is very intense, and there are so many good kids,” said Park Sook-hee, who spends around 700,000 won ($639) each month on Kim’s voice modulation and dance lessons. Kim is training for auditions to get into reputed talent management companies such as YG Entertainment or S.M. Entertainment. Success would bring a tougher schedule, perhaps even leading her to drop out of school. “She knows that she can’t help but work harder,” said Park. Jang Ha-jin made it to S.M. Entertainment’s coveted training program a decade ago after winning a talent contest. She stuck to a seven-day regimen for nearly three years, before giving it all up to return to a more sedate life. Now an engineering major, Jang remembers being trapped in an energy-sapping timetable that included lessons in Chinese, since many K-pop bands were trying to make inroads into China. Trainees had no access to mobile phones and each week, about 40 pupils were assessed on camera for their star potential. Jang constantly compared herself to her peers, and felt pressured to impress heavy-handed instructors. Worse, there was no guarantee she would be picked for a K-pop debut. “The most difficult part in fact was when I saw myself and felt like I didn’t grow up,” said Jang, 23, remembering her stressful teenage years. The trainees who survive and make it to the top reap the benefit of adulation by fans and stadium crowds. K-pop is the rage in Asia, especially in China and Japan, and the industry is eyeing new audiences in the West. Overseas sales revenues garnered by the “Korean Wave” pop culture industry, which includes music and TV dramas, nearly doubled to $730 million in 2013 in just five years, Bank of Korea data shows. Some of Jang’s peers who continued with the program eventually found spots on Girls’ Generation, one of South Korea’s top pop bands. Their success came at a price, Jang said. “The time they spent is fairly painful and difficult, but it is worth it,” she said. Sowon, whose six-member girl band GFriend made its debut this month, said she was more happy than tired, despite not being able to see her family or hang out with friends anymore. “I am thinking only one thing - our song keeps being played,” said the 20-year-old starlet, who spent five years training for her debut. “I hope to perform anywhere, anytime, even if I can’t sleep or I am tired.” Additional reporting by Kahyun Yang; Writing by Tony Tharakan; Editing by Clarence Fernandez Our Standards: The Thomson Reuters Trust Principles. All quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays. ",
    "datetime": null,
    "url": "https://www.reuters.com/article/us-southkorea-kpop-widerimage-idUSKBN0KV0OJ20150122"
}