{
    "title": "SOUTH KOREA  K-Pop idol, Rain, converts to Catholicism: For the faith, not for love ",
    "text": "Seoul (AsiaNews) - One of the most famous Korean \"new\r\nwave\" artists, actor and singer Rain, was baptized a few days ago in a small\r\nparish in Gwangju, on the outskirts of Seoul. Rain, best known for his vocal\r\ntalents, is one of the leading exponents of \"K-Pop\", the Korean music\r\ntrend that is highly popular throughout Asia. According to some sources, he\r\ndrew close to the Catholic Church through his girlfriend Kim Tae-hee, a famous actress\r\nand a fervent Catholic. \n\r\nThe baptism was confirmed this morning by his PR agency, the Cube DC: \" Rain was recently\r\nreceived baptism as a Catholic. It was something that was planned a long\r\ntime ago. Only family and close friends were attending\". The same agency denied there was any sentimental compulsion behind his\r\nchoice: \"It is not true that Rain and Kim are getting married, and it is not true\r\nthat he was forced to undergo baptism\".\n\r\nRain is only the latest in a long list of celebrities to join the South Korean Church.\r\nThe champion figure skater Kim Yu-na was baptized in adulthood choosing the\r\nname of \"Star\" and is very devout; BoA, known as the \"Queen of Korean\r\npop\" instead comes from a Catholic family and, in the course of her career\r\nand has always given a lot of importance to her faith. Precisely for this\r\nreason, she was chosen to attend the lunch with Pope Francis to be held in the\r\nDiocese of Daejeon South Korea during the pontiff's visit to South Korea \n\r\nThe Pope will visit the peninsula August 14 to 18 to participate in the Asian Youth\r\nDay in the Diocese of Daejeon, and to beatify Paul Yun Ji-chung and his 123 companions,\r\nmartyred in hatred of the faith during the persecutions of the Joseon kingdom. \n\r\nThe lunch will take place on August 15: BoA along with 17 other young people will\r\nbe representatives from many Asian nations, chosen as \"ambassadors\" of\r\nthe faith among their peers. According to the bishop, Msgr. Lazzaro You Heung-sik,\r\n\"the territory of this diocese has been the home of many martyrs. Hopefully\r\nthe Asian Youth Day will inspire other young people to look to their sacrifice.\r\nThis meeting with the Pope is sure to be a huge encouragement for their faith.\r\n\"   Subscribe to Asia News updates or change your preferences ",
    "datetime": null,
    "url": "https://www.asianews.it/news-en/K-Pop-idol,-Rain,-converts-to-Catholicism:-For-the-faith,-not-for-love-31675.html"
}