{
    "title": "South Korean men are wearing make-up and it's serious business ",
    "text": "We’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. This was published 6 years ago Add articles to your saved list and come back to them any time. Fit, well groomed and impeccably dressed, Heo Jeong-nam comes across every inch the modern South Korean man. But looking this good isn't easy. The 26-year-old follows a rigorous skin care regime involving cleansers and moisturiser, and always wears sunscreen to protect his face from damaging UV rays. Heo Jeong-nam started wearing make-up three years ago and hasn't looked back. Credit: Patrick Hatch And, like a growing number of his countrymen, he  has discovered the secret to a flawless and evenly toned complexion: make-up. \"I want to impress women and I don't think I could date a woman I like without wearing make-up,\" he told Fairfax Media on a recent visit to Yonsei University in Seoul.  \"It's easier to find a girl, with confidence.\" Pop singer Psy is the most well-known member of the \"K-Wave\", which has spread South Korean popular culture - and products - around the world. Credit: Marco Del Grande Many Australian men would baulk at the idea, but in South Korea, wearing make-up is becoming mainstream. Sales of men's skin care products grew 86 per cent in the five years to 2015 to average $39 for every South Korean man  yearly, according to research firm Euromonitor. That makes them the biggest preeners on the planet, far outspending Australian men, who spent $3.30 each. Mr Heo  said he started to worry about his complexion during his two-year national service in the army, when long days outdoors left his skin tanned and rough. (This experience is so common that one cosmetics brand makes its own SPF50 military camouflage, which is gentler than the army-issued gunk.) For the past three years Mr Heo has used BB cream, a popular all-in-one product combining primer, foundation and sunscreen. Back Do-hyun said wearing make-up gave him confidence. Credit: Patrick Hatch \"Celebrities, especially famous male celebrities, wear a lot of make-up, so I'm OK with putting it on,\" said Mr Heo, who works in recruitment. \"I still feel manly.\" South Korea is said to have the highest per-capita rate of cosmetic surgery in the world and is a lucrative market for cosmetics companies. Domestic giants like AmorePacific​ are investing heavily in innovation to stay ahead of the competition: it spent $123 million on research and development last year. Hajin Jung leads a team at AmorePacific's 500-person research facility in Seoul, and said the company was fine-tuning products to make them more suitable for male customers. \"Men are kind of afraid of the impression that if you put on make-up, it is visible. So we work on products that have a natural look,\" she said. Other innovations include foundation that comes out of its tube a masculine blue colour and only turns into a powdery pink paste when rubbed into one's skin. South Korea has grown to become the world's sixth-largest exporter of cosmetics, with foreign sales more than quadrupling between 2009 and 2015 to be worth $US1.59 billion. Driving that is the phenomenal spread of popular Korean culture, known as the \"K-Wave\", which has propelled pop stars and actors – and their endorsed products – onto the global stage. A fifth of AmorePacific's sales now comes from outside Korea, but it's yet to push male products onto the international market. Law student Back Do-hyun, 25, sees another reason more men will be joining him in wearing make-up every day: South Korea's faltering economy. Youth unemployment hit record highs last year, and he thinks men now need to put as much effort into their appearance as was traditionally expected of women if they are to get ahead. \"When you get a job interview, you need to look nice,\" he said on his way to class, skin smoothed with foundation. \"I want to make a good impression and want to be more handsome. Foundation covers my flaws and makes me look more natural, so I've got more confidence.\" The reporter travelled as a guest of the South Korean government Copyright © 2023 ",
    "datetime": "2017-01-15T20:15:25+00:00",
    "url": "https://www.smh.com.au/business/south-korean-men-are-wearing-makeup-and-its-serious-business-20161228-gtivin.html"
}