{
    "title": "South Korea pushing to become global cultural superpower after K-Pop Number 1 and Oscar success",
    "text": "The South Korean government plans to dramatically ramp up promotion of the Korean language and culture around the world It is the year South Korea became a global cultural powerhouse. First Parasite, an obscure but stunning film dissecting the country's societal tensions, made Oscars history as the first ever foreign language movie to pick up Best Picture. And then this week K-Pop, South Korea's catchy chart music, cemented its place as a global force with bestelling group BTS scooping a Number 1 debut single in the US - another record for an 'international' band. Now the South Korean government plans to dramatically ramp up promotion of the Korean language and culture around the world. The Ministry of Culture, Sports and Tourism announced this week that it is setting aside £56.5 million to encourage people to learn the “hangeul” language, up nearly £16 million from last year’s budget. A large proportion of the budget will be invested in opening another 22 King Sejong Institutes - akin to the British Council - in cities around the world. The ministry already operates 213 institutes, including four in the UK, to teach the language and culture and to foster “understanding and love for Korea”. The ministry’s announcement coincides with the new BTS song, “Dynamite”, becoming the first Korean song to top the Billboard Hot 100 singles chart and the video to go with the track breaking three Guinness World Records. The video was watched by a record 101.1 million viewers in the space of 24 hours. The previous holder of the biggest South Korean hit on the Billboard Hot 100 was Psy and his 2012 viral hit “Gangnam Style”, while Black Pink, Stray Kids, EXO and Monsta X are also making waves around the world. Korean cinema was put on the map in February when Bong Joon-ho lifted no fewer than four Oscars, including for best picture, at the 92nd Academy Awards in Los Angeles for Parasite, a story about a dirt poor family weedling their way into the life and home of a starkly wealthy one  - with a dark twist. The ministry is linking up with universities and agencies representing K-pop stars to produce Korean-language educational courses, such as “Learn! Korean with BTS”. The educational package includes four textbooks and a “sound pen” that plays back the pronunciation of words and phrases. Released on August 24, the initial release was sold out in the US in 20 minutes and in three hours in Japan. “Korea is seeking legitimacy in the eyes of the international community in comparison to China and Japan and this is one way that they can do that”, said David Tizzard, a professor of education at Seoul Women’s University. “And that also includes North Korea, because whenever anyone in the rest of the world opens a newspaper and sees a story about Korea, it’s always about North Korean missiles and Kim Jong-un, so they want to get away from that narrative.\" There is also a sense in Korea that its “soft power” has never been stronger on the world stage, while the government is also keen to put “hallyu”, or Korean wave pop culture, front and centre to raise the nation’s profile and global standing. “We are seeing something of a rebalancing of the world’s cultural order, with the US and Britain being overtaken as the undisputed superpowers of soft culture”, said Tizzard. “Now we’re seeing Korea, Taiwan and other middle powers rising.\" According to the ministry, Korean is the 14th most widely used language in the world, with some 77.3 million native speakers. Unveiling the campaign, Park Yang-woo, the culture minister, said: “We will work hard to establish the Korean language as one of the important pillars of the ‘Korean wave’ and promote the use of this glorious language across the globe.\" ",
    "datetime": null,
    "url": "https://www.telegraph.co.uk/news/2020/09/05/south-korea-pushing-become-global-cultural-superpower-k-pop/"
}