{
    "title": "South Korea's Gangnam district to get its own K-Star Walk of Fame | The Straits Times",
    "text": "SEOUL (The Korea Herald/Asia News Network) - South Korea's Gangnam-gu Office in the affluent southern district of Seoul will further revamp the streets of Cheongdam-dong to recreate them as streets of hallyu, or the Korean Wave, as part of efforts to attract foreign tourists. The renovation of the streets called the K-Star Road, modelled after the Hollywood Walk of Fame, has entered its second phase of construction, the district office said. Its first phase involved developing local stores regularly visited by Korean singers and artists into tourist attractions, and setting up photo zones on the streets of Cheongdam-dong last year. The district office also produced and distributed guidebooks and maps for foreign tourists during the first development phase. The second part of the development included setting up 3-meter-high art toys and dolls, or the so-called \"GangnamDol\" - coined from the words Gangnam-gu and K-pop idols. The district office has worked with 10 K-pop teams of artists and singers to create art toys of popular music groups such as 2PM, Super Junior, Girls' Generation and F.T. Island. The art toys and dolls have been placed in front of the Galleria luxury department store and all the way up to SM Entertainment, Korea's leading entertainment agency that represents K-pop idols such as Girls' Generation. The district office said it planned to expand the K-Star Road by further setting up GangnamDol kiosks, from which foreign tourists can get travel information about Cheongdam-dong and hallyu. It will also seek to develop more stores on the streets into tourist attractions, and go into merchandising and content businesses with entertainment agencies. Seoul's Gangnam-gu Office chose Cheongdam-dong because it is home to the country's leading entertainment or talent agencies, representing famous hallyu singers, TV and movie stars. Gangnam Mayor Shin Yeon Hee recently told the media that she aimed to turn Cheongdam-dong into a hallyu mecca where tourists can meet stars and learn about Korean culture on the streets. She added that the office will expand the K-Star Road into Apgujeong-dong and Shinsa-dong in an effort to attract 10 million foreign tourists to the southern district of Gangnam in the near future. Join ST's Telegram channel and get the latest breaking news delivered to you. Read 3 articles and stand to win rewards Spin the wheel now MCI (P) 066/10/2023. Published by SPH Media Limited, Co. Regn. No. 202120748H. Copyright © 2023 SPH Media Limited. All rights reserved. ",
    "datetime": "2015-04-14T09:08:21+08:00",
    "url": "https://www.straitstimes.com/lifestyle/travel/south-koreas-gangnam-district-to-get-its-own-k-star-walk-of-fame"
}