{
    "title": "South Korean remake of Scarlet Heart to premiere here the same time as Korea - TODAY",
    "text": "Entertainment SINGAPORE — K-wave fans who are eager to catch the highly-anticipated South Korean remake of mega hit Chinese series, Scarlet Heart, will be able to catch it at the exact same time as its telecast in Korea. SINGAPORE — K-wave fans who are eager to catch the highly-anticipated South Korean remake of mega hit Chinese series, Scarlet Heart, will be able to catch it at the exact same time as its telecast in Korea. The show, which stars South Korean singer-songwriter IU as the lead character who is character is catapulted back in time from the modern era, only to be caught within a web of political intrigue and complicated love relationships, will air exclusively on ONE in Singapore — the first regional cable channel in Southeast Asia to simulcast a South Korean drama series. Don’t understand Korean? There will be with subtitles in English, Chinese and Bahasa Malay. “ONE continues to break new ground when it comes to bringing the best South Korean entertainment to our viewers. In meeting viewers’ expectations for content to be delivered faster, we are excited to be able to offer them a same-time-as-Korea viewing experience that is unprecedented in this region,” said Virginia Lim, Sony Pictures Television’s Senior Vice-President and Head, Content, Production and Marketing, Networks, Asia. The period drama, which is based in the Goryeo dynasty, also stars Lee Joon Ki, Kang Ha Neul, Hong Jong Hyun, Baek Hyun of K-pop boyband EXO, Nam Joo Hyuk, and Ji Soo as the princes of Goryeo. Rounding off the starstudded list are idol-actress Seol Hyun of Girl’s Generation fame and rookie actress Kang Han Na who will both play princesses. Comprising 20 episodes, the series is directed by Kim Kyu Tae who is behind works such as That Winter and the Wind Blows. Fully pre-produced, the production took six months to complete, with filming ending on June 30. News of the remake has garnered much buzz ever since it was announced. “As the remake of the popular Chinese series, Scarlet Heart has big shoes to fill, but with the high production quality involved we have no doubt that it will amply satisfy fans’ expectations,” said Lim.  Scarlet Heart will premiere on Aug 29, same time as Korea’s telecast, every Monday and Tuesday at 9pm, on ONE (Singtel TV Channel 513 and 604 and StarHub TV Channel 124, 820 and 823). Read more of the latest in Subscribe to get daily news updates, insights and must reads delivered straight to your inbox. By clicking subscribe, I agree for my personal data to be used to send me TODAY newsletters, promotional offers and for research and analysis. Copyright 2023 © Mediacorp Pte Ltd. All rights reserved. We know it's a hassle to switch browsers but we want your experience with TODAY to be fast, secure and the best it can possibly be. To continue, upgrade to a supported browser or, for the finest experience, download the mobile app. Upgraded but still having issues? Contact us ",
    "datetime": null,
    "url": "https://www.todayonline.com/entertainment/television/south-korean-remake-scarlet-heart-premiere-here-same-time-korea"
}