{
    "title": "South Korea's culture ministry launches Hallyu department - Art & Culture - The Jakarta Post",
    "text": "Please Update your browser Your browser is out of date, and may not be compatible with our website. A list of the most popular web browsers can be found below.\n          Just click on the icons to get to the download page.  Or continue login with The Ministry of Culture, Sports and Tourism announced the launch of a new department to support the Korean Wave’s further expansion on Tuesday. “We are still working on the details related to the new department, including its English name,” a Culture Ministry official from the Planning and Coordination Office, Shim Min-seok, told The Korea Herald on Monday. The new department, which is under the ministry’s Content Policy Bureau, will have nine members. “We were planning to create the new department at the beginning of this year before the Hallyu cooperation committee was launched in February, but it took a bit more time. Meanwhile, some of the nine members have already started working on Hallyu-related projects at the committee,” said Choi Jung-jae, a Culture Ministry official. This is the first Hallyu-related department established under the Culture Ministry. So far the ministry has only had task force teams and committees conduct Hallyu-related projects. The official decision to create the new department was made on May 12 during a meeting of a pangovernmental Hallyu cooperation committee including representatives from 12 ministries. Read also: Korea marks BOP surplus for Hallyu-linked sectors on global success of games, K-pop The government said the new department is planning to conduct in-depth research of Hallyu and its business environment. The government also expects the Hallyu department to become a control tower and oversee diverse Korean Wave-related projects that have been undertaken by different departments. The new department’s agenda also includes assisting in the export of Hallyu-related contents. “To avoid hostilities that can arise when unilaterally promoting Korean culture overseas, we will also host diverse events for cultural exchanges,” Choi added. The government added that it will find ways to globally boost other industries such as sports and arts through the influence of Hallyu. Regarding the entertainment industry’s concerns about government meddling in what is essentially a private sector, the Culture Ministry said that it will play a supporting role while adding that it acknowledges the hard work done by the private businesses here to boost Hallyu over the last 20 years. Meanwhile, the Culture Ministry on Monday also announced that it is launching another new department to be in charge of culture, art, sports and tourism-related data that could be used in policymaking. TJP Documentaries: Why are married Indonesians moving back into their parents' home? TJP Documentaries: Viral Chef Vindy Lee Takes Our Indonesian Snacks Etiquette Challenge TJP Documentaries: Why Indonesian E-sports Athletes Are Today’s Money-making Superstars © 2016 - 2023 PT. Bina Media Tenggara ",
    "datetime": null,
    "url": "http://www.thejakartapost.com/life/2020/06/08/south-korean-culture-ministry-launches-hallyu-department.html"
}