{
    "title": "South Korea’s IPO K-wave swells on China crackdown | Reuters",
    "text": "HONG KONG, Jan 18 (Reuters Breakingviews) - Investors have watched the movies, bought the cosmetics and got hooked on its survival dramas. Now companies are becoming South Korea’s latest K-wave export as the $10.8 billion float  read more  of battery maker LG Energy Solution (373220.KS) breaks records. With interest in China dimmed by geopolitics and regulatory uncertainties, other Asian markets are moving out of its shadow. Seoul can benefit if valuations don’t overheat. LGES, a spin-off from LG Chem (051910.KS), is valued at $59 billion after pricing its IPO at the top of its range. The deal, the country’s largest-ever and which set new highs for demand, followed a record year for listings. Including the $4.6 billion raised in March in New York by e-commerce group Coupang, Korean companies last year raked in nearly $23 billion from going public, according to Dealogic. That’s more than funds raised in the preceding five years combined. A confluence of factors is at work. International interest in Asian markets outside China has grown since Beijing’s regulatory crackdowns, beginning in July, dented confidence and weakened valuations. Hot startups in Southeast Asia are also profiting from that  read more . Korea’s retail investors, who account for just over half of trading volumes per HSBC, have been also excited by buzzy new listings at home. In addition to technology startups cashing in, Korea’s conglomerates have begun to get in on the action. SK group, for example, last year floated its battery-materials maker SK IE Technology (361610.KS) and vaccine developer SK Bioscience (302440.KS) in deals worth $3.3 billion. This month, its security devices unit filed for a $1 billion IPO. Hyundai Engineering (000720.KS), part of the autos-to-steel making group, on Jan. 17 opened books for a $1 billion offering. LGES’s pricing gives it an enterprise value 22 times its forecast 2022 EBTIDA, per financial publication IFR, compared with a multiple of roughly 40 times for $223 billion Chinese rival Contemporary Amperex Technology (300750.SZ). Yet not all Korean deals have priced so reasonably. Video games producer Krafton (259960.KS), the country’s largest float last year, cut the price and the number of shares on offer to raise $3.8 billion in August, from hopes of $5 billion, after regulators intervened  read more . That still implied a valuation of 33 times 2021 earnings; a one-third fall in its shares since their debut leaves the stock trading on 17 times this year’s profit. Any more similarly-sized valuation declines from the country’s latest IPO crop risks turning back this tide. Follow @JennHughes13 on Twitter CONTEXT NEWS - South Korean battery maker LG Energy Solution said on Jan. 14 that it had raised 12.8 trillion won ($10.8 billion) in its initial public offering – the largest ever in the country. - The deal, which valued the company at $59 billion, also attracted record levels of demand with 1,988 domestic and foreign institutional investors placing bids worth 2,023 times the amount it was seeking, LGES said. - The float was the latest in a string of big Korean listings over the past year, with KakaoBank selling shares worth $2.2 billion in July, and e-commerce company Coupang raising $4.6 billion in New York in March. - Korean companies last year raised almost $23 billion from IPOs, including Coupang’s U.S. debut, per Dealogic data. That is more than the funds raised in the preceding five years combined. Editing by Robyn Mak and Katrina Hamlin Our Standards: The Thomson Reuters Trust Principles. Thomson Reuters Jennifer joined Breakingviews after three years as Reuters’ Asia Finance and Markets Editor. Prior to that, Jenn spent 18 years at the Financial Times covering various aspects of banking, finance and markets in London and New York before her move to Hong Kong in 2012. Jennifer has a BA in History from the University of Exeter and won a Knight-Bagehot fellowship to study at Columbia University, where she earned an MSc in Journalism studying alongside the MBA class. Packaged goods makers including Unilever and Nestle disappointed investors with weak third-quarter sales volumes, but that could change in the coming months as price increases moderate. India's ACC on Thursday reported a bigger-than-expected second-quarter profit aided by sturdy domestic demand, and forecast strong growth for the cement industry. Reuters, the news and media division of Thomson Reuters, is the world’s largest multimedia news provider, reaching billions of people worldwide every day. Reuters provides business, financial, national and international news to professionals via desktop terminals, the world's media organizations, industry events and directly to consumers. Build the strongest argument relying on authoritative content, attorney-editor expertise, and industry defining technology. The most comprehensive solution to manage all your complex and ever-expanding tax and compliance needs. The industry leader for online information for tax, accounting and finance professionals. Access unmatched financial data, news and content in a highly-customised workflow experience on desktop, web and mobile. Browse an unrivalled portfolio of real-time and historical market data and insights from worldwide sources and experts. Screen for heightened risk individual and entities globally to help uncover hidden risks in business relationships and human networks. All quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays. © 2023 Reuters. All rights reserved ",
    "datetime": null,
    "url": "https://www.reuters.com/markets/asia/south-koreas-ipo-k-wave-swells-china-crackdown-2022-01-18/"
}