{
    "title": "South Korea's One Direction: Super Junior's Wembley gig shows K-Pop is on the rise | The Independent | The Independent",
    "text": "Please refresh the page or navigate to another page on the site to be automatically logged inPlease refresh your browser to be logged in Boyband Super Junior will address the Oxford Union on their UK visit Find your bookmarks in your Independent Premium section, under my profile They are the epitome of manufactured, commercialised pop - and they are coming over here. Super Junior, a 13-piece South Korean boyband and \"super franchise\" are playing their first UK headline gig at Wembley Arena on Saturday night before delivering a guest lecture at the Oxford Union on Sunday, representing a new high water mark in the apparently unstoppable rise of \"K-Pop\". Ironically for a group from the youth-obsessed world of South Korean chart music, the band is made up of music-industry veterans, some of whom are going on for 30 years old. Their first hit came in eight years ago and while they are almost unknown in the UK they have had top 10 albums hits all over the world and were the best-selling K-Pop artist for three consecutive years. After performing in front of a sellout crowd at Wembley, they will follow in the footsteps of fellow K-Pop star Psy with an address to the Oxford University Asia Pacific Society at the university's prestigious debating chamber. Super Junior were created in 2005 after a mass talent contest run by their management SM Entertainment, that reportedly imposes a stringent singing and dancing training regime on its young performers. The firm's talent also includes Girls' Generation, a catchy pop group that earned a reported $88m in 2011 and appeared on the Late Show with David Letterman. In this tightly controlled world - sex scandals and drug use are practically unheard of - Super Junior are noteworthy as they are regularly split into different mini groups to appeal to different demographics and allow members to come and go as they complete their military service, which is mandatory in South Korea. For example in 2008 Super Junior-M, one of the groups five major spin-offs, was aimed at the burgeoning Chinese market and so included Han Geng, a Chinese singer. According to Keith Howard, a professor of music at the Centre for Korean Studies at SOAS University in London, this is typical of the wave of pop music that evolved in South Korean in the mid-2000s run by \"ruthless\" management companies, which were not afraid to drop members and substitute new ones for commercial reasons. \"Typically, they are manufactured in a music boot camps for three to six years and given all the skills, from music and media training to language and dancing so they are launched as a fully formed product,\" Professor Howard said. Enjoy unlimited access to 70 million ad-free songs and podcasts with Amazon Music Sign up now for a 30-day free trial Enjoy unlimited access to 70 million ad-free songs and podcasts with Amazon Music Sign up now for a 30-day free trial The non-stop lifestyle of the South Korean pop machine isn't without casualties though. Speaking recently at the K-pop KCON conference in Los Angeles a former member of girl group After School spoke of sleep deprivation and a gruelling schedule. \"The worst thing was not sleeping,\" said Rebecca Kim. We came home with 1 hour 30mins left [until the next activity]. I had to wash my makeup off, shower and I went to sleep. But by then, I only had 30 minutes to wake up again at 6am.\" Join thought-provoking conversations, follow other Independent readers and see their replies  Want to bookmark your favourite articles and stories to read or reference later? Start your Independent Premium subscription today. Please refresh the page or navigate to another page on the site to be automatically logged inPlease refresh your browser to be logged in Log in New to The Independent? Or if you would prefer: Want an ad-free experience?  ",
    "datetime": "2013-11-08T16:34:48.000Z",
    "url": "https://www.independent.co.uk/arts-entertainment/music/news/south-korea-s-one-direction-super-junior-s-wembley-gig-shows-kpop-is-on-the-rise-8929680.html"
}