{
    "title": "South Korea's Webtoons Seek K-Wave Success",
    "text": " By \n\n\tPatrick Frater Asia Bureau Chief International TV audiences may have fallen in love with Korean series “All of Us Are Dead,” “Itaewon Class” and “Dr. Brain” without ever being aware that each originated as a webtoon, or online comic. A clutch of Korean companies is now getting ready to make sure webtoons are the next big thing in the global K-culture takeover. Webtoons launched in the early years of the new century when Yahoo and Korean internet portal Daum started publishing news and web-only cartoons. It was a free-of-charge means of generating traffic and retaining readers that functioned much the same as printed newspapers carrying daily comic strips. Kang Full is widely credited as having created the first webtoon, “Love Story,” in 2003. With seven subsequent webtoon-to-screen adaptations, he still going strong and is responsible for the IP behind Disney+’s upcoming series “Moving.”  Webtoons, which are mostly digital originals, made an evolutionary leap with the advent of smartphones and vertical-scrolling. Companies like Naver Webtoon, founded in 2004, started operating as platforms that carried the new content. “Smartphones made this into a business with a potential for profit,” says Charlie Park, who currently heads the global webtoon business at Kakao Entertainment, which grew from a webtoon startup (named Podotree) founded in 2010. “And once we had established this as a viable business in Korea we turned to Japan, which thanks to its existing audience for manga, seemed fertile ground.” The Korean Creative Content Agency (KOCCA) estimates that the market within Korea passed the $1 billion a year revenue mark back in 2020. It has grown further since then, spurred by pandemic lockdowns. Naver alone reported webtoon gross merchandise volume of $900 million in 2021, driven by over 80 million monthly active users. Given that the figure exceeds the entire population of South Korea, the export drive appears to be working. KOCCA data points to Japan accounting for nearly a third of webtoon exports in 2020, followed by mainland China with 23%. North America rated at 16% and other parts of East Asia, especially Thailand, another 23%. Today the sector is headed by platforms that are the offshoots of Korea’s technology leaders Naver Webtoon (Naver) and Kakao Entertainment (Kakao) and Nate (telco SK Global). Platforms work with content providers (essentially mini-publishing firms), investors and individual creators and are responsible for marketing and revenue generation. In some cases they provide tech tools that help with drawing, templates and shading. That helps keep the cost of production at rock-bottom levels and profit margins healthy.  But the market is also fluid and fast-changing and offers multiple different business models. These range from recurring subscriptions, to Kakao’s favored “wait or pay” system, which allows users to either wait for the next episode or pay to read the next one in advance, and micropayments for individual episodes. Toomics, a second-tier platform with some 22 million monthly active users and over 60 million subscribers, was recently acquired for $160 million by Terapin Studios, a branch of U.S.-Korean media investor NPX Capital. Already offering its webtoons in English, Chinese and a handful of European languages, Toomics regards the overseas markets as having huge potential and representing a more level playing field. “They offer vast untapped audiences which are now increasingly interested in Korean pop culture and also have lower client acquisition costs than the more crowded Japanese and Korean markets,” says Samuel Hwang, NPX founder and CEO. While Kakao’s Park says the webtoon market is still in a growth phase, which points more to organic expansion than through corporate M&A deals in the near term, the sector has already seen one of the more telling examples of corporate activity. In 2021, Naver paid $600 million to buy Wattpad, the Canada-based online literature platform whose online authors have been responsible for films including “After,” and “The Kissing Booth.” The two companies are now integrated as Wattpad Webtoon Studios, under Aron Levitz, who said at the time that the deal was focused on “the next hundred years of literature.” The ability to generate films, series and games with already proven audiences resonates throughout the webtoon sector. A third-party Korean production company is working with Netflix on an adaptation of Toomics’ “Black Knight.” “But in future productions, we would expect Toomics to be a partner,” says Hwang. “We describe ourselves as a ‘story company,’ rather than a comics firm,” says Park. “That’s because whether you look at webtoons, novels or music, story is what transcends them all. And right now, webtoons are telling young, vivid and vibrant stories.” A Variety and iHeartRadio Podcast The Business of Entertainment ",
    "datetime": "2022-08-18T16:13:46+00:00",
    "url": "https://variety.com/2022/digital/spotlight/korea-webtoons-1235344262/"
}