{
    "title": "Splitting of standing spin-wave modes in circular submicron ferromagnetic dot under axial symmetry violation | Scientific Reports",
    "text": "Thank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\n            the best experience, we recommend you use a more up to date browser (or turn off compatibility mode in\n            Internet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles\n            and JavaScript. Advertisement Scientific Reports\nvolume 5, Article number: 18480 (2016)\n            Cite this article 3234 Accesses 9 Citations 1 Altmetric Metrics details The spin wave dynamics in patterned magnetic nanostructures is under intensive study during the last two decades. On the one hand, this interest is generated by new physics that can be explored in such structures. On the other hand, with the development of nanolithography, patterned nanoelements and their arrays can be used in many practical applications (magnetic recording systems both as media and read-write heads, magnetic random access memory and spin-torque oscillators just to name a few). In the present work the evolution of spin wave spectra of an array of non-interacting Permalloy submicron circular dots for the case of magnetic field deviation from the normal to the array plane have been studied by ferromagnetic resonance technique. It is shown that such symmetry violation leads to a splitting of spin-wave modes and that the number of the split peaks depends on the mode number. A quantitative description of the observed spectra is given using a perturbation theory for small angles of field inclination from the symmetry direction. The obtained results give possibility to predict transformation of spin wave spectra depending on direction of the external magnetic field that can be important for spintronic and nanomagnetic applications. An analytical description of spin waves in patterned magnetic structures is a complicated problem. Due to the inhomogeneity of the internal demagnetizing field, it is impossible to find exact eigenfunctions for most of the geometries. The good agreement between analytical calculations and experimental data was found for only few cases of simplest symmetry, for example, infinite stripes magnetized along two principal directions1,2 and axially magnetized circular dots3. In the former case, it was natural to assume that the eigenfunctions of the stripes would have an almost sinusoidal form, analogous to the form of spin wave resonance modes in a perpendicularly magnetized continuous homogeneous film. In the latter case, the spin wave profiles were satisfactorily described by zero-order Bessel functions. In both cases the demagnetizing fields for different modes were calculated with relative easiness. However, for practical applications of patterned elements, i.e. in read-write magnetic heads, the direction of the external magnetic field may deviate from the symmetry axis. In such devices additional spin-wave modes can be considered as magnetic noise4. Therefore, it is important to investigate the evolution of the spin wave spectra in the case of a symmetry violation. In this paper we study, both experimentally and theoretically, the modification of such spectra for circular Permalloy (Ni81Fe19) dots in external magnetic fields slightly inclined from the perpendicular direction. For this orientation the most efficient experimental techniques are either cavity-based3,5,6,7,8 or broadband9 ferromagnetic resonance (FMR) spectroscopy as well as FMR force microscopy10,11. Here the well established cavity-based X-band FMR was applied, that allows to probe the millimeter-size samples and to use sample holder with both in-plane and out-of-plane angular rotations. A square array of circular Py dots was prepared on a Si wafer with an oxidized surface Since the distance between the neighbour resonance peaks of standing spin waves in a perpendicularly magnetized circular dot is inversely proportional to the dot radius R3, we selected R to be 250 nm. In this case the shape of the dot is very close to the circular (as confirmed by scanning electron microscopy after removing the resist, see Fig. 1) and the distance between the resonance peaks is large enough to study the splitting in a broader angle range. The interdot center-to-center distance was equal to 4R = 1000 nm, which is sufficient to exclude the influence of interdot magnetostatic interactions on the resonance peak positions. The total size of the array was 2000 × 2000 elements, sufficient to obtain spin-wave spectra with a signal-to-noise ratio >100 even for the 5th peak. After resist development Permalloy (Py, Ni80Fe20) film with a thickness L = 40 nm was deposited. Finally after lift-off process the array of circular Py dots with well-pronounced edges was formed on Si surface. Scanning electron microscopy image of Permalloy dot array under study. The dot radius is 250 nm, center-to-center interdot distance is 1000 nm and dot thickness is 40 nm. We started our measurements with a precise orientation of the array under study with respect to the external magnetic field. To do so, the angular dependence of the resonance field for the most intense peak was measured in the vicinity of the normal as a function of θ. The maximum value of Hres corresponded to the perfect alignment of n along H. For this geometry, five sharp resonance peaks with their intensities growing with increasing resonance field were clearly observed (see Fig. 2, θ = 0°). This spectrum is similar to the one observed in ref. [3] where profiles of these standing spin waves were satisfactorily described by zero-order Bessel functions. Resonance fields and interpeak distances are a bit different from those observed in3 since they depend on the dot radius and thickness, in full agreement with analytical theory. Evolution of the 1st derivative of the spin-wave spectra of an array of circular dots with increase of angle θ. The main mode with index i = 1 was partially cut to make all other modes clearly visible. Inserts show zero-order Bessel-function profiles for corresponding circular “drumhead” modes. Then a series of spin wave spectra were measured from θ = 0o to 5o with an increment of 0.25o. It can be assumed from Fig. 2 that the modes are starting to split with angle θ inclination from the normal, however, the features of the splitting process are not pronounced enough. Therefore to clarify the number of split peaks for each particular mode and to track their resonance fields, the following procedure was introduced. First, the measured FMR spectrum (it is the 1st derivative of the microwave absorption) was integrated, then the 1st order low-pass Butterworth filter12 was applied to correct the signal baseline and finally the 2nd derivative was calculated to increase the accuracy of the resonant field determination of the split modes. As a result, we found the following numbers of split peaks: three for the second mode, five for the third one (see Fig. 3). Starting from the 4th mode the separation process is affected by the overlap between peaks of the several modes. The obtained dependencies of the resonance fields of the spin wave modes (numbered as i.s, where i is the mode number (i = 1, 2, …) and s is the level number) on the angle between the normal to the sample surface and direction of the external magnetic field are presented in Fig. 4. Evolution of the 2nd derivative of the spin-wave spectra of an array of circular dots with increasing angle between the normal to the sample surface and direction of the external magnetic field. The peaks of the spin wave modes are numbered as i.s, where i is the mode number and s is level number. The first mode i = 1 is not shown on the plot. Dependence of the resonance fields of the spin wave modes (numbered by i) on the angle between the normal to the sample surface and direction of the external magnetic field. Points represent the experimental data, lines show theoretical fits. The results shown in Figs 3 and 4 can be summarized in the following way: a) If θ ≠ 0, all resonance peaks except for the main one are split, i.e. all modes are split even for the very small angles θ but it becomes evident only with increase of θ when the splitting distance is large enough. For small angles the splitting looks just like broadening of the resonance line; b) the splitting value is proportional to the mode number and angle θ; c) the number of the split peaks depends on the mode number as 2i – 1. To explain abovementioned systematic behavior, the extension of the analytical theory presented in ref. [3] is proposed here. We start from the linearized Landau–Lifshitz equation for the components of the variable magnetization m perpendicular to the static magnetization M13,14, Here ωk is the spin wave (SW) frequency, k is the radial wave vector of the SW, ωM = γ4πM. We assume the external field H and the magnetization M to be confined in the zy plane.  is a component of the variable magnetization along the  axis (Fig. 5) of the canted coordinate system () with the new  axis directed along the M vector (see refs [13, 14, 15]). The angle between H and the normal to the dot plane (0z axis) is θ, the angle between M and the normal to the dot plane, θ0, can be easily calculated from the balance between the Zeeman and magnetostatic energies. The matrix elements of the dipole-dipole interaction have the form: Coordinate system used in the theoretical calculations. The exchange constant  and the effective matrix elements Nm of the inhomogeneous demagnetizing fields for different standing spin wave modes are defined in the same way as in ref. [3]: , where  is an analogue of the effective bias magnetic field in the case of a deviation of the direction of the external magnetic field from the symmetry axis. The expression for Heff is a sum of two terms - the components of the external field and of the static demagnetizing field along the M direction, like in ref. 14. However, the calculation of the components of the dipole-dipole tensor that we describe below is quite different from the presented in14. As it is known, both full sets - Bessel functions and plain waves - are not revealed as the sets of exact eigenfinctions of the dipole-dipole tensor. It was shown in3 that for the case of thin perpendicularly magnetized circular disks the expression derived previously for the dipolar-dipolar tensor in thin films13 is the most reliable approximation. Since we consider here the splitting of modes due to the small deviation from the perpendicular geometry, it is convenient and physically reliable to use the same approach as a starting point of the perturbation theory, presented below. We underline that this approach is valid only for the case of small inclination angles, while for larger angles the theory presented in14 is more consistent and reliable. So, the physical objects described here and in14 are similar, while the physical effects considered in our work and in14 are different. We are inclined to determine this as two mutually complementary investigations of the magnetic properties of thin circular nanodisks. It is worth to note that both descriptions are not suitable for the case when the external field angle θ is approaching π/2. In the latter case the excitation spectra includes the modes confined near the dot ages16. In the framework of the perturbation theory (i.e. when the θ0 value is small), we substitute dipolar operators in the system (1) with c-numbers: A similar substitution was performed in ref. 3 for the case of a perpendicular field. In such a case the system of two integral equations (1) can be reduced to the expression: For the case θ = θ0 = 0, the term coincides with the formula for spin-wave spectra (modified Kittel formula) for perpendicularly magnetized circular dots3. The eigenfunctions satisfying the dipolar infinite “pinning” boundary conditions can be written as , where , φ is an axial angle of the SW excitations vector. In the following we assume that the quantized values of the spin-wave vector satisfy the abovementioned conditions, i.e. k = knl, where n corresponds to the index of the Bessel functions while l is a number of its root. To find the experimentally observed SW frequencies we substitute the expansion of the variable magnetization m by eigenfunctions with even n and average the expression over the  angles. The second term in Eq. (2), proportional to sin2(θ0), gives deviations from the formula (3) due to a small inclination of the external field and magnetization from the perpendicular direction. This term is the only one “responsible” for the interaction between eigenfunctions of different numbers n and n΄, playing a role of the non-diagonal matrix element. Due to the special symmetry of the dipole-dipole operator, this interaction is non-zero only in the case when n΄ = n ± 2, see ref. [1]. The roots of the Bessel functions with such numbers n and n΄ coincide in the limit of large arguments. However, it is evident that already the values of the second root of J2(ρ) and second root of J0(ρ) are quite close to each other (see Fig. 6, red oval). As a consequence, the diagonal terms ωs(θ0)2 with k = k02 (corresponding to the SW profile m02(ρ, φ)) and with k = k22(spin wave profile m22(ρ, φ)) are found to be almost equal for all angles θ used in the experiment. In such a case only the non-diagonal matrix element in Eq. (2) gives the difference between the energies of the modes with n = 0 and n΄ = ±2 (splitting). Explanation of the dependence of the number of split peaks on the mode number. The left panel: analytical expressions of the profiles for three first modes. The lowest mode (black letters) is not degenerated in the case of perpendicular field. The second mode (red letters) contains the radially symmetrical Bessel eigenfunction (n′ = 0) and two Bessel eigenfunction with sine and cosine angular dependence (|n′| = 2). Very close zeros of these Bessel functions (red oval in the right bottom panel) determine almost equal values of the radial wave vectors, which in turn leads to the almost equal frequencies, i.e., the second mode is degenerated three times. In the same way, the third mode (blue letters) contains five Bessel eigenfunctions with correspondent indices (see text). The right top panel: splitting of the degenerated modes described above in the slightly canted magnetic field. The right bottom panel: zeros of Bessel functions, which determine the radial wave vectors, are divided into groups (by black, red and blue ovals), corresponding to the three first split modes. As a result, we propose the following scenario of mode splitting. The results of the corresponding calculations are presented in Fig. 4 by solid lines. The first root of the Bessel function with n = 0 has no neighbors and so, the lowest mode i = 1 does not split (see the black curve on the top graph and black oval on the bottom graph of Fig. 6). The second mode, i = 2, which contains eigenfunctions with the numbers n = 0 and n΄ = ±2, should split into three levels (red curve on the top graph and red oval on the bottom graph of Fig. 6). The third mode i = 3 is a “mix” of five eigenfunctions (n΄ = 0, ±4, n = ±2) and so, it should split into five levels, etc. The proposed theory can quantitatively describe the experimental results if both angles θ and θ0 are small. The absence of the full coincidence between theory and experiment in Fig. 3 can be associated with the effect of the dynamical magnetization pinning studied recently in16. Here for the simplicity the pinned boundary conditions were used for all the cases, when it has been proven in refs. 17 and 18 that the dipolar boundary conditions depend on the angle between the variable magnetization m and the boundary of the dot. This means that the boundary conditions depend on the angle θ0 that was not taken into account in the proposed theory. Secondly, the perturbation theory used here is valid when the energy gaps between the mode levels of different numbers are noticeable. However, as it is shown in Fig. 6, the levels of splitting modes become close to each other or even cross near θ ≈ 5°, which evidently restrict the validity of the perturbation theory for larger angles. Despite the mentioned issues, the difference between the experimental and theoretical results is below 5% even for θ = 5°. Summarizing, in this article we investigated the spectra of standing spin waves in arrays of planar soft ferromagnetic dots with a circular shape when the external magnetic field is deviated from the direction perpendicular to the dots plane. Is such a case the cylindrical symmetry of the isolated dot is violated. Our experimental results unambiguously show that in such a case the lowest mode does not split, the second mode splits into 3 levels and the third one splits into 5 levels. The phenomenological perturbation theory developed here explains such behavior and gives a simple rule that defines the number of levels that corresponds to the mode number in the symmetrical case as 2i – 1. The profile of each mode is a combination of Bessel functions of even order. Sample was fabricated by means of the electron-beam lithography and lift-off technique using a Raith 150 electron-beam writer. Py film with a thickness of 40 nm was deposited using molecular-beam epitaxy in a vacuum of 10–8 mbar. To improve the magnetic film quality, a 2 nm thick Cr underlayer was deposited on the substrate prior to the Py growth. To protect the Permalloy film, it was covered by a 2 nm thick Al layer, that fully oxidized after exposure to the atmosphere. Room temperature FMR measurements were done at 9.85 GHz using standard electron spin resonance spectrometers Bruker ELEXSYS E500 and Bruker ESP 300. In both cases a computer-controlled goniometer allowed varying the angle θ between the external magnetic field H and the sample normal to the array plane n with an accuracy of 0.1o. How to cite this article: Bunyaev, S. A. et al. Splitting of standing spin-wave modes in circular submicron ferromagnetic dot under axial symmetry violation. Sci. Rep. 5, 18480; doi: 10.1038/srep18480 (2015). Guslienko, K. Y. & Slavin, A. N. Spin-waves in cylindrical magnetic dot arrays with in-plane magnetization. J. Appl. Phys. 87, 6337–6339 (2000). Article \n    ADS \n    CAS \n    \n                    Google Scholar Jorzick, J. et al. Spin wave wells in nonellipsoidal micrometer size magnetic elements. Phys. Rev. Lett. 88, 047204 (2002). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Kakazei, G. N. et al. Spin-wave spectra of perpendicularly magnetized circular submicron dot arrays. Appl. Phys. Lett. 85, 443–445 (2004). Article \n    ADS \n    CAS \n    \n                    Google Scholar Helmer, A. et al. Quantized spin-wave modes in magnetic tunnel junction nanopillars. Phys. Rev. B 81, 094416 (2010). Article \n    ADS \n    \n                    Google Scholar Kakazei, G. N. et al. Probing arrays of circular magnetic microdots by ferromagnetic resonance. J. Nanosci. Nanotechnol. 6, 2811–2826 (2008). Google Scholar Nedukh, S. V. et al. Standing spin waves in perpendicularly magnetized circular dots at millimeter waves. J. Appl. Phys. 113, 17B521 (2013). Article \n    \n                    Google Scholar Castel, V. et al. Perpendicular ferromagnetic resonance in soft cylindrical elements: Vortex and saturated states. Phys. Rev. B 85, 184419 (2012). Article \n    ADS \n    \n                    Google Scholar Dow, J. et al. Exchange-coupling modified spin wave spectra in the perpendicularly magnetized Permalloy nanodot chain arrays. J. Appl. Phys. 107, 09B514 (2010). Article \n    \n                    Google Scholar Yu, C. et al. Ferromagnetic resonance in the proximity of the unstable perpendicular equilibrium: A study in Permalloy thin films and nanoscale dots. J. Appl. Phys. 101, 09D118 (2007). Article \n    \n                    Google Scholar Mewes, T. et al. Ferromagnetic resonance force microscopy studies of arrays of micron size Permalloy dots. Phys. Rev. B 74, 144424 (2006). Article \n    ADS \n    \n                    Google Scholar Chia, H.-J., Guo, F., Belova, L. M. & McMichael, R. D. Nanoscale spin wave localization using ferromagnetic resonance force microscopy. Phys. Rev. Lett. 108, 087206 (2012). Article \n    ADS \n    PubMed \n    \n                    Google Scholar Butterworth, S. On the theory of filter amplifiers. Experimental Wireless and the Wireless Engineer 7, 536–541 (1930). Google Scholar Kalinikos, A. & Slavin, A. N. Theory of dipole-exchange spin wave spectrum for ferromagnetic films with mixed exchange boundary conditions. J. Phys. C: Solid State Phys. 19 7013 (1986). Article \n    ADS \n    \n                    Google Scholar Klein, O. et al. Ferromagnetic resonance force spectroscopy of individual submicron-size samples. Phys. Rev. B 78, 144410 (2008). Article \n    ADS \n    \n                    Google Scholar Tartakovskaya, E. Quantized spin-wave modes in long cylindrical ferromagnetic nanowires in a transverse external magnetic field. Phys. Rev. B 71, 180404 (2005). Article \n    ADS \n    \n                    Google Scholar Guo, F., Belova, L. M. & McMichael R. D. Spectroscopy and imaging of edge modes in Permalloy nanodisks. Phys. Rev. Lett. 110, 017601 (2013). Article \n    ADS \n    PubMed \n    \n                    Google Scholar Kakazei, G. N. et al. Probing dynamical magnetization pinning in circular dots as a function of the external magnetic field orientation. Phys. Rev. B 86, 054419 (2012). Article \n    ADS \n    \n                    Google Scholar Zivieri, R. & Stamps, R. L. Theory of spin wave modes in tangentially magnetized thin cylindrical dots: A variational approach. Phys. Rev. B 73, 144422 (2006). Article \n    ADS \n    \n                    Google Scholar Download references Authors would like to acknowledge the fruitful discussions with Martha Pardavi-Horvath and Boris Ivanov. Work at IFIMUP was supported by Portuguese FCT through the project EXPL/IF/00981/2013, the “Investigador FCT” program (G.N.K.) and grant SFRH/BPD/63305/2009 (S.A.B.). E.V.T. acknowledges financial support from Fulbright Foundation in Ukraine. Work at IMag was supported by National Academy of Sciences of Ukraine through the project 1/15-Н. The Aveiro team acknowledges the FCT projects UID/CTM/50025/2013, RECI/FIS-NAN/0183/2012 (FCOMP-01-0124-FEDER-027494) and grant SFRH/BPD/74086/2010 (A.A.T.). N.A.S. acknowledges support from NUST “MISiS” through the grant K3-2015-003. The Kaiserslautern group gratefully acknowledges financial support from the Deutsche Forschungsgemeinschaft (grant SE 1771/1-2). The Nano-Structuring Center, TU Kaiserslautern, is acknowledged for technical support with sample preparation. Departamento de Física, IFIMUP and IN-Institute of Nanoscience and Nanotechnology, Universidade do Porto, 4169-007, Porto, Portugal S. A. Bunyaev & G. N. Kakazei Institute of Magnetism, National Academy of Sciences of Ukraine, 36b Vernadskogo Blvd, 03142, Kiev, Ukraine V. O. Golub, O. Yu. Salyuk & E. V. Tartakovskaya Departamento de Física and I3N, Universidade de Aveiro, 3810-193, Aveiro, Portugal N. M. Santos, A. A. Timopheev & N. A. Sobolev National University of Science and Technology “MISiS”, 119049, Moscow, Russia N. A. Sobolev Fachbereich Physik and Forschungszentrum OPTIMAS, Technische Universität Kaiserslautern, 67663, Kaiserslautern, Germany A. A. Serga, A. V. Chumak & B. Hillebrands You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar G.N.K, V.O.G., E.V.T. and A.V.C. formulated the problem and planned the work, A.V.C., A.A.S. and B.H. designed the sample structures. A.V.C. fabricated the samples. V.O.G., N.M.S., A.A.T. and N.A.S. performed microwave absorption measurements. S.A.B. developed software and processed FMR data. E.V.T. and O.Y.S. performed the analytical calculations. A.A.S. supervised samples fabrication. G.N.K. supervised the project. All the authors contributed to the discussion and writing of the manuscript text. The authors declare no competing financial interests. This work is licensed under a Creative Commons Attribution 4.0 International License. The images or other third party material in this article are included in the article’s Creative Commons license, unless indicated otherwise in the credit line; if the material is not included under the Creative Commons license, users will need to obtain permission from the license holder to reproduce the material. To view a copy of this license, visit http://creativecommons.org/licenses/by/4.0/ Reprints and Permissions Bunyaev, S., Golub, V., Salyuk, O. et al. Splitting of standing spin-wave modes in circular submicron ferromagnetic dot under axial symmetry violation.\n                    Sci Rep 5, 18480 (2016). https://doi.org/10.1038/srep18480 Download citation Received: 21 August 2015 Accepted: 17 November 2015 Published: 22 December 2015 DOI: https://doi.org/10.1038/srep18480 Anyone you share the following link with will be able to read this content: Sorry, a shareable link is not currently available for this article.  Provided by the Springer Nature SharedIt content-sharing initiative By submitting a comment you agree to abide by our Terms and Community Guidelines. If you find something abusive or that does not comply with our terms or guidelines please flag it as inappropriate. Advertisement Scientific Reports (Sci Rep)\n                \n\nISSN 2045-2322 (online) © 2023 Springer Nature Limited Sign up for the Nature Briefing newsletter — what matters in science, free to your inbox daily. ",
    "datetime": null,
    "url": "https://www.nature.com/articles/srep18480"
}