{
    "title": "Spreading the Kimchi and K-Drama Gospel in Ecuador",
    "text": "On a typical Saturday, dyed-blonde, spiked heel-wearing members of the Korean pop music group 2NE1 dance across the wall of the Gran K restaurant in Quito, Ecuador, where they've been projected, larger than life. Owner Señora Choi Choon-Ja hurries from table to table, teaching a group of university students how to use chopsticks, grinding fresh coffee for a table of regulars, changing the music to the Boys Over Flowers soundtrack when a customer requests it, and heaping plate after plate of fried chicken, daikon, and kimchi onto the tables. Her 5-year-old grandson clutches his video game and gapes at the crowd. Choi packs the ground coffee into a vacuum pot and the rich smell of the brewing beans fills the restaurant. At a table in the middle, the six students who requested Boys Over Flowers talk and laugh. They're here to nourish their love of K-dramas by eating the food they've seen their favorite characters eat so many times. It's their first time trying Korean food. One girl, Diana, likes K-dramas because they are \"healthy.\" She says \"they show true\" because a lot needs to happen before the characters fall for each other. The biggest K-drama fan of the group, Jasmin, has begun learning Korean, starting with saranghae, which means \"I love you.\" It's exactly this kind of enchantment with Korean culture that Señora Choi hoped to tap into when she opened Gran K. Still, she didn't know it would happen so fast. She's been open for only five months and the only marketing she's done has been to create a Facebook page, yet K-pop fan clubs have already begun meeting here regularly. Not long ago, a local news program, America Vive, did a report on Gran K, causing an unexpected influx of customers. Choi hopes to increase her customer base by continuing to tap into the Korean wave, or hallyu, which has been sweeping Latin America. Sometimes it's not clear whether Señora Choi is riding the Korean wave or if it is washing over her. A few weeks ago, a 24-person fan club took over the restaurant from 9:30 in the morning until 5 PM. The fanclub girls are intense. Although not fluent in Korean, they use honorifics like unni (elder sister) and oppa (elder brother). I speak fluent fangirl, but I still had trouble keeping up with everything they know—not just about the stars but their agents, tours, and international marketing plans. They played a video of a concert on the big projector, screaming and waving lightsticks as if it were the real deal. Choi emigrated to Ecuador ten years ago because she thought it would be a relaxing place to retire. She'd already done business in the country for years and continued her import business once she arrived. But in 2012, Ecuador's high taxes on imported goods made the business unprofitable. Choi also saw Ecuador lagging behind other South American countries in their embrace of all things Korean. While countries like Peru and Brazil give Korean pop music and dramas the insane fandom they deserve, in Ecuador they are reduced to mere popularity. Choi's goal is not only to spread K-pop but to carry fandom over to an interest in Korean culture—in a way, to make herself more at home in Ecuador. For this reason, her menu is planned around teaching culture—in baby steps. Like the university students, a lot of Choi's customers are trying Korean food for the first time. She models her meals on almuerzo ejecutivo, a prix fixe lunch that is a staple in Ecuador. A mere $5 gets you soup, a large entree, and a drink. The entree looks like a typical Ecuadorian segundo (main dish), with chicken, a salad, and sometimes rice. She serves it with a side dish of sweet and crunchy pickled radish. Much of the menu involves chicken. A recent K-drama, My Love from Another Star, about a handsome alien who falls in love with a depressed actress, internationalized the Korean love of fried chicken and mekju (beer), a combo called chimek. Choi's daughter, Shin Jee-Won, says that Korea has over a million chicken recipes, from which her mother selected to make her menu. In one of the dishes, chicken, vegetables, and rice are wrapped in a very thin omelet. Another features chicken marinated in a thick sesame sauce. Each entree comes with a salad of cabbage, peppers, and carrots topped with a sweet, tangy dressing. But once customers become regulars or express an interest in Korean food, the more challenging flavors come out, as does the spice. Regulars get panchan (side dishes) like kimchi and are served meals like kimchi jighae, a soup that some Koreans think is too spicy for non-Koreans to handle. Fan clubs can order from a special menu: bibimbap, mandu (dumplings), galbi (marinated short ribs), and jumukbap (rice with meat in the shape of hearts and stars). But they also come for Señora Choi, who shows them how to use chopsticks, to serve elders first, and to hold a glass in two hands when an elder pours. She plans to expand these demonstrations into free bi-monthly Korean culture and language classes. She'll explain to drama fans the meaning behind the food that characters eat. A character eating ramyun (instant noodles) might be depressed or in a hurry. If a woman buys a man dukbokki (marinated fish and rice cakes) it might mean she's interested in him. \"Even making white rice has a lot of meaning for us,\" says Shin. Choi often touches customers on the arm or shoulder and hugs regulars when they walk in. At first I thought this was from having lived in Ecuador for so long. Everyone here greets with a handshake or kiss on the cheek, and people often call each other vecino and vecina (neighbor), or mijo and mija (my child). But Shin says that this is jeong, the Korean concept of affection and attachment. \"We think that everybody's family. Once we get to know them, we don't leave them empty-handed.\" By signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content. ",
    "datetime": null,
    "url": "https://www.vice.com/en/article/aey94a/spreading-the-kimchi-and-k-drama-gospel-in-ecuador"
}