{
    "title": "Squid Game takes South Korean soft power up a notch, good for economy too | The Straits Times",
    "text": "SEOUL (BLOOMBERG) - South Korea has long been known for its manufacturing prowess, but the Netflix hit Squid Game is taking the country's cultural clout to another level that augurs well for a new driver of economic growth. While South Korean pop acts and TV dramas have been scoring hits overseas for years, only a handful - boy band BTS, for example - have managed to win many fans outside of Asia. Squid Game, set to become the most-watched show worldwide on Netflix, is changing all of that. Building on the success of the 2020 Oscar-winning film Parasite, the new Netflix show about indebted people fighting in a deadly survival game has caught the global mood and is projecting South Korea's growing soft power. It could also help make the country's cultural exports into much bigger economic contributors. Netflix says its business last year added US$1.9 billion (S$2.6 billion) to South Korea's economy, but overall the entertainment industry is starting to pull more weight. The size of South Korea's content industry is small relative to the vast manufacturing sector, but has been growing steadily. Content exports totalled US$10.8 billion last year, roughly one tenth of chips - South Korea's main cash cow - but already earning more than some other key export items such as household appliances and cosmetics. The value of South Korea's entertainment exports, which include publishing, games, music, movies and TV shows, rose 6.3 per cent last year even as overall shipments of goods fell 5.4 per cent due to the Covid-19 pandemic. Even consumer products related to the so-called Korean wave, such as cosmetics, clothes and food items, rose 5.5 per cent last year, according to a report by the Korea Foundation for International Cultural Exchange (KOFICE). The popularity of South Korean soap operas and idol stars led to a surge in Chinese visitors in the years before Covid-19 struck, but that over-reliance has become a vulnerability for the tourism industry. When relations between the two nations soured in 2017 over the deployment of the Thaad United States missile defence system in South Korea, a Chinese ban on tourists to the country sent overall arrivals plunging. That shaved 0.4 percentage points off gross domestic product growth that year. Among total inbound tourists, 13 per cent are estimated to have visited South Korea in 2019 specifically for the purpose of experiencing pop culture and attending fan events, with their spending totalling US$2.7 billion that year, according to KOFICE. South Korea's key challenge is to broaden its visitor base beyond Asia, and the growing appeal of its pop culture aids that mission. While still small in size, entertainment is one of South Korea's fastest-growing sectors along with technology. The number of workers in creative and artistic services grew 27 per cent between 2009 and 2019, while that in manufacturing, a traditional engine for economic growth, increased 20 per cent in the same period, according to data from the website of Statistics Korea. In a report last month, Netflix said it helped create 16,000 full-time jobs in Korea from 2016 to 2020 across entertainment and related industries. The firm estimates it contributed US$4.7 billion to the economy in the period. Join ST's Telegram channel and get the latest breaking news delivered to you. Read 3 articles and stand to win rewards Spin the wheel now MCI (P) 066/10/2023. Published by SPH Media Limited, Co. Regn. No. 202120748H. Copyright © 2023 SPH Media Limited. All rights reserved. ",
    "datetime": "2021-10-07T14:54:58+08:00",
    "url": "https://www.straitstimes.com/business/economy/squid-game-takes-south-korean-soft-power-up-a-notch-good-for-economy-too"
}