{
    "title": "Stacked bilayer phosphorene: strain-induced quantum spin Hall state and optical measurement | Scientific Reports",
    "text": "Thank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\n            the best experience, we recommend you use a more up to date browser (or turn off compatibility mode in\n            Internet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles\n            and JavaScript. Advertisement Scientific Reports\nvolume 5, Article number: 13927 (2015)\n            Cite this article 4163 Accesses 69 Citations Metrics details Bilayer phosphorene attracted considerable interest, giving a potential application in nanoelectronics owing to its natural bandgap and high carrier mobility. However, very little is known regarding the possible usefulness in spintronics as a quantum spin Hall (QSH) state of material characterized by a bulk energy gap and gapless spin-filtered edge states. Here, we report a strain-induced topological phase transition from normal to QSH state in bilayer phosphorene, accompanied by band-inversion that changes  number from 0 to 1, which is highly dependent on interlayer stacking. When the bottom layer is shifted by 1/2 unit-cell along zigzag/armchair direction with respect to the top layer, the maximum topological bandgap 92.5 meV is sufficiently large to realize QSH effect even at room-temperature. An optical measurement of QSH effect is therefore suggested in view of the wide optical absorption spectrum extending to far infra-red, making bilayer phosphorene a promising candidate for opto-spintronic devices. Recently, a new two-dimensional (2D) semiconductor material phosphorene has been exfoliated successfully1,2 and gained rapidly immense interests because of its high carrier mobility and large optical conductivity3,4,5,6,7,8,9,10,11,12,13. As compared with graphene and silicene14,15, hexagon lattice of phosphorene has higher buckling degree and stronger anisotropy, which indicates that the phosphorene is more sensitive to the strain manipulation12,16,17,18,19. As we known, strain is an effective way of tuning the electronic structure of the 2D semiconductor material and even can create a nontrivial topology of occupied bands in a quantum spin Hall (QSH) state, accompanied by band inversion between occupied and unoccupied bands at the time reversal invariant momenta (TRIM) in the bulk Brillouin zone20,21,22,23. A semiconductor to metal transition for phosphorene has been predicted with a large strain18,19. However, due to large band gap, the required strain has exceeded the critical value that the stable phosphorene can exist. Bilayer phosphorene has a smaller bandgap than the monolayer phosphorene24,25, which offers more opportunity in tuning of indirect semiconductor, metal and may even topological insulator. Furthermore, the weak interlayer van der Waals (vdW) interaction in the bilayer phosphorene allows for varieties of stacking orders26, which provides a new way to tune the electronic structure. Hence, the bilayer phosphorene should be a potential topological insulator. However, the topological phase transition in bilayer phosphorene has never been reported yet. Quantum spin Hall state of matter has a charge excitation energy gap in the bulk and gapless spin-filtered edge-states on the boundary with a Dirac-cone-like linear energy dispersion27,28,29,30,31,32,33,34,35,36,37. The special edge-states, which are topologically protected by the time reversal symmetry, can survive the nonmagnetic scattering and geometry perturbations, thus open new ways for backscattering-free transport. Such systems have stimulated enormous research activities in condensed matter physics due to their novel quantum spin Hall effect and hence the potential application in quantum computation and spintronics29,30. An excellent QSH material should have a large bandgap and be easily fabricated. Graphene has a superior high carrier mobility but its bandgap is extremely small31,32,33, while bilayer bismuth (111) is potentially large bandgap material but its fabrication is usually difficult due to its strong interlayer bonding34,35. Bilayer phosphorene has not only a high carrier mobility and a large bandgap but also easy fabrication. Hence, bilayer phosphorene can be a potential excellent candidate for future applications in QSH devices, such as topological field-effect transistors and spin valve devices. In this work, we will investigate a quantum spin Hall state of bilayer phosphorene by tunning strain and stacked order, then find a topological phase transition from normal to QSH state accompanied by a band inversion that changes  number from 0 to 1. Furthermore, the direct-indirect bandgap and semiconductor-metal transitions can be observed by adjusting the weight of vdW interaction. Our results reveal that the tuning of topological behavior in bilayer phosphorene is dependent on interlayer stacking order and the direction of the applied in-plane strain that should be along either armchair or zigzag direction. When the bottom layer is shifted by 1/2 unit cell along the zigzag or the armchair direction with respect to the top layer, the maximum topological bandgap can reach up to 92.5 meV, which is sufficiently large to realize the quantum spin Hall effect even at room temperature. The optical property of bilayer phosphorene is examined based on a real-space and real-time time-dependent density functional theory, which shows that the optical absorption spectrum of bilayer phosphorene becomes wide and is even extended to far-infra-red region in QSH state. Such improvement in optical response is indispensable for the broadband photodetection. An optical experimental setup is therefore improved to measure the QSH effect in bilayer phosphorene. The crystal structure of phosphorene is given in Fig. 1. Bilayer phosphorene can be viewed as cleaved from the (0001) surface of black phosphorus (space group Cmca), which allows various stacking orders due to its weak interlayer van der Waals (vdW) interaction, as shown in Fig. 1(a,b). We consider four possible high-symmetry stacking orders: (Ta) the top layer is stacked vertically on the bottom layer (space group Pmna), (Tb) the bottom layer is shifted by 1/2 unit cell along x (zigzag) or y (armchair) direction with respect to the top layer (space group Pbcm), (Tc) the bottom layer is shifted by one unit cell along x or y direction with respect to the top layer and thus the top and bottom layers are mirror images of each other (space group Pmma) and (Td) the bottom layer is shifted by 3/2 unit cells along x or y direction with respect to the top layer (space group Pccm), as shown in Fig. 1(c–f). Table 1 gives the optimized lattice constants, the bond lengths and the other structural parameters of the bilayer phosphorene for the four stacking orders, which is well consistent with the previously theoretical data26 with errors lower than 0.5%. For the different stacking orders, the bond length R1 and  are almost same, being shorter than the bond length R2. The bond angles α is smaller than β. The smallest interlayer distance dint is 3.503 Å (Ta), 3.085 Å (Tb), 3.739 Å (Tc) and 3.291 Å (Td). Among the four stacking orders, the Tb stacking order has the lowest cohesive energy. Therefore, the phonon spectrum of the Tb stacking order is further calculated, which shows the excellent structural stability (see Supplementary information). The cohesive energies of the Ta, Tc, Td stacking orders are slight larger than the Tb stacking order with the difference less than 10 meV, which indicates that the Ta, Tc and Td stacking orders also have the excellent structural stability. Crystal structures of bilayer phosphorene for four stacking orders. (a) The monolayer black phosphorus (phosphorene), where the top and bottom P sublattices in a nonplanar monolayer are represented by green and purple balls. (b) The projection of monolayer black phosphorus on x-y plane, where filled and opened circles are two different sublattices, R1 and  are P-P bond lengths in up and bottom sublattices and α is the angle between two R1 bonds. One unit cell has four atoms, as denoted by the blue shadow. (c–f) The top and side views of the four different stacking orders: (Ta) the top layer is stacked vertically on the bottom layer, (Tb) the bottom layer is shifted by half of one unit cell along x or y with respect to the top layer, (Tc) the bottom layer is shifted by one unit cell along x or y direction with respect to the top layer and thus the top and bottom layers are mirror images of each other and (Td) the bottom layer is shifted by one and a half of one unit cell along x or y direction. Here, R2 is the P-P bond length between up and bottom sublattices of a nonplanar monolayer, β is the angle between the R2 and  bonds and dint is the smallest interlayer distance. The electronic structure of the bilayer phosphorene is given in Fig. 2. Shown in Fig. 2(a–d) are the band structures of the four different stacking orders obtained by using Perdew-Burk-Ernzerhof (PBE) functional38, which gives the bandgap Eg = 0.434 eV (Ta), 0.442 eV (Tb), 0.264 eV (Tc) and 0.002 eV (Td) at Γ point. Since our hybrid Heyd-Scuseria-Emzerhof (HSE06)39,40 calculations indicate that the PBE Eg values are underestimated about 0.56 eV, the Eg of the bilayer phosphorene should be larger than 0.56 eV for the four different stacking orders, which is well consistent with the previous HSE06 data26. The iso-surfaces of the band-decomposed charge density of the valence band maximum (VBM) and the conduction band minimum (CBM) at Γ point show that the four stacking orders have the similar charge density distribution and bonding character, as shown in Fig. 2(e–h). Basically, the charge density distributions of the VBM and CBM in one nonplanar monolayer have no effect on the stacking order: an anti-bonding-like feature in one sublayer and a bonding-like feature between two sublayers are visible for the VBM, while the bonding-like features in one sublayer and the anti-bonding-like features between two sublayers are found for the CBM. On the contrary, the charge density distributions of the VBM and CBM between two layers are dependent on the stacking order: the sign of the chemical bond between two layers is not visible for the VBM in the four stacking orders, but a chemical bonding-like character between two layers for the CBM is found in the Tc and Td stacking orders, which is absent in Ta and Tb stacking orders. The bonding features for the CBM in the Tc and Td stacking orders push their CBM down to the low energies, which leads to the smaller bandgaps than the Ta and Tb stacking orders. Therefore, it is confirmed that the different chemical bonding in the interfacial area between two layers is related to the bandgap Eg for the four stacking orders. Electronic structures of bilayer phosphorene for four stacking orders by PBE method. (a–d) The band structures. The valence band and the conduction band are represented by purple and red lines with the valence band maximum (VBM) and the conduction band minimum (CBM) being denoted by purple and red squares. The bandgap Eg is highlighted by blue shadow. The inset in (d) shows the region close to the Fermi level. The Fermi level is set to zero and Γ (0.0, 0.0, 0.0), X (0.0, 0.5, 0.0) and Y (0.5, 0.0, 0.0) refer to special points in the first Brillouin zone. (e–h) The isosurface of band-decomposed charge densities on the y−z plane of VBM and CBM, where top and bottom P sublattices in a nonplanar monolayer are represented by green and purple balls. A bond (antibond) is circled by red (blue) box. The isosurface is set to be 0.0037 e/Å3. Figure 3 illustrates the variation of the bandgap of the bilayer phosphorene versus the in-plane strain for the four stacking orders, where σx, σy and σxy are the in-plane strains along x-direction, y-direction and both x- and y- directions, respectively. When the in-plane strain is applied, the lattice constants along the other directions are relaxed fully until the residual force on each atom is less than 0.01 eV/Å in order to ensure the complete relaxation of the crystal structure for the strained bilayer phosphorene. In our work, the in-plane uni-axial strain is defined as  and , where a,b are lattice constants along the x,y directions under strain, respectively and a0,b0 are the corresponding equilibrium lattice constants without strain. The in-plane strain σxy is loaded synchronously in the x- and y-directions. In experiment, the in-plane strain on the bilayer phosphorene can be realized by bending its flexure substrate similar to graphene, where the amount of the strain is proportional to 2D mode position of the bilayer phosphorene41. Bandgaps of the four stacking orders are more sensitive to σxy, as compared with σx, σy. When σxy > 0 (tensile), the bandgap increases with σxy, then turns to decrease at a critical value, being 4.0% (Ta), 3.0% (Tb), 5.0% (Tc and Td). When σxy < 0 (compression), the bandgap decreases with σxy and becomes zero at σxy = −3.0% (Ta and Tc), −2.77% (Tb) and 0.02% (Td). However, to our surprised, after the bandgaps are closed, Eg turns to increase again for the Ta, Tb and Td stacking orders [see the inset Fig. 3(d)]. Such close-reopen process of the bandgap indicates a possible topological phase transition. For Tc stacking order, the reopening of the bandgap is not seen up to σxy = −8.0%, which rules out the possibility of topological phase transition. Then the bandgap turns to decrease again with σxy until the bilayer phosphorene becomes to be the metal state at σxy = −8.0% (Ta), σxy = −7.0% (Tb), σxy = −3.0% (Tc) and σxy = −5.0% (Td) finally. Besides, we also find a direct-indirect bandgap transition when σxy = −1.0% (Tc) and −2.0% (Td). Bandgap Eg with in-plane strain σ of bilayer phosphorene for four stacking orders by PBE method. Three types of strains σx, σy and σxy are considered, which are along x (zigzag), y (armchair) and both x and y directions, respectively. The positive (negative) σ values corresponds to the tension (compression) strain. There exists a critical compression stain for the four stacking orders, where the closed bandgap turns to be reopened, corresponding to a band inversion process, as denoted by black box in (a–d). For the Tc and Td stacking orders, there occurs a direct-indirect bandgap transition up to a critical compression strain, as denoted by blue dash line in (c) and (d). For the Tb, Tc and Td stacking orders, the bilayer phosphorene becomes the metal state, as the compression strain increases further, as denoted by blue shadow. Next, the electronic structure of the Tb-stacked bilayer phosphorene is given in Fig. 4. At Γ point under σxy = 0, the conduction band (CB) and the valence band (VB) have the even (‘+’) and odd (‘−’) parities, respectively. Shown in Fig. 4(a–c) are the electronic band structures for the Tb stacking order under different σxy values. The CB and VB at Γ point tend to approach together as σxy increases, then become overlapped under σxy = −2.77%. For larger compression strain (σxy = −3.0%), the CB and VB at Γ point are separated because of the repulsion between them. Most remarkably, the parities of the CB and VB at Γ are exchanged when the compression strain σxy < −2.77%, as shown in Fig. 4(d), which shows the band inversion of the VB and CB at Γ. Such band-inversion character is also observed in the density of states (DOS) and the orbital-projected band structures when σxy = −3.0% [see Fig. 4(e–g)]. The p orbital makes a significant contribution to the total DOS. The conduction band near EF mainly comes from the py,z obitals, but the bottom of the conductor band originates mostly from the pz. The valence band near EF mainly comes from the pz obital, but the top of the valence band originates mostly from the py orbital, which indicates an band inversion process when the compression strain σxy is increased. Electronic structures of Tb-stacked bilayer phosphorene by PBE method. (a–c) The band structures when the in-plane strain σxy is −2.0%, −2.77% and −3.0%, where the valence band (VB) and conduction band (CB) are represented by the purple and red lines. The inset in (c) shows the region close to the Fermi level. The Fermi level is set to zero and Γ (0.0, 0.0, 0.0), X (0.0, 0.5, 0.0) and Y (0.5, 0.0, 0.0) refer to special points in the first Brillouin zone. (d) The evolution of the VB and the CB at Γ with the compression strain σxy. At Γ point under σxy = 0, the CB and the VB have even (‘+’) and odd (‘−’) parities, respectively. Their parities are exchanged when the compression σxy < −2.77%, which indicates a clearly band inversion. The maximum bandgap Eg after the band inversion is obtained about 92.5 meV, where the maximum of the VB and the minimum of the CB are not located at the Γ point. (e) The density of states of the Tb-stacked bilayer phosphorene when σxy = −3.0%, where the total density of states (DOS) is represented by the gray dotted lines, the s- and p-orbitals of P atom are represented by the purple and orange dotted lines and the px, py and pz orbitals are represented by green, red and blue dotted lines. (f) and (g) The py and pz orbital-projected band structures of Tb-stacked bilayer phosphorene, where the radii of circles are proportional to the weight of corresponding orbital. Further, we calculate the  number of the Tb-stacked bilayer phosphorene when σxy = 0 and −3.0%, by using the method of Fu and Kane42. Such method is valid since the Tb stacking order has both spatial invention and time reversal symmetries (four time reversal invariant points in the 2D Brillouin zone). Inversion center in the crystal ensures , where  is the electron energy for the n-th band with spin index α at k wave vector in the Brillouin zone. The time reversal symmetry makes , where  is the spin opposite to α. The calculated parities of all occupied bands at four time-reversal invariant momenta are summarized in Table 2. We can find that the product of parities of occupied bands contributes to a +1 parity at the four time-reversal invariant momenta when σxy = 0, yielding a trivial topological invariant . As the strain is increased up to σxy = −3.0%, the product of parities of occupied bands is −1 at Γ but +1 at the three other time-reversal invariant momenta like X, Y and S. The Tb-stacked bilayer phosphorene under σxy = −3.0% is identified as topological insulators with . The results shown in Fig. 4(d) suggest that the Tb-stacked bilayer phosphorene maintain to be the QSH state under the compression strain σxy = −2.77 ~ −7.0%, where the maximum topological bandgap Eg = 92.5 meV is obtained when σxy = −5.0%. The PBE method may underestimate the bandgap compared with reality, which leads to a low evaluation of the critical strain needed to produce a quantum spin Hall state. In order to avoid such problem, we have carried out the band structure calculations of the possible topological insulators (Ta and Tb stacking orders) under the in-plane strains by the HSE06 method which has been proven reliable for few layer phosphorene systems26. Fig. 5(a,b) present the P-pz orbital-projected band structures of the Tb-stacked bilayer phosphorene by the HSE06 method when σxy = −4.0% and −6.0%, respectively. We can find that the top of the valence band and the bottom of the conduction band for the Tb stacking order exchange the weight of P-pz orbital when the strain σxy = −6.0%, which shows a band inversion. Actually, the Tb-stacked bilayer phosphorene has already been in quantum spin Hall state when the strain is beyond −4.8%, as shown in Fig. 5(c). The corresponding strain range where the Tb-stacked bilayer phosphorene maintain to be the QSH state is −4.8 ~ −10.0% by the HSE06 method. It is worth noting that the lattice structure of the Tb-stacked bilayer phosphorene is still stable under the compression strain up to −5.0% by calculating its phonon spectrum (see Supplementary information), which is critical for the practical applications. The topological phase transition for the Ta stacking order induced by in-plane strain is proven by the same method. Like the Tb stacking order, the Ta stacking order also undergoes the bandgap closed and reopened process with the increasing σxy, as shown in Fig. 5(d), which shows a band inversion. Shown in Fig. 5(e) is the evolution of the bandgap with σxy, which indicates that the PBE bandgap is underestimated compared with the HSE06 bandgap. Hence the critical strain σxy (about −5.0%) obtained by the HSE06 method, where the Ta-stacked bilayer phosphorene is in quantum spin Hall state, is higher than that (about −3.0%) by the PBE method. For the Td stacking order, the VBM and CBM have the same parity, which rules out the possibility of topological phase transition. Electronic structures of bilayer phosphorene for Ta and Tb stacking orders by PBE and HSE06 methods. (a) and (b) The orbital-projected band structures of the Tb-stacked bilayer phosphorene by the HSE06 method when σxy = –4.0% and −6.0%, respectively, where the weight of P-pz is represented by the radii of blue circles. The even parity denoted by +  and the odd parity denoted by −. (c) The bandgaps for the Tb stacking order by the PBE and HSE06 methods change with σxy. (d) The band structures of the Ta-stacked bilayer phosphorene by the PBE method when the in-plane strain σxy is −2.0% and −4.0%. (e) The bandgaps for the Ta stacking order by the PBE and HSE06 methods change with σxy. The obtained bandgaps by the PBE and HSE06 methods are represented by blue line and red dotted line, respectively. The Fermi level is set to zero and Γ(0.0, 0.0, 0.0), X(0.0, 0.5, 0.0) and Y(0.5, 0.0, 0.0) refer to special points in the first Brillouin zone. The electronic band structure as function of the weight of van der Waals interaction between the top and bottom layers of the bilayer phosphorene is shown in Fig. 6. The weight of van der Waals interaction is incorporated into our DFT calculations by using a semi-empirical van der Waals approach, known as DFT-D2 method43. The total energy is defined as EDFT−D = EKS−FGT + W EvdW, where EKS−DFT is the Kohn-Sham DFT total energy, EvdW is the vdw energy and W is a scaling factor in order to consider the weight of van der Waals (WvdW) interaction. Electronic structures of bilayer phosphorene for four stacking orders by PBE method under different WvdW values. (a) The bandgap Eg changes with WvdW interaction. We find the bandgap of the Td-stacked bilayer phosphorene is reopened when WvdW interaction is up to a critical value, as shown in the inset. (b) and (c) The orbital-projected band structures of the Td-stacked bilayer phosphorene when WvdW = 0 t and 1.52 t, where the pz component is denoted by circle and the weight of pz orbital is proportional to the radius of the circle with the even parity denoted by + . The doubly degenerate of the energy band in partial zone (the pink box) is broken with the increasing WvdW interaction. The Fermi level is set to zero and Γ(0.0, 0.0, 0.0), X(0.0, 0.5, 0.0) and Y(0.5, 0.0, 0.0) refer to special points in the first Brillouin zone. The variation of the bandgap Eg of the bilayer phosphorene versus the WvdW interaction is illustrated in Fig. 6(a). The Eg tends to decrease with the increasing WvdW interaction for all four stacking orders. When the increasing WvdW interaction is beyond 2.70 t (t is the real value for the WvdW interaction), Eg for each stacking order will decrease gradually to zero, which indicates that the VBM and CBM of the bilayer phosphorene have been overlapped, yielding a semiconductor to metal transition. For the Td stacking order, the decrease of Eg versus WwdW is much stronger than the Ta, Tb and Tc stacking orders. Very specifically, we find a bandgap closed and reopened process for the Td stacking order, as shown in the inset of the Fig. 6(a), whereas this phenomenon is absent for the Ta, Tb and Tc stacking orders. The P-pz orbital-projected band structures of the Td-stacked bilayer phosphorene are presented in Fig. 6(b) under WvdW = 0 t and Fig. 6(c) under WvdW = 1.52 t. We find that the energy band is doubly degenerate in partial zone [see the pink box in Fig. 6(b)] under WvdW = 0 t. However, as the WvdW interaction increases up to WvdW = 1.52 t, this band degeneracy is broken [see the pink box in Fig. 6(c)], which can be due to the reason that the top and the bottom layers of the Td-stacked bilayer phosphorene tend to be bonded as companied with decrease of dint. Furthermore, as accompanied by the bandgap closed and reopened process, the VBM and CBM for the Td stacking order exchange the weight of P-pz orbital, indicating the band inversion of the VBM and CBM. However, as mentioned above, the VBM and CBM for the Td stacking order have the same parity, which rules out the possibility of topological phase transition. Hence, despite that the WvdW interaction causes the decrease of Eg and the break of the band degeneracy for the four stacking orders, but does not cause the topological phase transition, as shown in our computations. Our calculations establish the basic conditions for materials to exhibit strain-induced topological phase transition. First, the direction of the applied strain on materials should be along the bonding direction, i.e., the direction with the maximum atomic wave function overlap. For the bilayer phosphorene, this direction should be along the armchair or zigzag direction [see Fig. 2(e–h) above]. Second, the VBM and CBM of material should have the different parities, which is not the details of the atomic orbitals or bond types but the different signs of overlap integrals of the atomic orbitals. Hence, the topological phase transition of the Td-stacked bilayer phosphorene induced by strain is impossible. Third, materials should have direct bandgaps located at the time reversal invariant momenta before the transition. If not, the bandgaps would make the metal phase occur before band inversion, just like in the case of the Tc-stacked bilayer phosphorene. As the most primary structure inheriting from the bulk black phosphorus, the Tb stacking order has the highest structural stability and is most facile to be fabricated in experiment among the four stacking orders. Therefore, the Tb-stacked bilayer phosphorus would be the best phosphorus candidate for the future optical electronic devices. The optical response property of the Tb-stacked bilayer phosphorene is investigated, as shown in Fig. 7. The optical response calculation is conducted for 4 × 4 supercell of Tb-stacked bilayer phosphorene [see Fig. 7(a)]. In Fig. 7(b), we compare the optical response of the Tb-stacked bilayer phosphorene in the normal state (σxy = 0) and the QSH state (σxy = −3.0%), where the structural stability in QSH state is proved by calculating the phonon spectrum (see Supplementary information). Our results show that the photonic band-gap is decreased in the QSH state greatly, for example, the obtained photonic band-gap (PBG) is 0.5 eV in the normal state but only 0.01 eV in the QSH state for the case of the incident light polarized along the armchair direction. There exists two adsorption peaks in the optical adsorption spectrum. The first adsorption peak appears in the region that the optical strength of the incident light is less than 2 eV and the corresponding adsorption strength is also very low. When the incident light is polarized along the armchair direction, the first adsorption peak shows a red-shift in the QSH state [see red arrow in inset Fig. 7(b)], which leads to wider absorption zone that is highly desirable in broadband photodetection. The second adsorption peak occurs at the region of the optical strength of the incident light around 10 eV, which indicates that the bilayer phosphorene occurs a σ plasmon resonance. When the incident light is polarized along the zigzag direction, the second absorption peak becomes smaller and shows a blue shift in the QSH state, as compared with the normal state [see the black and blue arrows in Fig. 7(b)]. The blue shift is because that the increased interatomic spacing in the zigzag direction causes the larger resonance level spacing. The mechanism of the optical absorption in low-energy resonance behind the resonance phenomena is further analyzed in terms of the induced charge response in real-time propagation. The induced electron and hole charge densities tends to be separated and finally located at two edges. The induced charge density in the QSH state is larger than that in the normal state, emerging in the center areas in addition to the two edges. This is attributed to that the shielding effect becomes stronger in the QSH state when the interatomic spacing becomes smaller due to the in-plane strain (see Supplementary information). Optical respond of Tb-stacked bilayer phosphorene and optical measurement of quantum spin Hall effect. (a) The top and side views of the crystal structure, where the hydrogen atoms (red balls) is used to passivate the dangling σ bonds on the boundary. (b) The optical absorption spectra when the compression strain σxy = 0.0 and −3.0%. Two polarized directions are considered, which are along x (zigzag) and y (armchair) directions. Red- (blue-) shifted of the absorption peaks is highlighted by red (blue) arrow and the strength descending of the absorption peak is highlighted by black arrow. (c) Schematic of the experimental geometry to detect the quantum spin Hall effect. We place the sample in a He-flow cryostat and keep it at 30 K. The probe beam is incident upon the sample through a objective and a prism mirror placed in the He-flow cryostat. The objective is used to ensure the beam to focus on a controlled circular spot and the prism mirror is used to bent the probe beam to 90°. All the equipments are placed in a superconductor magnet that can induce a magnetic field Bext. (d) Magnification of the sample configure in (c), where the source and drain electrodes are denoted as ‘S’ and ‘D’, four terminals are represented by M1, M2, M3 and M4 and the spin-up and spin-down states are represented by red and blue lines. The center of the sample (“O” point) is set as the origin of the coordinate. The ac electronic current between the source and the drain electrodes can be measured by the ammeter A and the electronic voltage between the terminal M1 (M3) and M2 (M4) can be measured by the voltmeter V1 (V2). We propose an experimental setup [see Fig. 7(c,d)] to measure QSH effect of strained Tb-stacked bilayer phosphorene by using Scanning Kerr rotation microscopy. Our setup has the similar working principle with the previous optical measurement of local spin accumulation at the sample edges in n-GaAs and n-InGaAs44,45,46, but combines with the electronic measurement. Experimentally, because the transverse spin currents do not lead to net charge imbalance across the sample in nonmagnetic systems, the spin Hall effect is difficult to be observed by the simple electrical measurement. Hence, we employ the Scanning Kerr rotation microscopy to image the spin polarization at the edges of the samples that has 320-μm-long and 100-μm-wide, as shown in Fig. 7(c). The probe beam is bent 90° by a prism mirror placed in the He-flow cryostat, then is incident upon the samples through an objective lens with 0.73 μm lateral spatial resolution, which ensures that the beam is focusing on a circular spot with a full width at half-maximum of 1.1 mm44. An image from the Scanning Kerr rotation microscopy is taken by moving the cryostat integrated on a piezo nanoscanning stage, just like in the case of GaAs46. The Tb-stacked bilayer phosphorene is grown epitaxially on a substrate of comparable thickness, which makes the layers strained due to a mismatch in lattice parameter between the film and substrate materials. We set the center of the sample (“O” point) as the origin of the coordinate and x and y axes are taken to be across and along the sample channel, respectively. This channel is defined by the standard photolithography and the wet etching. Kerr rotation is measured as a function of magnetic field (Bext) and position (x, y), which is at a maximum at the two the channel edges when Bext = 0 mT and falls off rapidly with distance from the edge44. This indicates an accumulation of electron spins polarized at the edges, which is also a strong signature of the spin Hall effect because the spin polarization is out-of plane and changes sign for opposing edges47,48,49. Secondly, the two-terminal conductance GSD can be measured by using the electronic measurement, as shown in Fig. 7(d). When sample is a normal insulator, GSD should vanish at low temperatures, whereas GSD should equal a value ~ne2/h (n is the integer, e is the electronic charge and h is the Planck constant). It is worth noting that the electronic voltage V1 and V2 vanish between M1 and M2 and between M3 and M4, which is one of the remarkable manifestations of the QSH state50. We have proven that the Ta- and Tb-stacked bilayer phosphorene are excellent topological materials when the compression strain loaded synchronously in the x- and y-directions is larger than about 3%. The quantum spin Hall (QSH) state of the bilayer phosphorene is revealed due to the band inversion between the valence band maximum of pz orbital and the conduction band maximum of py and pz orbitals. Our results show that the strain manipulation is very effective for the bilayer phosphorene. In addition to the semiconductor-to-metal transition, strain can also induce the nontrivial topological band structure of the bilayer phosphorene. The obtained maximum topological bandgap is high up to 92.5 meV in the Tb-stacked bilayer phosphorene, implying that the QSH effect of bilayer phosphorene is observable even at room temperature. On the other hand, as compared with the chemical decoration and the electric field, the strain manipulation is more feasible in experiment, considering the current microfabrication technique, for example, heterepitaxy of the bilayer phosphorene grown on substrates of smaller lattices. Our results confirm that the bilayer phosphorene is an ideal material to study novel quantum states, showing new potential for future applications in spintronics devices such as topological field-effect transistors and spin valve devices. Furthermore, the strain is also an excellent way to tuning optical property besides those aforementioned. The optical absorption spectrum of the strained bilayer phosphorene becomes broadened and is even extended to the far-infra-red region and leads to a wider range of brightness. An improvement optical experimental equipment is designed therefore to measure the QSH effect in strained bilayer phosphorene, which shows that the strain-induced topological bilayer phosphorene can also be used as an outstanding opto-spintronic device. We use the method of Fu and Kane42 to calculate topological invariant . We state a time-reversal invariant periodic Hamiltonian  with 2N occupied bands characterized by Bloch wave functions. A time-reversal operator matrix relates time-reversed wave functions is defined by where α, β = 1, 2, …, N, |μα(Γi)> are cell periodic eigenstates of the Bloch Hamiltonian, Θ = exp(iπSy)K is the time-reversal operator (Sy is spin and K complex conjugation), which Θ2 = −1 for spin 1/2 particles. Since ,  is antisymmetric at TRIM Γi. The square of its Pfaffian is equal to its determinant, i.e., det[A] = Pf[A]2. Then δI = (det[A(Γi)])1/2/Pf[A(Γi)] = ±1. Hence, the topological invariant  can be defined as When solids have space-reversal symmetry,  can be simplified as where ξ is the parities of all occupied bands at Γi and M is the number of Kramers pairs. We calculate the lattice configurations as well as electronic band structures of bilayer phosphorene with four different stacking orders based on the density functional theory (DFT) implemented in the Vienna Ab-initio Simulation Package (VASP)51,52. The projector augmented wave (PAW)53 method and the Perdew-Burk-Ernzerhof (PBE)38 exchange-correlation functional are adopted. Long-range dispersion corrections have been taken into account within a semi-empirical van der Waals approach proposed by Grimme known as the DFT-D2 method43 (where D2 stands for the second generation of this method). The kinetic energy cutoff for the plane wave basis set is chosen to be 600 eV and the reciprocal space is meshed at 14 × 10 × 1 using Monkhorst-Pack method54. A vacuum space of at least 25 Å along the z direction is used to separate the bilayer systems in order to avoid spurious interactions due to the nonlocal nature of the correlation energy55. In order to correct the PBE bulk bandgaps, we apply a hybrid Heyd-Scuseria-Emzerhof (HSE)39,40 functional in which the exchange potential is separated into a long-range and a short-range part, where 1/4 of the PBE exchange is replaced by the Hartree-Fock exact exchange and the full PBE correlation energy is added. Hence the HSE functional corrects the GGA bandgaps40 significant by partially correcting the self-interaction. Spin-orbit coupling (SOC) is included in the calculations after the structural relaxations56. We calculate the optical responses of the Tb-stacked bilayer phosphorene under the strains σxy = 0.0 and −3.0%, based on a real-space and real-time time-dependent density functional theory (TDDFT) as implemented in the OCTOPUS code57. The Hartwigsen-Goedecker-Hutter pseudopotentials58 and Generalized Gradient Approximation (GGA) with PBE functional for the exchange-correlation are used to calculate both the ground state and excited state. We consider a 4 × 4 supercell of Tb-stacked phosphorene [see Fig. 7(a)] in order to ignore the interaction between the two boundaries. The simulation zone is defined by assigning a sphere around each atom with a radius of 6 Å and a uniform mesh grid of 0.3 Å. The induced density plane paralleled to the bilayer phosphorene plane and located at the middle of the top pucker-layer in the vertical direction. In the real time propagation, excitation spectrum is extracted by Fourier transform of the dipole strength induced by an impulse excitation59. In the real-time propagation, the electronic wave packets are evolved for typically 6000 steps with a time step of Δt = 0.005 Å/eV. The obtained optical bandgap is close to the electronic bandgap calculated by PBE implemented in VASP, which means that OCTOPUS is reliable on calculation for the optical property. How to cite this article: Zhang, T. et al. Stacked bilayer phosphorene: strain-induced quantum spin Hall state and optical measurement. Sci. Rep. 5, 13927; doi: 10.1038/srep13927 (2015). Lu, W. et al. Plasma-assisted fabrication of monolayer phosphorene and its Raman characterization. Nano Research 7, 853 (2014). Article \n    CAS \n    \n                    Google Scholar Li, L. et al. Black phosphorus field-effect transistors. Nat. Nanotechnol 9, 372 (2014). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Reich, E. S. Phosphorene excites materials scientists. Nature 506, 7486 (2014). Google Scholar Tran, V. & Yang, L. Scaling laws for the bandgap and optical response of phosphorene nanoribbons. Phys. Rev. B 89, 245407 (2014). Article \n    ADS \n    CAS \n    \n                    Google Scholar Jiang, J.-W. & Park, H. S. Negative poissons ratio in single-layer black phosphorus. Nat. Commun. 5, 4727 (2014). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Qiao, J., Kong, X., Hu, Z.-X., Yang, F. & Ji, W. High-mobility transport anisotropy and linear dichroism in few-layer black phosphorus. Nat. Commun. 5, 4475 (2014). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Fei, R. & Yang, L. Strain-engineering the anisotropic electrical conductance of few-layer black phosphorus. Nano Lett. 14, 2884 (2014). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Buscema, M., Groenendijk, D. J., Steele, G. A., van der Zant, H. S. J. & Castellanos-Gomez, A. Photovoltaic effect in few-layer black phosphorus PN junctions defined by local electrostatic gating. Nat. Commun. 5, 4651 (2014). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Du, Y., Ouyang, C., Shi, S. & Lei, M. Ab initio studies on atomic and electronic structures of black phosphorus. J. Appl. Phys. 107, 093718 (2010). Article \n    ADS \n    CAS \n    \n                    Google Scholar Liang, L. et al. Electronic bandgap and edge reconstruction in phosphorene materials. Nano Lett. 14, 6400 (2014). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Liu, H. et al. Phosphorene: an unexplored 2D semiconductor with a high hole mobility. ACS Nano. 89, 245407 (2014). Google Scholar Xia, F., Wang, H. & Jia, Y. Rediscovering black phosphorus as an anisotropic layered material for optoelectronics and electronics. Nat. Commun. 5, 4458 (2014). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Liu, Q., Zhang, X., Abdalla, L. B., Fazzio, A. & Zunger. A. Switching a normal insulator into a topological insulator via electric field with application to phosphorene. Nano Lett. 15, 1222 (2015). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Castro Neto, A. H., Guinea, F., Peres, N. M. R., Novoselov, K. S. & Geim, A. K. The electronic properties of graphene. Rev. Mod. Phys. 81, 109 (2009). Article \n    ADS \n    CAS \n    \n                    Google Scholar Drummond, N. D., Zólyomi, V. & Falko, V. I. Electrically tunable bandgap in silicene. Phys. Rev. B 85, 075423 (2012). Article \n    ADS \n    CAS \n    \n                    Google Scholar Wang, X. et al. Highly anisotropic and robust excitons in monolayer black phosphorus. Nat. Nanotechnol 10, 517 (2015). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Cakir, D., Sahin, H. & Peeters, F. H. Tuning of the electronic and optical properties of single-layer black phosphorus by strain. Phys. Rev. B 90, 205421 (2014). Article \n    ADS \n    CAS \n    \n                    Google Scholar Rodin, A. S., Carvalho, A. & Neto, A. H. C. Strain-induced gap modification in black phosphorus. Phys. Rev. Lett. 112, 176801 (2014). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Huang, G. & Xing, Z. Semiconductor to metal transition, dynamical stability and superconductivity of strained phosphorene. Arxiv 1409.7284 (2014). Winterfeld, L. et al. Strain-induced topological insulator phase transition in HgSe. Phys. Rev. B 87, 075143 (2013). Article \n    ADS \n    CAS \n    \n                    Google Scholar Yang, M. & Liu, W.-M. The d-p band-inversion topological insulator in bismuth-based skutterudites. Scientific Reports 4, 5131 (2014). Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Qi, X.-L. & Zhang, S.-C. The quantum spin Hall effect and topological insulators. Rhys. Today 63, 33 (2010). Article \n    CAS \n    \n                    Google Scholar Zhu, Z., Cheng, Y. & Schwingenschlögl, U. Topological phase transition in layered GaS and GaSe. Phys. Rev. Lett. 108, 266805 (2012). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Cai, Y., Zhang, G. & Zhang, Y.-W. Layer-dependent band alignment and work function of few-layer phosphorene. Scientific Reports 4, 6677 (2014). Article \n    ADS \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Manjanath, A., Samanta, A., Pandey, T. & Singh, A. K. Semiconductor to metal transition in bilayer phosphorene under normal compressive strain. Nanotechnology 26, 075701 (2015). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Dai, J. & Zeng, X. Bilayer phosphorene: effect of stacking order on bandgap and its potential applications in thin-film solar cells. J. Phys. Chem. Lett. 5, 1289 (2014). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Kane, C. L. & Mele, E. J. topological order and the quantum spin Hall effect. Phys. Rev. Lett. 95, 146802 (2005). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Li, Y. & Wu, C. High-dimensional topological insulators with quaternionic analytic Landau levels. Phys. Rev. Lett. 110, 216802 (2013). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Hasan, M. Z. & Kane, C. L. Colloquium: topological insulators. Rev. Mod. Phys. 82, 3045 (2010). Article \n    ADS \n    CAS \n    \n                    Google Scholar Qi, X.-L., Zhang, S.-C. & Kane, C. L. Topological insulators and superconductors. Rev. Mod. Phys. 83, 1057 (2011). Article \n    ADS \n    CAS \n    \n                    Google Scholar Liao, L. et al. High-speed graphene-transistors with a self-aligned nanowire gate. Nature 467, 305 (2010). Article \n    ADS \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Wu, Y. et al. High-frequency, scaled graphene transistors on diamond-like carbon. Nature 472, 74 (2011). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Qiao, Z., Tse, W.-K., Jiang, H., Yao, Y. & Niu, Q. Two-dimensional topological insulator state and topological phase transition in bilayer graphene. Phys. Rev. Lett. 107, 256801 (2011). ADS \n    PubMed \n    \n                    Google Scholar Murakami, S. Quantum spin Hall effect and enhanced magnetic response by spin-orbit coupling. Phys. Rev. Lett. 97, 236805 (2006). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Hirahara, T. et al. Inter-facing 2D and 3D topological insulators: Bi(111) bilayer on Bi2Te3 . Phys. Rev. Lett. 107, 166801 (2011). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Liu, C.-C., Feng, W. & Yao, Y. Quantum spin Hall effect in silicene and two-dimensional germanium. Phys. Rev. Lett. 107, 076802 (2011). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Xu, Y. et al. Large-gap quantum spin Hall insulators in tin films. Phys. Rev. Lett. 111, 136804 (2013). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Perdew, J. P., Burke, K. & Ernzerhof, M. Generalized gradient approximation made simple. Phys. Rev. Lett. 77, 3865 (1996). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Heyd, J., Scuseria, G. E. & Ernzerhof M. Hybrid functionals based on a screened Coulomb potential. J. Chem. Phys. 118, 8207 (2003). Article \n    ADS \n    CAS \n    \n                    Google Scholar Matsushita, Y.-I., Nakamura, K. & Oshiyama, A. Comparative study of hybrid functionals applied to structural and electronic properties of semiconductors and insulators. Phys. Rev. B 84, 075205 (2011). Article \n    ADS \n    CAS \n    \n                    Google Scholar Yu, T. et al. Raman mapping investigation of graphene on transparent flexible substrate: the strain effect. J. Phys. Chem. Lett. 112, 12602 (2008). Article \n    CAS \n    \n                    Google Scholar Fu, L. & Kane, C. L. Topological insulators with inversion symmetry. Phys. Rev. B 76, 045302 (2007). Article \n    ADS \n    CAS \n    \n                    Google Scholar Grimme, S. Semiempirical GGA-type density functional constructed with a long-range dispersion correction. J. Comput. Chem. 27, 1787 (2006). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Kato, Y. K., Myers, R. C., Gossard, A. C. & Awschalom, D. D. Observation of the spin Hall effect in semiconductors. Science 306, 1910 (2004). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Stern, N. P. et al. Current-induced polarization and the spin hall effect at room temperature. Phys. Rev. Lett. 97, 126603 (2006). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Matsuzaka. S., Ohno. Y. & Ohno, H. Electron density dependence of the spin Hall effect in GaAs probed by scanning Kerr rotation microscopy. Phys. Rev. B 80, 241305(R) (2009). Article \n    ADS \n    CAS \n    \n                    Google Scholar Murakami, S., Nagaosa. N. & Zhang, S.-C. Dissipationless quantum spin current at room temperature. Science 301, 1348 (2003). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Sinova, J. et al. Universal intrinsic spin Hall effect. Phys. Rev. Lett. 92, 126603 (2004). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Hirsch. J. E. Spin Hall effect. Phys. Rev. Lett. 83, 1834 (1999). Article \n    ADS \n    CAS \n    \n                    Google Scholar Bernevig, B. A., Hughes. T. A. & Zhang, S.-C. Quantum spin Hall effect and topological phase transition in HgTe quantum wells. Science 314, 1757 (2006). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Kresse, G. & Furthmuller, J. Efficient iterative schemes for ab initio total-energy calculations using a plane-wave basis set. Phys. Rev. B 54, 11169 (1996). Article \n    ADS \n    CAS \n    \n                    Google Scholar Kresse, G. & Furthmuller, J. Efficiency of ab-initio total energy calculations for metals and semiconductors using a plane-wave basis set. Comput. Mater. Sci. 6, 15 (1996). Article \n    CAS \n    \n                    Google Scholar Blochl, P. E. Projector augmented-wave method. Phys. Rev. B 50, 17953 (1994). Article \n    ADS \n    CAS \n    \n                    Google Scholar Monkhorst, H. J. & Pack, J. D. Special points for Brillouin-zone integrations. Phys. Rev. B 13, 5188 (1976). ADS \n    MathSciNet \n    \n                    Google Scholar Olsen, T., Yan, J., Mortensen, J. J. & Thygesen, K. S. Dispersive and covalent interactions between graphene and metal surfaces from the random phase approximation. Phys. Rev. Lett. 107, 156401 (2011). Article \n    ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Togo, A., Oba, F. & Tanaka, I. First-principles calculations of the ferroelastic transition be-tween rutile-type and CaCl2-type SiO2 at high pressures. Phys. Rev. B 78, 134106 (2008). Article \n    ADS \n    CAS \n    \n                    Google Scholar Marques, M. A. L., Castro, A., Bertsch, G. F. & Rubio, A. Octopus: a first-principles tool for excited electron-ion dynamics. Comput. Phys. Commun. 60, 151 (2003). Google Scholar Hartwigsen, C., Goedecker, S. & Hutter, J. Relativistic separable dual-space Gaussian pseudopotentials from H to Rn. Phys. Rev. B 58, 3641 (1998). Article \n    ADS \n    CAS \n    \n                    Google Scholar Yabana, K. & Bertsch, G. F. Time-dependent local-density approximation in real time. Phys. Rev. B 54, 4484 (1996). Article \n    ADS \n    CAS \n    \n                    Google Scholar Keyes, R. W. The electrical properties of black phosphorus. Phys. Rev. 92, 580 (1953). Article \n    ADS \n    CAS \n    \n                    Google Scholar Download references This work was supported by the NKBRSFC under grants Nos 2011CB921502, 2012CB821305, 2010CB922904, NSFC under grants Nos 11228409, 61227902, 11174214, NSAF under grant No. U1430117. Beijing National Laboratory for Condensed Matter Physics, Institute of Physics, Chinese Academy of Sciences, Beijing, 100190, China Tian Zhang, Jia-He Lin, Yan-Mei Yu & Wu-Ming Liu Institute of Atomic and Molecular Physics, College of Physical Science and Technology, Key Laboratory of High Energy Density Physics and Technology of Ministry of Education, Sichuan University, Chengdu, 610065, China Tian Zhang, Jia-He Lin & Xiang-Rong Chen You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar T.Z. conceived this research. T.Z. performed atomic and electronic structure calculations. J.-H.L. predicted the optical absorption spectra, Y.-M.Y., X.-R.C. and W.-M.L. analyze the numerical results. T.Z. and J.-H.L. wrote the manuscript and all the authors commented on it. The authors declare no competing financial interests. This work is licensed under a Creative Commons Attribution 4.0 International License. The images or other third party material in this article are included in the article’s Creative Commons license, unless indicated otherwise in the credit line; if the material is not included under the Creative Commons license, users will need to obtain permission from the license holder to reproduce the material. To view a copy of this license, visit http://creativecommons.org/licenses/by/4.0/ Reprints and Permissions Zhang, T., Lin, JH., Yu, YM. et al. Stacked bilayer phosphorene: strain-induced quantum spin Hall state and optical measurement.\n                    Sci Rep 5, 13927 (2015). https://doi.org/10.1038/srep13927 Download citation Received: 10 May 2015 Accepted: 11 August 2015 Published: 15 September 2015 DOI: https://doi.org/10.1038/srep13927 Anyone you share the following link with will be able to read this content: Sorry, a shareable link is not currently available for this article.  Provided by the Springer Nature SharedIt content-sharing initiative Scientific Reports (2020) Scientific Reports (2019) By submitting a comment you agree to abide by our Terms and Community Guidelines. If you find something abusive or that does not comply with our terms or guidelines please flag it as inappropriate. Advertisement Scientific Reports (Sci Rep)\n                \n\nISSN 2045-2322 (online) © 2023 Springer Nature Limited Sign up for the Nature Briefing newsletter — what matters in science, free to your inbox daily. ",
    "datetime": null,
    "url": "https://www.nature.com/articles/srep13927"
}