{
    "title": "Standoff in Sellersburg ends, suspect in custody",
    "text": "SELLERSBURG, IN (WAVE) – A standoff between police and a man who barricaded himself inside a home ended about 9:30 Monday night when the suspect was taken into custody. During the standoff, which latest more than nine hours, a Clark County deputy was wounded and an Indiana State Police K-9 was killed, according to the Clark County Sheriff. [PREVIOUS STORY: Deputy wounded, police dog killed during Sellersburg standoff] ISP said that just before noon Monday, Sellersburg police officers were called to a home on Iowa Avenue by the suspect's wife who wanted officers to help her husband. While attempting to serve a mental inquest warrant, the man took his two children, ages 16 and 4, and fled on foot into a backyard a couple of blocks away. According to the Sellersburg police chief, the suspect was armed and aimed a gun at the chief, then left his children in the backyard and ran into a home on East Delaware that does not belong to the suspect. Police said the man kicked in the back door to gain entry. \"He (one of the children) came running to me and just clenched onto me and said, 'Just hold me,' according to neighbor Brittany Hobbs. \"He said, 'My dad held a gun to my head saying he was going to shoot me. He's gonna shoot me.'\" Investigators said the man was barricaded in a back room of the home when six to seven shots were fired. That gunfire killed Kilo, a well-known police dog that made numerous drug busts with his officer handler. Police pulled back from the house and sealed off the area. WAVE 3 News reporter Katie Bauer said several rounds of gunfire could be heard around 3:30 p.m. Those shots wounded Detective Chris Proctor, a member of the SWAT team. Proctor was shot in the knee and rushed to University Hospital in Louisville for treatment. He was expected to undergo surgery on Tuesday. ISP said the residents of the home were not there at the time. The SWAT team sent a robot into the home, but its camera was shot out by the suspect. Neighbors were kept from their homes during the standoff. Neither the suspect's name nor his condition have been released. Copyright 2013 WAVE News. All rights reserved. ",
    "datetime": "2013-06-25T05:40:01Z",
    "url": "https://www.wave3.com/story/22675892/standoff-in-sellersburg-ends-suspect-in-custody/"
}