{
    "title": "Stars turn to Southeast Asia under China’s “Korean restriction order”\r\n中國「限韓令」發威  韓星轉戰東南亞 - Taipei Times",
    "text": "Beijing has issued a “Korean restriction order” to retaliate against South Korea over its deployment of the Terminal High-Altitude Air Defense (THAAD) system. Many South Korean stars are now embracing the Southeast Asian region after losing the huge Chinese market, hoping to mitigate the impact of this move. Despite efforts to expand in China in recent years, the South Korean show business industry has been hit badly. China no longer airs Korean TV programs, and has canceled most Korean artists’ commercial events. The ban has also made the South Korean entertainment industry think more about market diversification. South Korea’s pop cultural exports — known as the “Korean Wave” (or “Hallyu”) — have already swept Southeast Asian countries, China previously being the focus. Now, K-pop stars are targeting the Southeast Asian market. Boy group “EXO” held three concerts in Malaysia last month, and finished another show in Singapore this month, for example. Photo courtesy of Super Dome Enterprise Co.照片︰超級圓頂提供 (CNA, translated by Eddy Chang) 為了報復南韓布署終端高空防衛系統（「薩德」系統），北京祭出「限韓令」。南韓明星失去中國這個龐大市場後紛紛轉戰東南亞，希望能彌補「薩德」系統帶來的衝擊。 近年來積極開拓中國市場的南韓娛樂圈損失慘重，中國已經不再播放南韓節目，南韓藝人的商演活動也紛紛遭到取消，該禁令更引發南韓娛樂圈對於市場多樣化的思考。 被稱為「韓流」的流行文化輸出早已經風靡東南亞國家，而中國曾是韓流的重點。現在K-pop明星則轉戰東南亞市場，例如偶像天團「EXO」上個月在馬來西亞舉辦三場演唱會，這個月又到新加坡巡演。 （中央社）  A: It seems that the Taiwanese love to drink coffee.\r\nB: Yeah, there are coffee shops everywhere.\r\nA: Starbucks and Louisa each have over 500 branches.\r\nB: 7-Eleven also sells coffee at over 6,000 outlets.\r\nA: With unlimited business opportunities, no wonder coffee is often dubbed “black gold!”\r\nA:  台灣人還真愛喝咖啡。\r\nB:  對啊到處都是咖啡廳。\r\nA:  光是星巴克和路易莎就各有500多家呢。\r\nB:  7-Eleven更有6,000多家門市在賣咖啡。\r\nA:  咖啡商機無限難怪被稱為「黑金」！\r\n(By Eddy Chang, Taipei Times／台北時報張聖恩) Bats often have a bad reputation because they can carry viruses associated with serious diseases like COVID-19. While they may seem scary, bats actually contribute to the environment in an essential way. They help create new generations of plants through the transfer of pollen, a sticky substance inside flowers that helps produce new seeds.\r\nOne example of this is the Weber Azul agave plant, found in Mexico. It’s the only plant used to make tequila, a popular type of liquor. The Mexican long-nosed bat feeds on its nectar, the sweet liquid within a flower, and transports pollen from one flower to 美國名校在大學畢業典禮時，經常邀請政治圈、商業或演藝界的名人，為即將進入社會的新鮮人提供寶貴的人生經驗。有趣的是，近年來許多名人不再用傳統正面、充滿希望的那種芭樂（cheesy）的方式給新鮮人精神喊話，而是不避諱地強調社會黑暗面，給學生一個震撼的wake-up call，刺激並點醒學生面對現實。\r\n今天筆者精選了幾位名人的經典致詞，即使是出社會多年的老鳥們，看了也會有所頓悟、非常受用，還能學到相關的多益（www.toeic.com.tw）詞彙！\r\n首先，紐約時報專欄作家大衛．布魯克斯（David Brooks）在頂尖名校達特茅斯學院（Dartmouth College）提到這段逆耳卻很中肯的建言：\r\n“You have to give to receive. You have to surrender to something outside yourself to gain strength within yourself. You have to conquer your desire to get what you crave. Success leads to the greatest failure, which is arrogance and pride. Failure can lead to the greatest success, which is humility and learning. In order to fulfill yourself, you have to forget yourself. In order to find yourself, you have to lose yourself.”\r\n「你必須先付出再求回報，你必須先臣服於外在的殘酷，才能增強內在的強度，你必須先克服慾望，才能達成渴望。成功導致最大的失敗，便是自大與驕傲，失敗反能引領你邁向成功，正是謙卑與學習。欲實踐自我，你必須先忘卻自我，欲找回自我，你必須先失去自我。」\r\n在這個強調自我主義的時代，人們能方便快速地滿足自我需求，卻忘了成功的前提是須歷經一番寒徹骨的等價交換原則！除了這道理之外，英文方面剛好用到了兩個多益必考的高頻動詞：\r\nlead to  導致\r\nlead to為動詞片語，表示導致某事發生。很多人會以為lead to等於contribute to，但contribute to後面通常都是接較負面的結果，而lead to比contribute to廣泛，能接正反兩面的結果。比如說，「A sudden pouring rain contributed to the traffic jam.」這「traffic jam」當然就不是件好事囉！而lead to可以接負面的結果之外（如上述用法Success leads to failure），同時也能接正面的結果Failure can lead Many children are introduced to animals through TV shows or movies. Shaun the Sheep, a stop-motion animated series, features a variety of animals living at the Mossy Bottom Farm. Among them, mischievous Shaun is the clever leader of his flock of sheep. Sheep in this animation look a bit different from common ones because the TV show used the Valais Blacknose sheep as the prototype.\r\nThere are few animals that make people say “Aww!” in a high-pitched voice as quickly as the Valais Blacknose sheep. Known as the cutest sheep in the world, these animals come from the Valais region in ",
    "datetime": "2017-04-14T00:00:00+08:00",
    "url": "https://www.taipeitimes.com/News/lang/archives/2017/04/14/2003668653"
}