{
    "title": "Streaming media platform Kocowa launches in the United States, offering access to Korean TV Programs",
    "text": "Searching for your content... In-Language News Contact Us 888-776-0942\n\nfrom 8 AM - 10 PM ET - Korea's three largest broadcasters launched Kocowa in the United States, offering a single destination to watch popular Korean TV programs, including drama, variety shows and K-Pop shows. - Programs are available on Kocowa for U.S. viewers with English translations within hours of being broadcasted in Korea. - Kocowa is available on a variety of platforms including PC, mobile and tablets, and later this year on Smart TVs. News provided by 24 Jul, 2017, 09:00 ET Share this article LOS ANGELES, July 24, 2017 /PRNewswire/ -- KCP Global, a joint venture between the three largest Korean broadcasters (KBS, MBC and SBS) officially launched the new Korean entertainment platform Kocowa for U.S. audiences today. Fans of Korean dramas and K-pop in the United States now have access to the most popular Korean TV programs through this new, high-quality video streaming platform. Kocowa offers U.S. audiences instant access to the best Korean TV programs from all three broadcasters, ranging from TV series, variety shows and music videos. Programs are being made available to U.S. audiences with high-quality translations in up to six hours after being broadcast in Korea. To provide Korean programs almost simultaneously in the U.S. market, the company is working with a certified translation team that immediately translates the programs into English when the programs run in Korea. Kocowa is available on a variety of platforms including PC, mobile and tablet. Later this year, the video service will also be available to stream on Smart TVs. \"We are thrilled to bring the best of Korean TV to U.S. audiences with Kocowa,\" said Jungsik Kim, CEO of KCP. \"Korean pop stars, such as PSY and BTS, have captured global audiences, forging interest in discovering more Korean stars and TV programs. Kocowa offers a single destination to discover the best of all types of Korean TV programs, from drama to variety. We not only offer the best of Korean TV, we also offer it very fast, with very high-quality translations. The programs become available in the U.S. within hours after airing in Korea.\" Kocowa offers subscribers various perks and exclusive access to video content. Programs include popular TV dramas such as School 2017, Into the World Again and The King in Love, as well as the most popular Korean variety shows in 2016, Running Man and 2 Days 1 Night. This Thanksgiving, subscribers will have exclusive video access to the 2017 World Tour of popular K-pop artist G-Dragon, titled Act III, M.O.T.T.E (Moment of Truth: The End) in North and South America. According to Billboard, G-Dragon's 2017 tour is the largest concert tour ever conducted by a Korean solo artist. Kocowa makes its streaming service accessible for all audiences through multiple subscription options that include daily, monthly, annual and advertising-based plans. The daily plan, priced at $0.99 per day, offers fans full access to all content for one day, without any ads. The monthly subscription plan, priced at $6.99 per month, also enables unlimited access to all content after programming upload. For users who want to enjoy Korean TV dramas and shows year-round, the annual membership is priced at $69.99, and includes a discount for two months and surprise gifts. Both the annual and monthly memberships enable access to streaming contents without ads, and include a month-long free trial. Users who want to enjoy K-dramas and music programming free of charge can also opt for the advertising-based plan, which enables access to content within 24 hours of release. K-wave is a term that explains the surging popularity of K-pop (Korean pop music and idol groups) and K-drama (Korean films and TV series). There are estimated 35 million K-wave fans globally, 8 million of whom are based in the U.S. About KocowaKocowa, which stands for Korean Contents Wave, is a video streaming platform that specializes in delivering mainstream Korean TV dramas, variety shows and K-POP shows. The platform is powered by KCP Global, a joint venture between the largest three Korean broadcasters: KBS, the first and only national Korean broadcasting company; MBC, a broadcasting company specializing in culture that owns \"Infinity Challenge,\" the largest and most popular variety TV show in Korea; and SBS, a broadcasting company specializing in younger and modern generations. Kocowa is currently available in North and South America. Kocowa makes popular Korean TV programs available to a global audience hours after broadcast in Korea, with high-quality translations. Kocowa offers audiences a range of subscription options, including daily (for $0.99), monthly (for $6.99) and annual (for $69.99). Audiences can also stream content free of charge with an advertising-based plan. For more information, visit kocowa.com About KCPFounded in Los Angeles, CA in November 2016, KCP, a joint venture of three major broadcasters in Korea, provides high quality contents to consumers promptly through its own premium services. KCP continuously develops its own technology and secures carefully selected best contents around the world to become the world's top premium contents platform. Learn more at https://www.kcpglob.com/ Media ContactKatja Schroeder[email protected]  646-757-6116 SOURCE Kocowa http://www.kcpglob.com Sign up to get PRN’s top stories and curated news delivered to your inbox weekly!  ",
    "datetime": null,
    "url": "https://www.prnewswire.com/news-releases/streaming-media-platform-kocowa-launches-in-the-united-states-offering-access-to-korean-tv-programs-300492535.html"
}