{
    "title": "Streamer Rakuten Viki is riding a wave of Asian content - Los Angeles Times",
    "text": "The first episode of the Korean fantasy drama “Guardian: The Lonely and Great God” started at 7 p.m. last Wednesday. Viewers reacted to the scenes unfolding in front of them, commenting on the actors, the plot, and urging others to not spoil the show for newcomers. “It’s much more fun to watch this again with other people,” one viewer said early in the showing. It may seem like a typical movie night among friends, but the comments were all made online, and most of the viewers had likely never met. The streaming site Rakuten Viki launched its Watch Party function in May, giving users the chance to connect with each other across screens. Unlike Netflix Party, the free Google Chrome extension that allows friends to watch shows together, Rakuten Viki plans the watch party itself and any of its users can join. The streaming service, which offers free and paid tiers, has surged in popularity this year. The company said it now has more than 15 million subscribers globally (including those watching free with ads), up 50% from a year ago. While many streamers have seen increased traffic since the COVID-19 pandemic locked people in their homes, Rakuten Viki has capitalized on the rising demand for Korean content and become a go-to streaming site for East Asian television shows and films. In the last year, U.S. demand for Korean-language content has grown by 66%, according to the L.A.-based research firm Parrot Analytics. “The trend in the Korean wave actually began over 20 years ago, and it’s been building for many years leading up to the recent breakthrough,” Rakuten Viki Chief Executive Sam Wu said. “So we’ve been seeing that growing appetite in Asian content firsthand here.” On Rakuten Viki, users can curate collections of shows on the site, at least one of which is focused on dramas that feature K-pop idols. Additionally, many of the site’s subtitles in more than 130 languages are generated by users and volunteers who compete to contribute the most content, giving the site its name. Viki is meant to be a mix of the words “video” and “Wiki,” playing on the idea that the subtitles are user-generated, like content on the site Wikipedia. Owned by the Japanese e-commerce company Rakuten, Viki offers more than 1,300 shows and movies, including originals, from Korea, Japan, China and Taiwan. The San Mateo, Calif.-based company was launched in 2007 by three Stanford and Harvard graduate students — with funding from LinkedIn co-founder Reid Hoffman and a Singapore startup backed by Joichi Ito — to tap into the growing global demand for Asian content. Tokyo-based Rakuten, which also owns companies in advertising, telecommunications and e-books, acquired the streaming site in 2013 as part of its own global expansion. Rakuten Viki uses a tiered subscription system, offering free content with ads and monthly subscriptions of $4.17 or $8.33. Although it targets a global audience, Rakuten Viki has a big following in the U.S., where it attracted 5 million users in the last month. The company has more than 100 employees with offices in Shanghai, Seoul, Tokyo and Singapore. The platform boasts the largest library of Korean content, which gained popularity after the film “Parasite” won four Academy Awards in February. A similarly focused streaming site, DramaFever, was owned by Japanese telecommunications firm SoftBank Group, and streamed Korean content to global audiences. But in 2016, Warner Bros. acquired the company, and within two years shut it down amid licensing violations and other problems, leaving an opening for Viki and others. Several other streaming sites have since broken into the genre as demand for Korean content has climbed. Netflix started expanding its original and licensed Korean content after it launched in Asia about five years ago. And NBCUniversal, which just launched its new streaming site, Peacock, signed a deal with South Korean streaming site Wavve to license content and invest in the production of future content. Even so, Rakuten Viki maintains it has the shows that American viewers want to watch. Among the sites hosting the top 10 most in-demand Korean-language series in the U.S., Rakuten Viki beat out Netflix, Hulu, Amazon Prime and YouTube. “In fact, Viki houses three of the four most in-demand Korean-language series with U.S. audiences,” said Alejandro Rojas, director of applied analytics at Parrot Analytics. “As the streaming market gets more crowded and competitive, personalized curation of foreign content is a successful strategy to cut through the clutter.” Rakuten Viki recently signed a nonexclusive deal with Orange County-based distribution company 815 Pictures, adding more than 30 projects from the company to the site, including “Midnight Runners,” “Mr. Zoo: The Missing VIP” and “A Violent Prosecutor.” But 815 Pictures Managing Partner K.J. Lee said the deal goes beyond licensing agreements. He said Rakuten Viki is very in-touch with the U.S. Asian film market, giving 815 Pictures recommendations on which projects to acquire based on which actors are doing well in the U.S., and what films are trending. “Sometimes, before we acquire the contents from Asia, we discuss with Viki, ‘Hey Viki, we have this kind of opportunity, what do you think?’” Lee said. “We highly respect their comments on those contents.” Wu says his company’s niche content offers unique interactions with the fan base of Korean and other Asian content, giving it an edge in the market, especially considering the fan base is known for its force online. K-pop fans allegedly reserved tickets to President Trump’s rally in Tulsa, Okla., and never attended, and flooded the hashtag #WhiteLivesMatter with signals of support for the Black Lives Matter movement, all the while sharing videos and photos of K-pop stars. “The community within Viki, they really like to share their fandom,” Wu said. “So that means they love to share this with friends, families, on social media.” Rakuten Viki’s Watch Party is just the most recent addition to expand the site’s community of users at a time when people remain sheltered in their homes and unable to go to movie theaters or concerts. Wu said the function was being developed well before the pandemic, but it has presented a solution to the new issues of isolation. “We’ve heard from users that through Viki, they feel a sense of belonging and they feel connected to the community when they consume content,” Wu said. “They feel like they’re no longer alone, and they feel like they’re a part of a community, and they feel connected to other fans that love the same type of content that they love.” Inside the business of entertainment The Wide Shot brings you news, analysis and insights on everything from streaming wars to production — and what it all means for the future. You may occasionally receive promotional content from the Los Angeles Times. Follow Us Naomi Klinge is a summer 2020 reporting intern with the Company Town team at the Los Angeles Times. Company Town Oct. 25, 2023 Company Town Oct. 25, 2023 Company Town Oct. 24, 2023 Company Town Oct. 24, 2023 Politics Oct. 25, 2023 Company Town Oct. 22, 2023 Movies Oct. 22, 2023 Subscribe for unlimited accessSite Map Follow Us MORE FROM THE L.A. TIMES ",
    "datetime": "2020-07-22T16:33:49.247",
    "url": "https://www.latimes.com/entertainment-arts/business/story/2020-07-22/kpop-rakuten-viki-korean-dramas-streaming-watch-parties-parasite"
}