{
    "title": "\n\tStrong ‘Modi wave’ could help TDP win seats - The Hindu\n",
    "text": "To enjoy additional benefits CONNECT WITH US April 27, 2014 11:28 pm | Updated November 16, 2021 07:25 pm IST - ADILABAD: COMMents SHARE READ LATER Who wins from the Adilabad (ST) parliamentary seat will depend on the strength of the much-talked-about Modi wave. A stronger surge in favour of the BJP could boost the winning chances of sitting MP Ramesh Rathod of the TDP, while a weaker trend would make things easier for the TRS’ Godam Nagesh. Also in the fray is Congress candidate Naresh Jadhav, who seems handicapped following the selection of candidates for the seven Assembly segments in the parliamentary constituency. The party is accused of having erred in selecting most MLA candidates from the group owing allegiance to former MLC K. Premsagar Rao, a rival of the District Congress Committee president C. Ramchander Reddy. It is to Mr. Reddy’s group that Mr. Jadhav belongs. “The announcement on crop loan waiver of up to Rs.2 lakh made by party vice-president Rahul Gandhi is yet to percolate to the grassroots. This may therefore not improve Mr. Jadhav’s chances. Its real impact however, would be known only after the results are announced on May 16,” sums up Musku Ramana Reddy, a voter from Borigaon in Boath (ST) Assembly constituency. The BJP has some presence at the grassroots level in Adilabad, Mudhole and Sirpur constituencies, which may translate into votes for Mr. Rathod. Pushed to a corner in the aftermath of the Telangana struggle, the TDP camp is pinning hopes on cross-voting in all Assembly segments. Mr. Rathod could even trail behind in the Khanapur (ST) segment which he has held twice, and where his wife is the sitting MLA. As the TRS candidate is a strong contender here, the likelihood of cross-voting in favour of the TDP candidate is far less. “The TRS definitely enjoys an edge as it is credited with carving out Telangana State. The Rs.1 lakh crop loan waiver has also caught the imagination of farmers across the constituency,” opines Kalaveni Sheshamma of Kagaznagar town in Sirpur Assembly segment. The other advantage which the TRS enjoys is that its candidate belonging to the Gond tribe, whose voters number an estimated 1.5 lakh. They have reportedly vowed to support Mr. Nagesh which could tilt the balance in his favour. COMMents SHARE BACK TO TOP Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. ",
    "datetime": "2014-04-27T17:58:52.000Z",
    "url": "https://www.thehindu.com/news/national/andhra-pradesh/strong-modi-wave-could-help-tdp-win-seats/article5953892.ece"
}