{
    "title": "Super Junior Signs With ICM Partners Outside Asia – Billboard",
    "text": "ICM Partners has signed k-pop act Super Junior for representation outside of Asia. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tTaylor Mims Writer ICM Partners has signed k-pop act Super Junior for representation outside of Asia. Super Junior released their first album in 2005 and broke through with 2009 hit “Sorry Sorry.” The group has won multiple awards in Korea and beyond, including 13 Mnet Asian Music Awards, 19 Golden Disc Awards and US Teen Choice Awards for International Artist and Best Fandom. The group reached No. 1 on Taiwan’s music site, KKBOX, for 150 consecutive weeks and became the first Korean act to enter Billboard’s Latin charts in 2018 with single “Lo Siento” with Leslie Grace and Play-N-Skillz.  “We are thrilled to represent the kings of the Korean Wave, Super Junior,” ICM Partners vp of concerts Jon Pleeter said in a statement. “Along with Label SJ we look forward to growing the Super Junior brand across the media landscape, including global touring, marketing, business development and strategic partnerships.” Super Junior has released over 30 albums in Korea and Japan, including nine studio albums. Their most recent studio album, Time_Slip, debuted at No. 9 on the Billboard World Albums Chart. TIMELESS, a reissue of Time_Slip, was released in January. They have played over 150 shows in 30 cities across Asia, Europe and America to over 2.2 million fans and counting. The group’s current lineup includes Leeteuk, Heechul, Shindong, Yesung, Siwon, Eunhyuk, Donghae, Ryeowook and Kyuhyun. This agreement is in partnership with KAMP Global. Daily newsletters straight to your inbox Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2020-12-09T19:47:06+00:00",
    "url": "https://www.billboard.com/pro/super-junior-signs-icm-partners-representation-outside-asia/"
}