{
    "title": "Super Junior Interview: K-pop Group Talks Legacy, Songwriting & ‘Lo Siento’  | Billboard – Billboard",
    "text": "Super Junior's members addressed their K-pop legacy, songwriting, and more at KCON 2018 NY. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tTamar Herman Back in 2009, then-13-member Korean group Super Junior became one of that year’s biggest success stories when its single “Sorry Sorry” went viral. Over the next few years, the team became one of K-pop’s most prominent performers, and gained an international following around the globe. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tSuper Junior\t\t\n\t\t\t\t\t\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news They were one of the Top 10 K-pop touring acts globally between 2013-16, and were the first South Korean act to focus heavily on the Chinese market, with sub-unit Super Junior-M forming in 2007 with two additional Mandarin-speaking members. Now industry seniors who focus on a variety of entertainment fields, ranging from acting to MCing to music video producing, the boy band recently saw a career renaissance with their latest single, “Lo Siento.”   A Latin / K-pop collaboration that features Dominican-American singer Leslie Grace and production duo Play-N-Skillz, the group’s April-release showed that Super Junior still has what it takes to lead K-pop’s way into new markets: The single went to No. 13 on the Latin Digital Song Sales chart, the first ever Korean song to appear on a Latin music-associated Billboard chart. In an industry where, until recently, careers for idol pop acts rarely exceeded a decade, SuJu has once again reasserted their worth as one of the most impactful Korean artists internationally. Super Junior’s career growth has chronologically been in-line with the waxing and waning of K-pop’s popularity globally: “Sorry Sorry” was one of several hits in 2009 that spurred new interest in Korean pop culture internationally, fronting Hallyu or the Korean wave, in the late ‘00s and early ‘00s. Now “Lo Siento” comes at a time when more Korean music than ever before is appearing on American charts.  “When we first debuted, this word ‘K-pop’ it wasn’t such a big phenomenon as it is now,” group leader Leeteuk (Park Jungsoo) tells Billboard ahead of their performance at KCON 2018 NY on June 23. “But when we started to get really popular with ‘Sorry Sorry,’ K-pop as a whole became such a huge sensation. We want to continue to grow as a group, so that when the public thinks ‘K-pop,’ Super Junior becomes a household name that is very much relevant to ‘K-pop.’”  The rise of “Despacito” and other Spanish-language music in the global mainstream made Super Junior and their label, SM Entertainment, believe that the time was right for a Latin pop-inspired track. Performed in Korean, Spanish, and English, “Lo Siento” is the most expansive crossover with the Latin world that K-pop has seen as of yet. “Because it’s something new, there may have been some things that weren’t perfect,” reflects Leeteuk. “But as we try new things, we feel, as a group, that we’ll continue to grow and become a lot stronger.” According to Grace, who performed with Super Junior at the east coast KCON event last weekend, “Lo Siento” gave her the opportunity to, “Live firsthand the fact that music has no barriers,” and get an eye-witness look at what K-pop and its global audience is like. She performed alongside Super Junior throughout the Latin American stops of their recent Super Show 7 world tour, during which she had her own set midway through each concert.  While talking, it’s clear that Grace and the six members of Super Junior at KCON — the group’s seventh currently active member Kim Heechul was unable to attend — have learned much from one another, despite the language barrier; during the interview, barely a sentence gets out of anyone’s mouth without Grace or a member of Super Junior commenting on one another’s response, often poking fun at one another and referencing inside jokes. According to the six, Grace even has a favorite Super Junior song: “One More Chance,” off of last year’s Play album. Co-written by Lee Donghae, the Super Junior member cites her enthusiasm for the song as one of the motivators behind his desire to keep writing music for the group. “The members really liked this song, Leslie actually says it’s her favorite song as well, and the fans really enjoyed it, so it makes me feel like I need to keep continuing to work really hard and write more, better songs,” Lee explains.   According to Leeteuk, Super Junior feels an obligation as a veteran act to keep pushing forward with their career in new and novel ways, in order not only to remain relevant, but also to continue propelling K-pop’s growth for the next generation of younger K-pop stars. “Not much has changed since our debut days and the debut of current idols,” he said. “When we look to them, we think that we need to try harder as well, because these kids look to us and think, ‘Oh, we want to succeed like Super Junior.’ And so in order to keep that, we have to continue to succeed as a group as long as possible.” Though all of Super Junior’s members are well in their early or mid-30s, the group has no plans of slowing down anytime soon. “Rather than it being a long time for us having been around, we think that there’s even a longer time for us to continue to perform together as a group,” says Leeteuk. The idea of moving forward with their career while still maintaining their typical Super Junior style and exuberance radiated from the team throughout KCON 2018 NY, where they were the closers of the first night’s concert at the Prudential Center in Newark, New Jersey.  With a set that incorporated a medley of their hits and their newer songs, Super Junior’s six members showed their consummate skill as performers to finish off the show in a high-energy manner that got the whole audience excited. They may no longer be juniors anymore, but as the crowd danced and cheered along to the inspirational lyrics of concert closer “Miracle” — the ebullient pop track opens with the declaration, “Life couldn’t get better” — it was apparent that the 13-year-old act is very much still one of K-pop’s super stars. Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2018-06-27T17:25:53+00:00",
    "url": "https://www.billboard.com/music/music-news/super-junior-interview-lo-siento-k-pop-8463002/"
}