{
    "title": "Superconductivity record sparks wave of follow-up physics | Nature",
    "text": "Thank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\n            the best experience, we recommend you use a more up to date browser (or turn off compatibility mode in\n            Internet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles\n            and JavaScript. Advertisement Nature\nvolume 524, page 277 (2015)Cite this article 2910 Accesses 8 Citations 1201 Altmetric Metrics details This article has been updated Researchers strive to reproduce and understand landmark result. Hydrogen sulfide — the compound responsible for the smell of rotten eggs — conducts electricity with zero resistance at a record high temperature of 203 kelvin (–70 °C), reports a paper published today in Nature1. The first results of the work, which represents a historic step towards finding a room-temperature superconductor, were released on the arXiv preprint server in December2 and followed up by more in June3. They have already sparked a wave of excitement within the research community. A superconductor that works at room-temperature would make everyday electricity generation and transmission vastly more efficient, as well as giving a massive boost to current uses of superconductivity such as the enormous magnets used in medical imaging machines. In an accompanying News & Views article on Nature's website, Igor Mazin of the Naval Research Laboratory in Washington DC describes the hydrogen sulfide discovery as \"the holy grail of superconductors\"4. Physicist Fan Zhang of the University of Texas at Dallas agrees, saying that the finding is \"historic\" and that its impact will be \"far ranging\". The results are the work of Mikhail Eremets, Alexander Drozdov and their colleagues at the Max Planck Institute for Chemistry in Mainz, Germany. They find that when they subject samples of hydrogen sulfide to extremely high pressures — around 1.5 million atmospheres (150 gigapascals) — and cool them below 203 K, the samples display the classic hallmarks of superconductivity: zero electrical resistance and a phenomenon known as the Meissner effect. The Meissner effect occurs when a superconducting material is placed in an external magnetic field and there is no field inside the sample, unlike in normal materials. Not exotic According to Christoph Heil of the Graz University of Technology in Austria, other scientists are intensely interested in the result because it was achieved without using exotic materials such as the copper-containing compounds called 'cuprates' which until now have held the record for the highest superconducting temperature (133 K (–140 °C) at ambient pressure and 164 K (–109 °C) at high pressure). He says that the pressurized hydrogen sulfide seems to be a 'conventional' superconductor in which vibrations within the material's crystal lattice drive electrons to form ‘Cooper pairs’ that can flow through the crystal without resistance. In calculations reported in April5, Matteo Calandra of the Pierre and Marie Curie University in Paris and his colleagues found that the Mainz hydrogen sulfide results could be explained using a modified version of the conventional theory of low-temperature superconductivity based on lattice vibrations. That is surprising because many scientists assumed that superconductivity at temperatures of more than a few tens of Kelvin required exotic materials that do not exhibit conventional superconductivity. For others, such theoretical analyses are superfluous until the result by Eremets and co-workers is confirmed experimentally by independent teams. Several are working towards that goal, including Katsuya Shimizu of Osaka University in Japan and colleagues, who have seen the loss of resistance in pressurized hydrogen sulfide, but have yet to observe the Meissner effect. Meanwhile, four other groups contacted by Nature's news team — three in China and one in the United States — have yet to confirm either the electrical or magnetic effects. If Eremets and colleagues are right, then other hydrogen compounds may be good candidates for high-temperature superconductivity too. For instance, other researchers have published theory papers on arXiv suggesting compounds that pair hydrogen with platinum, potassium, selenium or tellurium, instead of sulfur. Taking a slightly different tack, Zhang in Dallas and Yugui Yao of the Beijing Institute of Technology in China predict that substituting 7.5% of the sulfur atoms in hydrogen sulfide with phosphorus and upping the pressure to 2.5 million atmospheres (250 GPa) could raise the superconducting transition temperature all the way to 280 K6, which is above water's freezing point. Some of the references in this story were incorrect when it was originally published. This has now been corrected. Drozdov, A. P., Eremets, M. I., Troyan, I. A., Ksenofontov, V. & Shylin, S. I. Nature http://dx.doi.org/10.1038/nature14964 (2015). Drozdov, A. P., Eremets, M. I. & Troyan, I. A. Preprint at http://arxiv.org/abs/1412.0460 (2014). Drozdov, A. P., Eremets, M. I., Troyan, I. A., Ksenofontov, V. & Shylin, S. I. Preprint at http://arxiv.org/abs/1506.08190 (2015). Mazin, I. Nature http://dx.doi.org/10.1038/nature15203 (2015). Errea, I. et al. Phys. Rev. Lett. 114, 157004 (2015). Article \n    ADS \n    \n                    Google Scholar Ge, Y., Zhang, F. & Yao, Y. Preprint at http://arxiv.org/abs/1507.08525 (2015). Download references You can also search for this author in\n                        PubMed Google Scholar Superconductivity record bolstered by magnetic data 2015-Jun-29 Superconductivity record breaks under pressure 2014-Dec-12 Reprints and Permissions Cartlidge, E. Superconductivity record sparks wave of follow-up physics.\n                    Nature 524, 277 (2015). https://doi.org/10.1038/nature.2015.18191 Download citation Published: 17 August 2015 Issue Date: 20 August 2015 DOI: https://doi.org/10.1038/nature.2015.18191 Anyone you share the following link with will be able to read this content: Sorry, a shareable link is not currently available for this article.  Provided by the Springer Nature SharedIt content-sharing initiative Quantum Studies: Mathematics and Foundations (2018) Nature (2017) Advertisement Nature (Nature)\n                \n\nISSN 1476-4687 (online)\n    \n\nISSN 0028-0836 (print) © 2023 Springer Nature Limited Sign up for the Nature Briefing newsletter — what matters in science, free to your inbox daily. ",
    "datetime": null,
    "url": "https://www.nature.com/articles/nature.2015.18191"
}