{
    "title": "Super Junior’s Choi Siwon Attends Stanford University Conference To Share Insight Into K-Pop Industry | Soompi",
    "text": "Super Junior’s Choi Siwon brought his personal experiences and knowledge to enrich a conversation about the world of K-pop at a special conference at Stanford University. Stanford University held their “Future Visions: Challenges and Possibilities of Korean Studies in North America” conference on November 1 and 2, where they invited academics in the field to come a discuss the future and potential of Korean studies. Choi Siwon attended the “Korean Wave” panel on November 2 to give his insight and share his experiences. During the event, Choi Siwon spoke about a number of topics including the work that goes into becoming a K-pop star and the social responsibility of entertainment agencies, and had a lively debate as he took questions from those in attendance. He also prepared a presentation of Super Junior’s history and shared insight into the group’s secret to success, touching upon their recent surge of popularity in Central and South America.  Choi Siwon posted a photo from the event on his personal Instagram account and wrote, “Today was an enriching, inspiring, and informative session about K-pop, culture technology, and Korean studies in North America with scholars, professors, and students alike at Stanford University. I hope this event will not only bring more awareness, but also develop into a meaningful study about K-pop and Korean culture as a whole.” https://www.instagram.com/p/Bpslj8xFsx-/ The conference was held by the Platon Academy and the Korea Program of Stanford’s Walter H. Shorenstein Asia-Pacific Research Center (APARC). A documentary around the “Future Visions: Challenges and Possibilities of Korean Studies in North America” conference is set to be aired on SBS CNBC in March 2019 under the tentative title “Golden Time of Korea and Korean Studies.” Source (1) ",
    "datetime": "1541233121",
    "url": "https://www.soompi.com/article/1257025wpp/super-juniors-choi-siwon-attends-stanford-university-conference-share-insight-k-pop-industry"
}