{
    "title": "Surf’s Way Up: Garrett McNamara Claims to Ride Record Wave in Portugal | Time",
    "text": "“In Nazaré, Portugal, the ocean is known as a place of death, not of riding waves,” pro surfer Garrett McNamara admits. If that’s the case, McNamara must be the tamer of the sea. Because on Monday, January 28, he surfed what’s thought to be a 100-foot wave, the largest swell ever ridden by a surfer. McNamara, better known as GMAC, is thought to have broken the world record previously held by, well, himself. In 2011, at the very same spot, he surfed a 78-foot wave, getting his name into the record books. For him, it was an experience so thrilling that Monday, he was at it again, surfing some of the largest waves in the world, including a possible 100-footer that is expected to shatter his previous record. In the small town of Nazaré, on Portugal’s Atlantic coast, a single red lighthouse stands at the shoreline. The small road leading to the lighthouse is, on any normal day, completely deserted. But on Monday, hundreds of people packed the road — photographers and spectators — as the huge swells battered the rocky shoreline. But most cameras seemed unable to capture the height of the sea from such a close vantage point — lauded surf photographer To Mane took a much wider angle, ultimately capturing a stunning view of McNamara’s ride atop the unfathomable wave. The shoreline of Nazaré produces some of the biggest waves in the world because of its physics: a canyon about 10 miles out into the Atlantic, McNamara says, that’s up to five miles at its mouth, gets narrower and narrower as it approaches the shoreline. “They get compressed, and just before they reach the rocks on the shoreline they stand up and reach their full potential,” he explains, giddy as a child. And it wasn’t a mission without danger, McNamara recounts. As he sailed down from the top of the wave, he paddled frantically to escape the crush of oncoming waves. The footage from his GoPro camera strapped to the edge of his board revealed he made a near-deadly turn, ending up perilously close to the rocky coast. He first surfed Nazaré in 2010 at the behest of a surfer friend, returning in 2011 to break the world record. Initially thought to be a 90-foot wave, it was later measured to be 78 feet high, no less a stunning feat and enough to get his name into the record books. And he returned again this year to best himself – by all spectator accounts he seems to have done so. But it’s not about breaking records for the 45-year-old surfer: “The only competition is myself, and even still I work every day to not have to do that,” he says. To be instated in the record books, the team at Guinness will now have to research exactly how high the wave stood up. While it may not measure up to the predicted 100-foot mark, it’s no smaller of a feat. But as the euphoria subsides, McNamara, for his part, is unconcerned. He’s simply focused on his next surfing mission — finding “perfect barrel” waves on his home beaches in Hawaii or perhaps even on the reefs of Indonesia or Tahiti. Nick Carbone is a reporter at TIME. Find him on Twitter at @nickcarbone. Contact us at letters@time.com. ",
    "datetime": "2013-01-30T16:21:55.000Z",
    "url": "https://time.com/3796323/surfs-way-up-garrett-mcnamara-claims-to-ride-record-wave-in-portugal/"
}