{
    "title": "Surfing the K-pop wave",
    "text": "It was 2009 when Suresh Moktan first started watching South Korean movies. It had already been a few years since Hallyu or the Korean Wave had hit Nepal. By the mid-2000s, South Korean movies and dramas like ‘My Sassy Girl' and ‘Boys Before Flowers’ had become hugely popular among Nepali teenagers. Young people, who usually consumed Nepali, Indian, and Western media, flocked to nearby CD stores to buy CDs to watch their favourite South Korean actors in the latest K-drama and films. Moktan was one of those thousands of teenagers who instantly fell in love with K-drama and films.“My sister, who was a huge K-drama and movie fan, suggested that I should watch Korean movies and dramas. That’s how I got introduced to Korean forms of entertainment, and I haven’t stopped since,” says Moktan, 27.After initially getting captivated by the world of K-dramas and movies, Moktan started listening to Korean pop music or K-pop which hadn’t become the global phenomenon it is today. K-pop immediately hooked Moktan and he has embraced it since.“As someone who was very much into B-boying at the time, I found the struggles and success of K-pop stars very inspirational,” says Moktan. “I wanted to do something similar here in Nepal through dance.”This desire led him to start a K-pop dance group. He started looking for people who shared his love for dance and K-pop. And in 2016, Moktan got together with Mizel Raj Pradhan, Alek Tamang, Suman Rai, Prakash Rai, and Santosh Shah Thakuri and started Strukpop, a six-member dance group. “It was Nepal’s first K-pop dance group,” he says. “Based on a suggestion given by a friend, we decided to name our group Strukpop which means ‘Struggling K-pop’. At that time, K-pop wasn’t as popular as it is today here in Nepal and we were sure that our path to success would definitely be filled with struggles. Hence we decided to go with the name Strukpop,” says Moktan, the leader of the group. During the group’s initial days, opportunities to showcase their talent were far and few in between. Lack of support from family members also made things more challenging for some of the group’s members. “For my parents, they didn’t understand what I was doing with the group and what I wanted to achieve out of it. Convincing them to let me follow my passion was difficult. I often used to lie to them that it was just a hobby and that I would quit it in a few years,” says Thakuri. “But it was never just a hobby for me. It was my passion, and I was very serious about pursuing the art form with the group.”Not long after Strukpop was formed, the group participated in the K-pop World Festival, a contest for K-pop dance groups of Nepal, in 2016. The group won the contest and got their first taste of success that further motivated the members to follow their passion. “Winning the contest and the kind of support we received from the audience encouraged us immensely,” says Moktan.But the turning point for the group came in 2017 when their artistic journey and struggles became a subject for a documentary. The documentary, the members say, opened new doors of opportunities.From then onwards, the group started receiving many offers for work. They even started uploading dance covers of K-pop songs, which received a decent number of views, on their YouTube channel. Similarly, they also collaborated with many Nepali singers and were part of some popular music videos including ‘Godawari Banaima’, ‘A Mero Mama’, and ‘Kalo Kothi Galaima’ that received millions of views and helped them gain more popularity. \"Once we started getting offers to be a part of Nepali music videos, people started taking us as a group seriously. Our parents also started believing in us. People were finally realising that the talent we have could be used,\" says Thakuri. But still, to survive as a K-pop dance group wasn’t easy. Compared to other traditional dance groups, Strukpop got fewer opportunities to showcase their dance moves for which they had practised for hours. Apart from that, the group members would often be the target of elicit judgements from the society that often ridiculed them for their appearance. Group members share that since Strukpop members emulated the appearance of many male K-pop idols, who wore makeup and several other things that don’t fall under the traditional definition of how a man should look like, the group members would be constantly judged for their choices. “We would often get judged by people for our fashion sense and our hairstyle,” says Pradhan, 23, the youngest member of the group. “People would sometimes call us by different names like copycats which honestly made us really sad at times.” Nevertheless, the group stayed strong and with whatever they were earning from the local stage shows, they kept on sustaining themselves. Similarly, they also focused on building their online presence by making efforts to produce high-quality videos for their YouTube channel. And their years of consistent hard work paid off in 2019 when the group got an opportunity to visit South Korea to attend a film festival where the documentary based on them was shown. During the same visit, they also got a chance to perform at the Nepathya band’s concert that the members say is one of the peak moments of their career.“It was one of the best moments of our lives. The fact that we were sharing a stage in South Korea with such a legendary Nepali band was a big achievement for our group,” says Moktan.But for Strukpop members, becoming successful as a group is just one of their aims. Their other important mission is to create a thriving K-pop community here in Nepal. To do that, the group has worked to build more platforms for the upcoming Nepali artists interested in K-pop. “From organising dance cover contests for aspiring K-pop dancers to collaborating and coordinating events, we have been constantly making efforts to build the K-pop community stronger,” says Moktan. All the members can understand and speak Korean—an achievement that speaks volume about their passion and love for K-pop. They also keep themselves updated with the latest Korean fashion trends. Meanwhile, on their YouTube channel, which has more than 67,000 subscribers, most of their K-pop dance covers are to the songs of the BTS band, which they consider as their icons.“BTS’s choreography and songs are incredible. Due to the fact that we have followed the band ever since they were a rookie band, we have seen their struggles and we feel this strange connection with them as well,” says Moktan. While they unabashedly admit their love for the band and try to follow in their footsteps, it’s important for the group, say, members, to also focus on their individuality equally as they don’t want to be just a clone of the band. “Even if our videos are just dance covers, we try our best to show our own unique identity with our dance moves, choreography, and style,” says Pradhan. Another thing the group is careful about is drawing the line between obsession and admiration. In recent years, along with the growing popularity of K-pop, there has been an equal rise of K-pop fans becoming obsessed with their idols so much that they want to resemble their idols physically. K-pop culture is often blamed for the rise of an unhealthy obsession with one’s physical appearance among its fans, with many opting for plastic surgery to look like their Korean idols. “We don’t want to lie but when we started out, we did focus a lot on our physical appearances. All of us regularly coloured our hair like the K-pop stars. We even tried to wear the kind of clothes they used to wear, but these days, we don’t focus much on the physical aspect,” says Pradhan. “Now the only thing we care about is our dance, and how we can express our unique identity in our videos.” Having dedicated more than five years of their lives dancing to popular K-pop songs, the group says they’ll soon release their own original K-pop inspired song.“We have spent a lot of years dancing, and now just like the K-pop stars we idolise, we also want to release our own song and perform in it,” says Pradhan. “In short, we want to introduce K-pop as a legitimate musical genre in Nepal through our songs and dance.” Khadgi is a queer journalist currently based in Chicago. ",
    "datetime": null,
    "url": "https://kathmandupost.com/art-culture/2021/08/17/surfing-the-k-pop-wave"
}