{
    "title": "Suspect in custody following standoff in Elizabethtown",
    "text": "ELIZABETHTOWN, KY (WAVE) – A suspect who prompted a standoff involving Kentucky State Police was taken into custody. After more than four hours, a K-9 officer bit the suspect, Robert May, in a tree line behind a home he was believed to have broken into. Trooper Jeff Gregory, the spokesman for the Elizabethtown post, said the situation began after an undercover trooper witnessed an accident involving a stolen vehicle. KSP said the stolen vehicle, driven by May, hit another vehicle, then hit a house and reportedly caused a gas leak around 2 p.m. Monday. As troopers pulled up to the scene Gregory said the vehicle that hit the home fled. The trooper got out of his vehicle to check on the woman in the vehicle May wrecked into and she reported she was not injured. After checking on her the trooper began to chase after the fleeing vehicle. With troopers in pursuit, May abandoned the vehicle and fled on foot through a field. According to a police report, he then went into the garage of a home in the 100 block of Evergreen Trail, in the Cedars subdivision. The owner of the home confronted May and he told the homeowner he needed a glass of water. The homeowner told May to leave at which time the report said he tried to steal a van inside the garage, but was unable to find the keys. The report said May was then removed from the vehicle by the homeowner and he told the homeowner he was going inside the home. The resident tried to flee and got into a struggle with May. The homeowner sustained a torn earlobe, which required stitches, but was able to escape. For hours KSP believed May was still inside the home and Gregory said troopers established a perimeter around the house and shut down the subdivision. With assistance from the KSP K-9 unit troopers eventually located him near a creek bed in the tree line behind the home. May was taken into custody and charged with burglary. Prior to Monday, May's most recent charge was on Aug. 15, 2014 for theft by unlawful taking. In 2013 he was charged with receiving stolen property and on a separate incident he was charged with leaving the scene of an accident, reckless driving, disregarding a stop sign, fleeing or evading police, DUI, failure to wear a seatbelt, no operator license, wanton endangerment, possession, theft by unlawful taking, resisting arrest, terroristic threatening, possession of a controlled substance, possession of marijuana, tampering with physical evidence, no insurance and possession of a controlled substance. In 2013 he also faced charges additional charges of possession of meth, marijuana and drug paraphernalia and had a fugitive warrant for his arrest from Texas. Other previous charges against May include DUI in 2012, probation violation, shock probation, complicity to burglary and burglary in 2011, theft by unlawful taking, probation violation and promoting contraband in 2010, possession of drug paraphernalia, possession of a controlled substance, DUI, fleeing police, no operator license, failure to wear seat belt, improper registration, speeding and probation violation in 2009. Copyright 2014 WAVE 3 News. All rights reserved. ",
    "datetime": "2014-10-13T23:50:20Z",
    "url": "https://www.wave3.com/story/26774074/troopers-surround-house-where-fleeing-suspect-is-hiding/"
}