{
    "title": "Taking Masks Off to Go to Korean Wave Planet THE-K - PR Newswire APAC",
    "text": "Grand Opening of K-Culture Festival 2022 on September 30 SEOUL, South Korea, Oct. 3, 2022 /PRNewswire/ -- The K-Culture Festival 2022 got things started with 'K-Culture Festival Eve' on September 30, an evening party to celebrate the start of the festival. On this day, artists connected with their fans by introducing a wide range of Korean culture that goes beyond K-pop to K-Drama, K-food, K-beauty and K-fashion. The Ministry of Culture, Sports and Tourism (Minister PARK Bo Gyoon, MCST) together with the Korean Foundation for International Cultural Exchange (President JUNG Kil-hwa, KOFICE) will host the \"K-Culture Festival 2022\". K-Culture Festival 2022 Eve image At the opening ceremony slated for Gwanghwamun Square in Seoul on October 1, musical actors will perform a gala show by acting out the best scenes of famous Korean dramas like , ,  and  with an orchestra performance. Followed by the musical performance is a drama talk show with popular actors such as Hong Su ah and Seol Junghwan. THE-K DRAMA Concert, which includes the performances of singers KYUHYUN, Kim Nayoung, and Paul Kim will be next up to impress audiences with the theme songs from popular dramas, including , ,  and . The top K-pop artists will be performing throughout the whole event of K-Culture Festival 2022(Sept. 30 – Oct.8). Singers scheduled to perform include NCT DREAM, THE BOYZ, MONSTA X, IVE, OH MY GIRL, WJSN, WINNER and ZICO. On October 2 and 3, THE BOYZ and OH MY GIRL will be meeting their fans at the Jamsil Auxiliary Stadium. During this event called \"Talk & Stage,\" the two idol groups will perform on stage and spend time communicating with their fans. This will include answering to their fans' questions and playing games together. 'THE-K Concert' at Jamsil Main Olympic Stadium on October 7(Fri) marks the festival's highlight with BLANK2Y, CRAVITY, IVE, MCND, MONSTA X, NCT DREAM, STAYC, WINNER, WJSN and ZICO (listed in alphabetical order) delivering the essence of K-pop performances. MAX, a red-hot American singer-songwriter, will also perform on stage. 'THE-K Stage,' being held from October 2 to 8, has a lineup of diverse genres embracing K-POP, jazz, ballad, hip-hop, indie, and DJing. The K-Culture Festival 2022 pursues a festival made together by fans and artists of Korean culture. Visitors are sure to check out the 'Fandom Making Space' and the exhibition of award-winning makeup and stage costumes planned and decorated by fans from the 'K-Culture Challenge.' There will be exhibitions of various industries related to Korean culture, such as K-food, beauty, fashion, games, webtoons, handicrafts, K-pop goods, fandom platforms and streaming. More information about this festival are available on the official website (kculturefestival.kr). All performances, exhibitions and programs are free of charge. Second ticketing for 'THE-K Concert' will be open on October 4 through Interpark. Major events of the festival will be streamed live on the official website and YouTube channel of K-Culture Festival 2022. ",
    "datetime": null,
    "url": "https://en.prnasia.com/releases/apac/taking-masks-off-to-go-to-korean-wave-planet-the-k-377845.shtml"
}