{
    "title": "Targeting Today’s Sports Fan: WAVE.tv To Grow Content Library With $32M Series A",
    "text": "Sports media company WAVE.tv aims to grow its library of sports entertainment content and has closed a $32 million Series A round of funding, of both equity and debt, to create new programming. Subscribe to the Crunchbase Daily The round was led by CoVenture and GPS Partners with participation from existing investors Golden Ventures and Sweet Capital, as well as undisclosed new investors. The company did not disclose the ratio of equity to debt. Including the Series A, WAVE.tv has raised a total of $38.8 million since the company’s inception in 2017, co-founder and president, Ishaan Sutaria, told Crunchbase News. Previous investments included various seed rounds over the past three years totaling $6.8 million, according to Crunchbase data. WAVE.tv specializes in posting short bites–under three minutes–of content on platforms like Snapchat, Instagram, Facebook, TikTok and YouTube, and has generated 3.2 billion monthly views. Co-founder Brian Verne said in an interview that the last two years for the company have been about mastering programming formats and understanding the nuances of how to build the shows for 65 million subscribers and followers. “Sports highlights are becoming more important,” Verne said. “That has enabled us to go to the leagues and rights holders of 65 of them to see how we can reimagine their intellectual property into new hit programming.” The company plans to use the new capital infusion to grow the business in the areas of continued category and platform expansion, intellectual property and talent development, e-commerce, acquisitions and sports betting. Fandoms are big for the company, Sutaria said. As such, WAVE.tv has created a portfolio of media brands that cater to them with programming for specific sports genres. “We have about 18 fandoms right now and want to expand that,” he added. “We are also building quality sports content and revenue-adjacent opportunities such as sports betting, gaming and e-sports.” Since 2017, Sutaria and Verne have grown the team to 42 people. Sutaria expects to add at least 18 more by the end of the year. WAVE.tv became profitable in the latter half of 2019 and has doubled its revenue between 2019 and 2020, Sutaria said. “As we continue to build audiences and sign on rights partners, we will extend the classic sports sponsorship advertising opportunity so they can reach the same consumers, but do it for folks spending most of their time on digital,” he added. Photo: iStock Stay up to date with recent funding rounds, acquisitions, and more with the\r\n    Crunchbase Daily. From 2018 till the end of 2022, investors across the globe poured more than $50 billion in seed through growth financing into supply chain-related... San Francisco- and London-based Aiolos Bio, a newly launched startup with an asthma drug in clinical trials, announced that it raised $245 million in... While venture funding to cybersecurity startups is down 30% year to year, this week has already seen a handful of good-sized rounds going to U.S... Funding records show that financings around carbon removal themes have accelerated in recent quarters. We take a look at which startups are getting... Find the right companies, identify the right contacts, and connect with decision-makers with an all-in-one prospecting solution. Editorial Partners: Verizon Media Tech About Crunchbase News Crunchbase News Data Methodology Privacy Policy Terms of Service Cookie Settings Do Not Sell or Share My Personal Info CA Privacy Notice Company Careers Partners Blog Contact Us Crunchbase Pro Crunchbase Enterprise Crunchbase for Applications Customer Stories Pricing Featured Searches And Lists Knowledge Center Create A Profile Sales Intelligence Sales Prospecting Guide Sales Prospecting Tools © 2023 Crunchbase Inc. All Rights Reserved. ",
    "datetime": "2020-07-22T07:10:55-07:00",
    "url": "https://news.crunchbase.com/startups/targeting-todays-sports-fan-wave-tv-to-grow-content-library-with-32m-series-a/"
}