{
    "title": "Tasteful tourism: Lotte Duty Free lures Chinese with fusion of K-Food and K-Drama : The Moodie Davitt Report -The Moodie Davitt Report          ",
    "text": "SOUTH KOREA. Lotte Duty Free brought together the dual ‘Korean Wave’ (Hallyu) worlds of K-Stars and K-Food for a pioneering promotional campaign this month that targeted some of its most influential Chinese customers. The cultural event was designed to help promote Chinese tourism to Korea in the wake of a recent political deterioration between the two countries, linked to the THAAD anti-missile system dispute. Lotte Duty Free CEO Jang Seon-wook hosted the Korean Wave cultural event from 16 to 19 February, aimed at the retailer’s top Chinese VIP customers. Combining tourism, culture, dining and shopping, it was themed ‘A winter trip with Cha Seung-won and Lee Yeon-bok’. The retailer invited its so-called ‘big hand’ customers – all ranked in the top 5% of Lotte Duty Free’s most important shoppers – to Korea for the campaign, noting that “they are opinion leaders who have a strong influence on shopping and tourism culture in China”. The Chinese VIP customers participated in ‘The Talk & Cooking show’, conducted by model turned acting superstar Cha Seung-won, one of Lotte Duty Free’s glittering portfolio of K-Wave faces, and celebrity chef Lee Yeon-bok. The latter is a master of Chinese cuisine – there is a one-month waiting list for reservations at his restaurant Moklan, ‘Mulan’ in Chinese, in Seoul. The show was filmed during a skiing experience at Konjiam Resort in Gwangju, an hour from Seoul, during the VIPs’ stay in Korea. Lights, camera, (cooking) action: K-Drama and K-Food combined as acting star Cha Seung-won (centre) learns the art of Korean cuisine at the hands of MasterChef Lee Yeon-bok (right) During the show, chef Lee, aided by Cha presented Korean-style Chinese cuisine to the VIPs, followed by a tasting. After the show, Korean BBQ dishes, traditionally popular with foreign visitors, were served. Cha Seung-won himself is no novice at cooking. In 2014 and 2015 he appeared in the hit cable reality show Three Meals a Day, set on remote Manjae Island, where he earned the nickname ‘Chajumma because of his versatile cooking skills. Culinary and cultural fusion: Two stars of very different disciplines bring together their skills to underline K-Food’s role in attracting Chinese tourists Lotte Duty Free CEO Jang said: “This VIP invitation event has successfully combined K-Star and K-Food culture based on the brand influence of Lotte Duty Free Store mixed with Korean tourism content. “We will do our utmost to ensure Lotte Duty Free plays a breakthrough role in Korean inbound tourism by further promoting Hallyu marketing for Chinese tourists.” In a statement Lotte Duty Free said: “This event is a good opportunity to inform people about Korean food. Lotte Duty Free is actively promoting Korean food overseas and leading the Korean Wave culture by featuring K-Food marketing.” In 2016 Lotte Duty Free held a widely publicised ‘road show’ cooking demonstration in Shanghai, featuring bibimbap (a famed Korean dish based on mixed rice blended with a wide range of alternative ingredients). [Acting and cooking celebrities join forces in the kitchen in this film, which profiles MasterChef Lee Yeon-bok and underlines how K-Food is taking the Korean television market by storm] [Cha Seung-won starred in the hit cable reality show Three Meals a Day, which showed off his cooking skills] Follow The Moodie Davitt Report on Linkedin:  Share this article: ",
    "datetime": "2017-02-20T06:24:03+00:00",
    "url": "https://www.moodiedavittreport.com/tasteful-tourism-lotte-duty-free-lures-chinese-with-fusion-of-k-food-and-k-drama/"
}