{
    "title": "The Vegetarian 'represents a change' – DW – 05/19/2016",
    "text": "In an interview with DW, literary agent Barbara Zitwer discusses Korean literature and its global appeal after the success of Han Kang's \"The Vegetarian,\" which recently won the 2016 Man Booker International Prize. Seoul-based novelist Han Kang and English translator Deborah Smith won the 2016 Man Booker International Prize for fiction with \"The Vegetarian,\" a symbolic novel that touches on modern day South Korea and its expectations of a woman's behavior, shown through the book's heroine, Yeong Hye, and her chilling detachment from meat and ordinary life. The pair shared a 50,000 British pound (65,000-euro) award, and beat out other novelists such as Angolan writer Jose Eduardo Agualusa, Austrian writer Robert Seethaler, Chinese author Yan Lianke, Turkish Nobel Laureate Orhan Pamuk and Italian author Elena Ferrante. The three-act story, each narrated by a different character, is first told by Yeong Hye's dramatic husband, Mr. Cheong, who opens with a description of his wife as \"completely unremarkable in every way.\" The second section is told from Yeong Hye's artistic brother-in-law, who becomes unselfishly obsessed with Yeong Hye's body as she forbids herself to eat meat and desires to shed her skin, taking on a tree-like state of being. The third act is told by her sister In Hye, who is married with the artistic narrator of act two and is left dealing with the collapse of the family. DW interviewed Han Kang's New York-based international literary agent Barbara Zitwer about \"The Vegetarian\" and the rise of the Korean literature market around the world. DW: Why do you think \"The Vegetarian\" won the 2016 Man Booker International Prize for fiction? The book won the award because it was the right book at the right time. It's very daring, brilliant and unusually appealing even for Koreans. It's universal and captures the imagination, and the heroine's struggle is a theme that many people, not just women, can relate with. Also, another aspect of the book that gathers your attention is veganism. Han Kang used the theme of veganism as a way to rebel, as Korea can be identified as a meat-loving country. Though, in my opinion, I thought her book was the least likely to win. There were a lot of well-known authors competing for the award, and Han Kang and her book, while still known, were not yet household names before the award was announced. But she deserved it. Also, Deborah Smith was a vital partner for Han Kang. Her translation was excellent, especially after only learning Korean in a few short years. In fact, the translation was the final push that convinced UK-based Portobello Books to publish the book. Han Kang's partnership with Smith really helped propel her publication for the English language world. Could the award-winning book inspire more Korean writers to get published around the world? It could certainly encourage them. Global publishers are now more willing to buy Korean books, and that wasn't always the case. Plus, the Korean government has done a lot to promote their writers, many of whom are poets, and will continue to support them where they can. It's an exciting time for Korean writers and for fans of literature. The Korean government has successfuly pushed its culture around the world through \"hallyu,\" a term meaning \"Korean wave.\" The music genre of K-Pop is very successful. Korean drama is also well known. Why has it taken so long for the international audience to embrace Korean literature? Things take time. It takes time for the world to embrace culture foreign to them, and Korean literature was certainly considered foreign for many years. There was a lack of connection between writers and publishers willing to put their name on the line for a book that may not be liked or easily sold. However, this award represents a change. Also, Korean men mostly dominated the country's literary market. But that too is changing. During the past few years, Korean women writers have started to emerge: Kyung Sook Shin won the Man Asian Literary Prize in 2011 for her book \"Please look after mom,\" and Sun Mi Hwang's \"The hen who dreamed she could fly\" sold more than two million copies worldwide after it was published in 2013. These writers and Han Kang really pushed the Korean literary market onto the global stage. Maybe those books and Han Kang's success might usher in a woman's literary movement. As I like to say, it takes a global village to create a global sensation. Do you think there's a resounding theme in Korean literature that's starting to appear based on the success from these women writers? It's quite possible. As women become more liberated in Korea, they are more able to write about their experiences. The previous success by those Korean women writers are examples of a literary movement in South Korea, and Han Kang is certainly a part of that. Han Kang tells the story of a woman who is marginalized and subjugated by her husband and family, herself and even the world. That's a theme many people, and like I said before - not just women - can really get behind and support. It's a major reason the book has received so much success. Barbara Zitwer is Han Kang's international literary agent based in New York, the United States. The interview was conducted by Shay Meinecke. ",
    "datetime": null,
    "url": "https://www.dw.com/en/korean-writer-han-kangs-success-represents-a-change/a-19267757"
}