{
    "title": "\n\tThe rising Korean wave in India - The Hindu\n",
    "text": "To enjoy additional benefits CONNECT WITH US April 20, 2021 11:50 am | Updated April 21, 2021 12:34 pm IST COMMents SHARE READ LATER Hallyu, or the Korean wave, has been around for a while now (since the 1990s), but with increased penetration of the Internet and streaming services in India, and now the pandemic giving people more time to explore foreign cultures and content, it has seen a boom like never before. Join the Korea Tourism Organization India and The Hindu in an online discussion on the rising Korean wave in India — from K-Beauty, K-Drama and K-Pop, to Korean food and more — and how it will influence post-pandemic travel to South Korea. Register here  Meet the panellists: Moderator Rathi Jafer Director, InKo Centre Jafer is on a mission to encourage a vibrant intercultural dialogue between India and Korea. For the last 15 years, she has been heading the Indo-Korean Cultural and Information Centre (InKo) in Chennai, where corporate support meaningfully sustains the promotion of arts and culture between India and Korea. She has curated exhibitions, music concerts, film festivals, has initiated and presented theatre collaborations, literature residencies, as well as promoted Korean language courses in partnership with key partners in Korea and India. The long-standing Indo-Korean Ceramic Residency is one of her many success stories. In 2020, Jafer’s contribution was recognised by Korea’s Ministry of Foreign Affairs, who awarded her a Certificate of Merit for her dedicated assistance to developing Indo-Korean relations. She also received a citation by the Prime Minister of Korea for outstanding contribution to the development of Hangul through research and dissemination of the Korean language.  Chinmayi Sripada Singer, voice actor The playback singer — who rose to fame in 2002 with the song ‘\nOru Deivam Thantha Poove ’ from the National Award-winning movie\nKannathil Muthamittal — is frequently looked up on social media for a completely unrelated topic: K-Beauty. Sripada joined the ranks of those who try ginseng, snail slime and seaweed in their skin care routine much before the K-Beauty boom hit. Her YouTube videos and Instagram workshops are very popular. And her e-store, Isle of Skin, retails Korean products personally curated by her (which either she or her friends have tried). Register here  Scherezade Shroff Fashion, beauty, travel and lifestyle content creator One of the early YouTubers of India, Shroff is known for her vivacious energy and her “from the heart'' content. With three channels, over 3,00,000 subscribers and 50 million views, the former model discusses food, travel, beauty and anything that tickles her creative buds. Over the pandemic, she got hooked to K-Drama (and spent most nights binge watching innumerable shows). Today, she has a following on Instagram for her K-Drama reels and, on Facebook, her recently launched Sherry’s K-Drama Club already has over 7,500 members. Now she’s looking forward to planning her third trip to Seoul, once travel is back on the cards.  Vikramjit Roy Chef and co-founder of A Sirius Hospitality Currently busy with growing Hello Panda, a delivery-only service that offers gourmet cuisine (which he co-founded in the midst of the pandemic), chef Roy says kimchi fried rice or\nbokkeumbap is a restaurant favourite, as are spicy Korean rice cakes,\ntteokbokki . He has several ‘Chef of the Year’ wins under his belt, including from Hotelier India and the Delhi Gourmet Club. With 18 years of experience and a deep appreciation of Asian cuisine, he has been instrumental in the pre-opening of several award-winning restaurants, including Wasabi by Morimoto for Taj Hotels. A trip to Seoul in 2019, where he sampled everything from the ubiquitous kimchi and\nbibimbap to temple food at the acclaimed Gosang restaurant, has made him a fan of the cuisine. Register here  Young-Geul Choi Director, Korea Tourism Organization India Young-Geul Choi started his term in India in November 2019 and has been responsible for all the innovations KTO has brought in during the pandemic travel lockdown to keep their customers engaged and the interest in South Korea alive. Previously he was extensively involved in tourism infrastructure projects. Under his leadership, KTO is focussing on digital and influencer marketing and laying the foundations for a post pandemic travel boom in 2022.  Sandeep Dutta Marketing Manager, Korea Tourism Organization India Dutta is a travel industry professional with over 14 years of diversified experience in operations, sales and marketing, especially International Destination Marketing. He has been associated with KTO as the Marketing Manager for India and neighboring countries since 2014. Dutta enjoys travelling, be it for work or pleasure, and shares a keen interest in subjects of international geo-politics and technology. COMMents SHARE The Hindu Weekend BACK TO TOP Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. ",
    "datetime": "2021-04-20T06:20:39.000Z",
    "url": "https://www.thehindu.com/life-and-style/travel/the-rising-korean-wave-in-india/article34364824.ece"
}