{
    "title": "The Dark Side of K-Pop – The Diplomat",
    "text": "Read The Diplomat, Know The Asia-Pacific Beneath the glittering surface image of K-pop idols lies the Dorian Grey-like heart of an industry that abuses and discards its trainees and stars. Members of South Korean girl group Loona pose as they arrives on the red carpet of the 2018 Mnet Asian Music Awards (MAMA) in Seoul, South Korea, Monday, Dec. 10, 2018. Soft power, or the power of cultural attraction and influence, is a dangerous and complicated tool to wield. After the People’s Republic of China proudly embraced “wolf warrior” nationalism based on a movie, others began to use the term as a pejorative to refer to overly combative diplomats. Extending action hero-level feats to bureaucrats controlled by the state traffics in myth making. Hallyu, or the K-Wave, is at the forefront of a revolution in soft power yet this, too, is open to reversal if it does not solve internal problems before continuing to extend outward. While the K-Wave draws attention to South Korea and offers a global position of cultural influence, this attention does come tinted with tragedy. Mistreatment, suicide, slave labor contracts, grueling training schedules, “no dating” clauses, sexual assault, and sexualization of minors by K-pop agencies cannot go unnoticed. While some groups promote the image of being antifragile, the entire K-pop industry rests on fragile foundations. In the pages of The Diplomat earlier this year, Gi-Wook Shin, Haley M. Gordon, and Maleah Webster argued it is time for the K-pop stars to leverage their influence to speak out on human rights. The sad fact is that the industry itself must look inward before it can project a positive global influence. Get briefed on the story of the week, and developing stories to watch across the Asia-Pacific. BTS’ Jungkook drew unfortunate attention to the industry by performing during the opening ceremony of the Qatar World Cup, itself a human rights disaster highlighted by, amongst others, the ongoing repression of players who want to use their right to stand for LGBTQ+ rights. By sending their artist to the Al Bayt stadium – where the Kafala system has made bonded laborers of migrant workers – Jungkook’s agency Hybe Corporation did not do its due diligence. The agency has the responsibility to respect human rights through its business relationships under the United Nations Guiding Principles on Business and Human Rights. This is all the more striking for an agency that promoted the motto “music for healing.” Enjoying this article? Click here to subscribe for full access. Scandals are frequent in K-pop, with this last month alone witnessing popular artist Lee Seung-gi discovering his agency Hook Entertainment withheld all profits for digital streams and downloads of his songs over a 20 year period. Omega X, a boy band made of 11 second-chance stars, was recorded receiving a violent dressing down by management. It was later charged that the agency made the group perform while testing positive for COVID-19 and sought to engage the boys in drinking events with accusations of sexual harassment leveled. The members of Omega X sued for emancipation. In another recent incident, a popular member of the girl group Loona, Chuu (Kim Ji-woo), reportedly sued her agency BlockBerry Creative for contract adjustments after receiving little remuneration for likely excessive work. The agency instead dropped her from the group for unspecified abuses of power. In a show of support, rather than excluding Chuu from commercial opportunities, the entire industry seemingly lined up behind the popular figure, expressing love and support for the idol. Loona’s time as a group might be over after nine other members sought to dissolve their contract for breach of trust, ostensibly for its treatment of Chuu and failure to distribute profits. This might be the first time a fandom has openly celebrated the dissolution of a group. These actions might provide visibility to the many starry-eyed trainees who must pay back years of development fees in the K-pop system. One agency even tried to sue a former contestant for production fees for a reality show that they were eliminated from. Beneath the surface image of K-pop idols lies the Dorian Grey-like heart of an industry that abuses and discards its trainees and stars. A system with absolute power over the artist cannot endure as a positive global influence. Soft power is often paired with compulsion. Rabid K-pop fandoms are built on pathological dedication. The industry only sees profit in extending its influence on the Middle East, China, or even North America, ignoring the warnings. The fainting idols forced to perform in the altitude of Mexico City with little preparation are more than warning signs; they are the effects of the disease. South Korea has to step up its game and ensure that K-pop agencies respect human rights by legal means. For more than two decades, South Korea has been actively supporting its entertainment industry as an engine of “soft power” and economic growth. Yet, when it comes to its duty to protect human rights, it has failed to deliver. The memes have begun. Omega X and Loona are leading a revolution seeking to give agency to the workers. The positive hype for the music must be paired with respectable treatment of the musicians and aspirants working in the industry otherwise the house of cards will collapse. As the feminist collective Twice would say, talk the talk. Brandon Valeriano Brandon Valeriano is an international affairs specialist with a focus on cyber security and popular culture. He is a committed Orbit (Loona fan) according to Spotify’s year end wrap but is hoping Bibi can be the standard bearer for K-pop into the future. Aleydis Nissen is a specialist in business and human rights issues and South Korean trade. She loved listening to \"Epik High is Here 下 (Part 2)\" this year.          ",
    "datetime": null,
    "url": "https://thediplomat.com/2022/12/the-dark-side-of-k-pop/"
}