{
    "title": "The Cornish musician writing songs for K-pop mega-band BTS - BBC News",
    "text": "A musician from Cornwall said writing hit songs for K-pop mega-band BTS was \"about as random as it sounds\". Marcus McCoan lives in St Austell - a former china clay mining town of about 25,000 people near the south Cornwall coast. Two songs written by him have featured on albums by South Korean boy band BTS, one of the biggest artists in the world with more than 50 million followers on Instagram. He said: \"Obviously I'm happy with it.\" BTS have had a string of global hits and in September the band opened a general debate at the United Nations headquarters in New York with a pre-recorded performance and speech. Mr McCoan, 31, explained how the unlikely connection started after doing some session work for other artists, alongside working on his own songs. A contact of his, James F Reynolds, who had worked with BTS before, gave him an unexpected call on New Years Eve. Mr McCoan said: \"They gave a 48-hour deadline and we had to come up with a lot of song and production ideas in that time. I think we landed on about 10 in total. \"I rang my friend and close collaborator Bad Milk who had also received the brief from his management, so we decided we should travel overnight and meet in London. \"We then stayed up for two days and wrote a load of songs, with some remote help from some other producers called Arcades - we had a lot of coffee.\" The songs were submitted, and one from the batch was chosen - and not the one he had thought most likely. \"They picked the one I thought was the weakest, even though I still really like it. I guess I couldn't hear what was good or bad anymore after no sleep. \"It was the one we did last, at the end of our 48-hour stint we did it in about two hours and we almost didn't send it. And that meant I could keep my favourite one from the batch for myself. \"We also found out that they had been debating the use of another track from a couple of months before - a song I had written with Arcades and Ryan Lawrie called Nervous. \"BTS accepted it, so we helped finish the production and it went on to be known as Mikrokosmos on their album.\" Mr McCoan now plans to release the song that was his favourite from the batch, and his own album next year. BTS have worked with a network of writers around the world, as well as writing their own material. \"The fans are the most supportive group of fans I've ever seen, because they make sure they find everyone who is credited on the album and they tweet the hell out of it,\" said Mr McCoan. \"So if you are on the credits for a BTS track and you tweet just as the album is coming out you get like 30,000 retweets within about five minutes. \"They know lots of people around the world are writing for their favourite band and they are fine with it. \"There is a lot of credit that goes out to song writers that didn't in the past. For someone trying to make an artistic career like myself it is handy.\" When the call comes from BTS, the brief can involve some examples of what they are looking for, and a general sense of style they are seeking. \"One of the briefs we got was, all they said was they wanted the song to have the energy of the full moon, which made me laugh, so we wrote a song that felt pretty lunar,\" Mr McCoan said. The two songs BTS have taken were a slow ballad called Jamais Vu and the bigger, more poppy single, Mikrokosmos. In 2019, as part of a world tour, BTS sold out two successive nights at Wembley Stadium, and Mr McCoan was in the crowd. \"It blew my mind. They saved our song for the closing song which was huge with a massive light show - they played it for about 12 minutes over and over. That one actually has some of my vocals in it so that was pretty exciting to hear.\" Payment comes in the form of royalties dependent on performances and sales which Mr McCoan said has \"been nice, and allowed me to call music a career\". He keeps in touch with the band and their management and continues to work on ideas with them - he has also worked on some of the solo projects of the band members. \"It's just crazy I still can't get my head around it,\" he said. Mr McCoan grew up in Cornwall and moved to London in his 20s for about two years but returned at the start of the pandemic and has not looked back. He said: \"Moving back to Cornwall has made me focus on my own thing. \"Even though the BTS stuff is cool, fun and definitely a journey in itself, sometimes being in London it was really hard to steer away from it. It is not my end goal. \"My end goal is to concentrate on my own artistic career, I love making music videos and I love gigging and touring. This has been really cool to get me off the ground.\" Follow BBC News South West on Twitter, Facebook and Instagram. Send your story ideas to spotlight@bbc.co.uk Korean boyband BTS perform at UN general debate How to show your devotion to the 'K-wave' BTS - from chart success to stock market gold? The BTS fans investing in their favourite K-pop band 'No words, just tears' as BTS tops Billboard How did BTS become so successful? 'I trained as a K-pop idol - here's why I quit' K-pop star What do non-Koreans love about K-pop? Historic village kicks up a stink over smelly sewage fears Saltash's WH Bond boss took part in the Padstow to Rock swim for charity Cornish mum whose son was saved by a defibrillator says everyone should feel confident using one Halloween: Dare to trick-or-treat at one of Cornwall's most historic castles? Garage by the sea in St Ives now for sale for £43,000 Lonely Planet snubs Cornwall in favour of Wales in 'best' travel list Hundreds of police search for Maine gunman as 16 feared dead Israeli tanks cross into Gaza for 'targeted raid' Humanity blasted and broken: Gaza through a medic's eyes Seoul crush: Survivors still tormented a year on The unending pain of India's sewer workers Bowen: Israelis and Palestinians fear worst is yet to come How two 4-year-olds were killed and social media denied it How one of gaming's lost sequels finally got made The chaotic search for Speaker... in 120 seconds. VideoThe chaotic search for Speaker... in 120 seconds Russia goes back to prisons to feed its war machine The dark side of touch-screen tipping Humanity blasted and broken: Gaza through a medic's eyes The town telling influencers to stay away What if a rogue nation dimmed the Sun? Why so many veterinarians suffer © 2023 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking. ",
    "datetime": null,
    "url": "https://www.bbc.com/news/uk-england-cornwall-58955819"
}