{
    "title": "  The ‘Korean Wave’: pop culture and tourism - The Boar",
    "text": "Popular culture often plays an important role in the fuelling of travel because it draws our attention to particular places that we might not otherwise come across. When something starts trending, it leads people to wonder what it is that’s so appealing and they want to find out more for themselves. No-one wants to miss out, therefore when a destination is positively presented in popular culture, people often want to visit. South Korea is an example of a place that draws lots of tourists, as a result of popular culture, specifically Korean pop music (K-pop) and Korean dramas (K-dramas). The popularity of Korean culture has been labelled as the ‘Korean Wave’, with countries in Asia being especially influenced by it. However, Korean culture is becoming increasingly popular in the West too- demonstrated by the growing popularity of Korean restaurants, as an example. I think Korean dramas really encourage people to go to South Korea for several reasons. Firstly, many of them are incredibly aesthetic with beautiful scenes that make you want to see the places in person. Lots of viewers then try to recreate iconic scenes. For example, people have tried to recreate a scene from Guardian: The Lonely and Great God, (otherwise known as Goblin), at Jumunjin Beach. I think South Korean culture draws a lot of interest in the West because it is so different to Western culture Historical dramas inspire people to visit the old palaces in Korea and try on hanboks, (traditional Korean dresses). Meanwhile, modern day dramas present a romanticised view of everyday life in South Korea, with cute cafes and cosy apartments. My First First Love is an example of a drama where every scene, whether it was interior or exterior, was very aesthetically pleasing. Another reason why K-dramas encourage people to go to South Korea is that they introduce viewers to Korean culture. For example, I’ve found that even when food isn’t the focus of the drama, it still features a lot and personally makes me really want to go and have Korean food. Two things that frequently appear and make me really want to go to South Korea is Korean fried chicken and tteokbokki, which are stir-fried rice cakes. Korean fashion is another example of popular culture that draws people to visit South Korea. K-dramas and K-pop help to promote Korean fashion, with many actors and K-pop idols being regarded as style icons. This makes people want to travel to South Korea for shopping. The high beauty standard in Korean dramas and K-pop also promotes Korean beauty products, which is another motivator for people to visit South Korea. South Korea is often high on a K-pop fans’ bucket list because there are lots of K-pop related tourist spots there. For example, previously, fans of the K-pop group Blackpink could visit Blackpink House in Hongdae, where the group had stayed to film a reality TV show. There is also K-Star road in Gangnam, where fans can take photos with bear sculptures that have the logos of famous K-pop groups printed on them. If something motivates you to travel to another country and find out more about another culture, I think it is a positive thing I think South Korean culture draws a lot of interest in the West because it is so different to Western culture. For example, if we look at K-pop, there is generally a big focus on the visual aspect, such as the dance choreography – not to say that the quality of the actual music is compromised. In contrast, the Western music industry tends not to accord the same level of importance to the visual aspect. Of course, Korean culture in general is also incredibly rich and interesting. Personally, I don’t think it’s a problem to visit South Korea because you enjoy Korean dramas or K-pop, as it is just the way that you have been inspired to explore a culture. If something motivates you to travel to another country and find out more about another culture, I think it is a positive thing. However, it can be a problem when you expect what you see in dramas and K-pop to be reflective of reality. For example, people often joke that Korean dramas can lead to unrealistic standards towards relationships. Similarly, we should realise that not everyone in Korea is going to be as beautiful as the actors and idols we see. As long as we do not see popular culture as representative of reality, then I don’t think it is a problem to visit a country because you enjoy the media it produces. The most important thing is that we remain open-minded when visiting any country and respectful of the place and its people. Your email address will not be published. Required fields are marked * Comment * Name * Email * Website   Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. © 2023 Copyright The Boar. Powered by\t\t\t\tTom, Hamish & Aaron. ",
    "datetime": null,
    "url": "https://theboar.org/2020/06/the-korean-wave/"
}