{
    "title": "The Moodie K-Blog: How Kap Lee intends to create ‘lifetime value’ at Lotte Duty Free : The Moodie Davitt Report -The Moodie Davitt Report          ",
    "text": " WEDNESDAY 12 MARCH Martin Moodie meets new Lotte Duty Free CEO Kap Lee at company headquarters in Myeong-dong, Seoul on Tuesday. Lotte Duty Free’s flagship store in Myeong-dong, Seoul is the epicenter of Korean travel retail. What happens here in many ways shapes the whole sector, particularly in terms of new product development and identifying what’s hot and, less often, what’s not.  This store has been both a local and international springboard, in fact a commercial trampoline, for so many brands (and sometimes whole categories) that it warrants a case study all of its own.  Many duty free executives from around the world come here just to view what amounts to a vast, throbbing human laboratory. Lotte Duty Free’s advantage is that it monitors that laboratory each and every day, giving it a unique insight into what’s hot among Chinese consumers. Remember, all of those daigou traders that shuttle in and out of this store every day know precisely what they want, buying to fulfil demand from all over the vast Chinese nation. [Click on the Podcast icon to hear Martin Moodie getting up close and personal with hundreds of daigou shoppers outside Lotte Duty Free in Myeong-dong, Seoul] Hundreds of daigou traders queue up outside Lotte Duty Free every morning awaiting opening time. And what a laboratory it is. This is a near US$4 billion business remember. What an astonishing number. One that has grown from just under US$3 billion in a year and which is projected to stretch over US$5 billion this year. Recently Lotte opened a dedicated zone, nicely dubbed an “incubation” area by store Director Steve Park, to introduce new and untried brands (mainly from small & medium enterprises). Several of these will go on to secure places in the main beauty, accessory or wellbeing departments. That concept is typical of Lotte’s ability to search out and then champion emergent brands (especially Korean SME products), some of which go on to become blockbusters. Lotte Duty Free Director of the Myeong-dong store Steve Park has led extraordinary top-line growth over recent years. He is confident of a further 30% lift this year. Blooming Beauty: A nice tagline for Lotte Duty Free’s ‘incubation zone’. Korean lifestyle fashion brands such as MLB and Fila are generating extraordinary levels of business. Yesterday I had the honour of conducting the first interview with new Lotte Duty Free CEO Kap Lee. The former CEO of Lotte’s Daehong Communications business (he has been with Lotte for 32 years) has a precise, well-articulated vision of where he wants to take the travel retailer. His top priority, he told me, is to create a “differentiated strategy” for Lotte within a Korean duty free industry structure that he admits is “not healthy”. Refreshingly, he does not hide from the fact that currently Lotte is “in the daigou business” (if you doubted it simply take a look at the 500-600-strong queue of daigou outside the flagship store every morning) but he is looking beyond that. Kap Lee told me that Lotte Duty Free is moving towards a much more differentiated and personalised strategy. He plans to focus on a more personalised marketing strategy (Lotte Duty Free currently has 6.9 million database members, a number that is slated to grow to 7.8 million this year), an especially important factor if, as expected, a more traditional Chinese tourism and shopping base is restored later this year as relationships between the two nations thaw (Chinese leader Xi Jinping is expected to visit South Korea this year). Like so many travel retailers, Lotte has been chastened by its airport bidding experience. In 2018 it pulled out of much of its Incheon International Airport Terminal 1 business after posting a colossal KW192.5 billion (US$182.2 million) operating loss for its Incheon and Seoul Gimpo airport operations. Consider this statistic for a moment – In 2017, Lotte’s sales at Incheon International Airport sales reached KW1.1 trillion (just over US$1 billion) but concession fees reached KRW580 billion, over half of sales. That’s before any other costs, remember. While most observers believe that Lotte would now like to boost its Incheon presence (its partial exit might have benefited the bottom line but also meant a big loss of market share), such a return will not be at any cost. Kap Lee isn’t interested in entering into any more ruinous airport contracts. As you will read in my fascinating interview, the company is likely to be highly selective about its targets, focusing on locations where it can be the sole operator, paying sensible fees and creating a win/win/win for airport, retailer and consumers alike. On his business card, Lotte Duty Free’s motto reads, ‘Lifetime Value Creator’. That sums up the Kap Lee vision nicely. This year he expects his business to grow by around 30%, buoyed in the short term at least by a continued boom in daigou trading. But it’s the long-term value he is really focused on. [Look out for the full, fascinating interview with Kap Lee in coming days] Daigou traders queue up to buy Philip Morris International’s IQOS ‘heat not burn’ tobacco device and sticks, reflecting burgeoning demand in China. TUESDAY, 11 MARCH Days may be cloudy or sunny\nWe’re in or we are out of the money, yeah\nBut I’m with you always\nI’m with you rain or shine – Ray Charles, Come Rain or Come Shine It’s a bitterly cold morning in Seoul, about 6 °C, though it feels much colder. I’m standing outside Star Avenue, the Hallyu (Korean Wave) marketing entrance to Lotte Duty Free’s flagship store in Myeong-dong, Seoul. And I am not alone.  This is the most popular duty free store in the world’s biggest duty free market. Sales last year climbed by a remarkable 37% to an all-time high of over US$3.8 billion. Some 88% of sales were to foreign customers, most of them Chinese, led by daigou shoppers who have so dominated the Korean duty free business over the past two years since the THAAD anti-missile system row broke out between China and South Korea in March 2017. As I noted in yesterday’s Blog, Korean travel retailers and their suppliers are anxiously monitoring the impact of China’s new e-commerce law, introduced on 1 January, which is in part designed to crack down on the daigou trade. But if the tap is being turned off, there’s little sign of it here. It’s a full hour before the Lotte Duty Free store opens and already a snake-like queue of around 400-500 Chinese daigou traders are queued up alongside the side of Lotte Department store and around the corner onto Namdaemum-ro. If you add in another 100, perhaps more, already, in the pre-booked Star Avenue express lane waiting area, that’s around 600 ‘shuttle traders’ as they’re often called here, waiting to burst through the Lotte Duty Free doors and buy huge volumes of Korean and international beauty products, as well as a wide range of Korean fashion and accessories and certain international luxury and premium branded goods.   To any outsider, it’s a remarkable scene but to industry insiders here it’s just another day in Korean duty free. Similar scenes will be being played out outside Lotte’s rivals as the daigou shoppers queue up early to ensure they can procure the items most in demand in China. The daigou phenomenon has rewritten the rules of engagement here. Brands’ long-held selective distribution principles have been scattered in the Korean winds – there’s certainly nothing selective about what amounts to a mass redistribution market, a little China of duty free. But the vast amounts of money at stake have simply convinced most beauty brands at least to turn a blind eye. Are those winds about to turn even icier though than on this cool Seoul morning? Yesterday I met the investor relations team at prominent Korean beauty house AmorePacific (at the group’s stunning new headquarters pictured below), for whom Korean duty free accounts for around 40% of sales and over 20% of operating margin. The company was one of the few to restrict daigou purchases, a decision that came at considerable cost last year.   For AmorePacific, and especially its flagship brand Sulwhasoo, 2019 has started well enough (though a little slower than its competitors such as LG) and there is no sign yet of any major dent in the daigou business. The sight outside Lotte Duty Free this morning would seem to confirm that, but there is a distinct sense of unease here that things could change fast.\n***** “Agility, challenge, teamwork,” reads The Shilla Duty Free’s motto behind Ingyu Han. I had the pleasure yesterday of interviewing The Shilla Duty Free President of Travel Retail Division Ingyu Han at company headquarters near the flagship store in Seoul. Sales here reached a record US$2.6 billion last year, up 40% year-on-year, with about 82% of them generated by foreigners, principally Chinese (many of them daigou). The place was jam-packed during my visit at just after 2p.m. with Korean beauty brands (particularly LG’s The History of Whoo and AmorePacific’s Sulwhasoo) and fashion products such as Gentle Monster sunglasses drawing huge crowds. The same applied for international beauty brands such as Estée Lauder, Chanel, Dior, YSL, Shiseido and Lancôme.  Mr Han has played a key role in the company’s growing internationalism, which now embraces blue-chip airport contracts in Hong Kong, Singapore and Macau as well as its Korean downtown and airport strongholds. Look out for my major interview with him over coming weeks. It’s a refreshingly candid take on the challenges and opportunities facing Korean travel retail. He believes that 2019 will be a good year for the company, but one marked by volatility. “There will be rain, there will be shine.” As always with travel retail, the mix will be vital. SUNDAY, 9 MARCH Thirty years on from my first visit here, I’m back at Lotte Hotel in Myeong-dong, Seoul, preparing for a week of interviews and store and airport visits. In recent years I’ve tended to stay at the Grand Hyatt but this time I opted to return for reasons of convenience to my old haunt at the Lotte Hotel. It’s handy to be able to simply wander out of the hotel, turn right, wander a few metres and walk into Lotte Duty Free’s Star Avenue, the pioneering Hallyu (Korean wave) marketing concept that proved the trailblazer for so many exhilarating campaigns that have followed since.    You know that you’ve entered a duty free heartland almost from the moment you land at Incheon International Airport. Big signs promoting Lotte Duty Free loom over the arrivals baggage zone. Doota Duty Free flyers are given out when you buy a bus ticket to the city hotels. Every seatback on the buses carries a Korean Air SkyShop magazine (featuring, I am pleased to say, The Moodie Davitt Report logo on the front cover).   Back in 1989, I was a raw recruit to both travel retail and Korean culture. I remember wandering the streets wide-eyed, bedazzled and beguiled by the sights, smells and colours of the Seoul streets. The downtown duty free industry, which had only begun nine years earlier with the opening of Lotte Duty Free’s store next door to the hotel, was still in its infancy, driven almost entirely by a mix of Korean and Japanese customers. Chinese visitors were not even on the horizon. But already, the duty free sector had won a reputation for innovation, blue-chip brand dominance and intense competitiveness between Korean customers.  Three decades on, the Seoul streets remain a feast of the senses. But while the duty free trade is still synonymous with those traits I mentioned, it’s now a very different market landscape. Where once the Japanese dominated the international spend, now it’s all about the Chinese – worth well over 70% of total sales for most duty free retailers. Much of that revenue since March 2017 (the beginning of the THAAD row with China) has been driven by daigou trade, the phenomenon of Chinese shuttle traders as they like to call them here, buying Korean and international brands (particularly beauty products) in vast quantities, repacking them (and turning Incheon International Airport into a near rubbish-tip in places) for onboard storage and then reselling them in China. The question on everyone’s lips here – and internationally – is how much China’s new e-commerce law introduced on 1 January (in large, designed to curb if not eradicate daigou trade worldwide) will affect Korean duty free. No-one – neither retailers, brands nor analysts – really knows the answer yet. Most brands have shown growth in  Korean duty free during the first two months of 2019, but some fashion and accessory houses have posted sharp year-on-year drops. Everyone is monitoring the situation here closely, while watching to see exactly how judiciously Chinese customs officials police travellers returning from South Korea and Japan. One of the other big concerns here is an expected further proliferation of duty free licences as the government seeks to slice up what it perceives to be a fast-expanding cake into more pieces. But this is not about baking a cake. In fact, the whole idea is half-baked. One of the many problems with such policies, as with a similar flurry of licence additions in 2015/16, is that they are based on the distinctly shaky premise that the market will continue to grow, while encouraging cut-throat competition among established and emergent retailers. The Moodie Davitt Report has spoken out repeatedly, including at a Korean National Assembly hearing in February 2016, against the short-sightedness of such an approach. Developing a taste for duty free shopping: The word ‘Yummy’ (a reference to something delicious in English) is embodied in Korean and draws on the acronym for Lotte Duty Free, LDF. Historical context helps here. It’s all too reminiscent of the then-booming but Japanese-dominated Korean duty free market of 1984-1988. In that period Japanese arrivals rose by +94%, earning the duty free industry the sobriquet of ‘the goose that lays the golden eggs’.  A proliferation of licences led to 29 stores being opened, far in excess of necessary capacity. When the Japanese bubble economy burst in 1990, many shops were forced to close as tourist arrivals and spending slumped. The golden egg had cracked. In an interview with Seoul’s highly influential Chosun Daily in January 2017, I noted: “The proliferation of duty free licences in Korea was based on the perception that it is an industry full of easy and rich pickings. The reality is that excessive competition in the market has simply driven up the cost of business (especially with tour agency commissions) and left too many players fighting over a pot that is frighteningly vulnerable to a downturn in Chinese tourism.” I was proven right, though at top-line level the Korean duty free trade grew strongly last year (+35%), driven by the frenzied level of daigou trading. Now, just as the Chinese government is seeking to crack down on, perhaps eliminate, daigou trading, there is the likelihood of more duty free licences here. Really? If that happens, Korea’s duty free chickens will have come home to roost. But they won’t be laying any golden eggs. Note: The Moodie Blog is the world’s leading travel retail Blog. Written by Martin Moodie with occasional contributions from Dermot Davitt, it offers a different, more personalised take on the travel retail universe. All Blog entries dating back to 2006, can be found here. The Moodie Blog is brought to you in association with Victorinox. Marry geographic proximity to a huge price disparity between Korean duty free and the Chinese domestic market and you have the daigou phenomenon explained in an instant. Incheon International Airport: Plenty of Chinese arrivals but the big question is how much daigou-purchased duty free will be carried on the return flights this year? Follow The Moodie Davitt Report on Linkedin:  Share this article: ",
    "datetime": "2019-03-13T21:58:19+00:00",
    "url": "https://www.moodiedavittreport.com/the-moodie-k-blog-how-kap-lee-intends-to-create-lifetime-value-at-lotte-duty-free/"
}