{
    "title": "The Korean wave",
    "text": "K-pop is spreading its wings across Delhi as it talks about life’s challenges, never giving up and elevates you with foot-tapping beats. By Sakshi Sharma\nWho is the singer with the maximum fan following? Taylor Swift? Beyoncé? Or is it Justin Bieber? Well, the answer is Exo, a nine-member boy band formed in 2012, who have been called by some “the kings of K-Pop” or Korean pop. Does the very idea leave you flabbergasted? Then just look at the figures. In 2018 Swift, with her 85 million followers, averaged around 91,000 Twitter mentions per week. Beyoncé saw almost three times as many weekly mentions as other artists with similar reach. Bieber saw close to 390,000 hits. But Exo, which averaged 24 million, and another Korean band called BTS, which clocked over 36 million mentions in a week, were bonafides enough to establish the legitimacy of K-Pop vis-a-vis English, a language which is clearly understood by more of the world population than Korean. Add to it the fact that “Dalla Dalla, I Love Myself,” that released in February this year by Itzy, a Korean girl band, logged in 17.1 million views in 24 hours! Korean bands like Big Bang, which is credited with the success of making Korean music international with Got7, has now even released their Japanese single Love Loop.\nAnd because the Korean popstars are young, they have addressed the youth demographic in most countries, especially the multi-cultural ones in south and southeast Asia. That has generated interest in other things Korean — films, music, dramas and web series.  Indian youngsters are addicts no less and students in Delhi are even participating in K-pop contests. K-pop bands may now just cut an Indian single.\nWhy is it a cult?\nWith the proliferation of internet and social media, people are naturally willing to explore other cultures. But what catches young people’s fancy are visual imagery, relatable lyrics and a fusion of genres. The visual sheen, with graphic-rich videos and bright-coloured outfits for both men and women, are in sync with a generation that talks in emoji language. The music videos are a mix of VFX, animation and other such tools, the appeal of which is not difficult to understand among the techno-trained generation that loves TikTok and Instagram.\nThe lyrics, because the beats are short and snappy,  are easy to learn and comprehend. Besides, they come with social messages, particularly addressing the challenges of youth. “Nowadays, the lyrics of popular K-pop bands carry a healing message for a troubled generation, encouraging them not to give up on life and helping them gain confidence and fighting spirit”, says Kim Kum-Pyoung, director, Korean Cultural Centre. Some songs even address mental illness in an open and honest manner. Others call for leading meaningful lives as an ode to the YOLO (You Ony Live Once) culture. Some even call for ushering in a “girl’s generation.” BTS, a seven-member boy band from South Korea, is topping popularity charts only because it is talking about the competitive pressures of an education system, drug abuse and performance pressure. “This is helping them garner attention from overseas as well. Their messages of confidence and self-love have impacted youth a lot. The lyrics are strong and people easily get a hang of them,” says Devyanshi Agarwal, a K-pop enthusiast and blogger. “K-pop is not just upbeat music, they have ballads too. It acts as a medium of connecting those who do not speak the language,” says Tarun Singh Rana from Sejong, South Korea.\nThe music is a mix of pop, hip-hop, EDM and many other genres, creating a matrix for universal acceptability. Besides, K-pop artists, by virtue of taking part in dares in reality TV shows, build an immediacy of connect.\nUNUSUAL THEMES\nMost K-pop bands  have a linear connect between all of their performances and albums, making them almost co-travellers in a journey called life. It is a live evolution in progress as it were, something which is not usual in any other performing arts. “This blend of performing arts disciplines is also the reason why K-pop bands not only focus on singing but emphasise dancing skills equally,” adds Kim. “Some fans realised lately that they release each of their albums on a solar or lunar eclipse. Isn’t this cool?”, asks Aeshal Fatima, a Delhi-based fan.  She loves Black Pink, an all-girls’ band, which is  another global obsession because of hip hop beats and catchy English lines.\nIndian FANDOM\nReferring to the increasing number of participants and enthusiastic fan clubs at the Korean Cultural Centre, Kim says, “Indians are riding the Korean wave, which has grown over time. An increasing response from India has enhanced the participation of K-pop stars here.”\nSakshi Mishra, one of the learners at the K-pop Academy at KCC, who has recently enrolled herself, shares her stint. “It has been an amazing experience as I have made a lot of friends through common interests. We are getting trained by teachers from Korea. Before joining the academy, I used to dance ocassionally like a hobby but now I have sharper moves, the landings are on-point and in sync with the music.”\nThe Triple Seven group, a participant at the contest, says, “It helped us develop confidence and international standards. The exposure it offers cannot be measured.” Feebe from South Korea, who has been a participant at the festival since last year, says, “It is always great to come to this small family where love stems for K-pop. It is a good way to celebrate the passion everyone has towards the Korean industry. This year has been much better than the previous ones.”\nSakshi adds, “There are many youngsters rising to prominence through this genre in the country, simply because it is clutter-breaking. Hence, I chose this beat.” The participants for K-pop competitions have increased from 764 (2017) to 3,475 (2019). Among other artists, Priyanka Mazumdar and Siddhant Arora are the first Indian K-pop stars, being launched as members of two new groups, Z-Girls and Z-Boys, respectively. Over the last few months, BTS has had various screenings across cities. The increasing number of footfalls with every screening, overwhelming responses from youngsters and recent visits by K-pop stars Kyuhyun Minho, Jonghyun, Sunggyu and Suho have only legitimised K-pop as a culture marker of Delhi’s youth.\nPhoto: Pankaj Kumar K-pop is spreading its wings across Delhi as it talks about life’s challenges, never giving up and elevates you with foot-tapping beats. By Sakshi Sharma Who is the singer with the maximum fan following? Taylor Swift? Beyoncé? Or is it Justin Bieber? Well, the answer is Exo, a nine-member boy band formed in 2012, who have been called by some “the kings of K-Pop” or Korean pop. Does the very idea leave you flabbergasted? Then just look at the figures. In 2018 Swift, with her 85 million followers, averaged around 91,000 Twitter mentions per week. Beyoncé saw almost three times as many weekly mentions as other artists with similar reach. Bieber saw close to 390,000 hits. But Exo, which averaged 24 million, and another Korean band called BTS, which clocked over 36 million mentions in a week, were bonafides enough to establish the legitimacy of K-Pop vis-a-vis English, a language which is clearly understood by more of the world population than Korean. Add to it the fact that “Dalla Dalla, I Love Myself,” that released in February this year by Itzy, a Korean girl band, logged in 17.1 million views in 24 hours! Korean bands like Big Bang, which is credited with the success of making Korean music international with Got7, has now even released their Japanese single Love Loop. And because the Korean popstars are young, they have addressed the youth demographic in most countries, especially the multi-cultural ones in south and southeast Asia. That has generated interest in other things Korean — films, music, dramas and web series.  Indian youngsters are addicts no less and students in Delhi are even participating in K-pop contests. K-pop bands may now just cut an Indian single. Why is it a cult? With the proliferation of internet and social media, people are naturally willing to explore other cultures. But what catches young people’s fancy are visual imagery, relatable lyrics and a fusion of genres. The visual sheen, with graphic-rich videos and bright-coloured outfits for both men and women, are in sync with a generation that talks in emoji language. The music videos are a mix of VFX, animation and other such tools, the appeal of which is not difficult to understand among the techno-trained generation that loves TikTok and Instagram. The lyrics, because the beats are short and snappy,  are easy to learn and comprehend. Besides, they come with social messages, particularly addressing the challenges of youth. “Nowadays, the lyrics of popular K-pop bands carry a healing message for a troubled generation, encouraging them not to give up on life and helping them gain confidence and fighting spirit”, says Kim Kum-Pyoung, director, Korean Cultural Centre. Some songs even address mental illness in an open and honest manner. Others call for leading meaningful lives as an ode to the YOLO (You Ony Live Once) culture. Some even call for ushering in a “girl’s generation.” BTS, a seven-member boy band from South Korea, is topping popularity charts only because it is talking about the competitive pressures of an education system, drug abuse and performance pressure. “This is helping them garner attention from overseas as well. Their messages of confidence and self-love have impacted youth a lot. The lyrics are strong and people easily get a hang of them,” says Devyanshi Agarwal, a K-pop enthusiast and blogger. “K-pop is not just upbeat music, they have ballads too. It acts as a medium of connecting those who do not speak the language,” says Tarun Singh Rana from Sejong, South Korea. The music is a mix of pop, hip-hop, EDM and many other genres, creating a matrix for universal acceptability. Besides, K-pop artists, by virtue of taking part in dares in reality TV shows, build an immediacy of connect. UNUSUAL THEMES Most K-pop bands  have a linear connect between all of their performances and albums, making them almost co-travellers in a journey called life. It is a live evolution in progress as it were, something which is not usual in any other performing arts. “This blend of performing arts disciplines is also the reason why K-pop bands not only focus on singing but emphasise dancing skills equally,” adds Kim. “Some fans realised lately that they release each of their albums on a solar or lunar eclipse. Isn’t this cool?”, asks Aeshal Fatima, a Delhi-based fan.  She loves Black Pink, an all-girls’ band, which is  another global obsession because of hip hop beats and catchy English lines. Indian FANDOM Referring to the increasing number of participants and enthusiastic fan clubs at the Korean Cultural Centre, Kim says, “Indians are riding the Korean wave, which has grown over time. An increasing response from India has enhanced the participation of K-pop stars here.” Sakshi Mishra, one of the learners at the K-pop Academy at KCC, who has recently enrolled herself, shares her stint. “It has been an amazing experience as I have made a lot of friends through common interests. We are getting trained by teachers from Korea. Before joining the academy, I used to dance ocassionally like a hobby but now I have sharper moves, the landings are on-point and in sync with the music.” The Triple Seven group, a participant at the contest, says, “It helped us develop confidence and international standards. The exposure it offers cannot be measured.” Feebe from South Korea, who has been a participant at the festival since last year, says, “It is always great to come to this small family where love stems for K-pop. It is a good way to celebrate the passion everyone has towards the Korean industry. This year has been much better than the previous ones.” Sakshi adds, “There are many youngsters rising to prominence through this genre in the country, simply because it is clutter-breaking. Hence, I chose this beat.” The participants for K-pop competitions have increased from 764 (2017) to 3,475 (2019). Among other artists, Priyanka Mazumdar and Siddhant Arora are the first Indian K-pop stars, being launched as members of two new groups, Z-Girls and Z-Boys, respectively. Over the last few months, BTS has had various screenings across cities. The increasing number of footfalls with every screening, overwhelming responses from youngsters and recent visits by K-pop stars Kyuhyun Minho, Jonghyun, Sunggyu and Suho have only legitimised K-pop as a culture marker of Delhi’s youth. Photo: Pankaj Kumar  ",
    "datetime": null,
    "url": "https://www.dailypioneer.com/2019/vivacity/the-korean-wave.html"
}