{
    "title": "The Korean Invasion | Foreign Affairs",
    "text": "The November/December issue is now available online Squid Game, the South Korean television show in which deeply indebted people compete with one another in a deadly tournament, has become Netflix’s top offering in 90 countries, including the United States, and is already the streaming service’s most popular original program ever. I am one of the millions of viewers who binge-watched all nine episodes as soon as they came out. Not only is the series well plotted, but it also captures deep-seated concerns among many people in prosperous societies about ever-widening income inequality. The show is only the latest cultural export from South Korea to take the world by storm. From pop music acts such as the boy band BTS to movies such as Parasite (which became the first foreign-language film to win the Academy Award for Best Picture in 2020), Hallyu, or the Korean “wave,” is enjoying unprecedented global success. Historically more worried about fending off Chinese and Japanese cultural domination than spreading its own culture abroad, South Korea has now become a global soft-power juggernaut. Although millions of people around the world now regularly engage with South Korean culture, few know how it became so successful. The country’s cultural growth was not simply the work of a handful of inspired creators. It was the result of a long-term government effort to expand specific creative industries, a strategy that has paid hard-power dividends in the form of economic growth and greater global influence. With this newfound clout, Seoul has a chance to take on a more active role in contemporary international politics—spreading its democratic ideals alongside its increasingly ubiquitous popular culture. South Korea’s cultural renaissance was born out of adversity. President Kim Dae-jung, who had come to power in 1998 when South Korea was still reeling from the Asian financial crisis, targeted media and popular culture as a major source of economic growth. Under the aegis of the “Hallyu Industry Support Development Plan,” his administration set a goal of increasing the value of South Korea’s cultural industry (“music, soaps, movies, animations, games, and characters”) to $290 billion in two years, larger than the country’s semiconductor sector, which was then worth $280 billion. The government also expanded the cultural industry budget from $14 million in 1998 to $84 million in 2001. To boost the production of Korean popular culture, the South Korean government used the same public-private partnership template that Seoul originally developed to grow its electronics, shipbuilding, automaking, and other export industries. In conjunction with public relations firms, technology companies, and other parts of the private sector, the Ministry of Culture and Tourism began developing detailed business plans designed to grow overseas markets for Korean TV dramas, movies, and popular songs and offered loans to entrepreneurs and training for aspiring artists. The 2002 television drama Winter Sonata marked the first big success of this initiative. The show—a tearjerker about two young lovers—became a global hit partly as a result of deals the Korean government struck with foreign broadcasters and quickly attracted a cult following worldwide. Sales of Winter Sonata merchandise surpassed $3.5 million in Japan alone, and when the show’s lead actor visited Tokyo in 2004, thousands of middle-aged women came out to the airport to greet him. Meanwhile, the number of foreign tourists traveling to South Korea grew by nearly 75 percent from 2003 to 2004. The bulk of the growth, according to South Korean tourism officials, stemmed from the allure of Korean popular culture. Subsequent South Korean governments have sought to capitalize on these early successes. Roh Moo-hyun, who assumed the presidency in 2003, coined the phrase “Creative Korea” and increased subsidies for cultural startups. His conservative successor, Lee Myung-bak, prioritized cultural exports as a means of enhancing South Korea’s national image and fostering economic growth. Lee was particularly keen on promoting Korean food, such as kimchi. The next president, Park Geun-hye, promised in her inaugural speech that “cultural enrichment” would be one of her administration’s main objectives. Park’s term in office also coincided with the release of pop singer Psy’s “Gangnam Style,” which quickly exploded in popularity; the video has since been viewed more than four billion times on YouTube. Park took advantage of the song’s global reach by showcasing K-pop in her visits abroad. Psy’s success also helped justify the government’s plans to pour millions of dollars into the Ministry of Culture, Sports, and Tourism for projects that included a series of giant auditoriums and cultural centers. With its newfound clout, Seoul has a chance to take on a more active role in contemporary international politics. President Moon Jae-in, a progressive who took power in 2017, has continued to support cultural production with tax incentives and subsidies. Moon’s government has also sought to use soft power to enhance South Korea’s international standing. His signature foreign policy initiative—the New Southern Policy, designed to expand Seoul’s ties with India and countries across Southeast Asia—has helped turn the broader region into one of the largest markets for Korean pop culture. Moon also arranged for K-pop acts such as Red Velvet and Baek Ji-young to perform in Pyongyang during his 2018 summit with North Korean leader Kim Jong Un, and his government appointed the singers of boy band BTS as “special presidential envoys” to the United Nations “for future generations and culture.” More than one million people around the world tuned in to watch the band’s speech at the UN General Assembly. The economic payoff of these policies has been immense. In 2019, South Korea exported $12.3 billion in pop culture (up from a mere $189 million in 1998), including computer games, musical tours, and cosmetics. By one estimate, the number of South Koreans employed in cultural fields grew to 644,847 in 2017—three percent of the entire workforce. BTS alone is an economic powerhouse. According to the Hyundai Research Institute, the band generates an estimated $3.5 billion per year in economic activity. In 2017, around 800,000 tourists—about seven percent of all arrivals in South Korea—visited because of their interest in the group. Some of the other economic benefits of Korean soft power are subtler but no less important. Many people around the world perceive South Korea as small, unthreatening, and increasingly “cool.” Korean exports and investment have sparked little backlash among Americans, even though South Korea runs a trade surplus with the United States. Korean companies such as Samsung, LG, Kia, and Hyundai have become uncontroversial parts of everyday American life—in sharp contrast to Japanese companies such as Toyota, Sony, and Honda in the 1980s and Chinese firms such as Huawei today. A Gallup poll found that 77 percent of Americans have a positive view of South Korea, up from only 46 percent in 2003. That is far more positive than American views of traditional allies such as Australia, France, Germany, and the United Kingdom—to say nothing of other Asian countries. Soft power also strengthens the long-standing military alliance between the United States and South Korea, which withstood former President Donald Trump’s accusations that Seoul was a military freeloader seeking to take advantage of U.S. largess. Such claims failed to resonate in the United States not only because of a shared history of sacrifice dating back to the Korean War but also because of the positive attitude toward South Korea held by many Americans, a view largely fostered by cultural exports. Beyond these economic and political benefits, soft power is changing the very nature of South Korean society. Thanks in part to bustling cultural industries, the country’s Confucian, respect-your-elders traditions are yielding to a more vibrant and freewheeling ethos—even as the population ages and the workforce declines. Young South Koreans are now more likely to aspire to artistic and creative careers than to jobs as salarymen in large corporate conglomerates. The old hierarchical system worked well in the industrial age, but this new entrepreneurial model is more appropriate for the information age and will help South Korea accelerate its difficult transition from an economy organized around heavy industry to one focused on the production of intellectual property. Creativity, after all, is just as important in information technology as it is in art—especially as Korean firms begin to compete with dynamic U.S. companies such as Apple, Alphabet, and Amazon. South Korea’s cultural efflorescence poses a challenge to its leaders. For decades, other countries such as Japan and the United States have used their cultural cachet to advance human rights, encourage economic development, and support global democracy. Seoul can follow suit. A good start would be to increase spending on development assistance. South Korea currently lags behind wealthy governments in the percentage of GDP that it allocates for development aid, ranking well below Japan, the United States, and most European countries. South Korea also generally refrains from criticizing the growing list of human rights abuses committed by China, its biggest trade partner. Seoul fears a repeat of 2017 when Beijing lashed out after Moon Jae-in’s government agreed to host a new U.S. missile defense system. China canceled tourism visits, reduced purchases of South Korean goods, removed South Korean music videos and dramas from Chinese streaming services, and canceled K-pop tours of China. South Korea suffered at least $7.5 billion in economic losses, demonstrating that soft power can be a point of vulnerability as well as strength. But South Korea is quickly becoming strong enough that, while still treading carefully with regard to China, it can afford to be more outspoken in standing up for democratic values. South Korean soft power will matter only at the margins when it comes to changing Chinese behavior, but it can be far more powerful in North Korea. Much as Western cultural exports such as McDonald’s, Coca-Cola, Levi Strauss, Hershey, Elvis Presley, and the Beatles once helped to undermine the Soviet bloc and win the Cold War, South Korean soft power has the potential to challenge North Korean despotism by tempting its population with the seductive fruits of democracy and capitalism. South Korea also has the opportunity to harness its soft power to promote democratic values. The North Korean government, for its part, describes these cultural exports at once dismissively as nampung (“Southern wind”) and with more alarm as a “weapon.” Nevertheless, many North Koreans still manage to watch South Korean dramas and listen to K-pop on USB drives smuggled in from China and sold on the black market. The most realistic part of the popular South Korean series Crash Landing on You—the story of a South Korean heiress who accidentally paraglides into North Korea, lands on a soldier, and falls in love with him—is its depiction of North Korean villagers secretly watching South Korean dramas. Some defectors to the South say they had grown to admire and even yearn for South Korea after watching its television programs. Pyongyang has predictably responded by warning citizens to stay away from all things South Korean, including its fashion, music, hairstyles, and even slang, such as oppa (“older brother”), a term made famous in “Gangnam Style.” Instead of capitalizing on its cultural allure, however, South Korea is so concerned about offending its neighbor that it recently banned the distribution of propaganda—in the form of USB flash drives, CDs, books, and other publications—into the North via balloon. The ban also criminalizes the use of loudspeakers and placards in the border area. Going forward, Seoul would be well advised to do the opposite—devote greater resources to helping South Korean culture penetrate the North. Such exports could help foster the peaceful reunification of the peninsula by making the South Korean model more attractive for Northerners, much as Western culture helped to break down the Berlin Wall. Moreover, South Korean soft power could also make any future reunification less painful by fostering a shared culture on both sides of the DMZ. Beyond North Korea, South Korea also has the opportunity to harness its soft power to promote democratic values, particularly in Asia, where its cultural offerings already resonate. Of course, films such as Parasite and shows such as Squid Game are double-edged swords; they showcase the power of capitalist culture while simultaneously illustrating the dangers of excessive income inequality in a capitalist system. The fact that South Korea produces such self-aware and critical narratives, however, is itself a tribute to free expression that would be unimaginable in many countries, including China. South Korea has done a superb job of growing its soft power in ways that other countries can only envy and emulate. But Seoul now has a far tougher job: figuring out how to harness that power to achieve the country’s foreign policy aims. As part of this process, South Korea needs to decide what it stands for. Does it want only to export entertainment, or does it also want to export its democratic ideals—solidifying its cultural star power along the way? A Foreign Policy for a Changed World How America’s Adversaries Have Hijacked Its Old Deterrence Strategy Israel’s Offensive Will Pit Sisi Against His Own People Before the War, Gaza’s Leaders Were Deeply Unpopular—but an Israeli Crackdown Could Change That How the Kims Got the Bomb and Why They Won’t Give It Up The Hopes and Fears of North Korea’s Dictator Get the Magazine Foreign Affairs From the  publishers of  Foreign Affairs Published by the Council on Foreign Relations ©2023 Council on Foreign Relations, Inc. All Rights Reserved. ",
    "datetime": "2021-10-14T00:01:00-04:00",
    "url": "https://www.foreignaffairs.com/articles/south-korea/2021-10-14/korean-invasion"
}