{
    "title": "The Korean Wave and the Impasse of Theory",
    "text": "Peter Yoonsuk Paik’s “The Korean Wave and the Impasse of Theory” appears in Telos 184 (Fall 2018), a special issue on Korea. Read the full article at the Telos Online website, or purchase a print copy of the issue in our online store. Individual subscriptions to Telos are available in both print and online formats. South Korean popular culture has achieved startling success across much of the globe during the past decade. The first transnational form of popular culture that is not the legacy of an imperial project, the efforts to understand the significance of the “Korean wave” have been hampered by dominant scholarly approaches in the humanities that are not capable of grasping both its emergence and its appeal. This article argues that a key reason for the appeal of South Korean television and film is the fact that they explore the clash between tradition and modernity. South Korean media resonates with peoples across the world who are living out the conflicts between tradition and modernity and are thus eager for models for negotiating the competing demands of the two. Contemporary theory by contrast is a phenomenon of post-industrial society, where intellectuals have become wholly alienated from tradition, leaving them incapable of reconstructing and inhabiting the standpoints of the pre-modern past. Theory is the favored instrument to criticize the post-traditional society from which it emerges, but it cannot explain how a popular culture that is more traditional than that of the West could achieve global success. Furthermore, it cannot account for the economic and technological conditions behind the production of this transnational popular culture: the meteoric rise of South Korea itself from dire poverty to the ranks of the world’s advanced economies. This article underscores the need to pursue lines of thought that can grasp the significance of South Korea in relation to global culture. ",
    "datetime": "2018-11-06T15:00:51+00:00",
    "url": "https://www.telospress.com/the-korean-wave-and-the-impasse-of-theory/"
}