{
    "title": "The K-Wave Splashes Down in London, With a Wide-Ranging Exhibition Devoted to Korean Pop Culture",
    "text": "Highlights include an immersive recreation of the bathroom from 'Parasite' and a monumental media work by Nam June Paik. Christine Ajudua, \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSeptember 28, 2022 Ten years ago, a little-known South Korean singer and rapper named Park Jae-Sang (a.k.a. PSY) put out a pop song and corresponding music video that catapulted both him and his country onto the global stage. With its quirky, catchy hook and all-too-imitable dance moves, Gangnam Style—referring to the affluent district south of the Han River in Seoul—became the first music video to reach 1 billion views on YouTube, a viral hit in the relatively early days of digital virality, while ushering in a still-growing wave of K-pop, K-drama, K-beauty, pretty much K-everything around the world. Now, just weeks after Frieze launched its first fair in Seoul, the phenomenon has been documented in “Hallyu! The Korean Wave” (through June 25, 2023), a first-of-its-kind exhibition on the country’s pop culture that opened last weekend at London’s Victoria and Albert Museum. Installation view of “Hallyu! The Korean Wave” at the Victoria and Albert Museum, London. Supported by the Ministry of Culture, Sports and Tourism—Republic of Korea and Genesis. “South Korea has captivated the world over with hallyu,” said lead curator Rosalie Kim, using the Korean word for “K-Wave,” in a statement. It has, she continued, “transformed the country’s image from one devastated by the Korean War to that of a leading cultural powerhouse in the era of social media and digital culture.” With more than 200 objects on display—1988 Seoul Summer Olympics posters; the world’s first commercial MP3 player; the green tracksuit and guard costumes from the Netflix series Squid Game; beauty products from the 13th century and today—the show aptly opens with Gangnam Style, featuring the pink suit jacket that PSY wore in the original video, beside video homages filmed on several continents. There’s an entire gallery devoted to K-pop—you enter it through a corridor lined with K-fan light sticks—with Seo Taiji and Boys as well as BoA album covers, Aespa and Ateez costumes, and other ephemera. Excerpts of music videos by Big Bang, NCT, and Blackpink play on a loop, and you can dance along to PSY’s That That, thanks to an interactive choreographic challenge created in collaboration with Google Arts & Culture Lab. Nam June Paik, Mirage Stage. © Nam June Paik Estate. Meanwhile, the V&A worked with Parasite’s production designer, Lee Ha Jun, to recreate the bathroom from the Kim family’s banjiha (semi-basement apartment) in Bong Joon-ho’s Oscar-winning film as an immersive installation. And there are monumental works by artists such as Ham Kyungah and Gwon Osang, including a 1986 Nam June Paik video sculpture with 33 TV monitors. You’ll also find contemporary hanbok (“Korean clothing”) worn by the likes of BTS alongside ensembles by fashion designers Minju Kim, Münn, and Miss Sohee, as well as special commissions inspired by traditional garments, with a cheollik dress by Tchai Kim among them. Below, see highlights from “Hallyu! The Korean Wave.” A recreation of the Kim family’s bathroom in Parasite for “Hallyu! The Korean Wave” at the V&A, London. Kyungah Ham, What you see is the unseen / Chandeliers for Five Cities. Photo: Chunho An. © Kyungah Ham. Courtesy of the artist and Kukje Gallery. Beauty Adorning Herself, attributed to Kim Hong-Do (ca. 18th–19th century Joseon Dynasty). © Seoul National University. A still from Aespa’s Next Level music video (2021). © SM Entertainment. A look from the Ji Won Choi x Adidas collaboration. Photo: Francesca Allen. Courtesy of Adidas. Eight Beauties of Korea folding screen (ca. 1900–50), attributed to Chae Yong Shin. © OCI Museum of Art. Minju Kim, Moon Jar Dress, Blue (2021). Photo: Sangmi An. Model: Leehyun Kim. © Minju Kim. Gwon Osang, Untitled G-Dragon, A Space of No Name. © Courtesy of the artist. A contemporary saekdong design by Korean label Darcygom. Photo: Jihoon Jung. Courtesy of Darcygom. Samsung Electronics’ TV production line (ca. 1970). Courtesy of the Samsung Innovation Museum. Miss Sohee, the Peony Dress from “The Girl in Full Bloom” graduation collection (2020). Photo: Daniel Sachon.  Share By\n\t\t\t\t\t\t\tDelia Harrington,\n\t\t\t\t\t\t\tDec 7, 2022 By\n\t\t\t\t\t\t\tVivienne Chow,\n\t\t\t\t\t\t\tSep 16, 2022 By\n\t\t\t\t\t\t\tJo Lawson-Tancred,\n\t\t\t\t\t\t\tSep 15, 2022 By\n\t\t\t\t\t\t\tVittoria Benzine,\n\t\t\t\t\t\t\tSep 28, 2022 By\n\t\t\t\t\t\t\tJo Lawson-Tancred,\n\t\t\t\t\t\t\tSep 28, 2022 ©2023 Artnet Worldwide Corporation. All Rights Reserved. You are currently logged into this Artnet News Pro account on another device. \n\t\t\t\t\tPlease log off from any other devices, and then reload this page continue.\n\t\t\t\t\tTo find out if you are eligible for an Artnet News Pro group subscription, \n\t\t\t\t\tplease contact [email protected]. \n\t\t\t\t\tStandard subscriptions can be purchased on the subscription page. Log In ",
    "datetime": "2022-09-28T16:27:09+00:00",
    "url": "https://news.artnet.com/art-world/hallyu-the-korean-wave-exhibition-2182985"
}