{
    "title": "The Kiwis riding the K-Pop music wave | Stuff.co.nz",
    "text": "Lia Williams clamps her hands between her knees to keep them from shaking. Her kohl-rimmed eyes dart around the room. The Korean Community Centre on Auckland's North Shore is packed. Registration has only been open for an hour, but so far more than 200 New Zealanders aged between 10 and 24 have signed up for their chance to be a Korean pop star. \"I've been a singer since I was six, and I always wanted to make it a career,\" says 20-year-old Williams, an Asian Studies student at Victoria University. \"I love Korean pop music, and I want to move over and live there anyway. Just the hard work they put in and the sheer talent they have is amazing.\" Today's auditions are courtesy of JYP Entertainment, one of South Korea's biggest entertainment agencies. It is scouting for K-Pop trainees, with successful applicants winning a contract to its academy in Seoul. All ethnicities are encouraged, and there are kids here of Asian, Pacific, and European descent (like Williams). Hopefuls are called by their numbers, six at a time. They file upstairs to perform a two-minute song, dance, or rap, most choosing to cover tunes made famous by K-Pop groups like Girls Generation, Big Bang and 2NE1. The space is tiny – just a few metres square. Three judges make the call. Whispers go around the room: if you're really bad, they'll cut you off before the allotted time; if you're really good, they might tell you so. Sixteen-year-old Macleans College student Vincent Lei has already been given the nod to come back tomorrow after a successful hip-hop routine to a song by K-Pop boyband iKON. The judges told him to keep it quiet, but he's so excited he's telling everyone, including this reporter. ALSO READ:  One Kiwi's K-Pop dream that came true In the middle of the room, a teenager unselfconsciously runs through dance moves. Instant coffee and lollies are handed out. Nate Mealor, 18, sits with his dad, who is working on his laptop. Dad and son have travelled from Melbourne for the audition. \"I wasn't sure if they were going to come to Australia, so I thought I'd come over and give it a go,\" Nate says. Another hip-hop dancer, he will perform to 'Thunder' by South Korean-Chinese boyband Exo. Why does he want to be chosen? \"Fame, plain and simple. Fame. It would be pretty cool going around the world singing songs all day. I wouldn't audition for X Factor or anything like that because I don't like it. But when it comes to K-Pop, I just like the culture.\" K-Pop: A few years ago, the majority of New Zealanders hadn't even heard of it. But then came goofy South Korean singer Psy, and 'Gangnam Style'. His catchy, offbeat song was an international success and, to-date, the most viewed video on YouTube, with more than two billion hits. While Psy was an unlikely star – most K-Pop singers are pretty, groomed, expertly choreographed specimens – he awakened an interest in K-Pop that has contributed to a Korean cultural wave that has spread worldwide. The word 'hallyu', which essentially means 'Korean wave', is used to describe South Korean pop culture, including television dramas, music, film, video games and fashion. Its influence is growing fast, with millions of converts across the globe, from China to Latin America to Australia and beyond. New Zealand is no exception. This is the second time in three years JYP entertainment has held auditions here, scouting local stars as part of a strategy to raise the profile of K-Pop down under. A New Zealand K-Pop fan group on Facebook has more than 5000 likes, and Auckland University's K-Pop Planet fan club had 160 members at last count. Psy's 'Gangnam Style' - Two billion YouTube hits and counting \"Last time we came to New Zealand we were quite amazed and surprised there was so much interest, and this time there's even more,\" says JYP Entertainment casting manager Jane Kim. \"At the first audition the majority were Asian, but this has diversified so we're getting kids from all different cultures and backgrounds. It shows that K-Pop is becoming more recognised in New Zealand, like the rest of the world.\" Watching a K-Pop video is akin to falling into a tub of candy floss. The groups, which have up to 12 members, are made up of good-looking, picture-perfect boys and girls (though never both genders together). Everyone wears full makeup, dances in unison, and the videos generally feature highly emotive, over-acted storylines. Clothes are bright or pastel, with only the obvious 'bad' boys or girls donning black. The music itself is heavily manufactured, saccharine pop, which typically includes at least a few English words, catchy electronic hooks and a lot of auto-tune. So what's the big deal? Aucklander Jenny Tan, 21, is a founding member of K-Pop Planet. \"It's sort of like a new culture, a new language, especially if you've grown up listening to Western music,\" she says. \"They're releasing new stuff constantly: new videos, new groups, new songs, and the singers are actors as well so they act in the videos. I like the whole package, everything to do with the visuals, the dancing – they're all so in-sync.\" Auckland University group K-Pop Planet started two years ago. Its 160 members meet and play games based on Korean variety TV shows, organise K-Pop nights at local bars, and swap intel about their favourite bands. In July, 30 of them will travel to Australia to see Girls' Generation, a nine-member girl group that is one of K Pop's biggest global selling acts. Riding the crest of the wave is Auckland's ACE dance crew, who came second in the New Zealand heat of last year's K-Pop World Festival. Held in 43 countries worldwide, the festival was brought here in 2012 by South Korea's Ministry of Foreign Affairs. If winners receive enough online votes they are flown to Korea to appear on national television. ACE crew leader Grace Xuan, 22, says the 12-strong group began as a hip-hop crew, but are increasingly being booked for their K-Pop performances. These have featured on Korean language television HiTV and Chinese channel WTV. \"People like the dance style – for K-Pop it's more about entertainment and your facials, your expressions. It's more of a performance than dance.\" Fellow crew dancer Mitchell Yee, 21, has started running two K-Pop dance classes a week for the public from a Newmarket studio. \"Definitely in the last few years it's taken off, and it's been quite cool especially for young people here. It's less aggressive than hip-hop.\" Where did hallyu come from? According to Euny Hong, the Korean-American author of The Birth of Korean Cool: How One Nation Is Conquering the World Through Pop Culture, its rise has been no accident. \"It would not be an exaggeration to say that hallyu is the biggest, fastest cultural paradigm shift in modern history,\" she writes. \"The South Korean government has made the Korean Wave the nation's number one priority.\" In the early 90s, the government of this geographically small nation of 50 million realised it could make its mark internationally by developing its 'soft power' – that is, power wielded through its image, rather than brute force. By investing heavily in the country's broadband infrastructure, technology and entertainment industries, the government ensured K-Pop had the right environment to grow. And it has – in 2012, Korea's pop culture revenue was $4.8 billion. Dr Sun Hee Koo, a University of Auckland ethnomusicology lecturer, says the spread of hallyu began with Korean soap dramas, initially marketed to Japan and China. Japanese housewives watched shows like Winter Sonata and What is Love? in their droves, wooed by the stereotyped, sensitive Korean masculinity portrayed on screen. (In Winter Sonata, a young man falls in love with a classmate and then suffers amnesia, struggling to remember who she is for the rest of the series.)  One of 200 singers hoping to score a contract to a K-Pop academy. The actors in these dramas could also sing, and would give sell-out concerts across eastern Asia. \"Because of this, people wanted to study Korean language and spend time in Korea,\" Dr Koo says. Movies and music came next and, make no mistake, K-Pop is serious business. The three main South Korean entertainment companies – JYP, SM and YG – sign up dozens of trainees each year to water-tight contracts, which have them training daily for years before they're even given the chance at a public debut. \"They've invested massive amounts of money building these academies of entertainers, quite a lot of whom never make it to the stage,\" says Dr Koo, who has a cousin in Seoul who's been in an academy for five years. \"Tons of kids are being trained in multiple aspects of performing.\" Haeri Lee is the former leader of K-Pop group MaskOT, and chief executive of start-up Kompany93, based in Seoul. At 16, Lee, whose parents moved to New Zealand in 1997 for their children's education, became the youngest student ever to attend Wellington's Victoria University, before moving back to South Korea in 2010 to pursue a career in K-Pop. In Seoul, she was picked up as a K-Pop trainee with GBK Entertainment. This meant training from 9am till 11pm six days a week – a life of dancing, running, singing, and sticking to a strict diet plan. Compared to other trainees, her debut was swift. Just a year after she was accepted, MaskOT released its first song. Unfortunately, success was also short-lived, with the group disbanding later that year due to disagreements with management. Kompany93 is a marketing and entertainment company that promotes K-Pop internationally. Lee has seen a surge in interest from New Zealand, with fans keen to see K-Pop gigs here and asking about auditions, clothing and merchandise. The appeal of K-pop to young people is clear, she says. \"K-culture in general is very stylish and modern, and it is very different. It's got an authenticity like no other culture. In K-Pop the songs are very catchy and easy to follow, and the performances are very glamorous – because the members go through such a tough training system even the small details in the choreography are perfect. K-culture is very unique, and I think that is what attracts global fans.\" Since she began lecturing at the University of Auckland four years ago, Dr Koo has also noticed a leap in awareness of Korean culture among her music students – and she can see why JYP would hold auditions here. \"Quite a few of my Kiwi students know about K-Pop stars, and have knowledge of east Asian singers. A lot of companies are reaching out for members in other parts of the world. I'm sure part of the reason JYP wants to recruit New Zealanders is so they can get New Zealand performers popular here. That's the strategy the entire Korean pop industry is using.\"  Inside the JYP K-Pop audition room The impact pop culture has had on aiding better relationships between Korea and other countries should also not be underestimated, she says. At Auckland University there has been a 40 percent spike in Korean language enrolments in the past year, making it the second most popular Asian language behind Japanese. In 2012, New Zealand's deputy secretary of foreign affairs and trade, Andrea Smith, told a gathering of South Korean diplomats: \"Korean food and music, both traditional and modern, are becoming well known in New Zealand… the 'Korean Wave' is now becoming part of the Kiwi lifestyle.\" And in March this year, the first ever Free Trade Agreement between New Zealand and Korea was signed – improving the ease of trade between both nations and increasing the numbers of Korean students allowed to study and work here. \"This involves a lot of support and co-operation – our relationship will be [even] stronger in the next few years,\" says Dr Koo. Along with New Zealand's other aspiring Korean pop stars, Lia Williams won't find out whether she has what it takes to be a K-Pop trainee for at least another month. Statistically, it's more than likely she won't. Instead she'll go home, watch the videos, practise the dance moves, learn the language – and, like millions of others, keep spreading the hallyu love. Head to our Facebook page for more from Stuff Entertainment Sunday Magazine © 2023 Stuff Limited ",
    "datetime": "2015-05-21T22:50:04.775Z",
    "url": "https://www.stuff.co.nz/entertainment/music/68734424/the-kiwis-riding-the-k-pop-music-wave"
}