{
    "title": "The NPR podcast 'Throughline' examines how Korean culture went global : NPR",
    "text": "By Ramtin Arablouei , Rund Abdelfatah From BTS to Squid Game, South Korea reigns as a global exporter of pop culture. In the past two decades, government intervention has led the country to become a major driver of global soft power. A MARTINEZ, HOST:  Fans of the Netflix hit \"Squid Game\" are already looking forward to Season 2, which is in the works. The show was awarded six Emmys last month, becoming the first non-English-language series to win. \"Squid Game\" is just one in a long line of South Korean cultural products that have taken the world by storm. There are movies such as \"Parasite\" and musical acts like BTS. Rund Abdelfatah and Ramtin Arablouei are the hosts of NPR's history podcast Throughline, and they bring a story behind the Korean wave.RUND ABDELFATAH, BYLINE: The global rise of South Korean pop culture began with a big fall.(SOUNDBITE OF MUSIC)ABDELFATAH: The country had weathered decades of war, military occupation and authoritarian government before emerging as a true democracy in 1987 and starting to prosper economically. But a decade later, a financial crisis rocked Asia. South Korean companies went bankrupt. Job security disappeared. And unemployment tripled. In order to rebuild, the country had to change.(SOUNDBITE OF ARCHIVED RECORDING)PRESIDENT KIM DAE-JUNG: (Through interpreter) I solemnly declare in front of the people that I will faithfully carry out my duty as president.ABDELFATAH: President Kim Dae-jung was elected in 1998, and he was determined to charter South Korea into a new future.MICHAEL KIM: He's kind of like, OK, now we're going to be a soft power.RAMTIN ARABLOUEI, BYLINE: Michael Kim is a professor of Korean studies at Yonsei University in Seoul. He says Kim Dae-jung had kind of a lightbulb moment. Korean TV series - K-dramas - were already massively popular around Asia. Kim Dae-jung took it further. He passed laws that establish the government as essentially what was called an entrepreneurial state. It became the government's responsibility to develop, finance and promote cultural industries, from film to TV to music. This included everything from building concert arenas to regulating karaoke bars.M KIM: This idea of Korean soft power, that Koreans can actually find a place in the world not through the hard military economic power, but through cultural influences - that actually captures the imagination of a lot of Koreans.ARABLOUEI: By the early 2000s, this investment began to pay off.(SOUNDBITE OF MUSIC)ABDELFATAH: The fans who loved K-dramas, like \"Winter Sonata,\" were now hungry for all things South Korean.ARABLOUEI: Women across Asia wanted to look like the stars, which helped the budding Korean beauty industry market their products - like cosmetics, face masks - to fans of the show. And there was one place in particular where pop culture and beauty trends collided - the fancy Seoul neighborhood of Gangnam.ABDELFATAH: A neighborhood made world famous by Psy's hit song \"Gangnam Style.\"(SOUNDBITE OF SONG, \"GANGNAM STYLE\")PSY: (Singing) Oppa Gangnam style, Gangnam style.M KIM: Gangnam is very much sort of the mecca of high consumption. You'd have tourists come from all over Asia to Seoul in order to shop - not just to shop, but to see what the Korean women are wearing and what cosmetics they're using, because that kind of sets the standards for all of Asia.ABDELFATAH: \"Gangnam Style\" was the first song to hit a billion views on YouTube. It also did what no other Korean pop song had done. It broke into the U.S.'s notoriously exclusive music market.(SOUNDBITE OF ARCHIVED RECORDING)UNIDENTIFIED NEWSCASTER #1: It is really getting a lot of reaction in the U.S., isn't it, Janet (ph)?JANET: It's the video to watch, and I have to admit, I've watched it probably about 15 times.(SOUNDBITE OF ARCHIVED RECORDING)AL ROKER: Normally I'd say these are my people. But today it's Psy people.(CHEERING)PSY: If you know all the words, say it. What? (Singing) Oppa Gangnam style.ARABLOUEI: But there was something crucial about the song that flew over a lot of non-Korean speakers' heads.M KIM: The whole entire song \"Gangnam Style\" is really kind of a parody of this lifestyle that a lot of Koreans are not actually living.ARABLOUEI: After the IMF crisis, the gap between wealthy and poor Koreans widened. There was a growing sense that no matter how hard you tried, you couldn't make it in South Korea.M KIM: But it's the sort of image that's there of this high-consumption lifestyle, which every Korean wants, but not every Korean is actually experiencing.ABDELFATAH: Those same themes of cynicism about economic inequality would reemerge from South Korea years later, only darker...(SOUNDBITE OF FILM, \"PARASITE\")UNIDENTIFIED ACTOR #1: (As character, speaking Korean).UNIDENTIFIED ACTOR #2: (As character, speaking Korean).UNIDENTIFIED ACTOR #1: (As character, speaking Korean).ABDELFATAH: ...With \"Parasite\" and \"Squid Game.\"(SOUNDBITE OF TV SHOW, \"SQUID GAME\")UNIDENTIFIED ACTOR #3: (As character) Will you go back to living your old and depressing lives, getting chased by your creditors, or will you act and seize this last opportunity we're offering here?ABDELFATAH: And the whole world was captivated.(SOUNDBITE OF MONTAGE)UNIDENTIFIED PERSON #1: And the Oscar goes to \"Parasite.\"(CHEERING)UNIDENTIFIED PERSON #2: And the Oscar goes to...UNIDENTIFIED ACTOR #3: Bong Joon-ho.UNIDENTIFIED PERSON #4: Bong Joon-ho.UNIDENTIFIED PERSON #2: \"Parasite.\"UNIDENTIFIED NEWSCASTER #2: Well, this is the show that everyone is talking about.UNIDENTIFIED NEWSCASTER #3: How cool is it that this show right now is just so big?UNIDENTIFIED NEWSCASTER #2: \"Squid Game\" is No. 1 in 94 countries.ABDELFATAH: So here we are in 2022. Twenty years ago, Kim Dae-jung bet that there was a global market for Korean culture. And that bet paid off. Korean cultural exports, like movies and music, generated over $11.6 billion last year.ARABLOUEI: Yet inequality has soared, and social divides have deepened.M KIM: Of course, Korean society itself is just as complex, just as controversial as any other society, right? And so I'm very wary of presenting sort of just the package version of Korean society and Korean history when there is actually so much trauma and so much destruction and death and suffering within it, right? There is this sort of idea that we have to share in the prosperity because there was this kind of common misery of the past. My parents these days, like with many elderly parents, are watching YouTube all day, right? But they often are watching these broadcasts that celebrate, that sort of are amazed by the fact that, well, now the Korean culture is the most successful in the world or Korean products are the best in the world because they grew up in a Korea where that wasn't the case.(SOUNDBITE OF MUSIC) A MARTINEZ, HOST: Fans of the Netflix hit \"Squid Game\" are already looking forward to Season 2, which is in the works. The show was awarded six Emmys last month, becoming the first non-English-language series to win. \"Squid Game\" is just one in a long line of South Korean cultural products that have taken the world by storm. There are movies such as \"Parasite\" and musical acts like BTS. Rund Abdelfatah and Ramtin Arablouei are the hosts of NPR's history podcast Throughline, and they bring a story behind the Korean wave. RUND ABDELFATAH, BYLINE: The global rise of South Korean pop culture began with a big fall. (SOUNDBITE OF MUSIC) ABDELFATAH: The country had weathered decades of war, military occupation and authoritarian government before emerging as a true democracy in 1987 and starting to prosper economically. But a decade later, a financial crisis rocked Asia. South Korean companies went bankrupt. Job security disappeared. And unemployment tripled. In order to rebuild, the country had to change. (SOUNDBITE OF ARCHIVED RECORDING) PRESIDENT KIM DAE-JUNG: (Through interpreter) I solemnly declare in front of the people that I will faithfully carry out my duty as president. ABDELFATAH: President Kim Dae-jung was elected in 1998, and he was determined to charter South Korea into a new future. MICHAEL KIM: He's kind of like, OK, now we're going to be a soft power. RAMTIN ARABLOUEI, BYLINE: Michael Kim is a professor of Korean studies at Yonsei University in Seoul. He says Kim Dae-jung had kind of a lightbulb moment. Korean TV series - K-dramas - were already massively popular around Asia. Kim Dae-jung took it further. He passed laws that establish the government as essentially what was called an entrepreneurial state. It became the government's responsibility to develop, finance and promote cultural industries, from film to TV to music. This included everything from building concert arenas to regulating karaoke bars. M KIM: This idea of Korean soft power, that Koreans can actually find a place in the world not through the hard military economic power, but through cultural influences - that actually captures the imagination of a lot of Koreans. ARABLOUEI: By the early 2000s, this investment began to pay off. (SOUNDBITE OF MUSIC) ABDELFATAH: The fans who loved K-dramas, like \"Winter Sonata,\" were now hungry for all things South Korean. ARABLOUEI: Women across Asia wanted to look like the stars, which helped the budding Korean beauty industry market their products - like cosmetics, face masks - to fans of the show. And there was one place in particular where pop culture and beauty trends collided - the fancy Seoul neighborhood of Gangnam. ABDELFATAH: A neighborhood made world famous by Psy's hit song \"Gangnam Style.\" (SOUNDBITE OF SONG, \"GANGNAM STYLE\") PSY: (Singing) Oppa Gangnam style, Gangnam style. M KIM: Gangnam is very much sort of the mecca of high consumption. You'd have tourists come from all over Asia to Seoul in order to shop - not just to shop, but to see what the Korean women are wearing and what cosmetics they're using, because that kind of sets the standards for all of Asia. ABDELFATAH: \"Gangnam Style\" was the first song to hit a billion views on YouTube. It also did what no other Korean pop song had done. It broke into the U.S.'s notoriously exclusive music market. (SOUNDBITE OF ARCHIVED RECORDING) UNIDENTIFIED NEWSCASTER #1: It is really getting a lot of reaction in the U.S., isn't it, Janet (ph)? JANET: It's the video to watch, and I have to admit, I've watched it probably about 15 times. (SOUNDBITE OF ARCHIVED RECORDING) AL ROKER: Normally I'd say these are my people. But today it's Psy people. (CHEERING) PSY: If you know all the words, say it. What? (Singing) Oppa Gangnam style. ARABLOUEI: But there was something crucial about the song that flew over a lot of non-Korean speakers' heads. M KIM: The whole entire song \"Gangnam Style\" is really kind of a parody of this lifestyle that a lot of Koreans are not actually living. ARABLOUEI: After the IMF crisis, the gap between wealthy and poor Koreans widened. There was a growing sense that no matter how hard you tried, you couldn't make it in South Korea. M KIM: But it's the sort of image that's there of this high-consumption lifestyle, which every Korean wants, but not every Korean is actually experiencing. ABDELFATAH: Those same themes of cynicism about economic inequality would reemerge from South Korea years later, only darker... (SOUNDBITE OF FILM, \"PARASITE\") UNIDENTIFIED ACTOR #1: (As character, speaking Korean). UNIDENTIFIED ACTOR #2: (As character, speaking Korean). UNIDENTIFIED ACTOR #1: (As character, speaking Korean). ABDELFATAH: ...With \"Parasite\" and \"Squid Game.\" (SOUNDBITE OF TV SHOW, \"SQUID GAME\") UNIDENTIFIED ACTOR #3: (As character) Will you go back to living your old and depressing lives, getting chased by your creditors, or will you act and seize this last opportunity we're offering here? ABDELFATAH: And the whole world was captivated. (SOUNDBITE OF MONTAGE) UNIDENTIFIED PERSON #1: And the Oscar goes to \"Parasite.\" (CHEERING) UNIDENTIFIED PERSON #2: And the Oscar goes to... UNIDENTIFIED ACTOR #3: Bong Joon-ho. UNIDENTIFIED PERSON #4: Bong Joon-ho. UNIDENTIFIED PERSON #2: \"Parasite.\" UNIDENTIFIED NEWSCASTER #2: Well, this is the show that everyone is talking about. UNIDENTIFIED NEWSCASTER #3: How cool is it that this show right now is just so big? UNIDENTIFIED NEWSCASTER #2: \"Squid Game\" is No. 1 in 94 countries. ABDELFATAH: So here we are in 2022. Twenty years ago, Kim Dae-jung bet that there was a global market for Korean culture. And that bet paid off. Korean cultural exports, like movies and music, generated over $11.6 billion last year. ARABLOUEI: Yet inequality has soared, and social divides have deepened. M KIM: Of course, Korean society itself is just as complex, just as controversial as any other society, right? And so I'm very wary of presenting sort of just the package version of Korean society and Korean history when there is actually so much trauma and so much destruction and death and suffering within it, right? There is this sort of idea that we have to share in the prosperity because there was this kind of common misery of the past. My parents these days, like with many elderly parents, are watching YouTube all day, right? But they often are watching these broadcasts that celebrate, that sort of are amazed by the fact that, well, now the Korean culture is the most successful in the world or Korean products are the best in the world because they grew up in a Korea where that wasn't the case. (SOUNDBITE OF MUSIC) Copyright © 2022 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information. NPR transcripts are created on a rush deadline by an NPR contractor. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record. Sponsor Message Become an NPR sponsor ",
    "datetime": null,
    "url": "https://www.npr.org/2022/10/03/1126517153/the-npr-podcast-throughline-examines-how-korean-culture-went-global"
}