{
    "title": "The K wave- The New Indian Express",
    "text": "We are crazy about BinJin (the couple’s combo nickname) now that they are officially dating. So we wanted to do something to show our love for them. Published: 07th  February 2021 05:00 AM  |  \n      \n         Last Updated: 06th  February 2021 07:59 PM\n\n  |  A+A A- What is common between a South Korean star, alumnae of the premier Indian Institutes of Management (IIM) and Mumbai dabbawalas? Surprise, surprise! When actress Son Ye-jin rang in her birthday on January 11, a group of former IIM students was busy raising funds for donations to celebrate the occasion. The star may not, yet, know about ‘The Drama Kweens’, a K-drama fan group started in August with around 100-odd alumnae of IIMs, but that has not stopped them from going gaga over her. “Charity is close to Son Ye-jin and co-star Hyun Bin’s heart. We are crazy about BinJin (the couple’s combo nickname) now that they are officially dating. So we wanted to do something to show our love for them. We raised 1 million won (`67,000) on that day and donated it to the Mumbai Dabbawala Association,” says Arti Gupta, a 44-year-old member from Mumbai. BinJin are the lead pair of the popular Netflix original Crash Landing on You, a Korean OTT drama that premiered last year in India and has topped the charts since then. Initially, the IIM ladies wanted to put up posters of the couple on a Mumbai local train. “But the cost was high and it seemed unnecessary. That’s when we thought of dabbawalas, many of whom have been jobless since the outbreak of Covid-19,” says Gupta, co-founder of StyleNook, a Mumbai-based fashion tech personal styling firm. ‘The Drama Kweens’ may be slaying it in corporate boardrooms but when it comes to K-drama they are merely “starry-eyed fans”. While Gupta has a carefully curated list of K-dramas to watch in the coming months, Akansha Rana is following her favourite K-pop band BTS “almost like an obsession”. Like any ardent BTS stan (stalking fan), she identifies herself as ARMY—the fandom term for Adorable Representative MC (Master of Ceremonies) for Youth. “Their music is uplifting and lyrics are meaningful. They create video content around their tours and talk openly about their struggles. All of it is so relatable,” says Rana, a 22-year-old communications professional from Delhi. Her wardrobe is filled with oversized hoodies with BTS logo, loose pants and skirts—fashion trends that find her closer to Seoul than Delhi. “It was during the lockdown, in April, that I started following them religiously. The band helped me tide through the difficult months, sometimes even depression,” confesses Rana, who has a monthly Korean night-out with a friend. The two cook Korean dishes, dress up like their favourite K-pop stars and watch reruns of their favourite K-drama all night. “I have shortlisted a few universities and postgraduate programmes in Korea. I aspire to settle down in Seoul,” Rana says. A K-Wave is sweeping Urban India from films to serials, music to art, beauty to language. Gupta and Rana, new Hallyu (the Chinese term for Korean wave) converts, encompass a growing tribe of fans in the country who are staunch advocates of the expanding subculture. What started as a fascination for pirated DVDs of Korean shows way back in early 2000 in the Northeast has now spread all across. Hallyu has finally hit home in its second avatar. Hallyu 2.0 began around 2007 with South Korea taking advantage of digital technology, internet penetration and social media. The brewing sub-culture has cut across generations, gender and region. The pandemic year further cemented Hallyu’s position in India. The statistics stand testimony to the deep inroads paved by Hallyu 2.0. Music streaming giant Spotify’s 2020 data puts BTS as the fourth most streamed boy band in India. Podcasts related to Korean culture on Spotify topped in India last year. Indian streaming platforms such as MX Player and ZEE5 have started Hindi-dubbed versions of popular shows due to popular demand. Language learning platform Duolingo reported a 256 percent increase in Korean learners in India between March and November 2020. Makeup aggregator Nykaa has a dedicated K-beauty section. Korikart, India-based online marketplace for Korean products, witnessed 300 percent surge in sales between March and December 2020. The huge demand has led Korikart to sign up with offline stores in Darjeeling, Delhi, Nagaland, Manipur, Chennai and Bengaluru. The National Education Policy (NEP) 2020 has included Korean as one of the foreign languages to be taught in schools from the next academic year. “The Covid-19 pandemic opened up more platforms for cultural contents. During this time higher quality content got more appreciation,” says Hwang Il-yong, director of Korean Cultural Centre (KCC) India, Delhi. The latest K-craze in town has come a full circle. “Hallyu has impacted our youth in a big way. They want to learn the language, eat and dress like Koreans, buy K cosmetics, games, automobiles, and even smartphones,” says Rubal Kanozia, Assistant Professor, Central University of Punjab. Kanozia and research scholar Garima Ganghariya have put together a paper on the impact of Hallyu in India and other western nations. “The fascination started with Korean dramas as there is a lack of originality and variety in our mainstream entertainment industry,” he adds.  The K-dramas are high on politics, romance and crime. Unlike the gritty new Indian serials like Mirzapur and Sacred Games, K-series don’t have verbal abuse, blatant violence and loud scenes, which makes them viewer-friendly to the semi-conservative Indian audience. Serials such as Chief of Staff starring the wildly popular Lee Jung-jae, Shin Min-a and Lee Elijah sanitise political skullduggery and murder to make the episodes realistic yet inoffensive dissimilar to Tandav and Gangs of Wasseypur. Nor does Korean TV hurt anyone’s religious sentiments. \n Origins of Crossover \nNew-age Hallyu fans may like to believe that the trend started in India when Korean musician PSY’s Billboard-topping  song ‘Gangnam Style’ hit a chord with fans. But way before PSY’s notes permeated through the Indian shores, sometime in the early- to mid-2000s, a relatively young generation especially in Nagaland and Manipur had started watching Korean dramas and films. “Bollywood movies were banned in Manipur. Pirated CDs of K-dramas and movies were readily available in Moreh market along the Myanmar border,” says Kanozia. During those years, the most-watched TV channel in these states was the Korean channel Arirang TV. In 2008, the Nagaland government organised the first India-Korea music festival and Korean artistes regularly travelled to the state for events. K-pop and K-drama slowly flourished into a cultural phenomenon with beauty, language, and food, also adding up to the growing fandom. Since then, Hallyu has scaled insurmountable heights. How did a cultural sweep as vast as this happen? “It didn’t happen overnight,” says Theja Meru, advisor of Task Force for Music and Arts, a Nagaland government initiative for promoting music. His association with K-pop dates back to 2008 when he convinced the state government to sponsor the India-Korea Music Festival. It’s truly a big movement, says Meru, a musician and entrepreneur from Kohima, who believes there are many lessons to be learnt from the way Korean artistes have won over Indians. “They have worked so hard to put their systems in place and now is their time,” he says.  If Korean artistes worked hard to gain fandom in the country, then fans have had their share of arduous journeys. Ask Chennai resident Sanjay Ramjhi, 38-year-old founder of K Wave India group and a Korean language interpreter. In 2008, he and a group of friends with a shared love for Asian culture started watching Japanese, Chinese and Korean shows. But Korean took precedence and soon the group K Wave India was formed with 12 members. Today they have around 1,500 members. “It was quite accidental how I bumped into Korean shows. I was heavily into Japanese anime and even studied the language. My dream was to settle in Tokyo,” he says. One of the Japanese animes that he had watched had a soundtrack by a Korean singer and that led Ramjhi to discover K-pop and K-dramas. In 2012, when ‘Gangnam Style’ hit India, Ramjhi’s group had 50 members. It is the lead single of South Korean singer PSY’s sixth studio album, PSY 6, a pop and dance-pop song about a newly coined term ‘Gangnam Style’, which reflects the lifestyle of Seoul’s Gangnam District where residents are trendy and classy. The song took K-music to world status and topped the music charts of 30-odd countries, including the UK, Australia, Canada, France, Germany, Italy, Russia, and Spain, and came second in the US Billboard charts. ‘Gangnam Style’ was a testimony to India’s youth opening up to new cultures. Then there were no streaming giants and K-dramas on websites had no subtitles. “Only weeks after some fan had watched the entire series would they be able to translate and add subtitles. The wait was frustrating, as was watching it with subtitles. So I started learning Korean,” Ramjhi says. The Indo-Korean Cultural and Information (InKo) Centre in Chennai offered its premises to his group to hold meetings. But it wasn’t enough for Ramjhi. He wanted to dive deeper into Korean culture. He quit his profession of a decade, packed his bags and moved to Seoul to further master the language. “I stayed there for seven months,” he admits. Chennai has one of the largest expat communities in the country with over 6,500 Koreans. Today, Ramjhi works as an interpreter with Korean business houses. \n Culture Powerhouse\nAccording to Netflix’s ‘What India Watched in 2020’ report, the viewing for K-dramas on the streaming platform increased more than 370 percent compared to the previous year. Actors like Tiger Shroff, Kajol, and Diljit Dosanjh have openly acknowledged their admiration for K-dramas and K-pop. Three years back, music channel VH-1 started a segment specifically dedicated to K-pop. When global music-streaming giant Spotify launched in India, they weren’t prepared for Indians flocking to the channel for K-pop. “In its essence, K-pop is great, addictive music,” says Vasundhara Mudgil, head of communications – India, Spotify. The number of streams for K-pop doubled in 2020 and BTS was among the top five artists overall on Spotify. The music videos with well-choreographed dance moves or crossover trends, where mainstream English pop and K-pop merged, have worked well with listeners. Mudgil explains how tracks such as the all-English ‘Dynamite’ by BTS, the band’s ‘Boy With Luv’ featuring Halsey, and ‘Ice Cream’ and others featured among the top 10 most-streamed K-pop tracks in India. Furthermore, K-pop cuts across age groups and regions. “When we comprehensively studied the most-listened-to music among older users across regions in February 2020, the top tracks for 55+ females in Telangana were K-pop band EXO’s songs. The love for K-pop also spilled over to the same group in West Bengal, where Blackpink’s track featured in their top songs,” points out Mudgil. When MX Player, a popular Indian streaming app, decided to dub Korean shows into Hindi, it was a decision driven by demand for Asian content beyond martial arts. “Last year we noticed how our viewers sought more diverse content and Korean shows were exceptionally good. They had plot-led, sensitive dramas, which weren’t over the top and were high on engagement level. Consumers started taking to our dubbed shows organically,” says Mansi Shrivastav, senior vice president and head – content acquisition at MX Player. They currently have 20 shows on air with 100 percent increase in user base. “It’s not a fad, it is here to stay,” predicts Shrivastav. \n Case of Kimchi \nKorean restaurants have been gaining popularity over the years, breaking in as a niche into the Indian Chinese-Thai world of cuisine. Early this year, Urban Platter, a popular food delivery platform in Mumbai, ran out of Ramyun noodles, Gochujang (hot chilli paste) and Gochugaru (red chilli pepper flakes) due to surge in orders. It’s not uncommon for fans, like Gupta and Rana, to cook Korean delicacies at home. Influenced by K-dramas, Urban Platter sees over 2,000 individual units of Korean food items being sold monthly—the category being the most popular among other Asian cuisines. “K-dramas place a lot of importance on food. It’s beautifully presented. The food, beauty and fashion—you can adopt it all in your daily lives,” says Gupta. A few months back, KCC held a contest among several culinary institutes from across India. “We had 14 institutes who presented skilful Korean cooking. Through the various online platforms, around five lakh people watched it,” says Il-yong. Seo Young-doo would know. His company Korikart saw huge demand in instant noodles during the lockdown period. “Staying and working from home has resulted in the growing demand for noodles which serve as a one-pot kind of meal that cooks instantly,” he says. Every few days they had to replenish the stock. Korikart has products that fit into several categories such as K-Life, K-Food, K-Beauty, etc, to meet ever-growing demands from the customers. \n Beauty Brigade\nYoung-doo had started Korikart in 2018 after watching the surging interest around K-beauty. Many men and women dressed up at home even if they couldn’t go out and Instagrammed the photos. K-beauty had overtaken J-beauty (Japanese beauty regimen). Korean products such as serums and mask sheets shot up in demand as the pandemic put the focus on skincare over makeup. “People were logging on to our website for the latest skincare products,” he says. Exotic products made of horse oil and horse face cream, cushion sponges and snail mucus are innovations that have outstripped competition. Korean companies such as Innisfree and The Face Shop are well-known beauty brands in India. Even though J-beauty vied for attention, experts maintain, it has not permeated as well as K-beauty yet. “J-beauty is comparatively newer to the market. Even though K-beauty brands have been present in the market for some time now, it is only now with the growing popularity of K-pop and K-drama, that we see an increased demand in the country as the TV characters indulge in skincare routines on-screen,” says spokesperson of Nykaa, India’s premiere online retail platform for beauty products. Popular author Kiran Manral can vouch for it. She is awestruck by the focused attention Koreans pay to their skin. “My interest in K-beauty has certainly piqued after watching K-dramas,” says the 49-year-old Mumbai resident. Rana has started taking advice from a friend in Seoul on the trusted K-beauty products that she should buy. “I never cared much about the beauty products I used. But not anymore,” she says. The Korean ideal of flawless, mirror-like skin has prompted many Indian women and girls to switch their trusted skincare products for South Korean brands. “On the K-beauty front, consumers are intrigued by the glass skin concept and the origins of the ‘no-makeup’ makeup look,” says the Nykaa spokesperson. Besides Indian metros, demand for the company’s masks and sheets are peaking in tier 2 and tier 3 cities. Lessons on Language \nKCC has worked rigorously, since its inception in Delhi in 2012, to make Korean language lessons accessible to all. “The official request to add Korean language as a second language to NEP 2020 was made in June 2019,” says Il-yong. The addition to NEP allows students to opt for it as a second language from Class IX onwards. KCC has also been assisting in conducting pilot Korean classes in schools since 2015. Last year, they started Korean hobby classes in 10 schools, and in 2020, three schools in Delhi have selected Korean as a regular subject. Sri Venkateshwar International School is one such school. “After our induction into NEP, we are offering Korean as a third language to our students,” says Principal Nita Arora. Since 2010, the school has ties with several Korean schools. Besides language institutes, many Korean apps are available for learners. Rana has downloaded an app that teaches her basic Korean language. Ramjhi conducts free online Korean classes for members of his group. There are podcasts, online learning tools and several apps that help in basic language. “Our listeners have consumed podcasts such as ‘Learn Korean with David’, ‘Real Life Korean Conversations For Beginner’, as well as ‘Talk To Me In Korean - Core Korean Grammar’,” says Mudgil.\n Slice of Soft Power \nSo what has worked in favour of Hallyu in India?\nThere are multiple reasons, but at the heart of the popularity lies the unflinching production quality of shows. Be it the strong script of a K-drama or the exceptional music of K-pop, it offers something for everyone.  Manral, a new entrant to the K-drama craze, makes an important point. “They are often written from the female perspective, the women in them are the women I can connect with—urban, self-aware, yet living in a society that is highly patriarchal and must therefore deal with it at both home and the workspace,” she says. Gupta concurs, “More than 70 percent of the scriptwriters are women, so they showcase strong women characters. Though there are some tropes, the wider appeal lies in its ability to hit upon several critical issues ranging from mental health to dysfunctional families.” Ramjhi’s 73-year-old mother never sleeps without watching at least one episode of a K-show. “I took her to Seoul, we prepared our itinerary according to all the places and cafes she had seen in her favourite show,” Ramjhi recalls. \nThen there is the South Korean government, which has tirelessly worked backstage, to push this soft power slowly across the globe. The financial crisis of 1997 played a crucial part in expanding Hallyu as its aftermath led Korea to explore new export markets. “Increased visibility of Korean content on the internet, first on websites and then OTT platforms and social media aided this growth,” observe Kanozia and Ganghariya. Even though almost all countries invest in cultural ties for diplomatic gains, yet the way the South Korean government worked towards it is a case for several research studies. “Cultural diplomacy has been the main essence and strategy in our recent international relations and diplomacy,” says Il-yong. Clearly, the country puts much premium on how cultural diplomacy helps develop relations. Hence, it’s not surprising that K-pop at $5 billion should be one of South Korea’s biggest exports. Even though South Korean cinema has acquired international following since the late 1990s, the audience was largely restricted to cinema lovers. But last year’s Oscar win Parasite has changed it all. The Bong Joon-ho-directed dark comedy is the first non-English film to win the best picture Oscar. It is also the first South Korean film to get a theatrical release in India. The American cultural influence on Indians is still strong. But embracing Korean culture requires a fair amount of work to overcome the language limitations. But followers are unperturbed. So will Hallyu stay? “Yes, unless some other sub-culture establishes itself equally firmly. Japanese could have done it a few years back when anime bowled the youth over. But it didn’t. Also, Hallyu has cut across age and gender barriers,” says Ramjhi. \nJapan’s loss is Korea’s gain. Meanwhile, Gupta is busy with online consultations of customers who come to her with Pinterest mood boards of their favourite Korean stars. At StyleNook, it’s another day of creating Hallyu-inspired outfits for fans by another fan. Drama\nFor rom-com, teen watch Boys Over Flowers, romance is incomplete without Crash Landing on You, Signal for lovers of thriller shows, it’s suspense with Healer, for fantasy genre, it’s Goblin and a \ncomplete drama with My Mister, fall in love with ghosts from Tale of Arang, and for an occult thriller, watch Possessed Beauty\nMask sheets and serums are important. Choose between a minimum of six and maximum of 10 steps. Start with double-cleansing followed by exfoliation, and toning. Follow it up with an essence or serum, an eye-cream, lip balm, face moisturiser and a night mask sheet. Music\nIt started with Seo Taiji’s ‘I Know’, moved to Super Junior, briefly took a pause with PSY and Glee and\nfinally found its groove with BTS, Blackpink and EXO Food\nRamyen, kimchi, miso, gochujang and gochugaru are easy to order and available on several food platforms. Standalone Korean cafes and fine-dining options are available in all cities. Language\nBesides institutes, there are several free apps and online learning platforms like Duolingo, Learn Korean, Korean Letter, to name a few “When we studied the most-listened-to music among older users across regions in February 2020, the top tracks for 55+ females in Telangana were K-pop band EXO’s songs. The love for K-pop also spilled over to the same group in West Bengal, where Blackpink’s track featured on top.”Vasundhara Mudgil, Head of Communications - India, Spotify 5 Korean Films Remade by Bollywood A Bittersweet Life into Awarapan \nAn unofficial remake, this film fared decently and won praise for actor Emraan Hashmi Seven Days into Jazbaa \nWhile it won Korean actor Kim Yun-jin the Grand Bell Award for best actress, Aishwarya Rai Bachchan didn’t meet with the same luck Montage into Teen \nThe drama-thriller film’s rights were bought by producer Sujoy Ghosh and with veterans such as Amitabh Bachchan and Vidya Balan, it made its mark Ode to My Father into Bharat\nThe fourth-highest grossing film in South Korean history, the Indian version scored well at the global box office but failed to impress people back home The Outlaws into Radhe\nOriginally featuring Ma Dong-seok and Yoon Kye-sang, Radhe will be less violent and sexual than its Korean counterpart Plotting a Connection The Great Money Divide\nPoor girl-rich guy or the vice versa plot is perhaps most overdone in K-dramas and the Indian film industry. \nK-drama: Heirs, Flower Boy Ramen Shopu Nice Guys Finish Last\nHow many times have we thought, “She should have fallen in love with him, but she’s stupid”? The second male lead is often rich, caring and gorgeous. But he never gets the girl. Never. \nK-drama: Fated to Love You, She Was Pretty Ugly Duckling to Preening Swan\nTried and tested for ages, filmmakers never tire of this one. There is always a disguised stunner, before she is magically transformed by a fairy godmother-of-sorts.  \nK-drama: Dream High, Oh My Venus Love to Hate You, Hate to Love You\nIf one of the leads says to the other, “I hate you”, be sure that by intermission, the so-called hate would have turned into love. \nK-drama: Divorce Lawyer in Love, Falling for Innocence The Evil Uber-Rich Family\nThe Korean film industry may not have heard of the viral “Rasode mein kaun tha?” meme, but they have been following the plotline for ages. The elitist rich family is always evil incarnate. \nK-drama: Boys Over Flowers, Birth of a Beauty The Memory Twist\nIt’s over-the-top, but the makers can’t seem to get enough of it. Also, the lead or the second lead conveniently losing or recovering his/her memory in most cases is the perfect last-minute plot device to guarantee a twist. \nK-drama: Boys Over Flowers Growing Up Into Lovers \nHe/she has always been by your side. Sharing secrets, sharing cigarettes, saving one another from the family’s wrath and more. And then, love happens. \nK-drama: Panda and Hedgehog, Bubblegum Childhood Trauma \nThe lead has some childhood memory that he/she would rather keep buried. This often adds to the plot and brings in a heightened sense of mystery.\nK-drama: It’s Okay, That’s Love; Tomorrow Cantabile Top K Dramas Crash Landing on You A South Korean business tycoon lands in North Korea and what follows is a story of love, loss and revenge My Mister The show centres around three middle-aged brothers, one an engineer whose personal life falls apart Goblin The fantasy drama follows the life of a 939-year-old Goblin Healer: An action drama interspersed with a love story about a night courier, tabloid journalist and a TV reporter. Signal A crime drama around a police lieutenant, a criminal and a special walkie talkie that can communicate with people from the past It’s Okay not to be Okay Rarely has a show dealt with mental illness and trauma with such sensitivity Boys Over Flowers It has everything related to adolescence and growing up Descendants of the Sun A love story between a Korean Special Forces captain and a surgeon in the backdrop of a war-torn country “The bond with Korean is not a millennial fad. My journey started almost a decade and a half back. It has made me shift careers and countries.” Sanjay Ramjhi, founder, K Wave India group, & Korean language interpreter The K-lingo Hello Ahan-nyong-ha-se-yo Dad and Mom Appa and omma Please Jwe-song-ha-ji-mahn Thank you Gahm-sah-hahm-ni-da Yes and No Neh & Ah-nee-oh Goodbye Anney-ong “K-dramas place a lot of importance on food. It’s beautifully presented. The food, beauty and fashion—you can adopt it all in your daily lives.”  Arti Gupta, Co-founder, StyleNook, Mumbai-based fashion tech personal styling firm From Korean OTT serials to K-beauty, from K-language schools to K-pop, from K-food to K-diplomacy, India’s love affair with South Korea has gone mainstream. Hallyu 2.0 is unstoppable as a cultural force among youth and the old alike. Follow The New Indian Express channel on WhatsApp O\n    P\n    E\n    N Comments  Disclaimer : We respect your thoughts and views! But we need to be judicious while moderating your comments. All the comments will be moderated by the newindianexpress.com editorial. Abstain from posting comments that are obscene, defamatory or inflammatory, and do not indulge in personal attacks. Try to avoid outside hyperlinks inside the comment. Help us delete comments that do not follow these guidelines. The views expressed in comments published on newindianexpress.com are those of the comment writers alone. They do not represent the views or opinions of newindianexpress.com or its staff, nor do they represent the views or opinions of The New Indian Express Group, or any entity of, or affiliated with, The New Indian Express Group. newindianexpress.com reserves the right to take any or all comments down at any time. The Morning Standard | Dinamani |  Kannada Prabha |  Samakalika Malayalam | Cinema Express  |   Indulgexpress  |  Edex Live  | Events Xpress Contact Us | \nAbout Us | Privacy Policy | \nTerms of Use | Home |  Nation |  World |  Cities |  Business |  Columns |  Entertainment |  Sport |  Magazine |  The Sunday Standard Copyright - newindianexpress.com 2023. All rights reserved. Website Designed, Developed & Maintained by Express Network Private Ltd. ",
    "datetime": null,
    "url": "https://www.newindianexpress.com/lifestyle/fashion/2021/feb/07/the-k-wave-2259656.html"
}