{
    "title": "The fourth wave of feminism: meet the rebel women | Feminism | The Guardian",
    "text": "The campaign for women's liberation never went away, but this year a new swell built up and broke through. Since the early summer, I've been talking to feminist activists and writers for a short book, All The Rebel Women, and as I tried to keep up with the protests, marches and talks, my diary became a mess of clashing dates. The rush was such that in a single weekend in October, you could have attended a feminist freshers' fair in London, the North East Feminist Gathering in Newcastle, a Reclaim the Night march in Edinburgh, or a discussion between different generations of feminist activists at the British Library (this sold out in 48 hours, was moved to a room four times bigger, and sold out again). You could have joined one of the country's 149 local grassroots groups, or shared your experience of misogyny on the site Laura Bates, 27, started in April 2012. Her Everyday Sexism Project has proved so successful that it was rolled out to 17 countries on its first anniversary this year, tens of thousands of women worldwide writing about the street harassment, sexual harassment, workplace discrimination and body-shaming they encounter. The project embodies that feminist phrase \"the personal is political\", a consciousness-raising exercise that encourages women to see how inequality affects them, proves these problems aren't individual but collective, and might therefore have political solutions. This year, 6,000 stories that have been sent to the project about harassment or assault on public transport – the majority never reported to authorities – were used to train 2,000 police officers in London, and create a public awareness campaign. In its first few weeks, says Bates, the reporting of harassment on public transport soared. Everyday Sexism currently has more than 108,000 followers on Twitter. Of course, following a social media account isn't the same as joining a political party, but to put this engagement in perspective, Tory membership is now at 134,000. Welcome to the fourth wave of feminism. This movement follows the first-wave campaign for votes for women, which reached its height 100 years ago, the second wave women's liberation movement that blazed through the 1970s and 80s, and the third wave declared by Rebecca Walker, Alice Walker's daughter, and others, in the early 1990s. That shift from second to third wave took many important forms, but often felt broadly generational, with women defining their work as distinct from their mothers'. What's happening now feels like something new again. It's defined by technology: tools that are allowing women to build a strong, popular, reactive movement online. Just how popular is sometimes slightly startling. Girlguiding UK introduced a campaigning and activism badge this year and a summer survey of Mumsnet users found 59% consider themselves feminists, double those who don't. Bates says that, for her, modern feminism is defined by pragmatism, inclusion and humour. \"I feel like it is really down-to-earth, really open,\" she says, \"and it's very much about people saying: 'Here is something that doesn't make sense to me, I thought women were equal, I'm going to do something about it.'\" As 2013 unfolded, it became impossible to ignore the rumble of feminist campaigners, up and down the country. They gathered outside the Bank of England in early July, the first burst of a heatwave, dressed as aviators, suffragettes and warrior queens, organised by Caroline Criado-Perez, 29, shouting for women's representation on bank notes and beyond. They demonstrated outside the Sun headquarters, organised by Yas Necati, 17, in a protest against Page 3, the biggest image of a woman that appears each day in the country's biggest-selling newspaper – a teenager or twentysomething smiling sunnily in her pants. Necati, a student at sixth-form college, laughed shyly as she told me about the mocked-up pages she has sent Sun editor David Dinsmore, suggesting feminist comedians, artists and writers to appear on the page instead. One of her favourites showed a woman flashing bright blue armpit hair. The the No More Page 3 petition started by Lucy-Anne Holmes, 37, in August 2012,, has been signed by 128,000 people. Ikamara Larasi, 24, started heading a campaign to address racist and sexist stereotypes in music videos, just as students began banning summer hit Blurred Lines on many UK campuses, in response to its sexist lyrics. Jinan Younis, 18, co-founded a feminist society at school, experienced online abuse from some boys in her peer group – \"feminism and rape are both ridiculously tiring,\" they wrote – and wasn't deterred. Instead, she wrote an article about it that went viral. When I spoke to her in September, she was juggling shifts in a call centre, babysitting for neighbours, preparing for university, while helping out with a campaign to encourage feminist societies in schools countrywide. UK Feminista, an organisation set up in 2010 to support feminist activists, has had 100 people contact them this year, wanting to start their own school group. In late August, their national day of action against lads' mags included 19 protests across the UK. Thousands more feminists raised their voices online. Bates and Soraya Chemaly, 47, were among those who set up a campaign against misogynist pages on Facebook, including groups with names such as \"raping a pregnant bitch and telling your friends you had a threesome\". Supporters sent more than 60,000 tweets in the course of a swift, week-long push, convincing the social media behemoth to change its moderation policies. Southall Black Sisters protested outside the offices of the UK Border Agency against racist immigration laws and propaganda – including the notorious \"Go Home\" vans. They also marched in solidarity with protesters in Delhi, who began a wave of demonstrations following the death of a woman who was gang raped in the city last December, protests against rape culture that soon spread to Nepal, Bangladesh, Pakistan and Sri Lanka. The African LGBTI Out & Proud Diamond Group demonstrated opposite Downing Street after allegations emerged of the sexual abuse of women held at Yarl's Wood immigration removal centre. The Fawcett Society continued to show how cuts to benefits, services and public-sector jobs pose \"triple jeopardy\" to women (in 2013 women's unemployment reached a 26-year high). Rape Crisis South London spearheaded a successful campaign to criminalise the possession of pornography that depicts rape. And 40 Days of Choice challenged the anti-abortion campaigners who have become worryingly prominent in the UK recently. The Edinburgh fringe hosted a surprising run of feminist comedians, including Mary Bourke, with her show Muffragette. Bourke memorably noted in a BBC interview this summer that the open-mic circuit has become a \"rape circle\" in recent years. Feminist standups were ready to respond. Nadia Kamil, 29, performed a set including a feminist burlesque, peeling off eight layers of clothing to reveal messages such as \"pubes are normal\" and \"equal pay\" picked out in sequins. She also explained the theory of intersectionality through a vocoder, and gave out badges with the slogan \"Smash the Kyriarchy\". (She hoped audience members would look up any words they were unfamiliar with later, such as \"kyriarchy\" and \"cis\".) Bridget Christie, 42, won the Foster's Edinburgh comedy award with A Bic for Her, in which she railed against sexist comments by racing driver Stirling Moss, and talked about \"ethical filing\" – taking sexist magazines off shop shelves and dumping them straight in the bin. She wasn't encouraging other people to do this, she emphasised. She just wanted to point out that she had been doing it for months – months – with no problem at all. Women marched through London for Million Women Rise and Reclaim the Night, and organised events in 207 countries for One Billion Rising, a day of demonstrations to highlight the UN statistic that one in three women will be raped or beaten in her lifetime. As part of this event, the UK parliament debated whether sex and relationship education should be on the national curriculum, and six months later, in her summer holidays, Lili Evans, 16, started the Campaign4Consent with Necati, calling for consent education in schools. A chorus rose against online misogyny. Criado-Perez highlighted the string of rape threats sent to her on Twitter, writer Lindy West published the comments she received, (\"There is a group of rapists with over 9,000 penises coming for this fat bitch,\" read one), and the academic and broadcaster Mary Beard, Lauren Mayberry from the band Chvrches, and Ruby Tandoh from The Great British Bake Off, all spoke out on this issue. If you want to know how deeply some people resent the idea of women's advancement, the stream of online misogyny has been perhaps the most obvious, ugly backlash yet. But bald attempts to silence women only made the movement larger and louder. They convinced those who had never thought about misogyny before that it was clearly still alive, and convinced those who were well aware of it to keep going. When Nimko Ali, 29, spoke out against female genital mutilation, with her group, Daughters of Eve, she received death threats. She kept speaking strongly, wittily, discussing both her own experience of FGM and her \"fanny forward\" list of supporters, putting an issue long marginalised firmly on the political agenda. In November, Alison Saunders, the new Director of Public Prosecutions, suggested she expected the first prosecution for FGM to happen in the UK fairly soon. Some of those leading the biggest campaigns, including Bates, only started calling themselves feminists in the last few years, which shows how nascent this wave is. Larasi bursts out laughing when I ask if she has always considered herself a feminist. \"Definitely not,\" she says. She has been working at the black women's organisation Imkaan for three or four years, and was raised by a feminist mother, but it was only last year that she started using the term to describe herself. She began identifying specifically as a black feminist in February 2013. This means she doesn't feel she has to \"pick a side\", she says, between the movements for women's rights and for racial equality, and she is now a member of the thriving Black Feminists group in London – there is also one in Manchester. The majority of activists I speak to define themselves as intersectional feminists – or say they try to live up to this decription – and when I mention this to Kimberlé Crenshaw, the US law professor who coined the term intersectionality in 1989, she's genuinely surprised. The theory concerns the way multiple oppressions intersect, and although, as Crenshaw says, it can be interpreted in a wild variety of ways, today's feminists generally seem to see it as an attempt to elevate and make space for the voices and issues of those who are marginalised, and a framework for recognising how class, race, age, ability, sexuality, gender and other issues combine to affect women's experience of discrimination. Younis considers intersectionality the overriding principle for today's feminists, and Ali says she constantly tries to check her privilege, to recognise how hierarchies of power are constructed. There are women and men of all ages involved in this movement – at a Lose the Lads' mags protest in York, for instance, I met an activist who had been at the women's liberation conference in 1978. But many of those at the forefront are in their teens and 20s, and had their outlook formed during decades in which attitudes to women were particularly confusing. They grew up being told the world was post-feminist, that sexism and misogyny were over, and feminists should pack up their placards. At the same time, women in the public eye were often either sidelined or sexualised, represented in exactly the same way as they had been in the 70s, albeit beneath a thin veil of irony. Finn Mackay says when she started the London Feminist Network in 2004, the two main issues motivating those who joined were the massive growth of the beauty industry, and \"pornification\" – the infiltration of pornographic imagery into the mainstream via Playboy-branded pencil cases, for instance, and the trend for pubic waxes. Those concerns have continued, and help explain the focus of many current feminist campaigns, which address the wallpaper of women's lives, the everyday sexism – lads' mags, Page 3, rape pages on Facebook, cosmetic surgery advertising – and calls for positive representation on bank notes and in broadcasting. But the feminist consciousness of the fourth wave has also been forged through the years of the financial crash and the coalition government, and many activists have been politicised and influenced by other movements, particularly the student campaign against fees, but also the wider campaign against cuts and the Occupy movement. The quick, reactive nature of many of the feminist campaigns cropping up today reflects the work of activists more generally in a biting world of unemployment and under-employment, workfare, zero-hours contracts, bedroom taxes, damaging rhetoric against immigrants, the disabled and those who need support from the state. With so many pressing issues, feminists are fighting on several fronts, and the campaigns of the past few years have often been started by individuals or small groups, who have responded to issues they feel strongly about, and can usefully address. Holmes and Necati both grew up with the Sun at home, which has shaped their opposition to Page 3. Criado-Perez was outraged by all-male discussions of teenage pregnancy and breast cancer treatment on the Today programme, so set up a database of female experts, The Women's Room, with Catherine Smith in 2012. In the first three days of that year, seven women were killed by men, and Karen Ingala Smith, chief executive of the charity Nia, started counting the toll of misogynist murders. Her Counting Dead Women project puts names and stories to the statistics we often hear, and is asking the government to take an integrated approach to understanding violence against women. There are, of course, differences of opinion when it comes to which subjects feminism should be addressing. How could there not be, in a movement that represents half the population, and aims for liberation for all? But what's exciting about these individual campaigns is the way they're building a movement capable of taking on structural, systemic problems. As the philosopher Nina Power notes, there are teenage girls today, growing up with Twitter and Tumblr, who have a perfect grasp of feminist language and concepts, who are active on a huge range of issues – some of those I talk to are starting to work on economic analyses of women's predicament, the ways in which neo-liberal policies such as the rolling back of the state and low taxes for the rich, have shaped modern inequalities. The movement's concerns are forever shifting, and will likely do so powerfully when some of today's young activists encounter the pay gap, childcare costs and pregnancy discrimination in their own lives. \"What is it going to be like,\" says Power, \"to have this generation of people who are totally attuned to all these terms and categories and thinking through all these issues from a very young age?\" Brought up to know they are equal to men, fourth-wave feminists are pissed off when they're not treated as such, but have more than enough confidence to shout back. Misogynists, watch out. All the Rebel Women: The rise of the fourth wave of feminism by Kira Cochrane is out now as a Guardian Shorts Originals ebook (£1.99). Visit guardianshorts.com to find out more. ",
    "datetime": "2013-12-10T18:55:00.000Z",
    "url": "https://www.theguardian.com/world/2013/dec/10/fourth-wave-feminism-rebel-women"
}