{
    "title": "The Next Cycle of Capitalism | INSEAD Knowledge",
    "text": "Strategy   “I suppose it’s tempting, if the only tool you have is a hammer, to treat everything as if it were a nail.” -  Abraham Maslow (1908-1970) In the 1930s, the Soviet Union asked Nikolai Kondratieff, a mathematician, to create a model that would “prove” that capitalism would fall and communism would endure. Kondratieff studied economic history and reached the conclusion that economics was better explained by technology than class struggle. He observed that technology did not evolve linearly, but rather in leaps every 50 to 60 years. Named for the mathematician who made it famous, this pattern is called Kondratieff cycles or K-waves. K-waves have been studied since and confirmed via spectral analysis. There is some controversy about the number of cycles and when they begin. Table 1 shows our own interpretation of the cycles and their defining technology. Table 1 – Kondratieff Cycles  Our main research hypothesis involves the end of the fifth, and current cycle, as well as the existence of a sixth cycle. The Crisis of 2015-2030 Each Kondratieff cycle ends with a general crisis. Karl Marx predicted capitalism as crisis-prone and believed this would lead to it falling apart. But Kondratieff found that capitalism reinvented itself with each crisis. As the saying goes, “desperate times require desperate measures” - giving rise to new solutions, investment in technology and new business models. These periods of crisis or struggle generally last between 12-15 years and eventually a new form of capitalism emerges. We seem to be in a period of struggle now. Based on past trends, the predicted crisis of the current Kondratieff cycle should take place between 2015 and 2030. When future economists or strategists look back, the refugee wave that hit Europe in 2015 may be considered the triggering event. Table 2 lists the main conflicts of each “crisis sub-phase” – the struggle that marks the end of each Kondratieff cycle. Table 2 – Crisis Sub-phases of Kondratieff Cycles  World War II and the generation after are considered outside the crisis sub-phase of the cycles. The 1939-1945 period was one of intensive technological development and economic growth, in the face of massive destruction. The post-war period gave us strong and fast expansion with a new public “business model” of the Welfare State. Hence, the 1950s are still known as the “golden age”. That model worked until the 1970s when it was reformed. As was the case at the end of other K-waves, “desperate times require desperate measures”. People are investing in new technologies and thinking out-of-the-box, trying new things and accepting the previously unacceptable. This is when a set of new technologies that had been too risky to develop becomes more feasible due to an increased tolerance of risk. A new technological revolution is brewing. This means organisations must tailor their strategies and business models accordingly. How business models will evolve When technology changes and capitalism adapts, business models evolve for companies to stay profitable. Business models have been around since the foundation of capitalism. There was a banking business model as far back as the 10th century. As capitalism evolved, especially after the Industrial Revolution, so did business models. A business model should not be designed with rigid components. It must have the real capacity to support the creation of revenues and profit in an organisation. For example, Casadesus-Masanell and Ricart used Ryanair, the low-cost airline, to illustrate business model components:  As technology and the economy co-evolved new business models were created. Models like retail businesses, public companies, franchises, manufacturing, licensing, joint ventures, Private-Public Partnerships, umbrella brands, multinational corporations, venture capital, holdings, and trusts have all been developed to cope with an increasingly complex world. Co-evolution between technology and the economy has not ceased, and business models must match increased complexity in the future. The technological revolution of 2030-2050 The next technological revolution will force another reinvention of capitalism. We have recently seen the invention of new extra-national currencies, such as bitcoin, and commercial transactions are focused on reducing bureaucratic barriers between the provider of labour and monetisation, like PayPal. Understanding the final user becomes a priority in this new dynamic business model. The user may change over time and businesses must be flexible. Drones, for example, were created for military use yet they are also used as toys or in agriculture to dust crops with insecticide. In our current age, many objects are designed for entertainment but, given time and user consideration, they can be used in practical ways as well. Managers must continue to look for new alternatives to maintain value creation. The search for value creation is ongoing. After examining R&D budgets from around the world, we can envision six major trends possibly emerging: A new cycle? Will businesses be able to adapt? We have something that none of our predecessors had: big data. The ability to crunch numbers to simulate future scenarios is a unique power that could impact the technological cycles going forward. Looking back over Kondratieff’s Cycles, one aspect we cannot control is government. The political decision-making power of a handful of countries is the independent variable. This variable could decide our future and whether capitalism as we know it will continue. Businesses should also be aware of, and tailor their strategies and business models to, hegemonic cycles and their effects. Hegemonic stability theory indicates that international relations are more stable when a single nation is a dominant world power, or hegemon. Hegemonic cycles tend to run for 100-140 years before entering a period of transition and a new stability cycle. It remains to be seen whether we are at the end of America’s dominance as the global hegemon. Fabian Salum is a Professor of Strategy and Innovation Management at Fundação Dom Cabral and Visiting Scholar at INSEAD. Paulo Vicente dos Santos Alves is a Professor of Strategy at Fundação Dom Cabral. Follow INSEAD Knowledge on Twitter and Facebook. is a Professor of Strategy and Innovation Management at Fundação Dom Cabral. Paulo Vicente dos Santos Alves is a Professor of Strategy at Fundação Dom Cabral in Brazil. Urooj fatima 12/09/2022, 07.46 pm Undoubtedly, we are going thorough the winter season of the 5th Kondrateiff wave. The ongoing pandemic has created a long lasting global economic recession. We are witnessing food shortage, inflation and severe economic crisis which are coupled with deadly diseases  and climate change.\nWe have immensely improved in technology and we have incoorporated technology with  alomost every field of life ranging from health to education, politics to military,, agriculture to space, industries to market places, transportation to communication so on and so forth. I believe, We have acheived so much yet we are moving towards worst days these ongoing crises are going to last longer than we have predicted. The positive point is we can try to better prepare ourselves and next generation. Undoubtedly, we are going thorough the winter season of the 5th Kondrateiff wave. The ongoing pandemic has created a long lasting global economic recession. We are witnessing food shortage, inflation and severe economic crisis which are coupled with deadly diseases  and climate change. We have immensely improved in technology and we have incoorporated technology with  alomost every field of life ranging from health to education, politics to military,, agriculture to space, industries to market places, transportation to communication so on and so forth. I believe, We have acheived so much yet we are moving towards worst days these ongoing crises are going to last longer than we have predicted. The positive point is we can try to better prepare ourselves and next generation.  Anonymous User 02/03/2017, 04.27 am Not only the refugees are maybe a sign that we are in the verge of a new cycle, but the loss of credibility in our instittutions: Wikileaks, Panama Papers, hate-to-politicians, trigger-warnings, not knowing how to debate or propose something different because if I don't like it I can: stop watching, unfollowing, blocking, open another app, stream another song, etc.\nI love technology for what its capable, but I think it has a bit of a dark side. Not only the refugees are maybe a sign that we are in the verge of a new cycle, but the loss of credibility in our instittutions: Wikileaks, Panama Papers, hate-to-politicians, trigger-warnings, not knowing how to debate or propose something different because if I don't like it I can: stop watching, unfollowing, blocking, open another app, stream another song, etc. I love technology for what its capable, but I think it has a bit of a dark side. Strategy  Economics & Finance  Responsibility  This website is part of INSEAD Digital Ecosystem © 2023 INSEAD INSEAD does not discriminate on the basis of race, gender, religion, age, sexual orientation, disability, colour, or national or ethnic origin. Our website has a lot of features which will not display correctly without Javascript. Here how you can do it: http://enable-javascript.com ",
    "datetime": "2017-02-17T17:54:00+0800",
    "url": "https://knowledge.insead.edu/strategy/next-cycle-capitalism"
}