{
    "title": "The Hunt for Elusive Gravity Waves Heats Up | Space",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works.  In the next five years or so, scientists are poised to discover proof that space and time can wrinkle in the form of gravitational waves. These waves were predicted almost 100 years ago by Albert Einstein's general theory of relativity, but have yet to be seen. That could change soon when the latest, most sensitive experiments hunting gravitational waves come online. \"There's so much activity and excitement in the field right now,\" said Mansi M. Kasliwal, an astronomer at the Observatories of the Carnegie Institution for Science in Pasadena, Calif. \"The momentum is really building.\" Kasliwal is the author of a paper published online today (May 2) in the journal Science describing the burgeoning field of gravitational wave studies. [The Search for Gravity Waves (Gallery)] According to general relativity, massive objects warp space and time around them, like a bowling ball dropped onto a sheet of rubber, causing passing objects, and even light, to travel along curved paths. When two extremely dense objects, such as neutron stars (stars so dense the protons and electrons in their atoms collapse to form neutrons) or black holes, orbit each other in binary pairs, their interactions should create ripples in the fabric of space-time called gravitational waves. The most powerful waves would arise when two neutron stars or black holes merge together.  Those waves should be detectable by experiments called Advanced LIGO (Laser Interferometer Gravitational Wave Observatory) and Advanced Virgo, set to come online in 2017. They will each use giant L-shape detectors in Louisiana, Washington and Italy to search for minute changes in the lengths of the detectors' arms caused when gravity waves pass through. At the corner of the \"L,\" a laser is split into two beams that travel back and forth down the length of the two arms (each between 1.2 miles, or 2 kilometers, and 2.5 miles, or 4 kilometers, long), bouncing off mirrors at each end. If a gravitational wave passed through, it would stretch and compress these lengths, depending on its orientation, creating a small but detectable difference in the length of the two arms. Initial versions of LIGO and Virgo are already operating, but aren't yet sensitive enough to detect gravitational waves. When they are upgraded to higher sensitivities, though, they should reveal hidden gravitational waves for the first time. These observations wouldn't just prove the existence of gravitational waves, they would offer unprecedented information about the rare and extreme cosmic phenomena that create them. \"I think the confidence level is quite high\" that the advanced experiments will see gravitational waves, Kasliwal told SPACE.com. \"The sensitivity is now such that if Einstein's general relativity is right, then we should see these things.\" She estimated that the experiments are likely to detect between four and 400 gravitational waves a year. \"But zero would be quite a disaster. We'd need to rethink our understanding of gravity.\" When a gravitational wave is spotted, it will likely trigger a global collaboration to attempt to find the source of the wave in the sky. By comparing the signals seen at the various detectors around the world, scientists can get a better idea of which direction the wave came from. Then they can point telescopes toward that spot and search for light that flared at the same time, potentially finding more clues about what happens when black holes collide. \"If you see spatial coincidence and temporal coincidence, this is something truly new that we haven’t seen before,\" Kasliwal said. Follow Clara Moskowitz on Twitter and Google+. Follow us @Spacedotcom, Facebook and Google+. Original article on SPACE.com. Join our Space Forums to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at: community@space.com. Breaking space news, the latest updates on rocket launches, skywatching events and more! Clara Moskowitz is a science and space writer who joined the Space.com team in 2008 and served as Assistant Managing Editor from 2011 to 2013. Clara has a bachelor's degree in astronomy and physics from Wesleyan University, and a graduate certificate in science writing from the University of California, Santa Cruz. She covers everything from astronomy to human spaceflight and once aced a NASTAR suborbital spaceflight training program for space missions. Clara is currently Associate Editor of Scientific American. To see her latest project is, follow Clara on Twitter. Shortest 'fast radio bursts' ever discovered last only 1 millionth of a second NASA's interstellar Voyager probes get software updates beamed from 12 billion miles away NASA's OSIRIS-REx mission officially surpasses asteroid sample size goal By Sharmila KuthunurOctober 23, 2023 By Robert LeaOctober 23, 2023 By Aaron W. HarrisonOctober 23, 2023 By Sharmila KuthunurOctober 23, 2023 By Harry BakerOctober 23, 2023 By Elizabeth HowellOctober 23, 2023 By John LoefflerOctober 22, 2023 By Ben TurnerOctober 22, 2023 By Jeff SpryOctober 22, 2023 By Samantha MathewsonOctober 22, 2023 By Paul SutterOctober 22, 2023 Space is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site. ©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. ",
    "datetime": "2013-05-02T18:06:47Z",
    "url": "https://www.space.com/20939-gravitational-wave-detector-search.html"
}