{
    "title": "The 9 Must-See Museum Shows During Frieze Week, From Carolee Schneemann’s First U.K. Retrospective to Cecilia Vicuña’s Turbine Hall Installation",
    "text": "Our top picks around town. Jo Lawson-Tancred, \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 11, 2022 With no shortage of world class museums, London usually boasts a good roster of unmissable exhibitions. For the art crowds that flock to the U.K. for Frieze Week, the city is putting its best foot forward with a bumper offering of Modern and contemporary art exhibitions. Fairgoers who need a break the frenzied bustle and want to see more of what London has to offer outside of Regent’s Park and pop-up tents will no doubt feel spoilt for choice. Here is a round-up of nine of London’s must-see museum shows this week.  “Carolee Schneemann: Body Politics” installation view at the Barbican Art Gallery, 2022. Photo: Lia Toby/Getty Images. The first U.K. survey of radical American artist Carolee Schneemann, who died in 2019, introduces a whole new audience to her transgressive feminist practice. The Barbican Art Gallery has ample space to house more than 300 objects, including large-scale installations, that give a comprehensive overview of just how varied Schneemann’s output of films, paintings, assemblages, performances, scrapbooks and costumes was over her 60-year career. As the title promises, visitors will learn how Schneemann’s body was often her most enduring medium in a series of works that still serve today as bold challenges to a male-dominated art world. “Carolee Schneemann: Body Politics”, Barbican Centre, Silk Street, EC2Y 8DS.  Installation image of Hallyu! The Korean Wave at the V&A. Photo: Ⓒ Victoria and Albert Museum, London. This exploration of South Korea’s vast and multifaceted international cultural influence takes its name from the 1990s phenomenon of “hallyu”, or “Korean wave,” which refers to the global popularity of Korean culture. An overview of the country’s modern history leads us from war through military rule and into an era of rapid industrialization. With objects ranging from a 1980s sculpture by the video art pioneer Nam June Paik right through to many viral sensations from very recent memory, including K-Pop superstars, the hit Netflix drama Squid Game and Bong Joon-Ho’s Oscar-winning film Parasite, the exhibition proves that this mania shows little sign of slowing down. “Hallyu! The Korean Wave,” Victoria & Albert Museum, Cromwell Road, SW7 2RL.  Installation view of “Kamala Ibrahim Ishag: States of Oneness” at Serpentine South Gallery. Photo: George Darrell, courtesy Serpentine. For her first solo exhibition in London, the Sudanese artist Kamala Ibrahim Ishag, now in her 80s, returns to a city that has been woven into her practice since the start. The most historic works on show date back to the 1960s, when Ishag was a student at the Royal College of Art, while other objects relate to a period of self-exile in London during the 1990s and 2000s. Sudanese life, history, spiritualism and culture are the primary themes running through her art, specifically as those subjects relate to the experiences of women. Among the newest pieces are two paintings, Bait Al-Mal (2019) and Blues for the Martyrs (2022), which both reflect on the devastating loses of the Khartoum Massacre on June 3, 2019. “Kamala Ibrahim Ishag: States of Oneness,” Serpentine South Gallery, Kensington Gardens, W2 3XA.  Installation view of Hyundai Commission: Cecilia Vicuna at Turbine Hall, Tate Modern. Photo by Matt Greenwood; © Tate. The latest artist to take on the Turbine Hall at Tate Modern, one of London’s hottest annual commissions, is the Chilean artist and poet Cecilia Vicuña. Using the same ancient Andean-influenced methods, her works range in scale from the tiny sculptures that make up the Precarios series to her vast textile installations, including Quipu Womb, an exploration of feminine energies which was recently acquired by the Tate. This latest commission, Brain Forest Quipu, uses found objects like plant fibre, rope, cardboard and wool to reflect on the destruction of the rainforest both as a driver of the climate crisis and as an act of violence against indigenous communities. “Hyundai Commission: Cecilia Vicuña,” Tate Modern, Bankside, SE1 9TG.  Installation view of “Maria Bartuszová” at Tate Modern. Photo: courtesy of Tate Modern. In another of many firsts for London this week, the Slovakian abstract sculptor Maria Bartuszová receives her first substantial exhibition in the UK, just coinciding with the inclusion of her work in the “Milk of Dreams” curated exhibition at the 59th Venice Biennale. Giving a sense of the breadth of her exploration into sensual, suggestive and organic forms, more than 80 plaster works have been staged beside bronze casts and aluminum reliefs. The show also sheds light on how Bartuszová’s life was affected by totalitarianism and the Cold War, crucial context that highlights the considerable struggles that she overcame to establish herself as a pioneering woman on the international art scene. “Maria Bartuszová,” Tate Modern, Bankside, SE1 9TG.  Lucian Freud, Bella and Esther (1988). Photo: © The Lucian Freud Archive. All Rights Reserved 2022/ Bridgeman Images. In celebration of the centenary of the birth of one of the greatest 20th-century British artists, the National Gallery has brought together more than 65 of his best known works from the 1940s up to the 2000s, including portraits of his children, various lovers, the financier Jacob Rothschild, artist David Hockney, performer Leigh Bowery and Queen Elizabeth II. The location is especially apt because Freud had a special pass to enter the National Gallery during closing hours, sometimes even visiting in the night, and many of his historical influences, including Holbein, Rubens and Velázquez, can be found just a short walk away. “The Credit Suisse Exhibition—Lucian Freud: New Perspectives,” National Gallery, Trafalgar Square, WC2N 5DN.  Still from Christopher Kulendran Thomas’s film The Finesse (2022). A new film, The Finesse, produced in collaboration with Annika Kuhlmann, is the centerpiece of Christopher Kulendran Thomas’ solo show at the ICA, a variation of which is also running at the KW Institute for Contemporary Art in Berlin. Existing across multiple screens and a projection, the work takes us back to the early years of the internet, when the Tamil Liberation movement set up an alternative, cooperative global economy during the Sri Lankan Civil War. By combining archival footage with A.I.-generated avatars, the show prompts us to imagine radical alternative uses for technology in the present day. “Christopher Kulendran Thomas: Another World,” ICA London, The Mall, SW1Y 5AH.  Installation view of Zadie Xa: House Gods, Animal Guides and Five Ways 2 Forgiveness at Whitechapel Gallery in London. Photo by Andy Keate. A new immersive installation by Zadie Xa continues the artists long time interest in her country of heritage, Korea. Housed within a traditional “hanok” architectural structure, a range of sculptures, paintings and textiles revive many of the traditional Korean legends, ideologies and Buddhist shamanic practices that were left behind during the country’s rapid industrialization of recent decades. Among the highlights are the “Animal Guide” marionettes, including tigers, foxes and seagulls, who each have their own spiritual and cultural resonances. “Zadie Xa: House, Gods, Animal Guides and Five Ways 2 Forgiveness,” Whitechapel Gallery, 77-82 Whitechapel High Street, E1 7QX.  Salvador Dalí, Lobster Telephone (1938). Photo: courtesy of West Dean College of Arts and Conservation; © Salvador Dalí, Fundació Gala-Salvador Dalí, DACS 2022. The huge impact of Surrealism on art is well known, from Dalí’s clocks to Max Ernst’s experiments with frottage, but although the Surrealists were very interested in creating uncanny objects, their influences on design remain an area that has been under-explored. In a major new survey, the Design Museum brings together examples of interiors, fashion, film and photography—including the work of fashion photographer Tim Walker, design Christian Dior and musician Björk—to show how the same preoccupations with dreams, the absurd, subversion, and desire have tantalized and amused creatives throughout generations. “Objects of Desire: Surrealism and Design 1924–Today,” Design Museum, 224-238 Kensington High Street, W8 6AG.  Share By\n\t\t\t\t\t\t\tKatarina Feder,\n\t\t\t\t\t\t\tOct 11, 2022 By\n\t\t\t\t\t\t\tColin Gleadell,\n\t\t\t\t\t\t\tOct 11, 2022 ©2023 Artnet Worldwide Corporation. All Rights Reserved. You are currently logged into this Artnet News Pro account on another device. \n\t\t\t\t\tPlease log off from any other devices, and then reload this page continue.\n\t\t\t\t\tTo find out if you are eligible for an Artnet News Pro group subscription, \n\t\t\t\t\tplease contact [email protected]. \n\t\t\t\t\tStandard subscriptions can be purchased on the subscription page. Log In ",
    "datetime": "2022-10-11T06:00:27+00:00",
    "url": "https://news.artnet.com/art-world/museum-shows-frieze-2022-2187693"
}