{
    "title": "The Next Chapter of K-Pop | Arts | The Harvard Crimson",
    "text": "News Amid Boston Overdose Crisis, a Pair of Harvard Students Are Bringing Narcan to the Red Line News At First Cambridge City Council Election Forum, Candidates Clash Over Building Emissions News Harvard’s Updated Sustainability Plan Garners Optimistic Responses from Student Climate Activists News ‘Sunroof’ Singer Nicky Youre Lights Up Harvard Yard at Crimson Jam News ‘The Architect of the Whole Plan’: Harvard Law Graduate Ken Chesebro’s Path to Jan. 6   When many people speak of or hear about K-Pop, men in flamboyant suits while horse dancing or groups of nine girls in matching outfits, makeup, and choreography may come to mind. The industry has capitalized on and successfully sold a flashy, visual medium, garnering the intrigue of fans across several continents. Over the course of the past 15 years, early K-Pop fans have witnessed the evolution of the genre, and the first few artists to foray into this new pop genre in South Korea—H.O.T, S.E.S., Shinhwa, g.o.d. to name a few—are now respected as members of an \"Old School\" K-Pop movement. As the second generation of K-Pop artists hit their mid-20s, they already seem much older than the the majority of artists with whom they compete for spots on the music charts, and are referred to as \"sunbae\" (older colleague) artists. Some of the newest debuting groups now even have members as young as 13 years old. It is an interesting time for K-Pop, and as the industry gears up to usher in a third generation of artists, it is worth reexamining how the industry has reached its current powerful status, for it is impossible to fully understand how K-Pop has come so far without a quick flashback to history. In the 1980s, President Chun Doo-hwan successfully led a military coup of the nation, quickly putting down the democratization movements in South Korea. To distract the public from his political corruption, he put forth his infamous \"3S\" policy: \"Sex, Sports, and Screen.\" With the enactment of this policy came the birth of a professional baseball league in South Korea and the creation of explicit films as sources of entertainment for the public. Films with any potential political messages were censored, but nudity was condoned, perhaps even encouraged, to distract audiences with a falsified sense of freedom, as the government took away this very freedom from its people. In June of 1987, the nation rallied together in mass protests from June 10 to June 29 in what would become known as the \"June Uprising.\" Demonstrators forced the ruling government to hold elections and put into policy democratic reform, thus establishing the Sixth Republic of the South Korea. This forced President Chun out of power and ushered in the return to democracy in the nation.This monumental moment in South Korea history was quickly followed with the 1988 Olympic Games held in Seoul, thus placing Korea on the map for the rest of the world to see. Since 1987, the nation has experienced incredible transformation, causing economists to ponder what could explain the exponential growth and comeback of the nation following the devastation of war only half a century ago. The explosion of the Korean Wave (Hallyu) and the widespread power of K-Pop paint the image of a nation with a transnational vision and a constant desire to globalize; but for a nation that remembers the 3S Policy’s suffocation of artistic expression, the Korean Wave and the growth of the K-Pop industry also serves to bring the Korean people a collective voice and identity worldwide. As filmmakers, actors, musicians, and now even K-Pop artists hone their craft, their works serve not only to tell outsiders about their stories and to spark an interest in Korea among other nations, but also to allow the Korean people to take agency and ownership of their identity as a nation of liberated individuals on a global stage. Perhaps those unaware of Korea’s history will listen to K-Pop and bob their hands along to the exciting beats or find intrigue in the foreign language lyrics or highly stylized clothing and choreography, but the music is not to be mistaken for an imitation or spin-off of American pop music. The light, playful, and youth-driven music is more than the glitz and glam of a multi-billion-dollar industry, more than a genre that has gained international fame and hyperactive fan bases. It is a genre that serves to give the people of Korea a voice on the global stage. —Staff writer Soy Kim can be reached at soyoung.kim@thecrimson.com. —Staff writer Soy Kim can be reached at soyoung.kim@thecrimson.com. —Staff writer Soy Kim can be reached at soyoung.kim@thecrimson.com. . Want to keep up with breaking news? Subscribe to our email newsletter. ",
    "datetime": null,
    "url": "https://www.thecrimson.com/column/k-pop-generation/article/2013/11/19/Future_of_Kpop_Soy_Kim/"
}