{
    "title": "The rise of Korean as an in-demand foreign language in Singapore; Sejong Korean Language School takes Korean language beyond the K-Wave trend | Macau Business",
    "text": "SINGAPORE –  Media OutReach – 14 October 2022 – Sejong Korean Language School was founded by Ryan Kwak Seong Hoon, a native Korean, 10 years ago when the trend of K-Pop or the “Hallyu Wave” was on the rise. While the initial crowd of students were drawn to the Korean language because of K-Drama and K-Pop, reasons for learning the language now span much more than being able to understand movies and singing songs. Fluency in Korean language has since become a useful tool in serving professionals, businesses, and other industries in terms of facilitating international relations or to enhance one’s personal skillsets. The K-wave has become a tsunami with presence felt in almost every industry – from fashion to electronics, construction, beauty, media, to F&B. The K-Wave has grown beyond a trendy niche market to a mainstay in Singapore’s economy and Korean language centres in Singapore have seen a steady uptick in demand for Korean language courses over the years. Sejong Korean Language School is one school that has enjoyed particular popularity with waitlist for new classes often more than a month long. The school titles itself one of the largest language schools in Singapore. With three campuses island-wide, over a thousand active students attending weekly on-campus and online classes, and an impressive list of corporate clients including local banks, law firms, airlines and MNCs. Founder Ryan Kwak shared that while he is certainly grateful that the K-Wave has solidified its position as more than just a passing trend, he had in fact saw the relevancy of Korean language as having the potential to go beyond the K-Wave from the very beginning. Because of that vision, he took decisive steps to limit his school’s reliance on the K-Wave. As early as 10 years ago, Ryan noted that many Korean language programmes promote their courses by marketing them as K-Pop Lyrics classes, or K-Drama classes. Instead, Ryan says he believed in the upcoming relevancy of the language itself. “I did not want to teach Korean language through song lyrics or drama subtitles. The grammar used there can be quite challenging for learners and should not be the starting point into the language. Students need to learn the language systematically to develop a good foundation. There is so much that Korean language and culture has to offer.” Ryan instead focused on developing Korean language courses that drew on what he saw as a rare advantage unique to him due to his life experiences. As a native Korean whose family migrated to Singapore at a young age, Ryan has studied at various International Schools in Singapore before transferring to a Singaporean local school. He believes that being a native Korean who is also familiar with how Singaporeans, and other non-native speakers of Korean language learn, gives him a one-of-a-kind edge in building and developing the most effective Korean language class. “I have utmost faith in the course I developed and am still continuing to develop. I am always hopeful that people would see the value in the “best Korean course” for actually learning the language over a K-Pop or K-Drama centric course.” According to Ryan, despite his efforts to reduce the reliance of the school’s courses from the K-Wave where possible, majority of his early batches of students were motivated to learn Korean because they were interested in K-Pop or Korean dramas. However, as the 5-star Google and Facebook reviews, and plethora of personal testimonials from their strong student community collectively attested to the quality of the school, learners with a wider variety of motivations started joining the school. The vision of developing a more in-depth Korean language course that was not directly related to the K-Wave gimmicks soon became a reality. Now, only about half of the school’s new students profess to learn Korean purely for interest. Every year, an increasing percentage claim to be learning for work, up-skilling purposes, or business related reasons. As the K-Wave evolves from “trend” to a market force to be reckoned with, picking up Korean language has never been more relevant. A casual verbal survey of the students in Sejong Korean Language School revealed the diversity of industries learning Korean is relevant to. “We have students from big beauty MNCs, food importers, banks, law firms, entertainment firms, energy companies… Samsung, Hyundai, LG and Kia have always been well known, but now the Singaporeans know Etude House, Paris Baguette, even Ssang Yong, the construction company building our MRT lines… The story that surprised me was that a number of students from the fitness industry also shared that Seoul is the undisputed king of cross-fit in the region and that learning Korean is also relevant to those in the fitness line.” The relevancy of learning Korean language has also been recognized by the Singapore government in recent years, with the launch of a market access programme between the Ministry of Manpower and Ministry of Trade and Industry of Singapore and South Korea. PM Lee Hsien Loong also previously announced that the Ministry of Education will be looking into offering Korean Language as a third language in local Singapore schools. Currently, Sejong Korean Language School is also an approved training provider by SkillsFuture Singapore, a government initiative to increase employability of Singaporeans. Looking back, Ryan shares that, “even though it would have been easier, I’m glad we did not rely on the K-Wave in the beginning. Just like it is important for a student to start with a good foundation, it is important for a business to start with the right footing. We will continue putting in the effort to provide the best Korean language education possible to cater to all learners… K-Pop and K-Drama enthusiasts, and beyond that, the new generation of learners who learn Korean for its relevancy in today’s society. As long as we have a solid programme, it does not matter what brought you to us.” Those looking to pick up Korean for work or business related reasons, to communicate with their Korean spouse or in-laws, or simply to be able to watch their favourite Korean dramas without subtitles may find out more about Sejong Korean Language School’s courses, including SkillsFuture claimable Korean courses at  https://www.sejong.com.sg/ Hashtag: #SejongKoreanLanguageSchool Established by Native Korean Principal who has lived in Singapore for over 20 years, Sejong Korean Language School connects students with Korean language and culture by referencing local Singaporean examples and languages for easy and better understanding. Developed with the “Sejong standard”: a systematic, structured, and engaging teaching methods which all teachers are trained in-house to meet, the teaching methodologies are vouched for by thousands of students to be perfectly suited for Singaporean learners. Teachers also speak excellent English, one of the largely forgotten but an extremely important factor when looking for good foreign language teachers, especially at the Beginners level. As Featured on   Straits Times and   The Business Times.   ",
    "datetime": "2022-10-13T18:00:00+00:00",
    "url": "https://www.macaubusiness.com/the-rise-of-korean-as-an-in-demand-foreign-language-in-singapore-sejong-korean-language-school-takes-korean-language-beyond-the-k-wave-trend/"
}