{
    "title": "The Success of ‘Squid Game’ Should Come as a Surprise to No One",
    "text": "  If you’re wondering why your social media feed is suddenly filled with people in green tracksuits and bobbleheads of your friends running away from a giant baby doll, check Netflix. More likely than not, wherever you are in the world, the answer will be right there in front of you, sitting at No. 1 of the top 10 list: Squid Game. The nine-episode South Korean survival drama is set to be Netflix’s biggest show ever. The series is an allegory for capitalism, dystopian in its visuals but set in present-day Seoul. Here’s the CliffsNotes: People compete against each other in a series of deadly challenges inspired by children’s games, for a chance to win 45.6 billion South Korean won ($38.3 million). Win big or die trying. Whether or not you’re into bloody on-screen deaths, the hype is hard to ignore. Vulture reported that Squid Game has topped Netflix’s rankings in 90 countries, including the United States. YouTube is filled with fan theories, TikTok with recreations of the challenges, and e-commerce sites with character-inspired merchandise. Even those who haven’t seen the show have their own memes. TV monoculture is virtually non-existent in the age of streaming services, algorithms, and niche programming, so the global success of a show from South Korea came as a surprise to many, but really, it was a long time coming. “Squid Game”​ has become the top Netflix show in 90 countries. Photo: Courtesy of Netflix South Korean TV shows, or K-dramas, have been popular in Asia for at least the last two decades. Unlike Squid Game, most of the shows in the early 2000s were less bloody and more soapy, with dubbed versions broadcasted on primetime by local TV stations around the region. By the 2010s, genres had diversified to include romantic comedies, action, and coming of age stories, and shows were made available for streaming or download in both official and unofficial websites. Its stars became household names, appearing on TV commercials, billboards, and fan meets. K-dramas had a more niche audience in the West, then, in 2016, Netflix entered the picture. In subsequent years, the streaming platform helped boost the genre’s popularity internationally and has since released a number of South Korean films and shows, including original productions and partnerships with local companies. No longer just for those who know where to find them, people around the world could now discover K-dramas alongside The Crown. In 2019, Netflix dropped its first original Korean series, the period zombie thriller, Kingdom, then, later that year, distributed the romantic comedy Crash Landing on You. Both were big hits. On Twitter, where many conversations about Korean pop culture live, Kingdom was the most mentioned K-drama in the world, while Crash Landing on You ranked 13, according to data analysis by the social media platform and VAIV company, of global English tweets from July 2018 to June 2021. According to Netflix, they saw a nearly 150 percent average rise in K-drama viewing across Asia between March to July 2020—the height of quarantine measures in many cities—compared to January to February of the same year. Netflix also said that last year, the viewing of Korean content went up an average of four times or more across Asia, compared to the year before. After years of niche popularity, South Korean TV shows now have an increasingly global audience. Photo: YOUNGKYU PARK, Courtesy of Netflix But it was only this year, with Squid Game, that K-dramas found a truly global crossover hit. According to Twitter, Squid Game has garnered over 10 million tweets globally since it premiered on Sept. 17. “Korean culture is kind of starting to be another phenomenon,” YeonJeong Kim, Twitter’s Head of Global K-pop and K-content Partnerships, told VICE. Squid Game’s writer-director Hwang Dong-hyuk said that he always had a global audience in mind for the series. “The most Korean is the most universal. BTS, PSY, and director Bong Joon-ho have already proved that,\" Hwang told The Korea Times. “Korea’s old children’s games, which were used in my series, are simple and old, but I saw the potential to make them appealing worldwide.” The show itself was in the works for years. The Wall Street Journal reported that Hwang came up with the idea for Squid Game over a decade ago, but was rejected for being too grotesque and unrealistic. But the delay seemed to have worked in its favor. Squid Game is an engrossing watch—high in concept and quality—but its premise is not new, even drawing comparisons with other fight-to-the-death thrillers like the 2020 Japanese series Alice in Borderland, also on Netflix. Finally released in 2021, Squid Game couldn't have come at a better time, just a little over a year after South Korean film Parasite won four Oscars, including Best Picture, and amid the growing popularity of K-pop in the West. “Squid Game”​ is set to be Netflix’s biggest show ever​. Photo: YOUNGKYU PARK, Courtesy of Netflix Netflix’s Global TV chief Bela Bajaria told Fortune that in the U.S., viewing of non-English series is up 71 percent, while viewing of K-dramas, specifically, is up 200 percent, since 2019. This, in a country where many notoriously avoid films that require them to read subtitles. It’s an unfortunate reality that validation from Hollywood, like this, is what usually helps push worthy works from other parts of the world into the mainstream. Of course, to those who have been riding the Korean Wave, it was only a matter of time for a TV show to break through like Squid Game did. “We found lots of K-pop fans are expanding their favorites from K-pop music, to drama, and webtoon, and movies,” Kim said, based on Twitter’s data analysis. “K-pop is not idol music… K-pop is Korean or Korea-oriented pop culture genre.” Follow Therese Reyes on Twitter and Instagram. By signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content. ",
    "datetime": null,
    "url": "https://www.vice.com/en/article/dyvnbv/squid-game-netflix-series-kdrama-korea-watch"
}