{
    "title": "The Korean Wave Rises in the UAE – The Diplomat",
    "text": "Read The Diplomat, Know The Asia-Pacific K-drama, K-beauty, and Korean fried chicken in the UAE. Hallyu, the so-called Korean wave, has been on the rise for the past couple of decades in Asia. But Korean culture has also risen to the forefront of global pop culture. Whether a part of various fandoms or a serial K-drama watcher, almost everyone knows about the existence of Korean cultural products. In yet another example, global streaming services, such as Netflix, have led to the establishment of locally based businesses in the Middle East that are committed to bringing South Korea to the region or franchising Korean brands locally. Korean pop culture might be making hits on global charts, but what is noteworthy in the United Arab Emirates is the popularity of K-dramas on streaming services like Netflix. As of 2019, 30 percent of Netflix subscribers are from Middle East, Africa, and Europe; the UAE alone has over 300,000 subscribers as of the first quarter of 2020. Although this number is not high among global rates, the revenue that Netflix has predicted it will gain from its UAE streams has increased from less than $1 million in 2017 to $6.03 million in 2020. K-dramas are a contributing factor to Netflix’s overall success in the UAE, as Korean series continue to be in the top 10 most viewed shows in the country.  Some of the most streamed series in the UAE include “Itaewon Class,” “Crash Landing on You,” and “Guardian: The Lonely and Great God” to name a few. Get briefed on the story of the week, and developing stories to watch across the Asia-Pacific. The demand for Korean movies and series is evident. For example, local newspapers have published articles presenting the top Korean shows to watch on Netflix. The reasons behind this phenomenon are many, including South Korea’s soft power plan aimed at making Korean culture prominent globally and also the success of award winning movies such as “Parasite,” which has attracted new riders to the Hallyu wave. At the moment, Korean series are being promoted as “feel good” series that can distract viewers from the pandemic. Korean series are known for their unique takes on love, representation of romance in non-sexual contexts and having women leads. Enjoying this article? Click here to subscribe for full access. With the continued success of K-dramas, Netflix has recognized the genre’s potential and has been investing in producing more. Netflix released its first K-drama, “Kingdom,” in January 2019. In August 2020 alone, Netflix announced the release of three shows – “Start-up,” “Alive,” and “The School Nurse” – and confirmed the production of three new original series – “Hellbound,” “Move to Heaven,” and “Deserter Pursuit” directed by award winning director Han Jun-hee. The attraction to K-dramas has not only increased tourism to South Korea, but it has also encouraged the opening of several local businesses based on the concept of bringing Korean pop culture to the UAE. An example of this is an e-commerce website called K Girls Closet, where you can find clothes and beauty products straight from South Korea. The website states: “They say K-Wave – so called ‘Hallyu; Korean Wave’ is so strong these days. It could be with Korean Drama where good-looking ‘Oppa’ and ‘Unni’ tell their romances, or with extremely spicy ‘Samyang’ Chicken Ramyon. All it funnels down to; Yeah, Korean Stuff.” A similar company, Chicsta, claims to cater to “the K-community in UAE, who binge watch K-Series, are loyal fans of K-Dramas, & lets not forget religious Korean Skincare followers!” The founders of Chicsta explained that once in Seoul, they understood that Hallyu was fun. All the drama and individuality was present in the food, merchandise, and skincare products and they needed to bring it to the UAE. In addition to the several e-commerce websites that are dedicated to Korean products, there are Korean restaurants run by Korean families residing in the UAE. South Korean fried chicken franchise NeNe Chicken opened its first store in the UAE. I recently interviewed Kelly Frost, the director of NeNe Chicken Middle East and asked what attracted them to open up a branch in the UAE. She said that “NeNe Chicken is growing worldwide and now is in seven countries through Asia Pacific; the plan for 2020/2021 is to open in China, Canada, and the UK.” She added that the “opportunity to come into the Middle East market in UAE and specifically Dubai” came about “as it is a foodie city that needed Korean Fried Chicken.” Frost also responded that there has been positive feedback so far. “All customers love NeNe Chicken. The crunchiness, juicy chicken and the different flavors is an attraction, and it is different than conventional fried chicken as the Korean fried chicken is unique  Some customers have tried NeNe in South Korea or on their travels through [the] Asia-Pacific so they are familiar; for others it’s a brand new experience.” I asked her whether there is any relation between the success of NeNe Chicken and the increased popularity of Korean culture overall in the UAE. She responded that “Korean fried chicken is one of the most popular Korean foods. Korean fried chicken is growing worldwide with K-drama, K-movies and K-pop bringing awareness in UAE. NeNe Chicken as an authentic popular Korean fried chicken brand now in the UAE is gaining popularity as people have either heard about it already, they have already had it before, or want to try it.” The Korean brand is not stopping at Dubai, either. Frost said that “We have plans to expand into the other Gulf countries as soon as we can.” Whether it is fried chicken or Korean dramas, it is clear that Korean soft power via Hallyu is continuing its growth in the Middle East and in the UAE, specifically. Donya Saberi is a Dubai based social science researcher, who is currently a research Fellow and lecturer at Middlesex University, Dubai. She is interested in analyzing the social changes in the Middle East caused by political reforms and its global impacts.          ",
    "datetime": null,
    "url": "https://thediplomat.com/2020/10/the-korean-wave-rises-in-the-uae/"
}