{
    "title": "\n\tThe best of K-Dramas in 2021: 'Squid Game,' 'Hometown Cha-Cha-Cha' and more - The Hindu\n",
    "text": "To enjoy additional benefits CONNECT WITH US December 23, 2021 06:36 pm | Updated 07:09 pm IST COMMents SHARE READ LATER ‘Squid Game’ and ‘Hometown Cha-Cha-Cha’ were two of the biggest global K-Drama hits this year Earlier this month,\nDelhi-born actor Anupam Tripathi (Ali Abdul in\nSquid Game )\n appeared on Netflix India’s YouTube page, teaching Korean for beginners in a light-hearted video, and rattled off Korean phrases for popular expressions like, “I love you,” and “You are awesome!” Indeed, he’s featured in three other videos recently, reaching out to Indian fans, thanking them, reacting to their appreciation of his performance, and even recommending other K-Dramas to watch. Also Read | Get ‘First Day First Show’, our weekly newsletter from the world of cinema, in your inbox .\nYou can subscribe for free here Anupam’s sudden rise to fame is just one of the latest facets of the\n hallyu phenomenon — or Korean wave — that has engulfed India (and many other parts of the world) in recent years. If 2020 was the year that saw K-Dramas have a massive breakthrough, the multitude of shows that debuted in 2021 — and the reception they enjoyed — is even more indicative of their staggering growth in popularity. Anupam Tripathi starred in the global phenomenon ‘Squid Game’ Anupam Tripathi starred in the global phenomenon ‘Squid Game’ Hallyu is not dramatically new to India; K-Dramas and K-pop music have always enjoyed a niche following in different parts of the country. But the recent lockdowns put the spotlight on the varied content available on streaming platforms in foreign languages, and K-Dramas, unsurprisingly, with their diverse genres, intriguing performers, and slick production values found several new takers from varied age groups. In 2020, a report from Netflix indicated a 370 per cent growth in viewership for Korean shows; it wouldn’t come as a surprise if 2021 witnessed a record rise in viewership numbers again. Anupam’s ticket to the big time,\nSquid Game , released in September this year\n , and went on to become Netflix’s biggest series launch till date, amassing 111 million viewers within a month of its release. For many viewers, the survival thriller was the first K-Drama they had ever seen. The complex thriller\nBeyond Evil (Netflix) was 2021’s dark horse. Its release on Netflix India came after it aired domestically in South Korea, but the show already had everything going for it to become a topic of discussion: nuanced writing, conflicts that kept audiences at the edge of their seats, and outstanding performances from its stars Shin Ha-Kyun and Yeo Jin-Go. In a year that saw several exceptional thrillers, including\nMouse (Viki) and\nTaxi Driver (Viki/Prime Video),\nBeyond Evil remained a notch up above the rest. ‘Beyond Evil’ was 2021’s dark horse ‘Beyond Evil’ was 2021’s dark horse Action and romance took top spots in equal measure when it came to the most talked-about shows of the year. Making a huge splash, Song Joong-Ki returned to screens after a brief gap and upped the swag and entertainment quotient in\nVincenzo (Netflix). Close on its heels,\n the wholesome and feel-good vibes of\nHometown Cha-Cha-Ch a\n (Netflix) once again proved that when it comes to swoony romances, K-Dramas can do no wrong; Kim Seon-Ho’s portrayal of Hong Du-sik is sure to become one of those iconic characters that we will see variations of in the future. Another show that set the bar high early on this year was\nRun On (Netflix), which wasted no time drawing audiences into the lives of its four protagonists. From Mi-Joo’s musings about love, films and her work as a subtitler; to Seon-Gyeom struggles as he navigates a life that has been thrown out of gear; to a smart spin on a common romance trope as Dan-Ah and Yeong-Hwa’s worlds collide, the slow-burn drama had a lot going for it. Meanwhile, historical comedy\nMr Queen (Viki/ Prime Video) — a domestic ratings hit — had Shin-Hye Sun in the titular role registering one of the earliest breakthrough performances of the year, with her impeccable comic timing and screen presence. ‘Mr Queen’ had Shin-Hye Sun registering one of the earliest breakthrough performances of the year ‘Mr Queen’ had Shin-Hye Sun registering one of the earliest breakthrough performances of the year Joining her as the other standout female performer of the year was Han So-Hee, who rose up to the challenge of\nheadlining the gritty, noir revenge-thriller My Name (Netflix), in complete contrast to her delicate, confused-in-love college student act from\nNevertheless (Netflix) earlier. After\nSquid Game , all eyes were trained onto Netflix to see what they had to offer next. While\nMy Name did garner attention, it was\n the dystopian horror\nHellbound which emerged as the bigger hit. Directed by\nTrain to Busan ’s Yeon Sang-Ho, the show dealt with a myriad of complex themes, coupled with a fantastic cast, led by the inimitable Yoo Ah-In. Several winners in 2021 were from a genre we’d like to call, “small shows with large hearts.” These include\nMove to Heaven (Netflix) which traced the story of a family-run trauma cleaning company;\nYouth of May (Viki), a romance set against the backdrop of the Gwangju Uprising in South Korea;\nNavillera (Netflix) where a septuagenarian chased after his life-long dream of becoming a ballet dancer;\nDali and the Cocky Prince (Viki) starring the extremely likable Kim Min-Jae and Park Gyu-Young, and the wholesome\nRacket Boys (Netflix) which followed the exploits of a school badminton team in a small town. A still from ‘Dali and the Cocky Prince’ A still from ‘Dali and the Cocky Prince’ This year also belonged to\nsageuks or historical shows; there was\nBossam: Steal the Fate (Viki),\nSecret Royal Inspector and Joy  (Viki), and more recently,\nThe King’s Affection (Netflix).\nThe Red Sleeve  (Viki), which is currently airing, has also been much-talked about online. What kept things interesting were how different all these titles were from one another, exploring different sub-genres such as war, crime, mystery, and even a gender-bender romance which was effectively written to suit the time period. Another\nsageuk ,\nRiver Where the Moon Rises (Viki), made headlines too after the lead actor had to be replaced following a controversy. The second seasons of some popular series came calling, something rare for K-Dramas given how most stick to the single season format. Love Alarm (Netflix) returned, welcomed with many raging debates online about the conclusion of the love triangle;\n everyone’s favourite doctors made a comeback in\nHospital Playlist (Netflix); and fans also got two seasons each of the\nmakjang (over-the-top) ratings winner\nPenthouse (Viki) series, as well as\nLove Ft. Marriage and Divorce (Netflix). ‘Hospital Playlist’ returned for a smash-hit second season ‘Hospital Playlist’ returned for a smash-hit second season Netflix also dropped a special episode of its hugely popular\nKingdom, titled\nKingdom: Ashin of the North , starring Jun Ji-Hyun, which has only garnered more anticipation for its third season. Squid Game too is due for a sequel, which was announced after much speculation by director Hwang Dong-hyuk. Fantasy-thriller\nThe Uncanny Counter , which began in 2020 and streamed till January this year, is tipped to have a second season under production too. Throughout the year, Netflix had a varied line-up in store for K-drama fans with several original titles that circumvented the usual 16-episode format, sticking to anywhere between six to 12 concise episodes. The six-episode\nD.P. , based on the Lezhin webtoon\nD.P Dog’s Day , starred Jung Hae-In, and shed the spotlight on the hostile conditions and bullying faced by young army recruits. A still from ‘D.P.’ A still from ‘D.P.’ This format also worked well for apocalyptic thriller\n Happiness , which aired 12 episodes simultaneously on local cable networks and streaming service Rakuten Viki. For those who adored Park Hyung-Sik in\nStrong Girl Bong Soon , both him and Han Hyo-Joo became quite popular on social media as a fan-favourite on-screen couple on the series. With the success of\nSquid Game, Hellbound and\nHappiness , survival shows that push boundaries and explore varied themes are clearly the ones to watch out for. Both\nYumi’s Cells  (Viki), a psychological romance where the protagonist’s cells take on the form of animated characters representing human emotions; and\nImitation (Viki), a show which traced the trials and tribulations of K-pop idols on either end of the success spectrum, had 14 and 12 episodes respectively. Starring a bevy of real-life idols from K-pop groups U-KISS, SF9 and Ateez among others,\nImitation benefited greatly from the shorter format which reflected in its tight writing. IQiyi, the Chinese streamer platformed several hyped shows this year, which included the fantasy romance\nMy Roommate is a Gumiho and the adventure-drama\nJirisan . The service is ending the year with a bang, thanks to\nBad and Crazy , a quirky thriller starring K-drama grim reaper Lee Dong-Wook, and\nSquid Game ’s Wi Ha-Joon, who has become a sensation of sorts. ‘Bad and Crazy’ is an original series from iQIYI ‘Bad and Crazy’ is an original series from iQIYI Prime Video’s plunge into streaming K-Dramas was easily amongst the biggest announcements of this year, since most fans in India have predominantly favoured Netflix and Viki for the extensive libraries they offer. It will be interesting to see if Prime Video expands its repertoire of titles in the coming years, and eventually delves into making original Korean content like Netflix has. Even as fans of superstar Lee Min-Ho wait with bated breath for the release of\nPachinko on Apple TV+ in 2022, the streaming platform released\n Lee Sun-Gyun’s\nDr Brain this year. Disney+ Hotstar also joined the bandwagon with romance drama\n Snowdrop , starring Jung Hae-In and Blackpink’s Jisoo. However, the show is currently facing allegations of history revisionism from a section of audiences, and it is unclear as to when it will be available in India. If 2020 belonged to K-Dramas finding new ground and more fans, 2021 was all about the diverse genres, formats, and stand-out performances that audiences were lucky to enjoy. Titles to look forward to in 2022:Thirty NineThe lives of three women, played by three powerhouse actors — Son Ye-Jin, Jeon Mi-Do, and Kim Ji-Hyun — who are on the verge of turning 40, as they face their everyday stories and unforeseen circumstances.The Youngest Son of a Conglomerate Song Jong-Ki hopefully comes back with oodles of swag and style, just as he did in\nVincenzo . Also starring Shin-Hyun Been who was recently lauded for her role in\n Hospital Playlist.The Sound of Magic A fantasy-drama starring Ji Chang-Wook with Hwang In-Yeop, who set the benchmark for SLS (Second Lead Syndrome) with his performance in\nTrue Beauty.All Of Us Are DeadScheduled to air in January, the Netflix show follows a group of students stuck in their high school during a zombie apocalypse.The Korean remake of Money HeistThe global phenomenon now has a Korean remake under production, starring Yoo Ji-Tae as the Professor! The likes of high-school romance\nTrue Beauty (Viki/Prime Video),\nHellbound, Nevertheless, Spring is Green  (Viki),\nMy Roommate is a Gumiho , and\nImitation were adaptations from webtoons, which has become another point of interest for newer aficionados. New release\nOur Beloved Summer , which is currently streaming on Netflix, also has a webtoon developed based on it. Six episodes in, and the show starring Choi Woo-Shik (from\nParasite ) and Kim Da-Mi seems promising so far thanks to its fresh narrative, lead characters, and a lilting OST complete with a song by BTS’ V. Fandoms too have evolved; there’s a ton of social media chatter, K-pop is discovered on a daily basis by new fans, and viewers are also going on to create podcasts, blogs, and Instagram pages with bite-sized musings about their favourite stars and projects. A still from Netflix’s ‘The Silent Sea’ A still from Netflix’s ‘The Silent Sea’ Things are already looking exciting for 2022, and the release of Gong Yoo and Bae-Doona’s\nThe Silent Sea on December 24 seems to be the perfect way to walk into yet another year of terrific offerings. Son Ye-Jin, last seen in\nCrash Landing On You  (Netflix), Song Joong-Ki, and Ji Chang-Wook are all expected to have shows releasing soon. With multiple platforms in India now in the fray and stacking their content libraries — coupled with Netflix’s line-up of original shows in the language — it promises to be a\ndaebak (awesome) year ahead! COMMents SHARE World cinema\n\n/\n\nSouth Korea\n\n/\n\ntelevision\n\n/\n\nEnglish cinema\n\n/\n\nentertainment (general) BACK TO TOP Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. ",
    "datetime": "2021-12-23T13:06:40.000Z",
    "url": "https://www.thehindu.com/entertainment/movies/beyond-squid-game-how-k-dramas-in-2021-navigated-sageuks-style-and-substance/article38021643.ece"
}