{
    "title": "The other big Korean drama right now - BBC News",
    "text": "You might have heard of K-pop, but there's more to South Korea's vibrant entertainment industry than just music. Welcome to the world of K-drama. A fresh-faced young man sits alone in a bar nursing a whisky, the ice cubes clinking against the side of the glass as he looks forlornly into it. We cut to a woman, slightly older, with a mobile phone to her ear on a busy street. She too looks like something is weighing heavily on her mind. The soundtrack plays a schmaltzy love song. \"The man who was very sad is the younger brother of the friend of the girl on the phone,\" explains Ma Jung-hoon, the show's producer. \"And they started liking each other, but their parents said they didn't want them to get married.\" Something in the Rain (or Pretty Sister Who Buys Me Food, as it's known in Korean), is South Korea's latest hit TV drama. It tells the story of a woman in her mid-30s who's given up on love - until she falls for her best friend's younger brother. The show is on South Korean TV on Friday and Saturday nights, but is also available around the world on Netflix. It's part of the booming K-drama industry. \"The industry's tripled in size since the early 2000s,\" says Ma Jung-hoon. Exports are a big part of that success. The most recent official annual figures count $239m (£178m) worth of K-drama exports. \"Half of our income comes from international sales,\" says Ma Jung-hoon. \"Of that 70% is from Asia and about 30% from the US.\" Ma Jung-hoon says he expects a bigger slice of their profit pie to be American in the future, as US production companies buy up the rights to remake successful K-dramas. He also thinks more collaborations with foreign companies are likely. In the meantime, there's one crucial requirement for K-dramas to travel well - good subtitles. Video streaming service Rakuten Viki, which specialises in Korean and other Asian TV shows, has a novel approach to subtitling its programmes. \"Viki is a combination of 'video' and 'wiki', so combine them and you get Viki,\" says Kristine Ortiz, the company's senior community manager. \"Basically, we're a video streaming platform, but all of our subtitles are crowdsourced, so that's where the wiki element comes in.\" This video can not be played K-foreign: The hidden Westerners in Korean drama The company, which was originally an independent start-up, was bought for £130m in 2013 by Japanese e-commerce firm Rakuten. It now has more than 40 million monthly active users, and offices in Seoul, Singapore, San Francisco, and Tokyo. Viki describes itself as \"global TV powered by fans\". One of its most popular shows at the moment is called Weightlifting Fairy Kim Bok-joo. \"In Korea the term 'fairy' is often used for beautiful, feminine women,\" Kristine says. \"So it's kind of contradictory having a weightlifting fairy. But essentially it's this love story between two childhood friends. One is a swimmer and the other is the weightlifting fairy, the girl, Kim Bok-joo. And it's fun because it's actually loosely based off a true story.\" Non-Korean speakers can enjoy Weightlifting Fairy Kim Bok-joo thanks to the subtitling work of what Kristine calls the \"volunteer community\". And they can work pretty quickly. \"The fastest we've seen an episode completed is three to four hours,\" she says. \"A really strong indicator of whether or not we have a hit on our hands is the subtitling speed.\" Weightlifting Fairy is available in 37 languages. English always gets done first, then other languages use that as a base. The volunteers are of course providing Viki with free labour. But they can earn rewards, like access to the site's ad-free subscription service. Like Netflix, Viki has started producing its own content in addition to buying from others. Comedy-drama show Dramaworld is one of Viki's most successful own productions. Set in Los Angeles and Seoul, it tells the story of an American college student who, thanks to a touch of magic, falls into her favourite K-drama programme. Kristine says they've seen a big surge in the popularity of K-dramas in the US and Latin America recently. \"I think that the format of Korean dramas is very digestible,\" she says. \"So instead of having these long, 20-episode, multi-series shows like we have in the US and other parts of the world, Korean dramas are [up to] 16 episodes. That's it, you only have one season. \"And also, the stories that they tell are very real, in the sense that they're not super-violent or hyper-sexualised. So I think a lot of users, especially in Latin American countries, find a lot of appeal in that.\" Others too are tapping into the growing global market for K-drama, such as as US entertainment giant Warner Bros, which bought the Korean TV and movies streaming service DramaFever for an undisclosed figure in 2016. \"K-drama has high production values,\" says Hye-kyung Lee, senior lecturer in cultural and creative industries, at King's College London. \"You have interesting stories, characters, trendy music, excellent camera work and good-looking actors and actresses. \"So, simply put, it has a lot of entertainment value.\" She says that after a dramatic rise in the 2000s in Japan, China, Taiwan and some Middle Eastern countries, K-drama has now become more globalised. Ms Lee adds that its popularity is growing consistently, driven by fandom. More from the BBC's series taking an international perspective on trade: \"Viki is an interesting case, showing how such fandom can create a new cultural business model,\" she says. \"In the US and European countries, maybe the audiences are attracted to the drama because it is very different from the local products or American imports. \"At the same time, the themes of K-drama, such as love, family, and friendship, might have some universal appeal.\" K-drama is one part of a bigger tide of successful exports from South Korea's entertainment industry, described collectively as the \"Korean Wave\". Its best-known element is pop music, with K-pop act BTS topping the US album charts last month. The Korean Foundation for International Cultural Exchange is a public body that helps to monitor and promote the Korean Wave. It estimates that the Korean Wave contributed 18tn won ($16bn; £12bn) to the South Korean economy in 2017. That figure has been growing steadily. The international appeal of South Korea's pop culture also helps to raise the country's profile more widely. \"I think Korean dramas have found a way to showcase the best of the best of Korea,\" says Viki's Kristine Ortiz. \"So it's not only just the storyline. You see the fashion, you see the beauty, and you see the food. And it's all really idealistic and really attractive for a lot of people. That's part of the reason I got into K-dramas myself.\" For more on this story, you can listen to the World Service's Global Business radio programme, broadcast on Saturday 16 June. The hidden Westerners in Korean drama. Video, 00:03:09The hidden Westerners in Korean drama Korean men are starting a beauty revolution K-pop stars BTS top US album charts The Korean military romance sweeping Asia Hundreds of police search for Maine gunman as 16 feared dead Israeli tanks cross into Gaza for 'targeted raid' Humanity blasted and broken: Gaza through a medic's eyes Seoul crush: Survivors still tormented a year on The unending pain of India's sewer workers Bowen: Israelis and Palestinians fear worst is yet to come How two 4-year-olds were killed and social media denied it How one of gaming's lost sequels finally got made The chaotic search for Speaker... in 120 seconds. VideoThe chaotic search for Speaker... in 120 seconds Russia goes back to prisons to feed its war machine The dark side of touch-screen tipping Humanity blasted and broken: Gaza through a medic's eyes The town telling influencers to stay away What if a rogue nation dimmed the Sun? Why so many veterinarians suffer © 2023 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking. ",
    "datetime": null,
    "url": "https://www.bbc.co.uk/news/business-44453310"
}