{
    "title": "The different waves of Auckland's K' Rd | Stuff.co.nz",
    "text": "Mention Karangahape Rd to almost anyone in New Zealand and they'll probably know something about it. They might know the infamous strip clubs and gay bars or the boutique shops and edgy artists. However, over the decades K' Rd has changed dramatically. Today, K' Rd is transforming to what some would say is a new Ponsonby, with apartment buildings and upmarket eateries opening up. READ MORE:  * Infamous Auckland road heading for a makeover * Cycleway planned for K' Rd * Legendary K' Rd strip club closes after 53 years Edward Bennett is the heritage advisor for the Karangahape Road Business Association and has seen the road breathe new life as the years rolled on. \"It used to be the major shopping street for Auckland.\" There was a general exodus from the centre of town after the 1960s and 70s, \"especially with the motorways coming through removing a lot of people in the area\", Bennett says. A lot of the small businesses closed and the larger ones relocated to the suburban malls.  That was when the red light district moved in and gave K' Rd a lurid reputation, Bennett says. \"There's two different worlds and in a lot of ways they don't overlap. \"There's never been more than 12 adult businesses and we deal with [more than] 600 businesses in this area.\" Bennett says people's perception of the area is based on when they go there. He first encountered K' Rd in the 70s when there were a lot of Pacific Island shops. \"Bananas and taro spilled out on the pavement and there were colourful clothing but that's all gone. \"The colourful street from the 70s and 80s has gone and now we have the first wave of gentrification complaining about the second wave,\" Bennett says. \"We have a whole lot of little shops complaining about their rents going up, but they displaced Chinese green grocers and PIs [Pacific Islanders].\" Roy Ward is the owner and operator of second-hand bookshop The Green Dolphin in St Kevin's Arcade. He has seen an increasing exodus of the smaller shops move out of the arcade due to the rent increases. \"Obviously it is a time of change in the arcade and we want to see it work,\" Ward says. \"With the new apartments and the railway station there will be a different mix of people and rent will go up but the alternative is empty shops. \"I think it's in a really good place now and it's more vibrant than it has been for a long time,\" he says. The reintroduction of a lot of people living on or off K' Rd has been a main factor in the gentrification of the street, Bennett says. \"You could argue the street is returning to its white middle class status it retained for almost a century from the 1880s to the 1960s.\" Bennett says as the population of the road increases, amenities will need to increase such as the Williamson Ave Countdown as people will want to shop on their doorstep. However Bennett doesn't think it will ever lose its edgy and bohemian vibe. \"Certain things will maintain their edge such as the gay nightclubs, but whether they stay here or move somewhere else due to rent rising.\" © 2023 Stuff Limited ",
    "datetime": "2016-09-19T04:20:32.279Z",
    "url": "https://www.stuff.co.nz/auckland/local-news/84420787/the-different-waves-of-aucklands-k-rd"
}