{
    "title": "The Korean Wave - a tsunami of cultural opportunity for ASEAN | Thaiger",
    "text": "by The Star Online – Asia News Network TV drama, pop music, culture, food. The ‘Korean Wave’ is on its way. The Korean Wave was the hot topic at the ASEAN-Korea Media Forum held in Seoul recently, with experts saying that it has, in fact, enhanced cultural exchanges between the republic and the entire region. Korean bands Blackpink and BTS are currently the two most popular bands in Thailand. Under the theme “Korean Wave in ASEAN: Successful Past and Sustainable Future”, speakers from media organisations, government and academia spoke about ways the phenomenon could be further spread through partnerships in the region. The Korean Wave, or Hallyu, refers to the global popularity of South Korea’s cultural economy exporting pop culture, enter-tainment, music, TV dramas and movies.  Current K-Pop female pop-heavyweights, ‘BlackPink’ A long-time journalist and Korean drama fan, June H.L. Wong, says that regional media didn’t jump on board the first wave of dramas and earlier K-pop in the early 2000s. “It wasn’t until the mid-2000s that the media started covering K-entertainment as awareness, access and opportunity improved,” said Wong, in her paper. Wong says that by 2011, ASEAN media had regular coverage on K-pop culture and today, its stories are an accepted part of ASEAN news content. Noting that for the millennials, the new mainstream media was social, Wong added that K-idols and their fan clubs have become the supreme masters of these tools to keep in touch and up to date. “More Korean pop songs now include English lyrics and more pop bands have English-speaking members, like BTS’ Kim Nam-joon (RM),” she added.  Matching ‘The Beatles’ for the most number of #1 Albums on the US charts in one year – ‘BTS’ The Korean Wave is expected to play an important role in stimulating greater partnership, coupled with President Moon Jae-in’s New Southern Policy to prosper together with ASEAN, said Kwon Chung-won, CEO and publisher of The Korea Herald. Jang Won-ho, a professor at the University of Seoul said the empathy being cultivated among members of the BTS fan club, while idolising Hallyu content, has lead to the creation of a cultural community beyond national borders. “It should be the future of Hallyu,” said Jang. He also noted the influence of BTS, saying that since the band saw themselves as a role model, the band has been working with bodies like UNICEF to raise funds for the “Love Myself” campaign. Watch BTS’ ‘RM’ speak at the UN about their ‘Love Yourself’ campaign…  SOURCE: the star.com.my  Join the conversation and have your say on Thailand news published on The Thaiger. Thaiger Talk is our new Thaiger Community where you can join the discussion on everything happening in Thailand right now. Please note that articles are not posted to the forum instantly and can take up to 20 min before being visible. Click for more information and the Thaiger Talk Guidelines. You must be logged in to post a comment. You must be logged in to post a comment. Copyright © 2023 Thaiger ",
    "datetime": "2019-06-23T06:26:01+00:00",
    "url": "https://thethaiger.com/news/regional/the-korean-wave-a-tsunami-of-cultural-opportunity-for-asean"
}