{
    "title": "The Korean wave embraces young Dominicans in first Korean festival",
    "text": "HOME\nABOUT US\nADVERTISING\nCONTACT Last update on October 25, 2023, 5:44 pm Local November 27, 2022 | 8:49 am Text size: \n                                 Smaller\n Bigger Santo Domingo, DR\nThe Korean fever has infected young Dominicans. More and more are attracted to this enveloping and exciting culture and understand that language is not a barrier to enjoying something thoroughly. Hallyu, also called “Korean wave,” is a term used by the media in that country to refer to the incredible popularity of this culture that emerged in the 90s through pop music (K-pop) and television series (K-dramas). This trend extended to gastronomy, books, and the desire to learn the language, among other interests. However, K-pop and K-dramas are at the top of the list of young people’s favorites, and more and more are joining this new trend. Groups such as BTS, EXO, Blackpink, Twice or Mamamoo, to mention a few, are among the most listened to and known by audiences all over the world and are gaining more fans day after day, as their rhythms and choreographies are capable of infecting anyone. On the other hand, there are also Korean TV series, known as K-dramas or simply dramas; their productions powered by platforms such as YouTube, Netflix, and recently Disney+ are becoming more popular among users who want to enjoy a passionate romance, an intriguing action story or a mystical fantasy story. Big screen productions are not far behind either, as the 2019 film, “Parasite” directed by Bong Joon-Ho, won four Oscars, including Best Picture and Best International Film. Korean Festival\nYoung and old of all ages attended the activity today, where the Asian country was the star. Many came for the dance demonstrations, the merchandise, or the Korean cuisine, but almost all of them had one characteristic: something about this exciting culture caught their attention. According to people who attended the event, K-pop or K-dramas caught their attention the most. Eimy, 22, has been a fan of Korean culture since she was ten years old and explained that she likes K-dramas the most. She believes that Koreans are very talented and emphasizes that “they really prepare themselves to do what they are doing; for example, on this side of the world, anyone can be a singer or whatever, but they really prepare themselves.” On the other hand, the young Camila is not such a “fan”; however, she is also attracted by the colors, the music, and the vibes that this culture offers. Likewise, Carolina has been a fan of k-dramas for six years and was very enthusiastic about the activity because, besides the food and dances, she was able to find merchandise from her favorite group: BTS. Music, colors, and enthusiasm were evident during this activity, which fans hope will be held again.  Δ  Δ  October 25, 2023 | 5:44 pm October 25, 2023 | 4:23 pm October 25, 2023 | 11:00 am October 24, 2023 | 5:01 pm October 24, 2023 | 11:30 am October 24, 2023 | 10:03 am Local Local World World World Health Local Health DominicanToday.com - The Dominican Republic News Source in English Av. Abraham Lincoln N° 452 Local 220B, Plaza La Francesa, Piantini, Santo Domingo Tel. (809) 334-6386 ",
    "datetime": null,
    "url": "https://dominicantoday.com/dr/local/2022/11/27/the-korean-wave-embraces-young-dominicans-in-first-korean-festival/"
}