{
    "title": "The Makers Of Elsword Talk About Localizing Korean Games For America - Siliconera",
    "text": "Join Siliconera+ for ad-free viewing.  We’ve talked a lot about bringing Japanese games to the West on Siliconera. Localizing online enabled Korean games is an entirely different process. Publishers have to decide which events and content should be localized. Sometimes content created specifically for the game’s home country like a Mid-Autumn Festival event wouldn’t translate here.  Elsword is an interesting case because it’s an action RPG with PvP mechanics that happen to be more popular in the West than the game’s home country. The US publisher, Kill3rcombo also managed to created original content specifically for the American release and occasionally content made for the Western release makes its way over to Korea. In this interview, the Elsword team explained the process of bringing a Korean PC game here and maintaining a community in the West.  When localizing a Korean game like Elsword, what are the most important things to get right?  The most important thing is making sure the game is easy to understand and play so that nothing gets in the way of having fun. Kill3rcombo was actually founded by Elsword’s developer, with the goal of providing fun for North American gamers through a high localization standard. Since we are all part of the same company, we have unusually strong support from the developer to make Elsword an enjoyable experience.  Putting our players first and letting them to know we are fine-tuning everything in Elsword just for them is essential for us. We obviously strive to retain the character of the game but we want make sure the dialog and humor is right for our region.  Could you tell us about the localization process? How does the pipeline work when bringing an event over from Korea to the US?  Well, there is definitely a lot of planning involved! Actually there are two kinds of content we bring over. With basic in-game content, like character dialog, we just focus on localizing the text so it’s fun and entertaining.  The other kind of content is event content. Most events in our version of the game are actually created strictly for North American players. In that case we work with the developer to create the event based on various things that are going on, like holidays, school breaks, or even election season. Localization in this case is a little different because many of the terms and concepts were created with North America in mind first.  When it comes to actually choosing the right wording, we do the localization in house so we can make changes quickly and if anything doesn’t sound good to the team, we can change that too.  Elsword has St. Patrick’s Day content in the game. That’s pretty unique since most localized Korean games only have localized content either made for Korea or China. I find with Korean games a lot of other  companies really focus on making content for the Chinese market a priority compared to the US.  That’s true, we released St. Patrick’s Day content for North America. We also made special football costumes for the big game. As we plan in-game events, our focus is on making content for North American players. That means we base events on North American holidays and school themes that only apply to our region. As a result, we often need custom content just for us. We’re able to do this because we have a very unique relationship with the developer of Elsword.  We’re the only case where, as a publisher of Elsword, we are 100% owned by its developer—so really we are the same company. Making a special effort for our players isn’t just about Kill3rCombo, but it also reflects on our parent company, KOG. So together we have a special commitment to making the North American service exceptional.  Does any of made for US content come back to the Korean version?  So far we’ve had some special pets made for North America that were released in other regions and we are in the process of creating special costumes—designed by our players—that will likely also make their way to the rest of the world eventually. Partly, it’s the “two-way street” relationship we have with the developer. We also believe great content should be enjoyed around the world. With the new player designed costumes, the winners were chosen by the players but we made sure the candidates were truly awesome and could be enjoyed by other regions. Personally, I would be proud to have a player in another country wearing my design.    Do you think the Western community reacts to events differently than online gamers in Asia? How do you work with the community here?  When it comes to our events, most are created or at least tailored specifically for North American players. I hope around the world the reaction is somewhat similar if the event is adjusted to suit each region.  Where I think we are different is that we invest much more time in our community than many of our counterparts around the world. We have multiple contests on Facebook every week. We livestream every week, which lets players party up with our GMs or even have their characters compete in beauty contests. We’ve run several online tournaments to showcase our PvP mode. We even had a booth at the last Anime Expo complete with cosplayers as each of the Elsword characters. This way we got to meet our players face to face—which I think is not true of many other publishers.    Can I propose a photo here of the Elsword cosplay team at Anime Expo?   Online games built in the West tend to have developers in house that can react to changes in the game’s economy or make new content. How do you work with the team in Korea to address these issues since there are constant content updates?  We actually have a special team at the developer dedicated to our region. We are all constantly monitoring the game and working together on new content. As for how we work together, I will tell you, we have video conferences constantly so it feels more like we are one team. The only downside we face when working together is that they are many time zones ahead of us so sometimes we have to work at very usual hours. But it’s just part of the job. It’s worth it to us!  I think one edge Korean games like Elsword has is a reservoir of content to release that’s already made for the Korean release. Sometimes content like classes or events gets released out of order. How did you decide which content to bring over at what time?  This constant “backlog” of content has proved to be a real blessing for our team and, honestly, one of the secrets to Elsword’s success in North America. Not only did we have many years of content to bring out here, but the developer has stepped up production in the wake of Elsword’s success, so we can bring content out even faster.  As for how we decide, we target times of the year when our players will have more time to enjoy the new content, meaning summer and winter breaks or even long weekends.  Sometimes we accelerate content based on player demand. For example, we had a special dungeon called “Henir” that was so much in demand we brought it out sooner than was planned in our first schedule. Originally it wasn’t clear how essential “Henir” was, but then players began telling us about a specific gap that it filled for high-level players. Listening to our players is a huge part of how we make our content decisions. OpenCritic ",
    "datetime": "2013-04-04T20:20:56+00:00",
    "url": "https://www.siliconera.com/the-makers-of-elsword-talk-about-localizing-korean-games-for-america/"
}