{
    "title": "The-5th-Wave-book-review",
    "text": "You can’t swing a dead zombie cat these days without hitting a movie or a TV show that takes place in some postapocalyptic, dystopian future. Nowhere is this more evident than in young-adult literature, which may be nearing its saturation point in tales of brave young women placed in life-threatening situations, with the world’s survival resting on their narrow shoulders. Rick Yancey’s The 5th Wave is a remarkable, not-to-be-missed-under-any-circumstances book in part because it manages to describe an invasion by aliens — or in 5th Wave-speak, ”the Others” — and leave you thinking, Oh, so this is how things will actually happen. Some people hunker down in makeshift bunkers. Some head to Disney World (until the Others cut off all electricity). Everyone misses the Internet. Cassie, our 16-year-old heroine, notes wryly how off base Hollywood was in depicting extraterrestrials as vaguely resembling humans: ”I bet the Others knew about the…aliens we’d imagined. And I bet they thought it was funny as hell. They must have laughed their asses off. If they have a sense of humor…or asses.” Cassie never loses her sense of humor — even when describing the circumstances that have left her orphaned and thinking she’s the last human on the planet. She’s not, of course. There’s a mysterious, hunky boy in the woods whom she can’t decide whether to trust. Yancey nails the full-body eye roll of teenage speech: Even in the midst of thrilling action scenes, Cassie still has time to be insecure about her hair. But he also makes room for lovely poetic language, as when Cassie says that without the constant hum of electricity she ”can hear the stars scraping against the sky.” While 5th Wave may technically be YA, the novel can’t be wedged into one genre. It has the dark, swoopy adrenaline of The Hunger Games, but the elegiac tone of The Road. Who cares what shelf you find it on? Just read it. A Coming to theaters: Sony has made a significant six-figure deal to launch a franchise based on what Yancey expects to be a trilogy. Producers include Graham King (Argo) and Tobey Maguire. ",
    "datetime": null,
    "url": "https://ew.com/article/2013/05/03/5th-wave-book-review/"
}