{
    "title": "These Photos Show The Intense Passion Of True K-Pop Fans",
    "text": "A true celebration of “All Things Hallyu!” BuzzFeed News Photo Essay Editor Since 2012, KCON has heralded itself as a celebration of “All Things Hallyu,” a term that refers to the undeniable cultural “Korean wave” that has swept the globe in recent years. With K-pop groups like BTS dominating the music charts and an increased interest in Korean beauty, food, television, and film, KCON has since become a mecca for those passionate about, and perhaps even a little obsessed with, Korean culture. Photographer Andrew Cullen was one of the 103,000 people in attendance at this year’s KCON at the Staples Center in Los Angeles, documenting the four-day event as people from all walks of life danced to elaborate K-pop “choreos,” dined on Korean and Pan-Asian foods, and shared in their mutual love of their favorite K-pop “idols.” While BTS was not on this year’s bill, superfans were able to catch a glimpse of their favorite “idols” in other popular K-pop groups, such as Stray Kids, Loona, Ateez, Momoland, and Seventeen. These pictures capture the sights and scenes of 2019’s KCON in Los Angeles. Dance is a central component of K-pop. Fans who have their moves down flock to the Toyota booth at KCON LA, where a DJ and dance floor provide the opportunity to show off. One constant at KCON LA: long waits in lines for the nightly concerts, audience engagement sessions, and performer appearances on the convention floor. Left: “K-pop connects people from all around the world,” said Prezno, who came to KCON with two friends — all of them planned to leave the event early to move into college in Arizona on Sunday. Right: Kevin Nguyen of Atlanta poses at KCON LA. Nguyen came with a friend, Erin Bautista, whom he’d met through K-pop social media. A staffer places cardboard cutouts of the contestants of World Klass, a survival reality show that pits 20 aspiring K-pop singers against each other for 10 spots in a new band, at at KCON LA. “For good and bad, everything is very manufactured,” one fan said. Left: Eva Hang and Diane Ho pose at KCON LA. K-pop fans since childhood, the friends said that KCON is a great place to see lots of celebrities at once — and that their favorite singers are more than just entertainers. “Their personalities matter a lot. They’re role models.” Right: Alexander Emmitt of Arizona poses at KCON LA. Emmitt said he’s a fan of K-pop’s highly developed visuals and color. Jon Avila, Zoe Perrin, and Jacob Alpern pose for a selfie in front of an installation of pictures of the K-pop groups performing at KCON LA. The friends said they had come to see the group Loona’s Los Angeles debut. Food trucks offer fried squid skewers and other Korean and Pan-Asian foods at KCON LA. Left: Juices sold in enormous plastic baby bottles are popular at KCON LA. Right: Fruit slushies come topped with boba bubbles at KCON LA. Dancers rehearse for a collaboration among eight K-pop dance teams, adapting BTS choreo for a group of more than 50 people to film a cover video outside the LA Convention Center. Left: Latrice Hall, 21, and Zaxaira Adame, 20, of San Diego pose at KCON LA. Hall and Adame came to dance. They met before K-pop gained popular attention. “We’re friends basically because of K-pop. We went to every dance workshop we could.” The pair enjoy checking out other attendees’ fashion concepts and came with their own, modeled after the cartoon characters Cosmo and Wanda. Right: Djuan Bowman of York, Pennsylvania, poses at KCON LA. For Bowman, K-pop “is more about the energy than the lyrics, because I don’t always understand them.” Beauty and cosmetics have a strong presence at KCON LA. Fans use a mirror on the convention floor to check their looks and take selfies. Fans eagerly await an appearance by the K-pop boy band VeriVery at KCON LA. VeriVery at KCON LA. Fans listen during an appearance by VeriVery. The K-pop girl group Mamamoo enters KCON LA to cheers. Fans meet with Eddy Avila, a popular K-pop beauty YouTube host during a meet-and-greet at KCON LA. A fan takes photos of the girl group Mamamoo during KCON LA. K-pop fans feel especially close to their “idols,” fans said throughout the weekend at KCON LA. The convention offered numerous ways to engage with the performers, from writing graffiti notes to meet-and-greet sessions. BuzzFeed News Photo Essay Editor Contact Gabriel H. Sanchez at gabriel.sanchez@buzzfeed.com. Got a confidential tip? 👉 Submit it here ",
    "datetime": null,
    "url": "https://www.buzzfeednews.com/article/gabrielsanchez/the-intense-trending-passion-of-true-k-pop-fans"
}