{
    "title": "These Are the Best K-Dramas on Netflix According to Koreans",
    "text": "If there’s one good thing to come out of the home quarantine most people are in, it’s that the world is finally catching on to the wonderful world of K-dramas. For the uninitiated, those are shows from South Korea, and despite the name, they’re not actually all dramatic. While Hallyu or the K-wave had taken over Asia years ago, these shows mostly had a cult following among fans of South Korean culture. Think: K-pop stans and Korean beauty obsessives. But ever since Netflix acquired some of them a couple of years ago, the fandom has been growing. Now, the streaming platform has a full library of the classics — from Boys Over Flowers to Full House — and a roster of originals. With people staying home and searching for the next good show to lose sleep over, even more are watching K-dramas now. There’s something for everyone. There are your typical soap operas, but there are also medical shows, legal dramas, thrillers, fantasy, and romantic comedies. Some are purely about love, but others discuss important topics like LGBTQ acceptance and differences between North Korea and South Korea. Some of the most popular K-dramas on Netflix right now are the medical show Hospital Playlist, family drama Hi Bye, Mama!, the legal drama Hyena, zombie thriller Kingdom, black comedy Prison Playbook, and coming of age revenge plot Itaewon Class. For those who want to dip into the K-drama pool but don’t know where to start, here are shows to add to your list, straight from South Koreans. Netflix synopsis: At the start of their 30s, three friends navigate the demanding entertainment industry while juggling love, careers, and dreams. The show is a witty, light comedy to enjoy during these depressing times. Director Lee Byung-hun’s unique sense of humour stands out in this series. He has his own way of rhythmical storytelling. The dialogue is also appealing for the audience. Listening to singer-songwriter Jang Beom-june’s hit song “Your Shampoo Scent In the Flowers” is also a pleasure. — Lee Young-mi, 59, pop culture critic Netflix synopsis: A paragliding mishap drops a South Korean heiress in North Korea — and into the life of an army officer, who decides he will help her hide. You can see the landscape of North Korea and how ordinary people live there through Crash Landing on You, since it was made based on in-depth research. Life in North Korea is fascinating for many, including South Koreans, because of the mystery surrounding the country. It’s also great to see top hallyu stars Hyun Bin and Son Ye-jin. It’s a well-made series with a good combination of romance and North Korean culture. — Ha Jae-keun, 49, pop culture critic Netflix synopsis: In a colourful Seoul neighborhood, an ex-convict and his friends fight a mighty foe to make their ambitious dreams for their street bar a reality. Itaewon Class is a relevant K-drama that depicts the reality young Koreans face, something most foreigners may not be exposed to through fantasy and romance-driven shows. The opportunity to move up the social ladder is very limited, if not almost impossible. Itaewon Class, based on a popular webtoon, shows the drastic wealth gap between the rich and the poor in Seoul and how the main character Park Saeroi (Park Seo-joon) is motivated to become successful. He takes careful steps to achieve his goal to defeat a food empire by opening his own restaurant in the Itaewon district. The show gives a sense of hope and catharsis when you root for Saeroi, as he breaks social norms and works his way towards building his own empire. — Danny Kim, 34, film professor Netflix synopsis: A young boy who ends up in the U.S. after the 1871 Shinmiyangyo incident returns to Korea at a historical turning point and falls for a noblewoman. I currently live in South Korea but I grew up in China and the United States. Although I know about Korea more than other foreigners, it’s hard to say that I understand Korean history well. When I returned to Korea, I tried to learn about Korean history and traditions. After immersing myself into the culture and history, I found myself watching this series. It depicts situations and characters during the Japanese colonial era. There are characters ranging from a traitor who betrayed his motherland to survive, a noble woman who fought against Japan, to a leader in sorrow over the situation. No doubt the creator put fabricated extremes and twisted facts, but I believe that the reality could be even worse than the series. As I relearn about Korea through shows and films, I think the series is meaningful for those interested in the country. I don’t want people to have anti-Japanese sentiments, just to think about the past and know history. I love the acting, storylines, visual style, soundtrack, and characters willing to sacrifice themselves. I love it so much. — Alexander Kim, 30, ad designer Netflix synopsis: All hailing from various parts of Korea, a group of college students go from being complete strangers to a big happy family at a Seoul boarding house. I would love to recommend the Reply series. Reply 1994 is my favorite out of all the seasons. First of all, I found the plot interesting because it develops from the present to the past, bouncing back and forth between timelines. This stimulates audiences’ curiosity and gives clues that encourage them to keep on watching (Who will the main character marry?). Secondly, it presents diverse Korean college cultures, songs, games, and regional differences. It reminds older generations of the past, and brings younger generations something fresh. Even I could relate to it, even though I was born in 1996). Finally, the character Chilbong (Yoo Yeon-seok) is so handsome. — Han Jee-hee, 24, student Netflix synopsis: For the families living at Sky Castle, an exclusive residential community that’s home to Korea’s elite, their children’s success means everything. And getting them into the top university is the ultimate prize. You can’t talk about South Korea without talking about its grueling exams that seem to have been handed down from the Joseon Dynasty. I think Korea’s infamous testing obsession originated not from people but from an old educational system. People predict children’s futures based on the results of their Suneng, an abbreviation for the College Scholastic Ability Test (CSAT) in Korean. Most generations went through Suneng and it brings the whole country to silence. Even planes are grounded. It’s ridiculous. SKY Castle is about parents and students from the upper class who are preparing for the Suneung. This series shows old generations who don’t care for diversity and how their children were screwed up by the way they were raised. It’s like a microcosm of Korean society. Everything that happens in the show revolves around the Suneung, showing how parents can go crazy believing that their children’s success depends on one exam. — Park Woo-bin, 29, graphic designer Netflix synopsis: With the help of a gutsy female detective, a prosecutor who has lost the ability to feel empathy tackles a murder case amid political corruption. This is the best among all Korean mystery shows! All the actors are convincing and it will keep you engaged as the story develops. Although legal shows are a popular sub-genre, I never got tired of watching this because the direction the show takes is so new. Most importantly, I love this because there’s no unnecessary romantic and emotional scenes. All the scenes are very valid and well-structured, so I hope more people have a chance to watch the show. — Choi Ye-eun, 25, student Interviews have been edited for length and clarity. Find Junhyup Kwon on Twitter.Find Therese on Twitter and Instagram. By signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content. ",
    "datetime": null,
    "url": "https://www.vice.com/en/article/pkejxm/best-k-dramas-netflix-koreans-recommend"
}