{
    "title": "Third-wave coffee makes a splash in Manhattan - The Collegian",
    "text": "From house-made syrups to single origin coffee, third-wave coffee shops Arrow Coffee Company and Sparrow Specialty Coffee celebrate communities both in Manhattan and abroad. Third-wave coffee celebrates a philosophical difference in coffee and business altogether. Owners and employees know the specific date the beans are roasted, and even the specific farm they come from. Coffee beans are sourced from individual farms, and the money goes directly back into the community the beans come from. Third-wave coffee shops take pride in the coffee they sell, and the farmers they buy it from. A year and a half ago, business partners Ben Motley and David Adkins brought this new style of coffee to Manhattan when they opened Arrow on Denison Avenue and Claflin Road. The two friends said they were passionate about the of third-wave coffee idea and believed there was a place in the market for it. “I believe in this business and this town,” Motley said. This past November, Sparrow added its “slow bar” style to the third-wave coffee community on Fourth Street in downtown Manhattan. Taylor Cannon, freshman in food science, has been working at Sparrow since they first turned on their coffee machines. “The purpose is to get the full flavor of the coffee out. We even make black coffee by hand,” Cannon said. Both Arrow and Sparrow focus on pour-overs and espresso, serve tea and feature multiple flavors of syrup made in-house. Arrow’s syrups include dark caramel and the newly-added sweet basil. While these syrups can take black coffee to a different level, Motley said he recommends starting with the most basic drink. Some customers tend to stray away from coffee drinks without sugar or cream because of the bitterness most black coffee is associated with. Newcomers are still encouraged to try straight pour-overs or espresso because the third-wave coffee method takes this typical bitterness away. Motley said he compares the third-wave outlook on coffee to wine. “You wouldn’t take the best wine in the world and add stuff to it,” Motley said. Employees at Sparrow said they recommend their lavender syrup to first-time customers. “The lavender latte is it,” Rains Wall, employee at Sparrow, said of the slow bar’s signature, house-made syrup. “The lavender hot cocoa is also the bomb.” Sparrow’s chocolate syrup is also a popular flavor. Its chocolate is single origin, grown in Springfield, Missouri. Arrow and Sparrow share a desire to educate the community of Manhattan about third-wave coffee. Walk in to either shop and the employees will be happy to share their purpose and passion for coffee and community. Arrow Coffee Company owners look to expand between their two buildings; their main shop would serve coffee to customers who want to get in and get out and their other building, which currently serves as overflow seating, would provide educational opportunities to their customers who want to know about the third-wave process. To learn more about third-wave coffee, Motley said he recommends the documentary “A Film About Coffee.” ",
    "datetime": "2015-02-04T07:34:15+00:00",
    "url": "https://www.kstatecollegian.com/2015/02/04/third-wave-coffee-makes-a-splash-in-manhattan/"
}