{
    "title": "This Three-Country, Four-Night Asian Music Awards Show Is A K-Pop Promotion Machine : The Record : NPR",
    "text": "By Patrick St. Michel Members of BTS attend 2017 Mnet Asian Music Awards at Asia World-Expo in Hong Kong.\n                \n                    \n                    VCG/Getty Images\n                    \n                \nhide caption Members of BTS attend 2017 Mnet Asian Music Awards at Asia World-Expo in Hong Kong. The beats of the Mnet Asian Music Awards, known as MAMA, resemble American ceremonies such as the Grammy Awards — a program the former CEO of its namesake television network compared the event to. Despite its name, the event mostly celebrates the best acts from the K-pop industry over the last year, doling out common award-show honors such as \"album of the year\" and \"artist of the year,\" with a few achievement awards mixed in (mostly reserved for artists from Asian countries that aren't South Korea), mostly in the service of helping to cement the central place of K-pop in the culture of the continent. A mix of online voting, expert opinion and sales measurement to determines the winners, with the event itself featuring a relentless parade of performances that drive most viewers' attention, eagerly sharing clips on Twitter and gushing over every screenshot. Notably, MAMA is owned by CJ E&M, an entertainment company which operates a K-pop label and management division. What separates MAMA from other, seemingly interchangeable, award ceremonies is scale — Mnet spread this year's edition out over four nights and three countries. The first took place in Vietnam on Nov. 25, before moving to Japan for one evening in Yokohama, then Hong Kong for the last two nights on Nov. 30 and Dec. 1. Once held only in Seoul, MAMA — the most-viewed awards show dedicated to K-pop going — has transformed into a bonanza celebration of the K-pop industry's global ambitions, typified as of late by the international success of BTS (the group recently performed on The Ellen Show). The awards started in 1999 on Mnet, a music and \"youth culture\" channel that began broadcasting in South Korea in 1993. Early on, it was analogous to MTV in the States — particularly since Mnet struck a deal with the American broadcaster to air its content in Korea, which lasted until the early aughts. Mnet's big awards gala initially mirrored itself after MTV's Video Music Awards, first airing as the Mnet Video Music Awards, with the night's the two largest prizes going to videos. For the first few years, it was an inward-looking affair, making space only for a \"best international artist\" category (first won by Ricky Martin). By the middle of the 2000s, K-pop's ambitions had shifted. Korean musical acts and television dramas were becoming incredibly popular across Asia. Helped by support from the Korean government, a \"Korean wave\" spread across the continent in the following years, with music playing a central role. Mnet saw more attention come to it from countries across the region, especially their weekly countdown show M Countdown. As the wave spread, MAMA pivoted as well, going from an extravaganza of domestic music videos to an event with grander ambitions. The video awards became secondary and a trio of artist, album and song of the year awards became the event's top prizes (daesang, in Korean). More artists from across the continent were invited to perform, with Mnet conjuring up special awards as an excuse for them to come out. Most significantly, starting in 2010, MAMA moved outside of Korea entirely, holding the show in Macau, China. It hasn't come back to Seoul since. Over the last decade, K-pop has become the sound of Asia. While local musical acts tend to still hold the top spots when it comes to overall sales on domestic charts, Korean artists have knocked American pop out of pole position when it comes to foreign sales across the region. Many saw \"Gangnam Style\" as a novelty, but the worldwide hit helped push K-pop further into the mainstream across all of Asia. The continent's history and political situation often presents hurdles — nationalist groups in Japan have protested Korean television dramas, while China banned all Korean entertainment for about a year as a result of Seoul installing the THAAD missile defense system on behalf of the US. But hooky pop numbers and impeccable choreography top all. In recent years, MAMA has learned to play to this. \"We must raise the Asian market itself in order to prevent the Korean wave from flowing in just one direction and ending there,\" former Mnet CEO Park Kwang-won said ahead of the 2010 show in Macau. \"There must be an interchanging of Asian culture as a whole in order to develop the Asian wave. Just like the influence that the American Grammy awards has on the entire Western market, we hope to develop the MAMA in order to influence the global Asian music market.\" The 2017 MAMA took this to its logical extreme, with its pan-continental strategy, stopping in a burgeoning Southeast Asian market (Vietnam), the established second-largest music market on Earth (Japan) and on the doorstep of China (Hong Kong). Local artists and industry members appeared at each, from 100-member-plus pop group AKB48 in Yokohama to celebrated Chinese performer Karen Mok in her hometown of Hong Kong. But, despite the CEO's overture in 2010, all were secondary to K-pop. This is, of course, on purpose — in a clever branding move, MAMA positions K-pop as the center of Asian music scene. As this continent's sounds get more attention, Korea will be at the forefront. Whether MAMA is the most important awards show in Korea, let alone Asia, is debatable, however. After Mnet's show wrapped up in Hong Kong, another big awards program, the Melon Music Awards — itself owned by LOEN Entertainment, a prominent K-pop label and talent incubator --took place in South Korea. The stakes of MAMA's awards feel pretty low; the top three awards went to the three of the year's biggest Korean acts — current international darlings BTS (named artist of the year), zippy girl group Twice (winning the song award for \"Signal\") and EXO (taking the album award). The lesser honors were distributed more democratically, with few repeat winners. Like nearly every installment of MAMA, the results felt evenly distributed — so no one agency or label, institutions that carry nearly all the power over media outlets (not to mention their own acts), could get angry at Mnet. Don't tell that to fans, though. They shouted out every movement of BTS' high-energy performance of \"Mic Drop,\" and flipped out on Twitter when it appeared the image of popular group Blackpink's faces were smeared out on screen (they weren't). Most notably, fans of boy band EXO crashed the server for the nation's Blue House after their faves failed to win the Best Male Group award, falling to Wanna One, a group created from an Mnet talent competition. Supporters made a petition calling for MAMA to be shut down. Anger at the channel carried on even after EXO won album of the year, one of the show's big-three awards. All of this online drama might not be good for the government websites that were flooded by EXO fans demanding action against the show, but it's a good sign for MAMA that it can generate so much frenzy. That, after all, is why it exists at all — to cement Seoul's status as the center of Asian pop. Sponsor Message Become an NPR sponsor ",
    "datetime": null,
    "url": "https://www.npr.org/sections/therecord/2017/12/04/568292038/this-three-country-four-night-asian-music-awards-show-is-a-k-pop-promotion-machi"
}