{
    "title": "This Is South Korea’s K-pop Soft Power Moment – The Diplomat",
    "text": "Read The Diplomat, Know The Asia-Pacific K-pop offers something different to the nationalism projected by China and the territorial politics of exclusion. K-pop group Twice pose for the photographers during a showcase for the 8th mini album “Feel Special” in Seoul, South Korea, Monday, September 23, 2019. The concept of a Belt and Road project, signifying an economic, social, and cultural strategy of a state to gain influence outside its borders, extends beyond the massive development project that China kicked off in 2013. While the Chinese project is impressive, it will eventually fall to the politics of debt and nationalism that historically have divided Asia. The most effective influence project of Asia, and the globe, might actually be K-pop with true cultural attraction coming from pop stars and their fandoms. K-pop is a global expression of soft power, fueled by the Hallyu, the “Korean wave,” that has sought to expand influence since the late 1990s. The success of K-pop is part of a Korean overhaul of the arts and entertainment sectors to explicitly project cultural power. In the same year that BTS reached the summit of the Billboard Hot 100, Bong Joon-ho’s “Parasite” won the 2020 Oscar for best picture and K-pop girl groups Blackpink (reaching eighth) and Twice cracked the Billboard Global 100 for the first time. These trends are only the beginning. Korean culture is a force to be reckoned with. As a result, South Korea is challenging not only the cultural ascendancy the United States maintains, but the course for the future of Asia. Prices of Tansaekhwa art have sky-rocketed. “Squid Game” model-turned-actress HoYeon Jung is the first person from Asia to grace a solo cover of American Vogue in its 130-year history after the show dominated Netflix. As of 2021, Korean content dominated even U.S.-produced content for streaming viewers in the East Asian region. In 2022, Disney+ secured the rights to stream Korean content, including a Blackpink Movie and K-dramas, in support of its expansion into Asia. K-pop offers something different to the nationalism projected by China and the territorial politics of exclusion. Instead of national identity creating fault lines, in K-pop, divergent national representation presents an opportunity for culture and economic dominance through collectivization of artistic expression. Many K-pop songs literally are a cultural mashup of languages, visual styles, and dance all shepherded by South Korean production values and international hitmakers. Get briefed on the story of the week, and developing stories to watch across the Asia-Pacific. The K-pop’n Road Enjoying this article? Click here to subscribe for full access. As scholars of popular culture and the international politics of Asia, we watch with interest as the distribution of cultural power shifts in the music industry. K-pop is more than the ideal of a boy or girl band that has been the foundation of the music industry since its inception. Vox’s Sam Nakahira notes that K-pop is “Korean music that blends pop, hip-hop, and dance” yet the idea of the musical style being “Korean” specifically is declining gradually. Like “Hollywood” being used as a term for the movie industry, the “Korean” in K-pop denotes the start but not the evolution of the art form. K-pop’s expansion north to Russia, east to the United States, west to India, and south to Oceania demonstrates that its global domination is only beginning. The tentacles of Korean cultural attraction, the literal definition of soft power, extend globally, infecting the minds of a new generation no longer concerned with the politics of their elders. The infectious positivity common in K-pop can trump even nationalism (“NKpop” represents an outlier). The big corporations in K-pop — SM Entertainment, JYP Entertainment, and YG Entertainment — were founded in the second half of the nineties, inspired by the Japanese Idol system. The big three were later joined by Big Hit Entertainment — recently rebranded as HYBE Corporation — founded by former JYP employee Bang Si-hyuk in 2005 who struck gold thanks to the massive success of BTS. Hallyu’s success has deliberately been connected to South Korea’s leading position in digital technologies. The power of social media in the emerging information age facilitates fanatical devotion to artists and their careers. These artists penetrate YouTube trending pages, and dominate on TikTok, Instagram and HYBE-owned Weverse. Artists use social media — especially video platforms — to amplify messages and create indelible images. Their efforts are complemented by the fans, who often act as highly professional marketeers for their bands on social media. K-Pop moves in generations, as do most cultural movements. YG’s Psy’s novelty hit “Gangnam Style” might have been a distraction, but in reality, it was more of a herald of the coming arrival of YG’s Blackpink and BTS, which represent the new generation of K-pop. While all the members of BTS are Korean, out of the four Blackpink members, there is one Thai member, Lisa, with Jennie spending a part of her youth in New Zealand and Rosé being the child of Korean immigrants in Australia. Blackpink’s producer and main songwriter, Teddy Park is a hip-hop artist from Diamond Bar, an affluent Southern California suburb. Diversification of newly debuting artists is the norm now in K-pop. The current fourth generation is known as the “global generation” with many of the stars coming from outside South Korea and aiming for international success from the start. The majority of bands have front-facing English names and incorporate multiple languages in each song, if not in the same lyric, expanding global reach and audience. Cultural Confrontation It will be interesting to witness the evolution of the Korean K-pop’n Road, especially in relation to China. K-pop is one of the first true forms of soft power, like radio and the movie industry before it, that can have a real impact on international relations. It can form an approximation of hard power through music and activism that is more powerful than any missile system that Korea could develop. Confrontation seemed to be an early theme. To “celebrate” the birthday of Kim Jong Un in 2016 K-pop was “blasted from loudspeakers setup on the border.” Also in 2016, girl group Twice had to apologize when Taiwanese member Tzuyu waved a Taiwanese flag. Her apology video stated “there is only one China.” At the time JYP noted that it would overhaul its strategy of Hallyu to be less confrontational. Compare this apology to the 2020 incident where BTS was accused of disrespecting Chinese soldiers through omission during an acceptance speech for an award given on the 70th Anniversary of the Korean War. Leader of BTS’ RM noted that “we will always remember the history of pain that our two nations [the United States and Korea] shared together and the sacrifices of countless men and women,” and did not refer to China’s struggle during the Korean War. As Foreign Policy reported at the time, the offensive only lasted two days. China’s Global Times deleted some attacks on BTS after push back from the fandom. The BTS Army beat China at the time. Enjoying this article? Click here to subscribe for full access. While social media in China used to fill up with K-pop content, the tide turned somewhat after the South Korean government deployed the THAAD missile defense system in 2017. In reaction, the Chinese government limited concerts, tours, and overall exposure to K-pop. More recently, the Cyberspace Administration of China has taken additional measures to curb “the sickened fan circle culture,” which it says “distorts minors’ values and endangers social governance.” China instituted measures to restrict fandoms, outlawing bulk purchase of albums and “effeminate boy bands.” The message is clear: K-pop idol worshiping is no longer tolerated in China. Yet the future is uncertain. International diversification is the key for the industry, suggesting that the attraction of K-pop power will win in the end. There is a Korean myth that the country has never invaded another country; while inaccurate the basic premise is true and continues to this day. Instead of a military invasion the K-pop cultural invasion continues despite intervention from China. The Value of K-pop Soft power is really about the power of attraction as a method of influence. It is a coercive process made through non-military means. Real soft power is comprehensive, it encourages cultural immersion and adaptation. It can be positive, providing a critical counter-narrative at a moment of increased racism and violence directed at people of Asian descent around the globe due to fears of COVID-19. The general image of K-pop, despite scandals, accusations of “slave contracts,” and obsessive fans, is wholesome and winsome. K-pop provides representation and inspiration. BTS was invited to visit the United Nations General Assembly in 2021, this time as appointed special envoy of South Korea, to express their belief in future generations. When three band members tested positive for COVID-19 later that year, Tedros Adhanom Ghebreyesus, the director-general of the World Health Organization wished them a speedy recovery on Twitter, alongside a reminder about precautionary measures and the importance of vaccinations. An academic study found that BTS fandom was a prime driver of positive information about protection from the virus. The power of K-pop is in the fandom. This fandom develops global reach and now seeks to influence daily life, including supporting the Black Lives Matter protests. In 2020, a Donald Trump rally in Oklahoma was ruined when the BTS Army snatched up tickets online to embarrass the politician. Overall, the message was hopeful, with the New York Times noting that the generally apolitical K-pop fans “may lend itself to more radical gestures, especially in a time of increased political polarization.” The Korean expression “fighting!” does not represent the typical Western conception of confrontation. Instead in Korean it generally means good luck, or “you can do it!” It’s a positive expression of collective unity against a challenge. This is the central ethos of K-pop: meet a challenge through positive force. This is also the hope of K-pop as an alternative to the destructive politics of confrontation typical in international politics. Brandon Valeriano is a senior fellow at the Cato Institute and a senior distinguished fellow at the Marine Corps University. His favorite K-pop groups are Twice and NiziU. Aleydis Nissen is an FWO and F.R.S.-FNRS research fellow at Leiden University, VUB and ULB.  She previously wrote about BTS. Like Suga, she is also rooting for the underdogs.          ",
    "datetime": null,
    "url": "https://thediplomat.com/2022/02/this-is-south-koreas-k-pop-soft-power-moment/"
}