{
    "title": "Thousands of Edmontonians come out to K-Days parade | Edmonton Sun",
    "text": "1 of 51 Full Screen is not supported on this browser version. You may use a different browser or device to view this in full screen. Even more exciting than watching a parade is participating.  That was the case for hundreds of participants in Friday morning's K-Days parade, kicking off 10 days of midway ride, food and entertainment. When asked what her favourite part of the parade was, Lora Pallster, riding along on the Winnifred Stewart Association's parade float, said, \"everything!\" For groups like the Winnifred Stewart Association -- an organization supporting and enriching the lives of persons with disabilities -- the parade offers a chance to have fun in the community while spreading public awareness of their cause. \"We're just really happy to have the opportunity to be out in the community and showcase what we do, supporting people with developmental disabilities,\" said Candace Smallwood, special events and development manager with the association. \"We're just happy to be here with the rest of the participants.\" The Al Shamal Shriners zipped through the streets on miniature motorbikes during the pre-parade, crisscrossing and threading the needle in what has become their signature routine over 65 years of participating in the parade. Nicole Primmer, one of thousands who turned out to watch the event, was a first-timer. \"It was amazing to see all the crowds and the kids and everyone high-fiving all the cops and everyone that came by. Lots of really good floats,\" she said. Thousands lined the streets hours in advance, staking out the best vantage points to view the 120 passing floats, giant balloons, mascots, critters and performers of all kinds. ﻿The parade started along 102 Avenue from 97 Street to 105 Street. \"My favourite part was when some characters from the movies came on the street,\" said seven-year-old Gracie Supeene, referencing costumed entertainers posing as popular cartoon princesses. \"That was pretty cool to me.\" \"All the girls were walking in dresses like you see in the movies,\" added her cousin Dana Jordan, 8. \"My favourite part of the whole parade was when we saw the big balloon pig,\" said Adam Jordan, 8, who was absolutely delighted as a massive inflatable pig pulled by a team of balloon wranglers twirled past his seat. Alberta's premier, waving from the back of a convertible, said the parade is a great way to connect with Edmontonians. \"It's always great to be part of the community, to show that we're all in it together, we're all celebrating together and to be able to see people enjoying summer fun here in Edmonton,\" Premier Dave Hancock said. The parade is the official launch of the K-Days exhibition, running from Friday, July 18 until Sunday, July 27. Subscribe now to read the latest news in your city and across Canada. Subscribe now to read the latest news in your city and across Canada. Create an account or sign in to continue with your reading experience. Don't have an account?  Create Account 365 Bloor Street East, Toronto, Ontario, M4W 3L4 © 2023 Edmonton Sun, a division of Postmedia Network Inc. All rights reserved. Unauthorized distribution, transmission or republication strictly prohibited. This website uses cookies to personalize your content (including ads), and allows us to analyze our traffic. Read more about cookies here. By continuing to use our site, you agree to our Terms of Service and Privacy Policy. ",
    "datetime": null,
    "url": "https://edmontonsun.com/2014/07/18/thousands-of-edmontonians-come-out-to-k-days-parade"
}