{
    "title": "Tida Wave, New Susan Chase, Whitty K and Judgment D crowned champions  | The Tribune",
    "text": "Jump to content  CLASS A WINNERS - the crew of Tida Wave - with Prime Minister Perry Christie. As of Monday, April 27, 2015 By BRENT STUBBS Senior Sports Reporter bstubbs@tribunemedia.net THE Tida Wave, New Susan Chase, Whitty K and Judgment D all took the spotlight in the 62nd National Family Island Regatta in Georgetown, Exuma, over the weekend. At the end of the four days of competition, which was hampered by the rain and even light winds, the Tida Wave pulled off the victory in Class A with 30 points. The Red Stripe got second with 28 and the Running Tide came in third with 26. In Class B, the New Susan Chase was crowned the champion with 40 points. She was followed by the Lonesome Dove with 38 and the Lady Sonia rounding out the top three with 34. The Whitty K collected 103 points to secure the win in Class C with the Bull Reg right on her trail in second with 99. The Lady Diane finished third with 98. And in Class E, the Judgment D clinched the title with 98 points. The Blue Bird came in second with 32 and the Hot Mix was third with 26. Governor General Dame Marguerite Pindling and Prime Minister Perry Christie were on hand and participated in the closing ceremonies on Saturday night. They both took part in presenting the awards to the various winners in both the Cup races held on Wednesday and the series races Thursday to Saturday. A total of 12 boats participated in Class A, 15 in Class B, 35 in Class C and 12 in Class E. It turned out to be the most boats that ever participated in a regatta and commodore Danny Strachan said the organising committee couldn’t be more happy with the support they received. “This was by far the largest amount of boats that ever participated in the regatta,” Strachan said. “We had some inclement weather, but all of the boats came out and they performed extremely well. So we are quite pleased with the way things turned out. It was a tremendous regatta.” Strachan, since the inception of the regatta, said they have seen a tremendous increase in the participation of the boats and it turned out to be a successful regatta. He said the spectators had a lot of action on the water, which enabled more of them to view the competition. Based on the performances of the boats, Strachan said they are already planning for the 63rd version of the regatta next year. Use the comment form below to begin a discussion about this content. Username Password Forgot? Sign in Password Confirm password Email  Sign up OpenID Contents of this site are © Copyright 2023 Ellington. All rights reserved. ",
    "datetime": null,
    "url": "http://www.tribune242.com/news/2015/apr/27/tida-wave-new-susan-chase-whitty-k-and-judgment-d-/"
}