{
    "title": "Today, Korean band IN2IT and ALEXA to perform in New Delhi - Asian Community News",
    "text": "Asian Community News - Community News New Delhi: India rides on Korean wave, as K-Pop Contest is back again to sweep you off your feet. The famous K-pop band IN2IT and ALEXA that once danced to the tunes of Shah Rukh Khan starrer Bollywood Hindi movie Kabhie Khushi Kabhi Gham’ song Bole Chudiya, Bole Kangana during its first Indian tour in April this year, is visiting India again. This famous K-pop band will be performing during the LG K-Pop India contest 2019 Grand Finale happening at Talkatora Stadium today (Saturday) evening in New Delhi. IN2IT and ALEXA performance, which took place in Mumbai in April this year, started with ALEXA dancing in ethnic Indian wedding attire Lehenga Choli. She was then joined by the members of the K-Pop group Jiahn, Yeontae, Inho, Hyunuk, Isaac, Inpyo and Sunghyun, Having successfully completed its first two rounds of online submissions and regional round in multiple cities, the grand finale of 2019 LG K-Pop India Contest attracted more than 3000 entries across India this year. The contest is also celebrating its 8th edition this year. The K-pop contest, initiated in the year 2012, has become a festival of dance and music for Indian K-pop fans. A total of 3475 participants and 1952 teams have participated in this year contest. The fierce competition consists of the online, regional and final round with separate categories for Vocal and Performance. The vocal category is for singing Korean songs in the original language, and Performance is for the cover dance of original choreography of K-pop song. The final winner of LG K-POP INDIA CONTEST 2019 will represent India and compete in Changwon K-Pop World Festival.  The Indian representatives of 2016 and 2017 Changwon K-Pop Festival won the Excellent vocal and best performance awards respectively. Priyanka Mazumdar, the winner of 2016 contest, has recently debuted as K-pop group, Z-Girls. Ki-Wan-Kim-MD LG Electronics India said in a written statement, “It’s time to say that K-pop has finally arrived in India. We are extremely delighted to host the LG K-POP INDIA CONTEST 2019 in association with the Korean Cultural Centre. The craze and the jazz for this genre of music are gaining momentum in India, especially after the launch of Psy’s Gangnam Style. We are happy to give youngsters the right platform to live their passion which is validated from the encouraging participation that we have witnessed from the strong and enthusiastic fandom of K-pop in India.” Kim Kum-pyoung, Director of Korean Cultural Centre India, said “K-pop is a world phenomenon now, and Indian youngsters find K-pop for their generation” referring the increasing number of participants and enthusiastic fan clubs in India.” Individuals who are keen on attending this energizing K-Pop event can collect the entry pass from the Korean Cultural Centre, Lajpat Nagar. Also read: Contestants rocked at 2019 LG K-pop Contest Delhi regional round Prev Post (Exclusive): New Chinese Ambassador to India reaches New Delhi, assumes charge Next Post Korean investment: India facing stiff competition from Vietnam, Indonesia Gujarati Garba meets Japanese & Korean Elegance at Navratri celebrations Delhi girl Prachi, dance group ‘With Nine’ win All India K-Pop Contest 2023 All-India K-Pop Contest 2023 Kicks Off with Record-Breaking Participation Indian students learn traditional Korean patchwork craft Jogakbo, mask making Hahoe… Leave A Reply Cancel Reply Your email address will not be published.     Recent Posts Japanese all-girls pop group Momoiro Clover… India to host skill evaluation test, job… Gujarati Garba meets Japanese & Korean… ASCI implements guidelines for “Dark… Japanese giants Panasonic, NEDO, JICA join… Japan Science & Technology agency… Assam-Japan Gateway 2023 event in Guwahati… Data Protection for India’s FinTech… KCCI New Delhi student Srija Paul wins… Golf Wellness Club comes up at DIA Park… Galaxy of top journalists to gather at Web… Flow of business travellers to Korea… Trending News Japanese all-girls pop group Momoiro Clover Z marks 15th… India to host skill evaluation test, job fair for job… Gujarati Garba meets Japanese & Korean Elegance at… Popular Articles In these difficult times, it’s important that We Never… Namaste India introduces vegan food in Japan India Japan Laboratory, Keio University-IJBC delegation… Welcome, Login to your account. Recover your password. A password will be e-mailed to you. ",
    "datetime": "2019-07-23T16:30:20+00:00",
    "url": "https://www.asiancommunitynews.com/k-pop-band-in2it-and-alexa-to-rock-at-lg-k-pop-india-contest-2019-grand-finale-on-saturday/"
}