{
    "title": "Top K-pop group EXO closes 'Ko Ko Bop' era in Manila show | Philstar.com",
    "text": "MANILA, Philippines — The second visit of K-pop heavyweight EXO to the country this year meant one thing to Filipino fans—it was the end of a remarkable era. EXO was back in town as the headliner of South Korean music program MBC Show Champion in Manila last Sunday, only few days away before its highly-anticipated comeback on November 2. Last April, the boys of EXO were in the country for their concert “ElyXiOn.”  Members Xiumin, Suho, Baekhyun, Chen, Chanyeol, D.O., Kai and Sehun sent fans cheering loudly and waving their lightsticks and banners passionately the moment the K-pop stars took the stage. EXO performed tracks from its fourth studio album “The War” and repackaged album “The Power of Music,” which were both released in 2017. Filipino EXO-Ls were in for a treat as they witnessed the group’s 70th performance of its hit song “Ko Ko Bop.” The reggae and EDM hybrid track has always been EXO’s staple in every performance since its release last year.  EXO also staged the equally-impressive B-side tracks “What U Do” and “Boomerang,” which showcased the group’s outstanding vocal abilities. The night would not be complete without the group’s performance of “Power”—a song about how music brings people together. But as the fans bid farewell to the The War-The Power of Music era, they are more than ready to welcome a new one. EXO’s leader Suho said EXO-Ls should look forward to their new album and concert. Main dancer Kai was also seen giving spoilers of the choreography of the group’s upcoming single. EXO will have its long-awaited comeback with the album “Don’t Mess Up My Tempo” on Friday. MBC Music Show Champion was presented by MBC+ together with Lumos E&M and All Access Production. Philstar.com is one of the most vibrant, opinionated, discerning communities of readers on cyberspace. With your meaningful insights, help shape the stories that can shape the country. Sign up now! ",
    "datetime": null,
    "url": "https://www.philstar.com/entertainment/korean-wave/2018/10/30/1864439/top-k-pop-group-exo-closes-ko-ko-bop-era-manila-show"
}