{
    "title": "  Trending Now: An A-List Actor, Facial Fuzz, & More | The Alcalde",
    "text": "By\r\nJordan Schraeder              in\r\n              \n40 Acres, Jan | Feb 2013 \r\n              on\r\n              \r\nJanuary 4, 2013 at 1:11 pm               |\r\n              \r\nNo Comments Put actor Ryan Gosling in a movie and you get a box-office hit. Put him in Gregory Gym and you get full-on fan pandemonium. As of presstime, the star of The Notebook was filming an untitled Terrence Malick film in Austin, popping up on South Congress, the Drag, and yes, even on campus—much to the delight of Longhorns.  Catching a glimpse of Gosling has become somewhat of a campus-wide obsession. Website the Digital Texan even created a guide to his favorite Austin haunts for those feeling a bit stalker-ish. (Hole in the Wall and Guero’s Taco Bar are on the list.) “I’ve been faking a British accent since I got to college.” Thanks to a new free iPhone app, Whisper, Longhorns are sharing their deepest secrets—from the innocuous to the raunchy—anonymously with others on the Forty Acres. The app features confessions posted within a mile of the center of campus, and lucky for students with something to get off their chests, it doesn’t track or store data about its users. Popular “whisper” topics include relationships, spirituality, and self-esteem. The mustache trend is growing—bad pun intended. Whether it’s a handlebar or pencil, it seems there’s a lingering love of facial hair on campus following “Movember,” an event each November where men grow mustaches to raise awareness for men’s health. And this trend isn’t limited to men: mustaches can be found on jewelry, clothing, and more at various retailers. Gangnam Style, anyone? The catchy dance-pop single by artist Psy of South Korea has garnered more than 8 million views on YouTube and inspired many students to break out some crazy dance steps, including Psy’s go-to move: riding an imaginary horse. The Internet sensation—which inspired many a Sixth Street-costume on Halloween—is one of several Korean pop, or K-pop, hits to make it big this side of the Pacific, a phenomenon now known as the “Korean wave.” Top, photo by Brenda Avila. Inset, istockphoto. Tags: Gangnam Style, K-pop, mustaches, Ryan Gosling, Whisper App Be the first one to leave a comment. Click here to cancel reply.   Copyright © 2023 The Alcalde. All rights reserved. ",
    "datetime": "2013-01-04T18:11:46+00:00",
    "url": "https://alcalde.texasexes.org/2013/01/trending-now-an-a-list-actor-facial-fuzz-more/"
}