{
    "title": "Tribute to Pastor Chuck Smith Includes Praise for Biblical Foundation, Loyal Support of Israel | Church & Ministries News",
    "text": "The Christian Post To enjoy our website, you'll need to enable JavaScript in your web browser. Please click here to learn how. ANAHEIM, Calif. – Pastor Chuck Smith, regarded by many prominent Christian leaders as having influenced their ministries and spiritual lives, was remembered as a preacher holding firm to Biblical principles and a loyal friend to Israel at a memorial tribute Sunday evening. More than 16,000 people at the event, as well as those viewing the livestream webcast internationally, watched as Smith, who died on Oct. 3 after battling lung cancer, was honored through words, music, and video. \"He preached his last sermon four days before he went to heaven,\" said evangelist Greg Laurie, who was one of several featured pastors speaking at the Honda Center in Anaheim, Calif. \"…When a loved one leaves us, like Chuck, we feel great sadness, but I must say, please don't feel sadness for him. We might say, 'Oh, poor Chuck, I wish he could be here tonight to see all of this.' Wait a second, Chuck's in heaven right now. He's thinking 'I wish they could be up here to see all of this.'\" During the more than 3-hour tribute, featuring both pastors and musicians influenced by Smith's teachings during the Jesus Movement of the late '60s, Consulate General of Israel, David Siegel, spoke about the Calvary Chapel movement leader's commitment to Israel, that included 60 visits to the country. \"In the 65 years of Israel's rebirth as a modern nation, one would be hard pressed to find a more committed and more honorable friend than Pastor Chuck, a pioneer in forging relations between Christians and Jews, and between the Christian world and Israel,\" Siegel said. \"The bond he formed with us is comparable to the biblical friendship between Jonathan and David. Pastor Chuck was our Jonathan.\" He added, \"We are indebted and we are deeply touched. We join with you today to express our profound sadness and respect on behalf of the people of Israel for the passing of Pastor Chuck Smith. … He worked for historic reconciliation between Christians and Jews. With his passing, the state of Israel has lost a great friend.\" The nearly full-arena with rows of floor seating, configured specifically for the tribute, included lots of expressed emotions from those in the audience and participants. In addition to Laurie, other speakers included Pastors Jon Courson, Don McClure, Bob Coy, Tom Stipe, Raul Ries, and hosts Pastor Brian Brodersen and his wife, Cheryl. Musical artists who performed were Jeremy Camp, Phil Wickham, Love Song, Mustard Seed Faith, Parable, Dennis Agajanian, and Malcolm and Alwyn. Lieutenant Commander, Dennis Wheeler, a leading Calvary Chapel chaplain of the U.S. Navy, also spoke after a long ovation for the military service chaplains. Siegal, who spoke about midway through the event, said at the outset of his message: \"Being the representative of Israel, a kid from northern Israel and a rabbi's son, I've probably been to more synagogues and churches in my life, but I've never seen anything like this.\" While suggesting that some who were touched by the Jesus people or Calvary Chapel movements in its early days may have lost their full commitment to Jesus Christ, Laurie asked those in attendance and the online audience to consider making a recommitment Sunday evening. \"Some who started their race during the days of the Jesus Movement have stopped running,\" Laurie explained. \"They are resting on their laurels or have been crippled by sin. Paul said, 'Forgetting those things which are behind . . . I press toward the mark' (KJV). I can't think of a greater tribute that they could give to Chuck than to 'come back to their first love.' It's not enough to merely start the race; you must finish it.\" Laurie described the Christian life as not a playground, but a battleground. He said, \"Chuck was a fighter. He never quit. If something needed to be done he got up and did it.\" In talking about the afterlife, he said, \"Chuck is more alive than he has ever been before because Jesus said, 'I am the resurrection and the life and he that believes in me, though he were dead, yet shall he live.' That's the hope of the Christian.\" More than 52,000 watched \"A Tribute to Pastor Chuck\" live from 80 countries (including 420-plus simulcast churches), according to the event's webcast team. The tribute was also broadcast live nationally via Calvary Chapel's radio station, K-WAVE. The archived version of the tribute can be seen online by clicking here: http://pastorchucksmith.com/.  Was this article helpful? Want more articles like this? Help keep The Christian Post free for everyone by making a one-time donation today. We’re sorry to hear that. Hope you’ll give us another try and check out some other articles. Return to homepage. Join thousands of others to get the FREEDOM POST newsletter for free, sent twice a week from The Christian Post. A religious liberty newsletter that is a must-read for people of faith.  The Christian Post ",
    "datetime": "2013-10-28T15:10:12-04:00",
    "url": "https://www.christianpost.com/news/tribute-to-pastor-chuck-smith-includes-praise-for-biblical-foundation-loyal-support-of-israel.html"
}