{
    "title": "Twitch catches Korean wave, will stream 26 dramas this month - CNET",
    "text": "It’s only available in US, Canada and Latin America. Living in Singapore, I am officially jealous. Twitch will stream 254 episodes from 26 Kdramas this month, including fantasy romance Goblin: The Lonely and Great God. If you're a Korean TV drama addict, there's a new way you can get your fix. Twitch\n has announced a partnership with Warner Bros' DramaFever that will allow it to stream 254 episodes from 26 Korean dramas (Kdramas) four days a week throughout August. You can watch the shows on Twitch Presents every Wednesday to Saturday beginning 10 a.m. PT on Wednesday. It will run until 25 August in the US, Canada and Latin America. You can check the broadcast schedule for a full list of series and episodes on the website. Featured Kdramas will include romantic comedies, melodramas and crime thrillers. Join the stream to laugh, cry or curse at an evil character in real time while chattering with other fans. Twitch is no stranger to TV marathons, having previously hosted longer streams of Doctor Who, Saturday Night Live and Power Rangers. \"Korean dramas have become a cultural phenomenon outside of Asia based on the fresh plots with frequent cliffhangers, and being a window into the country's culture, including its fashion, food, and music,\" Jane Weedon, Twitch's director of business development, said in the statement. \"Because crossover appeal exists between fans of Kdramas and some of the popular content on Twitch, like Anime, we are fortunate that DramaFever has so many great Kdramas to share with our community,\" she added. If Twitch is successful in converting you into a Kdrama fan and you find yourself craving for more, here's a list of shows we think you might enjoy. Or you could try Busted!, a Korean variety show that sets a murder mystery whodunnit in a giant escape room. Fight the Power: Take a look at who's transforming the way we think about energy. 'Hello, humans': Google's Duplex could make Assistant the most lifelike AI yet. ",
    "datetime": null,
    "url": "https://www.cnet.com/culture/entertainment/twitch-catches-korean-wave-to-stream-26-dramas-this-month/"
}