{
    "title": "Two more women file rape claims against Korean Wave star Park Yu Chun | The Straits Times",
    "text": "SEOUL (THE KOREA HERALD/ASIA NEWS NETWORK) - Sexual assault charges continue to pile up against JYJ singer and actor Park Yu Chun, 30, with two more women claiming the idol raped them, bringing the current total to four alleged victims. According to the police last Friday, a third and a fourth complainants have come forward to file separate charges against Park. One woman claimed Park raped her in the bathroom of a karaoke establishment in February 2015, while another told the police he raped her in the bathroom of his house in June 2014. These cases come just a few days after a woman in her 20s filed the first police report against the entertainer on June 10, saying she was sexually assaulted by Park earlier this month in the bathroom of a bar where she works. Although she went on to drop the charges, saying there was \"no coercion during sexual intercourse with Park\", the police said they would continue to investigate the allegations, noting that the accused can still face criminal charges even if a complaint has been withdrawn. The police also noted that the complainant can also face punishment if it is found she made a false claim. However, the initial filing led to a domino effect, with the second woman claiming she finally found the courage to file a police report after learning about the ongoing investigation. The second woman told the police Park assaulted her on June 12 in a bathroom at a Gangnam bar where she worked - similar to the first woman's initial claims. Meanwhile, a drawing that featured cartoonish depictions of a toilet, a man and unidentified characters and objects, which is believed to have been made by Park a few years ago, has gone viral on social media. Another captured image of a remark made by a foreign online user, saying \"Why Yu Chun loves to draw toilet bowl so much LOL and what is the motive tho?!\" has also spread quickly online. Park is popular in Asian countries, especially in Japan and China. Officials from his agency C-JeS Entertainment continue to deny the allegations against him, maintaining their defence of his innocence. They stated they would take legal actions against all those involved over defamation and libel. They said that Park has pledged to leave the entertainment business if any of the charges are found to be true. Park is currently serving as a public agent at Gangnam-gu Office in Seoul in lieu of military conscription. Join ST's Telegram channel and get the latest breaking news delivered to you. Read 3 articles and stand to win rewards Spin the wheel now MCI (P) 066/10/2023. Published by SPH Media Limited, Co. Regn. No. 202120748H. Copyright © 2023 SPH Media Limited. All rights reserved. ",
    "datetime": "2016-06-20T10:42:42+08:00",
    "url": "https://www.straitstimes.com/lifestyle/entertainment/two-more-women-file-rape-claims-against-korean-wave-star-park-yu-chun"
}