{
    "title": "U.S. State Dept. spokeswoman tweets congratulations on 'Parasite' wins | Yonhap News Agency",
    "text": "All Headlines North Korea Sports Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies URL is copied. By Lee Haye-ah WASHINGTON, Feb. 10 (Yonhap) -- The U.S. State Department spokeswoman on Monday tweeted her congratulations to the production team of \"Parasite\" after the South Korean movie won four Oscar titles. The sensational black comedy by Bong Joon-ho took best picture, best director, best original screenplay and best international feature film at the 92nd Academy Awards on Sunday. It became the first non-English language film to win best picture. It was South Korea's first Oscar-nominated film. \"Happy to see a foreign language film win Best Picture for the first time at the Academy Awards!\" tweeted the spokeswoman, Morgan Ortagus. \"Congratulations to the South Korean cast and creative team of ParasiteMovie -- your four Oscars were well deserved! The Korean wave has definitely arrived.\" In her tweet, Ortagus linked to another tweet by U.S. Ambassador to South Korea Harry Harris. The ambassador wrote, \"More Oscars did come for ParasiteMovie and Director Bong Joon-Ho! 4 total: Best Original Screenplay, Best Int'l Feature, Best Director & 1st time in Academy Awards history a non-English language film wins Best Picture! Wow! Congrats Director Bong, Team Parasite & ROK cinema!\" Harris posted a photo of Bong accepting the best picture award, as well as pictures of him and his staff watching the awards ceremony on television, and a bowl of noodles called \"jjapaguri,\" which was made famous through the film. In an earlier tweet apparently sent after Bong won his first Oscar, Harris wrote: \"Enjoying the Embassy's Oscars Watch Party with a bowl of 'jjapaguri.' Congratulations to Korean Director Bong Joon-Ho for 'Parasite' winning Best Screenplay ... ROK's first-ever Oscar! More awards to come!\" ROK stands for South Korea's official name, the Republic of Korea. This screenshot shows U.S. State Department spokeswoman Morgan Ortagus' tweet congratulating the production team of \"Parasite.\" (Yonhap)  hague@yna.co.kr(END) All News National North Korea Economy/Finance Biz Culture/K-pop Sports Images Videos Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies Korea in Brief Useful Links Festival Calendar Weather Advertise with Yonhap News Agency ",
    "datetime": "2020-02-11T05:52:36+09:00",
    "url": "https://en.yna.co.kr/view/AEN20200211000600325"
}