{
    "title": "U2 Relive Northern Ireland's Violence in 'Every Breaking Wave' Clip",
    "text": "By \n\n\tKory Grow The video for U2‘s new Songs of Innocence single, “Every Breaking Wave,” dramatizes the wave of violence that swept Northern Ireland in the Eighties. Belfast-born filmmaker Aoife McArdle made the clip using footage from her 13-minute short film, Every Breaking Wave (streaming below), which came out earlier this month and made use of the U2 song of the same name and Songs of Innocence‘s final cut “The Troubles.” The video opens with images of moshing and crowdsurfing at a punk show — made surreal with U2’s serene soundtrack — as a skinhead teen and young woman lock eyes. It chronicles their fast romance, running through the woods and diving into swimming pools, and also depicts the religious divide between them (one is Catholic; the other Protestant). From the Sixties through the late Nineties, Northern Ireland was the scene of violence as Protestant Unionists clashed with Catholic republicans, who wanted to secede from the U.K. and join the rest of Ireland. The lovers’ story accordingly ends in tragedy in the clip. Trending\n\t\n\t\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tAt Least 22 Dead and Suspect at Large in Maine Shooting\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tDuran Duran Have Gone Fully Goth on Their New Album. Wait, What?\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBob Lee’s Murder Shook San Francisco. What Really Happened?\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tWatch Lady Gaga Perform 'Shallow' With U2 in Las Vegas Sphere  None of the band members appear in the clip, likely for narrative purposes but also because frontman Bono is still recovering from the New York City bike accident that left him with fractures in his face, shoulder and arm last year. “Recovery has been more difficult than I thought,” the singer wrote in January. “As I write this, it is not clear that I will ever play guitar again. The band have reminded me that neither they, nor Western civilization, are depending on this…but then does the Edge, or Jimmy Page, or any guitarist you know have a titanium elbow, as I do now?” Despite the vocalist’s injuries, U2 have set a string of tour dates for the summer and fall. Each location of the tour will feature multiple concerts by the band. “We are going to try to have a completely different feeling from night one to night two and have some fun playing with the idea of innocence and experience,” Bono said in a statement when the tour was announced. “More to be revealed!” We want to hear it. Send us a tip using our anonymous form. Rolling Stone is a part of Penske Media Corporation. © 2023 Rolling Stone, LLC. All rights reserved. ",
    "datetime": "2015-02-23T19:32:00+00:00",
    "url": "https://www.rollingstone.com/music/music-news/u2-relive-northern-irelands-violent-past-in-every-breaking-wave-video-103413/"
}