{
    "title": "Ursula K. Le Guin’s The Lathe of Heaven: An excerpt from her 1971 classic sci-fi novel, published for the first time as an eBook. ",
    "text": "Photo courtesy Marian Wood Kolisch In Ursula K. Le Guin’s classic 1971 science fiction novel The Lathe of Heaven, George Orr discovers that his dreams have the power to alter reality. Upon waking, the world he knew has become a strange, barely recognizable place, where only George has the clear memory of how it was before. He seeks counseling from Dr. William Haber, a psychiatrist who immediately understands how powerful a weapon George wields. Soon, George is Haber’s pawn, and the fate of humanity grows more imperiled with every waking hour. The Lathe of Heaven is at once eerie and prescient, wildly entertaining and ferociously intelligent. This marks the first publication of The Lathe of Heaven as an eBook, and Slate and Diversion Books are offering Le Guin’s novel at a special price, $3.99, for one week only. To order the book, click here. Read Chapter 1 of The Lathe of Heaven below. “Confucius and you are both dreams, and I who say you are dreams am a dream myself. This is a paradox. Tomorrow a wise man may explain it; that tomorrow will not be for ten thousand generations.” — CHUANG TSE: II Current-borne, wave-flung, tugged hugely by the whole might of ocean, the jellyfish drifts in the tidal abyss. The light shines through it, and the dark enters it. Borne, flung, tugged from anywhere to anywhere, for in the deep sea there is no compass but nearer and farther, higher and lower, the jellyfish hangs and sways; pulses move slight and quick within it, as the vast diurnal pulses beat in the moon-driven sea. Hanging, swaying, pulsing, the most vulnerable and insubstantial creature, it has for its defense the violence and power of the whole ocean, to which it has entrusted its being, its going, and its will. But here rise the stubborn continents. The shelves of gravel and the cliffs of rock break from water baldly into air, that dry, terrible outerspace of radiance and instability, where there is no support for life. And now, now the currents mislead and the waves betray, breaking their endless circle, to leap up in loud foam against rock and air, breaking … What will the creature made all of seadrift do on the dry sand of daylight; what will the mind do, each morning, waking? His eyelids had been burned away, so that he could not close his eyes, and the light entered into his brain, searing. He could not turn his head, for blocks of fallen concrete pinned him down and the steel rods projecting from their cores held his head in a vise. When these were gone he could move again; he sat up. He was on the cement steps; a dandelion flowered by his hand, growing from a little cracked place in the steps. After a while he stood up, but as soon as he was on his feet he felt deathly sick, and knew it was the radiation sickness. The door was only two feet from him, for the balloonbed when inflated half filled his room. He got to the door and opened it and went through it. There stretched the endless linoleum corridor, heaving slightly up and down for miles, and far down it, very far, the men’s room. He started out toward it, trying to hold on to the wall, but there was nothing to hold on to, and the wall turned into the floor. “Easy now. Easy there.” The elevator guard’s face was hanging above him like a paper lantern, pallid, fringed with graying hair. “It’s the radiation,” he said, but Mannie didn’t seem to understand, saying only, “Take it easy.” He was back on his bed in his room. “You drunk?” “No.” “High on something?” “Sick.” “What you been taking?” “Couldn’t find the fit,” he said, meaning that he had been trying to lock the door through which the dreams came, but none of the keys had fit the lock. “Medic’s coming up from the fifteenth floor,” Mannie said faintly through the roar of breaking seas. He was floundering and trying to breathe. A stranger was sitting on his bed holding a hypodermic and looking at him. “That did it,” the stranger said. “He’s coming round. Feel like hell? Take it easy. You ought to feel like hell. Take all this at once?” He displayed seven of the little plastifoil envelopes from the autodrug dispensary. “Lousy, mixture, barbiturates and Dexedrine. What were you trying to do to yourself?” It was hard to breathe, but the sickness was gone, leaving only an awful weakness. “They’re all dated this week,” the medic went on, a young man with a brown ponytail and bad teeth. “Which means they’re not all off your own Pharmacy Card, so I’ve got to report you for borrowing. I don’t like to, but I got called in and I haven’t any choice, see. But don’t worry, with these drugs it’s not a felony, you’ll just get a notice to report to the police station and they’ll send you up to the Med School or the Area Clinic for examination, and you’ll be referred to an M.D. or a shrink for VTT—Voluntary Therapeutic Treatment. I filled out the form on you already, used your ID; all I need to know is how long you been using these drugs in more than your personal allotment?” “Couple months.” The medic scribbled on a paper on his knee. “And who’d you borrow Pharm Cards from?” “Friends.” “Got to have the names.” After a while the medic said, “One name, anyhow. Just a formality. It won’t get ’em in trouble. See, they’ll just get a reprimand from the police, and HEW Control will keep a check on their Pharm Cards for a year. Just a formality. One name.” “I can’t. They were trying to help me.” “Look, if you won’t give the names, you’re resisting, and you’ll either go to jail or get stuck into Obligatory Therapy, in an institution. Anyway they can trace the cards through the autodrug records if they want to, this just saves ’em time. Come on, just give me one of the names.” He covered his face with his arms to keep out the unendurable light and said, “I can’t. I can’t do it. I need help.” “He borrowed my card,” the elevator guard said. “Yeah. Mannie Ahrens, 247-602-6023.” The medic’s pen went scribble scribble. “I never used your card.” “So confuse ’em a little. They won’t check. People use people’s Pharm Cards all the time, they can’t check. I loan mine, use another cat’s, all the time. Got a whole collection of those reprimand things. They don’t know. I taken things HEW never even heard of. You ain’t been on the hook before. Take it easy, George.” “I can’t,” he said, meaning that he could not let Mannie lie for him, could not stop him from lying for him, could not take it easy, could not go on. “You’ll feel better in two, three hours,” the medic said. “But stay in today. Anyhow downtown’s all tied up, the GPRT drivers are trying another strike and the National Guard’s trying to run the subway trains and the news says it’s one hell of a mess. Stay put. I got to go, I walk to work, damn it, ten minutes from here, that State Housing Complex down on Macadam.” The bed jounced as he stood up. “You know there’s two hundred sixty kids in that one complex suffering from kwashiorkor? All low-income or Basic Support families, and they aren’t getting protein. And what the hell am I supposed to do about it? I’ve put in five different reqs for Minimal Protein Ration for those kids and they don’t come, it’s all red tape and excuses. People on Basic Support can afford to buy sufficient food, they keep telling me. Sure, but what if the food isn’t there to buy? Ah, the hell with it. I go give ’em Vitamin C shots and try to pretend that starvation is just scurvy…” The door shut. The bed jounced when Mannie sat down on it where the medic had been sitting. There was a faint smell, sweetish, like newly cut grass. Out of the darkness of closed eyes, the mist rising all round, Mannie’s voice said remotely, “Ain’t it great to be alive?” Slate and Diversion Books are offering the first-ever eBook of The Lathe of Heaven at a special price, $3.99, for one week only. To order the book, click here. Ursula K. Le Guin is the author of the Earthsea series, the Hainish series, and other novels. Ursula K. Le Guin is the author of the Earthsea series, the Hainish series, and other novels. Slate is published by The Slate Group, a Graham Holdings Company. All contents ©\n        2019  The Slate Group LLC. All rights reserved. ",
    "datetime": null,
    "url": "http://www.slate.com/articles/arts/culturebox/2014/04/ursula_k_le_guin_s_the_lathe_of_heaven_an_excerpt_from_her_1971_classic.html"
}