{
    "title": "Ursula Le Guin: ‘Wizardry is artistry’ | Ursula K Le Guin | The Guardian",
    "text": "As Ursula Le Guin receives the Medal for Distinguished Contribution to American Letters at the National Book Awards, she talks to Hari Kunzru about alternative fictional worlds Ursula K Le Guin’s speech at National Book Awards: ‘Books aren’t just commodities’ Ursula Le Guin cries freedom as she is honoured for contribution to literature Ursula K Le Guin lives along a winding road in a suburb of Portland, Oregon. Walking uphill towards her house I find the way spectacularly blocked. A bridge is being rebuilt and the road is broken by a steep drop, forcing me to pick my way along a trail down into a ravine, then back up the other side. This small detour feels auspicious. There ought to be more adventure on such a journey than an airport security queue and a taxi rank. I am resisting the temptation to use the language of the quest here, or get into any dubious comparisons between writers and wizards or witches. I didn’t have to change myself into a hawk or cross over into the land of the dead. I have rarely gone to visit a writer bearing so many messages of love and admiration. People want to thank Le Guin. Many readers discover her young, through her Earthsea sequence, now acknowledged as one of the great works of 20th-century fantasy. This week, 40 years after the third Earthsea book, The Farthest Shore, won the National Book award in children’s literature, Le Guin has been awarded the Medal for Distinguished Contribution to American Letters, presented to her by Neil Gaiman in New York. One of my friends, a Le Guin fan of great depth and seriousness, remembers being nine years old, in pain and distress as he recovered from open-heart surgery. “Reading the Earthsea trilogy saved my life,” he wrote to me. I don’t think he was being altogether rhetorical. Escape is derided as the cheapest of literary pleasures, “escapism” the name for a particular kind of aesthetic cowardice, a culpable flight from the real. But there are situations when what you need is teleportation. You need to get out of the surgical ward. You need to stay in Earthsea for as long as your imagination can float its little open boat. “He’s more than welcome,” Le Guin says, when I relay my friend’s thanks. In person she is tiny. The unwary might mistake her simply for the genial 84-year-old wife of a retired academic, a cat owner, who has lived quietly in the same house for half a century. Perhaps it takes a certain kind of temperament to absorb so much devotion and retain equanimity. A fierce, waspish energy animates her as she listens and speaks, but for a writer she seems strikingly unneedy. She frequently talks about herself as an object of wry or amused discovery. “Apparently,” she will say, “I don’t mind living in the margins, because I’ve put myself there often enough. Apparently, I never sought moral guidance in religion,” as if her past is a kind of text, from which she is only now making these deductions. In an astonishing run in the late 1960s and early 70s, Le Guin produced not just Earthsea but several of the great novels of science fiction’s postwar new wave. The Lathe of Heaven, The Dispossessed, The Word for World Is Forest and The Left Hand of Darkness fulfilled the genre’s promise, using speculation to address social, political, ethical and metaphysical questions. Since then she has continued to publish novels and short stories informed by the mystical philosophy of the Tao Te Ching and the west coast tradition of political radicalism, written in a clear, clean prose that is never tainted by inkhorn medievalism or technological jargon. A two-volume collection of stories, The Unreal and the Real, was published this summer, giving an overview of her entire career. Because of her subject matter, Le Guin isn’t always recognised for what she is, one of the great writers of the American west, a product of a coastal tradition that looks forward at the Pacific with a wilderness at its back and the great cities of Europe very far to the rear. Le Guin claims to “get very uppity” about the “parochialism and snobbishness” of the East Coast literary establishment. “The idea that everybody lives in a large city in the east, it’s such a strange thing for an American to think.” She grew up in Berkeley, the daughter of Alfred Kroeber, one of the major figures in US anthropology. Her mother was Theodora Kroeber, who became well known in the 1960s, around the time of her daughter’s first fame, as the author of popular books about Ishi, the last survivor of the Yahi tribe, who had lived as her husband’s ward in the early years of the century. Alfred, a student of the “father of American anthropology” Franz Boas, gathered and preserved information about native peoples and traditions in California, excavated archaeological sites in Mexico and Peru, and some years before his daughter’s birth had briefly practised as a psychoanalyst. The family home was a magnet for displaced European emigres, many of them anthropologists. Le Guin remembers dozens of intellectuals “in and out of the house”. Many of her earliest stories are set in a fictional middle European country she called Orsinia, like her own name a derivation of the Latin for bear. Summers were spent in the Napa Valley, not then the manicured hub of boutique agribusiness it is today. “It was much more like a valley in Provence or Italy. Olives and plums and apricots and grapes. They grew everything. Lots of small farms, Italian family farms. North Italians came there because they recognised it, they knew what to do with that land.” In a “wild and hairy” farmhouse, the Kroebers would also play host to the Native American subjects of Alfred’s research, giving the young Ursula “an experience that a great many American kids don’t have, of knowing people really from somewhere else”. Her father was one of the pioneers of “cultural relativism”, a theory that was to have huge influence on the progressive politics of the late 20th century. The notion that desires and moral values may be culturally specific was enormously challenging to a Victorian intellectual framework that dealt in universal hierarchies. For a nation that was just mopping up after a 300-year genocide, the thought that the people they had eradicated weren’t inferior but different was (and remains) unwelcome. Le Guin’s fiction is littered with moments of cultural contact, and heroes who approach the unfamiliar with an open mind and a desire to learn. How much of this perspective was learned in the family home? “It’s got to be partly nurture,” Le Guin allows, “but I really wonder if it’s partly nature, too, if I simply inherited something like my father’s temperament.” I put it to her that humility before otherness is always a signal virtue in her fiction. “It’s great curiosity also,” she says. “You want to know. You want to go and be there.” The Word for World Is Forest, published in 1972, is clearly a product of this view. The book is a response to the Vietnam war, to which Le Guin was vehemently opposed. In a 2008 interview with the novelist Alexander Chee, she remembered writing it in London, where she and her husband were spending a sabbatical year. “I was unable to protest my country’s increasing involvement by non-violent action. My frustrated anger and shame went pretty directly into the book.” The planet Athshe, an Edenic forest world, is the site of New Tahiti, a human logging colony. The humans have casually enslaved the inhabitants, who are peaceful, physically slight, with a subsistence-level material culture. The narrative pits Captain Davidson – a violent exploiter whose rape and murder of a native woman sparks a revolt in the hominids he derisively calls “creechies”– against anthropologist Raj Lyubov, who becomes a kind of species traitor as he discovers more about the nature of the native relationship to the forest. The anthropologist is despised by the military commander because he appears content to be in the world, to try to understand without altering it or bending it to his will. Lyubov, precisely because he is mindful and aware, realises that Athshe’s inhabitants, stigmatizsed as lazy and work-shy, actually spend part of their “waking” time in a state of lucid dreaming. If this reminds you of James Cameron’s 2009 blockbuster Avatar, you’re not alone (though the aliens in the film are large and blue rather than small and green). In Le Guin’s opinion, Cameron “had quite a few people to thank” for inspiring his story, but “he dodged all that”. Likewise she thinks JK Rowling “could have been more generous” in acknowledging A Wizard of Earthsea (1968), a novel in which a young boy attends a school for wizards and attracts the attention of metaphysical dark forces. Though Le Guin is certainly a famous writer, she is probably not as famous as she ought to be, and these days her influence is mainly felt indirectly. Her novels, like Ray Bradbury’s short story about cultural assimilation, “Dark They Were and Golden Eyed”, and Robert Heinlein’s novel Stranger in a Strange Land were among the dog-eared paperbacks that passed hand to hand in squats and communes across the US, as SF became one of the unacknowledged intellectual drivers of the counterculture. As she writes in her 1997 translation of the Tao Te Ching “true leaders/ are hardly known to their followers … when the work’s done right/ with no fuss or boasting/ ordinary people say/ Oh, we did it.” Le Guin’s engagement with Taoism underpins The Lathe of Heaven (1971). It’s set in a dystopian version of Portland in 2002, where George Orr arrives in the consulting room of Dr William Heber, an ambitious psychiatrist. Orr has been trying to avoid sleeping because he believes his dreams are “effective” and can alter the course of events. Heber, at first understandably sceptical, comes to believe in Orr’s power and makes disastrous attempts to harness it, producing a series of increasingly appalling realities. George Orr has a logical operator for a surname, because his mind is a garden of forking paths. The book produces a state of radical uncertainty, as the city outside the psychiatrist’s window changes with each waking. Does Le Guin believe that dreams have such power? “No, except insofar as they are obviously the dark parts of one’s mind operating, and we do affect the world. I’m not a lucid dreamer; I think my dreams are quite ordinary.” The title The Lathe of Heaven is an artefact of a 19th-century translation of the Zhuangzi (Chuang-Tzu), the collection of anecdotes and parables traditionally attributed to the Taoist sage Zhuang Zhou, the best known of which features a sage who doesn’t know whether he has dreamed of being a butterfly, or is a butterfly dreaming he is a man. “To let understanding stop at what cannot be understood is a high attainment. Those who cannot do it will be destroyed on the lathe of heaven.” Heber’s hubristic desire for control is, in Taoist terms, evidence of lack of spiritual attainment. It makes him a monster of a less obvious kind than the colonial overseer Davidson, but a monster nonetheless. After The Lathe of Heaven was published, Le Guin was contacted by a sinologist who informed her that her source for the title was inaccurate – the 1891 James Legge translation she was using had many problems: for one thing, the lathe had not been invented at the time of the Zhuangzi’s composition. Le Guin brushed away this disappointing news. “At least I got a good title out of it.” Le Guin had first discovered the Tao Te Ching as a teenager, and her own version (“a rendition, not a translation”) was the result of many years of wrestling with the obscurities of this terse, enigmatic text. “My father had a copy of Paul Carus’s translation. It has the whole Chinese text with transliteration and literal translation. You realise that a single word can be two or three different words in English. I think I was 14, 15, the age when you’re beginning to look around for religious guidance or whatever you want to call it. I found in it the thoughts I wanted to think, I guess. Much later I stumbled into pacifist anarchism. I thought I must educate myself about non-violence, so I read Gandhi and branched out from there.” Le Guin’s self-education ultimately took the form of The Dispossessed (1974), one of the most fully realised visions of a functioning anarchist society in literature. The novel is set on the planet Urras and its moon Anarres. Centuries earlier, to forestall a revolution, the Urrasti allowed anarchist sectarians to settle on the moon, giving them a guarantee of non-interference. The two societies have developed separately, with little contact. Anarres has become a place without authoritarian institutions or a conception of private property, while Urras has many states and ideologies, broadly reflecting the various alignments of the cold war period in which the book was written. “What did I know about Utopia?” she reminisced in a 1976 essay about the book. “Scraps of More, fragments of Wells, Hudson, Morris. Nothing.” Looking for models, she took assistance from “Engels, Marx, Godwin, Goldman, Goodman and above all Shelley and Kropotkin”. One of Le Guin’s great imaginative strengths is, paradoxically, her dislike of whimsy, and The Dispossessed considers many un-Utopian practicalities – who sleeps where, who looks after the children, how work is assigned and performed and compensated. The book still circulates widely in activist circles, and young anarchists often find their way to its author, hoping for political advice. These encounters make her “embarrassed and a bit guilty”, because one of her conclusions from writing the book was that “the only way it can be done” –“it” being the full implementation of an anarchist system of social organisation – “is to be completely isolated from everybody else. Then it will probably all the same destroy itself from inside, because we are perverse creatures. But it was a lovely thing to follow through in a novel, as an intellectual framework for a book. Which is really what anarchism was to me, a way of thinking, a way of imagining, but not a belief.” The “dispossessed” of Anarres are, of course, those who attempt to live without property, but also without a certain kind of language. They have no possessive pronouns (not “you can borrow my handkerchief”, but “you can share the handkerchief I use”) and abjure possessive sexuality. “The language Shevek spoke, the only one he knew, lacked any proprietary idioms for the sexual act … The usual verb, taking only a plural subject … meant something two people did, not something one person did, or had.” Like much of Le Guin’s writing, this is marked by her engagement with the women’s movement, and the notion that a patriarchal language will produce a patriarchal world. The Left Hand of Darkness (1969), probably Le Guin’s most celebrated work, is a novel that follows a human emissary to a winter planet whose inhabitants spend most of their time as asexual “potentials”, only adopting gender during a period of sexual receptivity known as “kemmer”. Le Guin follows trains of thought about sexual desire, gender identities and parenting. Like The Dispossessed, it was, she has written, “a thought experiment … Because of our lifelong social conditioning, it is hard for us to see clearly what, besides purely physiological form and function, truly differentiates men and women.” The novel has become a classic not just because of its themes, resonant though they have proved to be. Le Guin has a commitment to world-building, to constructing her unreal cities along scrupulously realist lines. In an excoriating review of On Such a Full Sea, Chang-Rae Lee’s recent foray into dystopian SF, she lists various faults of logic and plausibility, charging him with being just another literary tourist, one of a crowd of mainstream writers who have dabbled in the genre without paying their dues. “Neglect of such literal, rational questions in imaginative fiction is often excused, even legitimised, as literary licence. Because the author is known as a literary writer, he will probably be granted the licence he takes. But social science fiction is granted no such irresponsibility … Like Cormac McCarthy and others, Lee uses essential elements of a serious genre irresponsibility, superficially.” “I hated to do that,” says Le Guin of delivering this stinging rebuke. I half-believe her. Speculative fiction’s commitment to plausible, coherent world-building is often overlooked (or even attacked) by critics , and Le Guin would hardly be the first SF writer to feel irritated that the difficulty of her craft was underrated. Of course, her preference for coherent, consistent worlds is not prescriptive. She has termed SF “a crazy, protean, left-handed monkey wrench”, a fictional tool that “can be put to any use the craftsman has in mind – satire, extrapolation, prediction, absurdity, exactitude, exaggeration, warning, message-carrying, tale-telling, whatever you like”. Throwing the ultimate insult back at its detractors, she has also remarked that “fake realism is the escapism of our time”. She is not, for example, a fan of John Updike, though at the time of my visit she was reading and enjoying Arnold Bennett. Le Guin may be able to produce effective dreams, escape routes for the reader, but she is not an escapist. Her writing walks towards reality, not away from it. For all its furniture of spells and dragons, her Earthsea trilogy has something pithy and solid about it, something defiantly unwhimsical. In Earthsea, magic is predicated on naming, on knowing the “true name” of a person, place or thing. Her wizards attempt a sort of disclosure of the world as it is, rather than a flight from it. Le Guin has observed that “wizardry is artistry. The trilogy is, in this sense, about art, the creative experience, the creative process.” Le Guin’s own creativity has barely slowed over the years. In the noughties she wrote a trilogy (Gifts, Voices and Powers) that was marketed as teen paranormal fiction, thus ensuring it missed much of its audience. Her last novel, Lavinia, in which she adopts the voice of a minor character in the Aeneid, appeared in 2008, and since then she has published stories, essays and poetry. In The Farthest Shore (1972), the third part of the Earthsea sequence, the mage Sparrowhawk offers a quasi-Taoist lesson in ethics to a young prince, as they sail a small open boat into the west: On every act the balance of the whole depends. The winds and seas, the powers of water and earth and light, all that these do, and all that the beasts and green things do, is well done, and rightly done. All these act within the Equilibrium. From the hurricane and the great whale’s sounding to the fall of a dry leaf and the gnat’s flight, all they do is done within the balance of the whole. But we, in so far as we have power over the world and over one another, we must learn to do what the leaf and the whale and the wind do of their own nature. We must learn to keep the balance. Having intelligence, we must not act in ignorance. Having choice, we must not act without responsibility. Or, as Le Guin put it to me: “If you’re going to create a world out of whole cloth, that is to say, out of words, then you better get the words right.” ",
    "datetime": "2014-11-20T17:53:14.000Z",
    "url": "https://www.theguardian.com/books/2014/nov/20/ursula-le-guin-wizardry-is-artistry-interview-national-book-awards"
}