{
    "title": "Ursula K. Le Guin's Voice Rings Out In New Nonfiction Collection : NPR",
    "text": "By Jason Heller Your purchase helps support NPR programming. How? Ursula K. Le Guin's mastery of fiction has remained so consistent throughout her decades-long career, it's easy to overlook her accomplishments in other forms. Sure, she's the author of iconic, award-winning science fiction novels such as 1969's The Left Hand of Darkness and 1971's The Lathe of Heaven, not to mention the beloved fantasy series The Earthsea Cycle, which began in 1968. But those distinct works share Le Guin's firm grasp of poetic language, science, and history. Accordingly, she's a brilliant poet, albeit a less recognized one. Even further down on her résumé are her wins as a nonfiction writer. Her 2016 collection of essays and reviews, Words Are My Matter, won the Hugo Award for Best Related Work in 2017, despite the fact that the book did not focus exclusively on science fiction — nor do her other nonfiction collections, including The Wave in the Mind from 2004 and now, No Time to Spare, a new book that assembles some of her most cogent ruminations on everything from gender politics to anthropology to, yes, science fiction and fantasy. One of our most acclaimed and inventive authors of speculative fiction, specifically science fiction and fantasy, Le Guin has thought — and written — long and hard about genre. With her characteristic mix of wit and erudition, she dives into the definitions of science fiction and fantasy in \"Genre: A Word Only a Frenchman Could Love,\" her definitive statement on the subject. In the essay — which appears in Words Are My Matter but was originally a speech she delivered at a Public Library Association conference — Le Guin cites Virginia Woolf, Jorge Luis Borges, and the Bible in a sweeping, penetrating take on the way we categorize and prejudge everything from space opera to romance. Her takeaway (\"There are many bad books. There are no bad genres.\") exemplifies her keen ability to boil down complex issues to their essence, even as she argues with nuance and grace. Your purchase helps support NPR programming. How? Le Guin champions genre fiction — but not blindly. \"It Doesn't Have to Be the Way It Is\" from No Time to Spare sharply examines the traditional function and substructure of fantasy literature, a place where \"imagination and fundamentalism come into conflict.\" Her point is that fantasy is not, as widely assumed, a form of fiction where anything goes. Uncertainty is an important building block in fantasy literature, but the genre largely fails when it has no internal causality. \"It's hard for me to imagine that anyone who likes science can dislike fantasy,\" she says, and then — in a tactic she often employs — she uses that seeming paradox to illuminate the big truths, as she sees them, behind the philosophy of storytelling. At the same time, she's not above rolling up her sleeves and geeking out, as she does in her The Wave in the Mind essay \"Rhythmic Pattern in The Lord of the Rings\" — which is just as joyously bookish as the title implies. As strongly as genre factors into Le Guin's nonfiction, so does gender. In the essay \"Introducing Myself\" from The Wave in the Mind, she ponders male and female pronouns, spinning the issue into a clever, biting thought experiment about body image, the force of language, and the fluidity of identity. It's not a surprising position, considering that one of Le Guin's most celebrated novels, The Left Hand of Darkness, dramatizes these same issues, only on an alien planet many centuries in the future. One of her most powerful qualities is her ability to frame contemporary concerns within the far-flung speculation of science fiction, but essays like No Time to Spare's \"A Band of Brothers, a Stream of Sisters\" highlights just how adept she is at writing about the real world. In the piece, she gauges female solidarity against male solidarity, measuring with a sociologist's eye as well as a feminist's. \"Can women operate as women in a male institution without becoming imitation men?\" she asks, solidifying a question that floats more subtly at the heart of her fiction. Le Guin's clinical, theoretical way of framing complicated social and literary ideas makes sense. Her parents were the noted anthropologists Alfred Louis Kroeber and Theodora Kracaw — a fact that doesn't usually come up in her nonfiction. She makes an except in \"Indian Uncles,\" one of The Wave in the Mind's most heartfelt essays. She originally delivered it as a lecture in 1991 at the University of California at Berkeley, where her father taught and her mother studied. Le Guin recounts, from her point of a view, part of the events surrounding the famous case of Ishi, a member of the Native American Yahi people who became the subject of Kracaw's 1961 book Ishi in Two Worlds. Your purchase helps support NPR programming. How? Ishi died in 1916, thirteen years before Le Guin was born, but in \"Indian Uncles\" she writes eloquently and intimately about the how Ishi's time with her parents inspired and haunted them throughout their lives, and how her own life was shaped by this invisible \"uncle.\" She ventures into autobiography again, with equally poignant results, in Words Are My Matter's \"Living in a Work of Art\" — an essay that starts out being about the famed Bay Area architect Bernard Maybeck and ends up dwelling on her own childhood living in a house Maybeck built, a magical home built \"of light and air and redwood. And shadows.\" Above all, however, Le Guin is a word wonk. Her many book reviews in Words Are My Matter, first published in The Guardian, The Women's Review of Books, and others, are both playful and crisp, from her takedown of J. G. Ballard's bleak nihilism in Kingdom Come to her praise of Margaret Atwood's mysterious vision in The Year of the Flood. But some of her most spirited nonfiction writing is about writing itself. \"The Narrative Gift as a Moral Conundrum\" from No Time to Spare lays bare the substructure of storytelling, the notion that causality and plot are what define fiction — with Le Guin gleefully challenging preconceptions about what makes a story worthy and wonderful. And in \"Old Body Not Writing\" from The Wave in the Mind, she dives inward, cataloging her own motivational tics as an author, concluding with a mix of ecstasy and despair that \"I would rather be writing than anything else.\" That simple, profound sentence also sums up the thrust of her nonfiction as a whole. It's a complement to her fiction, definitely, but it's also one more window through which Le Guin's sage voice — alternately academic and homespun — rings. Jason Heller is a Hugo Award-winning editor and author of the forthcoming book Strange Stars (Melville House). Twitter: @jason_m_heller Sponsor Message Become an NPR sponsor ",
    "datetime": null,
    "url": "https://www.npr.org/2017/12/17/570873288/ursula-k-le-guins-voice-rings-out-in-new-nonfiction-collection"
}