{
    "title": "US Enrollment in Korean Language Classes Growing",
    "text": "No media source currently available Print Korean language study is quickly growing in popularity across the United States. The Modern Language Association finds that college enrollments in Korean increased by almost 45 percent between 2009 and 2013. This is happening at a time when total language enrollments have fallen. Fans call Korean popular music K-pop. It has attracted fans from around the world. It has caught on thanks to the Internet and websites like YouTube, which carry South Korean pop music and dramas. The growing popularity of this entertainment is called the \"Korean wave.” \"As a dean of Humanities, to look at a country that’s creating its reputation globally through cultural production, that’s very exciting,\" said David Schaberg, Dean of the Division of Humanities at University of California Los Angeles. \"Or course it attracts students. Of course it means more Americans who may have had nothing at all to do with Korea will now be gravitating to the study of Korean language and culture,\" he said. Korean entertainment is one reason why enrollments in Korean language classes have increased by almost 45 percent in four years. The Modern Language Association’s Rosemary Feal says that it is the biggest increase for any language enrollment at the university level.\n\n“Many students say they really want to get inside the culture and they want a better understanding and so clearly language gives us access to culture and cultural expression,\" said Feal. That’s the case for Korean language student, Persida Radu. “I actually first got into Korean pop and then the dramas they show and then learning it,\" said Radu. Feal says another reason for the enrollment increase is that children of Korean immigrants want to learn the language of their ancestral homeland. “We know there is a correlation between the immigration patterns and the new generations wanting to learn a family language,\" she said. This is true of John Park, who is taking a class for heritage speakers at UCLA. “I don’t speak Korean too well, and of course I want to communicate with my parents, [and] grandparents, and so I took it to learn how to read and write more effectively,\" he said. UCLA Korean professor Sung-Ock Sohn says South Korea's global economic clout is yet another reason why more students want to learn Korean. “Now in this global world, Korean brands such as Hyundai, Samsung, LG, it’s [they’re] very well known, well recognized by everyone. So students I think [if] they know the Korean language and proficiency in Korean really gives huge opportunity in job positions for American students who speak the Korean language,\" said Sohn. UCLA’s David Schaberg says this trend is also affecting American culture. “What we’re seeing is really the practical infinitesimal change of culture as American culture becomes more Asian, or at least opens itself to more Asian influences,\" he said. Language researchers say the trend of growing enrollment in Korean language classes shows no sign of ending soon, especially as the popularity of K-pop continues and second and third generation Koreans seek to re-connect with their heritage.  ",
    "datetime": null,
    "url": "https://www.voanews.com/a/enrollment-in-korean-language-classes-growing/2731075.html"
}