{
    "title": "Utah-based WAVE nabs $1.4M to bring wireless electric buses to a dozen cities (exclusive) | VentureBeat",
    "text": "VentureBeat presents: AI Unleashed - An exclusive executive event for enterprise data leaders. Network and learn with industry peers. Learn More  If batteries weren’t so expensive, most cities would have invested in electric buses by now. Batteries are also notoriously heavy, and slow to recharge. But a new startup called WAVE has developed a wireless transfer system that can be used by by bus manufacturers to operate electric buses with vastly reduced battery sizes. WAVE, which is one of Utah’s hottest startups, is powering the state’s first wireless electric bus. The research was conducted at Utah State University (USU), and is now being commercialized, after a successful on-campus test run. The company exclusively told VentureBeat that it raised a $1.4 million round of venture funding to bring WAVE to more cities across the country. To date, it has raised roughly $7.8 million, a sum that also includes city contracts. The funding for the initial research came from a federal grant, and USU holds an equity stake in the company. WAVE’s technology works by transferring power through the air. Charging pads are embedded in the road, which removes the need for on board power storage. Wireless electric transfer is not new, but only in recent years has the technology developed to the point where it can be used for urban transportation. As WAVE’s chief scientist Hunter Wu explains in the video below, the company uses “high frequency magnetic fields to jump through an air gap and transfer large amounts of electric power.” At the VCIR Fall conference in Park City, I met with the team behind WAVE. The founders are already in the market for further investment. They are currently in talks with a number of city transit authorities, including New York, Seattle, and Monterey. The company’s cofounder and head of sales Wesley Smith expects that wireless electric buses will be implemented in about 10 more cities by the end of 2014. Smith told me that it’s a far cheaper and more environmentally friendly option. Diesel buses are cheap to acquire, but expensive to operate, with diesel prices at $3 per gallon. Meanwhile, electric power is selling at 12 cents a kilowatt hour, which roughly equals $0.65 per gallon. Cities can choose to equip a new bus with WAVE’s technology, or convert a retired city bus. “That’s the most sincere form of reuse and recycle,” said Mike Masquelier, the company’s chief executive, in an interview. “These buses won’t end up in a landfill somewhere.” Kickstart, a Utah-based seed fund, led the most recent investment in WAVE. Clarke Miyasaka, who works for Kickstart, was one of the first people to ride in one of WAVE’s wireless electric buses. He told me that the experience isn’t any different to a typical bus ride, except it’s “far quieter.” Kevin Jessing, who works at Utah Governor’s Office, added the technology has been vetted, and he’s confident it’s “safe for passengers.” For this reason, WAVE’s team is confident that they won’t experience pushback from city regulators. In the future, WAVE plans to partner with companies making electric delivery trucks, and enter that highly lucrative market. The company is also rapidly hiring, and is moving into a larger facility in Salt Lake City. [youtube=http://www.youtube.com/watch?v=-Z3mqi9kcZE&w=420&h=315] VentureBeat's mission is to be a digital town square for technical decision-makers to gain knowledge about transformative enterprise technology and transact. Discover our Briefings. Join us for key insights and networking with leaders in the Data and AI spaces at VB's exclusive after hours event this November! © 2023 VentureBeat. All rights reserved. ",
    "datetime": "2013-10-10T21:37:24+00:00",
    "url": "https://venturebeat.com/enterprise/utah-based-wave-nabs-1-4m-to-bring-wireless-electric-buses-to-a-dozen-cities-exclusive/"
}