{
    "title": "V&A Showcases Korean Pop Culture In ‘Hallyu! The Korean Wave’ Exhibit",
    "text": "The exhibit features costumes from 'Squid Game.' Before the September opening of the Hallyu! The Korean Wave exhibit at London’s Victoria and Albert Museum (V&A), most of the museum’s Korean exhibits focused on either the country’s art history or contemporary art. “Yet it was the country’s popular culture that many around the world enjoyed and knew the most about,” said Rosalie Kim, curator of the Korean collection at the V&A. So, she proposed an exhibit highlighting the global boom in Korean pop culture known as the Hallyu or Korean Wave. The current exhibit features examples of Korean drama, film, music, beauty and fashion, elaborating on the ways these popular exports cross pollinated and helped expand South Korea’s worldwide cultural influence. Hallyu’s first wave rippled across Asia in the late 1990s, led by k-drama and film, then expanded globally from the mid-2000s, led by k-pop and buoyed by a tech-savvy generation of consumers making use of the emerging social media platforms (YouTube, Twitter, Facebook) and smartphone technology. As a result, the Hallyu can be seen as a prime example of how technology changes the production and consumption of culture. K-pop fashion was highlighted at the V&A exhibition. “MZ generations are also more vocal about, and in tune with, cultural diversity and inclusivity,” said Kim. “And their rise in consumer power and socio-political status has contributed to the success of Hallyu as well. During the COVID pandemic, k-drama in particular rose to prominence thanks to OTT platforms like Netflix\nNFLX\n making them readily accessible worldwide. They provided a welcome escapism at an uncertain time when many were confined at home during lockdowns. It is around the same period (2019-2020) that Parasite, BTS, BlackPink broke into the mainstream, making Hallyu’s profile visible to a wider audience.” It’s estimated that there are currently 150 million Hallyu fans worldwide. According to Kim, Europe is one of the last geographical regions to be swept up by the Korean Wave. “However, there were early signs marking the rise of Hallyu in the UK,” she said. “Including the expanding scale of the London Korean Film Festival, established in 2009, the landmark 2011 flash mob by K-pop fans in Trafalgar Square, or the rapid increase in Korean language courses across universities.” The V&A exhibition is divided into five sections. Each develops a thematic rather than chronological approach to the subject: brief introduction, historical preamble delving into the compressed modern Korean history, spotlight on k-drama and film, sounding k-pop music and fandoms, and making k-beauty and fashion. Rosalie Kim, lead curator of 'Hallyu! The Korean Wave,' attends a preview of the  exhibit. (Photo by ... [+] David M. Benett/Dave Benett/Getty Images for the V&A) “Each section features a special highlight,” said Kim. “For example, PSY’s bubblegum pink suit worn in the Gangnam Style music video, the colossal Mirage Stage video sculpture by artist Nam June Paik, costumes from Squid Game, Parasite’s iconic bathroom, dance interactive developed together with Google Arts and Culture, a monumental photographic sculpture of G-Dragon by Gwon Osang, costumes worn by K-pop idols ATEEZ and aespa. A rare early 20th century folding screen portraying Eight Beauties from the Joseon Dynasty complement a colorful array of cosmetic packaging design, and contemporary fashion as the final part of the exhibition. Many of these highlights are shown for the first time in the UK.” The exhibit also includes pieces with a subtle significance, like the first Samsung folding mobile phone produced in 1998. “Unbeknownst to all, the back of its integrated battery was engraved with the secret message ‘the belief we can do it’ by the engineers and technicians working in the factory,” said Kim. “This message captured the angst and hope of a nation hit by the worst financial crisis it had experienced. It was accidentally discovered only 10 years later.” Korea's fast-moving fashion scene was celebrated at the exhibition. The Gwon Osang sculpture of BigBang’s G-Dragon may be of special interest to k-pop fans. “Gwon Osang is a well-established artist famed for his photo-sculptures known as the ‘Deodorant Type’ series, one of the largest examples of which is the G-Dragon sculpture shown in the exhibition,” said Kim. “This work is built by molding onto a styrofoam core thousands of photographs of G-Dragon, one of the most celebrated k-pop idols and leader of BigBang. These images were mainly sourced online and in magazines. Alluding to the duality of fame and pressures that come with idol status, Gwon captured G-Dragon as both Archangel Michael and the Fallen Angel Lucifer in a style borrowed from baroque sculpture tradition. An anecdote shared by Gwon is that he personally photographed G-Dragon’s cat to complete the sculpture.” Artist Gwon O-sang's painted sculpture G-Dragon, A Space of No Name is on display at the Victoria & ... [+] Albert Museum. (Photo by Stringer/Anadolu Agency via Getty Images) The exhibition devotes considerable space to Korea’s versatile fashion scene. “The fashion section is essentially divided into two strands: one focusing on hanbok fashion (Korean costume), and one on contemporary fashion,” said Kim. “Over 20 designers and stylists are featured: Baek Oak Soo, Onjium, C-Zann E, Danha, Lee Young-hee, Jin Teok, Suh Younghee, Kim Hyesoon, Juun. J, Guiroe, Tchai Kim, Moonaoq, Ji Won Choi, Darcygom, J. Kim for hanbok fashion; Blindness, Münn, Kim Seo Ryong, Miss Sohee, KYE, Minju Kim, D-Antidote for contemporary fashion. The first strand unveils how hanbok has been reimagined through Hallyu, and how it was subsequently embraced by young Koreans and Korean diaspora, both consumers and designers, proud of their cultural heritage.” According to Kim, contemporary Korean fashion is fast moving, fresh and occupies a niche position between high-end luxury and streetwear. “In the exhibition, the genderfluid, whimsical, and street-style are shown in dialogue to hanbok garments, from which they at times borrow materials, patterns and sewing techniques.” A V&A staff member looks at a re-creation of the bathroom featured in Bong Joon-ho's film 'Parasite. ... [+] It's part of the museum's Hallyu! The Korean Wave exhibition. (Wiktor Szymanowicz/Future Publishing via Getty Images) For those who can’t get to the exhibition, there’s a book. “The book starts by tracing the history of Korean popular culture from the late Joseon dynasty (1392-1910) to the present day, then follows the exhibition’s main sections,” said Kim. “However, we had the opportunity to incorporate more in-depth studies or stories we weren’t able to expand upon in the exhibition. These are told through the combined voices of academics, fans, curators and industry insiders—including k-pop choreographer Lia Kim and make-up artist Song Jong-hee who designed Choi Min-sik’s iconic hairstyle in Oldboy and Lee Young-ae’s controversial red eye shadow look in Lady Vengeance.” The catalogue can be found on the V&A website and is distributed in the US by Abrams. The exhibit runs through June 2023.  ",
    "datetime": null,
    "url": "https://www.forbes.com/sites/joanmacdonald/2022/11/13/va-showcases-korean-pop-culture-in-hallyu-the-korean-wave-exhibit/"
}