{
    "title": "V&A celebrates 'Korean Wave' of popular culture with new exhibition | Reuters",
    "text": "LONDON, Sept 21 (Reuters) - From the bright pink guard costumes in hit Netflix series \"Squid Game\" to a large sculpture of rapper G-Dragon, London's V&A museum is celebrating South Korean popular culture and its rise to global prominence in a new exhibition opening this week. Among the items on display at \"Hallyu! The Korean Wave\" are K-Pop costumes, K-drama props as well as a replica of the bathroom set in Oscar-winning film \"Parasite\". \"This exhibition is actually celebrating the vibrant and colourful popular culture from South Korea from its inception to its place on the global stage,\" curator Rosalie Kim told Reuters at a preview on Wednesday. \"'Hallyu' actually means Korean wave and it refers to this meteoric rise of popular culture from South Korea that has taken the world by storm in the past few decades.\" The exhibition is split into different sections including K-pop and its fans, television drama and cinema, fashion and beauty. [1/5]A gallery assistant looks at \"K-pop - exporting hallyu to the world\" during the press view of \"Hallyu! The Korean Wave\" exhibition at the V&A in London, Britain, September 21, 2022. REUTERS/Tom Nicholson  Acquire Licensing Rights Greeting visitors is the pink jacket singer Psy wore in the music video for his 2012 mega hit \"Gangnam Style\". Other outfits on display include ensembles worn by G-Dragon and K-pop groups ATEEZ and Aespa as well as colourful designer creations. From the world of television, there are costumes from historical dramas as well as the recognisable pink boiler suits and a green tracksuit from \"Squid Game\". The \"Parasite\" bathroom replica is the first time the set from the protagonist Kim family's basement flat has been recreated, with the museum working closely with the film's production designer Lee Ha-jun. Other items on display include photographs, posters, record covers and K-pop fan banners. Visitors can also take part in an interactive K-pop dance challenge. \"Hallyu! The Korean Wave\" opens on Saturday and runs until June. Reporting by Marie-Louise Gumuchian\nEditing by Alexandra Hudson Our Standards: The Thomson Reuters Trust Principles. Antisemitic and Islamophobic incidents including violent assaults and online harassment have spiked in the U.S. since the Israel-Hamas conflict erupted on Oct. 7, two advocacy groups said Wednesday. Reuters, the news and media division of Thomson Reuters, is the world’s largest multimedia news provider, reaching billions of people worldwide every day. Reuters provides business, financial, national and international news to professionals via desktop terminals, the world's media organizations, industry events and directly to consumers. Build the strongest argument relying on authoritative content, attorney-editor expertise, and industry defining technology. The most comprehensive solution to manage all your complex and ever-expanding tax and compliance needs. The industry leader for online information for tax, accounting and finance professionals. Access unmatched financial data, news and content in a highly-customised workflow experience on desktop, web and mobile. Browse an unrivalled portfolio of real-time and historical market data and insights from worldwide sources and experts. Screen for heightened risk individual and entities globally to help uncover hidden risks in business relationships and human networks. All quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays. © 2023 Reuters. All rights reserved ",
    "datetime": null,
    "url": "https://www.reuters.com/world/asia-pacific/va-celebrates-korean-wave-popular-culture-with-new-exhibition-2022-09-21/"
}