{
    "title": "Video games composer hits out at his union over $50k fine threat - Classic FM",
    "text": "Classic FM Aled Jones\n                \n                \n\n9am - 12pm Violin Concerto in E minor Opus 64 (2)\n\n                        \n\n    \n    Felix Mendelssohn\n    \n\n                    \n\nDownload 'Violin Concerto in E minor Opus 64 (2)' on iTunes Composers Wintory 10 June 2014, 11:03 | Updated: 10 June 2014, 11:42 Composer Austin Wintory could be fined $50,000 by his union, the American Federation of Musicians, for penning a new video game score while the union is in dispute with the video games industry. According to Wintory, the AFM imposed a new contract outlining the terms under which composers would work for the video games industry - without consulting any of the parties involved - in December 2012. However, games developers and published rejected the contract, meaning that, for the past two years, it has been “effectively impossible” for composers to make their living writing music for games without breaching AFM rules. In a video statement (above), Wintory says there is “no end in sight” to the situation. Discover: video game music \"I think it's madness, and I think it's a story that needs to be shared,\" the Journey and Banner Saga composer said in the video statement. \"It seems that because I was outspoken I'm being specifically targeted by the union.\"The AFM contacted Wintory regarding his apparently unsanctioned work on The Banner Saga video game (which was itself crowd-funded by a Kickstarter project), which now puts him in line for a fine of up to $50,000.\"This is about composers and musicians being able to work in a medium that we love without fear of threats and intimidation. It's about the next wave of musicians and composers… who shouldn't have to fear being attacked.\"When asked to comment on Wintory's statement (which currently has had over 30,000 views since it was posted online yesterday), the AFM replied saying \"the AFM does not comment on pending internal disciplinary matters\". See more Wintory News See more Wintory Music ",
    "datetime": null,
    "url": "https://www.classicfm.com/composers/wintory/news/50k-union-fine/"
}