{
    "title": "Vietnam catches the Korean wave | East Asia Forum",
    "text": "Author: Pham Quang Minh, VNU, Hanoi An endless line of water that starts from a shallow stream, grows into a big river, and then flows into the ocean. That’s how Vietnam’s former deputy prime minister, Vu Khoan, described the progress made by Vietnam and South Korea in 2012, as they celebrated the 20th anniversary of the establishment of bilateral relations. The development of Vietnam–South Korea relations over the past two decades has been called ‘the Pacific miracle’. South Korea was Vietnam’s foe during the Cold War, but very quickly became a friend through that most flexible of means: soft power. Vietnam–Korea relations trace back to the thirteenth century when Prince Ly Long Tuong, facing internal threats, built a ship, crossed the sea and arrived in Korea seeking asylum. Vietnam and South Korea have long shared a historical and cultural background in sinocentric Confucianism and have encountered few cultural obstacles. It is not surprising, then, that the ‘Korean wave’ — or Hallyu — in Southeast Asia is said to have started in Ho Chi Minh City, where the first Korean drama series ‘Medical Brothers’ was shown in 1998. After capturing the hearts of Vietnamese audiences, South Korea continued to conquer the broader Vietnamese market. As of December 2014, South Korea has been Vietnam’s biggest investor, with US$37.23 billion of foreign direct investment in 4,110 projects throughout the country. In 2009 Samsung invested US$1.5 billion in Vietnam, building its second largest factory worldwide. Bilateral trade increased nearly 55 times from US$500 million in 1992, at the establishment of diplomatic relations, to about US$30 billion in 2014. South Korea is now Vietnam’s third-largest trading partner after China and the United States. Vietnam is South Korea’s sixth-largest export market. Further growth in Korean investment and bilateral trade is expected in 2015 as the two nations finalise their FTA. Since the end of the 1990s, Southeast Asia has witnessed the enthronement of Hallyu as a cultural phenomenon. Hallyu has heavily influenced youth culture in Vietnam. It is common to see many young Vietnamese enjoying ‘kimbap’ or noisily eating Korean seaweed soup in Vietnamese department stores, mimicking the habits of famous Korean drama stars. Few in the West recognise acts like Girls Generation or Super Junior, but they are idolised by young people in China, Japan, Vietnam, other Southeast Asian countries, and even the Middle East. South Korea’s drama stars, traditional dishes and pop music boost its economic prospects through increased tourism and exports. While Korean pop culture is aiding the South Korea economy, positive perceptions of South Korea in Vietnam are not based on economic relations. In Dong Nai province in southern Vietnam, where Korea is the largest investor, there have been numerous strikes by Vietnamese workers in Korean-owned factories. But despite these tensions Vietnamese continue to be attracted to Korean culture. In an survey of 400 Vietnamese, 90 per cent had seen the Korean drama ‘The Happy House’, 70 per cent had seen ‘Medical Brothers’ and more than 60 per cent had seen ‘Dae Jang Geum’. So, why do Vietnamese like Korean dramas? Many Vietnamese are attracted to Korean dramas because they have a strict hierarchical order, an attractive culinary culture and beautiful Korean stars. In a survey of 1114 students in Ho Chi Minh City, 59 per cent liked Korean dramas, and nearly 50 per cent liked K-pop. Based on the cultural success of K-pop and Korea dramas, particularly among young Vietnamese, Korea has created a popular national brand. Contemporary Vietnam–South Korean ties are further incentivised in the post-Cold War security environment where middle powers like Vietnam and Korea play an important role. The end of the Cold War marked the beginning of greater regional integration, which had previously been inhibited by the old bipolar system. The new strategic environment means that both Vietnam and South Korea must fundamentally change their foreign policy. During the Cold War both countries tended to play major powers against one another to maintain the delicate balance among them. Now they need to facilitate cooperation between powers such as the United States, China and Japan to protect common regional interests. Amid the complex web of diplomatic relationships in East Asia, small and middle powers, like Vietnam and South Korea, can take the lead in fostering regional cooperation, including through regional mechanisms such as the ASEAN Regional Forum and ASEAN Plus Three. The potential for cooperation is promising as it is more difficult for small and middle powers to abuse their position. Both South Korea and Vietnam have nothing to lose through cooperation, but much to gain. They can only strengthen their respective regional positions and influence. For almost the last two decades South Korean soft power, in the form of Hallyu, has spread through Asia, and particularly Vietnam, underpinning South Korea’s success. But some Koreans are worried that the peak of Hallyu is over. South Korea must not rely purely upon Hallyu as the basis of its bilateral relations. Some cultural differences remain. South Korea will also need to address key points of tension such as unrest among Vietnamese workers at Korean enterprises and the abuse of Vietnamese migrant brides in South Korea. These obstacles must be overcome to further strengthen Vietnam–South Korea relations. Pham Quang Minh is Associate Professor at the University of Social Sciences and Humanities, Vietnam National University, Hanoi.  Δ  Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Very interesting article. It’s uplifting to read a rare positive article about East Asian relations. I would like to know, however, why memory politics seemingly plays such a small role in Vietnam-SK relations. One would think that the legacy of the Vietnam war would strain bilateral relations considering SK’s major role in the war. How did Vietnam and SK overcome this tension? There seems to be a lot to learn from Vietnam-SK relations for other East Asian nations who can’t put the past behind them.  July – September 2023\nFor electronic copies of back issues, links to the individual articles and to subscribe to the hard copies, see the EAFQ page. ",
    "datetime": "2015-02-19T11:00:31+00:00",
    "url": "https://www.eastasiaforum.org/2015/02/19/vietnam-catches-the-korean-wave/"
}