{
    "title": "Violent Clark County standoff ends after more than 9 hours",
    "text": "SELLERSBURG, IN (WAVE) – A lengthy standoff in southern Indiana came to an end Monday night with the suspect alive and in custody, but a Clark County deputy was left shot and injured and an Indiana K-9 officer was shot and killed. The situation unfolded at a house on East Delaware Court in Sellersburg. [RELATED STORY: Friends say Sellersburg shooter had mental breakdown] Police said at least 30 to 40 rounds were fired and at least 40 tear gas canisters were shot into the house in an attempt to get the suspect, identified as Josh Priddy, a former Louisville Fire sergeant, to surrender. He did after more than nine hours. On a quiet block in Sellersburg, gunfire is the last thing people expect to hear, but for much the day on Monday, that's what neighbors listened to while police officers and SWAT members from multiple agencies surrounded the home. [PREVIOUS STORY: Standoff in Sellersburg ends, suspect in custody] Meredith Trendal's three children were barricaded inside her house across the street. Through text messages and phone calls for more than nine hours, Trendal waited and kept in touch with them. \"He [one of her children] said that it looks like they are using our house as some kind of command area center,\" said Trendal. \"There are people in the driveway, and it sounds like people were crawling on the roof and all around the house.\" [PREVIOUS STORY: Deputy wounded, police dog killed during Sellersburg standoff] It started after a 911 call from the Priddy's wife at their home on Iowa Street. Police said she was hoping officers could encourage her husband to get a mental evaluation that she believed he needed. When Sellersburg Police Chief Russ Whalen got to the scene, he said Priddy was in a different backyard with his two children and two handguns. Whalen said Priddy made anti-government statements before he let his 16-year-old son and 4-year-old daughter go. They were able to get to neighbor Brittany Hobbs. [SLIDESHOW: SWAT standoff in Sellersburg] \"He [one of Priddy's children] came running to me and just clenched onto me and said, 'Just hold me.' He said, 'My dad held a gun to my head saying he was going to shoot me. He was gonna shoot me,'\" said Hobbs. Police said Priddy then ditched his pants and kicked in the back door of the home on East Delaware Court. The homeowners were not there at the time. For hours, officers tried to make contact with Priddy. At times shots were fired and tear gas canisters were launched. Indiana State Police K-9 officer Kilo, was shot and killed. Clark County detective and SWAT member Chris Proctor was shot in the back of the knee. Police said Priddy continued to fire rounds. \"Most of the rounds at the end were from [Priddy],\" said Whalen. \"I believe we only fired towards the very end there, right before this came to a conclusion. We fired one round and after that round is when he decided to give up.\" In a ripped t-shirt and boxer shorts, police said the suspect finally came out the back door of the home unarmed. Clark County Sheriff Danny Rodden said Detective Proctor is recovering at University of Louisville Hospital. \"They are probably going to do some surgery in the morning just to make sure,\" Rodden said, \"but he is in good spirits and well taken care of, so he is doing just fine.\" Priddy was being questioned by Sellersburg Police, Indiana State Police and the Clark County Sheriff's Office. Together those agencies will decide what charges Priddy will face. Priddy was being held at the Clark County Jail. Copyright 2013 WAVE News. All rights reserved. ",
    "datetime": "2013-06-25T08:01:56Z",
    "url": "https://www.wave3.com/story/22676521/violent-clark-county-standoff-ends-after-more-than-9-hours/"
}