{
    "title": "Voyager 1 Hit by Solar Storm | Time",
    "text": "Planetary scientists have pretty much stopped haggling over whether Voyager 1, the space probe launched in 1977 to explore Jupiter and Saturn, has finally entered interstellar space. The tough little ship is still going strong, but there isn’t exactly a signpost that marks the heliopause—the place where particles streaming from the Sun bang into the thin gas that lies between the stars. As a result, there’s been some confusion about when the spacecraft actually crossed that invisible boundary—though there’s no confusion over the fact that it did. (There’s no confusion either about whether it’s left the Solar System: despite last year’s breathless headlines, it hasn’t. Comets in the Oort Cloud, which are definitely under the Sun’s gravitational influence, are much farther out than the heliopause.) But the fact that Voyager 1 is now firmly in interstellar space is evident just by the change in its surroundings, says Don Gurnett, of the University of Iowa, whose plasma wave instrument aboard the probe is the final arbiter. “It’s extremely quiet out there,” Gurnett says. “The magnetic fields are constant, the flux of cosmic rays is constant”—a sharp contrast to the turmoil of the so-called termination shock, where particles racing outward at a million m.p.h. (1.6 million k/h) slam into the relatively stationary particles that make up the interstellar medium. But the comparative quiet of distant space does not mean there’s nothing going on out there. At this very moment, in fact, as Gurnett explained at a talk at the American Geophysical Union’s annual meeting in San Francisco this week, the sparse interstellar gas is reeling from a powerful blast of solar particles that smashed into it last February. The eruption began its life as a coronal mass ejection or CME, a huge burst of hot plasma fired into space during a solar storm. When they hit the Earth, CMEs can disrupt electronic communications and even cause blackouts. Their impact further away is much greater, causing a kind of cosmic tsunami—huge pressure waves that make the interstellar gas vibrate like a ringing bell. Indeed, a recording the spacecraft made and NASA released reveals that the phenomenon even sounds like a bell. “This shows us how much influence the Sun can have on the surrounding area,” says Caltech physicist Ed Stone, who has been the Voyager project scientist since 1972, “and it’s very likely to be the same with other stars.” Voyager detected its first cosmic tsunami back in the 1990’s when the impact of a CME colliding with the heliopause created a blast of radio waves. They’re too faint to be picked up from Earth, says Stone. “You need to be out by Saturn, at least, to detect them.” By 2012, the spacecraft was close enough to the heliopause to experience a later tsunami directly, recording a steep increase in the density of the gas it was flying through. It felt another in 2013, and the probe is now in the midst of its third, which was still going nine months later—a period during which Voyager 1 traveled a quarter of a billion miles (.4 billion km). No one knows how far into space the tsunami will travel before it fades out, says Gurnett. “I’m guessing it could be another hundred astronomical units or more.” That, by the way, is a whole lot. An astronomical unit is the equivalent of the distance between the Earth and the sun—or 93 million mi. (150 million km). A hundred of those is 9.3 billion miles—or 15 billion km. Voyager 1 is currently at 130 A.U., or about 12 billion miles; it will have to reach 21.3 billion just to catch up with the outer reach of the tsunami—a journey that will take decades. Stone, Gurnett and the other Voyager scientists won’t have to wait that long for another big event, however. The Voyager 2 probe, which lagged behind its sister ship so it could take a look at Uranus and Neptune, is currently at 109 A.U. from the Sun, and approaching its own rendezvous with the heliopause. “We’re hoping it will happen in the next couple of years,” says Stone. If it’s hard to imagine what it’s like for Stone to watch the Voyager probes continue to make discoveries more than four decades after he took over the project, he offers a single, simple word of explanation: “Wonderful.” Contact us at letters@time.com. ",
    "datetime": "2014-12-17T16:05:57.000Z",
    "url": "https://time.com/3636857/voyager-1-tsunami-space/"
}