{
    "title": "Want to be a K-artist? South Korea ramps up for recovery with fresh ideas, new products and eye on tech - WiT",
    "text": "FROM Korea Tourism Organisation (KTO) considering visas for fans wanting to enrol in K-pop training classes to global attraction pass company, Go City launching its first city pass in Seoul since the pandemic, South Korea’s travel industry is ready and eager to pick up the pieces of both its inbound as well as outbound businesses since the full reopening of borders on September 23. The pent-up energy was evident in the packed room of more than 300 delegates at WiT Seoul 2022, the first all-physical WiT event in the city since March 2019, as a cast of close to 30 speakers took to the stage to share their recovery and plans to restart their business in what was Asia Pacific’s second largest outbound market in 2019. WiT Seoul’s co-founder and CEO of Tidesquare, Min Yoon, started the event with a minute’s silence, marking the weekend tragedy at Itaewon, and said the local travel industry stood in solidarity and sympathy with the 156 victims who lost their lives in the crush. Yeoh Siew Hoon, founder, WiT, remarked that the overseas delegates also “stand in solidarity and sorrow with our friends in South Korea. There’s not one of us who hasn’t been touched by what happened because, whether locals or visitors, Itaewon is an icon of South Korea tourism. “It is a sober reminder that even as we in travel celebrate our borders reopening, life’s tragedies still happen – and we certainly have been through the biggest tragedy with Covid, which has cost millions of lives worldwide and which is not over by any means.” She said that “after more than two years of lockdowns and travel restrictions, it is time for us to get back on the road because as the world gets increasingly divided and polarised, we in travel play an even more vital role in bringing people together, and spreading love instead of hate, understanding instead of fear”. She called out the staff at the conference venue, Fairmont Ambassador Seoul, along with all frontline staff in travel, who kept the engines of travel and trade going through the pandemic. With China out of the picture for now, and Japan just reopening, South Korea is taking the lead in recovery in North Asia as local players, who had to turn inwards, now start looking outwards for business and global OTAs re-enter a market which accounted for 28 million outbound trips and 17.5 million visitor arrivals in 2019. Of airports in Asia Pacific, Incheon has been the second airport, after Singapore Changi, to lead in recovery and, according to Amadeus recovery tracking data, looking at routes searched in September 2022 vs September 2021, within APAC, South Korea leads in top routes with five out of 10 routes departing from Seoul. New airline Premia Air launched its Seoul-Incheon service on October 29 with a reported 60% load factor while low cost airline T’way Air has plans to introduce the A330-300 to Sydney, with four weekly flights from Incheon as of December 23, and the same aircraft, with a business class cabin, will be used to fly to Singapore and Bangkok as well. Redistribution of tourism as well as diversification of markets were key themes at the conference – as were the accelerated digitisation of consumer behaviour – it’s all about mobile and apps in this market – and the ongoing technological transformation of traditional giants like Hana Tour to adapt to changing customer behaviour and new customer segments, with the 20s-30s a primary target for local OTAs such as Yanolja, Good Choice, Tripbtoz and MyRealTrip, to name a few. (Full report on key takeaways next week) Most of the speakers reported inbound as well as outbound recovery of around 30% of pre-Covid levels. Accor, which added hotels during the pandemic, now has 27 hotels in South Korea, with 10 in the pipeline, making it the biggest foreign hotel group in the country. Vice president operations, Vincent Lelay, said market mix at its hotels was now around 40% domestic and 60% international, an indication of recovery of both business, leisure as well as MICE business. “Longhaul, US and Europe, were the first to return, followed by regional,” he said. Jon Owen: “The (South Korean) opportunity remains huge as this well-travelled nation recovers from the pandemic.” Jon Owen, CEO of Go City, making his first trip to South Korea, used the occasion to announce the launch of its Seoul city pass, its first launch since the pandemic. The company has passes in more than 30 cities across four continents and claims a 65% market share as the largest global attraction pass company. In APAC, it has passes in Singapore, Bangkok and Sydney. “The (South Korean) opportunity remains huge as this well-travelled nation recovers from the pandemic. We’d previously only sold in English, limiting sales. We’re building out the Go City offer in a truly localised way: expanding our office in Seoul, recruiting strong local talent, as well as full translations and localisation of our sites, app, marketing and customer service. It is the second major market we’re doing this in globally, after Germany,” he said. The Seoul pass, which currently features 28 attractions including Lotte World and Coconut Box (Hybrid Metaverse Play Garden) gives South Korea access to Go City’s Western markets in US and Europe, markets South Korea will need to make up for the absence of China, which accounted for around 30% of arrivals. “The Go City model ensures that attractions offered aren’t just those located in the city centre, but also off the beaten path – this encourages visitors to see more and explore more, providing better variety to our customers and it also unlocks new visitors for these long tail attractions,” said Owen. Park Kyeong Suk, Hallyu Tourism, sharing plans to use K-wave popularity to pull in diverse mix of visitors to diverse mix of locales throughout the country. KTO is using K-wave power to pull in visitors through its Hallyu Tourism division. Indeed, Hallyu (which means Korean wave) Tourism has been around since 2003 and is now in its 4.0 version, said Park Kyeong Suk, division director, and you could argue that K-wave has become even bigger post-pandemic because more of us had more time to watch K-drama on channels such as Netflix, Amazon Prime, Apple+ and Disney, all of which are offering K-drama like there’s no tomorrow. With K-wave gathering fans worldwide, beyond South-east Asia, Hallyu Tourism, which helps curates tours and activities around popular K-drama spots and locations, hopes to draw in a more diverse mix of visitors to a more diverse mix of locales throughout the country. Global sensation, BTS, is of course the top draw and their “Yet to Come in Busan” concert, held as part of a big for Busan to hold the World Expo in 2023, is reported to have attracted 20,000 foreign visitors, accounting for 20% of the crowd. The concert was also streamed for free on the Naver Now, Weverse and Zepeto apps, giving it an even bigger virtual audience. Tours to Maengbang Beach, to pose like the band, at their album jacket filming location are among the most popular offerings, said Park. To cash in on the current K-wave craze, she said it was evaluating the possibility for “working” visas for fans to enrol in K-pop training classes to dance or act like K-stars. Lufthansa’s Elise Becker on NDC adoption and investment in premium travel. South Korea is also one of Lufthansa’s key markets in Asia Pacific, said Elise Becker, vice president, sales, Asia Pacific, and is a standout in terms of NDC adoption. In this market, NDC sales represent more than 50% of the airline’s volume, she said. The airline is also betting big on premium travel, having just announced its biggest investment in history in first and business class from 2023. “It is not a Covid-related effect, it’s part of a longterm strategy but it’s playing into the current trend of travellers trading up, including in South Korea,” said Becker. T’way Air’s vice president of strategy, Sukwan Kim, said the low cost airline’s decision to launch a business class product was also to make a play for premium traffic. “We made a tough decision to introduce a wide-bodied aircraft to our narrow-bodied fleet to create a blue ocean among the red ocean of low cost airlines,” he said. South Korea is one of the world’s most competitive low cost airline markets, with 10 low cost carriers operating. Korean Air, which remained profitable through the pandemic, thanks to strong cargo sales, is in the throes of merging with Asiana Airlines, a decision made in November 2020, in the thick of the pandemic. Approvals from various jurisdictions for the US$1.8 billion merger are ongoing and are expected to be completed in 2024. Song Bo-Young, excited about personalisation and Urban Air Mobility.  The airline is also showing a strong rebound, with its Q2 2022 operating profit nearly four times higher than last year. For the quarter April to June (Q2), Korean Air reported an operating profit of KRW 735.9 billion ($569.2 million), up from KRW 196.9 billion ($152.3 million) in Q2 last year. While no match for cargo, passenger revenue recorded a healthy 307% year-on-year increase. The airline is also introducing a Premium Economy cabin in 2024, said Song Bo-young, managing vice president of passenger sales and network at WiT. While he could not say much about the pending merger, he told the WiT audience that that two things had happened during the pandemic – customer perception of the environment and adoption of technology. He observed there was a trend of South Korean travellers shifting to small groups and family travel and called out the over-60 age segment, which accounts for 26% of the population and 30% of the wealth. “This generation is a key customer base and they want added value and safety.” He predicted an acceleration in personalisation tools, with NDC adoption key to this process, as well as in contactless services, with Delta Arline’s facial recognition as a key feature, and called out Urban Air Mobility as the trend to watch. South Korea has emerged as a battlefield among domestic and foreign companies seeking to gain supremacy in the UAM market, since the government unveiled its roadmap in 2020 to commercialise drone taxis by 2025. Local giants such as SK Telecom, Kakao, Jeju Air and Korean Air, among others, have thrown their hats into the ring, partnering with UAM companies such as Volocopter and Joby Aviation. Featured image: Credit: BTS Yet To Come in Busan tour  ",
    "datetime": "2022-11-03T03:51:23+00:00",
    "url": "https://www.webintravel.com/want-to-be-a-k-artist-south-korea-ramps-up-for-recovery-with-fresh-ideas-new-products-and-eye-on-tech/"
}