{
    "title": "Wave of New Ed Tech In K-12 to Usher In Classroom Redesigns, Survey Finds - Market Brief",
    "text": "As ed tech proliferates in schools, more classrooms are likely to get makeovers to accommodate new ways of teaching and learning with digital tools and platforms. That’s the conclusion of a new survey, which found that 78 percent of K-12 facilities officials and administrators said they expect classroom redesign to be a priority in the next three to five years. In higher education, about 91 percent of leaders expect to make adjustments to classrooms due to technology, according to the facilities survey conducted by SchoolDude, a company that provides software-as-a-service for operations management data and decisionmaking in education.   “We are definitely seeing more districts, colleges and universities doing facility assessments,” said Nicholas Mirisis, the marketing leader at Dude Solutions, the parent company of SchoolDude. These evaluations of facilities look at the age of an educational space, whether it has reached obsolescence, and attempt to estimate the cost of replacing the system or sub-system. They are often the precursor to making the case for providing funding to renovate or build a new facility, he said. The arrival of technology is “forcing a faster rate of renovation than we would have seen in the past,” said Mirisis, noting that the average age of a K-12 space is 46 to 48 years. “Our students are in a facility that was designed, scoped, and built in the ’60s and ’70s,” he said. “The technology demands and power demands are vastly different today.” College and university respondents reported being more likely to pursue classroom redesign to adapt to the changes of technology—a fact that Mirisis attributed to greater competitive pressures in higher education, as students want to be in more attractive and up-to-date facilities. “That segment has always been at the forefront of attracting the next generation of students,” and keeping the students they have, he said. It also has more sources of revenue to cover the costs of making changes, he said. The survey had 514 total respondents, 81 percent of whom were from K-12 schools, mostly of them public. Nineteen percent were from higher education. The respondents come from eight countries and 46 states, with the largest number coming from California, Texas, Washington, Pennsylvania and New Jersey. Respondents’ titles ranged from “maintenance and facility supervisors” to superintendents, representing districts with enrollments from under 1,000 students to nine districts that have more than 60,000 students. See also: You must be logged in to post a comment. K-12 Intel for Business Leaders © 2023 \n\t\t\t\tEditorial Projects in Education, Inc. 6935 Arlington Road, Bethesda MD 20814 - 1-800-346-1834 Username or Email address * Password * Remember me Lost your password? ",
    "datetime": "2017-06-14T06:59:56-04:00",
    "url": "https://marketbrief.edweek.org/marketplace-k-12/wave-new-ed-tech-k-12-usher-classroom-redesigns-survey-finds/"
}