{
    "title": "Wave of mergers seen to sweep school system | Inquirer Business",
    "text": " By providing an email address. I agree to the Terms of Use and acknowledge that I have read the Privacy Policy. MANILA, Philippines—The country’s adoption of the K-12 education program is expected to result in a wave of mergers and acquisitions (M&As) among operators of academic institutions. This development may open up acquisition opportunities for the STI Group, said Eusebio Tanco, STI chair. “As K-12 kicks in, there will be a lot of mergers and acquisitions,” Tanco said in a phone interview. “This should encourage consolidation.” The Philippines has shifted to the K-12 education program, which requires at least one year of kindergarten education, six years of elementary education and six years of secondary education. Secondary education will now include four years of junior high and two years of senior high school education. The K-12 program will cover grade 1 and high school freshmen students in school year 2012-2013. STI is now scouting for such acquisition opportunities. Last week, STI Education Systems Holdings Inc. obtained its board’s approval to proceed with the acquisition of a controlling stake in 65-year-old West Negros University (WNU) in Bacolod City, adding about 5,000 students to STI’s nationwide base. Tanco said STI is still conducting a due diligence audit on WNU, which will be the basis for pricing the deal. WNU is one of the biggest universities in Negros Occidental. The institution is accredited by Philippine Association of Colleges and Universities-Commission on Accreditation (PACUCOA). Its eight colleges offer 28 associate and bachelor’s degree programs. WNU also has a School of Graduate Studies with masteral programs in Education, Public Administration, Nursing and English, as well as doctorate programs in Educational Management and Public Administration. STI also reported that it recently purchased a 40-percent interest in a holding firm that owns a 20 percent equity in Unlad Resources Development Corp., the property arm of Philippine Women’s University. Because of the deal, STI’s stake in Unlad increased to around 40 percent, Tanco said. STI earlier said that 2013 could turn out to be another banner year for the institution. STI is banking on fresh capital with which to roll out its expansion program. Subscribe to our daily newsletter By providing an email address. I agree to the Terms of Use and acknowledge that I have read the Privacy Policy. The core of its investment strategy lies in the acquisition of new properties where it can build new and bigger campuses. Curated business news By providing an email address. I agree to the Terms of Use and acknowledge that I have read the Privacy Policy. We use cookies to ensure you get the best experience on our website. By continuing, you are agreeing to our use of cookies. To find out more, please click this link. ",
    "datetime": "Mon, 09 Sep 2013 05:58:39 PST",
    "url": "https://business.inquirer.net/142067/wave-of-mergers-seen-to-sweep-school-system"
}