{
    "title": "We’re in Love With Dallas’ Newest Wave of Korean Street Food - D Magazine",
    "text": "From\n\nD Magazine\nOctober\n2021 We know and love Korean comfort food, grocery stores, and barbecue. We’ve covered these beloved eats in our Koreatown guide. But there’s a burgeoning scene of treats on sticks and in between toasted bread slices that has us enamored right now. Meet the city’s latest slate of whimsical Korean snacks. From a bright-yellow drive-thru, you’ll be handed dogs with a darker shaggy panko crust than most and an impressive cheese-pull. Get them bacon bit-encrusted or wearing fiery red welts of Flamin’ Hot Cheetos—not powdered but embedded in the battered surface of the dog. Nab funnel cakes and shaved ice, too. 3048 N. Belt Line Rd., Irving. Prolific South Korea-based franchise Frank Seoul was one of the first to herald our Korean corn dog trend in the summer of 2020. Try the Seoul Ang Dog with sweet red bean sauce inside, a cream cheese dog, or a green-tinted dog with jalapeño sausage. 9292 Warren Pkwy., Ste. 130, Frisco; 2540 Old Denton Rd., Ste. 144, Carrollton. At the Asia Times Square mall, Korean chain Two Hands dredges hot dogs in Nashville-style seasoning, their signature spicy sauce, and Flamin’ Hot Cheetos dust. They lean spicy rather than sweet, though there’s also the crispy rice dog enrobed in sugar and the injeolmi dog based on a common Korean snack sporting bean powder and sweetened condensed milk. 2625 W. Pioneer Pkwy., Ste. 213, Grand Prairie. In May 2020, 27-year-old Sarah Park took over Ari Chicken, her family’s Korean fried chicken joint, and transformed it to focus on casual snacks. Korean street-food videos loop as you cradle brioche laden with the fluffiest eggs and house-made sweet and spicy mayos. (Do add avocado.) 2625 Old Denton Rd., Ste. 812, Carrollton. Our two outposts of the national mini-chain zigzag sauces over an array of hot dogs that are mounted on sticks, dipped in rice flour batter and panko, and deep fried. Choose your embellishments: cinnamon and sugar-dusted sweet potato; potato cube-studded and filled with molten mozzarella; or black squid ink-tinted with frilly “tentacle” skirts. Also try the bacon and cheese or teriyaki egg toast. 2625 Old Denton Rd., Ste. 314, Carrollton; 2405 S. Stemmons Fwy., Ste. 133, Lewisville. Mille crepes, dalgona coffee, and boba drinks aren’t the only staples at this cafe that decamped from Los Angeles, where it was a gem in Koreatown. In its quaint new home, find egg toast sandwiches bulging with bulgogi (marinated grilled beef), kimchi and hamburger, and galbi (beef short rib). You’ll also spot an infamous kimchi carbonara and bulgogi-loaded fries. 1060 W. Frankford Rd., Ste. 200, Carrollton. Attractions Bars and Clubs Shops Restaurants 750 North St.Paul St.\nSuite 2100\nDallas, Texas 75201 Tel: 214.939.3636\n \nFax: 214.748.4579 ",
    "datetime": null,
    "url": "https://www.dmagazine.com/publications/d-magazine/2021/october/were-in-love-with-dallas-newest-wave-of-korean-street-food/"
}