{
    "title": "What's behind the mix of K-pop culture boom and anti-Korean sentiment in Japan? - The Mainichi",
    "text": "Please view the main text area of the page by skipping the main menu. The page may not be displayed properly if the JavaScript is deactivated on your browser. Japan's National Daily Since 1922 October 29, 2021 (Mainichi Japan) Japanese version TOKYO -- It was around 20 years ago that major hit television drama series Winter Sonata sparked Japan's Hallyu, or Korean wave. The phenomenal wave kept expanding, and there is a sense now that K-pop and other forms of culture from various fields are firmly rooted in Japanese society. But there has also been anti-Korean sentiment in the air against the backdrop of political conflict between Japan and South Korea. Hate speech targeted at \"Zainichi\" Korean residents of Japan, as well as accusations labeling them as having anti-Japanese views, have also been erupting endlessly online and elsewhere. Why do such inconsistencies arise, and what is behind this contradictory state and love-hate relationship? The Mainichi Shimbun sat down with an expert to ponder this question. First, let's go over the simplified history of the Korean wave. The drama Winter Sonata was first aired on NHK's BS satellite channel in 2003. The following year the program was broadcast on NHK General TV, the main channel of the public broadcaster, and the pure love story between leading actors Bae Yong-joon and Choi Ji-woo proved an explosive hit. When Bae, affectionately called \"Yon-sama\" among Japanese fans, visited the country in 2004, many female fans rushed to see him at the airport, and a wild craze that could be called a social phenomenon was born. During the first Korean boom, middle-aged and elderly women were at the center of the fanbase in Japan, but when K-pop idols like Girls' Generation, also known as SNSD, and TVXQ, known as \"Tohoshinki\" in Japan, made their full-fledged Japanese debut from around 2010, the second wave encompassing younger people arose. This legacy was passed down to the third K wave led by globally popular boy band BTS, which was then followed by the fourth wave -- the product of demand for stay-at-home entertainment amid the coronavirus pandemic. As people have been spending more time at home, Korean dramas such as the mega hit \"Crash Landing on You\" and \"Itaewon Class\" have gathered increased viewership on the video streaming service Netflix. \"Around the time of Winter Sonata, the drama's popularity was backed by middle-aged and elderly female viewers who drew feelings of nostalgia and yearning for a youthful past from it. Now, though, I think many people, especially young individuals, are enjoying Korean popular culture as the latest trend of the time, viewing these entertainers as 'cool' and as objects of admiration. I think you can position their popularity alongside that of top Western stars.\" So said Minori Fukushima, a sociologist familiar with the youth culture of Japan and South Korea, and an associate professor at Tokoha University in central Japan. She takes particular note of the change in young men in Japan. \"In the past, even if they were young, many men distanced themselves from Korean pop culture. But lately, there have been male students at my university who dye their hair green or pink and tell me that 'it's the fashion of K-pop artists.' I feel that Korean culture is also making a quite increasingly favorable impression on boys.\" According to a fiscal 2020 survey by the Cabinet Office, 34.9% of respondents said they feel an affinity for South Korea, when including responses saying they somewhat feel affection. Differences in views among respondents' groups emerged when viewing the results in detail. Firstly, while 27.0% of men said they felt affinity with South Korea, 42.5% of women answered the same, up 15 percentage points from their male counterparts. By age, the percentage of those who feel a sense of closeness with the country was below 30% among people in their 60s and those aged 70 or older, respectively. This proportion increased to between 30% and no more than 40% for individuals in their 40s and 50s, respectively, and somewhere between 40% and no more than 50% among those in their 30s. As for those aged 29 or younger, 54.5% gave the same response. Women, compared to men, and younger generations could be seen as having less aversion to South Korea. These results are on the whole also consistent with Fukushima's view, based on incidents she often hears about from students, most of which are along the lines of being met with disapproval from fathers or grandfathers when telling them they want to study abroad in South Korea. \"I think that older men have a part of themselves that internalizes the consciousness of looking down on South Korea, based on Japan's colonial rule of the country in the past. Meanwhile, following the Asian Financial Crisis (in the late 1990s that caused great damage to the South Korean economy), mainly from the 2000s, South Korea has enhanced its national power through the fostering of its cultural and information technology industries. As a result, this has also contributed to the popularity of Korean culture, as seen now. Amid a sort of inversion of Japan and South Korea, whose international status has risen, I think that elderly men (in Japan) in particular are displeased at, or rather reluctant to acknowledge this fact,\" Fukushima said. In this light, young people in their teens and 20s do not view South Korea as a country that is lagging behind -- something that is also evident in the way they view its TV programs. Fukushima said, \"For example, the show 'Itaewon Class' is very popular among young people. It's not just that the actors are attractive, but the work also features a transgender character. Young people these days are highly sensitive about and show great interest in gender issues and human rights issues. There has also been praise surrounding the depiction of Seoul, which is portrayed in the drama as a city where people of various nationalities and ethnicities, and people with different characters, live together.\" Although there are differences among age groups, that Korean culture has been widely accepted in Japan is an undeniable fact. Quite a few elderly men have also been hooked on watching Korean dramas. The spread of Korean food has been even more prominent. Kimchi, once a symbol used to deride Korean residents in Japan, is now seen on dinner tables in many households in the country. This reporter, who is a third-generation Zainichi Korean resident in Japan, also welcomes this situation. However, this is also precisely why it's disappointing that anti-Korean sentiment persists. Fukushima said, \"As there is a political dispute between Japan and South Korea, I think it can't be helped to a certain extent that there are people who are just unable to rid themselves of hard feelings (toward South Korea). It's necessary to treat that issue separately.\" She then pointed out that there are two sides to antagonism toward South Korea. One is the urge to boost one's self-esteem by insulting another party that one considers \"inferior.\" The other aspect is that there are businesses that profit from this. \"Recently, I often see books that overemphasize the social divide of South Korea and overdoes its portrayal as a country that is difficult to live in. Phrases such as 'This country is hell' and 'Capitalism taken too far' are included on book bands and in titles. I think that these also contain an aspect resembling hate speech. When young people look at these books, they also say things like 'It seems really awful in South Korea. I'm glad I was born in Japan,'\" said Fukushima. It is true that South Korea has been reported to have a widening gulf among social classes, while labor issues among the young remain a major challenge for the government. However, Fukushima points out that it is problematic that the aforementioned books \"do not contribute to a substantial understanding of South Korea.\" Even in the world of Korean pop culture, which has gained overwhelming support from young people, there have been instances of anti-Korean sentiment being born as an undesired byproduct of its strong influence. As a clear example of this, Fukushima cited a controversy that occurred three years ago after it was revealed that a T-shirt worn by a member of the boyband BTS had an A-bomb mushroom cloud printed on it. Following a backlash online, the group's appearances on music shows on Japanese TV were canceled, and disappointment spread even among fans, who perceived that the band held anti-Japanese views. \"In many cases, young people engage with the country of South Korea through their relationships with K-pop and dramas, for better or worse. They think that they have nothing to do with history and past events. That's why when they suddenly run into moments like these through their idols, they get shocked. I think that behind this is the tendency of Japanese society to instill the belief that one should keep their distance from politics, and the fact that they have not been properly educated on the history of Japan's colonial rule of the Korean Peninsula.\" So how do the people of South Korea view Japan? According to a public opinion survey jointly conducted by the Japanese nonprofit organization The Genron NPO and South Korea's East Asia Institute from August to September this year, 20.5% of South Koreans answered that they have a good or relatively good impression of Japan. By age, 18.3% of individuals aged 60 or older said they have a good or relatively good impression of Japan, while 22.1% answered such among those in their 50s, 15.7% in their 40s, 17.9% in their 30s, and 29.5% among people aged between 18 and 29. Though figures were low overall, young people between 10 and 29 had the most favorable views toward Japan, showing a trend similar to that seen in Japanese people's perception of South Korea among different age groups. Furthermore, young Koreans also have a similar tendency of reacting on impulse. Two years ago, an animator for the popular anime series \"Neon Genesis Evangelion\" made negative comments on Twitter about a statue symbolizing wartime \"comfort women.\" Although the series is a Japanese work with many international fans, as soon as the controversial post was shared, voices condemning the tweet and feelings of disappointment spread within the Korean fanbase. Fukushima commented, \"If you see or hear unfavorable words or actions from someone involved in something you're familiar with, sure enough, your feelings do cool off. I think that's something people in Japan and South Korea have in common.\" Does this mean connections mediated by culture have their own limits? Fukushima answered, \"I suppose that in the end it's important to have connections, even if they're weak. ... Because if people build relationships where they can see each other's faces, and make precious friends in the other country, you wouldn't be able to engage in hate speech or other such acts.\" \"While bilateral relations between Japan and South Korea have been strained, there have been cultural interactions between the two countries. However, they're actually two sides of the same coin, and I think that any two countries located near each other in the world are in the same sort of situation. Keeping this in mind, I believe that we should keep up the willingness to connect with neighboring countries by using familiar aspects of culture as a gateway.\" (Japanese original by Yukinao Kin, Digital News Center) More Articles  Copyright THE MAINICHI NEWSPAPERS. All rights reserved. ",
    "datetime": null,
    "url": "https://mainichi.jp/english/articles/20211028/p2a/00m/0na/021000c"
}