{
    "title": "What can the global music industry learn from K-Pop and South Korea?",
    "text": "Applications are now OPEN for the Sandbox Music Marketing Campaigns of the Year 2023! The best, the most original and the most impactful music marketing campaigns from around the world are celebrated. Make sure yours are included. Music Ally Music industry consultancy covering digital music marketing and strategy K-pop is the genre that ate the world whole. Acts like BTS, Blackpink, Twice and TVXQ are not just some of the biggest acts within the genre – they are some of the biggest acts in the world. There is a lot that other artists can learn from how K-pop markets itself, how its acts engage with their fans and why trans-media marketing underscores everything they do. We speak to those within the K-pop world to better understand how it works and what everyone else can learn from the pop trail it has blazed. In 2020, BTS and Blackpink are, arguably, the biggest boy band and biggest girl group on the planet and K-pop is the number one image associated with South Korea, according to the recent Overseas Korean Wave Survey. In business terms, musical exports were worth $578m to South Korea in 2019, while BTS recently broke the record for the highest-earning online concert, banking upwards of $18m in ticket sales for their Bang Bang Con: The Live Show. Musically, the impact of K-pop has been growing rapidly, to the extent that collaborating with K-pop stars has become an essential part of the big pop album rollout. K-pop’s astonishing rise has been one of both artistry and sharp music industry marketing. But what, if anything, can the wider music industry learn from K-pop? Sandbox Best Music Marketing Campaigns 2023: Applications are now open, make sure your campaign is included! Deadline: 3rd November. Click here for more information and to apply. That “if anything” is important. Danny Lee, the chief agent at Asian Agent (a company that focuses on “bridging culture between the East and West via music and content”), says that K-pop artist campaigns “cannot just simply be ‘copied’”. “The fan community and business culture between the East and the West are quite different, so the planning and execution in comparison will provide separate results,” he says. One of the main differences between the music businesses in South Korea and the West comes down to the attitude of the artists themselves. Tamar Herman, a K-pop columnist for Billboard, says that South Korean artists don’t face as big a stigma around the idea of music as a career as many Western acts. “In the West in general, we tend to vilify the commodification of the music industry; and in South Korea that’s not really a concern,” she says. “There’s no concern that a K-pop group is too produced, that it’s too commercialised. This is their job, this is their career and there is artistry attached to it. Because of that, it makes things easier: they can do a lot of advertisements, they can do a lot of merchandising and a lot of concerts where merchandising is important.” There are also important structural differences between the music businesses in South Korea and the West, as Bernie Cho, owner/founder of Seoul-based artist and label services agency DFSB Kollective, explains. “The fully integrated, full-stack business model in South Korea – where artist management companies also wear record label and talent agency hats – works extremely well in Latin America and parts of Western Europe,” Cho says. “In the US, you rarely see this type of streamlined, synergised setup.” This one-stop-shop approach – with many management companies also owning stakes in local DSPs, as SM Entertainment does with Flo – enables South Korean music companies to “move, drive, and pivot quicker than separate companies would be able to”, Cho adds, which helps to explain why the traditional major labels are not as dominant in many of the major Asian music markets as they are elsewhere. Trans-media marketing and creating a narrative universe Being involved in so many aspects of an artist’s career also means that South Korean music companies can take a wider view of an artist’s development when it comes to marketing, rather than focusing solidly on the next record release. Lee Song Im, director of international business operations at Event Market, says that increasing numbers of K-pop companies are using trans-media marketing methods for their acts. “Trans-media marketing involves multiplatform storytelling, where instead of releasing albums with one-off concepts and themes, the marketing team develops one overarching theme and storyline around the artist and then delivers different pieces of narrative that build on top of one another, through various medium like an album, music video and game,” she says. Shin Cho, senior international marketing manager and head of K-pop and J-pop at Warner Music, also emphasises the importance of storytelling. “K-pop marketing focuses on building a community of superfans and turning them into advocates and influencers for the artist,” he says. “When K-pop acts such as AB6IX and CIX are put together, great care is taken to ensure that all the members have a clear storyline and they each complement the others. It’s like putting together a jigsaw.” Building stories around artists is nothing new for the Western music industry. But Lee compares the practice in South Korea to the way that comic book publisher Marvel has built up its Marvel Universe, going way beyond individual characters. “With trans-media marketing, besides simply listening to their favourite artists’ music, K-pop fans now have a storyline and characters to follow and the artists become a part of their lifestyle,” she says. The result, according to Lee, is “more stimulated and engaged fans”. “With increasingly sophisticated fans who are constantly on a lookout for new content around their stars, I believe artists who can extend their stories and messages beyond the sounds will be able to build a powerful rapport with their fans that lasts,” she says. The power of fandom marketing In many ways, this “powerful rapport” already exists between K-pop fans and their musical idols. South Korean fans are well known for their willingness to spend money on music, something the K-pop industry capitalises on by selling albums in multiple editions to appeal to the collector and completist instinct in fans. But fans also help promote their favourite K-pop acts, according to Jeon Duck Jung, vice chairman of the Korea Entertainment Producer’s Association. “K-pop’s other unique marketing strategy is fandom marketing,” he explains. “In addition to basic marketing, K-pop artists constantly interact and communicate with their fans through various channels and fan activities to retain and expand their fandom.” Rather than promoting the “rock star fantasy”, K-pop artists focus on actively communicating with their fans all over the world using social media, while simultaneously showcasing their more relatable sides by appearing on TV and via live video streaming. Their fans respond in kind. “Fans these days recreate their favourite K-pop stars’ content to their liking [e.g. as memes] and share them with other fans, which results in multiple consumption of the same content,” Jeon says, citing cover videos and fan-made music videos as examples. Breaking through the language barrier Another hugely important way in which K-pop fans help out their idols is by translating and transcribing videos and other content, thereby helping artists to expand into foreign markets. “When I got into K-pop as a fan in 2008, at that time it was all fan translation,” says Herman. “There was very little English language content coming from these South Korean companies. Now if you go to some music videos, they will have the lyrics translated into five or ten different languages the minute the song is up. They’re really trying to reach a foreign audience.” Leaving such an important task to fans might seem rather risky behaviour for a South Korean music industry known for its micromanagement, but Herman explains that many music companies often oversee translation themselves. At the same time, fan translation has worked extremely well for BTS, who Herman says have “an army of translators” on social media. “They have huge Twitter followers and they are known for translating the lyrics and also for translating the conversations that BTS have on social media,” she says. “BTS’s fandom has really perfected it. I have heard that they have group chats among the translators to determine what is going to be on at any given time to make sure nobody misses anything. They discuss the phrasing […] They have huge audiences: some of these tweets will get seen by hundreds of thousands of eyes, if not millions of eyes.” BTS tapped explicitly into this earlier in the year with the Learn Korean With BTS linguistic platform for fans outside of South Korea to get to grips with their mother tongue. It runs on Weverse (the app created by Big Hit Entertainment that specialises in hosting multimedia content and artist-to-fan communications) and fans can access three-minute language tutorials from the group. There are 30 in total and the band members are there to guide first-time speakers through it all. The lessons draw on existing footage from Run BTS! (the band’s reality show) as well as YouTube-only shows such as Bangtan Bombs and BTS Episodes. It has a proper academic foundation as Professor Heo Yong from the Department of Korean Education at the Hankuk University of Foreign Studies and researchers from the Korea Language Contents Institute were involved in its creation. The SNS gold standard BTS have also mastered another vitally important part of the music marketing jigsaw, with the band known for their extensive use of social media. “Top K-pop music companies have been smart and savvy in mapping out successful social media strategies,” says Bernie Cho. “En route to collecting an impressive trove of certified gold records, BTS has pretty much become the new SNS [Social Networking Service] gold standard when it comes to intimate interactivity with international fans. The virtual connection between the fans and the band feels very close and very real.” Of course, social media is important for almost any musical act in the 20th century; but South Korean bands have, on the whole, managed to parlay this into a very structured and effective platform for fan communication. Herman says that there are various ways in which K-pop acts use social media, including a small number who barely touch it. “Some artists spend time chatting with fans,” she says. “There is this thing called a ‘menpa’, which stands for ‘mention party’. That is when an artist will say ‘I am here to chat’ and will respond to different fans. Fans will ask questions, compliment them or send them memes – and they engage with them. Some artists generally are engaging and some artists do timed engagement each day – so you have a look into the window of their career.” This openness extends not just to classic social media like Twitter and Instagram: BTS are active on Weverse; while SM Entertainment acts such as Exo use the company’s community-based app Lysn. Herman says that K-pop fans do, for the large part, understand that they are not actual friends of their favourite artists, but she believes there is “a thinning of the barrier between the artist and the fan because these artists are engaging”. “It is unclear to everyone involved how much of it is PR, how much of it is the artists themselves, how much of it is pre-timed and how much of it is preplanned,” she adds. “It feels a lot of the time like something really natural and really earnest.” Making free pay and the K-pop rabbit hole Another crucial part of the K-pop marketing strategy is the release of vast amounts of content, largely – but not exclusively – for free. This, alongside social media, can help fans to feel like they have a real insight into their idols, helping to sustain K-pop’s own Marvel Universe. Video is key to this – both the formal promotional clips that labels commission and the more spontaneous, off-the-cuff content that fills bands’ social media. “In South Korea, music videos are not only essential but also epic marketing tools,” says Bernie Cho. “K-pop in many ways is music your eyes can hear and your ears can see, thanks to the power of music videos. Not much gets lost in translation because whatever you might not understand lyrically gets interpreted visually.” Herman explains that BTS, for example, are always “doing live streams, making videos that show behind the scenes” and even producing their own video clips. “If there’s a song that fans particularly like, maybe the band members will film their own video and one of them will edit it,” she says. “They will share dance practice videos where you can see them [being] not as polished as usual. And that is on top of social media and formal content.” To add to this mélange, K-pop fans also produce a vast amount of content, a practice largely encouraged by the South Korean music industry. “People call it the K-pop rabbit hole,” says Herman. “There is so much coming out, so many different acts out there and so much fan-produced content that, even if you are just absorbing the formal content, it still is too much to watch for pretty much any given artist.” Lights, camera, reaction One of the keystones of K-pop fan content – and one that has yet to really translate to Western acts – is the reaction video, whereby K-pop fans film themselves reacting to bands’ new videos and upload the results to YouTube. “There is a whole YouTuber industry based around this,” Herman says. This may seem, on the face of it, like a rather reductive way in which to interact with an artist’s music, but the results are frequently rather profound. “People want to know what other people are thinking and so reactions give them insight,” says Herman. “Maybe somebody catches something that they’re not catching. Maybe somebody had a thought that they didn’t think of. Some people have turned it into almost being an East-meets-West explainer: ‘Well, that means this, this is a pun, this is a socio-political in-joke that maybe you are not picking up from a translation…’” On the whole, the K-pop industry is fairly relaxed about fan content. Takedowns do still happen, from time to time, but on the whole, the South Korean music business takes a practical attitude towards UGC. “South Korean music companies usually encourage rather than discourage user-generated content on social media,” says Bernie Cho. “It’s an integral part of the K-pop marketing machine because they are able to not only monitor fans’ appreciation but also to monetise fans’ interpretation of their favourite K-pop choruses and dance moves.” Clearly, then, there remain important differences between the music industry in South Korea and the music industry in the West, even if some of the classic K-pop marketing tricks have already started to be adopted globally, notably the practice of collaborating with a local artist to extend your reach. “In the past, such tie-ups were done to help the K-pop artists promote themselves in the overseas market they were trying to enter,” says Jeon. “Today, many international acts approach K-pop artists for collaboration as they increasingly view this as an effective way of global marketing.” And yet Jeon believes that it is premature to say that the global music industry is copying K-pop marketing. “K-pop marketing may have an influence on overseas artists, but likewise global music also has a huge influence on the way K-pop is marketed internationally,” he says. “It is exciting to watch each side accept and embrace each other’s music and marketing strategies. Who knows if this will create an entirely new genre or culture.” The best idea for the Western music industry, then, may be not so much to copy K-pop marketing as to take inspiration from it as a base. “As much as it is impossible to copy K-pop marketing 100%, copying will only result in the artist’s loss of his or her own musical character,” Jeon and Lee say in a joint statement. “Instead, global music marketers should explore strategies that can best bring out and promote the artist’s authenticity and musical world. Just as how K-pop is now recognised as a music genre on its own, it is important to keep the international music industry diversified, to ensure a continued development of the global music scene. Cover Image _JStone / Shutterstock.com Get a mix of the vital news, analysis, and insider tips from across Music Ally's services. (Plus all the weird links & unusual music we find online.) It's FREE, fun*, and every Friday. *actual levels of fun may vary wildly We’ve recently reported that the startup Afterparty raised $5m of funding for its superfan platform.… Read all Tools >> Your email address will not be published. Required fields are marked * Comment * Name * Email * Website   Δ Get a mix of the vital news, analysis, and insider tips from across Music Ally's services. (Plus all the weird links & unusual music we find online.) It's FREE, fun*, and every Friday. *actual levels of fun may vary wildly Meta published its third-quarter financial results yesterday, including the latest figures for… A group of musicians, actors and other artists have come… Global collecting societies body Cisac has published its latest annual… Music Ally’s music business news podcast covers the vital issues in detail, as they emerge. Listen now »  Jobs The latest and best jobs in the global music industry See all jobs >> Sandbox: your essential digital marketing guide – expert insight, case studies, fresh ideas, and overlooked opportunities. When a pop-up store, running for a few days around… Blas Cantó started in music when he was just eight… Country Profiles Essential international guides, packed with data, interviews, strategies, and local insight. Read country profiles >> Côte d’Ivoire is a hub for the music business in French-speaking Africa, with its… Germany’s recorded music industry continues to grow, with revenue set to return to historic… Sweden remains one of the most advanced streaming markets worldwide, although physical music just… Music Ally Ltd., Holborn Studios,49-50 Eagle Wharf Rd, London, N1 7ED,United Kingdom +44 (0) 207 682 3996mail@musically.com Music Ally is a Registered Learning Provider 10029483 ",
    "datetime": "2020-07-13T14:28:34+00:00",
    "url": "https://musically.com/2020/07/13/what-can-the-global-music-industry-learn-from-k-pop-and-south-korea/"
}