{
    "title": "\r\n\tWhat is a Wavenumber?\r\n",
    "text": "We use cookies to enhance your experience. By continuing to browse this site you agree to our use of cookies.\r\n                        More info. Wavenumber is defined as the number of complete wave cycles per unit length of a linear space. It can also be referred to as the spatial frequency of the waves represented in radians per unit distance, or cycles per unit distance. It is usually measured in units of reciprocal centimeters (cm-1) and reciprocal meters (m-1). Wavenumber is usually denoted for an electromagnetic field in a vacuum or free space. Under most of the conditions, air is equivalent to vacuum. The wave number of a given electromagnetic field tends to increase in any media other than free space. When a light beam is transmitted from an air medium to a glass or water medium, or when a radio signal is propagated via a polyethylene dielectric medium, the wavelength is shortened as the propagation speed decreases. As a result, the wavenumber tends to increase. In vacuum or free space, the wavenumber represented by the letter “k” is defined as the function of frequency f based on the formula: k = f/c where c is the speed of propagation of light waves in free space, which is equal to 2.99792 x 108 m/s. In a medium other than free space, c is multiplied by velocity of the light wave, v. The velocity of the wave in a particular medium is defined as the ratio of speed of the light wave passing via the medium to the speed of light wave passing through the free space. In most cases, the velocity factor is greater than 0 or less than or equal to 1. The wavenumber in such a medium is given by the formula: k = f/(vc) References  Do you have a review, update or anything you would like to add to this article? Cancel reply to comment The Velocity™ EBSD camera provides best indexing performance on real-world materials. Discover the NAN™ Electrophysiology focusing nosepiece microscope by Sutter instruments. The Total Absolute Measurement System (TAMS) unit allows you to choose the right detector for angular-dependent measurements of optical properties of thin and thick samples. Dr. Mustafa Kansiz In this interview conducted at Pittcon 2023 in Philadelphia, Pennsylvania, we spoke to Mustafa Kansiz, Director of Product Management and Marketing at Photothermal Spectroscopy Corp, about O-PTIR, a new and alternative infrared spectroscopy method. Professors Susmu Noda and Menaka De Zoysa In a new interview, AZoOptics talks with Professors Susmu Noda and Menaka De Zoysa about their research presenting a new nonmechanical 3D Lidar system. Dr. Quentin Meyer and Dr. Ying Da Wang In a new feature, AZoOptics talks with Dr. Quentin Meyer and Dr. Ying Da Wang about their novel technology that allows for superior imaging of hydrogen fuel cells. AZoOptics.com - An AZoNetwork Site Owned and operated by AZoNetwork, © 2000-2023 ",
    "datetime": "2014-02-07T04:50:00.0000000-05:00",
    "url": "https://www.azooptics.com/Article.aspx?ArticleID=757"
}