{
    "title": "What to wear this Halloween: Last-minute costume inspiration",
    "text": "Awesome, you're subscribed! Thanks for subscribing! Look out for your first newsletter in your inbox soon! The best of Hong Kong for free. Sign up for our email to enjoy Hong Kong without spending a thing (as well as some options when you’re feeling flush). Déjà vu! We already have this email. Try another? By entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions. Get us in your inbox Déjà vu! We already have this email. Try another? By entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions. 🙌 Awesome, you're subscribed! Thanks for subscribing! Look out for your first newsletter in your inbox soon! Halloween is just around the corner and if you're in need of some costume inspiration we have a few ideas up our sleeve. You'll be ready to trick-or-treat in no time... If you haven't heard this viral hit then you're definitely out of the loop. Dress up as the ridiculous Japanese singer in his retro, animal print garb and draw on a skinny little mustache with some black eyeliner and you're good to go. If you need a costume for three, your friends can dress up as a pineapple or an apple. Make sure to bring pens. Dress up as everyone's favourite egg, Gudetama - Sanrio's lazy tamago who comes is all sorts of forms from an egg in shell to custard and even a sushi roll. Or just laze around with a bacon blanket. We won't judge. Probably the most predictable costume of the year, we're betting you'll see a whole squad of Harley Quinns and Jokers walking down the streets this Halloween. Gotta catch 'em all - or at least try to wear them all. If you're still riding the Pokémon craze then this costume is the best option for you. What's even better is that you can choose any Pokémon you want to be. Didn't catch that Snorlax? Just dress up as one instead. Instead of dressing up as a typical black cat, switch it up and be inspired by Hong Kong's very own Brother Cream this Halloween. A cute costume for any kid or adult, suit up as one of Hong Kong's very own icons, McDull.  Continue to ride the K-wave and dress up with a group of friends as your favourite Korean idols. Everybody appreciates a good sexy namja. Share the story An email you’ll actually love By entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions. 🙌 Awesome, you're subscribed! Thanks for subscribing! Look out for your first newsletter in your inbox soon! Popular on Time Out  Discover Time Out original video  An email you'll actually love By entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions. 🙌 Awesome, you're subscribed! Thanks for subscribing! Look out for your first newsletter in your inbox soon! Follow us About us Contact us Time Out products Time Out magazine ",
    "datetime": null,
    "url": "https://www.timeout.com/hong-kong/blog/what-to-wear-this-halloween-last-minute-costume-inspiration-102816"
}