{
    "title": "What Does the BTS' 'Hiatus' Mean For the Korean Wave? ",
    "text": "For impactful stories you just can’t miss By subscribing you agree to our Privacy Policy BTS, the South Korean boy band, broke millions of hearts with their decision to take a hiatus. The entertainment company behind them, however, stated that the video announcing their decision was mistranslated. HYBE released a statement reiterating, “BTS are not taking a hiatus. Members will be focusing more on solo projects at this time.” BTS’ Jung Kook also took to Instagram to announce the same – ensuring fans that the band was not disbanding – simply taking a new direction forward. The insistence came after the announcement knocked HYPE’s share by 28 percent. And irrespective of the error in translation, it did marginally anticipate what would happen if the band were to disband in the near future – considering the pioneering impact of the idol group on popular culture. But the Korean Wave or the Hallyu is propelled by more than just a boy band, right? The disbanding of a band wouldn’t arguably dismantle the increasing force of Korean soft power diplomacy, but it will deeply affect it. The South Korean government have always had a vested interest in advancing Hallyu to ensure global influence. But the Korean Wave is perhaps more than the policies political stakeholders initiate. Still from the music video of 'Gangnam Style' (Photo Courtesy: YouTube) For one, rapid digitalisation helped matters immensely. Everyone had a smartphone, but the Korean Wave existed before that as well – the only difference was it was smaller in scale. The gamechanger was Psy’s music video ‘Gangnam Style’ that reached a whopping 1 billion views – an achievement that was only possible through YouTube. Social media created a launching pad for artistes to showcase their work. And it is primarily through these platforms that the Korean entertainment industry became known across the globe. And consequently, the internet steadily created a culture of social media fandoms – a culture that would enable scores of Korean artistes to achieve global success – and among them would be the 2013 debuted idol group – BTS. Members of the K-Pop band BTS. (Photo Courtesy: Twitter) From Instagram, Twitter, and Facebook to Tumblr, the BTS fandom is everywhere supporting the band all the way through – one word against them and the fandom is out to get you. And now, not only are they collaborating with international musicians but also giving them stiff competition. Their hit single ‘Dynamite’ became the first K-pop song in history to debut at No. 1 on the US Billboard “Hot 100” chart. They slowly and steadily achieved the feat, which was an essential accomplishment for the band – who would, before digitalisation, remain on the peripheries of mainstream culture but now spearheaded what mainstream looked like. The global success of BTS was enabled by the fact that South Korea exports all possible \"cultural forms” – skincare, K-dramas, music, movies, webtoons, food, fashion etc. No other non-western country, as Dal Yong Jin, author of ‘New Korean Wave: Transnational Cultural Power in the Age of Social Media’, rightly points out, does that. Interestingly, the conflation of the Korean culture with its western counterpart helped BTS become the sensation it is today and will perhaps continue to be. BLACKPINK is another successful Korean idol group. (Photo Courtesy: Twitter) But despite the reasons behind the success of the band – the government policies, fandom and digitalisation – BTS remain at the heart of the Korean wave. The group is, after all, cementing a cultural moment, a significant one at that, because they challenged stereotypes, diversified music and created a platform – through their socially conscious music. So it seems more than fair that they may need to change their plans moving forward – take some time off – hiatus or not. (At The Quint, we are answerable only to our audience. Play an active role in shaping our journalism by becoming a member. Because the truth is worth it.) Loading Comments... Subscribe To Our Daily Newsletter And Get News Delivered Straight To Your Inbox. ",
    "datetime": "2022-06-17T15:49:44+05:30",
    "url": "https://www.thequint.com/entertainment/music/what-does-the-bts-hiatus-mean-for-the-korean-wave-jin-suga-j-hope-rm-jimin-v-and-jungkook"
}