{
    "title": "\r\n\tWhat Parasite's Oscar win means for Korean culture | PR | Campaign Asia\r\n",
    "text": "SOUNDING BOARD: We ask the industry how the success of 'Parasite' will affect brand appetite for Korean content. Korean director Bong Joon-ho’s tragicomedy about a lower-income family entering a wealthy household has made history as the first non-English film to win 'Best Picture' at the Oscars. Following a decade in which Korean culture has already been riding a popular wave through TV dramas and K-pop across Asia, we ask industry observers if this Oscar win is a turning point for Korean content globally and what brands ought to take careful note of. Taezin Im, creative director, Cheil Worldwide (Seoul) The success of film 'Parasite' will bring much greater attention on Korean creativity, not just Korean content. People would be willing to find out more about the culture of Korea where movies by Parasite's director, the dramas that stars Parasite's casts, and such unique content is made. So I expect that people’s interest in Korean culture triggered by the film will go on much longer than that prompted by any other K-content.\n\nParasite dug down deep into the social structure between the rich and the poor which is present in every country. That is why the film resonated with universal audience, and won a streak of statuettes at the Oscars. Rather than symbolising a shift in global cultural power, Parasite’s success will serve as a momentum to broaden people’s minds to discern content created in non-mainstream cultural areas, and brands will further consider collaborating with creatives from these areas like Bong Joon-ho. Evonne Chung, MD & Emily Sheen, senior strategist, Landor (Singapore) Above all, for fans of Korean films and dramas in Asia, it’s about time. The world is finally ready to embrace Korean film, but Korea’s film industry has long been ready to enter the world stage. Indeed, excellent examples of Korean film go back many years, whilst both the Busan Film Festival and Busan Film Academy are held in extremely high esteem. Now, the global surge in popularity around Korean music and beauty trends has paved the way for film, and it feels a natural next step.\n\nBut why Parasite? Firstly, the film’s success is rooted in the director’s ability to tell a real, relatable story based on universally identifiable struggles (poverty, class divide) in a way that doesn’t rely on an understanding of Korean language or culture on the part of the viewer. Secondly, Bong Joon Ho’s film paves the way for Korean film to be held in higher esteem perhaps because of his ability to mesh cinematic references from East and West. He emphasises how he takes inspiration from the great Martin Scorsese but also Taiwan’s legendary director Hou Hsiao-hsien, allowing him to bridge a culture gap and bring Korean film to Hollywood.\n\nThis is certainly the start of a new K-wave for the West, but for Asia, it is the celebration of a long-appreciated film legacy. Hyunwoo Park, founder and CEO, Innored (Seoul) It is amazing, inspirational and motivational news for people in the creative industry. Diversity will drive creativity harder. Global brands in Europe and the US will want to know more about East Asian culture to find winning creative seeds and will want to collaborate with creators from this part of the world. The short but impactful winning speech of Bong Joon-ho tells us many things: \"Once you overcome the one-inch tall barrier of subtitles, you will be introduced to so many more amazing films.\" Miranda Lee, general manager, The Hoffman Agency Korea (Seoul) Korea has, in many ways, demonstrated its power to cross cultural borders and create ‘movements’ recognised the world around. Now Parasite joins the revolution, bringing down the ‘barrier of the subtitle’, particularly when it comes to K-movies and K-dramas.\n\nIn particular, Parasite has shown that local can be global – and that despite societal differences, people worldwide are not only able to understand, but empathize and resonate with this phenomenal, award-winning movie, without the need to alter its context or language to be ‘foreigner-friendly’.\n\nCombined with the rise of foreign-language content on channels such as YouTube and Netflix, this moment is likely inspiring discussions worldwide for brands to explore Korean content as a conduit for reaching mass, international audiences. Marc Barnett, CEO, iflix (Kuala Lumpur) Parasite's well-earned recognition further puts Korean content on the map and certainly opens doors for other Korean filmmakers to follow suit. The Oscar wins are not surprising – the Koreans, both in film and TV, have been undisputed leaders in Asian storytelling and production values for some time now.\n\nWhilst they are prolific with making mass entertainment and quality K-dramas (many of which have a home on iflix), they have also been pushing the boundaries with cinema via films like Train to Busan, Bong Joon-ho’s Okja and of course, Parasite. It’s this trend in hyper-local and authentic quality filmmaking that in my view is even more encouraging than the likes of Crazy Rich Asians. Korean has done well to provide an international canvas not just for mainstream TV but also for more sophisticated fare. Luke Nathans, CEO, APAC, Iris (Singapore) The success of Parasite is testament to the artistic quality of the film. The recognition of increasingly artistic endeavours, such as Parasite, will encourage brands to work with more Korean talent. In a move to more real, cultural and creative solutions, rather than just badging and borrowing equity from ‘what’s hot’.\n\nIt’s a fantastic opportunity for brands. In recent times we’ve seen increased brand interest in K-Pop, Korean DJ’s, men’s fashion and the beauty industry. With a marked shift from wider Asia to a more global appeal, I think this is only set to continue. Aaron Lau, former International president & CEO, North America, Cheil Worldwide (Hong Kong) Parasite’s win will do miracles for Korea and Korean companies, and will help them understand that they could be on top on the world stage if they are creative. Koreans are usually criticised for their lack of innovation and creativity, but Parasite’s win will drive investment in this field. Brands need to leverage this heightened interest in Korea’s creative upsurge, but need to be careful to not be viewed as opportunistic one-time wonders.\n\nWhile Parasite’s accolades would have enhanced Korea’s reputation as an international creative hotbed, the country needs to build more robust capabilities that prove these skills are unique, durable and marketable. Thus far, the Korean creative that was a runaway hit was Gangnam Style, but that seems to have resulted in just more of the same from the K-Pop industry.\n\nLeveraging the success of Parasite, Korea needs to show it can be a country that can generate many more creative winners, which catch global eyeballs and awards. Brands will follow, if Korean creators can build a strong body of work that can be sold to the world. Top news, insights and analysis every weekday Sign up for Campaign Bulletins Who doesn't love enjoying a nice sweet treat. But would you use one to brush your teeth with before bed? From next year, Mickey Mouse the legendary rodent, will no longer be owned by Disney. With the chains of IP law beginning to unshackle, what does this mean for the future of the brand's beloved character? This tarot-reading Havas creative pines to visit the ancient pyramids of Egypt, get off Instagram so she can embrace a digital detox, and is busy trusting the process. A Mindshare China loyalist of over 24-years, Low is instrumental for commercial gains as well as client and staff retention. Terms & Conditions / Contact Us © Haymarket Media Ltd. ",
    "datetime": null,
    "url": "https://www.campaignasia.com/article/what-parasites-oscar-win-means-for-korean-culture/458136"
}