{
    "title": "When Korean Pop Culture Came To The Holy Land - Worldcrunch",
    "text": "Sign up to our expressly international daily newsletter. To give you the best possible experience, this site uses cookies. If you continue browsing, you accept our use of cookies. You can review our privacy policy to find out more about the cookies we use. Already a subscriber?\n          Log in\n          . You've reached your limit of one free article. You can\n          cancel anytime\n          . SUBSCRIBERS BENEFITS Exclusive International news coverage Ad-free experience\n              NEW Weekly digital Magazine\n              NEW 9 daily & weekly Newsletters Access to Worldcrunch archives 30-days free access, then\n            $2.90\n            per month. $19.90\n            per year,\n            save $14.90 compared to monthly billing.save $14.90. ASHDOD - My daily walk along the beachside promenade in this city south of Tel Aviv where I now live is a chance to get up-to-date with what's going on in the music industry. Thanks to the ringtones of people walking by with their phones, or others sprawled along the Ashdod boardwalk, and also thanks to the dance events on the beach on Friday nights, I get to hear musical extracts from an unexpected language: Korean. “Ashdod is probably the city with the most K-popsters in Israel,” says Osheret Azani, 25, a student from the town of Ariel. K-popsters are fans -- nay, addicts of the Korean Popular music, K-pop. In Israel it is a still a relatively small base, but one that's growing very fast. Thousands of Israelis, especially girls, spend their time studying every move and sound of their favorite Korean bands. The K-popsters buy CDs and posters on eBay, exchange bracelets, clothing accessories and especially traffic in the latest gossip about their favorite bands. “Our Facebook group, iKpop, already boasts 3,000 members, but there are many other groups”, says Victoria Dinkin, a high-school student from Kiryat-Gat, who broadcasts the only show in Israel entirely dedicated to K-pop, on the educational local radio station Kol Gat.   But beyond the music, Korean culture as a whole is seeping into Israeli life, little-by-little: television shows (K-dramas), food, fashion... and eventually also the language. In 2008, the Hebrew University opened a new course of Korean Studies, alongside the longstanding departments of China and Japan studies. It's all part of a global cultural trend that has its own name: Hallyu. The phenomenon is so unique that this past May, a special conference was held concerning the subject at the Hebrew University, with researchers in the field invited from the world over. Gil-Sung Park, a sociologist from the Korea University in Seoul,tells me during one of the breaks between discussions, that the term Hallyu, comes in fact from China. In 1999 a journalist in Beijing used the term “Han-Liu”, or “Korean Stream” in Chinese, to talk about the success of the Korean pop culture in China. The term was very warmly accepted in Korea, and since then, the stream hasn’t stopped growing. “Personally, I was very surprised by the worldwide success of Hallyu, and I think Koreans would agree. It was very unexpected,” says Park. In the west, K-pop and K-drama are popular especially thanks to the communities of Koreans around the world and Asian diaspora in general. The big burst in the mainstream arrived only last year with Psy’s song and video, Gangnam Style, a mega hit that transformed K-pop into a real worldwide craze. Still, the “real” fans of the genre are not very excited about the most-viewed video of all time on YouTube. Hardcore K-popsters say Psy is successful because he is willing to make fun of himself. “Gangnam Style is not really K-pop, and I don’t like it that there are so many parodies by people who do not understand the meaning of it,\" says Victoria Dinkin, “but Psy, without a doubt, opened the path to other artists, and it was wonderful to see all the interest that was awakened. If he can succeed, other bands could too.” From K-Pop conventions to Middle-East dreams On a cozy morning of mid-May in the Port of Tel-Aviv, the announcement of the big prize creates real excitement in the hundred or so young girls (and few boys) who came to the 15th Israeli K-pop association convention. “In 2010, not more than 10 people came to the first convention. The next year, they were already more than 100,” says Linoy Neguev, one of the organizers of the event -- who, these days, goes by the name Lin Pil.  “The feeling you get from those bands, from the K-pop stars, is one of real people who work hard for their fans, who will do almost everything. They are not made by the industry”, explains the student, Kim Alperon. “Outsiders don’t understand us, they don’t get this love. Meeting other fans makes me open up; it is a very strong connection.” Dr. Nissim Atmazgin from the East Asia department of the Hebrew University, who investigated the Hallyu phenomenon in Israel, explains that the interest in K-pop in South Korea is a “cultural capital” for the young, something that makes them special and different. “It creates a passage to the world, even with people from enemy states,” says one K-popster girl. Alaa Abid, a student at the Hebrew University of Abu Tur and a fan of K-dramas refers to the Korean dream, which in a way has replaced the famous American Dream that Hollywood successfully produced for the world for so many years. “In Korean Dramas we can see how they preserved their culture while modernising very fast -- I connect with this a lot,\" says Abid. \"The approach of the heroes to life is very positive even when they go through tough times. I don’t know if this is the reality in Korea or if it’s only TV, but it is something that gives you hope, and in Jerusalem it is sometimes hard to find hope.” Abid, together with Dr. Atmazgin, is participating in a project in which she brings together Israeli and Palestinian Korea fans and interviews them. Researchers believe that there are around 5,000 fans in Israel and around 3,000 in the Palestinian Territories.  “I interviewed a teenager from Gaza who said that during bombings or military operations, K-pop and K-dramas are her beautiful dream-world, her hiding place,\" says Abid. \"Even though she knows it’s not reality, what she sees helps her believe that a better situation is possible. The message of all the K-dramas is that dreams can come true.” *This is an abridged item, not a direct translation ASHDOD - My daily walk along the beachside promenade in this city south of Tel Aviv where I now live is a chance to get up-to-date with what's going on in the music industry. Thanks to the ringtones of people walking by with their phones, or others sprawled along the Ashdod boardwalk, and also thanks to the dance events on the beach on Friday nights, I get to hear musical extracts from an unexpected language: Korean. “Ashdod is probably the city with the most K-popsters in Israel,” says Osheret Azani, 25, a student from the town of Ariel. K-popsters are fans -- nay, addicts of the Korean Popular music, K-pop. In Israel it is a still a relatively small base, but one that's growing very fast. Thousands of Israelis, especially girls, spend their time studying every move and sound of their favorite Korean bands. The K-popsters buy CDs and posters on eBay, exchange bracelets, clothing accessories and especially traffic in the latest gossip about their favorite bands. “Our Facebook group, iKpop, already boasts 3,000 members, but there are many other groups”, says Victoria Dinkin, a high-school student from Kiryat-Gat, who broadcasts the only show in Israel entirely dedicated to K-pop, on the educational local radio station Kol Gat.   But beyond the music, Korean culture as a whole is seeping into Israeli life, little-by-little: television shows (K-dramas), food, fashion... and eventually also the language. In 2008, the Hebrew University opened a new course of Korean Studies, alongside the longstanding departments of China and Japan studies. It's all part of a global cultural trend that has its own name: Hallyu. The phenomenon is so unique that this past May, a special conference was held concerning the subject at the Hebrew University, with researchers in the field invited from the world over. Gil-Sung Park, a sociologist from the Korea University in Seoul,tells me during one of the breaks between discussions, that the term Hallyu, comes in fact from China. In 1999 a journalist in Beijing used the term “Han-Liu”, or “Korean Stream” in Chinese, to talk about the success of the Korean pop culture in China. The term was very warmly accepted in Korea, and since then, the stream hasn’t stopped growing. “Personally, I was very surprised by the worldwide success of Hallyu, and I think Koreans would agree. It was very unexpected,” says Park. In the west, K-pop and K-drama are popular especially thanks to the communities of Koreans around the world and Asian diaspora in general. The big burst in the mainstream arrived only last year with Psy’s song and video, Gangnam Style, a mega hit that transformed K-pop into a real worldwide craze. Still, the “real” fans of the genre are not very excited about the most-viewed video of all time on YouTube. Hardcore K-popsters say Psy is successful because he is willing to make fun of himself. “Gangnam Style is not really K-pop, and I don’t like it that there are so many parodies by people who do not understand the meaning of it,\" says Victoria Dinkin, “but Psy, without a doubt, opened the path to other artists, and it was wonderful to see all the interest that was awakened. If he can succeed, other bands could too.” From K-Pop conventions to Middle-East dreams On a cozy morning of mid-May in the Port of Tel-Aviv, the announcement of the big prize creates real excitement in the hundred or so young girls (and few boys) who came to the 15th Israeli K-pop association convention. “In 2010, not more than 10 people came to the first convention. The next year, they were already more than 100,” says Linoy Neguev, one of the organizers of the event -- who, these days, goes by the name Lin Pil.  “The feeling you get from those bands, from the K-pop stars, is one of real people who work hard for their fans, who will do almost everything. They are not made by the industry”, explains the student, Kim Alperon. “Outsiders don’t understand us, they don’t get this love. Meeting other fans makes me open up; it is a very strong connection.” Dr. Nissim Atmazgin from the East Asia department of the Hebrew University, who investigated the Hallyu phenomenon in Israel, explains that the interest in K-pop in South Korea is a “cultural capital” for the young, something that makes them special and different. “It creates a passage to the world, even with people from enemy states,” says one K-popster girl. Alaa Abid, a student at the Hebrew University of Abu Tur and a fan of K-dramas refers to the Korean dream, which in a way has replaced the famous American Dream that Hollywood successfully produced for the world for so many years. “In Korean Dramas we can see how they preserved their culture while modernising very fast -- I connect with this a lot,\" says Abid. \"The approach of the heroes to life is very positive even when they go through tough times. I don’t know if this is the reality in Korea or if it’s only TV, but it is something that gives you hope, and in Jerusalem it is sometimes hard to find hope.” Abid, together with Dr. Atmazgin, is participating in a project in which she brings together Israeli and Palestinian Korea fans and interviews them. Researchers believe that there are around 5,000 fans in Israel and around 3,000 in the Palestinian Territories.  “I interviewed a teenager from Gaza who said that during bombings or military operations, K-pop and K-dramas are her beautiful dream-world, her hiding place,\" says Abid. \"Even though she knows it’s not reality, what she sees helps her believe that a better situation is possible. The message of all the K-dramas is that dreams can come true.” *This is an abridged item, not a direct translation You've reached your limit of free articles. To read the full story, start your free trial today. Get unlimited access. Cancel anytime. Exclusive coverage from the world's top sources, in English for the first time. Insights from the  widest range of perspectives, languages and countries. Already a subscriber? Log in The French president expressed his solidarity with Israel while calling for a political solution for the Palestinians; but he also made a surprise proposal for an international coalition against Hamas, which faces several obstacles — but is also a way to \"frame\" the conflict so that the dormant two-state solution can return. The French President meeting with Mahmoud Abbas in Ramallah. -Analysis- PARIS — Should the open war between Israel and Hamas be \"internationalized,\" as a way to limit the carnage? This was the surprise proposal made by French President Emmanuel Macron on Tuesday, during his two-day visit to Israel, the West Bank and other countries in the region. For the latest news & views from every corner of the world, Worldcrunch Today  is the only truly international newsletter. Sign up here. For the latest news & views from every corner of the world, Worldcrunch Today  is the only truly international newsletter. Sign up here. Macron, who was otherwise rather successful in his balancing act between solidarity with Israel and support of Palestinian rights, also put forward a brand new proposal: an international coalition against Hamas. It would be modeled on, or extending the scope of the one that has been assembled against the jihadist movement Islamic State (ISIS). The proposal comes as something of a surprise, given that the coalition against ISIS includes, in addition to the West, the main Arab countries. It's hard to see them committing themselves to a proposal alongside Israel at a time when the Jewish state is ruthlessly bombing Gaza, arousing strong emotions across the Arab world. The idea seems to have been improvised, as it was adjusted several times during the day on Tuesday. In the end, it's more a question of sharing intelligence, controlling financial flows and imposing sanctions than of going to war on Israel's side. Nonetheless, the proposal raises several tough questions.             The latest ",
    "datetime": "2013-07-29T22:52:05+00:00",
    "url": "https://worldcrunch.com/culture-society/when-korean-pop-culture-came-to-the-holy-land"
}