{
    "title": "Which 4 hunky actors are heirs to crowns of ‘K-drama Kings’ Song Joong-ki and Lee Min-ho? | South China Morning Post",
    "text": "Who will succeed the top South Korean heartthrob actors Lee Min-ho and Song Joong-ki as the “K-drama Kings”? Lee, 31, has been one of the top “hallyu” – or Korean wave – stars since his breakthrough role in 2009’s romantic comedy-drama Boys Over Flowers, while Song, 32, rose to fame in 2010 in the historical drama Sungkyunkwan Scandal (2010) and in the variety show Running Man. We take a look at four rising stars – Jung Hae-in, Woo Do-hwan, Jang Ki-yong and Yang Se-jong – who have been attracting the attention of television viewers and are tipped as the potential heirs to Lee and Song. Jung Hae-in, ‘darling’ of an older women Rising star Jung Hae-in, 30, was propelled to stardom this year after appearing in JTBC television series Something in the Rain, which is also known as Pretty Noona Who Buys Me Food. He played the character of Seo Jun-hee, a game designer who falls in love with an older woman, Yoon Jin-ah. The great on-screen chemistry between Jung and veteran actress Son Ye-jin, 36, who plays the part of Yoon, led to many viewers thinking that the duo were actually dating. Jung made his debut appearance in a 2013 music video by K-pop girl band AOA Black. Woo Do-hwan, pursued by advertisers Woo Do-hwan, 26, is another actor on the rise, with different charms. He made his acting debut in the MBN sitcom You’re Here, You’re Here, You’re Really Here in 2011 and has appeared in many series including the OCN drama Save Me, and KBS’ Mad Dog in 2017. He won award as best new actor at the 31st KBS Drama Awards in 2017. Although his recent drama Tempted did not attract a big audience, he is still expected to be among the next generation of stars. Woo is particularly popular with advertisers. He often appears in television commercials for drinks, apparel and cosmetic companies. Jang Ki-yong, fit for ‘first love’ Jang Ki-yong, 26, came to prominence after starring in the KBS television drama series Confession Couple in 2017. He played the role of the first love of the female lead, Jang Na-ra, and attracted a strong following. Jang, who debuted as a model in 2012, began his acting career in 2014 with the SBS television series It’s Okay, That’s Love. His latest drama series, Come and Hug Me, which saw him play the role of a policeman, was also successful. Yang Se-jong, a versatile star Yang Se-jong, 26, is on television screens in South Korea right now – enthralling viewers in the SBS television series Still 17. The actor’s sensitive and emotionally charged performance has been praised as one of the reasons for the high ratings of the romantic comedy-drama, which first aired in July. Yang plays the role of Gong Woo-jin, who has isolated himself – shunning serious relationships because of a heartbreaking incident as a teenager. However, he starts to change after meeting a young woman. Yang made his official debut in the television series Dr. Romantic in 2016. He was kept busy in 2017, appearing in three different series – the historical drama Saimdang, Memoir of Colours, science-fiction thriller Duel, and romantic drama Temperature of Love. Want more stories like this? Sign up  here. Follow STYLE on  Facebook,  Instagram and  Twitter This article was originally written by Dong Sun-hwa for  The Korea Times. The dashing Jung Hae-in, Woo Do-hwan, Jang Ki-yong and Yang Se-jong have all been tipped be big stars in the future ",
    "datetime": "2018-08-31T12:02:05+08:00",
    "url": "https://www.scmp.com/magazines/style/people-events/article/2162127/which-4-hunky-actors-are-heirs-crowns-k-drama-kings"
}