{
    "title": "Why The Blueprint For K-Pop Actually Came From Japan : NPR",
    "text": "By Naomi Gingold Japanese boy band SMAP and its powerful agency, Johnny's Entertainment, are largely responsible for creating the K-pop model. Even though SMAP broke up, its influence is still being felt. AUDIE CORNISH, HOST: The lineup for this summer's Coachella festival is making fans of K-pop and J-pop smile. Korean and Japanese pop music groups feature prominently. Many people have heard about K-pop, the Korean boy band BTS. They topped the U.S. charts last summer. Many fewer people know the blueprints for the genre mostly came from Japan. A group there called SMAP played a big role in shaping the pop idol landscape across Asia. SMAP broke up but remains a huge influence. Naomi Gingold reports.NAOMI GINGOLD, BYLINE: This has to start with a bit of a confession. I'm kind of a Japanese teeny-bopper. When I was 16, living in the Japanese countryside as an exchange student, I fell in love with the boy band SMAP. And like most of Japan, I never fell out of love with them.(SOUNDBITE OF SONG, \"YOZORA NO MUKOU\")SMAP: (Singing in Japanese).GINGOLD: SMAP, Sports Music Assemble People, debuted in 1991. They came from Johnny's Entertainment, this male pop idol factory in Japan. But unlike most Johnny's groups, when SMAP came out, they were kind of a flop.RYOKO OSANAI: (Speaking Japanese).GINGOLD: So SMAP's manager took a new approach, says Ryoko Osanai, a reporter who's covered SMAP extensively.OSANAI: (Through interpreter) She started putting SMAP on comedy variety shows. It was a first for pop idols, and it was really popular.GINGOLD: Now, to anyone familiar with pop groups in Asia now, this seems typical. But in the '90s, pop idols were too cool for this. SMAP's popularity on these shows, though, changed the game for everybody.OSANAI: (Through interpreter) After SMAP, idols all started being on variety shows. They had to be able to do comedy, act, sing, dance.GINGOLD: In the mid-'90s, SMAP upped the ante again.(SOUNDBITE OF SONG, \"LA LA LA LOVE SONG\")TOSHINOBU KUBOTA: (Singing in Japanese).GINGOLD: One member, Takuya Kimura, starred in a TV drama called \"Long Vacation\" that exploded in Japan and across Asia. Overnight, he became Japan's No. 1 star, and the show's success cemented the superstar acting careers of all group five members.FABIENNE DARLING-WOLF: \"Long Vacation\" really kind of sparked a wave of Japanese transcultural influence, and SMAP became associated with that wave.GINGOLD: Fabienne Darling-Wolf is a professor of global media at Temple University in Philadelphia. Today, we talk about the Korean wave. But back then, it was the Japanese wave.DARLING-WOLF: Before K-pop, there was J-pop. (Laughter) I mean, it's a format, right? And the format was developed in Japan.GINGOLD: How agencies are run, what activities idols do. The same year as \"Long Vacation\" debuted, SMAP got their own TV variety show on Monday nights. Now, the truth is they weren't particularly good singers or even dancers. But they did have big hits.(SOUNDBITE OF SMAP SONG, \"SEKAI NI HITOTSU DAKE NO HANA\")GINGOLD: And this song became particularly important. It's called \"One And Only Flower In The World.\" The lyrics basically say you are the only one of you. You are special. It's OK to be you.(SOUNDBITE OF SONG, \"SEKAI NI HITOTSU DAKE NO HANA\")SMAP: (Singing in Japanese).GINGOLD: It was a megahit and later kind of became a rallying cry of Japanese pride. So in 2016, when rumors started that SMAP might be splitting up after 25 years, it created this earthquake of tabloid gossip and fan pandemonium. Then, one Monday night, SMAP came on their show in black suits, bowed deeply and apologized...(SOUNDBITE OF TV SHOW, \"SMAPXSMAP\")UNIDENTIFIED SMAP MEMBER: (Speaking Japanese).GINGOLD: ...And said they were continuing. Twitter crashed in Japan. Prime Minister Shinzo Abe said he was glad the group was staying together. Then, half a year later, SMAP said they would be calling it quits. Fans took out full-page newspaper ads, signed online petitions. And today, they still call for them to return because although individual SMAP members are still active, something in Japan is missing.(SOUNDBITE OF SONG, \"LION HEART\")SMAP: (Singing in Japanese).GINGOLD: The institution of SMAP may not be there, but the way they helped shape Japanese and Asian pop culture writ large is everywhere. And because this is my story, we're going out on my favorite song, \"Lion Heart.\"(SOUNDBITE OF SONG, \"LION HEART\")SMAP: (Singing in Japanese).GINGOLD: For NPR News, I'm Naomi Gingold in Tokyo.(SOUNDBITE OF SONG, \"LION HEART\")SMAP: (Singing in Japanese).CORNISH: And this story came to us from the podcast Not The Hello Kitty Show.(SOUNDBITE OF SONG, \"LION HEART\")SMAP: (Singing in Japanese). AUDIE CORNISH, HOST: The lineup for this summer's Coachella festival is making fans of K-pop and J-pop smile. Korean and Japanese pop music groups feature prominently. Many people have heard about K-pop, the Korean boy band BTS. They topped the U.S. charts last summer. Many fewer people know the blueprints for the genre mostly came from Japan. A group there called SMAP played a big role in shaping the pop idol landscape across Asia. SMAP broke up but remains a huge influence. Naomi Gingold reports. NAOMI GINGOLD, BYLINE: This has to start with a bit of a confession. I'm kind of a Japanese teeny-bopper. When I was 16, living in the Japanese countryside as an exchange student, I fell in love with the boy band SMAP. And like most of Japan, I never fell out of love with them. (SOUNDBITE OF SONG, \"YOZORA NO MUKOU\") SMAP: (Singing in Japanese). GINGOLD: SMAP, Sports Music Assemble People, debuted in 1991. They came from Johnny's Entertainment, this male pop idol factory in Japan. But unlike most Johnny's groups, when SMAP came out, they were kind of a flop. RYOKO OSANAI: (Speaking Japanese). GINGOLD: So SMAP's manager took a new approach, says Ryoko Osanai, a reporter who's covered SMAP extensively. OSANAI: (Through interpreter) She started putting SMAP on comedy variety shows. It was a first for pop idols, and it was really popular. GINGOLD: Now, to anyone familiar with pop groups in Asia now, this seems typical. But in the '90s, pop idols were too cool for this. SMAP's popularity on these shows, though, changed the game for everybody. OSANAI: (Through interpreter) After SMAP, idols all started being on variety shows. They had to be able to do comedy, act, sing, dance. GINGOLD: In the mid-'90s, SMAP upped the ante again. (SOUNDBITE OF SONG, \"LA LA LA LOVE SONG\") TOSHINOBU KUBOTA: (Singing in Japanese). GINGOLD: One member, Takuya Kimura, starred in a TV drama called \"Long Vacation\" that exploded in Japan and across Asia. Overnight, he became Japan's No. 1 star, and the show's success cemented the superstar acting careers of all group five members. FABIENNE DARLING-WOLF: \"Long Vacation\" really kind of sparked a wave of Japanese transcultural influence, and SMAP became associated with that wave. GINGOLD: Fabienne Darling-Wolf is a professor of global media at Temple University in Philadelphia. Today, we talk about the Korean wave. But back then, it was the Japanese wave. DARLING-WOLF: Before K-pop, there was J-pop. (Laughter) I mean, it's a format, right? And the format was developed in Japan. GINGOLD: How agencies are run, what activities idols do. The same year as \"Long Vacation\" debuted, SMAP got their own TV variety show on Monday nights. Now, the truth is they weren't particularly good singers or even dancers. But they did have big hits. (SOUNDBITE OF SMAP SONG, \"SEKAI NI HITOTSU DAKE NO HANA\") GINGOLD: And this song became particularly important. It's called \"One And Only Flower In The World.\" The lyrics basically say you are the only one of you. You are special. It's OK to be you. (SOUNDBITE OF SONG, \"SEKAI NI HITOTSU DAKE NO HANA\") SMAP: (Singing in Japanese). GINGOLD: It was a megahit and later kind of became a rallying cry of Japanese pride. So in 2016, when rumors started that SMAP might be splitting up after 25 years, it created this earthquake of tabloid gossip and fan pandemonium. Then, one Monday night, SMAP came on their show in black suits, bowed deeply and apologized... (SOUNDBITE OF TV SHOW, \"SMAPXSMAP\") UNIDENTIFIED SMAP MEMBER: (Speaking Japanese). GINGOLD: ...And said they were continuing. Twitter crashed in Japan. Prime Minister Shinzo Abe said he was glad the group was staying together. Then, half a year later, SMAP said they would be calling it quits. Fans took out full-page newspaper ads, signed online petitions. And today, they still call for them to return because although individual SMAP members are still active, something in Japan is missing. (SOUNDBITE OF SONG, \"LION HEART\") SMAP: (Singing in Japanese). GINGOLD: The institution of SMAP may not be there, but the way they helped shape Japanese and Asian pop culture writ large is everywhere. And because this is my story, we're going out on my favorite song, \"Lion Heart.\" (SOUNDBITE OF SONG, \"LION HEART\") SMAP: (Singing in Japanese). GINGOLD: For NPR News, I'm Naomi Gingold in Tokyo. (SOUNDBITE OF SONG, \"LION HEART\") SMAP: (Singing in Japanese). CORNISH: And this story came to us from the podcast Not The Hello Kitty Show. (SOUNDBITE OF SONG, \"LION HEART\") SMAP: (Singing in Japanese). Copyright © 2019 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information. NPR transcripts are created on a rush deadline by an NPR contractor. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record. An earlier online version of this story said the band SMAP broke up last year. It broke up in 2017. An earlier online version of this story said the band SMAP broke up last year. It broke up in 2017. Sponsor Message Become an NPR sponsor ",
    "datetime": null,
    "url": "https://www.npr.org/2019/01/08/683339743/why-the-blueprint-for-k-pop-actually-came-from-japan"
}