{
    "title": "\r\n\tWhy are more Korean stars coming to PH? | ABS-CBN News\r\n",
    "text": "Home\n > \nLife Posted at Mar 08 2019 03:24 PM Share MANILA — Deafening shrieks from the crowd welcomed NCT Dream as they took the stage of the Mall of Asia Arena Thursday. It was the first time for the Korean boy group to perform here as part of the 2019 K-POP Friendship Concert in Manila, a cultural celebration through music shared by the Philippines and South Korea in honor of the 70th anniversary of diplomatic relations between the two countries. Other performers of the night were boy group NOIR and girl group APRIL, and Filipino rock band Silent Sanctuary. Angel Delmo, a 21-year-old fresh graduate, was one of the lucky fans who finally saw NCT Dream in the flesh, calling it a “worthwhile experience.” Delmo said she has been a fan of K-pop, or South Korean pop music, for around 5 years. She recalled being influenced by her friends in high school, starting with the boy group EXO, which visited Manila twice last year. More and more Korean stars — not just “idol” groups but also actors and actresses — have been visiting the country in recent years. This is part of a phenomenon known as “Hallyu” or “Korean wave,” the increasing global popularity of Korean pop culture such as music, drama, food and even cosmetics. While the Korean government has put in financial support to “export K-wave overseas,” an official at Korea’s cultural ministry explained that “professionals in the K-pop industry” remain at the forefront of Hallyu. Kim Yong-Sam, 1st Vice Minister of the Ministry of Culture, Sports and Tourism, believes Korean entertainment companies find the Philippines an attractive market because of the “cultural solidarity” between Koreans and Filipinos. “The professionals in the K-pop industry… probably found the cultural solidarity between the Philippines and Korea very attractive and more marketable,” Kim said in a press conference for the 2019 K-POP Friendship Concert in Manila. In the first two months of 2019, girl groups Momoland and Blackpink held respective shows here. Actor Park Hyung-sik also met Filipino fans last month after being picked to model for a local clothing brand. K-pop acts set to visit the country in the coming months include The Boyz, Stray Kids, Dreamcatcher, GFriend, Park Ji-hoon and Bae Jin-young. Drama actors So Ji-sub and Park Bo-gum are also set to meet their fans here. Asked whether this was an effort of companies to reach out to other Asian markets after China tightened regulations on Korean entertainment, Kim said the cultural sector is “less affected by the political disagreements.” China banned Korean stars from the mainland as economic retaliation over the deployment of a US missile shield on the Korean peninsula, according to a 2017 report by the Korea Herald. Kim said while China imposed a “banning policy of K-wave,” interest in Korean entertainment continued to grow across Asia due to social media. “Even though they had that kind of policy at that time, the youth of Asia still were interested in K-wave and the interest is increasing more and more as the time goes through SNS (social networking sites), YouTube videos and other individual private broadcasters,” he said. National Archives of the Philippines Executive Director Victorino Mapa Manalo said Filipinos' interest in Korean culture is due to the shared values between the countries. “Koreans are very concerned with family values. They’re very close to their family. So their concerns, issues when it comes to dramas and plays, things like that, are very similar,” said Manalo. “Even the sentiments they touch on their songs are very similar,” he said. Last year, K-pop acts such as iKON, Winner, Wanna One, Girls' Generation's Taeyeon, Seventeen and Super Junior visited the country. “Weightlifting Fairy Kim Bok-Joo” star Nam Joo-hyuk also made Filipino fans swoon in an event with Sandara Park. Share US police launch manhunt for gunman who killed at least 22 October 26, 2023 Pumpkins for Halloween emojis? October 26, 2023 NAIA expects Undas influx to begin on Friday October 26, 2023 Palace: No suspension of work, classes on Oct. 31 October 26, 2023 USAID to fund development of 9 PH secondary cities October 26, 2023 BRAND NEWS BRAND NEWS How Filipinos can future-proof their finances Swedish home furnishing store accessible anywhere in PH Eye protection, 200MP flagship camera with HONOR 90 5G Strategies for stress-free holiday shopping An environment that energizes, supports businesses A mix of tech, entertainment, sports at JRU and UPD How to slow down bone loss as you age Lady guard honored for exemplary act BPO employees green up La Mesa Nature Reserve's forest When a photo booth becomes a holiday surprise Power couples' secrets to everyday confidence Where power and prestige meet Productivity meets fun with this realme tablet A celebration of togetherness and traditions Property builder offers 'Your Best Home Yet' Achieve a different kind of aura with this smartphone This app introduces new investment tools for Filipinos Smartphone photography: Meet the new challenger Food prep tips to help manage diabetes diet Kathryn, Min Bernardo share their stories in a vlog NBA teams up with tech innovator The impact of education expenses on Filipino families Anne Curtis' go-to gadget for nighttime photography Tips for a budget-friendly vacation Celebrity Fabio Ide's secret to a fit and healthy body Mall chain celebrates 65 years with deals, treats Property developer celebrates triple wins New smartphone series debuts with Anne Curtis Reclassified furniture: From dining to learning Jollibee Group reinforces sustainability with Cargill © 2023 ABS-CBN Corporation. All Rights Reserved. AboutCareersPrivacyTermsContact UsAdvertise With Us ",
    "datetime": null,
    "url": "https://news.abs-cbn.com/life/03/08/19/why-are-more-korean-stars-coming-to-ph"
}