{
    "title": "Why are Malaysian musicians localising K-pop hits? Blackpink’s Ice Cream and Kill This Love are just two songs that have got a more sanitised, Islam-friendly remake | South China Morning Post",
    "text": "Last year, all-female quartet Blackpink and Selena Gomez’s single Ice Cream came under fire for the line “play the part like Moses”, as some felt that it made light of the significant figure in Judaism, Christianity and Islam. The boy band NCT U met criticism the same year after exploiting the Imam Husayn Shrine in Iraq, a sacred site for Shia Muslims, as a stage prop, and later as an official piece of merchandise. In 2015, another K-pop boy band B1A4 stirred up controversy when members hugged three female Malaysian fans during their mini concert, which nearly led to the girls’ arrest for “indecent acts in a public place”. But while some Muslim fans responded to such incidents with criticism, others have been proactive in attempts to adapt K-pop to better suit local palates. K-pop lyrics, reimagined Amid this cultural clash, in recent years some Muslim musicians in Malaysia have made efforts  to localise K-pop by replacing naughty lyrics with more wholesome, sanitised cover versions that better adhere to Islamic principles. The genre that Tarbiah Sentap Records produces is known as pop nasyid, a Malaysian a cappella style that emerged in the 1990s. It focuses on fusing modern Western pop music with Islamic values and local traditional musical elements. The style appeals to a younger generation of Muslims, as it represents a Malaysian Islamic version of modernity while still incorporating popular global trends. Local receptions of K-pop covers by pop nasyid groups have been mixed, Hong Sung-ah, a correspondent in Malaysia for the Korea Foundation for International Cultural Exchange (KOFICE), said: “Some Muslims seem to sympathise with the point made by the label in that K-pop lyrics and music videos can be offensive to the believers. But there are others who show concern that although the effort can be meaningful to the Muslim population, it can also antagonise other religious groups.” Cultural clashes Popular foreign culture has often been vilified as a force of corruption in Malaysia. This labelling was mainly carried out by conservative authorities who have ruled the region since the 1980s and deemed such outsider influence to be a threat to their political control, according to Mary J. Ainslie, an associate professor of media and cultural studies at the University of Nottingham Ningbo China and an expert in intercultural links between East and Southeast Asia.“As a means to retain such control, authorities promote a racially and religiously divisive form of politics, one that places emphasis upon conformity and racial and religious forms of identity,” she said. But a majority of young Muslim K-pop fans see no glaring conflict between their religious faith and passion for global pop culture.“Many Malaysian fans tell me how strict they are with themselves and their own personal lives, but they do not feel the need to extend that strictness to others and are not threatened by different forms of entertainment. Fans are able to negotiate a relationship with K-pop, taking what they need to express themselves and remain close to Islam,” she added. The professor added that this comes as a result of the younger generation in particular being more educated and digitally savvy, thus becoming more accepting of foreign culture.Hong echoed the sentiment by citing the words of Rozyyati Mohamad, editor-in-chief of Malaysian website K-Popped! that delivers news about Korean culture. Cultural insensitivity? The emergence of Muslim-friendly versions of K-pop lyrics in Malaysia and efforts to reinterpret and localise the genre in other countries show that K-pop has certainly grown to exert a significant cultural influence internationally.In some countries, the genre has expanded far beyond the cultural realm, serving as a tool to represent certain political voices. Fans of the biggest K-pop names, including BTS, Exo and Blackpink, were part of the forces mobilising the pro-democracy movement in Thailand. Recordings of Girls’ Generation’s Into the New World and Blackpink’s Kill This Love were even played during street protests. Want more stories like this? Sign up here. Follow STYLE on  Facebook,  Instagram,  YouTube and  Twitter. ",
    "datetime": "2021-02-21T08:00:13+08:00",
    "url": "https://www.scmp.com/magazines/style/celebrity/article/3122380/why-are-malaysian-musicians-localising-k-pop-hits"
}