{
    "title": "Why the Korean entertainment wave is taking India by a storm",
    "text": "Listen to Story For Delhi-based Avanthika Shringi, 37, mother of two and a homemaker, days are dull and incomplete if a BTS song isn’t playing in the house. Bangtang Sonyeondan, popularly known as BTS, are a world-famous Korean boy band. On September 20 they joined the South Korean president Moon Jae-in at the United Nations General Assembly (UNGA), where they spoke and performed online at the Sustainable Development Goals (SDG) Moment 2021.“I started listening to BTS only last year after I saw them all over the Internet,” says Shringi. “I was curious then, and now, not just me, but my sons are huge BTS fans too. We sing their songs out loud, they are all so catchy.” Shringi is not alone. Divita Kemkar, 13, a Class 8 student of Apeejay School in Panchsheel Park, says she’s obsessed with BTS. “I 'purple' [meaning ‘love’ in K-culture slang] them so much so that I am taking Korean lessons online. I have taken it upon myself to make my friends fall in love with them and their songs!”advertisementSince a decade ago, when barely anyone knew of K-pop and Korean TV shows, a combination of increased Internet access, the streaming revolution and now the Covid-induced lockdown has bridged the 4,684 km distance between South Korea and India. Korean entertainment, pop songs and dramas are all the rage now. A recent Netflix study done in India, tracks a 370 per cent increase in the number of Indians watching K-dramas. Music streaming giant Spotify’s 2020 data puts BTS as the fourth-most streamed boy band in India. BTS was also one of the top three streaming trends from Spotify's first year in India. Indian streaming platforms such as MX Player and ZEE5 have released Hindi-dubbed versions of popular international shows, including Korean shows, due to popular demand.K-popSouth Korean singer PSY's viral hit 'Gangnam Style' in 2012 might have been the catalyst for the Hallyu Wave (a term used to describe Korean culture's growth) in India, but it certainly wasn't the origin.K-pop's presence in India can be traced back to the late '90s when it became popular in the Northeastern state of Manipur, where Bollywood movies were banned due to a years-old diktat from the separatist group Revolutionary Peoples Front to make Manipur an independent socialist state. With not much on offer, locals started turning to Korean entertainment. “I started listening to BTS only last year after I saw them all over the Internet,” says Shringi. “I was curious then, and now, not just me, but my sons are huge BTS fans too. We sing their songs out loud, they are all so catchy.” Shringi is not alone. Divita Kemkar, 13, a Class 8 student of Apeejay School in Panchsheel Park, says she’s obsessed with BTS. “I 'purple' [meaning ‘love’ in K-culture slang] them so much so that I am taking Korean lessons online. I have taken it upon myself to make my friends fall in love with them and their songs!” Since a decade ago, when barely anyone knew of K-pop and Korean TV shows, a combination of increased Internet access, the streaming revolution and now the Covid-induced lockdown has bridged the 4,684 km distance between South Korea and India. Korean entertainment, pop songs and dramas are all the rage now. A recent Netflix study done in India, tracks a 370 per cent increase in the number of Indians watching K-dramas. Music streaming giant Spotify’s 2020 data puts BTS as the fourth-most streamed boy band in India. BTS was also one of the top three streaming trends from Spotify's first year in India. Indian streaming platforms such as MX Player and ZEE5 have released Hindi-dubbed versions of popular international shows, including Korean shows, due to popular demand. South Korean singer PSY's viral hit 'Gangnam Style' in 2012 might have been the catalyst for the Hallyu Wave (a term used to describe Korean culture's growth) in India, but it certainly wasn't the origin. K-pop's presence in India can be traced back to the late '90s when it became popular in the Northeastern state of Manipur, where Bollywood movies were banned due to a years-old diktat from the separatist group Revolutionary Peoples Front to make Manipur an independent socialist state. With not much on offer, locals started turning to Korean entertainment. Talking about K-pop's growth in India, Gurgaon-based Rahul Prabhakar, 42, director, software development at Espire infolabs, says “Increasing use of Korean phrases in common parlance among the young people of Manipur was perhaps the first visible signs of growing affinity for their culture.” Having lived in Seoul from 2005 to 2012, Rahul saw the rise of K-pop culture outside Korea. He says, “a slew of K-pop music icons like Rain and 2Ne1 took the Internet by storm, grabbing attention with well-choreographed songs and peppy music. The proliferation of K-pop music videos on YouTube was another trendsetting development. This genre encompassed a wide spectrum of musical and visual elements, blending pop, rock, hip-hop, R&B, and electronic music.” Along with K-pop, South Korean TV shows, or K-dramas, are extremely popular. Shows such as Crash Landing on You (2019), It's Okay to Not Be Okay (2020) and Kingdom (2019) have dominated Netflix's top trending shows list in India since early 2020, especially during the lockdown. Indian viewers find K-dramas relatable. “Korean shows are popular because of its emotions,” says 30-year-old Videh, who works in a US-based organisation, Protiviti, and is a huge fan of K-dramas. ‘It is interesting how K-dramas with their set format of 16 episodes explore various genres such as thrillers, politics, time travel, criminal investigation, family dynamics and historical stories.” According to Hyunwoo Thomas Kim, co-founder, president and CEO of Kross Komics, predicts Korean originated Webtoons, or digital comics, will be the next big craze. Kross Komics is a one of its kind webtoon platform in India launched in December 2019. With just about 1.5 years of operation, the app has gathered over 4.5 million downloads with around half of them being females. “High number of webtoons in the romance/ rom-com category along with global best-selling stories make this new form of content a very interesting alternative to binge on,” he says. With lots of Korean content available on streaming services, YouTube and social media platforms, more people are joining K-fandom. Fans all over India are so connected with the K-culture that almost every K-pop group has a fan club dedicated to them. Th group ‘armybtsindia’ is one such group with 1.2 lakh followers. Daisy Ray, a 26-year-old BTS fan and a member of armybtsindia says, “The group is quite active with all BTS updates—their new albums, TV appearances, news articles on them, their upcoming concerts and cute pictures. It's a treat really.” Another fan of the band, 20-year-old Rajlakshmi Indulkar, a third year student of Mumbai’s Sophia College, says, “I started listening to BTS in 2015. Their message to love and accept yourself the way you are, appealed to me the most. They inspire me to achieve my dreams, to work towards them and mostly to believe that dreams come true by hard work and passion.” The Korean entertainment wave is still unfolding. How the K-phenomenon evolves from here on depends on how Korea’s entertainment industry innovates. ",
    "datetime": null,
    "url": "https://www.indiatoday.in/india-today-insight/story/why-the-korean-entertainment-wave-is-taking-india-by-a-storm-1855321-2021-09-21"
}