{
    "title": "Why K-Pop Is a Smash in Latin America | TIME.com",
    "text": "Lapped up by a Spanish-speaking market that adores K-pop's lavish production values and upbeat message, a Korean wave is sweeping through Latin America South Korean boy band Super Junior performing in São Paulo on April 21, 2013 Follow @TIMEWorld The export success of artists like Don Omar and Shakira in previous years may have given the Latin pop business a few global ambitions, but in Latin America itself the sound that’s making waves right now is Pop Coreano, or K-pop. Driven by South Korean entertainment companies seeking fresh markets for their superslick music stars, and lapped up by a Spanish-speaking youth market that adores K-pop’s lavish production values and infallibly upbeat message, a Korean wave is sweeping through Central and South America, attracting large audiences and inspiring cultish devotion. “So many [K-pop] acts are making South America and Latin America a priority on their touring,” Jeff Benjamin of Billboard’s K-Town column told TIME. “These fans will come out.” Some 13,000 fans showed up at a Super Junior concert in Lima in April; five months previously, Big Bang attracted an audience of 14,000, dancing and singing along to what were surely incomprehensible Korean lyrics to most (albeit with the odd Spanish shout-out or English chorus). There’s a shopping center in the Peruvian capital with entire floors dedicated to South Korean music, cuisine and clothes. On YouTube, K-pop videos with lyrics translated into Spanish notch up millions of views, as fans in Peru and throughout the Hispanophone world log on for their K-pop fix. In other words, South Korean popular music “has reached a certain critical mass and it’s become a niche in and of itself, everywhere,” says Mark Russell, author of Pop Goes Korea: Behind the Revolution in Movies, Music and Internet Culture. (MORE: Seoul Music — The World Is Finally Ready for K-Pop) That niche — an amalgamation of spectacular entertainment and relentless optimism — resonates with teenagers in South American nations. The values these stars represent are almost “Confucian,” says Professor Patrick Messerlin, a French economist who has produced an economic analysis of K-pop and who earlier this year addressed a cultural forum in Seoul on the music’s globalization. In his research, Messerlin found that “K-pop performers deliver a sense of modesty and restraint,” and “insist on working hard and learning more” during public appearances, something Western pop artists do not do. Their music represents a “new, colorful and cheerful start,” and not “an old order,” something that will easily appeal to millions of young Central and South Americans, living where economic challenges are rife and nondemocratic regimes common. K-pop’s positive energy is a world away from the introspective, jaded and at times downright depressing style of much Anglophone rock, indie and emo. “[The Koreans] say, ‘We understand your problems,’” Messerlin explains, “‘We went through it too,’” referring to the Korean War and the economic crash of the late 1990s. (WATCH AND LISTEN: Beyond PSY — 5 Essential K-Pop Tracks) For the fans, there is no contest. K-pop songs “are beautiful, are decent,” says Jenii Ramirez, an 18-year-old K-pop fan from Colombia, where TV station Caracol has been broadcasting a K-pop talent show and where K-pop concerts in the capital, Bogotá, lure audiences of at least 5,000. The singers, Ramirez says, have “dedication and are taught to fight in life, understanding that dreams are attainable.” The timing of K-pop’s Latin push is, of course, no accident. From 2008 to 2011, Korean music exports around the world more than doubled, but there is anecdotal evidence that the markets of its traditional East and Southeast Asian heartland are becoming saturated. The M!Countdown Halo Indonesia concert, slated for early July, was canceled because of “local circumstances.” Another concert in Thailand lost its main sponsor days before the event because of weak ticket sales. The sheer flood of K-pop artists has simply watered down the music’s appeal. Tastes, too, are maturing, with singer-songwriters and alternative bands making inroads into markets traditionally dominated by saccharine pop. In South America, though, decades of conflict, coups and revolution mean that people have had their fill of edginess, authenticity and angst. “In Chile, we don’t have anything like K-pop. Songs here mostly have political and social relics, though we have Latin rhythm,” a young woman from Santiago, who gathers with friends in a park every week to practice the latest K-pop dance moves, told the South Korean Yonhap News Agency. “The Korean songs make me dance and smile. What else is needed?” It seems that K-pop’s ability to dazzle is in no danger of diminishing just yet. An earlier version of this article misstated the capital of Colombia. It is Bogotá, not Santiago. MORE: Trend Alert — K-pop Meets Country Music and New Jersey ",
    "datetime": null,
    "url": "https://world.time.com/2013/08/01/forget-politics-lets-dance-why-k-pop-is-a-latin-american-smash/"
}