{
    "title": "Why Modi wave and Kejriwal’s problems may not bring BJP back to power in Delhi - India Today",
    "text": "Listen to Story The Bharatiya Janata Party (BJP) lost power in Delhi in 1998, when the Sushma Swaraj government fell to rising prices of vegetables, particularly onions in the Delhi Assembly election. For more than 21 years, the BJP has been trying to get back to power albeit unsuccessfully. The BJP came closest to forming a government in 2013 riding strong on still-building Narendra Modi wave. But falling short of majority mark, it chose to claim high moral ground by not staking claim to form government, which political debutant Arvind Kejriwal formed with outside support of the Congress. The Aam Aadmi Party (AAP) had crushed the Congress and Arvind Kejriwal defeated three-time chief minister Sheila Dikshit in what was the biggest setback for the party ruling both at the Centre and in Delhi. Kejriwal, leading a minority government, resigned after 49 days over an anti-corruption law, and returned with biggest ever majority for any party in Delhi in 2015 assembly election. This victory of Kejriwal and the AAP came in the middle of strong Modi wave. The BJP had gained majority in the Lok Sabha on its own only a year ago, and had been winning elections in state after state with Delhi and Bihar forming two much-talked about exceptions. Now, five years later, the BJP still banks on the Modi wave and the AAP on Kejriwal’s positive agenda of governance. Many thought a year ago that Modi wave was on the wane but Narendra Modi returned as the prime minister with the BJP winning an even bigger majority in 2019. And, despite protests, PM Modi continues to be the biggest vote aggregator in Indian politics. The BJP hopes that a combination of Modi wave and challenges faced by Arvind Kejriwal will bring it back to power in Delhi. But this is easier contemplated than accomplished. WHO RULES DELHI BJP? The BJP is facing its own set of problems in Delhi. Factionalism is one big impediment that even the party insiders say may keep the BJP in the also-ran category beside the Congress in Delhi Assembly election. The BJP is faction-ridden with Delhi unit president Manoj Tiwary being challenged by groups led by Union minister Vijay Goel and MLA Vijender Gupta. Parvesh Verma, too, has become more assertive in recent months staking claim on Delhi BJP leadership as political inheritor of his father Saheb Singh Verma’s legacy. Former Delhi BJP president Satish Upadhyay is still hoping for a tighter grip on the party. Then there is a band of Harsh Vardhan loyalists. Union minister Harsh Vardhan has, however, maintained a stoic silence which many interpret as his faith in the confidence PM Modi and Union Home Minister and BJP national president Amit Shah seem to have in him. Harsh Vardhan may again be a choice for Delhi chief minister of Modi-Shah leadership should the BJP trounce the ruling AAP in Delhi election. ANTI-CAA PROTESTS Continued protest against the Modi government over a range of issues emerging primarily from enactment of the Citizenship Amendment Act (CAA) is another challenge for the BJP in Delhi election. Students and women have been at the forefront of anti-CAA protests in Delhi. Police action and alleged inaction in premier universities in the national capital has helped building perception that the Modi-Shah leadership of the BJP is insensitive towards sentiments and concerns of aam aadmi. There is a strong feeling among Muslims, who form around 12-13 per cent of total voters in Delhi, that the BJP is unleashing its Hindutva agenda to teach them a lesson. Though there appears to be a silence among community opinion leaders, it is understood that they will resort to tactical voting in the Delhi Assembly election. This may benefit the Kejriwal government in beating anti-incumbency which, the AAP leader say, does not exist in Delhi. To counter negative perception, the BJP has tweaked its campaign strategy for the Delhi election and adopted the AAP-like electioneering. The BJP leaders are forming small groups and holding corner meetings in each of 70 assembly constituencies. The AAP had gained immensely from this campaign strategy. KEJRIWAL’S POLITICS OF POPULISM On the issues of governance, the BJP is finding hard to counter the freebies offered by the Kejriwal government, which implemented schemes for free water, free electricity for power consumption of up to 200 units, free treatment up to Rs 5 lakh even in private hospitals if the government hospitals cannot provide treatment within 30 days and to improve school education administration. The BJP has adopted the strategy of alleging scam in health and education departments under the Kejriwal government. But the cries of scams seem to have been losing their electoral value in India’s politics. Kejriwal’s populist schemes give it an apparent advantage over the BJP, whose central government has appeared to be in favour of reducing subsidy bills. Incidentally, anti-corruption drive that was the main election plank of the AAP in 2015 is not a talking point in 2020 Delhi Assembly election. The possible reason for the diminished role corruption-free government in Delhi election could be that both PM Modi and CM Kejriwal have built their reputation of non-corruptible politicians. Recently, Kejriwal invoked PM Modi’s anti-corruption drive at a public event. AAP’S SHIFT FROM LEFT TO RIGHT In months after 2015 victory by the AAP in Delhi election, some commentators predicted Kejriwal’s party occupying the space vacated by the Left-oriented parties. Kejriwal advocated greater government funding for schemes of social welfare just like the Left-oriented parties. But in recent months, particularly after the rout that the AAP faced in 2019 Lok Sabha election, Kejriwal seems to have repositioned himself from left of the centre to right of centre in some respects. Kejriwal has been seen portraying his Hindu identity through posting of photographs showing him in performing yajnas (sacrifice) and maintaining silence on issues that have been perceived to be issues of Muslims. His stand on the CAA and protests against it shows that he might by wary of antagonizing Hindu sentiments by seemingly siding with Muslims. Earlier, he supported the Modi government’s Article 370 move in Jammu and Kashmir, and his government prominently advertised the Teerth Yatra programme last year. For the core Hindutva voters of the BJP, Kejriwal does not stand at variance with the ideology. This explains why posters were seen in Delhi recently with slogan -- Modi for Centre, Kejriwal for Delhi. Some of these posters had been undersigned by BJP workers. This has led some to believe that the RSS, too, is not against the Kejriwal government. The connection becomes credible given that Kejriwal joined politics on the back of anti-corruption movement which had strong backing of the RSS. This makes Delhi Assembly election a tougher than anticipated fight for the BJP. And, then there is Congress which has tried to reconnect with the Muslim voters of Delhi during the ongoing anti-CAA protests particularly at Shaheen Bagh. The Congress believes there is sizeable anti-Modi non-Kejriwal vote bank to woo for its revival in Delhi.\nRead | Challenges that Arvind Kejriwal faces in his comeback campaign\nAlso read | Delhi assembly poll: Can a faceless BJP campaign take on Kejriwal? | India Today Insight\nYou may like it | 5 factors that will determine who wins Delhi Assembly election\nMore on Delhi polls | Delhi election: New Arvind Kejriwal strategy to fight BJP without challenging Modi\nWatch | So Sorry: AAP, BJP, Congress battle it out for Delhi elections 2020\n\nEdited By: Prabhash Kumar DuttaPublished On: Jan 16, 2020--- ENDS --- ",
    "datetime": null,
    "url": "https://www.indiatoday.in/elections/delhi-assembly-polls-2020/story/why-modi-wave-and-kejriwal-s-problems-may-not-bring-bjp-back-to-power-in-delhi-1637370-2020-01-16"
}