{
    "title": "Why learning from experience is the educational wave of the future",
    "text": "Dean of Engineering and Professor, McMaster University Ishwar K. Puri receives funding from National Science and Engineering Research Council. He is chair of the National Council of Deans of Engineering and Applied Science and Fellow of the Canadian Academy of Engineering.  McMaster University provides funding as a founding partner of The Conversation CA. McMaster University provides funding as a member of The Conversation CA-FR. View all partners The university experience has changed. It used to be enough for students to spend four years working hard on assignments, labs and exams to earn a useful undergraduate degree that signalled competence and was redeemable for a good job. Employers would spend weeks or months training their newly hired graduates, sometimes in cohorts, shaping their broad knowledge so it could be applied to the specific needs of the company or government agency. Today, in contrast, employers want fresh graduates who they don’t have to train. That means students must learn and apply their knowledge at the same time, inside and outside the classroom, all without adding extra months or years to their studies. After completing their degrees, they are expected to be ready to compete for jobs and jump into working life immediately, without further training. In the ongoing global drive for efficiency and competitiveness, education and training are now seen as the responsibility of the post-secondary sector, where students face a wider set of expectations not only to learn and synthesize subject matter, but to adapt it and put it to use almost immediately. This idea of learning by doing is what is now called “experiential learning,” and though it’s demanding, it is also very effective. It is vital to the mission of all advanced institutions of higher learning, including the one where I am dean of engineering, McMaster University in Hamilton. In class, this method of learning means replacing chalk-and-talk pedagogy of the past with inquiry, problem-based and project-based learning, sometimes using the tools of what we call a maker space   — an open, studio-like creative workshop. These methods recognize that lectures on complex, abstract subjects are difficult to comprehend, and that hands-on, minds-on learning by experience not only makes it easier to absorb complex material, it also makes it easier to remember. Outside class, experiential learning takes the form of clubs, activities and competitions for fun, such as the international EcoCAR competition, converting muscle cars from gas to electric power, or hackathons that see students compete to solve complex technical and social problems. This year at McMaster, experiential learning has been both the competition and the prize as six winners of an extracurricular Big Ideas competition flew off to tour Silicon Valley facilities where they hope one day to work or learn how to start up their own ventures. Experiential learning also means engaging undergraduates directly in high-level research that was once the exclusive domain of graduate students and professors, exposing them to scholarship at the highest level from early in their academic careers. In the community, experiential learning is learning through service, both within and beyond one’s area of study — rebuilding hurricane-damaged communities, for example, or helping at local soup kitchens. We are teaching students not only to be workers who drive the modern economy, but also to be engaged citizens. Work-integrated learning sees students stepping into the actual workplace to get a flavour of what working life is like in their fields, including managing time, working independently, multi-tasking, and adapting to the particular culture and expectations of a specific workplace, all as part of their formal education. We want students to understand and approach the grand challenges and wicked problems facing our world, such as climate change and opioid addiction, which are not solely issues of science or technology, sociology or economics, but complex, layered issues that demand broad thinking and collaboration. We want our students to be innovators. If life in Canada is to improve, especially in the context of challenging trade relationships such as NAFTA, we need a workforce that can address global problems with innovation that is relevant   —technologically, socially, economically, with respect for all cultures and genders. All of this learning drives students to begin thinking and acting with their careers in mind from their very first year of study. Is that fair? It is important to remember that high school has changed too. Students are better prepared than they were a generation ago. By the time they enter university, they are more aware of the new demands on their time and achievements. Much more information is also available about employment and specific employers from portals like Glassdoor, allowing students to make more informed choices about their co-op placements or the permanent employers they will target or reject, based on reputation and organizational climate. We cannot change the fact that the world is more competitive, nor that it takes more to succeed than it used to. What we can do is make sure that the extra work that goes into creating and completing a fully realized university experience is as valuable as it can possibly be. Copyright © 2010–2023, The Conversation ",
    "datetime": null,
    "url": "https://theconversation.com/why-learning-from-experience-is-the-educational-wave-of-the-future-92399"
}