{
    "title": "With K-pop back in spotlight, Korean-American stars take hope | CBC News",
    "text": "Tens of thousands of fans eagerly rode the wave of Korean pop or K-pop this weekend at a convention in Los Angeles, the world's entertainment capital, at a time when a boy band's success in America is giving new hope to many stars in the music genre. Several Korean-Americans were among the performers at the seventh annual KCON, an event for all things tied to \"Hallyu,\" or the \"Korean Wave\" of popular culture. Many Americans were given their first taste of K-pop via the viral success of rapper Psy's music video Gangnam Style in 2012. This year, another Korean act's growing fan base in the United States has K-pop stars, including some who grew up in America, thinking they too could win fame in the United States. In June, the boy band BTS became the first K-pop group to top the Billboard 200 album chart, with Love Yourself: Tear. \"We K-pop artists are really proud of them, because we know how hard it is to make it in the industry,\" Ailee, a U.S.-born K-pop star whose given name is Yejin Lee, said in a phone interview. \"The fact that they opened up those doors and cleared the way for us, it's a huge hope for us,\" said Ailee, who was performing at KCON this weekend. Ailee, whose hit singles include U & I and Heaven, went to high school in New Jersey and grew up listening to Beyoncé​ and Mariah Carey, all while consuming a steady diet of movies and television shows from South Korea. Ailee, 29, said that years ago, when she was trying to find a career in the U.S. entertainment industry, she was told fans would not want to emulate someone like her. \"They told me it's difficult for people who are Caucasian or black or Latino to feel that way toward an Asian person,\" said Ailee, who declined to say which U.S. entertainment companies turned her down. Ailee moved to South Korea nearly a decade ago, and was signed by an entertainment company there. Several other Korean-American performers have also turned to K-pop as their path to music careers. They include several past winners of televised singing competitions in South Korea, as well as members of the groups Girls Generation and Seventeen. K-pop acts sing or rap in Korean, often with snippets of English. Online, where K-pop fandom thrives, many music videos include subtitles. But language was no barrier at KCON, even though most attendees were not of Korean descent. Attendance at this year's event in Los Angeles, which has one of the largest Korean diaspora communities, was expected to exceed the 76,000 who attended last year, organizers said. This year, people of all ethnicities danced in unison to K-pop songs at a \"dance workshop,\" posed for photos with giant emoticons and tried on traditional Korean robes. Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636 It is a priority for CBC to create products that are accessible to all in Canada including people with visual, hearing, motor and cognitive challenges. Closed Captioning and Described Video is available for many CBC shows offered on CBC Gem.  ",
    "datetime": null,
    "url": "https://www.cbc.ca/news/entertainment/korean-pop-convention-la-1.4782237"
}