{
    "title": "Woman turns tables on scammers, gets $50K back",
    "text": "LOUISVILLE, KY (WAVE) - The con started, appropriately enough, on April Fools Day with a message on Erica's answering machine. The Elizabethtown woman asked that we not use her last name because she's still feeling vulnerable about what happened next. Erica said the computerized voice on the other end of the line scared her. \"Ignoring this will be an intentional second attempt to avoid an initial appearance before a magistrate judge and a grand jury for a federal criminal offense\" the message said. Then she did something she now knows she shouldn't have. \"And my head, I can't explain it,\" she said. \"It just went, 'Pick up the phone. You better call.'\" So she did. And people posing as IRS workers told Erica she had to pay thousands of dollars in overdue taxes and fines or face criminal charges. Erica followed their directions. She drove all over town buying handfuls of iTunes gift cards, transferring the value of each one - usually $500 each - into a bank account. They also convinced Erica she had to make two bigger money transfers - one for $13,500 and a second for $17,893. PREVIOUS TROUBLESHOOTER INVESTIGATIONS+ ITT students may get loan forgiveness after school shuts down+ Family loses car, toddler's wheelchair in rising wave of auto thefts+ Forcing city to clean up vacant property may be easier than you think+ Medicaid users wasting millions in ER visits In all, Erica sent the scammers about $50,000 over a 12-day period. She's not alone. By some estimates, seniors nationwide were scammed out of $3 billion last year..\"Our seniors come from a generation that is or has been more trusting,\" Kentucky Attorney General Andy Beshear said. \"They grew up in a time where if someone knew your home phone number, they knew you.\" When Erica pressed for more information about what was going on, the scammers told her they couldn't discuss it over the phone. They claimed it would violate the Electronic Communications Privacy Act, which is really a federal wiretapping law. Instead they told Erica a field agent would come to her house and explain everything in person. He never showed. \"I've been scammed really good,\" Erica remembers thinking at the time. \"And I was like, okay, now I need to face this.\" But where to turn? Erica ended up in the office of the Kentucky Attorney General and found out she had the key to cracking her own case: detailed notes she kept about every phone call, every money transfer, every bank account number. She handed over all her information to the AG's Office of Senior Protection that allowed them to follow the money, right to a bank account of a travel agency in Georgia. Investigators believe scammers in India were funneling money through that travel agency's account without the the owner's knowledge. \"This man didn't know,\" said investigator Lori Farris. \"The owner of the company was very surprised.\" Not as surprised as the scammers likely were when the AG's office was able to freeze the account and get all of Erica's money back. She still remembers the moment the Attorney General handed her that check. \"It was life-changing,\" Erica said, surprised as she broke down in tears describing the moment. \"I thought I was over that.\" Erica said getting scammed doesn't make a person unsophisticated or uneducated. And if it happens to you, she said don't let embarrassment stop you from fighting back or asking for help. The Kentucky Attorney General has started a new program called \"Scam Alerts,\" which provides weekly text and email alerts on the most trending scams. Click here for information on how to sign up. Copyright 2015 WAVE 3 News. All rights reserved. ",
    "datetime": "2016-09-20T17:05:23Z",
    "url": "https://www.wave3.com/story/33136721/tonight-at-11-woman-turns-tables-on-scammers-gets-50k-back/"
}