{
    "title": "Women arrested on multiple charges after making false burglary report",
    "text": "SHIVELY, KY (WAVE) – When Shively police received a report of a burglary in progress, they responded to the scene with lights and sirens. Once they got to the scene they didn't find a burglary, but discovered other crimes. Officers were called to the 2300 block of Rockford Lane around 1:15 a.m. October 22. When they arrived, they were met by a woman outside the home who waived them down and say someone was in. Police checked the house, found no one inside, nothing damaged and said things looked undisturbed. The women told police they had found the garage door wide open and one of them said she saw a shadow in a back bedroom. What officers did notice that the stories of the women, Sonya K. Blanton, 57, and Jennifer Lynn Houtchens, 39, didn't match and kept changing. Police said both appeared to be high on drugs. After being given their rights, police found a bag on the kitchen table containing a white powder believed to be meth. Both women admitted to using meth and eventually told police there had not been a burglary. They said the 47 inch TV set they initially said was stolen had been sold to Blanton's father for $100. In addition to the drugs in the house, police found a syringe and spoon inside Blanton's car and she told police about another bag of crystal meth in her phone case. While responding to the call, one officer suffered minor injuries when he slipped on gravel in the driveway. Blanton and Houtchens were arrested on charges of wanton endangerment, criminal mischief, public intoxication on a controlled substance, possession of a controlled substance and theft by unlawful taking over $500. Blanton faces an additional charge for possession of drug paraphernalia and falsely reporting an incident. Houtchens was also charged with filing a false police report. Copyright 2013 WAVE 3 News. All rights reserved. ",
    "datetime": "2013-10-23T05:04:09Z",
    "url": "https://www.wave3.com/story/23762331/women-arrested-on-multiple-charges-after-making-false-burglary-report/"
}