{
    "title": "Wonder Girls’ Yubin Gives Updates on Her Career, Relationship With Band Mates & More – Billboard",
    "text": "Check out Wonder Girls' Yubin had to say about a potential solo career, her relationship with her band mates and more below in this exclusive Q&A. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin Justin Thorne’s K-pop remix of new single “The Heartbroken” featuring Yubin of Wonder Girls marked the first new material from the girl group superstar in more than six months and her first time rapping in English in years. Even with the rapper laying low during Wonder Girls’ hiatus, fans immediately sent the track to No. 1 on the real-time Billboard Twitter Emerging Artist chart where it remained high all week. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t04/15/2015\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tExplore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tYubin\t\t\n\t\t\t\t\t\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news Exclusive Video Premiere: Justin Thorne & Yubin Enlist Their Fans for ‘The Heartbroken (K-Pop Remix)’ Earlier this month, Billboard premiered its accompanying music video and got the chance to find out what else Yubin’s been up to past laying down verses. Check out what she had to say about a potential solo career, her relationship with her fellow Wonder Girls and more below in this exclusive Q&A.  How did you and Justin connect for “The Heartbroken” remix? I met Justin in L.A. back in 2012, 2011 when I was shooting my movie. I met Justin at a Korean restaurant through a friend and I had dinner with him. We talked about K-pop, music and we got close; especially on Twitter because [Wonder Girls] were in New York and he was in L.A., so we didn’t really get to see each other. Numerous times, he said he wanted to work with me and he offered if I could feature on his track. I was so thankful and I was honored that I was part of the project. What was it like rapping in English again? It’s been like two years since I’ve rapped in English, but I listen to a lot of hip-hop and R&B in English and I follow the trends, so it wasn’t too difficult. I did have a hard time in the beginning, but it was fine.The remix got a huge reaction when fans heard you, going to No. 1 on the real-time Twitter charts. Did you anticipate such a big response? It was really nice to see the reaction from the fans, how I came back and featured on Justin’s track. I wasn’t expecting a huge reaction, but I had a lot of fun working with him and in the future if there’s another chance to work with Justin, I’m more than glad to work with him. That leads into my next question, does this remix mark an upcoming solo career for you? Will you keep recording collaborations? So, I’m happy that I had the opportunity to work with Justin and if I have a chance to do a solo career, yeah, I’m more than happy to do it. I’m always working and developing whatever skills I have. Yes, I’m up for doing any collaborations that I can and I’m happy that I can spread my talent and my music to my fans, and be able to share with them. Yeah, if there’s an opportunity, yeah, I’m more than happy to be doing it.  I loved that song you did with Ivy in 2012, “I Dance.” Oh thanks, I love that song too. You really are one of the leaders of K-pop’s international expansion. Today, there’s more albums on the charts and more concerts here than ever. How do you feel seeing how far it’s come now? I’m really glad that I’m one of the artists that spread the K-pop and hallyu [the Korean wave] all around the world. I hope to spread that in the future as well and I’m happy that I was a part of that. It’s surprising how K-pop got big and I wish that it goes on, and in the future I want to be a part of it as well. Wonder Girls Cover B.o.B / Bruno Mars: The Poll Winner! As someone who’s been in the scene awhile. What acts get you excited today? Who gets the Yubin stamp of approval? [Laughs.] Right now I’m into this guy HyukOh because I like the band sound but of course, I root for GOT7, and Jimin and Yerin from 15&. I’m rooting for all the artists from JYP like GOT7, Jimin and Yerin, and then I also like HyukOh.Speaking of your JYP label mates, have you spoke with your Wonder Girl band mates? Do you guys all keep in touch still? Actually, we are living together. Oh really? Yenny, Lim and Sunmi — we are living together, so I actually saw them like 10 minutes ago [Laughs.] I see them everyday. Sohee, she visits the apartment a lot. She actually came over three days ago and I see her often as well. Also, Sun, we talk all the time through the phone because she’s not in Korea. But we all stay in touch. That’s great to hear and, even though you’re all young, you’re 26, you really have a ton of wisdom. Do you have advice to have for someone who’s considering entering the K-pop world? As someone who didn’t make it through a lot of auditions, I had a lot of tryouts and after all those tryouts, I made it to the Wonder Girls. It’s important to know your goals and what you dream for and what you want to follow. But at the same time, don’t be too depressed if you don’t make it. You just have to keep trying if you really want something.  You need to know what your limit is and try to develop from there. I wasn’t down because I didn’t make it into a certain company; I’m glad I made it to the Wonder Girls and now I’m here. No one should be depressed if you they don’t make it. If they really want it, they should keep trying.  Anything add? I haven’t really been too active these days, but I’m glad I got to interact with my fans and was able to work with a great artist, Justin; a great artist and a friend. I’m really happy I got the chance to work with him through this opportunity. I’m going to try to meet my fans as soon as possible, very soon, so keep your eyes out. Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2015-04-16T01:20:58+00:00",
    "url": "https://www.billboard.com/music/music-news/wonder-girls-yubin-interview-heartbroken-remix-instagram-6531890/"
}