{
    "title": "Woodside Energy builds $500k supercomputer - Hardware - iTnews",
    "text": "Woodside Energy is investing an initial $500,000 in a Xeon-powered supercomputer that will be put to work crunching seismic data to improve the accuracy of oil and gas exploration efforts. The energy giant is aiming to have a machine that boasts 0.118 Petaflops of processing power by the end of the year, before potentially scaling up to a true Petaflop-scale supercomputer by around 2015. A Petaflop computer can perform over one quadrillion operations per second. For comparison, the current number one supercomputer in the world, China's Tianhe-2, is benchmarked at 33.86 Petaflops. A Woodside spokesperson confirmed to iTnews the initial investment that the company has made in the system, as well as the initial specifications. \"It is an Intel system with 110 Xeon E5-2670 processors (880 cores in total),\" the spokesperson said. \"We are currently in the process of adding accelerator hardware to each of the 55 nodes, most likely NVIDIA Tesla GPUs [graphics processing units].\" The supercomputer has been named Moordiup, an Aboriginal word meaning 'fast'. It is initially going to be put through its paces to resolve a geophysics challenge known as full wave inversion (FWI), according to subsurface technology chief scientist, Tom Ridsdill-Smith. \"The idea is for us to test FWI on a small scale and also to test the hardware with the intention that if we can get all these things to work we will expand Moordiup to a Petaflop-scale machine which we think we'll need for a production environment by about 2015,\" Ridsdill-Smith said in a recent edition of Woodside's internally-published magazine. According to Ridsdill-Smith, FWI takes 3D seismic data that would otherwise be discarded when creating geological models and uses it to more accurately model where oil and gas reserves exist. Woodside is already tapping universities and other external skills to test FWI on the interim build of the supercomputer. The company is sponsoring a professorship at the University of Western Australia that will put post-doctoral resources to work on Woodside projects. It has also brought in geophysicist Tenice Nangoo to apply Moordiup's compute power to FWI until the end of this year. Woodside's spokesperson said that prior to Moordiup, the company did not have the compute capacity to perform \"advanced seismic processing\". \"Previously we did mainstream seismic processing with external service providers,\" the spokesperson said, without revealing the identity of its compute partners. ",
    "datetime": null,
    "url": "https://www.itnews.com.au/news/woodside-energy-builds-500k-supercomputer-363664"
}