{
    "title": "World’s Largest Anamorphic Illusion in Seoul | Hypebeast",
    "text": "Digital technology company d’strict recently completed an installation of what is being described as the world’s largest anamorphic illusion in Seoul’s Coex K-Pop Square. Titled Public Media Art #1_ WAVE, the massive outdoor projection features crashing waves taking up the sprawling, curved screens located on the facade of the SMTown Coex Artium. These digital billboards measure 80.8 meters in width and 20.1 meters in height. They are roughly “four times the size of a basketball court in Seoul,” reported The Korea Herald. The SMTown Coex Artium is part of the Coex Convention and Exhibition Center in Seoul’s upscale neighborhood, Gangnam. d’strict specializes in developing site-specific experiences using an array of digital techniques. For the Gangnam installation, the studio utilized a series of anamorphic illusion methods to convey the visuals of massive waves. The way the effect works is that it’s comprised of specific vantage points to create a sense of depth without any distortion.\nCheck out the Public Media Art #1_ WAVE installation in the video above and then view more projects on d’strict’s Vimeo page.\nElsewhere in art, watch Daniel Arsham take his Ash & Pyrite Eroded Porsche for a spin.\nSMTown Coex Artium\n513 Yeongdong-daero\nSamseong 1(il)-dong\nGangnam-gu, Seoul\nSouth Korea\n\n\n                                                                                                    \n\n                                                            Read Full Article Check out the Public Media Art #1_ WAVE installation in the video above and then view more projects on d’strict’s Vimeo page.\nElsewhere in art, watch Daniel Arsham take his Ash & Pyrite Eroded Porsche for a spin.\nSMTown Coex Artium\n513 Yeongdong-daero\nSamseong 1(il)-dong\nGangnam-gu, Seoul\nSouth Korea\n\n\n                                                                                                    \n\n                                                            Read Full Article Elsewhere in art, watch Daniel Arsham take his Ash & Pyrite Eroded Porsche for a spin.\nSMTown Coex Artium\n513 Yeongdong-daero\nSamseong 1(il)-dong\nGangnam-gu, Seoul\nSouth Korea\n\n\n                                                                                                    \n\n                                                            Read Full Article SMTown Coex Artium\n513 Yeongdong-daero\nSamseong 1(il)-dong\nGangnam-gu, Seoul\nSouth Korea\n\n\n                                                                                                    \n\n                                                            Read Full Article     Gain access to exclusive interviews with industry creatives, think pieces, trend forecasts, guides and more. We charge advertisers instead of our readers. Support us by whitelisting our site. Whitelist Us Already whitelisted us?\n                        \n                            Refresh page ",
    "datetime": "2020-05-18T11:02:34-04:00",
    "url": "https://hypebeast.com/2020/5/dstrict-wave-anamorphic-illusion-seoul-south-korea"
}