{
    "title": "World's first refrigerator with built-in coffee maker to be built in Louisville",
    "text": "LOUISVILLE, KY (WAVE) - GE and Keurig have teamed up to create a first: a refrigerator with a built-in maker that will be built at GE Appliance Park in Louisville. The GE Cafe Series refrigerator with Keurig K-Cup Brewing System features a hot water dispenser paired with a Keurig K-Cup single-cup brewer. [LIST: Highest-paying jobs in Kentucky] Innovation and technology are pairing up as GE hopes to take consumer convenience to a whole new level. \"In 2013 in our GE Café Series Refrigerator, we introduced the industry's first refrigerator that dispensed cold and hot water out of the refrigerator,\" Dan Goldstein, GE Refrigeration Marketing Manager. Now it is on to coffee, tea, hot cocoa, any of your Keurig K-Cup favorites can be made right next to your ice and cold water dispenser. \"What we are talking about here this new innovation and partnership with GE is an entirely new opportunity to save some counter space and give consumers that single cup experience right from the refrigerator door,\" said Ben Yoder, Keurig Director of Strategic Partnerships. Because the water can take about four minutes to heat up to make life a little easier for those on the go, there's an app for that. \"We are going to have an app available on your phone, iPad, or mobile device that you can now program your refrigerator to be ready to go at 6 am,\" said Goldstein. Production in Louisville is set to begin this summer around the same time the sale of Appliance Park to Electrolux is expected to be finalized. \"As far as whether or not it will be moved out of here after Electrolux closes the sale, I really don't know,\" said Goldstein. \"I can't speak to that.\" For now, though GE says they are business as usual always thinking of the next big thing. The GE Cafe Series refrigerator with K-Cup Brewing System will be available in stainless steel during the third quarter of 2015 at the manufacturer's suggested retail price of $3,300. Copyright 2015 WAVE 3 News. All rights reserved. ",
    "datetime": "2015-01-14T23:08:07Z",
    "url": "https://www.wave3.com/story/27849401/worlds-first-refrigerator-with-built-in-coffee-maker-to-be-built-in-louisville/"
}