{
    "title": "Y-Speak: The expensive life of a K-Pop fan",
    "text": "K-POP or Korean Pop is now a hit in this generation. Many people are now into this type of music genre. It is all over the world now. Because of its distinctive melody and sick synchronized choreography.It is also the reason why K-Pop which is the heart of Korean Wave or also known as Hallyu Wave grew such popularity that made it into a global phenomenon. Now the question is how it is like to be a K-Pop fan? To be specific, an international K-Pop fan.A K-Pop fan’s life is easy when you are based in South Korea. For an international fan like me, it is very difficult and very expensive because there are a lot of things that are needed to be considered. In buying official goods or merchandises, its price is already expensive plus you need to think about the shipping fees. K-Pop life is very demanding. The satisfactory level of being a K-Pop fan is high and luxurious.How is it very expensive? From albums and concert DVDs, concerts, fan events, and official merchandises. Albums can go up to 15,000 Korean Won (KRW) or 13 US Dollars (USD) which is equivalent to 650 to 700 Philippine Peso (PHP). Take note that it is only for one version. Most of the albums now have more than one version. It is already that expensive and you also need to pay for the shipping fee since you live outside South Korea.For the concerts and fan events. Most of the K-Pop companies earn the most from concerts and tours. They do not just sell concert tickets but also official merchandise during the event too. The most expensive concert that happened here in the Philippines is the 2019 World Tour BLACKPINK In Your Area in Manila. Ticket of this concert can go up to P19,750 which is more expensive than concerts that are held in South Korea and Japan.Lastly, for the official merchandises, those are officially sold from entertainment companies which include key chains, light sticks, shirts, calendars, photo books, and stuffed toys. Some merchandises are made by the fans for the fans. There are these people called fansites which most of them are full-time fanatics that follow idols/artists in every event they go and taking pictures of them to create fan goods and earn from it.All of these things describe how K-Pop life is expensive. The satisfaction it gives to us is very indulging. If you don’t have the capabilities to buy all of these, you can still be a K-Pop fan. As long as you support and love them and they can give you happiness, it is fine. (Vince Eugene Suaner, UM AB English intern) Follow Us ©Copyright 2023 SunStar Publishing Inc. Powered by Quintype ",
    "datetime": null,
    "url": "https://www.sunstar.com.ph/davao/weekend/y-speak-the-expensive-life-of-a-k-pop-fan"
}