{
    "title": "YELL Bangkok and INNOCEAN signs MOU to accelerate K-invasion opportunities in Thailand",
    "text": "Infusing Thai creativity into the K-wave in the region to create new opportunities BANGKOK, Dec. 2, 2022 /PRNewswire/ -- YELL Bangkok, Thailand's first network agency, collaborates with INNOCEAN, a global marketing and communications brand, as a new business development partner for the Thailand market. The MOU signed by Dissara Udomdej, CEO of YELL, and William Lee, Global CEO of INNOCEAN, in Bangkok today cements a collaboration for knowledge exchange, data, and resources to generate new businesses in Thailand. Pooling INNOCEAN's K-Experience and YELL's Thai creativity with shared Thailand data insights, the new partners are confident of the creative imprint this will lead to in the very near future. \"This is a new business we will explore while leveraging our combined experiences. Without limiting our scope to the advertising industry, we will go beyond by focusing on creativity to connect with our clients and partners. Working with INNOCEAN will further open a tremendous treasure from the K-Experience experts to create vast opportunities in the region,\" Dissara explained. INNOCEAN was founded in South Korea over 17 years ago and gained fame through its high capabilities through creatives from production to customer experience marketing of K-experience. The partnership will contribute to the expansion to help lower the barrier for Korean fashion, food, and game brand to enter Thailand's market. K-Wave trends have been a major success around the world in recent years, particularly in South-East Asia, a developing market with approximately 700 million people that presented numerous opportunities. The advertising industry has transformed significantly in recent years. Many new independent agencies have discovered that new services are more focused. Network agencies have acquired many small technology companies for the group. It represents the growth of the agency industry in a highly competitive environment. In the digital era, no one knows what will happen. What's most exciting is how they're dealing with the different worlds and the fast pacing of changes. About YELL Group www.yellbkk.com Established in 2009, YELL is an independent advertising and digital creative agency pushing the boundaries of how organizations connect with audiences. Headquartered in Bangkok with an arm in Singapore and an alliance in Shanghai, China, YELL delivers impactful strategies while overcoming clients' challenges. SOURCE YELL Bangkok ",
    "datetime": null,
    "url": "https://finance.yahoo.com/news/yell-bangkok-innocean-signs-mou-053900198.html"
}