{
    "title": "Young Japanese Seek K-Pop Stardom in South Korea",
    "text": "Print No media source currently available  K-pop music is popular in many countries. This popularity has led to a number of young people leaving their home countries and going to South Korea - the center of the K-pop universe. Industry experts estimate there may be up to one million music hopefuls seeking stardom in South Korea. Most of these young men and women are South Koreans. But a growing number come from Japan, where K-pop has a huge following. One such K-pop wannabe is 17-year-old Yuuka Hasumi. She delayed her high school education in Japan in February and instead went to South Korea in hopes of becoming a star performer. Hasumi knew this decision meant her life in South Korea would not be easy. She would need to spend long hours working on her voice and dance moves. There would be little time for social activities. This meant giving up much of her privacy, having no boyfriend and little or no use of her telephone. The young woman signed up to attend the Acopia School in Seoul, a preparatory school offering young Japanese a shot at K-pop fame. Acopia teaches students the songs and dance moves, as well as the Korean language. Such training programs are the first step for Hasumi and others trying to prepare for an intensely competitive series of auditions. All the music hopefuls dream of getting invited to perform for major talent agencies. In the end, the agencies accept only a small number of “trainees” to shape into possible stars. It is difficult, Hasumi told a Reuters news agency reporter after one of her dance class workouts. She attended the class with Yuho Wakamatsu, a 15-year-old friend from Japan. Hasumi is one of about 500 Japanese who join the Acopia School each year. The program costs up to $3,000 a month. The cost includes training activities and a place to stay. The school can organize auditions for its students with talent agencies. Industry experts say the auditioning process has fueled a “Korean-wave” of pop culture that has spread worldwide over the past 10 years. One of the biggest K-pop groups to explode into stardom was the South Korean boy band BTS. “They’re nuts about BTS over there in Japan,” said Lee Soo-chul, who belongs to the Seoul-Tokyo Forum. The private group has members from the Japanese and South Korean diplomatic and business communities. K-pop’s huge popularity in Japan comes at a time when relations between South Korea and Japan have experienced difficulties. Relations have been hurt by South Korean court rulings against Japanese companies for carrying out forced labor during Japan’s 1910-1945 colonization of Korea. Many South Koreans believe Japanese officials have not done enough to take responsibility for Japan’s colonial past. But Lee says K-pop groups and well-known Korean musicians keep performing to large, sell out crowds throughout Japan. “There is no Korea-Japan animosity there.” ​Rikuya Kawasaki is a 16-year-old Japanese K-pop star hopeful. “I might get criticized for being Japanese, but I want to stand on a stage and make (South Koreans) know Japanese can be this cool,” she told Reuters. Many schools and talent agencies attempt to find new recruits in Japan because it is the second largest music market after the United States. Some Japanese have already made it big in K-pop. The three Japanese members of the girl band Twice helped make the group a success. Twice is now the second most popular band in Japan, after BTS. Yuuka Hasumi is hopeful that K-pop can be good for relations between the two countries. “It will be good if Japan and South Korea will get along through music,” she said. I’m Bryan Lynn.  The Reuters news agency reported this story. Bryan Lynn adapted it for VOA Learning English. George Grow was the editor. We want to hear from you. Write to us in the Comments section, and visit our Facebook page. _____________________________________________________________  audition – v. give a short performance to try to get a job as a singer, dancer, etc. band – n. a group of singers or other musicians nuts – adj. mad or unsound; crazy animosity – n. a feeling of hatred or anger toward someone stage – n. raised platform on which people perform recruit – n. someone who has recently joined an organization   ",
    "datetime": null,
    "url": "https://learningenglish.voanews.com/a/young-japanese-seek-k-pop-stardom-in-south-korea/4910468.html"
}