{
    "title": "Your Guide to the Latest Wave of K-pop Boy Bands",
    "text": " Things you buy through our links may earn Vox Media a commission. K-pop still exists on the periphery of America’s pop music scene, but it’s had a banner year in the U.S, and Korean boy bands are largely responsible for that. With male K-pop acts holding more concerts Stateside than ever before, and boy band BTS making their presence known in the American music market by breaking Billboard records, working with the Chainsmokers and Steve Aoki, and performing at the upcoming American Music Awards, the Korean invasion is most definitely here. For many international music watchers, this is nothing new; K-pop has steadily attracted millions of fans globally, and become a mainstay of what is known as the “Korean Wave,” or Hallyu, a stream of Korean pop culture into international markets. Aimed less at Korean listeners and more at international audiences as a form of cultural export, many of the most experimental K-pop songs are crafted by international songwriters in collaboration with Korean teams. This push for a sound that is able to attract global listeners has resulted in pop confections that transcend genre limitations in an effort on the part of the songwriters to appeal to the most people possible. But with dedicated audiences living primarily in internet spaces, K-pop has spent the past decade struggling to gain momentum in the U.S. There’ve been a few moments that made it seem like K-pop was finally about to break through, but, despite multiple attempts to cross over from some of Korea’s most prominent musicians, that has yet to really happen. Top Korean stars, including soloists Se7en and BoA and the girl group Wonder Girls, halted their careers in Asia to focus on the American market and release English-language albums; supergroups like 2NE1, Girls’ Generation, and BIGBANG garnered attention through television appearances, ads, and American collaborations. Several artists have even been able to get some radio play. But consistent mainstream American followings still proved elusive. The same music and packaging that saw success throughout much of the world didn’t resonate with American audiences, and after minimal interest, everything Korean artists achieved in the U.S. eventually fizzled out. But now, BTS and other Korean boy bands are making major headway and gaining traction among pop music listeners. Fiercely loyal fans have have used social media to mobilize. Propelled by social-media accounts dedicated to their favorite acts, K-pop fans rally around a variety of independent campaigns to promote their favorite artists. Whether it’s through creating streaming goals on YouTube videos or using a hashtag so frequently that it trends on Twitter, K-pop fans in 2017 act as unofficial international marketing teams for their favorite artists. Fan bases on social-media platforms have hundreds of thousands, if not millions, of followers looking to get the latest news (often translated), and get involved in ways to help get their group’s name out there. It has paid off: this year has seen a surge in coverage of all things Korean boy band, with streaming platforms, particularly Apple Music, beginning to grow its K-pop-related content. Even television is getting in the game, with a recent campaign by BTS’ fan coalition ARMY helping the group score an invite from The Ellen DeGeneres Show. The lightning-paced K-pop industry allows for only a few heavyweight boy bands to make their mark each year, ranging from the up-and-coming to those that have already solidified their place after years in the industry. Many of them are helping to fill the One Direction–size void in America’s pop scene, with K-pop’s latest crop of boy bands drawing U.S. fans in through their precisely crafted music and glossy personas. BTSBest described as: The voice of millennial reality Listen to: “Blood, Sweat & Tears” & “Dope” Backstory: BTS’s seven men came out with rebellious lyrics about going against South Korean societal expectations and pursuing their individual dreams. They’ve since switched gears and softened their sound a bit, with more recent singles hewing closer to romantic synthpop. However, BTS still releases numerous tracks critical of Korean society and modern-day life in general. This boy band has three rappers (Rap Monster, Suga, and J-Hope) and four vocalists (Jin, Jimin, V, Jungkook), many of whom have a heavy hand in crafting the act’s sound and style. Reception: Winning over fans through their music and affable personalities through a group Twitter account and hundreds of videos on the band’s YouTube channel, BTS’s fandom, called ARMY, is a huge part of their success. With 9.6 million followers on Twitter and over a billion combined views on their official music videos, ARMY has supported the boy band at every step; they’ve helped push BTS to become Korea’s most prominent musical act in the American market since Psy released “Gangnam Style” in 2012. In September, they made history when Love Yourself: Her became the first-ever K-pop album to reach the Top 10 of the Billboard 200. With growing interest from American media following their recent successes and collaborations with the Chainsmokers, Steve Aoki, and Desiigner, it’ll soon be almost impossible to avoid BTS. EXOBest described as: Reigning leaders of a K-pop generation Listen to: “Growl” & “Ko Ko Bop” Backstory: Put together by K-pop behemoth SM Entertainment, EXO was introduced with a cosmic backstory: Each member of the group was an extraterrestrial being with a distinct superpower. The boy band was originally created to be two distinct acts — EXO-K and EXO-M — made up of six members each, aimed at releasing the same music in Korean and Chinese music markets simultaneously, though they quickly joined together as one 12-member team. Despite three out of four Chinese members leaving to pursue solo careers, EXO has maintained its status as one of the most popular groups in Asia since their hit “Growl” launched them to the top tiers of the K-pop world in 2013. Reception: There’s something for everyone in the nine-member group, each of whom brings his own skill set and handsome face to the stage. Over the years, their EXO-L fan base has helped the boy band become one of South Korea’s best-selling musical acts ever, and their American fans are similarly loyal. EXO held Stateside arena tours in both 2016 and 2017, and continues to impress on Billboard charts. GOT7Best described as: Multinational fan favorites Listen to: “Fly” & “If You Do” Backstory: Produced by one of South Korea’s biggest entertainment labels, JYP Entertainment, GOT7 is a K-pop group built for the age of globalization, with members from Korea, Hong Kong, Thailand, and the U.S. After making a name for themselves with bombastic singles, the septet moved turned toward a mellower sound on their new album, 7 For 7. Reception: Though they’ve had a handful of stellar releases, GOT7 never made a true impact on the K-pop industry in Korea, even though great songs like the quirky “Just Right” and the sleek “If You Do” have shown immense potential for just that. Even so, with several songwriting members and a true character in deep-voiced rapper Jackson Wang, who has become a popular television personality in both Korea and China, the seven men have built up a dedicated following. The group’s trio of English speakers — including California-born Mark — has helped the band connect with American fans. Monsta XBest described as: Finely tuned with an aggressive edge Listen to: “Hero” & “Trespass” Backstory: Formed through No Mercy, a 2014–2015 show where competitors faced off to make it into the next group organized by Starship Entertainment, former home to the widely popular, now-defunct, girl group SISTAR, Monsta X has developed a propulsive sound and packaged its singles with dark, occasionally dystopian, music videos. But, like any good K-pop boy band, they also have their sweet moments, including last summer’s melodic “Newton.” Reception: Handpicked by Korean fans, Monsta X’s members have relied on their diverse skill sets to impress in a variety of fields. Through their powerful, often-acrobatic, body-roll-heavy choreographies, the group’s sex appeal has cast them a mature alternative to many of K-pop’s more youthful boy bands. Don’t worry, though, they’ve let their dorkier sides show during television appearances and livestreams on the increasingly-popular Naver V App, a Korean streaming platform used by many K-pop stars (including the majority of acts on this list). NCT (127, Dream, U) Best described as: The ultimate K-pop experiment Listen to: “My First and Last” by NCT Dream, “Cherry Bomb” by NCT 127, “7th Sense” by NCT U Backstory: NCT — or Neo Culture Technology — is the umbrella name for the latest batch of boy bands from SM Entertainment. Their business model is unique: different members perform under the same name, in an effort to create a timeless, multifaceted group that can appeal to different demographics all over the world. U was the first group, and introduced some of the key NCT players, but has been inactive since its debut in 2016. 127 is the Seoul-based team that emphasizes musical eclecticism, and Dream is the youth-focused group, whose members age out when they turn 18. Reception: Dream has gained a lot of attention in Korea with their funky throwback track “My First and Last,” while 127 is one of the most promising K-pop rookie boy bands to grace the U.S this year, with performances at KCON 2017 NY and LA, along with an appearance at KCON Mexico, bringing out ardent NCTzen’s to cheer on the nine-member boy band. They’ve even held intimate fan-meets and appeared on American radio shows, a rarity for any K-pop act, but doable thanks to two North American members in the group: Johnny hails from Chicago, and Mark is from Vancouver. Even if fans can’t see them in person, NCT’s members are extremely active on multiple group-oriented social-media accounts, and the teams have shared some of the biggest moments of their careers with fans through a variety of web series. Nu’Est (W)Best described as: Late-blooming electropop crowd pleasers Listen to: “Hello” & “Overcome” Backstory: Everyone loves an underdog story. The quintet made waves in 2012 when their first single “Face” gained attention for its anti-bullying message, and defied boy-band stereotypes through member Ren’s gender-fluid appearance. But after seeing success with the ballad “Hello,” the group struggled to find a place in the industry and has become all but irrelevant in recent years. When four members appeared on this year’s Produce 101 as a veteran group competing against fresh-faced idol trainees, they charmed audiences, and gained an immense following overnight. Though only member Hwang Min-hyun made the final cut, and he has since taken a hiatus from Nu’Est to participate in Wanna One (see below), the four other members have topped Korean charts with their new single “Where You At,” under the moniker Nu’Est W, emphasizing their “wait” for Hwang to complete their quintet. Reception: Nu’Est’s members’ skills and impressive take on vibrantly layered electropop has gained long-overdue recognition over the past few months. They haven’t been to the States in a few years, but do have a major following in K-pop social-media circles. SeventeenBest described as: Large in size, lofty in musicality Listen to: “Very Nice” & “Don’t Wanna Cry” Backstory: Confusingly, Seventeen is a 13-member boy band. They garnered a lot of attention early on for their upbeat, funky singles. Woozi and Hoshi in particular have gained renown, with each writing some of the group’s most popular songs and the latter also choreographing for the team. Split into three subunits (vocal, hip-hop, and dance), the boy band uses its immense numbers to produce impressive performances that turn the mass into one cohesive unit, while also emphasizing individual members through smaller projects. Two years into their career, they’ve begun to shift toward a mature, electronic sound on several songs, including their single “Don’t Wanna Cry,” which had enough similarities to the Chainsmokers and Coldplay’s “Something Just Like This” that Seventeen’s agency later granted copyright credits to both bands to avoid further legal troubles. Reception: Utilizing their size and varied skill set to attract fans across the K-pop spectrum, Seventeen has become one of the most prominent rookie Korean boy bands. The artistic nature of their releases — whether it’s the sharp choreography from their dance unit or the sentimental vocals from the group’s primary singers — has rapidly made them major players in the American K-pop scene. Only two years into their career, they closed out one night of KCON 2017 LA, a spot usually reserved for the most popular performers. Wanna OneBest described as: The “blink and you’ll miss it” “It” group Listen to: “Energetic” & “Burn It Up” Backstory: The 11-member Wanna One is a temporary group put together by the television show Produce 101. Known as the “Nation’s Idols,” each of the men competed against more than 100 other hopefuls to make it to the top. But the clock is ticking on their career as a cohesive unit: made up of members signed to different Korean entertainment labels, the group will disband at the end of 2018, and each idol will return to his original company. In the meantime, they’re killing it: their debut album, 1X1=1 (To Be One), topped charts in Korea, and their upcoming album 1-1=0 (Nothing Without You), set for a November 13 release, is expected to do just as well. Reception: Though the members were chosen by Korean television audiences, Wanna One’s popularity in the States has taken the intensity of K-pop to another level: when they attended KCON in Los Angeles this summer, security nearly cancelled events with the group because of how frenzied fans became. Though they have a time limit on their lifespan, Wanna One’s individual members are so popular that they’re alredy pegged to be the leaders of the next generation of K-pop boy bands. Things you buy through our links may earn Vox Media a commission.                 ",
    "datetime": "2017-11-13T16:19:25.059-05:00",
    "url": "https://www.vulture.com/2017/11/your-guide-to-the-latest-wave-of-k-pop-boy-bands.html"
}