{
    "title": "\r\n‘Doctor Stranger’ gets 100m views in China: What’s the key to its success?",
    "text": "Most Popular G-Dragon booked for drug use South Korea, Qatar agree to elevate ties, forge $4.6b industry partnership Former Olympic hero battles rumors surrounding her groom-to-be S. Korea goes all out to contain lumpy skin disease Yoon pitches S. Korea's investment appeal to Middle East Yoon meets Park, honors father in gesture of conservative unity 4-meter deep sinkhole injures 1 in central Seoul [News Focus] A year after Halloween crowd crush, legislation remains stalled Olympic medalist ‘tricked’ by fiance-turned-stalker Braving wind and high water to celebrate Dokdo Day Start your day with a roundup of key stories from The Korea Herald with news and comment on all that’s happening in Korea. Published : May 30, 2014 - 14:34 Link copied  Korean SBS drama “Doctor Stranger” has gained popularity throughout China, with the number of hits surpassing over 100 million as of May 30, Chinese video outlet Youku Tudou revealed.The success of “Doctor Stranger” is mainly attributed to the star power of the two male leads, Park Hae-jin and Lee Jong-suk.Park Hae-jin gained Chinese stardom with the success of SBS drama “My Love from the Star.” Park played Lee Hwi-kyung, the son of a business tycoon, who bears innocent and pure love toward Cheon Song-yi, played by Jun Ji-hyun.Park has starred in four Chinese dramas including “Qian Duo Duo‘s Marriage Story,” and “Another Kind of Splendid Life.” He is also expected to participate in another Chinese drama “Men 2” this year.The drama “Doctor Stranger” also revealed Park’s excellent Chinese skills in the eighth episode, with famous Chinese actor Zhang Liang appearing in a cameo.Actor Lee Jong-suk is also beloved by many Chinese fans with his latest works “School 2013” and “I Hear Your Voice,” that hit jackpot in audience ratings at home and overseas.Along with the immense popularity of the drama “Doctor Stranger”, other Korean dramas are gaining popularity in China as well, broadening the scope of the Korean wave. By Kim Min-jin, Intern reporter (minjin103@heraldcorp.com)[Photo Credit: SBS]  The Korea Herald by Herald CorporationCopyright Herald Corporation. All Rights Reserved.  ",
    "datetime": "2014-05-30T14:32:36+09:00",
    "url": "https://www.koreaherald.com/view.php?ud=20140530001069"
}