{
    "title": "‘Frozen’-Crazy South Korea Spawns Countless K-Pop Covers of ‘Let It Go’ (Video) – The Hollywood Reporter",
    "text": "Subscribe for full access to The Hollywood Reporter Subscribe for full access to The Hollywood Reporter The Oscar-winning animated film has become a phenomenon in the country, crushing local box-office records, topping the music charts and inspiring a wave of K-pop covers on YouTube. By \n\n\tLee Hyo-won SEOUL — Disney’s Oscar-winning animated film Frozen has become nothing short of a phenomenon in South Korea. Since its local release on Jan. 15, the film has grossed more than $75 million here, making South Korea the movie’s most successful market outside the U.S. It has also sold more than 10 million tickets — a record for an animated film in the country — meaning approximately one in five South Koreans have watched Anna on her adventure to break the wintery spell.  OSCARS VIDEO: Idina Menzel Belts Out ‘Frozen’ Showstopper ‘Let It Go’  “I believe the film’s Broadway musical appeal attracted audiences,” said prominent local film critic Jeong Ji-ouk, noting the popularity of live musicals in Korea.  On Monday, the Frozen soundtrack topped local music charts. The popularity, and ubiquity, of the Disney hit has inspired many of the country’s most popular K-pop stars — along with waves of fans — to release their own YouTube versions of the film’s Oscar-winning single, “Let It Go.” See below for a sampling of some of the most popular and impassioned K-pop covers so far. First, the official version. Hyolyn (aka Hyorin) of top girl band Sistar sung on the soundtrack for the Korean release of the film, appearing during the end credits of Frozen in cinemas here. The video has been posted several times to YouTube, collectively scoring several million hits.  Singer Sonnet Son‘s (aka Son Seung Yeon), winner of Voice Korea Season 1 attracted some 2.7 million views for her version. “It’s all thanks to you, thanks!” the 20-year-old tweeted to fans. Son recently decided to take a break from her studies at the Berklee School of Music (where her fellow K-pop star Psy also studied) to tour in South Korea.  Other covers by popular Korean singers creating buzz among fans include those by Ailee (below), Lee Haeri of pop duo Davichi and Kim Bohyung of girl group Spica.   Some covers by rather obscure singers, such as Jung A Young of Vivid and Dia of Kiss and Cry (below), have helped revive careers. Dia’s studio version has been viewed over 1.2 million times on YouTube.  Also garnering attention from Frozen fans is an instrumental version by South Korean YouTube star guitarist Jung Sungha (2.14 million views).  There also is a video of figure skating champion Kim Yu-na‘s 2010 Olympic Gold-winning free skate program, with “Let It Go” swapped in for the original Gershwin score. Kim is affectionately called the “Ice Queen” in Korea and wears a blue dress in the sequence that has been compared to the character Elsa’s.  Related Stories\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tRelated Story\n\t\t\t\n\n\n\n\t\n\t\t\n\t\t\t\t\tOscars: Idina Menzel Belts Out 'Frozen' Showstopper 'Let It Go' (Video)\t\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tRelated Stories\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tRelated Story\n\t\t\t\n\n\n\n\t\n\t\t\n\t\t\t\t\t'Frozen' Crosses $75 Million in South Korea, Breaks Local Records\t\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tRelated Stories\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tRelated Story\n\t\t\t\n\n\n\n\t\n\t\t\n\t\t\t\t\tJimmy Fallon, Idina Menzel Redo 'Frozen' Ballad With Classroom Instruments (Video)\t\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tRelated Stories\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tRelated Story\n\t\t\t\n\n\n\n\t\n\t\t\n\t\t\t\t\tThe Making of Disney's Animated Oscar Contender 'Frozen' Sign up for THR news straight to your inbox every day Sign up for THR news straight to your inbox every day Subscribe for full access to The Hollywood Reporter Send us a tip using our anonymous form. ",
    "datetime": "2014-03-05T05:27:08+00:00",
    "url": "https://www.hollywoodreporter.com/news/general-news/frozen-crazy-south-korea-spawns-686173/"
}