{
    "title": "‘Queen of K-pop’ Boa celebrates 20 years of leading the Korean Wave as she turns 34 – now Exo and NCT agency SM Entertainment’s creative director, how did she get where she is today? | South China Morning Post",
    "text": "The year 2020 might be a tough one, but it’s a special one for Boa: this year marks the 20th anniversary of her debut. Today, November 5, the star also celebrates her 34th birthday. She led the K-pop wave when she stepped onto the scene at age 13 and is now considered something of a legend, rightfully dubbed the “Queen of K-pop”. Here, we take a look back at five of her most iconic songs, many of which were often remade by other K-pop artists. No. 1 “You’re still my number one” – the catchphrase of this song is a popular fan cheer chant. This song won Boa the Daesang (grand prize) at annual music festival SBS Gayo Daejeon (Battle of the Bands) in 2002, just two years after her debut, and set the record as the youngest person to receive it. Her debut came after Boa caught the attention of SM Entertainment founder Lee Soo-man himself and she was contacted by around 15 different agencies. Valenti The year 2002 also saw Boa release her first Japanese album “Listen to My Heart”. The album topped Japan’s Oricon chart – a first for a Korean singer. Her single Valenti, which came out later that year, then topped Oricon charts for two consecutive weeks, and her second Japanese album of the same name became her bestseller with more than one million copies sold. Boa even won the Most Influential Asian Artist award at the MTV Asia Awards in 2004. Valenti, a song rooted in Latin music with a funky and mesmerising sound, therefore represents the peak of Boa’s career in Japan and her status as a K-pop pioneer outside of her native country. Atlantis Princess This song, which appeared on the album of the same name released in 2003, could be considered the epitome of early 2000s K-pop. Its positive lyrics and cute choreography were also perfect for Boa’s youthful looks. But behind the cheerful, energetic melody is a sad story that explains why Boa holds the song close to her heart – her manager, who she was close to, passed away in a car accident at around the same time of the song’s release. The tragedy pained her so much that she stopped singing the song until her 15th anniversary in 2015. Only One Released in 2012, this is the first title song – the most heavily promoted song on an album, but not necessarily a single – that Boa composed and wrote the lyrics for herself. The song features a medium tempo beat, R&B vibe and a duet dance, which saw Boa pairing up with many famous K-pop idols, including her friend  TVXQ’s Yunho,  Super Junior’s Eunhyuk, Shinee’s Taemin, Exo’s Sehun and more. Fans loved seeing the chemistry between the different pairs. The song returned this year when it was remade by American singer-songwriter Gallant, who is a long time fan of Boa. He also wrote the English version of the lyrics and brought a more soulful, groovy feel to the song. Merry Chri Merry Chri is also special to fans because Boa sings it at all of her concerts. The lyrics, which tell of lovers promising to stay together forever on a snowy winter day, can also easily represent the connection between Boa and her fans. At the end of her 10th anniversary concert in Japan, Boa was even moved to tears after hearing the 5,000-strong crowd sing along. Want more stories like this? Sign up  here. Follow STYLE on  Facebook,  Instagram,  YouTube and  Twitter . She performed with Exo’s Sehun, Shinee’s Taemin, Super Junior’s Eunhyuk and TVXQ’s Yunho in Only One and Girls’ Generation and Red Velvet remade Atlantis Princess and No 1 – what are Boa’s 5 most iconic songs? ",
    "datetime": "2020-11-05T16:05:39+08:00",
    "url": "https://www.scmp.com/magazines/style/k-pop/artists-celebrities/article/3108591/queen-k-pop-boa-celebrates-20-years"
}