{
  "text": "One of President Donald Trump's key aims in 2018  was to \"level the playing field\" of global trade. But so far, his main achievement has been to fill the fields of America with giant mounds of unsold soybeans.Those soybeans used to be snapped up by Chinese importers, largely to feed that country's pork industry. But this export route was halted in 2018 by a tit-for-tat global trade war that now involves $350bn (£277bn) worth of goods. The Chinese announced their restrictions on US soybean imports in April. That was a response to President Trump's dramatic import tariffs of 25% on steel and 10% on aluminium imports.In July, Mr Trump visited the Granite City steelworks in Illinois which had reopened following his new steel tariffs. The president criticised previous American administrations for past policies that had allowed jobs to be exported abroad. Mr Trump told workers: \"That's not free trade, that's fool's trade, that's stupid trade, and we don't do that kind of trade any more.\"The response of the Chinese leadership has been to match sanctions with more sanctions. In a speech in December, President Xi Jinping insisted: \"In a big country like China with more than 5,000 years of civilisation… no one can dictate to the Chinese people what should and what should not be done.\"Roger Johnson, president of the US National Farmers' Union, told me that the 200,000 family farmers he represents were increasingly concerned. He spoke to us after a trip to his home state of North Dakota, commenting: \"There are huge piles of soybeans, not just in stores, but piled on the ground. There is basically no market for many of these soybeans.\"If kept under cover, soybeans can be stored for up to a year. Even so, Mr Johnson is worried that the trade dispute will have a long term impact on the reputation of the US as a reliable supplier, and soybean production will move to Brazil, Argentina and Eastern Europe.Deborah Elms, executive director of the Asia Trade Centre in Singapore, divides Donald Trump's complaints against China into four elements. These are China's theft of American intellectual property, the forced transfer of technology when US firms build factories in China, cyber spying in the US, and the big US trade deficit with China.Ms Elms agrees that China has not opened up as fast as many had hoped, but she doubts whether  complex manufacturing supply chains can be moved from China back to the US for many products. And her assessment of the impact of President Trump's policy so far is that the economic damage from the higher cost of steel in America is offsetting any job gains.  She concludes: \"There's one US aluminium company that is very happy, and there are a couple of US steel companies that have hired more workers. \"But the net result so far to the US economy and US jobs as a result of all of these tariff war policies have been uniformly negative for US workers and US jobs.\"It is now 10 years since the height of the financial crisis when the reputation of investment bankers hit rock bottom. The Wall Street banks have worked hard since then to demonstrate they are ethical and responsible. It was a heavy blow for Goldman Sachs, then, to find itself caught up in another financial scandal in 2018.This centred on a fund in Malaysia called 1MDB, supposedly designed to finance infrastructure projects to benefit the country. In fact, about $4bn was apparently siphoned off to fund lavish living for insiders. Most embarrassingly for Goldman, the bank's former head of South East Asia, Tim Leissner, has pleaded guilty to facilitating bribes. The executive alleged to US prosecutors that a culture of secrecy at the investment bank led him to conceal wrongdoing.Goldman Sachs itself has now been charged by prosecutors in Malaysia. The bank says it had some rogue employees, but that the charges against it are \"misdirected\" and will be vigorously defended. A Malaysian financier known as Jho Low, now believed to be in China, was one beneficiary. His spending spree included a $2m bill for one evening at a nightclub, chartering yachts, funding movies, and making friends with celebrities such as Paris Hilton and Leonardo di Caprio.  The scandal also led to Malaysian voters turning against prime minister Najib Razak, who founded 1MDB, after $700m turned up in his personal bank account apparently related to the scandal. Malaysians reinstalled their former prime minister, the 93-year-old Mahathir Mohammed.Mr Razak has been charged but denies wrongdoing.Bradley Hope, co-author of a book on the scandal, Billion Dollar Whale, says: \"What's really pernicious about this scandal is that the money that was taken was borrowed.\"  Subsidies to Malaysian fishermen have already had to be cut, and the $6.5bn debt in the 1MDB fund will have to be repaid by Malaysia's government, he says.  It was another poor year for efforts to halt climate change. The latest global totals for global carbon dioxide emissions suggest a 2.7% rise in 2018 - after a 1.6% rise in 2017.Ambitious targets written into various climate agreements over the years have not led to successful shift in policies.  In France, President Emmanuel Macron's efforts to deter fuel use by increasing taxes met with violent protests and he was forced to back down.The cultural barriers are coming down across the global entertainment industry. Netflix continued to span the globe, drawing viewers away from established TV channels. And in the music business there was the breakthrough of Korea's K-pop - with one boy band topping the US album charts.Their secret seems to be lavishly produced and choreographed videos combined with lyrics that speak to their generation.  Music journalist Taylor Glasby says the likes of Youtube and Spotify have helped promote K-pop across the globe.Technology was key, she says. Even the lyrics can be immediately translated and put on websites. Put everything together, she says, \"and you've got this unstoppable juggernaut of pop magic\".",
  "datetime": "2018-12-26T00:35:58.000Z",
  "title": "2018 - The year in business - from K-pop to soybeans"
}
