{
  "text": "South Korean girl group Blackpink have just reached a new milestone - after their single Ddu-Du Ddu-Du was played more than a billion times on YouTube.The popularity of the lavish music video means the quartet are the first K-pop group to join the site's \"billion views club\".They are only the second Korean act, after Gangnam Style star Psy, to reach the number.Boy band BTS aren't far behind - their DNA video is currently on 866 million.The video sees the band draped over a bejewelled tank and swinging from chandeliers.This article contains content provided by Google YouTube. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Google’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.Blackpink's record label, YG Entertainment, announced their achievement on Tuesday, and it was later confirmed to the BBC by YouTube.A video of the band rehearsing the song's dance routine has also earned 264 million views.This isn't the first time the quartet have broken a YouTube record. In April, the single Kill This Love was played 100 million times in two days - faster than any other music video in the site's history.It was later overtaken by BTS's Boy With Luv, which achieved the feat in just 24 hours.Although there is no rivalry between the two K-pop bands, fans are locked in a fierce debate over who is bigger.Blackpink were formed three years ago and comprise four members - Jisoo, Jennie, Rosé and Lisa. Their debut album Square One was released in 2016 and gave them their first number one single in their homeland, with the track Whistle.Earlier this year, they became the first K-pop girl band to perform a set at the Coachella music festival, and they have collaborated with Dua Lipa on the single Kiss And Make Up.Blackpink are also the most-subscribed music group on YouTube, amassing 31.2 million followers, who call themselves \"Blinks\". The band's name is meant to challenge female stereotypes. \"Pink is commonly used to portray prettiness, but BlackPink actually means to say 'Pretty isn't everything,'\" YG Entertainment explained when the band launched.\"It also symbolises that they are a team that encompasses not only beauty, but also great talent\".This video can not be playedBlackpink: Meet the K-pop superstars backstage at their first UK tourFollow us on Facebook, or on Twitter @BBCNewsEnts. If you have a story suggestion email entertainment.news@bbc.co.uk.",
  "datetime": "2019-11-13T12:07:44.000Z",
  "title": "Blackpink are the first K-pop band to join YouTube's 'billion views club'"
}
