{
  "text": "Coachella, the annual music and arts festival in the Californian desert, has become something of a cultural phenomenon over the years.And, this year's no different with the buzz on what's happening on - and off - stage.Firstly, there's BLACKPINK who've made history by being the first K-pop girl band to perform there.And then, Childish Gambino's not only headlining, but unveiling a mysterious film collaboration with Rihanna.Let's start with BLACKPINK's highly anticipated US festival debut.The South Korean pop band - who are the highest-charting female K-pop act in US chart history - performed on the Sahara Stage with Lisa telling the crowd they were \"excited to be here tonight\".The crowd packed in while Jennie told them it was \"an honour to be a part of Coachella\". This was the band's first ever full length US concert.Rosé also invited fans to sing along saying it \"might be hard because some of [the words] are in Korean\".The set was live streamed on the big screen in New York's Times Square - with fans in both locations apparently loving what they saw.It was Childish Gambino who brought day one to a close though.The 1975, Janelle Monae and DJ Snake took to the stage before Gambino brought the curtain down.He opened by asking fans to put their phones away:  \"Put your phones down. If you're here for Instagram you can get to the back and boo.\"Most of them appeared to ignore him though as he performed tracks including This is America and Summertime Magic.As well as headlining this weekend, he's also unveiling a new - and until now, very secret - movie project alongside Rihanna.Guava Island comes to Amazon Prime on Saturday, after its premiere at Coachella, and reportedly will be free to watch for the first 18 hours.It's been described as a \"tropical thriller\" - and was shot in Havana, Cuba, last summer.Just as Childish Gambino finished his set reports of a fire breaking out in one of the festival's shower blocks started appearing on social media.One person described hearing \"explosion\" sounds before the fire was found.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitter’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.It's not known if anyone was hurt and Newsbeat has contacted the festival organisers for an update on the situation.Earlier in the day, country music singer Kacey Musgraves, fresh from her best album Grammy win in February, made her Coachella debut with a set on the main stage.She was later followed by The 1975, who had the crowd in the palm of their hands playing It's Not Living (If It's Not With You) and I Like America and America Likes Me.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitter’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.Headliners at the festival include Tame Impala on Saturday night and Ariana Grande on Sunday.Other names appearing throughout the weekend are Janelle Monáe, Weezer, Four Tet, Pusha-T and Ella Mai.Follow Newsbeat on Instagram, Facebook, Twitter and YouTube.Listen to Newsbeat live at 12:45 and 17:45 every weekday on BBC Radio 1 and 1Xtra - if you miss us you can listen back here.",
  "datetime": "2019-04-13T14:00:01.000Z",
  "title": "BLACKPINK become first K-pop girl group to perform at Coachella"
}
