{
  "text": "Blackpink's Jisoo has become one of the highest-profile K-pop stars to go public with her relationship, in a highly pressurised industry with notoriously fickle fans and record companies that monitor every aspect of their stars' private lives.The 28-year-old and actor Ahn Bo-hyun, 35, are \"getting to know each other with good feelings\", according to Korean media reports.The couple's respective agencies acknowledged the relationship on Thursday, asking the public for their support and understanding.Ahn, a Korean model and actor, has appeared in popular drama series such as Itaewon Class and Yumi's Cells.While members of high-profile groups such as EXO and Twice have gone public with their partners in recent years, the announcement remains unusual as top K-pop stars rarely reveal much about their private lives.Just a decade ago, it was common practice for agencies to ban new stars from dating or even having a personal mobile phone. Any admission of a romantic relationship or a partner was scandalous to fans. Idols being in private relationships may be \"bad for business\", according to sociologist Patrick Williams of Nanyang Technological University in Singapore.\"They want to sell idols that appear to be, at least in an imaginary sense, romantically obtainable. Fans can imagine themselves in some form of social relationship with this idol,\" noted Dr Williams.But Jisoo, the lead vocalist for the four-woman Blackpink, isn't your average K-pop star.Blackpink, one of the world's most popular acts, has headlined major music festivals such as Coachella and draws tens of thousands to their concerts. Their individual Instagram accounts have followers numbering from 73 million to 93 million.Nevertheless, Jisoo is the first member of Blackpink to acknowledge being in a romantic relationship. Their agency YG Entertainment has previously denied or refused to comment on rumours surrounding the group members' liaisons.While Blackpink fans have generally reacted positively - a comment on Jisoo's Instagram account that read \"Congratulations BABY\" has been liked more than 3,000 times - the admission is unusual. \"The fact that she's in... the peak of her career right now, I think is what makes it unusual,\" said Rob Schwartz, an Asian correspondent for Billboard.By comparison, none of the members of BTS - arguably the most popular boy band in the world - have acknowledged dating anyone. There is good reason for being cautious. In 2019, major K-pop stars Kang Daniel and Jihyo sparked a backlash from some fans when their relationship was outed by Korean media. Angry fans took it out on another celebrity, rumoured to be their matchmaker, by leaving threatening messages for him on social media. But Mr Schwartz said that Jisoo's new relationship is a sign that as more K-pop bands emerge on the international stage, the \"super powerful international industry\" is changing: \"We could even say this industry is becoming more mature.\"Dr Williams also reckons that the international stature of stars like Jisoo gives them greater freedom: \"I think that they're starting to [be] confident enough to push back against some of the constraining dimensions of [the K-pop industry].\" ",
  "datetime": "2023-08-03T10:03:53.000Z",
  "title": "Blackpink - Jisoo’s new relationship with Ahn Bo-hyun rocks K-pop world"
}
