{
  "text": "Donning sari-inspired clothing and intricate jewellery, four young women are seen dancing energetically at a temple. Then, gulal, a colourful powder used in traditional rituals, is spread across the sky and onto their faces. This is not a Bollywood movie but the latest music video of K-pop girl group Blackswan.Blackswan is currently the only K-pop girl group without any Korean members that has made its debut in South Korea. In 2017, an all-American K-pop boy band, Exp Edition, debuted in South Korea but they are no longer active.It is not unusual for K-pop groups to have foreign members, typically from other Asian countries. One of K-pop's biggest girl group, Blackpink, has a member from Thailand. But apart from Blackswan member Sriya, who hails from India, none of the other band members are from Asia. Fatou grew up in Senegal and Belgium, Gabi is Brazilian-German and NVee comes from the US.As the genre continues to globalise, the girl group has become part of a growing conversation about the definition of K-pop - and whether they fall within it. \"They are affiliated with a Korean entertainment company, debuted in South Korea, and sing in Korean,\" said one commenter, suggesting they should be defined as K-pop. Other Koreans, however, are less positive. \"Without [them actually being] Korean, they are just a pop group.\"Blackswan are unfazed by such comments.They say they identify as a K-pop group and sing in Korean.It is an argument that will likely continue to divide Korea, as the government plans to launch a two-year \"K-culture training visa\", enabling foreigners to undergo K-pop training, Blackswan's atypical line-up was not by design initially and reflects the trajectory of the development of the genre.The group's predecessor is Rania, which launched in 2011. It was made up of six Koreans and a Thai - though its membership experienced significant changes over the years.In 2020, music company DR Music decided to rebrand Rania into Blackswan, with Fatou being the only one from its original line-up. \"Some people might find it strange and even dislike the group for not having any Korean members,\" Philip YJ Yoon, managing director at DR Music, told the BBC. \"However, we saw the opportunity in the expanding K-pop market.\"But this expansion isn't without its challenges. Language is the first barrier, as K-pop idols are expected to speak and perform in Korean. Korean has different speech forms, depending on the listeners' age, social status, level of intimacy and occasions. Honorifics are key to the language.\"You shouldn't use the name of a person or say 'you' in Korean. But in Portuguese and English, you always use it in a sentence. So, it was really hard for my brain to process,\" says Gabi. Some members still struggle with Korean.But its dance practices they all find the hardest - with training typically taking up all day.\"When they constantly say, 'No, it's wrong. Do it again.' It was frustrating,\" says Nvee, who studied musical theatre and acting.Gabi performed in a cover dance group back home in Brazil - so she thought dancing would come easy. \"When I came here, oh my god, [I realised] I didn't know anything about dance,\" she says. Trainees also live together in a dorm and are restricted from going out and dating. They are also told to lose weight and need to look perfect. Any type of scandals are not permissible - as the Korean public hold celebrities to high moral standards.Freelance casting director In Ji-woong, who has spent eight years as a choreographer for K-pop groups, says he has heard of foreign trainees escaping from their shared house to go clubbing. Their managers were \"urgently deployed\" to bring them back.    Mr Yoon admits it is a challenge to work with international trainees: \"They often question the rules and are very straightforward.\"The rigidity of training and the hyper-competitiveness have also led to a mental health crisis in the K-pop industry. In April, fans were shocked by the sudden death of Moonbin, a member of boy band Astro. He was found unresponsive in his flat in the Gangnam neighbourhood of Seoul. In 2019, K-pop stars Sulli and her close friend Goo Hara passed away in a month - both suspected suicides.\"Dealing with mental stress was the most challenging part for me,\" says Fatou, who has suffered from depression symptoms since a young age. She says there are times when she asks herself: \"I can't dance, I can't rap, I can't sing. What [am I] doing?\"Fatou is seeing a psychiatrist and has been on medication since February. This is the first time she's ever sought medical help for her symptoms, and her agency is paying for it. Still, she says K-pop is what brings her the most joy.  An increasing number of entertainment companies now offer trainees and idols more personal time. Some of the rules are made more lenient, too.As for Blackswan, its members are confident that they represent the future of K-pop.\"K-pop will become more globalised, so that there are more global groups being trained and making debut in the global market,\" Gabi says.Sriya has put it in simpler terms: \"Everybody can do it… because skin colours don't define anything.\"",
  "datetime": "2023-08-27T00:17:36.000Z",
  "title": "Blackswan - The K-pop girl group with no Korean members"
}
