{
  "text": "Stephanie is part of the BTS army. It's a fandom even Directioners struggle to match. Her love for the seven-piece K-pop boy band runs so deep she's moved from Scotland to South Korea, just to be closer to them.\"One day, I was just going through YouTube and I came across this song called No More Dream by BTS.\"I watched the video and from that moment I was hooked. It's thanks to BTS I'm here.\"The 23-year-old has found a job as an English teacher in an elementary school, and says she's starting to learn Korean too.\"I've learnt a bit of Korean mainly because of BTS,\" she says.\"I want to understand the lyrics and more of what they are singing about.\"\"I can read quite well but speaking it is difficult, especially with my Scottish accent. Pronunciation is by far the hardest aspect for me.\"This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitter’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.It's those lyrics that have helped make the group successful.The pop industry in South Korea is known for its exhaustingly energetic tracks.But BTS have cut through with a more thoughtful tone, with songs about loneliness, anxiety and gender politics. 21st Century Girls is seen as one of the most feminist songs in K-pop. This article contains content provided by Google YouTube. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Google’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.Stephanie says there have been other difficulties resulting from her move - she misses her family, friends and boyfriend, Sam.And she's having to get used to the cold weather in Seoul, where the temperature reaches an average -9 degrees in January.But she says it's worth it to be nearer her heroes.This article contains content provided by Instagram.  We ask for your permission before anything is loaded, as they may be using cookies and other technologies.  You may want to read Meta’s Instagram cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.The band have just hit 12 million followers on Twitter and they ended Justin Bieber's six-year reign as Top Social Artist at last year's Billboards.Though unlike One Direction, the band have just one group account for each social media platform.Stephanie has already seen BTS perform live twice since she arrived in Seoul in October, and she'll be watching them at the Seoul Music Awards next week too.\"I'm in the 'army', which is a BTS fan club. For the Korean fan club it's like really hard to get in,\" Stephanie says. \"There's a waiting list and you have to buy X amount of merchandise to get in. \"That's especially the case if you want to go to fan meet-ups. You've got to have this album and that album. \"If you're in the army you get access to pre-sale tickets too, which really matters in K-pop concerts because they will sell out in seconds.\"This article contains content provided by Instagram.  We ask for your permission before anything is loaded, as they may be using cookies and other technologies.  You may want to read Meta’s Instagram cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.She says it's been exciting to meet other fans.\"Before I moved here I would only be able to talk to BTS fans over Twitter, since nobody I knew in Scotland had even heard of them.\"But when I went to my first BTS concert I got chatting to [another fan] in the queue and now we have become really close friends and hang out a lot together.\"Listen to Newsbeat live at 12:45 and 17:45 every weekday on BBC Radio 1 and 1Xtra - if you miss us you can listen back here",
  "datetime": "2018-01-19T14:40:07.000Z",
  "title": "BTS superfan moves to South Korea to be near K-pop band"
}
