{
  "text": "Global sensation BTS has become the first K-pop group to ever receive a Grammy Award nomination.Their latest hit song \"Dynamite\" was nominated for the Best Pop Duo/Group Performance category, alongside stars like Lady Gaga and Taylor Swift. The group posted a reaction video on Twitter, showing them cheering when their nomination was announced.K-pop expert Jeff Benjamin tweeted that the Grammy nomination was a \"huge long-awaited moment in their careers\".He added that it marked a major moment for diversity for \"music's biggest night\" - which will be held on 31 January. Dynamite, the band's first all-English single, topped the Billboards for weeks when it was released earlier in August.News of the nomination flooded social media, with many voicing praise and support for the boy band, currently one of the biggest bands in the world. This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitter’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\"I am so happy for you and the whole army!\" said talk show host James Corden, referencing the boys' fans who call themselves the Army. And of course, they had a lot to say as well.\"I am proud of the boys. they are fulfilling their dreams in America with music and projects that inspire young people,\" one fan said.\"Your dream finally came true, look how far you've come,\" another added.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitter’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitter’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.BTS uploaded a video showing the four members of the band jumping up from a sofa as their nomination was announced.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitter’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.BTS have made no secret about their desire to win a Grammy, with member RM saying in an earlier interview with Esquire that the \"Grammys are... the final part of the whole American journey\".The band have already swept the American Music Awards and the Billboard Music Awards. According to Yonhap, they will become the first South Korean group to win all three major US music awards if they win a Grammy. The art director for their Love Yourself: Tear album had previously been nominated for best recording package, at last year's Grammy Awards.BTS-mania has swept the globe in recent years, with the boy band's popularity skyrocketing overseas. This video can not be playedBTS - from chart success to stock market gold?",
  "datetime": "2020-11-25T08:08:06.000Z",
  "title": "BTS - Band gets first ever Grammy nomination for K-pop"
}
