{
  "text": "Even if you're not a K-pop fan, chances are you'll have heard of BTS.Known for their upbeat songs, big tours and catchy dance moves, put simply they are the world's biggest boyband.While the group is currently on a break so some members can serve in the South Korean military, fans have still been out in force this week celebrating the 10th anniversary of their first song.\"I've made friends from all over the world through BTS and I'm so grateful,\" superfan Beth Law tells BBC Newsbeat.The 26-year-old from Weston-super-Mare is part of the official fan group which calls itself BTS ARMY - made up of fiercely devoted fans encouraged to support not just the music group, but each other.\"I even met my boyfriend through BTS so it's been an amazing journey,\" she adds.Beth and her boyfriend are just two of the millions worldwide who follow every move the band make. But why do they mean so much to their fans?For Beth, it's not just her love life that BTS have helped her out with, but also her mental health.Over the past 10 years, the group have been commended for covering themes related to mental health in their songs, and Beth says one particular tune called Reflection connected with her. \"I remember just sitting in my room and looking at the lyrics, just crying while I was listening to it because it made me feel seen and so heard.\"Even though the group are singing in a foreign language, Beth still finds the messages about \"self-love\" and \"taking care of yourself\" incredibly powerful.BTS are often credited with being one of the factors for Korean culture becoming popular around the world.They've previously been named as the world's best-selling artists beating the likes of Taylor Swift and Adele, and were the first Korean act to score a chart-topping album in the UK.Jenny Sheehan, who now has her own YouTube channel dedicated to K-pop, praises the group \"for opening up my world to music that's not in English\".\"The music videos have subtitles so you can see what they're saying and it's usually so deep and there are so many cultural references in there.\"It's not just the music style that Jenny thinks is different, but the way they interact with fans.\"They do so much for their fans, [things] that maybe I haven't seen from Western artists. They go live regularly just to talk to us and read messages.\"It's this direct contact with their followers, that has made BTS an \"unstoppable force\" and differentiated them from other bands, according to music journalist and K-pop expert Taylor Busby. \"A lot of artists weren't using social media in a day-to-day way. They were using it [only] for album updates and links to videos.\"Members of the band often used these conversations and live streams to open up about their own struggles and vulnerabilities, creating a connection with fans.\"BTS were right in there, just chatting. You could get replies so it really felt like there wasn't that wall that K-pop used to have.\"Taylor thinks that BTS' success has \"opened the door\" for other Korean artists and made the K-pop world global.Groups like Blackpink have played at Coachella and are due to play in London this summer, while Red Velvet have been booked for a European tour.\"This is something very few K-pop idols could do prior to BTS.\"Though the group isn't making music right now, fans such as Mel James, currently based in Seoul, have been going all out in the past week to celebrate the birthday.The 26-year-old English teacher says the scenes of purple in the city, representing the band's colour, is \"amazing to see\".\"There are shows everywhere and Banpo Bridge which is in over the Han River is purple with fountain shows.\"There are deals going on in supermarkets. There's just so much celebration.\"This doesn't happen for everybody and it goes to show that authenticity is perfect,\" she adds.Follow Newsbeat on Twitter and YouTube.Listen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here.",
  "datetime": "2023-06-18T08:35:25.000Z",
  "title": "BTS - Fans celebrate 10 years of 'unstoppable' K-pop group"
}
