{
  "text": "Ten-year-old Miao Chunyou screamed for her mum as she disappeared into a brown torrent that had engulfed western Beijing.The strong currents ripped Miao from her father's grip as floods, triggered by incessant rains, chased the family of three to the roof of a neighbour's house.Her mother, clinging to a tree branch, watched helplessly. That was the last time she saw Miao. More than 10 days have passed but the couple has heard no news about their daughter. \"It was like a scene from a movie, with huge, furious waves,\" Miao's mother tells the BBC. She only shared her last name, Chang. China is no stranger to floods, but July saw a trio of typhoons from the Pacific Ocean over three weeks, which exacerbated seasonal monsoon rains. Two of the three made landfall in the country, including super typhoon Doksuri, which churned slowly over large areas of north-west China for several days, inundating Beijing and surrounding provinces such as Hebei. That week, the Chinese capital experienced the most rainfall in 140 years.Sixty-two people have so far been confirmed dead in the deluge - 33 from Beijing and 29 from neighbouring Hebei province.Miao was swallowed by water \"as high as two adults, one standing on the other\", her mother says. \"Villagers in their 70s or 80s said they had never seen floods this big in their lives.\"She says that it had been raining heavily until July 30, when the downpour eased. The family believed the worst had passed, but stayed home, worried that going outside could expose them to mudslides.But the following morning \"the rain came down heavily\", Ms Chang said. As water rapidly filled the house, she and her husband tried to pump it out. But within half hour, flood water and mud smashed through the front wall.Mr Chang is a migrant worker and spends much of the year in Beijing, where he sells spices. His wife and daughter were visiting him from Henan when the rains began. The three had mostly been apart during years of zero-Covid rules, and this was had been a much-awaited reunion. They had planned to visit Tiananmen square the day they lost Miao to the flood. Ms Chang and her husband adopted Miao as a baby. They have two older sons, 27-year-old twins, who were back home in Henan province in central China when the flood hit. Distraught at what happened to their sister, one of them is unable to even speak, Ms Chang says.China's flood control system allows for water to be diverted from major cities like Beijing, Shanghai and Tianjin to surrounding areas. During the floods, Hebei's Party Secretary Ni Yuefeng proudly declared that his province would act as a \"moat\" to protect Beijing, stirring anger among his constituents, who said the speed with which the flood waters hit caught them by surprise.Wan, who wished to reveal only his last name, lives in Beijing but was alerted to a distress message on WeChat on 2 August. The mountain village of Tangjiazhuang in Hebei province, where his family lives, was hit by a landslide two days earlier.It had cut off the village of 2,000 mostly elderly people. Some families had gathered there for the cool highland weather because parts of China had sweltered in heat waves before the typhoons brought deadly rains.Mr Wan says he rushed to Tangjiazhuang with his wife to rescue their relatives. But they were stopped at a neighbouring village by neck-deep water. Undeterred, they took an alternate route that involved a an uphill three-hour hike. The terrain caused him to slip and twist his ankle.\"When we finally got there, all we saw was an ocean, with nothing left,\" Mr Wan's wife recalls.Rescuers reached Tangjiazhuang on 3 August, three days after the landslide, and a day after the Wan couple found the village where their family had been in ruins. Local authorities counted 10 people dead and 18 others missing. Mr Wan, citing anecdotal reports, says the death toll is likely higher than official tallies. Mr Wan says seven of his relatives are either dead or missing, including his two nephews, aged seven and four. He reads out their names: \"Wan Hanying, my second uncle, Li Shulan, my second aunt, Wan Hechun, my third uncle, Jing Zhizhen, my third aunt, Wan Gongle, my sister, her children, Li Jiaqi and Li Jiaxin.\"China's state-run media, which has released death tolls outside Beijing over several days, has focused on the rescue efforts, with headlines such as: \"There is a sense of security called the People's Liberation Army\" and \"Shandong rescue team work in floods, starving, with hands shaking uncontrollably from the cold\". But that did not stop those on social media form noticing that President Xi Jinping did not visit any of the sites where disaster struck, unlike his predecessors. He did call for an \"all-out\" flood rescue effort, a message that was carried prominently on state media.Instead on 31 July, as parts of north-east China were submerged, and Miao was swept away, Mr Xi attended a ceremony in Beijing to promote generals in the Central Military Commission.Mr Xi could be asserting his status as a princeling, or someone born to a Communist Party official, says Dr Ming Xia, a professor of political science and global affairs at the City University of New York.\"He draws more legitimacy from the revolutionary tradition and does not urgently seek to derive some legitimacy from public opinion, as his predecessors Hu Jintao and Wen Jiabao, who were born into ordinary families, did.\" As the floods receded, people have begun piecing their lives back together, shovelling mud out of their homes, and washing clothes and appliances that have turned brown. But scientists say climate change will spawn stronger, more frequent typhoons like Doksuri.For Mr Wan, it is all too much. \"The mountain still has fissures and future dangers are certain,\" he says. \"We definitely won't live there anymore.\"",
  "datetime": "2023-08-11T23:31:05.000Z",
  "title": "China floods - The families torn apart by 'huge, furious waves'"
}
