{
  "text": "South Korea says China has forcibly repatriated a \"large number\" of North Korean defectors.This follows recent reports from human rights groups claiming that as many as 600 North Koreans have been sent back.Seoul said on Friday that the reports appear to be true, but did not confirm the exact number who were repatriated.Human Rights Watch (HRW) said the defectors, mostly women, could face imprisonment, sexual violence or even death once back in the North.Sources in China have reported that hundreds were put on trucks and sent from their detention centres to North Korea on Monday night. \"The government's position is that under no circumstances should North Koreans living abroad be forcibly repatriated against their will. Forced repatriation against one's will is a violation of the international norm of non-refoulement,\" said Koo Byoung-sam, a spokesman for the South's Unification Ministry.Non-refoulement means refugees and asylum seekers should not be made to return to countries where they could face persecution.Mr Koo said South Korea has protested to China and reiterated its position. He declined to give further details.UN special rapporteur on human rights in North Korea Elizabeth Salmon estimates that some 2,000 North Koreans are being held in China for crossing the border without permission.China does not recognise North Korean defectors as refugees. It claims they are \"economic migrants\" and has a policy of sending them back, despite requests from foreign governments and human rights organisations to reconsider its stanceAsked about the reported repatriations, China's foreign ministry spokesman Wang Wenbin said on Thursday there was \"no such thing as so-called 'North Korean defectors' in China\". He said Beijing upholds a \"responsible attitude\" towards North Koreans who enter China illegally for economic reasons, according to Reuters.This video can not be playedNorth Korea defectors: Why it's getting harder to escapeConcerns about forced returns of North Korean defectors have grown since Pyongyang announced the reopening of its borders in August, said HRW. Since July 2021, it has confirmed the repatriation of almost 170 defectors in total. HRW added that the latest returnees were at \"grave risk\" of being detained in forced labour camps. They also face the prospect of torture, enforced disappearance and execution.The rights group urged governments around the world to \"denounce China's latest returns and call for an end to future forced returns\". It also called on Beijing to either grant the North Korean defectors refugee status, or give them safe passage to South Korea or other countries.",
  "datetime": "2023-10-13T08:25:03.000Z",
  "title": "China deported 'large number' of N Korean defectors - Seoul"
}
