{
  "text": "An indie rock band plans to donate profits from an upcoming tour to food banks after seeing people \"struggling to survive all around us\".Circa Waves, from Liverpool, said it was \"heartbreaking\" to see parents unable to feed their childrenThe chart-topping band, who tour the UK in October, said they would donate a portion of profits from gigs in each town they visit to local food banks.\"We hope to make a difference, no matter how small,\" the band said.\"The cost-of-living crisis has taken away so much from so many people. Being able to feed your family is no longer a given, they added.\"Food banks are immeasurably important, they are the last line. Without them people will simply struggle to eat.\"The band, which consists of lead vocalist and guitarist Kieran Shudall, guitarist Joe Falconer, bassist Sam Rourke, and drummer Colin Jones, follow a summer of festival appearances with a series of gigs in Grimsby, Glasgow, Carlisle, Bedford, Milton Keynes, Southampton, Preston, Norwich and Cardiff.Circa Waves reached number four in the UK charts in 2020 with the song Sad Happy and topped the UK Independent Albums Chart with Never Going Under in January this year.Food poverty charity The Trussell Trust said, between 1 April 2022 and 31 March 2023, UK food banks distributed almost three million emergency food parcels to people, an increase of 37% from the previous year, with over one million of these parcels distributed for children.Circa Waves said they felt donations to food banks were \"needed more than ever\", adding: \"In a country with wild amounts of affluence and the rich getting richer food banks will only keep growing and becoming more indispensable.\"If every touring artist did it, it would be quite amazing.\"It \"takes a lot of small changes to make something big happen\", the band added.A government spokesman said: \"We know people are struggling, which is why we're providing record financial support worth an average £3,300 per household.\"On top of this we have raised benefits and the state pension in line with inflation, increased the National Living Wage and are supporting families with food, energy and other essential costs. \"We're also bearing down on inflation to help everyone's money go further, while helping millions more return to work with a £3.5bn package providing more work coach support, more free childcare and more help for the sick and disabled.\" Why not follow BBC North West on Facebook, Twitter and Instagram? You can also send story ideas to northwest.newsonline@bbc.co.uk",
  "datetime": "2023-06-28T14:08:10.000Z",
  "title": "Circa Waves - Liverpool rock band donates tour profits to food banks"
}
