{
  "text": "One of Britain's last remaining D-Day veterans has said he puts his survival down to \"the luck of the draw\".Les Budding, 97, was 18 years old when he served on board Landing Craft Flak 34, charged with providing covering fire for the first wave of troops who stormed Sword Beach on 6 June 1944.Mr Budding said: \"On this anniversary, I'm thinking about the veterans we've lost over the past few years.\"I'm also thinking about all those men we lost that day.\" The son of a steam locomotive driver, Mr Budding joined the Royal Marines at 17.Following intense training in Scotland, he found himself with 85 others boarding a 186ft landing craft in Portsmouth headed for the Normandy coast, 79 years ago.They were tasked with defending the main invasion force from attack from the Luftwaffe as well as surface vessels.He told the BBC: \"I wasn't nervous. We were kept busy. We knew we had an important job to do. Looking back, I think we had that attitude because of our youth. If we were 25 or 30 and had experience of death - of life, come to think of it - we would probably have seen things different.\"Survival was luck of the draw. A lot of people were lost.\"Mr Budding, who lives near Sleaford in his native Lincolnshire, recalled \"the false start\" when the invasion was put back a day due to bad weather.\"There was a narrow weather window and off we went,\" he said. \"We all just wanted to get going, to get the job done.\"Mr Budding saw his first enemy aircraft later that morning, but added the Luftwaffe posed little threat thanks to the efforts of the RAF who controlled the skies.\"The RAF did a marvellous job that day, keeping the Luftwaffe away from us,\" he recalled.He said: \"Our role was protecting the landing forces. The Germans were firing at us from the upper windows of houses dotted along the shore. They had all these sandbags around the windows and you could see the muzzle flashes.\"Mr Budding, although proud of his actions that day, insisted the more important task was the holding of the Trout Line - a defensive line ensuring supplies reached the first waves.After the war, Mr Budding returned to his childhood sweetheart Doris and they married soon after. They were married 71 years. Mrs Budding died five years ago.\"I still miss her,\" he said. \"She was not a happy bunny when I joined the forces,\" he said. \"But I had to go and do my bit.\"Mr Budding, a father to daughter Linda, grandfather to three and great-grandfather to six, believes it is \"most  important\" the nation continues to remember the sacrifices of those who helped free the world from Nazi tyranny.He remains modest, insisting he was \"just one of many\".Today, however, he is one of the few.With a wink, he added: \"We're getting a little thin on the ground now, aren't we?\"Follow BBC East Yorkshire and Lincolnshire on Facebook, Twitter, and Instagram. Send your story ideas to yorkslincs.news@bbc.co.uk.",
  "datetime": "2023-06-06T05:08:32.000Z",
  "title": "D-Day veteran Les Budding, 97, tells of first-wave role"
}
