{
  "text": "What if you could find a hidden treasure on an island in the North Atlantic, not gold or jewels, but something as precious and rare to surfers - a beautiful wave that no-one had surfed before?That was the dream that inspired Matt Knight, 59, a renowned skipper, adventurer and surfer, to follow the clues from a 19th Century treasure hunter's journal.\"That was what started the whole thing off really,\" he said.\"A great old seafaring friend of mine had been bequeathed a bookshelf full of amazing old seafaring yarns from his grandfather.\"And he pulled this particular book off the shelf one day when I was down there visiting, and said 'read this'.\"Savage Waters by Victorian adventurer and sailor EF Knight - no relation - was \"essentially a treasure hunt story\", explained Matt.The author had been tipped off that Spanish gold was buried on rocks called the Savage Islands so he and a band of adventurers set off to find it on what is now a nature reserve north of the Canary Islands.\"They were picking their way through the reefs looking for a place where you might be able to anchor when they were suddenly confronted with this giant breaking wave that appeared out of nowhere,\" said Matt.\"It was breaking on a hidden reef that was just under the water, and he described this behemothic wave rising up from the deep, forming this giant crest, underneath whose lip a cave was formed with a beautiful green light shining through it.\"And I'm reading that with surfer's eyes of course, I'm just going, wow, that sounds incredible. I thought if it was breaking in 1891, it's probably still breaking now.\"The father of four, from Georgeham in north Devon, told fellow surfers and Devon-based filmmaker Mikey Corker, about Knight's story and together they \"cooked up the the idea\" to look for the wave themselves.A film about their journey, Savage Waters, chronicles the subsequent \"curveballs\" the family and the team faced in 2015 when, armed with the Victorian text, they set off to the \"relatively uncharted waters\".\"There are two main islands on the Savages and then lots of reefs, and then miles of ocean in between and all around you,\" said Matt.\"We sailed all the way down there, which is quite a mission itself because it's just really sketchy and scary down there and the weather changes pretty quickly.\"We had found the Savage Islands all right and we had a look around. I had sailed past three times on previous Atlantic crossings and didn't even know they were there.\"Then the weather changed and a storm was coming, and we had to sail away again in a hurry.\" Before they could make a second attempt, Andrew suffered a serious injury at Nazare in Portugal and Matt's wife Suzanne was diagnosed with advanced skin cancer melanoma.\"Everyone's priorities and perspectives changed,\" said Matt. \"Suzanne was really lucky to get onto a trial for some experimental immunotherapy, she was one of the lucky ones that seemed to be responding.\"In 2020, with Suzanne and their surfer children Taz and Peony onboard, and surfer Ed Smith and filmmaker Mikey too, they made it to the Savage Islands again and this time they scored.\"It was quite emotional finding the wave, it was a long journey and so much stuff had happened in the background that it had left us all in tatters,\" said Matt.\"When we did finally get down there and surf some waves it was definitely an emotional experience.\"But the journey of recovery and human stories were as much the treasure as surfing the amazing wave.\"So the film is not just an adventure story, it's also about life really throwing curve balls... it's about people whose spirit and mind carries them through adversity.\"Matt said he hoped the inspiring stories of the film's main characters would resonate with people. But he added there was \"still unfinished business in that part of the world\".\"There are more waves there for sure,\" he said, but the risks are heavy.\"To be 100% safe you almost need helicopters and jet skis to really have the safety cover in place, to really find the treasure. But for me it was the journey and the experience that was as much the treasure as the wave.\"Follow BBC News South West on Twitter, Facebook and Instagram. Send your story ideas to spotlight@bbc.co.uk.",
  "datetime": "2023-09-05T05:02:55.000Z",
  "title": "Devon family's quest to find Savage Islands wave"
}
