{
  "text": "A man drowned on a commercially-run coasteering trip after a large wave knocked him off a ledge into the sea, an inquest has heard. Iain Farrell, 49, of Dorney, Buckinghamshire, died near Swanage, Dorset, in May 2019.Eight other participants, including his two sons, were rescued by lifeboat.Mr Farrell, who was a weak swimmer, was initially rescued by instructor Charles Ridley before being swept back into the water, the inquest jury heard.He was taking part in the activity, which involves jumping, climbing and swimming, at Hedbury Quarry on 26 May.One of the participants, Sophie Dunford, said strong waves were hitting the ledge where the swimmers jumped in.She told the hearing: \"Charles had to hold us so we didn't get knocked off our feet.\"Ms Dunford said Mr Farrell started to fall behind the group but told her he was OK.She continued: \"It wasn't long before Iain was struggling. Charles jumped in with a rope to help Iain get out of the water.\"They were both stood on the ledge and a massive wave basically knocked them off their feet.\"Ms Dunford, whose voice occasionally faltered with emotion, said the instructor then tried several times to throw a rope to the father of two.She said: \"Next thing I knew I see Charles diving into the water, pulling Iain out of the water and Iain was limp.\"The remaining swimmers, including four children, tried unsuccessfully to get out of the sea but became exhausted, she told the jury.Ms Dunford said: \"Waves were crashing over our heads.... We were struggling to hold onto each other, also drifting further out.\"The group was eventually rescued by the RNLI which had been alerted by nearby climbers.Another participant, Andrew Clark, described the waves as \"challenging but manageable\".He said: \"Iain was kind of in an inlet, trying to pull himself up on like a sheer cliff face. There was no way he could pull himself up.\"Mr Clark said the remaining swimmers spent 30-45 minutes trying to reach land, but were pushed back out by the current.The court heard Mr Ridley was a \"well-respected, qualified, experienced\" guide with adventure firm Land & Wave, which organised the trip.The firm's former director David Mutton said the instructor was working alone, even though he was only certified to work with an assistant, because the waiver had been approved by the firm's external technical adviser.The inquest at Bournemouth Civic Centre continues.Follow BBC South on Facebook, Twitter, or Instagram. Send your story ideas to south.newsonline@bbc.co.uk.",
  "datetime": "2023-09-19T15:46:41.000Z",
  "title": "Dorset coasteering victim was hit by massive wave, inquest hears"
}
