{
  "text": "Ecuadoreans are voting in the run-off of a presidential election that has been overshadowed by a crime wave which has turned the country into one of the most violent in the region. The first round of the election was held just days after presidential candidate Fernando Villavicenio was shot dead in the capital, Quito.Seven suspects were arrested in connection with his assassination, but have since been killed in jail.Security is voters' main concern. Voters will choose between centrist Daniel Noboa of the National Democratic Action coalition and Luisa González of the left-wing Citizen Revolution Movement. The 35-year-old Daniel Noboa is the son of banana magnate Álvaro Noboa. The older Noboa ran for the presidency five times, but failed to get elected.Daniel Noboa's success in the first round - he came second with 23% of the vote, thereby securing himself a spot in the run-off - was a surprise. He has since overtaken the first-placed candidate, Luisa González, in the opinion polls. Luisa González, a lawyer who secured 34% of the votes in the first round, may not have a billionaire father, but she does enjoy the backing of former president Rafael Correa.Mr Correa continues to exert huge political influence in Ecuador, despite the fact that he has lived in Belgium since he left power in 2017 after a 10-year stint as president.The former leader is a divisive figure, who was convicted of breaking campaign finance laws in 2020 and sentenced in absentia to 10 years in prison. The 45-year-old Luisa González is his handpicked candidate and she has said that if she were to win, Mr Correa would be her main adviser.Both Ms González and Mr Noboa have tried to address voters' concerns about Ecuador's skyrocketing murder rate and the increasing power of gangs. Mr Noboa has suggested moving some of Ecuador's most hardened criminals to prison ships off the Ecuadorean coast, in order to break up the prison gangs which have engaged in deadly warfare inside the country's penitentiaries.  He also wants to boost the security at Ecuador's borders and ports to disrupt key drug-trafficking routes. Ecuador is located between Colombia and Peru, the top two producers of cocaine in the world, and has become a transit country for the drug.Mr Noboa has suggested installing scanners at ports and airports to ensure more shipments of cocaine are intercepted. He has also tried to appeal to voters by promising to boost employment opportunities.Ms González has said that if elected, she would tackle the root causes of crime, fostering social integration and creating job opportunities for those who may be tempted to join the ranks of the gangs for lack of prospects. If she were to win, she would become Ecuador's first elected woman president. However, her opposition to abortion even in cases of rape and incest has alienated some of the women voters who want to see a woman lead the country.Whoever wins will only have until May 2025 in office, serving out the term begun by outgoing President Guillermo Lasso. This is due to the fact that the current presidential election was triggered early when Mr Lasso dissolved parliament amid an impeachment trial.",
  "datetime": "2023-10-15T13:29:04.000Z",
  "title": "Ecuador chooses president during wave of violence"
}
