{
  "text": "Wales faces a \"tidal wave of blindness\" unless urgent improvements are made to the way specialist eye care is delivered, a leading doctor has said.Latest figures show 75,000 people at greatest risk of losing their sight are waiting too long for treatment.This number has almost doubled in just four years.The Welsh government said it was improving access to eye care services, including opening new mobile theatres and community clinics.RNIB Cymru said a shortage of specialists was making the \"crisis\" worse.Jennifer Huggett from Pembrokeshire has had to give up many things she held dear because of her deteriorating eyesight.\"I was working in a charity shop and enjoying it and in the end I had to give it up because I couldn't read the labels,\" she said.\"I also had to give up [driving] my car and that was heart-breaking.\"The retired health visitor has a number of eye conditions including \"wet\" macular degeneration -  which means her eyesight could deteriorate quickly without regular eye injections.It's recommended these are given around every six weeks.But Jennifer's most recent appointment at Withybush hospital was postponed, meaning by the time of her next injection she will have been waiting almost five months.\"This delay isn't good timing for me is it really, half way through the job,\" she said.\"A year ago when I was reading hospital appointment letters, I could read them quite easily. Now I have to use a magnifying glass - that makes me realise the loss I've had.\"When I go shopping, it's very embarrassing, I have to ask people where things are.... and that's one thing I really don't like to do.\"In 2019, Wales became the first UK nation to introduce new eye care targets to try to make sure those at greatest risk of blindness get priority treatment.Patients are given a maximum waiting time date, according to their level of risk and how urgently they need to be seen.The figures also show some considerable variation between health boards.Eye care experts argue that it is vital to prioritise patients based on urgency because diseases such as glaucoma and age-related macular degeneration can lead to permanent blindness more quickly than some other eye conditions.Gwyn Williams, president of the Royal College of Ophthalmologist in Wales, said: \"In truth we were barely coping when Covid came along and now we have no hope without innovative ideas and substantial investment in services infrastructure and new ways of working.\"He said it was \"too late for sticking plaster solutions and throwing money at existing structures.\"Mr Williams called on the health minister to act on an 2021 external review of eye care, which found Wales had some of the lowest numbers of specialists anywhere in the UK.Unless that happens, backed with resources, the impact would be \"catastrophic\".\"(We'll see) a tidal wave, a tsunami of blindness across the whole country unless we are able to reorganise,\" he said.Of the patients attending a monthly eye care support group in Tenby, most had experienced considerable delays.Neil Chandley said he'll have to wait at least another 12 weeks for his next eye injection for macular degeneration after waiting 12 weeks already.\"I had an 19-week delay once\" he said.\"And before that happened I could tell the time on my wristwatch. The consultant was extremely angry with me for not having come sooner. But I couldn't come sooner because I couldn't get an appointment and I was ringing everyone.\"\"The delays have gone haywire.... I fear it's going to be a white stick situation.\"Val Robinson, who organises the monthly group meeting for the Macular Society, said there is considerable anger amongst the members about the length of the delays.\"They are really concerned and upset that they are literally losing their sight because of the delays,\" she said.\"It's your eyesight we're talking about and once it's gone it's gone.\"Nathan Owen, external affairs manager for RNIB Cymru, said the delays are having a profound effect on the lives of many thousands of people in Wales.\"We are hearing from people terrified at home watching television, experiencing a deterioration while waiting for their next appointment,\" he said.\"We know sight is the sense people are most afraid of losing.\"So you can imagine someone knowing that if they were seen on time their sight could be saved, but purely because there is no capacity in the system they are loosing their sight as a result.\"That must be a terrible thing to come to terms with.\"Mabon ap Gwynfor, Plaid Cymru's health spokesperson, said: \"There's a lot of noise around waiting lists - quite rightly.\"They are too long but when tackling waiting lists they have to make sure the most urgent cases are seen first.\"He said because of the pressure on health boards they were \"going through the easy pickings or low hanging fruit.\"Keith Jones, director of secondary care at Hywel Dda health board, which covers Pembrokeshire, said it regretted that some patients were waiting longer than they would like but it was taking several measures, including working with neighbouring health boards to improve services available.It had also worked with the independent sector to treat nearly 1,000 cataract patients.\"Despite the successful recruitment of several locum staff, we continue to experience recruitment challenges among our permanent consultant workforce and are exploring regional opportunities to attract new recruits to meet the needs of patients across the south west Wales region,\" said Mr Jones.The Welsh government said it was improving access to services, which was helping to increase the number of cataracts procedures undertaken and reduce the need for people to attend hospital. \"We are also funding an ophthalmology simulation suite in Wales to meet new trainee requirements, enhance training and improve patient outcomes,\" said a spokesperson.The NHS Wales University Eye Care Centre was providing specialist learning opportunities for optometrists and treating more complex eye cases outside hospitals to reduce waiting times.\"We are also working to enable optometrists on the high street to manage, monitor and treat an increased number of eye conditions so people can receive eye care in the community earlier,\" they added.",
  "datetime": "2023-08-01T05:07:16.000Z",
  "title": "Eye care - Wales faces tidal wave of blindness - doctor"
}
