{
  "text": "More Americans than ever are dying from fentanyl overdoses as the fourth wave of the opioid epidemic crashes through every community, in every corner of the country.It was six years ago that Kim Blake's son Sean died from an accidental fentanyl overdose in Burlington, Vermont. He was 27 years old.\"Every time I hear of a loss to substance use, my heart breaks a little more,\" Ms Blake wrote in a blog dedicated to her son in 2021.\"Another family shattered. Forever grieving the loss of dreams and celebrations.\"That year, the US witnessed a grim milestone: for the first time ever, drug overdoses killed more than 100,000 people across the country in one single year. Of those deaths, more than 66% were tied to fentanyl, a synthetic opioid 50 times more powerful than heroin. Fentanyl is a pharmaceutical drug that can be prescribed by a doctor to treat severe pain. But the drug is also illegally manufactured and sold by criminal gangs. Most of the illegal fentanyl found in the US is trafficked from Mexico using chemicals sourced from China, according to the Drug Enforcement Administration (DEA).In 2010, less than 40,000 people died from a drug overdose across the country, and less than 10% of those deaths were tied to fentanyl. Back then, deaths were mostly driven by the use of heroin or prescription opioids. The contrast is outlined in a study released this week by researchers at the University of California, Los Angeles (UCLA) that examines trends in US overdose deaths from 2010-21 using data compiled by the US Centers for Disease Control and Prevention. The data paints a clear picture of how fentanyl has redefined drug overdoses in America over the last decade.\"The rise of illicitly manufactured fentanyl has ushered in an overdose crisis in the United States of unprecedented magnitude,\" the study's authors wrote. Virtually every corner of the US, from Hawaii to Alaska to Rhode Island, has been touched by fentanyl. The rise in fentanyl-related deaths was first observed in 2015, the data shows. Since then, the drug has spread across the US and death rates have grown sharply. \"In 2018, around 80% of fentanyl overdoses happened east of the Mississippi river,\" Chelsea Shover, an assistant professor at UCLA's school of medicine and co-author of the study, told the BBC. But in 2019, \"fentanyl becomes part of the drug supply in the Western US, and suddenly this population that had been insulated from it is exposed, and death rates start to go up,\" Prof Shover said.In their study, the researchers sound the alarm on another growing trend: deaths related to the use of fentanyl and another stimulant drug, like cocaine or methamphetamine.This trend is being observed across the US, albeit in different ways owing to drug use patterns that differ from region to region. For example, researchers found higher death rates related to the use of fentanyl and cocaine in north-eastern US states, like Vermont and Connecticut, where cocaine has been traditionally more available. But for virtually everywhere else in the country, from West Virginia to California, deaths were primarily driven by the use of both methamphetamines and fentanyl. This video can not be playedExpert: Fentanyl crisis has ‘only gotten worse’Ms Blake, who is also a trained physician, said her son sporadically used cocaine, though his toxicology report revealed only fentanyl in his system. She learned that many use fentanyl along with another stimulant for a prolonged high. \"It's no surprise to me that we're seeing such an increase in stimulant-opioid combinations,\" Ms Blake told the BBC. When fentanyl first arrived in the US as part of the illegal drug supply, \"a lot of people did not want it\", Prof Shover said. But the synthetic opiate became widely available as it is cheaper to produce compared to other drugs. It is also highly addictive, meaning people who struggle with substance use and are exposed to it often seek it out to avoid painful withdrawals.Across the US, the study identified states like Alaska, West Virginia, Rhode Island, Hawaii and California as having the highest rates of overdose deaths involving fentanyl and another drug. These states have historically high rates of drug use, Prof Shover said. With the arrival of fentanyl, drug use in those areas has become more lethal. The opioid crisis has been traditionally portrayed as a \"white problem\", Prof Shover said. Her study, however, revealed that African Americans are dying from a combination of fentanyl and other drug use at higher rates, across age groups and geographical lines.For Rasheeda Watts-Pearson, an Ohio-based harm reduction specialist, the data reflects what she has seen in her region. She has been doing outreach work with A1 Stigma Free, a grassroots organisation that was founded just eight months ago to tackle a notable rise of overdose deaths within the African-American community in Cincinnati. As part of her work, Ms Watts-Pearson frequently visits barbershops, bars and grocery stores to talk to people about the deadly impacts of fentanyl. She said she does this because of a lack of awareness, driven partly by historic healthcare disparities experienced by racial and ethnic minority groups.Even marketing campaigns made to bring awareness to the opioid crisis have not included the experience of black Americans, she said. \"I can drive down Avondale right now, there is a billboard that says 'Opioid Crisis', but there's two white people on that billboard,\" Ms Watts-Pearson said.A big blind spot for her community has been fentanyl-laced street drugs, she said, which has led to people unknowingly using the deadly, synthetic opioid, and developing a dependency to it. \"The coroner's office is seeing people overdose and die off of cocaine, off of crack, off of pills, with traces of fentanyl,\" she said. \"It has been infiltrated in the black community now, and not enough people are talking about it.\"The lethal use of fentanyl in combination with other drugs has marked the \"fourth wave\" of the overdose crisis in the US, researchers have said. And experts like Prof Shover have cautioned that treatment options in the US for substance use have not kept up.\"Our treatment system for substance use disorder is often focused on one drug at a time,\" Prof Shover said. \"But the reality is, many people who use drugs use more than one kind of drug.\" To keep her son's memory alive, Ms Blake has been outspoken about her loss and has helped other families go through their grief of losing a loved one to an overdose. \"Everyone has a story, and for a parent who has lost a child, that is forever,\" she said. Her son had been enrolled in treatment a few times during his battle with substance use disorder. The experience taught Ms Blake that care options vary from state to state, and in many cases, what is available is not enough. \"Ideally, I think we would see something where people would get treatment rapidly, whenever they want it, and long-term,\" she said. Ms Blake also raised the idea of overdose prevention sites, where people could use drugs safely and under supervision. Those sites are widely available in Canada - which has its own fentanyl crisis - but only two sanctioned sites exist in the US. Above all, Ms Blake has called for compassion and understanding for those who are struggling with substance use. \"Most people I talk to, their kids did not want to die,\" she said. This video can not be playedOn America's trail of destruction",
  "datetime": "2023-09-17T10:34:08.000Z",
  "title": "How the fentanyl crisis' fourth wave has hit every corner of the US"
}
