{
  "text": "A Korean War veteran who survived almost three years as a prisoner of war (PoW) has been honoured in a ceremony marking 70 years since his release.Roy Mills, 93, from Cinderford, was captured after six days of intense fighting at the Battle of Imjin River.The battle, fought between 22 - 25 April 1951, was a pivotal moment in the Korean War.Mr Mills is the oldest surviving veteran from the Gloucester regiment known as the Glorious Glosters.He was honoured during an event in the centre of his home town of Cinderford earlier, with people gathering around the cenotaph.During the battle, about 4,000 troops of the British 29th Brigade, including about 700 from 1st Battalion, The Gloucestershire Regiment, faced more than 27,000 men of the Chinese 63rd Army.About 400 Glosters fought a last stand on Hill 235, which was later renamed Gloster Hill.The stand-off on Gloster Hill allowed time for UN forces to regroup and block the Chinese advance on the capital of South Korea, Seoul.Mr Mills endured starvation, torture, and disease as a PoW until being released in 1953.\"He was one of the unfortunate soldiers to be captured and spent a gruelling time under the Chinese care,\" said Kenny Durham from the Forest of Dean Branch of the Gloucestershire regiment.\"Roy probably should have have got a bravery award during the battle. \"Unfortunately, that didn't happen and it was thought that we should do something for him,\" he added.During the siege, Mr Mills volunteered to climb down the hill and bring back precious water to help sustain the troops and cool down gun barrels to prevent them overheating. \"Our dad volunteered to climb down the hill with jerry cans tied to his back. Without water they wouldn't have been able to carry on,\" said his son Kenny Mills.For their heroic stand during the Battle of the Imjin River, the Glosters were given the Presidential Unit Citation - the highest US award for extraordinary heroism and collective gallantry in battle.Follow BBC West on Facebook, Twitter and Instagram. Send your story ideas to: bristol@bbc.co.uk ",
  "datetime": "2023-09-05T14:45:36.000Z",
  "title": "Imjin River - Korean War veteran Roy Mills honoured by community"
}
