{
  "text": "K-pop star J-Hope from BTS has had Scottish red squirrels adopted in his name by fans for his 25th birthday.The South Korean singer's British fans raised over £600 for the endangered species, while fans from around the world raised money for other charities.The BTS army, as the group's fans are called, responded to J-Hope's call for birthday donations instead of gifts.The singer reportedly donated £68,000 to ChildFund Korea for the upkeep of his former high school in Gwangju.The wildlife group Saving Scottish Red Squirrels was approached by a British university student who fundraised enough to adopt 37 red squirrels - a quarter of the total red squirrel adoptions the charity had last year.\"J-Hope already knows about the red squirrel adoptions, he came across it in a Korean article,\" Lisa Ireland told the BBC.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitter’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\"J-Hope is often likened to a squirrel because he has cheeks that pop out when he eats,\" the 20-year-old said, after being inspired by other fans who had adopted a koala for BTS member RM for the same reason.\"This is the first time there's been an adoption in the name of a celebrity and someone as big as J-Hope,\" said Rory Syme from the Scottish Wildlife Trust. Most people adopted one animal to mark weddings, birthdays and anniversaries, he said. \"It's fantastic that fans want to celebrate J-Hope, but also support things like the Scottish Wildlife Trust.\"The endangered red squirrels are the UK's only native squirrel, and their continued survival has been threatened by a growing number of grey squirrels, originally from the US. Korean reports say at least 35 charitable projects by BTS fans have been started to honour J-Hope, whose real name is Jung Ho-seok.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitter’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.",
  "datetime": "2019-02-21T16:47:18.000Z",
  "title": "J-Hope - BTS fans 'save' squirrels for K-pop star's birthday"
}
