{
  "text": "A second K-pop star has dramatically quit the music business, in a growing industry sex scandal.Jung Joon-young, 30, admitted to secretly filming himself having sex with women and sharing the footage. \"I admit to all my crimes,\" said Jung in a statement. He also promised to drop all his TV and music work.It comes a day after superstar Seungri from the group Big Bang quit the industry after he was charged with sex bribery.Jung, who is accused of taping 10 or more women, is due to be questioned by Seoul Metropolitan Police on Thursday.\"I filmed women without their consent and shared it in a chatroom, and while I was doing so I didn't feel a great sense of guilt,\" said Jung in the statement released late on Tuesday.It came after South Korean broadcaster SBS reported allegations that he had filmed his own sex videos without his partners' permission, and shared them with friends in a mobile chat group during 2015-16. He apologised to the fans he had \"outraged\", and to the women whose privacy he violated.  \"Throughout the rest of my life, I will repent on my immoral and illegal acts that constitute crimes,\" he said.\"I will faithfully cooperate with an investigation by police that will start on Thursday and I will readily accept whatever punishment is in store for me.\"This is not the first time Jung has been accused of filming a sexual encounter without consent. An ex-girlfriend made an allegation against him in 2016, but ultimately withdrew it. The singer-songwriter, best known for his part in a variety show, claimed she had agreed to the filming.South Korea has been fighting an epidemic of \"spy cam porn\" in recent years. Hidden cameras are sometimes placed in toilets and changing rooms, then uploaded online without the knowledge of victims.The country saw more than 6,000 cases reported in 2017 alone. This video can not be playedThe use of hidden and up-skirt cameras is a huge problem in South KoreaThe case against Jung was discovered during a separate police investigation into K-pop superstar Seungri - who was reportedly a member of Jung's group chat. Seungri, whose boyband Big-bang have sold more than 140 million records, has been charged with supplying prostitutes to potential business investors - and police reportedly found Jung's videos while investigating that case.Seungri, 28, retired from the entertainment industry on Monday and promised to co-operate with police. He denies procuring sex workers.",
  "datetime": "2019-03-13T08:29:47.000Z",
  "title": "Jung Joon-young - K-pop star quits over secret sex videos"
}
