{
  "text": "K-pop singer HyunA has been sacked by her record label after her relationship with bandmate E'Dawn became public knowledge.Many K-pop artists - often known as \"idols\" - are not allowed to enter into any form of romantic relationship while under contract.In September, Cube Entertainment said no decision had been made to \"oust\" HyunA (Kim Hyun-ah) or E'Dawn (Kim Hyo-jong), after it emerged the pair had been in a secret relationship for over two years.But the label has now announced HyunA's contract has been \"terminated\".\"We sincerely thank the artist who has been with us until now and fans once again,\" said Cube Entertainment in a statement. No public announcement has yet been made on the contract of E'Dawn, who is signed to the same label.After news broke of her sacking, HyunA posted a short video on Instagram of her and E'Dawn together.This article contains content provided by Instagram.  We ask for your permission before anything is loaded, as they may be using cookies and other technologies.  You may want to read Meta’s Instagram cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.Cube Entertainment CEO Shin Dae-Nam previously said in September 2018 that singers HyunA and E'Dawn had not been sacked by the company.The head of the major South Korean music label denied reports that HyunA and E'Dawn, two members of the pop trio Triple H, were sacked after revealing their relationship.\"We've yet to make an official decision on the rumour that HyunA and E'Dawn would be ousted,\" read the statement on Naver, a major South Korean website. \"We are still discussing it, it is not a confirmed decision. Since the opinions of the artists are also important, this should be deliberately decided through the process of collecting opinions.\"This video can not be playedWhat do non-Koreans love about K-pop?HyunA has had a successful solo career and E'Dawn is also known as a member of boy band Pentagon. The pair formed Triple H as a side project with fellow Pentagon singer Hui.The relationship was revealed by HyunA, confirmed in a post on Instagram, telling her followers she \"wanted to stay honest\".This article contains content provided by Instagram.  We ask for your permission before anything is loaded, as they may be using cookies and other technologies.  You may want to read Meta’s Instagram cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.The change comes after many on social media specifically pointed to the fact HyunA has worked for Cube Entertainment for far longer than the CEO.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitter’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.The decision to sack the pair was heavily criticised. Some fans defended HyunA by asking how her work for Cube Entertainment could be ignored simply because she was in a relationship.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitter’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.Others came to the defence of E'Dawn, with fans referencing his struggle to land a contract with the label on TV show Pentagon Maker - a reality talent show where people competed to be part of the band.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitter’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitter’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.Those not familiar with K-Pop might recognise HyunA from her appearance in the music video for Psy's crossover hit Gangnam Style, where she can be seen dancing on an underground train before joining Psy in a larger routine.The success of the video led the pair to release a new version of Gangnam Style sung as a duet, which has been viewed over 720 million times on YouTube.",
  "datetime": "2018-10-16T16:07:27.000Z",
  "title": "K-pop - HyunA sacked over relationship controversy"
}
