{
  "text": "Amid ongoing protests in America against racism and police brutality, a global legion of K-pop fans has emerged as an important ally for the Black Lives Matter (BLM) movement.Fans of South Korea's popular music industry have raised funds for BLM and mobilised to overload social media hashtags used by its opponents, earning appreciation from protesters for their political activism.Some may have been surprised by their impact, but K-pop observers note fans have long organised support for social and political causes as well as their favourite artists.This support has, however, also raised questions about systemic racism in the industry and fandom, leading to calls for K-pop to address its own complicated relationship with race.Following the outbreak of protests in the US, sparked by the death of black man George Floyd, the Dallas Police Department asked people to share videos of \"illegal activity protests\" through the iWatch Dallas app. K-pop fans worldwide responded by inundating it with fan-recorded videos, known as fancams, and memes of various K-pop artists, in an effort to prevent police from tracking protesters' actions. Barely a day later, the app was reported to be experiencing technical difficulties  though Dallas Police would not say if it was due to the fancams. This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitter’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.K-pop fans also spammed hashtags used to oppose BLM on social media, such as #AllLivesMatter, #BlueLivesMatter and #WhiteLivesMatter. Though this made such hashtags trend higher, it also made it harder for their original messages to be seen.K-pop fans, who have previously been derided online and criticised for \"fancam spam\", were celebrated as valued allies of the protestors.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitter’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.See also:Many K-pop artists voiced their support for the movement on Twitter and Instagram, and some donated to the cause.When popular boy band BTS announced a $1m (£784,000) donation, fan group One In An Army (OIAA) organised its own fundraising drive and matched the amount in less than 24 hours.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitter’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.To many outside K-pop fandom, this political activism and co-ordination was a surprise.However, those who follow K-pop closely consider such fans' organisation and impact perfectly natural.Fans in South Korea and worldwide routinely run well-co-ordinated campaigns to promote their favourite artists and propel them to awards and charts success and greater visibility. These skills are now being applied to the BLM cause.As Hyunsu Yim, a pop culture reporter for The Korea Herald, has noted in a Twitter thread, this is far from the first time K-pop fans have made a political or social impression.He illustrated his point with previous examples of activism: donations to a London charity to fund over 35,000 meals; calls for safer roads in Bangladesh; and Chile's government in 2019 blaming K-pop and other \"international influences and media\" for domestic protests.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitter’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.But while many have praised K-pop fans for their involvement in the protests, some are highlighting the longstanding abuse and harassment of black fans, many of whom have left fandoms as a result.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitter’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.Hashtags like #BlackARMYSMatter and #BlackARMYSEquality trended on Twitter in 2018 after black members of the BTS ARMY complained of racism within the fandom. Fans of other artists have also complained of racism in their communities.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitter’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.Observers also question why K-pop idols - many of whom have expressed support for the US protests - are often silent when it comes to discrimination in South Korea.This may partly be to avoid a backlash from their more conservative fans. Many female idols have been criticised for expressing feminist views, and many who speak up for LGBTQ rights abroad shy away from such issues at home.Agencies may also exercise control over what the performers say. After Denise Kim, a member of rookie girl group Secret Number, expressed her support for BLM on Instagram, her Instagram and SoundCloud accounts were deleted and her agency's Instagram account deleted its latest photo of her.Fans criticised Kim's agency and are now increasingly voicing their outrage about such censorship, as well as calling out idols for hypocrisy.When Amber Liu, a member of girl group f(x), called for George Floyd's killer to be charged with first-degree murder, some pointed out that in 2019 she said that a black man - seen being harassed and arrested in a viral video - \"deserved it\". For K-pop, a multi-genre industry heavily influenced by black culture and music, the Black Lives Matter movement has highlighted the need for artists and fans to do some soul-searching.But as these protests have shown, their impact on society cannot be underestimated. When harnessed for a cause, K-pop has the potential to make a difference.",
  "datetime": "2020-06-11T00:54:03.000Z",
  "title": "K-pop fans emerge as a powerful force in US protests"
}
