{
  "text": "K-pop superstars BTS have announced that they will be taking an \"extended\" break from performing following a concert in Seoul on Sunday.Their agency Big Hit Entertainment said the seven members would be undergoing a \"period of rest and relaxation\".It added that the break would \"provide them with a chance to enjoy the ordinary lives of young people in their 20s, albeit briefly\".This is the first time BTS will have taken time off since their 2013 debut.It is not clear how long the break will last but they are scheduled to perform in Saudi Arabia in October as part of their world tour \"Love Yourself: Speak Yourself\". It's possible their break is necessary because South Korean males still have to complete two years of compulsory military service between the ages of 18 and 28.All of the BTS band members fit this age bracket.Exemptions are occasionally granted - Tottenham forward Son Heung-min avoided military service for South Korea last year after helping his country beat Japan 2-1 in the Asian Games football final.A gold medal at the event, along with an Olympic podium finish, is the only automatic way for a South Korean footballer to be excused a call-up.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitter’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.BTS is one of the world's biggest boy bands, and boasts a huge and devoted fanbase.Comprised of members RM, Jungkook, Jin, Suga, J-Hope, Jimin and V - the band became the first Korean act to top the UK charts earlier this year. Then in June, they became the first South Korean group to headline Wembley Stadium.Known for their meticulously choreographed dance style and boyish good looks, they were the first K-pop group to reach number one on the US album charts.On Twitter, many BTS fans - who call themselves ARMY - said the boys deserved the hard-earned break.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitter’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitter’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitter’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.The band has been performing since 2013. In 2017, their album Love Yourself: Her was the first K-Pop album to crack the top 10 US album charts, rising to number seven.It also hit the number one spot on iTunes in more than 70 countries.K-pop was conceived in South Korea in the 1990s as a Western-Asian hybrid and is now a multi-million dollar industry with many bands winning audiences around the globe.This video can not be playedBTS open up about their \"struggles and tears\" at press conference in Seoul",
  "datetime": "2019-08-12T09:52:53.000Z",
  "title": "K-pop group BTS to take 'extended' break from performing"
}
