{
  "text": "Fans of K-pop say they are finding a sense of community in Birmingham, as places dedicated to the musical genre continue to spring up.The first studio dedicated to the music opened in the city in April and new shops cater to the area's fanbase.The popularity of K-pop has continued to spread with bands topping the UK album chart in the past three years.\"Seeing it grow and be able to have a place to go and buy my albums is really special,\" one fan, Hannah, said.KPOPPINUK, which claims to be the first dedicated K-pop shop in Birmingham, held a photo-trading-card event on 4 December to allow fans to meet friends and buy merchandise.   Owner Jane Langley said: \"We have a really big community, it's about having somewhere to buy albums physically and also being able to interact personally with other fans.\" Fan Lexy said she used to be made fun of at school for liking the chart-topping music, but she said it was considered more normal now and \"the atmosphere at K-pop concerts is really friendly\".The new spaces were allowing people to find a sense of community, the fans said.Korean-exchange student Hayoon said she felt welcomed by the growing British interest in Korean pop culture.It gave her confidence and had been, she said, \"a great way to make new friends\".K-pop dance studio XI only opened in Birmingham in April, although fans have already found ways to learn routines together and perform in public places. IVIX is just one of several K-pop dance groups in Birmingham and leader Emily Hancocks described the group as a second family.She said: \"We meet up pretty much every weekend, it just makes me feel really happy.\"The genre's popularity has been notable, as band Blackpink became the first K-pop girl group to top the UK album charts, three years after boyband BTS did the same.The industry annually generates about $10bn for South Korea, according to non-profit group International Socioeconomics Laboratory. Although none of the biggest K-pop acts have yet played a concert in Birmingham, fans in the West Midlands are hoping that will change in the near future.Follow BBC West Midlands on Facebook, Twitter and Instagram. Send your story ideas to: newsonline.westmidlands@bbc.co.uk",
  "datetime": "2022-12-21T08:06:43.000Z",
  "title": "K-pop fans in Birmingham find sense of community"
}
