{
  "text": "A South Korean court has sentenced K-pop stars Jung Joon-young and Choi Jong-hoon to six and five years in prison for gang raping drunk unconscious women.Jung was also charged with filming the assault and distributing the footage.The men will have to do 80 hours of sexual violence treatment courses and are banned from working with children.The case is one of several sex and abuse scandals that have rocked the K-pop world in recent years. Judge Kang Seong-soo said that Jung, 30, had raped women who were \"drunk and unable to resist, filmed them nude and having sex, then spread it on a group chat\".\"We can't imagine the pain the victims might have felt who found out later.\"He also said it seemed Jung viewed the victims just as a tool for pleasure.In the final testimony, Jung - who rose to fame on a TV talent show - said: \"I deeply regret my foolishness and I feel great remorse.\" \"From now on, I shall only... live in remorse,\" he added. In March, he quit the music business after admitting that he secretly filmed women and shared the videos.On Choi - a former member of the band F.T. Island, which had number one albums in South Korea - the court said the 30-year-old \"did not feel remorse after mass-raping drunken victims\".The allegations involving some of the the biggest stars of the K-pop world have become a growing scandal.When we investigated the issue earlier this year, lawyer Cha Mee-kyung described these rapes as \"hidden crimes\". I was told women did not want to come forward out of shame, and fear they would be judged - rather than their attackers.Take this chat-room reaction to today's sentence as an example.\"This is rather too much for this type of crime. These women were not kidnapped on the street, but followed the handsome singers.\"But young women are realising that together, they do have a voice. In protests and marches they are speaking out. Thanks to them, things are changing.Two K-pop stars who joked about gang-raping women with their friends are now behind bars.At the very least, this horrific crime - which has taken place in the shadows of South Korean society - has been dragged into the light.The case against the two was discovered during a separate police investigation into K-pop superstar Seungri - who was reportedly a member of Jung's group chat.Seungri, whose boyband Big-bang have sold more than 140 million records, has been charged with supplying prostitutes to potential business investors.Police reportedly found Jung's videos while investigating that case.You may also be interested in:This video can not be playedSoo-yuen Park has dedicated her life to helping the victims of digital sex crimes in South Korea.",
  "datetime": "2019-11-29T06:13:51.000Z",
  "title": "K-pop stars Jung Joon-young and Choi Jong-hoon sentenced for rape"
}
