{
  "text": "Fans of Korean pop music (K-pop) have taken over the #WhiteLivesMatter hashtag by posting images and videos of their favourite singers.Use of the tag had increased as a response to the #BlackLivesMatter movement, with many posters opposing or criticising the protests.After K-pop fans flooded the hashtag with photos and videos, the term started trending on Twitter.Some fans are now focusing on other tags such as #AllLivesMatter.The #BlueLivesMatter hashtag has also increased in popularity, often used in support of the police and criticising #BlackLivesMatter protesters.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitter’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitter’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.By flooding the tags with videos and memes, the K-pop fans hope to drown out racist or offensive posts.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitter’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.The protests began following the release of a video showing African-American George Floyd being arrested in Minneapolis.In the video, a white police officer is seen kneeling on Mr Floyd's neck even after he pleads that he cannot breathe.Mr Floyd's death has sparked huge protests across the US against racism and the police killings of black Americans.Charges have been announced against all four of the police officers present during the death of Mr Floyd.The vast majority of demonstrations over the past eight days have been peaceful, but some have turned violent and curfews have been imposed in a number of cities.Clicking on the #WhiteLivesMatter hashtag now displays thousands of K-pop posts and messages of support for the US protesters.On Tuesday, the #BlackLivesMatter tag was also flooded, as thousands of people posted a plain black square in support of a social media \"blackout\" campaign.The flood of posts made it difficult for people to see updates about the protests or share important information using the #BlackLivesMatter tag.Activists urged people to use the term #BlackOutTuesday instead.",
  "datetime": "2020-06-04T13:02:51.000Z",
  "title": "K-pop fans drown out #WhiteLivesMatter hashtag"
}
