{
  "text": "A group of Korean War veterans from Wiltshire is to disband, because of the age and ill-health of its members. The Wiltshire & Swindon Korean War Veterans Association held its last function this afternoon.It came shortly after a ceremony in Royal Wootton Bassett to commemorate the 70th anniversary of the end of fighting in the Korean War.Secretary Bert Davey said he was \"very sad\" to close the group.The Korean War ended with a ceasefire of hostilities on 27 July 1953, although there has never been a formal peace agreement and no official peace has ever been declared.Over 81,000 UK service personnel served in the war and on peace-keeping duties. Of those, over 1,100 lost their lives.Today's ceremony in Royal Wootton Bassett was the last formal engagement for members of the Swindon & Wiltshire Korean Veterans Association.Bert Davey lost his brother Tom aged 21 on 2 June 1951, while he was serving with the King's Shropshire Light Infantry, and the association has been a large part of his life.He said: \"Losing my brother Tom had a big effect on me and my own vulnerability. Tom disappeared from my life and we had no opportunity to say our final goodbyes.\"Over the years you got odd photos of the cemetery, but when the local branch of the British Korean War Veterans Association asked me to join I was now with men who had served in that country and could tell me everything about the war. They enabled me to go back and visit my brother's grave for the first time in basically 50 years.\"But with the age of members and the difficulties of travelling, the branch has now taken the difficult decision to disband. Mr Davey said: \"It's sad but it's been a reality check for some while. I lost four veterans in just a few weeks over the Christmas period. Also, we have members scattered around and it is very very difficult for them to come to meetings. \"So it is sad but I'm keen that we'll have social reunions. We have several widows of previous veterans in our ranks. They love to meet and it helps considerably.\"Armed Forces Minister James Heappey, also the MP for Wells in Somerset, attended a ceremony in South Korea on 26 July to mark the signing of the armistice which brought hostilities to a close.He laid a wreath at the Battle of Imjin Memorial, also known as the Gloster Hill Memorial in memory of personnel from the Gloucestershire Regiment who died in one of the conflict's deadliest battles.James Heappey said: \"This anniversary presents an opportunity to reflect with pride on the role that all played in securing freedom for South Korea, on which a vibrant, dynamic and democratic society has been built.\"Follow BBC West on Facebook, Twitter and Instagram. Send your story ideas to: bristol@bbc.co.uk ",
  "datetime": "2023-07-27T15:59:54.000Z",
  "title": "Korean War - Wiltshire veterans group to disband"
}
