{
  "text": "A veteran of the Korean War has been sharing his memories on the 70th anniversary of the conflict's end.Dennis Jenkinson, from Ashurst in the New Forest, was a 21-year-old serviceman on the peninsula when the guns stopped firing on 27 July 1953.He hopes others will reflect on the sacrifices made by thousands of allied and American troops in what is often referred to as \"the forgotten war\".Mr Jenkinson recalled \"everyone smiling and shaking hands\" after the armistice.He was 18 when he joined the British Army to complete his two years of National Service. That same year, on 25 June 1950, North Korea had invaded South Korea following clashes along the border and rebellions in the south. North Korea was supported by China and the Soviet Union while South Korea was supported by the United States and allied countries. Mr Jenkinson, 91, said: \"In those days, young men had to do two years in the forces, but you were with your friends all the time laughing and joking. It never entered my head to be worried about [the war].\" In 1952 Mr Jenkinson was sent to Korea as a radio operator for the King's Regiment Commonwealth Division, made up of British, Australian and New Zealand forces. He said: \"There was lots of firing going on. Fortunately we had tanks, they didn't and our tanks were perched up on a hill behind us constantly firing at their hills - keeping them down so to speak - and we were just waiting for them if they did decide to advance.\"About eight of the people that I was joined up with got killed. Those scenes have stayed with me to a large degree.\" On 27 July 1953, Mr Jenkinson remembers \"there was silence for quite a while\" and at 10:00 BST the ceasefire was called after three years of fighting.He explained: \"They came out of their trenches, we went out of ours and met in no man's land, shaking hands, smiling - everybody was completely different to what I thought it would be.\" Mr Jenkinson married his sweetheart Betsy in 1956 and they had four children. He returned to a career in printing and then became a lecturer in Portsmouth, before eventually settling in the New Forest. Now, 70 years on, the couple hope people will take time to remember those who did not come home. Mrs Jenkinson said: \"Wherever people have stood up for what they believe in, in many ways put their body and soul into it, they should be remembered - we shouldn't forget them.\" Philippa Rawlinson, from the Royal British Legion, added: \"More troops were killed in the Korean War than any other war since World War II. Yet now, 70 years since the end of the conflict, many feel Korea is the 'Forgotten War'. \"It is vital that we all remember and honour those who served in the Korean War and that the sacrifice of the 1,100 British men who lost their lives is never forgotten.\" Follow BBC South on Facebook, Twitter, or Instagram. Send your story ideas to south.newsonline@bbc.co.uk.",
  "datetime": "2023-07-27T05:21:19.000Z",
  "title": "Korean War veteran reflects 70 years after conflict's end"
}
