{
  "text": "\"When you go back there and you see all those chaps laying there that you knew. They haven't got old like us, you think - well was it all worth it?\"Edgar Green was 19 and doing his national service when the Korean war began in 1950. The conflict, which ended in 1953, is often known as the Forgotten War.This summer marks 70 years since it ended, and for veterans like Mr Green it provides an opportunity to look back.He had been 18 when he was initially called up for national service, and spent much of it in the then-British colony of Hong Kong.Mr Green, from Aldermaston, said: \"As my father said to me, go in there, you've got 18 months to do, keep your nose clean, and you'll be out of it as quick as that.\"But it didn't end like that\".The Korean war started in June 1950, when North Korea invaded South Korea following clashes along the border and rebellions in the south.North Korea was supported by China and the Soviet Union while South Korea was supported by the United States and allied countries.Mr Green was based with the Middlesex regiment at the time, who were among the first British contingent to arrive in Korea, forming part of the 27th Commonwealth Infantry Brigade.\"We were shipped off to a country I've never even heard of\", he said.Whilst in Korea, Mr Green played a key role in resupplying front lines, and participated in a breakout from the Pusan perimeter, pushing the enemy back across the Naktong River. The 27th Commonwealth Infantry Brigade also consisted of the Argyll and Sutherland Highlanders regiment.The 92-year-old said: \"We took Middlesex hill, that was the main objective. But at the same time the Argyll's were taking their hill, and poor devils, they copped it.  \"They lost 100 men just like that - wounded and killed. I think about the chaps we left behind.\"He said: \"We went out from Hong Kong to Korea in jungle green because of the hot weather, and in October the hot weather changed overnight to 40 degrees below.\"He said British troops only had tropical clothing to wear, plus one blanket to sleep on the ground with, adding that \"if you were killed, they wrapped you up in that\".Mr Green saw one day of the Battle of Kapyung, before leaving Korea on 24th of April 1951, which happened to be his 20th birthday.He has returned to South Korea eight times since the conflict ended.Almost 60,000 troops from the UK - mostly National Servicemen - fought in the Korean war, with 1,100 killed in the conflict.Estimates vary, but in total at least two million Korean civilians, up to 1.5m communist forces, and around 30,000 US and 400,000 South Korean troops are believed to have died.The 70th anniversary of the end of the war was officially commemorated by the Royal British Legion at Horse Guards Parade in July, with Edgar Green in attendance.Follow BBC South on Facebook, Twitter, or Instagram. Send your story ideas to south.newsonline@bbc.co.uk.",
  "datetime": "2023-08-11T05:07:08.000Z",
  "title": "Korean War veteran looks back on 70th anniversary of armistice"
}
