{
  "text": "As he turned the dial gently but purposefully, the sound of people speaking in foreign languages and the lilt of unfamiliar music burst through a haze of crackle and buzz. Clint Gouveia was only about seven years old at the time, listening to long wave radio in bed, late at night.\"I could hear all these voices from far away,\" he recalls. \"It inspired me to want to see the world when I got older, to travel, which eventually I did.\"Back then, in the late 1970s, there were dozens of long wave stations broadcasting. Now, only a handful are left. Among them are those in Denmark and Iceland - but they are due to shut by the end of 2023 and during 2024, respectively. The BBC still broadcasts Radio 4 on long wave as well as on digital radio, FM, and online. However, separate scheduling of BBC radio programmes on long wave will end in March next year - for example Test Match Special will not be available on long wave. The long-term future of the BBC's long wave output is far from certain. The only other remaining broadcasters in the world using the long wave band are those in Romania, Poland, Algeria, Morocco and Mongolia.\"The band is basically almost dead,\" says Mr Gouveia, who enjoys listening to radio stations from his home in Oxford. \"It all feels a bit sad, really.\" He adds that, when a long wave station shuts, he makes an effort to record its last moments.Among those who have urged the BBC to continue supporting long wave are Blur's drummer Dave Rowntree, who also recalls listening to long wave radio as a child.The BBC has not yet confirmed when, exactly, it will cease long wave broadcasts.A private firm, Arqiva, owns and operates the Droitwich transmitter in Worcestershire as well as two additional transmitters in Scotland. All three broadcast Radio 4 long wave on the 198 kilohertz frequency.In a statement, Arqiva says, \"The current long wave network assets have been operational for 36 years and are energy intensive.\" They add that \"significant further re-investment\" is required to continue long wave broadcasting. Some reports have suggested that the long wave service has become too expensive to maintain, especially now that energy prices are so high following Russia's invasion of Ukraine. Plus, an article in The Guardian in 2011 claimed that only a small number of spare valves were still available for the transmitter.\"Long wave is coming to the end of its life as a technology,\" a BBC spokeswoman tells BBC News, adding that Radio 4 long wave is currently set to continue broadcasting beyond March 2024.\"We always work closely with organisations that support vulnerable audiences around the time of any platform closure, ensuring we migrate listeners to our other platforms in a timely and sensitive manner,\" she says.The long wave transmitter at Droitwich also supplies a service called the Radio Teleswitch Service (RTS), which beams energy tariffs to some electricity meters. Just under one million such meters are still in use in the UK.\"Customers should contact their electricity supplier at the earliest opportunity to arrange for their RTS equipment to be upgraded to a smart electricity meter,\" a spokesman for Energy UK says. He adds that Energy UK and other bodies are seeking to extend RTS provision until December 2025.The death of long wave, when it comes, will be mourned by many radio fans, says John McCullagh, president of the Radio Society of Great Britain.\"It has a particular resonance that people like to listen to,\" he says, describing the noisy sound of the long wave band, which can be affected by lightning and interference from electrical devices, such as LED lights. That lack of high fidelity is not loved by all but it does give long wave its own character, he explains.Given enough power, and the right conditions, long wave signals from a lone transmitter can travel for thousands of miles.\"A lot of European countries are quite nicely sized for long wave in the sense that one long wave transmitter can do the country,\" says Chris Greenway of BBC Monitoring, who has been tracking the demise of long wave services.But in Asia, Mongolia is also a prime example - a large country with a small population where the cost of putting an FM network in place, requiring many transmitters, would perhaps be hard to justify, he points out.The BBC first began broadcasting on long wave in 1925, from a transmitter in Daventry. It was this that allowed the BBC to \"claim to be a national broadcaster,\" argues Mr Greenway. The signal was strong enough to reach up to 94% of the population at the time.Among the long wave services that have come and gone over the years was Atlantic 252. It used a transmitter in Co Meath, Ireland that went on to carry Irish radio station RTÉ Radio 1 on the same frequency. RTÉ Radio 1 ceased its long wave broadcasts in April this year and the transmitter was demolished in July.Many ex-pats still use long wave signals to connect with their home country, says Jessica Foley, a lecturer at the Institute of Art, Design and Technology in Co Dublin.This was the case for many Irish people living in Great Britain, until RTÉ Radio 1 shut its long wave service. The station continues to be available on other frequencies and platforms.It is worth investing in long wave transmitters, even if they only serve a relatively small number of people, suggests Dr Foley: \"It is a question of culture and how willing we are to tolerate the minority.\"More technology of business:Long wave also provides a connection to things \"as vast as the cosmos\", she adds. A phenomenon called the skywave effect enables some radio signals to travel further at night. This is because a layer in the Earth's atmosphere called the ionosphere cool down, making it more reflective. Electromagnetic signals can, as a result, bounce back towards the ground and cover greater distances.Mr Gouveia says, proudly, that he has been able to listen to radio broadcasts from Mongolia, in part thanks to this effect.However, the equipment required to hear long wave broadcasts is arguably now obscure. It wasn't always like that.In his spoken word song \"On Hyndford Street\", the Northern Irish singer Van Morrison recounts many memories from his childhood.He appears to allude to how the skywave effect helped to bring one now defunct, but formerly much-loved station - Radio Luxembourg, which broadcast on long wave and then medium wave from 1951 - to listeners on distant shores:\"And in between the silence there was conversation,And laughter, and music and singing, and shivers up the back of the neck,And tuning in to Luxembourg late at night.\"",
  "datetime": "2023-09-04T23:10:27.000Z",
  "title": "Long wave radio fans mourn fading frequencies"
}
