{
  "text": "This video can not be playedWatch: Mourners leave notes and balloons on the street for K-pop star MoonbinFans have reacted with anguish and disbelief over the sudden death of K-pop star Moonbin at the age of 25.The Astro boy band member was found unresponsive by his manager at his Seoul apartment on Wednesday night. His death renews concerns over the immense stress K-pop stars face and brings to mind other high-profile music deaths in recent years.Police said it appeared he had taken his own life but an autopsy would determine the exact cause of death.Moonbin \"unexpectedly left our world and became a star in the sky\", his music label Fantiago said on Twitter.Pictures online showed fans laying flowers and notes at street memorials in South Korea and elsewhere in the world, including in the US, Chile, Indonesia and the Philippines. Some also strung up purple and silver balloons - colours that had featured prominently at the singer's last performance in Thailand. His death prompted an outpouring of grief on social media throughout Thursday. \"Rest in peace, Moonbin. I hope the stars and the moon treat you well. I hope they give you all the comfort and love,\" one person wrote on Twitter.\"Moonbin, your smile will light up the night,\" another wrote.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitter’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.With a career that spanned his entire life, Moonbin was in a rare group of K-pop stars. He entered showbiz as a child actor and model in the 2000s. He had his acting debut in 2009, when as an 11-year-old he starred in the popular Korean drama series Boys Over Flowers. At age 18, he joined Astro.While his international fame was not on the level of BTS or Blackpink, he's wildly popular at home, Rob Schwartz, an Asia correspondent for Billboard Magazine, told the BBC.He added that K-pop idols are under intense pressure from fans on social media to look and sound perfect, while record producers demand they churn out hit after hit.\"It's crazy how they have these guys under a microscope,\" he said. \"Certainly, stars in the West can more or less keep who they're dating a secret. In the K-pop world, it's impossible to keep a secret. Every time they lift a foot, thousands of lines are written about it.\"He also noted that Moonbin went on hiatus in 2019 and 2020, citing his health. \"K-pop artists don't really have a life outside being a pop star. They start training at a very young age. They don't go to school or make regular friends. It's really hard for them to see life outside the K-pop world,\" he said.Since 2020, Moonbin had been performing with another Astro member Sanha in a duo. Moonbin & Sanha had been in the middle of a world tour, and their last performance was in Bangkok on 8 April.Fantiago said all of Astro's members were returning to Seoul on Thursday to gather for Moonbin's wake. The statement from the label also asked people to \"refrain from speculative and malicious reports\" so that Moonbin's family could pay their respects in peace. Moobin's sister Moon Sua is also a K-pop singer, part of the girl group Billlie. The siblings had previously spoken in public interviews about their dependence on each other.South Korea has the highest rate of youth suicide among developed countries. While its overall suicide rate is falling - at about 26 per 100,000 people - deaths of those in their 20s are rising. Several young South Korean celebrities have died in recent years - with some of these cases acknowledged as suicide. Actress Jung Chae-yull, 26, was found dead in at her home in Seoul about a week ago. Her management agency did not disclose her cause of death.In October 2019, K-pop star Sulli, killed herself after a long struggle with online bullying. A month later, her close friend Goo Hara, best known as a former member of K-pop group Kara, was found dead at her home in Seoul. In 2018, Minwoo of boy band 100% died at home, with his label only saying he had suffered cardiac arrest. Jonghyun, the lead singer of SHINee, one of South Korea's biggest boy bands, died in 2017.Moonbin entered Fantagio's trainee programme as a child before eventually joining Astro. The group was originally six performers, but one member left in February. Astro fans - known as \"Arohas\" - have been mourning Moonbin's death. Known as an all-round performer, he had been seen as the boy band's most celebrated dancer.At a recent concert, while on the \"Diffusion\" tour with Sanha to promote the duo's latest EP record, Moonbin told fans that he had been going through a difficult time, Korean broadcaster SBS reported.\"I want to confess one thing, I'm actually feeling really bad. There might have been a lot of signs from which people could notice since the concert started, so I'm also very sorry to you guys. \"I'm working out and trying to pick up things that I've left little by little. I chose this job so I need to be happy so that I can make fans happy as well,\" he said in a live broadcast over social media.The duo was set to perform in Macau this Saturday, followed by Indonesia and Japan in May.Additional reporting by Joel Guinto in Singapore.For information and support about any issues raised in this story contact the BBC Action Line.",
  "datetime": "2023-04-20T10:42:15.000Z",
  "title": "Moonbin - Fans anguished over K-pop star's death in suspected suicide"
}
