{
  "text": "The death of K-pop star Moonbin has shocked fans around the world - and again highlighted the pressures such performers face. The 25-year-old member of boy band Astro was a singer, actor and model. His death came in the middle of a world tour of his duo with fellow Astro member Sanha. While the exact cause of death is still being investigated, police said Moonbin \"appears to have taken his own life\". It's the latest in a string of sudden young celebrity deaths to hit the South Korean entertainment industry. Jung Chae-yull, a 26-year-old actress, was found dead in her home earlier this month. Actress Yoo Joo-eun died at the age of 27 in August last year. Sulli, former member of girl group f(x), died in 2019 aged 25 following a long struggle with online bullying. And her close friend Goo Hara, also a K-pop star, was found dead at home a month later. Not all were acknowledged as suicides. But the loss of Moonbin has renewed scrutiny on the highly competitive world of Korean show business.Known for its hyper-competitive culture, South Korea also has the highest rate of youth suicide among developed countries. While its overall suicide rate is falling, deaths of those in their 20s are rising.This video can not be playedWatch: Mourners leave notes and balloons on the street for K-pop star MoonbinAnd being a celebrity in South Korea means they would be under much higher pressure compared to pop stars in North America or Europe, according to Rob Schwartz, an Asia correspondent for Billboard Magazine.The competition is fierce from the beginning. Entertainment is a highly popular career choice for aspiring young Koreans. A survey done by the South Korean education ministry in 2021 showed actors, models and singers were among the top 10 dream jobs for primary school pupils. To be a K-pop star, most people need to go through a gruelling training period, which means they will largely lose connections with their friends and peers, and this could last for years. In the case of Moonbin, despite already having been a child actor in the Asia-wide popular Korean drama series Boys Over Flowers at the age of 11, he still needed to train for eight years before making his debut as a member of the idol group Astro. His sister, Moon Sua, also a K-pop singer with girl band Billlie, spent 12 years preparing.After numerous intense rounds of selection, only a small number of trainees make it to the stage. And what awaits them is an industry that's already overwhelmed with stars.The control from celebrities' agencies and fan culture are two main contributors to the massive stress Korean stars face, Mr Schwartz pointed out.It used to be a common case that new starts would be tied into so-called slave contracts - long exclusive deals with little control of their schedule or financial reward.While some K-pop stars have won cases freeing them from unreasonable contracts in recent years, he doesn't think the relationship between the two parties has fundamentally changed. \"K-pop stars have more control, in the sense that they are not as controlled,\" says Mr Schwartz. \"Things have changed, I would not necessarily say they got better.\"And enthusiasm from the fans, amplified by the country's extremely active social media, could be a double-edged sword sometimes. \"They pay attention to every move, they comment on their hair,\" explains Mr Schwartz. \"It's crazy how they have these guys under a microscope.\"Once they have debuted, celebrities are not only closely watched by their fans, but by the whole of society. In a country where disparity has long been a talking point, being a public figure means higher standards expected by the public.Drink driving, commonly considered as one of the worst offences a public figure can commit in South Korea, could easily end one's career there. Prominent actress Kim Sae-ron, 22, faced huge backlash from the public after crashing her car while drunk driving.\"Korea has a very strict moral standard for celebrities compared to other countries,\" says Korean pop culture critic Ha Jae-kun. \"If a star behaves only a little different from what's perceived 'decent', the public would attack them. And it's hard for a star to ignore this kind of assault because of the high social pressure from a strong collectivism.\"Being a celebrity with mental health issues could be extremely hard, insiders have pointed out.In an interview with BBC Korean in 2017, rap star Swings, who himself has been diagnosed with multiple mental disorders, revealed the burden it could be for them.\"It's like walking around naked,\" he said. \"They say 'I thought this guy was ill, you know, how does he get on stage to perform?' They obviously don't know what's going on.\"The industry is aware of the strain on their stars' mental health, and some K-pop idols have been taking long breaks for wellbeing reasons.Jeongyeon, member of top girl group Twice, has taken four rounds of breaks since 2020 due to mental health issues and a neck injury. She made her comeback last month. Moonbin also went on hiatus in 2019 and 2020, citing health reasons. Multiple agencies also have introduced therapy sessions for trainees and celebrities. Naver, the biggest search engine in South Korea, shut down the comment section under its entertainment news in 2020, recognising how potentially toxic the environment had become.But some still don't see a momentum of fundamental change coming soon. \"K-pop is its own thing and everybody would like to make it better for K-pop idols. But how do you go about that?\" argues Mr Schwartz.\"The super fans are so obsessed with these idols, it seems like a vicious cycle of being placed under microscope to perform at a high level.\"Yuna Ku is a reporter for BBC Korean based in Seoul. Additional reporting by Joel Guinto in Singapore.For information and support about any issues raised in this story contact the BBC Action Line.",
  "datetime": "2023-04-20T15:04:45.000Z",
  "title": "Moonbin - Star's death renews scrutiny on pressures of K-pop"
}
