{
  "text": "This video can not be playedSharon Graham calls the PM's plan to fund public sector increases as a \"rob Peter to pay Paul situation\".A new wave of industrial unrest is on the way - unless big companies and the government up their pay offers, the head of the UK's second largest union has warned. Unite has more than a million members in the public and private sectors.Its leader, Sharon Graham, doesn't really do empty rhetoric.Since she took over from Len McCluskey nearly two years ago, she has overseen nearly 900 industrial disputes involving Unite members.Although the government has accepted the public sector pay review bodies' recommendations in full, Ms Graham still predicts trouble ahead. Speaking to the BBC at her union's policy conference in Brighton, she said the decision not to fully fund increases above 3.5% \"would come back to bite them\", adding \"this is a rob Peter to pay Paul situation\".  Although the government has said some of the extra cash will come from increased visa fees and, in the case of schools, \"underspend\" in other education areas, Ms Graham said she assumed much of the funding for pay increases of between 5% and 7% would come from cuts elsewhere in public spending.She said: \"I think we will see a new wave of industrial action. There are workers who will be working harder and for longer, and communities which will see services cut.\" She said existing Unite strike action would continue too.Earlier this year, the biggest public sector union, Unison, accepted an NHS pay offer and the Royal College of Nursing failed to get the turnout it needed in a strike ballot to continue pursuing its industrial action.But Unite's health service staff - including ambulance crews - voted narrowly to reject their offer. Ms Graham suggested a harder line was paying off: \"Today in the Yorkshire Ambulance Service, we won a one-off payment that members were told they wouldn't get.\"So I will be fighting for those workers until they get the pay rise they deserve. I think there will be a new wave of strikes in the NHS.\"She said Unite's research unit had calculated that £400m in total had been won for members through industrial action in the last two years.Asked if that meant this would embolden her to impose the misery of even more strikes on the public, she replied that the public were also workers - and the lesson people should learn amid a cost of living crisis was to join a union.She denied pay increases were fuelling inflation, and suggested that \"rampant profiteering\" and \"greedflation\" were partly to blame, with the UK's top 350 companies enjoying an average increase in profit margins of 89%.She suggested an extension of the existing windfall tax on oil and gas companies could easily cover fully-funded pay increases in the public sector, and said she was \"disappointed\" that the Labour leadership wasn't being bolder and more ambitious.Speaking at the Unite conference earlier in the day, Labour leader Sir Keir Starmer would not commit a future Labour government to specific percentage increases in public sector pay, and said he would not \"wade into\" current pay negotiations.But more generally, he said a future Labour government would be seen as a failure if it didn't tackle the scourge of low pay.As for the private sector, Ms Graham has her sights on winning further pay claims.She has employed a team of people who look at company accounts to calculate if pay increases can be afforded.If current negotiations on pay aren't fruitful, she said a new wave of strike ballots would be held in September and October.The teaching unions in England are now recommending that their members end their battle over pay, but a new era of peace in industrial relations appears to be a long way off.As Ms Graham put it: \"This is a marathon, not a sprint.\"",
  "datetime": "2023-07-13T18:10:32.000Z",
  "title": "New wave of strikes on way, Unite leader Sharon Graham warns"
}
