{
  "text": "A teaching assistant who won an award said it had been \"a privilege\" to share her Korean culture with pupils.In Wha Kim, who is of Korean heritage, works at Queen Katharine Academy in Peterborough and  runs a Korean club in the school lunch break.She won the Teaching Assistant of the Year accolade in the Times Educational Supplement 2023 awards.\"As a Korean, I'm privileged to be able to help students to learn Korean and share the culture,\" she said.Ms Kim has worked as a teaching assistant for 16 years and helps students in their learning at the secondary school.She started her lunchtime Korean club after a pupil approached her and asked to learn the Korean language. \"In the second year I heard of a lot of students who liked K-pop music and would like to listen to it, so I started a K-pop club at lunchtime as enrichment - and it's been quite popular,\" Ms Kim said.K-pop, which stands for Korean pop, is a multi-billion pound music industry popular in South Korea, and also around the world.She said the club helps students \"experience a different culture - and to broaden their knowledge and experience\".She said she felt \"honoured and humbled\" by the fact they wanted to learn more.Laiba, a 13-year-old pupil in Year 8, said the club was where \"everyone comes and enjoys Korean culture and listen to K-pop and try Korean food\".\"It makes school fun and, like, at lunchtime everyone comes in and ... it's just amazing. I really like Korean culture and... it makes me happy.\"Miss Kim has made everyone so proud. We are so proud Miss Kim got the award for this.\"Anamika, also 13, said: \"I just love Korea, I love K-pop.\"Speaking of her teacher's award, she said: \"She deserved it, she works so hard, she's like the best person - she's so kind and like one of the best teachers here.\" Fellow Year 8 pupil, Nikola said her friend Anamika had introduced her to K-Pop and she was now a regular at the club.\"K-pop is like the best music ever, and I love the food especially - it's very spicy so sometimes I just can't handle it,\" she admitted. Miss Kim was \"like the best teacher ever, she taught us so much\", she said, adding that listening to the music \"lightens up the mood\" for everyone.Their teaching assistant Ms Kim said she was \"delighted\" to have won the TES award.\"It's thanks to my students who made a big noise about my club, and colleagues who nominated me for that,\" she said.\"I am just over the moon.\"Follow East of England news on Facebook, Instagram and Twitter. Got a story? Email eastofenglandnews@bbc.co.uk or WhatsApp us on 0800 169 1830",
  "datetime": "2023-07-03T04:51:09.000Z",
  "title": "Peterborough - 'I'm privileged to help pupils learn Korean culture'"
}
