{
  "text": "A pioneering wave energy converter that was tested in Orkney belongs \"in a museum, not a scrapyard\", a councillor has said. Pelamis, the company that developed it, went into administration in 2014, and the device was bought by Orkney Islands Council for £1.It is now planning to spend £150,000 on scrapping it. Kirkwall East councillor John Ross Scott told BBC Radio Orkney it should be preserved for future generations. He said to scrap it would be like destroying the Wright brothers' plane, which made the first sustained flight by a manned aircraft in 1903.Pelamis became the first offshore wave energy machine to generate power to the National Grid, when it was installed at the European Marine Energy Centre in 2004. The 591ft-long (180m) device - known as the Sea Snake - won its inventor, Richard Yemm, the Saltire Prize for his outstanding contribution to the marine renewables sector. When the local authority purchased the machine in 2017, council leader James Stockan said it was \"symbolic of the industry\". He said if it had been scrapped \"the critics would have said 'you should have kept that for something'.\"But six years on the council has failed to find a use for the 1,350-tonne device, with director of enterprise Gareth Waterson saying: \"It has been a bit of an albatross.\"  Mr Waterson said the council had spent almost £45,000 on maintenance costs.The council will tender for its removal to a location where it can be processed for scrap, with the value recouped by the council.  Mr Scott, a Scottish Green councillor, said the option of finding a permanent home for the device had not been properly explored. He said museums in England and in Scotland which specialise in technology or design should be approached, to see if they would be interested in acquiring it - or, at least, parts of it.\"We just don't know,\" he says. \"I don't think it's been assessed if any museums would be interested in it.\" He said it did not even have to be the entire structure.\"I think you could perhaps take the nose-piece of the Pelamis, and make it an impressive piece that people would be stunned by,\" Mr Scott said.  A council spokesperson said: \"Options were considered for potential uses for the Pelamis device and ultimately a decision was taken by the development and infrastructure committee - then ratified at full council - to arrange for the disposal or sale of the device for scrap, or any other purpose.\"The authority has set a deadline of 31 January 2024 for the removal of the machine, which is currently moored off Lyness wharf in Hoy.",
  "datetime": "2023-08-04T05:11:52.000Z",
  "title": "Pioneering wave kit belongs in a museum not a scrapyard"
}
