{
  "text": "This video can not be playedWho is North Korea's leader Kim Jong Un?When Kim Jong Un took control of North Korea at just 27, the world knew little about him. The sombre, subdued and rounded figure that was often the subject of international ridicule in those early days has now made North Korea a global threat in a way his father Kim Jong Il never did. Kim Jong Un also did what no previous North Korean leader could - bring a sitting American president to the negotiating table. But historic talks with former US president Donald Trump and early moves to improve relations with the South led nowhere eventually.  Pyongyang's relationship with Washington and Seoul has since soured and turned increasingly volatile. Under Kim Jong Un in 2022 Pyongyang tested a record number of missiles, aimed two ballistic missiles over Japan, and has continued preparing for a seventh nuclear test - one that analysts expect despite dire warnings from the US, South Korea and Japan. This year there have been fewer missile tests but with North Korea building ever-more sophisticated nuclear weapons, it is increasingly unclear how the threat the country poses can be contained.Soon after Kim Jong Un, the youngest son of Kim Jong Il and his third wife Ko Yong Hui, was born in 1983 or 1984, a state-sanctioned personality cult swung into action.  Mythology claimed that the Kims were a semi-divine dynasty who had a close affinity with the near-sacred Mount Paektu that sits on the Korean-Chinese border. By that logic, the young Kim would be naturally endowed with heroic qualities and preternatural strength. In fact when he was announced as the leader in 2011, the pronouncement made clear that he \"inherits the ideology, leadership, courage and audacity of [his father] Comrade Kim Jong Il\".Audacity was not an inappropriate word to use: within five years of coming to power, he had executed his uncle, is widely believed to have ordered the assassination of his half-brother in a Kuala Lumpur airport, and North Korea claimed it had developed a hydrogen bomb that could be mounted in an inter-continental ballistic missile (ICBM).Kim Jong Un had little political or military experience, but almost immediately after the death of his father, he was hailed as \"the great successor\". He was also named head of the party, state and army, and took on the mantle of North Korea's Supreme Leader.He was initially not thought to be able to take up his father's mantle. Analysts focused instead on his older brother Kim Jong Chol and older half-brother Kim Jong Nam.  But Kim Jong Nam's deportation from Japan in May 2001 and Kim Jong Chol's reported \"unmanliness\" improved the young Kim's chances.Analysts saw him as the heir-to-be after he was awarded a series of high-profile political posts.Swiss-educated like his brothers, Kim Jong Un avoided Western influence, returning home when not in school and dining out with the North Korean ambassador.After coming back to Pyongyang, he is known to have attended the Kim Il Sung Military University, named after his grandfather, the almost mythical founder of North Korea.His mother was thought to be Kim Jong Il's favourite wife, and she clearly doted on her son, reportedly calling him the \"Morning Star King\".In August 2010, when Kim Jong Il visited China, one report said Kim Jong Un had accompanied his father on the trip. By then he was widely seen as the heir-apparent and when Kim Jong Il died, this was quickly confirmed. Mr Kim made his first public speech as North Korea marked the 100th anniversary of the birth of Kim Il Sung on 15 April 2012, praising the \"military-first\" doctrine and vowing the time when his nation could be threatened was \"forever over\".His single-minded development of North Korea's nuclear and missile programme appears to have led to it making rapid strides. Of the six nuclear tests that took place between 2006 and 2017, four happened under Kim Jong Un.In 2017, Pyongyang also claimed that it had successfully tested a miniaturised hydrogen bomb that could be loaded onto a long-range missile, but experts remain divided on how advanced its programme is. That year it also test-fired several missiles, claiming it had tested intercontinental ballistic missiles that could reach the US. This led to fresh UN sanctions and tensions with then US President Trump's administration also spiked, leading to a fiery war of words.  Yet, unexpectedly, Kim Jong Un offered an olive branch to Seoul in his new year's address, saying he was \"open to dialogue\".A flurry of diplomatic activity followed, with high-level meetings between the two Koreas, and they even marched under one flag in the 2018 Winter Olympic opening ceremony. Kim Jong Un also made his first known foreign trip as leader around that time, taking a train to Beijing. China is North Korea's main ally and trading partner.He also tried to improve relations with Mr Trump, and in April 2018 the two leaders held historic face-to-face talks in Singapore to broker a deal that would possibly lead to denuclearisation of the North.The following year, the two leaders, joined by South Korea's Moon Jae-in, participated in an impromptu but largely symbolic meeting at the demilitarised zone (DMZ) that separates North and South Korea.However, relations between the US and North Korea later deteriorated, with a second Trump-Kim summit in Hanoi in March 2019 ending abruptly without any deal. Talks stalled after the Trump administration refused to lift sanctions until Pyongyang fully abandoned its nuclear programme.Then, in January 2020, Kim Jong Un said he was ending the suspension of nuclear and long-range missile tests put in place during talks with the US, and threatened that \"the world will witness a new strategic weapon\".And in early 2022, North Korea announced that it had successfully launched its largest intercontinental ballistic missile to date - the Hwasong-17, first unveiled in 2020.But in November 2022, an ICBM launch - Pyongyang's seventh that year -  was said to have failed mid-flight. A South Korean defence source said this was believed to be the Hwasong-17. Not much was known of Kim Jong Un's personal life until television footage of an unidentified woman attending events with him surfaced. In July 2012, state media announced that he was married to \"Comrade Ri Sol Ju\".Little is known of Ms Ri, but her stylish appearance led some analysts to suggest that she was from an upper-class family. Reports have suggested that Ms Ri may have been a singer who caught Mr Kim's attention during a performance.According to South Korean intelligence, the couple have three children.Kim Jong Un's sister, Kim Yo Jong, holds a senior post in the ruling Workers' Party of Korea - and stole the limelight when she represented her brother at the Winter Olympics in the South. According to South Korea's spy agency, Ms Kim steers \"overall state affairs\" and has responsibility for Pyongyang's policy towards the US and South Korea, among other portfolios, and is \"the de-facto number two leader\". However, Seoul's spy agency has been wrong about North Korea in the past.It is not known whether his elder brother, Kim Jong Chol, holds an official role. The most high-profile indication of a possible power struggle within the North Korean elite came in December 2013, when Kim Jong Un ordered the execution of his uncle Chang Song-thaek. State media said he had been plotting a coup. Kim Jong Un is also widely believed to have ordered the murder of his exiled half-brother, Kim Jong Nam, in February 2017 at Kuala Lumpur International Airport. In April 2020, rumours about Kim Jong Un's health suggested he might have undergone a serious operation and there was uncertainty about his recovery. The reports were based on South Korean publication Daily NK and seemed to be backed up by the fact that Kim had missed the anniversary of his grandfather's birthday. Kim Jong Un's health has been a cause for concern for much of the time he has been the country's leader. He gained weight during his decade in power, leading to speculation that he could have been suffering from conditions like diabetes or gout. But in 2021 he emerged looking considerably thinner, with even state television airing concerns about his sudden weight loss.Kim Jong Un's children are reported to be too young to be even considered successors and observers believe his death or long-term incapacity could lead to a power vacuum in the nuclear state, bringing fresh instability to the region.Late last year he appeared with his young daughter in public for the first time, confirming long-rumoured reports of her existence. The girl is believed to be named Kim Ju Ae and thought to be about 10.The move fuelled speculation about whether she had been chosen as his successor, and raised more questions about why Mr Kim had decided to unveil her - and whether it had been for reasons related to his health.",
  "datetime": "2023-09-11T19:43:05.000Z",
  "title": "Profile - North Korean leader Kim Jong Un"
}
