{
  "text": "A telephone prescription ordering service in Norfolk and Waveney could be closed in a bid to save money. The Norfolk and Waveney Integrated Care Board (ICB) are proposing ending the Prescription Ordering Direct service, which runs in 18 of 105 GP practices, from April 2024.Concerns have been raised that it will affect people who feel less confident using online tools.The ICB said no final decision has been made.If the telephone service is cut, patients will need to use the NHS app, online services or in-person alternatives through their GP practice to order repeat prescriptions.Tony Dean, chief officer for Community Pharmacy Norfolk, said: \"I think the main issues will be an expectation that community pharmacies will pick up this repeats for patients.\"However, he said it was not within pharmacy contracts. If proposals go forward, he said there would need to be a transition period to help vulnerable patients less comfortable using technology. Mr Dean added he had empathy for the ICB, who have taken on more responsibility for primary care services while facing national cuts. A spokesperson from NHS Norfolk and Waveney said it launched an organisation-wide consultation with staff in July, following news that all ICBs had to reduce running costs by 30% by 1 April 2024.\"At this stage, the consultation is only with affected NHS Norfolk and Waveney ICB staff and it is not a public consultation. It is only a proposal and no final decision has been made,\" it said.Speaking to people in Great Yarmouth, BBC Radio Norfolk was told by some that older people felt like a \"forgotten generation\" when it came to moving services online. Others said they did not mind the service being cut as it would allow for money to be spent elsewhere.Follow East of England news on Facebook, Instagram and X. Got a story? Email eastofenglandnews@bbc.co.uk or WhatsApp us on 0800 169 1830",
  "datetime": "2023-09-20T05:06:17.000Z",
  "title": "Proposal to cut Norfolk and Waveney telephone prescription ordering service"
}
