{
  "text": "China has confirmed its detention of a South Korean footballer in relation to a bribery case.Son Jun-ho, who plays in the Chinese Super League, is in police custody in the north-eastern Liaoning province, China's foreign ministry said.The 31-year-old was detained at a Shanghai airport on Friday, according to South Korean media.Reports of Mr Son's detention come amid a concerted crackdown on corruption and match-fixing in Chinese football.Diplomats from South Korea will meet with Mr Son \"to figure out exactly what kind of charges\" he has been detained for, Yonhap News Agency reported, citing sources.The country's foreign ministry said its mission in China was providing consular support to Mr Son, but declined to comment further.China has arrested at least four football officials in the past three months for alleged wrongdoing.Mr Son moved to China's Shandong province in 2021 where he played as a midfielder for Shandong Taishan. The club won the Chinese Football League - the highest tier of professional football in China - that year. His current teammates include former Manchester United and Everton midfielder Marouane Fellaini. He has also played 20 international matches for his home country, including in the Fifa World Cup last year.A Korea Football Association official said it had sought an explanation from Shandong Taishan, but has not heard back from the club.Chinese football has long been engulfed in allegations of bribery and match-fixing. Recent detentions of major football figures have dealt another setback to the country's football ambitions.In February, just as stadiums started to reopen after Covid lockdowns, the president of the Chinese Football Association Chen Xuyuan was detained for suspected \"serious violations of discipline and the law\".Mr Chen's arrest was the fourth known example of a senior football official to be investigated in less than three months.Last November, former national coach Li Tie, who was one of China's most high-profile footballers, also came under investigation for \"serious violations of the law\".Match fixing has also sparked controversy in South Korean football recently. Last month, the entire executive board of Korea's Football Association resigned after attempting to pardon some 100 people who had been banned from the sport due to match-fixing and other offences.",
  "datetime": "2023-05-16T08:56:54.000Z",
  "title": "Son Jun-ho - South Korean footballer detained in China in bribery probe"
}
