{
  "text": "South Korea's first nationwide air-raid drill in six years has met with a tepid public response, even amid a looming satellite launch by the North.At 2pm local time on Wednesday, vehicles were ordered to pull over and people told to evacuate to air raid shelters during the 20-minute exercise. It is part of wider military exercises aimed at improving the country's response to a North Korean attack.  Pyongyang claims it will soon launch a rocket carrying a satellite.The drill, which used to be held annually, was a chance to remind people what to do in the event of an attack from the North.As Pyongyang builds up its arsenal of nuclear weapons, it poses an ever-greater risk to the South. But people here, who have lived with the threat of war for decades, are increasingly desensitised to the danger.  As sirens sounded, police jumped into the street to stop traffic, while public officials tried to usher people into nearby subway stations.At the station in central Seoul that BBC News visited, only a dozen people had gathered to seek shelter. \"This is necessary because we are nervous about North Korea and this acts as a reminder for us, to raise awareness\", said 24-year-old university student Kim Min-jun, who was among the dozen.20-year-old Choi Bo-geun, who came to the shelter with his friend, agreed. \"Since we are still at war with the North this training is necessary, but I worry that this sort of thing might provoke North Korea. Since we are also holding joint military exercises with the US, this escalates the chances of war\".But above ground, many continued with their journeys as usual. Yang Anna was in a coffee shop when the alarm sounded. \"I don't know where the shelter is, so I didn't go. I don't know why we have to do these drills. I don't think a war is going to happen\".80-year-old Park Hyung-joon did not seek shelter either. He said he thought the drills played an important role in protecting people and the country, but that he had been drinking tea with his friends at the time and did not want to leave.Local media reported that some 17,000 spots, such as apartment basements and subway stations, were set as defense drill shelters in 2022.",
  "datetime": "2023-08-23T09:32:23.000Z",
  "title": "South Koreans unfazed by first nationwide air raid drill in six years"
}
