{
  "text": "Four suspected high-ranking members of a South Korean doomsday cult have been arrested in Fiji. Two were deported, but a legal injunction prevented the others from being ejected, Fiji media report. The Grace Road Church became notorious after 400 of its members moved to Fiji in 2014 claiming they would be safe from imminent natural disaster.Its founder Shin Ok-ju was jailed in 2019 for holding followers captive in Fiji and subjecting them to violence.The Church has built a business empire after arriving in Fiji.It denies it is a cult - as well as allegations of abuse.However, members who have been able to return to South Korea have accused Ms Shin of confiscating their passports and holding them against their will. They have alleged the Church uses forced labour and issues ritual beatings so harsh that they have led to the death of one follower.South Korea issued an international arrest warrant and those on Fiji's deportation list have been wanted by the international policing organisation Interpol since 2018. Two of those arrested in Fiji, Byeong Joon Lee and Beomseop Shin, have been returned, Fijian Home Affairs Minister Pio Tikoduadua announced on Wednesday.Two other members, including the group's acting president Sung Jin Lee, were released after a High Court order prevented them from being deported.The Church's acting senior director and president of its business interests, Daniel Kim, is among the two men still at large.  He is the son of the founder of the Church. Mr Tikoduadua described the allegations of abuse against Grace Road Church members as a \"long pending issue\" and accused the country's previous government, which was defeated in December's general election, of ignoring calls to deport them. Grace Road Church's businesses in Fiji, operating under the name Grace Road Group, are wide-ranging - from construction to restaurants to agriculture, with labour provided by the Church's followers.A photo posted on the organisation's website shows former Fijian Prime Minister Frank Bainimarama appearing with Daniel Kim at the presentation of a business excellence award in 2017.\"Grace Road... has invested heavily in Fiji we recognise that and we appreciate that,\" said Mr Tikoduadua.\"But that does not mean to say that things are not being questioned by everybody.\"",
  "datetime": "2023-09-07T12:18:16.000Z",
  "title": "South Korean cult Grace Road Church members arrested in Fiji"
}
