{
  "text": "K-pop star Sowon has apologised after posing with a mannequin wearing Nazi clothing and posting the images online. The photos show Sowon, a member of GFriend, cuddling the mannequin, and were taken in a café last November while the group were filming a video.They have since been deleted from her Instagram. Her management said she felt a \"profound sense of responsibility\" over posting the images. Many people took to social media to call for the star to apologise. Source Music, her management company, said in a statement to CNN that she was shocked and deleted the post \"when she understood the significance of the image\". It is common practice for K-pop singers to issue apologies through their management.The company also apologised for the presence of the Nazi clothing and said the staff member in charge \"did not recognise there was an issue with the mannequin's attire during an on-site inspection on the day of filming\". \"We apologise that we were not able to check in advance that there were inappropriate props at the filming location, for not thoroughly inspecting the filming process and uploading the content, and not paying enough close attention to societal issues and historical facts,\" the statement said. Sowon, who has more than 800,000 followers on Instagram, has been criticised on social media for the images. \"As a fan from Poland, I feel really hurt and disgusted about the photos. My great grandmother died in a Nazi camp, my great uncle fought in the war. There is NO explanation, and there HAS to be an apology. I don't care if she knew or not, that is not alright,\" one fan wrote on Twitter. Another user wrote: \"[S]owon taking a picture with a [N]azi mannequin is terrible enough, but the fact that the [N]azi mannequin was part of a set they filmed on for their comeback is even more baffling.\"Others defended the singer, claiming that she might not know the uniform's significance. \"Positive thinking, maybe she doesn't know much about Nazi history, especially when she went to school about art/visuals, so she doesn't really know much about history. But I still hope Sowon or other members apologize for the post,\" one person said. Another wrote: \"Also to those blaming Sowon, I am sure she should've known better and Hitler's reign is indeed taught about in Korean schools, but there is one thing between being aware of Nazism and another thing about recognising the Nazi uniform.\"It is not the first time a K-pop group has been linked to Nazi inspired items. In 2018, BTS came under criticism after band member RM was pictured wearing a hat with a badge that resembled Nazi insignia. The image taken in 2014 started to go viral prompting criticism by the Jewish human rights group the Simon Wiesenthal Centre, which said the symbol depicted on the hats were of the Nazi SS Death Head logo.The band's management issued a lengthy apology. Nazi items are seen quite frequently in some Asian countries and Nazi uniforms have even been seen in cosplay.Correspondents say that while World War Two history is taught in Asian nations, the teaching concentrates on the region and not what happened in Europe, and that Asian cities lack Jewish organisations that would usually raise awareness of the Holocaust. This video can not be playedBTS - from chart success to stock market gold?",
  "datetime": "2021-02-01T20:12:57.000Z",
  "title": "Sowon - K-pop star apologises over 'Nazi mannequin' image"
}
