{
  "text": "Northern Ireland trade unions have warned they are gearing up for a new wave of industrial action in autumn.The focus is the public sector where most workers have been receiving pay awards far below the rate of inflation.In May, health service staff were told that under Stormont's current budget it would be impossible to match pay deals being offered to NHS England workers.ICTU assistant general secretary Gerry Murphy accused the Northern Ireland secretary of punishing workers.\"Many unions have live ballots mandating strike action and/or action short of strike,\" he said, speaking after a meeting of union leaders in Armagh.\"All teaching unions are in this situation, and an increasing number of unions representing health professionals, most of whom have little or no tradition of industrial militancy. \"They do now, and will be taking strike action in September, possibly being joined by other public sector workers with live ballots in the civil service, some district councils and all three levels of the education sector.\"Mr Murphy said Stormont departments had been \"set up to fail\" and questioned the framing of budget difficulties as an overspend.\"The Northern Ireland Fiscal Council stated in their report on public finances in March 2023 that the vast majority of the overspend was made up of 'pay awards, energy prices and other inflationary pressures,\" he said.\"Inescapable pressures rather than new funding commitments were to blame for the excess of spend.\"In the wake of April's budget, Stormont officials said they believed they would need to find £800m in cuts and revenue raising measures.A series of cuts plans have been laid but in July the head of the NI Civil Service warned that departments had \"reached the limit\" of what they could do to manage budget pressures in 2023.Civil servants have been running Northern Ireland departments since the executive collapsed 18 months ago.",
  "datetime": "2023-08-24T15:33:06.000Z",
  "title": "Strikes - Unions warn of new wave of action in autumn"
}
