{
  "text": "A campaigner has windsurfed up the Thames to return plastic bottles from the UK which he found in Sweden.Merijn Tinga said for the past five weeks he has travelled between Oslo and London, calling for the UK to establish a nationwide deposit return scheme. He also brought a petition with him for environment minister Rebecca Pow.The UK government previously announced plans to launch a deposit return scheme in 2025, to enable people to return bottles at machines and get cash back.A Bill would need to be put forward to begin the legislative process, and agreements reached with devolved nations.Scotland has been working on a deposit return scheme intended to launch in 2024, but ministers announced last month they would be postponing it.Mr Tinga, who is from the Netherlands, explained he was inspired to do the challenge after he found an English bottle of Lucozade on the Swedish coast. He then decided to make a surfboard \"with plastic bottles I found on the foreshore\" before embarking on his trip.He has joined forces with the World Wildlife Fund and Surfers Against Sewage for his campaign, which he said was not only about establishing a bottle return scheme but also securing a deposit system \"that leaves no room for subversion by the packaging industry\". \"To me it is important to show that we should [put in] an extra effort to combat things like plastic pollution, and you can actually change something,\" he added. Mr Tinga windsurfed from the Norwegian coast to Denmark and then along the coasts of Germany, the Netherlands and France, before getting a ferry to England.He then windsurfed up the Thames, which required special permission from London's Port Authority.\"I've done 30 days of windsurfing, so to be here to see this, and sail underneath the Tower Bridge, I mean that's so iconic,\" he said. \"Plastic pollution is a multi-headed monster. It is part of our society, but there are concrete actions we can take, and a deposit return scheme is one of those and we should implement it as soon as possible.\"A government spokesperson said: \"We are pushing ahead with our programme of reforms to reduce waste and improve our use of resources, building on our commitments clearly set out in the environmental improvement plan earlier this year.\"This includes introducing a deposit return scheme for drinks containers, which will boost recycling levels and reduce litter in our beautiful countryside. \"We will continue to work with producers, retailers and packaging companies on the design and delivery of this scheme, to ensure it delivers on our environmental goals.\"Follow BBC London on Facebook, Twitter and Instagram. Send your story ideas to hellobbclondon@bbc.co.uk",
  "datetime": "2023-07-19T17:48:52.000Z",
  "title": "Surfer makes waves on Thames over plastic recycling"
}
