{
  "text": "Taiwan is being rocked by a wave of sexual harassment and assault allegations - sparked by a Netflix show which many say has ignited a local MeToo movement.More than 90 people have spoken out in the past fortnight, accusing people across the island.The allegations at first centred on politics and the ruling Democratic Progressive Party (DPP) - where several senior officials have resigned. But they have spread across Taiwanese society, with allegations being made against doctors, professors, sporting umpires and YouTubers.On Saturday, a Polish diplomat was accused of sexual assault by a think tank researcher.For many women, the moment is long overdue in a Taiwanese society otherwise praised globally for its progressive politics and commitment to gender equality.President Tsai Ing-wen, the island's first female leader, has apologised and vowed reform.\"Previously we had single cases around sexual harassment, but never in such magnitude,\" social commentator Dr Liu Wen from Taiwan's Sinica Academia told the BBC.\"It's the first time a lot of the underlying issues in different industries are being revealed all at the same time.\"One woman in her 30s told the BBC she had felt the momentum to seek justice again after she was sexually harassed by her boss, a celebrated environmental activist.When Ms Tseng, as she wishes to be known, first sought redress last year, she said she was stone-walled and rebuffed.But when she spoke out online last week, she received an apology from the workplace and the activist. He also resigned, saying he was sorry for some of his conduct. Meanwhile her inbox filled up with messages from other women relaying their own complaints about him.A local TV drama has been credited with sparking the first wave of allegations. In late April, Wave Makers, a show about Taiwanese political staffers working on an election, debuted on Netflix.In a now iconic scene, a young female aide finds herself alone with her mentor - a party spokeswoman and the show's main character.Does she dare confide the harassment she had endured from a male colleague, knowing that a public report would harm the party's standing and likely her own career?She decides to tell her. The older woman listens, and chooses to help.\"Let's not just let this go, ok,\" she says, brushing away her staffer's concerns. \"We can't let things go this easily. Otherwise we'll wither away and die.\"This scene has been credited as the clarion call for the MeToo moment now sweeping Taiwan.On 31 May, an ex-DPP staffer wrote an essay on Facebook, echoing the show.\"Let's not just let this go,\" Chen Chiemn-jou wrote before describing her experience of being sexually harassed at a work event. When she reported her complaint, she said her female supervisor - in charge of the party's women's affairs - had asked her \"Why didn't you say anything?\", before advising her to bury the claim.Chen's post has since electrified Taiwan, and been shared thousands of times. It appears to have motivated others in politics and beyond to report their experiences of harassment and how authorities responded.After Chen's report, another ex-DPP female staffer said her male supervisor had verbally abused her and stymied her complaint about another male colleague's harassment.Several senior DPP officials have resigned including Hsu Chia-tien, the supervisor in Chen's case, who was suspended by the party, and Yen Chih-fa, an adviser to the president who has denied accusations of sexual harassment by a campaigner. Neither Yen nor Hsu have responded to the BBC's requests for comment on the accusations.The opposition KMT party has also been hit with allegations. Last week a journalist said KMT lawmaker Fu Kun-chi had forcibly kissed her at a press event in 2014, allegations denied by Fu. He reiterated his public denial to the BBC, saying he had never engaged in any sexual harassment towards women or subordinates.A KMT councillor has also alleged harassment by a famous media personality, who then apologised for his behaviour, saying he'd been drunk and had no recollection of events on the night in question.More than 90 cases have now been documented in a crowd-sourced online database. Some of the most high-profile men accused include:Gender equality had been considered a source of pride in Taiwan - especially compared with neighbouring China where Beijing has promoted traditional gender roles and pressured women to have more children.There are no women in senior political leadership in China, while Taiwan has been led by a woman for nearly a decade. Female representation in Taiwan's parliament is at 43%, far higher than the global average of 29% cited by the Inter-Parliamentary Union.President Tsai has responded swiftly to the allegations, apologising twice for her party's failures.She stated last week that those who had spoken out about sexual harassment were victims, not trouble-makers and she thanked them for revealing their experiences. \"Our society as a whole must educate ourselves again,\" she said.The MeToo moment has come at a critical period in Taiwanese politics. Like on the TV show, the island is gearing up for a presidential election next January.A day after the first staffer's Facebook post, the DPP's chairman and candidate for January's elections William Lai apologised and ordered an overhaul of how the party handles sexual assault allegations.\"We won't just let it go like this,\" he said, echoing the Wave Makers TV show's phrase. He has proposed an official inquiry into the allegations and reforms to strengthen sexual harassment laws.The show's screenwriters have said they never expected a public reaction like this. They told the BBC they hoped that \"through idealised depictions of addressing workplace harassment in drama, people can find a shared language to express their expectations of how such issues should be handled\".There is no doubt a reckoning is in motion, observers say, adding that it is a significant time in Taiwan for addressing gender and sexual abuse.But it is also a raw period for many survivors, plunged headlong into a traumatic public conversation. Many are sceptical of promises for lasting change.For Ms Tseng, the woman who received an apology last week, she's grateful the TV show opened up the conversation.But that pivotal scene of support and validation - and not suppression - still seems like a fantasy, she says.\"While watching the show, I felt a strong connection but I don't have a supportive supervisor like the ones portrayed on television who fight for justice,\" she said.\"In the dramas, the female party leader eventually apologises and tells the victims to wait for her to catch up with their pursuit of justice.  However, I'm uncertain if society is prepared to fully embrace the MeToo movement in Taiwan.\"",
  "datetime": "2023-06-14T20:56:09.000Z",
  "title": "Taiwan sees MeToo wave of allegations after Netflix show"
}
