{
  "text": "The world's last sea-going paddle steamer has been delighting passengers for decades.The Waverley launched along the River Clyde on 2 October 1946 - but this year it had one of its busiest seasons. We've pulled together some images that capture the story and enduring affection felt for this historic vessel.Closely associated with Scotland's shipbuilding heritage, The Waverley now gives people around the UK the chance to enjoy the traditional Clyde experience of a trip \"doon the watter\".Sir Billy Connolly, strumming a banjo on  its deck in the 1970s, summed up the attraction.  \"No kidding, it's a magic way to spend the day,\" he sang. For one more recent passenger, X/@ImagesLundy, a trip on The Waverley is about nostalgia and reminiscence.\"It captures the magic of times gone by. It was a truly mesmerising experience, as kind of time warp as though living part of history.\"The oil-fired steamship, built at the A & J Inglis yard in Glasgow, replaced an earlier PS Waverley that was lost during the evacuation of Dunkirk in 1940. Entering service initally with the London and North Eastern Railway Clyde paddle steamer fleet, it eventually ended up being owned by Caledonian MacBrayne. In 1974, it was gifted it to the Paddle Steamer Preservation Society for £1, after it was withdrawn from active service.The ship has an annual dry dock \"MOT\"  where the hull is inspected and shipyard work is carried out in Greenock where specialist skills are needed to maintain the paddle wheels. A boiler refit in 2020 cost £2.3m, while an earlier heritage restoration completed in 2003 restored the ship to its original appearance internally and externally, with new safety systems fitted at a cost of £7m. This year the crowds kept coming as the vessel carried more than 140,000 passengers during the summer - the busiest season in years thanks to an extended sailing programme.Paul Semple, general manager of The Waverley, said the trips away from Scotland help keep the tradition of pleasure steamers alive in the Thames, Bristol Channel and the south coast: \"It's about making sure that we keep the last of the paddle steamers going. \"Visiting other areas of the UK in shoulder season, spring and autumn, makes her more viable.\"Clare Adams, from the Isle of Wight, said taking her children on the ship brought back memories of days out with her parents when she was a child.\"We went to Yarmouth and we all queued up on the pier waiting for it. You could see it coming from quite a distance away, so that was quite exciting, watching it slowly get bigger as it gets nearer to you.\"Getting to see how it all works when you can go down to the engine room, that's quite exciting,\" she said.That engine room with its steam, steel, copper and gleaming brass -  soundtracked by a steady mechanical heartbeat -is a highlight of any trip. One of The Waverley's longest-serving engineers, John Lees, has worked on the paddle steamer for more than 20 seasons. A new generation of apprentice engineers are now learning the skills of the shipyard to keep the paddle steamer operational.Here, the last Clyde-built sea-going paddle steamer passes the shipyard at Clydebank in 1985 - an industry that has mostly since disappeared. Paddle ships were once a common sight along the river, but PS Waverley is now the only vessel of its kind in the world.The Waverley here returns to the River Clyde in Glasgow - also home of Victorian cargo vessel, the Tall Ship Glenlee, and the city's Riverside Museum which is dedicated to transport. Advances in technology and changing holiday habits led to a decline in passenger numbers on paddle steamships and yet The Waverley has outlasted the industrial times of the city where she was built.In this moody shot, The Waverley passes Dumbarton Castle in August 2023. The ship will be in for maintenance on the 77th anniversary of its launch this week - getting ready to sail again.",
  "datetime": "2023-10-01T06:43:27.000Z",
  "title": "The enduring allure of The Waverley paddle steamer"
}
