{
  "text": "I was told that the next big thing in K-pop were nervous backstage before the showcase of their first studio album. No wonder. These teenagers may feel that they have a lot to live up to.Tomorrow X Together, also known as TXT, have been billed as the little brother to the global sensation BTS. They are only the second idol group to come from the agency Big Hit Entertainment which launched BTS back in 2013.So, as you can imagine, expectations are high - and they know it.The group's leader, 18-year-old Soobin, told the gathered press, \"BTS and Big Hit have given us very large wings and I think it is our job to soar on these wings. Our job is to make these wings strong, and become a group that BTS can be proud of.\"Their debut in March was a promising start. The Dream Chapter: Star launched at No. 140 on the Billboard 200 in the United States, making it the highest-charting debut album by an all-male K-pop group. But now it's time for their first studio album release.I felt the nerves showed a little as they were introduced one by one for photographs. Soobin, Yeonjun, Beomgyu, Taehyun and Korean-American Huening Kai had to pull a pose for the cameras alone on stage. But put them together and wow they are dynamic - just as you would expect from a K-pop group. The moves were slick, punctuated and mesmerising as they performed Run Away on stage for the first time. The accompanying cinematic video tells a story of teenagers dreaming about running away from school. They find a secret door under a swimming pool into a magical world. Their own special place. Their lyrics focus on the emotions of being a teenager as 17-year-old Taehyun said: \"We have these bursts of emotions and want to share how we feel. These are stories that a lot of people can relate to.\"They dream of being rookies of the year, and have even coined the term \"rookies you can count on\". But this industry is robustly healthy and dozens of talented K-pop acts have debuted in 2019. Many aim to speak to a troubled youth and most offer to take them by the hand and transport them into the magical world of K-pop where fans are encouraged to lose themselves and dream.So do TXT stand out from the crowd?Mimyo, chief editor of Idology, feels they have a bit more work to do.\"TXT for now don't stand out much in terms of skill but what to note is their production is good.\" But he does think that they stand apart from big brother BTS.\"Ever since TXT debuted, it was very clear that they were a very different group than BTS. Other than the fact that they both came from the same entertainment company, I feel like there are almost no similarities.\"The core aspects of a K-pop idol group are this young, good-looking ideal and the idea of entering into fantastical worlds. But BTS was different from mainstream K-pop at the time of their launch. Their narrative was based on reality, stories of pain and suffering, and members talking about their own life stories. These were used in their music.\"Compare that to TXT which is a much more simple, good-looking group that you could lightly consume.\"In an interview with Time magazine, the founder of Big Hit Entertainment, Bang Si-hyuk, put the success of BTS down to their sincerity. I was struck by it myself at a BTS press conference earlier this year. I had not expected this answer from leader RM when he was asked about the pressures of the industry. \"The pressure is always there. Sometimes I feel scared of the spotlights and the audience. Sometimes I even feel like I want to run away… I cannot say I have completely overcome the fear, but now I have learned how to live with that. I am finding my balance between the precious support from the fans and the burden and weight,\" he said.BTS have put their hearts and souls on display at a time when many are questioning the pressure of the K-pop spotlight. They allowed a conversation about mental health when others remained silent on the toll this intensely competitive entertainment industry takes on young performers. Promising stars are often put through gruelling training schedules and many have strict controls over their private lives including bans on dating. Social media can be K-pop's best friend. Some have even compared parts of the big entertainment companies to IT firms because they spend so much time managing online media accounts, new releases and fan pages. But it can also be toxic for stars. Last week, singer and actress Sulli took her own life after years of dealing with malicious online comments. Of course, it was BTS' choice to discuss their lives. There is no reason the mantle should be handed to their little brother.TXT do sing about the difficult transition to adolescence, but the emotional rollercoaster of being a teen which was on display in the music video was missing from the press conference. Instead they maintained the brighter, more bubbly persona of a pop band. The youngest member, Beomgyu, told me when I asked him a question about the pressure of being constantly on display: \"There is pressure, but it also gives us driving force to prepare harder. And I think it allowed us to bring a well-made album to fans.\"They are young and they have time to develop a persona with the press, and their most important professional relationship right now is with their fans.Like every successful K-pop group, they've give their fandom universe a name - which was chosen by the fans themselves. It's MOA which stands for \"Moments of Always-ness\". Within months of starting a Twitter account they had more than 2.5 million followers. K-pop's success lies in its ability to connect fans with their idols through social media, and to make them feel part of their idol's lives. And this fanbase is growing. The government-affiliated Korea Foundation predicts that the number of people who consume Korean music, film and TV will reach 100 million by next year. The market is out there. So when it comes to becoming \"K-pop's next big thing\", it is not about living up to the expectation of BTS or even Big Hit Entertainment.TXT's main goal will be to live up to the expectation of their fans.This video can not be playedBTS open up about their \"struggles and tears\" at press conference in Seoul",
  "datetime": "2019-10-21T23:50:04.000Z",
  "title": "TXT - K-pop's next 'idol' sensation"
}
