{
  "text": "This video can not be playedWatch: Fire after Russian airport drone attack, says governorMoscow has vowed Ukraine will \"not go unpunished\" after drone strikes hit targets in Russia, while Kyiv saw its heaviest bombardment in months.The drones hit several Russian regions and damaged two military planes, a fuel depot and a microelectronics factory.Meanwhile Ukrainian officials said most missiles and drones were shot down but two people were killed.Kyiv has not said that it was involved in the latest attacks, but it rarely comments on strikes inside Russia. In recent weeks, however, Ukraine is believed to have increased its use of explosive drones to attack targets in Russia. This is all part of its counter-offensive strategy - making it as difficult as possible for Russia to keep its frontline troops supplied, as it pushes on with its full-scale invasion of Ukraine.At a regional airport in Pskov, a western city that lies some 600km (372 miles) from Ukraine, two military planes were struck and burst into flames according Russian news agencies.The regional governor, Mikhail Vedernikov, said that he was at the scene and posted a video on Telegram showing a large fire, while an explosion could be heard. The damaged aircraft - Ilyushin 76 - are long range cargo planes, that are ideal for transporting troops and equipment over long distances. Pskov airport, which was closed to its select few civilian flights on Wednesday, also serves as an important military hub. They are valuable war assets to Russia, and that makes them targets for Ukraine.Pskov first came under drone attack this year in May.There were more attacks further south, with the Russian military saying it shot down Ukrainian drones in the Bryansk, Kaluga, Oryol and Ryazan regions, plus one near the Crimean city of Sevastopol.Bryansk's regional governor, Aleksandr Bogomaz, said one was intercepted en route to destroying a TV tower, while another hit a microelectronics factory, where components for Russia's weapons systems were made.A fuel depot in Kaluga was also hit - yet another logistical target involved in keeping Russia's war machine rolling.Ukraine's plan to fight back against Russia's invasion has been described as \"starve, stretch and strike\" by the UK's Chief of the Defence Staff, Admiral Sir Tony Radakin.Kyiv hopes that this strategy of targeting key infrastructure - as well as long-range artillery and missile strikes well behind Russia's front lines in southern Ukraine - will help Ukrainian forces to push though those lines and achieve some measure of success before the end of the year.This video can not be playedMissile debris rains down from the Kyiv night skyIn Ukraine's capital Kyiv, meanwhile, night time footage showed balls of fire flying through the night sky and exploding.General Valeriy Zaluzhnyi, the commander-in-chief of Ukraine's armed forces, said there were 44 Russian strikes in total - 28 missiles and 16 drone attacks. He said all except one drone were intercepted.The two people who died were security guards in the city's Shevchenkivskiy district, Mayor Vitali Klitschko said.Cruise missile debris was scattered across a park north-west of the city centre, and authorities were at the scene investigating the wreckage on Wednesday.The air attacks in Russia are the latest in a spate of strikes deep inside its territory.Last week, three people were killed in the Belgorod region hours after a drone hit central Moscow, Russian officials said.And around the same time, a Russian long-range bomber was destroyed in a Ukrainian drone strike at an airbase south of St Petersburg. President Volodymyr Zelensky has previously said that attacks on Russian territory are an \"inevitable, natural and absolutely fair process\" as the war with Russia continues.Sign up for our morning newsletter and get BBC News in your inbox.",
  "datetime": "2023-08-30T12:16:14.000Z",
  "title": "Ukraine war - Wave of drone strikes hits several Russian regions"
}
