{
  "text": "A council has apologised for a delay in responding to an application by a father to make adaptations to his Surrey home for his disabled son.Waverley Borough Council admitted \"unreasonable delays\" in dealing with a resident, whose son has cerebral palsy. Housing secretary Michael Gove has written to the council following a finding of \"severe maladministration\" by the housing ombudsman.The family were left waiting for 18 months for the adaptations. The ombudsman found poor communication throughout the application process, which Mr Gove said caused the father to feel \"let down and ignored\".In the letter, addressed to council chief executive Tom Horwood, Mr Gove said the father carried out the works himself due to the delay. \"You failed to take account of how important the work was to this family. This is deeply disappointing,\" Mr Gove said. \"I have been clear that social housing residents must be able to put their trust in their landlords to provide a decent home and deal with complaints effectively.\"Waverley Borough Council said it was taking steps to improve the application process, and accepted that their communication \"could have been improved\". \"The council has learned valuable lessons from this case, and as requested by the ombudsman, we are in the process of carrying out a comprehensive review of our policies and procedures,\" a spokesman said. As part of the review, the council is conducting interviews with residents to gather feedback on their policy.Mr Gove added: \"I expect the changes you are implementing to make a significant difference to the service you deliver to your residents. I will be taking a personal interest in how your organisation continues to deliver its responsibilities.\"Follow BBC South East on Facebook, on Twitter, and on Instagram. Send your story ideas to southeasttoday@bbc.co.uk. ",
  "datetime": "2023-09-18T05:14:19.000Z",
  "title": "Waverley Borough Council apologises for disability home adaptation delay"
}
