{
  "text": "Whether it's watching a show like Squid Game or listening to BTS hits such as Butter or Dynamite, chances are you've had some kind of Korean influence in your life.And now that South Korean influence has reached the Oxford English Dictionary (OED).The \"accepted authority on the English language\" has added 26 new words of Korean origin to its latest edition.With these additions, \"we are all riding the crest of the Korean wave\" the OED says in a statement.Korean food features heavily in the latest list, with some of the new additions including:With the international success of Squid Game, Parasite and BTS, it should come as no surprise South Korean pop culture is represented in the list as well.The OED said including so many Korean words was a recognition of the shift in language used by English speakers.\"They show how Asians in different parts of the continent invent and exchange words within their own local contexts, then introduce these words to the rest of the English-speaking world, thus allowing the Korean wave to continue to ripple on the sea of English words.\"The full list of new words can be found here.The success of Korean exports such as Squid Game or Parasite can be put down to greater global thought by cultural producers, according to Dr Hye-Kyung Lee from King's College London.\"It's been more than 10 years since the early success of K-pop, so Korean cultural producers have a global mindset,\" says Dr Lee, who researches culture and arts, looking at the rise of K-drama and K-pop.She says characters in K-drama are ones people in the UK and internationally can relate to, despite the geography and language difference.\"The characters do not have a lot of hope, they don't have a future and just struggle to survive.\"\"These dramas or films are entertaining, and they have something unique which can strike a chord with people around the world.\"\"They present a critique of society and social economic conditions, which people can relate to through the characters.\"She says the industry has caught up with Western countries in terms of cultural production and believe it will continue to grow.\"In terms of technology and talent, they are cutting edge and have a strong capacity to produce high quality products,\" she adds.The success of South Korean exports in the UK has been happening for a while.Back in 2012, you might remember Gangnam Style by rapper Psy, who became the first South Korean pop star to make it to the top of the UK singles chart.Oscar-winning film Parasite is currently the highest-grossing non-English language film in the UK.And pop group BTS became the first Korean act to score a chart-topping album in the UK - and appeared on Radio 1 this year, recording a special Live Lounge performance.This article contains content provided by Google YouTube. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Google’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.Squid Game is currently on track to be Netflix's most-watched series ever - it's in the UK top 10 list and 95% of the show's viewers are from outside Korea.Follow Newsbeat on Instagram, Facebook, Twitter and YouTube.Listen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here. ",
  "datetime": "2021-10-05T11:30:29.000Z",
  "title": "Why 26 Korean words have been added to Oxford English Dictionary"
}
