{
    "text": "Share this article CULTURE BOOST: Celebrating a funding boost, Hihiaua Cultural Centre team, from left, Te Warihi and Janet Hetaraka and Te Kauri Parata The vision for a Whangarei centre to honour, teach and showcase excellence in Maori culture and art has been boosted by a $750,000 grant from Foundation North. While there is no start date for the Hihiaua Cultural Centre, the grant announced yesterday brings funding for the $2 million first stage to well over the half way mark. Whangarei District Council pledged $500,000 for the mixed-use cultural precinct in its 2015-2025 Long Term Plan. Hihiaua will be a focal point of both traditional and contemporary Maori arts and culture. Stage One includes remodelling a shed, currently used for carving, into a whare toi (studio/gallery) and building a new whare waka for storing, displaying and launching waka. Planning for the centre, on the peninsula between the Hatea River and Waiarohia Stream, has been in the public arena since 2007 but trustee and project leader Te Warihi Hetaraka said Maori elders first proposed it in 1980. \"It's carrying out the elders' wishes. They wanted to ensure the retention of the culture and create a centre for all hapu in Whangarei,\" Mr Hetaraka said. Trust secretary Janet Hetaraka said high on the wishlist for future development was a \"big outdoor stage\" for performances and other functions. A planned auditorium would cater to large audiences. Developed over four stages, it would include working studios, galleries, a laboratory for studying native marine life, flora and fauna, climate-controlled facilities for storing feathers, other materials and taonga, an auditorium and an outdoor amphitheatre. The centre would also be a meeting place for other indigenous people, building on last year's opening of the Pacific Indigenous and Local Knowledge Centre of Distinction at neighbouring He Puna Marama Trust. The trust would develop Hihiaua on behalf of all hapu and the community, Ms Hetaraka said. \"It's by Maori, for all.\" It was a concept that fitted neatly with Foundation North's own vision for communities. \"The total Hihiaua Cultural Centre project is aspirational and tremendous in its vision\" said the foundation's chief executive Jennifer Gill. \"It would simultaneously act as an anchor for the cultural background of the city, and a beacon which calls people to grow and experience Matauranga Maori in a contemporary setting.\" Hihiaua chairman Richard Drake said the trust was delighted about the grant, and hoped the remaining amount would come in soon so building could start. All the consents were in place and interested builders were waiting for the tendering process to start. Since the plans were formalised 20 months ago, building costs had gone up considerably, Mr Drake said. There were other training and exhibition centres for traditional arts and craft in New Zealand but the Hihiaua Cultural Centre would be unique, he said. \"We've always wanted a gallery for  authentic Maori art and cultural treasures and to include a performance venue. \"We have always, as part of our overall plan, had the objective of preserving, promoting and presenting all forms of Maori art, while creating a cross-cultural community facility.\" Although the concept had been eclipsed in profile and fundraising terms by the Hundertwasser and Wairau Maori Art Centre (HWMAC), the Hihiaua team had been busy over the same period. Mr Drake was earlier quoted as saying the two projects were separate and not in competition. \"A lot of people see they would complement, others see it differently. We've avoided that debate.\" The Hihiaua trust withdrew an application for a Foundation North grant last year so as not to compete with the Hundertwasser project's push to get over the line. Share this article The father has taken up carving in prison as a way to process his grief. ",
    "title": "$750K for Whangarei Maori arts and culture centre - NZ Herald",
    "url": "https://www.nzherald.co.nz/northern-advocate/news/750k-for-whangarei-maori-arts-and-culture-centre/TZSSHLJICJRAMVJV3ZUVMCFXVI/"
}