{
    "text": "SINGAPORE - A new range of educational programmes was launched on Sunday to introduce the less privileged to Singapore's heritage sites and institutions. There will be free guided trails of historical sites, workshops and interactive programmes at the country's museums which are specially tailored to the needs of low-income families, people with disabilities or special needs, youths at risk and senior citizens. HeritageCares, an initiative by the National Heritage Board (NHB), aims to reach about 12,000 Community Chest beneficiaries over the first three years. It will be supported by a $750,000 donation from watch retailer Cortina Watch from the auction of a table clock created by Patek Philippe, and funds from the Ministry of Culture, Community and Youth's Cultural Matching Fund. Ms Grace Fu, Minister for Culture, Community and Youth, told the launch event on Sunday morning: \"It's important that our heritage is presented to all parts of our society and we'd like it to be as inclusive as possible.\" Ms Fu joined a group of around 80 volunteers and people from low-income families on a section of the Jubilee Walk from the National Museum to the Spice Garden at Fort Canning Park and Singapore Philatelic Museum, which was the first activity under HeritageCares. The NHB hopes to attract companies to donate and encourage their employees to volunteer under the initiative. It is also working with Youth Corps Singapore, whose volunteers will be trained as trail guides for the 8km walking trail that makes up the Jubilee Walk. Join ST's WhatsApp Channel and get the latest news and must-reads. Read 3 articles and stand to win rewards Spin the wheel now MCI (P) 066/10/2023. Published by SPH Media Limited, Co. Regn. No. 202120748H. Copyright © 2023 SPH Media Limited. All rights reserved. ",
    "title": "$750k initiative will bring national heritage to the less privileged | The Straits Times",
    "datetime": "2016-03-13T15:09:54+08:00",
    "url": "https://www.straitstimes.com/singapore/new-initiative-to-bring-national-heritage-to-the-less-privileged-with-750000-worth-of"
}