{
    "text": "As Congress shifts focus to next year’s spending bills, education advocates are getting ready to renew their push against the across-the-board funding cuts known as “sequestration.” But the fallout from the cuts, which trimmed roughly 5 percent from federal K-12 funding overall this year, is often hard to illustrate or quantify, even for seasoned number-crunchers. The sequestration cuts—which were put in place for virtually all federal agencies in 2011 to force a long-term budget agreement—are hitting most districts at the start of this coming school year. While some Head Start early-childhood programs already have had to make painful choices, sequestration’s impact on K-12 education in the fiscal year ending Sept. 30 is very uneven around the country. “I thought by now we’d start to hear feedback from school districts and states,” said Michael Griffith, a school finance consultant for the Education Commission of the States in Denver. Mr. Griffith, who travels around the country talking to state and district officials about fiscal issues, hasn’t heard nearly as much about sequestration this summer as he thought he would. “At no point did [state and district officials] ever bring up the issue. If I brought up the issue, I got met with a shrug, basically. It was surprising to me.”  One possible reason for the lack of anxiety: Thanks to the economic recovery, states are generally much more fiscally fit than they were in past years, and many have decided to boost K-12 funding, Mr. Griffith said. “People tend to look at the bottom line for all education spending, and most states had a decent budget year,” he explained. “They increased education spending, and that might cover up the sequestration cuts.” Sequestration is slated to remain in place for the next decade, until Congress is able to come to up with a long-range plan to trim the deficit. Earlier this year, the White House used K-12 education as a poster child to illustrate the potentially devastating impact of the cuts on domestic programs. As part of that push, U.S. Secretary of Education Arne Duncan went on CBS’ “Face the Nation” and predicted that 40,000 teachers could lose their jobs.  Months later, Mr. Duncan agrees that the relatively rosy state fiscal picture has meant fewer teacher layoffs than the administration initially suggested might take place. But, he argues, sequestration is still having an effect on student learning. “It is a good thing that we had less layoffs than were possible,” said Mr. Duncan in an interview July 30. “It’s been obviously extraordinarily helpful that states and local communities have increased their investment, but at the end of the day, we at the federal level need to be a good partner.” To make up for the federal cuts, he said, districts have put off updating their technology or replacing outdated textbooks. “The fact that those investments aren’t being made, that’s not something we should feel proud of,” Mr. Duncan said. And he thinks the impact will only get worse if the cuts remain in place for years. “It’s a noose around your neck that just gets a little tighter and a little tighter.” He also stressed the effect of sequestration on districts that rely on roughly $1.2 billion under the federal Impact Aid Program, which helps school districts with a nearby federal presence, such as a military base. But some members of Congress remain unpersuaded. U.S. Rep. Todd Rokita, R-Indiana, the chairman of the House subcommittee that oversees K-12 policy, said the administration blew the impact of the cuts far out of proportion.  “Given what the president and the secretary and the entire administration said about the cuts, I’m surprised any teacher’s car started the morning after sequestration,” Mr. Rokita said. “The effect of the sequester was small in the education world. ... I’m not surprised that states and localities were able to weather this. It wasn’t nearly as drastic as the administration led us to believe.” Sequestration doesn’t appear to have led to massive layoffs or huge programmatic reductions in most Virginia districts, Charles Pyle, a spokesman for the state’s department of education said. That might be, in part, because education spending at the state level is up, from $5.17 billion in the 2012-13 school year to $5.34 billion this coming school year. Plus, Mr. Pyle said, the state gave districts plenty of notice that the cuts were coming—alerting them to the possibility of sequestration as early as last summer. That gave districts time to figure out how they would implement the cuts without much of an impact on classrooms, which might become a lot tougher if the reductions stay in place for yet another year. Other states and districts were able to soften the blow by using federal flexibility to shift unused funds from previous fiscal years to help cover the shortfall. For example, New Jersey was able to cut its federal funding loss roughly in half, from a projected $44.6 million for the coming school year to roughly $22.6 million, according to a spokesman for the New Jersey department of education. And the timing of sequestration was fortunate: Districts in the nearly 40 states that have received waivers from the mandates of the No Child Left Behind Act no longer need to set aside 20 percent of their Title I funding for school choice or tutoring services. This was the first year that districts got access to those long-withheld funds. “That allowed us to have some additional dollars, which helped mitigate” the impact of the cuts on the classroom, said Milagros Fornell, the chief academic officer of Florida’s 315,000-student Miami-Dade County school district. But that doesn’t mean the cuts are no big deal. Under sequestration, which took effect in March, the Title I program, which is financed at roughly $14.5 billion, was cut by $725 million nationally. Special education state grants, funded at $11.6 billion, were cut by $600 million. Overall, those were the most significant cuts to key formula grant programs in recent history, according to the Committee for Education Funding, an education lobbying coalition. In some cases, that’s meant prioritizing. The 34,000-student Cincinnati school district lost about $4 million out of roughly $54 million in federal funding thanks to sequestration. That didn’t directly translate into layoffs, but it’s going to affect instruction just the same. The district put off some necessary technology upgrades, including $1 million to refresh computer systems to prepare for online tests linked to the Common Core State Standards. Cincinnati also cut a contract for school-based technology support by $500,000 and put off spending about $300,000 in extra software upgrades, in addition to trimming professional development. The cuts come as Kentucky is still reeling from the recent recession. The Bluegrass State has weathered more than $100 million in total programmatic reductions for education since 2006, said Rebecca Blessing, a spokeswoman for the Kentucky department of education, in an email. While basic classroom funding was preserved, “we have not funded textbooks and resources for five years. Increasing costs of health care and pensions have had a devastating impact as well,” she said.  And in some states, the cuts have led to job losses. The 1,600-student Rockford Area school district in Minnesota lost roughly $19,250 of its Title I funds, which meant cutting one paraprofessional position, according to Paul Durand, the superintendent. Still, he noted that it’s tough for a small school district to tell which funding reductions are the result of sequestration and which might be the result of other factors, such as changes in enrollment or cuts to local and state funding. Kathy Murphy, the superintendent of the Monroe County schools in the southwestern corner of Alabama, a high-poverty district that’s heavily reliant on federal funds, seconded that. Ms. Murphy lost 13 staff positions this year, some through attrition and others through layoffs. But she isn’t sure which job losses directly resulted from sequestration. “What we know is that we have less teachers employed,” she said. “How much of this we can put at the feet of sequestration and how much can be put at the feet of declining enrollment because of a foundering economy? It’s hard to parcel out which is which.” The 1,200 impact-aid districts may be among the hardest hit. The National Association of Federally Impacted Schools surveyed 45 impact-aid schools about how they had implemented the cuts. NAFIS found that 31 districts had cut positions, either through layoffs or attrition. One district reported using online learning to keep the student-teacher ratios from soaring out of control. Eleven districts said the cuts would be minimal in 2013-14, but only because they’re tapping reserve funds. Meanwhile, on Capitol Hill, the battle over sequestration is likely just beginning anew. The U.S. House of Representatives recently passed a Republican-backed bill to reauthorize the Elementary and Secondary Education Act that would lock the cuts in place.  And the House GOP budget blueprint approved earlier this year would actually deepen the cuts for domestic discretionary spending, while alleviating sequestration for defense programs. It’s unclear, however, exactly what that would mean for K-12 programs, because the committee that oversees education spending hasn’t put forth a specific plan yet for implementing the domestic cuts. On the other hand, the Democratically controlled Senate Appropriations Committee gave a partisan stamp of approval to a spending bill for federal fiscal year 2014, which starts Oct. 1, that would essentially “pretend sequestration never happened,” according to Clare McCann, a policy analyst at the New America Foundation’s Federal Education Budget Project. Congress will also have to revisit the government’s borrowing limits sometime this fall. That likely means another round of budget wrangling and uncertainty, said Joel Packer, the executive director of the Committee for Education Funding. “I don’t think there’s going to be one big final package,” he said. “There’s going to be multiple fights and crises and [short-term] budget bills.” All of that may mean that sequestration stays in place for the long haul—a prospect that has even districts that came through the first year of sequestration relatively unscathed feeling anxious. “I’m dreading next year,” said Ms. Fornell of Miami-Dade.  A version of this article appeared in the August 07, 2013 edition of Education Week as Quantifying Pain From ‘Sequester’ Proves a Puzzle ",
    "title": "'Sequester' Impact Proves Tough to Track",
    "datetime": "2013-08-02T15:57:30",
    "url": "https://www.edweek.org/policy-politics/sequester-impact-proves-tough-to-track/2013/08"
}