{
    "text": " Follow think MORE FROM NBC © 2023 NBCNEWS.COM As a Korean American, it’s crazy to see how Korean pop culture has exploded in popularity in the U.S. in recent years. Today, it’s not uncommon to see Korean content and stars grabbing headlines in Western media, whether it’s “Squid Game” being greenlit for a second season or K-pop superstars BTS releasing their latest album “Proof” to commemorate the group’s ninth anniversary. But with global demand for Korean pop culture at an all-time high, it feels like South Korea is kind of losing control over its cultural narrative. This dichotomy between “K-culture” and “Korean culture” is probably being further reinforced by mainstream English-language news outlets Just a decade ago, I was fruitlessly seeking opportunities to write about K-pop; today, I’m frequently turning down requests from various editors and publicists asking me to write an article about a new K-pop idol group — that is, photogenic boy or girl bands that perform the kind of dance music that many of us have now come to associate with K-pop. I never thought I’d see the day when I’d actually get tired of people asking me to write about the topic, but it seems that just when much of the Korean public and the Korean diaspora have moved on from K-pop due to the surfeit of idol groups (about 200 to 400 of them have debuted in the past decade, and over 50 are debuting in this year alone), the rest of the world is clamoring for it. As I’ve written before, the type of Korean cultural content that’s popular in South Korea — whether that’s music, films or TV shows — often tends to be very different from the kind that’s popular abroad. Until “Parasite” came along, Korean films that were a hit with many international audiences were box-office flops in South Korea, and vice versa. K-pop is probably the best example of this puzzling paradox. “It seems like anytime someone writes something about K-Pop — particularly pieces on boy and girl bands — it doesn’t really matter who authored the articles, it’s pretty much a guaranteed way to generate massive clicks,” Bernie Cho, a music industry veteran and president and founder of DFSB Kollective, an agency that works with hundreds of independent Korean music acts, explained to me. “But unfortunately, what sort of happens as a result of this type of clickbait journalism is that you get a very skewed and myopic lens on the Korean music industry landscape. If you only believed what you read online, it would be easy to assume that every Korean music artist was a boy band or girl band.” Cho noted that a 2020 Korea Creative Content Agency survey of music listeners in South Korea found that ballad is the most widely enjoyed genre in the country, polling in at a whopping 76.5 percent. “The irony is that if you scan the year-end music charts in Korea, the most streamed artists are actually not boy bands or girl bands,” said Cho. Case in point: Last year, K-pop solo artist IU took the top spot on Korea’s streaming charts, while the two most downloaded songs in Korea both went to trot and ballad singer Lim Young-woong. And yet, because of the ever-growing global popularity of K-pop girl and boy bands — largely thanks to their vast international fan bases — it’s the kind of music that gets heavily marketed outside of Korea.  Even the way we’ve come to define “K-pop” — as music dominated by idol groups with flashy outfits and slick choreography — has been influenced by the narratives pushed by international (especially Western) media outlets and fans. However, Cho argues that the definition of K-pop should be broader to encompass any kind of Korean music that happens to be popular in Korea. He points out that in South Korea, all Korean artists are lumped together into one consolidated “K-pop” chart, which includes a diverse array of genres from hip-hop to R&B to ballads and rock. He compared it to the U.S. pop charts, where artists from a wide range of genres make up the Top 10 and Top 20 spots. “They’re pop artists because they’re popular — it’s less about the style and more about the statistics,” he said. Though Cho’s answer is technically correct, it seems the predominance of idol music in K-pop’s global reach has impacted the way that even Koreans themselves think about K-pop. When I ask my Korean friends and acquaintances about K-pop, almost all of them now seem to equate it with idol groups, and virtually none of them listen to it (except for the few who have to because it’s directly related to their jobs). In fact, most Koreans I know have told me they listen to Korean indie and folk rock, trot, ballads and/or music by non-Korean artists. The growing popularity of Korean TV shows have proven to also reveal this disconnect. Recent South Korean favorites like “Hometown Cha Cha Cha” and “Twenty Five Twenty One” — both available on Netflix — also did well internationally, but in the U.S. they were nowhere near as popular as Netflix’s original thrillers like “Squid Game,” “All of Us Are Dead” and “Hellbound.” Currently, the slice-of-life K-dramas “Our Blues” and “My Liberation Notes” are the top two shows on Netflix in South Korea and are both sitting in Netflix’s Global Top 10 list of non-English series, but neither has cracked Netflix’s U.S. Top 10. To help explain the divergence in Korean pop culture preferences between South Korean and international (especially Western) audiences, I spoke to David Tizzard, a professor at Seoul Women’s University who hosts the “Korea Deconstructed” podcast and regularly contributes to The Korea Times. He has a theory that makes a distinction between what he calls “K-culture” and “Korean culture.” “K-culture — anything with a ‘K ’— is primarily designed for export. It’s not designed for the domestic market; it’s designed with the taste of international people in mind,” he said. K-pop idol groups would probably be the quintessential example of this. “Squid Game,” which targeted the global market from the get-go, is another great example. In contrast, content that reflects “Korean culture,” according to Tizzard, is designed primarily for Korean audiences. Korean historical dramas and variety shows would probably fall in this category. Many of them are hugely popular with domestic audiences, and although some (such as the historical romance “The King’s Affection”) do well in other countries, they’re rarely expected to chart globally, since usually their primary aim is to inform and entertain Korean viewers. Moreover, this dichotomy between “K-culture” and “Korean culture” is probably being further reinforced by mainstream English-language news outlets, which tend to overemphasize certain K-pop idol acts over other kinds of Korean artists and show a predilection for covering only certain types of K-dramas. All that said, sometimes I wonder if I’m the one who’s selfishly and needlessly attempting to impose a narrow view of how Korean culture should be understood and interpreted. Pop culture is meant to be enjoyed and shared by everyone according to their own tastes. Perhaps that’s partly why Korean pop culture in particular has taken off across the globe — its elements are so diverse that there’s bound to be something for everyone. So if K-pop stans are crushing on and promoting the heck out of their favorite idols on Twitter and YouTube — so much so that media outlets are forced to pay attention — well, who am I to rain on their parade? And if Americans tend to enjoy violent K-dramas while most Koreans prefer more low key and family-friendly ones, like “Twenty Five Twenty One” or “Our Blues,” who am I to say who’s right and who’s wrong? In the end, I’d still much rather see people associate my motherland with idol K-pop and gory K-dramas than with, say, a certain dictator. Maybe those of us of Korean descent, who are observing this ever-expanding Korean Wave with a mixture of pride and bewildered amusement, should just learn to let go and enjoy the ride. Regina Kim is a freelance entertainment writer focusing on Korean pop culture. You can view some of her writings on her website reginakim.com. © 2023 NBC UNIVERSAL ",
    "title": "'Squid Game,' BTS and what may surprise you about Korean culture",
    "url": "https://www.nbcnews.com/think/opinion/squid-game-bts-what-may-surprise-you-korean-culture-rcna33354"
}