{
    "text": " Sections Shows More Follow today More Brands You're too busy to enter random dates from the last several hundred years into this sensational new tool called \"The Office\" Time Machine? False. You will enter dates now, and you will enjoy a mind-boggling array of cultural facts built into countless scenes from the former NBC series. No, Dwight K. Schrute didn't build the Time Machine, but a similarly obsessed genius sure took the time to demonstrate how \"culture enriches everything\" and how \"The Office\" was so often \"relatable (and hilarious) because it borrows so much from culture.\" Joe Sabia is the man behind the machine, which he just so happened to unveil on Monday, the anniversary for the premiere of the American version of the series in 2005. Below the embedded YouTube player which serves as the portal for all of his work, Sabia writes about why he did it — \"to advocate for copyright reform and highlight the importance of fair use in protecting creators and their art\" — and how he did it — he watched all nine seasons, waited for a cultural reference, looked it up and eventually cataloged about 1,300. It took him a year and a half. You don't even need to be a fan of \"The Office\" or Dwight or Michael or Jim or Pam or Stanley or any of the rest of the characters to get sucked into the Time Machine. Enter your birth date to check cultural references, or catch the names of celebrities, film titles, political figures, or song lyrics in a bunch of other years you test the Machine on. Enter 1 AD to get a bunch of Jesus mentions: Enter 500 AD for a reference (from Creed) and fact about the Loch Ness Monster: Jump to 1950 for multiple Charlie Brown references: The Time Machine will not allow you to travel ahead in time. Watch Michael's girlfriend Amy tell you she's from the future over and over if you enter 2015 and beyond:    © 2023 NBC UNIVERSAL ",
    "title": "'The Office' Time Machine delivers massive database of culture, comedy ",
    "url": "https://www.today.com/popculture/office-time-machine-delivers-massive-database-culture-comedy-2d79436771"
}