{
    "text": "When Wayne Kangas talks about his childhood on the Iron Range, it sounds idyllic. He was class president of his high school and captain of its baseball, basketball and football teams. He had loving and supportive parents, he said, who attended every game they could. Still, something was missing. There was a hole in his life he had covered up, a void he didn't even realize was there, until he left northeastern Minnesota for college in Wisconsin. \"It's rooted in this connectedness to Korean culture, Koreans, and people like me,\" he said. Kangas was born in South Korea, and adopted by his American parents when he was a baby. He remembers being the only Korean kid in school. He recognized he was different from his peers. But looking back on that time now, he didn't yearn for that Korean identity, he said, because he didn't even know what questions to ask. MPR News is supported by Members. Gifts from individuals power everything you find here. Make a gift of any amount today to become a Member! He's 33 now, and back home on the Iron Range, where he's embarked on what he calls a \"journey of self-identity.\" He's in the middle of a search for his birth family in Korea. \"I have a great life, but I still have a desire to know,\" he explained. \"To know what it is to be Korean.\" And that journey can be challenging, he said, in a rural place where he hasn't had access to Korean culture, to people who look like him, to a safe space where he can practice the little language he knows. But in the midst of all of that, Kangas met Byongchan and Africa Yoon, who want to build a summer camp in Ely, about an hour away from Kangas' home in Hibbing. They want to help connect kids to Korean culture through language, computer coding, choreography and K-pop. And Kangas said that void he once felt is getting a little smaller. He's now serving as an \"ambassador\" for the Yoons' organization, the K America Foundation, to other Korean adoptees. He joined them in Ely last month to explain their vision to about a hundred community members. For Byongchan Yoon, the project is \"deeply personal.\" He grew up in a small Illinois farming community. His was the only Korean-American family in town. He remembers driving for hours to take language classes. \"So I've lived how hard it was for even for two native Korean parents to teach their children Korean, Korean culture, and instill in us a sense of Korean pride,\" he said. And now he's raising three biracial kids of his own in Minneapolis, and he wants to help other parents instill that same Korean pride in their kids. Ely, he said, is a great place to do that. It's already a destination for people vacationing in the North Woods. And it's outside the Twin Cities metro area, which already has Korean camps, churches and markets. \"We wanted to go to rural Minnesota, where there weren't any or few Korean programs, and people have to travel far, like I did growing up,\" he said. But the big reason they chose to build their camp in Minnesota, Yoon said, is pretty simple: It's home to a larger percentage of Korean adoptees than any other state. \"People do joke about Minnesota being sort of the land of 10,000 Korean adoptees,\" said Richard Lee, a psychology professor at the University of Minnesota who studies Korean adoption. Part of the reason why so many Korean children have come to Minnesota is because the state is home to two large organizations with a long history of facilitating adoptions from South Korea: Children's Home Society and Lutheran Social Services. Adoptive parents founded Korean culture camps in Minnesota starting back in the 1970s, to create places where their children could meet other children from Korea and learn about Korean traditions and culture. Their children often faced a paradox, Lee said, as Korean children being raised, in most cases, by white families. \"You just physically look different than your family and everyone in your community,\" Lee explained. \"And even though those in your family and your immediate community see you as one of them, once you leave the comforts of those confines, the rest of the world sees you by your race and treats you accordingly.\" So Korean camps and other programs can do more than just help kids learn about their cultural identity. \"It's also a place for children and their parents to also have as a place where they belong,\" Lee said. \"Belonging is an important psychological need.\" As adoption numbers have dropped over the years, Lee said the camps are shifting to focus more on the children of adoptees and other Korean-Americans. \"They are now looking at these camps as an opportunity for their children to learn about and stay connected to their cultural heritage,\" Lee said. Byongchan Yoon said the K America Foundation wants to build something beyond what already exists in Minnesota. \"We hope to provide Korean experiences as if you've traveled to Korea, but with teachers to help support and encourage you to practice speaking Korean,\" said Yoon. He said they also hope to create partnerships with existing camps. Last fall Yoon's organization bought the 1930s-era Ely Community Center for $30,000. The city had tried for five years to sell it. Plans were hatched for an indoor farm, and a data center. But until now, nothing's panned out. \"This was the first real viable opportunity,\" said Ely Mayor Chuck Novak. \"We realized that if the building was shuttered, not heated, for four or five  winters in the future, it would just deteriorate to a point where you couldn't reclaim it.\" But there was pushback in Ely. The building has deep community roots. Novak remembers going there for Boy Scouts and church meetings and weddings. In public hearings about the proposal to sell the building to the Yoons, several residents said they wanted the community center to remain open to the public, and were wary of it being sold to anyone who isn't already part of the community. The Yoons watched the debate play out in the local newspapers. But Africa Yoon said her family plans to move to Ely after the building is renovated. \"I hope they'll get to know us,\" she said. \"We're just a family, three kids, coming to try to help other people, serve our heart, and serve a community, and I think if you meet me, maybe, maybe, race might fall to the wayside.\" But others came to the defense of the K America Foundation. They argued the plans were a perfect match for Ely, a town largely built on the backs of immigrants who came to work in the iron ore mines. \"Many people in Ely are not that far off the boat, myself included,\" said Celia Domich, who grew up in Ely and whose grandparents arrived there as kids from Finland and Croatia. \"We have classes on how to make potica,\" a Slovenian nut-and-pastry roll, she said. \"We're basically into our old world roots and culture in Ely, and this is just another culture that I think is exciting to have in Ely.\" The K America Foundation has six years to raise $3 million they need to renovate the historic community center, according to the purchase agreement it signed with the city. The center was built in the 1930s by the Public Works Administration, and has terrazzo floors on the inside and bas-relief carvings on the outside. If the Yoons' organization is able to pull it off, Wayne Kangas said he hopes the camp will provide his two young daughters growing up on the Iron Range, a safe place to learn about their Korean heritage. \"I want my girls to have the opportunity if they choose to to engage with that part of themselves, and I want them to be aware of it, and I want them to have that connectivity if they choose to have it,\" he said. And they'd only have to travel a little over an hour to do it. ",
    "title": "'To know what it is to be Korean': Foundation to build cultural center in Ely | MPR News",
    "url": "https://www.mprnews.org/story/2019/05/14/minneapolis-couple-eyes-ely-for-new-korean-culture-center"
}