{
    "text": "All Headlines North Korea Sports Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies URL is copied. (ATTN: ADDS photos) SEOUL, Oct. 14 (Yonhap) -- A spin-off of long-running South Korean television show \"Running Man\" is among the Korean originals to be released on Disney+ after the service's launch in the country on Nov. 12, its operator said Thursday. \"Outrun by Running Man,\" the first official spin-off of the SBS TV variety show, will star three members of the show's original cast -- Kim Jong-kook, Haha and Jee Seok-jin, the Walt Disney Company said during an Asia-Pacific content showcase of the streaming service. But the original show's main cast member Yoo Jae-suk will not participate in the spin-off series. \"Running Man,\" which revolves around emcees and guests competing with each other to complete missions at a landmark in Seoul, has been hugely popular for over a decade in Korea and other Asian countries. Walt Disney Company Korea CEO Oh Sang-ho (C) speaks during an Asia-Pacific content showcase of streaming service Disney+ in Seoul on Oct. 14, 2021, in this photo released by the company. (PHOTO NOT FOR SALE) (Yonhap)  \"Outrun\" was one of the 18 local-language Disney+ originals announced during the online showcase to be released in coming years in the Asia-Pacific region. Also among the Korean titles included in the lineup were a documentary about the K-pop supergroup BLACKPINK; \"Rookies,\" a coming-of-age romantic series set in Korea's elite police academy and starring K-pop idol Kang Daniel and actress Chae Soo-bin; \"Snowdrop,\" a romantic melodrama series starring South Korean heartthrob Jung Hae-in and Jisoo of BLACKPINK; and \"Moving,\" an action-thriller depicting a story of three teenagers discovering their unusual powers. Adapted from a popular web-based cartoon series by Kang Full, one of the most successful \"webtoon\" creators in the country, the thriller stars Ryu Seung-ryong, Han Hyo-joo and Zo In-sung. This image provided by Disney+ shows a logo of the company. (PHOTO NOT FOR SALE) (Yonhap)  A diverse range of local-language titles from Japan, Indonesia, China and Australia were also unveiled. Disney said it plans to secure more than 50 originals, including the 18 titles unveiled Thursday, in the region by 2023. \"I'm truly excited that we can provide a powerful platform for storytellers in Asia-Pacific to present their work to over a hundred million global subscribers,\" Jessica Kam-Engle, Disney's APAC head of content and development, said during the showcase event. \"With that, I hope that we can play our part in propelling the evolution of the creative industry in the region to create unique productions for the streaming experiences as we combine the power of Disney's unparalleled storytelling and cinematic excellence with the creative talents from Asia Pacific,\" she said. Jay Trinidad, Walt Disney Company's general manager of the direct-to-consumer division in the Asia-Pacific region, speaks during an Asia-Pacific content showcase of streaming service Disney+ in Seoul on Oct. 14, 2021, in this photo released by Walt Disney Company Korea. (PHOTO NOT FOR SALE) (Yonhap)  In the Korea Media Day event that preceded the showcase, Disney unveiled its high expectations for Korean content. \"South Korea continues to be a trendsetter showcasing some of the best original entertainment content in the world. In the world of content and entertainment, Korea has captured the imagination of global audiences with the power of K-culture,\" Jay Trinidad, general manager of the direct-to-consumer division in the Asia-Pacific region at Disney, said. \"With the launch of Disney+ in Korea, we hope to introduce Korean consumers with global entertainment and also showcase Korea's creative excellence to worldwide audiences.\" He said Disney will extensively invest in Korean content in the coming years but did not give numbers. sshim@yna.co.kr(END) All News National North Korea Economy/Finance Biz Culture/K-pop Sports Images Videos Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies Korea in Brief Useful Links Festival Calendar Weather Advertise with Yonhap News Agency ",
    "title": "(LEAD) Disney+ to release 'Running Man' spin-off in South Korea | Yonhap News Agency",
    "datetime": "2021-10-14T21:03:19+09:00",
    "url": "https://en.yna.co.kr/view/AEN20211014009351315"
}