{
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, visit My Profile, then View saved stories By Salva Mubarak Over the past decade, Korean pop culture, including music and TV, has gained intense popularity across the world. With Bong Joon Ho’s Parasite’s monumental success, more and more people have awakened to the brilliance of K-dramas and movies. But whether you’re new to embracing Hallyu (the Korean wave) or are a veteran, there are a lot of things that are bound to leave you confused while watching a K-drama. It is a globalised world we’re living in currently, so things might seem pretty familiar on the surface, but common Korean customs might seem unique to a lot of us. Fret not, here’s a little guide that might be a little helpful in navigating any K-drama or movie you want. You’re welcome! Remnants of 500 years of Confucianism can still be observed in the respect accorded to elders and seniors in Korean society. Seniority can be based on age, position in the family, or job title. While this might not seem out of place for us, as this is also a facet of Indian culture, there are some customs that prove how ingrained this is in their daily lives. For instance, if you’re out drinking with someone who is older than you, then it’s customary to turn your head away from them while drinking. Also, when you receive something from an older or senior person, it’s considered polite to use two hands while taking it. This goes for shaking their hands too. After-work hangs and team dinners are so important in Korean culture that they have a term for it: Hoesik. You’re obligated to attend these drink or dinner outings that can include your co-workers, supervisors, and sometimes CEOs. It’s considered as a way to increase the bond between co-workers. Hoesiks are used as essential plot device in many K-dramas, where it is used as a backdrop for whatever shenanigans the main leads have to pull. In real life, Hoesiks are considered tedious and problematic as the staff is still expected to uphold a strict code of conduct as this is considered an extension of the workplace. The #MeToo movement brought about significant change in corporate culture, with regards to Hoesik. Senior members of the company could no longer force the subordinates to attend these work dinners and drink excessively. Conscription, or compulsory enlistment of men in military services, still exists in Korea. By law, male citizens have to enlist for military services for at least two years, between the ages of 18-28. Korean celebrities, including actors and K-pop idols are not exempted from mandatory military services.The right to refuse enlistment didn’t exist in South Korea until recently. It was in 2018 that the South Korean Constitutional Court legalised conscientious objection as a basis for avoiding conscription. In Korea, calling each other by their first names directly is considered disrespectful. Your title can depend on your job description or position in the family. It also depend on whether you’re in a formal or an informal relationship with that person. For instance, if you’re in a formal setting, then you add ‘sshi’ after the name of the person to indicate respect. Another way of doing this is to add ‘nim’ to the end of their names. If you’re talking informally, say to a friend or your partner, you add ‘aa’ or ‘ya’ to the end of their name. In the workplace, Koreans address each other using their rank or job title in the company along with their names. One of the evergreen questions that continues to make rounds of millions of sub-Reddits, is why do characters in K-dramas not know how to hug or kiss? Once you start watching Korean TV shows, you’ll notice the lack of affection onscreen. The sparsely distributed scenes demonstrating physical affection, or ‘skinship’ (as it’s commonly referred to in Korea) are often awkward and stilted. Korean society is still conservative in a lot of ways, so couples in Korea don’t indulge in PDA in real life as it’s considered inappropriate. They use other ways to show their affection like wearing matching clothes or, sometimes, holding hands. While the pressure of cracking entrance exams to get into good universities is something we’re all sadly familiar with, it takes a whole different form in South Korea. Once students enter the tenth grade, the race to get selected into the top three South Korean universities begins. The commonly accepted way is through cracking an entrance exam, or ‘Suneung’. Students are required to undergo intensive preparations before they sit for the exams as there’s a popular belief that if you fail this exam, your entire life would be a failure. Rich and affluent people hire expensive tutors to help their children and give them an edge for cracking the exams. This was expertly parodied in Korea’s highest rated TV show of all times Sky Castle, a brilliant satire on the parents and children’s obsessive behaviour regarding higher education. No Korean TV character enters a household with their shoes on. They slip out of their regular shoes and wear special house slippers before entering the house. This is done to avoid bringing the dirt and disease-causing bacteria from the outside to the inside. Koreans are particular about cleanliness and this is just a result of that. Korean people might not care whether you’re a Libra, or a Gemini-Cancer cusp Mercury retrograde child. What they do want to know, however, is your blood type. Many Koreans associate different blood types with distinct personality traits that determine compatibility, likability, and even health status. It’s not news that Korean beauty has taken over the world—the famous ‘10-step skincare routine’ or the ‘glass skin’ trend are proof. But this also means that the beauty standards in Korean society are extremely high and rigid. Due to this, the country has the highest ratio of plastic surgeries in the world. It’s very common in both male and female Koreans, including people who are not even celebrities. Outer beauty is so important that it’s one of the deciding factors in job hiring processes. If you’ve seen Her Private Life or Touch Your Heart, you’ll know what we mean when we say that being a celebrity in South Korea is a curse and a blessing. The stars and icons have legions of fans following their every step and if the celebrity fails to live up to the standards set by their fans then they’re either discarded or torn down. They’re constantly under scrutiny by the press and the fans, and one misstep can cause their downfall. This is also the reason why many celebrities don’t disclose their relationship status to the public. The toxic celebrity culture also stems from the management agencies that effectively own these stars. 7 Korean comedy movies that are perfect for your next movie night Decoding the rise of foreign language shows All the new movies and film festivals you can now access from home via Hotstar, Disney+, Prime Video and more By Hasina Jeelani By Prabal Sharma By Kejhal Kalra By Kejhal Kalra By Namrata Kedar By Emma Spedding By Emma Spedding See more stories Condé Nast India © 2023 Condé Nast. All rights reserved. Use of this website constitutes acceptance of our Terms of Service and Policy and Cookie Statement. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. ",
    "title": "10 things you will always notice in Korean shows and movies | Vogue India",
    "datetime": "2020-05-09T09:30:00.000Z",
    "url": "https://www.vogue.in/culture-and-living/content/korean-movies-shows-k-dramas-cultural-themes-and-tropes"
}