{
    "text": "Oxford University Press'sAcademic Insights for the Thinking World  African religions cover a diverse landscape of ethnic groups, languages, cultures, and worldviews. Here, Jacob K. Olupona, author of African Religions: A Very Short Introduction shares an interesting list of 15 facts on African religions. 1. African traditional religion refers to the indigenous or autochthonous religions of the African people. It deals with their cosmology, ritual practices, symbols, arts, society, and so on. Because religion is a way of life, it relates to culture and society as they affect the worldview of the African people. 2. Traditional African religions are not stagnant but highly dynamic and constantly reacting to various shifting influences such as old age, modernity, and technological advances. 3. Traditional African religions are less of faith traditions and more of lived traditions. They are less concerned with doctrines and much more so with rituals, ceremonies, and lived practices. 4. When addressing religion in Africa, scholars often speak of a “triple heritage,” that is the triple legacy of indigenous religion, Islam, and Christianity that are often found side by side in many African societies. 5. While those who identify as practitioners of traditional African religions are often in the minority, many who identify as Muslims or Christians are involved in traditional religions to one degree or another. 6. Though many Africans have converted to Islam and Christianity, these religions still inform the social, economic, and political life in African societies. 7. Traditional African religions have gone global! The Trans-Atlantic slave trade led to the growth of African-inspired traditions in the Americas such as Candomblé in Brazil, Santería in Cuba, or Vodun in Haïti. Furthermore, many in places like the US and the UK have converted to various traditional African religions, and the importance of the diaspora for these religions is growing rapidly. African religions have also become a major attraction for those in the diaspora who travel to Africa on pilgrimages because of the global reach of these traditions. 8. There are quite a number of revival groups and movements whose main aim is to ensure that the tenants and practice of African indigenous religion that are threatened survive. These can be found all over the Americas and Europe. 9. The concerns for health, wealth, and procreation are very central to the core of African religions. That is why they have developed institutions for healing, for commerce, and for the general well-being of their own practitioners and adherents of other religions as well. 10. Indigenous African religions are not based on conversion like Islam and Christianity. They tend to propagate peaceful coexistence, and they promote good relations with members of other religious traditions that surround them. 11. Today as a minority tradition, it has suffered immensely from human rights abuses. This is based on misconceptions that these religions are antithetical to modernity. Indeed indigenous African religions have provided the blueprint for robust conversations and thinking about community relations, interfaith dialogue, civil society, and civil religion. 12. Women play a key role in the practice of these traditions, and the internal gender relations and dynamics are very profound. There are many female goddesses along with their male counterparts. There are female priestesses, diviners, and other figures, and many feminist scholars have drawn from these traditions to advocate for women’s rights and the place of the feminine in African societies. The traditional approach of indigenous African religions to gender is one of complementarity in which a confluence of male and female forces must operate in harmony. 13. Indigenous African religions contain a great deal of wisdom and insight on how human beings can best live within and interact with the environment. Given our current impending ecological crisis, indigenous African religions have a great deal to offer both African countries and the world at large. 14. African indigenous religions provide strong linkages between the life of humans and the world of the ancestors. Humans are thus able to maintain constant and symbiotic relations with their ancestors who are understood to be intimately concerned and involved in their descendants’ everyday affairs. 15. Unlike other world religions that have written scriptures, oral sources form the core of indigenous African religions. These oral sources are intricately interwoven into arts, political and social structure, and material culture. The oral nature of these traditions allows for a great deal of adaptability and variation within and between indigenous African religions. At the same time, forms of orature – such as the Ifa tradition amongst the Yoruba can form important sources for understanding the tenants and worldview of these religions that can serve as analogs to scriptures such as the Bible or the Qur’an. Jacob K. Olupona is Professor of African Religious Traditions at Harvard Divinity School, with a joint appointment as Professor of African and African American Studies in Harvard’s Faculty of Arts and Sciences. A noted scholar of indigenous African religions, his books include African Religions: A Very Short Introduction, City of 201 Gods: Ilé-Ifè in Time, Space, and the Imagination, Òrìsà Devotion as World Religion: The Globalization of Yorùbá Religious Culture, co-edited with Terry Rey, and Kingship, Religion, and Rituals in a Nigerian Community: A Phenomenological Study of Ondo Yoruba Festivals. In 2007, he was awarded the Nigerian National Order of Merit, one of Nigeria’s most prestigious honors. The Very Short Introductions (VSI) series combines a small format with authoritative analysis and big ideas for hundreds of topic areas. Written by our expert authors, these books can change the way you think about the things that interest you and are the perfect introduction to subjects you previously knew nothing about. Grow your knowledge with OUPblog and the VSI series every Friday, subscribe to Very Short Introductions articles on the OUPblog via email or RSS, and like Very Short Introductions on Facebook. Subscribe to the OUPblog via email or RSS.\nSubscribe to only religion articles on the OUPblog via email or RSS.\nImage Credit: A map of the Africa, showing the major religions distributed as of today. Map shows only the religion as a whole excluding denominations or sects of the religions, and is colored by how the religions are distributed not by main religion of country etc. By T.L. Miles via Wikimedia Commons via the Public Domain. Our Privacy Policy sets out how Oxford University Press handles your personal information, and your rights to object to your personal information being used for marketing to you or being processed as part of our business activities. We will only use your personal information to register you for OUPblog articles. Or subscribe to articles in the subject area by email or RSS […] I know we didn’t talk much about religion in the African Culture, but I found this interesting website that talks about 4 main religions that are spread throughout the continent of Africa. I found it very shocking because I honestly would have never known. There is also a picture on the website link that shows you where exactly the religions are spread throughout. https://blog.oup.com/2014/05/15-facts-on-african-religions/ […] […] https://blog.oup.com/2014/05/15-facts-on-african-religions/ […] Is african traditional religion a world region? nice No. Esther Showa it has been in existence for a very long time. it is as old as man. it was pass to us by our fore fathers African Religion is not only the way of life,but the ful beginnig and reflextion of true life for it existed before any other religions IS IT RELIGION OR RELIGIONS? There is no ONE African religion………its African religions. WHY IS AFRICAN TRADITIONAL RELIGION NOT CONSIDERED AS A WORLD RELIGION […] While those who identify as practitioners of traditional African religions are often in the minority, many who identify as Muslims or Christians are involved in traditional religions to one degree or […] Discuss the comments on graduation from childhood to adulthood in  ATR The Bible and the Quran, accept slavery as normal behavior, I would like to know if Traditional African religion touched on this How does the religious beliefs of an African enhance oral arts? Why we Afrikaans are suffering we go to churches to pray but still suffering\nPlease I need an answer I want to know more Regarding death and  life after death in a.t.r We as Africans we are lost we don’t know our identity we busy following Christian religion we even don’t know\nWe are the confused group in the world How can we as an Africa retrieve what was mean for us to identify us as a group of people who was burn to rule. How can we bring our people back home? Because the truth will still prevail, Interesting article! My interest is in the intersection of indigenous African religious traditions and Christianity – Islam – Judaism We Africans should focus even more on our own jux like other continents do, coz ATR is our indigenous and non else The 15 facts about African Traditional Religion are indeed true and as a matter of fact, that is why we do not have real conversion to Christianity. ATR’s belief system is embedded in the life of Africans and it is difficult to take that out of them. Because there isn’t real conversion to Christianity, people tend to forsake Christianity for ATR when they are faced with problems. ATR is a way of life of people and practical by nature. Christianity makes people live on promises which do not give immediate answers to their problems. Christianity has therefore, robbed Africa of its beautiful culture and religion. what are some of the unique features of African traditional religion […] African Religion Facts by Jacob K. Olupona […] Very clear introduction and so interesting to read more pls. What are those aspects of African indigenous religious worldview that have found expression with African indigenous churches Have been looking for the fact about Tradition religion for so long and am so glad that I found out some fact here about ATR, am so happy so read all these fact because our people are now focus on christainity and Islamic religion only and they leave ATR behind and the raw fact is that ATR is the true way of life and the best religion so far. Let take for instance if ATR are really involved in politics and some other social activities in the world we won’t be suffering for the COVID19 and so many things we are suffering about in the world. I will be so happy if people can understand the true fact about the ATR as we Africans main religion and stop focusing in others poeple religions Because we also have our own house of God like “Ijo Orumila Adulawo, Ijo Ifa kayejo etc” all over the world. So there fore am begging all Africans to come back Home. Faith is a gift: religion a work. The gift is God’s to give; it has been given so now humanity simply need to embrace it. Africa is the home of humanity and human’s search for God. God is not static but living and ceaselessly working to bring peace to human hearts. The legacy of African’s travel to the ends of the earth lingers in African DNA but God did new and eternal things to bring justice and righteousness amongst  humanity. God has shown humans how they ought to live but it takes courage, which we lack, to do justice, love mercy, and walk humbly before God. So we all want to do our own thing: chaos. Listen! Look outwards and upwards to the furthest horizons catch God’s vision and forget religion and focus on building relationships with the environment, and, more importantly, with those whom you love less. How are they similar to religions like Islam and Christianity???????? Comments are closed. Oxford University Press is a department of the University of Oxford. It furthers the University's objective of excellence in research, scholarship, and education by publishing worldwide. Copyright © Oxford University Press 2023 ",
    "title": "15 facts on African religions | OUPblog",
    "datetime": "2014-05-16T07:30:31+00:00",
    "url": "https://blog.oup.com/2014/05/15-facts-on-african-religions/"
}