{
    "text": "Following last year’s inaugural ranking of Billboard’s 20 Best K-Pop Songs of the year, the Billboard and Billboard Korea staff once again scoured the K-Pop Hot 100 and beyond to find the best… By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tBillboard Staff Following last year’s inaugural ranking of Billboard’s 20 Best K-Pop Songs of the year, the Billboard and Billboard Korea staff once again scoured the K-Pop Hot 100 and beyond to find the best songs to represent popular music hailing from South Korea. With bounds of fantastic singles released this year, the following is the 20 we feel break language barriers, push conventional music boundaries and highlight the fantastic range of music the K-pop scene produced in 2013. All Best of 2013 Content | The Year in K-Pop 2013Top-Selling K-Pop Songs in U.S. | Most Viewed K-Pop Videos in U.S.K-Pop Makes First Appearance on Year-End World Albums Artists Chart  The “Supa Dupa Fly” rapper brings her tongue-in-cheek flow to GD’s spits and growls, even mixing two of their respective signature hits in one lyric: “Get your freak on, baby / Get your cray on, baby.” The song is an infectious concoction of Eastern and Western sounds, sampling vocals from the Korean traditional folk song “Niliria” while mixing strong hip-hop elements and electronic thump, enhanced by double reed and siren sounds.  Six years into their careers, Kara is still proving to have a few tricks up its sleeves. The same zippy synths heard in past singles like “Wanna” and “Pandora” are now juxtaposed with noisy, electric guitar riffs. The edgy, rock-inspired production backing the girls’ coos and raps shows that a veteran girl group can still shock listeners.  Synth-pop group Glen Check’s dancefloor jam is an infectious mix of scraggly electro guitar, palpitating synths and head-bopping beats with a heavy ’80s ambience that’s helped the duo thrive above its contemporaries.  The six-member boy band exploded back to the scene after a long hiatus with “Shadow.” The lavish, piano-driven composition features highly-charged vocals, falsetto-driven chorus and sharp rapping, accompanied by goth-like music video to make it one of the more exciting summer singles.  While “Hush” is one banging pop track, the quartet teases listeners by purring over a swelling, electro-pop production complemented by bongos, piano and acoustic guitar until the beat hits at the second verse and explodes by the chorus. Instead of giving it all away the beginning, miss A showcase a perfected art of the aural tease.  The monster rookie who landed on this year’s 21 Under 21 showcased a different side of herself after a pair of throwback-inspired singles “1,2,3,4” and “It’s Over” with this melancholic dance track. The 17-year-old belts — and coolly raps — over a dramatic production, comparing her alluring love to a thorny rose.  One of the most promising rookies to make an official debut this year was, hands down, the multi-talented, quirky singer Zion.T. The electro-funk track “Babay,” featuring hip-hop veteran and labelmate Gaeko of Dynamic Duo, is a fun, bouncy track that indicates Zion.T as a major force to look out for in 2014.  Sweeping violins, surging electro beats, knocking drum ‘n’ bass: 2PM’s “A.D.T.O.Y.” is the type of progressive R&B track dudes like Usher would kill for.  After the girl group revamped its image with the electro-pop banger “Expectation” — which at times recalled the beat from Nicki Minaj’s “Pound the Alarm” — Girl’s Day came back even stronger with its follow-up single. Incorporating everything from tribal beats and trumpets to hand claps and rocky guitars, “Female President” is not only a composition triumph — with each chorus switching up its structure — but also vocal, with the girls belting their hearts out.   Until the tango-inflected, hip-hop track “Bad Girl,” Bumkey had struggled to land a huge hit. Teaming up with acclaimed rapper E-Sens, Bumkey’s buttery vocals mixes with E-Sens’ precise rapping atop a groovy melody that has listeners snapping fingers and bopping heads immediately.  Released on New Years Day, the girl group phenom set the standard high for K-pop in 2013 with this genre-bending, tempo-changing smash. With a load of seemingly disparate aural elements — clunky electro-pop, minimal drum ‘n’ bass, soaring diva vocals, fierce rapping, drastic tempo changes, xylophones — Girls’ Generation smoothes it all over with a sing-along chorus and ace, forward-thinking production.  The rap duo BAE CHI GI’s 15 years of relentless hustle and hard work finally paid off this year with the group’s hip-hop ballad hybrid “Shower Of Tears” featuring female vocal wunderkind Ailee. The folky, guitar-laden track is enhanced by French artist Oliver Monoury playing the bandoneon, Ailee’s gooey vocals meshing along with the duo’s lilting rapping.  Renowned for pristine vocal pipes, lush productions and soul-shattering lyrics, 4men rarely disappoints. The trio’s “Hello It’s Me” ballad soared into listeners’ hearts while lead vocalist Shin Yong Jae’s surging vocal approach reminded them of lost love.  The No. 1 overall song according to the K-Pop Hot 100 this year, Sistar19’s sophomore single showcased a very different side to the duo from debut single “Ma Boy.” Over a jazzy, saxophone accompaniment Hyorin and Bora coo their way through the melancholic track, each taking a verse to tell the story of longing for a lost lover and dealing with new realities.  After years of delving into dark subjects like depression and anger, the four-piece band brightened up with “Ocean of Light.” An uplifting rock track with thundering drum and electronica showcasing frontman Kim Jong Wan’s touching vocals demands the listener to “Just breathe in and breathe out your dreams with me.”   Four of five BIGBANG members had major K-pop releases this year, but the one to truly shine was Taeyang with the hard-hitting, club banger “Ringa Linga.” His smoky vocals poured over an elaborate production of pumping synths and chest-beating thumps (courtesy of Jose E. Luna and bandmate G-Dragon) — plus the intense accompanying choreography — make the solo single one of 2013’s most addicting.  After years of fans begging for new music, living K-pop legend Cho Yong Pil, at 63, delivered the unthinkable and captivated music fans of all ages with the pop-rock piece “Bounce.” The spritely, feel-good track was released before the launch of his epically-anticipated 19th LP, “Hello,” and ranked as one of 2013’s biggest hits.  If longtime f(x) fans were turned off by the quintet’s by-the-numbers “Electric Shock” last year, the girls returned at their most experimental yet. Somehow, “Rum Pum Pum Pum” blends funky guitar riffs, elements of samba, hard-hitting beats, alien-like harmonies and the Christmas classic “Little Drummer Boy” into one accessible pop treat.   The longtime collaborators teamed up once again for what might be 2013’s most touching — and at the same time soothing — tracks. Tiger and Bizzy’s deeply-reflective raps alongside Yoon Mi Rae’s inspiring chorus makes for a track that will cuts deep into one’s soul, but guides the listener back to the light.   “Growl” was the crown jewel in boy band EXO’s fantastic 2013. While past singles like “Mama” and “Wolf” were based around complex concepts and busy production, “Growl” used a sparse, Southern hip-hop beat that let the 12 boys’ talents shine through. A blend of rap, R&B melodicism and pop hooks, the breakout single had something for all listeners. Its accompanying video focused on a straight-forward, one-take video, again allowing for EXO’s talents — in this case, choreography — to shine, not detracting from over-the-top high fashion. Along with high interest from the United States — the boy band is the newest act to land among the top-selling K-pop tracks in America — “Growl” solidifies EXO as the act to watch in K-pop’s continuing international advancement.  [Written by Jeff Benjamin and Jessica Oak]  Released on New Years Day, the girl group phenom set the standard high for K-pop in 2013 with this genre-bending, tempo-changing smash. With a load of seemingly disparate aural elements — clunky electro-pop, minimal drum ‘n’ bass, soaring diva vocals, fierce rapping, drastic tempo changes, xylophones — Girls’ Generation smoothes it all over with a sing-along chorus and ace, forward-thinking production.  Six years into their careers, Kara is still proving to have a few tricks up its sleeves. The same zippy synths heard in past singles like “Wanna” and “Pandora” are now juxtaposed with noisy, electric guitar riffs. The edgy, rock-inspired production backing the girls’ coos and raps shows that a veteran girl group can still shock listeners.  Synth-pop group Glen Check’s dancefloor jam is an infectious mix of scraggly electro guitar, palpitating synths and head-bopping beats with a heavy ’80s ambience that’s helped the duo thrive above its contemporaries.  The six-member boy band exploded back to the scene after a long hiatus with “Shadow.” The lavish, piano-driven composition features highly-charged vocals, falsetto-driven chorus and sharp rapping, accompanied by goth-like music video to make it one of the more exciting summer singles.  While “Hush” is one banging pop track, the quartet teases listeners by purring over a swelling, electro-pop production complemented by bongos, piano and acoustic guitar until the beat hits at the second verse and explodes by the chorus. Instead of giving it all away the beginning, miss A showcase a perfected art of the aural tease.  The monster rookie who landed on this year’s 21 Under 21 showcased a different side of herself after a pair of throwback-inspired singles “1,2,3,4” and “It’s Over” with this melancholic dance track. The 17-year-old belts — and coolly raps — over a dramatic production, comparing her alluring love to a thorny rose.  One of the most promising rookies to make an official debut this year was, hands down, the multi-talented, quirky singer Zion.T. The electro-funk track “Babay,” featuring hip-hop veteran and labelmate Gaeko of Dynamic Duo, is a fun, bouncy track that indicates Zion.T as a major force to look out for in 2014.  Sweeping violins, surging electro beats, knocking drum ‘n’ bass: 2PM’s “A.D.T.O.Y.” is the type of progressive R&B track dudes like Usher would kill for.  After the girl group revamped its image with the electro-pop banger “Expectation” — which at times recalled the beat from Nicki Minaj’s “Pound the Alarm” — Girl’s Day came back even stronger with its follow-up single. Incorporating everything from tribal beats and trumpets to hand claps and rocky guitars, “Female President” is not only a composition triumph — with each chorus switching up its structure — but also vocal, with the girls belting their hearts out.   Until the tango-inflected, hip-hop track “Bad Girl,” Bumkey had struggled to land a huge hit. Teaming up with acclaimed rapper E-Sens, Bumkey’s buttery vocals mixes with E-Sens’ precise rapping atop a groovy melody that has listeners snapping fingers and bopping heads immediately.  The “Supa Dupa Fly” rapper brings her tongue-in-cheek flow to GD’s spits and growls, even mixing two of their respective signature hits in one lyric: “Get your freak on, baby / Get your cray on, baby.” The song is an infectious concoction of Eastern and Western sounds, sampling vocals from the Korean traditional folk song “Niliria” while mixing strong hip-hop elements and electronic thump, enhanced by double reed and siren sounds.  The rap duo BAE CHI GI’s 15 years of relentless hustle and hard work finally paid off this year with the group’s hip-hop ballad hybrid “Shower Of Tears” featuring female vocal wunderkind Ailee. The folky, guitar-laden track is enhanced by French artist Oliver Monoury playing the bandoneon, Ailee’s gooey vocals meshing along with the duo’s lilting rapping.  Renowned for pristine vocal pipes, lush productions and soul-shattering lyrics, 4men rarely disappoints. The trio’s “Hello It’s Me” ballad soared into listeners’ hearts while lead vocalist Shin Yong Jae’s surging vocal approach reminded them of lost love.  The No. 1 overall song according to the K-Pop Hot 100 this year, Sistar19’s sophomore single showcased a very different side to the duo from debut single “Ma Boy.” Over a jazzy, saxophone accompaniment Hyorin and Bora coo their way through the melancholic track, each taking a verse to tell the story of longing for a lost lover and dealing with new realities.  After years of delving into dark subjects like depression and anger, the four-piece band brightened up with “Ocean of Light.” An uplifting rock track with thundering drum and electronica showcasing frontman Kim Jong Wan’s touching vocals demands the listener to “Just breathe in and breathe out your dreams with me.”   Four of five BIGBANG members had major K-pop releases this year, but the one to truly shine was Taeyang with the hard-hitting, club banger “Ringa Linga.” His smoky vocals poured over an elaborate production of pumping synths and chest-beating thumps (courtesy of Jose E. Luna and bandmate G-Dragon) — plus the intense accompanying choreography — make the solo single one of 2013’s most addicting.  After years of fans begging for new music, living K-pop legend Cho Yong Pil, at 63, delivered the unthinkable and captivated music fans of all ages with the pop-rock piece “Bounce.” The spritely, feel-good track was released before the launch of his epically-anticipated 19th LP, “Hello,” and ranked as one of 2013’s biggest hits.  If longtime f(x) fans were turned off by the quintet’s by-the-numbers “Electric Shock” last year, the girls returned at their most experimental yet. Somehow, “Rum Pum Pum Pum” blends funky guitar riffs, elements of samba, hard-hitting beats, alien-like harmonies and the Christmas classic “Little Drummer Boy” into one accessible pop treat.   The longtime collaborators teamed up once again for what might be 2013’s most touching — and at the same time soothing — tracks. Tiger and Bizzy’s deeply-reflective raps alongside Yoon Mi Rae’s inspiring chorus makes for a track that will cuts deep into one’s soul, but guides the listener back to the light.   “Growl” was the crown jewel in boy band EXO’s fantastic 2013. While past singles like “Mama” and “Wolf” were based around complex concepts and busy production, “Growl” used a sparse, Southern hip-hop beat that let the 12 boys’ talents shine through. A blend of rap, R&B melodicism and pop hooks, the breakout single had something for all listeners. Its accompanying video focused on a straight-forward, one-take video, again allowing for EXO’s talents — in this case, choreography — to shine, not detracting from over-the-top high fashion. Along with high interest from the United States — the boy band is the newest act to land among the top-selling K-pop tracks in America — “Growl” solidifies EXO as the act to watch in K-pop’s continuing international advancement.  [Written by Jeff Benjamin and Jessica Oak] Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "title": "20 Best K-Pop Songs of 2013: K-Town Picks – Billboard",
    "datetime": "2013-12-24T02:56:33+00:00",
    "url": "https://www.billboard.com/lists/20-best-k-pop-songs-of-2013-k-town-picks/"
}