{
    "text": "Beyond the blinding videos, plastic sheen, and frank commerciality, South Korea's pop industry has also produced some of the most intelligent and accomplished mainstream music of the past few years. Practically an unknown quantity at the start of the decade, K-pop is now a household name around the globe. In recent years, the Western media has all but overflowed with a rising tide of South Korean pop, from fashion spreads to viral ads, Lorde pull-quotes to Grimes tweets, music video analyses to industry think pieces (and, of course, the most popular piece of content on the internet). And yet, so little of this attention has paid much mind to the music itself. If K-pop seems like the fad that never ends, that’s probably because it never really started, either. K-pop treats a song as just one of several interlocking aesthetic parts, which typically include corresponding choreography, a music video, novella-thick liner notes, the occasional corporate tie-in, and an overarching “concept” that brings it all together. These tend to be conceived in tandem to a much greater extent than in Western pop, so to divorce a K-pop single from its context is to engage with it only partially. For example, the absurdist satire of “Gangnam Style” wouldn’t make total sense even to someone living in Gangnam without its attendant video and “horse dance.” At its best, K-pop’s package-product approach can result in concise, nonpareil pop music gesamtkunstwerks—but good or bad, they can cause sensory overload for the uninitiated. The intense rate of productivity in Korea, where taking even a year’s pause between albums can kill a career, also adds to the overwhelming feeling for casual fans and popstars alike; onstage fainting and use of IV drips for energy are commonplace. Another factor is the highly micromanaged way in which all these complementary pieces are made and aligned. The Western media loves to fixate on K-pop’s “assembly line” methodology, and the industry’s de rigeur trainee development program indeed prizes performative excellence over any kind of creative aptitude. Considering the cost-intensive multimedia project that is the typical K-pop smash, it’s little surprise that agencies tailor these acts and their images to best court audiences that are most likely to reward their investment: obsessive teenyboppers. As such, both the presentation of the music and the “impersonal” way it’s made fundamentally disagree with most Western music fans’ Beatles-derived notions of authenticity. (The language barrier can be a roadblock as well.) But the Korean music industry—for all its bright color schemes, plastic sheen, and frankly commercial raison d'être—has quietly produced some of the most intelligent, adventurous, and accomplished mainstream pop of the past few years. It’s a world where songs with whiplash tempo cuts, Punjabi-via-Korean lyrics, and irregular beats exist as hyper-realized pop commodities, but connect with audiences on a mass scale. The following list offers a modest introduction to the hugely saleable genius some of the world’s best songwriters, producers, and performers can achieve when working in close cooperation. f(x): “미행 (그림자 : Shadow)” Simply put, f(x) is the most reliably risk-taking act in K-pop. Created in 2009 by SM Entertainment, the multinational, five-piece girl group’s two albums from the past year mark an unmatched winning streak in a mainstream market more inclined toward singles and mini-albums (K-Pop’s clever rebrand of the EP). “Shadow” is one of the stranger highlights from 2013’s neon Pink Tape. Built around a jazzy discord of flats and sevenths, the song’s synth harmony and xylophone melodies have more in common with a Thelonious Monk rag than anything on most modern pop charts (it peaked at #6 on Korea’s national chart, despite not being an official single). Exacerbating the tonal wooze is a pitch-shifted sample of what might as well be a gaggle of fairies getting fumigated. Above it all, the girls of f(x) detail a dark diary of stalking an object of desire. The fraught confessional is set to an R&B melody that’s lullaby-sweet, seeming to temper the tension in the arrangement—until the lyrics register. Ga-In: “팅커벨 (Tinkerbell)” As the youngest member of the quartet Brown Eyed Girls, Ga-In uses her solo career to test the limits of both Korea’s mainstream music and morals. “Tinkerbell”, a coy invite to a midnight tryst, is introduced by a damaged, half-deleted Latin guitar and proceeds to synthesize wobbly LFO chords, compression-blown riffs that could deafen Sleigh Bells, violent jump cuts to millisecond silence, yawps like a young Karen O’s, surf rock guitar leads, a lone bebop trumpet interjection, severe glitch undertones, and a four-bar break that snaps off-grid altogether. The song opens Ga-In’s excellent Talk About S mini-album, which tempers this IDM pop opioid with the delightful Madonna throwback “Bloom”. Orange Caramel: “까탈레나 (Catallena)” Orange Caramel’s very existence is an interesting insight into the K-pop industry. The female trio is a subsidiary of the larger girl group After School—in the same way that Kia is a subsidiary of Hyundai. So while Orange Caramel release their own records and stage their own performances, they are deliberately perceived as an After School-brand group, a common tactic in the K-pop market (other examples include T-ara’s T-ara N4, Sistar’s Sistar19, and Girls’ Generation’s Girls’ Generation-TaeTiSeo). These derivations are typically meant to exploit the specific talents or chemistry of a subset among a larger ensemble, and Orange Caramel’s uniting concept is “Candy Culture”—basically, Korean aegyo cutesiness meets a lot of saccharine pastels. Fortunately, this conceit has inspired some pretty fantastic pop. Orange Caramel’s best, “Catallena”, is a fluffy, filter-swept combo of ABBA-grade orchestration, ghazal folk samples, runny 1980s snare, Bollywood dyes, imitation Chic guitar, and a compression-lacquered coating of synth bass à la “Blue Monday”. The bright vocal frosting is piped preciously atop it all, flirting with an exoticized other and voicing bi-curious fancies—“She’s so great, I’ve fallen for her/ Even as a girl”—and they even sing some untranslated lyrics from the Pakistani wedding song that’s being interpolated. The holistic effect jars at first, making “Catallena” a common instance where the stickiness of a K-pop song’s video and choreography is crucial to its marketing plan. Unlike other mainstream industries, K-pop seems to romanticize the ideal of love at second listen. CL, G-Dragon, Skrillex, and Diplo: “Dirty Vibe” K-pop is home to a strange graveyard of gruesomely awful trans-Pacific collisions, including bewildered cameos from Kanye West, Chris Brown, and Lil Kim. But the four artists behind this track still dared to dream. The results, though buried on Skrillex’s Recess album from earlier this year, are historic: “Dirty Vibe” is visceral, exhilarating proof that K-pop and Western musicians can achieve unique things together. G-Dragon and CL respectively hail from Big Bang and 2NE1, two of Korea’s biggest groups (both fostered by YG Entertainment, the nation’s most dependable charisma depot). Over Skrillex and Diplo’s stark trap-hall beat, the two MCs have plenty of space to flex their best; consequent boasts touch on past hits, strip clubs, Diamonds and Pearls-era Prince, and “your girl’s lesbian crush.” Further charging the 160 BPM beat with fluid bilingual modulation, a plunder of profanity, and a deeply gratifying demon’s harmony on GD’s voice, he and CL each turn in highlight reel performances. Skrillex and Diplo sound inspired as well, particularly in the thrilling anti-drop at the 48-second mark. Almost purely rhythmic, “Dirty Vibe” is as truly future-sounding as any of these four have been. f(x): “첫사랑니 (Rum Pum Pum Pum)” As the lead single for a blockbuster K-pop album, “Rum Pum Pum Pum” came shrinkwrapped in a blindingly bright music video. And its performances on Korea’s half dozen “Top of the Pops”-style battle shows—an exhaustive gauntlet all acts must pass to credibly promote a single—were all tightly choreographed, schoolgirl uniformed cheers. While these common tropes and marketing tactics often signify trivial music in Western pop, a peek beneath the surface of this track reveals a remarkable feat of songwriting. While retaining the familiar structure of a pop banger, “Rum Pum” makes unlikely esperanto of Middle Eastern funk guitar, clangorous samba polyrhythms, the Yuletide classic “The Little Drummer Boy”, exactly one bar of flamenco tap dance, and the ad-libbing knock of mid-aughts Timbaland. Then there’s the jazz technique of brushing circles around the beat during the bridge, about the most counterintuitive move one can make in a commercial medium where an explicitly stated beat is fundamental. The lyrics are equally intrepid, exploiting a bit of wordplay in Korean to make a love song all about wisdom teeth: “What to do? You probably expected one/ Who grew up straight/ But I’ll be crooked and torture you/ I’m not easy!” Virtually every moment of the song features a compositional quirk worthy of scrutiny. © 2018 Condé Nast. All rights reserved. Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21). Your California Privacy Rights. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with prior written permission of Condé Nast. Ad Choices. CN Entertainment. ",
    "title": "20 Essential K-Pop Songs | Pitchfork",
    "url": "https://pitchfork.com/features/starter/9475-20-essential-k-pop-songs/"
}