{
    "text": "Searching for your content... In-Language News Contact Us 888-776-0942\n\nfrom 8 AM - 10 PM ET News provided by 20 Nov, 2017, 09:23 ET Share this article SEOUL, South Korea, Nov. 20, 2017 /PRNewswire/ -- 2017 Asia Artist Awards (AAA), the world-first award ceremony integrating K-Pop and K-Drama, has successfully completed its ceremony. The awards were granted to 40 K-culture representative stars and singers including EXO, Seventeen, Im Yoon-ah, Lee Joon-gi, and 57 trophies were awarded to artists from Japan and China, proving to be the definitive Asian award ceremony. Experience the interactive Multimedia News Release here: https://www.multivu.com/players/English/8224751-asia-artist-awards-2017/ Jiwon Ha, the director of Asia Artist Awards Organizing Committee said that the event that took place in Jamsil Gymnasium in Seoul on November 15th was live streamed for 4 hours and 30 minutes in Korea, Japan, and China while announcing the Popularity Award by voting. The AAA is an event celebrating the ceremony with artists who have brought glory to Asian culture over the previous year along with actors, actresses, and singers. The ceremony was sponsored by Paradise City, Samsung Pay and hosted by Media Star News and The Star Asia, a global entertainment media. The Popularity Vote was carried out through Samsung Pay and The Star Asia application, with 11 million votes (from 13 countries) to announce Popularity Award while letting fans of each country experience the vibrant ceremony. EXO, K-Pop boy band, has won the Grand Prize for Singer award section.  Seventeen, Super Junior and Wanna One have received trophies. Do Kyung-soo and Kim Hee-sun has won the Grand Prize for actor and actress section. Lee Joon-gi has won the Fabulous Prize, which enshrined him as Korea's representative Hallyu star. The organizing committee of AAA concluded that the event has become a global award ceremony beyond the borders of Korea. Also, adding that it will be better poised to represent Asia with the honor of having an official hotel partner with Paradise City Hotel & Resort. For more information visit: AAA official website http://www.asiaartistawards.com/ Star News http://star.mt.co.kr/foreign/starListEng.html Samsung Pay https://www.samsung.com/us/ Paradise City  http://www.p-city.co.kr/?language=EN The Star Asia http://www.thestar.kr/ SOURCE AAA Committee Sign up to get PRN’s top stories and curated news delivered to your inbox weekly!  ",
    "title": "2017 Asia Artist Awards Creates a Wave of Success for Asian Cultural Representatives at Awards Ceremony",
    "url": "https://www.prnewswire.com/news-releases/2017-asia-artist-awards-creates-a-wave-of-success-for-asian-cultural-representatives-at-awards-ceremony-300559379.html"
}