{
    "text": "- Closed off spectacular performances held for two days from November 13 to 14, in participation of various top local and international artists - Participation from 2.63 million Hallyu fans around the globe (as of November 18) ‘2021 World K-POP Concert (K-Culture Festival),’ held from Nov 13 to 14 ended successfully with huge support from Hallyu fans around the world. This year’s event was executed with close attention to infection prevention measures. The total number of global Hallyu fans that have participated in the concert both online and offline added up to approximately 2.63 million. Local artists including NCT DREAM, SHINee KEY, aespa, ITZY, PENTAGON, Simon Dominic, Loco, and BraveGirls as well as American pop star Kehlani performed at the event. This concert’s recordings will be aired through various channels such as Mnet, TVING and tvN Asia this coming Nov 28, Dec 5, and 6. Also, ‘The History of K-POP, and Future Insight’ virtual conference will be hosted on Nov 30 as a supplementary program of the World K-POP Concert. (Photo: Business Wire) ‘2021 World K-POP Concert (K-Culture Festival),’ held from Nov 13 to 14 ended successfully with huge support from Hallyu fans around the world. This year’s event was executed with close attention to infection prevention measures. The total number of global Hallyu fans that have participated in the concert both online and offline added up to approximately 2.63 million. Local artists including NCT DREAM, SHINee KEY, aespa, ITZY, PENTAGON, Simon Dominic, Loco, and BraveGirls as well as American pop star Kehlani performed at the event. This concert’s recordings will be aired through various channels such as Mnet, TVING and tvN Asia this coming Nov 28, Dec 5, and 6. Also, ‘The History of K-POP, and Future Insight’ virtual conference will be hosted on Nov 30 as a supplementary program of the World K-POP Concert. (Photo: Business Wire)  SEOUL, South Korea--(BUSINESS WIRE)--‘2021 World K-POP Concert (K-Culture Festival),’ held from November 13 (Saturday) to 14 (Sunday) at Korea International Exhibition Center (KINTEX) in Goyang-si, ended successfully with huge support from Hallyu fans around the world.  Jointly hosted by the Ministry of Culture, Sports and Tourism of the Republic of Korea (MCST, Minister Hwang Hee) and the Korean Foundation for International Cultural Exchange (KOFICE, President Jung Kil-hwa), this concert garnered much attention from fans as it was the first large-scale offline event prepared by the government since the implementation of the ‘living with COVID-19’ scheme to start a gradual return to normal life. This year’s event was executed with close attention to infection prevention measures by implementing the ‘vaccine pass’ and ‘people counting’ systems. First of all, fully vaccinated people who have passed the two-week mark after completing their second dose or those who presented proof of PCR test results via confirmation letter or text within 48 hours were allowed to enter the venue. In the case of the World K-POP Concert (B.I.T 4 U Concert) held on November 14, stronger disease prevention procedures were implemented where all the seats were assigned in compliance with the social distancing measures, and visitors were provided with vinyl gloves upon entrance to wear them at all times. Also, cheering and crowd singalongs during performances and changing seats were strictly prohibited – prioritizing safety. Held under strict safety measures, the total number of global Hallyu fans that have participated in the concert both online and offline added up to approximately 2.63 million, making the festival extra meaningful. In particular, around 3,000 onsite visitors experienced the sizzling hot performances of the Hallyu artists, and 150,000 fans around the world simultaneously enjoyed the festival streamed live via KOFICE’s official YouTube channel. Local artists including NCT DREAM, SHINee KEY, aespa, ITZY, PENTAGON, Simon Dominic, Loco, and BraveGirls as well as American pop star Kehlani performed at the event, and MCST’s minister Hwang Hee virtually joined the concert and delivered greeting remarks from France with a French Hallyu fan. SHINee KEY, who made the grand finale, said, “While we aren’t used to seeing a concert hall with no screaming sounds, leveraging this momentum, I hope more artists could have the opportunity to perform on stage in the living with COVID-19 era.” MCST and KOFICE extended their special invitation to medical staff and public personnel who worked hard to overcome COVID-19, as well as the culturally disadvantaged, multicultural families and foreigners living in Korea to share hopeful messages to overcome the pandemic situation through the performance. This concert’s recordings will be aired through various channels such as Mnet, TVING and tvN Asia this coming November 28, December 5, and 6 – inspiring the global audience once again. Meanwhile, KOFICE will be hosting ‘The History of K-POP, and Future Insight’ virtual conference on November 30 as a supplementary program of the World K-POP Concert. To be held under the theme of K-pop and popular music cultural policy, the conference will be streamed live in real-time via the K-Cultural Festival’s official YouTube channel.  For Korean Foundation for International Cultural Exchange (KOFICE)\nEdelman Korea\nOlivia Joh\n+82-2-2022-8260\nSeoulKOFICE@edelman.com Youngwoo Kim\n+82-2-2022-8237\nSeoulKOFICE@edelman.com 2021 World K-POP Concert (K-Culture Festival) ends in success, presenting a new model for performances in the ‘Living with COVID-19’ era. For Korean Foundation for International Cultural Exchange (KOFICE)\nEdelman Korea\nOlivia Joh\n+82-2-2022-8260\nSeoulKOFICE@edelman.com Youngwoo Kim\n+82-2-2022-8237\nSeoulKOFICE@edelman.com ",
    "title": "2021 World K-POP Concert (K-Culture Festival) Ends in Success, Presenting a New Model for Performances in the ‘Living with COVID-19’ Era | Business Wire",
    "url": "https://www.businesswire.com/news/home/20211124005350/en/2021-World-K-POP-Concert-K-Culture-Festival-Ends-in-Success-Presenting-a-New-Model-for-Performances-in-the-%E2%80%98Living-with-COVID-19%E2%80%99-Era"
}