{
    "text": "Copyright © 2023 Entrepreneur Media, LLC All rights reserved. Entrepreneur® and its related marks are registered trademarks of Entrepreneur Media LLC By          \n            Chrissie Gorman\n          \n                                      •\n          \n          \n            Jan 12, 2017 Share Opinions expressed by Entrepreneur contributors are their own. As a Duke University grad, I have long admired Coach K (head basketball coach Mike Krzyzewski) for his success on the court and the inevitable school pride that comes with cheering for the Blue Devils. However, the last two years of developing the leadership-development program, PowerForward, with Coach K has taken my admiration one step further: Over and over I've seen Krzyzewski demonstrate an incredible ability to understand team dynamics far beyond the basketball court. And in this way, he's essentially presented critical lessons for building a startup. Related: What Coach K Can Tell You About the Morning Habits of NBA Stars How does he get those lessons across? Well, there are his words, for a start. In our regular meetings, I find myself feverishly jotting down notes as he talks about his teams -- both Duke and USA Basketball -- and how he's approached different situations as a coach. The beauty of his approach is that it's simple and applicable to a broad range of \"teams\" (business as well as sports) at various stages of the entrepreneurial journey. Here are three of the major lessons I've learned. One of the words Coach K uses commonly with his teams is \"ownership.\" Recently, he shared an example of how he created this atmosphere with the USA Basketball team. In bringing the team together over a relatively short period of time (several weeks), Coach and his staff filmed the players talking about various topics such as what it means to play for their country. Then, before the August 2016 game against Argentina (which we won 105-78), Coach K dismissed the notion of giving a speech himself and instead played a video montage of the players themselves talking about winning the gold medal and their commitment to the team. In doing this with your team, you enable its members to own the problem, solution, cause -- whatever you need them to be singularly focused on. And, if your team members are not performing to the standards you want, you can refer to what they previously said they would do, not what you told them to do. It's a powerful way to get buy-in and build team trust and connection, to move toward a collective goal. Related: The Power of Writing Down Your Goals At the core of culture there often lies a strong emotional connection to the cause. However, you can't assume that that connection exists. Instead, you need to build it and continue to renew it. Coach K likens this to \"renewing your vows.\" In the Olympics, the USA Basketball team faced a one-and-done elimination format, something these NBA players weren't used to. So. instead of assuming that they understood how to play in that setting, Coach K likened the challenge to something they were more familiar with: Game 7 in a series. The players understood the emotion that surrounds a Game 7 and were able to translate that understanding into a must-win, gold medal culture. Related:  10 Examples of Companies With Fantastic Cultures Teams sometimes set principles or standards with catchy phrases or stylized wall posts. While those are good reminders, they are not enough for your team to build that emotional connection to the culture that's needed. Instead, think about the various perspectives your team members bring to the table -- how does your engineering team relate differently to your mission than your marketing team? And what common ground can you find to create that emotional connection? The best way to accomplish this is through regular team discussions to renew the culture. Culture is not a static thing -- it needs to be nurtured to grow with your business. After unexpectedly losing in the first round of the 2014 NCAA Men's Basketball Tournament, Coach K could do one of two things: focus on shoring up gaps on the team or review his entire program. Ultimately, he chose to review his entire program -- from trainers to assistants to the players themselves. He realized that the cause for the loss was a lack of alignment across his organization. He saw that he had incredible support across that organization, but it was all disconnected -- his various staff members had become too siloed. As a result, there was not a uniform set of standards across the organization, which led to breakdowns in the process. By bringing his staff and coaches together, Coach K helped them set clear organizational standards, which each person then felt responsible for upholding. When the team ultimately competed for the national championship the following season, the entire organization was able to share in the process and eventual victory. Related: The First 5 Steps That Begin Your Entrepreneurial Journey Looking at your entire organization might seem like an extreme reaction on the surface, but it's important to examine the big picture rather than focus on the minute details of the failure. When you face a defeat or setback, make sure to contextualize it and think about all the factors that went into that situation, not just rehash the situation itself. That's what Coach K would do; you should, too. CEO of PowerForward These tried-and-true tips will save you time, scale your business, and make you money. Employers across industries bemoan the difficulty of finding qualified talent. Yet, at the same time, legions of capable workers, especially caregivers, find themselves shut out of employment altogether due to inflexible employer attitudes. The solution? Forward-looking companies need to reimagine traditional career paths to gain access to a deep well of hidden talent. Google now offers a \"remove this result\" feature. In today's landscape, speed is the name of the game. Distance Athletics in Paris hired French Olympian Méba Mickael Zeze to keep an eye on the door. Photos and video from the scene show the massive crash. Successfully copied link We'll be in your inbox every morning Monday-Saturday with all the day’s top business news, inspiring stories, best advice and exclusive reporting from Entrepreneur. Copyright © 2023 Entrepreneur Media, LLC All rights reserved. Entrepreneur® and its related marks are registered trademarks of Entrepreneur Media LLC  ",
    "title": "3 Lessons Coach K Can Teach You About Building Your Team | Entrepreneur",
    "datetime": "2017-01-12T20:30:00+00:00",
    "url": "https://www.entrepreneur.com/leadership/3-lessons-coach-k-can-teach-you-about-building-your-team/287667"
}