{
    "text": " More and more Korean enterprises are making great social contributions, as their positive effects stand out. According to a recent Federation of Korean Industries survey answered by 231 large corporations, their spending on social contribution activities, which had reached 2.7727 trillion won (US$2.3403 billion) in 2013, showed a very slight decrease to 2.6708 trillion won in the following year in spite of the severe economic recession. Those corporations recorded an average of 11.6 billion won along with a median value of 2.4 billion won. The ratio of their spending for the purpose to their pre-tax profits, in the meantime, increased by 0.2 percentage points during the same period as their pre-tax profits showed a decline of 4.2 percent year-on-year. The 231 corporations’ average ratio was 3.5 percent, and 32 out of the 231, or approximately 14 percent of the total, maintained a ratio at 10 percent or higher, while 18 out of them ranged from 5 percent to less than 10 percent. In addition, about 11 percent of the 231 corporations, 26 to be specific, continued with their social contribution activities in spite of their losses. The ratio went up from 3.2 percent to 3.4 percent between 2010 and 2012, and then to 3.5 percent last year, while the ratio of this type of spending to sales averaged at 0.17 percent. Korean companies recorded more social contribution expenditures than their Japanese counterparts, too. The latter spent only 2 percent of their pre-tax profits and 0.13 percent of their sales on corporate social responsibility (CSR) activities. When it comes to the types of such activities in Korea, the ratio of more general and widespread ones such as assistance for the vulnerable and the less privileged in terms of education, schooling and academic studies decreased, whereas those in the new fields including culture, arts and sports received larger investments than before. At the same time, it has been found that executive and staff members are spending more and more time on CSR activities year after year. The FKI recently conducted a survey of 129 companies and found that their average was seven hours per person in 2006, but increased to 10 hours in 2010 and to 17 hours last year. About 46 percent of the hours were found to have been spent on assistance for the vulnerable. The Korea Chamber of Commerce & Industry also mentioned that smaller Korean corporations spent an average of 349 million won on CSR programs in 2014. According to its data, 60.3 percent of the expenditures were made in the form of cash donations, followed by donations in kind (32.2 percent), employees volunteer activities (3.5 percent), direct social contribution programs (3.2 percent) and property donations (0.8 percent). The main beneficiaries of their activities were children and adolescents (53.6 percent). They were followed by the aged (25.2 percent), the disabled (13.9 percent) and multicultural families (6 percent). These days, CSR programs in Korea are evolving, so that such activities can lead to business opportunities or better reflect each company’s individuality, while general social contribution activities like donations are dwindling. “Today’s CSR is about individuality,” said the FKI, adding, “In other words, it is for each to make the most of its individual properties of business and create shared values.” This means an increasing number of Korean companies are trying to contribute to society in the ways they can do best and in the fields highly related to their core values. These new types of CSR activities include pro bono programs for sharing expertise and knowledge and the utilization of corporate resources such as equipment and facilities. Textbook examples of pro bono programs are the Junior Construction Academy of the Construction Division of Samsung C&T, which allows low-income elementary school students to have vocational experiences; H-Safety Driving School of Hankook Tire for female drivers; and Dreams Come True of CJ Foodville for future bakers. In the meantime, Deloitte Consulting recently said that pro bono programs contribute to both executive and staff members’ job performances. In its recent survey, 88 percent and 90 percent of the respondents answered that their management performances and leadership were improved after CSR activities, respectively. Furthermore, 97 percent said that such activities were effective for their confidence and the percentage was as high as 95 percent with regard to communication skills and 92 percent concerning each of problem-solving capabilities and interpersonal relationships. It is in this context that global industry leaders such as American Express and GlaxoSmithKline are proceeding with human resources development programs associated with different social contribution programs and non-profit organizations. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "44% of Korean Enterprises Increased Spending on Social Contributions - Businesskorea",
    "datetime": "2016-01-04T02:30:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=13462"
}