{
    "text": "The Steppenwolf ensemble member talks Tony awards, social media, and his gold lamé outfit. Tony nominations are a long three months away, but already talk is swirling around one show in Chicago: Airline Highway, the dark comedy from Obie award-winning writer Lisa D'Amour currently running at Steppenwolf Theatre. While the buzz has mostly focused on D'Amour and the show's director, two-time Tony winner Joe Mantello (Assassins, Take Me Out), you should also get to know the name K. Todd Freeman. A Houston native, Freeman, 50, stars as Sissy Nana, the unofficial den mother to the hustlers, hookers, and marginal misfits of New Orleans’s seedy Hummingbird Hotel. Chicago caught up with the Steppenwolf ensemble member for a conversation about the perks of working at the storied theater, the dubious influence of reality TV on actors, and what it takes to swan about in gold lamé leggings and fringed half-tops for half a dozen shows a week. Airline Highway takes place in the parking lot of the kind of hotel that scares tourists. Did you stay in any similar places to prepare for the role? No. But I was inspired by Big Freedia. She’s this amazing New Orleans drag performer. Sissy is loosely based on her. A lot of the physicality I use in the role comes from her. I watched a lot of YouTube to help get that down. Speaking of which, back in the late 1980s and the early part of your career, nobody got famous on YouTube or reality TV or Twitter. Has the advent of social media changed the fundamentals of succeeding as an actor? Some of the things that influence actors just starting out today are horrible. They know the Real Housewives. They’re not sure who Meryl Streep is. When you were on Broadway with The Song of Jacob Zulu in 1993, you ended up with a Tony nomination. It’s not inconceivable that you could get another one for Airline Highway. Do you think about that at all? I seriously try not to. Awards—there are so many factors you can’t control. I think: Just do your job and always try to be better. Sissy Nana sashays around in a belly-baring top and a pair of skin-tight gold leggings, neither of which is a look most 50-year-olds can pull off. When you first saw the costume renderings, were you dismayed? Nope. The half top was my idea. I think I have lost a little weight since the show began—the role is so physical. People tell me my arms especially look great. What’s the right pronoun for Sissy? Tranny. She calls herself a tranny. Airline Highway runs through February 14 at Steppenwolf Theatre, 1650 N. Halsted. For more information, go to steppenwolf.org. Tags: Arts & Culture, Theater Chicago magazine newsletters have you covered. Find out where to go, what to eat, where to live, and more. Subscribe for free today! Chicago magazine newsletters have you covered. Find out where to go, what to eat, where to live, and more. Subscribe for free today! ",
    "title": "5 Questions for Airline Highway Star K. Todd Freeman – Chicago Magazine",
    "url": "https://www.chicagomag.com/arts-culture/january-2015/5-questions-for-steppenwolf-ensemble-member-k-todd-freeman/"
}