{
    "text": "K-pop's takeover in America is only growing bigger with Monsta X. Jeff Benjamin is a K-pop columnist and contributor at Billboard. K-pop's popularity in America is only growing with Monsta X paving their own way with a powerful sound and bold look all their own. Since their 2015 debut, the seven-member boy band has been watched by a worldwide fan base that's seen Shownu, Joohoney, Wonho, Kihyun, Hyungwon, Minhyuk and I.M mature and grow their global reach. Now, in 2019, the guys are back for their biggest U.S. tour, which will see them play their first concert in a U.S. stadium and make their first national TV appearance on \"Good Morning America.\"  Ahead of the guys' \"GMA\" debut, get to know Monsta X with a primer including all the must-know facts.  The seven members you see in Monsta X today were created from an intense singing-competition show in South Korea. Titled \"No.Mercy,\" the program saw 13 young K-pop hopefuls compete through challenges, and for viewers' and judges' votes, before the final group you see today was created. Even before their debut album was released, fans had been on a journey with the septet, which made them all the more attached when the group finally hit the scene. When the band's name Monsta X was revealed at the end of \"No.Mercy,\" it was said that Monsta X would signify a new \"monster\" group to dominate the K-pop scene, which fits well with the band's hard-hitting and aggressive songs like \"Hero,\" \"All In\" and their debut single \"Trespass.\" But analyzing the name further, Monsta X also means \"my star\" -- with the word \"mon\" translating to \"my\" in French, plus \"sta\" for star. The letter \"X\" represents the unknown and a future of possibility for the group. The multilingual theme also has a part in Monsta X's official fan base name, Monbebe. For those who can read French, they know \"mon\" and \"bebe\" can combine to mean \"my baby\" in French. So, when Monsta X call out for \"Monbebe,\" they're calling out for their baby. Trés adorable.  Monsta X was the very first K-pop group to perform on the long-running Jingle Ball concert series, and the boys took it not only as an opportunity to meet more fans around America, but meet the artists they admired too. Throughout the winter tour, the band took selfies with the likes of 5 Seconds of Summer, Camila Cabello, Khalid and Shawn Mendes, much to the delight of worldwide pop fans when the photos posted on social media. Monsta X has also expanded their reach musically, just this year collaborating with Steve Aoki on the disco-dance cut \"Play It Cool,\" released in both Korean and English, and bringing on French Montana for their latest single \"Who Do U Love?\" While K-pop is known for its colorful and youthful fashion, Monsta X visually represents a bit of a darker, sexier take on the music scene. The group rocked fetish-lite, leather outfits in their \"Alligator\" music video while \"Shoot Out\" saw the guys rocking different chains and masks. Members like Wonho and Shownu have even been known to rip their shirts off at the end of a performance. It's not the usual boy-band attire and attitude, and the group recently opened up to British GQ about their stage looks: \"We're not ashamed. ... We've done a lot of sexual items, like harnesses and chains, we're comfortable.\" Monsta X helps show diversity in the K-pop scene and prove that stars can shine in all kinds of looks. And if you see them on tour, look out for at least one shirtless moment. After hitting the K-pop scene in May 2015, Monsta X came to meet American fans just three months later with a performance at the 2015 KCON Los Angeles festival. The U.S. has continued to be a priority for the band, who visit at least once a year and have held stateside every year since 2017. They now have a U.S. label in Epic Records -- home to stars like DJ Khaled, Meghan Trainor and Travis Scott -- and are currently moving through America on their \"We Are Here\" world tour. The trek concludes at Los Angeles' massive Staples Center arena in August. 24/7 coverage of breaking news and live events ",
    "title": "5 things to know about K-Pop boy band Monsta X - ABC News",
    "url": "https://abcnews.go.com/GMA/Culture/things-pop-boy-band-monsta/story?id=64651680"
}