{
    "text": "All Headlines North Korea Sports Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies URL is copied. SEOUL, Jan. 24 (Yonhap) -- Eight in 10 foreigners living in and out of South Korea positively view the country, a government survey showed Monday. The Korean Culture and Information Service (KOCIS) canvassed 12,500 non-Koreans aged 16 and more in 24 countries around the world in September and found 80.5 percent of the respondents have positive images of South Korea. The share was up 2.4 percentage points from the same survey conducted a year ago. By country, 90 percent of those surveyed in seven countries -- Vietnam (95 percent), Turkey (92.2 percent), the Philippines (92 percent) and Thailand (90.8 percent) gave positive answers. In Japan, 35 percent of respondents cited a positive image, a big jump from 27.6 percent in 2020, exceeding the rate of Japanese with negative images (26.6 percent) for the first time since the annual survey began in 2018. Nearly 23 percent of the foreigners who have positive images cited South Korea's contemporary culture, such as K-pop and films as the main factors, while others chose Korean brands and products (13.2 percent), economic status (10.2 percent), cultural heritage (9.5 percent), the national character of Korea (8.6 percent), social system (7.8 percent) and sports (7.6 percent) etc. Fans of South Korean superband BTS enter SoFi Stadium in Los Angeles on Nov. 27, 2021, for the septet's first in-person concert since 2019. (Yonhap)  Compared with the previous survey conducted in 2020, there were increases by 5.9 percentage points, 5.8 percentage points and 4.6 percentage points, respectively, in the rates of answers -- \"social system\" and \"the national character\" and \"sports\" last year. Among the eight questions asking foreigners about their interest in Korea, the most answered items were \"hope to experience Korean traditional culture\" with 83.4 percent. It was followed by \"hope to visit Korea\" with 81.1 percent and \"hope to be friends with Koreans\" with 76.6 percent. In particular, 54.5 percent chose \"hope to learn Korean language,\" up 8.7 percentage points from 2020 while answers such as \"experiencing hallyu content\" and \"hope to visit Korea\" gained 6.7 percentage points and 6.5 percentage points from a year ago. Hallyu refers to the global popularity of Korean pop culture such as Korean dramas, pop music and films. By age, young people in their 10s, 20s and 30s showed higher interest in Korea than older people, the survey showed. Fans of South Korean supergroup BTS wait to enter SoFi Stadium in Los Angeles on Nov. 27, 2021, for BTS' in-person concert, titled \"BTS Permission To Dance On Stage - LA.\" (Yonhap)  sshim@yna.co.kr(END) All News National North Korea Economy/Finance Biz Culture/K-pop Sports Images Videos Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies Korea in Brief Useful Links Festival Calendar Weather Advertise with Yonhap News Agency ",
    "title": "80 pct of foreigners have positive views of S. Korea: survey | Yonhap News Agency",
    "datetime": "2022-01-24T17:02:41+09:00",
    "url": "https://en.yna.co.kr/view/AEN20220124008600315"
}