{
    "text": "  Pop culture critic Kim Heon-sik sits down for an interview with the Korea JoongAng Daily at his office in Yeongdeungpo District, western Seoul, on June 7. [PARK SANG-MOON] BTS arrives at the 64th Annual Grammy Awards at the MGM Grand Garden Arena on April 3 in Las Vegas. [AP/YONHAP] Fans of BTS, dubbed ARMY, cheer during a BTS concert held in April in Las Vegas. [YONHAP] In 2020, girl group Blackpink edited out a scene from the music video for its song \"Lovesick Girls\" (2020) after backlash that member Jennie's nurse costume, seen above, sexualized the profession. [SCREEN CAPTURE] Fans wait outside the SoFi Stadium in Los Angeles to take part in the BTS concert on Nov. 29, 2021. [YONHAP] RM, leader of BTS, speaks in the James S. Brady Briefing Room at the White House in Washington on May 31. BTS was invited to the White House to discuss anti-Asian hate crimes and Asian inclusion with U.S. President Joe Biden. [EPA/YONHAP] Pop culture critic Kim Heon-sik [PARK SANG-MOON] Solo artist Baek A-yeon to release first digital single in over two years Le Sserafim's Kim Chae-won returns to group activities after flu recovery Former (G) I-DLE member Soojin makes solo debut with dance performance Singer Chungha named Wemade and Wemix's promotional model Fans already suspected G-Dragon's illegal drug use [CRITICALLY SPEAKING: K-POP] K-pop is not just a genre, it's an entire industry K-pop documentary series 'K-pop Generation' set for release on Tving tonight Some K-pop fans #SayNoToStreaming, but others aren't happy [Column] Add wings to K-culture BTS's 'Butter' debuts at No. 3 on U.K. Official Singles Chart To write comments, please log in to one of the accounts. Standards Board Policy  (0/250자) Korea JoongAng Daily Sitemap All materials contained on this site are protected by Korean copyright law and may not be reproduced, distributed, transmitted,                    displayed, published or broadcast without the prior consent of Joins.com | Tel: 1577-0510 JoongAng Daily Co., Ltd. | Address: 48-6 Sangamsan-ro, Mapo-gu, Seoul, Republic of Korea Business registration number: 160-86-00572 | CEO: Park Chang-hee, Cheong Chul-gun Mail order business report number: 2020-Seoul Mapo-3838 ",
    "title": "[CRITICALLY SPEAKING: K-POP] Critic Kim Heon-sik shares hot take on K-pop's consumer centricity",
    "datetime": "2022-06-28T15:12:43+0900",
    "url": "https://koreajoongangdaily.joins.com/2022/06/28/entertainment/kpop/kpop-korea-kim-heonsik/20220628151252490.html"
}