{
    "text": "Most Popular [From the Scene] Don't remember Itaewon alley as place of death, victims' families say G-Dragon booked for drug use South Korea, Qatar agree to elevate ties, forge $4.6b industry partnership Former Olympic hero battles rumors surrounding her groom-to-be S. Korea goes all out to contain lumpy skin disease Man fined for assaulting soldiers who refused to praise Kim Jong-un, Putin Yoon pitches S. Korea's investment appeal to Middle East 4-meter deep sinkhole injures 1 in central Seoul Yoon meets Park, honors father in gesture of conservative unity [News Focus] A year after Halloween crowd crush, legislation remains stalled Start your day with a roundup of key stories from The Korea Herald with news and comment on all that’s happening in Korea. Published : Sept. 14, 2022 - 14:42 Link copied The first music video to reach 1 billion views on YouTube, the most-streamed group on global music platform Spotify and the bestselling foreign touring act in Japan -- these are feats achieved by K-pop stars Psy, BTS and TVXQ, respectfully. A handful of years ago, entering the Billboard charts was a tough milestone, especially for non-English-speaking artists or those outside the US market. But recently, Korean singers have created a space for themselves on the charts and in the world’s biggest music market. Bands like Twice sell out international stadiums, and global streaming services secure exclusive rights to Korean content, including for documentary films on Blackpink and BTS. BTS, in particular, is the first K-pop act to hit No. 1 on the Billboard Hot 100 singles chart and perform at the Grammys. At the heart of the ever-growing Hallyu, or Korean Wave, K-pop isn’t just a musical genre, but a multibillion-dollar industry that drives the national brand and spearheads global culture. And as K-pop has grown into a cultural sensation, experts have said K-pop is not a genre made in Korea, but made by Korea. “There are many elements that make up the ‘K’ in K-pop, but one of the main reasons behind K-pop’s ubiquitous influence and breakout success is because it didn’t start as something Korean. It’s a mixture of Western music and domestic culture, which is why the genre landed well with global fans and is suited to Western sensibilities,” said Lee Hye-jin, a communications professor at the University of Southern California. Short for Korean popular music, K-pop is a genre stemming from South Korea as part of its culture. It started as modern American-style pop music infused with the nation’s culture, paving the way for other artists and entertainment companies to be more experimental and break the mold. Years ago, idols tailored their images to Western music styles and standards. But the sonic aesthetics of K-pop have gone beyond the \"Macarena\" craze that took the music scene by storm in the mid 1990s. Now more K-pop artists seek bigger opportunities. K-pop A-listers are landing management contracts with American music labels for future endeavors in the pop music market. SuperM, SM Entertainment’s project group launched in 2019, clinched a collaboration with Capitol Music Group, an American music label under Universal Music Group. In 2020, Twice signed a partnership with Republic Records, also a major American music label owned by Universal Music Group. Last year, rookie band aespa inked a contract with Creative Arts Agency, home to musicians like Beyonce. Lee echoed her stance that just as K-pop has musically matured over time, US pop music consumers have changed. Unlike decades ago, the younger generation is more open to cultural diversity. Korean pop has the power to make people more receptive to Korean culture, meaning that listeners accept Korean culture through K-pop. Music idols and their songs show what Korea is to foreigners, which can be seen as a cultural movement. Although it is hard to distinguish the line between what makes a Korea-based identity with a slew of all-English tracks sung by idol groups, such changes were inevitable to create a cultural brand. According to Lee, English is a tool used by K-pop bands to make inroads and branch out to the Western market, and the roots are always Korea-based. The decision-makers, those who sing the songs and the K-pop acts making the achievements are Korean people,” Lee said. Lee sees K-pop’s future as the center of world cultural production. “Sony is a Japanese company but doesn’t make Japanese movies. Like Sony, K-pop agencies would want to produce musicians that fit the global market with its system. If the formula to stardom was through Hollywood, people nowadays aspire to be one by becoming a K-pop star.” Work is already progressing for several K-pop powerhouses. In July, JYP Entertainment announced that it would team up with Republic Records to launch a joint audition in search of a new global girl group. Hybe Labels Japan, an indie label affiliated with Hybe, is also gearing up to launch its first international boy band in December. Apart from K-pop’s sonic landscape, the lyrics also play a pivotal role in connecting global fans to Korea. While understanding the language isn’t a requirement, appreciating it can bring fans closer to their idols and Korean culture. It’s a sentiment fans share with hopes of creating an intrinsic connection, because music can transcend language, but words may not. Language-learning desire is also a facet of being part of a globalized fan base. Since the desire stems from wanting to connect with K-pop idols on a deeper level, a report by the Modern Language Association showed that the uptake of Korean language in American universities rose by 14 percent between 2013 and 2016. “Language goes together with culture. Before we used English to let foreigners know but now, K-pop’s status has gone through a seismic change. The number of people who understand Korean has increased, and it formed a relationship where fans prefer listening to the Korean version even though they don’t know it,” said Shin Ji-young, a Korean linguistics professor at Korea University. And as more fans are engaging with K-pop, new media emerge where content is sold and stories unfold. “The number of prosumers (someone who both produces and consumes) has risen on par with the number of Korea-based content. For example, 'Texas Style' is a tweaked version of Psy’s 'Gangnam Style,' which is part of Korea’s cultural gradient. The shift in social media paved the way for transmedia storytelling, which is why the K-pop crossover to the Western market was possible,” Yoo Seung-chul, an associate professor of media convergence at Ewha Womans University, told The Korea Herald. Yoo added that the perfect storm of media and K-pop content has culminated with Korean culture reaping the benefits by exporting Korean content. “K-pop has laid the foundations for the spread of Korean culture by allowing others to re-create Korea-based content via new media. It’s not just a product made for Korea or in Korea, but a culture made by Korea.” Articles by Park Jun-hee  The Korea Herald by Herald CorporationCopyright Herald Corporation. All Rights Reserved.  ",
    "title": "\r\n[Feature] What’s behind the ‘K’ in Korean popular music?",
    "datetime": "2022-09-14T09:08:25+09:00",
    "url": "https://www.koreaherald.com/view.php?ud=20220914000561"
}