{
    "text": "Most Popular [From the Scene] Don't remember Itaewon alley as place of death, victims' families say G-Dragon booked for drug use South Korea, Qatar agree to elevate ties, forge $4.6b industry partnership Former Olympic hero battles rumors surrounding her groom-to-be S. Korea goes all out to contain lumpy skin disease Man fined for assaulting soldiers who refused to praise Kim Jong-un, Putin Yoon pitches S. Korea's investment appeal to Middle East 4-meter deep sinkhole injures 1 in central Seoul Yoon meets Park, honors father in gesture of conservative unity [News Focus] A year after Halloween crowd crush, legislation remains stalled Start your day with a roundup of key stories from The Korea Herald with news and comment on all that’s happening in Korea. Published : Dec. 5, 2022 - 10:37 Link copied As a teenager, Chun Byong-geuk, the first vice minister of culture, sports and tourism, would watch Western movies and listen to classical music as well as trot, which was heavily influenced by Japanese music. Now he, 58, still loves going to classical music concerts but finds himself enjoying more K-dramas and movies. Chun said it is not just because he feels obliged, but because he is genuinely intrigued by the unique storylines and riveting characters. Chun, appointed in May, oversees culture, arts, content, copyrights and media policies. In a recent interview with The Korea Herald, Chun, whose new role comes on the heels of the so-called “K-culture boom,\" discussed the root of the growing popularity of Korean cultural products and the role of the government in supporting the country's culture and arts industry. “I think it is because of diverse topics and themes,” Chun said. The diverse topics and themes are based on Korean people’s understanding and their acceptance of cultures outside Korea, he added. This understanding of various global cultures is combined with Korean originality and has attracted audiences both domestically and abroad, Chun said. While it is essentially the private sector that has been leading the K-culture boom, Chun said the private and public sectors are like two wheels of a wagon, and it is important that the government supports areas where the private sector was unable to have an impact, such as providing policy funds, promoting SMEs and streamlining regulations. Some efforts include operating 33 Korean Cultural Centers in 28 countries and government-to-government cooperation in protecting intellectual properties, which is becoming an increasingly important task for the ministry. Then, can this K-culture renaissance maintain its momentum? Chun certainly believes so. \"About 20 years ago, it was mainly Asian countries that enjoyed Korean dramas and music. Now Korean content beyond soap operas and music is being accepted globally with help of the (streaming) platforms,\" he said. \"Now it has a stronger base that is unlikely to die down.\" Listing “Decision to Leave,” a Park Chan-wook movie, and TV drama series “Extraordinary Attorney Woo” as some of the most impressive recent works that he watched, the vice minister said that Park’s movie starring a foreign actor, Tang Wei, receiving good feedback globally, has widened the horizon for Korean cultural content. Chun also praised “Extraordinary Attorney Woo” for its unique portrayal of an attorney on the autism spectrum and added that the writer of the TV series, Moon Ji-won, was part of a mentoring program for creative talent run by the government in 2013. He vowed to continue to support the country’s talents, which he thinks, is the most important pillar of K-culture. \"The government recognizes that K-content is a powerful game changer in the country's economy and will put its utmost efforts to create an atmosphere where the private sector can foster creativity to the fullest,” he said, adding that the government plans to continue to nurture talent with various incubation programs and academies. Chun is a veteran bureaucrat who majored in public administration and has worked at the Culture Ministry since 1993. Articles by Park Ga-young  The Korea Herald by Herald CorporationCopyright Herald Corporation. All Rights Reserved.  ",
    "title": "\r\n[Herald Interview] First vice minister of culture says 'K-culture' now has a strong foundation that secures longevity",
    "datetime": "2022-12-04T08:41:04+09:00",
    "url": "https://www.koreaherald.com/view.php?ud=20221204000185"
}