{
    "text": "Most Popular [From the Scene] Don't remember Itaewon alley as place of death, victims' families say G-Dragon booked for drug use South Korea, Qatar agree to elevate ties, forge $4.6b industry partnership Former Olympic hero battles rumors surrounding her groom-to-be S. Korea goes all out to contain lumpy skin disease Yoon pitches S. Korea's investment appeal to Middle East Yoon meets Park, honors father in gesture of conservative unity 4-meter deep sinkhole injures 1 in central Seoul [News Focus] A year after Halloween crowd crush, legislation remains stalled Olympic medalist ‘tricked’ by fiance-turned-stalker Start your day with a roundup of key stories from The Korea Herald with news and comment on all that’s happening in Korea. Published : Oct. 5, 2022 - 16:36 Link copied   On Sept. 13, the Korean drama “Squid Game” won six awards at the 74th Emmy Awards, including those for outstanding lead actor and outstanding directing for a drama series -- the first non-English TV series to do so. “Squid Game” enjoyed explosive popularity internationally, made history, and received high praise at home and abroad. It seemed like an event that deserves to sweep the world at least once. In this sense, we cannot help but recall director Bong Joon-ho’s “Parasite,” Korea’s first Oscar-winning film. The Korean entertainment industry has already attracted audiences around the world for decades. It has become a recipient of major investment and player on the stages of Netflix and Hollywood. Korean films and dramas are now a global trend as part of the Hallyu, or Korean Wave. What makes them so successful? Is it because K-dramas are the most “Korean” medium, or because they are in touch with global culture that goes beyond the ideas embodied in “K”? How can we use this soft power for public diplomacy? This week’s discussion invites three experts from film studies and public diplomacy. Professor Kim Soo-yeon at the Department of English Literature and Culture of Hankuk University of Foreign Studies, associate professor of English Language and Literature Department Nan Zhang at Fudan University and research professor Kim Yun-hee at the Hallym University of Graduate Studies participated to delve into this topic further.  Hwang: What is the significance of Korean entertainment, including films like “Parasite” or dramas like “Squid Game”? Also, what gives them huge success in relation to global K-culture?  Zhang: The global popularity of K-culture, represented by things as diverse as K-pop, TV dramas, beauty products, food, lifestyle and so forth, remains one of the most impressive cultural phenomena in recent years. The worldwide success of Korea’s entertainment industry has undoubtedly enhanced the status of K-culture and greatly contributed to its widespread reception. At the same time, the conceptual depth and artistic richness of Korean films and dramas raises K-culture up to a new level of excellence, troubling an easy divide between pop culture and high culture that somewhat shapes its image. If K-culture had sometimes been associated with what Max Horkheimer and ‎Theodor W. Adorno have denigrated as the culture industry of global capitalism, then these visual contents at least encourage critical reflection, if not attacks, on the detrimental effects of such a socioeconomic system. Of course, there is no denying that the thriving of K-culture is inextricable from the development of the world capitalist market. Still, the visual contents’ intellectually stimulating and aesthetically dexterous engagement with social issues that have transnational or global implications attests to the scope and vitality of K-culture, which can not only bring art to bear on consumerism, but cultivate a more nuanced understanding of culture in its global consumers.  Kim S.: In the case of “Parasite,” its accomplishment is especially welcome because it diversifies global K-culture. No Korean would want Korean culture to be represented solely by BTS or Blackpink. For all the positive global influence exercised by BTS, a boy band cannot embody the entirety of Korean masculinity any more than Psy could in the early 2010s. Nor would we want a national culture to be epitomized in certain commodities, such as cosmetics, or a specific miniseries, notably, “Squid Game.” In short, these Korean films’ success is significant insofar as it expands the realm of the “K” in K-culture enjoyed worldwide. Similarly, I am ecstatic about Lim Yun-chan, the youngest person to win the first place at the Van Cliburn International Piano Competition recently at age 18. While Lim’s breathtaking performances shown on YouTube add to the diversity of global K-culture with tens of millions of views, K-culture need not be confined to a small number of K-pop celebrities or musical prodigies. I hope that there will be multiple tiers of mainstream and arthouse, internationally acclaimed and lesser-known cultural products, which originate from Korea and are rejoiced globally.  Hwang: What do you suggest to improve the East Asian entertainment industry’s fture prospects and competitiveness in the global market?  Kim S.: Selling well often translates to appealing to the masses at the cost of unfamiliar and uncomfortable truths. Hollywood fluff, feel-good movies such as “Singin’ in the Rain” and “Forrest Gump,” serve as a prime example. In this sense, East Asian movies doing well in global markets have little to do with their artistic growth or the creation of new perceptions. Calling new perceptions “aisthesis,” the origin word of “aesthetics,” Jacques Ranciere views the creation of new ideas and emotions, aisthesis, as the task of film art. In that East Asian movies are lesser-known than their western counterparts, I do wish that more people would watch Chinese, Japanese, and Korean films. An increasing number of East Asian movies are available on Netflix and other streaming platforms, but these movies are largely schematic and bland, far from creating new aisthesis. I suggest promoting heterogeneous sets of East Asian movies, such as classical and modern movies with cosmopolitan or local styles which surpass western audiences’ expectations and which may attract a variety of new global audiences.  Zhang: “Parasite” has set a good example -- and set the bar really high -- for East Asian movies. Its masterly treatment of social issues of global concern, such as inequity, unemployment, and poverty, coupled with deft use of local elements -- for example, symbolic objects, settings and experiences -- offers instructive ways to engage with audiences at home and abroad. Creativity knows no national or regional boundaries. When it is set free and deployed to confront thorny problems in a simultaneously ingenious and candid manner, it can manifest the unparalleled power of art to intrigue, inspire and move viewers, wherever they are. To be sure, given the inner diversity of East Asia, it is not always easy, or even desirable, to generalize about movies from this region. Directors and producers with transcultural perspectives and aspirations might be particularly sensitive to traditions and situations that vary from place to place. Some may have to negotiate between domestic and global markets that are governed by different tastes, demands, or standards. Instead of trying to please all, or to cater to specific markets, however, it might be more fruitful, as shown by successful cases like “Parasite,” to aim for movies that speak to audiences in their own distinctive and melodious languages.  Kim Y.: The way forward on K-movies in the global market is to fortify weaknesses and challenges in Korean Wave content. Although diverse people around the world are enthusiastic about Korea’s soft power in the international community, scholars and specialists have pointed out one thing: the sustainability of K-movies and dramas based on the Korean Wave. It is a fact that “Parasite” was a worldwide box office hit and “Squid Game” recorded the highest viewing rate on Netflix. However, K-content alters its color easily to appeal to and attract global audiences. In this context, the K-movie industry needs to draw up measures that fit the varied and ever-changing global situation for a long-term strategy in the worldwide market. As an expert in journalism and mass communication, professor Lee Byung-jong’s opinion in his column wrote that K-content needs to discover its distinctive color reflecting its culture and values that other countries do not have. To find a shape in a long-term strategy and plan to lead the cultural industry by Korean soft power, the Korean government and the public continue to create the right environment in each position. The government supports establishing an infrastructure, platform, policy and system for K-content. It then connects this to fostering conditions for the public to create K-content of its own accord.  Hwang: “Parasite” or maybe “Squid Game” presents a graphic portrayal of economic disparity in contemporary society. Can you share your ideas about the issue of class in your country or worldwide?  Zhang: Economic disparity remains one of the most disturbing issues in both developed and developing countries around the world. Such disparity, however, isn’t always visible or visceral to those who are inured to their own immediate environment. For example, in “Parasite,” turning abstract concepts like class or hierarchy into graphic images can be more effective in motivating and energizing its audience. Visual representation may not overcome the effect of “out of sight, out of mind,” but one can at least trust good art to leave a lasting impression.  Kim S.: Economic disparity is truly worrisome and is intertwined with other global disasters faced by all humanity, such as climate change and food shortages. In Korea, economic inequality has ceased to simply mean an unequal distribution of wealth, and generates all sorts of resentment directed toward “other” groups. This is why generational, gendered, and class conflicts are proliferating and dividing Korean society now. Making better policies matter, but it should be accompanied by an awareness of the complex, and often psychological, workings of contemporary capitalism.  Kim Y.: K-movies reflect the reality of Korean social problems vividly and plainly. The deep-seated issues depicted in these movies vary. Collusion between politics and business once seemed inevitable for Korea’s economic growth, but now it poses a problem that needs to be resolved. They cover issues that connect to people’s lives in Korean society, such as gender discrimination in the context of an androcentric community; unfair treatment of migrant workers; and difficulties for North Korean defectors to settle in South Korea. And finally, the inequality gap between rich and poor, which became more critical due to the pandemic. This came to the forefront as a serious matter that showed a disparity in education, employment rates, and health care.  Hwang: The Korean Wave seems to be declining in China. Do you think Korean cinema still appeals to the Chinese?  Kim Y.: Korea and China relations became estranged due to political issues in 2016; thus, the administration's order to ban the Korean Wave in China affected the Korean film industry. However, cultural exchange through movies between the two countries is still ongoing despite the tough situation. Although it is a different way of watching Korean movies or dramas, unlike before 2016, several Chinese movies that draw keen attention to its people are based on Korean content. For example, the remake of the Korean film “Veteran” has been a phenomenal success with the name of the Chinese movie “Big Big Man” in 2019. The recent Chinese movie “Moon Man,” which captivated audiences in China is also based on a famous Korean webtoon called “Moon You” by the writer and illustrator Jo Seok. According to research by Korea's creative content agency in 2022, Korean content still made up the greatest portion of the adaptation film industry in China. Last year, the Korean movie “Oh! My Gran” got permission to release in movie theaters in China for the first time in six years since China’s ban on the Korean Wave was carried out.  Zhang: The answer is definitely in the affirmative. Korean cinema has a considerable following here, spanning various age groups, whose interest shows no signs of abating. The international success of movies like “Parasite” has further boosted the reputation of Korean cinema, winning more fans in China and beyond. Some might say that K-dramas are more popular than movies in general, but both are familiar topics in casual and academic conversations about films and TV series. One feels that Korean cinema is an integral part of K-culture, which continues to influence in fascinating ways the development of various domains of cultural life, ranging from music, dancing, cuisine, and variety shows to concepts of beauty and modern art. Moreover, many would love to see further exchanges and collaborations on various levels between the two cultures.  Hwang: What is your opinion about Korean media contents’ role in Korea’s public diplomacy?  Kim S.: No popular culture product is free from the social and ideological roles it eventually comes to play, consciously or not. As a majority of films are commercially motivated, they tend to reproduce mainstream beliefs, rather than challenging the status quo, thereby perpetuating dominant social ideologies. If Korea’s public diplomacy aims to communicate with foreign publics in a mutually respectful way in order to improve its own interests, Korean cinema may contribute to it -- not by inculcating a fixed national image and identity, but by constantly renewing itself and exerting soft power.  Kim Y.: The government expects to advance Korea’s reputation and diplomatic ties by earning trust and expanding its influence on the global stage based on three major public diplomacy activities – cultural diplomacy, knowledge-oriented public diplomacy, and public diplomacy on policy. The committee on public diplomacy held its sixth meeting last month, stressing the need to enhance Korea’s global reputation on the basis of the Korean Wave, which will be the policy direction of public diplomacy for five years under South Korean President Yoon Suk-yeol’s administration as mentioned by the Minister of Foreign Affairs Park Jin. In that sense, the Korean film industry is a key mechanism for fostering Korea’s cultural diplomacy in the international community. Korea’s soft power is the core element of cultural public diplomacy, so movie content that reflects and includes Korea’s soft power draws a positive image of Korea and disseminates its cultural value to the world. The content of Korean movies also sets a stage for forming a mutual understanding between the Korean and foreign publics, especially among Korean movie lovers abroad who embrace Korean culture spontaneously.  Hwang: What challenges do you see for K-culture in general?  Kim S.: Countless Korean movies and drama series show up on streaming platforms day by day. Despite the high number of productions and the skyrocketing budgets poured into them, there appears to be no match for “Parasite” and “Squid Game” in the last few years. I believe that it’s due to a lack of original vision and storytelling. It's the same as Hollywood and other film industries, for that matter. Technology develops faster than the human imagination, and whatever you imagine can be meticulously visualized via state-of-the-art computer graphics now. The result is that spectacles and mise-en-scenes are more vividly rendered, but just barely remain new and interesting. While I have concerns for the rapturous ways in which “Parasite” and “Squid Game” have been received, these two succeeded in repeating universal themes reimagined in the context of contemporary Korea. Pursuing “original” ways through which to mix the global and the Korean is the key to the success of K-culture.   Hwang Jae-ho is a professor of international studies at Hankuk University of Foreign Studies. He is also the director of the Institute for Global Strategy and Cooperation. This discussion was assisted by researchers Ko Sung-hwah and Shin Eui-chan.   Articles by Choi He-suk The Korea Herald by Herald CorporationCopyright Herald Corporation. All Rights Reserved.  ",
    "title": "\r\n[Hwang's China and the World] The Korean entertainment industry’s public diplomacy competitiveness",
    "datetime": "2022-10-05T10:17:21+09:00",
    "url": "https://www.koreaherald.com/view.php?ud=20221005000696"
}