{
    "text": "Most Popular [From the Scene] Don't remember Itaewon alley as place of death, victims' families say G-Dragon booked for drug use South Korea, Qatar agree to elevate ties, forge $4.6b industry partnership Former Olympic hero battles rumors surrounding her groom-to-be S. Korea goes all out to contain lumpy skin disease Man fined for assaulting soldiers who refused to praise Kim Jong-un, Putin Yoon pitches S. Korea's investment appeal to Middle East 4-meter deep sinkhole injures 1 in central Seoul Yoon meets Park, honors father in gesture of conservative unity [News Focus] A year after Halloween crowd crush, legislation remains stalled Start your day with a roundup of key stories from The Korea Herald with news and comment on all that’s happening in Korea. Published : Dec. 2, 2022 - 10:02 Link copied  MADRID -- A decade ago, the Korean wave in Spain was almost solely about K-pop, but now it is virtually K-everything, the chief of a state-run cultural institution in Madrid said. “Because of the growing interest in Korean culture here, the Korean Cultural Center in Spain is making efforts to introduce new genres of Korean culture, such as games, magic, children's plays and fashion to the Spanish people,” said Oh Ji-hoon, director of the Korean Cultural Center of Madrid in a recent interview with The Korea Herald. In 2011, when the center first opened, the annual number of participants in its programs was around 30,000, but now it has increased tenfold to more than 300,000.   \"(The Korean wave) has overcome language and cultural barriers with universal messages and stories that people all over the world can relate to,” he said, adding the novelty of Korean culture was shown through original content such as the Netflix series “Squid Game.” The strategy of the Korean government and content producers, which proactively responded to the change in how people consumed content during the COVID-19 pandemic, was important, he said. Oh explained about the two-track strategy that his center has pursued to build an ecosystem to support the continuity of the Korean wave. “First, we need to closely work with overseas cultural organizations, which are consumers and suppliers of the Korean cultural content market,” he said. Those partners include concert organizers, large movie theaters, art galleries and Korean language schools. “To this end, the Korean Cultural Center is strengthening cooperation with various private organizations in addition to the Spanish government and public institutions,” Oh said.  The other strategy is to increase opportunities for people in Spain to create and produce Korea-related content rather than simply consuming it. “We plan to expand the number of events producing consumer-created content next year here which has the advantage of easy access and high acceptance by locals,” he said. In order to bring Korean culture closer to the Spanish people this year, the center held a cooking contest using kimchi via Spain's leading public broadcaster, which was watched by 4.3 million people. A magic show featuring Korean magician Yu Ho-jin, viewed by 30,000 people, was a successful event co-hosted by the institution, the director said. The center has been also working on Korean language education via King Sejong Institute, the brand name of Korean language institutes established by the Korean government around the world since 2007. Spain has the fifth largest number of King Sejong Institutes in Europe. A total of three are in operation in Spain including one at the Korean Cultural Center in Madrid and in Barcelona and Las Palmas. About 800 Spaniards study Korean there every year.  Articles by Park Han-na The Korea Herald by Herald CorporationCopyright Herald Corporation. All Rights Reserved.  ",
    "title": "\r\n[Newsmaker] [Interview] Diversification of K-culture gains traction in Spain",
    "datetime": "2022-11-28T16:43:01+09:00",
    "url": "https://www.koreaherald.com/view.php?ud=20221128000761"
}