{
    "text": "A shocking incidence happened to a South Korean consumer who was eating Haagen-Dazs ice cream on July 9. Around midnight on the day, a tip was posted on a Korean internet community site saying a 3 cm caterpillar was found in Haagen-Dazs strawberry ice cream. The informant said, “I heard a crunchy sound when I was eating ice cream, so I spitted it out to find a caterpillar there. I was so shocked that I threw up, but still don't feel good and has ended up having diarrhea from stress.” The informant went to the hospital for nervous stomachache and afterwards she called the Haagen-Dazs main office to complain about the incident, only to hear their inadequate response. This led her to officially report the shocking case to the Korean Ministry of Food and Drug Safety. The ministry contacted the Haagen-Dazs manufacturing factory in France and learned that the caterpillar in the ice cream was a beetles larva. The informant demanded that Haagen-Dazs make an official apology through a pop-up at its website and three or more news outlets, but Haagen-Dazs CEO left for a business trip without giving an answer. Moreover, the head and deputy heads of related departments at the company contacted the informant and wanted to apologize by offering a 200,000 won (US$180) worth of gift certificate to her. “I told them that I do not want monetary compensation. It was quite a shock that they came with a 200,000 won Haagen-Dazs gift certificate,” the informant said. “The reason I refused the compensation is for consumers’ right to know. As a Haagen-Dazs lover, I felt betrayed to find a caterpillar in the ice cream and their insincere attitude made me angry,” she added. Both Haagen-Dazs headquarters in the US and its factory in France are reportedly viewing the incidence in Korea as a fairly serious problem and are keeping their eyes on it. US General Mills, the corporate that owns the Haagen-Dazs brand, sent out an official apology, saying, “According to the results from our self-inspection, we judged there is a high chance that the larva was in a strawberry collected from the strawberry farm” and that “this incidence is a very unusual one that is not related to food safety, but we will do our best to raise the quality standard and provide the best product.” Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "A 3 cm Caterpillar Found in Haagen-Dazs Ice Cream - Businesskorea",
    "datetime": "2018-07-11T13:00:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=23597"
}