{
    "text": "Sections How the wing went from a throwaway to a delicacy in 50 years Joseph Stromberg With the Super Bowl around the corner, it seems that buffalo chicken wings may have become the country’s favorite football-watching food. While the annual rumors that we’re running out of wings simply aren’t true, wings have indeed become the most expensive part of the chicken due to their popularity when fried and covered in buffalo sauce. Few of us realize, though, that less than 50 years ago, wings were considered one of the least desirable cuts of the chicken—a throwaway part often cooked into stock—and “buffalo” was just a wooly ungulate that wandered the Plains. Despite the recency of the invention, the event itself is shrouded in mystery. Nevertheless, there is one thing we know for certain: the “buffalo” in the name definitively refers to the city in Western New York. The most authoritative account is by New Yorker writer Calvin Trillin, who investigated the dish’s history in 1980 as he sampled the city’s most well-regarded wing joints. He presented two competing versions of how a stroke of serendipity led Teressa Bellissimo, proprietor of the Anchor Bar, to invent the dish in 1964. Her husband Frank Bellissimo, who founded the bar with Teressa in 1939, told Trillin that the invention involved a mistake—the delivery of chicken wings, instead of necks, which the family typically used when cooking up spaghetti sauce. To avoid wasting the wings, he asked Teressa to concoct a bar appetizer; the result was the wing we know today. Dominic—Frank and Teressa’s son, who took over management of the restaurant sometime in the ’70s—told a slightly more colorful tale: It was late on a Friday night in 1964, a time when Roman Catholics still confined themselves to fish and vegetables on Fridays…Some regulars had been spending a lot of money, and Dom asked his mother to make something special to pass around gratis at the stroke of midnight. Teressa Bellissimo picked up some chicken wings—parts of a chicken that most people do not consider even good enough to give away to barflies—and the Buffalo chicken wing was born. Both Frank and Dominic agreed on a few other crucial details—that Teressa cut each wing in half to produce a “drumstick” and a “flat,” that she deep-fried them without breading and covered them in a hot sauce, and that she served them with celery (from the house antipasto) and blue cheese salad dressing. They also both reported that they became popular within weeks throughout the city, where they were (and are still) simply called “wings” or “chicken wings.” But there are even more competing versions of the story. John E. Harmon, a professor of geography at Central Connecticut State University who wrote the Atlas of Popular Culture in the Northeastern United States as a sabbatical project, writes that Teressa actually improvised the recipe to serve Dominic and a group of his friends when they ambled into the bar late at night. The most dissimilar account is also mentioned by Trillin, who wrote that on his trip to Buffalo, he met a man named John Young who bluntly stated, “I am actually the creator of the wing.” Young points out that growing up in an African-American community, he’d frequently eaten chicken wings as a standard dish; what he invented was a special “mambo sauce” for the wings he served at his restaurant, John Young’s Wings ’n Things, during the mid-’60s. But he served his wings breaded and whole (rather than chopped into flats and drumsticks), distinctions that suggest to many wing traditionalists that they belong to an entire different category. While it’s uncertain which creation myth is most accurate, what happened over the next few decades is clear: buffalo chicken wings exploded in popularity across the country. During the 70′s, the recipe spread to other eateries in the city and state—Duff’s, an early adopter, remains a favorite wing joint of many Buffalonians—then went national with the founding of chains like Wings N’Curls in Florida. Harmon reports that Trillin’s article itself sparked further interest, as did the 1983 founding of Hooter’s, which featured wings at the center of its menu. In 1994, Domino’s spent $32 million advertising their national roll-out of wings, and Pizza Hut quickly followed suit. Since, the growth of chains like Buffalo Wild Wings and the placement of wings on countless local menus means that they’re essentially available anywhere in the United States. They’re gradually penetrating international markets, too, with Buffalo Wild Wings planning to open locations in Dubai, Qatar, and Saudi Arabia later this year. Nowadays, buffalo sauce has gone beyond wings—it’s frequently used for boneless chicken fingers and pizzas, and gas stations sell everything from buffalo-flavored Combos to Pringles. In Buffalo, though, wings are still eaten roughly the way they were invented by Teressa in 1964: served in either hot, medium or mild buffalo sauce, with blue cheese and celery. Get the latest Travel & Culture stories in your inbox. Joseph Stromberg\n|\n\n| READ MORE Joseph Stromberg was previously a digital reporter for Smithsonian. Explore Subscribe Newsletters Our Partners Terms of Use © 2023 Smithsonian Magazine\nPrivacy Statement\nCookie Policy\nTerms of Use\nAdvertising Notice\nYour Privacy Rights\nCookie Settings © 2023 Smithsonian Magazine\nPrivacy Statement\nCookie Policy\nTerms of Use\nAdvertising Notice\nYour Privacy Rights\nCookie Settings ",
    "title": "A Brief History of the Buffalo Chicken Wing | Arts & Culture|\n Smithsonian Magazine",
    "url": "https://www.smithsonianmag.com/arts-culture/a-brief-history-of-the-buffalo-chicken-wing-10260772/"
}