{
    "text": "Before Michael K. Williams became known for playing Omar Little on The Wire, he was a dancer in music videos. For NPR's series \"My Big Break,\" he talks about how a scar changed his life. MICHEL MARTIN, HOST: I'm Michel Martin, and this is TELL ME MORE from NPR News. Now we'll hear about one actor's curious road to the top. It's part of a series by our colleagues at All Things Considered called \"My Big Break.\" That's where people talk about critical turning point in their careers. Michael Kenneth Williams has won acclaim playing a series of ruthless but complicated gangsters. But if you saw him as Omar Little on \"The Wire\" and the equally terrifying Chalky White on \"Boardwalk Empire,\" you might be surprised to know that before all that, he was a dancer in music videos. He performed with artists like Madonna and George Michael. Here's Michael K. Williams talking about his big break.MICHAEL K. WILLIAMS: I was doing a bunch of videos, you know, just dancing background, but then on my birthday - my 25th birthday - I got cut in my face in a barroom brawl. There was a popping party going on in Queens. I went outside to get some air, and I saw that two of my other friends were being surrounded by some dudes who I didn't know. And it looked like they were about to get jumped. And I said, yo, I'm ready to leave. Let's go back. I'm going to go back home now. But this one dude kept pacing behind me. He kept walking behind me. He kept like, you know, like sucking his teeth, and I'm looking - I'm like yo - so what's up dude? Yo bro, what's your problem? And the dude wiped his hand across his mouth and just - what I thought appeared to be - smacked me, but what he did was he spit a razor. He was positioning the razor in his mouth to get between his middle finger and his ring finger, and then he just went - swiped me down my face, and this cut my face. It was actually the first hit of the fight. So we managed to escape with our lives, barely, that night. Things changed immediately after that. Directors didn't want me just to dance in the videos any more. They wanted me to act out these thug roles, you know, like - Mike, roll these - roll these dice in this video. Have this fight in this video. I was like, all right. Tupac Shakur was filming a movie in New York called \"Bullet,\" opposite Mickey Rourke. And the production office that they were working out of in New York happened to have a Polaroid picture of me from me going to audition from some various music videos. So he happened to see a Polaroid picture of me and was like, yo, this dude looks thugged out enough that he could play my little brother. I think he saw my pain and my struggle, my heart. I was just like - I was star struck, you know. I was like, wow, that's Tupac Shakur.(SOUNDBITE OF FILM, \"BULLET\")TUPA SHAKUR: (As Tank) And if you was half as smart as I thought you was Paddy boy, you'd be minding your own business right now.WILLIAMS: (As High Top) Hey, we know all about you little hotshot package.Tupac was larger than life. I spent a lot of times just listening to him and watching him 'cause I learned so much. He's that kind of person - like a walking encyclopedia.(SOUNDBITE OF SONG, \"ALL EYEZ ON ME\")SHAKUR: (Singing) 'Cause all I want is cash and things - a five -double-oh Benz, flaunting flashy rings.WILLIAMS: I shot that movie - still dancing, and I had booked a major supporting role on \"Law and Order.\" I had booked a major supporting role on \"Sopranos.\" So you know, I got a little high on a horse, you know, I ain't going to LA. LA's going to send for me - you know what I mean? So I'm like, my phone will be ringing any minute now. And it didn't happen. And I got really financially strapped. My mom opened up a day care in the projects where we lived. So in 2000, she was like, why don't you come work in the day care? You know, I'm paying your rent anyway. You might as well earn it. So I said, Ma, you know I want to give this acting thing one more shot. It doesn't work - I'm done. It's me and you. We're changing Pampers, baby. My phone did not ring, and man, I was down in the dumps. I got really depressed - like really depressed. And then March came, and one day she called me -s aid, you got to fax downstairs, here. I went downstairs to her office, and it was the breakdown for Omar from \"The Wire\" On HPO.(SOUNDBITE OF TV SHOW, \"THE WIRE\")UNIDENTIFIED ACTOR: (As character) State your name for the record.WILLIAMS: (As Omar Little) Omar Devone Little.UNIDENTIFIED ACTOR: (As character) And what is your occupation?WILLIAMS: (As Omar Little) I rip and run.UNIDENTIFIED ACTOR: (As character) You?WILLIAMS: (As Omar Little) I rob drug dealers.UNIDENTIFIED ACTOR: (As character) Mr. Little, how does a man rob drug dealers for eight or nine years and live to tell about it?WILLIAMS: (As Omar Little) Date and time I suppose.I got to grow with an amazing group of people that I consider my Wire family. That character changed my life. And that was my big break.MARTIN: That was actor Michael Kenneth Williams. To hear more stories about other people's big breaks, just visit npr.org. MICHEL MARTIN, HOST: I'm Michel Martin, and this is TELL ME MORE from NPR News. Now we'll hear about one actor's curious road to the top. It's part of a series by our colleagues at All Things Considered called \"My Big Break.\" That's where people talk about critical turning point in their careers. Michael Kenneth Williams has won acclaim playing a series of ruthless but complicated gangsters. But if you saw him as Omar Little on \"The Wire\" and the equally terrifying Chalky White on \"Boardwalk Empire,\" you might be surprised to know that before all that, he was a dancer in music videos. He performed with artists like Madonna and George Michael. Here's Michael K. Williams talking about his big break. MICHAEL K. WILLIAMS: I was doing a bunch of videos, you know, just dancing background, but then on my birthday - my 25th birthday - I got cut in my face in a barroom brawl. There was a popping party going on in Queens. I went outside to get some air, and I saw that two of my other friends were being surrounded by some dudes who I didn't know. And it looked like they were about to get jumped. And I said, yo, I'm ready to leave. Let's go back. I'm going to go back home now. But this one dude kept pacing behind me. He kept walking behind me. He kept like, you know, like sucking his teeth, and I'm looking - I'm like yo - so what's up dude? Yo bro, what's your problem? And the dude wiped his hand across his mouth and just - what I thought appeared to be - smacked me, but what he did was he spit a razor. He was positioning the razor in his mouth to get between his middle finger and his ring finger, and then he just went - swiped me down my face, and this cut my face. It was actually the first hit of the fight. So we managed to escape with our lives, barely, that night. Things changed immediately after that. Directors didn't want me just to dance in the videos any more. They wanted me to act out these thug roles, you know, like - Mike, roll these - roll these dice in this video. Have this fight in this video. I was like, all right. Tupac Shakur was filming a movie in New York called \"Bullet,\" opposite Mickey Rourke. And the production office that they were working out of in New York happened to have a Polaroid picture of me from me going to audition from some various music videos. So he happened to see a Polaroid picture of me and was like, yo, this dude looks thugged out enough that he could play my little brother. I think he saw my pain and my struggle, my heart. I was just like - I was star struck, you know. I was like, wow, that's Tupac Shakur. (SOUNDBITE OF FILM, \"BULLET\") TUPA SHAKUR: (As Tank) And if you was half as smart as I thought you was Paddy boy, you'd be minding your own business right now. WILLIAMS: (As High Top) Hey, we know all about you little hotshot package. Tupac was larger than life. I spent a lot of times just listening to him and watching him 'cause I learned so much. He's that kind of person - like a walking encyclopedia. (SOUNDBITE OF SONG, \"ALL EYEZ ON ME\") SHAKUR: (Singing) 'Cause all I want is cash and things - a five -double-oh Benz, flaunting flashy rings. WILLIAMS: I shot that movie - still dancing, and I had booked a major supporting role on \"Law and Order.\" I had booked a major supporting role on \"Sopranos.\" So you know, I got a little high on a horse, you know, I ain't going to LA. LA's going to send for me - you know what I mean? So I'm like, my phone will be ringing any minute now. And it didn't happen. And I got really financially strapped. My mom opened up a day care in the projects where we lived. So in 2000, she was like, why don't you come work in the day care? You know, I'm paying your rent anyway. You might as well earn it. So I said, Ma, you know I want to give this acting thing one more shot. It doesn't work - I'm done. It's me and you. We're changing Pampers, baby. My phone did not ring, and man, I was down in the dumps. I got really depressed - like really depressed. And then March came, and one day she called me -s aid, you got to fax downstairs, here. I went downstairs to her office, and it was the breakdown for Omar from \"The Wire\" On HPO. (SOUNDBITE OF TV SHOW, \"THE WIRE\") UNIDENTIFIED ACTOR: (As character) State your name for the record. WILLIAMS: (As Omar Little) Omar Devone Little. UNIDENTIFIED ACTOR: (As character) And what is your occupation? WILLIAMS: (As Omar Little) I rip and run. UNIDENTIFIED ACTOR: (As character) You? WILLIAMS: (As Omar Little) I rob drug dealers. UNIDENTIFIED ACTOR: (As character) Mr. Little, how does a man rob drug dealers for eight or nine years and live to tell about it? WILLIAMS: (As Omar Little) Date and time I suppose. I got to grow with an amazing group of people that I consider my Wire family. That character changed my life. And that was my big break. MARTIN: That was actor Michael Kenneth Williams. To hear more stories about other people's big breaks, just visit npr.org. Copyright © 2014 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information. NPR transcripts are created on a rush deadline by an NPR contractor. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record. Sponsor Message Become an NPR sponsor ",
    "title": "A Brawl At Bar Brought Michael K. Williams His Big Break : NPR",
    "url": "https://www.npr.org/2014/06/30/326934053/a-brawl-at-bar-brought-michael-k-williams-his-big-break"
}