{
    "text": "Glen Weldon The cover of Saga, issue #12.\n                \n                    \n                    Image Comics\n                    \n                \nhide caption The cover of Saga, issue #12. \"Comics,\" a wise newspaper features editor once opined, back when the Earth had not yet cooled and icthyosaurs swam the turbid seas, \"Aren't Just For Kids Anymore.\" Her fellow editors, incredulous, seized upon this audacious truth. \"Comics Aren't Just For Kids Anymore!,\" they intoned, seized with an evangelical fervor. \"Comics Aren't Just For Kids Anymore!\" Their cry rang out throughout the land, in metropolitan dailies and weekly newsmagazines, in pennysavers and morning heralds and advocates and argusi. Sometime in the late Mesozoic, it was taken up by a new breed of editors who appended to it a prefix that testified to their surpassing wit and insight. \"Pow!\" they said. \"Zap!\" they said. \"Comics Aren't Just For Kids Anymore!\" But then the day came when those words lost their power. When suddenly the truth they contained was no longer audacious, but self-evident. Flatly, mundanely, dully so. And so it went for years. There were comics for and about kids. There were comics for and about adults. And some of those comics for and about adults were about very very sexy adults. And some of those comics for and about adults were about very very violent adults. Saga, the hugely successful Image comic written by Brian K. Vaughan and drawn by Fiona Staples, is a comic for adults, about adults to whom many sexy things happen, and many violent things happen. We have told you, in this space, that is a good comic — no, a great comic — for adults to enjoy. Witty, warm, hugely imaginative, sad, funny, gorgeous to look at, ingeniously plotted, with something to say about love and marriage and honor and robots with televisions for heads. On Tuesday, writer Brian K. Vaughan said Apple would not be allowing Saga #12, which goes on sale today, to be downloaded via iPad and iPhone. The reason, according to Vaughan: \"two postage-sized images of gay sex.\" This, of course, simply posed an inconvenience to a relatively small number of people. As Vaughan pointed out, there were several workarounds available to those who normally read Saga on Apple devices: 1) Head over to your friendly neighborhood comics shop and pick up a physical copy of our issue that you can have and hold forever. 2) While you're at it, don't forget to support the Comic Book Legal Defense Fund, which helps protect retailers who are brave enough to carry work that some in their communities might consider offensive. You can find signed copies of Saga at the CBLDF site right now. 3) Download the issue directly through sites like https://comics.imagecomics.com or on your non-Apple smartphone or tablet. 4) If all else fails, you might be able to find SAGA #12 in Apple's iBookstore, which apparently sometimes allows more adult material to be sold than through its apps. Crazy, right? Crazy, yes. (This writer can confirm that the route described in #4 works just fine, thank you very much.) This latest allegation of puzzling corporate gatekeeping reminded many of 2010's controversy over Apple's refusal to carry a comic-book version of James Joyce's Ulysses due to some brief male nudity. But then came a clarification Wednesday from the makers of Comixology, the iOS app in question. And they said Apple never rejected the issue at all — instead, Comixology independently interpreted the issue to be contrary to those Apple guidelines we just mentioned and never even submitted it to Apple. And they say it wasn't the sexual orientation of the beings involved that was the problem. That leaves open the question of just what the problem was, given the graphic content that Comixology has already successfully sold via its iOS apps. In the previous eleven issues of Saga alone. Please don't misconstrue my highlighting these instances as an attempt to call out Saga as a particularly prurient title. I am simply trying to imagine what internal policy discussions Comixology imagined Apple to be having that would have led to the conclusion that this issue would be uniquely problematic. ---- TO: ALL STAFF FROM: POLICY AND PROCEDURES, NAUGHTINESS DIVISION IN RE: STANDARDS AND PRACTICES, COMICS Some of you appear to be confused about our internal procedures regarding what may be depicted in comics we are prepared to sell via iOS devices, and which we are not. In the interest of transparency, we will use the Image Comics series called Saga as an example, and walk you through our decision process, instance by instance. ISSUE 1: A. Explicit scenes of childbirth. JUDGMENT: Approve. Childbirth is miraculous, if sticky. B. Explicit language, lots. JUDGMENT: Approve. Hey, we're not prudes, here. C. Nipples, female. Several instances. JUDGMENT: Approve. HELL YEAH. D. Breastfeeding. JUDGMENT: Approve. Please excuse our \"Hell Yeah,\" above. We were not clear on the context, and we amend our statement. Breastfeeding is natural and beautiful and depictions of it are encouraged. E. The male takes the umbilical cord and .. JUDGMENT: We know. We read it. It's gross, but whatever. Approved. F. Decapitations, several. JUDGMENT: Approved. It's a war comic. E. Disembowelments. One, perhaps two. JUDGMENT: Approved. See above. Also it looks badass, so. F. Explicit sex, male-female. JUDGMENT: Approved. G. Both participants are robots with television for heads. Does that ... matter? JUDGMENT: Approved. Robot sex is beautiful and natural. We are not prudes, here. H. Space monster explodes into many flying gobbets. JUDGMENT: Approved. ISSUE 2: A. Naked armless torso spider lady. JUDGMENT: Approved. B. Ghosts of brutally mutilated children, several. Seriously, like with intestines spilling out. JUDGMENT: Gross. But approved. C. Explicit language, lots. JUDGMENT: Approved. ISSUE 3: A. Explicit language, lots. JUDGMENT: Okay let's just take the 'explicit language' stuff as read, okay? Geez. You'd think we're like schoolmarms over here. Remember: It's APPLE. They're the HIP ones, okay? We GET it! We're getters of it! ISSUE 4: A. Sex-slave aliens who are just giant heads with legs. JUDGMENT: Approved. B. ... They're wearing fishnet stockings, is that cool? JUDGMENT: Approved. It's aliens. It's outer space. Just move on. C. Explicit orgy, involving graphic depictions of oral sex. JUDGMENT: Um ... Really? Because that's ... D. It's all-female oral sex. JUDGMENT: Approved. E. No, hold up. There's some dudes in there, too. And an alien dinosaur/dragon thing. Some light S/M. And wow, I think you can totally see this guy and girl ... I mean, like, everything. JUDGMENT: Approved. F. ... Really? JUDGMENT: Approved. G. Dude kills a dude by, like, pressing the guy's head between his hands. Kablooie-splurt! JUDGMENT: Approved. ISSUE FIVE: A. Robot pooping. JUDGMENT: Approved. It's natural and beautiful. Well, not beautiful. You know what we mean. B. A behanding. JUDGEMENT: Approved. C. Grisly chest wound. JUDGMENT: Approved. ISSUE SIX: A. Nothing really. I mean, the language, but you said... JUDGMENT: Approved. ISSUE SEVEN: A. Giant disgusting naked space-ogre with profoundly unpleasant space-ogre genitalia, male. JUDGMENT: Approved. ISSUE EIGHT: A. Space ogre genitalia, continued. From, like, different angles. JUDGMENT: Gross. But approved. ISSUE NINE: A. Head split in two. JUDGMENT: Approved. B. Mole-faced dude mauled, bloodily. JUDGMENT: Like there's any other way to maul. Approved. ISSUE TEN: A. Creepy witches with upside down heads. JUDGMENT: ... Like, bloodily mounted on their necks, or what? B: No, it's not bloody. JUDGMENT: Oh. Then why are you even ... C. It's just ... really creepy. JUDGMENT: Oh, whatever. Approved. ISSUE ELEVEN: A. Explicit sex. Male-female. JUDGMENT: Approved. B. Nipples, female. JUDGMENT. Well, we sort of figured. Approved. ISSUE TWELVE: A. Tiny depictions of oral sex on TV screen of a robot head, two instances. JUDGMENT: App-- wait. What kind of sex. B. Oral sex. Between two dudes. JUDGMENT: DeNIED, brah. Sponsor Message Become an NPR sponsor ",
    "title": "A Foolish Inconsistency: The Saga of 'Saga' : NPR",
    "url": "https://www.npr.org/2013/04/10/176793405/a-foolish-inconsistency-the-saga-of-saga"
}