{
    "text": "BTS performs onstage during the 2017 American Music Awards at Microsoft Theater in Los Angeles. (Kevin Winter / Getty Images) When tickets for K-pop phenomenon BTS’ North American stadium tour went on sale in March, they sold-out almost immediately. The group’s Soldier Field shows — May 11 and 12 — were no exception, selling out in two and a half hours. Which, if you ask fans and parents, felt like five minutes. At K-Pop of Chinatown (2223 S. Wentworth Ave.), a small but clear handwritten sign appears on a center console adjacent to high-gloss glamour shots of idols, printed pillows, collectible paper dolls to dress and so much more. “NO we don’t have any BTS light sticks,” the sign reads, warning fans about their pending concert needs. “NO we don’t know if we’ll get any more.” While K-pop (Korean pop) has been around since the 1940s, its modern-day iteration has quickly become the country’s hottest, and most influential cultural export, especially when it comes to the slick, seven-man outfit known as Beyond the Scene (or ‘Bangtan Sonyeondan’ aka ‘Bulletproof Boy Scouts’ in Korea). The 2018 list of top-selling albums included two BTS releases, “Love Yourself: Answer” and “Love Yourself: Tear,” and the group is No. 2 on the list of top-selling artists globally for 2018. Its latest album, “Map of the Seoul: Persona,” (released April 12) is the third No. 1 album for BTS in just under 11 months, a feat that has been matched only by The Beatles and The Monkees. Net profit for BTS’ label and distributor Big Hit Entertainment in 2017 surged more than 170% over 2016, according to Forbes. Other K-Pop acts such as BLACKPINK and NCT 127 have also begun to see major breakthroughs in the U.S.. In April, BLACKPINK, with a Coachella date, became the first K-pop girl group to perform at a major U.S. music festival. The K-pop influence has even spread to drag culture, helmed by Los Angeles-by-way-of-Chicago-based “K-pop drag superstar” and “RuPaul’s Drag Race” contestant Soju. With its positive messaging, catchy dance moves and bright fashions, BTS is at the heart of the genre and its fans right now. After its debut in 2013, BTS — RM, J-Hope, Suga, Jin, Jimin, V and Jungkook — quickly became the music’s gateway drug in the U.S., claiming numerous firsts including becoming the first K-pop act to perform on the Billboard Music Awards and “Saturday Night Live;” and setting a Guinness World Record for having the “world's most Twitter engagements for a music group.” In Chicago, one member of the ARMY (Adorable Representative MC for Youth — a moniker for the group’s dedicated fan base) prepares for her idols’ arrival. “This will be my fourth time seeing BTS,” says Gabby Watkins, president of K-pop Dreamers, a student club at Columbia College Chicago. “It’s like a carnival,” said Watkins, ARMY since 2014, as she recalls BTS’ previous stop in Chicago at United Center in October 2018. “The whole concert day and experience of it is just 24 hours of excitement. BTS set-up booths with life-size posters you can take pictures with. Last time, they had seven of their jackets they wore for one of their performances and you could touch them and smell them,” she laughs. Gabby Watkins, president of the K-pop Dreamers club at Columbia College Chicago, with her BTS pillow in her dorm room at the university center. (Jessi Roti/Chicago Tribune) In 2010, when initially compiling what would become BTS, Big Hit encouraged group members to increase their presence on social media; engaging with fans and giving curious eyes a glimpse at what life is like for young stars in-training, via video shares and streams. Operating under the belief that modern youth needed “a hero who can lend them a shoulder to lean on, even without speaking a single word,” CEO Bang Si-hyuk ditched the BTS’ original rap-focused initiative to that of a more traditional idol group. For Watkins, BTS are more like friends and activists than artists whose music she’s a fan of. It’s part of the package, which she argues is more about welcoming listeners rather than seducing them, like so many Western pop acts do. She hoped using BTS’ message about loving yourself in the club’s mission statement would resonate with anyone still shaping their identity. “It took me awhile to get to that place myself, to learn that I had to love myself. So I wanted to bring what I knew, my experiences and my stories to the members that were just joining; who were freshmen like me, who were lost and had no friends,” she says. Apart from the music’s exuberant sound and welcoming feel, dance plays a major role in K-pop culture and fandom. Dances can make or break a song. The easier the dance can be learned by fans — while still looking intricate and sharp — the bigger the effect. Chicago's K-pop dance group 'Prism Kru' teaches some of the most popular K-pop dances to people at Puzzle Box Dance Studio on April 23, 2019. (Chris Sweda/Chicago Tribune) Chicago’s K-pop community draws fans from all around the Midwest for special events and meet-ups shared across the internet, such as those hosted by Skokie-based dance troupe Prism Kru whose newest member, 13 year-old Lexus Vang, travels from Milwaukee with her mother to take part. The Kru started discussing hosting K-pop dance workshops in January after noticing the massive influx of arena shows in the Chicago area, and an increase in interest in individual K-pop classes being offered at Puzzle Box, a dance studio in Avondale. Established in 2013 after participating in a K-pop flash mob, Prism Kru — made up of 32 girls and 23 boys — has performed K-pop choreography as well as its own hip-hop routines at events such as Chicago Korean Festival and Taste of Korea. “Over the last few years, K-pop has gotten so huge that fans are looking for community — like K-Con in L.A.,” says Prism Kru member and Puzzle Box choreography instructor Ally Le. “I went to one of the first ones, it was tiny. Now it's in Staples Center and its three days, and it’s huge. Member of the K-Pop Dreamers club at Columbia College Chicago practice dance moves in one of the college's building on Friday, April 26, 2019. (Terrence Antonio James/Chicago Tribune) “And dance covers have become so huge with the rise of Youtube,” she continues. “When I first started dancing, it wasn't a huge thing. Now it's like an hour after the song drops, you'll see dance covers online. That, because the companies notice people are watching these dances and covering them, which will ultimately get them more views, they put more effort into the dance.” Watching her 12 year-old daughter Eden learn the choreography to BLACKPINK’s “Kill This Love” just before the act’s recent Allstate Arena show, Sophia Naiditch said that before K-pop she had never seen her daughter have such an enthusiastic response to pop music. “Eden never had an interest in dance — she got into it because of BTS. We’re going to see them on May 12, Mother’s Day,” Naiditch laughs. “We’ll be back for the BTS workshop before that concert. But I don’t mind, it’s teaching her positivity and confidence. She’s learning Korean, she’s meeting new people and staying out of trouble. It just makes me feel good seeing her smile and love this, seeing these girls all together, feeling free to be themselves.” Magdalena Fannick, 23, learns a dance from Blackpink during a K-pop dance workshop held by members of Prism Kru at Puzzle Box Dance Studio in Chicago on Tuesday, April 23, 2019. (Chris Sweda/Chicago Tribune) But how has this historically controlled and regimented presentation of pop music taken such hold of international pop culture, and what exactly is it about BTS that has millions of fans of all ages pledging devotion — and billions of dollars? K-pop in current form can be traced back to the early 1990s with trio Seo Taiji and Boys. The group’s self-titled debut, released in ‘92, has sold 1.8 million copies and is one of South Korea’s best-selling albums. Its early embrace of American rap, street-style dancing and clothing, and incorporation of lyrical social critique was pioneering at the time, drawing the attention of Korean and Japanese ethics and censorship groups. Two of the former’s founding members, Seo Taiji and Yang Hyun-suk are still noted influencers of South Korean popular culture. Taiji, often referred to as the country’s “President of Culture,” acknowledged BTS' thematic similarities to his music and recognized the group as his musical successors in 2017, after it released a remake of Taiji's 1995 classic \"Come Back Home\" in honor of the artist’s 25th anniversary. BTS reworked the style and lyrics to push for the same societal change Taiji had incorporated into his own music, so he invited them to perform as backup vocalists and dancers for eight songs at his Seoul Olympic Stadium concert, reportedly telling them, “This is your generation now. Show them.” Hyun-suk went on to found YG Entertainment, one of K-pop’s largest agencies whose roster includes BLACKPINK and 2NE1 (one of the biggest selling girl groups of all time with over 66 million albums sold before disbanding in 2016). Glorified boy band H.O.T., or Highfive of Teenagers, followed in 1996. Known as the first “K-pop idol group,” incorporating synchronized choreography, coordinated fashions and makeup, it provided an even more clear-cut blueprint for the future likes of BTS. Dal Yong Jin, media studies scholar and professor at the School of Communication at Simon Fraser University in Vancouver, Canada, explored what’s been named the “New Korean Wave” in his 2016 book “New Korean Wave: transnational cultural power in the age of social media” (University of Illinois Press). Jin explained contemporary K-pop’s global rise and the BTS phenomenon in responses sent via email. He argues three major factors contribute to the genre’s current popularity: hybridization of western and Korean culture, the K-pop industry’s strategic use of social media, and Psy’s “Gangnam Style” which, while seen as more of a novelty song in the U.S., laid out a template for “going viral” in a way that hadn’t been accomplished by the genre before. The “hybridization” of western and Korean popular culture is at the heart of the K-pop industry’s model. Language is no longer a barrier to entry for fans. While BTS predominantly sings in Korean, it also releases albums in Japanese, and regularly employs English expressions and slang. But the group has found its own way to bridge global and local sensibilities even beyond that. “The Korean music industry has been influenced by both Japanese music and American pop music,’ Jin writes. “After developing ballads, emphasizing sentimental love and sorrow embedded in Korean culture influenced by Japan starting in the 1910s, Korea has finally developed new music genres by adopting hip-hop, rap, and reggae starting in the mid-1990s. “With the arrival of American hip-hop culture and rap music, Korean popular music became youth-oriented hybrid music. In this regard, K-pop has developed the music themes of resistance and social critique as K-pop mixes with hip-hop, showing its universal appeal.” Jin notes that compared to idol group history, Big Hit Entertainment has offered more freedom and autonomy to BTS than other agencies have to their artists; encouraging an “authenticity” that wasn’t often associated with K-pop from a western perspective. The act often writes and produces its music, and has explored themes around the Korean education system (“N.O.”), social inequality and political corruption (“Spring Day”). Additionally, the in-house training process for idols has long been seen as “too rigorous, too non-humanistic, and too (money focused),” Jin says, adding that in the 2010s, several new forms of pop idol training started to appear. The industry faced some of its toughest criticism in recent memory after the passing of SHINee member and solo artist Jonghyun, who died of an apparent suicide in 2017. A note reportedly cited his “devouring depression” and struggles with fame, and the young singer’s death opened discussions about the harsh and competitive nature of the entertainment business in South Korea, as well as mental health. In 2018, BTS leader RM (aka Rap Monster; born Kim Nam-joon), gave a speech about the group’s “Love Myself Campaign” (in partnership with UNICEF) to the United Nations alongside his fellow group members. While messages of self-care and self-love have become more of an omnipresent trend in America in recent years, those notions are still widely considered groundbreaking to hear on Korean radio and in Asian culture, and fans have responded passionately. Jin argues this “movement,” while still small in the overall industry, “will eventually advance the status of K-pop in the global music scene.” A line of women cheer as another group learns a dance from Blackpink during a K-pop dance workshop held by members of Prism Kru at Puzzle Box Dance Studio in Chicago on Tuesday, April 23, 2019. (Chris Sweda/Chicago Tribune) But K-pop is not without its controversies. It works within a system that favors male performers over female. And the genre’s acts of cultural appropriation, and history of idols appearing in blackface, also finds itself part of the conversation as K-pop’s audience diversifies. Many acts, BTS included, have publicly apologized to fans and pledged to be better at understanding cultural ownership, racial history and tensions in the west that remain heightened. The competition at the root of K-pop as a for-profit industry – from music to band merchandise – also, in part, promotes the toxic fan behavior knowing as “stanning.” Aggressive bullying and fighting within the fan bases, especially when new singles or “comebacks” are released and have to obtain a high chart position, has become a regular occurrence. Many stans also deter others from declaring fandom for other groups, promoting exclusivity and loyalty pledges. And despite currently booming universal interest, K-pop is still considered a niche market in the U.S. – leading to a fetishization of its artists, particularly the girl groups and culture. Terms “Weeaboo” and “Koreaboo” speak to a lack of understanding among global fans, who are seen as ignoring or even shunning their own racial and cultural identity to adopt or celebrate what are often stereotypical attributes of Japanese or Korean culture, thinking the behavior or “knowledge” obtained through the behavior legitimizes their fandom. While it is acknowledged that Korea’s specific blind spots reflect its tight, cultural homogeny, Western and European fans have pushed for a deeper dialogue around the subject in hopes of strengthening – not isolating – the fandom. “Me and Lo led a general body meeting on cultural appropriation because we felt like we had to tell them it was a thing,” says Gabby Angeles, a member of the University of Illinois at Chicago’s Korean American Student Association. “Understanding and respecting the cultural differences is always going to be significant. (The double standard) is engraved into their culture, but being a K-pop fan here, that influences me a little bit.” A fan of K-pop and BTS since 2013, Angeles – alongside fellow member Lauren ‘Lo’ Nnabuo, says it’s one of the most negative sides of K-pop culture that American fans grapple with. The friends agree that having these conversations (about Koreaboos, Black history as it pertains to rap’s influence on K-pop, sexism in the industry, etc.) just come with the territory as the genre becomes more popular worldwide. “It's the same way you deal with it in the U.S.,\" Nnabuo says. “People will always take things that they don't understand and use them in ways they don't understand that they're using it. Fans do their best job, especially since the fandoms are getting much more diverse. Those who do understand try to explain as much as possible, then they get the word out there.” In the face of K-pop becoming more synonymous with pejoratives stateside, however, Nnabuo adds she feels the need to defend her interest. “People hold a stigma around K-pop, in general,” she explains. “They think you just want to be Asian, or are a screaming girl, whatever. But, for most of us, it's the same reason behind why people go and learn about Spanish cultures, or German or Russian. It's the same concept, I don't know why people differentiate between it. I don't know why I have to explain to people, 'I don't want to be anyone but myself.' I'm just learning about this culture, sometimes through this music. I'm learning a language, the same way you've spent five years learning Spanish.” Ultimately, all seem to agree the universal appeal of K-pop — helmed by BTS — lies in its message of love. “The idols, the way they interact with their fans, they tell them they don't have to look a certain way for someone to like you. Even if ideals and standards are pushed on them, they don't push it on their fans,” Nnabuo says. “The older generations, they're not focused on the things we're focused on now with the way society has changed. The younger generation is trying to be more open and optimistic about the world, so the idols push that to maybe try and change things in their home countries. People are still learning how to love themselves; they go through that forever.” When: May 11-12 Where: Soldier Field, 1410 Museum Campus Dr. Tickets: Sold out, resale tickets available; www.ticketmaster.com jroti@chicagotribune.com Twitter @jessitaylorro [ MORE COVERAGE: Album Review: BTS' 'Map of the Soul: Persona' ] [ Blackpink: Everything you need to know about the K-pop sensations ] [ Renowned muralist Ouizi to show-off new public works in West Town and Lakeview ahead of Chicago gallery debut ] Copyright © 2023, Chicago Tribune ",
    "title": "A guide to K-pop's cultural influence in Chicago before BTS arrives for two sold-out concerts at Soldier Field",
    "url": "https://www.chicagotribune.com/entertainment/music/ct-ent-bts-kpop-influence-chicago-0505-story.html"
}