{
    "text": "By Anya Kamenetz Preschool students from Nikki Jones' class at Porter Early Childhood Development Center in Tulsa, Okla., line up in the hallway on their way back from outside play.\n                \n                    \n                    John W. Poole/NPR\n                    \n                \nhide caption Preschool students from Nikki Jones' class at Porter Early Childhood Development Center in Tulsa, Okla., line up in the hallway on their way back from outside play. Both our current president and the presumptive Democratic nominee have talked a lot about expanding early childhood education. President Obama has backed up his rhetoric by creating Preschool Development Grants. In late 2014, the Department of Education announced 18 grants totaling $226 million to states, which have so far reached 33,000 children. The latest budget, not yet finalized, would add $250 million more. Dale Farran, a researcher at Vanderbilt University, has been watching closely how that money is spent in Tennessee. She argues the programs there are flawed, and unlikely to move the needle for the poor kids who need them most. What's worse, Farran says, is that across states, nobody's really watching the store when it comes to quality, so these mistakes are likely to be repeated. \"I'm so old I'm getting really grumpy about this,\" she says. \"I have cared about this for such a long time and it's just making me crazy.\" Farran outlines her criticisms in a new paper for the Brookings Institution. Farran's research team visited 139 preschool classrooms in the Memphis area and Nashville, all funded by the federal grant program. They observed the classes for a full six- to eight-hour day to see just how the teachers and students spent their time. This is really important, because we know from other research that high quality preschool means lots of choice-based play in centers, small group instruction, and outdoor or gym play so that young children can move their bodies. Here's what Farran's research says is the status quo for federally funded preschool in Tennessee: A lot of these issues, in Farran's view, come from pouring the fizzy juice of pre-K into glasses sized for much older children. \"We really should not treat these 4-year-olds as though they are fourth-graders and can do the same things,\" she says. She says part of the problem is infrastructure: Much of the federal grant money has gone to state education agencies that have used it to put pre-K classrooms into existing public elementary schools. That can mean bathrooms down the hall, cafeterias far across the building and playgrounds that aren't safe or that don't have time slots for the littlest ones to play without getting trampled. On the other hand, Farran notes that in a separate research project, she's helped a group of 26 preschool classrooms reduce their transition time by half. \"Some of it has to do with teachers who are more or less skillful at helping little children change activities,\" she says. But why the emphasis on whole-group instruction, with one teacher talking to 20 students? \"That's harder to explain,\" says Farran. \"I can't tell you the number of large groups I've seen where, out of 20 children, maybe five are paying attention.\" Based on her previous research, this kind of didactic instruction can be effective in the short run in familiarizing children with facts like letters, numbers and the months of the year. But, she adds, those gains fade over time if they're not based on deeper learning. As we reported last fall, Farran is the author of one of the largest-scale studies on the long-term effects of public preschool for poor kids. While several previous studies have shown large, long-term returns on investment, especially from relatively small programs that are rich in services and carefully implemented, Farran's results were more disquieting. She found that 18,000 children who attended public pre-K in Tennessee did start kindergarten more prepared. But by the second grade, those results were reversed: Children who had never attended pre-K were actually ahead of those who did. Takirra Winfield, a spokesperson for the Department of Education, told NPR Ed: \"The Department is committed to creating evidence through rigorous evaluation, which is why we specifically dedicated PDG funds to evaluate the effectiveness of preschool programs. We agree that a focus on quality is critical and we appreciate the ongoing dialogue about the best pathway to pre-K for all.\" But, she adds, it's too soon to disparage the federally funded programs: \"The study includes a number of faulty assumptions and prematurely attempts to evaluate a program with insufficient evidence.\" There may be states that are doing a better job than Tennessee at expanding high-quality preschool with the federal funds. For example, some states are working more with community groups rather than siting all programs at elementary schools. But, Farran argues, the federal grant program sets aside insufficient resources to evaluate the programs or spread best practices. \"Why do we have to make it up on the fly?\" asks Farran. \"Why don't we learn and figure out in a really systematic way what's better for children? Right now this is all voluntary — it's a perfect time to learn what will really work.\" Sponsor Message Become an NPR sponsor ",
    "title": "A Harsh Critique Of Federally Funded Pre-K  : NPR Ed : NPR",
    "url": "https://www.npr.org/sections/ed/2016/07/19/486172575/a-harsh-critique-of-federally-funded-pre-k"
}