{
    "text": "A museum with ties to the American Museum of Natural History in New York is slated to open in April 2014 in Overland Park, Kan. It’s part of Prairiefire, a $580 million development currently under construction along 135th between Nall and Lamar. Linda Segebrecht is the director of the not-yet-built Museum of Prairiefire. Her office in south Overland Park is on the second floor of a building just across the street from an empty, nearly 60-acre stretch of land. The large windows now have a clear view of earthmovers. \"One of the most interesting parts of doing an exhibit or doing a program like this, is seeing how it’s put together,\" she says. Creating a \"cultural icon\" in Overland Park In January 2013, the mixed-use development called Prairiefire broke ground, with the first tenants, including REI, scheduled to open their doors this fall. But Linda Segebrecht says developer Fred Merrill, and his wife, Candy, did not want Prairiefire to be just another retail location in Johnson County. \"They knew from the very beginning, when they first stared at this land – and even before they purchased it – that they had the opportunity to really produce and present a cultural icon for this area,\" says Segebrecht. What that could look like remained in flux, until Segebrecht says the Merrills heard the American Museum of Natural History (AMNH) in New York, one of the largest museums in the world, was interested in expanding its brand. Not familiar with the AMNH? Maybe the film, Night at the Museum with Ben Stiller will jog your memory. http://www.youtube.com/watch?v=jgu0Oppl7Wc Connecting science to students and to Kansas A longtime science educator, Segebrecht taught high school biology for a decade. She then switched to creating educational programming, with projects like Earthworks, The White House Decision Center at the Truman Library, Union Station’s DinoLab and the Dead Sea Scrolls exhibition. Segebrecht says she’s always looking for ways to make connections. \"While some people may read interesting novels at night, I sit around and try to figure out the curriculum that’s coming,\" she says, with a laugh. \"And that’s the beauty of Prairiefire, we know the next 10 exhibitions that we’re going to have, we know into 2016 what we’re going to be presenting here.\" The Museum of Prairiefire will display 20 traveling exhibitions from the AMNH over the next 10 years, as well as permanent exhibits of fossils and artifacts. In September, before the museum opens, a temporary space will host the first exhibition called “The World’s Largest Dinosaurs.” And Segebrecht says a Tyrannosaurus rex will have a permanent home at the new museum; a cast for the dinosaur will be made from the one in New York, with ties to Kansas. \"The T.rex was discovered in 1908 by a gentleman named Dr. Barnum Brown,\" says Segebrecht. \"What makes the story far more interesting is that Barnum Brown grew up in Carbondale, Kansas. He went to the University of Kansas. But he went back to New York, went on staff of the American Museum of Natural History, and is credited with finding the first full skeleton of a T.rex.\" \"Hit with science everywhere you go\" The American Museum of Natural History has an estimated 32 million specimens in its collection, with only a small fraction on display. The Museum of Prairiefire will be able to tap into that. But Segebrecht says the teaching extends beyond the footprint of the museum – with wetlands, butterfly and sunflower gardens, and science bulletins inside and native plants outside the retail shops. \"So when you come to the whole Prairiefire development, you’re going to be hit with science everywhere you go,\" says Segebrecht. \"We hope that it will kind of coalesce for you when you go into the museum, but it will be all the way through the whole development.\" Segebrecht says she expects collaboration and partnerships to be a large part of what the museum is about – from the Nerman Museum of Contemporary Art and the Deanna Rose Children’s Farmstead to the Nelson-Atkins Museum of Art and Science City. \"You know, as I look at my career, this really is a wonderful way for me to culminate everything I’ve done,\" she says. \"The education is there, the excitement is there. Bringing a larger scale of what science education can be and should be for our community. It's kind of all culminating at the Museum of Prairiefire.\" STAR bonds helped finance the shell of the museum, but fundraising continues for the inside – a Discovery Room, classrooms and exhibition space. To date, approximately $5 million more needs to be raised. ",
    "title": "A New 'Cultural Icon' For Overland Park | KCUR - Kansas City news and NPR",
    "datetime": "2013-04-03T10:00:00",
    "url": "https://www.kcur.org/arts-life/2013-04-03/a-new-cultural-icon-for-overland-park"
}