{
    "text": "Please select Recommendations and/or countries from the drop-down list on the right side. Back\n\n\n\n\t\t\t\t\t\tAdopt a Monument Miia Hinnrichsen ©Europa Nostra Award 2015 Location of the initiative: FINLAND Relation to Strategy 21 Recommendations: K2 - Implement measures to encourage young people to practise heritage Brief description of the initiative: This grassroots project, facilitated by the Pirkanmaa Provincial Museum, encourages citizens to ‘adopt’ monuments of cultural and historical significance in their environment, to care for them and return them to use. While the adopters do not own the site, they do take on the role of managers in taking responsibility for its upkeep and monitoring its condition. The wide array of structures that are ‘up for adoption’ are from many different periods in history and shows the inclusive nature of this programme. The project is sustainable and its potential to be applied across Europe is evident. Objectives of the initiative: As caretakers of these monuments, they contribute to raising awareness in the local communities about their heritage by researching the history of the site and holding events there. Adopt a Monument’ is a creative way to actively involve local inhabitants in the care and preservation of their local heritage and helps to encourage the protection of smaller, unprotected buildings As the monuments have often been left vacant for many years, this initiative helps to restore their visibility within their communities and greatly enhances their value. Brief assessment of the initiative’s results: ‘Adopt a Monument’ has grown rapidly and has enjoyed tremendous popularity in Finland. New monuments are being added all the time and it has started to gradually spread throughout the rest of the country, an indication of its great success. The volunteers who arrange the ‘adoptions’ are supported by professionals in museums and the projects for the restoration of the buildings are aided by conservation professionals. The enthusiasm from the volunteers coupled with the expertise of the professionals has resulted in a credible and highly efficient project which has had a great impact despite its modest budget. An interesting and very relevant aspect of this project is its focus on bringing these cultural heritage sites and immigrants to Finland closer together by providing meaningful, short-term activity to asylum seekers in a bid to foster understanding of Finnish culture. This is another good aspect of this remarkable initiative, particularly timely and of great relevance everywhere in Europe. Online resources: Contact: Mrs Tuija-Liisa Soininen\n[email protected]  ",
    "title": "Adopt a Monument - Culture and Cultural Heritage",
    "url": "https://www.coe.int/en/web/culture-and-heritage/-/adopt-a-monument"
}