{
    "text": "By Jason Lim Sulli was a 25-year-old actress who made her debut when she was only 11 years old and joined the K-pop girl group f(x) at age 15, leaving the group in 2014, reportedly due to malicious and unfounded online attacks. Ironically and tragically, she was most recently the host of a TV show trying to educate the public about the harms of cyberbullying, even reading out loud some of the online comments that she has had to deal with. The anonymity and ubiquity of online platforms make it too easy for people to lash out at others without thinking about the impact it might have on them. Because cyberbullies can’t witness the effect of their words, they use less restraint than they might in face-to-face situations. After all, you don’t see the blood from a broken nose or the black eye from a fist fight. There is no mess to clean up, which makes the violence less real. Except to the victims. In response to the social outrage, a “Sulli’s Law” may be introduced in South Korea’s National Assembly in early December. While the exact language isn’t available, the bill already carries high expectations to serve as a panacea to the many ills attributed to the prevalence of cyberbullying and its malevolent effects on those bullied. The New Alternative Party, a recent offshoot of National Assembly representatives who have left the majority Democratic Party of Korea, has announced: “Sulli’s death is nothing less than social murder. The press competed in clickbait marketing by taking advantage of the daily life of a young person, and the portal sites let it go on without doing anything. The countless cyberbullies, under the guise of the freedom of the press, trampled on Sulli’s human dignity. Now it’s time to establish a societal solution to such inhumane culture in line with Korea’s reputation as an internet superpower.” Back in 2007 when there was a dawning understanding that cyberbullying was becoming a problem, the National Assembly passed a law that mandated that people’s real identities be validated through their social registration numbers and actual names used in any posting or other online activities. The driving rationale behind the law was that online anonymity afforded a lack of transparency and accountability that gave rise to irresponsible behaviour by netizens. However, the law had little impact on people’s online behaviour except for increased cyberattacks on portal sites or telecommunication companies that were now storing people’s sensitive personally identifiable information (SPII) that included social registration numbers. One particularly high-profile breach affected up to 70 per cent of South Korean citizens. In 2012, the Constitutional Court declared the main parts of the law unconstitutional, giving it a quick death. Debates surrounding Sulli’s Law involve bringing back the “real name” mandate, which seems unlikely since it’s already been determined to be unconstitutional. Further, any law that creates legally enforceable criteria for proper speech online will necessarily face the question: what speech is disallowed and who gets to decide? The line between free speech and censorship is notoriously thin, and a democratic society must always choose on the side of free speech, even offensive speech. But if there’s no legislative silver bullet for human behaviour, where does that leave Sulli? How about targeting the technology platforms that enable such behaviour? Why not pass a law aimed at the underlying logic of the clickbait marketplace, a logic that’s focused and amplified by the monopolies of the giant portal sites that determine which articles get how many eyeballs and subsequent advertising dollars? Unless the underlying incentive structure is changed, you can’t expect behaviours to change. Just look at the frenzied competition to cover Sulli’s death in the most lurid way possible while at the same time decrying its tragedy. The same incentive translates into the comments section of portal sites, driving people to post comments for shock value, intentionally creating a clickbait marketplace even among the commenters. This is great for the ego of the posters who revel in the virtual recognition of making it to the top of the comments heap, but it drives ever more edgy language to get attention. In the US in 1890, the Sherman Antitrust Act came about due to the public outcry over monopolies fixing prices. Perhaps in South Korea in 2019, Sulli’s Law could be the antitrust law for the digital age, breaking up the monopolies that portal sites enjoy on price-fixing people’s ability to access news and information. ",
    "title": "After K-pop death, ‘Sulli’s Law’ being considered to fight cyberbullying | South China Morning Post",
    "datetime": "2019-10-29T13:33:27+08:00",
    "url": "https://www.scmp.com/lifestyle/entertainment/article/3035302/after-k-pop-death-sullis-law-being-considered-fight"
}