{
    "text": "We’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. This was published 10 years ago Add articles to your saved list and come back to them any time. AGL could face a fine of $50,000, after one of its door-to-door sales people ignored a Do Not Knock sign. The Federal Court in Melbourne found the energy retailer and its agent CPM Australia breached Australian consumer law by ignoring the sign. 'The message was an unambiguous request to leave the premises, without knocking.'Credit: Eddie Jim The breach occurred in 2011 when an uninvited salesman contracted by CPM knocked on the front door of a South Australian home to sell energy on behalf of AGL. Despite a Do Not Knock sign on the front door, he remained on the premises and knocked. Justice John Middleton found the message on the door was clear and sufficient to communicate a request to leave. ‘‘The message was an unambiguous request to leave the premises, without knocking,’’ he said in his judgement today. Justice Middleton said the sign could constitute a request for the salesperson to leave. The salesman’s actions breached section 75 of the Australian Consumer Law, which says a dealer who calls on a person to negotiate an unsolicited consumer agreement must leave immediately on their request. Justice Middleton said it did not matter if a consumer did not request the salesman to leave verbally. ‘‘The whole idea of the Do Not Knock Sign was to avoid confronting a salesperson, and being caught in discussion. ‘‘Consumers may be vulnerable, or too polite to tell people to leave. ‘‘Putting an appropriate sign on the door may be the best, or only way, to communicate the request to leave the premises.’’ Consumer Action Law Centre chief executive Gerard Brody said the decision sends a clear message to door-to-door salespeople across the country. ‘‘Australians have a right to enjoy their personal time without the unwanted distraction of salespeople,’’ he said. A further hearing to determine the penalty will be held at a date to be fixed. The ACCC said the court’s decision confirms that consumers can use a sign to request uninvited salespeople to leave their premises and do not need to meet the salesperson face-to-face to ask them to leave. ‘‘Businesses must respect people’s wishes in their homes,’’ ACCC commissioner Sarah Court said in a statement. ‘‘The ACCC will not hesitate to take action to protect consumers in their homes and enforce compliance with the laws.’’ The ACCC will now seek penalties for AGL and CPM’s failure to leave the consumer’s premises when requested. Comment is being sought from AGL and CPM. AAP Copyright © 2023 ",
    "title": "AGL faces $50k fine for door knocking",
    "datetime": "2013-10-11T03:07:57+00:00",
    "url": "https://www.smh.com.au/business/agl-faces-50k-fine-for-door-knocking-20131011-2vd2q.html"
}