{
    "text": "ANN/THE KOREA HERALD – Piggybacking on the global popularity of Korean culture led by K-pop and K-dramas, Korea Airports Corporation (KAC) said on Thursday it is going all out to attract more international travellers next year. “Welcoming 2023 and 2024 as the Visit Korea Year, we plan to bring in as much as 8.5 million inbound travellers, 40 per cent of the pre-pandemic level, by combining K-culture and tourism,” Korea Airports Corporation Chief Executive Officer Yoon Hyeong-Jung said during a press conference at the company headquarters in Gimpo, Gyeonggi Province. Visit Korea Year is the government’s tourism promotion scheme to attract 30 million international travellers and generate tourism-related expenditure of USD30 billion by 2027. Of the 14 airports operated by KAC, seven international airports including Gimpo, Gimhae, Jeju, Daegu and Chungju will be at the forefront of creating new flight routes and liaising tourism packages and K-pop concerts, Yoon said. In particular, Gimhae International Airport located in South Gyeongsang Province will step up to expand its routes to the western region of the United States and Europe. KAC is seeking to provide incentives such as cutting airport charges and landing fees for long-haul airlines. In a move to bring back deep-pocketed Chinese tourists, who make up 40-45 per cent of its revenue, the company plans to visit Beijing Capital International Airport and other airports as part of its marketing strategies. “At the same time, we will target emerging markets like Indonesia, where more than half of the population is in their 20s and 30s, and are active consumers of Hallyu content.  Borneo Bulletin is the leading English daily in the country. It was first published by Brunei Press. Today, Borneo Bulletin has become the foremost source of information on local and foreign affairs, and the region’s business news. © 2013 Borneo Bulletin Online - The Independent Newspaper in Brunei Darussalam, Sabah and Sarawak ",
    "title": "Airports eye travel rebound induced by K-culture boom next year | Borneo Bulletin Online",
    "datetime": "2022-12-18T04:07:32+0800",
    "url": "https://borneobulletin.com.bn/airports-eye-travel-rebound-induced-by-k-culture-boom-next-year/"
}