{
    "text": "*Your language will be set using a browser cookie. Don't have an account? Sign up Forgot your password? Kenya boasts some of the most diverse traditional dances in Africa. Younger generation of Kenyan artists, however, are doing less and less to produce music that gets their audience dancing. Alai K seeks to change this. The artist, who has finished work on his four-track EP, Cheza, says he wants the Kenyan dance culture to gain prominence on the continent through his music. The EP will be released online later in November. “Kenyan artists have done well when it comes to sampling and adopting styles from other countries such as South Africa or Nigeria,” Alai says. “Full of imitation, this music which is dominant on the airwaves does less to motivate the audience to dance to it.” On the EP, Alai K fuses Chakacha- traditional music of the Swahili people from the Kenyan coast with Benga music and electronic dance music.  He hopes the EP helps to get audiences back on their feet as the sounds draw from local tunes, some of which is “inspired mostly by the music he grew up with.” While title track ‘Cheza’ is a playful tune that urges people to come out and dance, another one of the songs on the EP, ‘Kenya,’ pays homage to outstanding citizens who represent Kenya through their remarkable endeavours.  The new EP continues a project which begun on Alai’s 2015 11-track album Disco Vumbi which aimed to create an authentic Kenyan sound inspired by music of the 1960s and 70s. “The name ‘Disco Vumbi’ refers to a saying from the 1970s when people would go out to a dance in the streets and come home covered in dust,” Alai says. He added that the album was well received and inspired him to continue creating music that can get recognition in Kenya and beyond. Venturing into music Alai K was raised in a Swahili cultural environment which influenced his solo singing and musical direction. His songs feature Swahili poetry and storytelling. “I grew up in Mombasa (Kenya’s second largest city), in the neighborhood of Kwahola Magongo. From an early age, I liked music and used to sing to Bob Marley, Lucky Dube, Maulidi Juma, Les Wanyika, Fadhilii William, Daudi Kabaka and Pepe Kalee. I also attended the madrasa (Islamic education) and was a lead singer.” Inspired by Nguchi P, one of the members of Ukoo Flani, Alai started creating music in 1994. “Together with other friends, we would meet up and write lyrics and stories. Eventually, Nguchi would come up with beats and we would freestyle on them,” Alai recalls. After two years of collaborating, Alai, Nguchi and others founded Ukoo Flani while still in Mombasa. The group would later meet with the Nairobi-based Kalamashaka music outfit to form one of Kenya’s largest hip hop movement that operated under the Ukoo Flani name. The group consisted of more than 30 rappers. Alai says that even as a member of Ukoo Flani he always had an interest in Afro-fusion music and therefore composed his own songs. In 2005, he auditioned for Spotlight on Kenyan Music in Mombasa, a project by Alliance Francaise, and was selected to participate. It was at this point that he moved to Nairobi and recorded his first song ‘Mtema Kuni’ at Ketebul Music Studios. He however continued to perform with Ukoo Flani while developing his own projects. Through Spotlight on Kenyan Music, he got a chance to perform at festivals such as Sawa Sawa Festival, Lamu Cultural Festival in Kenya. He has also staged performances in Djibouti and Mayote Island. Additionally he has participated in projects such as BLNRB that was run by Goethe-Institut Nairobi in 2010. This project enabled him to travel to Germany with the other participants where he picked vital skills in music production. “During that time I got interested in music production and how to include electronic music in my own music. This was furthered during the Ten Cities project by Goethe-Institut where I had the chance to get some lessons in music production by Oren Gerlitz, member of Jahcoozi.\" Since then Alai K has continued to study music production, producing and defining his own style he calls Disco Vumbi. Besides producing music, Alai has been involved in the production of live events dubbed Disco Boutiq that he hopes will enable more people experience his unique fusion of music. Music he says is his life and therefore an ongoing journey. Having dabbled in hip hop before settling on afro-fusion Alai continues with his journey, to discover new musical styles, instruments and methods.   Sponsored See all Disclaimer: Music In Africa provides a platform for musicians and contributors to embed music and videos solely for promotional purposes. If any track or video embedded on this platform violates any copyrights please inform us immediately and we will take it down. Please read our Terms of Use for more. Music In Africa is  ",
    "title": "Alai K seeks to bring back Kenyan dance culture | Music In Africa",
    "datetime": "2016-11-02T12:09:20+02:00",
    "url": "https://www.musicinafrica.net/magazine/alai-k-seeks-bring-back-kenyan-dance-culture"
}