{
    "text": "In July 2017, the K-pop group Monsta X played its first shows the U.S.: two nights at the 2,400-capacity Novo in downtown L.A. The sets were hotly-tipped among the genre’s superfans, who loved the brash aesthetic of singles like “Rush.” But they were only just beginning to break through to U.S. audiences. What a difference two years makes. In August, the group will return to L.A. to headline Staples Center, a capstone of its ascent into K-pop’s A-list. And this time around, they have a U.S. major record label and the most powerful music management consortium in the country behind them. In May, the seven-member group — which performs in Korean, Japanese and English — announced they’d signed with Sony Music subsidiary Epic Records, putting them alongside U.S. rap and pop stars like DJ Khaled, Camila Cabello and Travis Scott. “We have always agreed on a vision for Monsta X that certainly includes, but extends beyond their core K-pop Audience,” said Ezekiel Lewis, executive vice president of A&R at Epic Records. “We see them as a potentially enormous boy band that happens to be from Korea as opposed to viewing through the more narrow lens of K-pop. The deal was brokered by Eshy Gazit, former manager for K-Pop titans BTS. Gazit brought Monsta X with him to Maverick, the management firm owned by Live Nation, the largest concert promoter in the U.S. “It’s great that K-pop is getting more of a spotlight,” the band said, in a group-answered e-mail interview. These new deal mean they want to “go beyond K-Pop and challenge ourselves and what’s possible.” Monsta X isn’t alone in that regard. Several of K-pop’s top acts have recently inked high-profile deals with U.S. major labels, including Interscope’s Blackpink, Capitol’s NCT127 and Republic’s Tomorrow X Together. RCA has signed Ateez. Columbia has a deal with BTS, the group that took K-pop into the stratosphere in America. In the U.S., K-pop has grown from an underground digital fandom to “Saturday Night Live” and the Grammys. Festivals like KCON attract hundreds of thousands of fans. After BTS’ three Billboard 200-topping albums and sold-out Rose Bowl dates, K-pop now compares with Beyoncè and Taylor Swift as a live draw. As was the case with disco, teen-pop and EDM, the major U.S. record companies are now scrambling to invest in K-Pop, another fast-paced, diverse and youth-skewing genre that’s taken off globally. There are risks, though. K-pop is still primarily sung in Korean. There’s already a distinct, hierarchic label system and fan-driven culture that created these groups. The hot acts change quickly and the fanbase is young and fickle. If K-pop’s trends shift, or the genre falls from favor, labels heavily invested in stalled-out acts could be left holding the bag. Despite its massive appeal online and in arenas, there are substantial challenges in taking K-pop up the U.S. charts. But the lure of sold-out stadiums is finally too much for major labels to ignore. “The world has turned global. Music is growing into that newfound global space, and [South] Korea is leading in the new era,” Gazit said. “That is the next step in the journey of K-pop, to fully emerge in the U.S. market.” Nearly a decade ago, K-pop act Girls Generation signed to Interscope and 2NE1 released music with Capitol. They laid the groundwork for the genre’s latest wave, but perhaps peaked early. After BTS, however, the scope of what was possible for K-pop in America changed. Popular groups like “Twice, Blackpink — they all reached the U.S. top songs chart. There’s massive crossover potential, and it’s all over the country, every single city and state,” said Kathy Baker, the U.S. head of label relations for YouTube Music, where BTS beat Blackpink to set a record for the most-viewed clip over 24 hours with their video (with Halsey) for “Boy With Luv.” Monsta X is one of the top groups hoping to match that success. The band — Wonho, I.M, Kihyun, Minhyuk, Jooheon, Shownu and Hyungwon — formed in 2015 through a South Korean reality show. They stood out for a more aggressive style that mixed modern trap, R&B and dance music with dark electronic tinges. Singles like “Hero” became genre staples. They branched out to collaborate with EDM superstar Steve Aoki on “Play It Cool.” Their first single for Epic, “Who Do U Love,” is a moody collaboration with rapper and label-mate French Montana. The song aims straight at Top 40 radio, with crossover appeal to hip-hop and R&B fans: key demographics for a label growing K-pop beyond the already-devoted. “We love to push boundaries,” Monsta X said. “That’s how we are building our sound and keep changing over the years. “We see the fact that we are recording them in English as an advantage,” Lewis added. “That will help enable us to market them to a much wider audience and give us a real shot at being successful at U.S. and European radio.” The band’s manager Gazit was one of the architects of BTS’ U.S. success, which changed the whole scope of K-Pop in the U.S. (He’d previously worked as an engineer and producer, and as CEO of the music marketing firm Gramophone Media). “Shifting the conversation about K-pop was a very challenging task,” Gazit said. “When I started to work with BTS in 2016, people in the industry and media were very hesitant to do anything with the band and most often ignored my emails and calls. Many people in the US viewed K-pop at the time as an artificial product and looked down on it. [But] I saw the huge potential in the amazing fanbase.” Maverick, founded by Madonna manager Guy Oseary and one of the largest and most powerful music-management firms, hired Gazit and brought on Monsta X largely due to his experience in breaking K-pop to wider crowds. “It was an area we should be in. [Gazit] had the skill set and a band with the potential to be much bigger,” said Greg Thompson, president of Maverick Music (and a former Capitol executive). They’re one of several K-pop acts that could indeed get much more popular here. Blackpink’s set at this year’s Coachella Valley Music & Arts Festival was one of the most anticipated (and talked-about) sets of the weekend. YouTube Music live-streamed their set on the side of a tower in Times Square. Some arena-size K-pop acts like Twice (headlining the Forum on July 17) are still unsigned by U.S. labels, and emerging acts like TXT (labelmates of BTS at Big Hit Entertainment in Seoul) could be up next. But it’s not a matter of simply jumping on the K-pop bandwagon. The South Korean music industry that built K-pop is an established, distinct system with different structures and expectations. “It wasn’t like ‘Who is the next one?’ In any partnership there’s got to be trust and that’s not a fast process,” said Jacqueline Saturn, the president of Capitol’s Caroline/Harvest Records, who signed NCT127 to a deal in partnership with Seoul’s SM Entertainment. “You’ve got to spend time to understand the organization and know that they do know best. It’s not ‘Let us tell you what to do,’ it’s ‘How do we partner to do something game-changing that will last a long time.’” Label executives and managers interviewed for this story declined to provide financial figures on these deals, which encompass varying levels of distribution, A&R, marketing and other label services. Most deals are partnerships with the groups’ South Korean labels, which developed these acts for years. U.S. labels license the group’s albums for North America, and mainly provide distribution and radio promotion, the latter of which is still considered key to a stateside breakthrough, and thus far elusive for K-pop. (Despite their success, even BTS has failed to crack the top 20 on Billboard’s Pop Songs chart, which measures Top 40 radio airplay.) The U.S. labels are typically not part of the lucrative branding or merchandising deals that the South Korean labels have procured for their acts. And streams for K-pop acts still lag behind those of comparably popular hip-hop acts on subscription platforms like Spotify and Apple, from which U.S. labels draw the vast majority of their revenue. “K-pop is unique because much of the development has already been done by K-pop companies,” Thompson said. But it’s complicated to balance that label and fan culture with the demands and limits of the U.S. record industry. “It’s not so simple working with different cultures and companies. It’s not ‘Just do this, it’s easy’,” Saturn said, describing the groundwork already done by South Korean labels. It’s not so simple working with different cultures and companies. It’s not ‘Just do this, it’s easy’ — Jacqueline Saturn, president of Capitol’s Caroline/Harvest Records And yet, the cache of K-pop could be worth it, said Jung-Bong Choi, a professor at Hong Kong Baptist University who studies the globalization of South Korean pop culture. K-pop is uniquely suited to today’s social media culture, where fan enthusiasm creates a community identity that goes far beyond music. “K-pop subverts the top-down celebrity model of the U.S.,” he said. “The artists treat you like some broad-based family: fan club parties, dance contests, meeting with the idols, etc.” Like the sweep of Latin urban music across the pop charts, this is a pivot for how record labels see the genre’s future. “The world’s gotten smaller and streaming has taken down the barriers to entry. Social media opened doors and labels are thinking globally now,” Thompson said. K-pop’s malleability can appeal to many different cultures at once. “Lots of ethnic minorities who feel alienated from the European mainstream cultures tend to gravitate toward K-pop,” Choi said. Label executives see it similarly. The future is in breaking singles that can speak to broad swaths of the U.S. (and the globe). “We wouldn’t do this if there was only one road,” Saturn said. K-pop can team up with “Latin, hip-hop, pop, it’s all happening. There’s no limit to the amount of people you can reach.” Labels are counting on K-pop acts scoring more Billboard Hot 100 hits. More collaborations like BTS’ “Boy With Luv” featuring Halsey (which hit No. 8 on the Hot 100, a chart that measures streams, video consumption and radio airplay) are likely en route. “A Billboard No. 1 recognizable from Peoria to Pittsburgh would be huge,” Thompson said. “If the music is great, it could become a big piece of Top 40. If the songs aren’t great, it’ll plateau.” “My vision for Monsta X is fully integrated Pop, not just a K-pop band,” Gazit said. “To create a household name where the music is more relevant to the pop world, and still keep the roots and expression of the band.” Even if labels are finally jumping onboard, how do you translate that fan enthusiasm into a global phenomenon like “Despacito?” Language barriers never stopped U.S. fans discovering K-pop online, but pop radio is more conservative (Monsta X’s “Who Do U Love” is sung entirely in English). Given that K-pop has reached ubiquity in South Korea, artists may also be looking elsewhere for growth. (It’s also been a tumultuous year in Seoul, between the wide-reaching Burning Sun scandal and the recent resignation of YG founder Yang Hyun-suk.) “K-pop at some point ceased to be a ‘national brand’,” Choi said. “Recent signing[s] with U.S. labels can be seen in continuity…[with the] domestic K-pop industry reaching a saturation point.” For artists, new commercial prospects in the U.S. also mean relentless schedules and career anxieties too. “It is kind of inevitable to face the challenge of growing pressure,” Monsta X said, about leading the genre’s next wave in the U.S. The “intensive cycle of work is something to be accepted as a K-pop band.” In the meantime, as Monsta X gears up for its arena tour, the genre’s never been in better shape in America. The culture took off without the help of U.S. major labels or the approval of hipster festivals. But like hip-hop and EDM before it, this may be the year that K-pop becomes a permanent fixture in the U.S. music industry. Even if major labels are still figuring out what exactly to do with it. “Good music and smart managers and teams will always find a way to break through, K-pop or not,” Gazit said. “But one thing is certain, the limitation of taking K-pop and artists from Asia [or of] Asian descent not seriously is over.” For breaking music news, follow @augustbrown on Twitter. It's a date Get our L.A. Goes Out newsletter, with the week's best events, to help you explore and experience our city. You may occasionally receive promotional content from the Los Angeles Times. Follow Us August Brown covers pop music, the music industry and nightlife policy at the Los Angeles Times. Music Oct. 25, 2023 Music Oct. 25, 2023 Music Oct. 25, 2023 Sports Oct. 25, 2023 Entertainment & Arts Oct. 24, 2023 Oct. 24, 2023 Entertainment & Arts Oct. 24, 2023 Oct. 24, 2023 Entertainment & Arts Oct. 24, 2023 Subscribe for unlimited accessSite Map Follow Us MORE FROM THE L.A. TIMES ",
    "title": "American record biz goes all-in on K-Pop, but crossover challenges remain - Los Angeles Times",
    "datetime": "2019-07-03T11:00:01",
    "url": "https://www.latimes.com/entertainment/music/la-et-ms-kpop-monsta-x-major-labels-20190703-story.html"
}