{
    "text": "PRINCETON, N.J. -- By more than 2-to-1 (59% vs. 26%), U.S. adults agree with the idea of providing free child care and pre-kindergarten programs for all Americans. They are divided, however, about eliminating tuition at public colleges and universities.  Vermont Sen. Bernie Sanders has strongly advanced these education proposals in his struggling bid for the Democratic presidential nomination, while Hillary Clinton says she would increase federal funding for free daycare and tuition assistance programs. Both candidates argue that government investments in early and higher education will pay the country big dividends in creating a better-educated, more economically secure workforce. Americans' initial reaction to providing free early childhood education is positive, with the majority agreeing with this proposal. And while support is highest among women (65%), young adults (70%) and those living in lower-income households (69%), the demographic counterparts to these groups are also more likely to agree than disagree with the proposal. The poll does find sharp differences on the basis of party identification: Just 36% of Republicans and independents who lean Republican favor it, compared with 81% of Democrats and independents who lean Democratic. However, even among Republicans and Republican leaners, less than half disagree outright with the proposal.  Of course, government programs aren't free -- everything has to be paid for through taxes or government debt that will eventually come due. And it is not clear whether Americans who favor these programs do so because they aren't thinking about the costs, because they assume \"someone else\" will pay them or because they believe the price in higher taxes is worth it. A slightly different question Gallup tested on this topic nearly two years ago -- using federal money to make sure quality pre-K is available to everyone who needs it -- found 70% support. However, that slightly more positive response may reflect that the question did not offer the explicit \"don't know enough to have an opinion\" option that the current question does. Those without a well-formed opinion on the issue appear inclined to favor it. Republicans and Associated Demographics Oppose Free Tuition Free college tuition is the more controversial of the two proposals. While public opinion is evenly divided, Americans in different educational, age and party groups have opposing views. Majorities of 18- to 34-year-olds, those in lower-income households, those without a college degree and Democrats agree with the proposal. By contrast, majorities of those aged 55 and older, those earning $90,000 or more in annual household income, college graduates and Republicans oppose it. The high level of young adults' support for free public college education -- one of Sanders' signature themes -- could partly explain their strong backing of the 74-year-old senator during the primaries.  Gallup asked the early childhood and college tuition questions as part of an ongoing effort this election cycle to test Americans' reactions to specific policy proposals put forward by the various presidential candidates. As such, there is no attempt to explain the reasons for these programs or to balance the question with counter-arguments. The purpose is simply to measure the public's reaction to actual positions they might hear candidates promoting on the campaign trail. Bottom Line Both of the remaining Democratic candidates have proposed changes that would likely open up education to more Americans. Clinton's education proposals are intended to improve lower- and middle-income Americans' financial access to preschool and college. Sanders' would go further and make public education free for Americans, all the way from pre-K through college -- essentially a major expansion of the K-12 public school system. Clinton has amassed more delegates during this year's primaries and is widely expected to win the nomination. However, if Sanders follows through on his recent promise to take the battle to the convention and compete for superdelegates, Clinton may need to take bolder stances on some of Sanders' signature issues to help thwart that effort. In terms of taking those positions into the general election, support for free child care and preschool would be an easier sell than free college tuition. Survey Methods Results for this Gallup poll are based on telephone interviews conducted April 21-24, 2016, on the Gallup U.S. Daily survey, with a random sample of 2,024 adults, aged 18 and older, living in all 50 U.S. states and the District of Columbia. Each respondent rated a randomly selected subset of five of the 18 proposals included in the survey. Each proposal was rated by between 533 and 590 national adults. Results for each proposal have a margin of error of ±5 percentage points at the 95% confidence level. All reported margins of sampling error include computed design effects for weighting. Each sample of national adults includes a minimum quota of 60% cellphone respondents and 40% landline respondents, with additional minimum quotas by time zone within region. Landline and cellular telephone numbers are selected using random-digit-dial methods. Learn more about how the Gallup U.S. Daily works. Seventy-four percent of U.S. adults say trade represents \"an opportunity for economic growth through increased U.S. exports.\" Seven in 10 Americans continue to say it is very important for adults to have a degree or professional certificate beyond high school. Blacks and Hispanics are more likely than whites to say it is very important. Nebraskans agree that early childhood care and education is very important to children's success later in life, but many are concerned about the availability and affordability of high-quality care in their state. A majority of Americans view higher education as available to anyone in the U.S. who needs it, but a minority see it as affordable. Hispanics are more optimistic than other races and ethnicities about availability and affordability. A recent Lumina Foundation-Gallup study shows that in 2022, Hispanic students enrolled in a post-high school program in the U.S. were more likely than any other race or ethnicity to feel discriminated against. May 2, 2016\n\nGallup  https://news.gallup.com/poll/191255/americans-buy-free-pre-split-tuition-free-college.aspx\nGallup World Headquarters, 901 F Street, Washington, D.C., 20001, U.S.A\r\n            +1 202.715.3030 ",
    "title": "\r\n\tAmericans Buy Free Pre-K; Split on Tuition-Free College \r\n",
    "datetime": "2016-05-02",
    "url": "https://news.gallup.com/poll/191255/americans-buy-free-pre-split-tuition-free-college.aspx"
}