{
    "text": "PRINCETON, NJ -- The federal poverty threshold for a family of four is just under $24,000; however, Americans believe such a family unit living in their community needs more than double that -- $58,000, on average -- just to \"get by.\" That estimate reflects 29% of Americans saying these families need up to $50,000 in annual income, 47% saying they need between $50,000 and $99,999, and 10% saying they need $100,000 or more.  The current estimate, from Gallup's April 11-14 Economics and Finance poll, is only a bit higher than what Gallup found six years ago, in 2007. At that time, Americans estimated that the smallest amount a family of four needed to get by in their community was just over $52,000. The poll updates a long-standing Gallup question -- first asked in the 1930s -- about the minimum amount per week a family of four needed to get by. Minimum Income Is Relative Americans' perceptions of what it takes to get by may, to a large degree, reflect their own lifestyles, rather than an objective assessment of local living costs. This is evident in the strong correspondence between respondents' estimates and their own household incomes. Adults in households earning less than $30,000 think it takes an average of $43,600 to get by. However, the estimate rises to $55,100 among those earning between $30,000 and $74,999, and to $69,400 among those making $75,000 or more. Easterners and Suburbanites Report Highest Income Requirements Residents of the East have the highest estimate by region of what it takes to get by: $68,900. Southerners have the lowest minimum income estimate, at $50,300, followed by Midwesterners, with $54,500, and Westerners, with $61,800. Yet, despite this strong skew, Easterners are only slightly more likely than those in other regions to report having high annual incomes. About one-third in the East (34%) say they make $75,000 or more annually, compared with just under 30% in every other region. Another factor strongly related to perceived income needs is the size of one's community. Suburbanites perceive it takes nearly $75,000 in annual income for a family of four to get by. That's roughly 50% more than the $50,100 that residents living in small towns or rural areas estimate is necessary where they live. Similarly, the estimate of adults living in urban areas -- either big or small cities -- is $53,800. However, suburbanites also report making significantly more in annual income than those in cities or in towns and rural areas. Forty-four percent of those in the suburbs report earning $75,000 or more, compared with about a quarter of city and rural dwellers.  Bottom Line At $58,000, Americans' perceptions of the amount it takes just to get by in their community is close to the national median household income, but well above the poverty line. Having enough to get by appears to be particularly challenging in the East, whose residents give a significantly higher average estimate of what it takes to survive. And while people may gravitate to areas that provide the lifestyle they can best afford, suburban life -- with its heavy emphasis on single-occupancy detached homes, auto-based transportation, and relatively well-off residents -- may also be less hospitable for those whose incomes fall into the $30,000 to $60,000 category. Results for this Gallup poll are based on telephone interviews conducted April 11-14, 2013, with a random sample of 1,012 adults, aged 18 and older, living in all 50 U.S. states and the District of Columbia. For results based on the total sample of national adults, one can say with 95% confidence that the margin of sampling error is ±4 percentage points. Interviews are conducted with respondents on landline telephones and cellular phones, with interviews conducted in Spanish for respondents who are primarily Spanish-speaking. Each sample of national adults includes a minimum quota of 50% cellphone respondents and 50% landline respondents, with additional minimum quotas by region. Landline telephone numbers are chosen at random among listed telephone numbers. Cellphone numbers are selected using random digit dial methods. Landline respondents are chosen at random within each household on the basis of which member had the most recent birthday. Samples are weighted to correct for unequal selection probability, nonresponse, and double coverage of landline and cell users in the two sampling frames. They are also weighted to match the national demographics of gender, age, race, Hispanic ethnicity, education, region, population density, and phone status (cellphone only/landline only/both, cellphone mostly, and having an unlisted landline number). Demographic weighting targets are based on the March 2012 Current Population Survey figures for the aged 18 and older U.S. population. Phone status targets are based on the July-December 2011 National Health Interview Survey. Population density targets are based on the 2010 census. All reported margins of sampling error include the computed design effects for weighting. In addition to sampling error, question wording and practical difficulties in conducting surveys can introduce error or bias into the findings of public opinion polls. View methodology, full question results, and trend data. For more details on Gallup's polling methodology, visit www.gallup.com. Seventy-four percent of U.S. adults say trade represents \"an opportunity for economic growth through increased U.S. exports.\" The average age at which current U.S. retirees say they actually retired is now 61, up from 59 a decade ago and 57 in the early 1990s. Conversely, 37% of nonretirees expect to retire after age 65, up from 14% in 1995. The percentage of Americans who say they are spending less money than usual continues to drift downward, now at 41%, compared with at least 50% in 2009 and 2010. Twenty-six percent now say they are spending more and 32% the same. Gallup's U.S. Standard of Living Index climbed to 40 in April, the highest monthly average in the five years Gallup has tracked this measure. Americans' perceptions of both their current and future standard of living are at five-year highs. Public opinion on loosening restrictions is complex and shows that Americans want more than simple \"yes or no\" decisions from their leaders. May 17, 2013\n\nGallup  https://news.gallup.com/poll/162587/americans-say-family-four-needs-nearly-60k.aspx\nGallup World Headquarters, 901 F Street, Washington, D.C., 20001, U.S.A\r\n            +1 202.715.3030 ",
    "title": "\r\n\tAmericans Say Family of Four Needs Nearly $60K to \"Get By\" \r\n",
    "datetime": "2013-05-17",
    "url": "https://news.gallup.com/poll/162587/americans-say-family-four-needs-nearly-60k.aspx"
}