{
    "text": "Cho Mi-hak, 66, wanted to know how her son’s job was going, so she stole a glimpse at his mobile phone and the text messages he had been exchanging with friends and colleagues. Her son needn’t have worried about his privacy, however, as she could barely understand a word. “Gosh, I couldn’t wrap my head around some of the messages as they were laden with strange words, ones that appeared to be combinations of shortened words or hybrids of English and Korean that were beyond my apprehension,” she said. She later came to learn that Bepu meant “best friend”, Ah-Ah meant “Iced Americano”, Inssa was “insider” and Assa was “outsider”. In short, her son’s messages were littered with Konglish – hybridised words that mix Korean and English and are popular with the younger generation but largely incomprehensible to their elders. For the older generation, such words represent the butchering of a language that instils so much national pride that the anniversary of its alphabet’s creation is marked with a national holiday every October 9. At a ceremony on Saturday, to celebrate Hangul’s 575th birthday, Prime Minister Kim Boo-kyum said the government would lead the way in addressing the “corruption” of the Korean language. “But for Hangul, it would have been impossible for the country to rise to the ranks of the world’s top 10 economies and to grow as a digital powerhouse. It was also thanks to Hangul that K-pop and K-culture have become objects of love for people across the world,” Kim said. “The government will continue efforts to reduce the use of foreign words and jargon and to convert them into easy Korean words,” the prime minister added. While the prime minister referred to Hangul as a “global language”, critics pointed out that technically the Korean language is known as Hanguk-eo, or Woorimal, while Hangul is a system of alphabets – though many Koreans colloquially use Hangul to refer to both the language and its alphabet. Nam Mi-jeong, a linguist at the national Korean language institute said because the alphabet and the language were so interlinked, and so many Koreans used Hangul to mean the language anyway, that there was little point drawing a distinction between the two. The rise of K-pop and K-dramas, not to mention recent Netflix hits such as  Squid Game , have fuelled international interest in South Korean pop culture so much that the Oxford English Dictionary this year included 26 new Korean terms, including Hallyu (“the Korean wave”); mukbang, (a live-streamed video featuring a person eating a large quantity of food while talking to the audience); chimaek (the pairing of chicken and beer) and bulgogi (marinated and grilled shreds of beef or pork). Indeed, the dictionary has even added the term Konglish. But while the gatekeeper of the English language appears open to using foreign words, the feeling in South Korea – particularly among the older generation – is far from mutual. Many are fiercely proud of the Altaic language, which usually places objects before verbs and is widely praised by linguists for its scientific accuracy and convenience in the information technology age. Against the precision of Korean, Konglish just doesn’t cut it, they say. “Many young people simply ignore rules for spelling and forge new jargon and slang on a whim,” complained No Bo-kyun, 69. “Under these circumstances, what’s the point of celebrating Hangul Day as a national holiday?” Still, the country has a long way to go if it is to rid its legal and administrative documents and news media of words and hybrids loaned from other languages. Many of the English hybrids reflect the strong US military presence (the country hosts 28,500 American troops), while other words stem from Japanese, a legacy of the 1910-1945 period of Japanese colonial rule. One popular word in the local news media of late is widcorona, an approximation of “with corona” that reflects the lack of a “th” sound in Korean. This refers to the country’s plan to learn to live with the virus and return to normal in mid-November, when more than 80 per cent of the population are expected to have been vaccinated. Meanwhile, most shopping streets and department stores are decorated with signs written in English or French words, many of them misspelled, while instructions on vending machines are also often in English. 02:16 Squid Game drives boom in Korean lessons Kim Seoncheol, a senior official at the National Institute of Korean Language, said the phenomenon was being fuelled by young people on social media. “They think it’s more fun and cool but it’s regrettable that they use absurd or incorrect English-based words instead of pure and beautiful Korean words”, he said, giving the example of young people using the English word “tension” when they really meant “joy”. “It’s not possible to force businesses to use the Korean language but I just hope Korean people may discard their reckless use of foreign words and realise what treasures they have been bequeathed from their ancestors in the form of a beautiful language and perfect alphabets,” he said. And it’s not just the older generation struggling with the constantly evolving memes and vocab. “I’m in my mid-20s but even I sometimes can’t follow what is being spoken by teenagers,” said Hyun Ye-rim, 24. She gave as an example the word Banmo, a combination of the Korean word banmal – that means words without honorific endings – and the English word “mode”, to describe the practice of speaking informally. Still, she said the older generation shouldn’t worry too much. “I think we can just leave the young ones speaking the way they like because they do this to share a sense of comradeship among themselves,” she said. “They will eventually outgrow such words, as I quickly did.” 03:04 Win a jackpot or die: Netflix’s South Korean thriller ‘Squid Game’ becomes latest global sensation ",
    "title": "Amid Squid Game and K-pop, Seoul spots a challenge to its soft power: Konglish, a hybrid of Korean and English | South China Morning Post",
    "datetime": "2021-10-20T07:00:29+08:00",
    "url": "https://www.scmp.com/week-asia/lifestyle-culture/article/3152854/amid-squid-game-and-k-pop-south-korea-spots-challenge"
}