{
    "text": "While Korean hip-hop isn't at the same visibility level as K-pop, the 2015 Amoeba Culture Tour proved promise for its future touring endeavors. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin Thanks to the likes of PSY, Wonder Girls and Girls’ Generation, Korean pop is selling more music and holding more tours in overseas territories, including America. While Korean hip-hop isn’t at the same visibility level as K-pop, the 2015 Amoeba Culture Tour proved promise for its future touring endeavors. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news Dynamic Duo, Primary, Zion.T and Crush hit New York’s Terminal 5 to a crowd that wasn’t as culturally diverse as a typical K-pop concert — like VIXX’s show at the hall a few months earlier — but it was packed; it was nearly impossible to get a good view even in the the VIP floor. The stage was simple, but impressed with its towering LED screen-clad DJ booth towards the back. Korea’s DJ Friz opened the show with a set before Crush opened the show. The young rapper/singer got the crowd shrieking with his falsetto notes and body rolls. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tShazam Adds New 'Concerts' Section to Recommend Shows to Users\t\t\n\t\n\n\n\n\t04/03/2015 But the shrieks grew into roars when Zion.T joined Crush, setting off a string of collaborative stages that kept an energetic flow throughout the set along with the crowd on its toes as the two crooned through their smooth collabos “Two Melodies” and “Just.” Zion.T performed two tracks on his own — including a heartfelt rendition of “Yanghwa Bridge” — before he was joined by Primary in his mysterious robot helmet as the DJ/producer took over DJ Friz’s spot at the booth. Soon enough, Dynamic Duo’s Gaeko joined the duo for “Meet,” which led into DD’s Choiza joining for “? (Question Mark).” Even with slight mic and feedback issues, there was a new energy as the MCs traded verses and bounced around onstage. Dynamic Duo Reflect on 14 Years in K-Pop: Exclusive Q&A Dynamic Duo eventually closed out the strong setlist with a half-dozen of their own hits (including “BAAAM,” “Go Back” and “Fireworks”), inspiring chants, hollers and shouts from crowdgoers. But the show’s encore brought every act on the bill out to return to perform DD classic “Friday Night” in what was undoubtedly the most fun and memorable performance of the night. There wasn’t a flashy stage setup and the artists barely interacted with the audience in English — talking to them more or less only in Korean in between songs — but fans were no less turnt up. Korean hip-hop may not have the gloss and high-flying choreography like K-pop boy bands, but the Amoeba Culture crew proved that they could get a crowd just as pumped by including aspects of rarely seen collaboration stages.  Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "title": "Amoeba Culture Tour Indicates Bright Future for Live Korean Hip-Hop in America: Review | Billboard – Billboard",
    "datetime": "2015-04-04T00:59:34+00:00",
    "url": "https://www.billboard.com/music/music-news/amoeba-culture-tour-new-york-review-6524135/"
}