{
    "text": "Amorepacific will sharply reduce the number of its offline stores in China, which once reached 610. The cosmetics company recently decided to cut the number of its offline stores in China by more than 100. Early this year, it decided to close down up to 90 stores, but the figure was expanded following the COVID-19 outbreak. The company’s move was prompted by its worsening business performance. In the second quarter of 2020, its sales and operating profit fell 24 percent and 60 percent, respectively, according to the company’s earnings announcement. In particular, its overseas business swung to negative territory with sales plunging 21 percent to 405.4 billion won. Industry insiders put the blame for Amorepacific's poor performance on its excessive offline expansion in China. Innisfree has been posting negative growth since 2017. The brand recorded 767.9 billion won in sales in 2016, and saw its sales sink to 642 billion won in 2017, 598.9 billion won in 2018, and further to 551.9 billion won in 2019. \"Amorepacific has sought to penetrate the Chinese market with low- and medium-priced brands with Innisfree at the front and center, and ramped up its offline portfolios,\" an industry watcher said. \" Innisfree faces difficulties in the Chinese market as Chinese mid- and low-priced brands have become more competitive and consumer sentiment has weakened due to the spread of COVID-19.\" According to Amorepacific, the number of offline stores in China reached 608 in the third quarter of 2019, but the figure dropped to around 570 in the second quarter of 2020. It will be cut to the upper 400 range by the end of 2020. Meanwhile, sales of Amorepacific's flagship brand Sulwhasoo are growing via online channels in China, suggesting a possible rebound in China in the future. Sulwhasoo attained positive results at the June 18 special shopping event in China, in the first half of the year, by expanding sales of high-priced anti-aging products. Based on this, Amorepacific’s online sales of luxury brands in China grew more than 70 percent in the second quarter. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Amorepacific to Sharply Reduce Number of Offline Stores in China - Businesskorea",
    "datetime": "2020-08-04T14:42:27+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=50003"
}