{
    "text": "All Headlines North Korea Sports Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies URL is copied. By Shim Sun-ah SEOUL, Sept. 15 (Yonhap) -- An annual festival showcasing the Korean Wave, ranging from K-pop and TV dramas to traditional culture and food, will kick off in Seoul this month, organizers said Thursday. The 2022 K-Culture Festival will take place at Gwanghwamun Square in central Seoul and the Seoul Sports Complex in the Jamsil district of the capital from Sept. 30 to Oct. 8, the Ministry of Culture, Sports and Tourism and its affiliated private Korean Foundation for International Cultural Exchange (KOFICE) said. Under the slogan, \"Into The-K,\" the third edition of the festival will give fans of \"hallyu,\" or the global boom of Korean pop culture, the opportunity to explore a planet of hallyu called The-K. This image provided by the Ministry of Culture, Sports and Tourism shows a promotional poster for the 2022 K-Culture Festival set to run from Sept. 30-Oct. 8, 2022, in Seoul. (PHOTO NOT FOR SALE) (Yonhap)  In celebration of the eve of the festival's opening, a \"calligraphy croquis\" performance by creator and armless painter Seok Chang-woo, as well as traditional Korean and classical music performances, will be held at a square inside Gyeongbok Palace, the main palace during the Joseon Dynasty (1392-1910), at 7 p.m. on Sept. 30. The festival will open Oct. 1 with an event titled \"The-K drama concert,\" in which a stage musical composed of famous scenes and original soundtracks of various hit Korean TV dramas, including \"Jewel in the Palace,\" \"Itaewon Class,\" \"The Red Sleeve\" and \"My Liberation Notes,\" will be played. There also will be a talk session between producers of famous Korean dramas and their fans, as well as a performance of original soundtracks of some popular TV series by the artists who sang the songs, including Paul Kim and Kyuhyun, a vocalist of leading K-pop boy group Super Junior, as part of the opening event. The highlight of the festival will be a K-pop concert at Olympic Stadium on Oct. 7 featuring NCT Dream, STAYC, XG and Blank2y. Discussions are under way with Ive, Monsta X and Cravity to include them in the lineup, according to the organizers. Officials said the concert will accommodate about 35,000 to 40,000 people and that admission will be free but will require registration via Interpark, a domestic online reservation service. The festival has established a joint music awards show called \"The-K Billboard Awards\" with U.S. Billboard for the first time in South Korea to highlight the global popularity of K-pop artists. Winners will be chosen mainly based on their Billboard rankings and honored during an online ceremony to be held during the festival period. There also will be chances for Korean pop music and drama fans to communicate with one another. During \"The-K Fan Fair,\" set to be held from Oct. 2-8 at Gwanghwamun Square and the Seoul Sports Complex Auxiliary Stadium, visitors will be offered a chance to experience Korean food, fashion, cosmetics products, games, webtoons and craftwork. Rising K-pop group The Boyz will hold a free meet-and-greet event for its fans on Oct. 2 as part of the festival program at the auxiliary stadium. Four smaller concerts to showcase other popular mainstream K-pop, indie and hip-hop musicians, as well as, DJs will also take place at the Gwanghwamun and Jamsil areas between Oct. 3 and Oct. 8. They include Pentagon, Brave Girls, CIX, VIVIZ, JK Kim Dong-wook, Sunwoo Jung-A, 10cm, The Quiett, Raiden and Ginjo. Audiences of the meet-and-greet event and four concerts will be chosen in a lottery among applicants, according to the organizers. There will be a street parade themed on the Korean culture on Oct. 8, the last day of the festival, in Seoul's city center. Some 2,000 citizens and art troupe members will march along a 2.6-kilometer-long section linking Jongno to Gwanghwamun Square during the parade. For overseas hallyu fans, the festival will be streamed live through its official YouTube channel. \"We began this festival to provide 'hallyu' fans all over the world with a chance to fully experience the Korean Wave when they visit South Korea this time of year every year and make them have great expectations,\" Kim Jae-hyun, chief of the ministry's content policy bureau, said during a press briefing held at the government complex in Seoul to promote the festival. \"We hope it will grow to be an internationally renowned festival like Britain's Edinburgh Festival and the Carnival of Brazil.\"  https://youtu.be/K5w3h-FKomg sshim@yna.co.kr\n(END) All News National North Korea Economy/Finance Biz Culture/K-pop Sports Images Videos Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies Korea in Brief Useful Links Festival Calendar Weather Advertise with Yonhap News Agency ",
    "title": "Annual K-Culture Festival to showcase 'hallyu' | Yonhap News Agency",
    "datetime": "2022-09-15T15:14:02+09:00",
    "url": "https://en.yna.co.kr/view/AEN20220915005400315"
}