{
    "text": "Sections The bad boy chef and author weighs in on Americans’ late-arrival to the glorious delights of food culture Ron Rosenbaum It won’t be surprising if cultural historians look back on the first two decades of this century as The Era of Crazed Oral Gratification. I’m speaking of the fetishization of food, of cooking and eating, of watching other people cooking and eating, that has become omnipresent across all platforms, all media, all screens and all palates in our great nation. “Top Chef,” “MasterChef,” “Cake Boss,” the entire Food Network. Travel shows that are mainly about watching foreign people eat foreign food. Barbecue madness. Raw and locavore. The taco truck as the new gourmet temple, Artisanal Whole Foodism, fonio as the next quinoa (don’t tell me you didn’t know about fonio!). Along with all of this has been the transformation in the status of the chef from behind-the-scenes pot-stirrer to culinary rock star. And in this particular cultural revolution the original rock star, the Elvis of bad boy chefs, is Anthony Bourdain. He achieved his breakthrough with a sensational book called Kitchen Confidential, a surprise worldwide best seller about the frenzied, obscenity-laced, sex-and-drug-fueled back-burner ballet of tattooed pirates who brandish spatulas like swords. He went on to be a fixture on the Food Network, on “Top Chef,” paired with domestic goddess Nigella Lawson on “The Taste,” while somehow maintaining a globe-trotting food and travel show on CNN called “Parts Unknown.” When he arrives for our lunch at Ristorante Morini, a stylish but understated Manhattan restaurant run by a chef friend of his, Bourdain looks a lot less funky and downtown than in his youth. He’s a large, husky man with the suave, silvery look of a KGB hit man. Perhaps the KGB vibe is not accidental. Before our appetizers arrive we’re deep into a conversation about our mutual interest in espionage lore and he’s telling me about the time he slept with the daughter of one of the most notorious KGB defectors in cold war history, Anatoliy Golitsyn. “Golitsyn’s daughter....Lesbian....Beautiful, incredibly beautiful. Object of just insane, obsessive love by many women at Vassar,” he claims. “She died of an OD.” It’s this kind of acquaintance with the dark side that gives Bourdain, a former heroin addict himself, his bad boy reputation. His post-Vassar career included a stint at the CIA—not the one in Langley but the prestigious Culinary Institute of America—and then some wild summers at Cape Cod lobster trap restaurants, a dive into the downtown depravity of SoHo kitchens, addiction, recovery and the launch of the restaurant he’s most associated with, Les Halles, an old-fashioned French workingman’s place that grew to be a worldwide chain and still serves a great cassoulet in its original location on Park Avenue in New York City. And then the book. This is the other side of Bourdain: the serious writer. And the other side of his signature gonzo literary style is something that has been less recognized: Kitchen Confidential is one of the few books in recent American literature to capture the communal ecstasy of Work. American writers rarely write about work anymore. Not tech work, quant work, digital work, but real work, manual work, crew work, often skilled but sweaty. Bourdain’s depiction of the kitchen crews he worked on, their mad camaraderie and the kind of inspired improvisational feats of high-heat athleticism they performed are tours de force. They reminded me of the early sequence of Theodore Dreiser’s great novel An American Tragedy, where a naive kid gets his first job as a hotel bellboy and Dreiser captures the adrenaline-fueled world of the backstairs hotel hierarchy. I try out my theory about writing and work on him. “Look,” he replies, “I didn’t mean to do it, but in some way I think the book gave voice to a certain strata of working cooks who were not ever going to be stars, they weren’t going to end up on TV. But over the years I’ve seen a rise in their self-esteem and sense of self-worth. There’s a pirate camaraderie that I think was always there, but now maybe I helped put a name to. That could be a good thing or a bad thing. A lot of people like the book for the wrong reasons.” “What are the wrong reasons?” “A lot of people think it’s OK to get f--ked up and work. Kitchen Confidential was not a story about a particularly good or commendable career. It was my life; I wrote it in a way that made it sound like a lot of fun, but obviously it wasn’t. I think a lot of people tend to overlook that. It validates a lot of bad behavior.” “People responded to the joyousness, don’t you think?” Cooking, he says, can “develop this glorious culture that values certain things. Firemen have that same sort of thing—there’s us and f--k everyone else. Cop culture, people who are doing difficult things who are used to being under-appreciated....You develop a unit pride that allows you to transcend the overwhelming likelihood that the mission is doomed, OK?” OK! But how does he explain the massive audience for these shows, the desire to watch and salivate over others making food. He has an interesting theory: homesickness. “There are huge populations of people who move from the country to the city who, for them, I guess the Food Network is nesting. It’s evoking a family life, a kitchen table that they probably never had, or maybe only had briefly. I think that’s an international thing. But now I don’t know because people don’t really cook on TV anymore. There’re very few shows where they actually dump and stir. Now it’s doing stuff like having contests and...even the ones where they’re actually cooking, it’s more about interpersonal drama, like a reality show. Look, it’s a mystery to me. “I mean, I like watching really good food porn,” he continues. “Beautiful food that I know what it is, I know what they’re making, or I’m curious about the culture it’s coming from. I could watch that all day. I like watching food porn, I like making food porn for people who are really all about the food and learning about food or imagining about food.” But not Instagramming food. He has strong feelings about the craze of Instagramming dishes that has taken over social media. “Chefs bitch about it when it’s going on in their restaurants,” Bourdain says, “yet when they go out to dinner, they’re taking pictures of everything. And any notion that that’s sharing? It’s bullshit. It’s about making other people feel bad about what they’re eating. And a certain knowledge that what you’re eating is more interesting.” He has a theory about this I hadn’t considered. That the whole seismic food culture shift isn’t American superficiality but the New World learning what the Old World has known for centuries. “We’re just catching on,” he says. “We are changing societally, and our values are changing, so that we are becoming more like Italians and Chinese and Thais and Spaniards, where we actually think about what we’re eating, what we ate last night, and what we’re considering eating tomorrow. When I grew up in the ’60s, we’d go to see a movie, then we would go to a restaurant. And we would talk about the movie we just saw. Now, you go right to dinner and you talk about the dinner you had last week and the dinner you’re going to have next week, while you’re taking pictures of the dinner you’re having now. That’s a very Italian thing. A lot of the sort of hypocrisy and silliness and affectation of current American food culture is just fits and starts, awkwardly and foolishly growing into a place where a lot of older cultures have been for quite some time.” Along with that, he says, is the evolution of the American palate. “As a general statement, our palates are changing. We’ve seen a few really big moments just in the last 30, 40 years. The moment Americans decided that raw fish was desirable. Huge! Nothing could be more repulsive to the traditional American table than raw fish. And yet suddenly, very quickly, we all wanted it. It doesn’t really matter why—whether it was because we saw Sarah Jessica Parker eating it on TV or it was just brightly colored, or we were drunk. Whatever. Suddenly now we like it.” And there’s the realm beyond raw—the one he calls “the funk zone, the rot zone.” “One of the most serious things happening now is people like Korean food now. Clearly that funk zone, the rot zone, the kimchi zone people have learned in their lifetimes to like. People are learning to like liver and kidneys. They’re learning to enjoy textures that would have been profoundly repulsive to them earlier in their lives.” “What kind of textures?” “Rubbery, chewy, cartilagey, fatty, tendon, jellyfish, pig’s tail, pig’s ears. Very hot item on menus now, pig’s ears.” “Pig’s ears? Is that true?” “Yeah, serious hipster cred. And I think another huge thing is how spicy they’re willing to accept their food. We have entered a new zone of true scaldingly, spicy, hot food.” “Do you think there are tastes that we have not yet gotten to, that are still awaiting us?” “Well, we’ve embraced umami [the Japanese term for their version of the savory and pungent funk zone] in a big way. Lot of chef research going on in that subject. And people like their sushi older.” “Whoa, wait a minute. Sushi older?” “Lots of people have begun to understand that sushi has almost nothing to do with freshness. It’s all about the sweet spot during its decay.” It’s a great line, “the sweet spot during its decay.” But it doesn’t make me want to run out for aged raw mackerel. “I think we’re reaching our human potential, food-wise.” He conceded in one of his later books, No Reservations, that he reached his limit when he agreed to share rotting shark innards with the locals in Iceland. Even as he speaks of it a shadow of horror crosses his face. I ask him if he thinks the revolution or obsession we’re going through with food is as meaningful as rock ’n’ roll, or psychedelic mind expansion, or various spiritualities. Is it a genuine cultural revolution or just a wave of self-indulgence? “It is powerful,” he says. “What it does have something in common at its best with rock ’n’ roll, with great rock ’n’ roll: There’s a sense that somebody’s talking to you. You used to get an old 331⁄3, you’d listen to the music and if it moved you, then you’d go, ‘Wow!’ What else were they trying to say to you? And you’d pore over the cover and the back liner and say, ‘I want more. Someone’s talking to me and I want to make sure I understand.’” Bourdain sounds like he’s describing a consciousness raising, an expansive way of connecting more deeply with other people. He’s almost evangelical about it. “The little moments that I have regularly in places like Saudi Arabia, Palestine, Libya, Borneo, Barcelos in Brazil, Liberia, the Congo—the moment they’re looking at you and you put your hand in [a repugnant-looking offering] and you eat and you experience that thing with them. You share an intimate moment. You can’t say, ‘No, it’s OK. I’ll pass.’ If you blow that moment, it’s done. They’re not telling you the interesting thing they might have said afterwards. Because you’re rejecting everything they love. You’re rejecting their mom. It’s a simple thing. But openness to that, simply a willingness to say, ‘I’ll have that; I’m interested. Wow, where’d you get that?’ Then people tell you.” For someone who comes across a bit like a wise ass cynic in his books, someone who might scoff, Bourdain offers what seems like a genuinely idealistic take on it all: the spiritual globalism, you might say, at the heart of the food frenzy culture. *** The food we were eating was simple but perfect. For the record Bourdain ordered terrine and Garganelli, a classic pasta Bolognese, while I had that as a side dish and chicken as my entree. I almost never order chicken, finding it almost always boring, but it was probably the best chicken I can recall having, uncomplicated but flawless. “I can’t tell you how excited I was to eat this,” he says gesturing to his pasta. “A properly sauced Bolognese out of even a chipped bowl with a hunk of bread, I could have wept with joy. Because it’s a simple good thing. Like ‘Jumpin’ Jack Flash’ or sex, it’s good, it will always be good.” “What do you think of restaurant culture these days? Has it gotten more civilized or has it gotten too ridiculous?” “It’s better because the inmates are running the asylum now. In my day you had to convince somebody. Let’s say you were a talented kid, over eight years you worked your way up to sous-chef; ten years you became chef de cuisine at a good restaurant with a reputation. Based on that reputation and your experience, you were able to talk some credulous investor into fronting you a million dollars to open up a brick-and-mortar place somewhere, hopefully in a good location, where you had maybe a 10 to 20 percent chance of ever making a dollar. Now though, a talented kid, maybe you worked at a few good restaurants for a while but you have an interesting background—maybe mom was Korean, dad was Mexican, you grew up in Koreatown in L.A. with a Mexican neighborhood next-door. You borrow 50 grand, get yourself a food truck, go out and make interesting food. People love it, you spread the word over social media, then you get four trucks. Roy Choi now has five or six restaurants and a hotel. He started out with a truck making Korean tacos. “A lot of old-school guys complain about this—you’re not paying your dues. That’s the downside. The upside is interesting people with something to say and a unique worldview can actually get their name out there and open a place with relative ease compared to the way it used to be.” I asked him about his most remarkable experiences in his “Parts Unknown” show. “The Congo was far and away the hardest, the most difficult, the most frightening. You’re robbed or extorted or threatened twice a day. There are 29 different militias, all of whom are capable of spectacular violence and atrocity, but really the worst-case scenario is that the good guys show up. If the cops and the army show up, then you’re really f--ked. Then it’s time to really run. It was a gorgeous, heartbreaking place, excruciatingly difficult to shoot, but every minute of every day we knew we were telling a really important story that nobody else was telling.” Of course it’s not all unmixed fun. After all his tales of eating rotting shark, drinking pig’s blood, and the rot zone, he reveals the one thing he fears. It came when I ask him about my own bête noire: parasites. “Never had one.” “Really? How could that be? You must have like the most amazing immune system.” “Good stomach flora,” he agrees. “It’s been 14 years on the road, all over the world.” There is one, however, that he fears more than any other: “We don’t want Guinea worm, that’s something I really prefer to not have.” “I’ve never heard of Guinea worm.” “It’s a six-foot-tall, subcutaneous worm that travels around right under the skin layer. Pops its head out now and again. It drives you to the bathroom, you have an overwhelming need to bathe all the time. It used to be a huge killer in Africa. Jimmy Carter’s been very helpful in ameliorating that. In the old days, you’d stick a toothpick through it and try to reel the whole thing out without breaking it, which would cause this necrotic worm to rot in your skin, resulting in septicemia.” But he keeps at it, for one thing because he has a larger vision in mind. He’s a fanatic film buff and his “Parts Unknown” episodes give him the opportunity to indulge his directorial fantasies. This came up when he was complaining about food writers carping about the “golden hued Terrence Malick moment” that often appears in “Parts Unknown’s” treks through the wilds that Malick loves to film. “Are you a big Malick fan?” “Huge. One of the great joys of my life is being able [in “Parts Unknown”] to rip off these great films, many of which most of our audiences have never seen, but we know. So me and my shooters, we talk a lot about films we love, many of them very obscure, and how we’re going to just get that look. Often where we can get that look. Like we’ll go someplace to do a show; we’ll decide on the location after we’ve decided on the film we want to rip off. “[Directors] like Christopher Doyle, Wong Kar-wai, In the Mood for Love being a particularly good example. Shinya Tsukamoto’s sort of violent, ultra-violent Japanese work. Seijun Suzuki, early Robert Rodriguez, Terrence Malick we rip off a lot. Some of Stephen Soderbergh’s work as far as color values. Early Antonioni, we’ve ripped off shamelessly.” “And we’ve actually started getting like A-list Hollywood directors and cinematographers saying, ‘Can I come out and play with you guys? Like could I shoot an episode? I’ll do it for f--kin’ scale,’ which is great. I mean, I’ll tell you. I’m bragging—Darren Aronofsky called up.” Bourdain is living the dream. The true pirate life financed by Hollywood. And indeed it’s interesting to think of food as the center of a new artistic genre. It all comes together in a way with his tribute to rice culture and the ultimate rice culture film. His love of the simple beauty of rice culture is a deep one. He loves Vietnam and Cambodia, for instance. He’s even gone so far as to have sit-downs with former Vietcong and Khmer Rouge Cambodians. “This weekend I’m heading off for Vietnam. Love it. First love. It’s f--king beautiful. Any rice culture is beautiful.”\nAny rice culture? “It’s super-intricate. Just the irrigation systems, the level of cooperation with your neighbors. You need to manipulate the water levels, every little thing. Rice has something magical about it. Rice is an explanation for everything.” It dawned on me that “rice culture” embodies his celebration of communal work one finds all the way back in Kitchen Confidential. It figures in his conception of how he’d like his life to end. As our lunch concludes I ask my last question, the traditional question asked of chefs and death row inmates: “What would you like your last meal to be?” “Easy. Sukiyabashi Jiro in Tokyo. A sushi place. I’m eating 25 of them. Twenty-five courses in 22 minutes. So perfect.” “What makes it so perfect? “Did you see the film Jiro Dreams of Sushi?” “No.” “Watch the film and you will understand. It is an 88-year-old man doing the same basic 30 or 40 basic cuts of Edo-style sushi, meaning nothing innovative. Every night he’s been going to sleep for his entire life; how do I make that standard shrimp over rice better, better, better, better? “It’s about the rice. It’s an explanation of...everything. And sort of a tragedy and an inspiring...and also tragedy. The son’s 55—and they’re toasting the seaweed outside in the cellar—not yet trusted to take the helm! But it’s an extraordinary piece of work and really one of the most deeply satisfying perfect meals I’ve ever had. Stripped of everything, every nonessential ingredient. “You eat with your hands. You sit down, right in front of him, you look him in the eyes and pick it up and put it in your mouth. Two minutes later another thing goes down, you pick it up.” I like that, don’t you? “Rice is magical. Rice is an explanation of everything.”\b Get the latest Travel & Culture stories in your inbox. Ron Rosenbaum\n| READ MORE Ron Rosenbaum is the author of seven books of nonfiction, including The Shakespeare Wars: Clashing Scholars, Public Fiascoes, Palace Coups, and How the End Begins: The Road to a Nuclear World War III. An updated edition of his book, Explaining Hitler: The Search for the Origins of His Evil is being published by DaCapo/Perseus Books. Explore Subscribe Newsletters Our Partners Terms of Use © 2023 Smithsonian Magazine\nPrivacy Statement\nCookie Policy\nTerms of Use\nAdvertising Notice\nYour Privacy Rights\nCookie Settings © 2023 Smithsonian Magazine\nPrivacy Statement\nCookie Policy\nTerms of Use\nAdvertising Notice\nYour Privacy Rights\nCookie Settings ",
    "title": "Anthony Bourdain’s Theory on the Foodie Revolution | Arts & Culture|\n Smithsonian Magazine",
    "url": "https://www.smithsonianmag.com/arts-culture/anthony-bourdains-theory-foodie-revolution-180951848/"
}