{
    "text": "Home » Tech Watch » AR brings South Korea’s heritage sites to life The K-Culture Time Machine app provides remote experience over time and space for cultural heritage or relics with a 360-degree video, KAIST researchers say. South Korean researchers from the Graduate School of Culture Technology at KAIST have developed an augmented and virtual reality application to enable a \"smarter\" tourism. The app, called \"K-Culture Time Machine,\" was launched on iOS App Store in Korea on May 22 as a pilot service targeting the Changdeokgung Palace in Seoul, South Korea. The application provides remote experience over time and space for cultural heritage or relics with a 360-degree video, which can be accessed by installing a smartphone in a smartphone HMD device. Tourists can also search information on historical figures, places, and events related to cultural heritage. A 3D reconstruction of lost cultural heritage can also be experienced, researchers said. 🔥【Watch the Webinar】Silicon Labs Bluetooth Solutions：we will show customer how we can speed up their development process through the library from GitHub. Figure 1: 360-degree panorama image and video function screen of the K-Culture Time Machine. Smartphone HMD allows users to freely experience various cultural sites remotely. (Source: KAIST) For those who don’t have wearable HMD devices, mobile-based cultural heritage guides can be provided based on the vision-based recognition on the cultural heritages. Through the embedded camera in smartphone, the application can identify the heritages and provide related information and contents of the heritage sites. For example, in Changdeokgung Palace, a user can move inside the Changdeokgung Palace from Donhwa-Gate or the main gate, Injeong-Jeon or the main hall, Injeong-Moon or the main gate of Injeong-Jeon, and to Huijeongdang or the rest place for the king. A virtual 3D reconstruction of the seungjeongwon (Royal Secretariat), which no longer exists, is also shown of the east side of the Injeong-Jeon, according to the team. Figure 2: Through the smartphone HMD, a user can remotely experience cultural heritage sites and 3D reconstruction of cultural heritage that does not currently exist. (Source: KAIST)  You must Register or\n   Login to post a comment.  ",
    "title": "\n        AR brings South Korea's heritage sites to life - EE Times Asia    ",
    "datetime": "2017-06-13T01:00:00+00:00",
    "url": "https://www.eetasia.com/ar-brings-south-korea-heritage-sites-to-life/"
}