{
    "text": " Artificial electronic skin has been developed by a team of Korean researchers. The skin can detect the surface’s texture, temperature, pressure, and even its sound by copying fingerprints and even the internal structure of the skin. Since the skin has all the senses of a hand, it is expected to contribute to various sectors such as robots, artificial arms, prosthetic devices, wearable devices, medical examination and speech recognition. The Ulsan Institute of Science and Technology (UNIST) announced on Nov. 1 that a joint team led by Professor Koh Hyeon-hyup of the Energy and Chemical Engineering Division and professor Lee Heon-sang of Donga University has developed biomimetic electric skin that can play the roles of multi-function sensors and released it in the Oct. 30 edition of Science Advance. The electronic skin can detect micro-surface roughness which current touch sensors cannot. It can also catch even the subtle pressure and temperature changes that occur when water droplets collide, thanks to the coating of a curved surface, like a fingerprint. People can sense surface structures, temperature, and roughness while touching something with their hands. This is because the skin has a sensor that detects pressure, temperature and vibration. In particular, a unique microstructure inside the skin makes the touch sense sensitive. A structure of tiny, mutually-linked domes amplifies tactile signals and sends them to the sensor. What is more, fingerprints detect minute roughness while making a contact with a surface. The research team had micro domes formed on a side when processing polymer composite film. Then they placed two sheets of film so that convex parts engage with each other. They made micro structures engaged with each other like the inside of the skin. Finally, they completed flexible biomimetic electric skin by covering it with artificial fingerprints with a curved surface. “The newly-developed electronic skin is able to recognize voices more accurately than smartphones, since it can detect changes in vibrations made by sound,” said Park Jong-hwa, a research fellow who took part in the project as the first author. “This technology will help hearing-impaired people.” “The skin can recognize biometric information such as pulses that change according to skin temperatures,” said Kim Ma-ri, a joint first author and a master’s degree candidate at the Chemical Engineering Division at Donga University. “It can be used in the security and IoT sectors.” Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Artificial Electric Skin That Can Sense Sound - Businesskorea",
    "datetime": "2015-11-02T04:00:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=12711"
}