{
    "text": "“My grandmother was a tailor,” recalls Sonya Clark. “She was wonderfully strong, a little woman with a soprano voice and a shock of white hair. As long as I would sit and stitch with her, she would tell me stories about her life growing up in Jamaica.” And later, she says with a laugh, “Being a black woman growing up in the ‘70s, doing your hair is just something you do.” Those are personal takes on how Clark got interested in using textiles — and hair — for her own method of storytelling, assemblage art. There’s also a subsequent, more professional explanation: She was inspired by college courses and teachers when she attended Amherst College and the School of the Art Institute of Chicago and Cranbrook Academy of Art. The interweaving of stories is Clark’s forte. The 19 pieces in her exhibition “Sonya Clark: Material Reflex” (through Sept. 8) at the Craft and Folk Art Museum deploy techniques of embroidery, weaving and braiding with materials that include cotton thread and human hair, and objects related to apparel and grooming. PHOTOS: Arts and culture by The Times “There’s a real reflection on material in her work,” says Karen Derksen, curator of the show and director of the Winthrop University Galleries in South Carolina. “She really looks to the function and the symbolic aspect of material, and manipulates it in a way that transcends any traditional notions we have — like the C.J. Walker portrait where she’s created something so unexpected.” That unexpected portrait is 11 feet tall and hangs in the museum lobby. While it appears pixelated, “Madam C J Walker” consists of more than 3,000 black pocket combs, then carefully linked by small wire rings. Teeth have been strategically removed to create lighter areas. An African American born in 1867 to former slaves, Walker created a hair and beauty products business that made her the first self-made female millionaire in the United States. Not only did Clark find a product identified with hair care but, as usual, also something with multiple and layered associations. “These combs are made here in the U.S.,” says Clark, speaking from Richmond, Va., where she is chair of the Department of Craft/Material Studies at Virginia Commonwealth University. “Also, they’re stamped ‘unbreakable,’ which makes reference to C.J. Walker as this phenomenal woman. Combs are very gendered — I associate them with men — and as a successful entrepreneur she was walking in a white man’s world.” Clark acknowledges that Walker’s reputation is also problematic: “Some blame her for popularizing the straightening of African hair.” CRITICS’ PICKS: The best art in town Another portrait was created using the $5 bill. Using black cotton thread, Clark stitched Abraham Lincoln with an Afro, resulting in “Afro Abe.” She made two when Barack Obama began running for president, then 42 more when he won — to commemorate the 44th president. “First, he looks much better with an Afro,” Clark says, “and secondly it’s crowning the emancipator with the hair most associated with black liberation and black power.” calendar@latimes.com  It's a date Get our L.A. Goes Out newsletter, with the week's best events, to help you explore and experience our city. You may occasionally receive promotional content from the Los Angeles Times. Television Oct. 25, 2023 Image Oct. 25, 2023 Music Oct. 25, 2023 Music Oct. 25, 2023 Entertainment & Arts Oct. 25, 2023 Company Town Oct. 25, 2023 Television Oct. 25, 2023 Movies Oct. 25, 2023 Music Oct. 25, 2023 Subscribe for unlimited accessSite Map Follow Us MORE FROM THE L.A. TIMES ",
    "title": "Artist Sonya Clark weaves tales with textiles, hair at CAFAM - Los Angeles Times",
    "datetime": "2013-07-07T14:00:00",
    "url": "https://www.latimes.com/entertainment/arts/culture/la-et-cm-sonya-clark-20130707-story.html"
}