{
    "text": "Alive with creativity At CSB/SJU, artistic expression is a rich and diverse part of the campus experience. It's a part of our heritage. The unique experiences offered by our fine arts programming provide invaluable exposure to artists and performers across a range of genres. Excellent faculty, extensive facilities and exceptional programming position the art, music and theater departments at CSB/SJU among the best at liberal arts colleges. Schedule a Tour Request Information Apply Today The Fine Arts Series showcases professional artists who work with our students through workshops, master classes and even joint performances. The series brings national and even international touring artists to our stages with more than 20 annual performances and eight exhibitions. Upcoming Performances The art department offers a comprehensive visual program that embraces both traditional and contemporary approaches to art and includes courses in studio art, art history and art education. Art Department Art, Music and Theater Scholarships The music department, which is accredited by the National Association of Schools of Music (NASM), combines music training with a liberal arts education to prepare students for careers both in and out of music. We have graduates who are K-12 music teachers, professional opera singers, liturgical musicians, college professors and more. Music Department Art, Music and Theater Scholarships The theater program at CSB/SJU is ideal for students with inquiring minds who want to study theater in the broadest sense. Our students have the preparation required for acceptance into competitive graduate programs, and many go on to careers in theater. Theater Department Art, Music and Theater Scholarships The Literary Arts Institute (LAI) fosters creative writing, publishing, and interaction between students and writers. The LAI brings nationally recognized authors to CSB/SJU to speak and extensively mentor students. Additionally, the LAI encourages the artistry of fine letterpress through its partnership with the Welle Book Arts Studio and independent presses. Literary Arts Institute Welle Book Arts Studio OutdoorU provides environmental and outdoor education through classes, events and initiatives with the Abbey Arboretum, Saint John's University and the College of Saint Benedict. OutdoorU hosts Collegebound, an optional but very popular outdoor orientation program and learning experience for incoming first-year or transfer students. Students choose between the base camp trip, backpacking trip or canoeing trip and often report that this experience increased their self-confidence and helped them make new friends before arriving on campus. OutdoorU Collegebound at CSB/SJU In 1998, Saint John’s Abbey and University commissioned renowned calligrapher Donald Jackson to produce a hand-written, hand-illuminated Bible. We invite you to explore this work of art that unites an ancient Benedictine tradition with the technology and vision of today, illuminating the Word of God for a new millennium. The Saint John’s Bible Gallery is located on the lower level of Alcuin Library on the Saint John’s University Campus. The Saint John’s Bible Artist-in-Residence Richard Bresnahan and The Saint John’s Pottery engage students, apprentices and visiting artists in the work of artistic creation, discipline, and research and preparation of natural materials. These dynamic experiences are framed by questions of what it means to envision and create a sustainable lived system. Visitors are welcome in the studio to visit the gallery, purchase ceramics and take guided tours. Studio tours explore the cycles of clay processing and glaze development as well as preparation and firing of the Johanna Kiln each fall. The Saint John’s Pottery 37 South College Avenue St. Joseph, Minnesota 56374 320-363-5011CSB Campus Map PO Box 2000 2850 Abbey Plaza Collegeville, Minnesota 56321 320-363-2011SJU Campus Map Jobs at CSB and SJUMake a Gift Email the CSB and SJU Web CoordinatorNon-Discrimination StatementTransparency of Coverage800-544-1489 - Office of Admission ",
    "title": "Arts & Culture on the CSB+SJU Campuses – CSB+SJU",
    "url": "https://www.csbsju.edu/arts-and-culture"
}