{
    "text": "Hong Kong has long been considered one of East Asia’s most thriving financial and cultural hubs, thanks to its successful stock exchange, world-class food scene, and recent art boom. In 2017, CNN Travel even considered it to be the world’s greatest city. Over the past few decades, Hong Kong has established itself in the entertainment industry and has developed a unique cultural identity that transcends borders. The city has produced famous international film stars like Jackie Chan and Bruce Lee, and in the early 1990s, it produced an average of 400 movies per year. Its homegrown Cantopop music earned international acclaim and peaked in the mid-1990s. Its colonial past has made it a cultural fault line for Westerners, successfully blending Cantonese tradition with modern achievement. But its cultural vibrancy has started to dim under Chinese sovereignty, which has fostered an environment of growing political unrest, particularly over the last decade. In 2014, Hong Kong saw widespread pro-democracy protests, referred to as the Umbrella Revolution, in response to Chinese encroachment. Pro-democracy demonstrations have exploded sporadically over the past few years as China extends its political reach into Hong Kong—in 2019, protests erupted over a proposed extradition bill, and most recently, anger has mounted over a new national security law that has been used to crackdown on dissent. As political uncertainty grips Hong Kong, businesses, ex-pats, and creatives have begun to shift their focus elsewhere in Asia. Last month, The New York Times officially announced the relocation of its Hong Kong-based digital team to Seoul, citing the new national security law. Major global tech companies also reacted harshly to the new law, and short-form Gen-Z video titan TikTok announced it would cease operations in Hong Kong altogether. High-net worth investors have started mapping out their exit strategies, and on Wednesday, August 19, the U.S. officially suspended or terminated three bilateral agreements with Hong Kong, including certain reciprocal tax exemptions. As Hong Kong continues to deal with the fallout from the new national security law, forward-looking experts say South Korea may experience economic and cultural gain. “Undoubtedly there will be movements of personnel, especially in mass media,” John Lie, professor of sociology at the University of Berkeley, told VICE News. “And [South Korea] would very much like to be a major hub in East Asia.” Some of South Korea’s current success resides in its pop-culture empire. As Professor Lie highlights: “The attractiveness of the country is now bound up with the Korean Wave, also known as Hallyu, especially K-pop and K-dramas, and a sense of coolness.” South Korea has managed to leverage its pop-culture as a diplomatic tool. In 2019, South Korea’s soft power was ranked 19th in the world and the second in Asia, according to Soft Power 30, the annual index published by Portland Communications and the USC Center on Public Diplomacy. 2020 has shown more than ever the success of the “Korean Wave.” Bong Joon-ho’s Parasite won the Oscar for Best Picture—the first foreign-language film ever to do so. Dozens of K-dramas were released, and the enormously popular K-pop band BTS released a new album, which, according to Forbes, was the bestselling album worldwide this year. In total, public diplomacy group The Korea Foundation estimated that there were almost 100 million consumers of K-culture scattered across 113 countries in 2019. “In these times, having such a big fanbase is crucial,” Wantanee Suntikul, assistant professor at the School of Hotel and Tourism Management at The Hong Kong Polytechnic University, told VICE News. “Soft power talks to people by people. It is much more powerful nowadays because very few people still fully trust their government,” she explained. Suntikul noted that Korean pop idols BTS are at the forefront of South Korea’s cultural drive. “BTS is South Korea’s national treasure,” she explained. K-pop boy band BTS on February 21, 2020 in New York City. Photo: Cindy Ord / GETTY IMAGES NORTH AMERICA / Getty Images via AFP “They make South Korea shine globally—they are good boys, they appear to be very authentic and close to their fans, their message is about self-acceptation and parents love them.” “This unique combination brings both people and money to the country.” BTS alone has brought $4.65 billion of gross domestic product to South Korea in 2019 through the sale of albums and concert tickets, according to Forbes. BTS-mania has also brought a tourism boost to South Korea. “It's all about breathing the same air as the idols, and feeling closer to them,” Suntikul said. “This growth is obviously not only thanks to them, but they highly contributed to make South Korea cooler than ever.” South Korea registered a record number of around 17.5 million inbound visitors last year, an increase of 14 percent from 2018.  The state-run Korea Tourism Organization estimated that foreigners who traveled to the country to consume K-pop goods were spending an average of $1,007. In 2019, there were about 160,000 foreign students enrolled in South Korean higher education institutions, a continued increase from the year prior. South Korea’s cultural expansion has also helped boost its business profile. “Obviously K-culture helps to attract foreign business,” Hye Jin Lee, an assistant professor at the USC Annenberg School for communication and journalism, told VICE News. She explained that the attractiveness of South Korea resides in its geographical location, as well as in the stability of its governance. “South Korea’s government has proved its ability to manage crises over the past few decades: with North Korea, with the protests that lead to the impeachment of former President Park Guen-hye in 2016, and now with its strategies to contain COVID-19.” “Our economy has remained stable and that’s why businesses want to relocate there,” she added. According to a report by the Organization for Economic Cooperation and Development (OECD) released earlier this month, South Korea’s economy is projected to take the smallest hit from the coronavirus pandemic. According to the report, its GDP will fall by just 0.8 percent in 2020, compared to the global average decline of 7.5 percent. “South Korea also became a symbol of democracy in Asia, of peaceful protesting and of freedom of speech,” Lee added. “It gives a lot of confidence to foreign companies to relocate to South Korea. Compared to what’s happening in Hong Kong, the difference is striking”. By signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content. ",
    "title": "As Business Moves Away From Hong Kong, Will Seoul Become Asia’s New Culture Hub?",
    "url": "https://www.vice.com/en/article/akzq7b/seoul-becoming-asia-culture-business-hub-hong-kong"
}