{
    "text": "SEOUL, KOREA / ACCESSWIRE / December 26, 2020 / The first K-culture wave-based drama \"Pumping time (working title)\" will be produced which covers in detail of bitcoin, cryptocurrency, and block chain ecosystem. Since December 2020, various institutional investors are investing in bitcoin, which reached over $24,000. From 2021, Korea will institutionalize laws in order to deal legally in cryptocurrency at the exchange market. Next year is exciting because the cryptocurrency foundation in China will be a full-fledged digital Yuan. One of the major exchange markets in the US, Coinbase, promotes IPO, and Facebook will launch stable coin. The drama will cover in detail what are considered cons and truths in the cryptocurrency ecosystem and digital legal currency by governments. The drama is composed with 10 seasons total, and each season is composed with 20 episodes (30minutes), and will be on air in May next year. Full details can be found on www.kplay.net The drama will be edited in different ways such as special trailers (100minutes), regular broadcast, and theater version in order to make cryptocurrency easier for the public to understand as a standard drama. The drama aims to be recorded as the first drama which is produced by top stars and a top production team in the cryptocurrency field with interest and education. It aims to be a standard drama about cryptocurrency to people around the world including 2.5billion Facebook users, 250million PayPal users, and more than 100million Kakao Talk and Line users. People who have experience with cryptocurrency are over 100million. But, there are not many of them who can trade properly on the exchange market. The drama will be produced with fun and interest in order to easily know how to trade and use cryptocurrency. Since top Korean writers are already contracted to the production of other drama series, they are not able to make cryptocurrency productions right now. However, the main writer of \"Pumping Time\", Choi, Wan-kyu, studied and researched cryptocurrency and block chain since 2017, which means he is a cryptocurrency veteran among top Korean writers. The writer, Choi, Wan-kyu, produced \"All-in\" which made Song, Hye-gyo as a top star and \"Iris1\" which produced the most beautiful Korean actress Kim, Tae-hee. And also he produced \"Jumong\", \"Heo Jun\", \"General hospital\". They also produced \"Legend of Ambition\" which was watched by nearly the whole nation. \"Pumping Time (working title)\" is produced, planned, and fully invested by K-Play contents, Korean \"Jam stone\" film will conduct drama main producing, and global collaboration will be carried out by China and U.S productions. If there is any chance, the drama will introduce major exchange markets and coins, and try to give a Cameo role to coin founders. The reason the producers consider Korean dramas suitable for the cryptocurrency market is that the investment in cryptocurrency market is big enough to take 30% of the world market. The rapid legalized status backed by the Korean government who fully supports the content and cryptocurrency market, will lead to an interest in Korean content from people around the world. Because of Korean wave culture, a huge global audience feels connected to Korean culture without animosity, and is often addicted to Korean actors' acting and physical appearances. This means that watching a cryptocurrency drama may soon be a global act. Media contact Company: Kplay Contents (Youa Co., ltd)Contact: HenryE-mail: info@kplay.netWebsite: https://www.kplay.net/Telephone: +82-10-3668-0763Address: 15, Teheran-ro 82-gil, Gangnam-gu, Seoul, Republic of Korea SOURCE: Kplay Contents (Youa Co., ltd) View source version on accesswire.com: https://www.accesswire.com/622345/Asias-First-Top-Star-with-Bitcoin-Drama-out-Soon-Writer-Choi-Wan-Kyu-Starts-Filming-in-2021 ",
    "title": "Asia's First Top Star with Bitcoin Drama out Soon: Writer Choi Wan-Kyu Starts Filming in 2021",
    "url": "https://finance.yahoo.com/news/asias-first-top-star-bitcoin-163000756.html"
}