{
    "text": "In an ongoing series, NK News poses a reader’s question to a North Korean defector. This week a reader asks: have South Korea’s K-pop stars prompted a similar craze across the border? K-pop groups have grown much more popular in North Korea since 2012. But although bands often look glamorous, beautiful and frequently feature in big-budget music videos, North Koreans tend to pay more attention to the lyrics and the vocals, than to how the singers are dressed. North Korea is also a very patriarchal society, and the skimpy clothes worn bythe stars are often frowned upon by local audiences. In the DPRK, people who can afford to watch these kinds of videos are the ones with money. Therefore, it’s mostly adults who consume K-pop culture. Teenagers don’t usually have enough cash unless their parents are affluent, high-ranking officials. Under former leader Kim Jong-il’s leadership, people didn’t feel comfortable listening to any songs that sounded different from traditional and familiar trot songs – recognised as the oldest form of Korean pop music, and even when they listened to South Korean songs they often preferred older tunes to newer hits. But since 2012, South Korean songs have become increasingly popular amongst DPRK listeners, including K-pop classics such as Friend by Ahn Jae-wook, Private’s Letter by Kim Kwang Seok and For Love. More recently when the South Korean drama Sweet 18 became popular in the North, South Korean singer Jang Nara, who sang on the soundtrack, attracted a lot of attention in the DPRK. While I was still living in North Korea, my favourite K-pop song was Like Being Shot by a Bullet by Baek Ji-young. But since my mum didn’t like it, I couldn’t sing it at home. What’s clear is that North Korea’s younger generation has tastes that stretch far and wide, and they’re a big reason by K-pop singers have been getting more popular. You never know, North Korea’s teenagers might be dancing to EXID’s Up & Down at this very moment. But pop music isn’t the only South Korean cultural export beloved across the border: adults and teenagers alike are also big fans of the country’s soap operas and films. Dramas smuggled across the border have even been described as “cultural Trojan horses”, sneaking visions of the South into the tightly controlled North. Though the number of North Koreans watching South Korean TV has declined more recently because of crackdowns, it is still possible for some – including party officials and those with social capital – to watch them in secret. When it comes to the music featured in K-dramas, songs like Kal-muri by the famous trot singer Na Hoon-a are particularly popular. But North Korean teens prefer the catchy Bogoshipda (I Miss You) by Kim Bum-soo. In the DPRK dramas and films are all about making sacrifices for the leader. Even if the main character dies, they die for the leader. But across the border, characters are seen to make sacrifices for love, and often feature more relatable and realistic story lines, which is fresh and shocking to most North Koreans. ",
    "title": "Ask a North Korean: do you love K-pop too? | North Korea | The Guardian",
    "datetime": "2015-06-18T05:00:08.000Z",
    "url": "https://www.theguardian.com/world/2015/jun/18/k-pop-south-korea-ask-a-north-korean"
}