{
    "text": "Connecting talented and ambitious people in the world's greatest cities, our mission is to be a top quality institution. Join our more than 40,000 students studying in hundreds of programs on six continents all around the globe. Our world-class students, faculty, and scholars expect high achievement in pursuit of engaging the world's diverse challenges. An institution without walls, we draw spirit from our cities and their famous cultural institutions and professional opportunities. Being at the forefront of their disciplines, our faculty shape the understanding of an enormous range of academic fields. Connecting talented and ambitious people in the world's greatest cities, our mission is to be a top quality institution. Join our more than 40,000 students studying in hundreds of programs on six continents all around the globe. Our world-class students, faculty, and scholars expect high achievement in pursuit of engaging the world's diverse challenges. An institution without walls, we draw spirit from our cities and their famous cultural institutions and professional opportunities. Being at the forefront of their disciplines, our faculty shape the understanding of an enormous range of academic fields. Study Evaluates Effect of Middle School Versus a K-8 School on Academic and Psychosocial Outcomes Students who attend a middle school compared to a K-8 school are likely to have a lower perception of their reading skills, finds a new study by NYU Steinhardt School of Culture, Education, and Human Development. The study, published online in the Journal of Early Adolescence, evaluates the effect of attending a public middle or junior high school versus a K-8 school on 8th graders’ academic and psychosocial outcomes. “Early adolescence is an important time for youth, who are undergoing a variety of biological, psychological, and social changes,” said study author Elise Cappella, associate professor of applied psychology at NYU Steinhardt and director of NYU’s Institute of Human Development and Social Change. “Students’ self-perceptions of academic competence are critical in early adolescence, as they contribute to the development of their identity and their engagement with school.” In the 19th century, most early adolescents attended elementary schools (grades 1 to 8) before moving on to high schools (grades 9 to 12). It wasn’t until the early- to mid-20th century that middle schools (grades 6 to 8) and junior high schools (grades 7 to 9) emerged to meet the unique academic and social needs of early adolescents. Today, 90 percent of U.S. public school students attend a middle school or junior high school. Although these schools were developed to suit the needs of early adolescents and prepare them for high school, evidence suggests that they may not, in fact, do so. Studies show that the social and academic contexts of middle grade schools may not be well-aligned with early adolescents’ developmental needs for autonomy, feeling connected to others, and feeling competent. In fact, compared with elementary schools, middle grade schools often have more students per grade, lower levels of student autonomy, less positive teacher-student relationships, and more competition and less cooperation among students. Research also shows mixed results on the academic impact of middle grade schools versus K-8 schools, with some studies showing a benefit for K-8 schools. Teachers in middle and junior high schools may differ as well, both in their knowledge of whole child development and their experience of professional support and satisfaction. Taken together, these differences may lead teachers to be less responsive to student needs, which can have consequences when compounded with other characteristics of middle school. For instance, a decrease in teacher-student closeness or school safety, or an increase in academic competition among peers, may lead to lower self-esteem and higher anxiety and loneliness among students. The current study sought to understand the impact of school type – middle school, junior high school, or K-8 school – on the range of early adolescent outcomes that matter for success in high school and beyond. The researchers used the Early Childhood Longitudinal Study, Kindergarten Class 1998-99 (ECLS-K), which followed a nationally representative sample of kindergarteners from the 1998-1999 school year through 2006-2007, at which time the majority of participants were enrolled in 8th grade. The current study tracked 5,754 students from 1,712 U.S. schools. The dataset included measures of students’ academic competence, specifically test scores in math and reading, as well as psychosocial outcomes. They measured students’ beliefs about themselves, both broadly and about their academic abilities, as well as their social adjustment in school, including their feeling of belonging and attachment, academic values, and peer support. The researchers also collected information reported by teachers and parents. Cappella and her colleagues found that attending a middle or junior high school negatively impacted certain measures of beliefs about students’ academic abilities. The most dramatic effect was measured in students attending middle schools; they were more likely to have a negative view of their reading skills and interest levels. The researchers also saw negative effects of middle and junior high schools on teachers’ views of student reading and writing competence. No difference was detected in students’ test scores. The researchers said their study indicates that middle grade schools are neither the problem nor the solution but instead that schools serving early adolescents could be strengthened. “This may involve paying attention to the instructional and social environment, teachers’ expectations of student achievement, and students’ self-perceptions as they progress to and through middle and junior high school,” Cappella said.  “Strengthening middle schools may also involve increasing our understanding of what kinds of schools enhance growth as well as how school can be leveraged to support students’ development and enhance the odds that youth will approach high school with the competence to succeed.” In addition to Cappella, study authors include Kate Schwartz, Jennifer Hill, Ha Yeon Kim, and Edward Seidman of NYU. The research is supported by the Spencer Foundation (#201300077). About the Institute of Human Development and Social Change (@nyuIHDSC)\nThe Institute of Human Development and Social Change (IHDSC) at NYU aims to stimulate research on children, youth, and families in the context of a rapidly changing social world. IHDSC brings together faculty from the social, behavioral, and health sciences, and is a joint initiative of the Steinhardt School of Culture, Education, and Human Development; the Wagner School of Public Service; the Faculty of Arts and Sciences; and the Office of the Provost. For more information, visit steinhardt.nyu.edu/ihdsc. About the Steinhardt School of Culture, Education, and Human Development (@nyusteinhardt)\nLocated in the heart of Greenwich Village, NYU’s Steinhardt School of Culture, Education, and Human Development prepares students for careers in the arts, education, health, media, and psychology. Since its founding in 1890, the Steinhardt School's mission has been to expand human capacity through public service, global collaboration, research, scholarship, and practice. To learn more about NYU Steinhardt, visit steinhardt.nyu.edu. ",
    "title": "Attending a Middle vs. a K-8 School Matters for Student Outcomes",
    "url": "https://www.nyu.edu/about/news-publications/news/2017/october/attending-a-middle-vs--a-k-8-school-matters-for-student-outcomes.html"
}