{
    "text": "An essential resource focused on visual art from a Black perspective, Culture Type explores the intersection of art, history, and culture  PAINTED NEARLY 50 YEARS AGO, Alma Thomas‘s ode to “Spring Flowers in Washington D.C.” set an artist record yesterday, topping more than $300,000 at Los Angeles Modern Auctions. Grounded in pink, the mesmerizing square canvas is a rhythmic composition of pattern and color. Nearly four hours after the Modern Art & Design Auction started on March 5, the painting came up for bid and garnered sustained attention. The estimate was $125,000-$175,000. Bidding began at $110,000 and more than a dozen bids were offered. A phone bidder bested the competition. The hammer price was $310,000. With the final price far exceeding the estimate, applause erupted in the room and the auctioneer announced the winning price was an auction record for a work by Thomas. Including fees, the painting yielded $387,500, and was the top lot of the auction. According to LA Modern Auctions, “Spring Flowers in Washington” has never been exhibited and was seen publicly for the first time at the auction preview. Thomas made the oil on canvas painting in 1969 and sold it to an African American college student who visited her home studio that same year. The California undergraduate bought the painting in installments and when he sent his final payment, Thomas had it boxed up and mailed it to him in San Diego. She enclosed a hand-written note in the package, closing with the following sentiment: “I hope you will love the painting. So many of my friends want to buy it. I am painting more and more.” “I hope you will love the painting. So many of my friends want to buy it. I am painting more and more.” — Alma Thomas, 1969 After going on to medical school, becoming a doctor, and settling in the Los Angeles area, the man who bought the painting died in 2012. His family, wishing to remain anonymous, consigned “Spring Flowers in Washington D.C.,” for sale at the auction. The letter from Thomas was included in the lot along with the painting. READ MORE about the provenance of “Spring Flowers in Washington D.C.” on Culture Type A painting sold at Doyle New York set the previous auction record for Thomas. “Carnival of Autumn Leaves” (1973) garnered $254,500 (including fees) on May 9, 2012. The title is fitting. A dense cascade of red leaves appears to be falling down the canvas against a ground of various tones of green. The painting is illustrated in “Alma Thomas,” the catalog accompanying the recent survey organized by the Frances Young Tang Teaching Museum and the Studio Museum in Harlem. The credit line indicates “Carnival of Autumn Leaves” is owned by Michael Rosenfeld Gallery in New York. CT READ MORE about artist resale rights/royalties in California TOP IMAGES: From left, Alma Thomas. | Photo by Courtesy Smithsonian American Art Museum; ALMA THOMAS, “Spring Flowers in Washington, D.C.,” 1969 (oil on canvas). BOOKSHELF\nAccompanying the exhibition organized by the Tang Teaching Museum and Studio Museum in Harlem, “Alma Thomas” features more than 125 vibrant, colorful paintings and works on paper, many published for the first time, a preface by Thelma Golden, scholarly essays, and responses to Thomas’s work by four contemporary artists. To further explore the life and practice of Alma Thomas, consider “Alma W. Thomas: A Retrospective of the Paintings,” published to coincide with a traveling exhibition organized by the Fort Wayne Museum of Art (1998-2000). An earlier catalog, “A Life in Art: Alma W. Thomas, 1891-1978,” accompanied a Smithsonian exhibition (1981–1982). ALMA THOMAS, “Carnival of Autumn Leaves,” 1973 (acrylic on cavas), set a record when it sold for $254,500 (including fees) at Doyle New York in 2012. SUPPORT CULTURE TYPE\nDo you enjoy and value Culture Type? Please consider supporting its ongoing production by making a donation. Culture Type is an independent editorial project that requires countless hours and expense to research, report, write, and produce. To help sustain it, make a one-time donation or sign up for a recurring monthly contribution. It only takes a minute. Many Thanks for Your Support. Name required Email required Website Click here to cancel reply.  Δ Do you enjoy and value Culture Type? Please consider supporting its ongoing production by making a donation. Culture Type is an independent editorial project that requires countless hours and expense to research, report, write, and produce. To help sustain it, make a one-time donation or sign up for a recurring monthly contribution. It only takes a minute. Many Thanks for Your Support. Culture Type® participates in the Amazon Services LLC Associates Program, an affiliate program designed to help sites earn modest commissions by linking to amazon.com.  When you make any purchase from Amazon, and the many independent vendors, small businesses, and booksellers that partner with Amazon, via a link from this site, Culture Type receives a minute percentage of its price. The program helps offset a small portion of the countless hours and expense required to research, report, write and produce Culture Type's content. Culture Type® is also an affiliate of Bookshop.org, whose mission is to financially support local, independent bookstores. Culture Type earns a nominal commission when you access Bookshop via a link on this website and/or make a purchase from one of Culture Type's book lists on Bookshop. © 2013-2023 Culture Type, LLC. All Rights Reserved. Culture Type® is a registered trademark of Culture Type, LLC., and is registered with the U.S. Patent and Trademark Office ",
    "title": "Auction Record: Alma Thomas's 1969 Vision of 'Spring Flowers' Yields More Than $300K - Culture Type",
    "datetime": "2017-03-06T05:43:42+00:00",
    "url": "https://www.culturetype.com/2017/03/06/auction-record-alma-thomass-1969-vision-of-spring-flowers-yields-more-than-300k/"
}