{
    "text": "Dermatology resident Shannon Zullo, MD, chairs the AMA Minority Affairs Section. Growing up in Navajo Nation ignited a desire to serve her community. National Doctors' Day is an annual observance held on March 30. This day honors the dedication, skill and unwavering commitment of physicians in providing high-quality health care to individuals and communities worldwide. National Physician Suicide Awareness Day, observed each year on Sept. 17, highlights the alarming rates of physician suicide and the need for greater support in health care. The private practice setting can be particularly rewarding for the freedom and other benefits it offers physicians, but it also has its share of challenges. Learn more. International Medical Graduates (IMG) Recognition Week, observed annually in October, is a time to honor the contributions of International Medical Graduates (IMGs) in health care. The AMA Update covers a range of health care topics affecting the lives of physicians and patients. Learn more about engaging residents in their education. Take on leadership opportunities at the local, state or national levels to represent medical students and address their concerns. Knowing which questions to ask during interviews can make a good impression with interviewers and give insight on your fit with a program. Recognizing Residents Week, an annual observance in July, offers an opportunity to acknowledge the commitment and contributions of medical residents. When and how should you study for your licensing exam during intern year? Three veterans of residency and the exam offer insight. Budget neutrality legislation discussion draft released by GOP Doctors Caucus co-chairs and more in the latest Medicare Payment Reform Advocacy Update. National Addiction Treatment Week underscores urgent need for comprehensive solutions to the overdose and death epidemic and more in the latest National Advocacy Update. As an AMA member, you can save up to $750 on a new Mercedes-Benz today. Drive in style with preferred savings when you buy, lease or rent a car. Download PDFs and access information submitted for consideration at the AMA House of Delegates Interim Meeting. The 2023 Specialty and Service Society Interim Meeting will take place Nov. 5 via a virtual platform and Nov. 11-13 in person at the Gaylord National Resort & Convention Center in National Harbor, Maryland. See how the CCB recommends changes to the AMA Constitution and Bylaws and assists in reviewing the rules, regulations and procedures of AMA sections. Apply for a leadership position by submitting the required documentation by the deadline. National Latino Physicians Day, observed annually on Oct. 1, is a day dedicated to acknowledging the contributions of Latino physicians to health care. Each September, the medical community celebrates Women in Medicine Month, a time to acknowledge and honor the significant contributions of women to health care. The 2024 American Medical Association Medical Student Advocacy Conference (MAC) will be held March 7-8, 2024. The final webinar in Sepsis Core Elements: CDC Webinar Series discusses the impact of sepsis education for health care professionals during onboarding. Register now. The AMA “Members Move Medicine” series profiles a wide variety of doctors, offering a glimpse into the passions of women and men navigating new courses in American medicine. On the move with: Avani K. Patel, who is a fourth-year medical student at the University of Mississippi School of Medicine in Jackson. AMA member since: 2015. What inspired me to pursue a career in medicine: I was always close to my paternal grandfather who was born and raised in India and lived his life as a farmer and philanthropist. Often, people called him the “man of miracles” due to his servant heart. What I remember most and what I will always keep close to my heart is this: Before he passed away, he told me to pursue a career in which I felt the joy he felt helping people. He always said losing yourself in the service of others is the key to happiness. That’s when I knew a career in medicine was perfect for me. How I move medicine: By striving to improve the culture of medicine—one of compassion. Creating a positive environment and empowering those around me is fundamental. If only I can put into words how significant it is to encourage talented individuals all around us—be it colleagues, patients, family, friends—to pursue and advocate for what they are passionate about. For me, it is advocating for patients and colleagues, serving as a leader, and exhibiting true community. Career highlights: Albeit early in my career, I have been fortunate with opportunities to demonstrate my passions for service and advocacy on both a local and national level having served as a regional executive council member in the AMA-MSS and currently serving on the AMA Ambassador Steering Committee and the Membership, Engagement, and Recruitment Standing Committee. In addition, I am currently serving my second term on the Board of Trustees of the Mississippi State Medical Association and on the Executive Council of the Central Medical Society. I also just completed a one-year term as the Southern Region Chair on the Association of American Medical Colleges Organization of Student Representatives Administrative Board, allowing me to serve as a voice on behalf of students for fifty-plus allopathic institutions and work to address physician burnout, wellness, advocacy, professionalism, and more on a national level. These experiences have provided me with insight on how I can play a central role in patient care outcomes and as a patient advocate. Advice I’d give to those interested in pursuing a career in medicine: Medicine is as difficult as it is rewarding, but never forget why you chose to pursue medicine in the first place; only then are we able to empathize with our patients and better treat them. Although the journey isn’t always glamorous, we are in a profession that is entrusted with serving our patients to the best of our abilities and expertise. That is a great honor and a privilege. How I give back to the community: By leading by example. When you are committed to producing quality outcomes with a positive attitude and encouraging a sense of unity, everything else will fall into place. Aspect of my work that means the most: Compassion in medicine is the most important aspect of my work. Earning the trust of patients and becoming their advocate is the most rewarding part as I believe it is fundamental to our shared humanity. One of my favorite quotes when I need a reminder is this one by Leo Buscaglia, “Too often we underestimate the power of a touch, a smile, a kind word, a listening ear, an honest compliment, or the smallest act of caring, all of which have the potential to turn a life around.” My hope for the future of medicine: My hope for the future of medicine is to be one of compassion, respect, and a sense of community for better patient care, more diversity, and a culture for positive change. I believe Maya Angelou said it best, “I’ve learned that people will forget what you said, people will forget what you did, but people will never forget how you made them feel.” My challenge for anyone pursuing medicine is to be the change for your patients with a servant heart. Visit MembershipMovesMedicine.com to learn more about other AMA members who are relentlessly moving medicine through advocacy, education, patient care and practice innovation, and join or renew today. The AMA promotes the art and science of medicine and the betterment of public health. Download AMA Connect app for\niPhone or\nAndroid The best in medicine, delivered to your mailbox ",
    "title": "Avani K. Patel: Improving the culture of medicine | American Medical Association",
    "url": "https://www.ama-assn.org/about/leadership/avani-k-patel-improving-culture-medicine"
}