{
    "text": "            Battle High School religion and English teacher Greg Soden spends hours each week listening to podcasts. With his headphones on in the grocery store, Soden plans meals for his family while learning about religion or current events or punk rock music. When he isn’t listening to a podcast, he’s producing one. In August, Soden created the Classical Ideas Podcast, where he converses with religious authorities, philosophers and scholars. Javascript is required for you to be able to read premium content. Please enable it in your browser settings. Supervising editor is Elizabeth Brixey: brixeye@missouri.edu, 882-2632. Greg Soden, a teacher at Muriel Williams Battle High School,tries to keep an open mind and constantly learn new things in order to effectively teach his students. Greg Soden, a teacher at Muriel Williams Battle High School,tries to keep an open mind and constantly learn new things in order to effectively teach his students. I'm currently on the graphics desk. I've also been an assistant city editor and a reporter on the community and education beats. You can reach me by email at oliviagarrett@mail.missouri.edu or on Twitter @_oliviagarrett.   Education editor \n573-882-2632 \nbrixeye@missouri.edu Success! An email has been sent to  with a link to confirm list signup. Error! There was an error processing your request. The Columbia Parents’ Digest is a new monthly newsletter to keep you in the know about K-12 education and raising kids in Columbia. Receive top local news and columns every morning. (View a sample.) Receive a roundup of the news of the day each evening. (View a sample.) Get the latest Mizzou, local preps and other sports headlines every day. (View a sample.) We're always interested in hearing about news in our community. Let us know what's going on! Success! An email has been sent to  with a link to confirm list signup. Error! There was an error processing your request. Receive top local news and columns every morning. (View a sample.) Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:       The Columbia Parents’ Digest is a new monthly newsletter to keep you in the know about K-12 education and raising kids in Columbia. Receive top local news and columns every morning. (View a sample.) Receive a roundup of the news of the day each evening. (View a sample.) Get the latest Mizzou, local preps and other sports headlines every day. (View a sample.)  Thank you . Your account has been registered, and you are now logged in. Check your email for details. Invalid password or account does not exist Submitting this form below will send a message to your email with a link to change your password. An email message containing instructions on how to reset your password has been sent to the email address listed on your account. No promotional rates found.   Secure & Encrypted Secure transaction.\nSecure transaction. Cancel anytime.  Thank you. Your gift purchase was successful!\nYour purchase was successful, and you are now logged in. A receipt was sent to your email. ",
    "title": "Battle teacher shares philosophy, culture, religion through podcasting | K-12 Education | columbiamissourian.com",
    "url": "https://www.columbiamissourian.com/news/k12_education/battle-teacher-shares-philosophy-culture-religion-through-podcasting/article_697de336-1b09-11e8-b557-678b91163354.html"
}