{
    "text": "Candy, noodles top export items alongside biscuits Bandwidth import from India surges Former communications minister Abul Hossain no more PM arrives in Brussels to attend Global Gateway Forum Dhaka K-Meet 6.0 was organised by the BD K-Family on May 20, 2022 at Tokyo Square Convention Centre. The BD K-Family community is the first and only South Korean cultural community, which celebrated its 12-year anniversary this year. The signature event Dhaka K-Meet was graced by First Secretary Youngmin Seo, along with Cultural Officer Yu Haeng Lee, from the Embassy of the Republic of Korea in Bangladesh. The event saw almost 4000 participants belonging from all age groups. The event consisted of K-pop dance and music performances, merchandise stalls, Korean food stalls, Korean tourism landscape display and many more attractions related to the South Korean culture. There were 50 performances, including special K-pop performances by the founders Tashnuva Zahan and Tina Zahan, Shouvik Ahmed with his crew 2N8, singer Mahi Hasin and more. A member of the community Ahnaf Nuan, from the crew Rakuzan klan, said, \"After finally meeting everyone from the community, I feel like I am home. This past 12 years slowly grew into a huge part of my life which is like a source of dopamine for me.\" Saiful Islam, president of the community shared his vision of how this rapidly increasing fanbase would soon create a positive impact among youngsters. Founder Tashnuva Zahan stated, \"I honestly feel very proud of each and every member of the community for their underlying love and devotion towards their passion which will surely take them places.\" The purpose of the BD K-Family is to create a platform for the people of Bangladesh to train and explore their talents while creating a cultural bond between the two nations. There are similar events in South Korea solely dedicated to Bangladeshi culture, which acts as a bridge in creating a beautiful friendship. In 2023, Bangladesh and Korea will reach 50 years of diplomatic friendship, which is a big celebration of harmony. The community will promote peace and harmony between both nations. The events of BD K-Family are maintained by volunteers from Smile, a non-profit organisation and an amount from ticket sales will be donated to help people in need. আজ বৃহস্পতিবার সকাল থেকে আমিনবাজার ও আশুলিয়ায় পুলিশের চেকপোস্টের কার্যক্রম শুরু হয়। পাশাপাশি জাহাঙ্গীরনগর বিশ্ববিদ্যালয় এলাকায় আরেকটি চেকপোস্ট পরিচালনা করছেন র‌্যাব-৪ এর সদস্যরা। ",
    "title": "BD K-Family celebrates cultures at Dhaka K-Meet 6.0 | The Daily Star",
    "datetime": "2022-05-21T15:54:15+06:00",
    "url": "https://www.thedailystar.net/shout/news/bd-k-family-celebrates-cultures-dhaka-k-meet-60-3028406"
}