{
    "text": "The former member of girl group After School chats sleep deprivation, hard work and what makes it all \"worth it.\" By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin “I wasn’t on stage or doing fan engagements for two years,” says Rebekah Kim, backstage at K-pop convention KCON 2013. “It feels so good. It’s like a new energy again.” Kim, known professionally as Bekah, had once felt the energy of K-pop adulation as an original member of one of South Korea’s top pop acts, After School. Since its 2009 debut, the girl group has showcased high-skill showgirl concepts (drum lines, tap dancing, pole dancing — “We loved being different,” Bekah says). But the troupe is also unique as the only K-pop act with a graduation/admission process, with membership ranging from five to nine girls since their 2009 debut. Singer/rapper Bekah was the second member to leave the group, exiting in 2011 after recording a goodbye “graduation” track, “Take Me to the Place,” and disappearing from the K-pop limelight. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t09/24/2013\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tExplore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news  She returned to fans two years later as a panelist at packed KCON event. While fans mostly wanted details about her personal life (e.g. her K-pop crush), the Hawaii native sat down to share her what the life of a K-pop star is really like. With a built-in method to keep members fresh (i.e. the newest member, 17-year-old Kaeun, joined in spring 2012), After School may seemingly epitomize the “factory” label that Western outlets (including SPIN, The New Yorker and Forbes) use to describe the K-pop scene. But Bekah insists that it’s characterized by people working hard to transform into actual artists on the side. “They decide that path in the beginning,” the 24-year-old explains. “Before they become an artist, they need to choose the K-pop path. They’re the ones that are taking the time to do the training sessions. A ‘factory’ is more like you’re being made. These people already want to do it. I. There’s a passion that goes into it before everything else.” A passion that keeps artists going despite borderline-inhumane schedules. “The worst thing was not sleeping,” she says. “We came home with an hour and thirty minutes left [until the next activity]. I had to wash my makeup off, shower and I went to sleep. But by then, I only had 30 minutes to wake up again at 6:00 a.m.”  While some may see After School’s agency Pledis Entertainment’s (home to fellow K-pop idols Son Dam Bi, HELLOVENUS and NU’EST) treatment of the group as harsh, Bekah is adamant she was treated well. “I like the boss a lot. I never got into any arguments,” she says. “We ended on good terms; they threw me a party.”  Despite her cheery sendoff, the former K-popper does still caution those craving superstar status. “You got to know that all that glitters is not gold,” she warns. “Think about it, finish high school and have a Plan B. It’s a business! It’s a business for people, even though, for the audience it’s not. I’m not going to promise you it’s great — especially not all the time. But if it’s your dream and you have a feeling, do it. I’m not going to tell you to do it. It’s a lot of work; a lot of work.” Still, all that work can parlay into K-pop success, best characterized when an act’s single lands wins on weekly K-pop music chart programs that name a champion after each episode based on sales, streaming and fan voting. After School got their first taste of prize-winning with ’09 single “Because of You,” an electronic dance-ballad hybrid. Watch them attempt to perform an encore performance, through tears, after winning their third week in a row on music program “Inkigayo” below.  “It was a shock,” she reflects of winning a music program. “All this hard work just exploded that day. It was like, ‘Wow, you guys really like us. Thank you so much.’ I was ecstatic.” Bekah also reveals that chart success doesn’t mean the group can slack off. In fact, in meant even harder work. She adds, “Once we learned that it was going up on the charts, we would practice even longer. We’d do knee-highs, running around the rehearsal room, singing that song for 10 hours.  “It’s hard work…” she adds before pausing.”And it’s worth it. Right?” While Bekah wonders about After School’s future (“It’s not just difficult for the group adjusting to new people, I’d say it’s difficult for fans, too… luckily, fans usually just love to support that other member”), she adds that her proponents can expect a comeback soon. “I will be back. Be patient, please,” she says of a future career as either a solo artist or as a part of a new group. “I may not have been doing anything for a while, but my Twitter still blows up. It’s like ‘Wow, you guys really care about who I am.’ I’m just me. I just want to say thank you for showing that kind of love.”  Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "title": "Bekah, Former K-Pop Star, Talks Realities of Korean Music Industry – Billboard",
    "datetime": "2013-09-25T02:20:41+00:00",
    "url": "https://www.billboard.com/music/music-news/bekah-former-k-pop-star-talks-realities-of-korean-music-industry-5695566/"
}