{
    "text": "By Claudio Sanchez Some of the nation's top researchers who've spent their careers studying early childhood education recently got together in Washington with one goal in mind: to cut through the fog of studies and the endless debates over the benefits of preschool. They came away with one clear, strong message: Kids who attend public preschool programs are better prepared for kindergarten than kids who don't. The findings come in a report \"The Current State of Scientific Knowledge on Pre-Kindergarten Effects,\" and the authors include big names from the early childhood world: Deborah Phillips of Georgetown University, Mark W. Lipsey of Vanderbilt, Kenneth Dodge of Duke, Ron Haskins of the Brookings Institution and others. It lays out the current state of preschool education in the U.S. and what research can tell us about what works and what doesn't. Among their key findings, drawing from across the research base, are: Currently, the federal government, along with 42 states and the District of Columbia, spend about $37 billion a year on early childhood programs, mostly targeting low-income 3- to 5-year-olds. When it comes to what preschools should teach, the researchers took on a big question in that field, too: Should pre-K focus on the social and emotional development of children or should it concentrate on what researchers call \"skills specific curricula,\" namely numeracy and literacy? The research clearly says it's not a matter of either/or. \"What we know is that children bring a vast array of experiences, both strengths and weaknesses,\" Phillips says. \"Some children need more support than others. Some bring vast knowledge and skills.\" Instruction built on social and emotional skills, rich play, toys, games, art, music and movement complements explicit instruction focused on things like learning to count and matching letters to sounds and words. Both benefit kids' readiness for school. For researchers, the critical questions now are: What should the next generation of pre-K programs look like? What else needs to happen — in preschool and beyond — to ensure a long-term impact? And how do we connect all the dots in a child's educational trajectory beginning with preschool? That's no easy task considering that half of the school-readiness gap between poor and affluent children is already evident by age 2, before most kids ever get to preschool. Another major hurdle is the disconnect between pre-K and elementary education. Rather than building on the skills that kids arrive with, researchers have found lots of redundancy with kindergarten and first-grade teachers repeating a lot of what pre-K teachers do. This results in what researchers call \"dead zones\" that squander hard-won gains. \"On that count we cannot declare victory,\" says Phillips. \"We need to look at the elementary grades as re-charging stations.\" Pre-K programs today can also do a better job reaching out to low income families dealing with stress and mental health issues. The home, after all, provides either a sturdy or fragile foundation, researchers say. \"We know that poverty and adversity compromises the developing brain architecture and circuits,\" says Phillips. And while even a high-quality program does not inoculate children from adversity and poverty, it can help mitigate those effects. \"Absolutely,\" says Phillips. \"That is pre-K education's primary function.\" Sponsor Message Become an NPR sponsor ",
    "title": "Benefits Of Preschool: Kids Who Attend Public Preschool Are Better Prepared For Kindergarten : NPR Ed : NPR",
    "url": "https://www.npr.org/sections/ed/2017/05/03/524907739/pre-k-decades-worth-of-studies-one-strong-message"
}