{
    "text": "Korean pop culture seems to be everywhere these days. With the rising mainstream popularity of K-pop music and Korean dramas in the United States, the so-called “Korean Wave” (hallyu) seems ready to crest. The King Sejong Institute Center opened in downtown Los Angeles in September 2018, just a few miles away from historic Koreatown, one of the largest Koreatowns in the United States, and ready to capitalize on this growing interest in Korean culture. The institute, which is named after King Sejong the Great—who invented hangul, the Korean alphabet—and funded with help from the South Korean government, operates about 180 locations in 60 countries, and teaches Korean language and culture to students of all ages and backgrounds. All that’s required is a basic desire to learn. Woo Seung Sohn, the head of the U.S. office of King Sejong Institute Center, attributes people’s interest partly to the popularity of Korean television dramas (also known as K-dramas) and the meteoric rise of Korean boy band BTS, which in 2018 became the first K-pop group to have a No. 1 album on the Billboard 200 chart and recently scored their third No. 1 album in April 2019. “I think in recent days, one of the reasons why people try to learn Korean is because of the hallyu,” says Sohn. “They have the drive to actually learn the language to understand them better.”  For music producer Max Bonilla, learning Korean seemed like the best way to further his career. “I work with a lot of Korean artists,” he shares. “I do a lot of the musical production, but I also wanted to start topline writing. I figured, to topline write, I would probably need to learn Korean—so here we are.” Interest in Korean film and television also led Ariel Schudson to King Sejong’s doorstep, where she’s been taking classes for a year. “I’ve been doing film and television studies for about 20 years,” says Schudson. “I’ve been a fan of Korean films for about 10 of those years, and I never really thought about taking language studies, but I really got into the Korean dramas.” Schudson then realized that a lot of the translations for those dramas weren’t completely accurate—so she decided to take it upon herself to learn more about the language and culture. Of course, it would be wrong to assume that K-pop and K-dramas are the only aspects of Korean culture people want to learn about. What sets King Sejong apart in the eyes of its students is the Institute’s effort to tie together language, culture and camaraderie. Along with its language and conversation classes, King Sejong also teaches students about other aspects of Korean culture, from learning about the importance and symbolism of hanbok (traditional Korean clothing), to bringing in renowned chefs to teach them how to make bibimbap, a Korean rice dish.  “There’s something different about King Sejong Institute, and the cultural aspects here and what it gives the participants, that I’ve never experienced anywhere else,’” Schudson shares. “You get to meet your classmates. We exchange ideas, and that is all brought together here because it’s a center where people from all different parts of Los Angeles—all different walks of life, all different ages, all different ethnicities, everywhere—have come together for learning for different reasons.” Sohn adds, “I think learning a different culture and language is very important, even if it’s not Korean, even if it’s other languages. We are very supportive of having diversity, and understanding of cultural differences is probably one of the core things that we’re probably trying to accomplish.” One of the challenges the King Sejong Institute Center faced when first starting up was dealing with the logistics of opening a business in a foreign country. Since it was started and funded by the South Korean government, they were not very familiar with the U.S. banking process, says Sherrie Carr, vice president and branch manager at East West Bank’s Downtown Los Angeles Commercial Banking Center. They worked together to not only set up a number of accounts for the Institute, but also to set up their business plan and physical location, and to help navigate foreign transactions.  “One of the things that was very helpful was foreign currency exchange,” says Carr. “We can help him set it up as Korean currency, or if not, we could set it up as U.S. currency. At that moment in time, we were able to send the funds that they were required to send for books in Korean currency.” Sohn shares that this international capability was one of the key reasons why they chose to work with East West Bank. “East West Bank has been very supportive of us,” he says. “It has been very good for us because they know a lot of things about international transactions. Since our major funding comes from Korea, that has been very helpful—the knowledge and being able to get the services that we need.” Although King Sejong Institute has only been open for just over a year, Sohn says they have already tried out a number of different programs. Along with their regular Korean language classes that teach students grammar and vocabulary, the Institute also introduced conversation classes early in 2019. “Conversation class definitely focuses more on actual conversations that they’ll be using on a day-to-day basis, and they’ll have a lot of practice doing that,” says Sohn. “It’s something we’re trying out, and I think we’re getting a lot of positive results from the students.” They are also hoping to attract more students as they become more established. With a booth at KCON USA, an annual convention that brings together all types of Korean pop culture ranging from music to beauty, Sohn has high hopes for the future of the Institute. “We’re looking to expand,” he shares. “We believe that there are a lot more people who are interested in learning Korean.” Explore Topics Entrepreneur Insight Dominic's Take Bull Session US-Asia Business Business Continuity Toolkit Recipes of China Tech and Innovation SBA Loans Community East West Lifestyle US-Asia Market Watch Entertainment We’ll keep you in the know about the latest US-Asia business news and trends. 掌握中美经贸最新信息和产业脉搏。 Lo mantendremos informado sobre las últimas noticias y tendencias comerciales entre Estados Unidos y China. 掌握中美經貿最新資訊和產業脈搏。 Investment products: Are Not FDIC InsuredAre Not Bank GuaranteedMay Lose\r\n\t\t\t\t\t\t\t\t\t\t\tValue Are Not Insured by Any Federal Government AgencyAre Not\r\n\t\t\t\t\t\t\t\t\t\t\tDeposits East West Bank, compass logo, and East West Bank with compass logo are separately\r\n\t\t\t\t\t\t\t\t\tregistered trademarks of East West Bank in the United States and other countries. ©2006 - 2023, East West Bank. All Rights Reserved. NMLSR ID 469761 Equal\r\n\t\t\t\t\t\t\t\t\t\tHousing Lender ",
    "title": "Beyond K-Pop: Sharing Korean Language & Culture at King Sejong Institute Center",
    "url": "https://www.eastwestbank.com/ReachFurther/en/News/Article/Sharing-Korean-Language-Culture-at-King-Sejong-Institute-Center"
}