{
    "text": "The inaugural award show was hosted on October 28th. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tBillboard Staff On October 28, Billboard hosted the first-ever THE-K Billboard Awards, organized by the Ministry of Culture, Sports and Tourism, the Korean Foundation for International Cultural Exchange (KOFICE), and the Penske Media Corporation (PMC). The event was broadcasted live via YouTube in 73 countries.   \n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tExplore\t\t\n\t\n\nSee latest videos, charts and news\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tBTS\t\t\n\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tENHYPEN\t\t\n\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tIVE\t\t\n\t\t\t\t\t\n\n\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news A total of eight teams won awards in three categories based on Billboard’s charts. In particular, awards went to four newly debuted artists in the Hot Rookie category, casting light upon the new K-pop stars who have fascinated global audiences.\n\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tRelated\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tSEVENTEEN Announce North American Tour Dates\t\t\n\t\n\n\n\n\t11/28/2022 THE-K Billboards Awards presented awards in the Top Artist, Global Artist, and Hot Rookie categories. Nominees were selected based on their scores in three Billboard charts – Billboard Hot 100, Billboard 200, and Global 200. For the Top Artist category, BTS and TOMORROW X TOGETHER took home awards. They made stellar achievements in the Billboard Hot 100 and Billboard 200 charts, raising the appeal of K-pop across the world. Winners in the Global Artist category were chosen based on the Global 200 chart. BTS and IVE won this category as they have amassed a great number of fans around the globe, including in the US. For the Hot Rookie category, teams that debuted less than three years ago and recorded the highest total scores on three charts (Hot 100, Billboard 200, and Global 200) received the award. The winners included IVE, NewJeans, ENHYPEN, and Kep1er (based on data from January to September 2022). During the award show, Billboard President Mike Van said, “I am truly happy to recognize the dazzling achievements of K-pop artists through THE-K Billboard Awards. We are here today to celebrate K-pop’s contribution to the global music industry.” Yoon-ha Kim, a music critic and one of the co-MCs of the event, congratulated both the K-pop artists and their fans by saying, “K-pop fans’ love and devotion are behind the astonishing success of K-pop.” THE-K Billboard Awards is a follow-up program of the K-Culture Festival, which was held from September 30th to October 8th. Marking the third anniversary since its establishment, the K-Culture Festival is a major global hallyu festival jointly organized by the Ministry of Culture, Sports and Tourism; and the KOFICE. The festival introduced diverse Korean culture, mainly K-pop and K-drama. Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "title": "Billboard Hosts First-Ever THE-K Billboard Awards – Billboard",
    "datetime": "2022-11-28T20:16:26+00:00",
    "url": "https://www.billboard.com/music/music-news/the-k-billboard-awards-1235177027/"
}