{
    "text": "Subscribe Now! Get features like From a novel that spoke of ‘a severe pneumonia-like illness’ that would sweep the globe in 2020 to an episode of a Korean drama in which the characters speak about weaponising coronavirus, multiple pop-culture works are seeing a resurgence for unwittingly ‘predicting’ the ongoing pandemic. A thriller novel The Eyes of Darkness, written by Dean Koontz in 1981, mentioned a virus named Wuhan-400. The coronavirus originated in Wuhan, and later spread across the world. In the novel, the virus was created in a lab. “The Wuhan-400 is the perfect weapon,” a character says in the book. “It affects only human beings.”  Later, Kim Kardashian widely popularised another novel that seemingly foretold the coronavirus. Posting an excerpt of Sylvia Browne’s 2008 book End of Days: Predictions and Prophecies about the End of the World, Kim said that her sister Kourtney had shared the information on a group chat. An excerpt from the book reads, “In around 2020, a severe pneumonia like illness will spread throughout the globe, attacking the lungs and bronchial tubes and resisting all known treatments. Almost more baffling than the illness itself will be the fact that it will suddenly vanish as quickly as it arrived, attack again ten years later, and then disappear completely.”  A 2017 Asterix comic, Asterix and the Chariot Race, featured a ruthless Roman villain by the name of Coronavirus. Italy has been severely affected by the pandemic, and has reported the most number of deaths in the world.  The Simpsons, which has ‘predicted’ everything from the election of Donald Trump, tech inventions, and football results, in a 1993 episode mentioned the spread of a highly contagious virus named the Osaka Flu. The flu travelled to the United States from Japan in a package sent by an infected person. As a result, most of the residents of Springfield get sick. The episode also includes eery shots of deserted streets and mass panic. Some users tweaked stills from the episode to make it seem as if the virus in the show was actually called the coronavirus. The US is the third-worst hit nation in the world, after China and Italy.  Most recently, fans have discovered that an episode of the Korean series My Secret Terrius featured a plot in which the coronavirus was used as a weapon. The scene takes place in the tenth episode of the first season, which aired in 2018. “We must do more research, but it looks like a mutant coronavirus,” a doctor says in the episode. “Someone tweaked it to increase the mortality rate to 90%. The virus was manipulated to attack the lungs directly within just five minutes of being exposed.” The show also mentions that no cure exists for the virus, and that the only way to combat it is to wash one’s hands.  Episodes of The Big Bang Theory and its prequel series, Young Sheldon, have also witnessed a resurgence in popularity. In one episode of The Big Bang Theory, a paranoid Sheldon tries his best to avoid getting infected by a ‘deadly disease’. He ends up in hospital anyway, put in a two-week quarantine. Young Sheldon further explores Sheldon’s germophobia. In one episode, sensing the arrival of flu season, Sheldon excuses himself from class because he doesn’t ‘want to die’. Later, he is seen watching the news on TV, wearing a mask, while the newsreader talks about a virus that originated in China that is particularly contagious among old people and children.  The coronavirus has infected over 450000 people worldwide, including more than 600 in India. Close to 20000 have died. Follow @htshowbiz for more   ",
    "title": "Books, shows, films that chillingly predicted coronavirus pandemic, from Big Bang Theory to creepy K-drama - Hindustan Times",
    "datetime": "2020-03-26T10:06:34+05:30",
    "url": "https://www.hindustantimes.com/tv/books-shows-films-that-chillingly-predicted-coronavirus-pandemic-from-big-bang-theory-to-creepy-k-drama/story-4pCvTvD9jMS8CE3OAsx8iK.html"
}