{
    "text": "By Dong Sun-hwa BigBang, the veteran five-member boy band, have long been a prominent group on the K-pop scene, but most of its members have landed in trouble at some stage, tarnishing the group’s reputation as musicians. Here’s a look at the main controversies involving the members. Seungri Seungri, 29, is accused of buying sexual services for foreign investors, and a nightclub he has been involved with is under investigation for drug use and sexual assaults. He passed a drug test last Thursday, when he was questioned at Seoul Metropolitan Police Agency for more than eight hours. His agency, YG Entertainment, has said: “If any problem is found [after the investigation], legal punishment should follow. On the contrary, if any rumours are found to be false, we will seek legal action.” Seungri has been in the hot seat since January as a former executive director of the Burning Sun nightclub in Seoul’s Gangnam district, which has been described as a “hotbed of crime”. Some female customers were reportedly drugged and raped in the club. However, this is not the first time Seungri has been caught up in controversy; he was embroiled in a sex scandal in 2012. A Japanese media outlet published a photo of him and a topless woman lying on a bed. The woman in the picture provided the photo, and she told reporters that Seungri “likes to strangle his partner while having sex”. YG did not respond to the report. G-Dragon Group leader G-Dragon recently made headlines after failing to win promotion to the rank of corporal despite serving in the South Korean military since February 2018. Normally, an enlisted man can be promoted to corporal about 10 months after enlisting. Military service is compulsory for men in South Korea. G-Dragon reportedly spent about a third of his military life outside the unit and spent 40 days in an army hospital with an ankle problem. Although the army said his long leave was not the cause of him missing the promotion, people remain suspicious. Reports at the weekend said he would resume his service after claims that he sought another medical examination to get discharged from military duty. G-Dragon was also caught up in a drug scandal in 2011 for allegedly smoking marijuana at a club in Japan. But a criminal charge against him was left on the books as he was a first-time offender and the amount involved was small. T. O. P BigBang rapper T. O. P also came under fire in 2017 over marijuana use. He began his military service as a conscripted policeman in February 2017, but lost the position after being found guilty of smoking the drug. He was sentenced to a 10-month jail term suspended for two years, and was ordered to pay compensation. He is now doing public service work in Seoul and is due to be discharged in June. ",
    "title": "Boy band BigBang are no stranger to scandals: stories of sex, drugs and K-pop | South China Morning Post",
    "datetime": "2019-03-05T22:34:23+08:00",
    "url": "https://www.scmp.com/lifestyle/arts-culture/article/2188512/boy-band-bigbang-are-no-stranger-scandals-stories-sex-drugs"
}