{
    "text": "Daily News e-Edition Evening e-Edition Sign up for email newsletters  Sign up for email newsletters Daily News e-Edition Evening e-Edition Trending: Greg Allen/Greg Allen/Invision/AP Singer Boy George of Culture Club performs on NBC's \"Today\" show at Rockefeller Plaza on Thursday, July 2, 2015, in New York. (Photo by Greg Allen/Invision/AP) Stephen Lovekin/WireImage Roy Hay, Boy George, and Mikey Craig of Culture Club perform on NBC's \"Today\" at Rockefeller Plaza on Thursday.  Boy George cites one key reason Culture Club finally managed to reunite, 12 years after they last toured America and 16 years since they put out a new album. “Three of the four of us are in recovery,” George says. That’s the whole band except for bassist Michael Craig. “And he really ought  to be in recovery,” says George, with a laugh. “This whole comeback is just one big amends,” adds guitarist Roy Hay. Luckily, the world seems eager to accept it. Minutes before talking to the News, the now sober band played three rapturously received old hits on the Today Show’s “Throwback Thursday” concert series. They performed, confidently and soulfully, as a promotion for their big reunion tour, which kicks off July 17 in Vancouver and hits the Beacon Theatre in New York on July 27 and 28. Backstage at “Today,” stars and fans alike buzzed over the band. Magician Penn Jillette maneuvered to shake George’s hand. Hilary Swank broke into his dressing room to confess her lifelong devotion. One Culture Club member didn’t make it to the “Today Show”: Drummer Jon Moss, who will perform on the tour, got laid up with back problems. Fans surely noticed the absence of Moss because George’s doomed romantic relationship with the drummer played a key role in the band’s original breakup in the ’80s. George says that’s all blood under the bridge, though he doesn’t sugar coat on-going issues between the members. “We get on each other’s nerves,” he says. “It’s like going home for Christmas with your family. There’s always going to be something said that hurts you. But you know what? I love these fools.” The group tested several short-lived or aborted reunions before. George says everything changed for him relatively recently. “Only in the last five years have I really grown up,” admits the star, now 54. “I’d been winging it before.” The singer says he always had “one foot in, one foot out” of the band, even during their heyday. “I had to go off to do my own thing, to get my confidence as a writer, and a performer,” he says. Perhaps George also had to hit bottom. Seven years ago, he was arrested in Manhattan on suspicion of cocaine possession and for falsely reporting a robbery. In an interview in 2007, George said “People have this idea of Boy George now … that I’m a tragic f–k up. I mean, I’m all of those things. But I’m also lots of things.” When looking back at his long history of trouble now, George says “that person and me, there’s no connection at all.” He credits recovery — his and the other members’ — as well as the “big revelation that you have a choice.” Another key change is realizing how lucky he is. “Oh my God — someone just put me in a hotel room and they paid the bill! I love this job!,” he says. “When you’re young, you just don’t notice. But gratitude is a big part of recovery.” It wasn’t just George’s substance abuse he needed to recover from. His voice also had to heal. The band was meant to launch this reunion tour last fall, but they had to cancel because of George’s throat problems. “I still have the problem,” he says. “I had an explosion on my vocal chord. They weren’t joining so it was difficult to get certain sounds and my range dropped.” To heal, he’s been working rigorously with a vocal coach. “I’ve given up coffee, made diet changes,” he says. “I also have silent days, which the band loves.” While you could hear changes in his voice at the “Today” show performance, they’ve actually given him more texture and depth. He sounded rich and emotional on “Do You Really Want To Hurt Me?” and newly soulful on “Miss Me Blind.” The group will perform such hits on the tour, along with a few new songs. They’ve already completed a full album, “Tribes,” set to arrive in early 2016. They’re delaying it to take advantage of the paucity of releases at the start of each year. It will be the band’s first since 1999’s “Don’t Mind If I Do,” a work which bombed in the U.K. and never even came out in the U.S. George says the new songs recall old Roxy Music, T-Rex and Sly Stone. One cut even uses Sly as its main character. Of course, the world that will receive this album, and the tour, differs dramatically from the one in which Culture Club came up in the ’80s — or even the one they last occupied over a decade ago. When Culture Club won the Best New Artist Grammy in 1983, Boy couldn’t say he was gay. Now we have artists like Sam Smith, who swept the Grammys and whose sexuality draws no comment. “I’ve always wanted to live in a world where it’s a non-issue,” George says. “My feeling from the beginning was ‘who cares?’ I think we were part of the process of making that happen.” George says he’s proud of that, but he’s equally pleased to have a new way to relate to his classic band. “Our alchemy is so f–king weird,” he admits. “But there’s a real symmetry to this band,” adds guitarist Hay. “Symmetry and anarchy,” George says, with a laugh. “Together, it somehow works.” jfarber@nydailynews.com Copyright © 2023 New York Daily News ",
    "title": "Boy George talks reuniting with Culture Club: ‘This whole comeback is one big amends’ – New York Daily News",
    "datetime": "2015-07-02T13:39:01+00:00",
    "url": "https://www.nydailynews.com/2015/07/02/boy-george-talks-reuniting-with-culture-club-this-whole-comeback-is-one-big-amends/"
}