{
    "text": "The Private Eye, the new comic from the writer of Y: The Last Man. Cover for The Private Eye No. 10 Imagine there’s no Internet. It’s easy if you read The Private Eye, an extraordinary sci-fi mystery series written by Brian K. Vaughan that just wrapped up at the innovative online comics site Panel Syndicate. In the post-Internet world of this colorful and relevant comic, every fear you’ve ever had about privacy, leaks, oversharing, and technology has come true. About 50 years before the time of the story, everything in the cloud became public knowledge. That means every dirty picture on your phone, every weird Google search, everything you ever bought, etc. could be seen by anyone who cared to look—in a data flood that lasted, appropriately, 40 days. As you can imagine, this disaster destroyed plenty of lives, as well as much of society. In the 2076 world of The Private Eye, the Internet is a distant, despised memory—laptops and tablets are referred to as “old slab things.” Characters are so far removed from the age of TMI, so ingrained with the notion that self-disclosure is folly, that one remarks, “Anyone with an autobiography is almost definitely an evil piece of shit. But that’s only half the premise. The anonymity that used to flourish on the Internet has been flipped: now everyone has multiple, masked secret identities (called nyms) in the real world, so they can live with a little of the freedom we enjoy (and abuse) on the web. This Bizarro way of life is vividly shown at a funeral flashback, as a woman is eulogized along with her various nyms: ExWhyZed, Ms. Exalted, Beverly Hillson, Thomboy, 4hardwire6. As each nym is mentioned, a panel shows the masked mourners from that community or lifestyle. Those masks—portrayed energetically by artist Marcos Martin and colorist Munsta Vicente—add drama to a murder mystery and a plot to bring back that wrecker of lives, the Internet. Vaughan, Martin, and Vicente show the power of the human face by creating a world where faces are hidden. It’s hard for a face to make an impact on us, since we’re surrounded by the real thing, not to mention group selfies, no-filter selfies, makeup-free selfies, and selfie-stick selfies. But in this comic, nothing is more surprising and dangerous than showing your face: It’s a crazy risk, akin to passing out leaflets with your social security number. Many are so protective of their identity that they go without a driver’s license just to avoid revealing themselves to the DMV. We all have that one paranoid friend who refuses to join Facebook for privacy reasons: in this world, that friend has been proven 100 percent right. Since the Internet no longer exists, you can’t check your spouse’s email to see if he’s cheating—you have to hire a PI, such as lead character Patrick Immelmann. Immelmann violates privacy for a living, but he’s as protective of his own identity as anyone else—maybe even more so, wearing a kind of camouflage called a “dreamcoat” around the city. Some do remember the way things used to be: Immelman’s grandfather, for example, is a semi-senile relic from our age babbling about wifi and getting bars on his phone. Granddad misses his gadgets fiercely, and like most oldsters, thinks the world had gone to hell. His talk of Facebook and Star Trek are seen as both symptoms of dementia and core characteristics of “Generation ADD,” the dumbest generation. He’s both a pathetic character and a recognizable vision of what would happen to most of us if you took away our smartphones for, like, a day. Vaughan keeps on building a case that he’s the best writer in comics. He’s created great series that explore gender (in past series Y: The Last Man) and parenthood (in his ongoing sci-fi masterpiece Saga) but The Private Eye feels more timely than timeless, like great journalism. The great “Silver Age” creator Jack Kirby once noted that “if you have a viewpoint on drugs, or if you have a viewpoint on war, or if you have a viewpoint on the economy, I think you can tell it more effectively in comics than you can in words.” The Private Eye offers the pulpy thrills of the best comics—secret identities, private investigators, and a villain with a rocket—while taking a serious look at the fear that our digital shenanigans will ultimately doom us. Slate is published by The Slate\n          Group, a Graham Holdings Company. All contents ©\n        2023\n        The Slate Group LLC. All rights reserved. ",
    "title": "Brian K. Vaughan’s The Private Eye, reviewed: Panel Syndicate comic imagines all our privacy nightmares come true.",
    "datetime": "2015-04-01T16:53:49+00:00",
    "url": "https://slate.com/culture/2015/04/brian-k-vaughans-the-private-eye-reviewed-panel-syndicate-comic-imagines-all-our-privacy-nightmares-come-true.html"
}