{
    "text": "Photo by Steve Jennings/Getty Images for The Crunchies This story originally appeared on Inc.   This was a pretty great week. It may have had something to do with the fact that I got to walk along this beach at lunch, but mostly I think it was what I read in this Medium piece by Airbnb co-founder Brian Chesky. The story is actually a staff note he made public because he thought it might be helpful to other entrepreneurs. That makes him a nice guy, but it’s not what made my day. The following did; it’s a conversation Chesky had with venture capitalist Peter Thiel: Midway through the conversation, I asked him what was the single most important piece of advice he had for us. He replied, “Don’t f@#k up the culture.” This wasn’t what we were expecting from someone who just gave us $150M. I asked him to elaborate on this. He said one of the reasons he invested in us was our culture. But he had a somewhat cynical view that it was practically inevitable once a company gets to a certain size to “f@#k it up.” I feel like I should repeat that: When Chesky asked noted VC Peter Thiel (he of PayPal/Facebook/Palantir fame), for one piece of advice, Thiel said to make culture a priority (albeit in slightly stronger terms). That is simply music to my organizationally healthy ears! And from such an unexpected source. The validation is fantastic, but the second part of Thiel’s argument is intriguing if not troubling—that it’s inevitable to, ahem, screw up a culture when you scale. I prefer Chesky’s POV. Achieving and maintaining a healthy culture, he said, is both difficult and incredibly valuable, which is why Chesky made it a primary focus for Airbnb. So smart. Because, as Patrick Lencioni says, organizational health (or great culture) is an untapped competitive advantage that is available to anyone willing to invest in it. The problem is that so few are really willing to do what it takes to realize organizational health. Part of the problem is that few leaders realize how much hard work, diligence, commitment, and humility it takes to achieve—and maintain. It’s much easier and more natural to focus on the things we understand and can measure in spreadsheets. In our practice, we call that the smart side of the equation. It’s certainly important, but it’s not a competitive differentiator the way organizational health is. Do some companies become more and more miserable places to work as they scale (as seemingly implied by Thiel’s remark)? Sure. But there are exceptions. And those exceptions make culture a priority; they understand that the benefits to a culture that’s not f@#ked up are deep and lasting—and worth committing to. Does Airbnb stand a chance of maintaining its independent, entrepreneurial culture? Absolutely. So long as Chesky and his colleagues continue to back up that priority with attention and action. As he says, “Culture is forever.” See Also: And the Coolest College Start-up of 2014 Is …    Slate is published by The Slate\n          Group, a Graham Holdings Company. All contents ©\n        2023\n        The Slate Group LLC. All rights reserved. ",
    "title": "Brian Chesky, Airbnb co-founder: Peter Thiel’s one piece of advice for entrepreneurs is about company culture. ",
    "datetime": "2014-05-03T14:00:00+00:00",
    "url": "https://slate.com/business/2014/05/brian-chesky-airbnb-co-founder-peter-thiels-one-piece-of-advice-for-entrepreneurs-is-about-company-culture.html"
}