{
    "text": "Read The Diplomat, Know The Asia-Pacific Kevin Shin trained to be a K-pop star. He’s now making hip hop hits in China. He’s a Korean American who grew up in Seoul, Chicago, and Beijing. He trained to be a K-pop star and was offered a spot on one of most well-known K-pop bands in the world, but turned it down to join the underground rap scene in Seoul. He produced hit songs alongside one of China’s most popular artists, and has now moved to Beijing to pursue his own music. Kevin Shin is a singer, songwriter, and producer who is trying to change the Chinese music scene. Early on, Shin never considered music as a career possibility. He grew up in the suburbs of Chicago wanting to be a professional soccer player. His junior year of high school, SM Entertainment, a powerhouse Korean entertainment company known for producing some of the most famous K-pop artists in the world, came to Chicago on an international talent search that spanned Asia, the United States, and Canada. After auditioning more than 6,000 kids, they picked five. Shin was one of them. Photo provided by Kevin Shin. “Kids in the youth ministry of my church told me I should go audition,” says Shin. “I didn’t know anything about K-pop. I played piano, I played keys in a band with my friends. But I didn’t think that music would be my future. I knew I was good at writing, and I didn’t want to work in an office.” Get briefed on the story of the week, and developing stories to watch across the Asia-Pacific. The auditions were intense. In Chicago, 400 children showed up. “I didn’t even know there were that many Korean kids in Chicago,” says Shin. “You get a number and then line up. They bring out 30 people at a time, and they have three people judging you, kind of like American Idol. The one person steps forward and starts singing. I sang The Beatles, Let it Be. I didn’t know any Korean songs.” Enjoying this article? Click here to subscribe for full access. In the car on the ride home with his friends, they all joked about the auditions. “We were all like, ‘Wow, that was a stupid experience.’ And then I got a phone call saying ‘Hey, can you come back tomorrow?’ I went back the next day and it was in a little hotel room. They asked me to sing. And then they asked, Can you dance?’” “And I thought, I don’t know how to dance! I’ve never danced in my life. And they all laughed, and that’s when I knew I blew my chance.” A couple months later, SM called and wanted to sign a contract. Even though his parents disagreed with the process and were apprehensive about the contract, Shin signed with SM in 2006. He started training part-time in 2007 while attending college, and in 2009 he moved to Seoul for full-time training: 11 a.m.-11 p.m. days, with only every other Sunday off. In the fourth year, Shin said he could see where his hard work was leading. “You get an idea of what you’re going to become. EXO was coming into fruition, and it was finally presented that it would be a 12-man team. I was going to be part of that team.” EXO is a South Korean-Chinese boy band with nearly unprecedented international success. It is one of the most well-known K-pop bands in the world, and was chosen to sing at the 2018 Olympic Winter Games ceremony in PyeongChang. But Shin didn’t want to join EXO. After watching the progression of other K-pop bands produced by SM, including 13-man Super Junior, Shin realized he didn’t want the lifestyle K-pop offered. Despite his resolve to leave SM, it wasn’t easy. SM had invested a lot of money in Shin, and negotiations took more than six months. Once Shin was a free agent, he knew where he wanted to go next. “I had started listening to hip hop since grade school. I wanted to write my own songs, produce my own songs, write my own lyrics. I didn’t want to dance or sing songs that other people wrote for me.” After spending a year by himself creating a hip hop mix tape, Shin joined another label in Korea. He soon left after the label attempted to place him back into a boy band set-up. He then planned on creating his own label with friends, but that also fell through. “Then I went completely independent,” says Shin. “Within a month of leaving that company, then I dropped my first album. It was 100 percent jazz hip hop.” The album was nominated and won “Best Hip Hop Album of the Year” in the non-mainstream Korean music scene, leading to not only praise, but opportunities to work with other artists. A few months later, Shin dropped his second album, which was nominated for the same award. Around that time, Kris Wu, a Chinese artist and actor, reached out to him. Shin and Wu had been close from their time together training at SM to join EXO. While Shin left, Kris had joined EXO and then became an extremely successful solo artist in China. Enjoying this article? Click here to subscribe for full access. As Shin puts it, “I felt there wasn’t much more I could do in Korea. Timing was right. He asked me to help him out with his music. So I took a break from my music and focused on his. I helped him make his own style and find some direction. That was the last couple of years. Through him I was able to see what culture is like in China.” Shin stepped into China and produced back to back hits. He produced “Lullaby,” later used by the Beats by Dre “Above the Noise” campaign, which gave him the opportunity to work with his role model, Pharrell, for several days in LA. He also wrote and produced “B.M.” for a global Burberry campaign. In late 2017, Shin won “Producer of the Year” at the 2018 China Music Awards (CMAs) for the song, “6”. That’s when Shin noticed something in Chinese culture he hadn’t seen in Korea or the United States. “Young Chinese enjoy watching dramas and TV shows, but they don’t listen to a lot of music. When you walk on the streets, people don’t have earphones in.” China does have a paradoxical music industry, Shin argues: “Even though Chinese people recognize musicians and artists, it is because they star on reality TV and in movies. Fans recognize their faces, but not their music.” “I saw the market and this opportunity to show younger generation what music is. It’s a chance for me to change history and change culture. Luckily, I had a great team that was willing to promote and willing to support me coming into China. Without them, there was no way I would’ve been able to take that leap.” Shin dropped this latest album, “Evolution,” on November 15th. His fourth album, this is his first to drop in China, geared toward the Chinese mainstream. While the album targets young Chinese, a majority of the songs are in English. The album blends several styles of music, ranging from hip hop, pop, and R&B/soul, weaving them through a story structured by the Wu Xing 五行, or the “Five Phases” of the Chinese elements: earth (土 tu), wood (木 mu), water (水 shui), fire (火 huo), and gold (or metal, 金 jin). Since moving to China in early 2018, Shin has focused on simply making good, quality music. “Nowadays, more musicians and artists are seeking out bigger producers and songwriters in the U.S. and China. But I’ve been there and I have that. I strive to be like Pharell where I produce, songwrite, and also do my own music. I want to have a say in the culture and send a message out to listeners.” When asked which part of music is his favorite, he simply answers: “Everything brings a different joy. Performing in front of people, the feeling when you have finished creating something, when you work with somebody or for somebody. You just feel joy.” “I always say, I love to write. Even in this digital world I hate texting. I love pen and paper. Music is stories. It’s sharing emotions. And stories can be told with words, letters, but it can also be told with sound. It’s just a matter of how to tell a story. I feel like I am the author of my story and I just want to give people the chance to listen to them. And who better to tell my story than myself?” Listen to Kevin Shin’s latest album Evolution, available on iTunes, Apple Music, QQ Music, Ali Music (Xiami), and other Chinese platforms.          ",
    "title": "Bridging Cultures Through Music: K-pop, China, and the US – The Diplomat",
    "url": "https://thediplomat.com/2018/12/bridging-cultures-through-music-k-pop-china-and-the-us/"
}