{
    "text": "They're the Beatles for the 21st Century, a global pop sensation that generates mania and devotion in equal measure, and they've sold out London's O2 Arena. BTS, the South Korean seven-member boyband and pin-up stars of the K-pop genre, are performing in the UK for two nights only. And their fans, who call themselves the Army, are over the Moon. We headed for the queues to find out what makes the perfect K-pop fan. Don't know the chants? Then, jog on. Before the boys put a boxfresh trainer-clad foot on to the stage, the Army will be in full swing with their chants. Queue buddies Bianca, 16, from Poland, and Ella, 17, from Ipswich, shyly give us a demonstration, and it's oddly mesmerising. It's a synchronised list of the boys' names, surnames included. Fans talk about how regularly listening to BTS, who mostly sing in Korean, has meant they are inadvertently learning Korean. \"You quite quickly become engrossed in Korean culture,\" says 24-year-old Najma Akther, from Scunthorpe. \"It's like going down a rabbit-hole. I watch K-dramas (Korean TV shows) because of the great visuals and great acting - it's helping me learn Korean. I've only been watching them for a year so I'm not fluent yet.\" Tricky. The band famously spend days learning the routines. They're tightly choreographed and high intensity, and not ones that fans are willing to demonstrate to us in public. Most practise in their bedrooms, but the talented will post videos of their moves online. Almost a non-negotiable that'll cost you £45. It's a BTS-branded, Bluetooth-connected orb which will change colour in sync with the on-stage light show. No old ones or your own version allowed.  They are part of the K-pop world and, to one young fan, \"they bring us all together\". Another is less enthused - \"they're extortionate\". Allow Twitter content? This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Twitter’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’. Don't. The lights may be bright, the screams piercing, the heat rising and your senses overloaded but that's still no reason to fling your teddy bear, programme or pictures of yourself at the band. Fan Megan Spence, 21, from Dublin, knows people get overexcited and don't mean to cause harm but worries it's giving the fans a bad name. The problem is bad enough that the O2 makes a point of telling concert-goers not to throw stuff. If you forget, the band members will be there on stage to remind you - be kind, be respectful, love yourself and one another. It's not enough to just watch and listen, you've got to get involved. And their fans do - in droves. There are fan sites, spaces for translations (the band have had top 10 hits in about 70 countries) and philanthropy projects to raise money for BTS's chosen charities. Even their mums are getting in on the act. Vivian Nielsen, 43, from Oslo, has set up an online community for Army mums. Her 18-year-old daughter, Cecilia Skram, introduced her to the band. \"They focus on loving yourself and accepting yourself for who you are - and they talk about social issues,\" says Cecilia. It's a powerful message among their young fans, and one that appeals to Cecilia's mum too. \"There's not a lot of controversial things involved,\" she says. \"They behave. Onstage there's a bit of thrusting, some moves are questionable but the lyrics are safe.\" Chisa, a 28-year-old office worker from Osaka, has seen BTS once, in Japan. \"They were fantastic. 100 out of 10,\" she says. Desperate to see them again, she tried to buy an O2 ticket but missed out. So, she spent nearly £900 on a flight to the UK just so she could \"feel the atmosphere\" in the build-up to the concert. Now that's devotion. How did BTS become so successful? The enduring power of the princes of K-pop First K-pop band win US music award BTS arrive in the UK after history making US shows - Music News LIVE - BBC Hundreds of police search for Maine gunman as 16 feared dead Israeli tanks cross into Gaza for 'targeted raid' Humanity blasted and broken: Gaza through a medic's eyes Seoul crush: Survivors still tormented a year on The unending pain of India's sewer workers Bowen: Israelis and Palestinians fear worst is yet to come How two 4-year-olds were killed and social media denied it How one of gaming's lost sequels finally got made The chaotic search for Speaker... in 120 seconds. VideoThe chaotic search for Speaker... in 120 seconds Russia goes back to prisons to feed its war machine The dark side of touch-screen tipping Humanity blasted and broken: Gaza through a medic's eyes The town telling influencers to stay away What if a rogue nation dimmed the Sun? Why so many veterinarians suffer © 2023 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking. ",
    "title": "BTS and K-pop: How to be the perfect fan - BBC News",
    "url": "https://www.bbc.com/news/uk-45800924"
}