{
    "text": "This weekend in New York City, one website is trying to take their online community offline for a special BTS-oriented event. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tTamar Herman The global K-pop fandom largely thrives on the internet, where fans can connect with one another through a variety of social networking sites. This weekend in New York City, one website is trying to take their online community offline for a special BTS-oriented event. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tBTS\t\t\n\t\t\t\t\t\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news Amino, a social media platform built around specific communities of users, is hosting a special “#Love_Your_BTS” pop-up art gallery in NYC on Friday and Saturday (Oct. 13-14) in an attempt to push the boundaries of what it means to be a social media app in 2017.  “The original genesis of Amino was at an anime convention and we’ve tried to keep that as a common thread in all our communities and make it feel very immersive,” Amino’s marketing rep Tyler Pennell tells Billboard. “The idea of having a real world event that brings some of that content and experience out of the app and into a venue was something we were keen on.”  Filled solely with BTS-oriented artwork created by members of the Amino ARMY community, the #Love_Your_BTS gallery was inspired by similar events held by K-pop fans throughout the world, where fans regularly hold meetups based around artwork, fan-created merchandise and other activities to bring K-pop fans together. Growing in popularity, the fan-oriented events inspired Amino to put out a casting call for ARMY to submit their artwork and will be printing the digital art  professionally and displaying them in a gallery space. (Though fan-run, the events are gaining traction and INFINITE’s Sungyeol even attended a few to celebrate his birthday together with fans in August.) Along with the displayed artwork, the event will also feature stories of ARMY about how the band has influenced their lives, with the pop-up’s overall theme drawing on BTS’ most recent album, Love Yourself: Her for inspiration.  Amino will also be releasing a zine — a throwback to the early fan-created magazines that were essential to the early days of fandom culture — that contains analysis and essays based on BTS written by members of the ARMY Amino community. “You’re literally entering a 360 degree world of K-pop,” says Pennell. “It’s essentially a miniature BTS museum.” Other social media companies have also turned to offline events to rally fandoms, including Tumblr, which recently held a special meet-and-greet with K-pop group K.A.R.D. But for this event, and in general, Amino wants to keep the focus on its users. Amino engages users in multiple ways, providing an all-encompassing platform for people with like-minded thoughts to come together and express themselves through writing, images, videos, audio files and other sort of community-based interactions. Some of the largest communities on Amino are based around people coming together to discuss things including anime, K-pop, motorcycles, Pokemon, sports, LGBTQ+ and veganism. With hundreds of thousands of communities on the platform, choosing BTS to base their first live event around was an easy decision according to Pennell. Along with their recently-achieved historic records on multiple Billboard charts, BTS’ ARMY community on Amino is one of the platforms most active, with over 630,000 members. “Given everything that’s going on with the group and the amount of passion and dedication their fans have, we really wanted to celebrate that,” says Pennell. “Because that kind of passion and dedication is what we really want to foster on our platform. We really thought that ARMY is the perfect embodiment of that.” Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "title": "BTS NYC Pop Up Event: Amino App Aims to Take K-Pop Offline | Billboard – Billboard",
    "datetime": "2017-10-11T22:40:28+00:00",
    "url": "https://www.billboard.com/music/music-news/bts-amino-app-nyc-pop-up-art-gallery-event-7997582/"
}