{
    "text": "By Jun Ji-hye The debut of K-pop sensation BTS on the Grammy stage is expected to provide a boost for Korean game firm Netmarble as it prepares to launch the mobile game BTS World within the first half of the year. BTS took to the stage to present the award for best R&B album during the 61st Grammy Awards on Sunday at the Staples Centre in Los Angeles. It was the first time Korean stars had presented an award at the Grammys. BTS have now taken part in the world’s top three music awards, after their appearances last year at the Billboard and American Music Awards, highlighting their global popularity. This is all good news for Netmarble as it seeks to rebound from declining sales and operating profit last year. Seoul-based brokerage firm Shinhan Investment estimates that Netmarble made two trillion won (US$1.8 billion) in sales and 254 billion won (US$226.1 million) in operating profit last year, down 15.4 per cent and 50.1 per cent, respectively, from the previous year. The disappointing results were mainly attributed to the firm’s failure to produce hit games since the success of its previous mobile smash hit, Lineage 2: Revolution, which was released in December 2016. The firm has also suffered delays in releasing new games after the government implemented a new 52-hour work week limit in July last year. Now, the game firm is seeking to turn its fortunes around with the launch of BTS World. The game uses more than 100 video clips and 10,000 photos of the boy band, allowing users to nurture a BTS member. “We are aiming to launch BTS World in the global market within the first half of the year,” said a Netmarble official. Choi Jin-seong, an analyst from brokerage firm Hyundai Motor Securities, said: “Netmarble is likely to achieve meaningful results from BTS World as the game will allow a number of users worldwide to enjoy it easily.” ",
    "title": "BTS World mobile game should get boost from K-pop stars’ Grammys debut | South China Morning Post",
    "datetime": "2019-02-12T22:30:15+08:00",
    "url": "https://www.scmp.com/culture/music/article/2185783/bts-world-mobile-game-should-get-boost-k-pop-stars-grammys-debut"
}