{
    "text": "SOUTH KOREA MUSIC BTS K-pop group BTS performing at a live in-person concert at Jamsil Olympic Park in Seoul, South Korea on March 10. EPA Every year on July 9, millions of BTS fans around the world celebrate Army Day, dedicated to the group's fandom. Marking the day the name \"Army\" was first coined for the band's fans, this year is no different. Ahead of the ninth anniversary of Army Day, the record-breaking septet announced a special fan version of their hit song Yet To Come (The Most Beautiful Moment), to be released on July 13. “Many moments were spent together,\" member RM is heard saying in Korean, over clips reminiscent of the music video of Yet To Come (The Most Beautiful Moment), which was released last month. \"I am so glad we have the opportunity to reflect on our memories like this,” Jimin then says. “Whether near or far, I felt we were tightly connected through song and dance,\" Suga says. \"Our every moment was also a moment together with you,\" J-Hope is then heard saying. \"We are so blessed for being a part of your story,\" Jin chimes in. \"With a grateful heart, I hope to write more stories in the future with you,\" says Jungkook. V then delivers the last line in English, echoing a line from the song: \"The best moment is yet to come.” Yet To Come (The Most Beautiful Moment) is the lead single from the group's anthology album, Proof, which was released on June 10. Google is also joining in the celebrations for BTS Army Day, launching two collaborations to mark the anniversary. Starting Friday, fans who search for “BTS” on Google via mobile or desktop can unlock a special purple heart icon, based on the group's theme colour, that will appear on the right-hand side of their screen. Clicking on it will reveal a stream of purple balloons that fans can pop by clicking on them. The balloons with microphones inside reveal special audio messages from each BTS member. Google Arts & Culture also launched BTS x Street Galleries, which takes fans on a Street View tour of the cities and buildings that hold special memories for BTS members, from the UN in New York City to the Cheonggu Building in Seoul, the location of the group's label's first office where their story began. Last month, news that the group may be taking a hiatus shocked their global fan base, and even led to the stock of their label Hybe plummeting. Hybe set out to clear the confusion shortly after, saying that BTS want time to improve as individuals but will continue with group and solo activities, with a stronger focus on individual projects. The group has also since said they will continue to shoot their variety web series Run BTS. Biden BTS Members of the K-pop supergroup BTS join White House Press Secretary Karine Jean-Pierre during the daily briefing at the White House. AP ",
    "title": "BTS Army Day: how the K-pop group and fans are celebrating",
    "url": "https://www.thenationalnews.com/arts-culture/music/2022/07/09/bts-army-day-how-the-k-pop-group-and-fans-are-celebrating/"
}