{
    "text": "With their ‘Love Yourself: Her’ EP hitting No 7 on the US album chart – the highest ever for a Korean act – boy band BTS are starting something being compared to the 1960s British Invasion of The Beatles and The Rolling Stones By Kang Hyun-kyung South Korean boy band BTS are breaking through the glass ceiling of Asian pop in the United States. Before them, K-pop was depicted in the US as a just a phenomenon that sometimes went viral on the internet and that only enjoyed popularity outside the country. But this is poised to change. BTS are reaping the fruit of a decade of investment by the “Big Three” Korean entertainment companies – SM Entertainment, JYP and YG – to make the cut in the US mainstream market. Last year, the BTS EP Love Yourself: Her – containing the hit US single Mic Drop – hit No 7 on the US album chart, the highest ever for a Korean act. Some experts view the success of BTS as a harbinger of a revolutionary cultural change comparable to the “British Invasion” of the 1960s, referring to the success of several British rock ‘n’ roll groups in the US during that time including The Beatles, the Kinks and the Rolling Stones. Oh In-gyu, a professor at the Research Institute of Korean Studies at Korea University and director of general affairs at the World Association for Hallyu Studies, says there is definitely a parallel between the British Invasion and the “BTS phenomenon”. “Rock is a genre that initially began in the United States. British groups replicated it and the Beatles and other British groups dominated the American market in the 1960s. What we’re seeing now is that the Korean boy band BTS are popular among US teens because of their hip-hop music. Hip-hop was the brainchild of black American culture, but Korean singer Rap Monster, the frontman of BTS, does hip-hop as well as American musicians.” Oh says other K-pop groups will benefit from the popularity of BTS, and the golden days for K-pop music will begin to unfold in the United States. American talk show host Ellen DeGeneres likened her audiences’ enthusiastic reactions to BTS during her show on November 27 to the “Beatlemania” of the 1960s. Stephanie Choi, an ethnomusicologist and doctoral student at the University of California, Santa Barbara, who specialises in the global circulation of K-pop, says technology is the key factor behind BTS’ worldwide success. “The internet has changed the media flow from unidirectional to multidirectional between the West and non-West,” Choi says. “The Beatles had easier access to American audiences primarily because they were non-exotic, non-threatening white male singers who were first sanctioned by the American mainstream media. It is still difficult even for Asian-American singers to get attention from their own domestic mass media.” Choi says the influence of US mainstream media has declined today after the rise of social media, particularly YouTube. BTS, for example, were able to build a solid fan base all over the world after their music videos and performances went viral on the video-sharing platform. Oh says BTS offer an upgraded version of K-pop. “North American and European fans were sick and tired of K-pop bands. All of them were identical because the Big Three entertainment companies manufactured similar groups. BTS were initially a hip-hop group and enjoyed a strong reputation among hip-hop fans in North America and Europe. They became a global phenomenon after they embraced some K-pop elements, such as synchronised dance moves, in their performances.” The K-pop fan base around the globe has more than doubled in the past five years. According to experts, the figure hovered around 30 million in 2013. It surged to 70 million in 2017, according to figures provided by K-pop sites such as Soompi, the longest-running K-pop website, which was founded in 1998. The South Korean talent search show Show Me the Money has often served as a springboard for global fame. Oh says that since 2012, several underground Korean rappers have risen to stardom overseas after appearing on the show, broadcast on the country’s Mnet music cable channel. Each episode of the show is also broadcast the following day on YouTube. Artists such as G-Dragon, Dok2 and CL, the lead rapper of the girl band 2NE1, were the main beneficiaries of the show. In 2016, Big Bang’s G-Dragon, for instance, earned US$44 million, more than the US$33.5 million of American rock band Maroon 5, one of the highest-paid bands in the United States. CL, meanwhile, became the first Korean singer to crack the top 61 on the US Billboard chart in 2014 for her album Crush. She was featured on CNN and was described as a singer poised to be a mega star. Their success in the US mainstream market was the result of many years of endeavour by Korea’s Big Three entertainment companies to crack the US market. Among those Big Three, JYP was the most active. Founder Park Jin-young, a singer-songwriter and producer, initially went to the United States in 2003 to pave the way for K-pop. In an interview, he said his goal was to write songs that could make the top 10 on Billboard within a year. There was some progress, but his first attempt to place K-pop in the US mainstream market failed. He tried again in 2009, taking four-member girl group Wonder Girls to the US. Back then, Wonder Girls were one of the most popular K-pop acts in South Korea. Park reportedly insisted they leave Korea to join his experimental tour to the United States to sow the seeds for K-pop’s future success in that market and the girl band served as the opening act for the Jonas Brothers’ US tour. Wonder Girls travelled with the American pop group to 50 cities for live shows, but the tour did little for their popularity in the US. One of their singles reached No 76 on the Billboard charts, but their album only sold about 20,000 copies. Disappointed, Park and Wonder Girls returned to Korea in 2012. SM Entertainment chose to take a less travelled route to bring K-pop to the US. Founder Lee Soo-man teamed up with YouTube to broadcast streaming of K-pop groups. He also failed, but his experimental YouTube partnership turned out to be something of a game-changer. SM girl group Girls’ Generation became a sensation, pushing the K-pop fan base beyond Asia. “In retrospect, SM’s Lee was right,” Oh says. “YouTube helped K-pop groups go viral on the internet and his business partnership with social media helped increase fanbases all across the globe. Girls’ Generation was a milestone K-pop group because they have the most accumulated YouTube views among K-pop groups.” South Korean singer Psy set another milestone in K-pop, with his Gangnam Style music video receiving more than three billion YouTube views since it was posted in 2012. He was the first Korean singer to achieve global fame, but his popularity, however, ran short as his follow-up tracks didn’t receive as much attention. “Gangnam Style was phenomenal, but Psy’s persona was consumed as a character, not as an artist,” Choi says. “He didn’t have a strong fan base like other idol groups, but [US promoter] Scooter Braun found him marketable and introduced him to the American mass media. Despite his long career and musical talent, Psy was depicted in the United States as a hilarious, thus non-threatening, Asian male stereotype.” Although his success may have been a one-off, Psy led people involved in the American entertainment industry to realise that Korean music and singers can be a gold mine. ",
    "title": "BTS pave way for K-pop golden age in US, achieving what Psy and Wonder Girls failed to accomplish | South China Morning Post",
    "datetime": "2018-01-13T20:00:45+08:00",
    "url": "https://www.scmp.com/culture/music/article/2127984/bts-pave-way-k-pop-golden-age-us-achieving-what-psy-and-wonder-girls"
}