{
    "text": "BTS, a world-famous seven-member South Korean boy band, performed two hit songs for eight minutes at the New Year’s Rockin’ Eve concert at Times Square in Manhattan, New York on the night of Dec. 31 (local time). BTS fans celebrated 2020 by singing along the group’s songs in Korean. Ryan Seacrest, the event host, introduced BTS as a group that enthralled the entire planet, according to Korea’s Yonhap News Agency. The K-pop group opened their performance with “Make It Right” on the iconic red steps. Then, they moved to the main stage and performed another hit song “Boy with Luv.” After the performance, they bade New Year’s greetings, shouting “Happy New Year.” The performance of the sensational global K-pop band filled Times Square with cheers of excitement. Their fans sang and rapped the songs’ lyrics in Korean and chanted together. American Broadcasting Company (ABC)’s New Year’s Rockin’ Eve 2020 is the most-watched New Year eve live show in the United States. Viewed by up to 25 million Americans, the show takes place at several cities across the United States including Los Angeles, New Orleans and Miami. The show invites top musicians of the world. Along with global phenomenon BTS, hip-hop star Post Malone, country music star Sam Hunt and multi-platinum artist Alanis Morissette, and the cast of Broadway musical “Jagged Little Pill” were invited to the show this year. BTS staged pre-recorded performances on New Year’s Eve show at Hollywood in 2017, but this is the first time the group has performed live at Times Square. The superstar band became the second K-pop artist to perform on the New Year’s Eve stage at Times Square after Korean singer Psy in 2012. At that time, a million attendees crowding at the square performed the “horse-riding dance” to Psy’s single “Gangnam Style.”\n\r\nThe New York Police Department (NYPD) posted photos of its officers posing with BTS fans at Times Square on its official Twitter account. The NYPD estimated that at least 1.5 million people attended the New Year’s Eve concert at Times Square. At least one million people attend the show every year. Mild weather on the New Year eve with a daytime high temperature at 44 degrees Fahrenheit (6.7 degrees Celsius) also warmed up the air of the festivity. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "BTS Rings in New Year with Performance on Times Square Live Stage in New York City - Businesskorea",
    "datetime": "2020-01-02T09:19:27+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=39731"
}