{
    "text": "File picture of Tom Cruise and Simon Pegg displaying finger hearts, an integral part of K-culture\n                                                                    Sourced by the correspondent The rise of the hallyu wave has been extensive, especially in the last few years. With acts such as BTS spinning out one amazing hit after another and the immense popularity of movies and shows like Parasite and Squid Games, Korean culture as well as language has garnered widespread interest. According to the OED, the word “hallyu” itself means “the increase in international interest in South Korea and its popular culture, esp. as represented by the global success of South Korean music, film, television, fashion, and food”. However, the meaning of this borrowed word has now expanded to refer to South Korean pop culture and entertainment itself. With Korean content or K-content becoming more and more globally accepted and followed, the language itself is also exporting itself to a more global audience. According to the OED, in the late 1990s, Korean was shortened to simply “K-” and combined with other words to form nouns relating to South Korea and its popular culture. Among the oldest of these formations, K-pop, first appears in an article in the October 9, 1999 issue of Billboard magazine. It was first included in the OED in 2016 and revised as part of the current update. “The adoption and development of these Korean words in English also demonstrate how lexical innovation is no longer confined to the traditional centres of English in the United Kingdom and the United States—they show how Asians in different parts of the continent invent and exchange words within their own local contexts, then introduce these words to the rest of the English-speaking world, thus allowing the Korean wave to continue to ripple on the sea of English words,” said the OED in their blog on the 26 new additions. These newly added words are related to Korean food, popular culture and more. Take a look at some of these new words that have been added along with their usage in popular K-content. Aegyo (n.) Cuteness or charm, esp. of a sort considered characteristic of Korean popular culture. Also: behaviour regarded as cute, charming, or adorable. (adj.) Characterised by ‘aegyo’, cute, charming, adorable. Aegyo is a very well-known word in the world of hallyu with actors and idols often showcasing it. One of the most famous scenes featuring aegyo is this one from the 2017 K-drama Fight For My Way where Choi Ae-ra does it for Ko Dong-man. Bulgogi (n.) In Korean cookery: a dish of thin slices of beef or pork which are marinated then grilled or stir-fried. K-dramas feature a plethora of delectable Korean dishes that is enough to make your mouth water while watching them. Bulgogi is a commonly eaten delicious dish and this scene from the drama Weightlifting Fairy Kim Bok-joo proves so as the main character Kim Bok-joo and her friends devour it. Chimaek (n.) In South Korea and Korean-style restaurants: fried chicken served with beer. This delicious combo was popularised by the 2014 K-drama My Love from the Star when the character Cheon Song-yi said how a snowy day is the perfect time for chimaek. Following this, there was a huge surge in the popularity of this combo in Korea as well as internationally. Fighting (Hwaiting) This is an expression “esp. in Korea and Korean contexts: expressing encouragement, incitement, or support: ‘Go on!’ ‘Go for it!’” Whether or not you are a fan of K-content, you must have heard this phrase. It is an extremely common phrase that is often said by K-pop idols as well, like BTS did in their message of hope and encouragement to fight against the Covid-19 pandemic. Hanbok (n.) A traditional Korean costume consisting of a long-sleeved jacket or blouse and a long, high-waisted skirt for women or loose-fitting trousers for men, typically worn on formal or ceremonial occasions. Hanboks can be most commonly seen in historical K-dramas like Mr. Queen. Nowadays, modernised hanboks, made to be more comfortable and convenient for wear, are also gaining popularity. Kimchi (n.) In Korean cuisine: a staple dish consisting of fermented cabbage flavoured with garlic, ginger, fermented shrimp paste, red pepper powder, and spring onions, typically served as a side dish or as an accompaniment to rice. If you are a fan of K-content, chances are that kimchi is one of the first food items that caught your eye. This staple side dish is usually served with rice, ramyeon (noodles) and almost at every meal. Take a look at the scene from What’s Wrong with Secretary Kim where Secretary Kim shows Lee Young-joon to have kimchi with his ramyeon. Manhwa (n.) A Korean genre of cartoons and comic books, often influenced by Japanese manga. Also: a cartoon or comic book in this genre. Manhwas always make for fun, enjoyable and engaging reads. Some of the most popular manhwas include Tower of God, True Beauty, I Love Yoo and more. Search operations were also underway at eight other flats including the residences of Mallick's former personal assistant, while he was the food minister ",
    "title": "BTS (K-pop band) | The rise of Korean culture - Telegraph India",
    "url": "https://www.telegraphindia.com/culture/the-rise-of-korean-culture/cid/1835888"
}