{
    "text": "All Headlines North Korea Sports Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies URL is copied. By Park Boram SEOUL, Dec. 11 (Yonhap) -- The sensational global ascent of K-pop band BTS has brought to the fore the emergence of a new breed of globally connected, dedicated fans as represented by ARMY, the group's fandom. Powered by the connectivity of the internet and social network services, ARMY engages in organized transnational operations to download BTS songs and vote for the septet en masse, spearheading the band's victories on Billboard and major American music awards. BTS fans also helped spawn a new YouTube \"reaction video\" genre featuring fans' simultaneous reaction to K-pop stars' performances, while a hoard of ARMY fans converted their fannish passion into actual \"pilgrimage\" trips to South Korea to follow the footsteps of BTS. Such phenomena reshaped the landscape of pop music culture in the era of cross-border internet and communication technologies, scholars said during an academic seminar held in Seoul on Wednesday. This image shows the academic seminar \"K-pop Beyond BTS\" held at Yonsei University in Seoul on Dec. 11, 2019. (Yonhap)  \"K-pop fandom is a highly organized network community with specific communal goals. Fans will mobilize their resources via digital media and technology and perform affective labor to achieve those goals,\" Areum Jeong, an assistant professor at Sichuan University-Pittsburgh Institute in China, said during the seminar, \"K-pop Beyond BTS,\" hosted by the Korean Society for Journalism & Communication Studies. \"While digital media and technology facilitate collective experience, the power of technology can shift to the fandom, as fandom's fervor and mobilization motivate digital media and technology to develop more cutting-edge resources and services,\" the professor said. Lu Tian, a Ph.D candidate at Hong Kong Baptist University, focused on how the popularity of BTS led to cross-border flows of people, texts and imagery. \"'Bangtan Tour' should be seen as a participatory practice of global BTS fans, whose affective commitments to the idol group create additional values of places,\" she said, referring to ARMY's pilgrimage tours to South Korean places related to BTS members. Another scholar, Michelle Cho, an assistant professor at the University of Toronto, attributed K-pop's breakout global success to the emergence of new media. \"K-pop is a visual culture, not simply a musical genre ... K-pop's growing visibility is entirely attributable to a nexus of new media forms,\" she said in her presentation during the seminar. \"Social media participation constitutes an immersive, everyday form of meta-media ... the vicarious media I examine shows reflexivity to amplify rather than contain affective excess,\" she said, referring to how SNS communications between BTS and fans bind them tightly together. Seoul National University professor Hong Seok-kyong said BTS is a major symbol of today's growing transnationalism. \"K-pop is no longer an East Asian phenomenon. It's global pop culture,\" she said, adding that the ascent of BTS has redefined masculinity as previously defined by the West. This image shows scholars in discussion during the academic seminar \"K-pop Beyond BTS\" held at Yonsei University in Seoul on Dec. 11, 2019. (Yonhap)  pbr@yna.co.kr(END) All News National North Korea Economy/Finance Biz Culture/K-pop Sports Images Videos Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies Korea in Brief Useful Links Festival Calendar Weather Advertise with Yonhap News Agency ",
    "title": "BTS symbolizes cross-border pop culture in new media era: scholars | Yonhap News Agency",
    "datetime": "2019-12-11T17:54:47+09:00",
    "url": "https://en.yna.co.kr/view/AEN20191211009900315"
}