{
    "text": "But some have been taking the increased global exposure as an opportunity to introduce Korean museums and heritage sites to the world by filming performances at the country’s major tourist attractions. Last month, rapper and singer-songwriter CL shared a performance of her latest single Hwa filmed on CBS’s The Late Late Show with James Corden. Because the singer wasn’t able to physically be on the show due to the prolonged coronavirus pandemic, her rendition of the song was filmed at the National Museum of Modern and Contemporary Art (MMCA) in Seoul. Her performance was pre-recorded at the “MMCA Hyundai Motor Series 2020: Haegue Yang – O2 & H2O” exhibition and Jongchinbu, or the office of royal genealogy during the Joseon Kingdom. Originally located near Gyeongbokgung Palace, the historical building was moved to Jeongdok Public Library in Bukchon in 1981, but was returned to its original home near the garden at the MMCA in 2013. Joined by a group of masked backup dancers, the former 2NE1 member paid tribute to Korean art and heritage, delivering the track’s chorus in modernised traditional Korean clothing. “I frequently visit the MMCA whenever I’m in town. When I expressed my wish to film my performance of Hwa at the MMCA to introduce spots that represent Korean culture, they happily accepted my request,” CL said during an online press conference for the release of two songs Hwa and 5Star. This could be a win-win strategy for both the artist and the museum, as the latter has seen a decline in the number of visitors following the imposition of preventive social distancing measures. After a lockdown, it reopened in September, but has capped the number of visitors to a maximum of 200 allowed in each time slot. To stay afloat, it has curated the contactless online performance series MMCA Live. “We were well aware that CL is a huge fan of Korean contemporary art. This was the first time in the history of MMCA that we collaborated with a K-pop artist for a performance. The MMCA and Jongchinbu are located in central Seoul where modernity and tradition coexist, so it holds so much importance for our culture,” a museum official said. Meanwhile, the BTS Week special on NBC’s The Tonight Show Starring Jimmy Fallon, which was held from September 29 to October 3, included two performances in Gyeongbokgung Palace. On YouTube, the video has racked up more than 24 million views, which is even higher than the band’s performance of its last single Dynamite, which was filmed at a roller skating rink and has 17 million views. The band also sang Mikrokosmos at Gyeonghoeru Pavilion at the palace, where royal banquets were held. “I’m so happy they got to show Gyeongbokgung Palace to the world through their performance. I visited last year and was blown away by it in person after hearing about it so much before visiting. Absolutely breathtaking,” a fan tweeted. “Gyeongbokgung Palace is the representative legal palace of the Joseon Kingdom, and Gyeonghoeru Pavilion and Geunjeongjeon are two iconic traditional structures in the palace. BTS’ performances were filmed at the palace for that reason,” a CHA official said. She added that the administration is currently in the early stages of developing a BTS tour. “As of now, the places to be included in the BTS tour are Gyeongbokgung Palace and Korea House. As you know, BTS performed Idol and Mikrokosmos in the palace. In January 2018, the band visited Korea House to shoot the Billboard magazine cover,” the official added. “Visitors stand in line to take photos at Nogeumjeong Pavilion and Haeringwan.” Korea House became the residence for James A. Van Fleet, who served as commander of the 8th US Army during the Korean war, according to CHA. Having contributed to the promotion of Korea-US relations, an award was named after him. In 2020, BTS won the Van Fleet Award given by the Korea Society. This article originally appeared on  Korea Times. Want more stories like this? Sign up  here. Follow STYLE on  Facebook,  Instagram,  YouTube and  Twitter . BTS performed live at Gyeongbokgung Palace on The Tonight Show Starring Jimmy Fallon, while 2NE1’s CL streamed from Seoul’s MMCA for The Late Late Show with James Corden – so why are K-pop idols suddenly so interested in promoting Korean culture? ",
    "title": "BTS members performed Idol and Mikrokosmos for Jimmy Fallon at Gyeongbokgung Palace and will visit Korea House on tour – why are K-pop idols getting cultural? | South China Morning Post",
    "datetime": "2020-11-18T06:00:29+08:00",
    "url": "https://www.scmp.com/magazines/style/celebrity/article/3110265/bts-members-performed-idol-and-mikrokosmos-jimmy-fallon"
}