{
    "text": "By Dong Sun-hwa K-pop sensations BTS may have broken into the massive US music market, but the seven-piece boy band and their followers are still battling prejudice and discrimination against Asia and its pop culture. Trolls still taunt BTS online over what they argue are signs of the members’ lack of masculinity – wearing make-up, dying their hair rainbow colours and having fancy outfits. They also accuse them of being puppets manufactured by K-pop companies with no musical skills. And the BTS Army fan club also regularly comes under fire for supporting the boy band. The “Koreaboo” phenomenon in the US is an indication of this prejudice and discrimination, according to researchers at Sogang University in Seoul. Although Koreaboo is a derogatory term referring to people too obsessed with Korean culture, it is now widely used in the US to describe K-pop fans. “K-pop fans attempt to distinguish themselves from the Koreaboos out of self-defence,” researcher Marisa Lilette Luckie said during the “K-pop beyond BTS: Media technology, creative industries and fandom culture” seminar at Yonsei University, Seoul, last week. Luckie and her co-researchers – Won Yong-jin, Pang Hui-kyong and Lee Jun-hyung – said the lumping together of Koreaboos and regular fans was a sign that K-pop had not been fully embraced in the US. “To prove they are ‘normal’ followers who respect Korean culture, they criticise the Koreaboos … This shows there is still a bias against Asian culture in America.” Seventeen researchers from around the globe gave lectures on BTS and South Korean culture during the seminar. They said BTS had been changing the perception that “Asians are unattractive”, but discrimination had not been completely rooted out. “The phenomenon also shows that today, discrimination against Asia and its people has become more indirect,” Luckie said. “People now discriminate against those who follow Asian culture as well. “The discrimination has become ethnic too. As the culture of ethnic minorities in the US gains popularity, Americans … have displayed signs of more ‘specific’ ethnic discrimination.” The seminar was organised by the Korea Society for Journalism and Communication Studies and sponsored by BTS’ agency Big Hit Entertainment. It was held to discuss various cultural phenomena surrounding the Billboard-chart-topping BTS. ",
    "title": "BTS fans called ‘Koreaboo’ in the US; shows bias against Asian culture continues in the country | South China Morning Post",
    "datetime": "2019-12-14T22:00:11+08:00",
    "url": "https://www.scmp.com/lifestyle/entertainment/article/3042021/bts-fans-called-koreaboo-us-shows-bias-against-asian"
}