{
    "text": "K-pop boy band BTS creates one of K-pop's most subversive tracks through the gentle berating of \"Pied Piper.\" By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tTamar Herman Since The Beatles led the British Invasion, foreign boy bands have relied on the ardent support of their fans to propel their careers in the American music market. BTS, the Korean boy band that beat out Justin Bieber for the top social artist award at this year’s Billboard Music Awards, are hardly any different, and the septet has always thanked their fiercely passionate fan ARMY for its support. Becoming the most prominent Korean musical act in the U.S market since Psy, the K-pop group is undeniably the It boy band of 2017 and it’s all due to the fervor of their fans. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tBTS\t\t\n\t\t\t\t\t\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news Interesting, it seems that excitement that’s been key to the band’s success is something the group is ready to see die down a bit, based on the standout track “Pied Piper” from their recently released Love Yourself: Her album. Her’s “Pied Piper” is BTS’ most subversive song of their career, thanks to its takedown of the very fan culture that has helped the act thrive. A take on K-pop’s rampant and highly profitable fan culture, “Pied Piper,” is BTS doing what they do best: addressing a societal problem through their jaunty music. In this case, the obsessive nature of fans, originally derived from “fanatics.” In line with the band’s career-long focus on urging their youthful audience to pursue its own dreams, the boy band’s mellow nu-disco-imbued track serves as a playful reminder to ARMY that a boy band isn’t life’s be-all and end-all. In an industry dependent on the taste and affections of its audience, BTS’ frank approach to the dangers and realities of the intense dedication from fans and the band’s role as a distraction in those people’s lives, is as contradictory as the group has ever been towards its place in pop music. “Now stop watching and study/ Your parents and bosses hate me,” says Rap Monster in the first verse, referring to the time that fans spend absorbing BTS related content and how it distracts from their daily lives. “I know you don’t decide what you like/ stop [and] interpret the music videos later.”  Filled with lyrical tough love, warm affection is audible through the soft melody and the lighthearted delivery of the raps, turning the song away from being a bitter clap back and into a guiding ode from BTS to their fans, overflowing with paternal tenderness. Penned by three members of the group — Rap Monster, Suga, and J-Hope — their company’s CEO “Hitman” Bang and several other regular collaborators, the lyrics are rife with nods to the German legend of the titular Pied Piper who led the children of Hamelin away from their parents forever as BTS poise themselves as an alluring danger that is “taking over you.” “Follow the sound of the pipe/ Follow this song/ It’s a little bit dangerous but I’m so sweet” sings the band during the chorus. “I came to save you, I came to ruin you.” The track similarly refers to the Biblical tale of the Garden of Eden, with the band depicting themselves both as paradise and as the fruity temptation that led Adam and Eve away from the straight and narrow.  The literary references are nothing new for BTS. Fans have discerned references to works by the likes of Herman Hesse and Haruki Murakami in the band’s past music videos and songs. But the message of “Pied Piper,” with the group positioning itself as a danger to its fans, is unlike anything that the boy band and few other K-pop acts, have ever done before. While there are songs that address the potential for dangerous obsession among fans — Epik High’s “Fan” and EXID’s “Ah Yeah” come to mind — BTS is unique for both blithely taunting their fans for their intensity while simultaneously claiming accountability for making them that way. While hardly the only tongue-in-cheek track on the album — the Seo Taiji-emulating ”Mic Drop” is a swag track playing up BTS’ rise to the top while “Go Go” is a reggae-trap hybrid that uses popular Korean slang to tell the listeners to “stop worrying and just go” — the blatant approach of “Pied Piper” to criticize the very space within which the band thrives is precisely what makes them so beloved by fans around the globe.  Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "title": "BTS’ ‘Pied Piper’ Meaning: Song Is Filled With Tough Love Towards Fan Culture | Billboard – Billboard",
    "datetime": "2017-09-21T00:15:47+00:00",
    "url": "https://www.billboard.com/music/music-news/bts-pied-piper-is-filled-with-tough-love-towards-fan-culture-7972936/"
}