{
    "text": "Print The once-cordial ties between South Korea and its biggest trading partner have soured due to the perception that China has targeted businesses, sports teams and culture to protest deployment of an advanced U.S. anti-missile system in South Korea. A South Korean candy maker, a chocolate factory, video games and a soccer team have suffered from actions many in South Korea view as retribution and Chinese have vandalized some South Korean-run stores.\n\nBeijing is incensed over the Terminal High-Altitude Area Defense system. The U.S. and South Korea say it's needed as a defense against a belligerent North Korea but China believes the system could be used against its own missiles as well.\n\nChina denies any direct link between its ire over the U.S. missile system and recent troubles for South Korean businesses. Some recent developments viewed as retaliation:\n\nBittersweet: Lotte's lament \n\nChewing-gum maker and retail giant Lotte Group, South Korea's No. 5 business group, took the brunt of the backlash after agreeing to let one of its golf courses in southeastern South Korea be a site for deploying THAAD. Lotte Duty Free said its shopping websites were knocked offline for more than six hours a few days after the agreement was signed, in what it believes were cyberattacks by Chinese, based on an analysis of IP addresses.\n\nAt least 55 of 99 Lotte Mart discount stores in China were shut in early March for a month each after surprise inspections found violations of fire safety standards. Five Lotte department stores and 13 smaller supermarkets remain open, the company said Friday.\n\nA Hershey chocolate factory in Shanghai jointly operated with Lotte suspended production earlier this month for what Hershey said was maintenance for a routine inspection but South Koreans linked it to the spat.\n\nK-Pop, K-drama\n\nSince last year, some K-pop and K-drama stars have cancelled visits to China due to visa delays. South Korean actor Ha Jung Woo could not get a visa needed for a movie project with China called \"The Mask,\" starring Chinese star Zhang Ziyi, his agency confirmed on Wednesday. The representative for Ha, who was not authorized to talk about the matter and thus asked not to be identified, would not say if the project fell through because of the THAAD problem. Regional satellite broadcasters have reportedly been ordered to suspend broadcasts of South Korean television dramas. Online distributors such as Youku, a homegrown YouTube clone, have apparently also stopped buying broadcast rights to South Korean shows. On Youku, \"Guardian: The Lonely and Great God,\" a series featuring South Korean actor Gong Yoo, was no longer on the platform as of Friday. The fantasy-romance drama, which aired its final episode in January, had been available on Youku but reports emerged in February they were removed. Other shows haven't made new episodes available, though past episodes can be seen. In January, South Korean soprano Jo Sumi said her concert in China was canceled, possibly due to the diplomatic spat.\n\n\"I had been preparing for since I got the invitation two years ago, but there was no word on why it was cancelled,\" Jo, a Grammy Award-winning soprano, said on Twitter. \"It's very sad that conflicts between countries are getting in the way of culture and the arts.\"\n\nFootball\n\nChina and South Korea play each other in the central Chinese city of Changsha on March 23. China reportedly refused to let the team take a chartered flight. That could leave them at a disadvantage, and also limit the number of supporters they can bring. China trails in its group, and a loss to South Korea could anger local fans, adding to tensions.\n\nCosmetics\n\nSome South Koreans believe China's recent rejection of some South Korean cosmetic products also was fallout from the THAAD issue. Beauty companies whose products are popular in China, like Amorepacific and LG, have downplayed suggestions that such actions were linked to politics, saying they have not noticed any meaningful decline in sales to Chinese.\n\nTough on tourism\n\nEffective March 15, China told South Korean travel agencies not to sell group tour packages to South Korea. Instead, Chinese must seek visas individually. Both Italy's Costa and Royal Caribbean Cruises have cancelled port calls in South Korea by their cruises originating in China. One place likely to be hit hardest is the southern resort island of Jeju, where mom-and-pop shops and travel agencies rely on Chinese tourists. An official with Jeju's immigration office, who declined to be named, said that as of Thursday no cruises from China were calling at the semi-tropical island.\n\nSouth Korean airliners are cutting flights to and from China as reservations drop.\n\nAnti-Korean sentiment in China\n\nSouth Koreans have been shaken by reports of anti-Korean sentiment among Chinese.\n\nOne South Korean exchange student at a university in Beijing said a Korean restaurant in the Chinese capital turned him away. \"Maybe I didn't look Chinese. I don't know how they found out but they told me to get out, saying they don't sell meals to Koreans,\" Ji Wonik said via a mobile messenger app. \"I was angry but I just felt bad so I left the restaurant.\"\n\nWith quiet government urging, some schools have canceled trips to China as a precaution.\n\n\"Anti-Korean sentiment is running high in China due to the THAAD issue. Given the local political and economic situation, we asked schools to visit domestic destinations instead of going overseas,\" said Ahn Hee-won, an education supervisor in Daegu.\n\nA video uploaded to YouTube on Monday showed what it said was a Chinese nightclub playing an anti-Korean video loop on four video monitors as people sat drinking. It flashed the red \"no\" symbol of a circle with a diagonal line over a South Korean national flag and in ensuing frames, the word \"KOREA\" is followed by scenes showing two hands with their middle fingers raised and an epithet beginning with \"F\" in capital letters.\n\nJi, the Korean student in Beijing, says when he sees such signs of anti-Korean sentiment, he regrets going to China.\n\n\"But I didn't tell my parents because they might feel terrible, too,\" he said. \"I hope the government could quickly come up with diplomatic measures.\"  ",
    "title": "Candy, Makeup, K-Pop Get Doused Amid China's Ire over THAAD",
    "url": "https://www.voanews.com/a/candy-makeup-k-pop-get-doused-amid-china-ire-over-thaad/3772444.html"
}