{
    "text": "Extensive renovations have been made to the historic Cape Girardeau Oliver-Leming House, now referred to as the Flag House, and they are nearing completion. The nearly $350,000 spent on renovations so far have been underway for the past several years. The house was originally built in 1895. According to a brochure, “The Oliver-Leming house was the fulfillment of a life-long dream of it’s designer, builder and original owners, State Senator Robert Burett Oliver and his wife, Marie Elizabeth Watkins, the designer of the state flag of Missouri.” Located at the head of North Street and Ellis Street at 740 North Street, Senator Oliver originally named the property Oliver Heights. At the time, the property was on the unsettled northern border of Cape Girardeau. In Oliver’s original pencil-sketch of the property, it was a plantation-type layout with an allee presentation where Ellis Street is currently located. The original sketch included a barn, orchard, drive and the main house. The Olivers lived in the house for over 45 years. The house was then purchased as a gift to Thelma Leming from her husband where they also lived for over 45 years. The Lemings made several small renovations to the house including adding wood panelling on the walls and ceilings and building an add-on bedroom off the back of the house in the 1950s. The current owners of the house, Dr. Bert and Mary Ann Kellerman, purchased the property in 2002. They were interested in purchasing the historic home because nearly everything in the home was original from when the house was built in 1895. The original blueprints of St. Louis architect J.B. Legg have been preserved with the house along with 1,100 boxes of historical information concerning the Oliver family and the history of the house that are now owned by the State Historical Society. “From our view-point, the documentation historically was critical,” Mary Ann Kellerman said. “It made it an important house to retain and to restore.” Mary Ann said she and her husband made an offer on the house because they knew it needed to be saved and preserved due to its rich history. “The original things are all here, but [the house] needed everything, so new wiring, new plumbing, obviously a new roof, new heating and air conditioning up and down,” Mary Ann said. “The biggest thing was to rip all the panelling off the ceilings and walls, and to replaster.” They have also restored the original windows and painted the exterior, but according to Mary Ann, the house is basically as it was in 1895. “This is probably one of the most authentic preservation projects in the whole state because we have the original blueprints, the original printed-typed specifications,” Mary Ann said. “So anything we’re doing, we can just refer to the typed [specifications] from 1895 and do it exactly like it was done then.” Mary Ann said in terms of authenticity, the Flag House is way ahead of many of the projects in the United States because other preservation projects require research to find the original state of the historic building. Since the blueprints and original documentation have been preserved, they know exactly what was there in 1895, and they know it has not been changed. “Because we’re historians, we are absolutely against replacing anything that you don’t have to replace,” Mary Ann said. After the renovations are completed, the Kellermans intend to live in the house themselves. They have set up a private foundation called the Kellerman Foundation so that upon their deaths the house will be handed over to the foundation and turned into a museum. Currently the foundation focuses on other foundation projects and will be unaffiliated with the Flag House until their deaths for legal reasons.  ",
    "title": "Cape Girardeau’s Historic ‘Flag House’ Receives Over $350K In Renovations",
    "datetime": "2014-11-03T23:26:01",
    "url": "https://www.krcu.org/arts-culture/2014-11-03/cape-girardeaus-historic-flag-house-receives-over-350k-in-renovations"
}