{
    "text": "We earn a commission for products purchased through some links in this article. From Miss Sohee's flamboyant demi-couture to Andersson Bell's Seoul street style-inspired designs, Korean fashion has never been bigger. We’ve binge-watched Squid Game, and been mesmerised by Oscar-winning Parasite. We've listened to those catchy BTS beats on repeat, and lusted after Lisa from Blackpink’s Celine T-shirt and jeans wardrobe.  We may even have been one of the 4.5 billion people to watch Psy’s high-energy Gangnam Style on YouTube... Or one of the 11.6 million TikTokers who have taken part in the #gangnamstylechallenge. It seems we just can't get enough of Korean culture. Little wonder then, that London’s V&A Museum recently opened a barn-storming new show in celebration, running until June 25, 2023. Entitled Hallyu! The Korean Wave, the exhibition is divvied up between K-culture, K-drama, K-pop and, most excitingly of all, a roomful of fashion showcasing updated versions of Korean traditional hanboks (a tight-fitting cropped jacket and bell shaped skirt) as well as a range of exceptional designers to keep an eye on. There’s the romantic ruffled organza gown with matching pearl trimmed hood by Kyu Shin and Ji Park of five-year-old Seoul label Blindness; as well as a graphic neoprene and sequinned gown, full of street signs and typography by Korean-American Kathleen Kye of Kye – whose fans already include the likes of Kourtney Kardashian. These and other Korean fashion designers are now riding the crest of this unstoppable wave, whereby Korean culture strengthens its grip on the rest of the world. Seoul-born, London-based designer Rok Hwang of Rokh is leading the curve. He shot to fashion fame after winning the LVMH Special Prize in 2018 and has been showing at Paris Fashion Week since February 2019.  Launching his label in 2016, after stints at Phoebe Philo’s Celine, Chloé and Louis Vuitton, he has developed a knack for adding youthful pizzazz to classic pieces – like turning a trench coat into this season’s statement by making it in shiny electric blue PVC, or his punk buckled and strapped sharp tailoring, including a revamped blazer with dogtooth print and a cropped cut. Some Korean fashion trends become big – like the cropped tops, jackets and more.  Whilst Seokwoon Yoon was making backless suits for Seoul Fashion Week in March 2021 long before Timothée Chalamet stepped out in a backless top at the recent Venice Film Festival – and promptly stole the show. Another emerging designer who is making waves on the world stage is Seoul-born, New York-based Ashlynn Park. She recently reached the finals of 2022's LVMH Prize for her eponymous brand Ashlyn, that beautifully mixes Korean tailoring with Western drapery and pattern-cutting skills honed at Yohji Yamamoto – and has just been picked up by Matches as part of this season's Innovator programme. You need only glance at the burgundy bandeau crepe dress with asymmetric ruching or black puff-sleeve cotton shirt to appreciate Park's talent. London universities are also a hotbed for Korean designers to hone their skills.  Take London-based Sohee Park, better known as Miss Sohee: the  flamboyant pink-and-gold peony dress from her Central Saint Martins 2020 graduate collection was worn by Miley Cyrus when she performed on the BBC’s Graham Norton Show just a few months later, and currently lights up the fashion room at the V&A’s Hallyu! exhibition. Her dramatic and distinctive 'demi-couture' designs even caught the attention of Domenico Dolce and Stefano Gabbana, who supported her first-ever on-schedule show from the sidelines of Milan Fashion Week in February 2022. And now, Miss Sohee has debuted on Net-a-Porter as a 'new name to know', with a party-ready collection that oozes hot glamour – think sassy blue, crystal embellished cropped tops with integrated gloves, and a chic strapless metallic peplum minidress embellished with faux pearls as well as crystals. Another London-based Korean designer who has long been a go-to for discerning fashion lovers from Jorja Smith to Meghan Markle and Michelle Obama, is the inimitable Rejina Pyo. Starting her much-loved label in 2013, Pyo is now stocked by leading retailers including Matches and Selfridges, most recently making headlines when she dressed the former First Lady in double denim for Ellen Degeneres' now-defunct show. As Grazia Daily put it, the co-ord was 'the latest proof that she [Obama] is the coolest woman on the planet.' Quite right. The architectural tailoring of  Eudon Choi, meanwhile, has won him plaudits from the get-go – including a British Fashion Council and ELLE talent launch pad award in 2010 and emerging talent of the year award by WGSN in 2012.  And now even more so in his second year as creative director of Seoul-based, Paris-born luxury bag company Louis Quatorze. 'Korea is in my DNA,' said Choi from his Seoul atelier earlier this month. 'I just worked in the design industry in Korea and it’s very advanced... Korean women are dressed very well and they are so sophisticated, so I guess certain things are always there.  They are really into their tailoring and cut and fit, so this intuitively feeds into my work,' he explains. And just as there’s a strong street style scene in Korea, there’s a whole host of streetwear labels to discover too. Like cute-yet-edgy Bmuette run by design duo Byungmun Seo and Jina Um, which recently showed at London Fashion Week and last year undertook an inventive collaboration with Korean car icon, Hyundai, for a collection that upcycles materials from discarded car waste. Think seat fabrics transformed into shoulder patches and sleeves for track jackets, or seat belts as braces and detachable straps. Brothers Kevin and Terrence Kim of IISE are also names to watch, for their ability to update Korean fashion traditions with contemporary flair – see their utility jackets, trousers and shorts that feature Nubi stitching and quilting patterns. Whilst the likes of model Jieon Lee of Happly and Youngae Lee have re-interpreted the traditional hanbok for a project called 'Hanbok Wave': Youngae shortened it 'to add a youthful feeling', while Jieon turned its short top into a double-buttoned cropped blazer. Holly Tenser, womenswear buying manager at Browns Fashion, says Korea’s streets have also introduced Seoul-based Andersson Bell to the retailer this season – a mix of the country's signature street style with a minimalist Scandi aesthetic. 'They perfectly balance a streetwear-leaning aesthetic with a slightly retro, quirky, feminine edge,' explains Tenser. 'I especially love their playful crochet knit pieces, vintage-style t-shirts and their fun take on denim, often using patchwork or mixed washes to create interest.' 'Korean designers are making fashion feel fresh and fun again,' Tenser concludes. We couldn't agree more. Happily Ever Single: How We Love Now My Life In Fashion: Bethann Harrison Dina Asher-Smith On The Perfection Paradox My Life In Fashion: Claudia Rankine In Conversation: Naomi Klein The Rise Of Stressful TV Shows The 'Threatened Male' Vs Career Woman Stereotype The Interior Life Of Dr Barbara Sturm Behind The Lens When Free Speech Becomes Misogyny Why Sexual Violence Is Still Dominating Our News Everyone Is Obsessed With Marriage Right Now ELLE, PART OF THE HEARST UK FASHION & BEAUTY NETWORK We earn a commission for products purchased through some links in this article. ©2023 Hearst UK is the trading name of the National Magazine Company Ltd, 30 Panton Street, Leicester Square, London, SW1Y 4AJ. Registered in England. All Rights Reserved. ",
    "title": "Celebrating A New Wave Of Korean Fashion Designers",
    "datetime": "2022-11-11T14:45:00Z",
    "url": "https://www.elle.com/uk/fashion/a41777287/korean-fashion-designers-trends/"
}