{
    "text": " Culture July 12, 2018 /  By Arachika Kapoor /  New Delhi  The Korean wave in India has evolved from individual localised passion to a national phenomenon. Looking at the increasing number of K-culture fanatics in the country, the Korean Cultural Centre in India organised Changwon K-POP India 2018 that drew K-pop enthusiasts from all over the country. The event singled out representatives for the final stage of the K-pop competition to be held in South Korea. Upon setting foot inside the Siri Fort Auditorium, we were suddenly standing amidst a crowd of youngsters screaming ‘palli-palli’ (hurry, hurry in Korean) outside the main gate that restricted entry. Every time the sound of familiar Korean music could be heard from inside the auditorium, the screams were replaced by cheer for the associated Korean band. The entry to the Changwon K-POP India 2018 competition on June 9, was blocked as the venue was already house-full even before the competition started! Siri Fort (south Delhi) saw a gathering of thousands of K-pop fans this week to attend the Changwon K-POP India 2018 contest that is a part of the unique festival organised by South Korea’s Ministry of Foreign Affairs and Korean Broadcasting System (KBS) – the K-Pop World Festival 2018. Looking at the enthusiasm and love the crowd has for everything Korean, the management at the event finally let everyone in, despite insufficient space to seat everyone. Since its launch in 2012, the competition has been rapidly growing, as the presence of Korean pop culture in India has been spreading ever since. This year, during the singing and dancing contests held in 10 Indian cities before the final round in New Delhi, more than 1,200 participants in 532 teams had registered. According to the judges, many of the participants sang Korean songs pronouncing even the most complicated Korean words correctly, and properly re-creating the dance moves to their favourite Korean songs. The worldwide event for K-pop fans had preliminary rounds held in around 72 countries this year, including India, to single out a representative for the final stage of the competition in Changwon, South Korea. In an exciting competition, Juchy from Mizoram won the first prize for vocal category, while ‘We Are Family Crew’ from Delhi won in the dance category. The winners will now travel to South Korea for the K-POP World Festival Final on October 5.  The K-pop Contest has grown over the years – in contrast to this year, in 2012 only 37 contestants participated in the first official K-pop contest in India that was attended by a mere 300 people. “The K-wave and K-pop have arrived in India and we will witness the strong and enthusiastic fandom of K-pop in the country, which will surprise Korean people as well,” says Kim Kum-pyoung, Director of Korean Cultural Centre India. The competition also brought into focus famous South Korean tourist destinations, delicacies, art, culture and heritage, through a quiz for the audience, some of the participants of which won a free trip to Korea and other prizes. The first lady of the Republic of Korea also took out time to grace the event. During the festival that was powered by the entertainment channel VH1 India, apart from fierce competition, the audience also enjoyed special live performances by the emerging Korean boy-band Snuper. K-pop is characterised by a wide variety of audiovisual elements, covering mostly dance-pop, pop ballad, electronic, rock, hip-hop, etc, and has fans all over India. The present K-pop culture in India owes its origin to the 1990s, when South Korea started to promote the Korean Wave and promoted K-pop and helped Korean entertainment companies produce television series. The culture boomed in no time and today, tickets for one K-pop concert are sold out in less than a day. Korean dramas, music and culture are gradually invading young Indian hearts. So much so, Korean channels like Arirang and KBS World are aired in north-east India, and Tamil television network Puthuyugam translates K-dramas into Tamil and telecasts them. Your email address will not be published. Required fields are marked * Comment * Name * Email * Save my name, email, and website in this browser for the next time I comment.   Your Name Your Email Country —Please choose an option—AfghanistanAlbaniaAlgeriaAndorraAngolaAntigua and BarbudaArgentinaArmeniaAustraliaAustriaAustrian EmpireAzerbaijanBaden*Bahamas, TheBahrainBangladeshBarbadosBavaria*BelarusBelgiumBelizeBenin (Dahomey)BoliviaBosnia and HerzegovinaBotswanaBrazilBruneiBrunswick and LüneburgBulgariaBurkina Faso (Upper Volta)BurmaBurundiCabo VerdeCambodiaCameroonCanadaCayman Islands, TheCentral African RepublicCentral American Federation*ChadChileChinaColombiaComorosCongo Free State, TheCosta RicaCote d’Ivoire (Ivory Coast)CroatiaCubaCyprusCzechiaCzechoslovakiaDemocratic Republic of the CongoDenmarkDjiboutiDominicaDominican RepublicDuchy of Parma, The*East Germany (German Democratic Republic)EcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEswatiniEthiopiaFederal Government of Germany (1848-49)*FijiFinlandFranceGabonGambia, TheGeorgiaGermanyGhanaGrand Duchy of Tuscany, The*GreeceGrenadaGuatemalaGuineaGuinea-BissauGuyanaHaitiHanover*Hanseatic Republics*Hawaii*Hesse*Holy SeeHondurasHungaryIcelandIndiaIndonesiaIranIraqIrelandIsraelItalyJamaicaJapanJordanKazakhstanKenyaKingdom of Serbia/Yugoslavia*KiribatiKoreaKosovoKuwaitKyrgyzstanLaosLatviaLebanonLesothoLew Chew (Loochoo)*LiberiaLibyaLiechtensteinLithuaniaLuxembourgMadagascarMalawiMalaysiaMaldivesMaliMaltaMarshall IslandsMauritaniaMauritiusMecklenburg-Schwerin*Mecklenburg-Strelitz*MexicoMicronesiaMoldovaMonacoMongoliaMontenegroMoroccoMozambiqueNamibiaNassau*NauruNepalNetherlands, TheNew ZealandNicaraguaNigerNigeriaNorth German Confederation*North German Union*North MacedoniaNorwayOldenburg*OmanOrange Free State*PakistanPalauPanamaPapal States*Papua New GuineaParaguayPeruPhilippinesPiedmont-Sardinia*PolandPortugalQatarRepublic of Genoa*Republic of Korea (South Korea)Republic of the CongoRomaniaRussiaRwandaSaint Kitts and NevisSaint LuciaSaint Vincent and the GrenadinesSamoaSan MarinoSao Tome and PrincipeSaudi ArabiaSchaumburg-Lippe*SenegalSerbiaSeychellesSierra LeoneSingaporeSlovakiaSloveniaSolomon Islands, TheSomaliaSouth AfricaSouth SudanSpainSri LankaSudanSurinameSwedenSwitzerlandSyriaTajikistanTanzaniaTexas*ThailandTimor-LesteTogoTongaTrinidad and TobagoTunisiaTurkeyTurkmenistanTuvaluTwo Sicilies*UgandaUkraineUnion of Soviet Socialist Republics*United Arab Emirates, TheUnited Kingdom, TheUruguayUzbekistanVanuatuVenezuelaVietnamWürttemberg*YemenZambiaZimbabwe Media India GroupIndia OutboundInformation Technology  October 25, 2023 October 24, 2023 October 16, 2023 October 25, 2023 September 1, 2023 July 14, 2023 July 14, 2023 Media India Group is a global platform founded in 2004, based in Europe and India, encompassing publishing, communication, consultation services and event management. October 25, 2023 October 25, 2023 October 24, 2023 Copyright © 2023 mediaindia.eu - All rights reserved. ",
    "title": "Celebrating the Korean cultural wave in India - Media India Group",
    "datetime": "2018-07-12T13:49:52+00:00",
    "url": "https://mediaindia.eu/culture/changwon-k-pop-india-2018/"
}