{
    "text": "Most Popular [From the Scene] Don't remember Itaewon alley as place of death, victims' families say G-Dragon booked for drug use South Korea, Qatar agree to elevate ties, forge $4.6b industry partnership Former Olympic hero battles rumors surrounding her groom-to-be S. Korea goes all out to contain lumpy skin disease Man fined for assaulting soldiers who refused to praise Kim Jong-un, Putin Yoon pitches S. Korea's investment appeal to Middle East 4-meter deep sinkhole injures 1 in central Seoul Yoon meets Park, honors father in gesture of conservative unity [News Focus] A year after Halloween crowd crush, legislation remains stalled Start your day with a roundup of key stories from The Korea Herald with news and comment on all that’s happening in Korea. Published : Dec. 31, 2022 - 16:01 Link copied The coming year will see a number of changes ranging from minimum wages to university admissions fees. Each will have varying degrees of impact on day-to-day lives, below are some of the changes likely to have a direct effect on the lives of the individual. 1. Minimum wage increase The minimum hourly wage will rise by 460 won from Jan. 1 to 9,620 won ($7.60) an hour. Employees working eight hours, five days a week, will earn over 2 million won a month, including 346,000 won of holiday pay.  2. Use-by date instead of sell-by date The 38-year-old food expiration date system will change to show use-by dates of food items, not sell-by dates, in an attempt to reduce food waste. Milk will be the only exception.  3. University admission fees to be abolished In addition to tuition, students have had to pay admission fees to enroll in college, sometimes in excess of 1 million won. From 2023, colleges will be banned from demanding those entering undergraduate courses to pay admission fees.  4. Adoption of global standard of age counting Koreans have counted newborn babies’ age from 1, adding another year at same time to start the year, different from the universal way of counting age. However, the government decided to put an end to this unique age system. All Koreans will enjoy becoming younger by one or two years in June 2023.  5. Wider online TOPIK Getting a good grade on the state-run Test of Proficiency in Korean has been a major way to certify one’s Korean proficiency and has served as a shortcut to getting permanent residency or citizenship in South Korea. In response to increasing applications, the government will hold its first online-based reading, listening and writing test in November, while increasing its currently internet-based speaking test to twice a year.  6. Christmas and Buddha’s Birthday to have alternative holiday The government is to add the two religious holidays to the list of holidays that can have an alternative holiday when they fall on the weekend from next year. Currently, only Seollal, Chuseok, March 1 Independence Movement Day, National Liberation Day, National Foundation Day and Hangeul Day are on the list.  7. New visas – K-culture, 'workcation' The government is working on two new types of visas to introduce in 2023. The K-culture training visa is for young foreign nationals who want to learn about South Korea’s entertainment business or making content. The \"workcation\" visa is for digital nomads who want to stay in South Korea for up to one or two years while keeping their jobs at home and working remotely.  8. Easing work restrictions for foreign students Undergraduate students who stay in South Korea on a D-2 visa will be allowed to work up to 30 hours a week, five hours longer than the current restriction, from 2023. The detailed schedule for the change is not yet announced.    Articles by Lim Jae-seong  The Korea Herald by Herald CorporationCopyright Herald Corporation. All Rights Reserved.  ",
    "title": "\r\nChanges to come in 2023",
    "datetime": "2022-12-29T17:10:30+09:00",
    "url": "https://www.koreaherald.com/view.php?ud=20221229000700"
}