{
    "text": "Author: Geng Song, UHK Descendants of the Sun, a South Korean TV drama featuring a romance between a soldier and a surgeon in a fictional war-torn nation, is reigniting K-drama fever across Asia. In China alone, where the program is simultaneously broadcast online, it has drawn more than 2.4 billion views on video-streaming website iQIYI since it began airing in late February. Its fandom is mostly composed of young women who are fixated with the handsome male protagonist played by Song Joong-ki. It is reported that a jealous husband in China one night drunkenly stormed into a photography studio and demanded that the shop owner take pictures to ‘make him look like Song’.\nThe cult of male beauty associated with Descendants of the Sun is reminiscent of a recent trend that has been termed ‘Pan-East Asian soft masculinity’—male images that are exceptionally feminine to Western eyes. These types of images are mainly produced and circulated by the ‘Korean Wave’ and Japanese anime, comics and games (ACG) culture. It is well received by youth across most of East Asia and presents a significant response to the globally hegemonic masculine ideal based on the image of the transnational businessman.\nSome claim that the success of South Korean and Japanese pop culture lies in attempts to make it mugukjeok or ‘culturally odourless’ by downplaying their national specificity. But for many others its popularity can be largely explained by its representations of Pan-East Asian soft masculinity.\nPan-East Asian soft masculinity has its roots in the Confucian tradition of scholar masculinity shared by many East Asian cultures, such as the wen (literary attainment) masculinity in China or seonbi (scholar-officials) masculinity in Korean history. The talented scholar is physically weak, delicate and handsome, with androgynous beauty. He is desirable to women by dint of his knowledge and literary gifts.\nAt the same time, the current popularity of these images of masculine beauty also reflects the influence of the metrosexual trend from the West. This indicates that masculinity has become increasingly pluralistic and hybridised in a rapidly globalising East Asia.\nOne conspicuous example of the transnational flow of male images in East Asia is the spread of otaku culture. With the international spread of anime and manga, the term otaku has entered other cultures and generated new expressions. In Chinese, the vogue word zhainan (the Chinese pronunciation of the Japanese kanji for otaku) refers to a socially awkward young man who secludes himself in his home all day, indulging in computer games, anime and geek culture.\nDespite the Japanese term’s association with antisocial behaviour, more and more young men in Chinese cities identify themselves as zhainan and the term has come to indicate a desirable form of masculinity. There are Web essays on how to woo a zhainan and love stories featuring high school students and their zhainan teacher. The zhai lifestyle has even become a trend among urban youth. The popularity of zhainan in China may be explained by the discourse in premodern Chinese literature on the ‘purity’ of men who have obsessions.\nCompared with zhainan, the word meng bears an even more direct link with Japanese pop culture, being the Chinese pronunciation of the Japanese character moe. Moe, which originally meant ‘budding’ or ‘burning’, now refers to a particular kind of ‘adorable’ or ‘cute’ preadolescent girl in ACG culture. Like otaku, the word has undergone transformations in meaning and usage during its migration to China.\nIn the Chinese context, meng, which can be used as a noun, adjective or even a verb, has become a trendy word among young people, particularly in cyberspace. It can be used to describe a wide of range of things: from children’s expressions to President Xi Jinping’s new hairstyle. Notably, it is increasingly used to describe loveliness in men. When a man is referred to as meng, there is a (positive) implication of femininity. The popularity of zhainan and meng in China, on the whole, represents a growing cultural convergence among East Asian countries.\nThe ‘softness’ of Pan-East Asian soft masculinity also lies in its more sensitive and caring attitude toward women. The ‘Herbivore Man’ (sōshoku danshi) in Japan and South Korea, and ‘Warm Man’ (nuan nan) in China are all in line with this type of sensitive new guy.\nThe term Herbivore Man and its counterpart, ‘Carnivorous Woman,’ were first coined by the Japanese author Maki Fukasawa and became known through Megumi Ushikubo’s popular book The Herbivorous Ladylike Men: A Change in Japan. This new type of man is arguably a rebellion against the ideal salaryman masculinity of postwar Japan. They are less ambitious and are ‘harmless’ for women because they always display an understanding of women and their feelings.\nThe 2013 Chinese hit film, Finding Mr Right, centres on the idealised Warm Man. The male protagonist played by Wu Xiubo used to be a renowned doctor in Beijing but gives up his career in order to look after his teenage daughter in the United States. In China, he also epitomises the ideal sensitive man who harbours warm emotions for women.\n‘Tough’ masculine images are coterminous with ‘soft’ ones in East Asian popular culture. One example of the former is heroic men in China’s anti-Japanese TV dramas, a popular subgenre of TV program in China. This government-sponsored and market-oriented ‘consumerist nationalism’ represents a happy marriage between the state’s agenda and popular social desires in Chinese television.\nIn these dramas, patriotic Chinese masculinity is portrayed against its Other, the ‘Japanese devils’. The characterisation of Japanese officers and soldiers reflects stereotypes that are deeply rooted in the collective memory and imagination of generations of Chinese, gained from popular media if not from actual experience. For instance, the cold-blooded Japanese commander predictably commits hara-kiri when ultimately faced with defeat. The Japanese officer regularly slaps his subordinates in fits of anger, with baka (Japanese for ‘fool’ or ‘idiot’) always on his lips. He also regularly mistreats women, while his submissive wife bows deeply to welcome him home every evening.\nIt is against these images of Japanese men that an idealised Chinese manhood is portrayed and eulogised.\nGeng Song is Associate Professor at the University of Hong Kong.\nThis article appeared in the most recent edition of the East Asia Forum Quarterly, ‘Gender and sexuality’. Its fandom is mostly composed of young women who are fixated with the handsome male protagonist played by Song Joong-ki. It is reported that a jealous husband in China one night drunkenly stormed into a photography studio and demanded that the shop owner take pictures to ‘make him look like Song’. The cult of male beauty associated with Descendants of the Sun is reminiscent of a recent trend that has been termed ‘Pan-East Asian soft masculinity’—male images that are exceptionally feminine to Western eyes. These types of images are mainly produced and circulated by the ‘Korean Wave’ and Japanese anime, comics and games (ACG) culture. It is well received by youth across most of East Asia and presents a significant response to the globally hegemonic masculine ideal based on the image of the transnational businessman. Some claim that the success of South Korean and Japanese pop culture lies in attempts to make it mugukjeok or ‘culturally odourless’ by downplaying their national specificity. But for many others its popularity can be largely explained by its representations of Pan-East Asian soft masculinity. Pan-East Asian soft masculinity has its roots in the Confucian tradition of scholar masculinity shared by many East Asian cultures, such as the wen (literary attainment) masculinity in China or seonbi (scholar-officials) masculinity in Korean history. The talented scholar is physically weak, delicate and handsome, with androgynous beauty. He is desirable to women by dint of his knowledge and literary gifts. At the same time, the current popularity of these images of masculine beauty also reflects the influence of the metrosexual trend from the West. This indicates that masculinity has become increasingly pluralistic and hybridised in a rapidly globalising East Asia. One conspicuous example of the transnational flow of male images in East Asia is the spread of otaku culture. With the international spread of anime and manga, the term otaku has entered other cultures and generated new expressions. In Chinese, the vogue word zhainan (the Chinese pronunciation of the Japanese kanji for otaku) refers to a socially awkward young man who secludes himself in his home all day, indulging in computer games, anime and geek culture. Despite the Japanese term’s association with antisocial behaviour, more and more young men in Chinese cities identify themselves as zhainan and the term has come to indicate a desirable form of masculinity. There are Web essays on how to woo a zhainan and love stories featuring high school students and their zhainan teacher. The zhai lifestyle has even become a trend among urban youth. The popularity of zhainan in China may be explained by the discourse in premodern Chinese literature on the ‘purity’ of men who have obsessions. Compared with zhainan, the word meng bears an even more direct link with Japanese pop culture, being the Chinese pronunciation of the Japanese character moe. Moe, which originally meant ‘budding’ or ‘burning’, now refers to a particular kind of ‘adorable’ or ‘cute’ preadolescent girl in ACG culture. Like otaku, the word has undergone transformations in meaning and usage during its migration to China. In the Chinese context, meng, which can be used as a noun, adjective or even a verb, has become a trendy word among young people, particularly in cyberspace. It can be used to describe a wide of range of things: from children’s expressions to President Xi Jinping’s new hairstyle. Notably, it is increasingly used to describe loveliness in men. When a man is referred to as meng, there is a (positive) implication of femininity. The popularity of zhainan and meng in China, on the whole, represents a growing cultural convergence among East Asian countries. The ‘softness’ of Pan-East Asian soft masculinity also lies in its more sensitive and caring attitude toward women. The ‘Herbivore Man’ (sōshoku danshi) in Japan and South Korea, and ‘Warm Man’ (nuan nan) in China are all in line with this type of sensitive new guy. The term Herbivore Man and its counterpart, ‘Carnivorous Woman,’ were first coined by the Japanese author Maki Fukasawa and became known through Megumi Ushikubo’s popular book The Herbivorous Ladylike Men: A Change in Japan. This new type of man is arguably a rebellion against the ideal salaryman masculinity of postwar Japan. They are less ambitious and are ‘harmless’ for women because they always display an understanding of women and their feelings. The 2013 Chinese hit film, Finding Mr Right, centres on the idealised Warm Man. The male protagonist played by Wu Xiubo used to be a renowned doctor in Beijing but gives up his career in order to look after his teenage daughter in the United States. In China, he also epitomises the ideal sensitive man who harbours warm emotions for women. ‘Tough’ masculine images are coterminous with ‘soft’ ones in East Asian popular culture. One example of the former is heroic men in China’s anti-Japanese TV dramas, a popular subgenre of TV program in China. This government-sponsored and market-oriented ‘consumerist nationalism’ represents a happy marriage between the state’s agenda and popular social desires in Chinese television. In these dramas, patriotic Chinese masculinity is portrayed against its Other, the ‘Japanese devils’. The characterisation of Japanese officers and soldiers reflects stereotypes that are deeply rooted in the collective memory and imagination of generations of Chinese, gained from popular media if not from actual experience. For instance, the cold-blooded Japanese commander predictably commits hara-kiri when ultimately faced with defeat. The Japanese officer regularly slaps his subordinates in fits of anger, with baka (Japanese for ‘fool’ or ‘idiot’) always on his lips. He also regularly mistreats women, while his submissive wife bows deeply to welcome him home every evening. It is against these images of Japanese men that an idealised Chinese manhood is portrayed and eulogised. Geng Song is Associate Professor at the University of Hong Kong. This article appeared in the most recent edition of the East Asia Forum Quarterly, ‘Gender and sexuality’.  Δ  Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Thanks for an informative analysis of the different ways in which the concepts of masculinity are evolving in China, S Korea, and Japan. From a western psychological perspective, Otaku in Japan are more asocial than antisocial.  Ie, they avoid social interactions with others, especially women, because if their extreme shyness, lack of social graces, and lack of empathy for the feelings of others. They generally do not engage in antisocial behavior.  Ie, they do not violate the law and are not typically violent. One can wonder if Asian women nowadays are enamored with these images of sensitive, empathic, ‘feminine’ men because they find the stereotypical hard boiled, ambitious ‘masculine’ man to be so disappointing. When I wrote ‘antisocial’, I had Shoko Asahara and Tsutomu Miyazaki in my mind. But you are right that most Okatu are asocial instead of antisocial. Many thanks for pointing that out, Richard! But all this androgyny you see in Asian men started in Japan; not South Korea. South Korea took these aesethetics from Japan and capitalized on it through the success of Japanese pop culture in the world to make its way into the west. South Korea is not an innovative country when it comes to social movements; instead, it takes what seems fashionable or succesful and it infiltrates. This is the reason why aesthetics of KPOP bands are so reminiscent of anime/manga charcaters which are not Korean pop culture but Japanese pop culture. This is why I think that whenever you want to analyse these matters it must be taking into account the fact that it was Japan that started and created a whole world around “soft masculinity” as you put it while South Korea simply assimilated it for its profitable potetial as a market. A fantastic point! Many thanks, Alex!  July – September 2023\nFor electronic copies of back issues, links to the individual articles and to subscribe to the hard copies, see the EAFQ page. ",
    "title": "Changing masculinities in East Asian pop culture | East Asia Forum",
    "datetime": "2016-07-26T00:00:33+00:00",
    "url": "https://www.eastasiaforum.org/2016/07/26/changing-masculinities-in-east-asian-pop-culture/"
}