{
    "text": "By \n\n\tEric Hendrikx Chaz Ortiz was  raised in the suburbs of Chicago, and discovered his competitive circuitry early on. By the age of 11, he had followed in his father’s footsteps and become a state champion wrestler. But it was skateboarding that truly engaged him, and it wouldn’t be long before he had hung up his singlet and picked up a board. Needless to say, that decision paid off. In 2007, at 13 years old, Ortiz won the Gatorade Free Flow Tour. A year later, he dethroned three-time titleholder Ryan Sheckler at the Dew Tour Cup final stop in Orlando. Following a handful of successful competitions, Ortiz turned pro at 14 for Zoo York and has consistently finished among the top riders in the competitive arena since. It wasn’t by chance that he was selected in 2010 to compete among the world’s elite street skaters in the Street League competition series – the professional league where Ortiz remains a top competitor. Subsequent to a 2013 season-ending ankle injury, Ortiz moved to Los Angeles, taking up residence with fellow pro skater Manny Santiago and skating religiously at Paul Rodriguez’s private park. But after spending time in California, Ortiz headed back home to Chicago, where he’s helped bring his hometown’s skateboarding culture back to life.  Of course, he still finds time for some jet-setting. Rolling Stone caught up with Ortiz fresh off a Caribbean getaway to discuss his return to the Windy City, the costliest mistake he’s ever made in a competition and reading skateboarding mags in the back of Lil Wayne’s Bentley. What made you decide to leave California – this hub of skateboarding – and return to Chicago?I had a great time in California, and I would never trade it for anything – but it’s just not me. I grew up in Chicago and I’ve been around the Chicago area my entire life. I wanted to be home, around family, and I have my own skate park where I don’t have to be on anyone else’s dime to go skate. It’s fun skating with other pros every day. But I like to do my own thing. That’s kind of how I’ve always been. Editor’s picks\n\t\n\t\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tThe 500 Greatest Albums of All Time\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tThe 50 Worst Decisions in Movie History\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tThe Biggest, Messiest Band Breakups in Music History\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tThe 500 Greatest Songs of All Time How is Chicago’s skate scene different?Chicago has fallen off the map. I’m trying to show faith and be out here and represent skating in a positive way. We just got a new amazing skate park right in the center of Chicago. And now there are all these little rippers skating and it’s so cool to see. So my mission is to do stuff out here to help our scene continue to grow. When it’s nice outside, I skate our local park every day. I love meeting kids and parents. Chicago can be pretty rough – I’d rather see kids riding a skateboard than out making bad decisions and getting into trouble. You seem to have become an ambassador for skateboarding and for Chicago. You were recently invited to throw out the first pitch at a White Sox game –Yeah dude, and I threw a strike. It was pretty sick. I used to play baseball, and I can throw the ball, but I was really nervous about being in that situation; which is funny, because I skate in front of large crowds for a living. But yeah, it was super cool that they gave me the opportunity to do that.   Before skateboarding, you had a potential future in wrestling. Your father was a wrestler and you were a state champion. Why did you quit?I just quit because I was so much more into skating than wrestling. I would come home from tournaments and just want to skate. I’d watch skate videos at the tournaments between my matches. I don’t know why skating clicked in my head, but that’s all I wanted to do. So I told my dad I wanted to quit and focus on skating. He was bummed, but he was also cool with letting me find my own path. He definitely supported me and drove me everywhere to skate, took me to all my contests and to everything skateboarding-related. If it wasn’t for him, I just don’t know. He gave me so many opportunities. I was at one of your first Street League contests in Ontario, California, when you lost to Sean Malto and basically gave away $150,000 by trying to backside crooked grind a rail when you only needed two points to win.You were there? Oh, that was the worst.That was the most expensive crooked grind I ever missed! It was when the competition first started, and I didn’t know what to do. Now, I do. I could have done a 50-50, or maybe even a huge ollie and won. I was so confused and stressed in that moment. I was just looking around wondering what the hell was going on, and then I went for a big trick. Related\n\t\n\t\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tAaron 'Jaws' Homoki: Skateboarding's King of the Road Gets High as F--k How do you feel about the format of the competitions and how it plays to each skater’s strengths?Personally, I don’t think skateboarding should be judged by assigning points to one trick. If I do a switch 360 flip down a double set, they’d probably score me a 9 because they’ve never seen me do that trick before. But if P-Rod [Paul Rodriguez] did the same trick they’d give him, like, a 6.5 because they’ve seen him do it. We’re all different skateboarders, so that way of scoring doesn’t make sense to me. That said, I do think that the 45-second runs really showcase a person’s skating. If you’re on point and do hard stuff in a run, that’s better than just assigning a point value to a trick. But I love the contest, and it’s only helping skateboarding grow. It gets more kids to skate and allows us pros to do what we love every day. You can’t complain about that. This isn’t a complaint, but you’ve been filming a full-length Zoo York part, and you just pushed its release until next summer. What’s going on with that?I’m just fucking trying to make it the best that I can, you know? I have this vision for it, and it’s not quite there yet. It’s been a few years since I’ve dropped a full-blown solo part. I’m almost done. I just have a few more tricks in mind and then I can sit back and be stoked. I’m stoked now, but I want to get it right. Trending\n\t\n\t\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tAt Least 22 Dead and Suspect at Large in Maine Shooting\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tDuran Duran Have Gone Fully Goth on Their New Album. Wait, What?\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBob Lee’s Murder Shook San Francisco. What Really Happened?\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tChristine McVie Estate and Pat Benatar Sell Catalogs With Biggest Hits I know you’re friends with Lil Wayne, do you discuss tricks with him?Yeah, he’s my boy. I’ve been down to the studio to see him record. And when he was in Los Angeles, we skated a lot together. It’s sick. But I love how people hate on him for skateboarding, when in actuality, he’s way more passionate about skating than they are. I’ve seen that fool skate. He will try a trick for hours, nonstop, until he gets it. Weezy attends a lot of skate contests, skates at The Berrics and even has his own private skate park in Miami. He’s committed.It’s sick. He genuinely loves skateboarding. And he knows a ton about skating and all of the riders. He’s a skateboarding trivia master. I was in the back of his Bentley and he had all these skate magazines in the backseat. That’s how you know he loves skating – all these skate mags in the back of his nice-ass car. He was sitting there, telling me about Ben Raybourn’s most recent part. He knows his shit. He’s not faking the funk. We want to hear it. Send us a tip using our anonymous form. Rolling Stone is a part of Penske Media Corporation. © 2023 Rolling Stone, LLC. All rights reserved. ",
    "title": "Chaz Ortiz on Skating With Lil Wayne, Losing $150K on a Single Trick",
    "datetime": "2015-12-22T17:22:00+00:00",
    "url": "https://www.rollingstone.com/culture/culture-sports/chaz-ortiz-on-skating-with-lil-wayne-and-losing-150k-on-a-single-trick-52642/"
}