{
    "text": "Due to \"star-chasing behavior\" Weibo suspended 22 K-pop fan accounts for 30 days, including five for NCT, four related to BTS and three supporting Blackpink. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tHsiuwen Liu HONG KONG — In April, a Chinese fan group dedicated to BTS member Jimin set out to give the K-pop star a special 26th birthday present: a customized commercial airplane. Through an account with 1.1 million followers on Weibo, China’s leading social media platform, the group says it crowdfunded over 1 million yuan ($155,000) in three minutes to wrap a Jeju Air jet with photos of the star, which would act as a giant, flying billboard. But after the fan group posted pictures of the Jimin-adorned jet on Aug. 31, the Chinese government suspended the account for 60 days, claiming the fans had raised the funds “illegally.” Within hours, Weibo said that due to online complaints about “irrational star-chasing behavior,” it would also suspend 21 other K-pop fan accounts for 30 days, including five for NCT, four related to BTS, three supporting Blackpink and three for EXO.  The suspensions reflect the latest diplomatic tension between China and South Korea, as well as a broader tightening of control by China’s Communist Party over the cultural and political sphere. After months of regulatory action to stem the growing scale and influence of tech companies — including Tencent Music Entertainment — the government has now set its sights on taming “fan club chaos,” which it says is exacerbating cyberbullying and rumors among minors. As a result, artists and their followers will now face stringent censorship and penalties if they run afoul of authorities. On Aug. 27, the Cyberspace Administration of China (CAC), the government’s internet watchdog, announced 10 measures to “clean up” celebrity fan clubs, including banning celebrity rankings based on popularity. Tencent’s QQ Music service also said it would restrict customers from purchasing more than one download of an album. Then on Sept. 2, China’s State Administration of Radio, Film and Television banned “effeminate” boy bands from starring in TV and online idol talent shows. While K-pop album sales in China account for less than 2% of global revenue for the four biggest South Korean entertainment firms — SM Entertainment, HYBE, YG Entertainment and JYP Entertainment — securities analysts say, Chinese-based fan groups generate thousands of sales of physical albums and digital downloads through their sprawling networks. Exports of Korean albums from January to November of 2020 soared 78% from 2019 to a record value of $123 million, according to the Korea Customs Service. Total Korean music exports to China were $16 million (13%), which fell from second place to third after the U.S. at $17 million and Japan, the perennial export recipient, at $60 million. (The data was based on physical CDs and DVDs; digital downloads and streams were not included.) A week after the Chinese internet watchdog’s announcement, SM Entertainment, HYBE, YG Entertainment and JYP Entertainment’s share prices had fallen by 1.68%, 0.89%, 4.74% and 2.9%, respectively. The Chinese government seems particularly concerned that the country’s idol-fan culture is emulating that of K-pop, including such behaviors as inducing minors to raise funds, contest vote-rigging and the flaunting of wealth and extravagance. Across the world, K-pop fans have become powerful forces in driving sales and chart success for artists, and industry sources say music companies have come to expect that fan economy to generate a certain amount of additional revenue. “Labels are freaking out” about China’s fan-group crackdown, says Alex Taggart, the head of international for Outdustry, an industry services company that operates in China. “They were really relying on that revenue.” (The major multinational record labels and K-pop entertainment companies declined to discuss the topic with Billboard.) The actions threaten to slow the development of China’s highly engaged fan culture. The size of the country’s idol-generated economy — the amount of money driven by fan groups and their purchases — is expected to reach 100 billion yuan ($15 billion) by the end of this year, more than double the 45 billion yuan ($7 billion) of 2018 (which was a 60% jump from 2017), according to research by Owhat, a Chinese e-commerce platform. That vastly outweighs China’s recorded-music revenue, which IFPI reported to be $791.9 million in 2020. Weibo has been the main driving force, with over 500 million active monthly users as of this year. In 2011, the social media platform made a focused effort to invite celebrities to join and interact with their followers, says Yin Yiyi, associate professor of media and cultural studies at Beijing Normal University. By 2019, most popular artists and actors had at least 20 million followers on the site, with some like Jackson Yee counting over 88 million devotees. “The emergence of the K-pop-style idol industry in China [coincides] with the rise of its social media platforms,” says Bai Meijiadai, a lecturer at Liaoning University in northeastern China who studies fan culture. Chinese fan culture is a form of “data labor,” she says. ‘Milk Waste’ Scandal Leads To Fandom Crackdown As in South Korea, fan groups are known for their loyalty and lavish spending, from launching campaigns to boost their idol’s social media rankings, to buying multiple copies of their albums — and sometimes over-the-top activities. In 2018, Chinese pop star-actor Kris Wu made headlines when his debut solo album, Antares, knocked Ariana Grande off the iTunes U.S. music chart. Investigations by iTunes and Nielsen Music found that his fans had worked together to buy his albums in bulk to push up sales. Then in May, a popular Chinese talent show, Youth With You 3, encouraged viewers to buy milk and scan a QR code to support their favorite artists on the show — leading fans to waste an estimated 270,000 bottles during the campaign, according to Chinese media reports. The “milk waste” scandal, as the Chinese media dubbed it, caught the eye of the country’s internet watchdog, leading the CAC to decide it was time to start regulating China’s entertainment sector, analysts say. In June, it began its “Clear and Bright” campaign targeting online fan groups. The restrictive Chinese measures will likely have a limited impact on K-pop entertainment businesses, which saw robust earnings in the first half of the year in part from the diversification of fan-based business models, says Jeong-yeob Park, analyst at Mirae Asset Securities, a South Korean investment bank. Restrictions caused by the 2016 THAAD missile issue — Beijing has been upset over Washington’s agreement with Seoul to build a missile defense system to protect South Korea from North Korean attacks — and now the COVID-19 pandemic, were already cutting into K-pop’s business in China, industry sources say. “We view the latest crackdown as a ‘storm in a teacup’ in a market where reliability and dependence had already been eroded,” Park writes in a recent report. The missile defense system – which the U.S. upgraded in early 2020 – led China to block Korean TV shows and K-pop music videos from streaming in China. The move to regulate fandom was “caused by slowing economic growth and worsening public sentiment caused by COVID-19,” says Danny Lee, director at Beat Interactive, a South Korean record label. “What the Communist Party is most afraid of is the recurrence of Tiananmen Square, and now the strongest clusters and solidarity in China are fan clubs, so it can be thought that they are trying to prevent the spark of any ‘uncontrolled energy’ from collecting them in advance.” For now, fan groups and Weibo seem to be heeding the government’s regulatory orders. Responding to its punishment over the Jimin plane incident, the BTS member’s fan group called on its following “to be civilized, follow stars rationally … and build a harmonious and healthy online environment.” Weibo said in a statement that it “firmly opposes such irrational star-chasing behavior and will deal with it seriously,” vowing to “intensify” its policing of fan culture to “purify” online discussions and “regulate community order” on its platform. Additional reporting by Jeff Benjamin and Alexei Barrionuevo. Daily newsletters straight to your inbox Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "title": "China's Celeb-Culture Crackdown Targets K-Pop – Billboard",
    "datetime": "2021-10-11T12:14:23+00:00",
    "url": "https://www.billboard.com/pro/china-k-pop-fan-accounts-suspended-crackdown-milk-waste-scandal/"
}