{
    "text": " By providing an email address. I agree to the Terms of Use and acknowledge that I have read the Privacy Policy. COLORFUL TRADITION Chinese teachers perform excerpts of a typical Peking Opera in a post-Spring Festival dinnerorganized by the Chinese-Filipino community in Baguio. The teachers belong to the Confucius Institute, which deployedtutors to teach Mandarin in select senior high schools under the K-12 Basic Education Program. EV ESPIRITU COLORFUL TRADITION Chinese teachers perform excerpts of a typical Peking Opera in a post-Spring Festival dinnerorganized by the Chinese-Filipino community in Baguio. The teachers belong to the Confucius Institute, which deployedtutors to teach Mandarin in select senior high schools under the K-12 Basic Education Program. EV ESPIRITU BAGUIO CITY—Volunteer teachers from the Confucius Institute entertained the community here on Feb. 9 by performing segments of the Peking Opera during the city’s Spring Festival celebration. The institute has deployed a virtual army of teachers around the world to teach the Chinese language and share their heritage in select senior high schools under the K-12 Basic Education Program. The teachers donned period costumes, performed acrobatic tricks and sang operatic Mandarin tunes. Mandarin is included in the foreign language course—one of the specialized core courses—of the new senior high school program. According to the government’s K-12 program website, the senior high school program is two years of specialized upper secondary education. “Students may choose a specialization based on aptitude, interests and school capacity. The choice of career track (academic; technical-vocational-livelihood; and sports and arts)… will define the content of the subjects a student will take in Grades 11 and 12,” the website said. Chen Yanyi, a member of the visiting teachers’ group, said the volunteers were here to scout for universities that would partner with the institute. Chen said the volunteer teachers faced a huge task. “Most Filipinos only know the words, ‘siomai’ and ‘siopao’ so we want to share more of our culture,” she said. Not a centavo spent Zhang Shifang, a teacher, said 76 Chinese volunteer teachers had been deployed to different schools all over the country. These schools do not spend a centavo for the volunteers, who are paid by the Chinese government, she said. The institute also trains Filipino scholars. The first batch of graduates of the Mandarin course at the Fujian Normal University in 2010 included Cavin Pamintuan, a Filipino language teacher. The reformed K-12 curriculum will soon be part of the web service offered for free by the London-based education technology company, Quipper, in areas such as Bontoc town in Mt. Province. Quipper serves as a supplementary teaching aid. The service allows teachers free access to hundreds of lessons and test quizzes on English, Math and Science. Teachers can assign lessons and tests to their students online while students can go through tutorials on their computers and mobile devices. In November, a Quipper school was launched in Bontoc despite the weak Internet signal there, said Gloria Buya-ao, Mt. Province schools division superintendent. Quipper country manager Yuki Naotori said the company was preparing to incorporate the K-12 program syllabus for school year 2016-17 in the website’s contents. Specialized courses The K-12 reforms may also produce new specialized courses at the Philippine Military Academy (PMA) soon to suit the demands of the Armed Forces service units like the Army, Air Force and Navy, said Maj. Gen. Oscar Lopez, former PMA superintendent. Lopez relinquished his post to Maj. Gen. Donato San Juan II in a Feb. 13 ceremony. He was praised by Armed Forces Chief of Staff Gen. Hernando Iriberri for studying “the impact of [K-12 reforms] on the PMA resulting in… [the] rewriting [of] the curriculum and recruitment system.” Lopez said the PMA curriculum lost its general education subjects to Grades 11 and 12 under the reformed basic education law. Subscribe to our daily newsletter By providing an email address. I agree to the Terms of Use and acknowledge that I have read the Privacy Policy. “We are still conducting consultations and we have tapped the expertise of the University of the Philippines. A technical working committee will have to determine if we need additional majors or technical subjects,” he said. Kimberlie Quitasol, EV Espiritu and Jessica Tabilin, Inquirer Northern Luzon News that matters By providing an email address. I agree to the Terms of Use and acknowledge that I have read the Privacy Policy. We use cookies to ensure you get the best experience on our website. By continuing, you are agreeing to our use of cookies. To find out more, please click this link. ",
    "title": "Chinese culture, language offered under K-12 | Inquirer News",
    "datetime": "Mon, 15 Feb 2016 01:11:28 PST",
    "url": "https://newsinfo.inquirer.net/764827/chinese-culture-language-offered-under-k-12"
}