{
    "text": " The Korean creditors of Kumho Tire, including Korea Development Bank (KDB) and Woori Bank, on March 13 signed a share purchase agreement (SPA) in Seoul, South Korea with the preferred bidder China-based Doublestar. The total size of the transaction is 955 billion won (US$810 million). If chairman Park Sam-Koo of Kumho Asiana Group, who is known to have difficulty in arranging some 1 trillion won (US$850 million), does not exercise the Right of First Refusal within the next 30 days, Doublestar will become the largest shareholder of Kumho Tire with the 42.01% stake. Kumho Asiana Group, however, claimed in a press conference on the same day that the creditors should allow Chairman Park to set up a consortium to buy Kumho Tire back. Park has recently set up a special purpose company to buy back Kumho Tire, but the creditors have said that the takeover should not be made through a consortium. \"If the creditors do not allow (a consortium), we will not exercise the right to buy back (Kumho Tire),\" Yoon Byong-chul, Kumho Asiana's chief financial officer, said in the press conference. Park has to make a decision in a month after getting the related notice from the creditors and offer more than Doulestar's bidding price to take the affiliate of the group back. Kumho Tire, an affiliate of Kumho Asian Group, was placed under a creditor-led workout program in 2009, after its parent company was hit hard by a liquidity crunch from the takeover of Daewoo Engineering and Construction Co. At that time, chairman Park was given a priority option to buy back the country's No. 2 tire maker if the creditors led by the state-run KDB decide to sell the company. Last week, the creditors agreed to sell their combined 42.1-percent share in Kumho Tire to Doublestar. It has almost been a year since the creditors started pursuing the sale of a 42.01% stake of the cash stricken company. It was made official in September 2016, and the creditors announced on January 18, 2017 that they selected Doublestar as the preferred bidder after evaluating highly of non-price factors. After about two months of negotiations, Doublestar and the creditors have finally come to an agreement for SPA. Kumho Tire, founded in 1960, went public in 2005, and was previously one of global top 10 tire companies. Kumho Tire holds strength in passenger car radial (PCR), especially for its excellent quality in SUV and racing-purpose products. Kumho Tire is operating an R&D center and large scale manufacturing facilities in China, as its local counterparts, Hankook Tire and Nexen Tire, are doing. According to an information source of Doublstar, China accounts for 40% of Kumho Tire’s manufacturing capacity, but the company’s performance in the Chinese market has been stagnant since 2011 when there was a mismatch between production capacity and demands, recording losses since 2015. The source said China is the key for Kumho Tire to break through the difficulties that the company is facing, adding Doublestar can help Kumho Tire improve financial and operational hardships, and ultimately to achieve higher growth. In the meantime, Doublestar, a tire manufacturing company listed in China, is manufacturing specially designed tire products not only for trucks but also buses for intercity, long-distance and mines.    Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "China-based Doublestar Signs SPA for Kumho Tire Acquisition - Businesskorea",
    "datetime": "2017-03-13T06:45:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=17504"
}