{
    "text": "By Kellis Robinett In his final moments as North Dakota State’s football coach, Chris Klieman invited everyone in a room jam-packed with cameras to visit Manhattan and catch a game at Kansas State next season. He had just won his fourth FCS championship in five years with the Bison, yet he was already expecting big enough things with the Wildcats to welcome guests for an up-close view. Klieman is leaving a good situation for a better one. The implication was that his methods will work at both programs. “Dedication and hard work, guys buying in, all the things that have happened here,” Klieman said. “Success is very difficult and you have to do a great job of motivating guys, great job of caring for people and letting them know that you’re going to be there for them. It’s happened here and I know it can happen at Kansas State.” For now, there is little reason to doubt him. There is no arguing with the 69-6 record or the rings Klieman assembled during his time at North Dakota State. But he is about to jump up a level and take over a Kansas State football team that has played in eight bowls and claimed a Big 12 championship over the past decade. The Wildcats hired him not to build from scratch but rather to add onto the successful culture Bill Snyder established during his 27 transformational seasons in Manhattan. It’s a dream opportunity for Klieman, who has always wanted to coach at the highest levels of college football. It is also a monumental task. Following Snyder won’t be easy. There’s a reason his name is on the football stadium and the highway leading into town. He’s the only coach that has consistently won with the Wildcats. K-State was a moribund program before he arrived in 1989, guided the team to 210 victories and turned it into a winner. The Wildcats have been to 21 bowls in their history, and Snyder was the coach for 19 of them. Ron Prince tried to carry on Snyder’s legacy when he initially retired in 2005, but he produced results so mediocre that some K-State fans would rather not speak his name all these years later. Prince went 17-20 over three seasons, delivering highlights like a bowl trip in his inaugural season and a pair of upsets against Texas. But he never beat rival Kansas and struggled on defense. K-State went 5-7 in 2007 and 2008, then Snyder came out of retirement and again rebuilt the Wildcats into a postseason regular. There are countless reasons why that coaching transition failed. But one of the biggest had to do with a change in culture. Prince made a lot of bold changes during his three years on the job. He brought in new uniforms, judged recruits based on talent more than grit and even introduced new traditions at football games such as the short-lived power towel. It was a complete departure from Snyder’s ways and the results were regrettable. Klieman has already introduced some of his own changes, including a significantly stronger commitment to recruiting and social media. Fans can also expect alternate uniforms and new music at games next season. He will be his own man. Still, his big-picture alterations are expected to be subtle. Example: Snyder preached a 1-0 mentality. Klieman tells his players to “win the dang day.” He would rather blend the best aspects of North Dakota State with the top characteristics of K-State rather than totally replace anything that Snyder built. “It’s already there,” new K-State offensive coordinator Courtney Messingham said, who will follow Klieman from NDSU. “Coach Snyder has done a phenomenal job. I remember what K-State was like before him and what it has been the past 29 years or so. He has been the head guy and that culture is already there. They understand what it means to play for their brother, give themselves up and hold each other accountable.” Merging any two programs, even successful ones, can be difficult. But this should be easier than, say, Oregon and Army. The Bison and Wildcats both like to run the ball, both value defense and both value hard work more than talent. “There are a lot of parallels to the programs in terms of toughness and types of kids who have gone to both institutions,” new K-State receivers coach Jason Ray said, who worked for NDSU last season. “It’s a developmental program here at North Dakota State, and we are going to continue to develop our talent, whatever recruits we get to Manhattan, when we transition to Kansas State. We will operate the exact same way.” Klieman coached North Dakota State to a pair of FCS playoff victories after he was hired at K-State. Following the first win, a home thrashing of South Dakota State, he was asked if he went out of his way to show anything to K-State fans watching in the Sunflower State. He shook his head. “I was just trying to win this game for my guys,” Klieman said. “But we played tough, disciplined football and our guys played hard the same way they always have at Kansas State.” If you want a better idea of what Klieman has planned for the Wildcats, just take a look at the coaching staff he has assembled. He hired four assistants from North Dakota State, retained two from K-State and brought in three with no connections to either school. His support staff has a similar makeup. He will draw upon a convergence of new, old and different ideas in his new job. K-State football is sure to change under Klieman, and everyone is invited to watch. This story was originally published January 9, 2019, 2:51 PM. Try 1 month for $1 Real-time updates and all local stories you want right in the palm of your hand. Part of the McClatchy Media Network ",
    "title": "Chris Klieman brings new style to K-State football culture | The Wichita Eagle",
    "url": "https://www.kansas.com/sports/college/big-12/kansas-state/article224134530.html"
}