{
    "text": "SM Entertainment's A&R executive Chris Lee discusses K-pop hitmaking, \"cultural technology\" and more. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tTamar Herman A rare event took place recently at Lincoln Center. K-Factor, the first 50-piece orchestral performance of its kind put on in the iconic New York City landmark, featured a stroll through the sonic history of South Korean music. An attempt to delve into the musicality behind K-pop and draw a narrative through the creative patterns that have led to that industry’s worldwide popularity, the June 20 event was preceded by a talk the night before that was, while less musically impactful, just as intriguing.  Titled “The True Value of K-Pop,” the evening featured SM Entertainment‘s Chris Lee as he laid forth the company’s current operating model, known as “cultural technology,” and its goals in a Ted Talk-style session. Lee, who sits on SM’s board of directors and serves as A&R executive at the company as well as CEO of Culture Technology Group Asia (CTGA) Europe, started working with SM Entertainment as an intern in 1998 while in university. First working on research reports, he eventually became interested in A&R and in 2005 joined the company — which spearheaded the modern K-pop group structure with the launch of H.O.T  in 1996 and has been a major player ever since — as an A&R representative. His first project was working on Zhang Liyin, a Chinese artist under SM, and by 2008 he became the head of the department. Despite being a major power player in South Korea’s music scene, Lee is soft spoken and exudes an aura of calmness atypical of the frenzied K-pop world. After his talk, he spent about an hour speaking to every audience member who waited around, answering each question posited towards him, whether it was about SM’s plans for its artists or how they personally could get involved with the industry. When asked why he stayed even though his schedule was packed on his trip to New York, Lee opined that because “K-pop is far from here” fans rarely have access to speak with insiders. He had a similar response when agreeing to an impromptu interview the next afternoon, backstage at Lincoln Center as the orchestra practiced for that night’s event, during which he discussed SM’s operations, approach to music making, the future of K-pop, and more.  Billboard: How are you feeling today about last night’s event? Chris Lee: I feel really good because I’m done. You know, I always feel very stressed when I do a keynote speech in English, so I’m very good now. You spoke about how you started out at SM a bit. How do you feel about your career, looking back on it? What moments stand out to you the most? Lee: Just everything from the very beginning in 2005. But I really enjoyed when I was only doing the A&R job. I really enjoyed being in the studio, listening to all of the recording sessions with all the artists, and when the sound engineers mixed the tracks, it was really fascinating and that was a good setting for me. And, also, that makes me sensitive to all of the sounds, the EQing and compressing the sound. Also being with the writers during the writing camps at the studio, that’s the most exciting for me. It’s not exciting, but it’s more precious and the most important time for me. I think you said last night that you were the one that innovated song camps at SM? Lee: Yeah. [Laughs] I’m in charge of it as a head of A&R, but it’s all communications. It’s not by myself, of course, but with all my A&R staff and, of course, my producer [SM Entertainment founder] Mr. Soo-man Lee. He always gives me the right direction. “You should go out to have a much bigger network all around the world,” that’s what he said, so that’s why I started to go abroad. I spend like half of my working time not in Korea but outside Korea to meet and work with producers from Europe and the States.  SM is considered one of K-pop’s historic “Big 3” companies and has produced many hits in the tenure you have director A&R. What do you look for when you’re putting together a song that you think will be a hit? Is there any sound or style that you look for when you’re listening to songs and thinking, “This is it”? Lee: Nothing specifically because SM works with a lot of artists such as EXO, TVXQ!, BoA, Red Velvet, Shinee, NCT, Super Junior… I don’t really focus on a specific genre, but last night, during the Q&A session, someone asked me, “What’s the most important thing to make a sound or song as an A&R?” Make it not boring and bring heart. We just want the listeners, our fans, to get into the music. So that means it has to be perfect, musically perfect. Everything has to be perfect and has to be interesting. When it comes to perfection, what it means is having the perfect progressions to make the song not to be too loose, to keep the excitement throughout the whole song. But it’s not just about the music itself but other parts, all the other elements of K-pop, such as video and choreography, they have to come together to aim for perfect perfection. So we actually spend a lot of time working to make a record. It’s not just a one-time job, but sometimes we change one song around 60 times. [Lee pulls up a playlist on his smartphone, and shows and plays some of the separated elements of NCT 127’s “Cherry Bomb.”] Lee: For only one song, “Cherry Bomb,” I had more than 17 different versions. It’s not only “Cherry Bomb,” of course. It’s all of the songs. But [“Cherry Bomb”] was pretty extreme.  Those files that you just showed me, they are what ended up making up every single part of the song? They ended up in the final cut? Lee: Yeah. There was an original demo but we changed it a lot. “Cherry Bomb” didn’t have proper melody and verse the first time when I got the demo from Dem Jointz. We got topliners and other producers to make the verses, middle eights, dance breaks. So as we made that and recorded it, and during the mixing time, we also changed it a lot. That’s how we work. People ask us how SM is successful for the last 20, 30 years. That’s the only reason. Mr. Soo-Man Lee — producer — and assistants — SM Entertainment — we’re obsessed to make perfection. Is that part of the cultural technology system that you were talking about last night? Obviously everything is different per situation, but you seem to have a map for creating your SM Entertainment content? Lee: That’s right. It’s also because of my producer Soo-man Lee. He was kind of a teen star during his university school student time, so he was a famous singer, but at the same time he studied mechanics at the number one university in Korea, at Seoul University, which is like where all the geniuses in Korea go. And he decided to go to the States to study more about computer science, robots, and things like that. Soo-man Lee has this mindset that when it comes down to technology or computer science or even science, there’s always a manual, right? That step that needs to be followed to make sure that something gets done in the right way. So being trained that way, Mr. Soo-man Lee, when he started the company, he wanted to make sure that we have those manuals, specific manuals to follow to aim for perfection when creating creative content. Starting from that point, he combined the words “culture” and “technology,” which doesn’t really seem to combine with unity, but Mr. Soo-man Lee, he decided to call this “cultural technology.” For cultural content to be made as perfectly as possible, it required a really detailed process and system. So that’s how the cultural technology [of SM] has been formed, even from the very early days up until now.  So SM is like a tech company, not necessarily a music company? Lee: Yeah, kind of, and we do tech things in our company. We already had the AI division at the SM Entertainment around six years ago. We have a lot of subsidiary companies, which create things like apps that are used for functions like creating communication between the fandoms and artists. A lot of those things come from Soo-man Lee’s background. [Since this interview took place, SM Entertainment has faced increasing criticism from investors due to a variety of situations, including in part because the company operates too many subsidiaries that aren’t apparently lucrative.] You mentioned last night that the company has reached the final stage of SM’s cultural technology expansion. Can you expand on that? The idea of finalizing a company’s innovation sounds a bit like stagnation. Lee: There are three stages: culture creation, culture expansion, and culture exportation. First, we began with H.O.T. We made one very famous group and they went everywhere, China, Japan, etc. BoA and TVXQ!, even though those are Korean artists, we educated, let them learn Japanese in Japan, so they were kind of in between the first and second stages.  For the second stage, we worked with international artists, like Hankyung (Han Geng) from Super Junior and four members from EXO-M who were all Chinese. For the third stage… Even though there are music videos and choreography, the music is in Korean so there’s a language barrier. Also, in this cultural technology, the management and marketing is pretty important, but we’re Korean and we cannot really release our artists abroad. We are not there, so sometimes it’s a problem. So the best way to do it is if we want to expand our market. We need to be there or be working with the people who are already there. So that’s this stage, the third stage. NCT’s concept is that NCT is a brand of artist. NCT 127 is from this home [of Seoul]. NCT China, Weishen V [WayV], they are recruited and casted from China and Asian markets. They all speak Chinese and they are managed by Chinese company called Label V. We have plans to make things like NCT Thai, NCT Hollywood, NCT Europe. It could be NCT brand, or it could be another brand or team. We’re producing the artists, and artists’ album and all contents are produced by SM Entertainment. We are producing not only Korean [stars] but also [talent] from different cultures and we’re working with local companies for joint ventures. That’s our final stage of this culture technology thing, glocalization. How will it work? Will all international artists be trained in Korea, with music coming out of Korea? Or will SM’s practices be exported to partner companies in other countries and everything will be focused there but based on SM’s techniques? Lee: We’ll probably produce most of the contents from the [SM] headquarter, but [local partners] will manage it. The CT, cultural technology, can be transferred to those companies, which are partners. It will be very different case by case for different countries. For example, in Japan we have a partner in Avex but we also do have SM Japan. Even here in the States, we have different partners, such as Capitol [which represents NCT 127], along with SM USA. Our main thing is having a partner to help us with our distribution and support the marketing, partnering with them to help out with the glocalization. Our ultimate goal is to have more glocalization, so, “Yes” regarding both of those questions. I’ve seen discourse online from fans who suggested that the NCT brand means there will never be another new group from SM, but moving forward all teams, at least boy bands, produced by the company will be part of the NCT project since it is meant to be limitless. Is that the intent? Lee: Oh, no. Of course, we can make another NCT boy band or we can create another totally different boy band, of course. So not everything coming out of SM moving forward will be under the NCT brand? Lee: Yeah.  When you said it was the final form of this plan, how does that ultimate goal tie into that? Lee: We’re in the final stage of completion, achieving the goal, but once the NCT platform is secure and it’s been stabilized, we could have other different platforms that have more different expansion options, so NCT is not the end of development for SM. As SM Entertainment, our goal is to have more success with NCT bands and then other artists too, to have more expansion and explore more markets, to have more success, of course. What is SM’s current goal moving forward? Lee: Our current goal comes down to culture technology phase two, which is IP expansion. You know, these artists, if we consider them as intellectual property — they’re not products but as an analogy they can be looked at that way. We want to partner with the artists that we represent to utilize them, so their characters and their artistry and branding can be utilized in many different types of business. We’ve already been acquiring model agencies and sports agencies to have more diversity among our roster to expand further. Kind of going back to the glocalization element, it’s about expanding SM’s presence. You have recently acquired and began to work with a wide range of artists in different genres beyond K-pop idols, so do those come into play in this regard? Lee: Yes, we have different sub-labels and are investing a lot. There’s this one label that we launched with the sub-label Mystic [Story, formerly known as Mystic Entertainment] that we acquired [in 2017], All I Know Music. We also acquired a hip-hop label called Million Market, which represents artists like Suran and others. There is a company that we have invested in called Beasts And Natives Alike, or BANA, and they have a few different artists, like the rapper ESENS and a duo called XXX.  SM has invested in the company behind XXX? Their songs are quite vocal against the established state of music in South Korea. Lee: I love them. Actually, the founder of their company BANA, his name is Kim Ki-hyun and he was one of my favorite A&R staff. One day, he came to me and said he wanted to quit to make his own hip-hop label before he turned 30-years-old. So he founded it, and we invested. That is fascinating. But going back to SM’s cultural technology and glocalization aims, how do you deal with foreign markets when socio-political elements come into play so greatly, such as with how China and Korea came to head several years ago over the installation of THAAD and the Chinese market has been relatively closed-off to K-pop even though in the past China has been such a major market? How does SM approach this volatility from a business perspective? Lee: We cannot really predict the future so we cannot really say at all, you know, “This or that for now,” especially for territories in those political situations. But our job is just to do the best. We always have to consider political situations, but our goal is to make this content produced by SM, so we have different strategies. Such as with Southeast Asian territories, at the moment we have our joint ventures that are managed and supported by a local partner to run. In the U.S. and Japan, we have our SM subset label and work with local partners. If we decide to go into the Latin American market, our goal is to find the right partner to work with in those territories. We’ll definitely consider what will be the best strategy as we approach all markets and political situations, but finding the right partner is really the most important thing.  [Since this interview, South Korea and Japan have increasingly faced a cooling of tensions that have led to a trade war that will potentially impact the future of K-pop in Japan. SM recently held its company-wide SMTown concert series in Tokyo over Aug 3-5.] The Chinese market is a lucrative one, and the C-pop scene is increasingly growing. Many K-pop-trained stars are moving to work in China, and the Chinese industry is regularly using techniques and emulating television programs coming out of Korea. Is there any concern that the Chinese market is not only no longer as open to the K-pop industry but that it will eventually overtake the K-pop industry as the most internationally dominant East Asian music scene? Lee: I think the bottom line is that we don’t think of it as a negative but, simply, it’s just the market getting more competitive. It’s the same as just within our own country, you know? We see it as an opportunity to compete in growing markets because they become more available for us to have more expansion. Do you have any personal worries about the future of K-pop?  Lee: Yesterday, at the discussion there was a person that asked the question, “How long do you think K-pop will last?” But the answer to that was that I believe that this is just the beginning. I was getting the same question since a decade ago and still the same question gets raised. But in this ecosystem of K-pop, it’s been growing in a very healthy way even though recently there have been many incidents and news that shows a bad part of K-pop. But I think of it as continuing to grow in a healthy way. As for us [at SM], if we could make ourselves a fair competitor in the market and create good content, we believe that the future’s bright. Personally, I’m a fan of Marvel. There are many different characters, and many series’. But fans aren’t worried about the future because they know that there are many other characters and there will be more diversity coming along the way. It’s similar in the K-pop scene. Whether it’s SM, JYP, or any other labels in Korea, I think it can be an analogy to the Marvel storytelling universe. Beyond Korea, throughout the whole world K-pop creates excitement for fans. As different record labels and artists compete and create content, it’s continually moving forward and being groundbreaking. So the bottom line is that, my answer is almost too long, but simply back to my simple answer: I don’t worry about the future of K-pop. I’m really enjoying this job. This interview was conducted in both English and Korean, and edited for clarity. Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "title": "Chris Lee Talks SM Entertainment, Glocalization, NCT and Creating K-Pop Hits | Billboard – Billboard",
    "datetime": "2019-08-06T03:43:35+00:00",
    "url": "https://www.billboard.com/music/music-news/chris-lee-sm-entertainments-kpop-interview-8526172/"
}