{
    "text": "Christine Fellows and John K. Samson are the new writers-in-residence at the Winnipeg Public Library. The Winnipeg-based singer songwriters are the first duo selected for the residency. The married couple have been longtime collaborators on manuscripts, scores, performances and recordings. \"Building a creative community is important to both of us,\" said Fellows. \"Writing can be lonely and isolating at times, and encouraging and connecting with each other through that process is so valuable.\" Added Samson: \"The Library has always been a touchstone for us in the community, and we are thrilled to be taking part in this residency.\" Together, they have led workshops and undertaken several artistic residencies, including as writers-in-residence at the University of Manitoba's Centre for Creative Writing and Oral Culture. They were also part of UBC's Creative Writing Faculty in 2014 and 2015, teaching courses in songwriting and interdisciplinary collaboration. Fellows released her sixth solo album, Burning Daylight, alongside her first collection of poetry in 2014. Samson's second solo album, Winter Wheat, is set for release in October. He has also released five albums as frontman for the popular indie folk/rock band The Weakerthans, as well as the book Lyrics & Poems, 1997-2012. He and Fellows have also published poetry and prose in several magazines and literary journals, including The Believer, Contemporary Verse 2, and Geist. Samson also co-founded local press ARP Books. As writers-in-residence, they will provide online and in-person consultation with emerging and established writers of all genres from an office located at Millennium Library. Manuscripts for review can be submitted by email or by mail starting Oct. 3, 2016. Check the Winnipeg Public Library's writer-in-residence website for more information and submission guidelines. Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636 It is a priority for CBC to create products that are accessible to all in Canada including people with visual, hearing, motor and cognitive challenges. Closed Captioning and Described Video is available for many CBC shows offered on CBC Gem.  ",
    "title": "Christine Fellows, John K. Samson named Winnipeg library writers-in-residence | CBC News",
    "url": "https://www.cbc.ca/news/canada/manitoba/christine-fellows-john-samson-writers-residence-library-1.3735545"
}