{
    "text": "By Anna Edwards and Lucy Crossley and Chris Brooke for the Daily Mail Published:  08:14 BST, 20 November 2013   |  Updated:  02:10 BST, 21 November 2013  385 View  comments  The decision may have surprised some observers, but Hull yesterday became Britain’s latest City of Culture. The news was greeted with a mixture of astonishment, shock and delight by local dignitaries. The achievement in beating off competition from Dundee, Leicester and Swansea Bay to become the nation’s official culture location could now bring the city ‘out of the shadows,’ it was claimed.   Hull has been named as the UK City of Culture 2017, seeing off competition from Dundee, Leicester and Swansea Bay  The city will hope to see an economic boost from the accolade which is handed out every four years    Officials predict the 2017 honour could inject £184million into the city’s economy over five years.Hull has regularly featured in the best-selling book Crap Towns – and last month an article in the Economist cited it as one of ‘Britain’s decaying towns’. However, Culture Secretary Maria Miller said the win could ‘produce a wonderful mix of inward investment and civic pride’. The Government chooses a new city every four years with the aim of helping tourism and the economy. Hull takes over from Londonderry. There were wild celebrations at Hull Truck Theatre this morning as Hull was announced as UK City of Culture for 2017  Hull is known for being the home of poet Philip Larkin, the Ferens gallery and the Truck Theatre, where people gathered to hear the announcement  The victory means the city will stage a £12m programme of arts and cultural events during 2017, including 25 major festivals and spectacular opening and closing ceremonies  Stephen Brady, the leader of Hull City Council, hailed the victory as ‘a real game-changer.’ He added: ‘Never again will Hull have the reputation that some people have put on it in the past.’ In the Commons, Prime Minister David Cameron said it was an ‘exciting opportunity’ for the city on the Humber. However, he couldn’t resist a joke at Labour’s expense by pointing out that it had the ‘burden to bear’ of having former cabinet minister Peter Mandelson appointed as the High Steward of Kingston Upon Hull earlier this year. The Hull Freedom Festival, pictured, was a major event in the city and attended by more than 80,000 people   The KC Stadium, home of Hull City and Hull FC, is a focal point for residents Princes Quay shopping centre could see a boost in profits as tourists may flock to see the city Lord Prescott, the city’s former MP, reacted to the news by tweeting a reference to a hit song by the Hull band The Housemartins: ‘It’s Happy Hour again! Hull Yes Well done.’ Hull’s association with things  cultural were being widely quoted and the city found itself in the  unusual position of trending on Twitter. Hull put forward the most compelling case based on its theme as 'a city coming out of the shadows' The Guildhall in Hull is one of many picturesque buildings in the portside city   Hull's plan for its year includes an opening ceremony with 3,000 volunteers paying tribute to its heritage as a major fishing port   Cobbled Prince Street in Hull is one of the winding lanes that run through the city, which was founded in the late 12th Century   Up until this year Hill regularly featured in the book Crap Towns - and last month an Economist article cited Hull as one of 'Britain's Decaying Towns' Poet Philip Larkin – notorious for his glum view of life – worked in the university library, actor Sir Tom Courtenay and actress Maureen Lipman are both from Hull, while singer Paul Heaton fronted both the Housemartins and The Beautiful South. Out on the streets there was a mixed reaction to the honour. Lorry driver Mark Taylor, 52, said: ‘I have been all over the country and there are a lot worse places to live.’  The remains of a wrecked car show the darker side of the UK's new City of Culture  The Economist article said Hull was among a list of northern towns and cities that were 'decaying, despite dollops of public money and years of heroic effort'  Hull City Council admits one of the aims of the bid was to 'change the perceptions' of the city  But John Longthorn, 62, a supermarket worker, said: ‘Parts of Hull are depressing. My daughter moved to Newcastle 13 years ago and won’t come back.’ Hull has had some success in tackling the social problems responsible for its grim reputation. Youth unemployment, teenage pregnancy and crime have all apparently fallen. However, health remains an issue, and Hull is still one of the country’s top five obesity hotspots. Perhaps it is no surprise that Hull has been awarded the title, given its rich history of producing cultural figures. Perhaps the most famous resident is poet Philip Larkin, who was originally from Coventry, moved to Hull and lived there for the majority of his life as the resident Librarian at Hull University. Larkin, who turned down the chance to become Poet Laureate, is not the only writer connected with Hull. Poets Philip Larkin and Andrew Motion both spent a large portion of their lives in Hull, which has fittingly been named the UK City of Culture 2017  Another important figure for the UK's literary scene was former Poet Laureate Sir Andrew Motion, who taught English at the University of Hull. And the 17th century metaphysical poet Andrew Marvell, who was born and brought up in the area, is remembered with a statue in the city. Former Deputy Prime Minister John Prescott was born in Wales but has been the MP for, and resident of, Hull East since 1970. Former Hull MP Lord Prescott couldn't contain his delight at the news, and tweeted: 'It's Happy Hour again! HullYes Well done' - a reference to the 1986 top three hit by the Housemartins, who formed in Hull. Another famous politician who made his mark on Hull, and the nation, was William Wilberforce, who devoted most of his Parliamentary career to ending the slave trade. Politician and Hull native William Wilberforce, pictured on an engraving from the 1850s, led of the movement to abolish the slave trade  The Hull native became MP for Yorkshire in 1784 and was one of England's leading abolitionists, heading the parliamentary campaign against the British slave trade for twenty-six years until the passage of the Slave Trade Act of 1807. Wilberforce supported the campaign for the complete abolition of slavery, and continued his involvement after 1826, when he resigned from Parliament because of his failing health. That campaign led to the Slavery Abolition Act 1833, which abolished slavery in most of the British Empire; Wilberforce died just three days after hearing that the passage of the Act through Parliament was assured. He was buried in Westminster Abbey, close to his friend William Pitt. Other famous faces include actress, columnist, and comedian Maureen Lipman who appeared in Educating Rita, and actor Sir Tom Courtenay. The Hull Truck Theatre was formed in 1971 and counts Alan Plater, John Godber and Oscar-winning film director Anthony Minghella among its alumni. Olympic gold-medallist boxer Luke Campbell who claimed his medal at the London 2012 Summer Olympics. Aviator Amy Johnson, who was born in Hull 1903, was worldwide famous during the 1930s and the first person to fly solo from England to Australia. Michelle Dewberry, Apprentice winner of the show's second series, was born in the city. Singer Patricia Bredin was the UK's first entry to Eurovision Song Contest in 1957 with the song 'All', coming in seventh place out of the ten entrants. Musician Paul Heaton of The Beautiful South band spent the majority of of his life in Hull, and often references this fact in songs. His first band, The Housemartins, even called their debut album London 0 Hull 4 - a reference to their claim to be only the fourth best band in Hull behind Red Guitars, Everything But The Girl and The Gargoyles. John Prescott became Lord Prescott of Kingston Upon Hull in July 2010, while Hull-native Michelle Dewberry was crowned the Apprentice winner in 2006   Hull-born Amy Johnson was a pioneering aviator who flew solo Australia Located on the banks of the River Hull and Humber the town, whose full name is Kingston Upon Hull, the city was founded in the 12th century. Monks of Meaux Abbey needed a port where they could export wool and selected a place at the junction of the rivers Hull and Humber to build a quay. Tourist attractions include the historic Old Town and Museum Quarter, which have winding paths and quaint streets, Hull Marina and The Deep aquarium, a city landmark. Hull was almost flattened to the ground when it fell victim to a Nazi German strategic bombing campaign during World War Two. Air raids began in Hull on June 19, 1940 and continued until 1945 with the city spending more than 1,000 hours under alert in what was called the Hull Blitz. Hull was the most was the most severely damaged British city or town apart from London during the war, with 86,715 buildings damaged, 95 percent of houses damaged or destroyed and 152,000 people made homeless as a result of bomb destruction or damage. Much of the city centre was completely destroyed and heavy damage was inflicted on residential areas, industry, the railways and the docks. Despite the damage and heavy casualties, the port continued to function throughout the war. As Hull celebrated, three other cities, Swansea Bay, Leicester and Dundee lost out on the chance to be named the UK's next City of Culture. Leicester hit the headlines last year after the remains of King Richard III, who died in battle in 1485, were discovered by archaeologists under a council car park in the city in September 2012. He is due to be reburied at the city's cathedral next summer. One of the oldest cities in England, Leicester also boasts leading visitor attraction, the National Space Centre and the largest Diwali celebrations outside India while celebrities to call the city home include Gary Lineker and brothers David and Richard Attenborough. However, travellers to Leicester must contend with the M1 motorway at Junction 21, with the section considered to be the busiest part in the country, and those on a diet may wish to avoid one of the city's most famous exports - Walkers Crisps. Swansea Bay has been home to a host of Hollywood stars, including actors Richard Burton, Sir Anthony Hopkins, and Catherine Zeta Jones, as well as the writer Dylan Thomas. Dubbed the 'copper kingdom', or 'copperopolis', Swansea helped forge Britain's indentity as an industrial giant, with the city providing the copper bottoms for the ships used in the Battle of Trafalgar. But through the 20th century, heavy industries in the town declined, leaving the Lower Swansea Valley filled with derelict works and mounds of waste products from them. Comic book fans willl recognise Dundee as the home of D.C. Thompson & Company, which prints the Beano, and formerly the Dandy - famous for characters such as Desperate Dan, who is commemorated with a statue in the city centre. The city also boasts Broughty Castle, which has survived numerous seiges and battles since it was built in 1496, and is now a popular museum, soon to be joined by the new Victoria and Albert outpost. The forthcoming Scottish referendum was not thought to have influenced the decision of the City of Culture panel, however If Dundee had won the bid, it could have been UK City of Culture despite being part of an independent Scotland if there was a Yes vote. Share what you think The comments below have not been moderated. The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. We are no longer accepting comments on this article. Published by Associated Newspapers Ltd Part of the Daily Mail, The Mail on Sunday & Metro Media Group ",
    "title": "City of culture? It's a Hull of a thought! £184million boost for the area once derided as a dump | Daily Mail Online",
    "datetime": "2013-11-20T08:14:30+0000",
    "url": "https://www.dailymail.co.uk/news/article-2510411/City-culture-Its-Hull-thought--184million-boost-area-derided-dump.html"
}