{
    "text": "CJ CheilJedang announced on Dec. 22 that its Bibigo Dumpling sales at home and abroad surpassed one trillion won in 2020. The milestone is quite meaningful as it has been achieved by a single food item. CJ CheilJedang designed Bibigo Dumplings for both the domestic and overseas markets from the start. In Korea, the company broke the negative image of frozen foods with the product's high quality. As a result, the company has made dumplings the most important category in the frozen food market in Korea. It boasts five dumpling products with annual sales of more than 10 billion won each, including Bibigo Wanggyoja which logs 10 billion won in monthly sales. CJ CheilJedang tailored marketing strategies for overseas markets to their food cultures and consumption trends. In particular, the Korean food giant made efforts to make Bibigo Dumplings recognized as a Korean-style dumplings by overseas consumers. In the U.S., one of CJ CheilJedang’s strategic markets, the company targeted the mainstream market from the start by making its dumplings available at Costco. In China and Japan, where there are already strong dumpling brands in the market, the company focused its marketing efforts on young people who are future consumers. the case of Europe where consumers are not much exposed to Korean food, CJ CheilJedang sought to expand distribution channels in Great Britain, France and Germany where acceptance of Asian food cultures is relatively high. Currently, 800 large distribution channels and all Costco stores across Europe are selling Bibigo Dumplings. In the U.K., France and Germany, dumpling sales recorded an average annual growth rate of 61 percent for three years from 2018 to 2020. Active investment in infrastructure has driven global sales. In 2013, the company had five production bases in Korea, the U.S., and China. The figure has grown to 15 with new production bases set up in Vietnam, Japan, and Europe (Germany). Its production lines have also quadrupled compared to 2013. The company is planning to further accelerate the expansion of its global business. In the U.S., where CJ CheilJedang enjoys the largest sales, it supplies Bibigo Dumplings through Schwan’s Co., its U.S. subsidiary which has a strong distribution network across the country. It will also speed up the development of new products to satisfy local consumers while maintaining the identity of Korean food through collaboration with Schwan’s Co. Meanwhile, CJ CheilJedang will actively promote the creation of Bibigo Dumpling facilities and standard packages based on “Only One Technology” accumulated through the Global Dumpling Technology Center established under its Food Production Division. This will standardize the tastes and quality of Bibigo Dumplings sold around the world and boost CJ CheilJedang’s capabilities. \"We have achieved our vision of seeing people enjoy Korean food all over the world once a week announced during the launch of Bibigo Dumplings,\" a CJ CheilJedang official said. \"We will continue to spare no efforts in creating the next generation of K-food that can succeed Bibigo Dumplings.\" Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "CJ Bibigo Dumplings Break through 1 Trillion Won Sales Milestone in 2020 - Businesskorea",
    "datetime": "2020-12-24T11:37:39+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=57431"
}