{
    "text": "  CJ E&M Co., South Korea's leading entertainment and media company, is pushing into the Southeastern broadcasting content market worth some 5 trillion won (US$4.41 billion) in total by acquiring a company and establishing a joint venture in Vietnam and Thailand as part of its aggressive investment efforts to jump into one of the top 10 cultural content firms in the world within four years from now.\n\nThe company announced on October 16 that it recently took over Blue Group, one of the leading content production and advertising agencies in Vietnam, and is relaunching it under the name of “CJ Blue Corp.” It also added that it would establish a joint venture “TRUE CJ CREATIONS” with Thailand's leading cable satellite television operator TrueVisions. Blue Group has the third largest market share in the domestic industry and posts 80 billion won (US$70.58 million) in annual sales. CJ E&M hasn’t reveled how much it paid to acquire the company but industry sources says that it probably paid tens of billions of won for it. Based on the acquisition of CJ Blue Corp., CJ E&M plans to remake intellectual property products, such as existing Hallyu TV dramas and entertainment contents and characters, to make it more palatable to audience in the Southeastern market, including Vietnam, and distribute them in the local market. The company expects to increase advertising sales by analyzing the plan and effects of advertising products in this process. To this end, CJ E&M has decided to expand the investment in content production infrastructure, such as studios, further. The company will also produce and sell localized contents in Thailand through TRUE CJ CREATIONS. With annual sales of 60 trillion won (US$52.93 billion), TrueVisions, which now has a stronger partnership with CJ E&M through the joint venture, is a subsidiary of True Group, a telecommunications and broadcasting firm under Thailand's largest conglomerate Charoen Pokphand Group. The two companies signed a memorandum of agreement to create a joint venture in April. As they have recently completed the establishment of the joint venture, CJ E&M and TrueVisions are planning to reveal more than 10 contents in the local market by 2021. CJ has been selling Hallyu contents to 10 countries in Asia through its subsidiary in Hong Kong. According to the data from the Korea Creative Content Agency, the average annual growth rate of Thailand and Vietnam in the broadcasting market is expected to stand at 6.3 percent and 9.3 percent, respectively, from 2014 to 2019. Considering the broadcasting market size in 2019, the market of Thailand and Vietnam will grow to US$4.25 billion (4.82 trillion won) and US$1.15 billion (1.3 trillion won). Hallyu contents have already shown the potential to succeed in the two countries. “I Am Your Grandmother,” the Vietnamese remake of the popular South Korean film \"Miss Granny,\" has become the most viewed Vietnamese movie of all time. CJ E&M also sold the format of its hit makeover show “Let Me In” to Thailand and the Thailand version of the show recorded 4.5 percent of the average viewer rating. Due to its popularity, the second season of the Thailand version of Let Me In will begin in November. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "CJ E&M Targets Southeastern Broadcasting Content Market - Businesskorea",
    "datetime": "2016-10-17T01:45:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=16213"
}