{
    "text": " CJ ENM said on Aug. 19 that the \"K-CON 2019 LA,\" which leads the spread of \"K-Culture,\" ended in great success with more than 100,000 customers. The K-CON, which was held at the Los Angeles Convention Center and the Staples Center from Aug. 15 to 18, drew 103,000 spectators to enjoy K-Culture. The figure is the largest in history, a 10-fold increase from 10,000 in the first year of K-CON LA Irvine in 2012. Since 2012, CJ ENM has hosted the world's largest K-Culture Convention K-CON in the Americas, Central and South America, Europe, the Middle East, Asia, Southeast Asia, and Oceania to promote the global spread of K-Life Style. K-CON, which marks its eighth year in 2019, has spread K-culture to a total of 1,069,000 hallyu fans around the world with the aim of globalizing hallyu. In particular, K-CON USA is a key hub area that accounts for 60 percent of K-CON's cumulative audience. LA has increased the number of days it will host this year from three to four, expanded hands-on programs that enhanced K-pop, K-beauty and K-food contents, and offered opportunities to experience hallyu. It also selected 40 promising small and medium-sized companies in South Korea that are not easy to enter the global market and held promotions and exhibitions targeting on-site audiences at the \"K-Collection\" at the LA Convention Center. In particular, 28 beauty companies participated this year, focusing their efforts on spreading K-beauty. A total of 257 small and medium-sized companies have participated in the LA K-CON over the past six years, making it a channel for small and medium-sized companies to enter the North American market. \"We are rewriting the history of K-CON every year, starting with 10,000 viewers in 2012 and growing into the world's largest hallyu festival with a cumulative audience of 1 million,\" a CJ ENM official said. \"K-CON will continue to strive to co-prosperity of small and medium-sized companies and globalize K-culture based on the philosophy of its chief executive.\" Following Japan in May this year, New York in July and LA in August, K-CON is scheduled to hold \"K-CON 2019 Thailand\" at the Impact Arena and Impact International Exhibition Center in Bangkok, Thailand, for two days from Sept. 28 to 29. ",
    "title": "CJ ENM 'K-CON' has more than 1 million viewers - Korea IT Times",
    "datetime": "2019-08-20T12:30:05+09:00",
    "url": "http://www.koreaittimes.com/news/articleView.html?idxno=92458"
}