{
    "text": "CJ LiveCity Will Include the 20,000-Capacity Seoul Metropolitan \n      Arena, a Studio Complex, a K-Culture Themed Entertainment District and \n      Waterfront Park Agreement Combines CJ’s Cultural Content Capability with AEG’s Venue \n      Management and Live Entertainment Expertise LOS ANGELES & SEOUL, South Korea--(BUSINESS WIRE)--CJ LiveCity Corporation, a subsidiary of CJ Group which owns the largest \n      media and entertainment company in Korea spanning film, music, \n      television and conventions, and AEG, the world’s leading sports and live \n      entertainment company, have signed an agreement to jointly pursue \n      building a state-of-the-art 20,000-capacity arena in Metropolitan \n      Seoul’s Goyang City, Gyeonggi Province, Korea. CJ LiveCity will include the Seoul Metropolitan Arena, as well as a \n      studio complex, a K-culture themed entertainment district and waterfront \n      park. With more than 20 million visitors projected annually, CJ LiveCity \n      will become Korea’s landmark touristic destination that will revitalize \n      both the national economy and the northern Gyeonggi Province. CJ \n      LiveCity is strategically located to attract K culture fans across Asia. \n      The site is centrally positioned among five of Korea’s largest cities \n      with a combined population of over 150 million people. The GTX highspeed \n      express train (scheduled to open in 2023) will connect CJ LiveCity to \n      Gangnam District in only 20 minutes; a 40-minute drive from Seoul’s \n      Incheon International Airport; and a 20-minute drive from Gimpo \n      International Airport. Seoul Metropolitan Arena will be designed by a world-renowned \n      architectural firm and will serve as the key landmark facility in CJ \n      LiveCity. The arena will become Korea’s largest and most advanced live \n      performance venue for K-Pop, international artist tours, sports events \n      and Hallyu content, and is poised to redefine the live entertainment \n      experience in the country. The arena and CJ LiveCity will be the first \n      of their kind destinations in Korea and will offer an ‘indoor and \n      outdoor’ experience so that audiences in the arena and visitors to CJ \n      LiveCity are able to collectively enjoy the performance together. The agreement marks AEG’s entrance into the growing Korean live \n      entertainment market and further expands the company’s footprint in Asia. Once the arena opens, AEG will curate a top-quality program of \n      international and domestic concert tours through its music division AEG \n      Presents, one of the largest music companies in the world. AEG Presents \n      has promoted world tours for artists including Ed Sheeran, Justin \n      Bieber, Paul McCartney, Elton John, Shawn Mendes, Celine Dion, Khalid, \n      Taylor Swift, The Rolling Stones and Katy Perry. CJ LiveCity’s CEO Michael Kim said, “This collaboration combines CJ’s \n      long-standing cultural business capabilities with AEG’s venue \n      development and operations expertise and its global live touring and \n      promotions capacities. Seoul Metropolitan Arena, which will be designed \n      by a leading architectural firm, is expected to be a competitive venue \n      not only across Asia, but also globally due to performances of K-Pop as \n      well as world-renowned artists.” Michael Kim continued, “Securing qualified content based on building a \n      world-class facility is a key success factor for the Arena in CJ \n      LiveCity. In this context, the collaboration with AEG, which is one of \n      the world’s leading venue operators and global live music companies, \n      will be one of the most important factors for the arena’s success.” AEG owns and has developed such renowned venues and entertainment \n      districts as STAPLES Center and L.A. LIVE in Los Angeles, which is \n      visited by more than 20 million guests annually; The O2 in London, which \n      has hosted more than 50 million people since it opened; Mercedes-Benz \n      Arena and Mercedes Platz in Berlin; and T-Mobile Arena in Las Vegas \n      through a joint venture partnership with MGM Resorts International. \n      These world-class destinations are among AEG’s global network of over \n      150 venues, which includes more than 20 of the top-100 arenas. AEG also developed China’s premier entertainment destination Mercedes \n      Benz Arena in Shanghai in partnership with the NBA and Oriental Pearl \n      Group, and is currently developing two venues in Bangkok through a joint \n      venture partnership with Thailand’s leading retail developer, The Mall \n      Group. As part of its research and analysis for developing Seoul Metropolitan \n      Arena, CJ visited several of the world’s leading arenas and made the \n      decision to pursue building the arena with AEG based on the company’s \n      extensive experience. AEG Asia’s President and CEO Adam Wilkes said, “We believe that the \n      combination of CJ LiveCity and the new Seoul Metropolitan Arena will \n      revolutionize Korea and the region’s entertainment landscape. Both AEG \n      and CJ share a vision of Korea as a world-leading entertainment \n      destination and we are thrilled to work with such an innovative leader. \n      CJ has an in-depth understanding of the Korean and Asian markets and \n      unparalleled experience in entertainment. We believe that Seoul \n      Metropolitan Arena will become a must play destination for world tours \n      and look forward to breaking new ground together.” About AEG Headquartered in Los Angeles, California, AEG is the world’s leading \n      sports and live entertainment company. With offices on five continents, \n      AEG operates in the following business segments: AEG Facilities, which \n      is affiliated with or owns, manages or consults with more than 150 \n      preeminent arenas, stadiums, theaters, clubs and convention centers \n      around the world including The O2 Arena, the Sprint Center and the \n      Mercedes-Benz Arenas; AEG Presents, which is dedicated to all aspects of \n      live contemporary music performances, including producing and promoting \n      global and regional concert tours, music and special events and \n      world-renowned festivals; AEG Real Estate, which develops world-class \n      venues, as well as major sports and entertainment districts like STAPLES \n      Center and L.A. LIVE; AEG Sports, which is the world’s largest operator \n      of sports franchises and high-profile sporting events; and AEG Global \n      Partnerships, which oversees worldwide sales and servicing of \n      sponsorships including naming rights, premium seating and other \n      strategic partnerships. Through its worldwide network of venues, \n      portfolio of powerful sports and music brands, AXS.com ticketing \n      platform, AXS cable television channel and its integrated entertainment \n      districts, AEG entertains more than 100 million guests annually. More \n      information about AEG can be found at www.aegworldwide.com. About CJ Group Established in 1953, CheilJedang (CJ) began as a food manufacturing \n      company within the Samsung Group. Spinning off from Samsung in 1993, CJ \n      Group has since become a global cultural conglomerate with a diverse \n      business portfolio in core sectors that are at the forefront of \n      spreading K-Culture including K-Pop, K-Movies and K-Food that have \n      influenced lifestyles worldwide. As of 2018, CJ Group became the 14th \n      largest conglomerate in Korea with assets of 29 trillion 523.4 billion \n      KRW or approximately $24.8 billion. CJ LiveCity Corporation, Ltd was established in 2016 to create CJ \n      LiveCity which will include a world-class Arena, studio complex, \n      next-generation theme park and waterfront park developed by Hallyucheon \n      on 302,265㎡ of land. The project is scheduled to open in 2024. A 90% stake of CJ LiveCity is held by CJ ENM, Korea’s largest media \n      conglomerate that has been leading Korea’s cultural content industry for \n      the last 20 years through the production of films, media, live \n      performances, music, and animation. Through CJ Group’s acquisition of Schwan Company, a leading U.S. food \n      manufacturer and marketer, CJ was an investor and distributor of the \n      feature film PARASITE, directed by Bong Joon Ho, which won the \n      prestigious “Palme d’Or” award at the 72nd Cannes Film \n      Festival in May 2019. Additionally, CJ Group organized the first KCON \n      convention in 2012 in Irvine California, which has since expanded into \n      eight different countries.   Michael Roth213 742 7155mroth@aegworldwide.com  Acrofan      |      Contact Us : guide@acrofan.com     |      Contents API : RSS Copyright © Acrofan All Right Reserved   ",
    "title": "CJ LiveCity Corporation and AEG to Jointly Pursue Building Korea’s First World Class Arena",
    "datetime": "2019-06-09T16:30:00+09:00",
    "url": "http://us.acrofan.com/detail.php?number=120271"
}