{
    "text": "Park Keun-hee, CEO of CJ Logistics, issued a public apology on Oct. 22 and announced measures to prevent a recurrence of the tragic incident in which a courier working for the company is believed to have died of overwork. The most noticeable action is an increase in pre-delivery package sorting manpower, something that has long been called for by workers themselves. The sorting divides packages at the logistics terminal before their delivery according to their destination areas. This makes for more efficient truck loading and helps with planning a good route. Until now, the delivery workers had to do the sorting work themselves and then load the parcels into their trucks before driving out on their route. CJ Logistics announced that it will gradually bring in 4,000 more staff to work as sorters at the logistics centers. This move is aimed at reducing the workload of delivery drivers. Unions and labor activists have welcomed CJ Logistics’ move, apparently entirely at its own expense, to increase the number of workers in package sorting, cited as the main culprit behind cases of death by overwork. According to a survey on the reality of death by overwork among courier workers jointly released last month by the Democratic Party's Euljiro Committee and the Committee for the Prevention of Work-related Deaths of Delivery Workers, couriers work an average of 71.3 hours and spend 42.8 percent of that time just on package sorting before setting out. An official of the task force said, “When 4,000 sorting personnel are deployed, the delivery workers just have to load the organized items into their cars,” adding, “We can reduce working hours by at least two to three hours.” However, some experts say that the measures proposed by CJ Logistics are at or below the level of measures that Coupang has long been taking. Coupang began employing workers that were exclusively focused on sorting tasks in 2014, long before the matter of drivers doing unpaid sorting work became an issue, and it is known that the company has 4,400 employees working in that area. This has raised interesting questions about the difference in labor costs between the two companies, both with similar numbers of dedicated sorters. Coupang has revealed that it pays its 4,400 sorters a total of 100 billion won each year in wages, while CJ Logistics has announced that it plans to spend an additional 50 billion won to hire only 4,000 workers. This is the reason why questions are being asked about whether CJ Logistics is using only hourly part-time sorters for 1 to 2 hours each, or is only introducing sorters into some of its logistics centers. Meanwhile, industry sources have expressed doubts that a solution to the fundamental problem can be found without shifting to a five-day work week and regular, direct employment such as that practiced by companies like Coupang. The recently deceased delivery driver, believed to be a victim of overwork, was engaged as an independent contractor. In contrast, Coupang directly employs and manages its own delivery drivers. Coupang Friends, as they are called, are all company employees and are covered by the four major insurances. As well as their monthly salary, they receive a vehicle and a mobile phone paid for by Coupang. What’s more, their time on the clock is limited to 52 hours a week, and they are granted annual leave. With these structures in place, Coupang’s delivery drivers seem to be freer from the risk of over-exertion and death from overwork. One industry source said, “At the press conference, CJ Logistics did not answer whether it would directly hire its workers,” adding, “If we do not introduce a direct employment system like Coupang has, it is questionable if this measure alone will solve the problem of delivery workers dying of overwork.” Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "CJ Logistics' Reform Measures Leave Room for Improvement - Businesskorea",
    "datetime": "2020-10-27T15:03:07+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=53918"
}