{
    "text": "Maria Godoy K-Cups: Quick, convenient ... and nonrecyclable.\n                \n\n                    Patrick Gensel/Flickr\n                    \n\nhide caption K-Cups: Quick, convenient ... and nonrecyclable. You want a cup of decaf. Your significant other is craving the fully caffeinated stuff. With the simple push of a button, Keurig's single-serving K-Cup coffee pods can make both of you happy. But those convenient little plastic pods can pile up quickly, and they're not recyclable. And that's created a monster of an environmental mess, says Mike Hachey. Literally. Hachey is CEO of Egg Studios, a video production company based in Halifax, Nova Scotia. Earlier this month, his firm released a 2 1/2-minute mock horror film featuring a giant, Godzilla-like creature constructed entirely of K-Cups. It's a slick little film in the found-footage style of movies like Cloverfield and The Blair Witch Project. And it's got the usual Hollywood tropes of the genre: big explosions, pedestrians fleeing in terror, an aerial onslaught of K-Cup projectiles, soldiers shooting blindly at the enemy. The point, says Hachey, is to use cinematic tactics to raise awareness of the waste. Consider this startling statistic: In 2013, Keurig Green Mountain produced 8.3 billion K-Cups — enough to circle the Earth 10.5 times. (In 2014, output shot up to 9.8 billion portion packs.) \"To see that stat ... made us think, wow,\" says Hachey. Hachey began digging into the issue after he bought a Keurig machine for his 22-person office last year. The system was great, he says. The mounds of plastic cups they were tossing out were not. \"We basically decided, 'You know what? This is just too wasteful,' \" he says. He could have left things at that, but instead, he started investigating K-Cup waste. About 1 in 8 American households now has a single-serving coffee brewer, according to a 2013 survey by the National Coffee Association, and Keurig, which launched in the 1990s, is the market leader. \"There were 60 billion K-Cups that have gone into landfills during Keurig's rise so far,\" he says. \"Obviously, Keurig is the machine of choice for many people — 13 million people have this machine.\" The video is Hachey's attempt to get K-Cup lovers thinking about what their habit means for the planet. \"We wanted to do something that looked big and felt big,\" Hachey says. His team of engineers and animators spent months working on post-production effects — work they squeezed in between paying gigs for clients. \"Doing things like this stands out and can create a bigger conversation,\" he says. Concerns about the K-Cup's environmental impact have been brewing for several years. \"It's a warranted criticism,\" says Monique Oxender, chief sustainability officer for Keurig Green Mountain. She says the company has been exploring recyclable alternatives since Green Mountain acquired Keurig in 2006. \"We're not proud of where we are right now, and we're committed to fixing it,\" she tells The Salt. Several competing coffee pod makers offer recyclable options. Nespresso, for example, makes its pods out of aluminum. But K-Cups are made from No. 7 composite plastic, which isn't recyclable in most areas. The company says its newer coffee pod systems are made from recyclable plastic: the Vue, K-Carafe (which holds multiple coffee servings in one pod), and the Bolt (designed for workplaces). But those models are just 5 percent of the beverage packs Keurig Green Mountain produces; the rest are K-Cups. So why not simply adopt those new materials in the far more ubiquitous K-Cups? The sticking point is backward compatibility — there are already millions of Keurig brewing machines out there, Oxender explains. \"It has to work on all models,\" she says. The newer recyclable pods are designed to be punctured once, not twice as with K-Cups, and the overall shape and design are different. And in K-Cups, the filter and coffee grounds are fused to the cup and the lid; in Vue cups, they are attached to the peel-away foil lid. Oxender says the company experimented with a paper K-Cup, but that didn't pan out. One challenge, she says, is that coffee starts to degrade as soon as it is exposed to oxygen. \"You have to have the right combination of cup, the filter and the top.\" \"We just haven't hit the right formula,\" she says. Keurig Green Mountain has set a deadline of 2020 for making all of its beverage pods recyclable. Hachey isn't impressed. He says that's way too far into the future. He launched a website, Kill The K-Cup, that includes a link to a Change.org petition urging the company to move up that deadline. How does Oxender respond? \"I would really love to,\" she says. \"And I'm pushing the organization as hard as I can.\" In the meantime, the new Keurig 2.0 brewing system also has critics steamed. It accepts the greener Vue and K-Carafe pods, as well as K-Cups, but it doesn't work with pods made by Keurig competitors — including some recyclable options. The new system also lacks a reusable filter, which was available for the previous model. Oxender says the company is considering bringing that option back. So what's an eco-minded K-Cup user to do? The company has a program called Grounds to Grow On for workplace K-Cup users to mail back their used pods. These get burned up as fuel — a less than ideal solution, Oxender says, but at least they don't end up in landfills. The company plans to pilot a similar program for residential users in the next few months, she says. Or you could sign up for a service like Terracycle's Zero Waste Box. The company sends you a bin to fill up with your spent pods, and you mail it back for custom recycling. Bins cost $70 to $118, depending on size. That's not cheap — but it might help keep visions of the K-Cup monster at bay. Sponsor Message Become an NPR sponsor ",
    "title": "Coffee Doomsday? Why Critics Say K-Cups Are Bad News For The Planet : The Salt : NPR",
    "url": "https://www.npr.org/sections/thesalt/2015/01/28/379395819/coffee-horror-parody-pokes-at-environmental-absurdity-of-k-cups"
}