{
    "text": "A research project in the College of Education is helping educators create more inclusive classroom environments and embrace a state requirement to incorporate Native American culture and history into curriculums. Senate Bill 13, passed by the Oregon Legislature in 2017, addressed a concern that Oregon has been “missing a critical opportunity to fully leverage the strengths, assets and contributions our Native American students bring to their communities.” The bill requires Oregon school districts to include Native American curriculum in lesson plans and includes lessons written by the Oregon Department of Education as well as each of the federally recognized tribal nations in Oregon who developed their own place-based curriculum units. Stephanie Wood, a research associate in the Center for Equity Promotion, works with her team to develop K­-12 curriculums that include Native American cultures and their histories. Though not part of the Senate Bill 13: Tribal History/Shared History curriculum mandate, these curriculum units nevertheless fill an important gap with respect to Native studies curriculum.The  study units are available to all teachers as downloadable PDFs and are created for diverse grade levels and subjects. Education about Native American history in the U.S. is often not comprehensive. Eighty-seven percent of content taught about Native Americans in school includes only history before 1900, according to a study in the journal Theory & Research in Social Education, and 27 states surveyed did not name one Native American individual in their teachings. In fact, most Americans do not even know that there is more than one Native American tribe, the study says. “Because so many U.S. citizens are barely aware that tribal nations continue to exist, and few know that these are diverse cultures with varying historical experiences, we have worked to ensure Native voices get into more classrooms nationwide,” Wood said. “We hope that a more balanced education will help reverse achievement gaps for Native students and broaden the appreciation for Indigenous cultures for non-Native students.” To ensure Native voices are heard, the project includes primarily Indigenous curriculum designers. Curriculum designers receive support locating primary sources and crafting lessons that encourage critical thinking and ensuring their units are easily transferrable to a range of classrooms. A recent grant from the Department of the Interior has helped develop 10 new lesson units. Funds helped recruit designers, conduct research, edit curriculum and publish the units on the Honoring Tribal Legacies website. Founded at the University of Oregon in 2010, Honoring Tribal Legacies is a project that initially sought to build upon a digital video archive — “Tribal Legacy” — of hundreds of educators and tribal leaders sharing their stories. Wood’s team is now expanding the free online curriculum that educators can use in their own classrooms. “Our project aims to promote greater diversity and balance in U.S. classrooms by supplying information that has been ignored and points of view that have been overlooked,” Wood said. “If our curriculum design practice can serve as a model for others seeking to address state laws for shared histories and improve conditions for native students, that would be a victory.” —By Meghan Mortensen, College of Education All Academics and Research  around@uoregon.edu  ",
    "title": "College of Education team develops inclusive K-12 curriculum | Around the O",
    "datetime": "2021-03-22T10:28:04-0700",
    "url": "https://around.uoregon.edu/content/college-education-team-develops-inclusive-k-12-curriculum"
}