{
    "text": "By \n\n\tJason Newman  For Jim Irsay,  the owner and CEO of the Indianapolis Colts and an avid collector of the world’s most sought-after guitars, it was a steal at $275,000. At Arader Galleries, a New York City gallery and auction house more accustomed to selling antique maps and rare books, two rare guitars encased in glass were the centerpieces of a controversial and historical auction featuring the items of guitar pioneer, producer and songwriter Les Paul. On the left: a 1956 Gretsch Chet Atkins rare prototype. On the right: a 1954 black Custom guitar, dubbed Black Beauty, that became the prototype for guitars used by Paul McCartney, Jimi Hendrix, Eric Clapton and Keith Richards, among many others. Chris McKinney, a product trainer for Gibson Guitars and Irsay’s longtime curator, was one of 25 people in the room Thursday night. He arrived that morning from Indianapolis on a mission from Irsay: Buy Black Beauty.  After five minutes of bidding, McKinney bested an anonymous phone bidder, paying $275,000 ($335,000 including buyer’s premium) on behalf of Irsay to add the instrument to the sports owner’s collection of 175 guitars. It was far from the most Irsay has paid for a guitar. In 2002, Irsay bought Jerry Garcia’s Tiger, the Grateful Dead member’s main guitar from 1979 to 1989, for $850,000. A decade later, in 2013, Irsay would add Bob Dylan’s Sunburst Fender Stratocaster (in)famously used at Newport Folk Festival — the famed “Dylan goes electric” guitar — for $965,000. “I wasn’t going to go north of $1 million, but I think we got it for a great price. I think it could’ve gone for a lot more.” The auction was not without its controversy. After Guitar Player magazine featured the instrument on its cover with the eye-catching cover line “The Grail! The genesis of all Les Paul guitars to come!,” many guitar experts and aficionados, including Cheap Trick’s Rick Nielsen and blues guitarist Joe Bonamassa, said the pedigree of the instrument, while important, was overhyped. Critics noted that the first Les Pauls were released in 1952, two years before Black Beauty. “Deceiving,” Nielsen told the Washington Post of the “holy grail” claim. “It’s just wrong.” Editor’s picks\n\t\n\t\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tThe 500 Greatest Albums of All Time\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tThe 50 Worst Decisions in Movie History\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tThe Biggest, Messiest Band Breakups in Music History\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tThe 500 Greatest Songs of All Time Irsay was unconcerned. “It’s an important guitar,” he tells Rolling Stone after the auction. “I don’t feel it’s the Holy Grail — that’s a mythical term — but it has huge significance in that it was Paul’s personal guitar and it was a huge influence in terms of producing electric guitars. I wasn’t going to go north of $1 million, but I think we got it for a great price. I think it could’ve gone for a lot more. This is a guitar builder’s guitar.”  Perhaps due to the criticism, Guernsey’s, the auction house that organized the sale, fell short of President Arlan Ettinger’s initial $2 million sales estimate for the instrument. “People are going to try to hype things up,” Irsay says. “I’ve seen it all the time at auctions. I think the bidding was diminished because there was some of that negative talk from some very serious people that are respected. But I’m really happy we got it.”  Colts Owner on $275k Purchase of Les Paul ‘Black Beauty’ Guitar, Page 1 of 2 We want to hear it. Send us a tip using our anonymous form. Rolling Stone is a part of Penske Media Corporation. © 2023 Rolling Stone, LLC. All rights reserved. ",
    "title": "Colts Owner on $275k Purchase of Les Paul 'Black Beauty' Guitar",
    "datetime": "2015-02-20T13:43:00+00:00",
    "url": "https://www.rollingstone.com/culture/culture-sports/colts-owner-on-275k-purchase-of-les-paul-black-beauty-guitar-174900/"
}