{
    "text": "Sign In Subscribe Now On Wednesday, members of the Comox Valley Regional District and K’ómoks First Nation came together to unveil new cultural signage at Seal Bay Park. The park, which lies within the unceded traditional territory of KFN, served as a camp during canoe trips and a resource for harvesting for many Indigenous people. K’ómoks Elected Chief Nicole Rempel along with staff from the CVRD assisted on new signage which celebrates the traditional languages of the K’ómoks First Nation and reflects a variety of flora and fauna. The signs - 32 in total - also feature phonetic pronunciations. “For me, (the event) is a step toward reconciliation, and reconciliation in our own community with a language not utilized in many years and really trying to revitalize that within the community,” says Rempel. “It’s a great first step in getting it out into the broader community in the Valley … (but) to recognize our history. It’s a diverse history with three different languages to learn that - it’s a big challenge to learn that.” The signs use designated colours to assist park users with navigation and to indicate where they can ride bikes or horses in addition to hiking and are designed to blend in within the natural environment  photos@comoxvalleyrecord.comLike us on Facebook and follow us on Twitter Be Among The First To Know Sign up for a free account today, and receive top headlines in your inbox Monday to Saturday.  This site is protected by reCAPTCHA and the Google\n                    Privacy Policy and\n                    Terms of Service apply.    This site is protected by reCAPTCHA and the Google\n                    Privacy Policy and\n                    Terms of Service apply.  A link has been emailed to you - check your inbox.  This site is protected by reCAPTCHA and the Google\n                    Privacy Policy and\n                    Terms of Service apply. A link has been emailed to you - check your inbox. About the Author: Erin Haluschak Dialogue and debate are integral to a free society and we welcome and encourage you to share your views on the issues of the day. We ask that you be respectful of others and their points of view, refrain from personal attacks and stay on topic. To learn about our commenting policies and how our community-based moderation works, please read our Community Guidelines. ",
    "title": "Comox Valley park signs reflect K’ómoks culture  - Comox Valley Record",
    "url": "https://www.comoxvalleyrecord.com/news/comox-valley-park-signs-reflect-kmoks-culture/"
}