{
    "text": "Competition among domestic and foreign over the top (OTT) service providers is expected to intensify in 2020. Last year, SK Telecom and three Korean terrestrial broadcasters jointly launched an OTT platform, Wavve, to compete with Netflix. CJ ENM and JTBC have also agreed to launch another Korean OTT platform. Disney's OTT service named “Disney Plus'' and Apple's OTT service dubbed “Apple TV Plus” are likely to make inroads into Korea this year. This means that Korean and foreign OTT players will compete neck and neck in Korea this year. Domestic OTT companies and Netflix are stepping up their efforts to secure more Korean content. As CJ ENM and JTBC decided to launch an OTT platform of their own, it has become impossible for Wavve to use their content. TV dramas of CJ ENM and JTBC already enjoy a higher viewership than those of terrestrial broadcasters, so the CJ ENM-JTBC alliance is a big threat to Wavve. As a result, Wavve plans to develop and create more content this year. Netflix is ​​collaborating with Korean content companies to increase the production of “K content” or Korean-created programs. The global OTT giant has agreed to produce 21 TV shows with CJ ENM and its subsidiary Studio Dragon for three years. It will also produce 20 TV shows for three years with JTBC. Last year, Korean TV show “Kingdom” caused a stir around the world, making Netflix feel more confident about expanding K content. KT's OTT, named “Season,” debuted in November last year. It has secured content from diverse sources ranging from terrestrial TV channels to general programming cable channels and CJ-affiliated channels. Season features more than 110 real-time broadcast channels, including CJ-affiliated channels, general programming cable channels and sports broadcasts, and replay services for over 200,000 programs, including video on demand services by the three Korean terrestrial broadcasters. A new platform will be launched too. Kakao subsidiary Kakao M plans to launch “Talk TV” this year with a focus on short video clips. It is a platform aimed at millennials who enjoy short and simple videos. Quibi, an upcoming American short-form mobile video platform headquartered in Los Angeles, California, which was founded in 2018 by Jeffrey Katzenberg, succeeded in attracting US$1 billion in investment even before the service was launched. The expected entry into Korea of more foreign OTT service providers will change the landscape of the Korean OTT industry this year. Like Netflix, which has rapidly expanded subscribers in collaboration with LG U+, Disney Plus and Apple TV Plus may enter the Korean market by joining hands with Korean OTT companies. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Competition among Korean and Global OTT Players to Intensify in 2020 - Businesskorea",
    "datetime": "2020-01-07T14:44:44+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=39883"
}