{
    "text": "South Hills High School teacher Saleta Thomas bills her class as a digital game-design program for students. But once students opt to take the class, they start learning computer coding through basic programs like Alice, then move on to Flash, JavaScript, ActionScript, and other coding languages. Since the students in the Fort Worth, Texas, school are focused on digital-game creation, often they don’t even realize they’re learning computer coding, Thomas says. The “marketing” ploy of labeling the course digital-game design has had an impact, she says. Computer science wasn’t a popular course at the low-income school, which has struggled over the past few years to bring test scores up, but the digital-gaming elective has gone from 22 students its first year to 45 this school year, and 81 are projected for the next school year. “If we get the hook into them through gaming, then when they go to college they can see there’s a whole lot more offered in computer science,” Thomas says. “If you major in computer science, your world is really open.”  Computer programmers and software engineers are urging that K-12 students be introduced to computer coding—designing and writing source code for computers—earlier in their educational careers, even as early as elementary school. According to the organization Code.org, which seeks to raise awareness about the need for students to learn computer coding, 1.4 million jobs in the computer field, including coding, engineering, and data mining, will be available in the United States by 2020, but there will be only 400,000 college students majoring in computer science. Those jobs come with significantly higher wages than jobs associated with many other college degrees. The starting salary for a 2013 computer science major is about $64,800, a 5 percent increase over the previous year, according to the National Association of Colleges and Employers, based in Bethlehem, Pa., which tracks starting salaries for college graduates.  But a majority of K-12 schools don’t offer computer science programs, and the number of computer science students in college has fallen, according to Code.org, even though coding experiences for K-12 students are important not just from a career perspective, but also from a purely educational perspective, says Mitchel Resnick, a professor of learning research at the MIT Media Lab. The lab has created Scratch, a free program for students that allows them to create interactive stories, digital games, and animations while learning the basics of computer coding. Coding teaches problem-solving, communication, and collaboration, Resnick says. “The ability to code should be one aspect of fluency in the 21st century,” he says. “Everyone should learn to code because it makes you a better learner.” Methods for introducing coding to K-12 students are varied. There are traditional computer science classes in high schools, where students learn digital languages like Java, C++, or HTML. Courses in video-game creation, such as the one at South Hills High, are increasing in popularity since that is often what draws students in. And enrichment opportunities through programs such as CodeEd, which focuses on teaching computer science to girls, and CoderDojo, an after-school coding club staffed by volunteers, are also gaining in popularity. The 13,200-student Albemarle County schools in Virginia launched CoderDojos at five sites in the district this past year after advertising a summer CoderDojo academy before the academic year began. Officials expected to have 50 students sign up for the one-week summer session, but found themselves with a list of 1,100 students who wanted to participate, says Vincent Scheivert, the district’s chief information officer. Each CoderDojo is run independently by volunteers and is typically available for free to mixed ages of students. Students work on Scratch programming, HTML, blog creation, Alice (another coding program aimed at students and created by Carnegie Mellon University) and Kodu, a visual-programming language made for game creation and geared toward children. This summer, the Albemarle County district plans to expand its free CoderDojo academy to two weeks. Each day, students will interact with a different type of technology. Beginner, intermediate, and advanced HTML and JavaScript will be offered for those who want to go deeper.  In Albemarle County’s version of CoderDojo, only the students are allowed to touch the computers, Scheivert says. “We try our best to stay out of the kids’ way,” he says. “We’re promoting the idea that they are producers of technology, not just consumers.” Scheivert says he considers the skills students develop through CoderDojo “a direct translation” to skills they need in education: how to work through barriers, problem-solving, higher-order thinking skills. And because the sessions are based on ability rather than age, it’s not uncommon to see a student from middle or even elementary school collaborating with a high school student, he says. Michael Craddock, a computer science teacher at Albemarle’s Monticello High School, runs a CoderDojo at his school and also teaches computer science. Craddock says he sees a direct influence on other areas of education. Designing games, he says, forces students to set up formulas and functions based on mathematics, for example. “To make a character go up or down or left or right, you’re using the Pythagorean theorem constantly,” he says. “For most of my students, that is the first time they’ve used the Pythagorean theorem outside of looking at triangles on a worksheet. It opens up why math matters.” In fact, coding relates so well to math that Emmanuel Schanzer developed Bootstrap, a free curriculum for students ages 12 to 16, which teaches them to program video games using algebraic and geometric concepts. The Bootstrap curriculum goes beyond writing code, Schanzer says, by using programming language that promotes higher-level thinking: how to attack an algebra problem, break it down into parts, and follow steps for coding and solving mathematical problems. “It’s so much more about thinking and problem-solving that has nothing to do with touching a keyboard,” he says. This new emphasis on coding and its importance in other areas of education is beneficial. But Hadi Partovi, the CEO and co-founder of Code.org, says the approach to teaching coding needs to change. While he lauds organizations like CoderDojo and others that bring coding to students in a mostly extracurricular setting through volunteers, he remains concerned about the role that coding education plays in school. “We don’t teach reading and math with volunteers,” he says. “Ten to 15 years from now, computer science will be as important as reading and math, and we’ll be wondering why we didn’t change sooner.” Melanie Wiscount, a computer science teacher at McKinley Tech High School in Washington, is trying to make that change now. In her classes, students started with Scratch and Alice and are now learning coding languages like Python, JavaScript, and HTML. Wiscount uses Bootstrap as well as Codecademy, which provides a curriculum and a series of challenges and projects for students. Students are able to log in to the site from home and work on projects there as well, she says. Codecademy also contains a social-networking feature, to allow students to code with friends, and students earn points and badges for their work building websites, games, and apps. Wiscount’s students are now creating a mobile app about the attractions and landmarks in Washington. When tourists stroll around the city, GPS will track their movements, and avatars will pop up to give them historical context or fun facts about the monuments they’re visiting. “Abraham Lincoln can walk up on their screen and give them a quest,” Wiscount says. “They can answer a question by texting narration, by taking a picture, or a video.” Freshman Nathan Bronnée took Wiscount’s class because he entered school a few weeks into the academic year and it was one of the only electives still available. When he thought of computer coding, he envisioned “that stereotype of the pasty white guy sitting in front of a laptop.”  But Bronnée says he’s enjoyed Bootstrap (which also helped him pull up his algebra grade) and the classwork with Codecademy, and was surprised how much of coding involved working with fellow students. Bronnée, who is moving to a new school, says he plans to continue working on Codecademy projects through the website and is interested in taking some computer science classes in college—something he might have been hesitant to do before Wiscount’s class. “I expect to take a course like this in college,” he says. “It’s an opportunity people might want to take, but they might be scared they’re not the right person.” The potential for helping students secure a lucrative future job is also a driver for some teachers. The 600-student Tygarts Valley Middle/High School for grades 6-12, in rural Mill Creek, W.Va., serves a mostly low-income population, says teacher Mollie Ferguson, who started a class in video-game design using a program called Globaloria. Ferguson teaches various aspects of game design, including coding, she says. The idea that students who typically may not have a wide range of career options could use her class and coding as a jumping-off point to a better future is a selling point, Ferguson says. “With coding, it’s a skill they can actually take away and use it to make a career for themselves,” she says. “They can learn how to apply coding to games, but also to something else.”  A version of this article appeared in the June 12, 2013 edition of Digital Directions as Cracking the Code ",
    "title": "Computer Coding Lessons Expanding for K-12 Students",
    "datetime": "2013-06-12T01:49:19",
    "url": "https://www.edweek.org/teaching-learning/computer-coding-lessons-expanding-for-k-12-students/2013/06"
}