{
    "text": "Conan O’Brien’s very special Korea episode, which aired on TBS over the weekend, is a much bigger deal than you might imagine (clips are available on TBS.com). It is as good a glimpse as you’re likely to find of both the limitlessness and the limits of globalization in the year 2016. Conan is joined in this adventure by Korean-American actor Steven Yeun, who plays The Walking Dead’s scrappy Glenn Rhee. Yeun serves as the Virgil to Coco’s Dante. They’re two deadpan comedians in a country where people don’t smile at anyone they don’t know. Now, Conan O’Brien basically wins the Nobel Prize in awkwardness, and he knows it. He would appear out of place even at a convention of ginger Irish-American comedians who went to Harvard in the 1980s—let alone the streets of Seoul. What most Americans wouldn’t pick up on, however, is that Steven Yeun looks almost as out of place in Korea as Conan does. Conan in Korea is also a snapshot of how three distinct cultural groups now view each other: Americans, Koreans, and Korean-Americans. And make no mistake, the latter two groups are increasingly non-overlapping. Even though the late-night show Conan is not broadcast in Korea, its internet episodes have gained a cult following among the millennial Korean set; in fact, upon arriving at Incheon, airport he was greeted by 2,000 fans. It’s not hard to see why. Conan is a bit of a curiosity: A satirist who hates cynicism. “For the record, [cynicism] is my least favorite quality,” he famously said on his final NBC Tonight Show episode in 2010. His treatment of Korea is respectful and at times educational (Coco is a known history buff). And it’s a good thing, too, because when you are a Western comic visiting Korea, you are not the Sacha Baron-Cohen in this equation: Koreans are. Comedian Jack Black learned this the hard way, when he was in Korea earlier this year promoting Kung Fu Panda 3 and was subjected to all manner of humiliation on the Korean variety show Infinite Challenge. Chloë Grace Moretz, who guest-starred on Korea’s iteration of Saturday Night Live earlier this year, was forced to wear a traditional Korean outfit (while everyone else was in regular Western dress), go completely mental, and bitch-slap a man with a wad of kimchi. (Google “kimchi slap.” It’s a real thing.) Conan, in turn, sang for his supper by starring in a K-pop music video alongside Steven Yeun (who can actually sing) and big-deal Korean recording artist JYP. Conan also did a cameo on a popular K-drama One More Happy Ending (about aging girl K-pop stars), in which he plays a talking goldfish and unwelcome client at an upscale Seoul matchmaking firm. What’s significant about this appearance is that Conan’s character, a Westerner, is even allowed to be a client at a Korean matchmaking firm. Miscegenation has historically been taboo in Korea, only becoming barely permissible in recent years due a rural female shortage and the inevitability of immigration. In the context of the K-drama, the heroine is offput by Conan’s familiarity, exaggerated bravado, and awkwardness. The white guy is never the hero. You might think that a Korean-American star visiting Korea might get a hero’s welcome. But this is rarely the case. Steven Yeun might well be the one of the most globally recognizable actors of Korean descent. But within Korea, he doesn’t conform to the ideal of a Korean celebrity—for no real reason other than that he is unaffected, he hasn’t had epicanthic fold surgery on his eyelids, and his haircut cost less than $400. Going through the Korean media coverage of Yeun, it’s clear to me that Koreans don’t know what to do with him, even though his Korean is quite good. To Koreans, he is in that awkward Korean-American category—neither fish nor fowl, inherently somewhat untrustworthy. I have the same problem when I visit Korea; it’s why I don’t go there unless I have to. Besides which, trends change so rapidly in Korea that ex-pats can barely keep up—not even with food trends. In one scene from the Conan special, Yeun is comically unable to identify any of the side dishes at a Seoul restaurant, leading Conan to comment, “You’re sort of like Anthony Bourdain if he knew absolutely nothing.” For me, and I suspect for a lot of Asian Americans, the Conan in Korea episode was as much about Steven Yeun as it was about Conan. Asian-Americans and particularly Korean-Americans see Steven Yeun as their embodiment of It Gets Better, in perhaps the same way that African-Americans viewed Sidney Poitier in the 1960s. I would go so far as to say that in entertainment and pop cultural terms, it’s now the 1960s for Asian-Americans. Oh, you think I’m exaggerating? How could America be 60 years behind in their acceptance of Korean (or Asian-) Americans? Well, here’s one example: In 2006, when my novel Kept: A Comedy of Sex and Manners (Simon & Schuster) was published, my US agent met with a Hollywood agent to try to sell the movie rights. The Hollywood agent’s response: “I don’t see a movie being made with an Asian-American heroine.” This was just 10 years ago, people. So why, only four years later in 2010, was Steven Yeun able to get cast as a central character in what would become  America’s top-rated TV show for the last four years? Answer: historically, zombie-fighter has always been an equal-opportunity job. As I’ve written elsewhere, George Romero set the precedent for this, making the landmark decision of casting an African-American actor (Duane Jones) as the star and hero of his 1968 seminal zombie classic Night of the Living Dead. That movie just so happens to have come out the same year that the Civil Rights Act passed. This particular horror sub-genre, in other words, is the minority kingmaker. Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  ",
    "title": "Conan O'Brien accidentally exposed the culture gap between Koreans and Korean-Americans",
    "datetime": "2016-04-13T12:00:53.598Z",
    "url": "https://qz.com/659674/conan-obrien-accidentally-exposed-the-culture-gap-between-koreans-and-korean-americans"
}