{
    "text": "By Zhuo Yang Apartments, apartments, everywhere; nor any flat to buy: Survey after survey reveals that young Chinese are stressed out — and skyrocketing property prices are one of the main reasons.\n                \n                    \n                    Zhuo Yang/NPR\n                    \n                \nhide caption Apartments, apartments, everywhere; nor any flat to buy: Survey after survey reveals that young Chinese are stressed out — and skyrocketing property prices are one of the main reasons. Every weekend, I rise at 7 a.m. to get on the subway to hunt for apartments. The cheapest two-bedroom homes in the suburbs of Shanghai cost $200,000 or more, which would take me more than 12 years to pay off — if I don't spend a dime of what I make. This is the reality of China's boom. After decades of explosive growth, the cost of living in China's big cities has skyrocketed, and many young people have been priced out of the housing market. People in the West tend to think the Chinese are taking over the world; the reality is young people here struggle to make ends meet. Putting food on the table and having a shelter are still their biggest concerns. I'm 27, with a graduate degree in journalism and a good job in my field, and I'm worried about these basics. No Home, No Honey Owning a home is even more important in China than in America. Homeownership is the main prerequisite for single men looking for wives — property becoming a unifying force that binds two families together. A rough calculation reveals that every month after paying the mortgage and for food and other essentials, I will have a little more than $100 left. A crowded bus ride to the office now takes nearly two hours. Mothers-in-law want their daughters to have an easy life, making single male homeowners the preferred choice of a mate. But that's not enough. In-laws demand that homeownership certificates include their daughters' names — an insurance policy that entitles the wife to half the value of a property if a couple divorces. A growing income gap and rampant materialism have driven many young women to openly focus on finding rich husbands. Some who do agree to marry poorer guys are reluctant to share the burden of paying off debts. Businesslike as it may sound, the family negotiations before marriage are to a great extent like preparations for a business transaction. This is true of many Chinese families, mine included. This age-old practice is suffocating many young men in China. Buying property is the talk of the nation, just as it was in the U.S. before the bubble burst a number of years ago. Except it is much harder here. Statistics show on average it takes families in Shanghai 28 years to pay off an apartment, in a city where prices compare with big American cities but incomes are far lower. Not A Supply Problem After seeing a lot of real estate during my three months of house hunting, it seems to me that the high prices aren't a result of demand outstripping supply but the result of a policy failure. Block after block of apartments in suburban Shanghai sits empty. It's more obvious at night, when few lights in those buildings are on. Apartments in Shanghai cost as much as they do in major American cities — but incomes are much lower.\n                \n                    \n                    faceleg/Flickr\n                    \n                \nhide caption Apartments in Shanghai cost as much as they do in major American cities — but incomes are much lower. The popular Chinese magazine Caijing recently reported that a survey done by the Beijing police last year indicated that of the 12.3 million apartments in the city, 3.8 million were vacant. That's a vacancy rate of 29 percent. With limited investment options, companies and the rich have poured money into the real estate market. They are willing to let property sit empty so it can fetch a good price — in the belief that incomes and demand will eventually catch up. A commentary in the People's Daily, the Communist Party's main newspaper, recently asked why so many young people suddenly feel so old. A subsequent survey by Beijing News showed 86 percent of respondents cite high housing prices as the major source of pressure in their lives. This frustration is widely shared. I've started losing sleep since I began house hunting. What A \"Bargain\" To find a cheaper home, I focused on the areas at the end of each subway line. The search for a good price pushed me so far out, I came within a few miles of the next province. After months of painstaking online searches and visits, I settled on an 860-square-foot, two-bedroom apartment that costs $208,000. That price tag is so big that it felt like a boulder on my shoulder. However, in the current market, this price really seems like a bargain. The apartment was built six years ago; colorful fliers from small businesses cover the walls of the building's hallways. It's just the skeleton of a living space, really; rooms with walls and uneven bare concrete floor and not much else — no appliances, no wooden flooring or carpeting, no usable toilet even. To modestly outfit the place will require an additional $40,000. A rough calculation reveals that every month after paying the mortgage and for food and other essentials, I will have a little more than $100 left. A crowded bus ride to the office now takes nearly two hours. A friend of mine, who moved to Australia and now works in a factory making springs for pacemakers and hearing aids near Sydney, owns a house, a brand new Toyota SUV and has three kids. Our monthly income is almost the same. He drives 20 minutes to his workplace. Life in Australia seems much easier, although he does complain he has no savings. Things should get better. Thanks to Shanghai's fast-expanding infrastructure, a new subway line is expected to open by the end of this year. That would very likely cut my commuting time to 70 minutes. My father comes from a poor farming village in western China. It has taken a few generations for my family to have a member able to live and work in what is arguably China's premier megacity. To give my children a leg up, I plan to stay. Zhuo Yang works in NPR's Shanghai bureau. Sponsor Message Become an NPR sponsor ",
    "title": "Concrete Floors! No Working Toilet! Just $200K In Shanghai : Parallels : NPR",
    "url": "https://www.npr.org/sections/parallels/2013/06/23/193877084/concrete-floors-no-working-toilet-just-200k-in-shanghai"
}