{
    "text": "To celebrate the Chinese New Year — the Year of the Monkey — the K-State Confucius Institute hosted its first Chinese Culture Fair from 2-5 p.m. Sunday in the K-State Student Union Main Ballroom. There were 14 events showcasing Chinese culture, including Chinese calligraphy, paper-cutting, Chinese tangrams, jigsaw puzzles, Chinese chess and the Chinese game Go, as well as traditional costumes and Chinese food called dim sums. “This is a great chance, not only for locals to experience Chinese culture, but also for Chinese culture to spread,” said Max Lu, geography professor, director of the Confucius Institute and organizer of the event. “That’s what we are looking forward to.” As the coordinator of the Chinese Culture Fair, Lu said he feels satisfied with this first attempt at a Chinese New Year event. “There are more visitors coming than I expected,” Lu said. Lu said he visited several local elementary schools, like Lee Elementary School, with other staff members prior to the event to make announcements. Attendees of the event received a “passport” made by the Confucius Institute. With this ticket, visitors were eligible to participate in as many of the event’s hands-on activities as they wanted. Alice Trussell, Academic Services Librarian, said that in most cases, the ways she acknowledges Chinese culture is through reading and interacting with some Chinese students. “It is so interesting,” Werth said. “You can see the good turnout here. We expect to get more chances to get closer to China.” The scene of the event was decorated with traditional Chinese decoration, especially the Chinese character “Luck.” At around 3 p.m., five members of the new Chinese Art Group presented a fan dance called Wing Chun. Yichao Zhang, senior in chemical engineering and one of the performers, said she appreciated the chance to perform at the event. She said it was a surprise to see how much applause it received, though Zhang and her teammates started preparing for it in December. The event progressively became busier. Lani Sandoral, senior in animal sciences and industry, said she came with her five children. Sandoral said her daughter received a prize from the volunteer at her first time to play the game Go, and she said she wondered how to get Chinese chess for her children to develop their thinking. Xiuhuan Shi, biological and agricultural research assistant, said she and her husband were both volunteers in the fair and were responsible for giving guidance and treats in a game called “Lucky Wheels.” “I feel this Chinese New Year is much more special because there are more people spending good time and taking a trip to Chinese culture with us,” Shi said. ",
    "title": "Confucius Institute welcomes Year of Monkey with culture fair - The Collegian",
    "datetime": "2016-02-08T06:00:55+00:00",
    "url": "https://www.kstatecollegian.com/2016/02/08/confucius-institute-welcomes-year-of-monkey-with-culture-fair/"
}