{
    "text": "The COVID-19 pandemic, which has challenged non-profit organizations throughout the community, has left the future Cornwall Arts and Culture Centre unscathed. As of Tuesday, the Be The Link fundraiser, organized to support the costs of establishing the centre in the former Bank of Montreal building at 159 Pitt St., in downtown Cornwall, had raised $784,093 — nearing its $1-million goal. Sixty per cent of the amount raised has been deposited within the Art Trust Fund account, whereas the other 40 per cent consists of pledges. These are promises that a certain amount of funds will be donated towards the fundraiser. Donors that do so can pledge to donate over five years. “We have been surprised by the generosity of our donors – this sum has been raised without an architectural drawing,” said fundraising campaign chair Katie Burke. “People have had to envision what it will look like. “The centre will be a long-overdue asset to our community.” Back in January, the fundraiser was sitting at $542,630. Eight months later, nearly $250,000 has been added. These funds were raised whilst the local community lived through various levels of pandemic restrictions. “It’s hard to explain,” Burke told the Standard-Freeholder. “Perhaps donors had time to think, being indoors for that long. It has been an interesting process so far. We want to do it right the first time — people want us to see it done right.” But it isn’t just individual donors that have been assisting in raising the funds — several businesses, organizations and service clubs have also joined in. The Kinsmen Club, the Rotary Club of Cornwall Sunrise, the Rotary Club of Cornwall, the Lions Club of Cornwall, and the Club Optimiste de Cornwall have all participated. The former Bank of Montreal building was purchased by the City of Cornwall in 2018 for $450,000, with a goal of transforming it into an arts and culture centre. Doing so was estimated by the city to cost from $4 million to $6 million. The launch of the fundraiser took place within its walls, in January 2019. Burke also announced an architect firm employed by the city had recently visited the building and were tasked with developing the transformation plans. “To raise this amount without an idea of exactly what the Arts and Culture Centre might look like is a testament to the faith of the donors that this will come to be and to the need for such a centre,” she said. According to an update from Cornwall parks and recreation manager Jamie Fawthrop shared by Burke, structural engineers had proceeded to make holes in several walls in order to inspect how the building was being supported. “They will also be going into the basement of the restaurant next door so that can have a complete understanding of the neighbouring structures,” he said. “Once this structural review is complete they will have their costing consultant prepare a detailed construction estimate for the preliminary floor plan design that’s been developed. We’ve also recently completed a geotechnical study which will tell the structural engineer the capacity of the underlying soil to bear the weight of the new addition.” fracine@postmedia.com twitter.com/FrancisRacine Postmedia is committed to maintaining a lively but civil forum for discussion and encourage all readers to share their views on our articles. Comments may take up to an hour for moderation before appearing on the site. We ask you to keep your comments relevant and respectful. We have enabled email notifications—you will now receive an email if you receive a reply to your comment, there is an update to a comment thread you follow or if a user you follow comments. Visit our Community Guidelines for more information and details on how to adjust your email settings. To contribute to the conversation, you need to be logged in. If you are not yet registered, create your account now - it's FREE. 365 Bloor Street East, Toronto, Ontario, M4W 3L4 © 2023 Cornwall Standard-Freeholder, a division of Postmedia Network Inc. All rights reserved. Unauthorized distribution, transmission or republication strictly prohibited. This website uses cookies to personalize your content (including ads), and allows us to analyze our traffic. Read more about cookies here. By continuing to use our site, you agree to our Terms of Service and Privacy Policy. ",
    "title": "Cornwall arts and culture centre fundraising surpasses $780K | Cornwall Standard-Freeholder",
    "url": "https://www.standard-freeholder.com/news/local-news/cornwall-arts-and-culture-centre-fundraising-surpasses-780k"
}