{
    "text": "Share Copied Mickey Mouse entertains visitors on the opening day of the Disney Resort in Shanghai, China, June 16, 2016. /AP Photo With the number of coronavirus infections continuing to grow and residents in China advised to avoid public places for fear of contagion, the entertainment and leisure industry has all but grounded to a halt. Top acts have cancelled concerts, amusement parks have shuttered and cinemas – a beloved past-time in China – have seen their numbers dwindle. The happiest place on earth Shanghai Disney Resort announced on January 26 that it was closing temporarily \"as a precautionary measure in line with prevention efforts taking place across China\" and Hong Kong Disneyland Park followed suit a day later. U.S. rock band Pixies has cancelled its China dates – in Shanghai and Beijing on February 29 and March 1 –  while British singer Craig David has scrapped a February 17 appearance in Shanghai. The Boston Symphony Orchestra (BSO) has axed its entire East Asia tour, which would have taken in Shanghai, Hong Kong, Taipei and Seoul on February 6-16. \"All of us at the Boston Symphony Orchestra are incredibly sad to have to cancel our tour,\" BSO music director and renowned conductor Andris Nelsons said in a statement, \"(but) we need to put the health and well-being of our musicians first and foremost.\" Read more: Battling the novel coronavirus - What we know so far Coronavirus wreaks havoc on Beijing 2022 test events, Olympic qualifiers Members of South Korean music band GOT7 pose for photos at the Mnet Asian Music Awards (MAMA) in Hong Kong, December 14, 2018. /AP Photo The coronavirus has so far killed 426 people, with over 20,500 infected cases worldwide, leading authorities to lock down several cities near the epicenter of the outbreak in Wuhan, of central China's Hubei Province. But elsewhere too authorities have recommended that people wear masks in public and avoid crowded places. Restaurants, bars and shops have also remained closed longer than usual after the Chinese New Year holiday – which began on January 25 – amid fears the virus could spread easily. Empty stages, dark screens The public health emergency has led theaters and local stars to pull the plug on upcoming shows. The National Center for Performing Arts, Beijing's foremost opera and concert hall, has cancelled all performances for the month of February. Hong Kong star Andy Lau scrapped 12 concerts in Hong Kong in February, as well as dates in Wuhan in April, while fellow Cantopop singer Leon Lai postponed shows over the weekend in Macao. Cinemas in the world's second largest movie market have also been badly hit, with studios scrapping the release of seven Chinese movies that had been planned for the holiday and thousands of cinemas reportedly shutting in the wake of the outbreak. Box-office results for January 27 to February 2 showed just over 164,000 tickets were sold nationwide for the top 10 films. That compared to almost 5.2 million the previous week – when stricter health measures began being implemented – and represented a mere fraction of the 130.7 million cinema entries recorded in the week following Chinese New Year last year. Movie showings also dropped to about 14,200 from the usual six-digit figures. A movie goer walks by display panels showing the movie 'Crazy Rich Asians' near ticket machines at a cinema in Beijing, China, December 4, 2018. /AP Photo Beyond China Even beyond China's borders, the coronavirus outbreak has caused a headache for event organizers and tour promoters. K-pop band Winner cancelled a February 8 concert in Singapore, where there have been 18 confirmed cases of coronavirus, while other South Korean acts like GOT7, Taeyeon and NCT Dream have postponed shows in Singapore, Bangkok and Macao over the next month. A total of 22 countries, besides China, have reported cases of coronavirus, including Japan, South Korea, Thailand and the U.S. At risk The Hong Kong Arts Festival, which the Boston Symphony Orchestra was due to open, is now struggling under the weight of cancellations. Up to a sixth of performances planned during the month-long event starting on February 13 – including London dance company Sadler's Wells and Bristol's Old Vic theatre – have already been lost, according to organizers. This was due to performance venues being shut by local authorities as a precaution against a further spread of the virus. So far, many events scheduled for February have been cancelled, but with experts warning the outbreak has yet to peak, the arts and culture calendar for the coming months could be further thrown into disarray, in China and around Asia. Copyright © 2020 CGTN. Beijing ICP prepared NO.16065310-3 Copyright © 2020 CGTN. Beijing ICP prepared NO.16065310-3 Copyright © 2020 CGTN. Beijing ICP prepared NO.16065310-3 ",
    "title": "Coronavirus hits Mickey Mouse, K-pop acts and cinemas - CGTN",
    "url": "https://news.cgtn.com/news/2020-02-04/Coronavirus-hits-Mickey-Mouse-K-pop-acts-and-cinemas-NOeXWLY1Mc/index.html"
}