{
    "text": "To celebrate the global shopping festival “Black Friday,” Coupang will hold a special event to offer global products and brands with the biggest benefits of the year until Nov. 28. This year’s special event for Black Friday will be held for Coupang’s Rocket Jikgu and directly imported Rocket Delivery products, and it is drawing attention as a great number of global brands that were popular on Coupang are participating. In particular, various discount benefits will be available along with “time sale” events held every day. Popular electronics/digital product brands such as Samsung, LG, Dyson, Xiaomi, Bose, Logitec, Cuisinart, Philips, etc., as well as global fashion brands including Nike, Adidas, MLB, and Sketchers will be part of the event. In addition, P&G, an American company that offers a myriad of daily necessities, and Lego, the brand that has been popular for overseas direct purchasing, etc., will participate in the event. For Wow members, Coupang will offer popular items as bundles in the nutritional supplements, food, kitchen items, fashion, etc., category and products of popular brands at discounted prices. Categories and brands offered at low prices will change every day during the event period, which Wow members can check through “Today’s Category” and “Today’s Brand.” In particular, for Wow members, even a single item will be delivered for free and up to a 40 percent discount will be offered additionally for household digital products. In addition, all members will be provided with a maximum of 20,000 won vouchers for all Rocket Jikgu products and up to 30 percent discounts will be applied to all TV products from Samsung and LG. During the Black Friday special event period, Coupang will also hold “Super sale price for only one day” to offer products at a low price. In addition to this, during the event period, “time sale for limited inventory” will be held four times every day at 7:00-11:00, 11:00-15:00, 15:00-19:00, and 19:00-23:00. An official from Coupang said, “Black Friday started as an American culture, evolved to become a global shopping festival, and we prepared this special event with great benefits for Coupang’s customers to enjoy it,” adding, “We hope you to get great deals at discounted prices for Rocket Jikgu products and the products you’ve been eyeing so far as popular global brands will be participating. Coupang will continue to hold various events for the customers in the future too.” Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Coupang Holds 'Black Friday' Special Event - Businesskorea",
    "datetime": "2021-11-26T11:54:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=82308"
}