{
    "text": "  K-9 officers make up a vital part of the Hillsborough Police Department.  These dogs are highly trained, and human officers rely on them to track suspects and assist in peaceful arrests. But it takes a lot of trust between dogs and their handler to do this kind of work.  That complicates things when a police dog retires.  That's the subject of this week's episode of Criminal, a podcast recorded and produced in the studios of WUNC and hosted by Phoebe Judge. Many of the K-9 dogs are European-trained German Shepherds, and there's high demand for them. But they come at a steep price, around $12,000. The police department in Hillsborough, N.C., has two dogs, and their handler is Cpl. Scott Foster. \"He's absolutely devoted to how important a tool and resource these dogs can be in helping police departments,\" Judge said. These K-9s are so highly coveted because of their keen sense of smell, which can be trained to detect all sorts of scents: Suspects, weapons, drugs. \"A lot of times what’ll happen is, (suspects) will initially run a short distance and hide, and they’ll see us coming, and they’re like, 'How are they finding me?'\" Foster said. \"And then they’ll run a little further and then they’ll hide. That’s when the panic sets in. What they don’t realize is the more panic and adrenaline they give off, the easier they’re actually making our job.\" After a K-9 locates its target, they may attack but not to cause harm. \"These dogs are highly trained to bite with the back teeth and just hold,\" Judge said. \"These police dogs, they’re not trying to maul anyone. They’re just trying to get the person to stop running.\"  Foster has grown close with his canine partners over the years, particularly his current dog, Vader. It's not just a work relationship either; when Foster clocks out, he takes Vader home. \"One of the most interesting things is that all of these officers, their cop cars have the name of their dog on the window, just kind of symbolizes this is their actual partner,\" Judge said. Foster has shown the relationship between K-9 dog and officer is long-lasting. His previous partner, Talon, had to be retired due to injury, but Foster has continued to caring for him. \"He’s so devoted to these animals that he set up his whole entire house to house Vader and Talon with the idea that neither one of them will ever think they’re getting the short shrift,\" Judge said. \"Just because Talon doesn’t go to work anymore, Scott doesn't want him to think he’s now not important.\" Says Foster, \"It may be silly to a certain point that I’m putting human emotions on an animal that may not feel it, but I don’t want (Talon) to see Vader in equipment that he would recognize and me in a uniform he would recognize, leaving in what at one time was his car.\" To find out more, visit thisiscriminal.com. Also, you can hear the latest episode of Criminal on WUNC on Sunday afternoon. Watch Judge take on one of the K-9s: https://www.youtube.com/watch?v=aRYkHA98MzY&feature=youtu.be ",
    "title": "Criminal: The Story Of A K-9 Love Triangle | WUNC",
    "datetime": "2015-10-30T11:03:12",
    "url": "https://www.wunc.org/arts-culture/2015-10-30/criminal-the-story-of-a-k-9-love-triangle"
}