{
    "text": "By Assel Satubaldina in Culture on 16 August 2022 NUR-SULTAN – Over the past decade, Korean pop culture has swept the globe. Many countries have witnessed a massive rise in K-pop fans. While Kazakhstan was no exception, Korean culture has been particularly welcomed in Kazakhstan, said Lee Hyeran, director of the Korean Cultural Center in Kazakhstan in an interview with The Astana Times. K-Pop fans holding posters during Hello to K-Pop concert in Nur-Sultan on June 18. Photo credit: Korean Cultural Center This year, 2022, is designated as the year of cultural exchange between Kazakhstan and Korea after the official visit of President Kassym-Jomart Tokayev to Seoul in August 2021, the first foreign leader to visit South Korea since the pandemic began. Cultural exchanges have been an important part of growing bilateral ties between Kazakhstan and South Korea which celebrate 30 years of diplomatic relations in 2022. “In my opinion, the reason [for K-Pop popularity] lies in the cultural and emotional commonalities between our people. The two countries have countless common features, such as a beautiful native language, genuine care for family and neighbors, and a traditional culture associated with the expression of joy and sorrow,” she said. The Korean Cultural Center, established in March 2010, is the only such center in Central Asia. Korean Cultural Center Director Lee Hyeran. Photo credit: Korean Cultural Center Korean pop culture, also known as the Korean Hallyu wave, includes the K-Pop genre, K-Drama (Korean series), K-Movies (Korean movies), and K-Foods (Korean food). All are very popular in Kazakhstan. “The K-Pop genre is known not only for its uniquely vivid and sensual performances, but it has also played a role in conveying a message of hope and mutual assistance, unity and harmony to future generations. In particular, during the pandemic, K-Pop stars encouraged people all over the world and conveyed their warm feelings through various campaigns and activities,” said Lee. South Korea has hosted several events to introduce Kazakhstan to its citizens, including a Kazakh Film Festival in Pusan and the visit of Kazakhstan’s State National Academic Korean Theater of Musical Comedy to Korea to present a play based on Anton Chekhov’s “The Seagull.” The theater, one of the oldest Korean national theaters in the world, celebrates its 90th anniversary this year. “In May, we visited three Kazakh cities such as Taldykorgan, Aktau and Kostanai for the 11th Korean Film Festival in Kazakhstan. As part of this year’s festival, two Korean films were screened – ‘Little Forest’ and ‘Tunnel.’ The film screenings provided the center with an opportunity to communicate directly with people from different regions of Kazakhstan,” said Lee. Korean artist Park Dae Song signs an autograph to a woman during the opening of his exhibition at the National Museum of Kazakhstan in Nur-Sultan on June 24. Photo credit: Korean Cultural Center In June, the center opened the exhibition of Korean artist Park Dae Song at the National Museum of Kazakhstan, which lasted from June 24 to Aug. 14. The same month, famous Korean K-Pop artists Baek Ji-young, VIVIZ and HIGHLIGHT performed at a concert in the Kazakh capital. The entire concert hall with 2,700 seats was filled up. “The concert was held to thank Kazakhstan’s citizens for their love for the K-Pop genre. The concert audience had a chance to enjoy Korean culture and the K-Pop genre. By organizing a concert of K-Pop artists representing Korea, we could see once again the great interest and popularity of the K-Pop genre among the people of Kazakhstan,” said Lee. Traditional Korean clothing – Hanbok – was presented in Oskemen on July 2 during the Hanbok Fashion Show. Photo credit: Korean Cultural Center Kazakh Minister of Culture and Sports Dauren Abayev also attended the concert. “The interest of Kazakh citizens, especially young people, in Korean culture is growing. This is evidenced by the success of events during the Year of Cultural Exchange. For example, a K-pop concert that drew a full house. I was personally present at this event, and I would like to note that it was a large-scale spectacle,” said Abayev at an Aug. 2 meeting with the deputies of the South Korea National Assembly. Numerous events are planned through the end of the year to foster greater cultural exchanges and understanding. In September, the center, working with the Astana Opera Theatre will hold a Gala-Opera classical music concert with the specially invited world-famous Korean diva-soprano Sumi Jo performing with some of the brightest and most talented Kazakh vocalists. The Museum of the Library of the First President will host the exhibition “Love, Created from the Heart. Children Clothes” where children’s Hanbok traditional Korean clothes will be presented. The Korean Cultural Center will host an exhibition “Baekje Kingdom Historical Area,” where the public will be able to learn more about the Baekje Kingdom founded in 18 BC, try on traditional clothes of the Baekje era and taste dishes of that era. Some other events planned by the center will give an opportunity to the public to try Korean traditional food, and explore the world of the Korean beauty industry as well as the country’s traditional clothes. Lee said that all events and their dates are announced on the center’s social media pages. Kazakhstan and Korea have more in common than might appear at first glance. Kazakhstan is also home to more than 100,000 ethnic Koreans, a testament to the close ties that have been there for more than 30 years. Get The Astana Times stories sent directly to you! Sign up via the website or subscribe to our Twitter, Facebook, Instagram, Telegram, YouTube and Tiktok! ",
    "title": "Cultural and Emotional Closeness Make Korean Pop Culture Welcome in Kazakhstan as Two Countries Celebrate Year of Cultural Exchanges - The Astana Times",
    "datetime": "2022-08-16T12:02:37+00:00",
    "url": "https://astanatimes.com/2022/08/cultural-and-emotional-closeness-make-korean-pop-culture-welcome-in-kazakhstan-as-two-countries-celebrate-year-of-cultural-exchanges/"
}