{
    "text": "To revisit this article, select My Account, then View saved stories To revisit this article, visit My Profile, then View saved stories By Goings On Editors Each week, the editors of Goings On share online happenings that caught their eye. Art Even art historians have guilty pleasures. For the medievalists of the Getty, in Los Angeles, it’s the television show “Game of Thrones.” Last year, they began recapping episodes on Tumblr using digitized masterpieces from the collection, which is rich in images of dragons, sword play, royal weddings, knights in armor, water gardens, and the like. This season, they’ve begun upping the ante with “wildcards” borrowed from other museums. (Spoiler alert: the Art Institute of Chicago’s Giovanni di Paolo painting of the beheading of St. John the Baptist illustrates Jon Snow’s execution of the impertinent Janos Slynt.) They have also compiled a reading list for series characters; for the feisty princess Arya Stark, they suggest “The Flower of Battle,” published in 1410, an illustrated manual on wielding weapons. Last week, they made a short film“Game of Manuscripts,” which recasts the show’s opening sequence as a tour of the Getty’s manuscript study room. What’s next—a lesson in High Valyrian?_—Andrea K. Scott _ Theatre Attention, citizen fact-checkers! Notice anything funny about this sign, which hangs on the downstairs level of the Circle in the Square Theatre, next to a portrait of Eugene O’Neill? If your eyebrow rose when you got to the last line, you’ve got it. O’Neill did not, in fact, win the Nobel Peace Prize. He won the 1936 Nobel Prize in Literature. (The Peace Prize that year went to Carlos Saavedra Lamas, who helped end the Chaco War, between Paraguay and Bolivia.) My friend and colleague Adam Feldman, a theatre critic at Time Out New York, has been waging a fussbudget’s campaign against the sign since 2011, when he blogged about the error after noticing it at a performance of “Lombardi.” This month, at a press preview of “Fun Home” (reviewed in this week’s issue), he saw the uncorrected sign again and took his cause to (https://twitter.com/FeldmanAdam/status/589103119159664640). Just in case, he sent the photo to a “Fun Home” publicist, saying, “It would be great if they could fix this. I do a little face-palm inside my head every time I see it.” Three minutes later, he got a reply from Susan Frankel, the theatre’s general manager: “Unbelievable we’ve never seen that before!” She immediately corrected the sign with white-on-black label-maker tape. Reached last week, Frankel said, “Adam has an ally in me, because I am in trouble all the time here for being a real nitpicky proofreader and grammarian. I think I assumed all this time that it was true that O’Neill won a Peace Prize, and that’s why it was such an extraordinary fact.” As for whether “Hughie” truly counts among his masterpieces (it was produced twice by Theodore Mann, the Circle in the Square’s co-founder), that remains for future patrons to judge, on their way to the restrooms.—Michael Schulman Movies American teen-rock movies of the late fifties and early sixties tended to make young people look like naïve idiots. It took a young-at-heart French director in his mid-thirties, Jacques Rozier, to capture, in his first feature, “Adieu Philippine” (which he shot in 1960), the severe drama and the earnest games contained in the exuberance—nowhere more than in this thrilling, exquisite dance sequence. Michel (Jean-Claude Aimini), a young TV technician in Paris, has been drafted into the French Army; he and two teen-agers, Juliette (Stefania Sabatini) and Liliane (Yveline Céry), head down to Corsica, where he has to catch a ship to report for duty. Along the way, the women compete for his affections. The first scene here, in a car, has no subtitles. (To skip straight to the dance, go to the 1:40 mark.) The trio is lost; Michel needs help reading the map; Juliette has her arm around him as he drives, and he uses the map as a pretext to get her off him (“It would be much easier if you held the map with two hands”). That’s when we reach the seaside café where the great nocturnal dance takes place. Juliette is a girl of rock; her seductive wiggles leave Michel, a relatively traditional young working man, cold. The young people dance—and so does the camera. Rozier, who is now eighty-eight, is the one New Wave director who went to film school, and he worked as an assistant to television directors—which is to say, he had experience in stage-managing for the camera and the actors in real time (which is what Michel does in the first scene of the film). The deft and delicately timed choreography for the dancers and the camera puts Rozier’s craft on display. When the tunes turn sentimental, Liliane goes it alone—with a look, or a pair of looks, into the camera that are defiant, proud, intimate, complicit. As Lesley Gore later sang, it’s the look of love—and that look, delivered both by the actress and by Rozier’s camera, was as central to the spirit of the times as was the music. Rozier’s few films capture that spirit as few others do; they’re not available in the U.S. on home video, which is why his work is among the most grievous gaps in American film appreciation.—Richard Brody Night Life It's ironic that the English performer Tahliah Debrett Barnett is in the news because she's settling down. Better known as FKA Twigs, she’s engaged to the scruffy actor Robert Pattinson, and the paparazzi have been on a hunt for an image of her engagement ring. She was raised as a dancer, and motion is core to her being. Soon she will be in New York City, taking over a massive warehouse space in Brooklyn from May 17th to 19th, for a performance during the Red Bull Music Academy Festival New York, where she and ten dancers will explore the limits of human kinetics. Her music, which seemed to arrive last year with the urgency of a scientific discovery—in fits and starts and then, suddenly, everywhere at once—draws on early-nineties trip-hop, and enriches it with sensual R. & B. and Kate Bush-like theatrics. In concert, she moves as she sings, giving her songs new meaning with her athletic and artistic gestures. Her latest video (N.B., it’s a wee bit N.S.F.W., for its conceptual depiction of a birth) is for her new song “Glass & Patron,” and it showcases her movement style. In a related interview, the surprisingly demure artist sits down and talks about everything from parenting to creativity, and reveals a telling belief about her work: “If everyone did get it, I must be doing something wrong.”—John Donohue Food & Drink Ice-cream season is approaching (though some would say it’s been here all along), and it’s time to get serious about options. After the deflating news that Jeni’s Splendid Ice Creams will have to destroy two hundred and sixty-five tons of ice cream due to a listeria contamination, it’s important to stay positive and trust your ice-cream purveyors. One of my favorite shops in New York has always been Cones, on Bleecker Street, run by the Argentine brothers Raul and Oscar D’Aloisio, who make very fine gelato, especially dulce de leche and coffee mocha chip, and the occasional surprise flavor, like corn or yogurt. Last year, a new contender entered the cutthroat New York ice-cream game: Morgenstern’s Finest Ice Cream. Nicholas Morgenstern (a co-owner of El Rey Coffee Bar and Luncheonette, reviewed by Hannah Goldfield this week) was a pastry chef before he opened a few restaurants, and his ice-cream shop is a labor of love. He doesn’t use any emulsifiers or eggs (except for one: “American egg” ice cream), and the flavors—burnt honey vanilla, raw milk, salt-and-pepper pine nut, Szechuan peppercorn chocolate, and cardamom lemon jam, to name a few—are extremely pure. While you’re deciding what to try first, you can listen to this amazing song by the K-pop band Red Velvet, “Ice Cream Cake,” and then you’ll have two things you can’t stop thinking about.—Shauna Lyon By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. By Russell Platt By Andrea K. Scott By Helen Shaw Sections More © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. The New Yorker may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "title": "Cultural Clicks: “Game of Thrones” Art, FKA Twigs, and Ice-Cream-Themed K-Pop | The New Yorker",
    "datetime": "2015-04-30T13:13:25.000Z",
    "url": "https://www.newyorker.com/culture/culture-desk/cultural-clicks-game-of-thrones-art-fka-twigs-and-ice-cream-themed-k-pop"
}