{
    "text": " Leveraging the power of pop culture for commercial and creative impact, Culture Group celebrated a number of notable client wins throughout the first half of 2022. Now, with a string key appointments, the Company is poised to service its growing portfolio of clients. Serving as a creative and commercial bridge between brands and popular culture, Culture Group is producing work around k-culture, streetwear, sustainability, virtual fashion, the creator economy and Web3. Alongside recent Web3 mandates from Coca-Cola and Mastercard, Culture Group is also working alongside. Spotify to drive more cultural relevance with digital and experiential programs to engage Gen Z fandoms in Southeast Asia, including ‘Bestie Hotline,’ a regional initiative to drive premium user engagement. Additionally, the agency is working with creator platform Wattpad as a Partnership Agency of Record across Southeast Asia, and social streaming platform Kumu as Entertainment Agency of Record The new senior leadership team includes: Jakeena Malli (pictured left), Managing Partner – Previously Head of Client Delivery, Malli was promoted Managing Partner and will lead the delivery team responsible for turning pop culture moments into brand movements. During her tenure at Culture Group, she has led impactful partnerships and content driven programs for clients including kumu, Globe Group, Spotify, and Wattpad. Ross Henderson (pictured right), Managing Partner – Henderson joins as Managing Partner, charged with developing the agency’s creative and content offerings, including consumer insights, brand strategy, and partnership opportunities. Henderson is a veteran of advertising, previously Head of Business Leadership & Managing Partner of BBH Singapore where he was responsible for many world class creative and strategic outcomes for a multitude of internationally recognised brands, including Nike, Jollibee, Netflix, and Sentosa. “Getting to focus on the things you are passionate about whilst making a huge difference to businesses and brands is pretty special – the opportunity to do that made joining Culture Group a very easy decision for me. With a team of expert colleagues, globally recognized clients, and an expanding market of business opportunities, there is an exciting journey ahead. I am looking forward to working closely with Michael, Jakeena and the rest of the team to accelerate our growth, and continue to shape pop culture in the region,” said Henderson. Jan-Paul Jeffrey, Head of Marketing SEA at Spotify, said: “Purpose-driven marketing and engaging fandoms is at the heart of everything we do at Spotify. Culture Group’s deep understanding of our brand has meant they have become a valuable partner in helping us connect and engage with our most important listeners in Southeast Asia – Gen Z. Their finger on the pulse of the ever-changing trends, from creators to K-pop, has enabled us to stay ahead in local markets.” Additionally, Acacia Leroy also joins Culture Group as Head of Insights & Trends. An established trend-watcher and sought-after keynote speaker, Leroy brings over 8 years of experience tracking consumer trends in Asia-Pacific. Name or pseudonym (required) Email (optional) Website (optional) Save my name, email, and website in this browser for the next time I comment. Comment *   GET THE CBDAILY BULLETIN Register for Free and receive the Campaign Brief Daily Bulletin. Type your email address in the space below. GOLD SPONSORS Copyright © 2023 Campaign Brief ",
    "title": "Culture Group hires ex-BBH Singapore’s Ross Henderson, Acacia Leroy + elevates Jakeena Malli – Campaign Brief Asia",
    "datetime": "2022-08-18T11:41:14+08:00",
    "url": "https://campaignbriefasia.com/2022/08/18/culture-group-hires-ex-bbh-singapores-ross-henderson-acacia-leroy-elevates-jakeena-malli/"
}