{
    "text": "AFTER rumours began circulating on social media that local dancehall artiste Kwinton “K Lion” Thomas had died on Wednesday, many fans, DJs, producers and fellow artistes began expressing condolences. He was 26. It is believed Thomas died after suffering a heart attack in Miami, Florida in the US. No other official information was provided. Some of his most popular songs include Malandros, Safe, One Link and Private Zess. He also performed at the 2020 International Soca Monarch finals. Fellow dancehall artistes Kyle “Rebel Sixx” George and Taryll “Prince Swanny” Swan posted their condolences and tributes to Instagram along with photos and videos of the late singer. George also went live on Instagram and began crying as he mourned his close friend. Many fans had expressed their concern for George as they knew how “inseparable” they were. Soca artiste Aaron “Voice” St Louis also posted condolences saying, “Undoubtedly one of the most talented artistes, both lyrically and vocally to come out of Trinidad. Rest in peace, my brother. Fly high, young king.” Neil “Iwer” George posted, “RIP, Malandros boss. You will definitely live on through your music.” Culture Minister Nyan Gadsby-Dolly also paid tribute via a Facebook post. She said while the era of dancehall she grew up with was in the 80s, she believes the local dancehall movement, commonly called the “zesser” movement, is promising. “Today I see fierce nationalism as my teens, and maybe yours, are engrossed in local dancehall – not getting into the issue of the messages, because I'm not sure the ones we imbibed in the 80s were any different. But the totally local \"Zesser\" movement is big, bigger than some realise, and by the shockwaves and consternation this death has caused among the youth, hugely influential. I mourn with TT today the loss of a young national of immense talent and potential.” The last post on Thomas' social media was in support of the Black Lives Matter movement on June 2. ",
    "title": "Culture minister, artistes mourn local dancehall artiste K Lion - Trinidad and Tobago Newsday",
    "datetime": "2020-06-11T23:22:53+00:00",
    "url": "https://newsday.co.tt/2020/06/11/culture-minister-artistes-mourn-local-dancehall-artiste-k-lion/"
}