{
    "text": "By \n\n\tJon Blistein Culture Club have canceled their upcoming U.S. and U.K. tour dates after a polyp was discovered in Boy George‘s throat. A doctor has ordered the frontman to refrain from singing as he may need to undergo an operation. Ticket refunds will be available at the point of purchase, but the group hopes to reschedule the concerts for next year. In a statement, the band wished George a speedy recovery and said, “To our fans, we wish to thank you for your loyalty and know that we love you all.” Trending\n\t\n\t\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tAt Least 22 Dead and Suspect at Large in Maine Shooting\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tDuran Duran Have Gone Fully Goth on Their New Album. Wait, What?\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBob Lee’s Murder Shook San Francisco. What Really Happened?\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tChristine McVie Estate and Pat Benatar Sell Catalogs With Biggest Hits Culture Club was scheduled to spend much of November and December on the road as they prepped for the release of their new album, Tribes, which arrives in early 2015 via the band’s own Different Man Music label. Last week, Culture Club released the album’s first single, “More Than Silence,” which they also performed on The View. The LP is available for pre-order on the band’s PledgeMusic page. In an interview with Rolling Stone in March, Boy George — who just released his first solo LP, This is What I Do, since 1995 — said the band had tried writing together a few years ago, but admitted that at the time, “my mojo wasn’t quite in rhythm.” But the band regrouped and Culture Club announced their first album of new material in 15 years this May, saying they were working with producer Youth, the bassist and co-founder of Killing Joke and producer for acts like the Verve, the Cult and Primal Scream.  We want to hear it. Send us a tip using our anonymous form. Rolling Stone is a part of Penske Media Corporation. © 2023 Rolling Stone, LLC. All rights reserved. ",
    "title": "Culture Club Cancel U.S. and U.K. Tour Due to Boy George Injury",
    "datetime": "2014-11-13T17:40:00+00:00",
    "url": "https://www.rollingstone.com/music/music-news/culture-club-cancel-u-s-and-u-k-tour-164679/"
}