{
    "text": "FOLLOW ON Advertisement Christy Somos\nCTV National News Associate Producer @C_Somos\nContact South Korean boy band Monsta X performs at Z100's iHeartRadio Jingle Ball at Madison Square Garden on Friday, Dec. 7, 2018, in New York. (Photo by Evan Agostini/Invision/AP) TORONTO – After fans of K-pop superstars Monsta X launched a global protest over member Wonho’s departure from the group amid allegations of a “scandal,” the spotlight is on the strict behavioural and cultural standards to which South Korean entertainers are held. To an international audience and fans, the allegations about Wonho’s past behaviour, including allegedly using cannabis in 2013 and owing an ex-roommate money, would be laughable if they were levelled at a Western artist. In South Korea, however, any damage to a star’s hard-won reputation and image are taken extremely seriously. “Monsta X were widely seen as the next big K-pop group to potentially achieve popularity outside of Asia… the group has a very big North American following and their fans are devoted to the group in its current configuration. So it makes sense that these fans are upset,” said Assistant Professor of Popular Culture in the Department of East Asian Studies of the University of Toronto Michelle Cho, in an email to CTVNews.ca. Wonho is not the first incident of a K-pop performer, or “idol” as they’re known in South Korea, to have their career suffer as a result of a so-called “scandal.” B.I., real name Kim Han Bin, was the leader and rapper of K-pop group iKON before bowing out of the popular group and terminating his contract with YG Entertainment earlier this year, after allegedly attempting to buy -- but never using -- cannabis and LSD in 2016. B.I. later recanted his original story and admitted to some cannabis use, according to local reports. The investigation continues. Veteran K-pop performer Hyuna and her bandmate E’Dawn were both terminated from their contracts with CUBE Entertainment in 2018, after they revealed their relationship – sparking international waves of anger and condemnation of the company. Many South Korean entertainment companies employ “dating bans” in their performers’ contracts. Cho said that the cultural differences between South Korean fans and international audiences are part of the reason that fans clash over such supposed “scandals.” “K-pop idols are a type of public figure in South Korea that really doesn’t have an analogue in North America or Western Europe,” Cho said. “Young idol celebrities are understood to have a duty to the public to maintain high standards of morality and character — this is because, in general, pop culture, as a collective/mainstream culture, is supposed to have an edifying impact on society.” Cho said that the practice is likely a historical cultural norm that’s been carried over, likely dating back to the late 1950s through the late 1980s, when South Korea was under authoritarian rule. “During these decades, media and pop culture were tightly controlled by the state, and all forms of public culture were supposed to advance the public good,” she said. International fans frustrated by what they perceive as unfair or unduly harsh treatment of their favourite stars in South Korea, however, end up “directing their frustration towards what they perceive as a broader set of problems in Korean society and the entertainment industry at large,” said Cho. The culture clash between fans is nothing new, but as K-pop continues to generate curiousity and gain immense popularity abroad, the scrutiny on how performers are treated by their management and South Korean audience will likely increase. “If you look at how the coverage of Korean celebrity culture has developed in the last decade, there is a huge spike of coverage after 2017…and many outlets are now covering K-pop on a regular basis,” Cho said, adding that social media plays a major part in making Kpop stories go “viral,” whether positive or negative. But the media attention, social media presence and constant availability of K-pop acts to their fans comes at a cost. “The K-pop industry cultivates strong fan engagement through a variety of industry practices — fan meetings, weekly music shows, fan chat rooms, social media accounts, etc.,” Cho said. “Devoted fans feel some ownership over the idols’ images, since the industry encourages this sort of attitude — idols cultivate fans’ fantasies that they are in a direct, human relationship with the idols,” she said. Cho said most fans realize their relationship with and “ownership” of the idol and their image is indeed fantasy, but there are those who “are not able to distinguish between their fantasy relationship and an actual one – thus they feel personally offended and ‘betrayed’ when their idols do things that they don’t identify with or approve of,” she said. That’s where fans collide. For Western audiences, getting tattoos, going on dates, smoking a cigarette or even cannabis use may not be considered anything out the ordinary for a performer -- but in conservative South Korean entertainment culture -- especially for idols, they are considered taboo and in the case of cannabis, illegal. Although Cho said she understands the motives and mindset of international fans upset by a “scandal” that would barely be a blip on the radar of a Western artist, she cautions that generalizations about South Korean culture and social norms may be “overblown.” “Many K-pop fans outside of Korea [only] see Korean society as filtered through the lens of K-pop,” Cho said. “The industry is much less representative of Korean society at large than it can appear to be if one’s main access to Korea/Korean culture is K-pop fandom.” Advertisement Use of this Website assumes acceptance of Terms & Conditions and Privacy Policy | Accessibility © 2023All rights reserved. Back to top ",
    "title": "Culture clash: A guide to the chasm between Kpop fans in South Korea and the West | CTV News ",
    "datetime": "2019-11-07T11:15:00-05:00",
    "url": "https://www.ctvnews.ca/entertainment/why-k-pop-scandals-frustrate-international-fans-1.4674375?cache=walqrkeg"
}