{
    "text": " The K-12 academy in St. Paul has twice been named one of the best high schools in the country by U.S. News & World Report. When Subis Dini arrived here in April of 2000, her family enrolled her in the sixth grade. Her first day at a Minneapolis middle school was her first day of school — ever. She could not read or write. She knew only a few words of English. Kids laughed at her for being unable to use her locker, which had a combination lock. She was born in Somalia, but didn’t even share a language with some of her Somali classmates. She grew up in a refugee camp in Kenya, while others were born here or emigrated from Sweden, Italy or an Arabic-speaking country. Her parents were determined to help her succeed, but had never been to school themselves. They enrolled Dini in a St. Paul school that had become increasingly popular with Somali and Oromo families, Higher Ground Academy. A K-12 charter founded in 1999, Higher Ground serves a student body that is 98 percent East African and 91 percent impoverished. Still, its academic outcomes are so good that it has twice been named one of the best high schools in the country by U.S. News & World Report. Dini flourished there, graduating on time. “It took a lot of hard work and effort,” she says. “I did not want to go back where I was.” One of the school’s graduation requirements is that students be accepted into a post-secondary institution. Dini is nearly finished earning a degree in global studies from the University of Minnesota. In the interim, she works at Higher Ground as a teacher’s aide, helping the next generation of newcomers scaffold up to grade level. One of her jobs is to administer the tests that allow the school to determine what a student’s skills gaps are and how best to plug them. Last year, 61 percent of its 740 students, drawn from the entire metro area, tested proficient in reading and 67 percent in math. Using a methodology that juxtaposes challenges such as poverty and a high percentage of English-language learners against academic outcomes and advanced course completion rates, the magazine awarded medals to 145 Minnesota’s high schools. Higher Ground was No. 47. While the program’s 62 percent on-time graduation rate lags well behind other schools on the U.S. News lists, it’s proof that students who start out behind don’t need to stay there. (Given an extra year or two to catch up, virtually of Higher Ground’s students graduate, if not on the timeline required to count statistically.) To understand how they do it, it helps to know something about culture — the students’ and the school’s. Former St. Paul City Council member Bill Wilson started Higher Ground in a moment of frustration. Tired of hearing students of color described as uninterested in learning, he determined to open an Afrocentric school. At first the school was predominantly African-American. But without the extracurricular attractions of a large high school — St. Paul Central High is a two-minute stroll down the street — it struggled to retain students. At the same time, Higher Ground was acquiring a buzz within the growing East African community. The immigrant parents placed a premium on education, even if they had no personal exposure. Like Dini’s, many of them were concerned that placement in a mainstream ESL classroom wasn’t enough. Higher Ground made a deliberate decision not to acculturate the students who poured through the new pipeline. “Our approach is that the students’ culture is their roots,” said Wilson. “We need to nourish and support those roots, but also give them experiences so they can more easily navigate the outside culture.” Besides, the vision he and founding Principal Samuel Yigzaw started with was that by expecting children to conform to a single set of cultural norms, schools fail a lot of communities. “We start with the premise that if a change needs to be made, it’s with us,” said Wilson. “We make a good faith effort to educate whoever shows up.” As required by law, the school is nonsectarian and there is no religious instruction. But its leaders have made every effort to understand students’ home cultures — far from homogenous despite the lumped-together labels — and have recruited a multilingual staff. One early challenge: Administrators were initially stumped by parental complaints about student participation in art classes. They asked and listened and learned that Muslim children are taught not to try to replicate any part of the body. After more conversations, art programming that respects this belief was created. Similarly, the use of people’s photographs is discouraged unless necessary for a practical purpose, such as obtaining an ID or a driver’s license. Dini asked not to be photographed for this story, and the school asked MinnPost not to use images of students. When students enroll, an assessment is done. “The first thing we do is give them a writing assessment,” said Yigzaw. “Without knowing that, I really can’t teach them effectively.” An individual learning plan is then created that involves a school year that’s 220 hours longer than most. If a student is behind, he or she gets intensive services paid for by federal Title 1 funds. Students are continually assessed on the fly, and staff compare notes weekly to identify small gaps before they become big ones. “If students are not making adequate progress we need to know,” said Wilson. Students are grouped by their achievement level and transferred into more challenging classes. Advanced Placement courses are available, as is support for a student who can meet the level of rigor with the right assistance. Students are encouraged to take off-campus college-level classes through the state’s Post Secondary Enrollment Options (PSEO) programs. Indeed, many students graduate not just with a college acceptance letter on file but with credits to transfer obtained free of charge. Teachers work on annual contracts and are evaluated at least four times throughout the year. “We don’t have teachers running out the door,” said Yigzaw. “We have teachers wanting to stay.” Teacher preparation programs are anxious to expose their students to the mix of strategies and the high-expectations mindset. Student teachers come from the universities of St. Thomas, Hamline and Concordia (which is also the school’s charter authorizer). Higher Ground has a particularly strong bond with St. Mary’s University, which boasts a culturally responsive teaching curriculum and where Yizgaw teaches. All of the institution’s teacher candidates are required to student-teach at Higher Ground. “An emphasis on getting kids ready for school is important,” said Joe Nathan, executive director of the Center for School Change, which partners with and shares space with the program. “But we also need to talk about getting schools ready to teach kids.” Finally, school leaders work hard to nurture relationships with families and with community leaders and elders. Parents are surveyed about their experiences; last spring 100 percent responded that they were satisfied. “The parents that we deal with did not go to school in America,” said Wilson. “Yet they hold education in high esteem.” According to Dini, the fates of her classmates bear this out. One is planning to attend medical school, but several have come back to work at Higher Ground. One is helping to launch a science, technology, engineering and math program while another teaches math. As for Dini, she’s happy enough helping new arrivals find their stride for right now. But she dreams of returning to a peaceful Somalia to help reconstruct. “I think about trying to create a non-governmental organization (NGO),” she said. “There are a lot of people still living in refugee camps.” Maybe, just maybe, her aid effort will involve education. As a nonprofit newsroom, MinnPost relies on donations from readers like you. Donate today to keep our in-depth journalism free for all to access. Beth Hawkins covered education and other public-policy topics for MinnPost from its launch in 2007 to October of 2015, when she left to write for Education Post, a nonprofit based in Chicago. is a 501(c)(3) nonprofit newsroom Member donations are crucial to the work of our nonprofit newsroom. Our reporters are only able to do their work thanks to support at all levels. Donations made by check can be made out to MinnPost and mailed to us at PO Box 18438, Minneapolis, MN 55418. MinnPost | P.O. Box 18438 | Minneapolis, MN 55418 | 612.455.6950 By Beth Hawkins Jan.  31, 2013 This article first appeared on MinnPost and is republished here under a Creative Commons license. MinnPost's in-depth, independent news is free for all to access — no paywall or subscriptions. Will you help us keep it this way by supporting our nonprofit newsroom with a tax-deductible donation today? ",
    "title": "Culture-conscious Higher Ground Academy serves largely East African student body | MinnPost",
    "datetime": "2013-01-31T10:57:15-06:00",
    "url": "https://www.minnpost.com/learning-curve/2013/01/culture-conscious-higher-ground-academy-serves-largely-east-african-student-b/"
}