{
    "text": "Let K-12 Dive's free newsletter keep you informed, straight from your inbox.  Topics covered: K-12 policy, classroom technology, school systems, personalized learning, equity, and much more. Topics covered: Curriculum design, adoption, standards, best digital practices, professional development, research/studies, assessment, and more. AYAimages/Stock.adobe.com Schools improve when teachers are supported in ways that enable them to do their best work in the classroom. We know teachers have the greatest impact on the success of every student’s learning journey and creating a healthy school culture is fundamental to their support. In fact, teachers cite school culture factors as more important to their work than compensation. Yet too often, time and focus by leaders is pulled away on everything other than supporting teachers and their use of effective instructional practices. Leaders are now positioned to create new ways of thinking about how to improve student performance by supporting teachers. To do this, they will need to shift away from the traditional endgame focus of improving test scores and move to a mindset of how to best support teachers. The untapped resource to creating critical teacher support lies within the schools’ culture. CogniaTM introduced MyVoice as part of its Improvement Solutions to help schools build positive environments, starting with teacher voice. School culture can no longer be minimized or viewed as an afterthought to “the real work” of teachers. In fact, new conversations on the power of school culture will provide valuable insights and thinking that is needed to unlock new solutions to support the work of teachers, improve job satisfaction and employ the most effective instructional practices so students develop, grow and thrive. A team of researchers and nationally renowned educational leaders focused on how creating a healthy school culture addresses the exponentially growing problem of teachers leaving their schools and the profession. While the traditional definition of school culture had been characterized as vague, intangible and non-actionable, these experts identified and defined 10 Drivers of a Healthy School Culture, all of which are measured in MyVoice, so teachers and leaders can have focused conversations for improving their schools. Clear and Unified Direction: The school’s vision, mission and beliefs (school’s direction) is important in developing universally understood norms, practices and policies. Professional Engagement: Teachers are lifelong learners necessitating multiple opportunities for them to engage in professional activities both collectively and individually. Instructional Autonomy: Teachers have the flexibility to make decisions about the success of each student using multiple metrics. Collaboration: Collaborative planning is required to develop and share instructional resources, and to embed the professional learning needed for expanding and improving teacher practices. Empowerment: Teachers have the responsibility to make individual and collective decisions that impact the school and classroom. Feedback and Reflection: Pervasive instructional observations provide immediate feedback and create conversations about effectiveness. Resource Priorities: Teacher strengths and students' needs are aligned in developing schedules that maximize teachers’ skills. Support and Care: Meeting a teacher's personal and professional needs through focused professional learning with follow-up are essential for professional growth. Sense of Belonging: The feeling of being valued and part of the school brings meaning and importance to teachers’ work. Teacher Advancement: Opportunities are created for teachers to be leaders and experts in their fields. Facilitating continuous teacher voice and agency to support a healthy school culture goes far beyond the typical survey process that schools often use. Teachers and leaders best understand and improve their school culture together when real-time formative data are continuously collected, analyzed and acted upon. MyVoice was designed so teachers can easily provide input using the ratings on School Culture Indicators to monitor the progress in each of the School Culture Drivers. MyVoice empowers teachers with a voice. Its actionable data leads to developing solutions that improve and build capacity in schools, creates a shared space of collective action and results in a healthy school culture that attracts and retains high-quality teachers and creates positive learning environments for students. Cognia, the world’s largest nonprofit school improvement organization, recognizes the importance of retaining teachers and building positive school culture. Get the free daily newsletter read by industry experts The rapid spread of classroom censorship policies has left educators feeling targeted and students without resources. Photo illustration: Shaun Lucas/Industry Dive; Getty Images These leaders are shaping the nation’s schools with commitments to high expectations, strong relationships and robust career exploration models. Keep up with the story. Subscribe to the K-12 Dive free daily newsletter Keep up with the story. Subscribe to the K-12 Dive free daily newsletter Subscribe to K-12 Dive for top news, trends & analysis Get the free daily newsletter read by industry experts The rapid spread of classroom censorship policies has left educators feeling targeted and students without resources. Photo illustration: Shaun Lucas/Industry Dive; Getty Images These leaders are shaping the nation’s schools with commitments to high expectations, strong relationships and robust career exploration models. The free newsletter covering the top industry headlines ",
    "title": "Cultivating a healthy school culture supports teachers | K-12 Dive",
    "url": "https://www.k12dive.com/spons/cultivating-a-healthy-school-culture-supports-teachers/633810/"
}