{
    "text": "San Francisco punks Culture Abuse have decided \"to no longer continue with this band\" following allegations of sexual misconduct regarding frontman David Kelling. Culture Abuse have announced that they are calling it a day after frontman David Kelling (second from left) publicly addressed sexual misconduct allegations. In a statement posted to his personal Instagram account, the singer/guitarist said that as stories have come to light about \"how toxic the music scene has been\", David has to recognise where he has \"been guilty of similar behaviours\". \"Ten years ago I was 22 and slept with a 17-year-old,\" he writes. \"I led her on and pressured her and over time left the relationship without checking in on her feelings. Now come to find out it caused pain that she has had to deal with all the time. She did not deserve that in any way. We spoke on the phone today with both of our partners present and she said she accepted my apology, though she didn't have to. \"But this is not the only instance where someone deserves an apology and this has not been the only time where I have acted without considering others emotions. The guilt I have felt has been overwhelming and I didn't know how to open up or go back and fix it on my own. Or to tell people I do not want to be put on a pedestal because I have been a fuck up that's trying to work on myself. \"Three years ago I met my girlfriend and she's been pivotal in showing me the ways my behaviours are wrong and how to be a better partner and person. I've tried to grow as a person and love myself and treat the people in my life with empathy. I'm far from perfect, but I have been trying. And I've reflected and grappled with the angry younger person I was. I know this doesn't fix the past mistakes or excuse me from the work I know that I need to continue to do. I recognise that it is time that I find the help I need and do my best to right my wrongs. I am so sorry to anyone I have hurt. Nothing makes it better but I promise to try and do my part. If anyone wants to reach out please do. I want to be better and I want to be fully accountable.\" He finishes his statement by writing: \"How can I preach about peace, love and equality when my past has caused people pain?\" As the news came to light, the remaining members of Culture Abuse wrote in a joint statement of their experience with David that they took his \"erratic behaviour\" as \"an immense passion for this band and David’s ultimate goals in the music. Some people can say that this was our way of allowing David’s behaviour to continue but we looked at it as a support system to help a person change.\" They add that, \"We are well aware that this does not fix the pain caused but we are hoping it’s a first step. There are no excuses for this behaviour and it cannot be allowed,\" encouraging that David seek therapy while also confirming that they will \"no longer openly associate\" with the frontman. \"This [social media] account name will be changed to extract the word abuse and will no longer be used to promote what this band was,\" Culture Abuse continue. \"We will use this platform to educate and share information and important articles for abusers and victims. This is a mens issue, and we are aware of how many men follow this account specifically, and it is our duty to hold each other accountable and in hopes create a safe community for all.\" Read both statements in full below: Features We look at 11 bands for whom Weezer paved the way. Features The final Back To School Jam made us wish this yearly hardcore fest would never end. News PLUS! Enter Shikari, Bring Me The Horizon, Culture Abuse, Venom Prison, Taking Back Sunday, As It Is and LOADS more! Video The Californian punx performed to 50 fans at Blondies in Clapton as part of our K! Pit series. Features Been busy? Here's your weekly round-up of nonsense in one digital lump. News Find out how you can stream their sweaty show, filmed live at our dive bar Blondies. News This ’60s song was made famous by The Clash. News Punk rock and a free guitar: not a bad deal! ",
    "title": "Culture Abuse Split Up Following Sexual Misconduct… | Kerrang!",
    "url": "https://www.kerrang.com/culture-abuse-split-up-following-sexual-misconduct-allegations-against-frontman-david-kelling/"
}