{
    "text": "All Headlines North Korea Sports Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies URL is copied. SEOUL, Nov. 14 (Yonhap) -- The South Korean government will host a big in-person K-pop concert to be attended by 3,000 people Sunday to help the people gradually return to their normal lives after almost two years of restrictions meant to slow the spread of COVID-19. The Ministry of Culture, Sports and Tourism and its affiliated private foundation, the Korean Foundation for International Cultural Exchange, said the one-day \"World K-pop Concert: B.I.T. 4U Concert\" will take place at the Korea International Exhibition Center (KINTEX) in Goyang, just northwest of Seoul, at 7 p.m. This photo provided by the Korean Foundation for International Cultural Exchange shows the \"World K-pop Concert: B.I.T. 4U Concert,\" set to be held on Nov. 14, 2021. (PHOTO NOT FOR SALE) (Yonhap)  It marks the first large-scale music concert hosted by the government after the country uniformly implemented the first phase of the three-phase \"living with COVID-19\" scheme across the country on Nov. 1, alleviating major virus curbs. The ministry said it has invited 3,000 people, mostly the less privileged and multicultural families, to the free concert. The event is expected to help recover the country's live music market in a deep freeze for almost two years due to the coronavirus pandemic. It will feature 15 K-pop acts, including popular boy groups NCT Dream and Pentagon, girl groups ITZY, Brave Girls and aespa, SHINee's Key, and rappers Simon Dominic and Loco. American pop star Kehlani will join the show remotely through a video link. For the rising rookie group aespa with successive hits such as \"Black Mamba,\" \"Next Level\" and \"Savage,\" it will be the group's first in-person concert after its debut a year ago amid the pandemic. In addition to the pop music performances, there will be a special show combining elements of K-pop music, traditional Korean music and martial arts and a non-verbal theater show, according to the ministry. Before the concert opens, visitors can enjoy various side events such as a \"hallyu\" content exhibition and booths for getting hands-on experience on Korean food, cosmetics and fashion. \"Hallyu\" refers to the global popularity of Korean pop cultural content, such as K-pop, Korean drama and films. sshim@yna.co.kr(END) All News National North Korea Economy/Finance Biz Culture/K-pop Sports Images Videos Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies Korea in Brief Useful Links Festival Calendar Weather Advertise with Yonhap News Agency ",
    "title": "Culture ministry to co-host in-person K-pop concert for 3,000 people | Yonhap News Agency",
    "datetime": "2021-11-14T08:00:06+09:00",
    "url": "https://en.yna.co.kr/view/AEN20211113001800315"
}