{
    "text": "Seven Days needs your support! cars/trucks\nbicycles\nsell your ride health/wellness\nhome/garden\npost your service all merchandise\nsell your stuff all categories\npost your class apartments\nhomes for sale\nfor sale by owner\npost your listing browse notices\npost a notice If you're looking for \"I Spys,\" dating or LTRs, this is your scene. Archives |\nRSS Tags: Kahambwe Prince Felekeni, K Prince, hip-hop, Creamy Goodness Productions and Studio, David Cooper, Yellow Mellow, A2VT, Image, Video, Web Only Showing\n1-1\nof 1  Comments are closed.\n\nSince 2014, Seven Days has allowed readers to comment on all stories posted on our website. While we’ve appreciated the suggestions and insights, the time has come to shut them down — at least temporarily.\nWhile we champion free speech, facts are a matter of life and death during the coronavirus pandemic, and right now Seven Days is prioritizing the production of responsible journalism over moderating online debates between readers.\nTo criticize, correct or praise our reporting, please send us a letter to the editor. Or send us a tip. We’ll check it out and report the results.\nOnline comments may return when we have better tech tools for managing them. Thanks for reading. Since 2014, Seven Days has allowed readers to comment on all stories posted on our website. While we’ve appreciated the suggestions and insights, the time has come to shut them down — at least temporarily.\nWhile we champion free speech, facts are a matter of life and death during the coronavirus pandemic, and right now Seven Days is prioritizing the production of responsible journalism over moderating online debates between readers.\nTo criticize, correct or praise our reporting, please send us a letter to the editor. Or send us a tip. We’ll check it out and report the results.\nOnline comments may return when we have better tech tools for managing them. Thanks for reading. Vermonter's Musical Bound for Broadway With Hillary Clinton as a Producer The Magnificent 7: Must See, Must Do, October 25-31 Champlain Valley School District Spells Out the Rights of Transgender and Nonbinary Students ",
    "title": "Cultural Mosaic: Rapper K Prince Encourages Positive Thinking | Live Culture",
    "url": "https://www.sevendaysvt.com/LiveCulture/archives/2018/12/27/cultural-mosaic-rapper-k-prince-encourages-positive-thinking"
}