{
    "text": " Forgot Your Password? New to The Nation? Subscribe Print subscriber? Activate your online access Illustration by Sonia Pulido.  By signing up, you confirm that you are over the age of 16 and agree to receive occasional promotional offers for programs that support The Nation’s journalism. You can read our Privacy Policy here. By signing up, you confirm that you are over the age of 16 and agree to receive occasional promotional offers for programs that support The Nation’s journalism. You can read our Privacy Policy here.  By signing up, you confirm that you are over the age of 16 and agree to receive occasional promotional offers for programs that support The Nation’s journalism. You can read our Privacy Policy here. By signing up, you confirm that you are over the age of 16 and agree to receive occasional promotional offers for programs that support The Nation’s journalism. You can read our Privacy Policy here. When New Hampshire teacher Misty Crompton learned that she had become campaign fodder for a local school board race, she says, “I immediately thought of the California privilege teacher.” Crompton is referring to a third-grade teacher in Cupertino, Calif., who became a right-wing-media punching bag after a lesson she’d taught about white privilege went public. “I thought, ‘They’re going to try to tar me with that same brush.’”1 \n\n\n\n\nCrompton, who has taught middle school social studies in Derry for 21 years, would seem an unlikely target for culture warriors. She hasn’t even taught since August 2020, when she was awarded a paid sabbatical by the New Hampshire Charitable Foundation, a prize granted annually to an exceptional teacher in the state. But what Crompton saw as a once-in-a-career opportunity to study success stories from school districts around the country and help New Hampshire become an “equity leader,” conservatives viewed as a nefarious plot.2\n“Right now, a Derry teacher is training to change our social studies curriculum to teach Critical Race Theory (Marxist ideology) in our schools with no community input,” warned campaign postcards sent to voters in this southern New Hampshire mill town. Then a Republican state representative from Derry, Katherine Prudhomme O’Brien, weighed in, complaining to school board members that Leaders for Just Schools, a program Crompton is part of, was linked to Black Lives Matter. “I know a lot of people like Black Lives Matter. They don’t realize it’s a Marxist organization,” warned O’Brien, who also invoked the Cambodian genocide.3\nThis spring, New Hampshire has witnessed an extraordinarily acrimonious debate about public education. GOP lawmakers, who took control of the legislature in 2020, have prioritized controversial—and deeply unpopular—legislation, including a sweeping expansion of a program that provides tuition vouchers for private schools and a ban on discussing “divisive concepts,” such as racism or sexism, in the public schools. Crompton, an outspoken opponent of both measures, says, “I became a pawn in the culture war and in the scheme to discredit public schools.”4 \nMisty Crompton, a New Hampshire middle school teacher.  \nShe isn’t the only one. Fueled by the Trump-era GOP’s insatiable appetite for red-meat issues—and finding fertile ground in a public politically polarized by the pandemic—the culture wars are raging, upending school board races, reshaping local politics, and now threatening public education itself.5\n\n\n\nPopular\n\"swipe left below to view more authors\"Swipe →\n\n\n\n\n\n\nWhy I Just Quit DSA\n\nWhy I Just Quit DSA\n\n\n\nMaurice Isserman \n\n\n\n\n\n\n\nI’m a Proud Jewish DSA Member. Here’s Why I’m Not Quitting.\n\nI’m a Proud Jewish DSA Member. Here’s Why I’m Not Quitting.\n\n\n\nHadas Thier \n\n\n\n\n\n\n\nLet’s Talk About How the Media Covers Gaza\n\nLet’s Talk About How the Media Covers Gaza\n\n\n\nQ&A\n\n/\n\nMohammed El-Kurd \n\n\n\n\n\n\n\nTrump’s Lawyers Should Be Laughed Out of Court\n\nTrump’s Lawyers Should Be Laughed Out of Court\n\n\n\nElie Mystal \n\n\n\n\n\n\n\n\n\nPopular\n\"swipe left below to view more authors\"Swipe →\n\n\n\n\n\n\nWhy I Just Quit DSA\n\nWhy I Just Quit DSA\n\n\n\nMaurice Isserman \n\n\n\n\n\n\n\nI’m a Proud Jewish DSA Member. Here’s Why I’m Not Quitting.\n\nI’m a Proud Jewish DSA Member. Here’s Why I’m Not Quitting.\n\n\n\nHadas Thier \n\n\n\n\n\n\n\nLet’s Talk About How the Media Covers Gaza\n\nLet’s Talk About How the Media Covers Gaza\n\n\n\nQ&A\n\n/\n\nMohammed El-Kurd \n\n\n\n\n\n\n\nTrump’s Lawyers Should Be Laughed Out of Court\n\nTrump’s Lawyers Should Be Laughed Out of Court\n\n\n\nElie Mystal \n\n\n\n\n\n\nEvery generation has its “school culture war thing,” says Adam Laats, an education historian at SUNY Binghamton and the author of The Other School Reformers: Conservative Activism in American Education. “You see the same combination of national issues and local anxieties—these ‘You won’t believe what we saw in our son’s textbook’ stories surfacing again and again.”6\nTake the sudden reappearance of concern over socialist indoctrination. Laats points out that a virtually identical panic emerged in the 1950s: “There’s no more Soviet Union, no more [Fidel] Castro, but once again you have this fear of the government taking over that’s this high-anxiety issue.”7 \nCurrent Issue\n\n\n\n \nView our current issue\n\n\n\n\n\nBut in at least one respect, the current culture war convulsion differs from its antecedents, Laats says. “The big difference is Trump. He provided a center and a symbol for all of these old ideas to coalesce around.”8\nIn the waning days of Trump’s term, the commission he convened to further the cause of “patriotic education” released its long-awaited 1776 Report—a rejoinder to The New York Times’ 1619 Project. Though widely panned as plagiarized propaganda, the report has also proved to be extraordinarily influential.9\n“It’s the idea of the past as a refuge,” says Noliwe Rooks, a professor at Cornell University and the author of Cutting School: Privatization, Segregation, and the End of Public Education. “The message is ‘Let’s get rid of the parts and the people in public education that we don’t like.’” She sees parallels between the current attacks on critical race theory and the collisions that resulted from the rise of Black studies in the late 1960s. “Students succeeded in forcing changes to curricula and on campus. But that little bit of progress they made around equity and innovative programs resulted in a backlash that destroyed all of that little bit of progress,” Rooks says.10 \n\n\n\n\n\n\nMore From Jennifer C. Berkshire\n\n\n\nHow to Fight the Right's Moral Panic Over Parental Rights\nMay 23, 2023 \n\n\nThe West Coast Think Tank Helping to Orchestrate DeSantis’s War on the Woke\nMarch 30, 2023 \n\n\nGood News Alert: Democrats Might Actually Flip the Michigan Legislature\nOctober 28, 2022 \n\nDivisive Concepts\nIn the past few months, GOP lawmakers in one state after another have introduced legislation aimed at keeping discussions of social justice out of the classroom. Bills prohibiting the teaching of critical race theory and other “divisive topics” have already passed in Utah, Texas, Oklahoma, and Tennessee and are under consideration in at least 15 other states. In Missouri, a proposed amendment sought to outlaw what its author describes as the “erroneous and hate-filled 1619 Project.”11\n“It said ‘1619 Project,’ but the aim was much broader. It would affect every part of history and literature,” says Jessica Piper, who teaches 11th-grade American literature in Maryville, Mo., a town of 12,000 on the Iowa border.12\nPiper would seem to be exactly the sort of teacher that legislators around the country are targeting. Her students read Clint Smith’s poem “How to Make a Cardboard Box Disappear in 10 Steps,” with its stark imagery of lives lost to police brutality, as part of a history lesson on racial violence. In 1931, a mob of more than 2,000 Maryville residents lynched a man named Raymond Gunn, burning him to death on top of the local schoolhouse. “There’s no historical marker, so the students didn’t know anything about it,” Piper says. This year, for the first time since she began using the poem in class, a parent complained.13 \n\n\n\n\nPiper recently decided that this will be her last year in the classroom. She’s running for the state legislature as a Democrat in a long-shot bid to unseat a Republican who, when he last faced an opponent, won by 80 points.14 \nRelated Articles \n\nFlorida’s Ron DeSantis Wants to Cancel Education About Systemic Racism\n\nJohn Nichols \n\n\nRepublican Cancel Culture: State Laws to Suppress Activism\n\nDavid Cole \n\nIn Iowa, as in Missouri, lawmakers have made the culture wars the centerpiece of their legislative agenda. So far this session, legislators have sought to ban transgender student athletes, implement an ideological test for state-funded faculty, and prohibit the teaching of “divisive concepts” at public schools and universities.15\n“They went with the Trump 1776 agenda,” says Nick Covington, a high school social studies teacher in Ankeny, a city north of Des Moines. “They’re carrying that banner, and it has a chilling effect on everything.”16 \nNick Covington, an Iowa high school social studies teacher.  \nThe bitter aftermath of the presidential election has also roiled the city. Two Ankeny residents were among the participants in the January 6 Capitol attack. And voting on a school funding question in March was disrupted for hours after police found a live pipe bomb at one of the facilities being used as a polling station.17\nCovington says the deep divisions outside his classroom are increasingly affecting what happens within it. This year he has been the target of repeated complaints from a small group of parents. The trouble started in January, when Covington streamed live news reports of the Capitol riot in his European history and economics classes. A parent called the school and claimed that Covington had directed students to his personal social media account, where he’d called Trump supporters Nazis, all of which Covington vehemently denies.18\nThis spring, after Covington showed a Vice News report on the “Unite the Right” rally in Charlottesville, Va., as part of an AP history unit on nationalism in Europe, parents contacted the school board and the superintendent and demanded that he be sanctioned. Though he’d taught the same lesson for three previous years without incident, Covington was ordered by school administrators to stop talking about current events.19\n“I’m basically waiting for the other shoe to drop,” he says.20 \nBLM blacklash: Nationwide protests and calls for a racial justice reckoning have some legislators and school districts on high alert. (Evelyn Hockstein / The Washington Post via Getty Images) \nDeep Divide\nThe pandemic’s profound disruption of public education was already upending state and local politics, as Republicans eagerly capitalized on parents’ frustration over shuttered classrooms. Now the culture wars are further exacerbating this tense climate.21\nJessica Piper’s small Missouri town recently saw the emergence of its first-ever PAC: Northern Missouri Citizens for Reflective Government. The group, which backed conservative candidates for local offices, put most of its energy into attacking an education professor who was running for a seat on the school board in Maryville. Ominous campaign ads depicted Jill Baker, a former schoolteacher, posed between cutouts of Joe Biden and Alexandria Ocasio-Cortez, spouting anti-Trump sentiments and stressing the importance of teaching social justice in elementary schools. She lost in a landslide.22\nIn Elmbrook, Wis., the Waukesha County Republican Party recently threw its weight behind James Gunsalus, a first-time school board candidate who claimed that Covid was no more serious than the flu. According to Gunsalus, Elmbrook’s schools, long among the highest-ranked in Wisconsin, were in free fall as teachers embraced “leftist indoctrination” over academic content, teaching students that “all white people are racist” and that “some people must be censored or canceled.” He lost by only 5 percent of the vote against an incumbent, coming within 600 votes of victory.23\nIn the North Texas community of Southlake, a fast-growing and rapidly diversifying city near Dallas, candidates for the school board, the city council, and mayor, backed by a PAC opposing the school district’s efforts to incorporate more cultural awareness into the curriculum, all captured around 70 percent of the vote. “Southlake Says No to Woke Education,” proclaimed a Wall Street Journal headline.24\n“Every single right-wing person that ran won,” says Megan Walsh, who graduated from a local high school in 2017 and is a leader in the Southlake Anti-Racism Coalition, a community group whose advocacy inspired the adoption of the Cultural Competency Action Plan, which the winning candidates have pledged to eliminate. “We’re back to square one.”25\n\n\n\n\n\nPandemic Fallout\nMunicipal races that once turned on hyperlocal issues have been politicized and nationalized by right-wing culture warriors. But the long reach of the pandemic is at work here too. Debates over diversity plans and critical race theory are further dividing communities that were already split over the response to Covid.26 \nLindsay Love, the first Black school board member in Chandler, Ariz.  \n“It’s all morphing into the same thing,” says Lindsay Love, a school board member in Chandler, Ariz. The first Black board member elected there, Love has been a frequent target of conservative activists and received death threats for her position that schools should remain closed until Covid levels dropped. “You hear people comparing children being masked to slavery and referring to mask supporters as Marxists,” Love says.27\n“You have lost [the] trust of parents,” declared a furious father at a recent board meeting. “Mask mandates, forcing vaccines, canceling prom, limiting graduation, critical race theory. The list goes on. When is enough enough?”28\nThe school culture wars came early to this part of Arizona. After the district adopted a new program that included training teachers on race and equity issues, conservative parents revolted, charging that the equity training “marginalizes white people.” Tucker Carlson has devoted two segments to Chandler.29\n“Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 Crompton, who has taught middle school social studies in Derry for 21 years, would seem an unlikely target for culture warriors. She hasn’t even taught since August 2020, when she was awarded a paid sabbatical by the New Hampshire Charitable Foundation, a prize granted annually to an exceptional teacher in the state. But what Crompton saw as a once-in-a-career opportunity to study success stories from school districts around the country and help New Hampshire become an “equity leader,” conservatives viewed as a nefarious plot.2\n“Right now, a Derry teacher is training to change our social studies curriculum to teach Critical Race Theory (Marxist ideology) in our schools with no community input,” warned campaign postcards sent to voters in this southern New Hampshire mill town. Then a Republican state representative from Derry, Katherine Prudhomme O’Brien, weighed in, complaining to school board members that Leaders for Just Schools, a program Crompton is part of, was linked to Black Lives Matter. “I know a lot of people like Black Lives Matter. They don’t realize it’s a Marxist organization,” warned O’Brien, who also invoked the Cambodian genocide.3\nThis spring, New Hampshire has witnessed an extraordinarily acrimonious debate about public education. GOP lawmakers, who took control of the legislature in 2020, have prioritized controversial—and deeply unpopular—legislation, including a sweeping expansion of a program that provides tuition vouchers for private schools and a ban on discussing “divisive concepts,” such as racism or sexism, in the public schools. Crompton, an outspoken opponent of both measures, says, “I became a pawn in the culture war and in the scheme to discredit public schools.”4 \nMisty Crompton, a New Hampshire middle school teacher.  \nShe isn’t the only one. Fueled by the Trump-era GOP’s insatiable appetite for red-meat issues—and finding fertile ground in a public politically polarized by the pandemic—the culture wars are raging, upending school board races, reshaping local politics, and now threatening public education itself.5\n\n\n\nPopular\n\"swipe left below to view more authors\"Swipe →\n\n\n\n\n\n\nWhy I Just Quit DSA\n\nWhy I Just Quit DSA\n\n\n\nMaurice Isserman \n\n\n\n\n\n\n\nI’m a Proud Jewish DSA Member. Here’s Why I’m Not Quitting.\n\nI’m a Proud Jewish DSA Member. Here’s Why I’m Not Quitting.\n\n\n\nHadas Thier \n\n\n\n\n\n\n\nLet’s Talk About How the Media Covers Gaza\n\nLet’s Talk About How the Media Covers Gaza\n\n\n\nQ&A\n\n/\n\nMohammed El-Kurd \n\n\n\n\n\n\n\nTrump’s Lawyers Should Be Laughed Out of Court\n\nTrump’s Lawyers Should Be Laughed Out of Court\n\n\n\nElie Mystal \n\n\n\n\n\n\n\n\n\nPopular\n\"swipe left below to view more authors\"Swipe →\n\n\n\n\n\n\nWhy I Just Quit DSA\n\nWhy I Just Quit DSA\n\n\n\nMaurice Isserman \n\n\n\n\n\n\n\nI’m a Proud Jewish DSA Member. Here’s Why I’m Not Quitting.\n\nI’m a Proud Jewish DSA Member. Here’s Why I’m Not Quitting.\n\n\n\nHadas Thier \n\n\n\n\n\n\n\nLet’s Talk About How the Media Covers Gaza\n\nLet’s Talk About How the Media Covers Gaza\n\n\n\nQ&A\n\n/\n\nMohammed El-Kurd \n\n\n\n\n\n\n\nTrump’s Lawyers Should Be Laughed Out of Court\n\nTrump’s Lawyers Should Be Laughed Out of Court\n\n\n\nElie Mystal \n\n\n\n\n\n\nEvery generation has its “school culture war thing,” says Adam Laats, an education historian at SUNY Binghamton and the author of The Other School Reformers: Conservative Activism in American Education. “You see the same combination of national issues and local anxieties—these ‘You won’t believe what we saw in our son’s textbook’ stories surfacing again and again.”6\nTake the sudden reappearance of concern over socialist indoctrination. Laats points out that a virtually identical panic emerged in the 1950s: “There’s no more Soviet Union, no more [Fidel] Castro, but once again you have this fear of the government taking over that’s this high-anxiety issue.”7 \nCurrent Issue\n\n\n\n \nView our current issue\n\n\n\n\n\nBut in at least one respect, the current culture war convulsion differs from its antecedents, Laats says. “The big difference is Trump. He provided a center and a symbol for all of these old ideas to coalesce around.”8\nIn the waning days of Trump’s term, the commission he convened to further the cause of “patriotic education” released its long-awaited 1776 Report—a rejoinder to The New York Times’ 1619 Project. Though widely panned as plagiarized propaganda, the report has also proved to be extraordinarily influential.9\n“It’s the idea of the past as a refuge,” says Noliwe Rooks, a professor at Cornell University and the author of Cutting School: Privatization, Segregation, and the End of Public Education. “The message is ‘Let’s get rid of the parts and the people in public education that we don’t like.’” She sees parallels between the current attacks on critical race theory and the collisions that resulted from the rise of Black studies in the late 1960s. “Students succeeded in forcing changes to curricula and on campus. But that little bit of progress they made around equity and innovative programs resulted in a backlash that destroyed all of that little bit of progress,” Rooks says.10 \n\n\n\n\n\n\nMore From Jennifer C. Berkshire\n\n\n\nHow to Fight the Right's Moral Panic Over Parental Rights\nMay 23, 2023 \n\n\nThe West Coast Think Tank Helping to Orchestrate DeSantis’s War on the Woke\nMarch 30, 2023 \n\n\nGood News Alert: Democrats Might Actually Flip the Michigan Legislature\nOctober 28, 2022 \n\nDivisive Concepts\nIn the past few months, GOP lawmakers in one state after another have introduced legislation aimed at keeping discussions of social justice out of the classroom. Bills prohibiting the teaching of critical race theory and other “divisive topics” have already passed in Utah, Texas, Oklahoma, and Tennessee and are under consideration in at least 15 other states. In Missouri, a proposed amendment sought to outlaw what its author describes as the “erroneous and hate-filled 1619 Project.”11\n“It said ‘1619 Project,’ but the aim was much broader. It would affect every part of history and literature,” says Jessica Piper, who teaches 11th-grade American literature in Maryville, Mo., a town of 12,000 on the Iowa border.12\nPiper would seem to be exactly the sort of teacher that legislators around the country are targeting. Her students read Clint Smith’s poem “How to Make a Cardboard Box Disappear in 10 Steps,” with its stark imagery of lives lost to police brutality, as part of a history lesson on racial violence. In 1931, a mob of more than 2,000 Maryville residents lynched a man named Raymond Gunn, burning him to death on top of the local schoolhouse. “There’s no historical marker, so the students didn’t know anything about it,” Piper says. This year, for the first time since she began using the poem in class, a parent complained.13 \n\n\n\n\nPiper recently decided that this will be her last year in the classroom. She’s running for the state legislature as a Democrat in a long-shot bid to unseat a Republican who, when he last faced an opponent, won by 80 points.14 \nRelated Articles \n\nFlorida’s Ron DeSantis Wants to Cancel Education About Systemic Racism\n\nJohn Nichols \n\n\nRepublican Cancel Culture: State Laws to Suppress Activism\n\nDavid Cole \n\nIn Iowa, as in Missouri, lawmakers have made the culture wars the centerpiece of their legislative agenda. So far this session, legislators have sought to ban transgender student athletes, implement an ideological test for state-funded faculty, and prohibit the teaching of “divisive concepts” at public schools and universities.15\n“They went with the Trump 1776 agenda,” says Nick Covington, a high school social studies teacher in Ankeny, a city north of Des Moines. “They’re carrying that banner, and it has a chilling effect on everything.”16 \nNick Covington, an Iowa high school social studies teacher.  \nThe bitter aftermath of the presidential election has also roiled the city. Two Ankeny residents were among the participants in the January 6 Capitol attack. And voting on a school funding question in March was disrupted for hours after police found a live pipe bomb at one of the facilities being used as a polling station.17\nCovington says the deep divisions outside his classroom are increasingly affecting what happens within it. This year he has been the target of repeated complaints from a small group of parents. The trouble started in January, when Covington streamed live news reports of the Capitol riot in his European history and economics classes. A parent called the school and claimed that Covington had directed students to his personal social media account, where he’d called Trump supporters Nazis, all of which Covington vehemently denies.18\nThis spring, after Covington showed a Vice News report on the “Unite the Right” rally in Charlottesville, Va., as part of an AP history unit on nationalism in Europe, parents contacted the school board and the superintendent and demanded that he be sanctioned. Though he’d taught the same lesson for three previous years without incident, Covington was ordered by school administrators to stop talking about current events.19\n“I’m basically waiting for the other shoe to drop,” he says.20 \nBLM blacklash: Nationwide protests and calls for a racial justice reckoning have some legislators and school districts on high alert. (Evelyn Hockstein / The Washington Post via Getty Images) \nDeep Divide\nThe pandemic’s profound disruption of public education was already upending state and local politics, as Republicans eagerly capitalized on parents’ frustration over shuttered classrooms. Now the culture wars are further exacerbating this tense climate.21\nJessica Piper’s small Missouri town recently saw the emergence of its first-ever PAC: Northern Missouri Citizens for Reflective Government. The group, which backed conservative candidates for local offices, put most of its energy into attacking an education professor who was running for a seat on the school board in Maryville. Ominous campaign ads depicted Jill Baker, a former schoolteacher, posed between cutouts of Joe Biden and Alexandria Ocasio-Cortez, spouting anti-Trump sentiments and stressing the importance of teaching social justice in elementary schools. She lost in a landslide.22\nIn Elmbrook, Wis., the Waukesha County Republican Party recently threw its weight behind James Gunsalus, a first-time school board candidate who claimed that Covid was no more serious than the flu. According to Gunsalus, Elmbrook’s schools, long among the highest-ranked in Wisconsin, were in free fall as teachers embraced “leftist indoctrination” over academic content, teaching students that “all white people are racist” and that “some people must be censored or canceled.” He lost by only 5 percent of the vote against an incumbent, coming within 600 votes of victory.23\nIn the North Texas community of Southlake, a fast-growing and rapidly diversifying city near Dallas, candidates for the school board, the city council, and mayor, backed by a PAC opposing the school district’s efforts to incorporate more cultural awareness into the curriculum, all captured around 70 percent of the vote. “Southlake Says No to Woke Education,” proclaimed a Wall Street Journal headline.24\n“Every single right-wing person that ran won,” says Megan Walsh, who graduated from a local high school in 2017 and is a leader in the Southlake Anti-Racism Coalition, a community group whose advocacy inspired the adoption of the Cultural Competency Action Plan, which the winning candidates have pledged to eliminate. “We’re back to square one.”25\n\n\n\n\n\nPandemic Fallout\nMunicipal races that once turned on hyperlocal issues have been politicized and nationalized by right-wing culture warriors. But the long reach of the pandemic is at work here too. Debates over diversity plans and critical race theory are further dividing communities that were already split over the response to Covid.26 \nLindsay Love, the first Black school board member in Chandler, Ariz.  \n“It’s all morphing into the same thing,” says Lindsay Love, a school board member in Chandler, Ariz. The first Black board member elected there, Love has been a frequent target of conservative activists and received death threats for her position that schools should remain closed until Covid levels dropped. “You hear people comparing children being masked to slavery and referring to mask supporters as Marxists,” Love says.27\n“You have lost [the] trust of parents,” declared a furious father at a recent board meeting. “Mask mandates, forcing vaccines, canceling prom, limiting graduation, critical race theory. The list goes on. When is enough enough?”28\nThe school culture wars came early to this part of Arizona. After the district adopted a new program that included training teachers on race and equity issues, conservative parents revolted, charging that the equity training “marginalizes white people.” Tucker Carlson has devoted two segments to Chandler.29\n“Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 “Right now, a Derry teacher is training to change our social studies curriculum to teach Critical Race Theory (Marxist ideology) in our schools with no community input,” warned campaign postcards sent to voters in this southern New Hampshire mill town. Then a Republican state representative from Derry, Katherine Prudhomme O’Brien, weighed in, complaining to school board members that Leaders for Just Schools, a program Crompton is part of, was linked to Black Lives Matter. “I know a lot of people like Black Lives Matter. They don’t realize it’s a Marxist organization,” warned O’Brien, who also invoked the Cambodian genocide.3\nThis spring, New Hampshire has witnessed an extraordinarily acrimonious debate about public education. GOP lawmakers, who took control of the legislature in 2020, have prioritized controversial—and deeply unpopular—legislation, including a sweeping expansion of a program that provides tuition vouchers for private schools and a ban on discussing “divisive concepts,” such as racism or sexism, in the public schools. Crompton, an outspoken opponent of both measures, says, “I became a pawn in the culture war and in the scheme to discredit public schools.”4 \nMisty Crompton, a New Hampshire middle school teacher.  \nShe isn’t the only one. Fueled by the Trump-era GOP’s insatiable appetite for red-meat issues—and finding fertile ground in a public politically polarized by the pandemic—the culture wars are raging, upending school board races, reshaping local politics, and now threatening public education itself.5\n\n\n\nPopular\n\"swipe left below to view more authors\"Swipe →\n\n\n\n\n\n\nWhy I Just Quit DSA\n\nWhy I Just Quit DSA\n\n\n\nMaurice Isserman \n\n\n\n\n\n\n\nI’m a Proud Jewish DSA Member. Here’s Why I’m Not Quitting.\n\nI’m a Proud Jewish DSA Member. Here’s Why I’m Not Quitting.\n\n\n\nHadas Thier \n\n\n\n\n\n\n\nLet’s Talk About How the Media Covers Gaza\n\nLet’s Talk About How the Media Covers Gaza\n\n\n\nQ&A\n\n/\n\nMohammed El-Kurd \n\n\n\n\n\n\n\nTrump’s Lawyers Should Be Laughed Out of Court\n\nTrump’s Lawyers Should Be Laughed Out of Court\n\n\n\nElie Mystal \n\n\n\n\n\n\n\n\n\nPopular\n\"swipe left below to view more authors\"Swipe →\n\n\n\n\n\n\nWhy I Just Quit DSA\n\nWhy I Just Quit DSA\n\n\n\nMaurice Isserman \n\n\n\n\n\n\n\nI’m a Proud Jewish DSA Member. Here’s Why I’m Not Quitting.\n\nI’m a Proud Jewish DSA Member. Here’s Why I’m Not Quitting.\n\n\n\nHadas Thier \n\n\n\n\n\n\n\nLet’s Talk About How the Media Covers Gaza\n\nLet’s Talk About How the Media Covers Gaza\n\n\n\nQ&A\n\n/\n\nMohammed El-Kurd \n\n\n\n\n\n\n\nTrump’s Lawyers Should Be Laughed Out of Court\n\nTrump’s Lawyers Should Be Laughed Out of Court\n\n\n\nElie Mystal \n\n\n\n\n\n\nEvery generation has its “school culture war thing,” says Adam Laats, an education historian at SUNY Binghamton and the author of The Other School Reformers: Conservative Activism in American Education. “You see the same combination of national issues and local anxieties—these ‘You won’t believe what we saw in our son’s textbook’ stories surfacing again and again.”6\nTake the sudden reappearance of concern over socialist indoctrination. Laats points out that a virtually identical panic emerged in the 1950s: “There’s no more Soviet Union, no more [Fidel] Castro, but once again you have this fear of the government taking over that’s this high-anxiety issue.”7 \nCurrent Issue\n\n\n\n \nView our current issue\n\n\n\n\n\nBut in at least one respect, the current culture war convulsion differs from its antecedents, Laats says. “The big difference is Trump. He provided a center and a symbol for all of these old ideas to coalesce around.”8\nIn the waning days of Trump’s term, the commission he convened to further the cause of “patriotic education” released its long-awaited 1776 Report—a rejoinder to The New York Times’ 1619 Project. Though widely panned as plagiarized propaganda, the report has also proved to be extraordinarily influential.9\n“It’s the idea of the past as a refuge,” says Noliwe Rooks, a professor at Cornell University and the author of Cutting School: Privatization, Segregation, and the End of Public Education. “The message is ‘Let’s get rid of the parts and the people in public education that we don’t like.’” She sees parallels between the current attacks on critical race theory and the collisions that resulted from the rise of Black studies in the late 1960s. “Students succeeded in forcing changes to curricula and on campus. But that little bit of progress they made around equity and innovative programs resulted in a backlash that destroyed all of that little bit of progress,” Rooks says.10 \n\n\n\n\n\n\nMore From Jennifer C. Berkshire\n\n\n\nHow to Fight the Right's Moral Panic Over Parental Rights\nMay 23, 2023 \n\n\nThe West Coast Think Tank Helping to Orchestrate DeSantis’s War on the Woke\nMarch 30, 2023 \n\n\nGood News Alert: Democrats Might Actually Flip the Michigan Legislature\nOctober 28, 2022 \n\nDivisive Concepts\nIn the past few months, GOP lawmakers in one state after another have introduced legislation aimed at keeping discussions of social justice out of the classroom. Bills prohibiting the teaching of critical race theory and other “divisive topics” have already passed in Utah, Texas, Oklahoma, and Tennessee and are under consideration in at least 15 other states. In Missouri, a proposed amendment sought to outlaw what its author describes as the “erroneous and hate-filled 1619 Project.”11\n“It said ‘1619 Project,’ but the aim was much broader. It would affect every part of history and literature,” says Jessica Piper, who teaches 11th-grade American literature in Maryville, Mo., a town of 12,000 on the Iowa border.12\nPiper would seem to be exactly the sort of teacher that legislators around the country are targeting. Her students read Clint Smith’s poem “How to Make a Cardboard Box Disappear in 10 Steps,” with its stark imagery of lives lost to police brutality, as part of a history lesson on racial violence. In 1931, a mob of more than 2,000 Maryville residents lynched a man named Raymond Gunn, burning him to death on top of the local schoolhouse. “There’s no historical marker, so the students didn’t know anything about it,” Piper says. This year, for the first time since she began using the poem in class, a parent complained.13 \n\n\n\n\nPiper recently decided that this will be her last year in the classroom. She’s running for the state legislature as a Democrat in a long-shot bid to unseat a Republican who, when he last faced an opponent, won by 80 points.14 \nRelated Articles \n\nFlorida’s Ron DeSantis Wants to Cancel Education About Systemic Racism\n\nJohn Nichols \n\n\nRepublican Cancel Culture: State Laws to Suppress Activism\n\nDavid Cole \n\nIn Iowa, as in Missouri, lawmakers have made the culture wars the centerpiece of their legislative agenda. So far this session, legislators have sought to ban transgender student athletes, implement an ideological test for state-funded faculty, and prohibit the teaching of “divisive concepts” at public schools and universities.15\n“They went with the Trump 1776 agenda,” says Nick Covington, a high school social studies teacher in Ankeny, a city north of Des Moines. “They’re carrying that banner, and it has a chilling effect on everything.”16 \nNick Covington, an Iowa high school social studies teacher.  \nThe bitter aftermath of the presidential election has also roiled the city. Two Ankeny residents were among the participants in the January 6 Capitol attack. And voting on a school funding question in March was disrupted for hours after police found a live pipe bomb at one of the facilities being used as a polling station.17\nCovington says the deep divisions outside his classroom are increasingly affecting what happens within it. This year he has been the target of repeated complaints from a small group of parents. The trouble started in January, when Covington streamed live news reports of the Capitol riot in his European history and economics classes. A parent called the school and claimed that Covington had directed students to his personal social media account, where he’d called Trump supporters Nazis, all of which Covington vehemently denies.18\nThis spring, after Covington showed a Vice News report on the “Unite the Right” rally in Charlottesville, Va., as part of an AP history unit on nationalism in Europe, parents contacted the school board and the superintendent and demanded that he be sanctioned. Though he’d taught the same lesson for three previous years without incident, Covington was ordered by school administrators to stop talking about current events.19\n“I’m basically waiting for the other shoe to drop,” he says.20 \nBLM blacklash: Nationwide protests and calls for a racial justice reckoning have some legislators and school districts on high alert. (Evelyn Hockstein / The Washington Post via Getty Images) \nDeep Divide\nThe pandemic’s profound disruption of public education was already upending state and local politics, as Republicans eagerly capitalized on parents’ frustration over shuttered classrooms. Now the culture wars are further exacerbating this tense climate.21\nJessica Piper’s small Missouri town recently saw the emergence of its first-ever PAC: Northern Missouri Citizens for Reflective Government. The group, which backed conservative candidates for local offices, put most of its energy into attacking an education professor who was running for a seat on the school board in Maryville. Ominous campaign ads depicted Jill Baker, a former schoolteacher, posed between cutouts of Joe Biden and Alexandria Ocasio-Cortez, spouting anti-Trump sentiments and stressing the importance of teaching social justice in elementary schools. She lost in a landslide.22\nIn Elmbrook, Wis., the Waukesha County Republican Party recently threw its weight behind James Gunsalus, a first-time school board candidate who claimed that Covid was no more serious than the flu. According to Gunsalus, Elmbrook’s schools, long among the highest-ranked in Wisconsin, were in free fall as teachers embraced “leftist indoctrination” over academic content, teaching students that “all white people are racist” and that “some people must be censored or canceled.” He lost by only 5 percent of the vote against an incumbent, coming within 600 votes of victory.23\nIn the North Texas community of Southlake, a fast-growing and rapidly diversifying city near Dallas, candidates for the school board, the city council, and mayor, backed by a PAC opposing the school district’s efforts to incorporate more cultural awareness into the curriculum, all captured around 70 percent of the vote. “Southlake Says No to Woke Education,” proclaimed a Wall Street Journal headline.24\n“Every single right-wing person that ran won,” says Megan Walsh, who graduated from a local high school in 2017 and is a leader in the Southlake Anti-Racism Coalition, a community group whose advocacy inspired the adoption of the Cultural Competency Action Plan, which the winning candidates have pledged to eliminate. “We’re back to square one.”25\n\n\n\n\n\nPandemic Fallout\nMunicipal races that once turned on hyperlocal issues have been politicized and nationalized by right-wing culture warriors. But the long reach of the pandemic is at work here too. Debates over diversity plans and critical race theory are further dividing communities that were already split over the response to Covid.26 \nLindsay Love, the first Black school board member in Chandler, Ariz.  \n“It’s all morphing into the same thing,” says Lindsay Love, a school board member in Chandler, Ariz. The first Black board member elected there, Love has been a frequent target of conservative activists and received death threats for her position that schools should remain closed until Covid levels dropped. “You hear people comparing children being masked to slavery and referring to mask supporters as Marxists,” Love says.27\n“You have lost [the] trust of parents,” declared a furious father at a recent board meeting. “Mask mandates, forcing vaccines, canceling prom, limiting graduation, critical race theory. The list goes on. When is enough enough?”28\nThe school culture wars came early to this part of Arizona. After the district adopted a new program that included training teachers on race and equity issues, conservative parents revolted, charging that the equity training “marginalizes white people.” Tucker Carlson has devoted two segments to Chandler.29\n“Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 This spring, New Hampshire has witnessed an extraordinarily acrimonious debate about public education. GOP lawmakers, who took control of the legislature in 2020, have prioritized controversial—and deeply unpopular—legislation, including a sweeping expansion of a program that provides tuition vouchers for private schools and a ban on discussing “divisive concepts,” such as racism or sexism, in the public schools. Crompton, an outspoken opponent of both measures, says, “I became a pawn in the culture war and in the scheme to discredit public schools.”4 \nMisty Crompton, a New Hampshire middle school teacher.  \nShe isn’t the only one. Fueled by the Trump-era GOP’s insatiable appetite for red-meat issues—and finding fertile ground in a public politically polarized by the pandemic—the culture wars are raging, upending school board races, reshaping local politics, and now threatening public education itself.5\n\n\n\nPopular\n\"swipe left below to view more authors\"Swipe →\n\n\n\n\n\n\nWhy I Just Quit DSA\n\nWhy I Just Quit DSA\n\n\n\nMaurice Isserman \n\n\n\n\n\n\n\nI’m a Proud Jewish DSA Member. Here’s Why I’m Not Quitting.\n\nI’m a Proud Jewish DSA Member. Here’s Why I’m Not Quitting.\n\n\n\nHadas Thier \n\n\n\n\n\n\n\nLet’s Talk About How the Media Covers Gaza\n\nLet’s Talk About How the Media Covers Gaza\n\n\n\nQ&A\n\n/\n\nMohammed El-Kurd \n\n\n\n\n\n\n\nTrump’s Lawyers Should Be Laughed Out of Court\n\nTrump’s Lawyers Should Be Laughed Out of Court\n\n\n\nElie Mystal \n\n\n\n\n\n\n\n\n\nPopular\n\"swipe left below to view more authors\"Swipe →\n\n\n\n\n\n\nWhy I Just Quit DSA\n\nWhy I Just Quit DSA\n\n\n\nMaurice Isserman \n\n\n\n\n\n\n\nI’m a Proud Jewish DSA Member. Here’s Why I’m Not Quitting.\n\nI’m a Proud Jewish DSA Member. Here’s Why I’m Not Quitting.\n\n\n\nHadas Thier \n\n\n\n\n\n\n\nLet’s Talk About How the Media Covers Gaza\n\nLet’s Talk About How the Media Covers Gaza\n\n\n\nQ&A\n\n/\n\nMohammed El-Kurd \n\n\n\n\n\n\n\nTrump’s Lawyers Should Be Laughed Out of Court\n\nTrump’s Lawyers Should Be Laughed Out of Court\n\n\n\nElie Mystal \n\n\n\n\n\n\nEvery generation has its “school culture war thing,” says Adam Laats, an education historian at SUNY Binghamton and the author of The Other School Reformers: Conservative Activism in American Education. “You see the same combination of national issues and local anxieties—these ‘You won’t believe what we saw in our son’s textbook’ stories surfacing again and again.”6\nTake the sudden reappearance of concern over socialist indoctrination. Laats points out that a virtually identical panic emerged in the 1950s: “There’s no more Soviet Union, no more [Fidel] Castro, but once again you have this fear of the government taking over that’s this high-anxiety issue.”7 \nCurrent Issue\n\n\n\n \nView our current issue\n\n\n\n\n\nBut in at least one respect, the current culture war convulsion differs from its antecedents, Laats says. “The big difference is Trump. He provided a center and a symbol for all of these old ideas to coalesce around.”8\nIn the waning days of Trump’s term, the commission he convened to further the cause of “patriotic education” released its long-awaited 1776 Report—a rejoinder to The New York Times’ 1619 Project. Though widely panned as plagiarized propaganda, the report has also proved to be extraordinarily influential.9\n“It’s the idea of the past as a refuge,” says Noliwe Rooks, a professor at Cornell University and the author of Cutting School: Privatization, Segregation, and the End of Public Education. “The message is ‘Let’s get rid of the parts and the people in public education that we don’t like.’” She sees parallels between the current attacks on critical race theory and the collisions that resulted from the rise of Black studies in the late 1960s. “Students succeeded in forcing changes to curricula and on campus. But that little bit of progress they made around equity and innovative programs resulted in a backlash that destroyed all of that little bit of progress,” Rooks says.10 \n\n\n\n\n\n\nMore From Jennifer C. Berkshire\n\n\n\nHow to Fight the Right's Moral Panic Over Parental Rights\nMay 23, 2023 \n\n\nThe West Coast Think Tank Helping to Orchestrate DeSantis’s War on the Woke\nMarch 30, 2023 \n\n\nGood News Alert: Democrats Might Actually Flip the Michigan Legislature\nOctober 28, 2022 \n\nDivisive Concepts\nIn the past few months, GOP lawmakers in one state after another have introduced legislation aimed at keeping discussions of social justice out of the classroom. Bills prohibiting the teaching of critical race theory and other “divisive topics” have already passed in Utah, Texas, Oklahoma, and Tennessee and are under consideration in at least 15 other states. In Missouri, a proposed amendment sought to outlaw what its author describes as the “erroneous and hate-filled 1619 Project.”11\n“It said ‘1619 Project,’ but the aim was much broader. It would affect every part of history and literature,” says Jessica Piper, who teaches 11th-grade American literature in Maryville, Mo., a town of 12,000 on the Iowa border.12\nPiper would seem to be exactly the sort of teacher that legislators around the country are targeting. Her students read Clint Smith’s poem “How to Make a Cardboard Box Disappear in 10 Steps,” with its stark imagery of lives lost to police brutality, as part of a history lesson on racial violence. In 1931, a mob of more than 2,000 Maryville residents lynched a man named Raymond Gunn, burning him to death on top of the local schoolhouse. “There’s no historical marker, so the students didn’t know anything about it,” Piper says. This year, for the first time since she began using the poem in class, a parent complained.13 \n\n\n\n\nPiper recently decided that this will be her last year in the classroom. She’s running for the state legislature as a Democrat in a long-shot bid to unseat a Republican who, when he last faced an opponent, won by 80 points.14 \nRelated Articles \n\nFlorida’s Ron DeSantis Wants to Cancel Education About Systemic Racism\n\nJohn Nichols \n\n\nRepublican Cancel Culture: State Laws to Suppress Activism\n\nDavid Cole \n\nIn Iowa, as in Missouri, lawmakers have made the culture wars the centerpiece of their legislative agenda. So far this session, legislators have sought to ban transgender student athletes, implement an ideological test for state-funded faculty, and prohibit the teaching of “divisive concepts” at public schools and universities.15\n“They went with the Trump 1776 agenda,” says Nick Covington, a high school social studies teacher in Ankeny, a city north of Des Moines. “They’re carrying that banner, and it has a chilling effect on everything.”16 \nNick Covington, an Iowa high school social studies teacher.  \nThe bitter aftermath of the presidential election has also roiled the city. Two Ankeny residents were among the participants in the January 6 Capitol attack. And voting on a school funding question in March was disrupted for hours after police found a live pipe bomb at one of the facilities being used as a polling station.17\nCovington says the deep divisions outside his classroom are increasingly affecting what happens within it. This year he has been the target of repeated complaints from a small group of parents. The trouble started in January, when Covington streamed live news reports of the Capitol riot in his European history and economics classes. A parent called the school and claimed that Covington had directed students to his personal social media account, where he’d called Trump supporters Nazis, all of which Covington vehemently denies.18\nThis spring, after Covington showed a Vice News report on the “Unite the Right” rally in Charlottesville, Va., as part of an AP history unit on nationalism in Europe, parents contacted the school board and the superintendent and demanded that he be sanctioned. Though he’d taught the same lesson for three previous years without incident, Covington was ordered by school administrators to stop talking about current events.19\n“I’m basically waiting for the other shoe to drop,” he says.20 \nBLM blacklash: Nationwide protests and calls for a racial justice reckoning have some legislators and school districts on high alert. (Evelyn Hockstein / The Washington Post via Getty Images) \nDeep Divide\nThe pandemic’s profound disruption of public education was already upending state and local politics, as Republicans eagerly capitalized on parents’ frustration over shuttered classrooms. Now the culture wars are further exacerbating this tense climate.21\nJessica Piper’s small Missouri town recently saw the emergence of its first-ever PAC: Northern Missouri Citizens for Reflective Government. The group, which backed conservative candidates for local offices, put most of its energy into attacking an education professor who was running for a seat on the school board in Maryville. Ominous campaign ads depicted Jill Baker, a former schoolteacher, posed between cutouts of Joe Biden and Alexandria Ocasio-Cortez, spouting anti-Trump sentiments and stressing the importance of teaching social justice in elementary schools. She lost in a landslide.22\nIn Elmbrook, Wis., the Waukesha County Republican Party recently threw its weight behind James Gunsalus, a first-time school board candidate who claimed that Covid was no more serious than the flu. According to Gunsalus, Elmbrook’s schools, long among the highest-ranked in Wisconsin, were in free fall as teachers embraced “leftist indoctrination” over academic content, teaching students that “all white people are racist” and that “some people must be censored or canceled.” He lost by only 5 percent of the vote against an incumbent, coming within 600 votes of victory.23\nIn the North Texas community of Southlake, a fast-growing and rapidly diversifying city near Dallas, candidates for the school board, the city council, and mayor, backed by a PAC opposing the school district’s efforts to incorporate more cultural awareness into the curriculum, all captured around 70 percent of the vote. “Southlake Says No to Woke Education,” proclaimed a Wall Street Journal headline.24\n“Every single right-wing person that ran won,” says Megan Walsh, who graduated from a local high school in 2017 and is a leader in the Southlake Anti-Racism Coalition, a community group whose advocacy inspired the adoption of the Cultural Competency Action Plan, which the winning candidates have pledged to eliminate. “We’re back to square one.”25\n\n\n\n\n\nPandemic Fallout\nMunicipal races that once turned on hyperlocal issues have been politicized and nationalized by right-wing culture warriors. But the long reach of the pandemic is at work here too. Debates over diversity plans and critical race theory are further dividing communities that were already split over the response to Covid.26 \nLindsay Love, the first Black school board member in Chandler, Ariz.  \n“It’s all morphing into the same thing,” says Lindsay Love, a school board member in Chandler, Ariz. The first Black board member elected there, Love has been a frequent target of conservative activists and received death threats for her position that schools should remain closed until Covid levels dropped. “You hear people comparing children being masked to slavery and referring to mask supporters as Marxists,” Love says.27\n“You have lost [the] trust of parents,” declared a furious father at a recent board meeting. “Mask mandates, forcing vaccines, canceling prom, limiting graduation, critical race theory. The list goes on. When is enough enough?”28\nThe school culture wars came early to this part of Arizona. After the district adopted a new program that included training teachers on race and equity issues, conservative parents revolted, charging that the equity training “marginalizes white people.” Tucker Carlson has devoted two segments to Chandler.29\n“Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 Misty Crompton, a New Hampshire middle school teacher. She isn’t the only one. Fueled by the Trump-era GOP’s insatiable appetite for red-meat issues—and finding fertile ground in a public politically polarized by the pandemic—the culture wars are raging, upending school board races, reshaping local politics, and now threatening public education itself.5\n\n\n\nPopular\n\"swipe left below to view more authors\"Swipe →\n\n\n\n\n\n\nWhy I Just Quit DSA\n\nWhy I Just Quit DSA\n\n\n\nMaurice Isserman \n\n\n\n\n\n\n\nI’m a Proud Jewish DSA Member. Here’s Why I’m Not Quitting.\n\nI’m a Proud Jewish DSA Member. Here’s Why I’m Not Quitting.\n\n\n\nHadas Thier \n\n\n\n\n\n\n\nLet’s Talk About How the Media Covers Gaza\n\nLet’s Talk About How the Media Covers Gaza\n\n\n\nQ&A\n\n/\n\nMohammed El-Kurd \n\n\n\n\n\n\n\nTrump’s Lawyers Should Be Laughed Out of Court\n\nTrump’s Lawyers Should Be Laughed Out of Court\n\n\n\nElie Mystal \n\n\n\n\n\n\n\n\n\nPopular\n\"swipe left below to view more authors\"Swipe →\n\n\n\n\n\n\nWhy I Just Quit DSA\n\nWhy I Just Quit DSA\n\n\n\nMaurice Isserman \n\n\n\n\n\n\n\nI’m a Proud Jewish DSA Member. Here’s Why I’m Not Quitting.\n\nI’m a Proud Jewish DSA Member. Here’s Why I’m Not Quitting.\n\n\n\nHadas Thier \n\n\n\n\n\n\n\nLet’s Talk About How the Media Covers Gaza\n\nLet’s Talk About How the Media Covers Gaza\n\n\n\nQ&A\n\n/\n\nMohammed El-Kurd \n\n\n\n\n\n\n\nTrump’s Lawyers Should Be Laughed Out of Court\n\nTrump’s Lawyers Should Be Laughed Out of Court\n\n\n\nElie Mystal \n\n\n\n\n\n\nEvery generation has its “school culture war thing,” says Adam Laats, an education historian at SUNY Binghamton and the author of The Other School Reformers: Conservative Activism in American Education. “You see the same combination of national issues and local anxieties—these ‘You won’t believe what we saw in our son’s textbook’ stories surfacing again and again.”6\nTake the sudden reappearance of concern over socialist indoctrination. Laats points out that a virtually identical panic emerged in the 1950s: “There’s no more Soviet Union, no more [Fidel] Castro, but once again you have this fear of the government taking over that’s this high-anxiety issue.”7 \nCurrent Issue\n\n\n\n \nView our current issue\n\n\n\n\n\nBut in at least one respect, the current culture war convulsion differs from its antecedents, Laats says. “The big difference is Trump. He provided a center and a symbol for all of these old ideas to coalesce around.”8\nIn the waning days of Trump’s term, the commission he convened to further the cause of “patriotic education” released its long-awaited 1776 Report—a rejoinder to The New York Times’ 1619 Project. Though widely panned as plagiarized propaganda, the report has also proved to be extraordinarily influential.9\n“It’s the idea of the past as a refuge,” says Noliwe Rooks, a professor at Cornell University and the author of Cutting School: Privatization, Segregation, and the End of Public Education. “The message is ‘Let’s get rid of the parts and the people in public education that we don’t like.’” She sees parallels between the current attacks on critical race theory and the collisions that resulted from the rise of Black studies in the late 1960s. “Students succeeded in forcing changes to curricula and on campus. But that little bit of progress they made around equity and innovative programs resulted in a backlash that destroyed all of that little bit of progress,” Rooks says.10 \n\n\n\n\n\n\nMore From Jennifer C. Berkshire\n\n\n\nHow to Fight the Right's Moral Panic Over Parental Rights\nMay 23, 2023 \n\n\nThe West Coast Think Tank Helping to Orchestrate DeSantis’s War on the Woke\nMarch 30, 2023 \n\n\nGood News Alert: Democrats Might Actually Flip the Michigan Legislature\nOctober 28, 2022 \n\nDivisive Concepts\nIn the past few months, GOP lawmakers in one state after another have introduced legislation aimed at keeping discussions of social justice out of the classroom. Bills prohibiting the teaching of critical race theory and other “divisive topics” have already passed in Utah, Texas, Oklahoma, and Tennessee and are under consideration in at least 15 other states. In Missouri, a proposed amendment sought to outlaw what its author describes as the “erroneous and hate-filled 1619 Project.”11\n“It said ‘1619 Project,’ but the aim was much broader. It would affect every part of history and literature,” says Jessica Piper, who teaches 11th-grade American literature in Maryville, Mo., a town of 12,000 on the Iowa border.12\nPiper would seem to be exactly the sort of teacher that legislators around the country are targeting. Her students read Clint Smith’s poem “How to Make a Cardboard Box Disappear in 10 Steps,” with its stark imagery of lives lost to police brutality, as part of a history lesson on racial violence. In 1931, a mob of more than 2,000 Maryville residents lynched a man named Raymond Gunn, burning him to death on top of the local schoolhouse. “There’s no historical marker, so the students didn’t know anything about it,” Piper says. This year, for the first time since she began using the poem in class, a parent complained.13 \n\n\n\n\nPiper recently decided that this will be her last year in the classroom. She’s running for the state legislature as a Democrat in a long-shot bid to unseat a Republican who, when he last faced an opponent, won by 80 points.14 \nRelated Articles \n\nFlorida’s Ron DeSantis Wants to Cancel Education About Systemic Racism\n\nJohn Nichols \n\n\nRepublican Cancel Culture: State Laws to Suppress Activism\n\nDavid Cole \n\nIn Iowa, as in Missouri, lawmakers have made the culture wars the centerpiece of their legislative agenda. So far this session, legislators have sought to ban transgender student athletes, implement an ideological test for state-funded faculty, and prohibit the teaching of “divisive concepts” at public schools and universities.15\n“They went with the Trump 1776 agenda,” says Nick Covington, a high school social studies teacher in Ankeny, a city north of Des Moines. “They’re carrying that banner, and it has a chilling effect on everything.”16 \nNick Covington, an Iowa high school social studies teacher.  \nThe bitter aftermath of the presidential election has also roiled the city. Two Ankeny residents were among the participants in the January 6 Capitol attack. And voting on a school funding question in March was disrupted for hours after police found a live pipe bomb at one of the facilities being used as a polling station.17\nCovington says the deep divisions outside his classroom are increasingly affecting what happens within it. This year he has been the target of repeated complaints from a small group of parents. The trouble started in January, when Covington streamed live news reports of the Capitol riot in his European history and economics classes. A parent called the school and claimed that Covington had directed students to his personal social media account, where he’d called Trump supporters Nazis, all of which Covington vehemently denies.18\nThis spring, after Covington showed a Vice News report on the “Unite the Right” rally in Charlottesville, Va., as part of an AP history unit on nationalism in Europe, parents contacted the school board and the superintendent and demanded that he be sanctioned. Though he’d taught the same lesson for three previous years without incident, Covington was ordered by school administrators to stop talking about current events.19\n“I’m basically waiting for the other shoe to drop,” he says.20 \nBLM blacklash: Nationwide protests and calls for a racial justice reckoning have some legislators and school districts on high alert. (Evelyn Hockstein / The Washington Post via Getty Images) \nDeep Divide\nThe pandemic’s profound disruption of public education was already upending state and local politics, as Republicans eagerly capitalized on parents’ frustration over shuttered classrooms. Now the culture wars are further exacerbating this tense climate.21\nJessica Piper’s small Missouri town recently saw the emergence of its first-ever PAC: Northern Missouri Citizens for Reflective Government. The group, which backed conservative candidates for local offices, put most of its energy into attacking an education professor who was running for a seat on the school board in Maryville. Ominous campaign ads depicted Jill Baker, a former schoolteacher, posed between cutouts of Joe Biden and Alexandria Ocasio-Cortez, spouting anti-Trump sentiments and stressing the importance of teaching social justice in elementary schools. She lost in a landslide.22\nIn Elmbrook, Wis., the Waukesha County Republican Party recently threw its weight behind James Gunsalus, a first-time school board candidate who claimed that Covid was no more serious than the flu. According to Gunsalus, Elmbrook’s schools, long among the highest-ranked in Wisconsin, were in free fall as teachers embraced “leftist indoctrination” over academic content, teaching students that “all white people are racist” and that “some people must be censored or canceled.” He lost by only 5 percent of the vote against an incumbent, coming within 600 votes of victory.23\nIn the North Texas community of Southlake, a fast-growing and rapidly diversifying city near Dallas, candidates for the school board, the city council, and mayor, backed by a PAC opposing the school district’s efforts to incorporate more cultural awareness into the curriculum, all captured around 70 percent of the vote. “Southlake Says No to Woke Education,” proclaimed a Wall Street Journal headline.24\n“Every single right-wing person that ran won,” says Megan Walsh, who graduated from a local high school in 2017 and is a leader in the Southlake Anti-Racism Coalition, a community group whose advocacy inspired the adoption of the Cultural Competency Action Plan, which the winning candidates have pledged to eliminate. “We’re back to square one.”25\n\n\n\n\n\nPandemic Fallout\nMunicipal races that once turned on hyperlocal issues have been politicized and nationalized by right-wing culture warriors. But the long reach of the pandemic is at work here too. Debates over diversity plans and critical race theory are further dividing communities that were already split over the response to Covid.26 \nLindsay Love, the first Black school board member in Chandler, Ariz.  \n“It’s all morphing into the same thing,” says Lindsay Love, a school board member in Chandler, Ariz. The first Black board member elected there, Love has been a frequent target of conservative activists and received death threats for her position that schools should remain closed until Covid levels dropped. “You hear people comparing children being masked to slavery and referring to mask supporters as Marxists,” Love says.27\n“You have lost [the] trust of parents,” declared a furious father at a recent board meeting. “Mask mandates, forcing vaccines, canceling prom, limiting graduation, critical race theory. The list goes on. When is enough enough?”28\nThe school culture wars came early to this part of Arizona. After the district adopted a new program that included training teachers on race and equity issues, conservative parents revolted, charging that the equity training “marginalizes white people.” Tucker Carlson has devoted two segments to Chandler.29\n“Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 Maurice Isserman Hadas Thier Q&A\n\n/\n\nMohammed El-Kurd Elie Mystal Maurice Isserman Hadas Thier Q&A\n\n/\n\nMohammed El-Kurd Elie Mystal Every generation has its “school culture war thing,” says Adam Laats, an education historian at SUNY Binghamton and the author of The Other School Reformers: Conservative Activism in American Education. “You see the same combination of national issues and local anxieties—these ‘You won’t believe what we saw in our son’s textbook’ stories surfacing again and again.”6\nTake the sudden reappearance of concern over socialist indoctrination. Laats points out that a virtually identical panic emerged in the 1950s: “There’s no more Soviet Union, no more [Fidel] Castro, but once again you have this fear of the government taking over that’s this high-anxiety issue.”7 \nCurrent Issue\n\n\n\n \nView our current issue\n\n\n\n\n\nBut in at least one respect, the current culture war convulsion differs from its antecedents, Laats says. “The big difference is Trump. He provided a center and a symbol for all of these old ideas to coalesce around.”8\nIn the waning days of Trump’s term, the commission he convened to further the cause of “patriotic education” released its long-awaited 1776 Report—a rejoinder to The New York Times’ 1619 Project. Though widely panned as plagiarized propaganda, the report has also proved to be extraordinarily influential.9\n“It’s the idea of the past as a refuge,” says Noliwe Rooks, a professor at Cornell University and the author of Cutting School: Privatization, Segregation, and the End of Public Education. “The message is ‘Let’s get rid of the parts and the people in public education that we don’t like.’” She sees parallels between the current attacks on critical race theory and the collisions that resulted from the rise of Black studies in the late 1960s. “Students succeeded in forcing changes to curricula and on campus. But that little bit of progress they made around equity and innovative programs resulted in a backlash that destroyed all of that little bit of progress,” Rooks says.10 \n\n\n\n\n\n\nMore From Jennifer C. Berkshire\n\n\n\nHow to Fight the Right's Moral Panic Over Parental Rights\nMay 23, 2023 \n\n\nThe West Coast Think Tank Helping to Orchestrate DeSantis’s War on the Woke\nMarch 30, 2023 \n\n\nGood News Alert: Democrats Might Actually Flip the Michigan Legislature\nOctober 28, 2022 \n\nDivisive Concepts\nIn the past few months, GOP lawmakers in one state after another have introduced legislation aimed at keeping discussions of social justice out of the classroom. Bills prohibiting the teaching of critical race theory and other “divisive topics” have already passed in Utah, Texas, Oklahoma, and Tennessee and are under consideration in at least 15 other states. In Missouri, a proposed amendment sought to outlaw what its author describes as the “erroneous and hate-filled 1619 Project.”11\n“It said ‘1619 Project,’ but the aim was much broader. It would affect every part of history and literature,” says Jessica Piper, who teaches 11th-grade American literature in Maryville, Mo., a town of 12,000 on the Iowa border.12\nPiper would seem to be exactly the sort of teacher that legislators around the country are targeting. Her students read Clint Smith’s poem “How to Make a Cardboard Box Disappear in 10 Steps,” with its stark imagery of lives lost to police brutality, as part of a history lesson on racial violence. In 1931, a mob of more than 2,000 Maryville residents lynched a man named Raymond Gunn, burning him to death on top of the local schoolhouse. “There’s no historical marker, so the students didn’t know anything about it,” Piper says. This year, for the first time since she began using the poem in class, a parent complained.13 \n\n\n\n\nPiper recently decided that this will be her last year in the classroom. She’s running for the state legislature as a Democrat in a long-shot bid to unseat a Republican who, when he last faced an opponent, won by 80 points.14 \nRelated Articles \n\nFlorida’s Ron DeSantis Wants to Cancel Education About Systemic Racism\n\nJohn Nichols \n\n\nRepublican Cancel Culture: State Laws to Suppress Activism\n\nDavid Cole \n\nIn Iowa, as in Missouri, lawmakers have made the culture wars the centerpiece of their legislative agenda. So far this session, legislators have sought to ban transgender student athletes, implement an ideological test for state-funded faculty, and prohibit the teaching of “divisive concepts” at public schools and universities.15\n“They went with the Trump 1776 agenda,” says Nick Covington, a high school social studies teacher in Ankeny, a city north of Des Moines. “They’re carrying that banner, and it has a chilling effect on everything.”16 \nNick Covington, an Iowa high school social studies teacher.  \nThe bitter aftermath of the presidential election has also roiled the city. Two Ankeny residents were among the participants in the January 6 Capitol attack. And voting on a school funding question in March was disrupted for hours after police found a live pipe bomb at one of the facilities being used as a polling station.17\nCovington says the deep divisions outside his classroom are increasingly affecting what happens within it. This year he has been the target of repeated complaints from a small group of parents. The trouble started in January, when Covington streamed live news reports of the Capitol riot in his European history and economics classes. A parent called the school and claimed that Covington had directed students to his personal social media account, where he’d called Trump supporters Nazis, all of which Covington vehemently denies.18\nThis spring, after Covington showed a Vice News report on the “Unite the Right” rally in Charlottesville, Va., as part of an AP history unit on nationalism in Europe, parents contacted the school board and the superintendent and demanded that he be sanctioned. Though he’d taught the same lesson for three previous years without incident, Covington was ordered by school administrators to stop talking about current events.19\n“I’m basically waiting for the other shoe to drop,” he says.20 \nBLM blacklash: Nationwide protests and calls for a racial justice reckoning have some legislators and school districts on high alert. (Evelyn Hockstein / The Washington Post via Getty Images) \nDeep Divide\nThe pandemic’s profound disruption of public education was already upending state and local politics, as Republicans eagerly capitalized on parents’ frustration over shuttered classrooms. Now the culture wars are further exacerbating this tense climate.21\nJessica Piper’s small Missouri town recently saw the emergence of its first-ever PAC: Northern Missouri Citizens for Reflective Government. The group, which backed conservative candidates for local offices, put most of its energy into attacking an education professor who was running for a seat on the school board in Maryville. Ominous campaign ads depicted Jill Baker, a former schoolteacher, posed between cutouts of Joe Biden and Alexandria Ocasio-Cortez, spouting anti-Trump sentiments and stressing the importance of teaching social justice in elementary schools. She lost in a landslide.22\nIn Elmbrook, Wis., the Waukesha County Republican Party recently threw its weight behind James Gunsalus, a first-time school board candidate who claimed that Covid was no more serious than the flu. According to Gunsalus, Elmbrook’s schools, long among the highest-ranked in Wisconsin, were in free fall as teachers embraced “leftist indoctrination” over academic content, teaching students that “all white people are racist” and that “some people must be censored or canceled.” He lost by only 5 percent of the vote against an incumbent, coming within 600 votes of victory.23\nIn the North Texas community of Southlake, a fast-growing and rapidly diversifying city near Dallas, candidates for the school board, the city council, and mayor, backed by a PAC opposing the school district’s efforts to incorporate more cultural awareness into the curriculum, all captured around 70 percent of the vote. “Southlake Says No to Woke Education,” proclaimed a Wall Street Journal headline.24\n“Every single right-wing person that ran won,” says Megan Walsh, who graduated from a local high school in 2017 and is a leader in the Southlake Anti-Racism Coalition, a community group whose advocacy inspired the adoption of the Cultural Competency Action Plan, which the winning candidates have pledged to eliminate. “We’re back to square one.”25\n\n\n\n\n\nPandemic Fallout\nMunicipal races that once turned on hyperlocal issues have been politicized and nationalized by right-wing culture warriors. But the long reach of the pandemic is at work here too. Debates over diversity plans and critical race theory are further dividing communities that were already split over the response to Covid.26 \nLindsay Love, the first Black school board member in Chandler, Ariz.  \n“It’s all morphing into the same thing,” says Lindsay Love, a school board member in Chandler, Ariz. The first Black board member elected there, Love has been a frequent target of conservative activists and received death threats for her position that schools should remain closed until Covid levels dropped. “You hear people comparing children being masked to slavery and referring to mask supporters as Marxists,” Love says.27\n“You have lost [the] trust of parents,” declared a furious father at a recent board meeting. “Mask mandates, forcing vaccines, canceling prom, limiting graduation, critical race theory. The list goes on. When is enough enough?”28\nThe school culture wars came early to this part of Arizona. After the district adopted a new program that included training teachers on race and equity issues, conservative parents revolted, charging that the equity training “marginalizes white people.” Tucker Carlson has devoted two segments to Chandler.29\n“Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 Take the sudden reappearance of concern over socialist indoctrination. Laats points out that a virtually identical panic emerged in the 1950s: “There’s no more Soviet Union, no more [Fidel] Castro, but once again you have this fear of the government taking over that’s this high-anxiety issue.”7 \nCurrent Issue\n\n\n\n \nView our current issue\n\n\n\n\n\nBut in at least one respect, the current culture war convulsion differs from its antecedents, Laats says. “The big difference is Trump. He provided a center and a symbol for all of these old ideas to coalesce around.”8\nIn the waning days of Trump’s term, the commission he convened to further the cause of “patriotic education” released its long-awaited 1776 Report—a rejoinder to The New York Times’ 1619 Project. Though widely panned as plagiarized propaganda, the report has also proved to be extraordinarily influential.9\n“It’s the idea of the past as a refuge,” says Noliwe Rooks, a professor at Cornell University and the author of Cutting School: Privatization, Segregation, and the End of Public Education. “The message is ‘Let’s get rid of the parts and the people in public education that we don’t like.’” She sees parallels between the current attacks on critical race theory and the collisions that resulted from the rise of Black studies in the late 1960s. “Students succeeded in forcing changes to curricula and on campus. But that little bit of progress they made around equity and innovative programs resulted in a backlash that destroyed all of that little bit of progress,” Rooks says.10 \n\n\n\n\n\n\nMore From Jennifer C. Berkshire\n\n\n\nHow to Fight the Right's Moral Panic Over Parental Rights\nMay 23, 2023 \n\n\nThe West Coast Think Tank Helping to Orchestrate DeSantis’s War on the Woke\nMarch 30, 2023 \n\n\nGood News Alert: Democrats Might Actually Flip the Michigan Legislature\nOctober 28, 2022 \n\nDivisive Concepts\nIn the past few months, GOP lawmakers in one state after another have introduced legislation aimed at keeping discussions of social justice out of the classroom. Bills prohibiting the teaching of critical race theory and other “divisive topics” have already passed in Utah, Texas, Oklahoma, and Tennessee and are under consideration in at least 15 other states. In Missouri, a proposed amendment sought to outlaw what its author describes as the “erroneous and hate-filled 1619 Project.”11\n“It said ‘1619 Project,’ but the aim was much broader. It would affect every part of history and literature,” says Jessica Piper, who teaches 11th-grade American literature in Maryville, Mo., a town of 12,000 on the Iowa border.12\nPiper would seem to be exactly the sort of teacher that legislators around the country are targeting. Her students read Clint Smith’s poem “How to Make a Cardboard Box Disappear in 10 Steps,” with its stark imagery of lives lost to police brutality, as part of a history lesson on racial violence. In 1931, a mob of more than 2,000 Maryville residents lynched a man named Raymond Gunn, burning him to death on top of the local schoolhouse. “There’s no historical marker, so the students didn’t know anything about it,” Piper says. This year, for the first time since she began using the poem in class, a parent complained.13 \n\n\n\n\nPiper recently decided that this will be her last year in the classroom. She’s running for the state legislature as a Democrat in a long-shot bid to unseat a Republican who, when he last faced an opponent, won by 80 points.14 \nRelated Articles \n\nFlorida’s Ron DeSantis Wants to Cancel Education About Systemic Racism\n\nJohn Nichols \n\n\nRepublican Cancel Culture: State Laws to Suppress Activism\n\nDavid Cole \n\nIn Iowa, as in Missouri, lawmakers have made the culture wars the centerpiece of their legislative agenda. So far this session, legislators have sought to ban transgender student athletes, implement an ideological test for state-funded faculty, and prohibit the teaching of “divisive concepts” at public schools and universities.15\n“They went with the Trump 1776 agenda,” says Nick Covington, a high school social studies teacher in Ankeny, a city north of Des Moines. “They’re carrying that banner, and it has a chilling effect on everything.”16 \nNick Covington, an Iowa high school social studies teacher.  \nThe bitter aftermath of the presidential election has also roiled the city. Two Ankeny residents were among the participants in the January 6 Capitol attack. And voting on a school funding question in March was disrupted for hours after police found a live pipe bomb at one of the facilities being used as a polling station.17\nCovington says the deep divisions outside his classroom are increasingly affecting what happens within it. This year he has been the target of repeated complaints from a small group of parents. The trouble started in January, when Covington streamed live news reports of the Capitol riot in his European history and economics classes. A parent called the school and claimed that Covington had directed students to his personal social media account, where he’d called Trump supporters Nazis, all of which Covington vehemently denies.18\nThis spring, after Covington showed a Vice News report on the “Unite the Right” rally in Charlottesville, Va., as part of an AP history unit on nationalism in Europe, parents contacted the school board and the superintendent and demanded that he be sanctioned. Though he’d taught the same lesson for three previous years without incident, Covington was ordered by school administrators to stop talking about current events.19\n“I’m basically waiting for the other shoe to drop,” he says.20 \nBLM blacklash: Nationwide protests and calls for a racial justice reckoning have some legislators and school districts on high alert. (Evelyn Hockstein / The Washington Post via Getty Images) \nDeep Divide\nThe pandemic’s profound disruption of public education was already upending state and local politics, as Republicans eagerly capitalized on parents’ frustration over shuttered classrooms. Now the culture wars are further exacerbating this tense climate.21\nJessica Piper’s small Missouri town recently saw the emergence of its first-ever PAC: Northern Missouri Citizens for Reflective Government. The group, which backed conservative candidates for local offices, put most of its energy into attacking an education professor who was running for a seat on the school board in Maryville. Ominous campaign ads depicted Jill Baker, a former schoolteacher, posed between cutouts of Joe Biden and Alexandria Ocasio-Cortez, spouting anti-Trump sentiments and stressing the importance of teaching social justice in elementary schools. She lost in a landslide.22\nIn Elmbrook, Wis., the Waukesha County Republican Party recently threw its weight behind James Gunsalus, a first-time school board candidate who claimed that Covid was no more serious than the flu. According to Gunsalus, Elmbrook’s schools, long among the highest-ranked in Wisconsin, were in free fall as teachers embraced “leftist indoctrination” over academic content, teaching students that “all white people are racist” and that “some people must be censored or canceled.” He lost by only 5 percent of the vote against an incumbent, coming within 600 votes of victory.23\nIn the North Texas community of Southlake, a fast-growing and rapidly diversifying city near Dallas, candidates for the school board, the city council, and mayor, backed by a PAC opposing the school district’s efforts to incorporate more cultural awareness into the curriculum, all captured around 70 percent of the vote. “Southlake Says No to Woke Education,” proclaimed a Wall Street Journal headline.24\n“Every single right-wing person that ran won,” says Megan Walsh, who graduated from a local high school in 2017 and is a leader in the Southlake Anti-Racism Coalition, a community group whose advocacy inspired the adoption of the Cultural Competency Action Plan, which the winning candidates have pledged to eliminate. “We’re back to square one.”25\n\n\n\n\n\nPandemic Fallout\nMunicipal races that once turned on hyperlocal issues have been politicized and nationalized by right-wing culture warriors. But the long reach of the pandemic is at work here too. Debates over diversity plans and critical race theory are further dividing communities that were already split over the response to Covid.26 \nLindsay Love, the first Black school board member in Chandler, Ariz.  \n“It’s all morphing into the same thing,” says Lindsay Love, a school board member in Chandler, Ariz. The first Black board member elected there, Love has been a frequent target of conservative activists and received death threats for her position that schools should remain closed until Covid levels dropped. “You hear people comparing children being masked to slavery and referring to mask supporters as Marxists,” Love says.27\n“You have lost [the] trust of parents,” declared a furious father at a recent board meeting. “Mask mandates, forcing vaccines, canceling prom, limiting graduation, critical race theory. The list goes on. When is enough enough?”28\nThe school culture wars came early to this part of Arizona. After the district adopted a new program that included training teachers on race and equity issues, conservative parents revolted, charging that the equity training “marginalizes white people.” Tucker Carlson has devoted two segments to Chandler.29\n“Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 But in at least one respect, the current culture war convulsion differs from its antecedents, Laats says. “The big difference is Trump. He provided a center and a symbol for all of these old ideas to coalesce around.”8\nIn the waning days of Trump’s term, the commission he convened to further the cause of “patriotic education” released its long-awaited 1776 Report—a rejoinder to The New York Times’ 1619 Project. Though widely panned as plagiarized propaganda, the report has also proved to be extraordinarily influential.9\n“It’s the idea of the past as a refuge,” says Noliwe Rooks, a professor at Cornell University and the author of Cutting School: Privatization, Segregation, and the End of Public Education. “The message is ‘Let’s get rid of the parts and the people in public education that we don’t like.’” She sees parallels between the current attacks on critical race theory and the collisions that resulted from the rise of Black studies in the late 1960s. “Students succeeded in forcing changes to curricula and on campus. But that little bit of progress they made around equity and innovative programs resulted in a backlash that destroyed all of that little bit of progress,” Rooks says.10 \n\n\n\n\n\n\nMore From Jennifer C. Berkshire\n\n\n\nHow to Fight the Right's Moral Panic Over Parental Rights\nMay 23, 2023 \n\n\nThe West Coast Think Tank Helping to Orchestrate DeSantis’s War on the Woke\nMarch 30, 2023 \n\n\nGood News Alert: Democrats Might Actually Flip the Michigan Legislature\nOctober 28, 2022 \n\nDivisive Concepts\nIn the past few months, GOP lawmakers in one state after another have introduced legislation aimed at keeping discussions of social justice out of the classroom. Bills prohibiting the teaching of critical race theory and other “divisive topics” have already passed in Utah, Texas, Oklahoma, and Tennessee and are under consideration in at least 15 other states. In Missouri, a proposed amendment sought to outlaw what its author describes as the “erroneous and hate-filled 1619 Project.”11\n“It said ‘1619 Project,’ but the aim was much broader. It would affect every part of history and literature,” says Jessica Piper, who teaches 11th-grade American literature in Maryville, Mo., a town of 12,000 on the Iowa border.12\nPiper would seem to be exactly the sort of teacher that legislators around the country are targeting. Her students read Clint Smith’s poem “How to Make a Cardboard Box Disappear in 10 Steps,” with its stark imagery of lives lost to police brutality, as part of a history lesson on racial violence. In 1931, a mob of more than 2,000 Maryville residents lynched a man named Raymond Gunn, burning him to death on top of the local schoolhouse. “There’s no historical marker, so the students didn’t know anything about it,” Piper says. This year, for the first time since she began using the poem in class, a parent complained.13 \n\n\n\n\nPiper recently decided that this will be her last year in the classroom. She’s running for the state legislature as a Democrat in a long-shot bid to unseat a Republican who, when he last faced an opponent, won by 80 points.14 \nRelated Articles \n\nFlorida’s Ron DeSantis Wants to Cancel Education About Systemic Racism\n\nJohn Nichols \n\n\nRepublican Cancel Culture: State Laws to Suppress Activism\n\nDavid Cole \n\nIn Iowa, as in Missouri, lawmakers have made the culture wars the centerpiece of their legislative agenda. So far this session, legislators have sought to ban transgender student athletes, implement an ideological test for state-funded faculty, and prohibit the teaching of “divisive concepts” at public schools and universities.15\n“They went with the Trump 1776 agenda,” says Nick Covington, a high school social studies teacher in Ankeny, a city north of Des Moines. “They’re carrying that banner, and it has a chilling effect on everything.”16 \nNick Covington, an Iowa high school social studies teacher.  \nThe bitter aftermath of the presidential election has also roiled the city. Two Ankeny residents were among the participants in the January 6 Capitol attack. And voting on a school funding question in March was disrupted for hours after police found a live pipe bomb at one of the facilities being used as a polling station.17\nCovington says the deep divisions outside his classroom are increasingly affecting what happens within it. This year he has been the target of repeated complaints from a small group of parents. The trouble started in January, when Covington streamed live news reports of the Capitol riot in his European history and economics classes. A parent called the school and claimed that Covington had directed students to his personal social media account, where he’d called Trump supporters Nazis, all of which Covington vehemently denies.18\nThis spring, after Covington showed a Vice News report on the “Unite the Right” rally in Charlottesville, Va., as part of an AP history unit on nationalism in Europe, parents contacted the school board and the superintendent and demanded that he be sanctioned. Though he’d taught the same lesson for three previous years without incident, Covington was ordered by school administrators to stop talking about current events.19\n“I’m basically waiting for the other shoe to drop,” he says.20 \nBLM blacklash: Nationwide protests and calls for a racial justice reckoning have some legislators and school districts on high alert. (Evelyn Hockstein / The Washington Post via Getty Images) \nDeep Divide\nThe pandemic’s profound disruption of public education was already upending state and local politics, as Republicans eagerly capitalized on parents’ frustration over shuttered classrooms. Now the culture wars are further exacerbating this tense climate.21\nJessica Piper’s small Missouri town recently saw the emergence of its first-ever PAC: Northern Missouri Citizens for Reflective Government. The group, which backed conservative candidates for local offices, put most of its energy into attacking an education professor who was running for a seat on the school board in Maryville. Ominous campaign ads depicted Jill Baker, a former schoolteacher, posed between cutouts of Joe Biden and Alexandria Ocasio-Cortez, spouting anti-Trump sentiments and stressing the importance of teaching social justice in elementary schools. She lost in a landslide.22\nIn Elmbrook, Wis., the Waukesha County Republican Party recently threw its weight behind James Gunsalus, a first-time school board candidate who claimed that Covid was no more serious than the flu. According to Gunsalus, Elmbrook’s schools, long among the highest-ranked in Wisconsin, were in free fall as teachers embraced “leftist indoctrination” over academic content, teaching students that “all white people are racist” and that “some people must be censored or canceled.” He lost by only 5 percent of the vote against an incumbent, coming within 600 votes of victory.23\nIn the North Texas community of Southlake, a fast-growing and rapidly diversifying city near Dallas, candidates for the school board, the city council, and mayor, backed by a PAC opposing the school district’s efforts to incorporate more cultural awareness into the curriculum, all captured around 70 percent of the vote. “Southlake Says No to Woke Education,” proclaimed a Wall Street Journal headline.24\n“Every single right-wing person that ran won,” says Megan Walsh, who graduated from a local high school in 2017 and is a leader in the Southlake Anti-Racism Coalition, a community group whose advocacy inspired the adoption of the Cultural Competency Action Plan, which the winning candidates have pledged to eliminate. “We’re back to square one.”25\n\n\n\n\n\nPandemic Fallout\nMunicipal races that once turned on hyperlocal issues have been politicized and nationalized by right-wing culture warriors. But the long reach of the pandemic is at work here too. Debates over diversity plans and critical race theory are further dividing communities that were already split over the response to Covid.26 \nLindsay Love, the first Black school board member in Chandler, Ariz.  \n“It’s all morphing into the same thing,” says Lindsay Love, a school board member in Chandler, Ariz. The first Black board member elected there, Love has been a frequent target of conservative activists and received death threats for her position that schools should remain closed until Covid levels dropped. “You hear people comparing children being masked to slavery and referring to mask supporters as Marxists,” Love says.27\n“You have lost [the] trust of parents,” declared a furious father at a recent board meeting. “Mask mandates, forcing vaccines, canceling prom, limiting graduation, critical race theory. The list goes on. When is enough enough?”28\nThe school culture wars came early to this part of Arizona. After the district adopted a new program that included training teachers on race and equity issues, conservative parents revolted, charging that the equity training “marginalizes white people.” Tucker Carlson has devoted two segments to Chandler.29\n“Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 In the waning days of Trump’s term, the commission he convened to further the cause of “patriotic education” released its long-awaited 1776 Report—a rejoinder to The New York Times’ 1619 Project. Though widely panned as plagiarized propaganda, the report has also proved to be extraordinarily influential.9\n“It’s the idea of the past as a refuge,” says Noliwe Rooks, a professor at Cornell University and the author of Cutting School: Privatization, Segregation, and the End of Public Education. “The message is ‘Let’s get rid of the parts and the people in public education that we don’t like.’” She sees parallels between the current attacks on critical race theory and the collisions that resulted from the rise of Black studies in the late 1960s. “Students succeeded in forcing changes to curricula and on campus. But that little bit of progress they made around equity and innovative programs resulted in a backlash that destroyed all of that little bit of progress,” Rooks says.10 \n\n\n\n\n\n\nMore From Jennifer C. Berkshire\n\n\n\nHow to Fight the Right's Moral Panic Over Parental Rights\nMay 23, 2023 \n\n\nThe West Coast Think Tank Helping to Orchestrate DeSantis’s War on the Woke\nMarch 30, 2023 \n\n\nGood News Alert: Democrats Might Actually Flip the Michigan Legislature\nOctober 28, 2022 \n\nDivisive Concepts\nIn the past few months, GOP lawmakers in one state after another have introduced legislation aimed at keeping discussions of social justice out of the classroom. Bills prohibiting the teaching of critical race theory and other “divisive topics” have already passed in Utah, Texas, Oklahoma, and Tennessee and are under consideration in at least 15 other states. In Missouri, a proposed amendment sought to outlaw what its author describes as the “erroneous and hate-filled 1619 Project.”11\n“It said ‘1619 Project,’ but the aim was much broader. It would affect every part of history and literature,” says Jessica Piper, who teaches 11th-grade American literature in Maryville, Mo., a town of 12,000 on the Iowa border.12\nPiper would seem to be exactly the sort of teacher that legislators around the country are targeting. Her students read Clint Smith’s poem “How to Make a Cardboard Box Disappear in 10 Steps,” with its stark imagery of lives lost to police brutality, as part of a history lesson on racial violence. In 1931, a mob of more than 2,000 Maryville residents lynched a man named Raymond Gunn, burning him to death on top of the local schoolhouse. “There’s no historical marker, so the students didn’t know anything about it,” Piper says. This year, for the first time since she began using the poem in class, a parent complained.13 \n\n\n\n\nPiper recently decided that this will be her last year in the classroom. She’s running for the state legislature as a Democrat in a long-shot bid to unseat a Republican who, when he last faced an opponent, won by 80 points.14 \nRelated Articles \n\nFlorida’s Ron DeSantis Wants to Cancel Education About Systemic Racism\n\nJohn Nichols \n\n\nRepublican Cancel Culture: State Laws to Suppress Activism\n\nDavid Cole \n\nIn Iowa, as in Missouri, lawmakers have made the culture wars the centerpiece of their legislative agenda. So far this session, legislators have sought to ban transgender student athletes, implement an ideological test for state-funded faculty, and prohibit the teaching of “divisive concepts” at public schools and universities.15\n“They went with the Trump 1776 agenda,” says Nick Covington, a high school social studies teacher in Ankeny, a city north of Des Moines. “They’re carrying that banner, and it has a chilling effect on everything.”16 \nNick Covington, an Iowa high school social studies teacher.  \nThe bitter aftermath of the presidential election has also roiled the city. Two Ankeny residents were among the participants in the January 6 Capitol attack. And voting on a school funding question in March was disrupted for hours after police found a live pipe bomb at one of the facilities being used as a polling station.17\nCovington says the deep divisions outside his classroom are increasingly affecting what happens within it. This year he has been the target of repeated complaints from a small group of parents. The trouble started in January, when Covington streamed live news reports of the Capitol riot in his European history and economics classes. A parent called the school and claimed that Covington had directed students to his personal social media account, where he’d called Trump supporters Nazis, all of which Covington vehemently denies.18\nThis spring, after Covington showed a Vice News report on the “Unite the Right” rally in Charlottesville, Va., as part of an AP history unit on nationalism in Europe, parents contacted the school board and the superintendent and demanded that he be sanctioned. Though he’d taught the same lesson for three previous years without incident, Covington was ordered by school administrators to stop talking about current events.19\n“I’m basically waiting for the other shoe to drop,” he says.20 \nBLM blacklash: Nationwide protests and calls for a racial justice reckoning have some legislators and school districts on high alert. (Evelyn Hockstein / The Washington Post via Getty Images) \nDeep Divide\nThe pandemic’s profound disruption of public education was already upending state and local politics, as Republicans eagerly capitalized on parents’ frustration over shuttered classrooms. Now the culture wars are further exacerbating this tense climate.21\nJessica Piper’s small Missouri town recently saw the emergence of its first-ever PAC: Northern Missouri Citizens for Reflective Government. The group, which backed conservative candidates for local offices, put most of its energy into attacking an education professor who was running for a seat on the school board in Maryville. Ominous campaign ads depicted Jill Baker, a former schoolteacher, posed between cutouts of Joe Biden and Alexandria Ocasio-Cortez, spouting anti-Trump sentiments and stressing the importance of teaching social justice in elementary schools. She lost in a landslide.22\nIn Elmbrook, Wis., the Waukesha County Republican Party recently threw its weight behind James Gunsalus, a first-time school board candidate who claimed that Covid was no more serious than the flu. According to Gunsalus, Elmbrook’s schools, long among the highest-ranked in Wisconsin, were in free fall as teachers embraced “leftist indoctrination” over academic content, teaching students that “all white people are racist” and that “some people must be censored or canceled.” He lost by only 5 percent of the vote against an incumbent, coming within 600 votes of victory.23\nIn the North Texas community of Southlake, a fast-growing and rapidly diversifying city near Dallas, candidates for the school board, the city council, and mayor, backed by a PAC opposing the school district’s efforts to incorporate more cultural awareness into the curriculum, all captured around 70 percent of the vote. “Southlake Says No to Woke Education,” proclaimed a Wall Street Journal headline.24\n“Every single right-wing person that ran won,” says Megan Walsh, who graduated from a local high school in 2017 and is a leader in the Southlake Anti-Racism Coalition, a community group whose advocacy inspired the adoption of the Cultural Competency Action Plan, which the winning candidates have pledged to eliminate. “We’re back to square one.”25\n\n\n\n\n\nPandemic Fallout\nMunicipal races that once turned on hyperlocal issues have been politicized and nationalized by right-wing culture warriors. But the long reach of the pandemic is at work here too. Debates over diversity plans and critical race theory are further dividing communities that were already split over the response to Covid.26 \nLindsay Love, the first Black school board member in Chandler, Ariz.  \n“It’s all morphing into the same thing,” says Lindsay Love, a school board member in Chandler, Ariz. The first Black board member elected there, Love has been a frequent target of conservative activists and received death threats for her position that schools should remain closed until Covid levels dropped. “You hear people comparing children being masked to slavery and referring to mask supporters as Marxists,” Love says.27\n“You have lost [the] trust of parents,” declared a furious father at a recent board meeting. “Mask mandates, forcing vaccines, canceling prom, limiting graduation, critical race theory. The list goes on. When is enough enough?”28\nThe school culture wars came early to this part of Arizona. After the district adopted a new program that included training teachers on race and equity issues, conservative parents revolted, charging that the equity training “marginalizes white people.” Tucker Carlson has devoted two segments to Chandler.29\n“Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 “It’s the idea of the past as a refuge,” says Noliwe Rooks, a professor at Cornell University and the author of Cutting School: Privatization, Segregation, and the End of Public Education. “The message is ‘Let’s get rid of the parts and the people in public education that we don’t like.’” She sees parallels between the current attacks on critical race theory and the collisions that resulted from the rise of Black studies in the late 1960s. “Students succeeded in forcing changes to curricula and on campus. But that little bit of progress they made around equity and innovative programs resulted in a backlash that destroyed all of that little bit of progress,” Rooks says.10 \n\n\n\n\n\n\nMore From Jennifer C. Berkshire\n\n\n\nHow to Fight the Right's Moral Panic Over Parental Rights\nMay 23, 2023 \n\n\nThe West Coast Think Tank Helping to Orchestrate DeSantis’s War on the Woke\nMarch 30, 2023 \n\n\nGood News Alert: Democrats Might Actually Flip the Michigan Legislature\nOctober 28, 2022 \n\nDivisive Concepts\nIn the past few months, GOP lawmakers in one state after another have introduced legislation aimed at keeping discussions of social justice out of the classroom. Bills prohibiting the teaching of critical race theory and other “divisive topics” have already passed in Utah, Texas, Oklahoma, and Tennessee and are under consideration in at least 15 other states. In Missouri, a proposed amendment sought to outlaw what its author describes as the “erroneous and hate-filled 1619 Project.”11\n“It said ‘1619 Project,’ but the aim was much broader. It would affect every part of history and literature,” says Jessica Piper, who teaches 11th-grade American literature in Maryville, Mo., a town of 12,000 on the Iowa border.12\nPiper would seem to be exactly the sort of teacher that legislators around the country are targeting. Her students read Clint Smith’s poem “How to Make a Cardboard Box Disappear in 10 Steps,” with its stark imagery of lives lost to police brutality, as part of a history lesson on racial violence. In 1931, a mob of more than 2,000 Maryville residents lynched a man named Raymond Gunn, burning him to death on top of the local schoolhouse. “There’s no historical marker, so the students didn’t know anything about it,” Piper says. This year, for the first time since she began using the poem in class, a parent complained.13 \n\n\n\n\nPiper recently decided that this will be her last year in the classroom. She’s running for the state legislature as a Democrat in a long-shot bid to unseat a Republican who, when he last faced an opponent, won by 80 points.14 \nRelated Articles \n\nFlorida’s Ron DeSantis Wants to Cancel Education About Systemic Racism\n\nJohn Nichols \n\n\nRepublican Cancel Culture: State Laws to Suppress Activism\n\nDavid Cole \n\nIn Iowa, as in Missouri, lawmakers have made the culture wars the centerpiece of their legislative agenda. So far this session, legislators have sought to ban transgender student athletes, implement an ideological test for state-funded faculty, and prohibit the teaching of “divisive concepts” at public schools and universities.15\n“They went with the Trump 1776 agenda,” says Nick Covington, a high school social studies teacher in Ankeny, a city north of Des Moines. “They’re carrying that banner, and it has a chilling effect on everything.”16 \nNick Covington, an Iowa high school social studies teacher.  \nThe bitter aftermath of the presidential election has also roiled the city. Two Ankeny residents were among the participants in the January 6 Capitol attack. And voting on a school funding question in March was disrupted for hours after police found a live pipe bomb at one of the facilities being used as a polling station.17\nCovington says the deep divisions outside his classroom are increasingly affecting what happens within it. This year he has been the target of repeated complaints from a small group of parents. The trouble started in January, when Covington streamed live news reports of the Capitol riot in his European history and economics classes. A parent called the school and claimed that Covington had directed students to his personal social media account, where he’d called Trump supporters Nazis, all of which Covington vehemently denies.18\nThis spring, after Covington showed a Vice News report on the “Unite the Right” rally in Charlottesville, Va., as part of an AP history unit on nationalism in Europe, parents contacted the school board and the superintendent and demanded that he be sanctioned. Though he’d taught the same lesson for three previous years without incident, Covington was ordered by school administrators to stop talking about current events.19\n“I’m basically waiting for the other shoe to drop,” he says.20 \nBLM blacklash: Nationwide protests and calls for a racial justice reckoning have some legislators and school districts on high alert. (Evelyn Hockstein / The Washington Post via Getty Images) \nDeep Divide\nThe pandemic’s profound disruption of public education was already upending state and local politics, as Republicans eagerly capitalized on parents’ frustration over shuttered classrooms. Now the culture wars are further exacerbating this tense climate.21\nJessica Piper’s small Missouri town recently saw the emergence of its first-ever PAC: Northern Missouri Citizens for Reflective Government. The group, which backed conservative candidates for local offices, put most of its energy into attacking an education professor who was running for a seat on the school board in Maryville. Ominous campaign ads depicted Jill Baker, a former schoolteacher, posed between cutouts of Joe Biden and Alexandria Ocasio-Cortez, spouting anti-Trump sentiments and stressing the importance of teaching social justice in elementary schools. She lost in a landslide.22\nIn Elmbrook, Wis., the Waukesha County Republican Party recently threw its weight behind James Gunsalus, a first-time school board candidate who claimed that Covid was no more serious than the flu. According to Gunsalus, Elmbrook’s schools, long among the highest-ranked in Wisconsin, were in free fall as teachers embraced “leftist indoctrination” over academic content, teaching students that “all white people are racist” and that “some people must be censored or canceled.” He lost by only 5 percent of the vote against an incumbent, coming within 600 votes of victory.23\nIn the North Texas community of Southlake, a fast-growing and rapidly diversifying city near Dallas, candidates for the school board, the city council, and mayor, backed by a PAC opposing the school district’s efforts to incorporate more cultural awareness into the curriculum, all captured around 70 percent of the vote. “Southlake Says No to Woke Education,” proclaimed a Wall Street Journal headline.24\n“Every single right-wing person that ran won,” says Megan Walsh, who graduated from a local high school in 2017 and is a leader in the Southlake Anti-Racism Coalition, a community group whose advocacy inspired the adoption of the Cultural Competency Action Plan, which the winning candidates have pledged to eliminate. “We’re back to square one.”25\n\n\n\n\n\nPandemic Fallout\nMunicipal races that once turned on hyperlocal issues have been politicized and nationalized by right-wing culture warriors. But the long reach of the pandemic is at work here too. Debates over diversity plans and critical race theory are further dividing communities that were already split over the response to Covid.26 \nLindsay Love, the first Black school board member in Chandler, Ariz.  \n“It’s all morphing into the same thing,” says Lindsay Love, a school board member in Chandler, Ariz. The first Black board member elected there, Love has been a frequent target of conservative activists and received death threats for her position that schools should remain closed until Covid levels dropped. “You hear people comparing children being masked to slavery and referring to mask supporters as Marxists,” Love says.27\n“You have lost [the] trust of parents,” declared a furious father at a recent board meeting. “Mask mandates, forcing vaccines, canceling prom, limiting graduation, critical race theory. The list goes on. When is enough enough?”28\nThe school culture wars came early to this part of Arizona. After the district adopted a new program that included training teachers on race and equity issues, conservative parents revolted, charging that the equity training “marginalizes white people.” Tucker Carlson has devoted two segments to Chandler.29\n“Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 May 23, 2023 March 30, 2023 October 28, 2022 In the past few months, GOP lawmakers in one state after another have introduced legislation aimed at keeping discussions of social justice out of the classroom. Bills prohibiting the teaching of critical race theory and other “divisive topics” have already passed in Utah, Texas, Oklahoma, and Tennessee and are under consideration in at least 15 other states. In Missouri, a proposed amendment sought to outlaw what its author describes as the “erroneous and hate-filled 1619 Project.”11\n“It said ‘1619 Project,’ but the aim was much broader. It would affect every part of history and literature,” says Jessica Piper, who teaches 11th-grade American literature in Maryville, Mo., a town of 12,000 on the Iowa border.12\nPiper would seem to be exactly the sort of teacher that legislators around the country are targeting. Her students read Clint Smith’s poem “How to Make a Cardboard Box Disappear in 10 Steps,” with its stark imagery of lives lost to police brutality, as part of a history lesson on racial violence. In 1931, a mob of more than 2,000 Maryville residents lynched a man named Raymond Gunn, burning him to death on top of the local schoolhouse. “There’s no historical marker, so the students didn’t know anything about it,” Piper says. This year, for the first time since she began using the poem in class, a parent complained.13 \n\n\n\n\nPiper recently decided that this will be her last year in the classroom. She’s running for the state legislature as a Democrat in a long-shot bid to unseat a Republican who, when he last faced an opponent, won by 80 points.14 \nRelated Articles \n\nFlorida’s Ron DeSantis Wants to Cancel Education About Systemic Racism\n\nJohn Nichols \n\n\nRepublican Cancel Culture: State Laws to Suppress Activism\n\nDavid Cole \n\nIn Iowa, as in Missouri, lawmakers have made the culture wars the centerpiece of their legislative agenda. So far this session, legislators have sought to ban transgender student athletes, implement an ideological test for state-funded faculty, and prohibit the teaching of “divisive concepts” at public schools and universities.15\n“They went with the Trump 1776 agenda,” says Nick Covington, a high school social studies teacher in Ankeny, a city north of Des Moines. “They’re carrying that banner, and it has a chilling effect on everything.”16 \nNick Covington, an Iowa high school social studies teacher.  \nThe bitter aftermath of the presidential election has also roiled the city. Two Ankeny residents were among the participants in the January 6 Capitol attack. And voting on a school funding question in March was disrupted for hours after police found a live pipe bomb at one of the facilities being used as a polling station.17\nCovington says the deep divisions outside his classroom are increasingly affecting what happens within it. This year he has been the target of repeated complaints from a small group of parents. The trouble started in January, when Covington streamed live news reports of the Capitol riot in his European history and economics classes. A parent called the school and claimed that Covington had directed students to his personal social media account, where he’d called Trump supporters Nazis, all of which Covington vehemently denies.18\nThis spring, after Covington showed a Vice News report on the “Unite the Right” rally in Charlottesville, Va., as part of an AP history unit on nationalism in Europe, parents contacted the school board and the superintendent and demanded that he be sanctioned. Though he’d taught the same lesson for three previous years without incident, Covington was ordered by school administrators to stop talking about current events.19\n“I’m basically waiting for the other shoe to drop,” he says.20 \nBLM blacklash: Nationwide protests and calls for a racial justice reckoning have some legislators and school districts on high alert. (Evelyn Hockstein / The Washington Post via Getty Images) \nDeep Divide\nThe pandemic’s profound disruption of public education was already upending state and local politics, as Republicans eagerly capitalized on parents’ frustration over shuttered classrooms. Now the culture wars are further exacerbating this tense climate.21\nJessica Piper’s small Missouri town recently saw the emergence of its first-ever PAC: Northern Missouri Citizens for Reflective Government. The group, which backed conservative candidates for local offices, put most of its energy into attacking an education professor who was running for a seat on the school board in Maryville. Ominous campaign ads depicted Jill Baker, a former schoolteacher, posed between cutouts of Joe Biden and Alexandria Ocasio-Cortez, spouting anti-Trump sentiments and stressing the importance of teaching social justice in elementary schools. She lost in a landslide.22\nIn Elmbrook, Wis., the Waukesha County Republican Party recently threw its weight behind James Gunsalus, a first-time school board candidate who claimed that Covid was no more serious than the flu. According to Gunsalus, Elmbrook’s schools, long among the highest-ranked in Wisconsin, were in free fall as teachers embraced “leftist indoctrination” over academic content, teaching students that “all white people are racist” and that “some people must be censored or canceled.” He lost by only 5 percent of the vote against an incumbent, coming within 600 votes of victory.23\nIn the North Texas community of Southlake, a fast-growing and rapidly diversifying city near Dallas, candidates for the school board, the city council, and mayor, backed by a PAC opposing the school district’s efforts to incorporate more cultural awareness into the curriculum, all captured around 70 percent of the vote. “Southlake Says No to Woke Education,” proclaimed a Wall Street Journal headline.24\n“Every single right-wing person that ran won,” says Megan Walsh, who graduated from a local high school in 2017 and is a leader in the Southlake Anti-Racism Coalition, a community group whose advocacy inspired the adoption of the Cultural Competency Action Plan, which the winning candidates have pledged to eliminate. “We’re back to square one.”25\n\n\n\n\n\nPandemic Fallout\nMunicipal races that once turned on hyperlocal issues have been politicized and nationalized by right-wing culture warriors. But the long reach of the pandemic is at work here too. Debates over diversity plans and critical race theory are further dividing communities that were already split over the response to Covid.26 \nLindsay Love, the first Black school board member in Chandler, Ariz.  \n“It’s all morphing into the same thing,” says Lindsay Love, a school board member in Chandler, Ariz. The first Black board member elected there, Love has been a frequent target of conservative activists and received death threats for her position that schools should remain closed until Covid levels dropped. “You hear people comparing children being masked to slavery and referring to mask supporters as Marxists,” Love says.27\n“You have lost [the] trust of parents,” declared a furious father at a recent board meeting. “Mask mandates, forcing vaccines, canceling prom, limiting graduation, critical race theory. The list goes on. When is enough enough?”28\nThe school culture wars came early to this part of Arizona. After the district adopted a new program that included training teachers on race and equity issues, conservative parents revolted, charging that the equity training “marginalizes white people.” Tucker Carlson has devoted two segments to Chandler.29\n“Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 “It said ‘1619 Project,’ but the aim was much broader. It would affect every part of history and literature,” says Jessica Piper, who teaches 11th-grade American literature in Maryville, Mo., a town of 12,000 on the Iowa border.12\nPiper would seem to be exactly the sort of teacher that legislators around the country are targeting. Her students read Clint Smith’s poem “How to Make a Cardboard Box Disappear in 10 Steps,” with its stark imagery of lives lost to police brutality, as part of a history lesson on racial violence. In 1931, a mob of more than 2,000 Maryville residents lynched a man named Raymond Gunn, burning him to death on top of the local schoolhouse. “There’s no historical marker, so the students didn’t know anything about it,” Piper says. This year, for the first time since she began using the poem in class, a parent complained.13 \n\n\n\n\nPiper recently decided that this will be her last year in the classroom. She’s running for the state legislature as a Democrat in a long-shot bid to unseat a Republican who, when he last faced an opponent, won by 80 points.14 \nRelated Articles \n\nFlorida’s Ron DeSantis Wants to Cancel Education About Systemic Racism\n\nJohn Nichols \n\n\nRepublican Cancel Culture: State Laws to Suppress Activism\n\nDavid Cole \n\nIn Iowa, as in Missouri, lawmakers have made the culture wars the centerpiece of their legislative agenda. So far this session, legislators have sought to ban transgender student athletes, implement an ideological test for state-funded faculty, and prohibit the teaching of “divisive concepts” at public schools and universities.15\n“They went with the Trump 1776 agenda,” says Nick Covington, a high school social studies teacher in Ankeny, a city north of Des Moines. “They’re carrying that banner, and it has a chilling effect on everything.”16 \nNick Covington, an Iowa high school social studies teacher.  \nThe bitter aftermath of the presidential election has also roiled the city. Two Ankeny residents were among the participants in the January 6 Capitol attack. And voting on a school funding question in March was disrupted for hours after police found a live pipe bomb at one of the facilities being used as a polling station.17\nCovington says the deep divisions outside his classroom are increasingly affecting what happens within it. This year he has been the target of repeated complaints from a small group of parents. The trouble started in January, when Covington streamed live news reports of the Capitol riot in his European history and economics classes. A parent called the school and claimed that Covington had directed students to his personal social media account, where he’d called Trump supporters Nazis, all of which Covington vehemently denies.18\nThis spring, after Covington showed a Vice News report on the “Unite the Right” rally in Charlottesville, Va., as part of an AP history unit on nationalism in Europe, parents contacted the school board and the superintendent and demanded that he be sanctioned. Though he’d taught the same lesson for three previous years without incident, Covington was ordered by school administrators to stop talking about current events.19\n“I’m basically waiting for the other shoe to drop,” he says.20 \nBLM blacklash: Nationwide protests and calls for a racial justice reckoning have some legislators and school districts on high alert. (Evelyn Hockstein / The Washington Post via Getty Images) \nDeep Divide\nThe pandemic’s profound disruption of public education was already upending state and local politics, as Republicans eagerly capitalized on parents’ frustration over shuttered classrooms. Now the culture wars are further exacerbating this tense climate.21\nJessica Piper’s small Missouri town recently saw the emergence of its first-ever PAC: Northern Missouri Citizens for Reflective Government. The group, which backed conservative candidates for local offices, put most of its energy into attacking an education professor who was running for a seat on the school board in Maryville. Ominous campaign ads depicted Jill Baker, a former schoolteacher, posed between cutouts of Joe Biden and Alexandria Ocasio-Cortez, spouting anti-Trump sentiments and stressing the importance of teaching social justice in elementary schools. She lost in a landslide.22\nIn Elmbrook, Wis., the Waukesha County Republican Party recently threw its weight behind James Gunsalus, a first-time school board candidate who claimed that Covid was no more serious than the flu. According to Gunsalus, Elmbrook’s schools, long among the highest-ranked in Wisconsin, were in free fall as teachers embraced “leftist indoctrination” over academic content, teaching students that “all white people are racist” and that “some people must be censored or canceled.” He lost by only 5 percent of the vote against an incumbent, coming within 600 votes of victory.23\nIn the North Texas community of Southlake, a fast-growing and rapidly diversifying city near Dallas, candidates for the school board, the city council, and mayor, backed by a PAC opposing the school district’s efforts to incorporate more cultural awareness into the curriculum, all captured around 70 percent of the vote. “Southlake Says No to Woke Education,” proclaimed a Wall Street Journal headline.24\n“Every single right-wing person that ran won,” says Megan Walsh, who graduated from a local high school in 2017 and is a leader in the Southlake Anti-Racism Coalition, a community group whose advocacy inspired the adoption of the Cultural Competency Action Plan, which the winning candidates have pledged to eliminate. “We’re back to square one.”25\n\n\n\n\n\nPandemic Fallout\nMunicipal races that once turned on hyperlocal issues have been politicized and nationalized by right-wing culture warriors. But the long reach of the pandemic is at work here too. Debates over diversity plans and critical race theory are further dividing communities that were already split over the response to Covid.26 \nLindsay Love, the first Black school board member in Chandler, Ariz.  \n“It’s all morphing into the same thing,” says Lindsay Love, a school board member in Chandler, Ariz. The first Black board member elected there, Love has been a frequent target of conservative activists and received death threats for her position that schools should remain closed until Covid levels dropped. “You hear people comparing children being masked to slavery and referring to mask supporters as Marxists,” Love says.27\n“You have lost [the] trust of parents,” declared a furious father at a recent board meeting. “Mask mandates, forcing vaccines, canceling prom, limiting graduation, critical race theory. The list goes on. When is enough enough?”28\nThe school culture wars came early to this part of Arizona. After the district adopted a new program that included training teachers on race and equity issues, conservative parents revolted, charging that the equity training “marginalizes white people.” Tucker Carlson has devoted two segments to Chandler.29\n“Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 Piper would seem to be exactly the sort of teacher that legislators around the country are targeting. Her students read Clint Smith’s poem “How to Make a Cardboard Box Disappear in 10 Steps,” with its stark imagery of lives lost to police brutality, as part of a history lesson on racial violence. In 1931, a mob of more than 2,000 Maryville residents lynched a man named Raymond Gunn, burning him to death on top of the local schoolhouse. “There’s no historical marker, so the students didn’t know anything about it,” Piper says. This year, for the first time since she began using the poem in class, a parent complained.13 \n\n\n\n\nPiper recently decided that this will be her last year in the classroom. She’s running for the state legislature as a Democrat in a long-shot bid to unseat a Republican who, when he last faced an opponent, won by 80 points.14 \nRelated Articles \n\nFlorida’s Ron DeSantis Wants to Cancel Education About Systemic Racism\n\nJohn Nichols \n\n\nRepublican Cancel Culture: State Laws to Suppress Activism\n\nDavid Cole \n\nIn Iowa, as in Missouri, lawmakers have made the culture wars the centerpiece of their legislative agenda. So far this session, legislators have sought to ban transgender student athletes, implement an ideological test for state-funded faculty, and prohibit the teaching of “divisive concepts” at public schools and universities.15\n“They went with the Trump 1776 agenda,” says Nick Covington, a high school social studies teacher in Ankeny, a city north of Des Moines. “They’re carrying that banner, and it has a chilling effect on everything.”16 \nNick Covington, an Iowa high school social studies teacher.  \nThe bitter aftermath of the presidential election has also roiled the city. Two Ankeny residents were among the participants in the January 6 Capitol attack. And voting on a school funding question in March was disrupted for hours after police found a live pipe bomb at one of the facilities being used as a polling station.17\nCovington says the deep divisions outside his classroom are increasingly affecting what happens within it. This year he has been the target of repeated complaints from a small group of parents. The trouble started in January, when Covington streamed live news reports of the Capitol riot in his European history and economics classes. A parent called the school and claimed that Covington had directed students to his personal social media account, where he’d called Trump supporters Nazis, all of which Covington vehemently denies.18\nThis spring, after Covington showed a Vice News report on the “Unite the Right” rally in Charlottesville, Va., as part of an AP history unit on nationalism in Europe, parents contacted the school board and the superintendent and demanded that he be sanctioned. Though he’d taught the same lesson for three previous years without incident, Covington was ordered by school administrators to stop talking about current events.19\n“I’m basically waiting for the other shoe to drop,” he says.20 \nBLM blacklash: Nationwide protests and calls for a racial justice reckoning have some legislators and school districts on high alert. (Evelyn Hockstein / The Washington Post via Getty Images) \nDeep Divide\nThe pandemic’s profound disruption of public education was already upending state and local politics, as Republicans eagerly capitalized on parents’ frustration over shuttered classrooms. Now the culture wars are further exacerbating this tense climate.21\nJessica Piper’s small Missouri town recently saw the emergence of its first-ever PAC: Northern Missouri Citizens for Reflective Government. The group, which backed conservative candidates for local offices, put most of its energy into attacking an education professor who was running for a seat on the school board in Maryville. Ominous campaign ads depicted Jill Baker, a former schoolteacher, posed between cutouts of Joe Biden and Alexandria Ocasio-Cortez, spouting anti-Trump sentiments and stressing the importance of teaching social justice in elementary schools. She lost in a landslide.22\nIn Elmbrook, Wis., the Waukesha County Republican Party recently threw its weight behind James Gunsalus, a first-time school board candidate who claimed that Covid was no more serious than the flu. According to Gunsalus, Elmbrook’s schools, long among the highest-ranked in Wisconsin, were in free fall as teachers embraced “leftist indoctrination” over academic content, teaching students that “all white people are racist” and that “some people must be censored or canceled.” He lost by only 5 percent of the vote against an incumbent, coming within 600 votes of victory.23\nIn the North Texas community of Southlake, a fast-growing and rapidly diversifying city near Dallas, candidates for the school board, the city council, and mayor, backed by a PAC opposing the school district’s efforts to incorporate more cultural awareness into the curriculum, all captured around 70 percent of the vote. “Southlake Says No to Woke Education,” proclaimed a Wall Street Journal headline.24\n“Every single right-wing person that ran won,” says Megan Walsh, who graduated from a local high school in 2017 and is a leader in the Southlake Anti-Racism Coalition, a community group whose advocacy inspired the adoption of the Cultural Competency Action Plan, which the winning candidates have pledged to eliminate. “We’re back to square one.”25\n\n\n\n\n\nPandemic Fallout\nMunicipal races that once turned on hyperlocal issues have been politicized and nationalized by right-wing culture warriors. But the long reach of the pandemic is at work here too. Debates over diversity plans and critical race theory are further dividing communities that were already split over the response to Covid.26 \nLindsay Love, the first Black school board member in Chandler, Ariz.  \n“It’s all morphing into the same thing,” says Lindsay Love, a school board member in Chandler, Ariz. The first Black board member elected there, Love has been a frequent target of conservative activists and received death threats for her position that schools should remain closed until Covid levels dropped. “You hear people comparing children being masked to slavery and referring to mask supporters as Marxists,” Love says.27\n“You have lost [the] trust of parents,” declared a furious father at a recent board meeting. “Mask mandates, forcing vaccines, canceling prom, limiting graduation, critical race theory. The list goes on. When is enough enough?”28\nThe school culture wars came early to this part of Arizona. After the district adopted a new program that included training teachers on race and equity issues, conservative parents revolted, charging that the equity training “marginalizes white people.” Tucker Carlson has devoted two segments to Chandler.29\n“Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 Piper recently decided that this will be her last year in the classroom. She’s running for the state legislature as a Democrat in a long-shot bid to unseat a Republican who, when he last faced an opponent, won by 80 points.14 \nRelated Articles \n\nFlorida’s Ron DeSantis Wants to Cancel Education About Systemic Racism\n\nJohn Nichols \n\n\nRepublican Cancel Culture: State Laws to Suppress Activism\n\nDavid Cole \n\nIn Iowa, as in Missouri, lawmakers have made the culture wars the centerpiece of their legislative agenda. So far this session, legislators have sought to ban transgender student athletes, implement an ideological test for state-funded faculty, and prohibit the teaching of “divisive concepts” at public schools and universities.15\n“They went with the Trump 1776 agenda,” says Nick Covington, a high school social studies teacher in Ankeny, a city north of Des Moines. “They’re carrying that banner, and it has a chilling effect on everything.”16 \nNick Covington, an Iowa high school social studies teacher.  \nThe bitter aftermath of the presidential election has also roiled the city. Two Ankeny residents were among the participants in the January 6 Capitol attack. And voting on a school funding question in March was disrupted for hours after police found a live pipe bomb at one of the facilities being used as a polling station.17\nCovington says the deep divisions outside his classroom are increasingly affecting what happens within it. This year he has been the target of repeated complaints from a small group of parents. The trouble started in January, when Covington streamed live news reports of the Capitol riot in his European history and economics classes. A parent called the school and claimed that Covington had directed students to his personal social media account, where he’d called Trump supporters Nazis, all of which Covington vehemently denies.18\nThis spring, after Covington showed a Vice News report on the “Unite the Right” rally in Charlottesville, Va., as part of an AP history unit on nationalism in Europe, parents contacted the school board and the superintendent and demanded that he be sanctioned. Though he’d taught the same lesson for three previous years without incident, Covington was ordered by school administrators to stop talking about current events.19\n“I’m basically waiting for the other shoe to drop,” he says.20 \nBLM blacklash: Nationwide protests and calls for a racial justice reckoning have some legislators and school districts on high alert. (Evelyn Hockstein / The Washington Post via Getty Images) \nDeep Divide\nThe pandemic’s profound disruption of public education was already upending state and local politics, as Republicans eagerly capitalized on parents’ frustration over shuttered classrooms. Now the culture wars are further exacerbating this tense climate.21\nJessica Piper’s small Missouri town recently saw the emergence of its first-ever PAC: Northern Missouri Citizens for Reflective Government. The group, which backed conservative candidates for local offices, put most of its energy into attacking an education professor who was running for a seat on the school board in Maryville. Ominous campaign ads depicted Jill Baker, a former schoolteacher, posed between cutouts of Joe Biden and Alexandria Ocasio-Cortez, spouting anti-Trump sentiments and stressing the importance of teaching social justice in elementary schools. She lost in a landslide.22\nIn Elmbrook, Wis., the Waukesha County Republican Party recently threw its weight behind James Gunsalus, a first-time school board candidate who claimed that Covid was no more serious than the flu. According to Gunsalus, Elmbrook’s schools, long among the highest-ranked in Wisconsin, were in free fall as teachers embraced “leftist indoctrination” over academic content, teaching students that “all white people are racist” and that “some people must be censored or canceled.” He lost by only 5 percent of the vote against an incumbent, coming within 600 votes of victory.23\nIn the North Texas community of Southlake, a fast-growing and rapidly diversifying city near Dallas, candidates for the school board, the city council, and mayor, backed by a PAC opposing the school district’s efforts to incorporate more cultural awareness into the curriculum, all captured around 70 percent of the vote. “Southlake Says No to Woke Education,” proclaimed a Wall Street Journal headline.24\n“Every single right-wing person that ran won,” says Megan Walsh, who graduated from a local high school in 2017 and is a leader in the Southlake Anti-Racism Coalition, a community group whose advocacy inspired the adoption of the Cultural Competency Action Plan, which the winning candidates have pledged to eliminate. “We’re back to square one.”25\n\n\n\n\n\nPandemic Fallout\nMunicipal races that once turned on hyperlocal issues have been politicized and nationalized by right-wing culture warriors. But the long reach of the pandemic is at work here too. Debates over diversity plans and critical race theory are further dividing communities that were already split over the response to Covid.26 \nLindsay Love, the first Black school board member in Chandler, Ariz.  \n“It’s all morphing into the same thing,” says Lindsay Love, a school board member in Chandler, Ariz. The first Black board member elected there, Love has been a frequent target of conservative activists and received death threats for her position that schools should remain closed until Covid levels dropped. “You hear people comparing children being masked to slavery and referring to mask supporters as Marxists,” Love says.27\n“You have lost [the] trust of parents,” declared a furious father at a recent board meeting. “Mask mandates, forcing vaccines, canceling prom, limiting graduation, critical race theory. The list goes on. When is enough enough?”28\nThe school culture wars came early to this part of Arizona. After the district adopted a new program that included training teachers on race and equity issues, conservative parents revolted, charging that the equity training “marginalizes white people.” Tucker Carlson has devoted two segments to Chandler.29\n“Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 John Nichols David Cole In Iowa, as in Missouri, lawmakers have made the culture wars the centerpiece of their legislative agenda. So far this session, legislators have sought to ban transgender student athletes, implement an ideological test for state-funded faculty, and prohibit the teaching of “divisive concepts” at public schools and universities.15\n“They went with the Trump 1776 agenda,” says Nick Covington, a high school social studies teacher in Ankeny, a city north of Des Moines. “They’re carrying that banner, and it has a chilling effect on everything.”16 \nNick Covington, an Iowa high school social studies teacher.  \nThe bitter aftermath of the presidential election has also roiled the city. Two Ankeny residents were among the participants in the January 6 Capitol attack. And voting on a school funding question in March was disrupted for hours after police found a live pipe bomb at one of the facilities being used as a polling station.17\nCovington says the deep divisions outside his classroom are increasingly affecting what happens within it. This year he has been the target of repeated complaints from a small group of parents. The trouble started in January, when Covington streamed live news reports of the Capitol riot in his European history and economics classes. A parent called the school and claimed that Covington had directed students to his personal social media account, where he’d called Trump supporters Nazis, all of which Covington vehemently denies.18\nThis spring, after Covington showed a Vice News report on the “Unite the Right” rally in Charlottesville, Va., as part of an AP history unit on nationalism in Europe, parents contacted the school board and the superintendent and demanded that he be sanctioned. Though he’d taught the same lesson for three previous years without incident, Covington was ordered by school administrators to stop talking about current events.19\n“I’m basically waiting for the other shoe to drop,” he says.20 \nBLM blacklash: Nationwide protests and calls for a racial justice reckoning have some legislators and school districts on high alert. (Evelyn Hockstein / The Washington Post via Getty Images) \nDeep Divide\nThe pandemic’s profound disruption of public education was already upending state and local politics, as Republicans eagerly capitalized on parents’ frustration over shuttered classrooms. Now the culture wars are further exacerbating this tense climate.21\nJessica Piper’s small Missouri town recently saw the emergence of its first-ever PAC: Northern Missouri Citizens for Reflective Government. The group, which backed conservative candidates for local offices, put most of its energy into attacking an education professor who was running for a seat on the school board in Maryville. Ominous campaign ads depicted Jill Baker, a former schoolteacher, posed between cutouts of Joe Biden and Alexandria Ocasio-Cortez, spouting anti-Trump sentiments and stressing the importance of teaching social justice in elementary schools. She lost in a landslide.22\nIn Elmbrook, Wis., the Waukesha County Republican Party recently threw its weight behind James Gunsalus, a first-time school board candidate who claimed that Covid was no more serious than the flu. According to Gunsalus, Elmbrook’s schools, long among the highest-ranked in Wisconsin, were in free fall as teachers embraced “leftist indoctrination” over academic content, teaching students that “all white people are racist” and that “some people must be censored or canceled.” He lost by only 5 percent of the vote against an incumbent, coming within 600 votes of victory.23\nIn the North Texas community of Southlake, a fast-growing and rapidly diversifying city near Dallas, candidates for the school board, the city council, and mayor, backed by a PAC opposing the school district’s efforts to incorporate more cultural awareness into the curriculum, all captured around 70 percent of the vote. “Southlake Says No to Woke Education,” proclaimed a Wall Street Journal headline.24\n“Every single right-wing person that ran won,” says Megan Walsh, who graduated from a local high school in 2017 and is a leader in the Southlake Anti-Racism Coalition, a community group whose advocacy inspired the adoption of the Cultural Competency Action Plan, which the winning candidates have pledged to eliminate. “We’re back to square one.”25\n\n\n\n\n\nPandemic Fallout\nMunicipal races that once turned on hyperlocal issues have been politicized and nationalized by right-wing culture warriors. But the long reach of the pandemic is at work here too. Debates over diversity plans and critical race theory are further dividing communities that were already split over the response to Covid.26 \nLindsay Love, the first Black school board member in Chandler, Ariz.  \n“It’s all morphing into the same thing,” says Lindsay Love, a school board member in Chandler, Ariz. The first Black board member elected there, Love has been a frequent target of conservative activists and received death threats for her position that schools should remain closed until Covid levels dropped. “You hear people comparing children being masked to slavery and referring to mask supporters as Marxists,” Love says.27\n“You have lost [the] trust of parents,” declared a furious father at a recent board meeting. “Mask mandates, forcing vaccines, canceling prom, limiting graduation, critical race theory. The list goes on. When is enough enough?”28\nThe school culture wars came early to this part of Arizona. After the district adopted a new program that included training teachers on race and equity issues, conservative parents revolted, charging that the equity training “marginalizes white people.” Tucker Carlson has devoted two segments to Chandler.29\n“Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 “They went with the Trump 1776 agenda,” says Nick Covington, a high school social studies teacher in Ankeny, a city north of Des Moines. “They’re carrying that banner, and it has a chilling effect on everything.”16 \nNick Covington, an Iowa high school social studies teacher.  \nThe bitter aftermath of the presidential election has also roiled the city. Two Ankeny residents were among the participants in the January 6 Capitol attack. And voting on a school funding question in March was disrupted for hours after police found a live pipe bomb at one of the facilities being used as a polling station.17\nCovington says the deep divisions outside his classroom are increasingly affecting what happens within it. This year he has been the target of repeated complaints from a small group of parents. The trouble started in January, when Covington streamed live news reports of the Capitol riot in his European history and economics classes. A parent called the school and claimed that Covington had directed students to his personal social media account, where he’d called Trump supporters Nazis, all of which Covington vehemently denies.18\nThis spring, after Covington showed a Vice News report on the “Unite the Right” rally in Charlottesville, Va., as part of an AP history unit on nationalism in Europe, parents contacted the school board and the superintendent and demanded that he be sanctioned. Though he’d taught the same lesson for three previous years without incident, Covington was ordered by school administrators to stop talking about current events.19\n“I’m basically waiting for the other shoe to drop,” he says.20 \nBLM blacklash: Nationwide protests and calls for a racial justice reckoning have some legislators and school districts on high alert. (Evelyn Hockstein / The Washington Post via Getty Images) \nDeep Divide\nThe pandemic’s profound disruption of public education was already upending state and local politics, as Republicans eagerly capitalized on parents’ frustration over shuttered classrooms. Now the culture wars are further exacerbating this tense climate.21\nJessica Piper’s small Missouri town recently saw the emergence of its first-ever PAC: Northern Missouri Citizens for Reflective Government. The group, which backed conservative candidates for local offices, put most of its energy into attacking an education professor who was running for a seat on the school board in Maryville. Ominous campaign ads depicted Jill Baker, a former schoolteacher, posed between cutouts of Joe Biden and Alexandria Ocasio-Cortez, spouting anti-Trump sentiments and stressing the importance of teaching social justice in elementary schools. She lost in a landslide.22\nIn Elmbrook, Wis., the Waukesha County Republican Party recently threw its weight behind James Gunsalus, a first-time school board candidate who claimed that Covid was no more serious than the flu. According to Gunsalus, Elmbrook’s schools, long among the highest-ranked in Wisconsin, were in free fall as teachers embraced “leftist indoctrination” over academic content, teaching students that “all white people are racist” and that “some people must be censored or canceled.” He lost by only 5 percent of the vote against an incumbent, coming within 600 votes of victory.23\nIn the North Texas community of Southlake, a fast-growing and rapidly diversifying city near Dallas, candidates for the school board, the city council, and mayor, backed by a PAC opposing the school district’s efforts to incorporate more cultural awareness into the curriculum, all captured around 70 percent of the vote. “Southlake Says No to Woke Education,” proclaimed a Wall Street Journal headline.24\n“Every single right-wing person that ran won,” says Megan Walsh, who graduated from a local high school in 2017 and is a leader in the Southlake Anti-Racism Coalition, a community group whose advocacy inspired the adoption of the Cultural Competency Action Plan, which the winning candidates have pledged to eliminate. “We’re back to square one.”25\n\n\n\n\n\nPandemic Fallout\nMunicipal races that once turned on hyperlocal issues have been politicized and nationalized by right-wing culture warriors. But the long reach of the pandemic is at work here too. Debates over diversity plans and critical race theory are further dividing communities that were already split over the response to Covid.26 \nLindsay Love, the first Black school board member in Chandler, Ariz.  \n“It’s all morphing into the same thing,” says Lindsay Love, a school board member in Chandler, Ariz. The first Black board member elected there, Love has been a frequent target of conservative activists and received death threats for her position that schools should remain closed until Covid levels dropped. “You hear people comparing children being masked to slavery and referring to mask supporters as Marxists,” Love says.27\n“You have lost [the] trust of parents,” declared a furious father at a recent board meeting. “Mask mandates, forcing vaccines, canceling prom, limiting graduation, critical race theory. The list goes on. When is enough enough?”28\nThe school culture wars came early to this part of Arizona. After the district adopted a new program that included training teachers on race and equity issues, conservative parents revolted, charging that the equity training “marginalizes white people.” Tucker Carlson has devoted two segments to Chandler.29\n“Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 Nick Covington, an Iowa high school social studies teacher. The bitter aftermath of the presidential election has also roiled the city. Two Ankeny residents were among the participants in the January 6 Capitol attack. And voting on a school funding question in March was disrupted for hours after police found a live pipe bomb at one of the facilities being used as a polling station.17\nCovington says the deep divisions outside his classroom are increasingly affecting what happens within it. This year he has been the target of repeated complaints from a small group of parents. The trouble started in January, when Covington streamed live news reports of the Capitol riot in his European history and economics classes. A parent called the school and claimed that Covington had directed students to his personal social media account, where he’d called Trump supporters Nazis, all of which Covington vehemently denies.18\nThis spring, after Covington showed a Vice News report on the “Unite the Right” rally in Charlottesville, Va., as part of an AP history unit on nationalism in Europe, parents contacted the school board and the superintendent and demanded that he be sanctioned. Though he’d taught the same lesson for three previous years without incident, Covington was ordered by school administrators to stop talking about current events.19\n“I’m basically waiting for the other shoe to drop,” he says.20 \nBLM blacklash: Nationwide protests and calls for a racial justice reckoning have some legislators and school districts on high alert. (Evelyn Hockstein / The Washington Post via Getty Images) \nDeep Divide\nThe pandemic’s profound disruption of public education was already upending state and local politics, as Republicans eagerly capitalized on parents’ frustration over shuttered classrooms. Now the culture wars are further exacerbating this tense climate.21\nJessica Piper’s small Missouri town recently saw the emergence of its first-ever PAC: Northern Missouri Citizens for Reflective Government. The group, which backed conservative candidates for local offices, put most of its energy into attacking an education professor who was running for a seat on the school board in Maryville. Ominous campaign ads depicted Jill Baker, a former schoolteacher, posed between cutouts of Joe Biden and Alexandria Ocasio-Cortez, spouting anti-Trump sentiments and stressing the importance of teaching social justice in elementary schools. She lost in a landslide.22\nIn Elmbrook, Wis., the Waukesha County Republican Party recently threw its weight behind James Gunsalus, a first-time school board candidate who claimed that Covid was no more serious than the flu. According to Gunsalus, Elmbrook’s schools, long among the highest-ranked in Wisconsin, were in free fall as teachers embraced “leftist indoctrination” over academic content, teaching students that “all white people are racist” and that “some people must be censored or canceled.” He lost by only 5 percent of the vote against an incumbent, coming within 600 votes of victory.23\nIn the North Texas community of Southlake, a fast-growing and rapidly diversifying city near Dallas, candidates for the school board, the city council, and mayor, backed by a PAC opposing the school district’s efforts to incorporate more cultural awareness into the curriculum, all captured around 70 percent of the vote. “Southlake Says No to Woke Education,” proclaimed a Wall Street Journal headline.24\n“Every single right-wing person that ran won,” says Megan Walsh, who graduated from a local high school in 2017 and is a leader in the Southlake Anti-Racism Coalition, a community group whose advocacy inspired the adoption of the Cultural Competency Action Plan, which the winning candidates have pledged to eliminate. “We’re back to square one.”25\n\n\n\n\n\nPandemic Fallout\nMunicipal races that once turned on hyperlocal issues have been politicized and nationalized by right-wing culture warriors. But the long reach of the pandemic is at work here too. Debates over diversity plans and critical race theory are further dividing communities that were already split over the response to Covid.26 \nLindsay Love, the first Black school board member in Chandler, Ariz.  \n“It’s all morphing into the same thing,” says Lindsay Love, a school board member in Chandler, Ariz. The first Black board member elected there, Love has been a frequent target of conservative activists and received death threats for her position that schools should remain closed until Covid levels dropped. “You hear people comparing children being masked to slavery and referring to mask supporters as Marxists,” Love says.27\n“You have lost [the] trust of parents,” declared a furious father at a recent board meeting. “Mask mandates, forcing vaccines, canceling prom, limiting graduation, critical race theory. The list goes on. When is enough enough?”28\nThe school culture wars came early to this part of Arizona. After the district adopted a new program that included training teachers on race and equity issues, conservative parents revolted, charging that the equity training “marginalizes white people.” Tucker Carlson has devoted two segments to Chandler.29\n“Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 Covington says the deep divisions outside his classroom are increasingly affecting what happens within it. This year he has been the target of repeated complaints from a small group of parents. The trouble started in January, when Covington streamed live news reports of the Capitol riot in his European history and economics classes. A parent called the school and claimed that Covington had directed students to his personal social media account, where he’d called Trump supporters Nazis, all of which Covington vehemently denies.18\nThis spring, after Covington showed a Vice News report on the “Unite the Right” rally in Charlottesville, Va., as part of an AP history unit on nationalism in Europe, parents contacted the school board and the superintendent and demanded that he be sanctioned. Though he’d taught the same lesson for three previous years without incident, Covington was ordered by school administrators to stop talking about current events.19\n“I’m basically waiting for the other shoe to drop,” he says.20 \nBLM blacklash: Nationwide protests and calls for a racial justice reckoning have some legislators and school districts on high alert. (Evelyn Hockstein / The Washington Post via Getty Images) \nDeep Divide\nThe pandemic’s profound disruption of public education was already upending state and local politics, as Republicans eagerly capitalized on parents’ frustration over shuttered classrooms. Now the culture wars are further exacerbating this tense climate.21\nJessica Piper’s small Missouri town recently saw the emergence of its first-ever PAC: Northern Missouri Citizens for Reflective Government. The group, which backed conservative candidates for local offices, put most of its energy into attacking an education professor who was running for a seat on the school board in Maryville. Ominous campaign ads depicted Jill Baker, a former schoolteacher, posed between cutouts of Joe Biden and Alexandria Ocasio-Cortez, spouting anti-Trump sentiments and stressing the importance of teaching social justice in elementary schools. She lost in a landslide.22\nIn Elmbrook, Wis., the Waukesha County Republican Party recently threw its weight behind James Gunsalus, a first-time school board candidate who claimed that Covid was no more serious than the flu. According to Gunsalus, Elmbrook’s schools, long among the highest-ranked in Wisconsin, were in free fall as teachers embraced “leftist indoctrination” over academic content, teaching students that “all white people are racist” and that “some people must be censored or canceled.” He lost by only 5 percent of the vote against an incumbent, coming within 600 votes of victory.23\nIn the North Texas community of Southlake, a fast-growing and rapidly diversifying city near Dallas, candidates for the school board, the city council, and mayor, backed by a PAC opposing the school district’s efforts to incorporate more cultural awareness into the curriculum, all captured around 70 percent of the vote. “Southlake Says No to Woke Education,” proclaimed a Wall Street Journal headline.24\n“Every single right-wing person that ran won,” says Megan Walsh, who graduated from a local high school in 2017 and is a leader in the Southlake Anti-Racism Coalition, a community group whose advocacy inspired the adoption of the Cultural Competency Action Plan, which the winning candidates have pledged to eliminate. “We’re back to square one.”25\n\n\n\n\n\nPandemic Fallout\nMunicipal races that once turned on hyperlocal issues have been politicized and nationalized by right-wing culture warriors. But the long reach of the pandemic is at work here too. Debates over diversity plans and critical race theory are further dividing communities that were already split over the response to Covid.26 \nLindsay Love, the first Black school board member in Chandler, Ariz.  \n“It’s all morphing into the same thing,” says Lindsay Love, a school board member in Chandler, Ariz. The first Black board member elected there, Love has been a frequent target of conservative activists and received death threats for her position that schools should remain closed until Covid levels dropped. “You hear people comparing children being masked to slavery and referring to mask supporters as Marxists,” Love says.27\n“You have lost [the] trust of parents,” declared a furious father at a recent board meeting. “Mask mandates, forcing vaccines, canceling prom, limiting graduation, critical race theory. The list goes on. When is enough enough?”28\nThe school culture wars came early to this part of Arizona. After the district adopted a new program that included training teachers on race and equity issues, conservative parents revolted, charging that the equity training “marginalizes white people.” Tucker Carlson has devoted two segments to Chandler.29\n“Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 This spring, after Covington showed a Vice News report on the “Unite the Right” rally in Charlottesville, Va., as part of an AP history unit on nationalism in Europe, parents contacted the school board and the superintendent and demanded that he be sanctioned. Though he’d taught the same lesson for three previous years without incident, Covington was ordered by school administrators to stop talking about current events.19\n“I’m basically waiting for the other shoe to drop,” he says.20 \nBLM blacklash: Nationwide protests and calls for a racial justice reckoning have some legislators and school districts on high alert. (Evelyn Hockstein / The Washington Post via Getty Images) \nDeep Divide\nThe pandemic’s profound disruption of public education was already upending state and local politics, as Republicans eagerly capitalized on parents’ frustration over shuttered classrooms. Now the culture wars are further exacerbating this tense climate.21\nJessica Piper’s small Missouri town recently saw the emergence of its first-ever PAC: Northern Missouri Citizens for Reflective Government. The group, which backed conservative candidates for local offices, put most of its energy into attacking an education professor who was running for a seat on the school board in Maryville. Ominous campaign ads depicted Jill Baker, a former schoolteacher, posed between cutouts of Joe Biden and Alexandria Ocasio-Cortez, spouting anti-Trump sentiments and stressing the importance of teaching social justice in elementary schools. She lost in a landslide.22\nIn Elmbrook, Wis., the Waukesha County Republican Party recently threw its weight behind James Gunsalus, a first-time school board candidate who claimed that Covid was no more serious than the flu. According to Gunsalus, Elmbrook’s schools, long among the highest-ranked in Wisconsin, were in free fall as teachers embraced “leftist indoctrination” over academic content, teaching students that “all white people are racist” and that “some people must be censored or canceled.” He lost by only 5 percent of the vote against an incumbent, coming within 600 votes of victory.23\nIn the North Texas community of Southlake, a fast-growing and rapidly diversifying city near Dallas, candidates for the school board, the city council, and mayor, backed by a PAC opposing the school district’s efforts to incorporate more cultural awareness into the curriculum, all captured around 70 percent of the vote. “Southlake Says No to Woke Education,” proclaimed a Wall Street Journal headline.24\n“Every single right-wing person that ran won,” says Megan Walsh, who graduated from a local high school in 2017 and is a leader in the Southlake Anti-Racism Coalition, a community group whose advocacy inspired the adoption of the Cultural Competency Action Plan, which the winning candidates have pledged to eliminate. “We’re back to square one.”25\n\n\n\n\n\nPandemic Fallout\nMunicipal races that once turned on hyperlocal issues have been politicized and nationalized by right-wing culture warriors. But the long reach of the pandemic is at work here too. Debates over diversity plans and critical race theory are further dividing communities that were already split over the response to Covid.26 \nLindsay Love, the first Black school board member in Chandler, Ariz.  \n“It’s all morphing into the same thing,” says Lindsay Love, a school board member in Chandler, Ariz. The first Black board member elected there, Love has been a frequent target of conservative activists and received death threats for her position that schools should remain closed until Covid levels dropped. “You hear people comparing children being masked to slavery and referring to mask supporters as Marxists,” Love says.27\n“You have lost [the] trust of parents,” declared a furious father at a recent board meeting. “Mask mandates, forcing vaccines, canceling prom, limiting graduation, critical race theory. The list goes on. When is enough enough?”28\nThe school culture wars came early to this part of Arizona. After the district adopted a new program that included training teachers on race and equity issues, conservative parents revolted, charging that the equity training “marginalizes white people.” Tucker Carlson has devoted two segments to Chandler.29\n“Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 “I’m basically waiting for the other shoe to drop,” he says.20 \nBLM blacklash: Nationwide protests and calls for a racial justice reckoning have some legislators and school districts on high alert. (Evelyn Hockstein / The Washington Post via Getty Images) \nDeep Divide\nThe pandemic’s profound disruption of public education was already upending state and local politics, as Republicans eagerly capitalized on parents’ frustration over shuttered classrooms. Now the culture wars are further exacerbating this tense climate.21\nJessica Piper’s small Missouri town recently saw the emergence of its first-ever PAC: Northern Missouri Citizens for Reflective Government. The group, which backed conservative candidates for local offices, put most of its energy into attacking an education professor who was running for a seat on the school board in Maryville. Ominous campaign ads depicted Jill Baker, a former schoolteacher, posed between cutouts of Joe Biden and Alexandria Ocasio-Cortez, spouting anti-Trump sentiments and stressing the importance of teaching social justice in elementary schools. She lost in a landslide.22\nIn Elmbrook, Wis., the Waukesha County Republican Party recently threw its weight behind James Gunsalus, a first-time school board candidate who claimed that Covid was no more serious than the flu. According to Gunsalus, Elmbrook’s schools, long among the highest-ranked in Wisconsin, were in free fall as teachers embraced “leftist indoctrination” over academic content, teaching students that “all white people are racist” and that “some people must be censored or canceled.” He lost by only 5 percent of the vote against an incumbent, coming within 600 votes of victory.23\nIn the North Texas community of Southlake, a fast-growing and rapidly diversifying city near Dallas, candidates for the school board, the city council, and mayor, backed by a PAC opposing the school district’s efforts to incorporate more cultural awareness into the curriculum, all captured around 70 percent of the vote. “Southlake Says No to Woke Education,” proclaimed a Wall Street Journal headline.24\n“Every single right-wing person that ran won,” says Megan Walsh, who graduated from a local high school in 2017 and is a leader in the Southlake Anti-Racism Coalition, a community group whose advocacy inspired the adoption of the Cultural Competency Action Plan, which the winning candidates have pledged to eliminate. “We’re back to square one.”25\n\n\n\n\n\nPandemic Fallout\nMunicipal races that once turned on hyperlocal issues have been politicized and nationalized by right-wing culture warriors. But the long reach of the pandemic is at work here too. Debates over diversity plans and critical race theory are further dividing communities that were already split over the response to Covid.26 \nLindsay Love, the first Black school board member in Chandler, Ariz.  \n“It’s all morphing into the same thing,” says Lindsay Love, a school board member in Chandler, Ariz. The first Black board member elected there, Love has been a frequent target of conservative activists and received death threats for her position that schools should remain closed until Covid levels dropped. “You hear people comparing children being masked to slavery and referring to mask supporters as Marxists,” Love says.27\n“You have lost [the] trust of parents,” declared a furious father at a recent board meeting. “Mask mandates, forcing vaccines, canceling prom, limiting graduation, critical race theory. The list goes on. When is enough enough?”28\nThe school culture wars came early to this part of Arizona. After the district adopted a new program that included training teachers on race and equity issues, conservative parents revolted, charging that the equity training “marginalizes white people.” Tucker Carlson has devoted two segments to Chandler.29\n“Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 BLM blacklash: Nationwide protests and calls for a racial justice reckoning have some legislators and school districts on high alert. (Evelyn Hockstein / The Washington Post via Getty Images) The pandemic’s profound disruption of public education was already upending state and local politics, as Republicans eagerly capitalized on parents’ frustration over shuttered classrooms. Now the culture wars are further exacerbating this tense climate.21\nJessica Piper’s small Missouri town recently saw the emergence of its first-ever PAC: Northern Missouri Citizens for Reflective Government. The group, which backed conservative candidates for local offices, put most of its energy into attacking an education professor who was running for a seat on the school board in Maryville. Ominous campaign ads depicted Jill Baker, a former schoolteacher, posed between cutouts of Joe Biden and Alexandria Ocasio-Cortez, spouting anti-Trump sentiments and stressing the importance of teaching social justice in elementary schools. She lost in a landslide.22\nIn Elmbrook, Wis., the Waukesha County Republican Party recently threw its weight behind James Gunsalus, a first-time school board candidate who claimed that Covid was no more serious than the flu. According to Gunsalus, Elmbrook’s schools, long among the highest-ranked in Wisconsin, were in free fall as teachers embraced “leftist indoctrination” over academic content, teaching students that “all white people are racist” and that “some people must be censored or canceled.” He lost by only 5 percent of the vote against an incumbent, coming within 600 votes of victory.23\nIn the North Texas community of Southlake, a fast-growing and rapidly diversifying city near Dallas, candidates for the school board, the city council, and mayor, backed by a PAC opposing the school district’s efforts to incorporate more cultural awareness into the curriculum, all captured around 70 percent of the vote. “Southlake Says No to Woke Education,” proclaimed a Wall Street Journal headline.24\n“Every single right-wing person that ran won,” says Megan Walsh, who graduated from a local high school in 2017 and is a leader in the Southlake Anti-Racism Coalition, a community group whose advocacy inspired the adoption of the Cultural Competency Action Plan, which the winning candidates have pledged to eliminate. “We’re back to square one.”25\n\n\n\n\n\nPandemic Fallout\nMunicipal races that once turned on hyperlocal issues have been politicized and nationalized by right-wing culture warriors. But the long reach of the pandemic is at work here too. Debates over diversity plans and critical race theory are further dividing communities that were already split over the response to Covid.26 \nLindsay Love, the first Black school board member in Chandler, Ariz.  \n“It’s all morphing into the same thing,” says Lindsay Love, a school board member in Chandler, Ariz. The first Black board member elected there, Love has been a frequent target of conservative activists and received death threats for her position that schools should remain closed until Covid levels dropped. “You hear people comparing children being masked to slavery and referring to mask supporters as Marxists,” Love says.27\n“You have lost [the] trust of parents,” declared a furious father at a recent board meeting. “Mask mandates, forcing vaccines, canceling prom, limiting graduation, critical race theory. The list goes on. When is enough enough?”28\nThe school culture wars came early to this part of Arizona. After the district adopted a new program that included training teachers on race and equity issues, conservative parents revolted, charging that the equity training “marginalizes white people.” Tucker Carlson has devoted two segments to Chandler.29\n“Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 Jessica Piper’s small Missouri town recently saw the emergence of its first-ever PAC: Northern Missouri Citizens for Reflective Government. The group, which backed conservative candidates for local offices, put most of its energy into attacking an education professor who was running for a seat on the school board in Maryville. Ominous campaign ads depicted Jill Baker, a former schoolteacher, posed between cutouts of Joe Biden and Alexandria Ocasio-Cortez, spouting anti-Trump sentiments and stressing the importance of teaching social justice in elementary schools. She lost in a landslide.22\nIn Elmbrook, Wis., the Waukesha County Republican Party recently threw its weight behind James Gunsalus, a first-time school board candidate who claimed that Covid was no more serious than the flu. According to Gunsalus, Elmbrook’s schools, long among the highest-ranked in Wisconsin, were in free fall as teachers embraced “leftist indoctrination” over academic content, teaching students that “all white people are racist” and that “some people must be censored or canceled.” He lost by only 5 percent of the vote against an incumbent, coming within 600 votes of victory.23\nIn the North Texas community of Southlake, a fast-growing and rapidly diversifying city near Dallas, candidates for the school board, the city council, and mayor, backed by a PAC opposing the school district’s efforts to incorporate more cultural awareness into the curriculum, all captured around 70 percent of the vote. “Southlake Says No to Woke Education,” proclaimed a Wall Street Journal headline.24\n“Every single right-wing person that ran won,” says Megan Walsh, who graduated from a local high school in 2017 and is a leader in the Southlake Anti-Racism Coalition, a community group whose advocacy inspired the adoption of the Cultural Competency Action Plan, which the winning candidates have pledged to eliminate. “We’re back to square one.”25\n\n\n\n\n\nPandemic Fallout\nMunicipal races that once turned on hyperlocal issues have been politicized and nationalized by right-wing culture warriors. But the long reach of the pandemic is at work here too. Debates over diversity plans and critical race theory are further dividing communities that were already split over the response to Covid.26 \nLindsay Love, the first Black school board member in Chandler, Ariz.  \n“It’s all morphing into the same thing,” says Lindsay Love, a school board member in Chandler, Ariz. The first Black board member elected there, Love has been a frequent target of conservative activists and received death threats for her position that schools should remain closed until Covid levels dropped. “You hear people comparing children being masked to slavery and referring to mask supporters as Marxists,” Love says.27\n“You have lost [the] trust of parents,” declared a furious father at a recent board meeting. “Mask mandates, forcing vaccines, canceling prom, limiting graduation, critical race theory. The list goes on. When is enough enough?”28\nThe school culture wars came early to this part of Arizona. After the district adopted a new program that included training teachers on race and equity issues, conservative parents revolted, charging that the equity training “marginalizes white people.” Tucker Carlson has devoted two segments to Chandler.29\n“Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 In Elmbrook, Wis., the Waukesha County Republican Party recently threw its weight behind James Gunsalus, a first-time school board candidate who claimed that Covid was no more serious than the flu. According to Gunsalus, Elmbrook’s schools, long among the highest-ranked in Wisconsin, were in free fall as teachers embraced “leftist indoctrination” over academic content, teaching students that “all white people are racist” and that “some people must be censored or canceled.” He lost by only 5 percent of the vote against an incumbent, coming within 600 votes of victory.23\nIn the North Texas community of Southlake, a fast-growing and rapidly diversifying city near Dallas, candidates for the school board, the city council, and mayor, backed by a PAC opposing the school district’s efforts to incorporate more cultural awareness into the curriculum, all captured around 70 percent of the vote. “Southlake Says No to Woke Education,” proclaimed a Wall Street Journal headline.24\n“Every single right-wing person that ran won,” says Megan Walsh, who graduated from a local high school in 2017 and is a leader in the Southlake Anti-Racism Coalition, a community group whose advocacy inspired the adoption of the Cultural Competency Action Plan, which the winning candidates have pledged to eliminate. “We’re back to square one.”25\n\n\n\n\n\nPandemic Fallout\nMunicipal races that once turned on hyperlocal issues have been politicized and nationalized by right-wing culture warriors. But the long reach of the pandemic is at work here too. Debates over diversity plans and critical race theory are further dividing communities that were already split over the response to Covid.26 \nLindsay Love, the first Black school board member in Chandler, Ariz.  \n“It’s all morphing into the same thing,” says Lindsay Love, a school board member in Chandler, Ariz. The first Black board member elected there, Love has been a frequent target of conservative activists and received death threats for her position that schools should remain closed until Covid levels dropped. “You hear people comparing children being masked to slavery and referring to mask supporters as Marxists,” Love says.27\n“You have lost [the] trust of parents,” declared a furious father at a recent board meeting. “Mask mandates, forcing vaccines, canceling prom, limiting graduation, critical race theory. The list goes on. When is enough enough?”28\nThe school culture wars came early to this part of Arizona. After the district adopted a new program that included training teachers on race and equity issues, conservative parents revolted, charging that the equity training “marginalizes white people.” Tucker Carlson has devoted two segments to Chandler.29\n“Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 In the North Texas community of Southlake, a fast-growing and rapidly diversifying city near Dallas, candidates for the school board, the city council, and mayor, backed by a PAC opposing the school district’s efforts to incorporate more cultural awareness into the curriculum, all captured around 70 percent of the vote. “Southlake Says No to Woke Education,” proclaimed a Wall Street Journal headline.24\n“Every single right-wing person that ran won,” says Megan Walsh, who graduated from a local high school in 2017 and is a leader in the Southlake Anti-Racism Coalition, a community group whose advocacy inspired the adoption of the Cultural Competency Action Plan, which the winning candidates have pledged to eliminate. “We’re back to square one.”25\n\n\n\n\n\nPandemic Fallout\nMunicipal races that once turned on hyperlocal issues have been politicized and nationalized by right-wing culture warriors. But the long reach of the pandemic is at work here too. Debates over diversity plans and critical race theory are further dividing communities that were already split over the response to Covid.26 \nLindsay Love, the first Black school board member in Chandler, Ariz.  \n“It’s all morphing into the same thing,” says Lindsay Love, a school board member in Chandler, Ariz. The first Black board member elected there, Love has been a frequent target of conservative activists and received death threats for her position that schools should remain closed until Covid levels dropped. “You hear people comparing children being masked to slavery and referring to mask supporters as Marxists,” Love says.27\n“You have lost [the] trust of parents,” declared a furious father at a recent board meeting. “Mask mandates, forcing vaccines, canceling prom, limiting graduation, critical race theory. The list goes on. When is enough enough?”28\nThe school culture wars came early to this part of Arizona. After the district adopted a new program that included training teachers on race and equity issues, conservative parents revolted, charging that the equity training “marginalizes white people.” Tucker Carlson has devoted two segments to Chandler.29\n“Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 “Every single right-wing person that ran won,” says Megan Walsh, who graduated from a local high school in 2017 and is a leader in the Southlake Anti-Racism Coalition, a community group whose advocacy inspired the adoption of the Cultural Competency Action Plan, which the winning candidates have pledged to eliminate. “We’re back to square one.”25\n\n\n\n\n\nPandemic Fallout\nMunicipal races that once turned on hyperlocal issues have been politicized and nationalized by right-wing culture warriors. But the long reach of the pandemic is at work here too. Debates over diversity plans and critical race theory are further dividing communities that were already split over the response to Covid.26 \nLindsay Love, the first Black school board member in Chandler, Ariz.  \n“It’s all morphing into the same thing,” says Lindsay Love, a school board member in Chandler, Ariz. The first Black board member elected there, Love has been a frequent target of conservative activists and received death threats for her position that schools should remain closed until Covid levels dropped. “You hear people comparing children being masked to slavery and referring to mask supporters as Marxists,” Love says.27\n“You have lost [the] trust of parents,” declared a furious father at a recent board meeting. “Mask mandates, forcing vaccines, canceling prom, limiting graduation, critical race theory. The list goes on. When is enough enough?”28\nThe school culture wars came early to this part of Arizona. After the district adopted a new program that included training teachers on race and equity issues, conservative parents revolted, charging that the equity training “marginalizes white people.” Tucker Carlson has devoted two segments to Chandler.29\n“Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 Municipal races that once turned on hyperlocal issues have been politicized and nationalized by right-wing culture warriors. But the long reach of the pandemic is at work here too. Debates over diversity plans and critical race theory are further dividing communities that were already split over the response to Covid.26 \nLindsay Love, the first Black school board member in Chandler, Ariz.  \n“It’s all morphing into the same thing,” says Lindsay Love, a school board member in Chandler, Ariz. The first Black board member elected there, Love has been a frequent target of conservative activists and received death threats for her position that schools should remain closed until Covid levels dropped. “You hear people comparing children being masked to slavery and referring to mask supporters as Marxists,” Love says.27\n“You have lost [the] trust of parents,” declared a furious father at a recent board meeting. “Mask mandates, forcing vaccines, canceling prom, limiting graduation, critical race theory. The list goes on. When is enough enough?”28\nThe school culture wars came early to this part of Arizona. After the district adopted a new program that included training teachers on race and equity issues, conservative parents revolted, charging that the equity training “marginalizes white people.” Tucker Carlson has devoted two segments to Chandler.29\n“Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 Lindsay Love, the first Black school board member in Chandler, Ariz. “It’s all morphing into the same thing,” says Lindsay Love, a school board member in Chandler, Ariz. The first Black board member elected there, Love has been a frequent target of conservative activists and received death threats for her position that schools should remain closed until Covid levels dropped. “You hear people comparing children being masked to slavery and referring to mask supporters as Marxists,” Love says.27\n“You have lost [the] trust of parents,” declared a furious father at a recent board meeting. “Mask mandates, forcing vaccines, canceling prom, limiting graduation, critical race theory. The list goes on. When is enough enough?”28\nThe school culture wars came early to this part of Arizona. After the district adopted a new program that included training teachers on race and equity issues, conservative parents revolted, charging that the equity training “marginalizes white people.” Tucker Carlson has devoted two segments to Chandler.29\n“Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 “You have lost [the] trust of parents,” declared a furious father at a recent board meeting. “Mask mandates, forcing vaccines, canceling prom, limiting graduation, critical race theory. The list goes on. When is enough enough?”28\nThe school culture wars came early to this part of Arizona. After the district adopted a new program that included training teachers on race and equity issues, conservative parents revolted, charging that the equity training “marginalizes white people.” Tucker Carlson has devoted two segments to Chandler.29\n“Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 The school culture wars came early to this part of Arizona. After the district adopted a new program that included training teachers on race and equity issues, conservative parents revolted, charging that the equity training “marginalizes white people.” Tucker Carlson has devoted two segments to Chandler.29\n“Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 “Chandler is getting more diverse, and they don’t like that,” Love says.30\nLove worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 Love worries that the culture wars could end up undermining Arizona’s public schools. The state’s GOP lawmakers are attempting to enact a massive expansion of the state’s school voucher program—even though voters overwhelmingly rejected a similar effort just two years ago. Under the proposed measure, two-thirds of students in Arizona would be eligible to use state funding to pay to attend private and religious schools. “There’s this constant refrain that our schools are broken, that they’re liberal indoctrination camps. It feeds into this push to get parents to opt out of the public schools,” Love says.31\nArizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 Arizona lawmakers recently approved their own ban on teaching controversial issues. The Unbiased Teaching Act prohibits teachers in the state’s public and charter schools from talking about racism or sexism in the classroom. Teachers who disregard the ban can be fined up to $5,000.32 Jennifer C. BerkshireJennifer C. Berkshire hosts the education podcast Have You Heard. She is the author, with Jack Schneider, of A Wolf at the Schoolhouse Door. ",
    "title": "Culture War in the K-12 Classroom | The Nation",
    "datetime": "2021-06-22T09:00:01+00:00",
    "url": "https://www.thenation.com/article/society/culture-war-classroom-teachers/"
}