{
    "text": "The Indiana State House in Indianapolis, Indiana Changes to K-12 curriculum, increased access to early childhood education and a response to Indiana’s ongoing teacher shortage are top-of-mind for Indiana lawmakers as the 2023 legislative session nears. Republican state lawmakers have also hinted at the return of a contentious “curriculum transparency” bill that would limit classroom discussions about race, as well as a bill that seeks to prohibit sexually-explicit content in school library books. Versions of both bills sparked widespread debate during the 2022 session, but both failed to pass. Top GOP legislators are additionally pointing to a draft “Don’t Say Gay” that could ban Indiana teachers from holding classroom instruction about sexual orientation or gender identity. It’s not exactly clear where Gov. Eric Holcomb stands on such proposals, although he told the Indiana Capital Chronicle he would entertain a variety of bills in the next session — and that while he wants to “be very pragmatic” about what bills he signs, he did not say whether any would be too hot to touch. The Republican governor is expected to outline his full legislative agenda for the next session on Jan. 4 — less than a week before Indiana lawmakers reconvene at the statehouse. The 2023 session will also draw debate around the next state budget — a majority of which goes towards education-related line items. Numerous other agenda items affecting Hoosier students and schools will be up for debate, too. “Reinventing” high school Republican House Speaker Todd Huston in November announced a desire to “reinvent” high school in Indiana during the upcoming legislative session. Since then, other GOP leaders and state education department officials have echoed the same idea. Longtime chairman of the House Education Committee, Rep. Bob Behning, R-Indianapolis, said the state’s high school curriculum needs to better prepare students to enter the workforce and should include greater emphasis on the importance of post-secondary education. Part of that could include making math “more relevant” by tying components like financial literacy, simple interest and mortgage rates into coursework, he said. Other options include more apprenticeship programs — and making those types of opportunities more easily count towards a student’s diploma requirements. Indiana Secretary of Education Katie Jenner has also doubled-down on the importance of adding additional work-based learning opportunities for students and making it easier for high schoolers to access post-secondary education credentials before graduation. “In the four years we have children in high school, how do we really maximize that time, so they’re set up for the best possible success?” Jenner said. The Indiana Chamber of Commerce continues to make the same argument. Sen. J.D. Ford, D-Indianapolis, said Democratic lawmakers will renew their call to automatically enroll qualified students into the 21st Century Scholars program, a statewide grant program that supports student enrollment at two- and four-year schools. Enrollment in the program varies across the state, with some schools reporting 80% of qualified students are already enrolled, while others have less than 8% signed up, according to the Indiana Department of Education’s new GPS dashboard. The Indiana Commission for Higher Education made automatic enrollment a legislative priority for the next session, too. Senate education committee chair Sen. Jeff Raatz, R-Richmond, said he supports the idea if the current requirements — such as maintaining good grades while in high school — stay in place. “I think it’s incredibly important as we develop these young people to become young adults, to realize that they have things they have to do in order to make it to the next level in their lives,” he said. Early childhood education Ford emphasized the need for Indiana to expand resources centered around early childhood education. The ranking Democratic lawmaker said the issue is top-of-list for other members of the party, too. “If we want our students reading at that third grade level … if we want to see positive graduation rates, it all starts with pre-K,” he said during a recent legislative conference, referring to the state’s dismal literacy rates reported earlier this year. He said early education has become an urgent issue after last year’s IREAD scores showed roughly one in five Hoosier third graders can’t read proficiently. In response, Sen. Fady Qaddoura, D-Indianapolis, said he plans to introduce a bill to expand the income eligibility for On My Way Pre-K, a state program providing pre-K grants to low-income families of four-year-olds. Jenner noted that learning Indiana’s learning gaps “start so early,” adding “it’s imperative that we have excellent, excellent early learning in Indiana. “I think that if we really want to scale access to early learning, we have to get bureaucracy out of the way as much as possible,” she said. Behning maintained that his caucus “has been a strong champion for pre-k,” and said pricing for early learning “probably needs to be adjusted.” The lawmaker also shifted some of the pre-k investment responsibility to the “employer community.” “It’s a great asset for them — it’s a retention tool,” Behning said. “We could provide credits or some sort of incentive for them to invest … and it makes us conscious of state dollars.” Raatz, on the other hand, said he would like to see On My Way Pre-K run by the Indiana Department of Education rather than the Family and Social Services Administration. Responding to teacher shortage The Indiana State Teachers Association (ISTA), the largest teachers union in the state, announced this month that its top agenda item is addressing the state’s teacher shortage, including through improved pay and benefits. “The educator shortage crisis is real … and the shortage has become unsustainable,” said ISTA president Keith Gambill during a news conference earlier this month. He noted there are currently about 1,500 educator job openings in Indiana, affecting over 35,000 Hoosier students. There are over 2,800 jobs available in Indiana schools overall, according to the Indiana Department of Education School Personnel Job Bank. “If that isn’t compelling enough for legislators to recognize they have to do better in increasing the pay and doing what is needed to make sure that we are able to fully staff our schools, then I don’t know what that would take to convince them,” Gambill continued, adding that lawmakers should simultaneously focus on other school staff like food service providers and bus drivers. “We cannot rely on short term fixes,” he said. ISTA’s proposed four-step plan of action for legislators emphasizes the need for educators to earn more pay. Gambill said legislators also need to improve working conditions for both teachers and students, respect educators’ voices — including expanded collective bargaining rights — and “inspiring and preparing” the next generation of educators. “Divisive concepts” bills could make a comeback Indiana Democrats and teachers union representatives have pleaded for Republicans to ditch divisive “culture war” bills that prompted protests and heated debate throughout the previous legislative session. Despite this, Behning said he “guaranteed” such bills would still be introduced. Raatz said such bills could be entertained in his chamber, as well. “I’m not saying we’re going to see them, and I’m not saying we’re not going to see them,” Raatz said. “But at this stage of the game, the culture war should not be proliferated in the classroom … we need to educate. We need the basics.” Behning said lawmakers in both the House and Senate will introduce measures that seek to combine language from two previous contentious bills — one that sought to ban “critical race theory” from being taught in classrooms, and another which aimed to remove “sexually-explicit” materials from school libraries. GOP lawmakers said earlier this month that they will also attempt to enact a controversial bill to restrict discussion of LGBTQ+ subjects in schools. Behning said during a legislative conference in Indianapolis that the upcoming draft would be “similar to what Florida did in regards to sexual orientation.” The “Don’t Say Gay” law Behning referred to was signed into law by Florida Gov. Ron DeSantis, a Republican, has been described as one of the most “hateful” pieces of legislation in the country. Behning did not explicitly name the bill’s sponsors and clarified that he did not yet know whether it would be assigned to his committee. But he did express support for “parental rights” in education. “Let’s teach kids the basics and not try to get beyond that in terms of what are parental responsibilities versus what are responsibilities of the school,” Behning said. Ford said the state has “more important priorities to deal with,” however. “We will definitely be playing defense if we have to,” Ford said. “Those divisive concepts, in my opinion, always serve to divide us, and so I’m hoping that next session will be more about investing in our kids.” This story by Casey Smith is republished from indianacapitalchronicle.com, an independent, not-for-profit news organization that covers state government, policy and elections. Nobody covers Johnson County and the surrounding areas like the Daily Journal. 30 S. Water St., Second floor, Suite A, Franklin, IN 46131\nPhone: (317) 736-7101  Toll free: (888) 736-7101\nContact us: [email protected] Phone: (317) 736-7101  Toll free: (888) 736-7101\nContact us: [email protected] Phone: (317) 736-7101  Toll free: (888) 736-7101\nContact us: [email protected] Contact us: [email protected] Contact us: [email protected] ",
    "title": "Curriculum, pre-k, culture war bills among 2023 education priorities - Daily Journal",
    "datetime": "2022-12-28T16:05:00+00:00",
    "url": "https://dailyjournal.net/2022/12/28/curriculum-pre-k-culture-war-bills-among-2023-education-priorities/"
}