{
    "text": "• Amazing lineup of artists such as American singer Kehlani as well as many other exciting things to see and enjoy, including fan meetings, Korean cultural experiences, etc. 2021 World K-POP Concert (K-Culture Festival) is held at the Korea International Exhibition Center (KINTEX) in Korea on November 13 and 14, and the concert will be livestreamed in real-time via the K-Culture Festival’s YouTube channel. Spectacular performances organized with local and international pop & hip-hop artists and experiential programs with emerging K-pop artists and popular influencers are ready. (Graphic: Business Wire) 2021 World K-POP Concert (K-Culture Festival) is held at the Korea International Exhibition Center (KINTEX) in Korea on November 13 and 14, and the concert will be livestreamed in real-time via the K-Culture Festival’s YouTube channel. Spectacular performances organized with local and international pop & hip-hop artists and experiential programs with emerging K-pop artists and popular influencers are ready. (Graphic: Business Wire)  SEOUL, South Korea--(BUSINESS WIRE)--There are only five days left until the ‘2021 World K-POP Concert (K-Culture Festival)’ hosted by the Ministry of Culture, Sports and Tourism of the Republic of Korea (MCST, Minister Hwang Hee) and the Korean Foundation for International Cultural Exchange (KOFICE, President Jung Kil-hwa) kicks off. Held offline at the Korea International Exhibition Center (KINTEX) in Goyang-si, Korea, this coming Saturday, November 13 and Sunday, November 14, the concert will be livestreamed in real time via the K-Culture Festival’s official YouTube channel. With heightened anticipation from global K-culture fans as many countries around the world have entered into ‘Living with COVID-19 Era,’ the below is an introduction of the main programs at the ‘2021 World K-POP Concert (K-Culture Festival)’ and key things to watch for at the concert. Spectacular performances organized with local and international pop & hip-hop artists First, guests can meet with world-class local and international artists at the ‘2021 World K-Pop Concert (B.I.T 4 U Concert)’ held at 7 pm on November 14. The amazing lineup of local artists includes ‘NCT DREAM’, ‘SHINee KEY’, ‘aespa’, ‘ITZY’, ‘PENTAGON’, ‘Simon Dominic’, ‘Loco’, and ‘BraveGirls’. With Lia from ITZY and Jeno from NCT DREAM hosting the event, the concert is making headlines. In particular, American pop star Kehlani, who is regularly mentioned among many K-pop stars as an artist they want to collaborate with, will be delivering a virtual performance. On top of this, various digital technologies such as 360-degree VR shooting, AR video technology, and 3D stereoscopic sound will be integrated to convey the concert’s atmosphere more vividly for online viewers. Experiential programs with emerging K-pop artists and popular influencers In addition, a K-Culture Fan Fair (sub theme: B.I.T for ALL) will be hosted at the concert as a concurrent experiential program for fans. Under the slogan of ‘BIT: Bright / Together,’ the Fan Fair will have an array of experiential events, in which fans can participate firsthand at KINTEX 2 Exhibition Hall 7 for two days on November 13 and 14. Other programs at the scene include ‘K-POP Star Talk & Stage’ with emerging K-pop artists (BAE173, Ciipher, PURPLE KISS, woo!ah!), ‘K-POP Random Play Dance’ with ‘GoToe RPD,’ an influencer who has 1.6 million subscribers around the world with his K-pop random play dance content, ‘K-Beauty Show’ with Ham Kyung Sik, a top makeup artist in Korea, etc. Furthermore, there will be exhibition booths showcasing various cultural content, including Hansik (Korean food), Hangeul (Korean alphabet), Hanbok (traditional Korean clothes), etc., creating a stage for Hallyu fans to participate and engage in Korean culture firsthand. Meanwhile, the ‘2021 Global Entertainment Expo (Hosted by MCST and the Korea Entertainment Producer's Association)’ will also be held at Exhibition Hall 8 during the same period, and this event will serve as an opportunity to provide a glimpse of the present and the future of relevant industries. For more details about the ‘2021 World K-POP Concert,’ visit the official website at kculturefestival.kr. Information on ticket reservations will be announced through the K-Culture Festival official website and social media channels.  For Korean Foundation for International Cultural Exchange (KOFICE)\nEdelman Korea\nOlivia Joh\n+82-2-2022-8260\nSeoulKOFICE@edelman.com Youngwoo Kim\n+82-2-2022-8237\nSeoulKOFICE@edelman.com D-5, the 2021 World K-POP Concert (K-Culture Festival) announced the key things to watch for: amazing lineup of artists as well as exciting programs. For Korean Foundation for International Cultural Exchange (KOFICE)\nEdelman Korea\nOlivia Joh\n+82-2-2022-8260\nSeoulKOFICE@edelman.com Youngwoo Kim\n+82-2-2022-8237\nSeoulKOFICE@edelman.com ",
    "title": "D-5, Key Things to Watch for in the 2021 World K-POP Concert (K-Culture Festival)! | Business Wire",
    "url": "https://www.businesswire.com/news/home/20211108005072/en/D-5-Key-Things-to-Watch-for-in-the-2021-World-K-POP-Concert-K-Culture-Festival-%21"
}