{
    "text": "Goo Hara is the second notable K-pop star to die by suicide in a month. SEOUL, South Korea -- Following the recent deaths of beloved K-pop stars Sulli and Goo Hara, experts and authorities in South Korea are examining what may have contributed to their deaths -- and how to prevent similar tragedies. Sulli took her own life about six weeks ago, and Goo was found dead in her apartment on Nov. 24, along with a handwritten memo and \"no evidence of murder,\" local police said. The deaths of Sulli and Goo Hara likely aren't just the result of the entertainment industry's \"dark side,\" analysts said, as South Korea already suffers the highest rate of suicide among countries in the Organization for Economic Cooperation and Development, a collection of developed nations. There were 13,670 suicides in South Korea last year, an average of more than 37 per day, according to Statistics Korea, a part of the country's ministry of strategy and finance that generates and analyzes data. Among those aged 10 to 39, suicide was the leading cause of death, according to the agency. For comparison, according to OECD data from 2017, per 100,000 persons, 24.6 in South Korea died by suicide compared with 13.9 in the U.S. Experts have said that's due to a combination of complex social, cultural and personal issues. Before the death of Goo, 28, a K-pop singer and former member of girl group Kara, there were warning signs, experts told ABC News. \"Her case was a red flag. She had attempted suicide before. That meant she could try again anytime,\" said Lee Dong-gwi, a psychology professor at Yonsei University. Shortly after the death last month of Sulli, Goo's close friend, Goo bid farewell in an Instagram livestream video, saying, with tears running down her cheeks, \"I hope you will live happily as you please up there. I'll live more diligently for you. I'll work harder.\" 'High risk' \"She was definitely categorized 'high risk,' in need of treatment,\" Lee added. \"Goo should not have been left alone.\" Contributing to high suicide rates in South Korea is a social taboo against treating depression as an illness, analysts told ABC News.  \"The use of antidepressants is the lowest in the world. Here, there is a tendency to regard getting medical help as embarrassing and only for 'crazy' people,\" said Lee Je-wook, a psychiatrist at Bright Future Neuropsychiatric Clinic. Lee added: \"Although perceptions against medical treatments are improving, it is still tough for celebrities to seek help for depression.\" Major entertainment groups like SM Entertainment and JYP Entertainment run programs for their artists and regularly monitor \"risk groups,\" but the majority of artists don't have such luxuries, which can be expensive. 'A devastating effect' Authorities also must be concerned with copycat suicides. \"In the case of last year, we presumed Werther Effect kicked in during January, March and July, after suicides of famous public figures,\" Kim Jin, who's in charge of population movement at government-run Statistics Korea, told the Hankyoreh newspaper. South Korean media last year extensively covered the suicides of K-pop star and SHINee member Jonghyun, of longtime actor Jo Min-ki, who had been accused of sexual assault, and a well-respected politician named Roh Hoe-chan, who had been facing corruption charges. Jonghyun was found dead Dec. 18, 2017, Jo was found dead on March 9, 2018, and Roh was found dead July 23, 2018. Their deaths were covered in shocking detail, including graphic reports on their chosen method of suicide and the private notes they left for family members. \"For many depressed young people, a loss of a famous role model like an idol star or movie star could have a devastating effect,\" Oh Kang Seob, chairman of Korea Association for Suicide Prevention, told ABC News.  The connection between pop idols and fans are especially strong and intimate in South Korea, where social media interactions have flourished. As of January, about 85% of South Koreans used some form of social media, ahead of 70% of Americans and about two-thirds of Canadians or residents of the U.K., according to DataReportal, a digital research firm. Idols are expected to actively engage with fans through social networks like Twitter, Instagram and Facebook, while fans reciprocate with likes and personal comments. Such strong interdependent online communications have powered the rise of viewer-driven, television-audition programs and the rise of K-pop groups including the boy-band BTS. \"A smart mobile environment has made fans consider themselves more of a companion in a horizontal relationship, rather than a passive onlooker,\" Kim Hern Sik, a pop culture expert, explained to ABC News. Lee said when idols die by suicide, for the fans who felt a connection with the stars, the \"sense of loss is tremendous.\" In fact, many individuals who attempted suicide would use the same method as a celebrity who recently died by suicide, with younger females most likely to be influenced to do so, according to a report in 2015 by Dr. Myung Woojae, a psychiatrist at Seoul National University Bundang Hospital. It's perhaps an example of the double-edged sword of K-pop celebrity -- idols quickly can go from being supported and revered through active communication with fans, but an unfounded rumor or mixed reactions to personal comments could quickly result in terrible mental anguish. Cyberbullying victims Both Sulli and Goo recently had been victims of cyberbullying, receiving hateful comments as false rumors about them spread online. Sulli had been outspoken about freedom of choice to not wear bras and joined a feminist campaign, viewed as brave decisions in a still-conservative society. Goo was criticized online and accused of having plastic surgery, to which she later publicly admitted. She also endured a scandalous breakup with a boyfriend, a hair designer who allegedly threatened to expose her by using a sex tape. Many who succeed in K-pop do so as teens, training fiercely and coming of age knowing only the world of show business.  \"The problem is, when idols act immaturely, the public doesn't view them as minors and is consequently much less forgiving when they make even little mistakes,\" Choi Ji-eun, a pop culture columnist, told ABC News. \"They are in constant fear that other people will hate them.\" As idols are subject to stricter moral and ethical standards, they often become the center of gossip and suffer from severe criticism as well as cyberbullying when they are involved in unwanted scandals, Kim added. \"Idols are, despite their young age, influential figures with wealth and fame, and, as a result, are recognized as individuals who are vicariously realizing the youth's hopes and dreams,\" Kim continued. \"At the same time, however, they are the subject of jealousy. In South Korea, celebrities, including young idols, are held to much higher standards, which can cause intense amount of stress.\" ABC News' Hakyung Kate Lee, Hansol Park and Kapkoo Kwon contributed to this report. If you are in crisis, please call the National Suicide Prevention Lifeline at 1-800-273-TALK (8255) or contact the Crisis Text Line by texting TALK to 741-741. 24/7 coverage of breaking news and live events ",
    "title": "Deaths of Goo Hara and Sulli highlight tremendous pressures of K-pop stardom - ABC News",
    "url": "https://abcnews.go.com/International/deaths-goo-hara-sulli-highlight-tremendous-pressures-pop/story?id=67303374"
}