{
    "text": "By NPR Staff Your purchase helps support NPR programming. How? Death is the great leveler. All of us — kings, peasants, beggars and billionaires, saints and gnats will all die. It's the one certainty we share, even if we differ on the fine points of what happens thereafter. But what if someone set out to circumvent death by having themselves essentially suspended: Technically dead, but ready to be revived? Frozen in some secret location, body and head insulated separately, against the day a technology is developed to regenerate them, with some memories restored and others cast away? Such an enterprise — known as Convergence — is at the center of Don DeLillo's new novel, Zero K. DeLillo tells NPR's Scott Simon that the novel centers around a healthy man in his 60s who wants to use the technology so that he can be with his already-frozen wife. \"The point is that this is a completely illegal process, and takes place in the deepest physical levels of the Convergence, in an area known as Zero K,\" he says. On whether we're headed for Convergence Science and technology are on that course, and I think they have been for quite a while. I can only expect that it will continue, perhaps in a more refined manner. But I ought to add that I did not do a great deal of research; I did what was necessary. Don DeLillo has won the National Book Award, the PEN/Faulkner Award, and been nominated for several Pulitzer Prizes. His new book is Zero K.\n\n                    \n                    Joyce Ravid\n                    \n                \nhide caption Don DeLillo has won the National Book Award, the PEN/Faulkner Award, and been nominated for several Pulitzer Prizes. His new book is Zero K. On whether the people of Convergence are trying to avoid death — or life Well, in general I think what they hope to accomplish is a return to life in 20-30 years, or possibly less. The question ultimately is, what kind of life, what kind of mind does an individual possess after spending 20 years in a cryogenic pod? But they do expect that an individual at the end of the process will have an identity resembling his or her original identity. On what the possibility of immortality does to art and poetry I think this is a major question. Do I know the answer? I think it would have to affect novels and poems and stage plays and every other form of art. But to what extent, and would it create an urgency that would benefit the creator of various kinds of art? I don't know the answer. On what happens to us when we go I think peace happens, in the sense of being submerged beneath whatever difficulties, complications and unrest are part of our lives. In essence, I think nothing happens. But I could change my mind. Sponsor Message Become an NPR sponsor ",
    "title": "DeLillo's 'Zero K' Freezes At The Edge Of Immortality : NPR",
    "url": "https://www.npr.org/2016/04/30/476062916/zero-k-freezes-at-the-edge-of-immortality"
}