{
    "text": "Agree & Join LinkedIn By clicking Continue, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. Netflix's inaugural Culture deck is authored by Reed Hastings. IDEO's culture code is uploaded by Tim Brown. But when Dell Global Talent Manager Jennifer Newbill started thinking about joining the Culture Code campaign and publishing a deck on the inner workings of Dell, she wanted to do something decidedly different: The deck would not be built from the top down, but rather by employees, she says. “I’ve been watching the Culture Code revolution happening and got really excited about it,” says Newbill, who works on Dell's employee branding and candidate experiences. \"But I wanted to focus on our people at Dell rather than have it come across as, ‘Hey, this is what Michael Dell [CEO] thinks, this is what the exec team or HR thinks.' \" The hope was also that Dell -- which went from a public to private company just over a year ago -- would be able to promote its entrepreneurial culture and mitigate a reputation of bureaucracy that can befall many larger corporations. \"Where we struggle, as do all large technology companies, is attracting attention and candidates from university or start up environments. This is because large companies are seen as bureaucratic and stagnant,\" Newbill says. However, Newbill says, Dell was founded by the ultimate entrepreneur [Michael Dell] and as a result, is not a typical large tech company. She wanted to use the Culture Code to prove this. \"We are engaged in the start up culture in technology and support this within our company. What we needed to do is share those stories. […] Sharing that story is key and what helps to modify any misconceptions.\"    It took Newbill four months to create the Culture Code, much of the time brainstorming with others and letting the ideas and feedback soak in. “I gave myself and our teams enough time to think about the content, take in feedback and let the story evolve in a natural and organic way. There was not a set plan for what our Culture Code was supposed to be – we let it happen naturally,” says Newbill, who talked with about 20 people across a number of departments including Marketing, HR, and Social Media. The deck, which now has more than 70,000 views on SlideShare and 200,000 impressions from posting it as a company update on Glassdoor.com, includes real life stories from employees hailing from Texas to Argentina. (Julian Egea’s rise from intern to manager in under five years exemplifies “We help shape employees’ goals.\" And Jesse Cheng’s ability to preview the next generation of products showcases how “We grow capabilities early in career.”) “Much of the content features people who have partnered with my team (our social media and brand engagement leads) to create testimonials about why they love working for Dell. There is no better content than that,” Newbill says. Of course, creating the Culture Code wasn’t without its difficulties. In particular, Newbill says she debated whether she should include only positive aspects of the company. “Dell’s not perfect,” Newbill says. “If people want to see the good, bad, and ugly they can go to our profile on Glassdoor. We embrace it; we have plans in place to address those things. I didn’t want to inflate anything.” So how do you, too, go about creating a Culture Code that your employees can get behind? Below are Newbill’s 3 tips: 1) TAKE IT SLOW & STEADY: “Give yourself plenty of time to think about the story, craft the story, circle up with stakeholders who you think would have not just an opinion but have a great idea or suggestion — a few of the slides came entirely from other people.” 2) BE SOCIAL-READY: Your company needs to be active with leaders who feel comfortable promoting your deck across social media, Newbill says. I tell them first, ‘Do a gut check, is your culture actually ready for this?” 3) TALK TO BOTH MARKETING AND HR: “I feel that Marketing and HR need each other to create balance and synergies in how we address the marketplace. Marketing traditionally focuses more on the customer, our products and services, etc. while HR focuses more on people,” Newbill says. However, we recognize at Dell that partnering with Marketing is the best route to go when we market our employment brand as we achieve greater results and get other points of view.” READ MORE: Culture Code: Give Us a Peek Inside Your Workplace This post was originally published on SlideShare's Blog 室内装饰设计师 News Editor at LinkedIn SlideShare HR, Talent Acquisition, Employer Branding Another awesome employer branding campaign. CEO of Psylent | Where Data meets Psychology Niall Greenwood Building employee experience strategy and execution for organizational change Great points about bringing Marketing and HR together on this and also including both the positives and the challenges within the culture.  terrific. thanks for sharing To view or add a comment, sign in LinkedIn Never miss a beat on the app Don’t have the app? Get it in the Microsoft Store.  ",
    "title": "Dell: Creating a Culture Code by Employees, for Employees",
    "url": "https://www.linkedin.com/pulse/dell-creating-culture-code-employees-lorraine-k-lee"
}