{
    "text": "From a small band of students who love K-pop and K-pop dance to DKDG, Denison’s first-ever K-pop Dance Club, this group believes in progress. In 2017, the Asian Culture Club (ACC) hosted an annual dinner celebrating the Lunar New Year, a traditional holiday prevalent in East Asian countries. At the same time, ACC called for student performances, especially those that would represent Asian cultures. In response to that invitation, Khue Ngo ’19 and Jiahao “Peter” Ran ’19 gathered their friends to pull off a complete K-pop dance cover. The group named themselves AADG which stands for “Another Asian Dance Group.” After the success of this performance, the group continued with another dance cover for UPC’s Aestavalia accompanied by new members. At the end of Spring 2018, AADG had come to the realization that there were many folks on campus who were just as passionate about K-pop and K-pop dance as those in the group. However, there had not been a declared community on campus which could provide those individuals with opportunities to freely express their interests or speak their cultures, hence contributing to the diversity at Denison. For that reason, AADG wanted to reach out more, and established DKDG, (Denison Kpop Dance Group) in October of 2018, with 26 original members and new members recently joining after the workshop. During the first workshop, a total of 17 participants attended which was more than the small group expected. The group hopes to obtain official club status through DCGA in Spring 2019 if students still express interest. As representatives of K-pop lovers on campus, the group wants to embrace the impossible spirit of K-pop groups such as BTS, and their mission to bring people together by the virtue of music, love and culture. “Through dancing, we’re excited to continue making K-pop music more present on campus since it is only known and enjoyed within a small community,” says Ha Le ‘21, one of two founders of the dance group from Hanoi, Vietnam. Nha Le ‘21 is the other co-founder, also from Vietnam. “For the group members, DKDG will be an open space to express their love for K-pop or korean culture in general.” From past practices, K-pop groups popular among the members include: BTS, EXO, BLACKPINK, TWICE, Girl’s Generation, Red Velvet, WINNER, G(I-DLE), CLC, f(x), MAMAMOO etc. Song selection for the group is generally based from members preference and the difficulty level of the choreo, as well as the comfort of the dancers. According to Ha Le, the most difficult part is not the actual dancing, even if it is hard rather to try and copy trained Korean idols. The hardest part is organizing times for everyone to rehearse, and breaking down stereotypes. “We have been misunderstood as a dance group for females only, maybe due to the “fangirl” concept. But really it’s just like a normal dance crew. We currently don’t have enough male members, but that’s not a problem as long as people are interested in covering male groups’ songs,” says Le. Despite the hardships, every practice tries to incorporate fun, high energy, which is not hard with such a passionate crew. “I personally feel so grateful to be friends with these amazing people, we just have this bond and care for one another inside and outside practice time although we couldn’t meet all the time,” says Le. How do you sign up? You can send a message to the DKDG facebook, OR send an email to dkdg2018@gmail.com to express your interest or ask them any questions. While the club is not official through DCGA, the two founders are working with CLIC to get that status. “DKDG acknowledges the presence of K-pop interests on campus and further aims to promote K-culture towards a wider audience among the Denison community,” says Le. “In that spirit, we welcome all individuals who wish to learn, enjoy and spread K-pop love around campus regardless of [their] dance skill or identity.”  ",
    "title": "Denison Kpop dance group bursts onto Denison's social scene – The Denisonian",
    "datetime": "2019-02-02T06:44:00+00:00",
    "url": "https://denisonian.com/2019/02/features/denison-kpop-dance-group-bursts-onto-denisons-social-scene/"
}