{
    "text": "Philip K Dick was never quite the writer Hollywood has wanted him to be. In both Ridley Scott’s Blade Runner and the new Amazon Prime adaptation of The Man In The High Castle, Dick’s Nazis-win-the-war alternate history, the science fiction icon is presented as the laureate of dystopia – a visionary misanthrope who perceived the trajectory of mankind not as a series of upward triumphs but as a descent into foggy, smoggy nihilism. He was, by this telling, the pulp Nostradamus – a machine-age prophet whose escapist texts offered flash-forwards to a dark future towards which we inevitably hurtle. Actually, he wasn’t that guy at all. With a handful of exceptions (which we shall come to), cinematic retellings of Dick sidestep the eccentricity and paranoia – the Walter Mitty fever – that infused his work. Far from a soothsayer reading the technological tea-leaves , by the end of his life Dick was literally a member of the tin-foil hat club. He believed, sincerely and obsessively, that humanity inhabited a multiverse where timelines unspooled simultaneously and that he, a five times-married, invariably impoverished genre hack, was living a parallel existence as “Thomas”, a early Christian persecuted in ancient Rome. Even before his descent into delusion in the mid-1970s, eccentricity had been a defining feature of Dick’s writing. His ideas were uncanny and obtuse – not at all the chic cyberpunk with which he has become synonymous. Those coming fresh to his bestseller Do Androids Dream Of Electric Sheep? (from which Blade Runner is adapted) may, for instance, be surprised at the absence of gleaming futurescapes or noir voiceover. Instead, this is a strange, imperfectly formed tale of a man who dreams of one day owning an actual sheep but must, in a world of unchecked pollution, make do with an artificial alternative. It isn’t – as per Rutger Hauer’s famous Blade Runner monologue – a rumination on what it is to have a soul. It’s a weird, knotty book about, among other things, the joys of pet ownership. Indeed, Dick would have in all likelihood been baffled by Blade Runner’s gilded beauty and cool, crisp contours – aesthetics entirely absent from Electric Sheep. We’ll never know for sure, of course – he passed away obscure and unmourned aged 53 in 1983, three months before Blade Runner’s release. Dick, ultimate chronicler of out-of-body experiences, missed his own transcendence by mere weeks. Through his life, Dick had always seemed to wobble between the real world and an alternate dimension of his own creation. He had from the start used hallucinogenics and sundry stimulants freely as a creative tool – and the results are clear from such amphetamine-powered head-trips as Martian Time Slip – one of the most perceptive books ever written about autism – and The Three Stigmata Of Palmer Eldritch, a sweltering mash-up of golden age science fiction and chemical odyssey that reads like Isaac Asimov trapped inside a Timothy Leary vision. However, it was in 1974 that Dick plunged off the deep end in earnest. In February of that year, as he recovered from a complicated dental procedure and was still high on painkillers, Dick answered the door to a prescription delivery girl. Gawping through the chemical haze, he concluded that the caller was a visitor from classical Rome – and that he, like her, was an early Christian fleeing oppression. Furthermore the 20th century did not exist. Reality was an apparition – Dick had merely dreamed that he was a struggling sci-fi scribe. “I experienced an invasion of my mind by a transcendentally rational mind,” he would recall. “As if I had been insane all my life and suddenly I had become sane.” “He really did go crazy, “ wrote the New Yorker’s Adam Gopnik in a 2007 profile of the author. “And it wasn’t the cute-crazy of the movies, with well-cast hallucinations and Jennifer Connelly to comfort you. It was true staring madness, hell on earth.” Then he’d always been haunted after a fashion. Dick and his twin sister were born six weeks prematurely in 1928 – he lived and she did not and as an adult he would obsess about the presence of a “phantom twin” (a recurring trope in his stories). Unhappiness also characterised his writing career. Far from being drawn to speculative fiction, he regarded sci-fi as pigeonhole of last resort and always dreamed of making it as a literary novelist. But this ambitions were snuffed out for good when, in 1963, a New York literary agency returned all of his “mainstream” manuscripts deeming them unpublishable. That echo of that slamming door resonated through the rest of his career (he won the Hugo Award for best science fiction novel shortly afterwards for Man In The High Castle – an honour that appears not to have detained him unduly). Professionally frustrated, guilty at surviving in place of his sister and routinely out of his cerebrum on substances, Dick poured his neuroses into books that cycled between delirium and lucid miserablism – sensibilities the movie adaptations which have made him famous have largely avoided. The exceptions are Richard Linklater’s trippy animation, A Scanner Darkly (2006), and the opening half of Paul Verhoeven’s Total Recall (1990), when the audience is invited to consider Arnold Schwarzenegger’s character truly could be a construction worker possessed by the paranoid delusion that he was a secret agent from Mars. In practically every other instance, the quality that defined Dick’s novels has been scrubbed from the screen. Certainly, none of his uncanniness trickles down to Amazon’s rigorous and tightly-plotted Man In the High Castle – and is unlikely to feature in the forthcoming Blade Runner sequel, to be directed by Denis Villeneuve. Dick stared unblinkingly into the void – were Hollywood to come even close to replicating that experience, the results would surely be too terrifying to sit through. © 2023 The Irish Times DAC © 2023 The Irish Times DAC ",
    "title": "Did Philip K Dick dream of electric sheep? Much worse – The Irish Times",
    "url": "https://www.irishtimes.com/culture/books/did-philip-k-dick-dream-of-electric-sheep-much-worse-1.2498367"
}