{
    "text": "A band you may have never heard of has recently topped Australian streaming charts, breaking records and changing the shape of the Australian musical landscape forever. Not only has this band risen to the top of our streaming charts, but they also look set to smash into ARIA.  BTS supergroup: In Australia, the growth of K-pop has led to an increase in enrolments in Korean language classes with many K-pop fans meeting up to practice their Korean language skills with Koreans who are visiting Australia to improve their English. Image credit: Wikimedia Commons But what’s most surprising about this band for many Australians is that they aren’t American, British or even Australian. The band which has swooped in out of nowhere to capture the ears of young Australians is a seven-member boyband from South Korea named BTS. There is a new interest in all things Korean among young Australians ... Korea is at the centre of a global pop culture and Australian fans are actively joining the fun And the band’s popularity hasn’t come from nowhere; it builds upon a new interest in all things Korean among young Australians, many of whom now watch Korean TV, regularly eat Korean food, and wear Korean clothes and make-up. BTS’s meteoric rise to worldwide fandom has firmly placed Korea at the centre of global pop culture, and young Australians fans are actively joining the fun. On Friday 12 April, global K-pop superstars BTS dropped their newest album Map of the Soul: Persona. The album quickly rose to the top position across numerous global streaming charts, taking the number one spot on 49 national iTunes charts - including Australia. The music video for the lead single from the album, Boy With Luv (ft Halsey), has already broken records, becoming the most-viewed 24-hour debut in YouTube’s history, amassing a staggering 78 million views. Boy with Luv: Two days ago the single became the most-viewed 24-hour debut in YouTube’s history, amassing a staggering 78 million views. Australian fans were eager and active participants in the massive “viewing parties” which helped usher in this achievement, demonstrating just how popular K-pop is becoming among young people Down Under. In fact, BTS are helping Aussie fans develop a cosmopolitan identity and deepening their awareness of, and appreciation for, Asian culture. For the uninitiated, BTS is a 7-member K-pop boyband from South Korea comprised of RM, Jin, Suga, J-Hope, Jimin, V, and Jungkook. BTS is an acronym for either Bangtan Sonyeondan (Bulletproof Boy Scouts, the band’s Korean name) or Beyond the Scene (the band’s official English name). A mixed hip-hop and pop group, BTS sits at the vanguard of global K-pop fandom, with K-pop referring to a genre of popular music from South Korea that has developed a massive global fandom in recent years. Renowned for its highly trained “idol” performers, the K-pop industry has recently embraced Western markets on the back of devoted social-media based fandoms. Fans of BTS, who identify as “ARMY,” sit at the forefront of this movement, helping BTS receive global recognition. BTS has racked up several notable achievements in recent years. In 2017, the band and its fans received the Top Social Artist Award at the Billboard Music Awards (a feat they repeated in 2018). Following this success, BTS returned to the US as the first Korean band to perform at the American Music Awards in November 2017. 2018 saw BTS launch a global stadium tour in Asia, the US and Europe, release two new albums which topped the US Billboard Chart, and receive an invitation to the Grammy Awards. On the 12th April 2019, BTS became the first K-pop group to officially debut their newest album in the US via a performance slot on the pop culture icon Saturday Night Live. Just before the release of their new album, ARIA revealed that three of BTS’s 2018 releases had been certified gold in Australia. K-pop is a phenomenally influential global industry, and there are many fans of various K-pop idol groups active in Australia. In fact, Australia commonly appears on K-pop groups’ tour itineraries, with 2019 alone seeing the groups Stray Kids (which even includes two Aussie members), Black Pink, and Monsta X visit Sydney and Melbourne for concerts. Australian fans of K-pop are active in promoting the genre to mainstream audiences, working hard to increase the visibility of the genre on Australian radio and television. For example, after the release of Boy With Luv, members of the Aussie ARMY camped out in front of the Channel 7 building in Martin Place to wave banners and attract the attention of the hosts, who then included a segment on the boyband on the show.  Fandom: Korean fashion and food are having a moment in Australia along with Korean TV and music - fuelled by the extreme popularity of boy band BTS, says Asian studies lecturer Thomas Baudinette.                                    Pic credit: Tom Baudinette The massive fandom for BTS which is emerging among young Australians is representative of larger trends around Asian popular culture consumption in Australia. Fans of BTS are not only attracted to the band because of their meaningful lyrics and good looks, but also because it allows them to learn about Korea and participate in global culture. K-pop fans don’t just listen to Korean pop music, but also watch Korean soap operas called “K-dramas” (which they access via streaming services such as Netflix), wear Korean fashion, buy and use Korean cosmetics, and enjoy eating Korea cuisine such as spicy fried chicken, fermented cabbage known as kimchi and the famous mixed-rice dish bibimbap. Listening to K-pop in Australia is significant because it connects young people to the broader Asian region and increases their knowledge of Asian culture. Australian fans of K-pop come from all sorts of backgrounds, and the popularity of bands such as BTS is not simply restricted to Asian migrant communities in our major cities. K-Pop fans Down Under work hard to raise awareness of the genre among the mainstream and seek to introduce “Asian” content into Australia’s notoriously monoculture media landscape where the presence of people of colour is rare. The popularity of bands such as BTS among young Australians potentially shows a shift towards more diverse musical tastes. One shift of note is a clear diversification in receptiveness to languages other than English. K-pop is sung mostly in Korean and the fact that bands such as BTS do not sing in English has not hampered their entry into the global pop scene. In fact, fans come together to translate and share lyrics, unlocking the messages within. In Australia, the growth of K-pop has led to an increase in enrolments in Korean language classes and many K-pop fans participate in “meet-ups” to practice their Korean language skills with Koreans who are visiting Australia to improve their English. So what happens next? BTS has opened a space for Korean pop culture in Australia, building on the energy of loyal fans to inject a much-needed multiculturalism into our media landscape. As BTS climbs the chart, perhaps they will pave the way for other Asian artists to enter our national soundscape. In five years’ time, maybe we all will be rocking out to the latest pop hits from Asia. © Macquarie University CRICOS Provider 00002J ",
    "title": "Do you know BTS? How K-pop superstars reveal Aussie love affair with Korean culture | The Lighthouse",
    "datetime": "2019-04-15T16:19:23+10:00",
    "url": "https://lighthouse.mq.edu.au/article/april-2019/do-you-know-bts-how-k-pop-superstars-reveal-aussie-love-affair-with-korean-culture"
}