{
    "text": "We use cookies and other tracking technologies to provide services in line with the preferences you reveal while browsing the Website to show personalize content and targeted ads, analyze site traffic, and understand where our audience is coming from in order to improve your browsing experience on our Website. By continuing to browse this Website, you consent to the use of these cookies. If you wish to object such processing, please read the instructions described in our  Cookie Policy /  Privacy Policy. Interested in blogging for timesofindia.com? We will be happy to have you on board as a blogger, if you have the knack for writing. Just drop in a mail at toiblogs@timesinternet.in with a brief bio and we will get in touch with you. Arjun Subramaniam is a retired Air Vice Marshal and occupies the President’s Chair of Excellence in National Security Affairs at the National Defence College Over two decades ago George K Tanham, a RAND researcher from the US, stirred a hornet’s nest by obliquely pronouncing that India lacked a strategic culture to support its emerging geopolitical ambitions. In his monograph ‘Indian Strategic Thought: An Interpretive Essay’, he argued that India’s values, cultural diversity, recent historical legacy and non-alignment as a state policy, stymied the proliferation of strategic thought and could result in sub-optimal responses to challenges faced on multiple fronts, particularly in areas related to national security. Written primarily as a policy primer for a US political leadership that was tentatively looking at scaling up relations with India, it faced considerable flak from Indian strategic thinkers like K Subrahmanyam, who blasted it for its myopic and jaundiced view of higher national security decision making. While George Tanham used the elite as a benchmark for evaluating strategic culture, it is time to evaluate strategic culture from a common citizen’s perspective. With higher levels of education, a rising middle class that is becoming increasingly aware of its rights, the proliferation of social media and multiple tools for knowledge, national interest is gradually seeping into the consciousness of the common citizen. Today, good articles on national security elicit diverse and nuanced responses from a wide cross-section of readers, something that was absent during the years when Subrahmanyam wrote extensively. Fingerprinting a young and evolving nation’s strategic culture at a time when Tanham did was bound to result in a skewed analysis. It is when a large chunk of citizens become active stakeholders in charting the course of their nation’s history that the study of strategic culture assumes significance. Does education play a pivotal role in the development of a strategic culture? If the answer is in the affirmative, the next step is to identify how and when this development takes place and whether ‘strategic culture’ is a focussed by-product of a rigid education system, or whether it is the natural flowering of ideas, thoughts and writing that emerge from a liberal and broad-based system. Nations where primary and secondary education revolve around ideology, theology, excessively structured syllabi and distorted history have seen the development of strategic cultures that are rigid and run the risk of being consumed by change, or destroyed from within. Soviet Russia and Pakistan are extreme examples of such manifestations. The Indian education system was stuck for years in a colonial trap that alternated between rote and an obsession with ‘white collar possibilities’. It was only a few of the elite who were exposed to multi-disciplinary education that is so necessary for the creation of a robust strategic culture. As a result, Indian strategic culture in the post-Independence era did not reflect the culture of the majority and suffered from the infirmities of few ideas. I do not acknowledge that contemporary Western strategic culture, typified by Pax Americana or Pax Britannica, are ideal ones. However their longevity was and is a result of a robust multi-disciplinary education system that focussed on the spirit of enquiry, innovation and reflection. What of contemporary Chinese strategic culture? Rising from the ashes of centuries of colonial exploitation and rigid communist influences, contemporary Chinese strategic culture would have met the same fate as Soviet strategic culture but for the vision of Deng Xiaoping. Retaining much of the rigidity of the existing system, Deng complemented that framework with ideas that emerged from Chinese intellectuals, economists, scientists and historians educated in the West to create a hybrid strategic culture that has emerged as a strong challenger to the West. We must adopt a bottomsup multidisciplinary approach from the lowest rungs of education to the highest pillars of our strategic edifice to develop a strategic culture that is not only robust and flexible, but widely inclusive. Just as China in the last decade has shown clear signs of emergence as an assertive nation with revisionist aspirations, India in its seventh decade as an independent nation-state is poised to shape its own strategic culture in its image. We would do well to look at education as a key driver of strategic culture. The writer is a faculty member at the National Defence College, New Delhi   Views expressed above are the author's own. Beyond the strip: If civilian suffering in Gaza is not reversed, chances of a wider Middle East conflict are wider The Gaza Trap: Of course, Israel must exercise restraint. But beyond outrage, how are Arab govts helping? Virat Kohli and the virtue of selfishness Here is how India can afford to host 2036 Olympics PM don’t preach: Stand on Hamas attack shows change in India’s foreign policy ‘Finish Hamas…remove Netanyahu…then talk peace’: In conversation with Ehud Olmert, former Israeli prime minister. He tells Rudroneel Ghosh the way forward for Israelis and Palestinians Question for Netanyahu: Who takes charge of Gaza? What’s really dangerous about the Israel-Hamas war While the Gaze is on Gaza: The last two weeks since Hamas’s brutal attack have shown that it is upon Israel to recognise that only in Palestinian well-being can it find real long-lasting security Milords, shouldn’t women decide? Interested in blogging for timesofindia.com? We will be happy to have you on board as a blogger, if you have the knack for writing. Just drop in a mail at toiblogs@timesinternet.in with a brief bio and we will get in touch with you. Chennai Talkies Juggle-Bandhi The Underage Optimist,TOI Edit Page Erratica,TOI Edit Page,Tracking Indian Communities Copyright © 2023 Bennett, Coleman & Co. Ltd. All rights reserved. For reprint rights: Times Syndication Service ",
    "title": "Does India have a strategic culture? Yes, it is slowly beginning to develop one",
    "datetime": "2016-02-02T02:12:06+05:30",
    "url": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/does-india-have-a-strategic-culture-yes-it-is-slowly-beginning-to-develop-one/"
}