{
    "text": "By Katharine B. Stevens | Elizabeth English Smith American Enterprise Institute April 12, 2016 Key Points Read the PDF. Executive Summary With growing public and political support, the early childhood field is advancing quickly, now focused primarily on expanding school-based pre-K. Yet pre-K is just one part of a broad landscape of pro­grams for children from birth through age four, and the emphasis on pre-K often overshadows other valuable approaches, such as child care and two-generation initiatives that work with children and parents together. Neither the public nor policymakers have a clear picture of the range of early childhood programs, the varied evidence on their effectiveness, and how that evidence can guide us going forward. This report aims to provide a starting point for a more comprehensive, nuanced dialogue around core policy goals in early childhood and the best strat­egies to accomplish those goals. It examines 10 of the best-known, widely cited programs of the last half century—Abbott Preschool, Abecedarian, Bos­ton Pre-K, Chicago Child-Parent Centers, Georgia Pre-K, Head Start, Nurse-Family Partnership, Okla­homa Pre-K, Perry Preschool, and Tennessee Volun­tary Pre-K—and the research on those programs. The report has two parts. Part I is a short guide to the four research meth­ods most commonly used to evaluate early childhood programs. While research findings are often presented in policy debates as black and white, they have a lot more gray than is often acknowledged. A basic under­standing of how studies are conducted is essential to correctly interpreting their results. This brief overview aims to help nonexperts understand the methods used in early childhood research, how the choice of meth­ods can influence study results, and the limitations of each method. Part II describes the 10 programs, answering sev­eral broad questions about each: What is the specific nature of the program? Whom does it serve, and how is it designed? What kind of research has been conducted on it? What methods were used, and what results were found? What are the key takeaways? A close look at these 10 programs reveals that they are as different as they are similar. Some focused on four-year-olds, some on three-year-olds, and some solely on infants and toddlers. Some programs ran for just one year, others for two, and one served children from infancy to kindergarten. Some were school-based while others were home-based. Some targeted children alone while some targeted their families too. Some pro­grams increased the number of alphabet letters children knew when they were five; others led to large increases in social, economic, and health outcomes decades later. The research conducted on the 10 programs also varied greatly. Researchers used different methods to investigate a range of questions: some evaluated basic academic skills in kindergarten, some examined chil­dren’s performance in elementary school, and still oth­ers tracked a range of long-term social and economic effects into adulthood. Some studies were more rigor­ous than others. The research shows neither that “pre-K works” nor that it does not; rather, it shows that some early childhood programs yield particular outcomes, sometimes, for some children. Overall, our report finds that this body of research provides less useful information than is commonly assumed. It shows that early childhood programs can have a significant, sus­tained impact on the lives of children born into disad­vantaged circumstances, but falls far short of showing that all programs have that impact. The most rigorous research shows that the most meaningful, far-reaching effects occurred with intensive, carefully designed, well-implemented programs—specifically Abecedar­ian, Nurse-Family Partnership, and Perry—that target very young children, engage parents, and teach a broad range of skills. Two important policy implications emerge. To move the early childhood field forward, we must: While current research focuses overwhelmingly on the short-term impact of conventional pre-K on children’s basic academic skills, the core policy question remains unanswered: what are the most effective early interventions for improving disadvantaged children’s lives? To guide policy effec­tively, research must be improved by focusing on the most important questions instead of the most fashionable or convenient ones; increasing research transparency and replication; and pursuing new approaches to rigorous, policy-relevant research. Early childhood is gathering public and political momentum as one of the most important domestic policy areas of our time. But what America’s most disadvantaged children are facing is not an achieve­ment gap; it’s a life gap. To close that gap, we need to move beyond a narrow focus on improving academic skills as the aim and expanding pre-K as the solution. Researchers, policymakers, and the public alike must remain focused on the core goal: to give all children, no matter the circumstances of their birth, a fair start in life.  INFOGRAPHIC | Studies used to promote Pre-K actually make the case for a different approach  Introduction Early childhood education has become increasingly prominent in the American policy landscape over the last several years. Between 1980 and 2016, the number of states with publicly funded pre-K programs increased more than fourfold, from 10 to 45. Since 2002, state spending on pre-K rose by nearly 300 per­cent, growing from $2.4 billion to almost $7 billion in 2016. In 2015 alone, 11 states boosted their pre-K funding by more than 25 percent. And the proportion of three- and four-year-olds attending preschool has almost tripled since 1970, up from 21 percent to 55 percent in 2013.[1] It makes sense that early childhood is an emerging priority for policymakers. A rapidly growing body of brain research underscores the crucial impact of chil­dren’s experiences from birth through age four. Other research has shown that high-quality early childhood programs hold great promise in helping disadvantaged young children succeed in school and life. Recent polls show that the public also widely con­siders early childhood to be an important priority. In one 2014 poll, for example, 78 percent of Republicans, 83 percent of independents, and 93 percent of Demo­crats said they favor building better and more accessible preschool services.[2] So far, the early childhood field has largely focused on expanding school-based pre-K programs for four-year-olds. But pre-K is just one part of a broad landscape of programs for children from birth through age four, and the emphasis on pre-K often overshadows other important approaches, such as child care and two-generation initiatives that work with children and parents together. Neither the pub­lic nor policymakers have a clear picture of the range of early childhood programs, the varied evidence on their effectiveness, and how that evidence can guide policy going forward. This report aims to provide a starting point for a more comprehensive, nuanced dialogue around core policy goals in early childhood and the best strate­gies to accomplish those goals. It examines 10 of the best-known programs and highlights of the research on their impact, answering several broad questions about each: What is the specific nature of the program? Whom does it serve, and how is it designed? What kind of research has been conducted on it? What methods were used, and what results were found?[3] A close look at the 10 programs reveals that they are as different from one another as they are similar. Some targeted four-year-olds; others focused on infants and toddlers. Some operated for 50 hours per week; others for just 15. Some ran for a single year; others for up to five. Some were entirely school based; others include intensive work with parents. In fact, much of the most-cited early childhood research is on programs that are not pre-K at all—and narrow debates over the pros and cons of pre-K exclude a great deal of knowl­edge about how to best serve children and families. This report has two parts. Part I provides a short guide to the four research methods most commonly used to evaluate early childhood programs. Research methods are usually ignored as esoteric and boring. But it is important to understand how those methods work, how the choice of methods can influence what results are found, and the particular limitations of each one. Part II describes 10 of the most widely cited early child­hood programs, including details on program design and research findings on their impact. The following pages are not intended as a scholarly examination or definitive review of the 10 programs, but rather aim to provide accessible information to a nonexpert audience. Our hope is to broaden partici­pation in a crucial public debate—toward the widely shared goal of creating policy that will advance the well-being of America’s most vulnerable young children. Read the full report. Read the two-page overview. Notes ",
    "title": "\n\tDoes Pre-K Work? The Research on Ten Early Childhood Programs—and What It Tells Us | American Enterprise Institute - AEI",
    "url": "https://www.aei.org/research-products/report/does-pre-k-work-the-research-on-ten-early-childhood-programs-and-what-it-tells-us/"
}