{
    "text": "Please select Recommendations and/or countries from the drop-down list on the right side. Back\n\n\n\n\t\t\t\t\t\tDragodid.org – preserving the dry-stone masonry techniques of eastern Adriatic Vilma Stopfer©4 GRADA DRAGODID Location of the initiative: CROATIA and EASTERN ADRIATIC AREA Relation to Strategy 21 Recommendations: K6 - develop knowledge banks on local and traditional materials, techniques and know-how Time span of the initiative: Start Date: July 2010 / End Date: On-going Motivation / Methodology Association 4 GRADA DRAGODID (short: DRAGODID) is an education, training and awareness raising NGO, whose work is focused on vernacular architecture, specifically dry-stone techniques in Croatia and the Eastern Adriatic area. Its team consists mostly of volunteers – young professionals and students of heritage and landscape related disciplines (architecture, ethnology, landscape architecture, agriculture etc). DRAGODID was awarded Europa Nostra’s 2011 EU Prize for Cultural Heritage and has had an advisory role in the national protection and multinational nomination of dry-stone art and techniques on the UNESCO Representative List of the Intangible Cultural Heritage of Humanity (2017-2018). In the past, dry-stone was one of the most widespread skills within the rural population, where it was – and still is in some places – a common part of everyday life. Even in the changed economic circumstances, and in its new roles, it still is inclusive, widespread, and recognised as the one of the most environmentally sustainable techniques of building. The project is an attempt at transferring knowledge and skills from the old masters to future generations of enthusiasts and heritage professionals. It aims at re-establishing dry-stone as an efficient, aesthetical, humane and sustainable option for the construction of simple buildings and structures in the Mediterranean. Methods of our work are: · Gathering and documenting of specific local knowledge in dry-stone construction techniques; · Transfer of this knowledge and skills to the new generation of practitioners, both experts and enthusiasts; · Raising of awareness about the utility of dry-stone buildings and its potential for economic and tourist usage; · Renovation and revitalisation of exemplary sites of dry-stone architecture into heritage attractions and case studies of sustainability; · Digital and field research. · As a grassroots project with the strong DIY component, Dragodid.org actively encourage the public’s participation in developing the small-scale projects and in the decision-making processes on a local scale. The number and the diversity of project partners and activities denotes the inclusiveness of the project. · The project brought to light various local practices and practitioners, encouraged some new ones, and helped their cooperation and mutual recognition. There are not as many dry-stone masters active and fit today as there were 20, 50, 100 years ago. This is sometimes a cause for urgent actions and projects with a goal to learn and preserve for younger generations. The non-profit and volunteer profile of the association and its activities certainly provides enthusiastic drive, but this is sometimes a disadvantage due to lack of time and resources. Ours is a good example of the importance of the focus of a campaign. Instead of covering a wide area of heritage, we have designed and performed a diverse range of activities for one particular issue and one particular type of heritage – dry-stone heritage. 4 GRADA DRAGODID is based on the recognition that dry-stone masonry techniques are practical, culturally important and sustainable, as well as a part of the region’s intangible heritage which is immensely important for future generations: they produce usable and aesthetic structures from locally available materials. · The project implemented some of today’s most sought after practices in heritage protection: · Digital technologies using crowdsourced data such as interactive web GIS open public inventory of dry-stone heritage www.suhozid.hr; · Active citizenship and volunteering through many public volunteer workshops throughout the year and along Croatia and neighbouring countries; · Cultural good documentation via 1) “The Mediterranean Stone House – Construction and Renovation Techniques” manual, printed in 15 000 copies in four editions and six years; 2) heritage news portal www.dragodid.org written in a popular and accessible style while still remaining informative and resourceful thus rendering it useful to experts, 3) photo, video and transcribed data about known dry-stone practices, masters and localities; · Horizontal and multinational cooperation. In the general sentiment, dry-stone represents an undoubted national cultural good in both its aspects, tangible and intangible, because the buildings and landscapes so strongly represent the skill and stamina of its makers. We could say that the dry-stone cultural landscapes are the most evident link between man and the environment. That is the case, not only in Croatia, but also in every European region that has dry-stone heritage. This common experience of dry-stone heritage resulted in a recent joint successful UNESCO ICH application by 8 European countries (Croatia, Cyprus, France, Greece, Italia, Slovenia, Spain, Switzerland). Most importantly, dry-stone know-how contributes to the creation of a collective identity associated with the element at local and regional level, generating synergies and common bonds. The fact that this technique is used in many places around the world fosters the creation of networks between different cultural communities, thus encouraging the exchange of knowledge and expertise, as well as mutual respect and appreciation of cultural diversity. Bakota, Julia\n4 GRADA DRAGODID\n[email protected] Shared public / private financing Financing details\npart of the funding is from a sponsor, part of the funds of the local government and the Ministry of culture  ",
    "title": "Dragodid.org – preserving the dry-stone masonry techniques of eastern Adriatic - Culture and Cultural Heritage",
    "url": "https://www.coe.int/en/web/culture-and-heritage/-/association-4-grada-dragodid-"
}