{
    "text": "  Fans of BTS, dubbed ARMY, wear t-shirts that have ″Oppa, we're here″ written on the back at the boy band's fan meet ″2019 BTS 5th Muster: Magic Shop″ held in Songpa District, southern Seoul, on June 22, 2019. [ILGAN SPORTS] The word \"banchan,\" a small side dish served along with rice as part of a typical Korean meal, was added to the Oxford English Dictionary (OED) in September. [SHUTTERSTOCK] Oppa Planner, an online seller, sells customized planners, desk calendars and journals of famous Korean actors, or ″oppas.″ [SCREEN CAPTURE] \"Mukbang,\" a livestreamed video featuring a person eating, usually large quantities of food, while communicating with their audience, is considered a neologism in Korea, yet was added to the OED. [SCREEN CAPTURE] The addition of the word \"trot\" to the OED seems to have been heavily influenced by cable television TV Chosun’s hit competition shows, “Miss Trot” (2019-21) and “Mr. Trot” (2020). The above is a scene from ″Miss Trot.″ [SCREEN CAPTURE] Foreigners try out the dalgona challenge on YouTube, since the success of Netflix's ″Squid Game.″ [SCREEN CAPTURE] [AI IN ACTION] From K-pop to webtoons, K-content is no stranger to AI [AI IN ACTION] What do poems, orchestras and steaks all have in common? AI. 'Every big label wants to sign a K-pop act,' experts say [EXCLUSIVE] Deep dive into the Omega X tampering controversy [WHY] Why is sex still a taboo subject in Korea? Korea equals K-pop to many foreigners, according to Hallyu trends report The life of a word depends on the users [Meanwhile] The life of a word depends on the users (KOR) Korean pop culture exports fall amid chill with China [Column] Add wings to K-culture To write comments, please log in to one of the accounts. Standards Board Policy  (0/250자) Korea JoongAng Daily Sitemap All materials contained on this site are protected by Korean copyright law and may not be reproduced, distributed, transmitted,                    displayed, published or broadcast without the prior consent of Joins.com | Tel: 1577-0510 JoongAng Daily Co., Ltd. | Address: 48-6 Sangamsan-ro, Mapo-gu, Seoul, Republic of Korea Business registration number: 160-86-00572 | CEO: Park Chang-hee, Cheong Chul-gun Mail order business report number: 2020-Seoul Mapo-3838 ",
    "title": "Drop your kimbap and call your oppa, the OED has 26 new additions  ",
    "datetime": "2021-12-02T15:46:43+0900",
    "url": "https://koreajoongangdaily.joins.com/2021/12/02/culture/features/Oxford-English-Dictionary-OED-Kculture/20211202154645096.html"
}