{
    "text": "Mike Krzyzewski is the winningest coach in the NCAA Division I men's basketball history. With four national championships, 957 wins, and a few more years of coaching ahead of him, Krzyzewski will finish his career as one of the greatest coaches in the history of sports. Krzyzewski became Duke's head coach in 1980 and has turned the basketball program into an iconic force. The players who commit to playing for Coach K at Duke receive an incredible amount of exposure, adoration, and criticism. In order to thrive in this environment, Krzyzewski has to be very particular about the players he recruits to Durham, NC. Each player that commits to becoming a Duke Blue Devil must exhibit the following five traits. Anyone familiar with Duke basketball knows that Mike isn't the only Krzyzewski who has an influence on the program. His family is a regular fixture at Duke's home games, and his wife Mickie serves as a motherly figure for many of the players, which is why it isn't uncommon for players to stop by the Krzyzewski home to often talk about things other than basketball. As an extension of the family atmosphere, Coach K wants his players to commit to each other and become part of the Duke family. Whether it's during their college careers or later in life, Krzyzewski expects his players to always remember that they're part of a family at Duke. With his background at the United States Military Academy at West Point and his experience playing and coaching for Bob Knight, Mike Krzyzewski places a huge emphasis on structure and leadership. This structure is dependent upon recruiting players who are coachable and will buy into his system. With coachable players, Krzyzewski is able to instill his mentality and philosophy on every team he coaches. According to an interview with Success.com, Coach K's principle of having coachable players enables him to set different goals for each team based on the personality and abilities of each team. It's part of the reason he often tells business leaders, \"Your team needs to instantly believe what you say.\" Considering his success, it's easy to understand why so many players look forward to the opportunity to be coached by Krzyzewski. Mike Krzyzewski often talks about himself as more of a leader who develops people instead of a coach who develops players. As part of this development, he has also built Duke into a brand that is known for having quality individuals who stay out of trouble and succeed once they move on from the program. He looks for guys with high character who will continue to uphold the standards of that brand. Coach K typically avoids recruiting players with a history of having off-court issues or academic problems because of the friction that it could potentially create in his program. According to the latest rankings from U.S. News & World Report, Duke University is the eighth ranked university in the country. In order for a player to be able to contribute for Mike Krzyzewski on the basketball court, he has to be able to succeed in the classroom at Duke. Coach K looks for individuals who can handle the pressure of being a Duke Blue Devil, both from the academic rigors and the expectations that come with playing in Cameron Indoor Stadium. For Krzyzewski, it's also about keeping the player's interests in mind, saying \"you can't put them in an environment where they're going to have a chance to fail,\" in his recent CNBC interview. Make no mistake about it—talented players are the key to building any successful program. Some coaches might not pay close attention to scouts and recruiting services but every coach is trying to find the most talented players to fit his or her team. Because of Duke's status and Mike Krzyzewski's approach to the game, each year he recruits some of the most talented and highly recruited players in the country. In order for the Blue Devils to continue to compete at an elite level and keep up with their competition, Coach K pursues the best in high school basketball. His reputation and recent success, particularly with the U.S. National team at the Olympics, also gives him a platform for players who have expectations of reaching the NBA. As Krzyzewski said in a recent interview with CNBC, you have \"to have talent to compete for a championship.\" Follow @davidmaldridge ",
    "title": "Duke Basketball: 5 Most Important Traits Mike Krzyzewski Looks for in a Player | News, Scores, Highlights, Stats, and Rumors | Bleacher Report",
    "url": "https://bleacherreport.com/articles/1640010-duke-basketball-5-most-important-traits-mike-krzyzewski-looks-for-in-a-player"
}