{
    "text": "Dulwich College Seoul (DCSL) announced on Jan. 23 that it received “Teaching Initiative of the Year” at the International School Awards 2019. Head of mathematics, Chris Krnic, flew to the awards ceremony in London to receive the distinguished accolade on behalf of Dulwich College Seoul. “After winning the Teaching Initiative of the Year at the British International School Awards 2018, we are delighted to receive this award again in the expanded version known as the International School Awards,” remarked Graeme Salt, head of college at Dulwich College Seoul. “Our initiative is focused on Years 7 and 8 (Grades 6 and 7) Mathematics programs and we believe this successful model can have a significant impact in other subjects across the school as well. We also plan to share our model with 11 other Dulwich schools in the near future.” Dulwich College Seoul was recognized for a newly developed education model in which mathematics students are grouped by ability for each unit in the curriculum, rather than for an entire academic year. In this model, students take a multiple-choice diagnostic assessment before each unit of study, which provides class structures that are regularly and formally subject to change based on ability in future topics rather than performance in previous ones. As a result, the school removed the long-term stigma of certain students being in the “bottom set” and allowed students to receive a balanced exposure to teachers in a fluid system. The school found clear evidence that a fluid grouping structure improved learning across all ability levels compared to traditional year-long fixed settings. The International School Awards are hosted by International School Leader Magazine and sponsored by Pearson, a global educational publishing and services company. The awards recognize outstanding schools in a total of 12 categories each year. This year the awards were open to all international schools for the first time and over 200 nominations were accepted. Dulwich College is one of the U.K.'s oldest independent schools, founded in South London as a boys’ school in 1619. Dulwich College International (DCI) was established to bring the Dulwich education to students around the world and is now one of the fastest growing U.K. independent school networks. Through DCI, Dulwich College has been in Asia for almost 15 years. The Dulwich network currently provides for over 7,200 students in 11 cities and five countries, with colleges in London, the Pudong and Puxi districts of Shanghai, Beijing, Suzhou, Seoul, Singapore and Yangon, international high schools in Suzhou and Zhuhai, and a sister school in Dehong. Dulwich College Seoul opened in 2010, steadily expanded roll to accommodate over 650 students from age 3 to age 18, with over 40 different nationalities represented in diverse student body. Dulwich College Seoul is open to students who have one or two parents who do not have South Korean nationality as verified by an alien registration card and Korean family registry, as well as to Korean students who have lived overseas for no less than 3 years (1,095 days) as verified by the “Entry and Exit Certificate” issued by the Korean immigration department. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Dulwich College Seoul Wins 'Teaching Initiative of the Year' at International School Awards 2019 - Businesskorea",
    "datetime": "2019-01-24T18:14:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=28648"
}