{
    "text": "E-Mart is considering buying a 50 percent stake in Starbucks Coffee Korea from Starbucks Corp. of the United States to make the coffee shop chain in Korea a wholly owned subsidiary. Starbucks Coffee Korea was established in 1997 with Starbucks Corp. and Shinsegae Group's E-Mart going 50:50 in investment. It began operating in Korea in July 1999 and had 1,503 stores in Korea as of December 2020. Sales surpassed one trillion won for the first time in 2016 and continued to grow at 20 percent a year from 2017 to 2019. In 2020, the company racked up 1,928.4 billion won in annual sales. This year, the company looks to top two trillion won in sales. Last year, Starbucks Coffee Korea paid 30 billion won in dividends to E-Mart and its U.S. parent company, respectively. Even if E-Mart owns Starbucks Coffee Korea 100 percent, it must continue to pay royalties as it does now to Starbucks Corp. Starbucks Coffee Korea currently pays about 5 percent of its sales in royalties to Starbucks Corp. for the use of its trademark and technology. Rumors of a breakup between E-Mart and Starbucks Corp. have been going around for years. Until now, many industry insiders have speculated that Starbucks Corp. will run the Korean operations on its own after breaking up E-Mart. In fact, in the past five years, Starbucks Corp. directly managed the coffee shop chains in countries such as China and Japan by taking over stakes held by local partners. If the deal is sealed, Korea will be the only Asian country where Starbucks coffee shops will be 100 percent owned by a domestic company. Starbucks Coffee Korea's sales account for more than one-tenth of Starbucks’ global sales, but its operating profit ratio is reportedly below the global average. Analysts speculate that the two companies are seeking to set up a new cooperation model. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "E-Mart Considering Making Starbucks Coffee Korea a Wholly Owned Subsidiary - Businesskorea",
    "datetime": "2021-03-22T10:36:31+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=62860"
}