{
    "text": "To enjoy additional benefits CONNECT WITH US November 23, 2022 04:37 pm | Updated 08:23 pm IST COMMents SHARE READ LATER Nineteen-year-olds Abby, Saloni and Darshini’s eyes lit up as they swayed to the catchy tunes of K-pop numbers at the Express Avenue Mall, last week. Not just K-pop, Korean culture, cosmetics and beauty products have also struck a chord with the Indian audience whose resonances are being felt deeply. But what fuels this passion? Speaking about K-culture, Saloni said, “Korea is an emotion, Korean food is delicious and K-Pop bands like BTS preach ‘self-love’ which is motivating and uplifting, creating a strong bond.” Held from November 17 to 20, the Korea Fair in India 2022 (KFI) was all about pulsating K-pop music, scrumptious Korean food, stalls displaying Korean beauty and wellness products, information desks and other consumer products. Large crowds swarmed the event organised by Korea Trade Investment Promotion Agency (KOTRA), in association with Consulate General of the Republic of Korea in Chennai. The theme of the fair was Korean wave: Made in Korea, Loved in India. More than 20 B2B booths showcased K-consumer products ranging from food, cosmetics, jewellery, posters, electronics, wellness products in addition to several games stalls. The public was also encouraged to participate and win prizes in the games, quizzes and roulettes. The wide array of food and skin products were also up for tasting and testing. Kamaleshan F, deputy manager, KOTRA said, “The Korea Fair was aimed at enhancing business for the upcoming importers and to encourage other Korean importers. The event registered a footfall of eight lakh people on the second day and six-and-a-half lakh people on the third day.” Fourteen-year-old Anayra was there at the event with her mother Tarana. “I am going to visit Korea in my summer holidays next year. It is my dream destination. “ The teenager’s mother couldn’t help but gush about her daughter’s love for Korean ramen, bibimbap, kimbap and kimchi. “She responds to phone calls with a Korean salutation, and has even learnt to cook Korean food from YouTube,” she added. An all-girls dance group LDC inaugurated the event with a power-packed dance performance. The girls grooved to popular K-pop songs which left the audience hooting, cheering and breaking into intermittent jigs. Sruthi, Rhea, Ananyaa, Aradhana, and Jay came together at a flash mob that happened at the Express Avenue mall in 2017. Rhea said, ‘’A K-pop contest is conducted in India every year. That’s how LDC was formed. We went to Delhi to represent Chennai at the contest.” “The energy of K-pop comes from the idols themselves and their passion to dance. It inspires us to dance and dream. In the West, people connect to lyrics, but K-pop idols are interactive so we feel closer to them,” said Aradhana.  COMMents SHARE The Hindu MetroPlus BACK TO TOP Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. ",
    "title": "\n\tEight lakh K-culture enthusiasts turn up at Chennai’s Korea Fair 2022 - The Hindu\n",
    "datetime": "2022-11-23T11:07:24.000Z",
    "url": "https://www.thehindu.com/life-and-style/eight-lakh-k-culture-enthusiasts-turn-up-at-chennais-korea-fair-2022/article66168302.ece"
}