{
    "text": "Please select Recommendations and/or countries from the drop-down list on the right side. Back\n\n\n\n\t\t\t\t\t\tElectronic encyclopaedia of traditional folk culture © Slovak Intangible Cultural Heritage Centre Location of the initiative: SLOVAK REPUBLIC Relation to Strategy 21 Recommendations: K6 - Develop knowledge banks on local and traditional materials, techniques and know-how Time span of the initiative: 2008- ongoing Brief description of the initiative: The encyclopaedia entitled Traditional Folk Culture Through The Word and Picture (Tradičná ľudová kultúra slovom a obrazom) contains 1,813 entries which use a concise and popular form to provide information on the phenomena of traditional folk culture in Slovakia, the everyday and festive life of its inhabitants (Slovaks and other ethnic groups as well). The chapter devoted to home-made production and crafts contains more than 180 entries with names and descriptions of historic occupations and products accompanied by examples of traditional tools, materials and techniques or production procedures. The collected data origin mainly from the 19th and beginning of the 20th century, but numerous entries reach further to the past and describe also the transformations of cultural phenomena in time and their form at the present moment. The electronic platform collects data of diverse character in order to bring the information in its highest possible entirety, therefore each textual description is accompanied by graphic materials and rich video, audio and film documentation.  The electronic encyclopaedia was prepared in 2008 by the Coordination centre of traditional folk culture and the Institute of Ethnology of the Slovak Academy of Sciences. Objectives of the initiative: Based on the experience and knowledge gained in comprehensive projects carried out during 1990s we had the opportunity to capture authentic living traditions preserved by craftsmen and folk art masters born back at the turn of the 19th and 20th centuries. Brief assessment of the initiative’s results: The electronic encyclopaedia provides the general public the opportunity to obtain diverse knowledge and rare graphic presentations of traditional folk culture and thus stimulates interest in maintaining and disseminating the intangible part of the cultural heritage in Slovakia. Online resources: Contact: SĽUK Centre for traditional folk culture\nDirector\nVladimír Kyseľ\nBalkánska 31\n853 08 Bratislava - Rusovce\nSlovak Republic\n[email protected]  ",
    "title": "Electronic encyclopaedia of traditional folk culture - Culture and Cultural Heritage",
    "url": "https://www.coe.int/en/web/culture-and-heritage/-/electronic-encyclopaedia-of-traditional-folk-culture"
}