{
    "text": "We all know that This Is Us star Milo Ventimiglia is rocking an amazing bod. As patriarch Jack Pearson, Milo's potentially anachronistic buffness has been well-documented. Very well-documented. No one is complaining but when it comes to Pearson family thirst it seems we've been sleeping on recent Emmy-winner Sterling K. Brown who plays youngest son, Randall. Okay, maybe you've been sleeping on it; I've definitely known about this for a while but everyone could use a refresher. The star is featured on the cover of Variety talking about his work, his hit series and his history-making win. Also, not incidentally, he's photographed lounging in bed with a This Is Us script, his second Emmy and the shiniest abs I've ever seen. Like, the wood looks dull compared to him. (This is not a euphemism. I'm talking about the headboard.) I need to know his workout routine and his moisturizing routine immediately. This man has got crunches and cocoa butter on lock and I'm shewk. Sterling K. Brown (with all that boom-boom-pow on the body, you have to use his whole name. Including middle initial. Social Security number, too, if you have it.) gave us a glimpse of what lies beneath Randall's impeccably tailored suits last March with this Instagram. This belongs in the humblebrag thirst trap hall of fame. This is a work of art! Sterling K. Brown, two-time Emmy winner, nails it: the casual body-builder pose, the selfie smirk, the partially obscured face perfect for sliding into people's DMs with plausible deniability. And, best of all, is the caption in which he reminds us that 1) he's working on a Predator movie, 2) it's with Trevante Rhodes from Moonlight who is boom-boom-pow incarnate, and 3) Sterling K. Brown is 40 years old and knows he looks damn good. This is so much! It's too much. I'm spent. In the Variety profile, Sterling K. Brown spends most of his time talking about his work on This Is Us and his reaction to winning back-to-back Emmys. But the actor, who was literally studying lines while in his boudoir photoshoot, does deliver one piece of devastating news. Rattling off Sterling K. Brown's packed slate of upcoming projects, Variety Executive Editor Debra Birnbaum drops this horrific bombshell: \"One thing we won’t be seeing, though, is any nudity.\" Apparently, the upcoming film Marshall included a revealing love scene between Sterling K. Brown and Kate Hudson. \"Kate and I both collectively were like, Woah,\" he's quoted as saying. \"I clutched my pearls! But it’s going to be good, even without the booty shot.\" First of all, Sterling K. Brown, surprisingly buff, Stanford-trained actor, uses the terms \"clutch my pearls\" and \"booty shot\" so everything is not so bad in the world. Second of all, Sterling K. Brown does not want his booty on screen so everything is terrible in the world and you should go back to bed. In a video accompanying the profile, Sterling K. Brown, clothes-wearing hottie, also shows off what he calls his \"lucky socks,\" which bear the word \"Namaste.\" Get into that extension! I can't with this Hatha Hottie. Sterling K. Brown's leg pop is going to single-handedly revive NBC's other great series, Smash. Here for it. While I wait for that, I'll just be over hear watching the new season of This Is Us, praying for more push-up-centered episodes for Sterling K. Brown, possessor of blindingly bright abs and two Emmy awards. Follow R. Eric Thomas on Twitter. R. Eric Thomas is a columnist for ELLE.com, where he skewers politics, pop culture, celebrity shade, and schadenfreude. He is also the author of Here for It: Or, How to Save Your Soul in America, a memoir-in-essays. The Year 2020 as Told By Dionne Warwick Tweets Suddenly, I Am an Expert on mRNA White House Shocks with Non-Terrifying Christmas Fate of Nation Rests on One Person Hitting Send Let's Hear It for the Depressed Christmas Tree Sad! Trump Fights the Tyranny of Reality Republicans Divided Over How to Obstruct Election Trump Should Ask Warren Beatty to Call Election Man of the People Locks Himself in Borrowed House We Are Entering The Biggest \"Not Yet\" Season Ever What to Do With Your Celeb Private Island Invites We Must Find Out What the Moon Is Plotting A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "title": "Emmy Winner Sterling K. Brown Has Yoga Socks and the Shiniest Abs You've Ever Seen",
    "datetime": "2017-09-25T15:30:35Z",
    "url": "https://www.elle.com/culture/movies-tv/a12436489/emmy-winner-sterling-k-brown-has-yoga-socks-and-the-shiniest-abs-this-is-us/"
}