{
    "text": "- For 46 days from January 14, as an online promotion Korea Grand Sale 2021 is held online from January 14 to February 28. It will be opened with the online concert of K-pop idol singer OH MY GIRL. Korea Grand Sale 2021 offers a variety of programs: Online Cultural Tours Around Korea wherein people can experience and purchase Korean cultural content in a contactless way; Special Online Shopping Mall Event wherein discounts are offered for items of K-beauty, K-food, and K-fashion, which are popular among foreign tourists; Korean Tourism Products Pre-purchase Promotion which offers discounts on tourism products to encourage foreign tourists to visit Korea when the COVID-19 era comes to an end; and Share Your Korea, a social media campaign with a hashtag designed to promote foreigners to participate on social media as well as on the Internet. (Graphic: Business Wire) Korea Grand Sale 2021 is held online from January 14 to February 28. It will be opened with the online concert of K-pop idol singer OH MY GIRL. Korea Grand Sale 2021 offers a variety of programs: Online Cultural Tours Around Korea wherein people can experience and purchase Korean cultural content in a contactless way; Special Online Shopping Mall Event wherein discounts are offered for items of K-beauty, K-food, and K-fashion, which are popular among foreign tourists; Korean Tourism Products Pre-purchase Promotion which offers discounts on tourism products to encourage foreign tourists to visit Korea when the COVID-19 era comes to an end; and Share Your Korea, a social media campaign with a hashtag designed to promote foreigners to participate on social media as well as on the Internet. (Graphic: Business Wire)  SEOUL, South Korea--(BUSINESS WIRE)--MCST (Ministry of Culture, Sports, and Tourism; Minister: Park Yang-woo) and VKC (Visit Korea Committee) will host a culture & tourism festival for foreigners 'Korea Grand Sale 2021' from January 14 to February 28. Korea Grand Sale is a representative festival of shopping, culture, and tourism that provides attractive tourism contents and shopping benefits to attract foreign tourists during the off-season of tourism in winter. This festival will be specially held online in 2021 due to the COVID-19 situation. Korea Grand Sale 2021 offers a variety of programs: Online Cultural Tours Around Korea wherein people can experience and purchase Korean cultural content in a contactless way; Special Online Shopping Mall Event wherein discounts are offered for items of K-beauty, K-food, and K-fashion, which are popular among foreign tourists; Korean Tourism Products Pre-purchase Promotion which offers discounts on tourism products to encourage foreign tourists to visit Korea when the COVID-19 era comes to an end; and Share Your Korea, a social media campaign with a hashtag designed to promote foreigners to participate on social media as well as on the Internet. The Korea Grand Sale 2021 will be opened with the online concert of K-pop idol singer ‘OH MY GIRL’ for 46 days from Jan. 14. For further information, please visit the official website of the Korea Grand Sale (www.koreagrandsale.co.kr).  Visit Korea Committee\nKim Moon-joo, Marketing Manager\n+82-2-6272-7307\nonlyou6@vkc.or.kr Korea Grand Sale 2021 for foreigners is held online from January 14 to February 28 with a variety of programs and promotions. Visit Korea Committee\nKim Moon-joo, Marketing Manager\n+82-2-6272-7307\nonlyou6@vkc.or.kr ",
    "title": "Enjoy the Amazing K-Contents Online... Korea Grand Sale 2021, a Culture & Tourism Festival for Foreigners, to Be Held Online  | Business Wire",
    "url": "https://www.businesswire.com/news/home/20210107005363/en/Enjoy-the-Amazing-K-Contents-Online...-Korea-Grand-Sale-2021-a-Culture-Tourism-Festival-for-Foreigners-to-Be-Held-Online"
}