{
    "text": "The author is an analyst of Shinhan Investment Corp. He can be reached at gwak81@shinhan.com. – Ed.  Korean New Deal The Korean government, on July 14, announced its version of a “New Deal,” a comprehensive national development strategy aimed at lifting the domestic economy out of COVID-19 impact and a prolonged low-growth trap. The Korean New Deal places the country ahead of others in terms of fiscal stimulus. The EU, as a union of multiple countries, remains slow in making decisions. The US is facing difficulties in implementing a nationwide policy amid a spike in COVID-19 cases ahead of the November presidential election. China unveiled its blueprint for infrastructure development, but doubts remain on whether the IT-focused infrastructure policy can be executed rapidly amid continuing conflicts with the US. All in all, the New Deal definitely sets Korea apart from others. The Korean government's New Deal focuses on building a more digital and green economy. We believe the pandemic accelerated the inevitable shift in that direction, required to drive sustainable growth. The New Deal, which promises enormous investment in a wide range of areas, will likely have a significant impact on select industries and companies rather than the entire market in the near term. The deal features 28 projects in nine focus areas (seven when excluding those related to safety nets). We recommend focusing on beneficiaries of the 10 key projects for the development of investment ideas. 10 key projects to promote growth of non-face-to-face and green industries The government has selected 10 key projects: three for Digital New Deal, three for Green New Deal, and four for digital-green industrial convergence. For the Digital New Deal, focus is placed on three key projects –data dam, smart (AI) government, and smart healthcare. Data dam, an unfamiliar term to many, refers to a solid foundation built for big data collection to support the convergence of 5G communications and AI. This project is designed to establish a flawless 5G platform in advance and drive the development of future growth engines such as virtual/augmented reality. A 5G platform should also enable autonomous vehicle deployment, promoting the competitiveness of Korean players in related industries. Another area to benefit from the 5G platform is smart factories. Smart factories powered by AI systems should be able to drive the reshoring of production facilities that were relocated overseas from the rise in labor costs. This will help the country cope with the de-globalization trend that is set to intensify in the post-pandemic world. We expect the data dam project to bring attention to stocks related to 5G, smart factories, and autonomous driving. The smart (AI) government project aims to improve the quality of public services through the adoption of 5G and blockchain technology. Adoption of blockchain technology coupled with 5G capabilities is no longer a choice but a necessity as countries around the world consider introduction of central bank digital currencies. Development of an integrated network of public systems, targeting to enhance convenience for government service users, would require big data centers and should thus benefit cloud and big data-related stocks. The smart healthcare project is focused on building a platform for non-face-to-face medical services, which are in high demand amid the pandemic. Smart hospitals should promote cooperation between medical institutions and help to provide quality services for people with poor medical access. The project will also focus on the development of IBM Watson-like diagnostic systems with big data analysis and self-learning features to help lower misdiagnosis rates. Expected beneficiaries include developers of Internet of Things (IoT) devices, smart medical devices, and medical AI systems. For the Green New Deal, emphasis is placed on three key projects: green remodeling, green energy, and eco-friendly mobility of the future. The green remodeling project is designed to enhance energy efficiency of buildings through the use of solar generation systems or eco-friendly insulating materials. We expect companies producing or installing eco-friendly tools/materials, LED lamps, and solar panels to benefit from the project. The project for green energy production, a popular theme these days, aims to increase renewable energy generation from 12.7GW in 2019 to 42.7GW in 2025 by fostering the industry ecosystem. Massive investments in wind, solar and hydrogen energy are needed for the targeted three-to fourfold expansion of power generation capacity in the next six years. Related energy companies should benefit greatly from the project. The eco-friendly mobility project focuses on providing investment and support for vehicles powered by renewable energy sources such as electric and hydrogen cars. It also includes support for the early scrapping of old diesel cars and adoption of diesel particulate filters (DPF) for old vessels. Hydrogen-related support is notable, considering that Korean automakers boast strong competitiveness in hydrogen vehicles. We expect benefits for related companies. For digital-green industrial convergence, the government plans to focus on four key projects: green and smart schools, digital twin, digitalization of SOC, and smart and green industrial complexes. Excluding overlapping areas with Digital/Green New Deal tasks, we focus on the following details of each project. The project for green and smart schools will focus on building a digital education platform, given low levels of satisfaction for public education through online classes that were introduced abruptly amid the pandemic. The shift toward online education could further boost demand for private education services as a supplement or substitute. The digital twin project aims to build a digital replica of reality. It focuses on establishing a real-time monitoring system for public utility facilities and developing high-precision road maps. The digital SOC project has a similar goal. The smart and green industrial complex project targets to set up a system to monitor and control energy/environment-related activities of private companies. These three projects are expected to benefit companies related to IoT, virtual/augmented reality, and monitoring software. Focus on the trees in the near term The Korean New Deal covers a wide range of industries and infrastructure projects, and is thus likely to bring drastic changes to the Korean economy as a whole in the long run. The stock market also stands to see significant impact in the long-term. In the near term, however, we recommend focusing on individual industries and companies likely to immediately benefit from the massive government support. The KOSPI is unlikely to instantly multiply in value from the introduction of the Korean New Deal. However, for select industries and companies, we expect visible growth to start from this year or the next. The comprehensive development strategy offered by the government provides a peek into the Korean economy ten years from now. The blueprint for “untact” and “green” economy (key topics in the COVID-19 world) will likely have a positive impact on the Korean economy and relevant industries. We hope the Korean New Deal will provide a good example for other countries going forward. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Equity Strategy: Korean New Deal Investment Strategy - Businesskorea",
    "datetime": "2020-09-28T18:46:21+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=52587"
}