{
    "text": "Everland announced on July 22 that its Giant Panda couple had given birth to a new, tiny Giant Panda of their own two days before. The baby panda, measuring 16.5 cm and weighing 197 grams, is the first Giant Panda born in Korea. Everland Zoo received a pair of pandas, Ai-Bao (爱宝, age 7, female) and Le-Bao (乐宝, age 8, male), from China four years ago. The two pandas have been extremely popular ever since they flew about 2,400km to South Korea’s Everland Zoo from Sichuan Dujiangyan Panda Habitat in China in March 2016. Since then, they have lived in Panda World, one of Everland Zoo’s attractions, and received about 9.5 million visitors there over the last four years. Pandas find it difficult to get pregnant and give birth. The time in which they can conceive is quite short. They can become pregnant only one to three days a year, usually sometime between March and April. As pandas are solitary animals, meeting the right panda at the right time is tricky. Also, early health management is very important, as babies are born premature. If pandas succeed in mating during the fertile window between March and April, they go through about four months of pregnancy and give birth sometime in July or August. Pandas are always summer babies. These summer babies are also smaller than other bears when they are born. They are born in a premature state and are about 1/900th the weight of an adult panda. Therefore, they require very intensive early health management. Only 1,800 pandas are believed to remain in the wild, a rare animal that the International Union for Conservation of Nature and Natural Resources has designated “Vulnerable,” a species considered to be facing a high risk of extinction in the wild. Including in their wild habitat in China, pandas live in 20 countries including the U.S., the U.K. and Germany. To give the pandas the best chance of a child, the staff at Everland Zoo regularly changed Ai-Bao and Le-Bao’s rooms, so they could be accustomed to each other’s scents. The staff also made sure to give them the best and most nutritious foods in the spring. Additionally, the zookeepers identified the best and most successful mating date by analyzing the pandas’ hormonal changes via regularly testing their blood and urine and giving them regular health checkups. After all of this effort, the couple successfully mated at the end of March, right in the middle of the normal period. However, because a panda’s newborn is so much smaller than the mother’s 122 kg of weight, the team couldn’t be sure that Ai-Bao was pregnant until the birth was very close. When she became a lot more sensitive and began to eat much less, the team knew that birth was imminent. They continuously observed her behavior and appearance changes, and moved her into a dedicated labor room where she could be monitored 24 hours a day. There was a lot of hidden effort from many different people to ensure that this new life was born. Now that the baby panda has been born, Everland staff have set up a special residence inside Panda World to help the 197 gram baby panda grow up healthy and strong. This area is closed to the public for the time being, as the baby’s health is the top priority. According to other panda experts and based on other cases in the U.S. and Japan, baby pandas are strong enough to be open to the public from at five to six months old when they can walk well and eat their own bamboo. At that time they develop a stronger immune system and have adapted to being outside. “I’m so happy that Ai-Bao and Le-Bao, who have been living together for four years, have become parents,” said Kang Chul-won, a breeder at Everland who is in charge of pandas. “I hope that people will forget their tired daily lives for a while and receive the energy of hope for a new life with the news of the baby panda’s birth.” Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Everland Succeeds in Natural Birth of Giant Panda - Businesskorea",
    "datetime": "2020-07-23T11:21:58+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=49419"
}