{
    "text": "Chinese cyberspace authorities have ordered a crackdown on the country’s fandom culture, hoping to curb what they have called “toxic idol worship” in the wake of several high-profile celebrity scandals. Zealous support from young fans amid allegations of celebrity tax evasion and sexual assault have raised government concerns about the frenzy around idols. But what is a fandom? Is it really that bad? What exactly does the crackdown entail? Here’s what you need to know. Hong Kong star Nicholas Tse on renouncing Canadian citizenship A fandom is a highly organised group of fans, who are willing to devote time and money to increase their idol’s popularity. Within fandoms, administrators organise groups of fans on different media platforms, such as Tencent and Weibo. These managers assign different tasks to fans every day to boost the celebrity’s ratings or exposure. Tasks can include sharing, liking and commenting on social media posts. The most devoted fans will sometimes even spam social media, spread fake news to hijack public opinion, and use bots to increase traffic data related to their idols. In 2018, Chinese-Canadian Kris Wu Yifan, ex-member of the hugely popular Korean-Chinese boy band EXO, beat American pop star Ariana Grande to top the US iTunes chart with his album “Antares”. This drew speculation that his fans had used bots to manipulate the streaming data and sales figures of the Chinese star, who is not as well-known in the West. American media outlet Variety reported at the time that Grande’s manager Scooter Braun had written in a now-deleted Instagram post about a conversation he had with Wu: “It was explained to [him] and I last night that because his release was held back in China for his birthday his fans went and got the music any way they could and that was US [iTunes] ... Those were real people from the US and international community and not bots like many have rumoured.” Fans create fake name cards to see Canto-pop boy group Mirror According to a report published by iResearch Consulting Group in 2020, the market value related to the fan economy in China was estimated to be more than 4 trillion yuan (US$619.2 billion) in 2019, and was projected to surpass 6 trillion yuan in 2023. On Weibo, China’s equivalent of Twitter, the most shared post of all time is a birthday post from September 21, 2014, by Karry Wang Jun-kai, member of mega Chinese boy band, TFBoys. The post has been shared 42,776,438 times, holding the current Guinness World Record of “the most reposts of a Weibo post”. In June, the Cyberspace Administration of China posted a statement on its official website stating that fans had been fighting and spreading rumours about other idols online, which “disrupted the pure and healthy online ecosystem”. It continued to explain that the fan culture phenomenon had “harmed the mental and physical health of young people”. In late August, Chinese authorities ordered a harsher crackdown following Kris Wu’s detention this month for alleged rape. Wu’s fans were seen gathering at the police station where the star was detained, as they sang in support of the male singer. These actions received harsh criticism online, as internet users accused fans of being shamefully devoted to the accused singer. Tencent and Weibo closed down social media groups where some of his fans expressed they “believed in Wu and would wait for his release”. Some extreme fans even said they would plan a prison break to free Wu. China will limit children to three hours of online gaming per week Since its initial statement in June, the Cyberspace Administration of China has deleted more than 150,000 “harmful messages”, closed down more than 4,000 social media accounts and taken at least 39 mobile apps offline. To further weed out what it deemed as “toxic fan culture”, the Office of the Central Cyberspace Affairs Commission announced a 10-point regulation late last month. Under the new regulations, all lists ranking celebrities will be removed. Rankings of music, films and other works by celebrities can be kept as long as they do not name the stars directly. Why Hong Kong loves Anson Lo and Canto-pop band Mirror Celebrity agencies will also face tighter regulations in regards to content release, commercial promotion and fan management of celebrities. Agencies have been ordered to take a stronger role in monitoring fan groups to deal with accounts that start fights between fans with differing opinions. Teenagers are banned from joining fan clubs. They are also restricted from voting online for idols and spending money on idol-boosting activities, which include buying products for which an idol is a spokesperson. Authorities said the move was meant to keep fan culture from disrupting their studies and daily life. As the government continued to clean up the entertainment industry, one of China’s biggest film stars, Zhao Wei, was scrubbed from the internet in late August, with descriptions of her involvement removed from all television series, films, videos and promotional materials online. On August 6, Weibo announced the removal of its Star Power Ranking List – one of the most popular virtual battlegrounds where Chinese fans shower money and time to show their love and support for idols. The company said the list had been removed “to ensure the orderly development of the community and to make sure fans were rational in their support”. Likewise, Douyin, TikTok’s sister app in China, and Kuaishou, a short video-sharing app backed by Tencent, have removed celebrity rankings from their platforms. In late August, Gong Yu, founder and CEO of streaming giant iQiyi, said at a symposium that iQiyi had cancelled its idol talent show and online voting features for the next few years. “iQiyi ... always insists on drawing a clear line against unhealthy trends in the industry,” Gong said, adding that the company did not support paying stars an unreasonably high amount or allowing them to evade taxes. ",
    "title": "Explainer: What is the reasoning behind China’s crackdown on ‘toxic’ fandom culture, and how are people reacting? - YP | South China Morning Post",
    "url": "https://www.scmp.com/yp/discover/news/asia/article/3147895/explainer-what-reasoning-behind-chinas-crackdown-toxic-fandom"
}