{
    "text": "As the Western music world unravels with big names like R Kelly and Michael Jackson coming under fire for sex abuse scandals, a similar situation has been unfolding in the increasingly popular K-pop industry. Over the years many Korean artists – professional labelled as “idols” – from veteran group Super Junior’s Kangin’s DUIs (in 2009 and in 2016) and involvement in assault cases, to the Big Bang artist T.O.P’s marijuana controversy, and many others the list of those embroiled in scandals has been growing longer. The latest, and most horrifying, instance referred to as the ‘Burning Sun Gate’ has in essence exposed a K-pop crime cartel. A slew of adored artists – including Big Bang’s Seungri, FT Island’s Choi Jung Hoon, Highlight’s Yong Jun-hyung and entertainer Jung Joon Young – were proven to be part of a group chat where surreptitiously filmed videos of women were shared, with some members of the chat also engaging in prostitution, and alleged sexual assault. Starting off in January 2019 with footage of a man being assaulted by guard of Burning Sun – a club of which Seungri was known as executive director – became a saga of crime and corruption in the following months. Crimes including prostitution mediation, filming and circulation of illegal hidden camera footage, drug usage, bribing the police, gambling, tax evasion and most recently sexual assault became ‘Burning Sun Gate’ which shook Korea. – – –  – – – As well-known names and their disconcerting list of crimes were revealed one after another bringing attention to the dark side of supposedly “inspirational” public figures, fans – no matter how supportive – were expected to understand that this is much more than just the clumsy quirks of their idols. And yet many people continued to fiercely defend and support their favourite K-pop idols. This is where we should begin to consider if the “idol culture” that is prevalent in Korean entertainment does more harm than good. This culture is something that undeniably extends to the West as well. As R Kelly’s numerous sexual abuse allegations became a talking point, the loyalty of many of fans remained unchanged. As the six-part documentary highlighting his crimes – Surviving R.Kelly- indicated that people still had hollow justifications to offer in his defence. But the difference between the defenders of R Kelly and those of K-pop artists like Seungri is that while R Kelly fans displayed nonchalance or detachment to his actions – defending him with “There are two sides to every story,” “Who are we to judge?” and “He’s been the same for years” – those of Seungri and many others have remained fiercely and passionately defensive of their “oppa” (older brother) – with beliefs that Seungri, in particular, was witch-hunted and that everything has been a plot against him. An idol is defined as a person who is greatly admired, loved, or revered. But why are people like those involved in ‘Burning Sun Gate’ awarded that title without any effort? Since the advent of the genre in the mid-90s, K-pop idols have been groomed by their management teams to have clean, near perfect images – with every visible fault, of personality or actions, glossed over as jokes. This projected perfection which includes fan-service such as artists interacting with their fans informally via social media, and indulging them in their romantic “idol boyfriend” fantasies, can be fun and harmless. But where do you draw the line and understand that not every action is defendable or forgivable? Speaking to a range of fans of the polished, gimmicky and increasingly popular genre, the general consensus is that putting these artists up on a pedestal is doing no one any good, as it prompts them to abuse this undying support. Musician and student Rhianne Mee, 20, says: \"Fandoms can be possessive of their idols, unable to accept when their favourites have done wrong. But in Big Bang’s case, Seungri’s issue is beyond opinion, it’s a crime.\" – – –  – – – These crimes that Rhianne mentions are unfortunately not limited to the Korean entertainment industry. News reports indicate that the crime of secret filming is rampant throughout the country with a South Korean hotel found guilty of filming 1500 guests without consent, while other stories strewn across the internet reveal that sexual abuse of women – rapes remain incredibly difficult to prosecute – is largely hushed into non-existence by mandates of Korean culture. Nottingham Trent Linguistics student Jade Shepherd, 21, believes that Seungri’s issue helped shine a light on a society-wide problem. She says: “If the scandal hadn’t happened the widespread issue of spy cams in the country may not have been brought to attention. But I believe the impact on the industry should be much more severe.” But what could have been a positive revelation to improving attitudes in the conservative country such as Korea was flipped on its head when fans – both Korean and international – began to defend those accused of the crimes. Korean, and Asian, traditions at large have always been deeply rooted in a chase for perfection. It’s these values of perfection that are often reflected in K-Pop. Long-time fan Ruqaya Malik says: “K-Pop is meant to be a fantasy. Idols put on a flawless performance on stage and don’t expect people to believe that’s who they are in real life. But social media and variety shows that present these idols as perfect, thus making it harder for fans to reconcile or accept when they do something wrong.” She adds: “The industry can definitely be something that entertains and inspires people, but marketing strategies and obsessive fans have turned it crazy and toxic.\" As each passing day shines a new light on the ugly side of pretty idols – in the last few days JYJ’s Park Yoochun tested positive for methamphetamine(crystal meth) use – it becomes time to redefine “idol culture” and for fans to open their eyes to the fact that there may be a very dark side to the people they idolise- and that they themselves are possibly part of a much bigger problem. – – – Words: Malvika Padin Join us on Vero, as we get under the skin of global cultural happenings. Follow Clash Magazine as we skip merrily between clubs, concerts, interviews and photo shoots. Get backstage sneak peeks and a true view into our world as the fun and games unfold. Buy Clash Magazine   ",
    "title": "Exploring The Darker Side Of K-Pop's Stan Culture | Clash Magazine Music News, Reviews & Interviews",
    "datetime": "2019-04-26T13:37:14+00:00",
    "url": "https://www.clashmusic.com/features/exploring-the-darker-side-of-k-pops-stan-culture/"
}