{
    "text": "All Headlines North Korea Sports Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies URL is copied. SEOUL, April 14 (Yonhap) -- Exports of Korean cultural products, including computer games, music, tour programs and cosmetics, soared 22.4 percent last year from a year earlier thanks to the global ascent of Korean culture, a report showed Tuesday. According to the report on the 2019 economic effects of hallyu, or the Korean Wave, released by the Korean Foundation for International Cultural Exchange (KOFICE), hallyu-related exports came to US$12.3 billion last year, up 22.4 percent from 2018. Of the total, exports of cultural content including computer games, K-pop and broadcasting programs rose by 19.2 percent to $6.38 billion, while overseas sales of consumer goods such as tour programs, cosmetics and groceries shot up 26.1 percent to $5.93 billion, according to the report. Korean computer games were the biggest Korean cultural content export, with overseas sales of $4.7 billion last year, followed by the K-pop industry's exports of $533 million. On the consumer product front, tour products were the biggest export with $2.65 billion in sales, followed by cosmetics with $969 million. The 2019 figure for tourism exports, in particular, marked a growth of nearly 88 percent from a year earlier. The report put the value of the effect on production inducement by hallyu, or the global popularity of Korean culture, at 25.7 billion won (US$21.1 million), up 28.6 percent from a year ago. This year, the South Korean entertainment industry stepped further into the international limelight after the Korean film \"Parasite\" won four top Oscar awards while K-pop boy band BTS earned its fourth No. 1 on the Billboard 200 albums chart. A consumer browses shelves stocked with instant noodle products at a supermarket in Seoul on April 6, 2020. (Yonhap)  pbr@yna.co.kr(END) All News National North Korea Economy/Finance Biz Culture/K-pop Sports Images Videos Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies Korea in Brief Useful Links Festival Calendar Weather Advertise with Yonhap News Agency ",
    "title": "Exports of Korean culture products soar 22.4 pct last year | Yonhap News Agency",
    "datetime": "2020-04-14T18:05:26+09:00",
    "url": "https://en.yna.co.kr/view/AEN20200414009800315"
}