{
    "text": "Travel is expensive and uncomfortable. You have to get off your couch and leave the house, for one, and the next meal is always a mystery. Unless you travel with K-TV. K-pop, the musical sound of South Korea’s army of young entertainers, has in recent years put the nation’s culture on the international stage, leading to a deluge of K-entertainment and K-products. On Dec. 18, when Kim Jong-hyun of boy band SHINee committed suicide, fans in Costa Rica petitioned to protect the mental health of young Korean stars. In November, the boy band BTS performed at the American Music Awards. US drugstores are packed with K-beauty products promising skin as fresh as the faces of K-pop. And people everywhere are watching Korean TV productions. Variety shows, cooking competitions, police procedurals, and soaps known as K-dramas are all finding audiences abroad. So much so that this past April Paste magazine reported that in parts of the Middle East, Korean shows are scheduled so their broadcasts don’t coincide with Muslim prayer times. There’s also plenty of K-fun available for streaming-TV audiences, where timing’s not a problem. In April, Netflix signed a licensing agreement with South Korean broadcaster JTBC, acquiring the rights to 600 hours of its television programming. Among the offerings on Netflix is Chef and My Fridge, which in Korea goes by a name that translates literally (and roughly) to “Please take care of my refrigerator.” In this culinary showdown, the fridges of Korean celebrities are trucked into the studio and chefs compete to make the best quick meals for the famous guests, using only the contents of their own refrigerators. The antics are entertaining, yet valuable cooking and cultural lessons also abound. For example, the show reveals how to elevate instant ramen into a proper meal, and how to dine with the kind of gusto that will draw admiration from a table of Korean eaters—”he eats so nicely” is a compliment common on the show, and rarely heard at tables in the US. Perhaps most fun, the cooking competition provides a window into the lives of Korea’s celebrities—at least the parts they’ll show. After watching Chef and My Fridge I now know that every self-respecting Korean celebrity has kimchi in their fridge, and not just any kind. It’s got to be mom’s kimchi, or grandma’s, perhaps a mother-in-law’s, but definitely not store-bought. I’m also becoming familiar with the pressures K-pop stars are under, having watched Cao Lu—a Chinese member of the Korean girl group Fiestar—weep about her mom’s cooking. It’s been many years since she’s eaten at home regularly; like other young K-poppers, Cao Lu has basically been in entertainment bootcamp from the time she was a teenager until she reached adult stardom. This life story is recounted by every one of the many singers who visit Chef and My Fridge with their refrigerators. The show reveals that Korean celebrities live very differently from their American counterparts. In Korea, stars share apartments and fridges with band members and family, and don’t seem to worry about keeping up with the Kardashians at all. For example, G-Dragon of the hugely popular boy band BigBang—who snacks on oysters, caviar, and foie gras—lives with his parents. (His episodes, numbers five and six, were so charming they got me watching BigBang videos on YouTube nonstop.) You needn’t speak Korean to get Chef and My Fridge because it’s got subtitles, of course. Also part of the fun for a non-Korean is in the not-always-understanding. For example, because visual references differ in the east and west, the on-screen graphics of the show can be mysterious to those in North America or Europe. Case in point: embarrassment, which for Westerners is often illustrated by blushed cheeks, is typically expressed on the show with gusts of wind blowing from the nostrils or beads of purple sweat. Sometimes, a wide-brimmed black hat with a chin strap appears on screen seemingly out of nowhere. After it happens a few times, you’ll put two and two together, and realize the hat shows up whenever the show portrays or discusses traditional Korean food. Then you might go to Google and discover that the hat is actually a gat, traditional Korean menswear. Chef and My Fridge also yields culinary benefits. Watching the chefs whip up home-cooked meals with whatever’s around is inspiring. Much can be done with little. Actress Kang Ye-Won, for example, gets her groceries at convenience stores, but even her instant foods and chocolates were enough for the show’s contestants to make multiple dinners and lovely desserts. When she’s not letting chefs dig through her fridge, Kang stars in another piece of popular K-entertainment, the drama Bad Guys. The show is about a drunk, broken cop, played by Sang Joong Kim, who goes into prisons to seek out the worst criminals he can find, then pulls them out and forces them to help catch even worse criminals. The old officer and his gang of freed psychopaths band together for causes they’re surprised to find they have in common, all under the watchful eye of an ambitious up-and-coming police officer played by Kang. This stylish and riveting series has a range of fascinating faces from young and pretty to old and broken, plus what must surely be the handsomest man on TV with no IMDB photo, Jo Dong-Hyuk. Jo masterfully plays a hitman so able and noble that he’s only imprisoned because he turned himself in to make amends for his many murders. To make further penance, he’s been anonymously sending money to the widow of one of his victims while he sits in prison. Somehow he managed to convince me that such a person could exist, and even make me wish he did. But not all K-TV is created equal. Just like pop culture from anywhere else, what’s awesome about some Korean shows is that they’re no good. That’s true for Quiz from God, a crime drama about a genius medical examiner who solves murders while wearing infinity scarves. It’s a bit silly, with its pontificating young genius holding elders in thrall, but still worth checking out for the unintentional laughs and over-the-top neckwear. Refinery29 recently published a guide to K-drama that predicts these shows will be “your next big obsession” because they’re “known for their action-packed narratives, gripping story arcs, pulpy relationships, and, of course, terrifically good-looking lead actors.” That may be true but it doesn’t quite get at how big an impact a brief immersion in K-culture can have on your life. My kitchen, meals, and musical listening habits have transformed in just six months of getting into K-TV. Now, my husband and I share K-pop gossip like we’re talking about people we know, and my whole family is hooked. Jewish New Year preparations in the Livni household this year involved lots of dancing to videos by TOP, another member of BigBang even more delightful than G-Dragon—that is, if you believe my mom, niece, nephew, and me. At this point, a trip to Seoul seems almost inevitable. Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  ",
    "title": "Fall in love with pop culture again, thanks to Korean TV on Netflix",
    "datetime": "2017-12-24T10:20:06.813Z",
    "url": "https://qz.com/quartzy/1162542/fall-in-love-with-pop-culture-again-thanks-to-k-tv-on-netflix"
}