{
    "text": "Subscribe Now! Get features like New Delhi Riding high on the Korean wave, when Delhi University students took to stage to shake a leg and compelled the audience to join in with cheers and applause. At the recently held first-ever Karnival: Korean Cultural Fest by Lakshmibai College, Delhi University, the amphitheatre was filled with enthusiasm and zest due to the high octane dance performances and K-drama based contests. There were also stalls where one could buy K-pop posters and get the hair braided or experiment with a temporary tattoo. Students from across the varsity turned up to attend the extravaganza that reverberated with fandom. “Finally, an event on campus that did not have Punjabi songs playing on the console. Fans like me need more events like this, please,” quips Ria Thangjam, second-year student of BA (Hons) Political Science at Indraprastha College for Women. Independent dance groups comprising students from different universities, across NCR, brought all the jazz to the stage with their performances. Among these was Delhi-based dance team Kumi. “It was such a memorable day for all team members as this was our first-ever public performance! We chose to perform on some of the most iconic K-pop songs by three biggest K-pop groups namely, I Need U by BTS, Fancy by Twice and Boombayah by Blackpink,” says Sarah Nautiyal, from Kumi, adding, “We never expected to receive so much love and support for our first live performance. But needless to say, the love for K-pop among the DU crowd is so much that all that we took back was supportive cheers, to cherish for a long time.” Bingeing on popular Korean dishes such as Tteok-bokki (rice cakes), stir-fried kimchi and banana milk, many attendees splurged on polaroids of K-pop artistes. One among them was Shivani Kumari, second-year student of BA (Hons) Political Science at Lakshmibai College, who shares, “I bought two small photos of V from BTS (South Korean boy band), and it’s going into my treasured collection. But, what I loved the most about the fest was the ambience of the event, which was very much in sync with the theme. I loved the pink-purple hangings in the trees as these looked super cute.” Adding to this, Siddhiksha Rana, second-year student of Gargi College, says, “It was so much fun to interact with fellow K-culture lovers. We haven’t had such a fest ever, and most of us enjoyed it thoroughly.” “Almost a thousand students attended the event,” informs Chostina Oinam, organising team member and second-year student of BA (Hons) History, adding, “It was just an idea that we came up with when we sat down together to think what could we do to bring some vibe on campus. Turning mere words into reality, we kind of made history by being a success in the first go itself. We hope in the next edition too, K-fans show us the same love when we bring back this event.” Author tweets @priyaanshie_ For more stories follow Facebook and Twitter   ",
    "title": "Fandom fever: K-culture sweeps DU’s Lakshmibai College | Latest News Delhi - Hindustan Times",
    "datetime": "2022-11-17T12:48:42+05:30",
    "url": "https://www.hindustantimes.com/cities/delhi-news/fandom-fever-k-culture-sweeps-du-s-lakshmibai-college-101668669523459.html"
}