{
    "text": "The ears of millions of young music fans have been captured by its polished pop, foodies have been tantalised by its gastronomic delights, and the country’s artists and actors are also part of a creative wave, known as hallyu, that is establishing South Korea as a major cultural force. Tottenham Hotspur’s Son Heung-min was the latest to join the line of cultural pioneers, trotting off the pitch at Manchester City’s Etihad stadium on Wednesday as his nation’s flag was waved by a delirious Spurs fan and others sang a song dedicated to him: “Nice one Sonny, nice one son.” He was not the only Korean hitting the heights in Britain in recent days, as BTS became the first K-pop act to top the national charts and their two dates at Wembley in June sold out within minutes. Son’s two goals helped his team secure a place in the semi-finals of the Champions League, and although they were beaten 4-3 by Manchester City in a thrilling match, the result was enough to put Spurs through on away goals. With dazzling skills and a genial smile, Son has not only established himself as one of the Premier League’s most prolific strikers but also as a South Korean ambassador who, along with his compatriots, is pushing the boundaries of their nation’s popular culture as it blossoms in Britain and beyond. Some Spurs fans have booked holidays to South Korea, their interest ignited by a player affectionately called Sonny, who exudes a charm and grace not normally associated with British footballers. Those with adventurous taste buds have discarded the traditional post-match pint or burger to sample the delights of bibimbap or japchae. Selfies are snatched with Korean visitors to Spurs games as attempts are made to tackle the language barrier and discuss football and other things Korean. Son’s popularity is also driven by his Roy of the Rovers story; he left home in Chuncheon, north-east of Seoul, aged 16 and went to live alone in Germany to realise his dream of becoming a professional footballer. He was signed by Tottenham Hotspur from Bayer Leverkusen in 2015 for £22m and is now also South Korea’s captain. “There’s no doubt that Sonny has had a major influence on many British people attempting to sample and understand Korean culture,” said Sungho Min, spokesman for the South Korean embassy in London. “His popularity has opened up our nation and what it offers to a completely new section of the British population, not just those with an interest in things like food and art. Sonny and K-pop have done more to promote Korean culture in the UK than anything the government or official tourism department have been able to do.” Son may be the latest face of the Korean wave but he is certainly not the first. For almost a decade it has been chefs and musicians that have led the way. K-pop, or Korean pop, with its catchy melodies and elaborately choreographed dance routines, has baffled music executives with its worldwide success. The phenomenon began in the UK with a major hit for Korean rapper Psy in 2012. The video for his song, Gangnam Style, has now had 3 billion views on YouTube. Now boy band BTS have established themselves as a global force. Their first appearance in Britain last October won full houses and hysterical fans. Launched in 2013, they are also the first K-pop band to top the US album charts and have more than 12 million subscribers on YouTube. Their female counterparts, Blackpink, became the first Korean act to perform at the Coachella music and arts festival in California, earlier this month, with their performance streamed live in Times Square. They also recently became the first ever K-pop girl group to make it to the Billboard charts with both their album and single of the same name, Kill this Love. Food has been a critical feature of the rise in popularity of Korean culture, and while London has an established restaurant scene, complete with celebrity chefs such as Judy Joo, the cuisine is also spreading beyond the capital, with venues flourishing in Manchester, Birmingham, Sheffield and Edinburgh. Almost all major supermarkets stock Korean ingredients or foods, and specialist Korean shops are now a common sight in most city centres. Jae Joon, manager of the Miss Korea restaurant in Birmingham, said: “Most of our customers are not Koreans. The British have developed a taste for our food, which has further led to an interest in our culture. There was a time when people in this country didn’t even know where Korea is.” The Observer’s food critic, Jay Rayner, added: “Korean food has been on the rise over the last five years but in the past year it’s really broken through. There’s been a significant breakout of restaurants and supermarkets in London and other parts of the country. “The real benchmark is when you have mainstream supermarkets stocking Korean items, and this is happening more and more. It’s part of the wider interest in Korean culture.” The growth in Korean restaurants, particularly outside of London, is partly driven by an increase in students from the country attending British universities. There are an estimated 53,000 Koreans living in the UK, the largest community in Europe, of whom almost 20,000 are students. New Malden in Surrey is home to the largest concentration of Koreans – almost 20,000 – earning it the nickname “Korea Town”. The newfound interest in their culture extends beyond food and K-pop. Next month,the Korean Cultural Centre in London will host a festival to showcase the country’s other musical talents. A Korean film festival is also taking place to highlight its flourishing film industry, underlined by the 2017 Netflix success of Okja, which tells the story of a Korean girl protecting her gentle giant friend. Last summer South Korea’s most famous artist, Lee Bul, arrived on London’s arts scene with her exhibition, Crashing, while another, Seung-taek Lee, exhibited at the White Cube gallery. Next month, Wales will host its first ever Korea Day with another planned for Manchester next year. Korean fashion brand Fayewoo, known for its elaborate party dresses, is popular with celebrities and social media influencers, and is opening its first European store in London. South Korea’s cultural emergence is no accident. Struggling with the impact of the Asian economic crisis of the late 1990s, it formed part of a deliberate policy by the country’s former president Kim Dae-jung to focus on culture to push the country forward, which was dubbed hallyu. Dwarfed by the might of neighbours China and Japan, he also saw it as an opportunity to establish his nation on the world stage and move away from how it saw itself – “a shrimp between whales”. Thanks to the wave, it is now becoming a giant in its own right. ",
    "title": "Feast from the east – why Britain is surfing the Korean culture wave | K-pop | The Guardian",
    "datetime": "2019-04-21T06:01:44.000Z",
    "url": "https://www.theguardian.com/music/2019/apr/21/feast-from-east-britain-surfing-korean-culture-wave"
}