{
    "text": "By Celeste Kriel K-pop’s first openly gay singer, MRSHLL, has released his new mixtape, Alien Issa Mixtape, which he says is dedicated to all the “aliens and the misfits” and those on the margins of society. “These are songs I’ve been working throughout the past year that didn’t make it onto the Breathe EP released this past June, nor did it quite fit into the concept of my next album but I didn’t want to throw them away,” the Korean-American artist said. During the process of writing the new music, it became more than just a “SoundCloud thing,” he added, and he decided to share the six new songs on all streaming platforms as a mixtape. The title of Alien Issa Mixtape alludes to the fact that the artist does not feel fully at home in this world, especially Korean society, the birthplace of his parents. “I kind of sometimes feel like I’m not a part of this world and I don’t fit in necessarily. While my parents are from here, I was born and raised abroad,” ” he said. “But now being here in the land of my parents which essentially is a part of me, I’ve been learning a lot about the culture and my identity as a Korean. But being raised somewhere else, sometimes I feel like I look like me but I’m an alien, like a Korean impostor.” “That’s the theme I wanted to go with and I just feel like there’s a lot of us out there that feel like we are outcasts or that we are kind of in the margins and don’t fit in.” He repeats the mantra “Relax your mind, it’s time to unwind” on one of the songs, Breathe, also the title of his first mini-album released in June. While MRSHLL didn’t hide his sexuality in the past, he had never been particularly vocal about it either. However, MRSHLL the musician and Marshall Bang, the Korean-American from Orange County, have always had a vision to inspire and help others by celebrating the things that make people unique. In helping others he felt he was helping himself. After moving to LA, working for a non-profit, then delving into hairstyling and cosmetology, MRSHLL found the courage to live his own truth out loud. “I was playing this big role of being fully ‘self-realised’, but I had this secret I wasn’t ready to give away so it was quite a journey of self-work, self-love and self-actualisation. It wasn’t like there was an ‘aha’ moment, it was over time when I met and interacted with people from different communities, I gained inspiration from other people living out bold and loud and proud and that gave me inspiration and strength to be more of myself.” His song Elevate speaks about elevating communities, individuals and ourselves. “We have it within ourselves to elevate and go on to the next level and be more than who people tell us we have to be and have the strength to be who we are meant to be,” he said. MRSHLL is an advocate for Korea’s LGBTQ community and hopes to create more visibility with his music. He hosts an inclusive party called “Pose” that welcomes all genders. “I hope my music or the parties I host or anything I am a part of will help people be bolder and be more courageous in who they are and that people will be able to meet and find other people in our community as well and be strengthened by each other,” he said. Since moving from LA to New York and then to Seoul, there has been a MRSHLL metamorphosis. “I’ve been coming out of my cocoon and starting to spread my wings. Although I haven’t fully spread my wings yet, I’m at least starting to unfold.” ",
    "title": "First openly gay K-pop singer, MRSHLL, dedicates new release to all the ‘aliens and misfits’ | South China Morning Post",
    "datetime": "2018-10-31T20:00:30+08:00",
    "url": "https://www.scmp.com/culture/music/article/2170995/mrshll-first-openly-gay-k-pop-singer-dedicates-new-release-all-aliens"
}