{
    "text": "South Korean food festival Taste of Seoul launched its third edition late last month with an awards ceremony at the Sebitseom Island convention centre in Seoul. The event, which ran from September 30 to October 6 and was organised by the Seoul Metropolitan Government, was the first citywide in-person gastronomy event of its kind since the start of the coronavirus pandemic, as much of Asia moves into a post-pandemic phase. Two previous editions were held virtually because of the pandemic. Taste of Seoul was held to promote the “diversity and differentiation of Seoul’s gourmet culture”. Michelin-star restaurant chefs hosted parallel events – Seoul Restaurant Week, Seoul Market Dining, Seoul Marché, Seoul Food Cinema and Seoul Sool Class – to spotlight Korea’s food and drinks culture. Yoshihiro Narisawa, the chef-founder of Narisawa in Tokyo, also took part in the event’s Grand Gala Dinner, where he cooked with “godmother of Korean cooking” Cho Hee-sook and Son Jong-won of one-Michelin-star L’Amant Secret and Eatanic Garden. “The Seoul government seeks to discover the city’s unique differences in cuisines and promote it both at home and abroad,” says Choi Kyeng-ju, the director general of the city’s tourism and sports bureau. “We want to become a global gourmet city and enhance our food tourism competitiveness.” “Over the last decade, Korean fine dining has increased in popularity in and outside Seoul,” says Choi Jung-yoon, head chef of the Sempio Korean Fermentation Culinary Research Centre and founder of JY Tour, an online guide that highlights old Korean restaurants. Modern Korean cuisine has been making headway thanks to the chefs who serve it – look no further than the South Korean Michelin Guide for proof, says Choi, where a large proportion of stars were awarded to modern Korean restaurants. “Chefs Kang Min-goo and Yim Jung-sik have played a major role in the development of the Korean fine dining industry in Seoul,” she says of the chefs behind two-Michelin-star restaurants Mingles and Jungsik, respectively. In the last 10 years, however, Seoul’s dining scene has been quietly evolving to encompass more than that. According to Choi, the fine-dining set in Seoul is skewing “younger and more dynamic” and is drawn to traditional Korean cuisine and Korean barbecue omakase. “Younger Korean chefs are becoming more interested in the authenticity of traditional cuisine [and] more are exploring temple cuisine and fermentation techniques,” she says. Cho Eun-hee, an executive chef of one-Michelin-star traditional Korean restaurant Onjium, agrees. Onjium was one of seven winners in the Korean cuisine category in the Taste of Seoul awards. “I think the younger demographic are now embracing traditional Korean food,” says Cho. “For them, it is something new and exotic rather than old, and so it comes across as trendy.” Cho – who has more than 30 years of experience in traditional Korean cuisine – says there is still a dearth of traditional Korean dining in Seoul, although she believes “the numbers will grow fast thanks to the attention and love showered on traditional fare from the younger generation”. In 2013, Cho opened Onjium as a one-table dining room serving traditional Korean cuisine and dedicated to studying and sharing Korean cultural heritage. Cho and co-executive chef Park Sung-bae travelled across the country for two years before Onjium’s debut, researching Korean heritage food and ingredients. In 2018, Onjium became a 25-seat food studio – as well as a housing studio and a clothing studio. In a building formerly occupied by United Nations cultural agency Unicef, it became a part of a non-profit research institution that preserves Korean traditions. The chefs make their own Korean sauces, such as ganjang (soy sauce), doenjang (soybean paste) and gochujang (red pepper paste), and they brew their own liquors for the restaurant’s traditional Korean alcoholic pairing menu. They also work closely with farmers to change the way rice crops are planted to improve the quality of harvested rice. In 2014, chef Kwon Woo-joong opened Kwonsooksoo, which went on to win two Michelin stars in 2017. 7th Door by chef Kim Dae-chun, of contemporary Seoul restaurant Toc Toc, debuted in 2020 and uses traditional techniques of ageing and fermentation. Just this year, Park Ju-eun, the former head chef of the now defunct Hansikgonggan, welcomed diners to his newly opened traditional Korean fine diner, Restaurant Jueun, near the Gyeonghuigung Palace – one of the five royal palaces in Seoul. According to Park, vegetarian recipes flourished during the Goryeo dynasty (918–1392) because Buddhism – which prohibits taking the life of any person or animal – was deeply rooted in society. Despite its reputation as a meat-loving society, Park says that Koreans used to eat a wide variety of vegetables with seasonings such as soy sauce and soybean paste. During my stay in Seoul I met chef Kim Dae-chun, who took us to the 115-year-old Jingwansa Temple in Bukhansan National Park. The Korean chef, himself a diligent student of temple cuisine, is two months into a vegan diet and has a deep interest in learning about how temple food heals the body and soul. Jingwansa Temple, he says, was a favourite for Korean royals, and its temple cuisine remains well regarded. “By chance, I had the opportunity to [try] the food of Jingwansa and it was revolutionary,” says Kim, who has been a chef for more than 20 years. “If Korea still had a monarch, he’d be eating food like the temple cuisine of Jingwansa.” It will be more than just a restaurant, though, says Kim – it will be a space where guests can seek inner healing. The Icon Award: Chef Cho Hee-sook Best Korean Restaurant: Onjium Best Western Restaurant: Mosu Best Asian Restaurant: Kojima Best Grill Restaurant: Born and Bred Best Plant-Based Restaurant: Local Eat Best Cafe and Dessert: Maison M.O Best Bar and Pub: Le Chamber ",
    "title": "First K-pop, now K-food: Seoul in South Korea’s push to highlight its culinary culture beyond kimchi and kimbap is finding fans | South China Morning Post",
    "datetime": "2022-10-20T07:15:10+08:00",
    "url": "https://www.scmp.com/lifestyle/food-drink/article/3196367/first-k-pop-now-k-food-south-koreas-push-highlight-its-culinary-culture-beyond-kimchi-and-kimbap"
}