{
    "text": "By Kelli Korducki This April 3, 2013 photo shows the inside of a classroom at Miami's Coral Way K-8 Center, the nation's largest bilingual school.\n                \n                    \n                    Lynne Sladky/AP\n                    \n                \nhide caption This April 3, 2013 photo shows the inside of a classroom at Miami's Coral Way K-8 Center, the nation's largest bilingual school. Right now, across the country, parents are in the midst of trying to get their children enrolled in bilingual classrooms for next September. The motivation is usually straightforward. Parents want their kids to learn a foreign language. The thinking is that a second language will bring significant cultural and economic advantages. But for many Latino parents (and others as well) there is something more at play; namely, it can feel like the family language is at stake. (The loss of Spanish-language fluency among native-born Latinos is a widespread phenomenon.) Bilingual classrooms are seen as a way of ensuring children will be able to read, write and speak Spanish. Research and Controversy Spanish-dominant students learn English faster and better in classrooms that include Spanish-language instruction, according to a 2006 National Literacy Panel report. The findings are cited by University of Toronto Professor Jim Cummins as proof of the benefits of bilingual education. He says, \"In the last 10 or so years, there's pretty much been a consensus among the research community in regard to the outcomes of dual-language programs.\" But, standardized test scores show the transfer of language skills from Spanish to English can take time. Particularly so, in the very first years of schooling. Cummins, however, believes any remaining opposition to bilingual education in the U.S., is ideologically grounded. Businessman Ron Unz disagrees. Long before his most recent claim to fame as an advocate for a $12 minimum wage in California, Unz was the principal sponsor behind Proposition 227, which passed in 1998 and was designed to effectively eliminate bilingual education in the same state. He remains adamant in thinking that native-language instruction hinders academic performance among English learners. California's standardized test scores did rise noticeably in the years following passage of Unz's initiative. But, defenders of bilingual education argue that there's no conclusive evidence establishing a link between Proposition 227 and the increase in test scores. \"The way you make a Spanish-speaking child bilingual is for the school to teach them English,\" says Unz. \"I would argue that my initiative created bilingual students.\" Others aren't so sure. In Sacramento, Democratic state Sen. Ricardo Lara is looking to repeal 227 and bring bilingual classrooms back for good. In other districts across the state, Unz's proposition never took full effect. \"My experience has never been that bilingual programs are in any way in jeopardy, in urban areas at least, in California,\" says Grace Cornell Gonzales, who has taught in bilingual classrooms in Oakland and San Francisco since 2007. As Cornell Gonzales puts it, Proposition 227 implementation was left largely up to individual school districts. In keeping with the demands of a rapidly growing Latino population, many districts opted to ignore the legislation altogether. Instruction in Cornell Gonzales' San Francisco kindergarten classroom happens almost entirely in Spanish. Culture vs. Test Scores When Mercedes Garcia and her husband moved to San Francisco from Mexico ten years ago, they noticed a recurring trend among their friends' children: the kids didn't speak Spanish. \"Even if the parents don't speak any English, the kids speak only English,\" says Garcia. This made the decision easy to enroll their now six-year-old daughter in Cornell Gonzales' classroom. Garcia admits she's had moments of concern over how well her daughter is learning English, but they've been fleeting. Her daughter is already able to understand a great deal of English and can even translate concepts between the two languages. \"Kids are capable of easily learning a new language, whether that be English or anything else,\" Garcia says. By some standards, that learning doesn't come quickly enough. Cornell Gonzales admits that test scores don't always reflect bilingual classroom successes. \"The tests aren't adapted at all to the realities of a bilingual program,\" she says. \"The avalanche of testing, given predominantly in English, has really pushed all schools to do more in English than I think is pedagogically appropriate,\" says Robert Petersen, who in 1988 founded La Escuela Fratney, a bilingual, multicultural public K-5 school in Milwaukee, Wisconsin. According to Petersen, test scores measuring math and literacy skew perceptions of what a dual-language classroom does right. They also have the potential to prevent specific teachers from getting pay raises or escaping layoffs, which exacerbates the existing challenge of hiring quality bilingual educators. Despite the hurdles, many parents see great value in a bilingual education for their children. Petersen reports that La Escuela Fratney enjoys consistent waiting lists among a diverse body of prospective students (the student body's current ethnic breakdown is roughly 58 percent Latino, 25 percent African-American, 16 percent white, and 1 percent Asian-American) from across the socioeconomic spectrum. Petersen also points out that once students enter the school, they generally stay there until graduation. \"All children should have the right to learn two languages, including their home language,\" says Petersen. \"We are proud to be bilingual, multicultural learners.\" Sponsor Message Become an NPR sponsor ",
    "title": "For Latino Parents, Bilingual Classrooms Aren't Just About Language : Code Switch : NPR",
    "url": "https://www.npr.org/sections/codeswitch/2014/04/03/298377276/for-latino-parents-bilingual-classrooms-arent-just-about-language"
}