{
    "text": " Investors continue to purchase the Korean won as they believe that South Korean government will not intervene in the foreign exchange market, though the won-US dollar exchange rate reached its two-year high. According to the Wall Street Journal (WSJ) on December 4 (local time), foreign investors bought US$3.3 billion (3.59 trillion won) worth of South Korean stocks and bonds in October this year regardless of the expansion of the geopolitical risk on Korean peninsula. Accordingly, the won increased more than 12 percent against the dollar this year alone, showing the highest growth among major currencies. The won-US dollar exchange rate dropped to the 1,080 won level for the first time in nearly two years. The WSJ said, “Investors are buying the Korean won as they think that South Korea will not be able to weaken the current trend of the strong won due to its concerns over being designated as a country manipulating its currency. The US government has made a half-yearly report on exchange rates and reported it to Congress from 2016 according to the Trade Facilitation and Trade Enforcement Act introduced in 2015. The report considers whether countries that have a huge trade surplus with US, just like South Korea, intervene in the foreign exchange market. Under such pressure from the US, countries on the watch list cannot easily “fine tune” their currencies even when there is a big herd effect on the market. This is why market participants are betting on an additional strong upward trend of the won. Jorge Mariscal, emerging markets chief investment officer at UBS Wealth Management, said, “They (the Korean authorities) are not trying to confront the current trend on the foreign exchange market.” Mariscal predicted that the won would increase over 2 percent against the dollar in the next 12 months.” Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Foreign Investors Are Buying Korean Currency-denominated Bonds and Stocks - Businesskorea",
    "datetime": "2017-12-06T01:15:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=20008"
}