{
    "text": "Foreign investors net purchased South Korean listed stocks for two months in a row last month. With a continuous net inflow from January, foreign investors’ Korean bond holdings hit a record high. According to a report on foreigners’ stock investment trend in August released by the Financial Supervisory Service (FSS) on September 17, foreign investors net bought 1.1 trillion won (US$978.25 million) worth of listed stocks last month. They continued to net sell domestic stocks for three months after April and then turned into net buyers in July and August. By country, the United States net purchased a total of 2.3 trillion won (US$2.04 billion) worth of domestic stocks last month, followed by Singapore with 488 billion won (US$433.2 million), Japan with 85 billion won (US$75.45 million) and China with 73 billion won (US$64.8 million). On the other hand, Saudi Arabia was the largest net seller with 522 billion won (US$463.38 million), followed by Luxemburg with 307 billion won (US$272.53 million), the Cayman Islands with 230 billion won (US$204.17 million) and Norway with 182 billion won (US$161.56 million). The total foreign ownership of domestic stocks amounted to 599.82 trillion won (US$532.47 billion) as of the end of last month, accounting for 31.9 percent of the total market capitalization. The U.S. took up 42.5 percent of the total foreign ownership with 254.79 trillion won (US$226.17 billion), followed by the United Kingdom with 48.75 trillion won (US$43.27 billion), or 8.1 percent, Luxemburg with 38.43 trillion won (US$34.12 billion) and Singapore with 32.03 trillion won (US$28.43 billion), or 5.3 percent. Foreign investors also net bought 4.5 trillion won (US$4 billion) worth of listed bonds last month. The amount of net investment excluding redemption at maturity came to 2.39 trillion won (US$2.12 billion). Foreigners had continued to make a net investment for eight months now. Foreign investors’ listed domestic bond holdings reached a new record high at 114.3 trillion won (US$101.46 billion) as of the end of August. The foreign ownership of listed bonds accounted for 6.6 percent of the total. By type of bonds, government bonds had the largest net investment with 1.3 trillion won (US$1.15 billion), followed by monetary stabilization bonds with 1 trillion won (US$887.71 million). By term to maturity, bonds maturing in less than one to five years attracted 1.6 trillion won (US$1.42 billion) of net investment, followed by bonds maturing in more than five years with 600 billion won (US$532.62 million) and less than one year with 200 billion won (US$177.54 million). Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Foreign Investors’ Korean Bond Holdings Hit Record High at 114 Tril. Won - Businesskorea",
    "datetime": "2018-09-18T10:08:46+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=25138"
}