{
    "text": " Foxconn, the world's largest IT equipment supplier on consignment basis, is emerging as the biggest threat to the Korean semiconductor and display industries. According to industry sources, Foxconn is nursing a scheme to transform itself into a general IT company through the acquisition of Sharp in Japan and Toshiba Memory. The Flying Eagle strategy, which Terry Gou, chairman of Foxconn recently announced is based on this blueprint. The Flying Eagle strategy aims to become the strongest player in the IT industry to maximize synergies out of US political and economic support, advanced Japanese technology, and Chinese manufacturing plants. To this end, Foxconn is actively cooperating with the US on reviving the US manufacturing industry. The company is planning to scratch the back of Trump in the US by creating jobs, and to take advantage of America's influence in big issues such as the takeover of Toshiba Memory in Japan. In July, Foxconn announced a plan to invest US$10 billion in an LCD panel factory in Wisconsin, the US. Wisconsin responded with a US$3 billion tax cut for the Foxconn factory. Foxconn also decided to continue investing in automobiles in Michigan, the US. Foxconn’s moves are explicit courtship to strengthen a honeymoon with the United States, even if they take high labor costs. The Trump government bent on creating jobs has no choice but to welcome Foxconn’s investment. The problem is that Foxconn is openly showing its intent to hold Korean companies in check in the midst of these moves. Above all, Foxconn began to block the SK Hynix alliance from taking over Toshiba memory. Originally, SK Hynix was selected as the preferred bidder by Toshiba, becoming one step closer to acquiring NAND flash technology from Toshiba. However, Foxconn demanded that the US oppose the SK Hynix alliance’s acquisition of a stake in Toshiba because Korea’s NAND market share will exceed 50% if the SK Hynix alliance takes over the stake. The situation is getting complicated as the acquisition competition took an unexpected turn. Toshiba changed its stance to have negotiations with Western Digital and Foxconn apart from SK Hynix. \"If Foxconn succeeds in acquiring Toshiba Memory and makes a chicken game-like investment, the memory semiconductor market can fall into a serious turmoil,\" an industry official said. Foxconn's aggressive investment in displays such as liquid crystal displays is also a threat to Korean TV makers such as Samsung Electronics. In addition to investing in LCD factories in the US, Foxconn already has large LCD factories in China and Taiwan. Moreover, after acquiring Sharp, which is a strong display player, Foxconn’s LCD TV market share rose to 4th place in the second quarter from 9th place in the first quarter of this year. In recent years, the company has been trying to enter the organic light emitting diode (OLED) business as well as the LCD business while trying to acquire Japan Display of Japan. Moreover, Foxconn is expanding its business in all directions such as the medical equipment, industrial big data and cloud and security business. \"Foxconn's technology is still far below that of Korean companies but Foxconn can be a huge threat because of its huge financing capacity and support from the US government,\" a securities industry official said.   Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Foxconn Rising as New Threat to Korean Semiconductor, Display Industries - Businesskorea",
    "datetime": "2017-08-21T02:15:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=19025"
}