{
    "text": "This post has been corrected. Please see below. With his fellow Pritzker Prize-winning L.A. architect, Thom Mayne, playing the self-described role of “ombudsman” and “facilitator,” Frank Gehry is back in the fold for a major exhibition on Los Angeles architects that will open June 16 at the Museum of Contemporary Art. Gehryhad withdrawn about a month ago, saying he doubted it would be “a scholarly, well-organized show” and that he was concerned the handling of his own work would be a “trivialization.” Controversy and confusion surrounding the show intensified in early May as its guest curator, Christopher Mount, said it was in financial trouble, with doubts as to whether MOCA had the money needed to cover its budgeted expenses of $614,000. In mid-May, MOCA announced the show was on, but would be delayed two weeks from its original planned opening on June 2. FULL COVERAGE: 2013 Spring arts preview “A New Sculpturalism: Contemporary Architecture From Southern California,” surveys the work of 37 L.A. architects over the past 25 years and will run through Sept. 16 at MOCA’s Geffen Contemporary building. Instead of revisiting some of his past greatest hits, such as the 1997 Guggenheim Bilbao Museum in Spain and the celebrated Walt Disney Concert Hall that opened in 2003, Gehry said his section of the exhibition will focus on a recent work, his never-to-be-built design for the National Art Museum of China in Beijing. The design lost out in a competition to the French architect, Jean Nouvel, Gehry said, but “I was kind of proud of our scheme, and I wanted to show it” at MOCA. “It shows the complete way we work, it was very thorough as a building proposal, and it looked different from some of our other stuff. It relates to our perception of the sense of China and how we interpret it.” CRITICS’ PICKS: What to watch, where to go, what to eat and more Gehry, who won the Pritzker, architecture’s top honor, in 1989, said the installation would include models, sketches, movies his firm made for the presentation and “a full-scale mock-up of a piece of the wall.” His return to the exhibition was first reported Friday by radio station KCRW-FM (89.9). He didn’t entirely quell the controversy surrounding the show. Gehry told The Times – apparently incorrectly – that the reason he rejoined the exhibition was that MOCA director Jeffrey Deitch agreed to install Mayne as its curator in place of Mount: “Jeffrey Deitch came to see me a few weeks ago and asked me what it would take to change my mind, and I said `change your curator.’ Thom is a good friend, and I trust him, and it’ll be OK.” Deitch wasn’t available for comment Friday, but Mayne said that he is definitely not the show’s curator – it’s still Mount. PHOTOS: Arts and culture in pictures by The Times At 69, Mayne is 15 years younger than Gehry and has known him for decades. He said he felt the exhibition was too important a showcase for L.A. architects – especially ones a generation or two younger than Gehry and himself – to allow it to be sidetracked. When its difficulties surfaced, he said, he approached Deitch, offering advice and help, and started making calls in the L.A. architecture community aimed at putting the exhibition back on track. The calls included one to Gehry, asking him to reconsider his withdrawal. “I’ve been in Frank’s jet stream my whole life,” said Mayne, the 2005 Pritzker winner whose buildings include the Caltrans’ District 7 headquarters in downtown L.A. “I said, `Frank, this is a collective community, you want to be in the show.’” Mayne said he’s helped with logistical matters such as putting together a team of craftspeople that’s assembling the physical show, but that he had almost no curatorial input. He said that apart from “super-minor tuneups” and “ultra-minor changes,” it’s “the same show” that had been envisioned all along, and that “Christopher Mount is the curator without question.” Mount said he was “sort of shocked” to hear that Gehry thought he’d been replaced, but was happy about the star architect’s return. “It’s nice to have him back. He’s the world’s most famous architect, without a doubt.” “A New Sculpturalism” is a leading component of a series sponsored by the J. Paul Getty Trust, “Pacific Standard Time Presents: Modern Architecture in L.A.” The primary funding is a Getty Foundation grant of $445,000. For the record, June 1, 6:30 p.m.: A previous version of this post incorrectly gave the year of Frank Gehry’s Pritzker Prize as 1997. ALSO: MOCA architecture show pushed back to June 16 L.A. artists, architects’ effect on each other at MAK Center exhibition MOCA’s `A New Sculpturalism’ faces an uncertain future without Frank Gehry It's a date Get our L.A. Goes Out newsletter, with the week's best events, to help you explore and experience our city. You may occasionally receive promotional content from the Los Angeles Times. Mike Boehm is a former arts reporter and pop music critic for the Los Angeles Times. Television Oct. 25, 2023 Image Oct. 25, 2023 Music Oct. 25, 2023 Music Oct. 25, 2023 Entertainment & Arts Oct. 25, 2023 Company Town Oct. 25, 2023 Television Oct. 25, 2023 Movies Oct. 25, 2023 Music Oct. 25, 2023 Subscribe for unlimited accessSite Map Follow Us MORE FROM THE L.A. TIMES ",
    "title": "Frank Gehry back in MOCA architecture show, coaxed by Thom Mayne - Los Angeles Times",
    "datetime": "2013-06-01T12:00:00",
    "url": "https://www.latimes.com/entertainment/arts/culture/la-et-cm-frank-gehry-thom-mayne-moca-architecture-show-20130531-story.html"
}