{
    "text": "Thousands of people gathered in Balboa Park Saturday afternoon for Korea Day, a celebration of Korean music and culture held by the House of Korea and Korea Cultural Center Los Angeles. The day included 10 performances from K-pop cover dance groups and solo dancers, aiming to emulate their favorite musicians and vying to represent in the world K-pop cover competition. Some of the performers came from as far as Arizona, Illinois and Utah, while others were local groups from Los Angeles and San Diego, including CTRL.ALT.SD. Visitors to the park learned how to play Korean children games that were featured in the popular Netflix series “Squid Game,” including marbles, Mugunghwa flower has bloomed (red light, green light), and ddakji, which is a game similar to the American pogs game. With ddakji, players throw folded, origami paper tiles at their competitor’s tile, aiming to flip them over. Wijin Park, director of the Korean Cultural Center Los Angeles, said in an email that Saturday’s event was more successful than they had originally expected. “We are so excited to see so many K-Pop fans who are interested in Korean culture,” Park said. “I would also like to congratulate the opening of the House of Korea cottage in Balboa Park, and I hope that it will become a focal point for spreading Korean culture to the locals in San Diego.” Saturday’s event was held as Korean pop culture continues to become increasingly popular among mainstream American audiences. Having just held its opening ceremony in August, House of Korea is one of the most recent additions to the House of Pacific Relations International Cottages at Balboa Park. House of Korea San Diego founder and President Jung Joo Hwang described Saturday’s turnout as unbelievable. When she first moved to America in 1985 there was a complete misunderstanding about what her country was like and the progress it had made in the decades since the Korean War ended in 1953. People would even ask whether there was electricity in Korea. So to see the growing popularity of films like “Parasite,” the new Netflix show “Squid Game” and K-pop bands like BTS and Blackpink in recent years, Hwang said, has been both surprising and heartwarming. “I think when the nation has more prosperity, they start to focus on cultural things, so this is our time to share our culture,” Hwang said. “With ‘Squid Game’ on Netflix, it was fun for me to see the people’s response, and all the games I used to play when I was young.” Dancers during the K-pop cover dance contest came from many different cultural backgrounds, and many of them described the K-pop community as being a niche subculture that is both inclusive and supportive. San Marcos resident Chevy Rivera, who competed with her dance troupe CTRL.ALT.SD, said K-pop has grown from a single genre to an umbrella term encompassing multiple sub-genres of music and dance. “You find your own little pocket within K-pop that you can connect with, and once you find that pocket, it’s addicting,” Rivera said. “A lot of times, especially if you’re struggling, it just sort of feels like it completes you and adds this happiness that you can just escape from your daily struggles. So I’m not surprised that K-pop is blowing up.” Korean Cultural Center of Los Angeles staff member Kenji Kumagai used to share his Japanese heritage with friends growing up but often shied away from sharing the Korean side, given that so few people knew anything about it. “I’ve lived in the U.S. for most of my life, but I was never represented through any media or cultural stuff,” Kumagai said. “Slowly, the Korean culture got its foot in the world market ... and me being lucky enough to see that happen in real time is great.” Kumagai said he hopes Saturday’s event not only shined a spotlight on K-pop and band P1Harmony, but that the audience walked away knowing more about the richness of Korean culture as a whole. “Of course we love K-pop fans, and we love that K-pop is doing so well, but we want them to have maybe Korean food, instruments, clothes — maybe get little bites of those as well,” Kumagai said. “Maybe the main dish is K-pop, but maybe a little bit of dessert from the other stuff, too.” Get Essential San Diego, weekday mornings Get top headlines from the Union-Tribune in your inbox weekday mornings, including top news, local, sports, business, entertainment and opinion. You may occasionally receive promotional content from the San Diego Union-Tribune. Follow Us Privacy PolicyTerms of ServiceSign Up For Our NewslettersSite Map Follow Us MORE ",
    "title": "From Squid Game to K-pop, San Diego celebrates Korea - The San Diego Union-Tribune",
    "datetime": "2021-10-24T03:33:15.839",
    "url": "https://www.sandiegouniontribune.com/local/story/2021-10-23/from-squid-gamee-to-k-pop-band-p1harmony-san-diegans-celebrate-koreas-cultural-clout"
}