{
    "text": "A new show at the V&A — Hallyu! The Korean Wave — opens today, Think Korea, and depending on your age, it will either be M*A*S*H*, kimchi or K-Pop. The K-Pop fandom already knows what the rest of us are still discovering — that Korean culture is having not so much a moment as a tsunami, engulfing the outside world in its pop music, cinema, TV, fashion, art. Korea is hot, hot, hot. (The South, obviously — the North, as we all know, is entirely different). A new show at the V&A — Hallyu! The Korean Wave — opens today, showcasing everything from the 2019 film Parasite, which won the Palme d’Or at Cannes plus 6 Oscars including Best Director for Bong Joon-ho, to the fantastical gowns of Miss Sohee, the creations of Sohee Park, a 26-year-old fashion graduate of Central St Martin’s whose degree show went viral during lockdown. Designer Minju Kim is the breakout star of Netflix series Next In Fashion, and Korea’s Squid Game is so far the most successful Netflix show ever, amassing 1.65 billion viewing hours in the four weeks after its release in September 2021. Meanwhile, K-Pop has taken over the world. Boyband BTS and girlband Blackpink are now the biggest selling pop bands in the world, having conquered not just Asian but global music markets. Think Stock Aitken Waterman on digital steroids, creating not just a raft of ever changing new pop idols, but an entire global social movement — for teens — to go with it.  K-Popstars, or ‘idols’ are recruited from the age of 11 years upwards, and trained like athletes in popstar factories, overseen by management companies who install them in ‘homes’ where they live and interact with fans and media, either face to face or via digital metaverse. Bands like Aespa have four human members and four avatar members, so that they are available to fans 24/7. So far, so sci-fi. And yes, due to the intense pressure under which K-Pop ‘idols’ can find themselves, there have been suicides, although this is not referenced in the exhibition, perhaps because it is sponsored by the Korean Ministry of Culture, Sports & Tourism, which wishes to project an image of exuberant positivity. This is all about Korea’s soft power, and the country’s pragmatic decision to fund culture as well as manufacture. In 1994, when box office takings from Jurassic Park outperformed sales of 1.5 million Hyundai cars, the government took note and began supporting the Korean film industry. This gave a new generation of film makers the chance to experiment — the result has been K-Drama, webtoons, and Oscar winners like Parasite — whose memorable bathroom is recreated in the exhibition. As is the pink jacket worn by Psy in his satirical Gangnam Style video from 2012.  The V&A is the first major global institution to showcase modern Korean culture. It’s the story of an extraordinary transformation from war-ravaged backwater to a futuristic culture whose only speed is fast and faster, driven initially by the huge success of brands like Samsung, LG, Hyundai. Curator Rosalie Kim describes how Korea’s vibrant and creative culture has transformed the country’s image from one devastated by the Korean War to cultural boss in an era of social media and digital culture. “This phenomenon has been amplified by tech-savvy and socially conscious global fanbases, further raising the profile and relevance of hallyu around the world,” she says. The fandoms, as they are called, are known to mobilise online in giant benign waves – in 2020, during Black Lives Matter protests, K-Pop fans took to Twitter in their tens of thousands to drown out racist posts; unlike traditional pop fans, whose sole concern is the pop band they idolise, K-Pop fandoms have created an online social movement, acting as translators, activists, fundraisers, archivists.  The Hallyu! show is divided into four sections, bright and loud and immersive — history, cinema and drama, music, fashion and beauty. Amid all the colour and clamour, perhaps the most fascinating photo is in the From Rubble To Smartphones history section, of a 1979 black and white shot of giant towerblocks — Gangnam, the most expensive area of Seoul. In front of these is a man ploughing a field with an ox. It is this image more than any other which captures the hyper-accelerated modernity of Korea — in 1960, 72% of its population was rural — achieved via Stakhanovite work practices. Between 1961 and 1987, exports grew an almost unbelievable 30-40% per year. The country had fallen first to Japanese colonial occupation (1910-1945), then the Cold War when the country was divided into North and South in August 1945 by the US and the USSR. This resulted in the Korean War and years of military dictatorship in the South, which ended in 1979. North and South are still officially at war today, the border one of the most militarised places on earth.  After rapid industrialisation and economic growth in the 1960s and 70s, the 1988 Seoul Summer Olympics changed Korea’s image overseas for the first time, its cheery logo reminding us of the tiger on the Frosties cereal box. During the 1997 Asian Financial Crisis, people out of work had time to play around with tech, which turned South Korea into one of the most digitally innovative countries in the world. Webtoons, a Korean invention, gained popularity during this time — these are cartoons read vertically by scrolling down on your screen — providing much inspiration for K-Drama, computer games, cinema and musicals. Today, Koreans work some of the longest hours in the world — the official 52 hour week set by the government is considered “reasonable but elusive”, with shattering levels of presenteeism and workplaces demanding employees be contactable around the clock. As a result, Koreans get the least sleep and consume the most alcoholic spirits of any country in the world. Korea has a $2.5 billion sleep industry to combat not just insomnia — which is increasing by 8% a year — but frequent cases of hyperarousal (where individuals are so overstimulated they cannot blink) as 100,000 Koreans regularly consume sleeping pills in unsafe doses. Sleep cafes — where you can nip in on your lunchbreak and pay for a quick nap — are popular.  This all fits perfectly with Korean ppalli-ppalli culture, which roughly translates as quick-quick. The country has the fastest broadband on earth; restaurants serve food almost instantly; intensive language courses promise immediate results; speed dating is huge, as are speed weddings, in locations which provide a non-stop conveyor belt of one-hour ceremonies. It is quite the opposite of the Slow Movement. So what drives this quick-quick mentality that has served to transform a country of 53 million, yet left them so sleep deprived they need cafes for naps? According to the show’s organisers, in the early 90s the South Korean government progressed high-speed internet infrastructure and communication technology in “the belief that the slow embrace of industrialisation in the late 19th century caused the country’s colonisation.” By becoming the fastest place on earth, Korea will not allow itself to be caught out again. Walking through the giant K-Pop screen avatars, or marvelling at the beauty devices — LED masks originally developed by NASA to grow plants in space are now used by individuals to rejuvenate their skin — you might wonder about where the traditional culture of Korea fits within the fibre-optic onslaught. This compressed modernity has, say the show’s curators, created paradoxes within society — after 500 years of Joseon Dynastic rule (1392 – 1910), traditional Confucian and shamanistic ritual now co-exists with cutting edge tech so ahead of itself as to appear almost science fiction. This is the hybrid which has shaped hallyu.  Read MoreLiving with dementia: 'I didn't have a clue who I was' More in this section Sign up for Scene & Heard, our dynamic weekly arts and culture newsletter\ncurated by the Irish Examiner Arts Editor. Please click here for our privacy statement.     Music, film art, culture, books and more from Munster and beyond.......curated weekly by the Irish Examiner Arts Editor. © Examiner Echo Group Limited, Linn Dubh, Assumption Road, Blackpool, Cork. Registered in Ireland: 523712. © Examiner Echo Group Limited ",
    "title": "From K-Pop to Squid Games — how Korean culture is sweeping the West ",
    "datetime": "2022-09-24T17:51:00+01:00",
    "url": "https://www.irishexaminer.com/lifestyle/artsandculture/arid-40967807.html"
}