{
    "text": "K-pop phenoms G-Dragon of BIGBANG and f(x) are the latest addition fans will get up and close with at KCON 2013, hitting L.A. on Aug. 24 & 25. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin G-Dragon, leader of mega K-pop boy band BIGBANG, and popular girl group f(x) are the latest artists added to the KCON 2013 lineup. They join previously-announced boy bands TEEN TOP, 2AM and EXO. The U.S.-based convention devoted to K-pop culture hits Los Angeles on Aug. 24 and 25.  Watch a brand new trailer for the convention below: Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news   G-Dragon will be releasing his sophomore full-length album, which will include a Missy Elliott collaboration, next month. It is likely that fans will be able to see new material by the BIGBANG leader at the convention. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t07/29/2013 GD had recently wrapped his first solo world tour, but the trek did not include America. This stop at KCON should more than more than make up for the flyover, given the artist meet-and-greets and photo ops. Following their SXSW performance — a first for K-pop — f(x) returned to the scene with “Rum Pum Pum Pum” that should make its debut on the K-Pop Hot 100 when the charts are revealed on Thursday. Tickets are currently on sale and can be purchased at KCON’s website here. Billboard’s own K-Town columnist @Jeff__Benjamin will speak on KCON panel “Spreading the Goodness of K-Pop!” on Sunday, August 25, from 11:00 a.m. to 12:00 p.m. in Panel Tent #1. More info here.  Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "title": "G-Dragon and f(x) Join KCON 2013 Lineup – Billboard",
    "datetime": "2013-07-29T23:00:00+00:00",
    "url": "https://www.billboard.com/music/music-news/g-dragon-and-fx-join-kcon-2013-lineup-4998758/"
}