{
    "text": "The Smithsonian announced Wednesday that G. Wayne Clough, the head of the institution, will step down as the museum’s leader next year. He has held the job for six years. Clough is perhaps best known to Culture Monster readers for his 2010 decision to remove a short excerpt of “A Fire in My Belly,” a 30-minute video made in 1987 by David Wojnarowicz, from the exhibition “Hide/Seek: Difference and Desire in American Portraiture” at the National Portrait Gallery. An 11-second portion of the video shows a crucifix with ants crawling on it. The decision to remove it came in the wake of calls by Reps. John A. Boehner (R-Ohio) and Eric Cantor (R-Va.) to dismantle the exhibition, though it was privately funded. PHOTOS: Arts and culture by The Times The move drew a strong rebuke from the Assn. of Art Museum Directors for censoring a work of art, and a panel advising the Smithsonian on how to handle controversies that may spring from its exhibitions later issued recommendations to prevent the removal of any artwork from museum shows without wide consultation. The recommendation was seen as a rebuke to Clough. Clough later told the Los Angeles Times that the decision was painful but denied it was censorship. Clough resigned to Supreme Court Chief Justice John G. Roberts Jr., who is also chancellor of the Smithsonian, saying he intended to leave in October 2014. The institution announced it would form a search committee to find Clough’s successor. ALSO: Clough says move was hasty but not censorship Critic’s Notebook: Smithsonian director needs to admit error It's a date Get our L.A. Goes Out newsletter, with the week's best events, to help you explore and experience our city. You may occasionally receive promotional content from the Los Angeles Times. Television Oct. 25, 2023 Image Oct. 25, 2023 Music Oct. 25, 2023 Music Oct. 25, 2023 Entertainment & Arts Oct. 25, 2023 Company Town Oct. 25, 2023 Television Oct. 25, 2023 Movies Oct. 25, 2023 Music Oct. 25, 2023 Subscribe for unlimited accessSite Map Follow Us MORE FROM THE L.A. TIMES ",
    "title": "G. Wayne Clough, Smithsonian chief who pulled artwork, to step down - Los Angeles Times",
    "datetime": "2013-09-18T14:53:00",
    "url": "https://www.latimes.com/entertainment/arts/culture/la-et-cm-wayne-clough-smithsonian-chief-who-pulled-artwork-to-step-down-20130918-story.html"
}