{
    "text": "By  Andrew Pentol \nin  Airports, Asia/Pacific, Brand News, Cosmetics, Fashion & Leathergoods, Jewellery & Watches, Latest News, Regions, Retail News\nJuly 18, 2016 Comments Off on Galleria Duty Free 63 store officially opens in Seoul Korean department store retailer Hanwha Galleria has officially opened its Galleria Duty Free 63 store on July 15. An online duty-free mall and mobile application have also been launched. Located in the 63 building, one of Seoul’s best-known landmarks due to its shimmering golden luster offering an expansive view of the Han River and city of Seoul, the facility partially opened on December 28 2015 as previously reported. According to the retailer, sales have since increased five-fold since and significant growth is expected as the year progresses. The retailer also said Galleria Duty Free 63 provided an unmatched experience as a shopping Mecca that served as a gateway to the range of tourist sites across Yeouido, a large island in the Han River and Seoul’s main business and investment banking district. In addition, the store provides the best Korea’s Hallyu culture can offer, the retailer indicated. Spread across four storeys with a total floor area of 10,153sq m, luxury boutique brands such as Ermenegildo Zegna, Philipp Plein, Michael Kors, Aigner, Coach, and Longchamp, have all opened since the soft-opening last year. The store now features more than 540 brands. Visitors are greeted by natural lighting on the ground floor, which features luxury boutiques and cosmetics brands. The first floor comprises global luxury watch and jewellery brands, while the second and third floors feature  fashion, tobacco, alcohol and general merchandise brands including Korean cosmetics labels that have become popular in Asia. Street 1O1, offering diversified fashion items by rising Korean designers, can also be found on the second floor. Another feature of Galleria Duty Free 63 is the K-Special Hall located on the third floor, where visitors can experience various products from 141 brands by Korea’s leading small and mid-sized enterprises and high potential equivalents. The third floor also includes a character store for children and a hands-on IT product zone for “kidults” designed to cover a wide range of preferences and interest of visitors. A cultural tourist attraction with annual visitors of over 3.32 million, visitors can choose from various activities within the 63 Building after shopping at Galleria Duty Free 63. Hanwha Group has rebuilt its aquarium under the concept of “Real Nature” and changed its name to Aqua Planet 63. Here, visitors can enjoy underwater performances and view the exotic aquatic wildlife, 63 Art, that provides a view of the Han River and numerous works of art. The premium buffet restaurant and high-end Chinese, Japanese and French cuisine can be enjoyed with a “commanding view” of the Han River.  Galleria Duty Free 63 also offers One Stop Tour courses that group together Yeouido’s tourist products by theme, including shopping, tourist sites and Hallyu content. The One Stop Tours include the Hallyu Course, Traditional Korean Market Course, Culture and Art Course and Han River Course, offering half-or full-day tours that include shopping and sight-seeing. A typical tour might begin with shopping at Galleria Duty Free 63, followed by bicycle rides along the riverside park bike path, various water sports/leisure activities and a relaxing break while taking in a view of the Han River. A K-culture Zone on the fourth floor of the 63 Annex Building will also be launched this year, showcasing an exclusive visual experience of K-drama in collaboration with the Korean Broadcasting System. Also, to enhance marketing, Hanwha Galleria has signed a marketing partnership agreement (see below) with Wanda Group, China’s largest retailer. Under this agreement, Hanwha Galleria will carry out a joint campaign on Chinese holidays targeting more than 120 million members of the distribution company.  To further expand its presence in China, Hanwha Galleria also established an office in Shanghai earlier this month (July 11) and will set up more in Beijing and Shenyang next month. Meanwhile, Galleria Duty Free is offering various benefits through linking with the Galleria department store. An example is The One Card Service delivering various benefits and membership discounts of the duty-free store, department store and shopping-mall with a single card. Customers already holding a department store membership card need only register their passport numbers to receive additional benefits. Galleria Duty Free 63 also operates the Diamond Lounge on the third floor for VIP guests. A one-on-one concierge service provides a shopping advisor who can cater to the needs of each customer. Other premium benefits include reservations for tourist spots in Yeouido, delivery service to airport pick-up zones, and complimentary snacks and beverages. Offline promotions feature a lucky draw giving away 63 Building-shaped gold blocks (630g), a shopping spree up to KRW6.3m ($5537) and various events giving away special gifts and gift-cards depending on amounts spent. An online duty-free mall and mobile application have also been launched and an online mall will offer special discount coupons and other online benefits.  Tagged with: Coach Ermenegildo Zegna Galleria Duty Free Hanwha Galleria Longchamp Michael Kors ",
    "title": "\n        Galleria Duty Free 63 store officially opens in Seoul    ",
    "datetime": "2016-07-18T09:06:52+01:00",
    "url": "https://www.dfnionline.com/latest-news/retail/galleria-duty-free-63-store-officially-opens-18-07-2016/"
}