{
    "text": " GammaCon 2015: Canberra convention brings together K-pop, cosplay and comic fans Lovers of comics, K-pop and cosplay have gathered in Canberra's south for GammaCon 2015 - the capital's third annual festival of popular culture. Similar to Oz Comic-Con, which tours other major capitals in Australia, GammaCon is an ACT event that celebrates video games, anime, manga, comics, science fiction, fantasy and all things in between. GammaCon convener James Ansell said the convention had become enormously popular since it began in 2013, with about 200 attendees in its first year. Our attitude is, if there's something cool, and someone can do it... we want it. He estimated more than 2,000 people would come through GammaCon's doors this year, at the Hellenic Club in Canberra's south. \"It s been quite amazing to see how much the Canberra community has really embraced this sort of event,\" he said. \"It's all themed around sci-fi, or fantasy ... all this sort of nerdy stuff.\" Mr Ansell said these days, when a major Marvel movie was released every two weeks, the word \"nerd\" no longer had negative connotations. \"It's the era of the nerd basically now,\" he said. For many attendees, one of the highlights of this year's GammaCon was an appearance by Andy Trieu, host of television show PopAsia - a popular Sunday morning program on SBS featuring Korean pop music (K-pop) and video clips. The TV host came to GammaCon to meet and greet fans, and lead a workshop on mastering some essential K-pop dance moves. \"It's just so awesome to see an event like this Canberra ... bringing together people who are interested in manga, video games even Asian pop all in the same place. It's just really cool,\" he said. \"It's really vibing.\" During his dance workshop, Trieu used Korean pop star Psy's huge 2012 hit Gangnam Style as an example of Asian pop. He said the genre was less about a specific musical style, and more about music videos and the celebrities who feature in them. \"It specialises in having swift, slick dance grooves with quirky, great music of all kinds of genres, collaborating with many western artists to create the songs,\" Trieu said. \"It just shows a slick production value, or level, of making music. And it also shows a whole bunch of quirkiness, over-the-top concepts, great fashion and personalities.\" Trieu said K-pop, or Asian pop, had a lot of crossover appeal at conventions like GammaCon. \"A lot of people that are into Asia pop are also into manga and gaming,\" he said. Trieu's K-pop workshop was followed by a cosplay competition. Cosplay, which stands for costume play, is all about getting dressed up as a fictional character - typically inspired by the sci-fi or fantasy genre. About 30 people took part in the official Cosplay competition but plenty many more had dressed up for the event. Catriona Oldfield, 15, came dressed as Jinora, from the cartoon Legend of Korra. \"I came last year ... it's the best thing I've ever been to. It's so much fun and I love it,\" Catriona said. \"I'm a very big Avatar World fan. I love the series so much. It's just beautiful.\" As well as K-pop and cosplay, this year's GammaCon included a short film festival, a fan fiction competition, and a space for computers games, role players and board games. The organisers said the aim was to be inclusive as possible. \"Our attitude is, if there's something cool, and someone can do it ... we want it,\" Mr Ansell said. \"We've jammed more stuff in than we probably should have ... we're spilling out into the hallway. \"We really just want to have as much cool stuff as there is. That's what makes it interesting. Just seeing all the amazing stuff that's around, both Canberra to Australia-wide. \"Pop culture is not just a casual hobby. It can be just that if you want it to be, but if you want to do more with it or go somewhere with it, there's a huge world there.\" We acknowledge Aboriginal and Torres Strait Islander peoples as the First Australians and Traditional Custodians of the lands where we live, learn, and work. This service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced. AEST = Australian Eastern Standard Time which is 10 hours ahead of GMT (Greenwich Mean Time) ",
    "title": "GammaCon 2015: Canberra convention brings together K-pop, cosplay and comic fans - ABC News",
    "datetime": "2015-05-23T18:28:40+00:00",
    "url": "https://www.abc.net.au/news/2015-05-24/gammacon-2015-festival-brings-together-k-pop-cosplay-and-comics/6492426"
}