{
    "text": "  This article is over a year old, and the information within may be out of date. K-Culture will showcase performances by the band P1Harmony, featuring Markham’s own Korean-Canadian singer Yoon Keeho. - Photo courtesy of ROM Get things shaking with a K-pop band and a host of Korean contemporary culture. The Royal Ontario Museum (ROM) is launching the new season of ROM After Dark with K-Culture taking the lead. K-Culture will showcase performances by the band P1Harmony, featuring Markham’s own Korean-Canadian singer Yoon Keeho. Keeho (Stephen) was born in Toronto in 2001, grew up in Markham and went to Unionville High School. He was trained for almost three years prior to his debut and was introduced as the first member of P1Harmony. Keeho’s soulful voice is quite distinct throughout P1Harmony’s music and covers. He also has writing credits on several songs throughout P1Harmony’s discography, including “That’s It,” “Reset” and “If You Call Me.” Since debuting in 2020 with the release of “Siren,” P1Harmony have come out with five new albums, including the recent “Harmony: Zero In.” The title song, “Doom Du Doom,” has been viewed on YouTube over ten million times as their fan base grows. ROM After Dark: K-Culture will be launched on Friday, Sept. 16, from 7:30 p.m. to 11:30 p.m. While driven by K-pop’s signature musical hooks, ROM After Dark: K-Culture will showcase a variety of Korean arts and culture in the forms of animation, calligraphy, fashion, music and dance. Visitors can join and display moves with Dance like a K-pop Star with Toronto’s RPM Dance Crew, take a shot at Korean Karaoke stardom or get dancing with DJ Yuka K and DJ Korea Town Acid. Sample Korean animation shorts such as “Manimals” by Oh Jihyeon, “Apartment” by Lee Jui and “Shining Night” by Yang Hyeonseo. For a more relaxed vibe, you can enjoy Korean tea tasting with certified tea sommelier Soo Park of Soocha Tea, groove to Korean contemporary jazz or enjoy the instrumental meditation sounds from musicians from the Korean Traditional Music Association of Canada. Get the unique experience of donning traditional attire in the Hanbok selfie station; hanbok is a type of traditional dress that remains an important part of Korean culture and is worn on special occasions. Tickets are $30 and can be purchased online. ROM members get 10 per cent off. ROM After Dark is the museum's monthly evening cultural social event for adults. The popular series features curated performances, music, gallery access and a night out on the town with an eclectic mix of bar refreshments and food from themed pop-up stations. ROM After Dark returns for six more Friday evenings with new themes and new things to do and enjoy. Top stories delivered to your inbox. is a former reporter for the Markham Economist & Sun and YorkRegion.com. Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers: © Copyright 2023 Metroland Media Group Ltd. All Rights Reserved\n8 Spadina Avenue, Suite 10A, Toronto, ON M5V 0S8       Sign up with  Thank you . Your account has been registered, and you are now logged in. Check your email for details. Invalid password or account does not exist Sign in with Submitting this form below will send a message to your email with a link to change your password. An email message containing instructions on how to reset your password has been sent to the email address listed on your account. No promotional rates found.    Secure & Encrypted Secure transaction.\nSecure transaction. Cancel anytime.  Thank you. Your gift purchase was successful!\nYour purchase was successful, and you are now logged in. A receipt was sent to your email. ",
    "title": "Get things shaking with K-pop idol from Markham on ROM stage",
    "url": "https://www.yorkregion.com/things-to-do/get-things-shaking-with-k-pop-idol-from-markham-on-rom-stage/article_de2866df-23b3-5b3b-b776-682ac8c43e1b.html"
}