{
    "text": "Why don’t we get education changing the way successful systems change? This means that we keep working to improve the schools we have, but don’t bet all our chips there. At the same time, we should be open to innovation, letting organizations and individuals try things outside the givens of conventional school and conventional teaching. Call it a “Split Screen” strategy.  It does work. In successful, self-improving systems, new ideas get tried and early adopters pick them up. Initially, most people remain with the traditional ways, but as the new strategy improves, people shift. In time, a transformation occurs; sometimes rapidly.  Unfortunately, education policy does not work like that. Deep inside, its working premise is to develop a consensus on “The Right Way,” and then to engineer a comprehensive transformation politically. But arguing alternative futures is not the route to change. Imagine doing that with communications or transportation: arguing land line vs. cellphone, and gasoline-powered vs. electric or hybrid. We’d never get consensus on one right way. Instead, we’d be where we are with education. Most systems combine improvement and innovation. Why can’t we do that with a system as important as public education? When traditional education policy set out in the 1980s to improve school and system, it approached the problems—visible in test scores, graduation rates, and teacher quality—as problems of organizational performance. It did not see them as ones of school and system design. It took the traditional arrangements as given. This was realistic: If policy experts had tried at the same time to redesign K-12 practice, proposing to turn it inside out and upside down, nobody would have listened. So policymakers moved to introduce standards of performance, measures of performance, and consequences for performance; initially at the state level, then at the national level. “Reform” today is still about driving change into an inert system, rather than changing what makes K-12 an inert system. This has left the nation with a one-bet strategy: continuous improvement within the givens of traditional school and system. This might succeed, despite the resistance to the Common Core State Standards and to testing. And improvement surely is good. But by itself it is a risk. And, because it is a risk, it is not enough. Almost certainly we could be getting more than we are from both our students and our teachers. For this, education policy must find new models of school and new approaches to learning.  Conventional policymaking is unlikely to produce a radical redesign of school and learning. Education policy needs a new concept of change to find its way into 21st-century learning. It’s fine to say we’ll close achievement gaps and make graduates college-ready, raise standards, enforce accountability, draw top candidates into teaching, and “do what Finland did.” But endlessly restating objectives does not make things happen.  There has to be a new “How.” The great need—and opportunity—today is to personalize learning, capturing the potential of digital electronics. We cannot imagine today what teaching and learning might look like in this new world. The new-and-different will have to evolve. This means finding ways to free up districts, schools, and teachers—those that wish to be freed, that is—to depart from the givens of conventional school: from whole-class teacher instruction; from age-grading; from the conventional academic day, week, and year; and from the one-dimensional notion of achievement. Innovation is letting people try things. Chartering is a platform for innovation. The freedom it provides has produced more different forms of school than research has explored. Starting around 2004, however, it was turned by its new leadership toward doing conventional school better by getting elementary students in the inner cities to perform better. But chartering still is the opportunity to do different completely, not just to do better at what we’re doing already. Innovation can come in the traditional district sector, too. There should be enough progressive superintendents and motivated teachers to make a start. Teachers will be the key; they must be able professionally to adapt their teaching to the differences among their students—the differences that the teachers know best. (To see a district teacher doing this, look here.) Over time, teaching will change and perhaps become more like coaching. The old boss/worker model of school organization can also change, and it would be logical for the teachers’ unions to lead both changes. The old deal was that teachers, who do not control professional issues, would not be accountable for student learning. Now those we call reformers want to hold teachers accountable, while school management still controls the curriculum and pedagogy. Predictably, reasonably, teachers resist. The way out is a new deal. Teachers get the authority to decide what matters for student success and, in return, accept accountability for student success; the quality issues are internalized within their professional group. Research by Widmeyer Communications for my organization, Education Evolving, shows astonishingly high support among teachers and in the general public for this teacher-powered arrangement. Ninety-one percent of 1,000 people surveyed in January said they felt “teachers should have greater influence over decisions that affect student learning,” and 81 percent said they trusted teachers to make “schools run better.”  And, remind those who resist: Nobody will be forced to change. This is about freeing up venturesome individuals and organizations to try things. Efforts will continue to improve existing schools, but now innovation will also be running on a separate policy “screen.” Innovation is the “How” of change. The case for letting people try new things comes through powerfully in Engineers of Victory, Yale historian Paul Kennedy’s account of innovation in World War II. Franklin Roosevelt and Winston Churchill had a grand strategy to supply Great Britain from factories in North America, to bomb Germany night and day, and to open a second front in Western Europe. But in early 1943, ships were being sunk and bombers shot down at unsustainable rates. Winning depended on figuring out how to get Allied ships safely past the U-boats, how to provide fighter cover for the bombers over Germany, and how to land an army on a hostile and well-defended shoreline. So, the innovators were given permission to brainstorm. Canadian engineers switched a bomb bay for a fuel tank and extended the range of B-24s patrolling for submarines. Physicists in Britain figured out how to miniaturize radar to fit in a plane’s nose cone. Ronnie Harker, a Rolls-Royce test pilot, suggested putting the Spitfire engine into the American P-51, producing the Mustang fighter able to accompany the B-17s to Berlin. U.S. Army engineers at Aberdeen Proving Ground turned the Soviet T-34 into a tank that drove the German Panzers out of the Soviet Union. So what was the “How” behind these advances? It was, Kennedy writes, the creation of “a climate of encouragement for innovation.” Answers did not come from the top, but from people close to the action. “The successful systems,” he says, “stimulated initiative, innovation, and ingenuity and encouraged problem-solvers to tackle large, apparently intractable problems. Winning requires people to run organizations in a fashion that will allow outsiders to feed fresh ideas into the pursuit of victory. None of this can be done by the chiefs alone. There has to be a support system, a culture of encouragement, efficient feedback loops, and a capacity to learn from setbacks.” Who would describe mainline American education policy today as “creating a climate of encouragement for innovation” for those closest to the action? In World War II, it took about 18 months to find answers to the critical challenges. The United States has been bumbling around with its education problem for almost 40 years.  Why would we not get education changing the way successful systems change? A version of this article appeared in the September 24, 2014 edition of Education Week as Getting Beyond One ‘Right Way’ of K-12 Reform ",
    "title": "Getting Beyond One 'Right Way' of K-12 Reform (Opinion)",
    "datetime": "2014-09-22T16:25:46",
    "url": "https://www.edweek.org/leadership/opinion-getting-beyond-one-right-way-of-k-12-reform/2014/09"
}