{
    "text": "Roof-top meetings and friendly colleagues helped to make Twitter’s employees the happiest in the country, according to a report published Friday. The microblogging company received the highest rating from its own workers in terms of corporate culture and values on career website Glassdoor.com, which studied the reviews of tens of thousands of employers. Twitter ended up with an average score of 4.5 for culture and values on a scale of 1 to 5. The time period covered by the report – July 2013 to July 2014 – was certainly an eventful one for Twitter, which launched a successful IPO last fall that famously turned 1,600 of its employees into instant millionaires and, one would assume, pretty happy campers. Workers also get free meals at its San Francisco headquarters, in-office yoga classes and unlimited vacation, at least for exempt employees. Glassdoor relies on employees’ opinions of their companies, which are submitted anonymously, to create its database of reviews of employers across dozens of industries. In addition to the scale of 1 to 5 rating, Glassdoor also asks employees to submit more specific thoughts on their companies’ cultures and values. “Team meetings on the roof are the best, great teamwork and a lot of smart people,” one self-described software engineer at Twitter told Glassdoor. That employee added that the company’s core values help steer Twitter’s in a positive direction, while an anonymous Twitter account executive said “everyone is friendly” at the company. Glassdoor community expert Scott Dobroski told Fortune that, overall, three common themes emerged from all of the employee comments. “We saw employees talking about a supportive and motivational team-oriented environment,” he says. “We saw employees talking about working for companies that had a great mission statement and generally did the right thing and acted with integrity.” And, finally, Dobroski says employees wanted to feel like they had “a second family” at the workplace, where they could turn to colleagues for support and advice. Rounding out the top three on Glassdoor’s culture and values ranking behind Twitter were public relations firm Edelman and Internet giant Google (GOOG), both of which had an average rating of 4.4 out of 5. Edelman workers who reviewed their employer on Glassdoor pointed to the “entrepreneurial spirit” of the agency, while one Google researcher said that company features a “culture of respect.” Tech companies dominated the top rankings with 11 of the top 25 slots including Facebook, Intuit and Apple. Dobroski says employees at such companies likely rate their employers highly when it comes to culture and values because they really buy into the companies’ mission statements. “Part of their mission statement at these three companies is to make the world more connected and open . . . So, we see the employees really love working there because they believe in the mission,” Dobroski says. Dobroski says company culture is among the top five factors that prospective employees consider when looking for a new job. But despite all the feel-good philosophy, salary is, in the end, the most important factor in the ratings, he says. Of course, tech company wages are quite high compared with average national salaries. Tech companies also shower workers with free perks. Retail was the second most -represented industry on the list with three companies getting high marks from employees for their culture and values including grocery-store chains HEB (HEB) and Wegmans. The only restaurant chain on the list was Chick-fil-A, which ranked seventh. Of course, not all is rosy at top ranked companies like Twitter. It’s share price has fallen to almost $30 at one point this year after reaching a high of more than $70 in 2013. But its stock (TWTR) has since rebounded somewhat and is up almost 19% in just the past month. What Glassdoor didn’t do is publish a list of companies with the lowest ratings in terms of culture and values. For those, you’ll just have to guess.   © 2023 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. ",
    "title": "Glassdoor report says employees rate Twitter highest for culture and values | Fortune",
    "url": "https://fortune.com/2014/08/22/twitter-tops-list-company-culture/"
}