{
    "text": "The global semiconductor industry’s capital spending is forecast to surpass US$100 billion (112 trillion won) this year for the first time ever. According to IC Insights, a global semiconductor market research company, the total amount of capital spending by global semiconductor companies is forecast to climb 15% to $107.1 billion this year, the first time that annual industry capex is expected to top US$100 billion. The sharp increase in capital outlay is led by Samsung Electronics, which is projected to account for 21.1 percent of the total with US$22.6 billion. IC Insights note that Samsung spent US$24.2 billion for semiconductor capex in 2017. It forecasts that the company’s spending will edge slightly downward this year, but remain at a very strong level. It says Samsung’s two-year semiconductor capital spending will be an astounding US$46.8 billion. According to IC Insights, Samsung’s semiconductor capital outlays from 2010, the first year the company spent more than US$10 billion in semiconductor capex, through 2016 averaged US$12.0 billion per year. However, after spending US$11.3 billion in 2016, the company more than doubled its 2017 capex budget. “The fact that Samsung continued its strong capex spending in 2018 is just as impressive,” it says. IC Insights believes that Samsung’s massive capital spending in 2017 and 2018 will have repercussions far into the future. It notes that one effect that has already begun is a period of overcapacity in the 3D NAND flash market. This overcapacity situation, the research company says, is due not only to Samsung’s huge spending, but also to spending by competitors, including SK Hynix, Micron, Toshiba and Intel, which sought to keep pace in this market segment. IC Insights also points out that SK Hynix ramped up its capital spending this year. In the first quarter of this year, SK Hynix said that it intended to increase its capex spending by “at least 30%” this year. Yet IC Insights forecasts the company’s actual capital spending will surge 58% from US$8.09 billion in 2017 to US$12.8 billion in 2018, ranking third among global semiconductor companies. SK Hynix increased its spending this year to bring new capacity online at two of its large memory fabs -- M15, a 3D NAND flash fab in Cheongju, South Korea, and its DRAM fab in Wuxi, China. According to IC Insights, Intel Corp. will rank second with US$15.5 billion, up 32% from last year’s US$11.78, while Taiwan's TSMC will follow SK Hynix to take fourth place with US$10.25 billion, down 5% from a year ago. Micron of the U.S. is forecast to place fifth with US$9.96 billion, up 54% from last year. IC Insights predicted that major semiconductor companies will slow down the pace of facility investment next year as the memory semiconductor market has been soft recently. Samsung Electronics is forecast to reduce its capital spending by 20 percent to US$18 billion in 2019, while Intel and SK Hynix are expected to cut spending by 13 percent and 22 percent respectively. The combined capital spending by the three largest memory suppliers -- Samsung, SK Hynix, and Micron -- is forecast to drop from $45.4 billion in 2018 to $37.5 billion in 2019, a decline of 17%. IC Insights says the current softness in the memory market is expected to extend into at least the first half of next year. The overall capital spending of the global semiconductor industry is forecast to reach US$94.59 billion, falling below the US$100 billion mark. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Global Semiconductor Capital Spending Projected to Surpass $100 bil. in 2018 - Businesskorea",
    "datetime": "2018-11-30T17:36:06+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=27073"
}