{
    "text": "Subscribe for full access to The Hollywood Reporter Subscribe for full access to The Hollywood Reporter The exec touted the rise of K-Pop and Korean film and extended a deal between Google and the country's culture ministry to support local arts and culture. By \n\n\tLee Hyo-won SEOUL – Google CEO Eric Schmidt touched down in South Korea this week. The tech exec was in Seoul to announce that the Internet giant plans to actively promote the Korean alphabet, Hangul, amid the rising popularity of K-pop around the world. Google will fund and design education facilities for the Hangul Museum that is slated to open in Seoul next year, Schmidt said during a joint press meeting with the South Korean culture ministry. The CEO did not specify the amount of financial support, but he said the company plans to develop web tools for learning the alphabet online.  PHOTOS: The 10 Most Googled Oscars Gowns  “I heard that King Sejong invented the language because he was concerned so few Koreans could communicate, that there was a division between the upper class and normal people,” Schmidt said of the 15th-century monarch who promulgated Hangul. “It was a very important decision made in history… He wanted to make it easier for people in Korea to be able to organize information, 600 hundred years ago,” he said, adding that the vision for sharing information with the masses corresponds to Google’s mission. “The Korean culture spans 5,000 years,” Schmidt said, comparing it to the company’s history of 15 years. “It’s a pleasure for me to learn from the richness of Korean culture and also to help it to share with the rest of the world.” “Google will be a great deal of help to us and we can, in turn, contribute to Google. This is just the beginning of what I hope will be a larger partnership between our two organizations,” said Culture Minister Yoo Jin-ryong. STORY: Google Chairman Eric Schmidt Calls on North Korea to Drop Web Barriers The collaboration is an extension of a 2011 deal to promote Korean music and films online, and Google plans to expand the coverage by introducing local traditional clothing (“hanbok”) and architecture (“hanok”) via Google Cultural Institute. As part of the former deal, several concerts including performances by Psy were broadcast live on YouTube’s K-pop channel. “Today, K-pop is everywhere, and even I had to learn how to dance ‘Gangnam Style,'” Schmidt said, adding nearly 90 percent of the views tallied on K-pop videos posted on YouTube are from outside Korea.  Old Korean films provided by the Korean Film Archive were screened on YouTube’s Korean film channel. Since opening in May 2012, the channel attracts about 2,700 views per day by users in 160 countries and 70 percent of users are from outside of the country. Since May this year, the National Museum of Korea and Korea Database Agency have also provided images for Google Art Project, a cyber exhibition space for artworks and cultural relics from all over the world. Related Stories\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tRelated Story\n\t\t\t\n\n\n\n\t\n\t\t\n\t\t\t\t\tGoogle Chairman Eric Schmidt Calls on North Korea to Drop Web Barriers\t\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tRelated Stories\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tRelated Story\n\t\t\t\n\n\n\n\t\n\t\t\n\t\t\t\t\tThe 10 Most Googled Oscars Gowns\t\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tRelated Stories\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tRelated Story\n\t\t\t\n\n\n\n\t\n\t\t\n\t\t\t\t\tSun Valley: Google's Eric Schmidt Discusses Apple Rivalry\t\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tRelated Stories\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tRelated Story\n\t\t\t\n\n\n\n\t\n\t\t\n\t\t\t\t\tMissy Elliott's Buzzed-About K-Pop Duet Released (Video)\t\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tRelated Stories\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\tRelated Story\n\t\t\t\n\n\n\n\t\n\t\t\n\t\t\t\t\tA$AP Rocky, G-Dragon Named Style Icons at Top Asian Awards Sign up for THR news straight to your inbox every day Sign up for THR news straight to your inbox every day Subscribe for full access to The Hollywood Reporter Send us a tip using our anonymous form. ",
    "title": "Google CEO Eric Schmidt Sweeps Into South Korea, Promotes Local Cultural Initiative – The Hollywood Reporter",
    "datetime": "2013-10-31T00:59:16+00:00",
    "url": "https://www.hollywoodreporter.com/business/digital/google-ceo-eric-schmidt-sweeps-652105/"
}