{
    "text": "GOT7 have been traveling through the United States, playing arenas on their 2018 Eyes on You world tour, and ahead of the final Stateside date at Brooklyn's Barclays Center -- where they'll be the… By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin GOT7 have been traveling through the United States, playing arenas on their 2018 Eyes on You world tour, and ahead of the final Stateside date at Brooklyn’s Barclays Center — where they’ll be the first K-pop group to perform at the massive arena — the guys stopped by Billboard‘s New York offices to take in the moment. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tGOT7\t\t\n\t\t\t\t\t\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news  The multinational boy band spoke in both English and Korean about their experiences on tour so far, including a memorable show at The Forum in member Mark’s hometown of Los Angeles (“We knew we wanted to perform in arenas, we just didn’t know how long it would take,” the SoCal native shares), what it’s like meeting fans personally before each show (with the band explaining the culture of “hi-touch”), as well as their habits on tour (including which members are singing Bruno Mars, Bazzi and unreleased GOT7 music in their hotel showers).  In a poignant moment, member BamBam took some time to share how they see achievements like these not only as significant to him and his bandmates, but in laying down the groundwork for the future of Korean music. “In some places, we’re the first K-pop group that can perform [at these arenas] and sell it out,” he explains. “It’s an honor and, as a K-pop artist, I feel like another group can get some energy from us too. K-pop is not just GOT7; we’re all family. GOT7, another group, different companies — we’ll start right now and later we’ll make K-pop bigger so another group can perform here too.” GOT7 leader JB added to that sentiment, saying that they feel “blessed” to be able to share the culture of K-pop. Watch the full interview above for more tour stories, career reflections and the meaning behind their latest chart-topping album Eyes on You.  Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "title": "GOT7 Interview: 2018 World Tour, Travel Habits & Why K-Pop Industry Is ‘All Family’ | Billboard – Billboard",
    "datetime": "2018-07-11T19:13:43+00:00",
    "url": "https://www.billboard.com/music/music-news/got7-eyes-on-you-2018-world-tour-interview-video-8464988/"
}