{
    "text": "As the president of the Black Student Union and a long-running member of BSU for now entering four years, I get asked all the time, “Why do we need a Black Student Union?” There is no exact answer to be honest. However, I will say this: BSU exists because we as African-American students exist. Looking at our country, and even our university, black representation lacks in what seems like every facet of our community. All the plentiful aspects of black culture are not in full representation within our society. As African-American students, we are more than the sports we compete in and the hip-hop music we create. Why do we need a Black Student Union? Because, in terms of student retention here at K-State, we are last in retaining our students compared to white and Hispanic students. Cumulative grade-point average and graduation rates? Last. So why do we need a BSU? Because young African-Americans can’t afford to be without a sense of cultural pride and competency. Why do I and so many other African-American students know and have been taught more about European history than our own? We’re more than the history of slavery and Dr. Martin Luther King Jr., although both are important pieces in our history. Why do we need a BSU? To give our African-American students a place to feel liberated and alleviated from the injustices our people face daily and the draining racism we encounter in our lives, even if it is just for just an hour and a half per week at a BSU meeting. K-State is not perfect, let’s be real. There are many students who hold negative views and interpretations of African-Americans. The world isn’t perfect. BSU makes one forget that unfortunate reality once you walk into such an inviting and inclusive community. Why do we need a BSU? Our community serves as a place where anyone can educate themselves on our own culture. No, you don’t have to be African-American to attend BSU. Let it serve as an opportunity to gain a small, yet better, understanding of who we are as African-American students here at K-State. You see, it’s hard to cram an entire group of people’s culture, history and community into one organization, but if not us then who else will? We embrace our roles to do so. Imagine cramming the College Republicans Club, Skydiving Club, Christian Challenge, Economics Club, and many more into one club? Sounds pretty difficult and hard to maintain. Through the obvious difficulty you could say we make it work and do a good job. Moving forward, we need the Black Student Union because we still have a ways to go in creating a better racial climate for people of color at K-State. Instances of racism are still happening on and off our campus. Also, we have to continue to increase diversity at our beloved university. We need more faces that represent all shades and colors, as long as they’re wearing purple. I’d say BSU exists because we ALL exist. Muenfua Allen Lewis Junior in Finance K-State Black Student Union President ",
    "title": "Guest Column: Why does the Black Student Union exist? - The Collegian",
    "datetime": "2015-10-20T05:51:12+00:00",
    "url": "https://www.kstatecollegian.com/2015/10/20/guest-column-why-does-the-black-student-union-exist/"
}