{
    "text": "A new K-Pop music video which opens with a traditional haka is offensive, says a respected Māori lecturer and filmmaker. Korean pop group NCT 127's new single Simon Says samples three seconds of a haka at the beginning of a song that ends with the defiant line \"we don't pay no attention\". It is another case of Māori culture being misappropriated, says Karlite Rangihau, a lecturer in the Masters of Indigenous Knowledge course at Te Wānanga o Aotearoa and a leading filmmaker. \"The haka is upbeat and represents masculinity but I would never use a Korean tradition in any of my work,\" says Rangihau. \"If they came to New Zealand, or if they had a Māori in that video doing the haka, then I think it'd be fabulous.\" READ MORE: * Ngai Tahu's reach shapes a new city * Tyson ink stink resolved * Tapu taboos * Pounamu mana​ * JK Rowling under fire for writing about 'Native American wizards' NCT 127 is a popular 10-member group formed in 2016. Simon Says is the lead single on their album Regulate. Rangihau says she can appreciate how the haka's use in their video might seem okay. \"I'm from Tūhoe and if I view that music video with that lens, then I'm offended. But if I wore my Te Arawa hat, I'll be more understanding because Te Arawa have been engaged in tourism and international cultural events for a very long time.\" The K-Pop video is one of a long list of acts and media adopting Māori culture into their work. In the past the haka and moko have been used to sell products including energy drinks and German cars. Members of the Patea Māori Club said they were disgusted when their song Poi E was used during the BET awards show in June. In a live performance, actress Teyana Taylor danced provocatively to Poi E as a promotion for the US television series Hit The Floor in which she stars. Rangihau says technology means that Māori cannot prevent their culture from being exposed and made accessible to the world. \"We've reached a point in our cultural evolution that cannot be defined or restricted to our marae.\" She says this is a lesson for all New Zealanders, not just Māori, to embrace and reclaim the indigenous culture of New Zealand. First step, she says, is for everyone to learn te reo Māori. \"We need to own it,  We need to repatriate our own history and culture because if we don't, others will and they'll misuse it.\" *Comments on this article have now closed. © 2023 Stuff Limited ",
    "title": "Haka in K-Pop music video 'offensive', says Māori lecturer | Stuff.co.nz",
    "datetime": "2018-11-27T01:27:33.938Z",
    "url": "https://www.stuff.co.nz/entertainment/108899046/haka-in-kpop-music-video-offensive-says-maori-lecturer"
}