{
    "text": "LOS ANGELES, CA / ACCESSWIRE / August 2, 2022 / Hanryu Holdings, a global Korean Pop Culture platform company, announced today it will be attending KCON 2022 LA, the World's No. 1 K-Culture Festival, in Los Angeles August 19-21. The Company will have a booth display to promote its popular, and growing, FANTOO smartphone app for fans of K-Culture. The booth will be a place for K-Culture fans to find out more about FANTOO's features and capabilities, as well as sign up for exclusive events, including a live performance from one of the winners of FANTOO's Global KPOP Dance Competition. The Competition featured 1,312 teams from around the world. During KCON 2022 LA, one of the most beloved KPOP groups-whose name will be revealed as the event draws near-will visit the FANTOO booth for a special meet-and-greet only for FANTOO subscribers. The booth will also feature plenty of convention swag and prizes. Fans will also be challenged to play Red Light/Green Light, a game from the popular Netflix show Squid Game, to win prizes and tickets to various KCON 2022 LA events. For more details and a chance to win free tickets to KCON 2022 LA, please visit FANTOO's landing page for this event at https://event.fantoo.co.kr/ First held in 2012 in the U.S., KCON played an instrumental role in spreading K-Culture throughout the world. The event has amassed millions of fans across nine cities/regions in North America, Europe, Asia, and more. From its first event, which attracted 10,000 visitors, KCON has seen incredible growth, gathering 291,000 attendees in 2019 (the last in-person event). During the pandemic, the event went virtual with \"KCON:TACT,\" which has seen more than 22 million K-pop fans tune in over the last two years. \"K-culture is sweeping the world, and KCON 2022 LA is the epicenter of the culture-quake that expanded the influence of Korean art, music and film to the rest of the world,\" said company spokesman James Lee. \"We can't wait to join fans, content creators and K-Culture celebrities alike back in the place where the movement began back in 2012. We look forward not only to meeting new fans, but also to bringing the 4 million-plus members of our FANTOO app all the big news and exclusive content from the show.\" About Hanryu Holdings Inc. Hanryu was established in 2018 as Hanryu Bank Co., Ltd, in the Republic of South Korea, aiming to spread K-Culture (Hanryu) across the globe. In 2021, Hanryu launched FANTOO, an all-in-one fandom platform. FANTOO connects users who share the same interest, particularly K-Culture, by providing communication, content creation, and e-commerce services. Through these experiences, FANTOO users can stay connected and up to date with their fandom communities. About FANTOO FANTOO is a social networking platform for global fans of K-Culture, with a suite of features and functionalities built to engage K-Culture fans and keep them engaged through its comprehensive services, fair and efficient rewards system, and various fan events. Fans can socialize and get up-to-date news and information in the communities, create their own clubs to bond with others who share common interests, live chat with each other in different languages, as well as create, share, and sell content to other fans. Fantoo is part of the next generation of digital fandom apps designed to become part of the global fan economy. Investor Contact: Dave Gentry, CEORedChip Companies Inc.407-491-4998hanryu@redchip.com Hanryu Holdings, Inc. Contact: Ahra Choahra@fns.ai Cautionary Note Regarding Forward-Looking Statements This news release includes certain \"forward-looking statements\" for the purpose of providing information about management's current expectations and plans relating to the future. Forward-looking statements are based upon a number of estimates and assumptions that, while considered reasonable, are subject to known and unknown risks, uncertainties and other factors which may cause the actual results and future events to differ materially from those expressed or implied by such forward-looking statements. Such factors include, but are not limited to: general business, economic, competitive, political and social uncertainties; the ability of Hanryu to continue increasing its user-base; and Hanryu's ability to monetize its user-base. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements. Hanryu disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law. SOURCE: Hanryu Holdings View source version on accesswire.com: https://www.accesswire.com/710536/Hanryu-Holdings-Takes-Fantoo-to-KCON-2022-LA ",
    "title": "Hanryu Holdings Takes Fantoo to KCON 2022 LA",
    "url": "https://finance.yahoo.com/news/hanryu-holdings-takes-fantoo-kcon-120000409.html"
}