{
    "text": "K-Global is an annual convention held to acknowledge Korea's competitive technological advancements at Silicon Valley. K-Global @ Silicon Valley 2021 “Go Digital, Better Tomorrow” will present the ever-progressing modern outlook on digital transformation. (Graphic: Business Wire) K-Global is an annual convention held to acknowledge Korea's competitive technological advancements at Silicon Valley. K-Global @ Silicon Valley 2021 “Go Digital, Better Tomorrow” will present the ever-progressing modern outlook on digital transformation. (Graphic: Business Wire)  SAN JOSE, Calif.--(BUSINESS WIRE)--Known as the definitive record of the English language, the Oxford English Dictionary recently added and updated more than twenty Korean words. The K- prefix itself is listed along with such culturally specific words as skinship, aegyo, and mukbang. K-pop has been blasting the American air and wifi waves for the past few years. In 2020, Parasite took home four Oscars including Best Picture as the first non-English film, and just recently, Netflix’s Squid Game has captured the attention of anyone who keeps a pulse on pop culture and social media. “Korean wave”, or hallyu (another addition to the Oxford Dictionary), has found its way into mainstream American culture. A big influence has been through music especially. BTS has dominated the Billboard charts and found a plethora of new fans here in the states. However, they didn’t merely reach fans through traditional means of broadcast. In 2019, the record label that BTS is signed to, Hybe Corporation, sought to provide fans more intimate interactions with their favorite artists and even increase the fanbase through their unique platform: Weverse. Through Weverse, the media magnate Hybe creates an environment where artists can vlog, live stream, and answer messages from fans and for fans, allowing fans and their idols to get closer than ever. The app users can also purchase concert tickets, connect with fans of different artists, and even buy artists’ goods and merch. This particular innovation is an example of how digital transformation can impact businesses to reimagine their models and take their technology to a new level of efficiency and reach. Many of these ideas were derived from culture. More specifically, Korean culture has been at the forefront of where these businesses and the entertainment industries intersect. Better awareness of K-culture through the digital world has had a global influence. K-Global represents such global Korean influence with the focus on new and emerging technology. Participants of K-Global can learn about innovations such as the Starbucks Siren + myDT pass: by registering a license plate number in the app, cameras at the pick-up window will recognize the car plate and automatically charge the account for the drinks that were ordered ahead. Spatial is another unique example of these innovations. Another platform called Spatial provides digital conferencing inspired by virtual reality to create more interactive and productive meeting spaces. Toss is also mentioned during one of the keynote speeches as a stellar example of digital adaptation. Toss provides its users a plethora of financial services including standard banking, investing, loan application, insurance consultations, credit score reports, and securities and investments - an all-in-one platform seen never before. As a result, Korean start-ups have become the newest “blue ocean” for investors, as they eagerly seek worthy start-ups to dip their toes in the emerging market. These are merely a few among the many success stories of how K-companies create digital transformation successfully that K-Global will cover. K-Global will also feature noteworthy keynote speakers: CTO of IBM Ranjan Sinha will talk on “Accelerating Enterprise Transformation;” Twitter CISO Rinki Sethi will give her perspective on cybersecurity; CDO at AWS Faraz Shafiq dives deep into what opportunities digital transformation truly has to offer; VP at SK Telecom Jongmin Lee will provide a post-pandemic perspective on 5G and AI services; and VP at SK mySUNI Jeehyun Kim’s presentation, “Digital at Scale: The First Movers”, will provide attendees success stories of digital transformation, some of which has been shared above. Returning for its tenth annual event, K-Global @ Silicon Valley 2021 “Go Digital, Better Tomorrow” will present the ever-progressing modern outlook on business in the digital age. The virtual event will present along with the aforementioned keynote speakers, panelists from varied and expert backgrounds discussing digital transformation from the lens of start-ups, pitching competitions showcasing sixteen Korean start-ups and eight other international businesses, and opportunities to have one-on-one virtual meetings with exhibitors representing 38 South Korean companies through the online exhibition. The three-day event kicks off November 8th 5PM PST (00:00 UTC) About KOTRA KOTRA (Korea Trade-Investment Promotion Agency) is a non-profit agency that promotes international trade and investment by providing Korean SME export support, FDI promotion, and business matchmaking.  Eunji Kim | Marketing Specialist | KOTRA Silicon Valley\n3003 North First Street, San Jose, CA 95134\nmarketing@kglobal.tech K-Global 2021 \"Go Digital. Better Tomorrow\" will provide a unique insight into the future of digital transformation. Eunji Kim | Marketing Specialist | KOTRA Silicon Valley\n3003 North First Street, San Jose, CA 95134\nmarketing@kglobal.tech ",
    "title": "Hear from Digital Transformation Leaders from AWS, IBM, Twitter, and SK Telecom at K-Global 2021 | Business Wire",
    "url": "https://www.businesswire.com/news/home/20211029005562/en/Hear-from-Digital-Transformation-Leaders-from-AWS-IBM-Twitter-and-SK-Telecom-at-K-Global-2021"
}