{
    "text": "Photo Courtesy: IANS NEWS Suddenly, American hip-hop and Hollywood seem so 2020. If the pandemic left India locked in for most of the past year, a new wave of imported entertainment seems to have taken over 'desi' mindspace during this time.\n\r\nIn an age when the internet and OTT increasingly dominate viewing and listening patterns, India says hello to Hallyu. The K-craze is trending.\nHallyu is a term that the Chinese gave to the world and, translated, it means the 'Korean Wave'. Put simply, it refers to Korean pop culture, which has been manifesting itself all over the globe including India over the past few years. The last one year has only consolidated the fact that K-culture is here to stay.\nYes, we are talking BTS and \"Minari\", but also much more. What broadly started as a fad of following K-pop and K-movie is burgeoning into fan culture, especially among the nation's urban youth. After music and films, K-drama has already found inroads into Indian living rooms. Don't be surprised if K-beauty and K-food get essential makeovers and reach the larger Indian market.\nWhile the current wave is certainly the first consolidated attempt for a possible Korean culture influx here, the nation's impact on the Indian psyche has been a gradual process. Korean films have been around for decades -- Sanjay Gupta, after all, had rehashed the fabulous \"Oldboy\" (2003) as \"Zinda\" by 2006. Closer in time, pop star Psy's \"Gangnam Style\" had India grooving along with the world in 2012.\nThis kind of influx, though, did not mark a defining influence on the Indian mindset. An \"Oldboy\" was a rage, but only as much as numerous other foreign films that were finding space in the DVD shelf of the discernible movie addict, at a time when India was beginning to gain wider access to world cinema at large. Psy's global hit came and went, and was not powerful enough to create or sustain a wave.\nWhat BTS have managed to do is reorient listening habits of the Indian musiclover with an ear for foreign whiffs. Between \"Dynamite\" last year and \"Butter\" last month, the band has seen a noticeable jump in fan count. The number of Indian fans that have joined ARMY (as the band's ever-growing fan base is known) is swelling, a fact validated by the monstrous hits that \"Butter\" has garnered in India since release on May 21.\nAccording to YouTube statistics, the opening figures for the song stood at 32.2 million hits in India for the week of May 21-27, 2021. This made it the most popular foreign song in the country upon release this year so far. Incidentally, in its week of release the song was above many Indian songs that were already a rage on the charts, including B. Praak's \"Baarish ki jaaye\", Jubin Nautiyal's \"Wafaa na raas aayee\" and Stebin Ben's \"Thoda thoda pyar\".\nThe success of BTS has prompted another band to look for an Indian entry. The K-pop boy band Tomorrow X Together, popularly known as TXT, released the music video of their first English song \"Magic\" on June 11.\nNotably, bands like BTS and TXT are singing in English now, with an obvious eye at the lucrative English-speaking global market of which India, with a billion and quarter-plus population, is a massive chunk.\nIt is also the reason Amazon Prime have been quick to play up hosting recent Korean cinema winners such as the 2020 Best Film Oscar winner \"Parasite\" and this year's Oscar contender \"Minari\". If the advent of digital platforms has facilitated the entry of world cinema into average Indian laptops and cellphones, film catalogues of OTT sites including Netflix and Amazon Prime have been seeing a good number of views on even slightly older K-movies such as \"Train To Busan\", \"Burning\", \"Forgotten\", \"The Host\", \"The Drug King\", \"Psychokinesis\", \"Dawning Rage\", and \"The Chase\" among others.\nThe scene has been equally bright in India for K-drama, with Korean shows such as \"Start-Up\", \"Kingdom\", \"Full House\", \"The King: Eternal Monarch\", and \"Boys Over Flowers\" finding instant connect with the Indian audience.\nThe real test, more than OTT, must have been foraying Indian television where K-soap (the 'desi' Ekta Kapoor variety we mean) defined TV formula for over a decade.\nWhen Zing TV aired \"Boys Over Flowers\" in Hindi (along with the OTT platform Zee5) earlier this year, it was a clear signal the 'BTS syndrome' was beginning to lure the K-soap couch potato. The teenybopper series is about all things that define feel-good -- from high school romances to friendships, love triangles and heartbreaks. It is about pretty girls and goodlooking boys. Importantly, it is about a melodrama quotient that let the Indian psyche find instant connect with Korean fiction content, more than a lot of what OTT often imports from the West.\nIn fact, \"Boys Over Flowers\" resonated so instantaneously with the Indian audience that it found airtime once again last month, this time on Zee Cafe. There's more coming up. \"Descendants Of The Sun\" starts airing in June. It is a love story between a South Korean Special Forces Captain and a surgeon, and promises a brand of mush that clicks with Indian tastes.\nIn the era of social media networking and aggressive dissemination on the net, inflow of creative content from one country to another is natural. India, a nation that is forever thirsting for entertainment, has always welcomed every imported culture even before the net and social media made access to foreign content easy. The rising popularity of Korean power brands such as Samsung, Hyundai and LG since the opening up of the Indian economy in the late nineties, coupled by the impact of the United States' current interest in Korean culture thanks to inclusivity, has also played indirect roles in influencing India's rising interest in Hallyu.\r\n \n(IANS) Suddenly, American hip-hop and Hollywood seem so 2020. If the pandemic left India locked in for most of the past year, a new wave of imported entertainment seems to have taken over 'desi' mindspace during this time. In an age when the internet and OTT increasingly dominate viewing and listening patterns, India says hello to Hallyu. The K-craze is trending. Hallyu is a term that the Chinese gave to the world and, translated, it means the 'Korean Wave'. Put simply, it refers to Korean pop culture, which has been manifesting itself all over the globe including India over the past few years. The last one year has only consolidated the fact that K-culture is here to stay. Yes, we are talking BTS and \"Minari\", but also much more. What broadly started as a fad of following K-pop and K-movie is burgeoning into fan culture, especially among the nation's urban youth. After music and films, K-drama has already found inroads into Indian living rooms. Don't be surprised if K-beauty and K-food get essential makeovers and reach the larger Indian market. While the current wave is certainly the first consolidated attempt for a possible Korean culture influx here, the nation's impact on the Indian psyche has been a gradual process. Korean films have been around for decades -- Sanjay Gupta, after all, had rehashed the fabulous \"Oldboy\" (2003) as \"Zinda\" by 2006. Closer in time, pop star Psy's \"Gangnam Style\" had India grooving along with the world in 2012. This kind of influx, though, did not mark a defining influence on the Indian mindset. An \"Oldboy\" was a rage, but only as much as numerous other foreign films that were finding space in the DVD shelf of the discernible movie addict, at a time when India was beginning to gain wider access to world cinema at large. Psy's global hit came and went, and was not powerful enough to create or sustain a wave. What BTS have managed to do is reorient listening habits of the Indian musiclover with an ear for foreign whiffs. Between \"Dynamite\" last year and \"Butter\" last month, the band has seen a noticeable jump in fan count. The number of Indian fans that have joined ARMY (as the band's ever-growing fan base is known) is swelling, a fact validated by the monstrous hits that \"Butter\" has garnered in India since release on May 21. According to YouTube statistics, the opening figures for the song stood at 32.2 million hits in India for the week of May 21-27, 2021. This made it the most popular foreign song in the country upon release this year so far. Incidentally, in its week of release the song was above many Indian songs that were already a rage on the charts, including B. Praak's \"Baarish ki jaaye\", Jubin Nautiyal's \"Wafaa na raas aayee\" and Stebin Ben's \"Thoda thoda pyar\". The success of BTS has prompted another band to look for an Indian entry. The K-pop boy band Tomorrow X Together, popularly known as TXT, released the music video of their first English song \"Magic\" on June 11. Notably, bands like BTS and TXT are singing in English now, with an obvious eye at the lucrative English-speaking global market of which India, with a billion and quarter-plus population, is a massive chunk. It is also the reason Amazon Prime have been quick to play up hosting recent Korean cinema winners such as the 2020 Best Film Oscar winner \"Parasite\" and this year's Oscar contender \"Minari\". If the advent of digital platforms has facilitated the entry of world cinema into average Indian laptops and cellphones, film catalogues of OTT sites including Netflix and Amazon Prime have been seeing a good number of views on even slightly older K-movies such as \"Train To Busan\", \"Burning\", \"Forgotten\", \"The Host\", \"The Drug King\", \"Psychokinesis\", \"Dawning Rage\", and \"The Chase\" among others. The scene has been equally bright in India for K-drama, with Korean shows such as \"Start-Up\", \"Kingdom\", \"Full House\", \"The King: Eternal Monarch\", and \"Boys Over Flowers\" finding instant connect with the Indian audience. The real test, more than OTT, must have been foraying Indian television where K-soap (the 'desi' Ekta Kapoor variety we mean) defined TV formula for over a decade. When Zing TV aired \"Boys Over Flowers\" in Hindi (along with the OTT platform Zee5) earlier this year, it was a clear signal the 'BTS syndrome' was beginning to lure the K-soap couch potato. The teenybopper series is about all things that define feel-good -- from high school romances to friendships, love triangles and heartbreaks. It is about pretty girls and goodlooking boys. Importantly, it is about a melodrama quotient that let the Indian psyche find instant connect with Korean fiction content, more than a lot of what OTT often imports from the West. In fact, \"Boys Over Flowers\" resonated so instantaneously with the Indian audience that it found airtime once again last month, this time on Zee Cafe. There's more coming up. \"Descendants Of The Sun\" starts airing in June. It is a love story between a South Korean Special Forces Captain and a surgeon, and promises a brand of mush that clicks with Indian tastes. In the era of social media networking and aggressive dissemination on the net, inflow of creative content from one country to another is natural. India, a nation that is forever thirsting for entertainment, has always welcomed every imported culture even before the net and social media made access to foreign content easy. The rising popularity of Korean power brands such as Samsung, Hyundai and LG since the opening up of the Indian economy in the late nineties, coupled by the impact of the United States' current interest in Korean culture thanks to inclusivity, has also played indirect roles in influencing India's rising interest in Hallyu. (IANS) Which among the following is most responsible for delay in road constructions, poor workmanship and maintenance in Nagaland? Give reasons. The Morung Express\nThe Morung Express is a people-oriented alternative newspaper based in Nagaland that was conceived from the Naga people’s historical realities and is guided by their voices and experiences. It emerged from the well-recognized concept that the core of a free press is based on “qualitative and investigative” journalism. Ensuring this is essential for contributing to an informed Naga public that makes sound decisions on issues that affect all spheres of life. The Morung Express The Morung Express is a people-oriented alternative newspaper based in Nagaland that was conceived from the Naga people’s historical realities and is guided by their voices and experiences. It emerged from the well-recognized concept that the core of a free press is based on “qualitative and investigative” journalism. Ensuring this is essential for contributing to an informed Naga public that makes sound decisions on issues that affect all spheres of life. Select Date ",
    "title": "Hello Hallyu! India's romance with K-culture is on | MorungExpress | morungexpress.com",
    "url": "https://morungexpress.com/hello-hallyu-indias-romance-with-k-culture-is-on"
}