{
    "text": "The University of Toronto has seen a big spike in enrolment in Korean language studies in recent years largely due to the rising popularity of K-pop, according to a professor in the school's East Asian studies department. \"We only had 30 students in our first year of classes 10 years ago . Now we've got 150, with double that on the waiting list,\" said Andre Schmidt on Metro Morning Monday. Some concert-goers demand refund after calling Hallyu North K-pop festival a 'chaotic mess' \"It's about K-pop music...then students get interested in Korean historical dramas and get interested in the culture more generally. Korean food is also getting more popular.\" Schmidt said his students are a diverse group of people from all over Canada and the world. \"I'll have a student who grew up in a farm town in Grey County in rural Ontario. She'll sit beside an international student from Beijing. They'll be beside someone who grew up in downtown Toronto speaking Greek or Italian and they'll be beside a third generation Korean-Canadian who, because of this music, wants to learn the language of their grandparents,\" he said.  Another contributing factor to the spike in popularity, which according to Schmidt is not just a Toronto phenomena but happening all over North America, is the booming Korean economy. \"Many of our students that graduate go on and get jobs in Korea,\" he said. \"K-pop is a phenomena of the growing importance of the Korean economy. It's a big industrial effort that's getting people around the world interested and it transfers into jobs for people.\" Schmidt, who teaches the Korean language and history of both North Korea and South Korea, said he had to add a lecture to his course to talk about the internationalization of Korean culture. Edmonton K-pop dancers master the moves of Korean music videos New radio show bringing joys of Korean pop to Regina In recent years, K-pop has also become easily accessible to people around the world, said Schmidt. \"When you look at it, the music videos, one of the things the culture industry in Korea is able to do is use YouTube to really spread the message,\" he said. \"And so that student who is from a farming community in rural Ontario can learn about Korean pop music without having ever been to Korea.\" Psy's Gangnam Style breaks the limit of YouTube's video counter As someone who has been teaching the language and history of Korea for many years, Schmidt said the interest he has seen recently has been really unexpected.  \"The truth is the students know how the world is changing sometimes better than the professors at the university,\" he said. \"I'm supposed to teach them this but they teach me this. So we're scrambling a little bit to accommodate all of this interest.\" For those whose interest may just be beginning to pique, Schmidt admits Korean isn't an easy language to master.    \"It's a difficult language to learn but all you have to do is go to Korea town and start ordering some food and practicing it and you'll pick it up soon enough.\"  Producer, CBC Toronto Ramna Shahzad is a multi-media producer and reporter in the CBC Toronto newsroom. She began working at CBC News in 2015 as a Joan Donaldson Scholar. Born in Karachi, Pakistan, she now calls Toronto home and writes about everything from transit and city hall to baby animal births at the zoo With files from Metro Morning Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636 It is a priority for CBC to create products that are accessible to all in Canada including people with visual, hearing, motor and cognitive challenges. Closed Captioning and Described Video is available for many CBC shows offered on CBC Gem.  ",
    "title": "Here's the unexpected reason why Korean language courses are so popular at UofT | CBC News",
    "url": "https://www.cbc.ca/news/canada/toronto/programs/metromorning/korean-interst-1.4022395"
}