{
    "text": "Follow Us The statue of the Hindu god Ganesha flashed on screen for just seconds in the music video by Blackpink, an all-female K-pop band. The elephant-headed deity was shown on the floor, near a bejeweled Aladdin lamp, as a member of the band preened and rapped on a golden throne. That glimpse of Ganesha in the video for “How You Like That” was enough for eagle-eyed K-pop fans, many of them in India, to unleash a torrent of criticism against Blackpink last month, accusing the group of cultural appropriation, of using the religious object as a prop and of defiling it by placing it on the ground. They demanded that the image be removed. “No hate to the artists but our hindu religion and Gods aren’t a toy/prop/aesthetic for pop culture music videos to use,” a fan from Delhi with the user name Iam_drish wrote on Twitter, adding that it wasn’t the first time Indian and Southeast Asian culture had been disrespected by K-pop. As the tempest grew, Ganesha suddenly vanished from the video posted on YouTube, and fans declared victory. On Wednesday, Blackpink’s management acknowledged that it had edited the deity out, saying in a statement that its use had been an “unintentional mistake.” The swift reediting of the Blackpink video illustrated how K-pop fans, who are deeply invested in the mythmaking of their musical idols, use the internet to spread their messages, reach the artists (and their management) almost instantly and get quick results. K-pop, fueled by highly choreographed musical performances, is South Korea’s biggest cultural export. The country’s music industry generated more than $5 billion in revenue in 2018, most of it from K-pop, according to the Korea Creative Content Agency. YG Entertainment, the agency that manages Blackpink, made $220 million in revenue in 2019. But the fans are key to the phenomenon, and they know it. They have helped to propel bands like Blackpink to stardom by coordinating mass postings and stunts on social media before an album release or a star’s birthday — in some cases, even pooling their money to buy subway ads. Blackpink — whose members use the stage names Jisoo, Jennie, Rosé and Lisa (real names Ji-soo Kim, Jennie Kim, Roseanne Park and Lalisa Manoban) — has more than 100 million followers across social media platforms. But K-pop fans — an internet-savvy army that spans the globe and counts members of different races, ages and socioeconomic strata among its ranks — are also pushing their idols to be socially progressive. They have become more politically active, claiming to have targeted an Oklahoma rally for President Donald Trump’s campaign by registering for thousands of tickets with no intention of showing up. K-pop groups are also reaching across cultural boundaries to find new muses. Boy band BTS was praised for “Idol,” a song released in 2018 that was infused with Afro-beats and Korean folk rhythms. But bands have also stumbled over cultural and racial red lines. The inclusion of religious and socially sensitive motifs for their opulent-looking video backdrops and candy-colored costumes has led to accusations of cultural misappropriation. Members of Blackpink, for example, were criticized for wearing bindis and box braids. Ganesha was the latest cultural touchstone to stir up the fan base. YG Entertainment, Blackpink’s agency, was bombarded by social media posts and emails, some of which followed a fan-created template. Fans demanded a public apology and the Ganesha statue’s removal. On June 30, the agency uploaded a new version of the “How You Like That” video without the deity. “It was immediately edited when we became aware of it,” said a YG representative, Cho Woo-young. Vedansh Varshney, a 21-year-old university student and K-pop fan from Delhi, said of K-pop’s cultural mash-ups, “Some people will feel like our culture is represented. But this is not the situation at all when it becomes disrespectful.” The list of comparable K-pop scandals includes a 2016 social media post by Taeyang, a singer with the band Big Bang, who used an app to merge his face with an image of Kanye West and wish his followers a “Happy Monkey New Year.” In 2017, the group Mamamoo performed a parody of “Uptown Funk” in blackface. In 2018, an old photograph circulated online showing a member of BTS wearing a hat with a badge resembling a Nazi insignia. A photograph of another band member in a T-shirt with a picture evoking the atomic bombing of Japan by the United States had already been widely shared. Apologies followed, along with suggestions that cultural ignorance was to blame. But some ask why the bands keep making similar mistakes. Some experts point to South Korea’s history to explain the prism through which K-pop artists distill foreign influences and inspiration. “When you take elements of a culture and use it in a way that demeans or ridicules the people in that culture, that’s disrespectful,” said Crystal Anderson, an affiliate Korean studies faculty member at George Mason University. “What is often left out of the conversation is how those images and their creators got to places like East Asia in the first place,” Anderson said by telephone. South Korea was largely cut off from the outside world during the Cold War, with many newspapers, books and films banned by military dictators. As the country opened up in the 1990s, many looked to the U.S. as a model for cultural success. But some racist tropes were imported and replicated during a campaign called “Let’s learn from Hollywood,” scholars say. “When foreign cultures came into Korea, they arrived through the lens of mainstream American media, making the situation prone to distortion,” said Shim Doobo, a professor of media and communication at Sungshin Women’s University in Seoul. “K-pop has grown faster than the industry had time to raise issues with or reflect on their problematic behavior,” Shim added. Even as fans chastise K-pop stars for using offensive images, it is unclear how many independent artistic choices the singers are allowed to make. The groups are tightly managed by agencies that dictate virtually every detail of their public lives, from their appearance to their romantic relationships. Discussions of racism in the wake of George Floyd’s killing in Minneapolis have also led to calls for change in K-pop. Last month, many praised BTS’ donation of $1 million to the Black Lives Matter movement, following up with donations of their own. But Black fans also renewed long-standing critiques about K-pop, particularly what they saw as a refusal to recognize the genre’s influences in Black music, dance and culture. Still, through all the controversies — even the unholy pairing of a Hindu god with gyrating musical stars — the international army of K-pop fans has remained fiercely loyal. Varshney, the student from Delhi, said the genre had inspired him to shuck off traditional macho behavior and a hypermasculine appearance. He started learning Korean three years ago to understand the lyrics, and he mashes up K-pop choreography with Bollywood music. But Varshney wants his K-pop idols to include more nuanced portrayals of other cultures in the music he loves. “If there is a pattern and we don’t speak out about it, it will keep happening,” he said. ",
    "title": "Hindu God in a music video? A K-pop band runs afoul of fans",
    "url": "https://www.deccanherald.com/entertainment/hindu-god-in-a-music-video-a-k-pop-band-runs-afoul-of-fans-860104.html"
}