{
    "text": "Hiring for the right cultural fit can be more important than focusing on technical skills alone and can help companies improve employee retention, engagement and loyalty.  As organizations struggle to adjust to the new growth economy, finding top talent is one of their biggest challenges. According to a recent study from Deloitte’s Global Human Capital Trends 2014, “Critical new skills are scarce — and their uneven distribution around the world is forcing companies to develop innovative new ways to find people, develop capabilities and share expertise.” But equally important is retaining talent once you’ve found it — making sure that your efforts to identify, recruit, hire and develop talent aren’t in vain. Sourcing and hiring with retention in mind requires companies to focus less on skills and experience and more on cultural fit and development potential, says Chris Duchesne, vice president of Workplace Solutions, Care.com. “At many forward-thinking companies, the leadership and hiring teams understand that technology changes so rapidly that, more important than discrete skills, is an employee’s cultural fit and their ability to transfer their skills, experience and values to new technology, new endeavors, new paths to the organization. You can always teach and/or acquire new skills and gain new experiences, but it’s hard to ‘teach’ culture,” Duchesne says. The book “Tribal Leadership” by David Logan, John King and Halee Fischer-Wright emphasizes the importance of workplace culture and how it can contribute to a more successful workplace. The authors found that organizations that stress cultural fit find that, within their workforce, “fear and stress go down as the ‘interpersonal friction’ of working together decreases; people seek employment in the company and stay, taking the company a long way toward winning the war for talent; organizational learning becomes effortless, with the tribe actively teaching its members the latest thinking and practices; People’s overall health statistics improve. Injury rates and sick days go down; and most exciting … is that [employees] report feeling more alive and having more fun” in such a workplace, according to the book. — Todd Raphael, editor in chief, ERE.net Identifying talent that fits culturally within your organization can be a huge step toward employee engagement, satisfaction and long-term retention. Workplace culture is, at its heart, making sure that your employees’ values, mission and personality align with those of your company, says Todd Raphael, editor in chief of recruiting site ERE.net. “Hiring for cultural fit above skills is a great idea, because you never know how much an employee will be developing, growing and changing over time — they could be in a completely different role by next year,” Raphael says. \n\n“And it makes sense to do so based on the industry and market you’re in, too: If you’re an accounting company, for instance, you don’t necessarily want to hire someone who’s chaotic and extremely creative. If you’re a cutthroat, uber-competitive, cutting-edge company, you don’t want to hire someone who’s very laid-back and not as driven by competition, for instance,” Raphael says. How do you identify someone who’s a good cultural fit? For some organizations, it’s as easy as noticing what they wear, says Care.com’s Duchesne. One large manufacturer of snowboarding equipment, for example, advises potential candidates not to wear a suit to an interview; in fact, if someone does arrive wearing a suit, they’re instantly discounted as not being a good cultural fit, simply based on how they’re dressed, Duchesne says. For startup Grammarly.com, an automated proofreading tool for English-language writers, making sure new hires are a good cultural fit means candidates are assessed based on the acronym EAGER (Ethical, Adaptable, Gritty, Empathetic and Remarkable), says Grammarly’s CEO Brad Hoover. “We codified our culture profile with one word — EAGER. Assessing skills is relatively straightforward, but culture fit is much more difficult, especially if the culture is not defined, so that was priority number one for us,” Hoover says. “Our hiring process is much more efficient because of this filter — we spend much less time getting to a final decision and we’ve been really successful at making the right hiring decision,” he says. The acronym EAGER stands for all qualities Grammarly.com looks for in its employees. Potential hires are introduced to and approved by the company’s executive team, and then hiring teams are formed based on that potential employee’s role and who they’ll be working for and with, Hoover says. The first letter stands for Ethical, and Hoover explains that “with an ethical team, we can trust each other and put lots of responsibility in the hands of everyone on the team.” — Sean Storin, CEO, One Degree This is critical in a startup with only about 70 team members split between offices in San Francisco and Kiev, Ukraine. The second letter stands for Adaptable: the ability to embrace change and learn in order to evolve and succeed, Hoover says. “Our people must apply a positive, problem-solving attitude to whatever they’re doing,” he says. “They’ve got to be looking out for potential problems and proactively thinking — either individually or collectively — about how to solve them.” The G is for Gritty, Hoover says, which emphasizes the need for both passion and perseverance when going after long-term goals. “This is especially important for a startup to do whatever it takes to get the job done whenever it is necessary,” he says. “As tech companies grow, teams can’t grow as quickly as the user base, so it’s hard for the hiring and onboarding process to keep up as demand for the product grows. We want our people to have the grit to persevere, even when it’s difficult.” The second E, for Empathetic, simply means treating others as you want to be treated, to work more effectively as a team, Hoover says. Active listening and constantly ‘putting yourself in another’s shoes’ are key elements of empathy, he says. “We care about this because of the implications for communication. At a foundational level, that requires mutual respect, and that’s based on empathy,” he says. Finally, the R is for Remarkable. Being remarkable, Hoover says, involves being recognized for being exceptional but also humble. “We want our people to be exceptional in their own right, but also to seek out others and learn from them. It’s hard enough to find remarkable people, but the ‘humble’ part of it involves the recognition that there are so many things you don’t know, and then finding a mentor or teacher to help you learn those things,” he says. A June 2013 Gallup poll of more than 150,000 U.S. workers found that a whopping 70 percent of respondents either hated their jobs or felt disengaged, and of the main reasons cited, “poor management” and “poor cultural fit” were at the top of the list. Sean Storin, CEO and co-founder of recruiting and networking site One Degree, says these statistics are what prompted him and his team to develop One Degree to address the staggering number of bad hires and try to identify better employees based on culture, mission and values, he says. “We’d heard that something like 89 percent of people leave a job because they’re not happy. Even if that statistic is overblown, even if it’s only 50 percent, that’s an epidemic,” he says, “And it’s as bad for the employees as it is for business.” One Degree is an online career network that claims to place culture, values and mission above all else when matching candidates and potential employers, Storin says. The site does not include resumes, nor does it include job postings; instead, he says, candidates sign up and answer questions based around cultural categories to find companies and roles that would best fit for their interests, values and their lifestyle. There are three distinct ecospheres that lead to good hiring, Storin says, what a candidate knows, how the candidate lives and what the candidate wants. “Skills are obviously where companies begin — the ‘What I Know’ piece — because you need someone who can execute tasks, who’s familiar with tools and technology. But skills alone aren’t solely what makes companies pull the trigger to hire,” Storin says. “The ‘How I Live’ piece outlines the type of personal values a candidate has, and how that translates into their fit into your organization. And the ‘What I Want’ piece is an opportunity to express exactly what would make candidates happy in a work environment. The last piece is extremely important, and it’s something candidates are not often faced with — it’s empowering for them to have this be a major part of the hiring conversation,” Storin says. One Degree does use search, networking and messaging functionality like that found in traditional job search sites like LinkedIn, Storin says, but it also incorporates algorithms to identify cultural traits and alignment with specific industries, companies and roles, Storin says. The model was similar to algorithms like those used in music discovery and playback software Pandora. “We looked at companies doing things very well in other capacities; Pandora, for instance, is using all these metrics and algorithms to match users with music they might like based on things like syncopation and beats-per-minute. We felt like this was the key to the future of employment search and answered the question of how to integrate culture into the equation,” Storin says. Storin says the information gathered by One Degree’s questions is also beneficial for hiring companies, and that while candidates can fill out the site’s questionnaires in under five minutes, most users spend around four to five times that amount of time on the site — a conversion rate of 40 percent. “It’s a coup for these huge companies to know these things about their potential hires,” Storin says. “And we already see a much greater level of engagement and interest from candidates because we are based on culture,” he says. “Recruiters should be addressing cultural fit already, and some of them are, but as far as it being a general practice, they just don’t have the time or the bandwidth,” Storin says. “So many are reduced to just scanning resumes, looking for keywords and plugging holes, and then companies wind up with bad hires, unhappy employees and disengaged workers, and that equals attrition,” he says. “If employees are engaged and feel like they are part of a larger entity that mirrors their beliefs and values, they are more likely to stay when presented with a challenge,” Storin says. Sharon Florentine covers IT careers and data center topics for CIO.com. Follow Sharon on Twitter @MyShar0na. Email her at sflorentine@cio.com Follow everything from CIO.com on Twitter @CIOonline and on Facebook. Sponsored Links ",
    "title": "Hire for Cultural Fit, Train for the Right IT Skills | CIO",
    "url": "https://www.cio.com/article/291237/careers-staffing-hire-for-cultural-fit-train-for-the-right-it-skills.html"
}