{
    "text": "PUBLISHED : 23 Jun 2022 at 14:14 WRITER: \n                            South China Morning Post HONG KONG: Hong Kong will include Korean in the foreign language category of the city's university entrance exam starting from 2025, but will drop both Hindi and Urdu. The Consulate General of the Republic of Korea in Hong Kong confirmed on Wednesday that the city's Examinations and Assessment Authority and South Korea's National Institute for International Education had reached an agreement to include Korean as part of the Diploma of Secondary Education Examination (DSE). \"The documents on the agreement are ready, but a physical ceremony for the memorandum of understanding was postponed due to Hong Kong's Covid-19 restrictions,\" deputy consul general Park Kyong-sig said. Under the agreement, Hong Kong's testing authority will allow students to submit scores from the Test of Proficiency in Korean (TOPIK), taken in the last two years. TOPIK is a Korean language test for non-native speakers and includes reading, writing and listening components. \"In view that young people's interest in the Korean language has been increasing, the Korean examination was specially added to meet students' needs,\" said Wei Xiang-dong, secretary general of the Hong Kong Examinations and Assessment Authority (HKEAA). With Chinese and English listed as the official languages of Hong Kong, the city's university entrance exam currently includes French, Spanish, German, Japanese, Hindi and Urdu in its foreign language category. \"Since our students are interested in Korean culture, it will be appreciated that Korean will be included in our university entrance exam,\" said Cheung Wing Fung, the acting principal of Mu Kuang English School in Hong Kong, which offers Korean as a required subject. \"They will be able to develop their hobby academically.\" Cheung said the school had adopted Korean as part of its curriculum after conducting a survey among parents and students amid the growing interest in Korean culture. Discussions to offer Korean as part of the university entrance exam began after officials from the Consulate General of the Republic of Korea in Hong Kong held meetings with the city's Education Bureau in November. \"The introduction of the Korean language test into Hong Kong's university entrance exam appears to have become possible due to the interest about Korea in Hong Kong as well as the elevated status of South Korea as a country around the world,\" Park added. \"This is also meaningful for graduates of Hong Kong schools, because with a proficiency in Korean, they will have a wider pool of opportunities when they seek jobs.\" Currently, the opportunity to study Korean is mainly at the university level, with the University of Hong Kong offering Korean studies as a major, while a number of other institutes offer Korean as a minor subject. The HKEAA said that candidates from 2025 can choose to sit the \"other language subjects\" and will be required to take stipulated official language examinations. The authority confirmed that Hindi and Urdu examinations will be discontinued from 2025 taking the number of languages offered down from six to five. A spokeswoman for the HKEAA said that the authority had contacted both the Consulate General of India and the Consulate General of Pakistan in Hong Kong in order to make similar arrangements for Hindi and Urdu examinations. \"As far as we know, there are no institutions in Hong Kong that offer officially recognised examinations in Hindi and Urdu … we will continue to liaise with the relevant consulates in Hong Kong to explore other possible options,\" she said, adding that the authority will announce any updates to the arrangements. The authority added that candidates will have to enrol directly with the administrators of the stipulated language examinations and opt for the language subjects during registration for the DSE. Students sitting the language subjects are currently required to take Cambridge Assessment International Education advanced subsidiary level question papers. The last administration of the test will be in November next year for candidates taking the 2024 DSE, the authority added. \"We have seen that there has been interest in the Korean language among Hong Kong students due to exposure to Korean culture, but up until now, learning Korean was limited to a hobby,\" said Lee Young-ho, director of the Korean Cultural Centre in Hong Kong. \"When the Korean test is included in Hong Kong's university entrance exam, students will be able to learn Korean from an earlier stage, which will improve proficiency. Universities are also expected to expand Korean language courses.\" The Korean Cultural Centre in Hong Kong will continue to offer opportunities for the city's residents to take part in Korean-language events, Lee added. It will be the first time the TOPIK test will be used as part of a university entrance exam. Japan, Vietnam, Thailand, France and New Zealand currently offer their own Korean language test as part of their university entrance exams. Driven by a growing interest in the country due to the popularity of Korean dramas and K-pop, 330,016 participants took the TOPIK test in 75 countries last year. By subscribing, you accept the terms and conditions in our privacy policy. ",
    "title": "Hong Kong to include Korean in university entrance exam from 2025 amid K-culture boom",
    "url": "https://www.bangkokpost.com/world/2332513/hong-kong-to-include-korean-in-university-entrance-exam-from-2025-amid-k-culture-boom"
}