{
    "text": "City’s fascination with all things Korean is behind the interest in Korean fashion, which has a reputation for good styling, quality and fit, and is priced competitively A flock of young women is gathered inside Stylenanda, one of the more popular fashion stores in Hong Kong selling clothes and accessories made and designed in South Korea. These young women, the majority in their late teens and early 20s, are the biggest buyers of Korean street fashion in Hong Kong. The 2012 release of Psy’s Gangnam Style garnered international acclaim for South Korea, but the influence of the “Korean wave” (hallyu in Korean) goes beyond music and K-pop in Hong Kong. Devoted fans of Korean culture have moved from eating the food and listening to Korean songs to Korean fashion. Causeway Bay and Tsim Sha Tsui are lined with small stores selling clothes made and designed in South Korea. “The major attraction for clothes made in Korea is K-pop,” says Cyrus Lee Yim, a salesman at Stylenanda. “That is what attracts Hong Kong people.” Korean culture has never been more influential in Hong Kong than today, be it sold-out concerts by K-pop stars such as boy band Big Bang or TV dramas such as Descendants of the Sun. “The Korean culture is one of the main reasons customers in Hong Kong are choosing to buy clothes made in Korea,” says Leung Ka-hei, 26, a salesman at the Rare Element shop in G-Square, a shopping centre in Granville Road, Tsim Sha Tsui. Lee, 25, says Stylenanda customers buy K-fashion items to mimic the styles of their favourite Korean celebrities. “They believe they are closer to their idols if they wear clothes like them,” he says. These shops attract young women, such as office workers, because their clothes are cheaper than high-end brands but still deliver quality and style. Indeed, Lee says some of the K-fashion on sale in Hong Kong is very cheap. “Despite being cheap, they can make the wearer look stylish, and the quality is good, too,” he says. However, many of the clothes cost more than similar designs that are made in China. Cheng Lai-ying, 24, a saleswoman at a Korean clothes store in Granville Circuit, Tsim Sha Tsui, says they charge more for Korean clothes than those made in China because they cost more. “They are more expensive for us to buy,” she says. Before South Korea became the fashion capital for young women in Hong Kong, clothes made in Japan held a similar appeal. “In the past, Japanese culture was popular so people bought Japanese clothes,” says Joanne Li, 26, a saleswoman at the D.femmes store in G-Square. “Now Korean culture is more popular, so clothes made in Korea are also more popular.” Most Hongkongers buying Korean fashion currently go to the small stores in places like G-Square, and to the shops of big Korean brands such as A-land and Stylenanda. This could soon change, though, with online fashion retailer Zalora’s launch of fashions from 16 Korean brands. Luca Barberis, managing director of Zalora, agrees the interest in Korean culture boosts K-fashion sales. “The popularity of K-fashion is boosted by the prominence of Korean [TV drama series] and K-pop artists across the world.” Sales staff use the slogan “It’s made in Korea” to lure buyers. Wong Hiu-man, 27, who owns the shop Tide Man in the Rise Shopping Arcade in Tsim Sha Tsui, admits she sometimes uses the slogan, though some customers pay more attention to price than the origin of the clothes. Janice Look Fung-yu, 26, a saleswoman at Jace Store in Tsim Sha Tsui, believe there’s definitely a higher chance of customers making purchases if they use the “Made in Korea” tagline. Most young women, though, won’t be lured into making hasty purchases based on where clothes are made. Connie Ho On-lee, 24, a fan of Korean culture including K-fashion, pays no heed to the slogan. “I buy clothes made in Korea because they are more fashionable and their quality is sometimes better,” she says. Echoing Ho, 22-year-old sales executive Estella Chan Hoi-yi says: “Clothes made in Korea have a reputation for design and better textiles.” Another major attraction is the cut of the clothes. “I prefer to buy clothes made in Korea because their cut is good,” says Angela Li Hui-min, a 24-year-old customer service officer. Women like these are not regular customers at high-end stores such as Chanel and Gucci, and don’t spend extravagantly, says Lee at Stylenanda. Estella Chan says: “I wouldn’t pay HK$1,000 for an item of K-fashion, but if the price is higher than similar clothes made elsewhere but still affordable, then for sure, I’ll pay more.” Angela Li does not spend more than HK$500 on a K-fashion item, while Connie Ho limits herself to HK$300. “If the price is too high I won’t buy them,” she says. ",
    "title": "Hong Kong millennials, fans of K-pop and soap operas, are big on Korean street fashion | South China Morning Post",
    "datetime": "2016-09-05T12:00:45+08:00",
    "url": "https://www.scmp.com/lifestyle/fashion-luxury/article/2012231/hong-kong-millennials-fans-k-pop-and-ktv-are-big-korean"
}