{
    "text": "K-pop superstars G-Dragon and Shinwa were broadcast to the British public on the UK's BBC Radio 1 thanks to a 22-year-old fans from the countryside Sam Ranns. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin A few weeks back, British radio listeners very well may have double checked their radio dials when they heard Korean music playing on their airwaves. The audiences may have been doubly surprised to hear one of their most famous DJs then profess his love for Korean pop. It’s all thanks to Sam Ranns, a 22-year-old K-pop fan from the countryside who won a spot on BBC Radio 1’s ‘Access All Areas’ contest. It gave normal folk the chance to use the famous lounge — that’s recently hosted the likes of HAIM, Kings of Leon and more — to record their own hour-long show in the famous studios. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t04/22/2014 The Cambridgeshire native with a soft spot for Girls’ Generation won one of the 39 available spots used to play whatever he liked, just like the other winners. What he learned after his hour was up was that BBC DJ Scott Mills was listening in on his broadcast and eventually played — to borrow a phrase Ranns used on-air — “beautifully addicting” K-pop tracks live on public British radio… very much unlike the other winners. Listen to an excerpt below where Mills begins playing Rann’s broadcast — even though he’s “not supposed to do this” — and reveals his love for K-pop, PSY and one of the scene’s biggest stars G-Dragon, much to surprise of his co-host.  Speaking about the experience, Ranns tells Billboard, “shock, fear, and amazement pretty much round up how I felt” over his hijacked radio show. “‘Access All Areas’ was promoted as 60 minutes in the studio doing what you want and then they would give you a USB stick with your show,” he says. “But here I was halfway through my show with Scott Mills playing some of the songs I chose to quite possibly millions of listeners. I really couldn’t believe it and it threw me for a loop.” Ranns says he was equally thrown learning the award-winning broadcaster was a fellow fan. He says, “I knew that he interviewed PSY when ‘Gangnam Style’ was big over here, but I thought that was where it ended. My producer for the day did say before I got into the studio that I was brought in that day because Scott would be very interested in my content and I’m so glad he is.”   But this wasn’t just a chance for Ranns to play his favorite K-pop songs, he adds that a lot of preparation went in to make the program as accessible to new audiences as possible. “My original idea was to try and find a song that everybody would enjoy, but it turned into more of a ‘K-pop for Beginners’ which turned out to work really well,” he explains. “I didn’t want to seem biased towards any group or company, so I had to spend a long time debating with my online friends and the community what deserved to be on the playlist.” The result was a mix of the most-viewed K-pop tracks on YouTube like BIGBANG’s “Fantastic Baby,” and 2NE1’s “I Am the Best” (“No brainers,” says Ranns) to recent favorites of longtime fans (Brown Eyed Girls’ “Abracadabra,” Shinwa’s “Hurts,” INFINITE’s “The Chaser,” T-ara’s “Roly Poly,”) peppered with facts about South Korean and K-pop culture. He even spun one of PSY’s pre-“Gangnam Style” hits, 2010’s “Right Now.”  But when it came to introduce his favorite act for the finale track, Ranns admitted he was nearly “speechless” gearing up to play Girls’ Generation’s “Genie (Tell Me Your Wish).” “I remember very vividly how I got into K-pop, and it was all because of Girls’ Generation’s ‘Mr. Taxi’ video,” he explains. “I watched it a couple of times and got hooked, which lead me to explore…they introduced me to a completely different world of music, and if it wasn’t for them I wouldn’t be doing some of the things I’m doing now.” While Ranns admits that K-pop “might be considered too different to become the norm” in the quiet countryside where he’s from, he’s hopeful for its growth in the country’s capital. “In a busy city like London with a huge mixture of cultures, I could definitely see it becoming big. Just last month, [Asian-pop mashup artist] DJ MASA performed a set in a London night club and it seemed like everybody there was loving it.” At the very least, he now knows he’s got a very influential fellow fan supporting K-pop in the UK.  Listen to Sam Rann’s full ‘All Access Areas’ K-pop hour here. Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "title": "How K-Pop Got on the UK’s BBC Radio 1 (Something Other Than Psy, That Is) – Billboard",
    "datetime": "2014-04-23T01:10:04+00:00",
    "url": "https://www.billboard.com/music/music-news/how-k-pop-got-on-the-uks-bbc-radio-1-something-other-than-psy-that-6049217/"
}