{
    "text": "Please try again The excerpt below is from the book “Moonshots in Education: Launching Blended Learning in the Classroom,” by Esther Wojcicki, Lance Izumi and Alicia Chang. This excerpt is from the chapter entitled “Trick in the Blended Classroom,” written by Wojcicki. \nIt all started in 1987, when I got a grant from the State of California. The state sent me eight Macintosh computers, never asking if I knew how to use them, and when they arrived I had no idea how to even turn them on. I realized then that I was going to fail if I didn’t get some help quickly. I looked around for colleagues who could help, but none of them had any idea. Our school had no IT department. So I took a leap of faith and confessed to my students that I had no idea how to use the new computers and that I needed help. This turned out to be a stroke of good luck, even though I did not see it that way at the time. It was the beginning of my new teaching methodology.\nThe students were absolutely thrilled to help me (can you imagine being asked to help a teacher?!), and that was the beginning of my collaborative teaching model. Only, at that point, it did not have a name, and in fact I had to hide it from other teachers who might have frowned on what I was doing. The students and I ended up spending hours after school and on weekends figuring out the computers and how to network them. I had never even heard the word “network” in a computer context. I was one of the first teachers in California to use computers in the classroom, and possibly the first in the nation to use computers in a journalism classroom.\nI was soon sold on the idea of collaboration, respect, and trust in the classroom. And it turns out that building a culture of collaboration, respect, and trust is key to a successful blended classroom. The first action a teacher needs to take in the fall when school starts is to set up the culture. On the surface, this may sound like a waste of time, but in fact its importance cannot be overemphasized. Part of such a culture is understanding that the teacher is not the only expert in the room; in fact, students can know more than the teacher about some aspects of what they will be doing together.  The excerpt below is from the book “Moonshots in Education: Launching Blended Learning in the Classroom,” by Esther Wojcicki, Lance Izumi and Alicia Chang. This excerpt is from the chapter entitled “Trick in the Blended Classroom,” written by Wojcicki. It all started in 1987, when I got a grant from the State of California. The state sent me eight Macintosh computers, never asking if I knew how to use them, and when they arrived I had no idea how to even turn them on. I realized then that I was going to fail if I didn’t get some help quickly. I looked around for colleagues who could help, but none of them had any idea. Our school had no IT department. So I took a leap of faith and confessed to my students that I had no idea how to use the new computers and that I needed help. This turned out to be a stroke of good luck, even though I did not see it that way at the time. It was the beginning of my new teaching methodology. The students were absolutely thrilled to help me (can you imagine being asked to help a teacher?!), and that was the beginning of my collaborative teaching model. Only, at that point, it did not have a name, and in fact I had to hide it from other teachers who might have frowned on what I was doing. The students and I ended up spending hours after school and on weekends figuring out the computers and how to network them. I had never even heard the word “network” in a computer context. I was one of the first teachers in California to use computers in the classroom, and possibly the first in the nation to use computers in a journalism classroom. I was soon sold on the idea of collaboration, respect, and trust in the classroom. And it turns out that building a culture of collaboration, respect, and trust is key to a successful blended classroom. The first action a teacher needs to take in the fall when school starts is to set up the culture. On the surface, this may sound like a waste of time, but in fact its importance cannot be overemphasized. Part of such a culture is understanding that the teacher is not the only expert in the room; in fact, students can know more than the teacher about some aspects of what they will be doing together.   Computers, tablets, and other electronic devices alone are not going to change the classroom. It is the change in culture that will make the difference. To help everyone remember what it takes to set up a culture that works, I have come up with an acronym, TRICK. Each letter stands for an important part of the culture. T = trust\u2028\nR = respect\n\u2028I = independence\nC = collaboration\nK = kindness Trust\nThe first thing to establish in the classroom is a culture of trust. That does not mean the students are given complete freedom to run wild and do what they want; it means the students trust each other to help in the learning process and the teacher trusts the students. The boundaries need to be established early in the semester. There are a variety of exercises to build trust that a teacher can use, ranging from the blind man’s game to walking into walls. Since the teacher is the one in control, it is he or she who must take the initiative. Teachers need to put themselves into situations that require students to be trustworthy. Opportunities arise every day. For example, having students work in teams and be responsible to the team teaches trust. Creating a group blog or website gives students a natural way to develop trust in the team, and, if the teacher trusts the team, it builds a community of trust in the classroom.    However, the key to building trust is to actually trust the students. While that may seem counterintuitive to many teachers, it is really the only way to effectively build trust. For example, in my advanced journalism class, the students each have an individual story assignment, so no two students are doing the same thing. Some of the stories are particularly sensitive about issues in the school, the district, or the city. It takes a leap of faith on my part to trust students to get the information right and to write it up in an objective way. We publish the results online— typically garnering thousands of views—and in hard copy for three thousand local residents. Students have told me that trusting them to write the stories is significant in building their self-esteem. The students also put out a newspaper or magazine. The newspaper class has an enrollment of seventy students, who work in teams on the paper. Six editors-in-chief are in charge of the class, giving the students critical leadership experience and a sense of control over the publication. The magazine classes have an enrollment of thirty-five and an editorial board of three editors. Each student in each class has a title that correlates to his or her responsibilities. Examples are news editor, editorial-page editor, feature-page editor, or reporter. Besides having the students produce actual publications, a second suggestion is to allow the students to teach the class on a regular basis. For example, the teacher can designate one day a week when the kids take over the class for an hour or so. Having kids teach each other in small groups on a regular basis also creates a sense of trust in the class. I also encourage the students to help with the technological side of the program. I use Google Docs to create documents and Adobe software to publish. New products come out daily, and many of those might be useful for me, but I have little time to investigate them. Thus, I ask my students to watch out for new software that might be useful for the program, tell me about it, and, if it seems appropriate, learn how to use it. They then share it with the rest of the class. A third suggestion to enhance trust is to give students your home phone number, cell number, and e-mail and tell them to contact you when they have problems, but not later than a specified time in the evening. Just giving out that information provides for a culture of trust and caring. All students also have the same contact information for all other students including home phones, cell phones and addresses as well as my contact information. A fourth suggestion is for the teacher to laugh at his or her own mistakes on a regular basis. We all make mistakes, and teaching students that mistakes are part of life is an important lesson in helping them accept themselves. I do that every day in class, and the mistakes are not difficult to find: Every day there is something that does not go as planned. Teachers who are willing to show that they are not perfect, don’t know everything, and can laugh at themselves can more easily develop trust. Finally, and perhaps most important, is to put students in situations requiring them to think for themselves. They may stumble and have difficulties, but the key is to support them in their efforts while letting them solve the problem themselves. This builds trust in themselves, in the class as a whole, and between teacher and students. Respect\nTeachers need to have sincere respect for their students, especially in today’s world, where the members of a class may come from very different backgrounds and experiences. But each one has unique gifts even if he or she also has unique problems. As a teacher I know how difficult it can be to respect students who create problems in the classroom, but it is up to the teacher to show respect. It goes a long way in making the student feel better about themselves. Respect is part of trust. I trust the kids and respect them, and in turn they trust and respect me. Someone has to start the process, and it cannot be the students, since the teacher is in charge. Giving students respect does not mean letting go of expectations. In fact, it means the opposite. Teachers need to respect them as individuals and expect them to achieve at a high level. My expectations are high and I encourage my students to reach those standards by giving them the opportunity to revise their work on a regular basis. I use the mastery system model (which means students work on a skill until they master it) and grade only when students have finally mastered the standard. An innovative internet company called MasteryConnect.com has software that sup- ports this pedagogy. Grades can be very discouraging for kids but if teachers return an assignment with suggestions on how to improve or correct the errors and kids understand it is part of the process of learning, they will still be excited to learn. Famed psychologists Albert Bandura talks about the power of self-efficacy and how a student’s self image determines how they feel about themselves. He defines self-efficacy as a person’s belief in their ability to succeed in specific situations and says that self efficacy plays a major role in how people (especially students) approaches goals, tasks, and challenges. According to Bandura’s theory, people with high self-efficacy—that is, those who believe they can perform well—are more likely to view difficult tasks as something to be mastered rather than something to be avoided. http://en.wikipedia.org/wiki/Albert_Bandura David Kelley, CEO of IDEO and head of Stanford University’s d.school, has a similar philosophy which he calls Creative Confidence. He says the key to being creative and achieving is “believing in your ability to create change in the world around you. It is the conviction that you can achieve what you set out to do. We think this self-assurance, this belief in your creative capacity, lies at the heart of innovation. Creative confidence is like a muscle--it can be strengthened and nurtured through effort and experience.” http://en.wikipedia.org/wiki/David_M._Kelley Carol Dweck, social psychologist from Stanford University, talks about the power of “mindset” and how if people think their intelligence is flexible and can grow, they will achieve, but if they think it is fixed and there is nothing they can do about it, they tend to be afraid to try. People with a growth mindset understand that their talents and abilities can be developed through effort, good teaching and persistence. They think that if they persevere, (mastery learning concept) they will succeed. http://en.wikipedia.org/wiki/Carol_Dweck This is nothing new, but it is harder to do than to say. Students will rise to meet the expectations of their teachers and parents. By giving students the respect and having the expectation, teachers will be empowering kids. In my experience, students will achieve at levels far beyond what is expected if you give them the opportunity. Just believing in them helps them believe in themselves. Independence We all like independence; it is the foundation of our nation. For most children it starts when they are two years old and want to do everything themselves—to the chagrin of their parents. In elementary school, students want to be independent too, but as they progress through the system, they become more dependent on the teacher. By the time they are in high school—if they have been taught according to the old model—they are waiting to be told what to do. However, high school is a time when the students’ drive for independence should be at its peak. One way teachers can encourage this drive is to give students an opportunity to come up with their own projects within defined guidelines. For example, students could have a writing assignment, but one in which they pick the topic. It could be a restaurant review, with each student reviewing a restaurant of his or her choice. Collaboration Collaboration is an important part of the culture of the blended classroom. Students love to work with their peers, especially if they are working on a project they selected themselves. In fact, the main attraction of school for most students is being with their peers. So if teachers can make the environment a friendly, collaborative work space in which students feel comfortable, more learning will take place. This type of learning is important for several reasons: 1) most workplaces today require collaboration and students need to practice those skills at school 2) students learn more when they are responsible for another students work 3) collaboration increases student interest in learning especially if it is on a common project such as a newspaper, magazine, video, or website. Kindness Kindness is self-evident. If students feel that the teacher is kind, they want to learn. I can remember many instances of being kind to students who had made mistakes. It paid off a hundred times, because the students were so grateful, it made them feel relaxed and accepted. Being kind not only in school, but in life in general, makes the difference. As the American religious leader William J. H. Boetcker (1873–1962) put it: “Your greatness is measured by your kindness; your education and intellect by your modesty; your ignorance is betrayed by your suspicions and prejudices, and your real caliber is measured by the consideration and tolerance you have for others.”   Esther Wojcicki teaches journalism and English at Palo Alto High School in California. She served as Chair of Creative Commons and is currently a vice-chair of Creative Commons and an advisor to The University of the People, a global online non-profit free university. You can follower her on Twitter @EstherWojcicki. Subscribe to receive weekly updates of MindShift stories every Sunday. You’ll also receive a carefully curated list of content from teacher-trusted sources. ",
    "title": "How to Grow a Classroom Culture That Supports Blended Learning | KQED",
    "url": "https://www.kqed.org/mindshift/39556/how-to-grow-a-classroom-culture-that-supports-blended-learning"
}