{
    "text": "From capitalist realism to acid communism, new anthology K-Punk demonstrates the reach of the late writer’s cultural criticism Amongst the most obstinate tendencies of contemporary criticism is the justification of the past in terms of the present, Mark Fisher wrote in his 2005 blogpost ‘The Outside of Everything, Now’. It’s one of those cutting observations so characteristic of his work; a mere digression from a wider discussion of post-punk’s cultural politics, but one that challenges much of how we think of popular culture. After all, to prohibit assessments of cultural products on the basis of their influence, would be to compel critics to appraise them on their own terms. One suspects many would have little left to say. It’s a notion indicative of what made Fisher’s writing punk – K-Punk happens to be the title of his long-running blog as well as his newly collected writings, published this month by Repeater Books. Inasmuch as both rejected postwar consumer culture, punks weren’t so different to critical theorists. Only punks, as Greil Marcus has it in his monumental Lipstick Traces (1989), did so with a joy mostly absent among po-faced theoreticians. If Fisher is punk then, it’s insofar as he rarely condescends to pop culture. Indeed, his enthusiasm for his material is infectious, his ferocity when it lets him down is admirable. He frequently praises his favourite writers and critics for scrambling the hierarchy between high theory and pop, but it’s a mode of writing of which Fisher is exemplary. Mark Fisher, K-Punk, 2018, cover image. Courtesy: Repeater Books According to punk convention, commercial success entails aesthetic failure, but Fisher was oriented towards selling out from the start. That is, he premised meaningful social change upon the left’s recovery of a cultural hegemony it lost, in Britain at least, to the dominance of neoliberal capitalism in the 1980s. It’s especially fascinating, in this context, to view the gestation of Fisher’s ideas in K-Punk as they emanate from the relative obscurity of blogging to wider outlets. As he, along with many of his peers, moved into publishing and academia, owing occasionally to the notoriety of their blogs, Fisher’s ideas endured the unlikely transformation from anonymous appraisals of mass culture, to becoming a small part of it. In this regard, the presses he co-founded, first Zero then later Repeater, became important vessels for left political and cultural criticism. More widely, his influence is discernible in a whole archipelago of independent writing and publishing that’s sprung up in the UK and elsewhere in the last decade. Part of Fisher’s success can be put down to his facility with memorable neologisms and phrases that, encapsulating broad sets of ideas, helped them to circulate smoothly and widely. The best known of these is ‘capitalist realism’, a reference to a collapsed political imaginary characteristic of British social life, which Fisher dates to the defeat of the miners’s strike in 1985. Another, ‘hauntology’, denotes a pervasive mourning for lost belief in the future; it’s recited by critics often enough that it ought probably to be proscribed by editors by now. One more, ‘acid communism’, was to be the title of a future book; and while Fisher died tragically last year before its completion, the arguments it was to present have since disseminated widely. The title gestures to a desire to revive counter-cultural experiences of sensuality and collectivity and, perhaps unexpectedly, it’s a doctrine that’s been taken up as a plank around Jeremy Corbyn’s Labour Party, especially in the form of ‘Acid Corbynism’ events. These fuse party politics with ideas of ‘consciousness expansion’ that Fisher was drawing upon as a potential break from the narrow cognitive horizon imposed by neoliberalism. Mark Fisher, 2014, speaking at Off the Page, a literary festival about music organized by The Wire. Photograph: Paul Samuel White As a form, blogs tend to generate prompt, concise, reactive writing, and Fisher is at ease in this rhetorical mode. He’s inclined to declarative sentences, he deploys hyperbole with an enviable boldness. While, for instance, I’ll never see The Fall’s version of post-punk as anything but insipid nor view Fisher’s disapproval of marijuana as anything besides misguided, his biases are nonetheless refreshing. Indeed, it’s difficult to remember now, given the current ubiquity of theses on every imaginable artefact of contemporary culture, just how rare his sort of writing was in 2009, let alone when he began. At times though, his divide and conquer polemics fall flat. Condemnations of the left as either nostalgic Leninists or primitivist neo-anarchists, often reiterated, give little purchase on the recent history of British radicalism. Similarly, an opposition of punk ‘proletarian discipline’ to hippy ‘fuzzed out psychedelic fascist drug talk’, later repudiated, is reductive to say the least. But this is besides the point. Fisher’s work is best when engaged in fine-grained examination: an essay on goth aesthetics, another on J.G. Ballard, and a widely cited article on producer Burial, are all standouts. The blogs and essays on television though, might be his finest work, perhaps because there’s less baggage, less weight of a canon, where TV is concerned. An article from 2012, ‘Beyond Good and Evil’, that reads series Breaking Bad (2008–13) as the oedipal tragedy of the nuclear family in late capitalism is razor-sharp. Celebrity Big Brother becomes an opportunity to contemplate the effects of social media-induced anxiety upon popular culture in the 2015 essay ‘The House That Fame Built’. In fact, the latter serves to support a claim Fisher made repeatedly; despite its assertions to deliver the goods, what capital offers is, in reality, tawdry and predictable, if not outright depressing. All in all, it’s as far-reaching an aesthetic critique of capitalism as we’ve had in the past decade. Edited by Darren Ambrose, k-punk: The Collected and Unpublished Writings of Mark Fisher (2004–2016) is published by Repeater Books. Main image: Mark Fisher, 2014. Courtesy: Contour by Getty Images; photograph: Pal Hansen Paul Rekret teaches political theory at Richmond, the American International University, London, UK. His latest book, Down with Childhood: Pop Music and the Crisis of Innocence was published by Repeater in 2017. Novelist Isabel Waidner explores the artist’s keen interest in writing and books In his new book, journalist Ed Gillett illustrates how the genre became intertwined with British conservative politics in a time of social division Transforming limitations into artistic resources with community support The reissue of the 2001 collection considers the AIDS crisis through the lens of the Italian filmmaker 'Love Songs' at International Center of Photography, New York, suggests that queer art is inherently allergic to telling a representational story of intimacy A new memoir by Alexandra Auder delves into life with her parents, Warhol superstar Viva and artist Michel Auder The writer's debut novel, set in an English boarding school, explores desire, gender identity and charged dynamics From new fiction by Isabel Allende to the first Bulgarian novel to win the Man Booker International, the frieze team recommend new favourites and future classics Told from the perspective of a mountain lion, Henry Hoke's hallucinatory novel explores the polycrisis of Los Angeles's unhoused population, wildfires and political violence Other highlights include Martine Syms’s art-school satire and a nostalgic glance back at the indomitable Tina Turner Two gallery directors discuss the future of Britain’s second most populous city as the Council issues a Section 114, effectively declaring bankruptcy Jorie Graham and Geoffrey G. O’Brien on poetry as a tool for fostering responsibility in a changing world A retrospective at Tate Britain showcases the YBA who defied good taste and mocked sexual norms  How the artist's development is shaped by his family and local community © FRIEZE 2020 Cookie Settings | Do Not Sell My Personal Information ",
    "title": "How Mark Fisher Turned Punk Writing on Pop Culture Into an Infectious Critique of Capitalism | Frieze",
    "url": "https://www.frieze.com/article/how-mark-fisher-turned-punk-writing-pop-culture-infectious-critique-capitalism"
}