{
    "text": "Read The Diplomat, Know The Asia-Pacific The “Korean Wave” comes to Myanmar. A Cinderella story of two antagonistic stepsisters and a love story about a woman with amnesia – these soap opera tropes may be South Korea’s ticket for greater influence in the slowly opening Burmese market. According to the Yonhap News Agency, the South Korean Ministry of Culture, Sports and Tourism is teaming up with the Korea Foundation for International Culture Exchange (KOFICE) to provide Myanmar with free Korean television content. As a start, two shows will be broadcast on Myanmar’s state-run channel, MRTV. Both shows are part of the usual Korean melodrama genre – “A Thousand Days’ Promise” follows a young woman who is slowly losing her memory and the man who falls in love with her, and “Cinderella’s Sister” is a dramatic Cinderella tale of two stepsisters whose lives and loves intertwine. But these typical soap opera love stories are not just meant to entertain Burmese viewers – they are meant to foster a positive view of South Korea–and maybe even spark demand for Korean products. Get briefed on the story of the week, and developing stories to watch across the Asia-Pacific. The concept is not so far-fetched – in China, where Korean entertainment content is incredibly popular, a brief reference in a 2014 show famously led to a fried chicken and beer craze that swept the nation, leaving Korean chicken joints in Beijing with three hour waits. Enjoying this article? Click here to subscribe for full access. In another stunning example, after one of the members of the popular Korean boy band Super Junior showed off Ryeo Shampoo on a Chinese reality program, the brand’s sales increased 630 percent over the same period the previous year. The shampoo’s domestic sales also increased by 300 percent at the time – its manufacturer, AmorePacific, attributed this increase to Chinese tourists buying the product while visiting Korea. Love of Korean culture is actually boosting exports of cosmetics and beauty products – even as most of Korea’s exports are down. In fact, a recent survey of foreigners in Myeongdong and Apgujeong shopping areas found more than two thirds of them said they became interested in Korean cosmetics products after “getting to know Korean dramas or K-pop stars.” According to the study’s author, a professor at Hanyang University, “Interest and affection for Korean culture, or hallyu, has a direct correlation to growth in the cosmetics industry.” In a broader sense, Hallyu, or the Korean Wave, is the “crossover of culture and economy,” according to a 2013 essay by noted political scientist Joseph Nye. “The Korean Wave idols are often chosen as commodity representatives of Korean brands, helping Korean trademarks to become more fashionable, cool image products…in the widest possible sense, the Korean culture industry is seen to commodify the nation, exporting its popular culture as a cool national brand.” Bringing Hallyu to Myanmar In Myanmar, Korea could be trying to replicate this phenomenon – by creating fans of Korean celebrities, you create demand for the products they use. This is not a new tactic for Korea. Many Hallyu watchers and scholars attribute the start of the phenomenon to a civil servant who in 1992 managed to convince his superiors to fund Cantonese subtitling for a Korean drama called “What is Love.” The local stations in Hong Kong, the story goes, did not want to invest the money it would take to translate the shows. But one station was happy to accept the already-subtitled tapes and broadcast them – a move that sparked a k-drama revolution. Euny Hong interviewed the man behind this plan, Chung Injoon, for her book The Birth of Korean Cool. Describing the explosive popularity of “What is Love,” she wrote, “It became so popular in the region that during the time slots that it aired on Thursday and Saturday evening, ‘there were no people or cars on the street,’ according to Chung; everyone was at home watching the show.” Myanmar may be well on its way to a similar Hallyu bonanza. An official from the culture ministry told Yonhap that Myanmar currently shows more than 10 Korean programs per day, accounting for more than 90 percent of TV shows broadcast there. Demand for more content is high, however, prompting KOFICE to choose Myanmar as its “pilot” for this new program. If it is successful, the Ministry of Culture and KOFICE will continue their partnership and keep bringing free Korean content to new markets – they are already in talks to send dramas to Fiji, Jamaica, Lesotho, Swaziland, Botswana, Kyrgyzstan and Bangladesh. According to the head of KOFICE, “By supporting the ‘excellent Korean Footage Distribution’ program, countries where access to Hallyu content is difficult or where cultural exchange with Korea was scarce can have the chance to see positive images of Korea through the diffusion of Hallyu.” Further, according to Yonhap’s ministry source, “We thought it is necessary to hold a mutually beneficial program like this in order to keep Hallyu afloat amid heated competition from China, India and Japan.” In Myanmar, a country that that has only recently rejoined the international community, getting in on the ground floor can pay huge dividends in the future. Myanmar’s GDP has grown by more than 8 percent each year since 2013, and it is projected to post an 8.4 percent increase in real GDP in 2016, according to the IMF. And Korea wants to get in on some of that increased wealth. With Hallyu continuing to spread the word about Korean products around the world, this new program could get the Burmese, and their wallets, on board. Jenna Gibson is the Director of Communications at The Korea Economic Institute of America. She runs KEI’s media relations and outreach along with managing KEI’s online presence. Follow Jenna on Twitter at @jennargibson.          ",
    "title": "How Korea Is Conquering Myanmar, One Soap Opera at a Time – The Diplomat",
    "url": "https://thediplomat.com/2016/03/how-korea-is-conquering-myanmar-one-soap-opera-at-a-time/"
}