{
    "text": "Greg Priester found his dream as a singer on the other side of the globe. SEOUL, South Korea -- In the busy streets of Seoul, 6,000 miles away from home, Greg Priester joyfully takes selfies at the request of fans while his manager keeps a wary eye. Priester, a former high school teacher in Indiana, has become a celebrity in the birthplace of K-pop after his appearance in an audition program went viral. Priester, who teaches English, hosts a radio show and often appears on local television entertainment programs. He has released five singles, one of which features him singing in Korean. His YouTube channel, which includes K-pop covers, has nearly 400,000 subscribers.  Koreans see Priester as a unique singer with “American soul,” but he says it’s the similarities that have connected him to Koreans. “There’s a lot of connections there that make soul fulfilling. When I hear traditional Korean music, I automatically think of gospel music,” he told ABC News. “I think the language isn't as important as just connecting to the music.” Growing up in rural South Carolina, Priester says he was an average child, going to church on Sundays and playing football. “When I was a child, I was really shy,” he remembered. He admired his father, who sang in church, and he was pursuing a career in as a singer. But his childhood dream quickly folded because his father disapproved. \"He's like, 'How can you promise that you're going to make it? Get a regular job, have a salary, and I'll be proud of you,'\" said Priester.  After graduating from college, Priester took a job as a high school teacher in Indiana and worked part-time as a waiter to make ends meet. Four years into teaching, Priester said he found himself suffering from burnout. “There was violence in the school. You would see guns sometimes. And that was not a good thing for me,” he told ABC News. “I was in tears.” His mother advised him to take a break, so he traveled to several Asian countries before settling in South Korea in 2007 to work as an English teacher. He also started learning Korean. The turning point of his life came in 2014, after making an appearance on a popular audition program, \"Superstar K.\" The video of him singing a K-ballad went viral online and reached millions of viewers. “The next day I woke up, I couldn’t log into my phone because there’s too many notifications,\" he said. The video was so popular that celebrities started imitating him on various shows. \"Suddenly,\" he said, \"I had all these stars imitating me,” including members from Exo, BTS and Wanna One. But when his career as a singer took off, his friends and family didn't believe him. So he invited them to South Korea and gave them a tour of his life. “That was the moment they could see it,” Priester recalled. His father, who originally didn't support Priester's dream of being a singer, was now behind him. “It was just really such a blessing to get to see him watch those videos, because I think he didn’t expect it,\" Priester said. \"I think he was really proud to see that -- really proud.” Priester, who currently hosts a daily radio show, \"Men on Air,\" is planning to release another album and perform his own solo concert in Korea next year. “When I sing K-pop, I get a chance to kind of put my spin on it and make that same energetic soulful feeling come out of it,\" Priester said. \"And that's the way I think of it. So K-pop for me has a lot to it that I think people sometimes miss by just looking at the image.\" \"K-pop is energetic with a good beat, but there's some soul under there too, you know, Kimchi soul?\" he said. \"It's really cool, I like that.” ABC News’ Hakyung Kate Lee and Hansol Park contributed to this report. 24/7 coverage of breaking news and live events ",
    "title": "How an American high school teacher became a K-pop celebrity - ABC News",
    "url": "https://abcnews.go.com/International/american-high-school-teacher-pop-celebrity-overnight/story?id=65572855"
}