{
    "text": "Not a week goes by for New Delhi-based event planner Neha Sharma without her ordering Korean food in from a restaurant or rustling it up in her kitchen. The 28-year-old attributes her food obsession to the Korean dramas she’s been bingeing while working from home during the pandemic. What Sharma particularly relishes is bibimbap, a dish that features in two of her favourite Korean shows: Strong Woman Do Bong Soon and My Lovely Sam Soon. “It is a yummy dish made from sticky rice and topped with meat, spinach, carrots, bean sprouts and kimchi. Everything is combined with sesame oil and spicy red pepper paste called gochujang,” she says. “I loved its look so much that I learnt to make it from a YouTube video and now often invite my friends over to enjoy it with them.” According to the Ministry of Commerce and Industry of India, there has been a dramatic rise in the consumption of Korean food in India after the 2020 lockdown, with Korean noodles alone witnessing a growth of 162 per cent in terms of volume in 2020 and 178 per cent in 2021. Mumbai-based engineer Pankaj Aggarwal, 38, says what appeals to him most about Korean food is that it encourages communitarian dining in a world where people are increasingly lonely and crave company. “We’ve seen our number of customers spiral upwards with the fame of K-dramas in India,” says Anurag Rouniyar of Seoul Restaurant in New Delhi, who co-owns the award-winning eatery with South Korean national Rani Lee. “Most of the customers that we get at our restaurant are youngsters – college students who particularly love our noodles and ramen.” The restaurateur adds that Korean food is promoted so beautifully through its movies that it’s been a big influence on young Indian consumers, especially those who are buying all sorts of Korean products. “So great has been the demand for our restaurant’s food that during the pandemic, our buyer profile changed completely. From the pre-pandemic era, when we had mostly Korean expats coming in, the ratio has now changed to 70 per cent Indians and 30 per cent Koreans.” According to leading Indian chefs, another reason why Indians have taken so well to Korean food is that it ticks all the boxes of flavour, taste and texture for them. In addition, adds Bhardwaj, increasing exposure to global cuisine and a peripatetic lifestyle among Indians is making them far more experimental with food. “The Indian foodscape had been dominated for decades by Chinese and Japanese cuisines. But Indians are now ready for newer tastes, so Korean is offering them a fresh and novel alternative. Variety, as they say, is the spice of life,” he says. According to Chef Sabyasachi Gorai, culinary director of three multicuisine restaurants across India, Indians have now pivoted to idolising Korean pop stars and celebrities from American ones, which has also contributed to the growing popularity of the country’s food. In Korea, everything from noodles to sauces to pastes has an overtone of chillies which not only adds character to the dishes but appeals greatly to Indian taste buds, he adds. Market players say that easier access to Korean ingredients has also played a pivotal role in the popularity of Korean cuisine. A representative of Korikart, an India-based online marketplace for imported Korean products that launched in 2018, said the company has been reporting a 40 per cent growth month-on-month since March 2020. Korikart’s success has spurred other Korean brands to break into the Indian market. Popular Korean noodle brands Nong Shim and Samyang are currently targeting tier 1 Indian cities because of increasing demand and customer awareness. Korean noodles are also being sold across big e-commerce platforms like Amazon, Flipkart and Big Basket. South Korean packaged food giant Orion is also betting big on India. In 2021, the company announced an investment of US$26 million in a manufacturing facility in India’s western state of Rajasthan and is looking to scale up its India business through distribution expansion. The company’s India portfolio comprises Choco-pie, O’Rice cracker and Custas Cup Cake. Given the Indian appetite for Korean food, fast-food restaurants are also jumping on the bandwagon. ",
    "title": "How Indians’ love of K-pop and K-dramas gives them appetite for Korean food, from kimchi and barbecues to bibimbap and bulgogi | South China Morning Post",
    "datetime": "2022-03-18T11:15:17+08:00",
    "url": "https://www.scmp.com/lifestyle/food-drink/article/3170621/how-indians-love-k-pop-and-k-dramas-gives-them-appetite-korean"
}