{
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, visit My Profile, then View saved stories By Taylor Glasby “Music has the power to overcome barriers, including language and nationalities,” said RM (real name, Kim Namjoon) as South Korean superstars, BTS, accepted their trophy for Group of the Year at Variety’s Hitmakers brunch on December 7, 2019, in Los Angeles. Although it’s not the first time BTS have used this sentiment as shorthand for their ascension to global pop royalty, it never fails to ring true, particularly when in a room of Western music industry folks who were unconvinced by BTS until they were knocking their artists off the top spot. BTS in Los Angeles, December 2019 With their equivalent album sales estimated at around 40 million globally (including three US number one albums) and live shows selling out stadiums across continents in minutes, BTS-mania, frequently compared to 1960s Beatle-mania, has grabbed the steering wheel of pop culture. But neither K-Pop nor BTS are an overnight phenomenon. In 2017, the time of their US breakthrough, BTS were four years into their career and already in possession of a devoted Western audience, as were EXO, MONSTA X, Blackpink, Red Velvet, GOT7, f(x), Twice, Girls’ Generation, SHINee, BIGBANG and Super Junior, to name but a few. K-Pop had built enough ground to have made several US crossover attempts between 2009 and 2012, while various artists had undertaken small tours of Europe and America. KCON, an annual, multiple location convention that began in 2012, had amassed an attendance of 42,000 by 2014. By 2017 over 185,500 attended. By Hasina Jeelani By Prabal Sharma By Kejhal Kalra Monsta X on stage during a concert in Berlin, July 2019 K-Pop has now become, at the very least, a known entity in the mainstream hive mind. This year Blackpink headlined Coachella festival, the debut album from supergroup SUPERM went to #1 on Billboard’s Hot 200, NCT 127 appeared on everything from Beats 1 to The Late Late Show with James Corden to PeopleTV, and dozens of idol groups, new and established, sold out venues across the world. BTS, with their sleek, modern but authentic story-telling around youth and self-acceptance, are not only widely acknowledged by their fans and peers to have paved a path into the West, but helped creatively reinvigorate the industry on home turf. SUPERM fans at Capitol Records Tower in Los Angeles, October 2019 In late 2012, I interviewed BIGBANG’s songwriting powerhouse, G-Dragon, and he attributed credit “to the internet and YouTube for spreading awareness of who BIGBANG is”. Definitively, that’s the “how” behind K-Pop’s staggering level of growth, but the “why” has no singular answer. K-Pop is like staring at a fireworks extravaganza—beautiful, intricate and jaw-dropping—and being let loose in a fairground, a department store, a candy shop and a disco simultaneously, an exhilarating (and carefully constructed) blend of movement, colour, sound, and heightened emotions. It’s the frustrating pleasure of having a chorus stuck in your head for weeks and spending hours exploring slick, sumptuous music videos. By Hasina Jeelani By Prabal Sharma By Kejhal Kalra BIGBANG at the MTV Europe Music Awards in Belfast, November 2011 But whereas K-Pop once asked little more than for you to enjoy and observe, it’s evolved into a more immersive and creatively sophisticated art form. Artists like BTS, LOONA, EXO, TXT and Stray Kids have worlds in which to lose yourself as you hunt for pieces to add to a lyrical or visual narrative or painstakingly comb content for Easter eggs, which fans then share as images, gifs and video compilations. EXO tour concert arena in Taipei, September 2019 By Hasina Jeelani By Prabal Sharma By Kejhal Kalra The one element unchanged since its birth in 1992, when Seo Taiji and Boys combined American hip-hop/New Jack Swing with pop and rock on ‘난 알아요 (I Know)’, is K-Pop’s propensity for melting together influences and trends with a fearlessness that pushes idol songs beyond where Western boy and girl pop groups tread. Songwriters blend, or simply mash together, techno, house, Eurodance, electronica, vaporwave, trap, acoustic guitars, dream pop, synth-pop, hip-hop, reggae or rock. There are no rules when it comes to creating K-Pop and its classics are as emotionally taut and string-laden as Infinite’s ‘The Chaser’ or as bubblegum and coming-of-age as Girls’ Generation’s ‘Gee’. Although every artist acknowledges fans as one of the reasons for their success, K-Pop’s Western rise is, unarguably, entirely the result of fan power. G-Dragon may have pointed at YouTube for being the delivery method, but music videos alone do not a cultural behemoth make. Even now, multilingual fans continue to rip and reupload, translate and subtitle K-Pop’s unrelenting content (from dance practices to appearances on variety shows to scripted reality series), as well as lyrics, news, live chats and tweets. But the result is international fans quickly getting to grips with K-Pop then becoming as invested in, and protective of, idols as fans in South Korea. G-Dragon in Paris, October 2017. By Hasina Jeelani By Prabal Sharma By Kejhal Kalra As with any powerful fanbases, there are blind spots, dark corners and volatility, but K-Pop fandoms are driven, familial and socially savvy, on a par with sport, film franchises and gaming as a passionate and vocal culture. From the rise in learners of Korean to global philanthropic projects, memes, fan art and streaming parties, this level of engagement is one that, especially in an age of consumer apathy, often staggers both the general public and the music industry. Blackpink perform at the Coachella Valley Music And Arts Festival in California, April 2019 Take, for example, Ariana Grande, who has 67.9 million Twitter followers. According to Social Blade, her posts average around 10,800 retweets and 72,500 likes. By comparison, BTS has 23 million followers, yet they average around 422,000 retweets and 1.2 million likes per tweet. It’s this dedication embodied by K-Pop fans that made Blackpink’s Ddu-Du Ddu-Du the first song by a Korean group to hit 1 billion YouTube views; or for 227,980,938 votes to be cast in helping determine winners at the 2019 Mnet Asia Music Awards; or to spring into action to change the result when Twitter announced that the World Record Egg was the most RT’d tweet of the year, with BTS member Jungkook dancing to Billie Eilish’s Bad Guy in at number 2. By Hasina Jeelani By Prabal Sharma By Kejhal Kalra BTS during the American Music Awards in Los Angeles, November 2017 Like every entertainment industry, K-Pop has its problems and imperfections. But streaming and YouTube has opened its wild visuals and exhilarating music like never before, and with fandoms taking an open door approach to newcomers, it’s little wonder that there’s been an increase in fan diversity across colour, gender, sexuality and age, and, consequently, global popularity. As Ten, a member of SuperM and WayV, succinctly pointed out during a recent Wired interview, “You don’t need to be young to love it. Every age can love K-Pop.” What makes K-beauty a global skincare phenomenon? 7 emerging indie music acts in India you need to know about in 2019 By Daniel Rodgers By Nidhi Gupta By Manglien Gangte By Utkarsh Mani Tripathi See more stories Condé Nast India © 2023 Condé Nast. All rights reserved. Use of this website constitutes acceptance of our Terms of Service and Policy and Cookie Statement. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. ",
    "title": "How K-Pop took over the world in the 2010s | Vogue India",
    "datetime": "2019-12-18T07:46:38.408Z",
    "url": "https://www.vogue.in/culture-and-living/content/k-pop-took-over-the-world-in-the-2010s-bts-blackpink-exo-g-dragon"
}