{
    "text": "Catchy K-Pop tunes and engrossing Korean dramas are changing New Zealanders' view of South Korea for the better. National Correspondent Lucy Craymer reports. For 22-year-old Arina Aizal, it started with a discovery during last year’s Covid-19 lockdown. “I started watching K-dramas on Netflix and that’s how I came into K-Pop,” says Aizal. The ‘K’ stands for Korean. “It’s not just about K-Pop, now it’s about the beautiful culture that the Korean people have,” she says. “Korea is accessible for the pop culture – the K-Pop and the K-Drama but then as you get more into Korea you tend to learn more.” READ MORE: * New Zealanders increasingly see China as a threat * International students enrich Kiwi classmates' cultural appreciation * K-pop stamps Korea's mark on the world Appreciation of Korean culture is surging in New Zealand and abroad. In 2019, Parasite was the first foreign film to win best picture at the Oscars; South Korean TV series Crash Landing on You was one of the most popular international shows on Netflix in the United States; and bands like BlackPink and BTS have topped the charts in several countries. The popularity of Korean pop music, TV dramas and movies is such that it’s being talked about as an instrument of ‘soft power’ for South Korea. Here, a survey released by Asia New Zealand Foundation this week found 51 per cent of people identify South Korea as “friendly” towards New Zealand. This was up from 47 per cent in 2019, and places South Korea behind only Japan for perceived friendliness to New Zealand in the survey, which was carried out late last year. Stephen Epstein, a specialist in contemporary Korea at Victoria University, says K-Pop and K-Dramas are driving interest and positive sentiment towards Korea around the globe. While demand for learning other languages has dropped off, Korean has seen a resurgence, he says. Doctoral student Fine Koloamatangi first became interested in Asia through K-Pop. She’s such a devotee that she now runs the largest online community of K-Pop fans in the country and is doing her doctorate thesis on the use of K-Pop as soft power. “The Korean government uses K-Pop as a tool of cultural diplomacy abroad, and so they’ve financially backed it and promoted it to the world,” says Koloamatangi. When she first got into it, there was a bit of a stigma so it “was a bit of a secret that fans kept between themselves, but now everyone likes K-Pop.” Aizal has started learning Korean so that she can understand the K-Pop songs she listens to. She has joined the local Dunedin Korean Society and taken a class where she learnt to make a Hanbok, a traditional Korean dress. One of her favourite bands is BlackPink, partly because the band features a Korean New Zealander and a Korean who went to school in New Zealand. Ben O’Brien first heard about K-pop more than a decade ago when he was in high school, but it wasn’t until he got to Canterbury University that he really got into it. He joined a newly formed Korean Club and even led a Korean dance crew. In the past few years, the Christchurch lawyer has taken several trips to Korea to soak up the culture, eat the food and catch a K-pop concert. “K-Pop sparked a crazy interest in me and made me really want to get over there and experience it,” O’Brien says. “All based on K-Pop, I wanted to explore more.” The Korean Education Centre in New Zealand, which is run by the South Korean consulate in Auckland, now has wait lists for a number of its courses and is looking to add more as people sign up to learn the language. “The number of people signing up is growing each term,” says Annie Kim, administrator at the centre, who puts the increase down to K-Pop and K-Drama. “We are getting emails from mums of young teenagers, who are more exposed to K-Pop, so they would like to learn Korean language to learn about the lyrics.” The glow of South Korean popular culture is not improving Kiwi attitudes towards North Korea, which is seen as the biggest threat to New Zealand, according to the Asia New Zealand survey. But improved feelings towards South Korea did contribute to the survey’s finding that New Zealanders feel warmer towards many Asian nations than they did in 2019. The major exception to this is China, which is increasingly seen as a threat. “As we know, Covid-19 has presented major challenges to New Zealand’s international engagement over the past 18 months. It’s created a level of disruption most of us had not experienced previously,” says Asia New Zealand Foundation executive director Simon Draper. “But this research tells us that New Zealanders think Asia really counts, and it shows they have an appetite for learning more.” © 2023 Stuff Limited ",
    "title": "How 'K-Pop' is driving a Kiwi Korean love affair | Stuff.co.nz",
    "datetime": "2021-06-19T17:00:00.000Z",
    "url": "https://www.stuff.co.nz/national/125480411/how-kpop-is-driving-a-kiwi-korean-love-affair"
}