{
    "text": "Wonderfall Savings! Wonderfall Savings! Wonderfall Savings! Wonderfall Savings! Being around people who are different from us makes us more creative, more diligent and harder-working The first thing to acknowledge about diversity is that it can be difficult. In the U.S., where the dialogue of inclusion is relatively advanced, even the mention of the word “diversity” can lead to anxiety and conflict. Supreme Court justices disagree on the virtues of diversity and the means for achieving it. Corporations spend billions of dollars to attract and manage diversity both internally and externally, yet they still face discrimination lawsuits, and the leadership ranks of the business world remain predominantly white and male. It is reasonable to ask what good diversity does us. Diversity of expertise confers benefits that are obvious—you would not think of building a new car without engineers, designers and quality-control experts—but what about social diversity? What good comes from diversity of race, ethnicity, gender and sexual orientation? Research has shown that social diversity in a group can cause discomfort, rougher interactions, a lack of trust, greater perceived interpersonal conflict, lower communication, less cohesion, more concern about disrespect, and other problems. So what is the upside? The fact is that if you want to build teams or organizations capable of innovating, you need diversity. Diversity enhances creativity. It encourages the search for novel information and perspectives, leading to better decision-making and problem-solving. Diversity can improve the bottom line of companies and lead to unfettered discoveries and breakthrough innovations. Even simply being exposed to diversity can change the way you think. This is not just wishful thinking: it is the conclusion I draw from decades of research from organizational scientists, psychologists, sociologists, economists and demographers. The key to understanding the positive influence of diversity is the concept of informational diversity. When people are brought together to solve problems in groups, they bring different information, opinions and perspectives. This makes obvious sense when we talk about diversity of disciplinary backgrounds—think again of the interdisciplinary team building a car. The same logic applies to social diversity. People who are different from one another in race, gender and other dimensions bring unique information and experiences to bear on the task at hand. A male and a female engineer might have perspectives as different from each other as an engineer and a physicist—and that is a good thing. Research on large, innovative organizations has shown repeatedly that this is the case. For example, business professors Cristian Dezsö of the University of Maryland and David Gaddis Ross of the University of Florida studied the effect of gender diversity on the top firms in Standard & Poor’s Composite 1500 list, a group designed to reflect the overall U.S. equity market. First, they examined the size and gender composition of firms’ top management teams from 1992 through 2006. Then they looked at the financial performance of the firms. In their words, they found that, on average, “female representation in top management leads to an increase of $42 million in firm value.” They also measured the firms’ “innovation intensity” through the ratio of research and development expenses to assets. They found that companies that prioritized innovation saw greater financial gains when women were part of the top leadership ranks. Racial diversity can deliver the same kinds of benefits. In a study conducted in 2003, Orlando Richard, now at the University of Massachusetts Amherst, and his colleagues surveyed executives at 177 national banks in the U.S., then put together a database comparing financial performance, racial diversity and the emphasis the bank presidents put on innovation. For innovation-focused banks, increases in racial diversity were clearly related to enhanced financial performance. Evidence for the benefits of diversity can be found well beyond the U.S. In August 2012 a team of researchers at the Credit Suisse Research Institute issued a report in which they examined 2,360 companies globally from 2005 to 2011, looking for a relation between gender diversity on corporate management boards and financial performance. Sure enough, the researchers found that companies with one or more women on the board delivered higher average returns on equity, lower gearing (that is, net debt to equity) and better average growth. Large data-set studies have an obvious limitation: they can show only that diversity is correlated with better performance, not that it causes better performance. Research on racial diversity in small groups, however, makes it possible to draw some causal conclusions. Again, the findings are clear: for groups that value innovation and new ideas, diversity helps. In 2006 Margaret Neale of Stanford University, Gregory Northcraft of the University of Illinois at Urbana-Champaign and I set out to examine the impact of racial diversity on small decision-making groups in an experiment where sharing information was a requirement for success. Our subjects were undergraduate students taking business courses at the University of Illinois. We put together three-person groups—some consisting of all white members, others with two white members and one nonwhite member—and had them perform a murder mystery exercise. We made sure that all group members shared a common set of information, but we also gave each member important clues that only he or she knew. To find out who committed the murder, the group members would have to share all the information they collectively possessed during discussion. The groups with racial diversity significantly outperformed the groups with no racial diversity. Being with similar others leads us to think we all hold the same information and share the same perspective. This perspective, which stopped the all-white groups from effectively processing the information, is what hinders creativity and innovation. Other researchers have found similar results. In 2004 Anthony Lising Antonio, a professor at the Stanford Graduate School of Education, collaborated with five colleagues at the University of California, Los Angeles, and other institutions to examine the influence of racial and opinion composition in small group discussions. More than 350 students from three universities participated in the study. Group members were asked to discuss a prevailing social issue (either child labor practices or the death penalty) for 15 minutes. The researchers wrote dissenting opinions and had both Black and white members deliver them to their groups. When a Black person presented a dissenting perspective to a group of white people, the perspective was perceived as more novel and led to broader thinking and consideration of alternatives than when a white person introduced that same dissenting perspective. The lesson: when we hear dissent from someone who is different from us, it provokes more thought than when it comes from someone who looks like us. This effect is not limited to race. For example, in 2013 professors of management Denise Lewin Loyd of the University of Illinois, Cynthia Wang of Northwestern University, Robert B. Lount, Jr., of the Ohio State University and I asked 186 people whether they identified as a Democrat or a Republican, then had them read a murder mystery and decide who they thought committed the crime. Next, we asked the subjects to prepare for a meeting with another group member by writing an essay communicating their perspective. More important, in all cases, we told the participants that their partner disagreed with their opinion but that they would need to come to an agreement with the other person. Everyone was told to prepare to convince their meeting partner to come around to their side; half of the subjects, however, were told to prepare to make their case to a member of the opposing political party, and half were told to make their case to a member of their own party. The result: Democrats who were told that a fellow Democrat disagreed with them prepared less well for the discussion than Democrats who were told that a Republican disagreed with them. Republicans showed the same pattern. When disagreement comes from a socially different person, we are prompted to work harder. Diversity jolts us into cognitive action in ways that homogeneity simply does not. For this reason, diversity appears to lead to higher-quality scientific research. In 2014 Richard Freeman, an economics professor at Harvard University and director of the Science and Engineering Workforce Project at the National Bureau of Economic Research, along with Wei Huang, then a Harvard economics Ph.D. candidate, examined the ethnic identity of the authors of 1.5 million scientific papers written between 1985 and 2008 using Thomson Reuters’s Web of Science, a comprehensive database of published research. They found that papers written by diverse groups receive more citations and have higher impact factors than papers written by people from the same ethnic group. Moreover, they found that stronger papers are associated with greater numbers of not only references but also author addresses—geographical diversity is a reflection of more intellectual diversity. Diversity is not only about bringing different perspectives to the table. Simply adding social diversity to a group makes people believe that differences of perspective might exist among them, and that belief makes people change their behavior. Members of a homogeneous group rest somewhat assured that they will agree with one another, understand one another’s perspectives and beliefs, and be able to easily come to a consensus. But when members of a group notice that they are socially different from one another, they change their expectations. They anticipate differences of opinion and perspective. They assume they will need to work harder to come to a consensus. This logic helps to explain both the upside and the downside of social diversity: people work harder in diverse environments both cognitively and socially. They might not like it, but the hard work can lead to better outcomes. In a 2006 study of jury decision-making, social psychologist Samuel Sommers of Tufts University found that racially diverse groups exchanged a wider range of information during deliberation about a sexual assault case than all-white groups did. In collaboration with judges and jury administrators in a Michigan courtroom, Sommers conducted mock jury trials with a group of real selected jurors. Although the participants knew the mock jury was a court-sponsored experiment, they did not know that the true purpose of the research was to study the impact of racial diversity on jury decision-making. Sommers composed the six-person juries with either all white jurors or four white and two Black jurors. As you might expect, the diverse juries were better at considering case facts, made fewer errors recalling relevant information and displayed a greater openness to discussing the role of race in the case. These improvements did not necessarily happen because the Black jurors brought new information to the group—they happened because white jurors changed their behavior in the presence of the Black jurors. In the presence of diversity, they were more diligent and open-minded. Consider the following scenario: You are writing up a section of a paper for presentation at an upcoming conference. You are anticipating some disagreement and potential difficulty communicating because your collaborator is American and you are Chinese. Because of one social distinction, you may focus on other differences between yourself and that person, such as their culture, upbringing and experiences—differences that you would not expect from another Chinese collaborator. How do you prepare for the meeting? In all likelihood, you will work harder on explaining your rationale and anticipating alternatives than you would have otherwise. This is how diversity works: by promoting hard work and creativity; by encouraging the consideration of alternatives even before any interpersonal interaction takes place. The pain associated with diversity can be thought of as the pain of exercise. You have to push yourself to grow your muscles. The pain, as the old saw goes, produces the gain. In just the same way, we need diversity—in teams, organizations and society as a whole—if we are to change, grow and innovate. This article was originally published with the title \"How Diversity Works\" in Scientific American  311, 4, 42-47 (October 2014) doi:10.1038/scientificamerican1014-42 Katherine W. Phillips headed the Sanford C. Bernstein & Co. Center for Leadership and Ethics at Columbia University and was senior vice dean at Columbia Business School. She passed away in 2020. Fred Guterl Fred Guterl Douglas Medin, Carol D. Lee and Megan Bang Steven Bishop D. N. Lee Brian Welle and Megan Smith Discover world-changing science. Explore our digital archive back to 1845, including articles by more than 150 Nobel Prize winners. Follow us Scientific american arabic © 2023 Scientific American, a Division of Springer Nature America, Inc. All Rights Reserved. Support science journalism. Thanks for reading Scientific American. Knowledge awaits. Already a subscriber? Sign in. Thanks for reading Scientific American. Create your free account or Sign in to continue. See Subscription Options Continue reading with a Scientific American subscription. You may cancel at any time. ",
    "title": " How Diversity Makes Us Smarter - Scientific American ",
    "url": "https://www.scientificamerican.com/article/how-diversity-makes-us-smarter/"
}