{
    "text": "By \n\n\tAmy X. Wang On a humid  summer afternoon in New Jersey, several thousand people are screaming their hearts out in a language they don’t speak. American devotees of Korean pop music have taken over Newark’s Prudential Center for the weekend; in the parking lot, the crowd sings along to a series of Korean-pop hooks by groups like Exo, Red Velvet and BTS, whose arena-rock stomper “Fake Love” gets the loudest shouts. Close by, a teenage dance group teaches signature moves from K-pop music videos; other stages in the complex host songwriter meet-and-greets, beauty tutorials and panels like “Meeting Idols in Korea: Reality vs. Expectation.” (“Manners in Korea are taken very seriously,” advises the moderator, a K-pop blogger named Whitneybae. “Rookie groups are respectful, shaking your hand and bowing 90 degrees. But more veteran idols will give you a ‘what’s up?’ — trying to greet you in a friendlier, more ‘American’ way.”) When the event, Kcon, was first held in the U.S. in 2012, it drew a few hundred fans and curious locals. That number has since swelled to more than 125,000, divided between conventions on both coasts. “The chanting was so loud last time that mainstream music industry people told me they’d never heard the roof blown off like that before,” says organizer Angela Killoren. The event’s popularity coincides with the worldwide explosion of K-pop, which has swelled in the past five years from a niche genre to a $5 billion global industry. K-pop’s takeover of the West will be cemented on October 6th, when the seven-member Seoul crew BTS becomes the first Korean group to play a U.S. stadium, at New York’s Citi Field. The show, which sold out in minutes, follows the success of the group’s hit “Fake Love,” which debuted at Number 10 on Billboard’s U.S. Hot 100 in June and racked up more than 35 million YouTube views in its first 24 hours, surpassing Taylor Swift’s “Look What You Made Me Do.” BTS’ LP Love Yourself: Tear, released in May, debuted at Number One on the Billboard 200, moving 135,000 copies in its first week. Editor’s picks\n\t\n\t\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tThe 500 Greatest Albums of All Time\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tThe 50 Worst Decisions in Movie History\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tThe Biggest, Messiest Band Breakups in Music History\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tThe 500 Greatest Songs of All Time BTS aren’t alone. In June, the quartet Blackpink scored the highest-charting U.S. single debut for a Korean girl group when their “Ddu-Du Ddu-Du” entered the charts at No. 55. Super Junior, a 12-member Korean group, currently have a Latin hit with “Lo Siento,” which is sung in both Korean and Spanish – and has more than 37 million YouTube views. “Somebody always has to be the one to walk down that path and cut through the jungle and make some noise, and I think that group [was] BTS,” says Phil Becker, vice president for content at Alpha Media, which owns 68 U.S. radio stations. “I think six months from now we’re going to be talking about some of the biggest mainstream U.S. artists in the world infusing themselves into K-pop records.” Korean pop music first cracked the U.S. in 2012, when Psy’s “Gangnam Style” — a supercharged beat paired with outrageously stylized visuals — became the first video to top a billion streams on YouTube. But most K-pop fanatics today see that song as a one-off gimmick. “‘Gangnam Style’ was an anomaly,” says Killoren. “The dynamics were Internet-meme-driven, like ‘oh, look at this.’” Other label efforts to expand the genre worldwide fizzled; the nine-member Girls Generation launched a marketing campaign for their Interscope Records debut in 2011, but it “just didn’t work out,” says one industry vet. Before that, Wonder Girls went on tour opening for the Jonas Brothers, but failed to score a hit. Claude Kelly, who has written for Bruno Mars and One Direction as well as for Girls Generation, wondered why K-pop wasn’t breaking through: “The pop over there [in Korea] has always been so Michael Jackson-esque in its size. They don’t hold back on production and money and rehearsal and stuff, so I’ve always been like, why isn’t all this big-budget show business shit really making a dent in American culture the way it should?”  The answer may be that those groups tried too hard and too soon to appeal to a global audience. Both Wonder Girls and Girls Generation recorded English-language versions of their hits, which failed to take off. BTS, meanwhile, have continued singing in Korean while embracing Western pop in other ways. “The music of ‘Fake Love’ was so good that you can listen to it and like it and not even care about the lyrics,” says Leslie Whittle, radio program director at Houston’s KRBE. BTS’ first Top 10 album, last year’s Love Yourself: Her, featured songs written with the Chainsmokers. The group has since released collaborations with Steve Aoki, Zedd and Ali Tamposi (who co-wrote Camila Cabello’s “Havana” and Kelly Clarkson’s “Stronger”). See Also\n\t\n\t\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tWhy ‘Gilmore Girls’ Is the Ultimate Fall TV Show\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tJung Kook Recruits Jack Harlow, Latto, Major Lazer and DJ Snake for New Album 'Golden'\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tInside BTS-mania: A Day in the Life of the K-Pop Superstars And by mashing together genres and cultures, K-pop songs kick the familiar rhythms of American pop music up a notch. “Everything in the Top 40 is mid-to-low-tempo. The feeling K-pop leaves you with is upbeat and positive,” says Whittle. “Korean pop music likes differentiation and changes,” says songwriter Rodnae “Chikk” Bell. “The average American song is four melodies, maybe five. The average K-pop song is eight to 10. They are also very heavy in the harmonies.” That’s good news for American R&B hitmakers, some of whom have been frustrated to see the U.S. turn away from their genre and toward loops and minimalist melodies to keep pace with hip-hop. Teddy Riley (Blackstreet, Keith Sweat) and Harvey Mason Jr. (Mario, Toni Braxton) have found new careers overseas conjuring Nineties-era R&B. “We’re having this thing now where we are literally being reintroduced to our own stuff,” says Kelly. K-pop acts, he continues, are like, “Hey, this is the shit that you did that was dope, and we still love it.”  Aoki points out that the K-pop revolution likely wouldn’t have happened without the streaming revolution: “With streaming, fans now have such a large voice, and that’s how BTS really became a phenomenon — because the fans made it a phenomenon, like with the underground culture of punk and hardcore,” the DJ says. “These guys just crush it. And I think because the fans are making such a big deal, it’s not going anywhere.” On Soompi, one of the biggest online K-pop communities, active since 1998, the vast majority of fans are not Korean (the same goes for Kcon’s attendees.) But its users — 22 million and growing fast — spend hours translating lyrics and analyzing K-pop’s notoriously intricate music videos, which are crammed full of plots including but not limited to murder, familial betrayal, dream sequences, heartbreak and time travel. “A lot of it is very visual,” says Kristine Ortiz, a community manager at the company that owns Soompi. “They’re able to create a sensory experience through clothes and music videos with elaborate story lines. That’s not seen a lot in Western music.” The fans who do understand the language decode interviews with artists. Language isn’t so much a barrier as it is a point of entry: “In Korea, it’s already a part of the culture, and they speak the same language,” says Ortiz. “In the U.S., it’s a process of self-discovery and that makes it really exciting for fans. Users find one song and they start digging on their own. There’s a level of motivation and socializing you don’t see with American artists.” Some fans, she says, even wind up learning Korean as a result.  Soompi’s users skew young and female. When BTS arrived in Los Angeles last year to make K-pop’s first performance at the American Music Awards, the group was greeted by a riotous British Invasion-like crowd. “Boy bands and girl bands are as old as the Beatles, and this is part of the history of music in general,” Killoren says, adding that K-pop is tapping into a “continual hunger.” Despite the record-shattering success of BTS, radio remains largely hesitant about putting K-pop into rotation. Alpha Media’s Becker says his radio company is hard at work researching where — and how — to change that. “People often dismiss things because they’re not primarily in English,” he says. “The challenge I present back is, if last year’s most-played song was ‘Despacito,’ why can’t we play more songs not in English?” (Earlier this year, “Despacito,” became the first Latin-pop song to be certified diamond and earn more than a billion streams on Spotify.) Still, the U.S. is not the genre’s only target, as the K-pop/Latin crossover success of Super Junior proved. “Listeners are beginning to really expect us to look globally,” says Whittle. “We, as programmers, are becoming more aware of the fact that the world is a much smaller place than it used to be.” Additional reporting by Elias Leight   We want to hear it. Send us a tip using our anonymous form. Rolling Stone is a part of Penske Media Corporation. © 2023 Rolling Stone, LLC. All rights reserved. ",
    "title": "How K-Pop Conquered the West",
    "datetime": "2018-08-21T19:30:39+00:00",
    "url": "https://www.rollingstone.com/music/music-features/bts-kpop-albums-bands-global-takeover-707139/"
}