{
    "text": "When the Dallas police called for the public to send them videos of illegal activity during protests a week ago, they didn’t get the evidence of law-breaking demonstrators they expected. Instead, fans of Korean pop music downloaded the police department’s app en masse, rallied each other to flood it with short, fan-produced videos, and gave it low ratings to make it less visible in the app store. Several hours later, the police announced that the app was temporarily offline. K-pop stans—where “stan” basically means a prolific online superfan—have gained a new and appreciative online audience for other acts of protest and organizing, such as hijacking racist hashtags on Twitter and circulating petitions and fundraisers for victims of police violence. On Wednesday, when another fan rally managed to co-opt #whitelivesmatter, a hashtag originally promoted by racists, they cemented their reputation as a powerful force on the side of those demonstrating against police violence. The hashtag stayed trending on Twitter for hours, as people heaped praise on K-pop fans for pausing their relentless promotion of groups like BTS, Blackpink, or EXO and instead pushing for justice. “I never thought I’d see the day where K-Pop stans are defeating the police,” read one tweet with more than 4,000 likes. Good Morning America even ran a segment on the fan army’s “fight for justice.” Online culture loves a vigilante in times of crisis, and many saw parallels with Anonymous, the leaderless hacktivist collective that has, in the past, allied itself with protest movements and doxxed KKK members. K-pop fans are now even making fan videos about Anonymous itself. This narrative has found traction partly because it plays against stereotypes: K-pop fandom is often dismissed as a monolithic swarm of annoying, shallow screaming tweens who manipulate Twitter’s trending algorithms in order to establish which group or performer is the most worthy. Suddenly being shown evidence that stans are more complex, thoughtful, or socially aware than the stereotype is a surprise only for those who weren’t paying attention. “There’s a narrative that seems to persist with the general public and the media about K-pop fans, that mostly white, teen girls comprise the fan community,” says Keidra Chaney, a culture writer and publisher of The Learned Fangirl, a website that analyzes and critiques pop culture. “It’s very diverse, not just around race and ethnicity but age as well. The stereotype of ‘giggling teen girls’ does a lot to obscure the diversity of these fan communities and the more complex dynamics of how they interact.” K-pop’s earliest American fan base was in the Asian diaspora, but then it “spread through communities of young people of color who are interested in other aspects of East Asian popular culture,” says Michelle Cho, an assistant professor of East Asian studies at the University of Toronto. She says fans often tell her that they found K-pop by seeking out non-Western pop culture as an alternative to an American mainstream “in which they feel they are not represented.” Their ability to dominate online conversation is not an accident: learning how to get views on behalf of your favorite group is part of K-pop fandom. Fans learn tactics to help their groups explode in YouTube views and shoot up the charts whenever they release new material. Groups of stans stream new music videos and tracks on YouTube and Spotify for hours at a time, guided by fan-made tutorials. They make memes, like fancams—short, fan-produced videos focusing on a single performer—and share them widely. They’re so good at manipulating the metrics of social media that people who are new to watching K-pop in action can, on first glance, mistake the accounts for bots. The genre’s fans have a tendency to prioritize harnessing their numbers for maximum visibility over using their social-media presence to make K-pop more accessible to outsiders, says Cho: “There’s a lot of retweeting, and making one’s influence known as part of an aggregate and not a single voice.” This skill at redirecting online attention has translated into activism before. There is a long history of K-pop fans organizing around causes in the name of their favorite groups, and not just as a feel-good detour from streaming artists on Spotify: activism is part of participating in the fandom, where good deeds can become another metric. “K-pop fans often use their voices to uplift viral charity campaigns for global nonprofits, often done under the names of their favorite idols,” Chaney says. In the past decade, this has included donating to create forests carrying the name of their favorite group or idol, creating donation drives, and elevating campaigns promoted by celebrities. “While altruism is definitely a motivation for these campaigns, it’s also an act of goodwill and positive publicity for fans’ favorite artists,” Chaney adds. This all reached critical mass in the US with the emergence of protests over the killing of George Floyd in Minneapolis. Two days before K-pop stans took down the Dallas police app, fans of Blackpink, a South Korean girl group that regularly breaks streaming records, organized a campaign to stop a Twitter hashtag related to the group’s collaboration with Lady Gaga from trending, instead opting to amplify #blacklivesmatter. But some stans, and the academics who study them, say that while it’s great to see fans use these platforms for good, the rapid veneration is overshadowing the more complex dynamics underlying K-pop fandom. And, they say, the newfound reputation for anti-racist heroism largely ignores the voices of black K-pop fans, who have struggled with racism and harassment within the community. “For a lot of black fans, including myself, to see white K-pop fans get praised and credited in the media for anti-racist activism, while black fans have faced (and will continue to face) anti-black harassment online for spearheading these conversations, feels like a punch in the gut—that we are being used for our social currency and then discarded,” Chaney says. For example, as K-pop’s activism was attracting international news coverage, there was also a harassment campaign targeting fans who were calling out Suga, a member of BTS, an enormously popular K-pop group. They were concerned about a song on a new mixtape in which he sampled the voice of cult leader Jim Jones, whose victims were overwhelmingly black. A lot of black fans were expressing themselves on Twitter and, as a consequence, getting harassed and doxxed by other fans who didn’t want them to say negative things about their favorite artist, says Tamar Herman, a pop culture contributor for Billboard. BTS itself also remained silent on Black Lives Matter, even as other groups were taking their fans’ lead and making public statements supporting the protests. Finally, on Thursday, the official BTS account tweeted about it. ìš°ë¦¬ëŠ” ì\u009d¸ì¢…ì°¨ë³„ì—\u0090 ë°˜ëŒ€í•©ë‹ˆë‹¤.ìš°ë¦¬ëŠ” í\u008f­ë ¥ì—\u0090 ë°˜ëŒ€í•©ë‹ˆë‹¤.ë‚˜, ë‹¹ì‹ , ìš°ë¦¬ ëª¨ë‘\u0090ëŠ” ì¡´ì¤‘ë°›ì\u009d„ ê¶Œë¦¬ê°€ ìžˆìŠµë‹ˆë‹¤. í•¨ê»˜ í•˜ê² ìŠµë‹ˆë‹¤.We stand against racial discrimination.We condemn violence.You, I and we all have the right to be respected. We will stand together.#BlackLivesMatter The controversy tapped into a long-running debate over K-pop’s history of appropriating black American music culture. Black K-pop fans have done the bulk of the work to keep idols accountable for their actions when, say, a popular group decides to perform in blackface. Internet culture (like other forms of pop culture before it) has a long history of relying on marginalized communities—particularly young black people—to drive trends and then filtering those contributions through influencers, mainstream media outlets, and popular television until the people who did the work to create them are excised from the conversation. This is often exacerbated by media outlets’ reliance on an overwhelmingly white roster of reporters —including me—to quickly explain cultural trends. The work of black K-pop journalists is being “overlooked in all of this,” Chaney says. “Hiring more writers from marginalized backgrounds to cover these kinds of tech and culture issues from the start would go a long way in giving these topics the nuance they deserve when they occur.” Herman watched in real time as K-pop stans jumped into the fray and started spamming the Dallas police app with fancams. To her, it seemed at first that anonymous accounts were sincerely promoting the tactic in hopes that “this will keep people from getting arrested.” One week later, Chaney is seeing signs that the stans, while still actively targeting hashtags, are moving on, with references to #blacklivesmatter slowing down. The attention shifted from the cause to the fans themselves, who were mythologized in near real time. But once the attention moves elsewhere, not all fans have the option to shift to the next trend. “Black fans are commenting that the work is far from done,” she says. “They will continue to speak out and organize for BLM long after it is a popular trending topic.”  Tackle supply chain visibility and customer engagement with standards and “phygital” technology. In the midst of industry discussions about productivity and automation, it’s all too easy to overlook the importance of properly reckoning with complexity. How global standards and unique identifiers are turning supply chain data into a game-changer Technology can transform patient care by bringing together data from a variety of sources Discover special offers, top stories,\n            upcoming events, and more. Thank you for submitting your email! It looks like something went wrong. We’re having trouble saving your preferences.\n                Try refreshing this page and updating them one\n                more time. If you continue to get this message,\n                reach out to us at\n                customer-service@technologyreview.com with a list of newsletters you’d like to receive.  © 2023 MIT Technology Review ",
    "title": "How K-pop fans became celebrated online vigilantes | MIT Technology Review",
    "url": "https://www.technologyreview.com/2020/06/05/1002781/kpop-fans-and-black-lives-matter/"
}