{
    "text": "How the VA developed its culture of coverups Share  Breaking Points  or Read story  BREAKING POINTS | 2014 UPDATE\nA new leader pledged to end an ugly VA tradition: cooking its own books, to hide bad service. As a first step to cure public mistrust, the Secretary began giving out his own cellphone number.   Read the full update. About two years ago, Brian Turner took a job as a scheduling clerk at a Veterans Affairs health clinic in Austin. A few weeks later, he said, a supervisor came by to instruct him how to cook the books. “The first time I heard it was actually at my desk. They said, ‘You gotta zero out the date. The wait time has to be zeroed out,’ ” Turner recalled in a phone interview. He said “zeroing out” was a trick to fool the VA’s own accountability system, which the bosses up in Washington used to monitor how long patients waited to see the doctor. BREAKING POINTS: WHERE GOVERNMENT FALLS APART Third in a series examining the failures at the heart of troubled federal systems. This is how it worked: A patient asked for an appointment on a specific day. Turner found the next available time slot. But, often, it was many days later than the patient had wanted. Would that later date work? If the patient said yes, Turner canceled the whole process and started over. This time, he typed in that the patient had wanted that later date all along. So now, the official wait time was . . . a perfect zero days. In his last public appearance as head of the VA, former Veterans Affairs secretary Eric K. Shinseki gives a speech to a coalition concerned about homeless veterans on Friday morning. Later Friday morning, President Obama announced that Shinseki had resigned after five years on the job. (Nikki Kahn/The Washington Post) It was a lie, of course. But it seemed to be a very important lie, one that the system depended on. “Two to three times a month, you would hear something about it,” Turner said — another reminder from supervisors to “zero out.” “It wasn’t a secret at all.” But all this was apparently a secret to Secretary Eric K. Shinseki, perched 12 levels above Turner in the VA’s towering bureaucracy. Somewhere underneath Shinseki — among the undersecretaries and deputy undersecretaries and bosses and sub-bosses — the fact that clerks were cheating the system was lost. On Friday, Shinseki resigned and was replaced by his deputy. But his departure is unlikely to solve the VA’s broader problem — a bureaucracy that had been taught, over time, to hide its problems from Washington. Indeed, as President Obama said, one of the agency’s key failings was that bad news did not reach Shinseki’s level at all. This is an ironic development: Until recently, the VA had been seen as a Washington success story. In the 1990s, reformers had cut back on its middle management and started using performance data so managers at the top could keep abreast of problems at the bottom. Then that success began to unravel. As the VA’s caseload increased during two wars, the agency grew thick around the middle again. And then, when the people at the bottom started sending in fiction, the people at the top took it as fact. “Shinseki goes up to Capitol Hill, and says, ‘I didn’t know anything.’ I find it perfectly believable,” said Paul C. Light, a professor at New York University who has studied the bureaucracy of the VA and others in Washington. “And that’s a real problem.” Charles R. Forbes, the first head of the U.S. Veterans Bureau, meets with staff. Forbes was chosen by President Warren G. Harding, a poker buddy. He turned out to be an audacious crook, taking kickbacks and selling government supplies at low cost to his cronies. Forbes later went to jail, and his crimes shaped the agency that would become the VA.                                                                            (Library of Congress) For decades, the VA was a byword for bureaucracy itself, seen as Washington’s ultimate paper-pushing, mind-bending hierarchy. That reputation was rooted in the VA’s history: It came about because the agency’s first leader was an audacious crook. Charles Forbes was chosen to head the Veterans Bureau by his poker buddy, President Warren G. Harding, in 1921. He was a poor choice. Forbes took kickbacks. He sold off federal supplies. He wildly misspent taxpayer money — once buying a 100-year supply of floor wax, enough to polish a floor the size of Indiana, for 25 times the regular price (apparently as a favor to a floor wax company). Eventually, Forbes was caught. The president was unhappy. In 1923, a White House visitor opened the wrong door and found Harding choking Forbes with his bare hands. “You yellow rat! You double-crossing bastard!” Harding was saying, according to historians. When he noticed the visitor, he let go of Forbes’s neck. Forbes was eventually convicted of bribery and conspiracy. But afterward, the VA’s next leaders built in layers of bureaucracy and paperwork — to be sure that nobody would ever have the same freedom to steal. Seventy years after Forbes was gone, the place was still wrapped in that red tape. That was clear on the day that Kenneth Kizer — a reformer appointed by President Bill Clinton — arrived at the VA’s health service. “I had to approve reimbursement of a secretary . . . purchasing a cable for her computer. I think it was something like $11 or $12,” Kizer said. There was a form. He had to sign it personally. “Here I’m running this multibillion dollar organization with — at that time — 200,000 employees. And I’m having to approve reimbursements for somebody.” Kizer set out to change that. He cut back on staffing at VA headquarters in Washington and at regional headquarters. He cut out layers in the chain of command. And he embraced the idea that statistics could allow the agency’s leaders to peer around those middlemen and see the bottom from the top. If patients at a certain hospital were waiting too long for appointments, they wouldn’t have to wait for the news to travel from a scheduling clerk to a supervisor, from the supervisor to a chief, from the chief to the hospital director, from the hospital director to the region, and from the region to Washington. Instead, Washington could just watch the numbers and see for itself. In theory. Today, 15 years after he left the VA, Kizer said he’s frustrated to see that one of his solutions — that numbers-based system — become the problem itself. Instead of alerting the bosses to problems in the field, it has been perverted to cover them up. “The measures have become the end,” Kizer said in a phone interview from California, “As opposed to a means to an end.” Last year, Shinseki was given a tour of the VA Medical Center-Hampton, in Hampton, Va. Before taking over the VA, Shinseki spent more than 30 years in the U.S. Army, serving as the Army’s chief of staff from 1999 to 2003.                                                                            (Matt Eich for The Washington Post) Today, even after a massive influx of Iraq and Afghanistan veterans that increased the number of VA patients by nearly 2 million, the VA health system still does many things well. The satisfaction rate for patients who have been treated by the VA is over 80 percent. But in many places, veterans were waiting too long to get the care they need. “When you actually get in the room with a doctor, it’s okay. But it’s what it takes to get to that point that I think is the problem,” said Stewart Hickey, national executive director of the veterans service group AMVETS. “You’re sick today. Three weeks from now, you’re either cured or you’re dead.” One great test of any bureaucracy is whether it can effectively deliver bad news to the top of its chain of command. In recent years, the VA health system started to fail that test. “That’s what, to me, makes this event so shocking,” said Scott W. Gould, who spent four years as Shinseki’s second-in command. Gould left the VA last year. Gould said that Shinseki tried hard to show he was open to bad news. Three times a year, in fact, Shinseki spent a solid week meeting with regional VA medical directors. That was 63 separate four-hour interviews, every year. But, apparently, his message of openness wasn’t enough: In those hours of meetings, nobody told Shinseki what so many people in his system apparently knew. “I find it shocking that anyone could believe that they were expected to dissemble” about performance measures, Gould said. This is how the system was failing: As the VA’s patient load grew, new layers of middle management slowly reappeared. And all the way at the bottom of the VA’s 12-level chain of command were the schedulers — the ones who actually had to match veterans with doctors. There were too many of the veterans. There were too few of the doctors. So what should they do? One choice was to tell the truth — tell the computer how long veterans were actually waiting for an appointment. That was what Shinseki said he wanted, 12 levels up and miles away in Washington. But, according to people with experience in scheduling, it was often the opposite of what lower-level bureaucrats wanted. In some cases, local officials’ bonuses depended on the numbers looking good. So, at some point years ago, they began asking clerks to change the numbers — with practices like “zeroing it out.” Cheating was made easier by the VA’s ancient computer systems, designed decades ago. For many clerks, the choice between the bureaucrats they knew and the secretary they didn’t was obvious. “They would say, ‘Change the “desired date” to the date of the appointment,’ ” said one employee knowledgeable about scheduling practices at a VA medical center. The employee, who spoke on the condition of anonymity for fear of retaliation, decided to go along with those requests. Fighting the order to lie wasn’t worth it. “You know, in the end, the veteran got the appointment that was available anyway,” the employee said. “It didn’t affect the veteran’s care.” (Photo: Larry Downing/Reuters) Way back in 2005, federal auditors found evidence that clerks were not entering the numbers correctly. By 2010, the problem seemed to be widespread, the VA health service sent out a memo listing 17 different “work-arounds,” including the one that Turner was taught in Texas. Stop it, the VA said. They didn’t. By 2012, in fact, one VA official told Congress he wasn’t sure how to force people to send in the real numbers. “Because of the fact that the gaming is so prevalent, as soon as something is put out, it is torn apart to look to see what the work-around is,” said William Schoenhard, who was then the deputy undersecretary for health for operations and management, an upper mid-level official that VA employees call the “Dushom.” “There’s no feedback loop.” That was the key. There was no feedback loop. The system that had been set up to let the top of the VA’s bureaucracy watch the bottom was no longer working. It was sending back science fiction, and the VA’s top brass seemed either ignorant of the deceptions or powerless to stop them. This week, federal auditors provided stark evidence of the problem that VA’s leaders had missed. The auditors had studied 226 veterans who got appointments at the VA medical center in Phoenix. The official data showed they waited an average of 24 days for an appointment. In reality, the average wait was 115 days. Afterward, Shinseki called that finding “reprehensible.” But, to the doctor who used to run the VA’s Phoenix emergency room, the findings were no surprise. Katherine Mitchell said that the ER was often overburdened by patients with non-urgent problems, who simply couldn’t get an appointment with their regular doctors. Mitchell said she’s been shifted to another job at the VA after complaining about inadequate staffing and other problems with care in Phoenix. She said Shinseki’s long experience in the U.S. Army had not prepared him well for the VA. “In the military, if you say, ‘Do something,’ it’s done,” said Mitchell, who has spent 16 years at the VA. “I suspect that he wasn’t aware that in VA, it’s not like that. If you say, ‘Do something,’ it’s covered up. It’s fixed by covering it up.” Now, VA’s leaders have been faced with a startling failure. The bureaucracy below them wasn’t telling them the truth about wait times. The numbers system they set up to go around the bureaucracy wasn’t, either. The only answer, now, has been to send people out to VA clinics to talk to schedulers, face to face. Before the auditors went out, they were warned they might hear evidence that clerks had been cheating the system. “If this occurs, remain calm,” the VA counseled auditors in a memo. It suggested follow-up questions. “Have you brought this to anyone’s attention? If needed, follow up with: What has been the response?” Deep underground, federal employees process paperwork by hand in a long-outdated, inefficient system. Many of the thousands of reports mandated by Congress will only gather dust. About the series A multipart series examining the failures at the heart of troubled federal systems. washingtonpost.com © 1996-2022 The Washington Post Terms of Service Privacy Policy Submission and Discussion Policy RSS Terms of Service Ad Choices ",
    "title": "How the VA developed its culture of coverups |  The Washington Post",
    "url": "http://www.washingtonpost.com/sf/national/2014/05/30/how-the-va-developed-its-culture-of-coverups/"
}