{
    "text": "It's a truism that the writer you read on the page is not the writer you meet in the flesh. It's for exactly this reason that meeting our cultural heroes is so often a profound disappointment. The transcendent singer on the stage is a bawdy lech in the bar. The poet who expresses beauty in words is a drunken misanthrope in person. So we commonly separate the artist from the human being, the icon from the reality. But when the actions of our cultural heroes go beyond bad behaviour, into to moral outrage, illegality and immorality, that separation becomes far harder. And in some cases, impossible. The accusations of child abuse levelled at science fiction author Marion Zimmer Bradley, who died in 1999 age 69, are of the most serious kind. Published last week on the blog of Deirdre Saoirse Moen, these accusations come from Bradley's own daughter, Moira Greyland. They include accounts of physical and sexual abuse, and were later joined by a brutally affecting poem written by Greyland in \"honour\" of Bradley, Mother's Hands. Bradley's reputation when alive had already been considerably damaged by the conviction of her husband on charges of child molestation in 1990. Science fiction readers have been vocal in disowning Bradley. Established writers of SF and fantasy including John Scalzi and G Willow Wilson have expressed horror and concern for Bradley's alleged victims. The wider science fiction community is still absorbing accusations that have been filtering into public consciousness over recent days. A complex reckoning with the actions of a former colleague has begun. Among many honours Marion Zimmer Bradley was awarded the prestigious World Fantasy award for lifetime achievement. No doubt many will question, quite rightly, whether this and other honours should be revoked. There are echoes here of the posthumous accusations levelled at Lewis Carroll, whose relationship with Alice Liddell has been under suspicion since Florence Becker Lennon's 1945 biography, or JM Barrie, whose relationship with the Llewelyn Davies family has cast something of a shadow over Neverland. But writers are far from being the only cultural figures to pose us such problems. The DJ Jimmy Savile has become a byword for depravity, whose behaviour has left us wondering how trusted institutions such as the BBC or the NHS can have allowed him such licence to abuse. And when the Vatican reveals it has defrocked 848 priests for alleged abuse of children in 10 years, it's quite natural for people to question the values of the church that employed them. How far can we separate any cultural figure from the values they represent? And in rejecting the figure, do we risk rejecting values that should transcend the actions of any single individual? The Mists of Avalon and the Darkover series made Marion Zimmer Bradley a leader of the emerging feminist movement in science fiction, alongside writers including Ursula Le Guin, Joanna Russ and Margaret Atwood. In critical terms Bradley was rarely considered seriously comparable to those writers, but as a writer of popular, mythic fiction she reached an audience those more acclaimed figures of feminism SF did not. Readers will ultimately choose whether the works of Marion Zimmer Bradley are remembered and continue to be read. Many readers, myself included, will agree with Redditor CJGibson that \"to read/support these authors in spite of their positions or actions sends a tacit message that what they're doing is OK\". Others will argue that the value of the work can be separated from its creator, and that we can condemn the writer without condemning her writings. As with every previous case of a fallen cultural titan, the debate will continue as long as they are remembered. ",
    "title": "How far can culture heroes' work stand apart from their lives? | Fantasy books | The Guardian",
    "datetime": "2014-06-27T12:52:29.000Z",
    "url": "https://www.theguardian.com/books/booksblog/2014/jun/27/culture-heroes-lives-abuse-marion-zimmer-bradley"
}