{
    "text": "Scientific research has shown that kindness increases endorphins in the body, reducing pain and increasing energy. Yet, there is no mention of kindness – the act of giving without expecting anything in return – in the UN’s ambitious 2030 Agenda for Sustainable Development. UNESCO Mahatma Gandhi Institute of Education for Peace and Sustainable Development (MGIEP) is hoping to change this through its initiative ‘Building kinder brains’ – Transforming Education with Social and Emotional Learning for the Sustainable Development Goals (SDGs). Read next: How schools can build kindness into their curriculum The MGIEP has long championed kindness as integral to emotional wellbeing and the importance of learning SEL competencies. With World Kindness Day approaching on 13th November, MGIEP director, Dr Anantha Duraiappah, says there are several important ways schools can cultivate this important quality. “Neuroscience research shows that all learning occurs in a context and involves cognitive-social emotional interactions throughout the whole brain,” Dr Duraiappah told The Educator. “This whole-brain activation happens when children and adolescents learn to read, count, reason, make decisions and perform acts of kindness.  The introduction of social and emotional learning provides a double dividend to learners and society by improving academic achievements and nurturing empathetic and compassionate individuals dedicated to building a kinder world.” One of the key messages of the recently launched International Science and Evidence based Education (ISEE) Assessment by UNESCO MGIEP was ‘a whole-brain approach to learning. Dr Duraiappah said a whole-brain learner-centric approach towards learning strengthens the interconnectedness of cognition and the social-emotional domains, which is essential for human flourishing. “This approach in education integrates social-emotional learning into a highly energetic, authentically engaged process to help students learn better,” she said. “Education, if implemented with an understanding of the brain, can help reinforce behaviour to create a more sustainable society by addressing problems like violence and inequality.” Also critical in the early years, said Dr Duraiappah, is Social and Emotional Learning (SEL). “SEL is a necessary condition for all learners to begin from early childhood, ensuring that over time, the brain can respond to changing needs such as social and emotional connections which occur in adulthood,” she said. “In education, SEL practises encourages ethical choices, kindness, and calmness which build on social and emotional intelligence. Given its dynamic nature, SEL can help build social and emotional intelligence – an anchor in transforming societies towards sustainable peace.” However, Dr Duraiappah said SEL on it its own is not enough. “What is also essential for informed decision-making is critical inquiry that helps an individual validate new information, continuously questioning and relying on replicable facts to make choices,” she said, “At UNESCO MGIEP, we provide a range of courses for K-12 learners, youth [18+] and teachers that have SEL, including critical inquiry, embedded in them.” Police are searching for a male staff member from the school The Educator looks at the NSW Government's new plan to improve student outcomes and strengthen the teacher profession Educators hold a special place as trusted influencers, holding the potential to mould young minds and alter their behaviour, writes Geoff Flemming Copyright © 2023 KM Business Information Australia Pty Ltd ",
    "title": "How schools can foster a culture of kindness | The Educator K/12",
    "url": "https://www.theeducatoronline.com/k12/news/how-schools-can-foster-a-culture-of-kindness/281380"
}