{
    "text": "The post went viral, prompting Kim and his agency, Salt Entertainment, to issue an apology. According to Soompi, the poster responded with a follow-up statement, mentioning that Kim apologised to her and that she had accepted the apology. Now that the two sides of the story have been revealed, here’s how Kim’s career is holding up … His ads were restored Popular brands such as Domino’s Pizza Korea, Canon Korea and Food Bucket were quick to pull Kim’s ads at the height of the controversy, according to NME. However, face mask brand Miima, Canon Korea and e-commerce platform 11Street all restored his ads following the Dispatch report. Surprisingly, despite Kim’s controversy, 11Street recorded its highest transaction in a day on November 11 after the actor returned in their ads, generating 200 billion won (US$168 million) in sales. The sales initially hit 21 billion won (US$17 million) in a span of one hour, according to Malay Mail. He did not pay any penalties Since Kim appeared in numerous ads, many wondered if he was liable to pay a fine over the initial loss of his endorsements deals. However, according to entertainment reporter-turned-YouTuber Lee Jin-ho, as quoted in Hype Malaysia, no company has charged him. Lee said that there are no stipulations in his endorsement contracts that cover his personal life, and he only needs to pay a penalty if he commits a crime. His Instagram followers actually increased His fans also showed their support in dramatic fashion offline, too: Chinese fans sponsored a digital billboard for him in Gangnam, according to AllKpop. He will continue to film Sad Tropics Kim was dropped from two major films he was supposed to star in – Dog Days and 2 O’Clock Data – but he will remain as the lead of Sad Tropics, NME reported. There was also a Change.org petition in favour of his return to 2 Days & 1 Night. However, according to Soompi, the show’s chief producer Lee Hwan-sun responded in a statement: “We would like to clarify that both sides held a negotiation process with each other before making that announcement.” He won popularity polls despite the allegations Thanks to his strong fan base, Kim won two popularity polls at this year’s 2021 Asia Artists Awards, which will be held on December 2, according to Zapzee. He also led the 2021 AAA Ret Popularity Award poll with around 1.8 million votes, and topped the U+ Idol Live Popularity poll with around 543,000 votes, beating actor Cha Eun-woo and NCT’s Doyoung. ",
    "title": "How did Kim Seon-ho survive cancel culture? The Hometown Cha-Cha-Cha actor’s star power returns amid controversy, from his increased Instagram following to lead role in Sad Tropics | South China Morning Post",
    "datetime": "2021-11-17T15:51:03+08:00",
    "url": "https://www.scmp.com/magazines/style/celebrity/article/3156368/how-did-kim-seon-ho-survive-cancel-culture-hometown-cha"
}