{
    "text": "Leaders who bring out the best in others. Read the papers: \"Corporate Culture: Evidence from the Field\" and \"Corporate Culture: The Interview Evidence.\" In a new study from Duke University's Fuqua School of Business, executives say corporate culture drives profitability, acquisition decisions and even whether employees behave in ethical ways.  \"Executives overwhelmingly indicate that an effective corporate culture is essential for a company to thrive in the modern business world,\" said professor Jillian Popadak. \"We set out to determine what the mechanisms and corporate policies are that lead to effective corporate culture and how an effective corporate culture relates to outcomes such as risk-taking and long-term value creation.\" Popadak and her fellow Fuqua professors John Graham and Campbell Harvey, plus Shiva Rajgopal of Columbia Business School, surveyed more than 1,800 CEOs and CFOs around the globe, focusing their initial analysis on more than 1,400 from the U.S. and Canada. They also interviewed executives at about 20 mostly large firms (with average sales of $50 billion) for the 13-month project, which closed Oct. 31. The team is presenting preliminary results during a conference at the Federal Reserve Bank of New York on Thursday, Nov. 12. Further results will be released as the authors continue to analyze the data. More than 90 percent of executives said culture is important at their firms, and 78 percent said culture is among the top five things that make their company valuable. But only 15 percent said their own corporate culture is exactly where it needed to be, and 92 percent said they believe improving their firm's corporate culture would improve the value of the company. \"There is a lot of talk about culture and next to no scientific research; we have filled that gap,\" Harvey said. \"Assigning a value to culture is difficult - you don't see it in the firm's quarterly reports. We go to the CEOs and CFOs and they are very clear that getting culture right enhances value. Fifty-two percent put culture in the top three things that make a firm valuable. It is a puzzle that if culture is so important to value, why do we hear very few CEOs talking about it? Most often, talk of culture arises after a disaster - such as the VW emissions scandal. We need to change the conversation.\" Executives variously defined culture as a company's tone, operating style, standard of behavior and even the \"invisible hand\" that guides a firm. They tended to characterize culture as shared values that guide employee decisions. More than 50 percent of executives said corporate culture influences productivity, creativity, profitability, the value of a firm and growth rates. \"Our research provides systematic evidence - perhaps for the first time - that effective cultures are less likely to be associated with short-termism, unethical behavior or earnings management to pad quarterly earnings,\" Rajgopal said. Almost half the executives said they would not acquire a company whose culture was not aligned with their own. The executives were asked to imagine they were at a company with a strong, effective culture and were evaluating two companies for acquisition, both of which would offer the same strategic and operational benefits. One had a culture closely aligned to the acquiring company, the other did not. \"We figured acquisitions were a good way to measure the value of culture,\" Harvey said. \"We asked if the CEO would discount a target if the culture was misaligned. Thirty percent said they would discount the offer up to 30 percent, and an extraordinary 46 percent would not even make an offer.\" While the survey found governance and financial incentives can reinforce culture, the researchers also concluded culture is more than a mission statement or code of conduct. \"The executives who participated in our study are passionate about the effects and importance of corporate culture,\" Graham said. \"Our research team is just getting started synthesizing the thousands of detailed insights that the executives provided, and we look forward to many new discoveries in the months ahead.\" This research was conducted in partnership with CFO Magazine and COLE, the Fuqua/Coach K Center on Leadership & Ethics. For more information contact our media relations team at media-relations@fuqua.duke.edu. © Duke University's Fuqua School of Business ",
    "title": "How Corporate Culture Affects the Bottom Line | Duke's Fuqua School of Business",
    "url": "https://www.fuqua.duke.edu/duke-fuqua-insights/corporate-culture"
}