{
    "text": " Profile Sections tv Featured More From NBC Follow NBC News A man arrested in the killing of a Baltimore tech entrepreneur was suspected of raping a woman days before and was already under surveillance, police say September 28, 2023, 12:24 PM Michael Gambon, the actor best known for playing Dumbledore in the 'Harry Potter' films, dies at 82 September 28, 2023, 8:02 AM Morning Rundown: Biden impeachment inquiry's first hearing, Powerball jackpot nears $1 billion, and Kansas City's love story with Taylor Swift September 28, 2023, 7:36 AM U.S. soldier Travis King arrives back on American soil after being expelled from North Korea September 28, 2023, 4:04 AM Remains found in Colorado are identified as Suzanne Morphew, a mom who disappeared in 2020 September 27, 2023, 5:54 PM The mother of a man suspected of killing a Baltimore tech CEO urged him to surrender, fearing police would try to kill him September 27, 2023, 2:37 PM Author Axie Oh credits her interest in Korean culture and history to what some might consider an unlikely source: the community that surrounds K-pop fandom. “K-pop culture is really intense. It’s not just the music, it’s the fandom and the music videos and the shows where people discuss the lives of the idols,” Oh told NBC News. “One of my favorite things to do when I was young was watch the performances and the dances. That actually showed me a lot of what Korean culture was like.” That connection, Oh noted, was a particularly important one to her because she did not grow up hearing or speaking Korean at home except through music and Korean dramas. She incorporated a lot of what she picked up from the world of K-pop (including adding a character who is a K-pop idol) into her debut young adult (YA) novel “Rebel Seoul,” which is scheduled to be released on Sept. 14. While the 28-year-old describes the book as “a YA sci-fi adventure romance with giant robots,” it also has a deep connection to her studies in Korean history and the works Oh read while doing her undergraduate degree in East Asian studies. “Even though it’s set in the future I use a lot of themes related to 1930s colonialism in Korea,\" she said. \"I studied manuscripts that were written after that period that were reflecting on the history of Korea and the pressure of colonialism brought into the 1960s and 1970s. So I was watching these Korean dramas [for fun] and actually studying the events in history. They were all they are all about nationalism and they are all about preserving culture and preserving history.” “Rebel Seoul” tells the story of Jaewon, a Korean teen who is alone in the world until he is conscripted into the military in the year 2199. In Jaewon’s world, China, Japan, and Korea no longer exist as separate countries but as part of the Neo Council, a conglomerate made up of the former nations. 10 DAYS until REBEL SEOUL's release! Excited for my mecha & kdrama-influenced YA Sci-Fi to be out in the world! ️ https://t.co/7UNRUv54WW pic.twitter.com/svVY9UixiS “I read a lot [while studying Korean history] about freedom fighters trying to figure out how to return to their culture,” Oh said, noting that people were forbidden from speaking in Korean during Japanese rule in the 1930s. “That really inspired me when I was writing my sci-fi novel.” While Oh said she always knew she wanted to write a futuristic novel featuring Asian teens, she was worried that it would never find the right audience in the world of publishing. “There wasn’t that much sci-fi YA when I was growing up, in terms of books that were set in East Asia or set in Asia at all,” she said. “I didn’t have any markers or any books to help influence me.” Instead, she devoured books by authors like Philip Pullman and JK Rowling as a teen and did her MFA in writing for young people at Lesley University in Massachusetts. She also began attending conferences for authors. It was at a conference hosted by the American Library Association that she learned of the New Visions Award for Writers of Color, a competition sponsored by Lee and Low Books that seeks middle grade and YA novel. “One of the reasons I applied for the New Visions Award was because they had put out a short story anthology called ‘Diverse Energies,’ which is all short stories by different authors,” Oh explained. It was there that Oh read “Blue Skies” by fellow sci-fi author Cindy Pon. “It is a YA set in Taiwan and I had never read a short [YA science fiction] story set in a different country,” she said. “So I was like ‘It can be done.’” Pon would go on to mentor Oh and praise \"Rebel Seoul\" in a blurb that appears on the book's cover. Experiences like that one are also why Oh has become an outspoken advocate for the need for diverse books in YA literature. “I had a lot of books but not necessary ones with characters that looked like me or with direct experiences like mine either,” she said. “A very strong factor was even why I was able to finish ‘Rebel Seoul’ was that there was this story that I read and I loved it so much. I knew [then that ‘Rebel Seoul’] would connect with someone else.” Follow NBC Asian America on Facebook, Twitter, Instagram and Tumblr. © 2023 NBC UNIVERSAL ",
    "title": "How K-Pop and Korean History Helped Axie Oh Write Her Debut Novel",
    "url": "https://www.nbcnews.com/news/asian-america/how-k-pop-korean-history-helped-axie-oh-write-her-n799661"
}