{
    "text": "Thank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\n            the best experience, we recommend you use a more up to date browser (or turn off compatibility mode in\n            Internet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles\n            and JavaScript. Advertisement Nature Protocols\nvolume 10, pages 1939–1947 (2015)Cite this article 3947 Accesses 186 Citations 30 Altmetric Metrics details Human noroviruses (HuNoVs) are a leading cause of foodborne disease and severe childhood diarrhea, and they cause a majority of the gastroenteritis outbreaks worldwide. However, the development of effective and long-lasting HuNoV vaccines and therapeutics has been greatly hindered by their uncultivability. We recently demonstrated that a HuNoV replicates in human B cells, and that commensal bacteria serve as a cofactor for this infection. In this protocol, we provide detailed methods for culturing the GII.4-Sydney HuNoV strain directly in human B cells, and in a coculture system in which the virus must cross a confluent epithelial barrier to access underlying B cells. We also describe methods for bacterial stimulation of HuNoV B cell infection and for measuring viral attachment to the surface of B cells. Finally, we highlight variables that contribute to the efficiency of viral replication in this system. Infection assays require 3 d and attachment assays require 3 h. Analysis of infection or attachment samples, including RNA extraction and RT-qPCR, requires ∼6 h. This is a preview of subscription content, access via your institution Open Access articles citing this article. BMC Genomic Data\nOpen Access\n06 July 2022 Archives of Virology\nOpen Access\n12 April 2022  Subscribe to this journal Receive 12 print issues and online access 251,40 € per year only 20,95 € per issue  Rent or buy this article Prices vary by article type from$1.95 to$39.95  Prices may be subject to local taxes which are calculated during checkout Patel, M.M. Systematic literature review of role of noroviruses in sporadic gastroenteritis. Emerg. Infect. Dis. 14, 1224–1231 (2008). Article \n    \n                    Google Scholar Ahmed, S.M. et al. Global prevalence of norovirus in cases of gastroenteritis: a systematic review and meta-analysis. Lancet Infect. Dis. 14, 725–730 (2014). Article \n    \n                    Google Scholar Hall, A.J. et al. Norovirus disease in the United States. Emerg. Infect. Dis. 19, 1198–1205 (2013). Article \n    \n                    Google Scholar Koo, H.L. et al. Noroviruses: the most common pediatric viral enteric pathogen at a large university hospital after introduction of rotavirus vaccination. J. Pediatr. Infect. Dis. Soc. 2, 57–60 (2013). Article \n    \n                    Google Scholar Payne, D.C. et al. Norovirus and medically attended gastroenteritis in US children. N. Engl. J. Med. 368, 1121–1130 (2013). Article \n    CAS \n    \n                    Google Scholar Koo, H.L., Ajami, N., Atmar, R.L. & DuPont, H.L. Noroviruses: the principal cause of foodborne disease worldwide. Discov. Med. 10, 61–70 (2010). PubMed \n    PubMed Central \n    \n                    Google Scholar Duizer, E. et al. Laboratory efforts to cultivate noroviruses. J. Gen. Virol. 85, 79–87 (2004). Article \n    CAS \n    \n                    Google Scholar Herbst-Kralovetz, M.M. et al. Lack of norovirus replication and histo-blood group antigen expression in 3-dimensional intestinal epithelial cells. Emerg. Infect. Dis. 19, 431–438 (2013). Article \n    CAS \n    \n                    Google Scholar Papafragkou, E., Hewitt, J., Park, G.W., Greening, G. & Vinje, J. Challenges of culturing human norovirus in a 3-D organoid cell culture model. PLoS ONE 8, e63485 (2013). Article \n    CAS \n    \n                    Google Scholar Takanashi, S. et al. Failure of propagation of human norovirus in intestinal epithelial cells with microvilli grown in three-dimensional cultures. Arch. Virol. 159, 257–266 (2013). Article \n    \n                    Google Scholar Marionneau, S. et al. Norwalk virus binds to histo-blood group antigens present on gastroduodenal epithelial cells of secretor individuals. Gastroenterology 122, 1967–1977 (2002). Article \n    CAS \n    \n                    Google Scholar Gonzalez-Hernandez, M.B. et al. Murine norovirus transcytosis across an in vitro polarized murine intestinal epithelial monolayer is mediated by M-like cells. J. Virol. 87, 12685–12693. Tamura, M., Natori, K., Kobayashi, M., Miyamura, T. & Takeda, N. Interaction of recombinant Norwalk virus particles with the 105-kilodalton cellular binding protein, a candidate receptor molecule for virus attachment. J. Virol. 74, 11589–11597 (2000). Article \n    CAS \n    \n                    Google Scholar White, L.J. et al. Attachment and entry of recombinant Norwalk virus capsids to cultured human and animal cell lines. J. Virol. 70, 6589–6597 (1996). CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Wobus, C.E. et al. Replication of norovirus in cell culture reveals a tropism for dendritic cells and macrophages. PLoS Biol. 2, e432 (2004). Article \n    \n                    Google Scholar Ward, J.M. et al. Pathology of immunodeficient mice with naturally occurring murine norovirus infection. Toxicol. Pathol. 34, 708–715 (2006). Article \n    \n                    Google Scholar Mumphrey, S.M. et al. Murine norovirus 1 infection is associated with histopathological changes in immunocompetent hosts, but clinical disease is prevented by STAT1-dependent interferon responses. J. Virol. 81, 3251–3263 (2007). Article \n    CAS \n    \n                    Google Scholar Lay, M.K. et al. Norwalk virus does not replicate in human macrophages or dendritic cells derived from the peripheral blood of susceptible humans. Virology 406, 1–11 (2010). Article \n    CAS \n    \n                    Google Scholar Basic, M. et al. Norovirus triggered microbiota-driven mucosal inflammation in interleukin 10–deficient mice. Inflamm. Bowel Dis. 20, 431–443 (2014). Article \n    \n                    Google Scholar Zhu, S. et al. Identification of immune and viral correlates of norovirus protective immunity through comparative study of intra-cluster norovirus strains. PLoS Pathog. 9, e1003592 (2013). Article \n    CAS \n    \n                    Google Scholar Bok, K. et al. Chimpanzees as an animal model for human norovirus infection and vaccine development. Proc. Natl. Acad. Sci. USA 108, 325–330 (2011). Article \n    CAS \n    \n                    Google Scholar Jones, M.K. et al. Enteric bacteria promote human and murine norovirus infection of B cells. Science 346, 755–759 (2014). Article \n    CAS \n    \n                    Google Scholar Karst, S.M. Identification of a novel cellular target and a co-factor for norovirus infection: B cells and commensal bacteria. Gut Microbes 6, 266–71 (2015). Article \n    CAS \n    \n                    Google Scholar Karst, S.M. & Wobus, C.E. A working model of how noroviruses infect the intestine. PLoS Pathog. 11, e1004626 (2015). Article \n    CAS \n    \n                    Google Scholar Guix, S. et al. Norwalk virus RNA is infectious in mammalian cells. J. Virol. 81, 12238–12248 (2007). Article \n    CAS \n    \n                    Google Scholar Lohmann, V. & Bartenschlager, R. On the history of hepatitis C virus cell culture systems. J. Med. Chem. 57, 1627–1642 (2013). Article \n    \n                    Google Scholar Park, Y., Cho, Y.-H. & Ko, G. A duplex real-time RT-PCR assay for the simultaneous genogroup-specific detection of noroviruses in both clinical and environmental specimens. Virus Genes 43, 192–200 (2011). Article \n    CAS \n    \n                    Google Scholar Download references This work was funded by the US National Institutes of Health (NIH) R01 1R01AI116892 and the University of Florida Opportunity Fund 00093472 for S.M.K., and by NIH R01 AI080611 and R21 AI103961 for C.E.W. We would like to thank G. McFadden (University of Florida), R. Renne (University of Florida) and B. Chandran (Rosalind Franklin University of Medical School and Sciences) for generously providing cell lines used in these studies. The findings and conclusions in this article are those of the authors and do not necessarily represent the official position of the Centers for Disease Control and Prevention (CDC). Names of specific vendors, manufacturers or products are included for public health and informational purposes; inclusion does not imply endorsement of the vendors, manufacturers or products by the CDC or the US Department of Health and Human Services. Department of Molecular Genetics and Microbiology, University of Florida, Gainesville, Florida, USA Melissa K Jones, Katrina R Grau, Scott A Tibbetts & Stephanie M Karst Centers for Disease Control and Prevention, Atlanta, Georgia, USA Veronica Costantini & Jan Vinjé Department of Microbiology and Immunology, University of Michigan, Ann Arbor, Michigan, USA Abimbola O Kolawole & Christiane E Wobus Department of Viroscience; Erasmus Medical Center, Miranda de Graaf & Marion Koopmans Erasmus Medical Center, Rotterdam, The Netherlands Miranda de Graaf & Marion Koopmans Department of Infectious Diseases, St. Jude Children's Research Hospital, Memphis, Tennessee, USA Pamela Freiden & Stacey Schultz-Cherry Department of Oral Biology, College of Dentistry, University of Florida, Gainesville, Florida, USA Christina L Graves & Shannon M Wallet You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar M.K.J., K.R.G., S.A.T. and S.M.K. developed and optimized direct and co-culture infections of BJAB cells, attachment assays, RNA extraction and qPCR parameters. C.L.G. and S.M.W. contributed to the development of the coculture infections. M.K.J. performed direct and co-culture infections. J.V. and V.C. provided GII.4-Sydney-positive stool samples and performed extensive numbers of infections in their CDC laboratory, investigating assay variables, and they also performed infections at the University of Florida. A.O.K. and C.E.W. performed infections at the University of Florida and the University of Michigan. P.F. and S.S.-C. performed direct infections at St. Jude Children's Research Hospital using stool samples provided by the CDC and collected at St. Jude's. M.d.G. and M.K. performed infections at the University of Florida and EMC. M.K.J., K.R.G. and S.M.K. jointly wrote the manuscript and prepared the figures. All authors reviewed and edited the manuscript. Correspondence to\n                Stephanie M Karst. A patent pertinent to this work has been filed (International application number PCT/US2015/030361, Methods and Compositions for Caliciviridae, M.K.J. and S.M.K. as inventors). Reprints and Permissions Jones, M., Grau, K., Costantini, V. et al. Human norovirus culture in B cells.\n                    Nat Protoc 10, 1939–1947 (2015). https://doi.org/10.1038/nprot.2015.121 Download citation Published: 29 October 2015 Issue Date: December 2015 DOI: https://doi.org/10.1038/nprot.2015.121 Anyone you share the following link with will be able to read this content: Sorry, a shareable link is not currently available for this article.  Provided by the Springer Nature SharedIt content-sharing initiative Food and Environmental Virology (2023) BMC Genomic Data (2022) Nature (2022) Archives of Virology (2022) Journal of Food Science and Technology (2022) By submitting a comment you agree to abide by our Terms and Community Guidelines. If you find something abusive or that does not comply with our terms or guidelines please flag it as inappropriate.  Advertisement Nature Protocols (Nat Protoc)\n                \n\nISSN 1750-2799 (online)\n    \n\nISSN 1754-2189 (print) © 2023 Springer Nature Limited Sign up for the Nature Briefing newsletter — what matters in science, free to your inbox daily. ",
    "title": "Human norovirus culture in B cells | Nature Protocols",
    "url": "https://www.nature.com/articles/nprot.2015.121"
}