{
    "text": "Hyundai-Kia Motors has decided to enhance strategic cooperation with Baidu, one of China's largest Internet companies, to reach China's future automobile market. Hyundai-Kia Motors signed a memorandum of understanding (MOU) on strategic collaboration for connected cars at Baidu’s headquarters in Beijing, China on July 10. Hyundai-Kia Motors said it is aiming to build a stronger alliance with Baidu in the future car sector, such as connected cars and autonomous vehicles, by strengthening collaboration between the two companies that has lasted since 2014. The four areas of collaboration include connected car service, voice recognition service, artificial intelligence (AI) robot development, and Internet of Things (IoT). The two companies will jointly develop a connected car service that allows easy access to various content using maps, big data, AI, and various Internet portal services. They also decided to upgrade the voice recognition service based on natural language recognition. The voice recognition technology of Baidu perfectly distinguishes the differences in intonation of Chinese dialects. The two companies have also agreed to accelerate the development of AI ​​robots for automobiles, which is in heated competition in the information and communications technology (ICT) industry. AI ​​robots communicate with the driver with voice and control the operation of the vehicle. The two companies have already developed an AI robot, named “Xiao Du,” and made it public for the first time at the Baidu AI Developer Conference held in the International Exhibition Center in China on July 4. The prototype of “AI Xiao Du Robot” on the dashboard of Kia Motors' new Zupao (Sportage in Korean name) displays the image of human eyes in the dashboard that express feelings such as joy and embarrassment, communicating with the users. It offers main news and the driver’s schedule as it is talking to the driver, and fulfills orders such as booking a movie ticket. It has the ability to interact with users so when users stare at AI Xiao Du for more than one second, it winks at them. Lastly, the two companies decided to make efforts to introduce IoT technology in the market soon including Home-to-Car, which controls cars at home, and Car-to-Home, which controls the living environment outside the car. \"We are confident that this partnership will lead to the development of innovative connected cars that exceed the expectations of Chinese consumers,\" said Chung Kyo-Woong, director of Hyundai-Kia Infotainment Development Division. \"Baidu has been leading the automotive ecosystem by providing vehicle intelligence technology and various solutions to our partners,\" said Su Tan, general manager of Baidu's Connected Car Division. \"Through our partnership with Hyundai-Kia, we will provide our customers with safe, convenient driving environment,\" said he.  Baidu is one of the top companies with the best technical skills in China in the areas of search engine, AI, voice recognition and connectivity. Recently, it is expanding its business by developing connected cars and autonomous navigation technology. Hyundai-Kia has maintained strategic partnership with Baidu since 2014 and has jointly developed vehicle-smartphone connection service, communication type navigation, and interactive voice recognition service. Hyundai-Kia is expanding their collaboration with other Chinese IT companies as well and responding to the Chinese market, where technological competition is fierce. Currently, it is developing a next generation infotainment system equipped with Tencent’s QQ Music and will provide QQ music service with the new cars to be released this fall. In the field of big data analysis, the company is developing advanced connected car services in collaboration with Unicom, the second largest telecom company in China. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Hyundai Motor Joins Hands with Baidu of China for Future Cars - Businesskorea",
    "datetime": "2018-07-10T17:42:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=23578"
}