{
    "text": " South Korean auto giant Hyundai Motor Co. and its smaller affiliate Kia Motors Corp. became the two best-sellers in Chile last month, the most recent numbers show. According to data from Chile’s auto association ANAC, Hyundai Motor sold 2,353 vehicles in October to top the list of best-selling brands in Chile, closely followed by Kia with 2,306 cars. Last year, Hyundai Motor and Kia Motors ranked second and third with annual sales of 32,757 and 31,477 units, respectively, following the U.S. rival Chevrolet which sold 47,054 units. This year, Hyundai Motor topped the list of best-selling cars in Chile in January, while Kia Motors took the first place in June and September. However, it was the first time for the two companies to become the two best-sellers, pushing Chevrolet to third place in monthly sales in the Chilean market. However, the U.S. carmaker still remains ahead of both Hyundai and Kia in accumulative sales this year. It sold 26,935 cars in the first 10 months of the year, while Kia Motors has sold 23,190 cars and Hyundai 20,649. With good performance in Chile, the market share of Hyundai-Kia Motors has also slightly increased from last year. So far, the combined market share of Hyundai and Kia in the market has gained 0.2 percentage points, rising to 19.2 percent from 19 percent last year. Although the Chilean auto market is not that big, with annual sales of 400,000 on the standard of sedans, 70 global automakers are intensely competing in the market. The good result of Hyundai and Kia in the auto market is largely due to aggressive promotion campaigns based on the effects of the Korea-Chile free trade agreement (FTA) that was signed in 2004. With tariff elimination from the FTA, Hyundai and Kia Motors have been able to be in the upper ranks, holding an advantageous position compared to other competitors. In particular, the two companies have maintained dominant positions in the market, though the FTA between Japan and Chile has come into effect from 2007. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Hyundai, Kia Motors Ranks First, Second in Chile’s Best-selling Car List - Businesskorea",
    "datetime": "2015-11-23T01:45:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=13082"
}