{
    "text": " The Hyundai Motor Group is accelerating the process of producing electric vehicles in the commercial vehicle sector such as electric buses and trucks as well. The business group set a goal of launching eco-friendly electric models of small trucks such as the Porter, medium-sized buses and the heavy truck Xient, regardless of sizes and types starting next year. \"The biggest strength of the commercial vehicle division of the Hyundai Motor Group is to generate synergies with the group’s passenger car division. We will expand eco-friendly lineups from the small truck Porter to the big truck Xient,\" said Mike Ziegler, director of commercial vehicle research and development (R&D) at Hyundai Motor Group. \"We are also focusing on improving convenience and safety apart from developing eco-friendly models. We will speed up the development of high-tech safety technologies that take into account driver and pedestrian safety as well as vehicle platooning and autonomous navigation based on connectivity technology. This marked the first time that Ziegler, who joined Hyundai Motor from Daimler Trucks last December, introduced a blueprint for the commercial vehicle division of the Hyundai Motor Group. Apart from introducing a hydrogen electric bus during the PyeongChang Winter Olympic Games, production of electric commercial vehicles will begin with a small model. The automaker decided to load electric motor systems used in the Kona EV into the Porter and Mighty under development with the goal of launching them next year. Their battery capacity will be expanded to 256kWh to compensate for their increased body weights. On one charge, they will be able to run 250 to 300 km. \"First of all, we are going to launch a small electric truck, and plan to launch a small electric bus within two years,\" Ziegler said. The small electric bus is the County, and Hyundai recently began to produce a pilot car for the model. \"Small buses, which can cover relatively short distances compared to large buses, are advantageous in terms of electric car production,\" Ziegler added. Therefore, a large number of small town buses, which are commonly found in urban areas, are expected to be replaced by Hyundai's County electric buses in 2020. In the mid- to long-term, Hyundai's large-size truck Xient will also be transformed into an eco-friendly model. Its eco-friendly model is set to come out in 2022. Hyundai is considering developing the Xient in the form of a hydrogen-powered electric car, unlike small trucks and medium-sized buses. In terms of mileage, hydrogen cars are stronger than pure electric cars. Hyundai introduced a hydrogen electric bus at the PyeongChang Winter Olympics. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Hyundai Motor Expedites Launches of Eco-Friendly Commercial Vehicles - Businesskorea",
    "datetime": "2018-03-21T02:00:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=21164"
}