{
    "text": "At South by Southwest, a Swedish duo and the Korean five-piece f(x) resurrect the awesome pleasure of pop delivered in-sync. Fun fact: There are few to no American pop groups making hits today. Folk troupes, pop-rock bands, rappers in one-off collaborations, and solo superstars: Sure, America still mints those. But the tradition that stretches back from the Monkees to the Jackson 5 to TLC to *NSYNC—where each personality counts nearly as much as each song does—has lately been carried on here by imports from the U.K., in the form of tween-pleasing boy bands One Direction and The Wanted.  Why? Who knows. Writing last year for The Atlantic, Jason Richards reported that financial problems of the music industry may play a role in the fall of pop groups generally: It's cheaper to tour and promote one person than five people. Other factors (Culture? Social media? A fluke of history?) likely matter too. Regardless, though, the first two days of the South by Southwest music festival in Austin have shown that there's plenty of life yet in the pop-group format, even if right now, there's not much of a place for it in America. You're heard Icona Pop's song \"I Love It,\" right? If not on the radio, then certainly in some commercial, trailer, or film/TV soundtrack—like the fabulous dance scene from Season Two of HBO's Girls. It's that anthem with with the engine-rev base, mosh-pit pacing, and, most importantly, in-tandem singing/shouting from Sweden's Caroline Hjelt and Aino Jawo: \"I DON'T CARE / I LOVE IT.\" It wouldn't work as well from a one-woman act; the entire point is the in-unison hollering—so that you feel like you're pumping fists with an entire generation even if you're listening alone in your car. Up on stage at Vice's showcase Wednesday night, Icona Pop saved the track for last, where it had exactly the effect you'd want: a warehouse full of people jumping and screaming and, yeah, pumping fists together. But the other songs, from their 2012 self-titled album and a couple EPs, had similar effects; they varied in tempo, but entertained with big, blocky basslines, squelching synths, dubstep breakdowns, and above all, verses with lines sung alternatingly by one woman and another, and choruses where the two united. The scene had been different a night earlier at Pitchfork's showcase, where, faced with sound-quality problems (the bassline wasn't audible) the two women futzed around with their synthpads and sampling gear as a fantastically danceable loop faded in and out. Seeing them up there fret and press buttons and apologize somewhat annoyedly reminded of just how unusual they are: a pop group, making the most of their group dynamics, with very real commercial aspirations—\"I Love It\" was written by professional songwriters (including aspiring solo star Charli XCX) and has charted in the U.S. and abroad, and the duo is now on a major label—with an indie-band sensibility and capital-A artistic ambitions on their sleeves. Maybe the next world-dominating pop group, when they arrive, will arrive not from an industry talent search but rather from the underground, appealing to Pitchfork and Vice crowds. Maybe that's what's happening right now. Elsewhere Tuesday night, history was being made by a new iteration of the old-school idea of pop groups. At a dingy bar named Elysium, people had waited for hours for a glimpse of f(x), an all-girl Korean pop five piece who, according to their rapping, Taiwanese-American member Amber Liu, was the first K-Pop act to ever perform in Texas. Back in east Asia, f(x) and their K-Pop group peers—all of whom are closely managed by their music labels, marketed heavily in TV and film, and produce inventive, forward-thinking, and ridiculously catchy pop—top charts and help sell out arenas. Here, though, outside of the fluke of solo artist Psy's \"Gangnam Style,\" the genre fascinates a devoted niche but hasn't broken into the mainstream. Their performance at Elysium started well after their scheduled start time of 1:30 a.m., lasted for only four songs, and was marked by a blaring backing track and the five members' dance moves performed mesmerizingly in unison. While it lasted, the at-capacity crowd loved it. The main reason they did, and that so many people were still lined up outside the bar's door when the band came on, is surely that the music is fun. But part of the reason, too, is same reason that pop groups have appealed for decades: the collection of personalities and voices all delivering one gigantic hook together. That appeal will never die—even if, for Americans craving it right now, the best place to find it is an ocean away. ",
    "title": "Icona Pop, K-Pop, and the Winter of American Group Pop - The Atlantic",
    "datetime": "2013-03-14T19:15:46Z",
    "url": "https://www.theatlantic.com/entertainment/archive/2013/03/icona-pop-k-pop-and-the-winter-of-american-group-pop/274018/"
}