{
    "text": "The chaos surrounding the Grand Avenue redevelopment may turn out to be a good thing — at least for Frank Gehry and quite possibly for the project as a whole. Los Angeles County Supervisor Gloria Molina and the Grand Avenue Authority surprised developer Related Cos. last week by severely criticizing and temporarily rejecting its plan for a retail complex crowned by hotel, apartment and condo towers. After that vote, it seemed possible, at least in a worst-case-scenario sort of way, that the project might collapse altogether. What is much more likely when the authority, which Molina chairs, meets late this afternoon is that Related will be granted an extension of its agreement through January. That delay, in turn, will present an opportunity for the design to be significantly reassessed — and an opportunity perhaps for Frank Gehry, who was heading up the design effort before Related’s California office started consulting with other firms, to return to a lead role. CHEATSHEET: Fall arts preview 2013 The plans that Molina objected to were produced by Gensler, the large architecture firm that also designed a proposed pro football stadium next to L.A. Live. The Gensler plan, for a site on the east side of Grand known as Parcel Q, directly across from Gehry’s Walt Disney Concert Hall, were meant to be conceptual — a master plan for how buildings would be arranged on the site, not a final design. But the way they have been presented doesn’t make that entirely clear. The digital renderings for Parcel Q included in the latest report to the authority are highly detailed architecturally — more than is typically the case for a master plan. Given the sleek, upscale and rather placeless look of those images, it’s not too hard to understand why they bothered Molina. She has pushed from the start of negotiations with Related for the inclusion of affordable housing and other concessions. But Bill Witte, president of Related California, said Monday that it was county officials who requested the more detailed renderings. “We contined to reiterate to them that this is not architecture yet -- it’s conceptual design,” Witte said. “It needs work. We knew that going in. We had no idea they would react as they did.” Further muddying the waters is the news that Robert A.M. Stern Architects of New York, who designed the new George W. Bush Presidential Center in Dallas, has officially joined the project. According to Barbara Casey, speaking for Related, Stern’s work on a residential tower across from Disney Hall is not complete. The renderings, she said, don’t reflect Stern’s final design but are “based on his concept.” Peter Morris Dixon, a spokesman for Stern, also confirmed the firm’s involvement. Gensler refused to comment. PHOTOS: Arts and culture in pictures by The Times From an aesthetic point of view, a Grand Avenue project based on a Gensler master plan and including buildings by both Gehry and Stern is very difficult to imagine. Gehry’s work is formally exuberant, Stern’s historically minded and conservative. Their personal relationship, though, is close; Gehry has been a regular visiting professor at the Yale School of Architecture, where Stern is dean. Reached by phone Monday morning, Gehry, who has been busy in recent weeks with events marking the 10th anniversary of Disney Hall, sounded relatively upbeat about the prospects for his continued involvement. He said he has been in close touch recently with Stephen M. Ross, Related’s chairman. “We’ve been asked to work on the next phase” by Related, Gehry said. “We’ll see what happens. If we do it, we’ll take the lead on the design. They understand that.” Gehry added that the designs Related presented to the Grand Avenue Authority last week — the result of a rather hasty collaboration between Gensler and Stern to meet the latest deadline — reflect the nature of the project and its approval timeline. “There is lots of angst and anxiety around the project,” he said. “The pressure is on Related to deliver these plans. But the market isn’t there. It’s still soft.” Witte agreed. “You can’t legislate the market,” he said of the Grand Avenue Authority’s reaction to the latest plans. “We are responding to and will continue to respond to the market. This is a commercial project, not a museum or a university one.” The recent turmoil, though it hardly reflects well on the way Related or the Grand Avenue Authority has overseen the project in recent months, is likely to shake up the design process in a helpful way. It will make an uninspired proposal less likely to win approval or move uninterrupted through the process. And it will clarify the fact that the proposal rejected last week was not meant as a complete design but a master plan. It may also be the case that while Related executives in California favored a plan by Gensler and Stern, Ross and the New York headquarters have been planning to trump the West Coast office by deciding to let Gehry take the lead on the design. Several sources also said that Molina is unhappy that work on a city-owned parcel in the Grand Ave. redevelopment area, site of the forthcoming Broad museum and a Related Cos. apartment building, has moved ahead while Parcel Q, a county site, remains empty. The relationship between the Grand Avenue Authority and Related has grown less smooth in the last couple of years with the departure of Martha Welborne, who had been helping manage the project, for a job with the Metropolitan Transportation Authority. Meanwhile City Councilmember Jose Huizar has replaced Jan Perry as the city’s representative on the Grand Avenue body. Those changes have all had the effect of bolstering Molina’s influence. Compared with the original 2007 proposal for the site across from Disney Hall, the new Related plan shows the effects of the recession. It calls for fewer residential units (430 instead of 488), a slightly smaller number of hotel rooms (275 versus 250) and less retail space (171,000 square feet compared with 250,000). The residential units will be mostly rental apartments, while the original plan called for mostly condominiums. Related had also sought permission to build out Parcel Q in two phases, starting along 2nd Street with an apartment tower and retail plaza and adding facilities near 1st Street later. ALSO: A Disney Hall Sunday simulcast in Grand Park Museum of the Holocaust in L.A. names new executive director Bryan Cranston plays LBJ onstage as ‘Breaking Bad’ ends [Updated]   It's a date Get our L.A. Goes Out newsletter, with the week's best events, to help you explore and experience our city. You may occasionally receive promotional content from the Los Angeles Times. Christopher Hawthorne was the architecture critic for the Los Angeles Times from 2004 to March 2018. Before coming to The Times, he was architecture critic for Slate and a frequent contributor to the New York Times. He is the author, with Alanna Stang, of “The Green House: New Directions in Sustainable Architecture.” Hawthorne grew up in Berkeley and has a bachelor’s degree from Yale, where he readied himself for a career in criticism by obsessing over the design flaws in his dormitory, designed by Eero Saarinen. Television Oct. 25, 2023 Image Oct. 25, 2023 Music Oct. 25, 2023 Music Oct. 25, 2023 Entertainment & Arts Oct. 25, 2023 Company Town Oct. 25, 2023 Television Oct. 25, 2023 Movies Oct. 25, 2023 Music Oct. 25, 2023 Subscribe for unlimited accessSite Map Follow Us MORE FROM THE L.A. TIMES ",
    "title": "In the end, turmoil over Grand Avenue plan could help the design [Updated] - Los Angeles Times",
    "datetime": "2013-09-30T21:35:00",
    "url": "https://www.latimes.com/entertainment/arts/culture/la-et-cm-grand-avenue-turmoil-20130930-story.html"
}