{
    "text": "PRINCETON, NJ -- Seven in 10 Americans say they favor using federal money to make sure high-quality preschool education programs are available for every child in America. Twenty-eight percent oppose the idea.  President Barack Obama has called for universal access to preschool education for 4-year-olds prior to entering kindergarten. Some states and cities already have universal preschool programs. New York City's universal preschool program began at the start of the new school year last week and will fully go into effect next year. Such schooling has great potential benefits for children, instilling academic and social skills at a young age that can aid them throughout their school years. That may be one reason for Americans' widespread support for the proposal. Many education experts view pre-K education as especially important for economically disadvantaged children, whose parents may not be able to afford quality preschool programs. Poorer and minority children often lag behind other students in academic achievement, and early education is seen as a way to close these gaps -- perhaps preventing them from emerging in the first place. The potential of closing the achievement gap is one of the motivating factors behind the Obama administration's push to expand federal funding for universal access to preschool. Reflecting that push, the question wording specifically referred to \"using federal money\" to pay for an increase in pre-K programs. Republicans Less Supportive of Expanding Pre-K Education Republicans (53%) are much less likely than Democrats (87%) to favor using federal money to expand pre-K education, perhaps related to their preferences for more limited government spending and more limited federal involvement in education and other spheres of society. The 70% of independents in favor of the proposal matches the national average. There are also significant differences by race and income. Nonwhites (85%) are more likely than whites (63%) to favor expanding preschool education, and those residing in lower-income households (81%) show greater support than those in middle- and upper-income households (65% each). Parents of children younger than 18 are slightly more likely (75%) than Americans who do not have younger children (68%) to favor using federal dollars to expand pre-K education. Americans Rate Pre-K as Less Important to Future Life Success Consistent with their high level of support for expanded preschool programs, 73% of Americans say preschool education is extremely (39%) or very important (34%) to a person's ability to succeed in life. Americans in general believe all levels of education are important, but there are differences in the relative importance they assign to each. At least nine in 10 Americans rate high school, middle school, and elementary school as extremely or very important, with roughly six in 10 saying they are extremely important. On a relative basis, Americans view preschool and college as somewhat less important to future life success.  College ranks slightly ahead of preschool in terms of Americans' views of which education level is most important to future success. Americans may feel the basic knowledge people need to function in society -- such as writing, reading, and math, which are learned in the K-12 years -- is crucial to life success, while the more specialized knowledge learned in college, although arguably important for pursuing certain careers as well as for earning potential, is less crucial. Americans may also consider college and preschool as less important than K-12 education because they likely view these as optional, whereas K-12 education is largely compulsory. Generally speaking, key subgroups agree that preschool and college are less important to future success than the K-12 education years. At the same time, there are differences in the importance some subgroups attach to the various education levels. For example, those with postgraduate education are more likely than those with less schooling to rate all levels of education as \"extremely important.\" Republicans and Democrats view the importance of K-12 education similarly, but Republicans are much less likely than Democrats to rate preschool and college as extremely important.  Although Americans living in lower-income households are more likely to favor using federal funds to expand pre-K education, they do not rate it as any more important than do those in middle- and upper-income households. Nonwhites are somewhat more likely than whites to rate both college and preschool as extremely important. To a large degree, that may reflect nonwhites' Democratic political orientation, and whites' Republican leanings. Implications Americans generally regard preschool education as important and widely favor the use of federal funding to make preschool programs available to all U.S. children. At the same time, they view preschool, as well as college, as less important to one's ability to succeed in life than the core K-12 education years. There is a growing body of academic research about the benefits of pre-K education, including a consensus among researchers that children who receive it perform better academically in kindergarten. Preschool has also been found to aid in children's social development. Many studies have shown that the social and academic benefits persist beyond the initial years of school. There is much evidence that pre-K education is successful in closing the achievement gap between minority and non-minority students, and between economically advantaged and disadvantaged students, although it is not clear how much it can reduce these gaps. The public seems to agree with Obama's push for expanding preschool education in more areas of the country. But as with any proposal, it may fall behind other government priorities. Also, the political calculus is important. Although a slim majority of Republicans favor expanded federal funds for pre-K education, their level of support is much less than that of Democrats. And with Republicans currently holding the majority in the House, it is unclear how motivated they would be to take action on the issue as opposed to other issues for which rank-and-file Republicans show far greater support. Results for this Gallup poll are based on telephone interviews conducted Aug. 25-26, 2014, on the Gallup Daily tracking survey, with a random sample of 1,013 adults, aged 18 and older, living in all 50 U.S. states and the District of Columbia. For results based on the total sample of national adults, the margin of sampling error is ±4 percentage points at the 95% confidence level. Interviews are conducted with respondents on landline telephones and cellular phones, with interviews conducted in Spanish for respondents who are primarily Spanish-speaking. Each sample of national adults includes a minimum quota of 50% cellphone respondents and 50% landline respondents, with additional minimum quotas by time zone within region. Landline and cellular telephone numbers are selected using random-digit-dial methods. Landline respondents are chosen at random within each household on the basis of which member had the most recent birthday. Samples are weighted to correct for unequal selection probability, nonresponse, and double coverage of landline and cell users in the two sampling frames. They are also weighted to match the national demographics of gender, age, race, Hispanic ethnicity, education, region, population density, and phone status (cellphone only/landline only/both, and cellphone mostly). Demographic weighting targets are based on the most recent Current Population Survey figures for the aged 18 and older U.S. population. Phone status targets are based on the most recent National Health Interview Survey. Population density targets are based on the most recent U.S. census. All reported margins of sampling error include the computed design effects for weighting. In addition to sampling error, question wording and practical difficulties in conducting surveys can introduce error or bias into the findings of public opinion polls. View survey methodology, complete question responses, and trends. For more details on Gallup's polling methodology, visit www.gallup.com. Seventy-four percent of U.S. adults say trade represents \"an opportunity for economic growth through increased U.S. exports.\" In the U.S., 49% of Americans are dissatisfied with the quality of K-12 education while 48% are satisfied, the narrowest split since 2001. From 2008-2013, more Americans were dissatisfied with education than were satisfied. North Dakota is the runaway leader among the states in how its residents score their lives and their state on 50 different dimensions. Several leading North Dakota officials offer their insights on why North Dakotans are so content. The majority of Americans think local agencies should be the chief influencers over what is taught in public schools. The recent Virginia and New Jersey state elections played out in the context of broad, national trends relating to the mood of the nation, the economy and the role of government. September 8, 2014\n\nGallup  https://news.gallup.com/poll/175646/favor-federal-funds-expand-pre-education.aspx\nGallup World Headquarters, 901 F Street, Washington, D.C., 20001, U.S.A\r\n            +1 202.715.3030 ",
    "title": "\r\n\tIn U.S., 70% Favor Federal Funds to Expand Pre-K Education \r\n",
    "datetime": "2014-09-08",
    "url": "https://news.gallup.com/poll/175646/favor-federal-funds-expand-pre-education.aspx"
}