{
    "text": "Thank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\n            the best experience, we recommend you use a more up to date browser (or turn off compatibility mode in\n            Internet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles\n            and JavaScript. Advertisement Scientific Reports\nvolume 5, Article number: 15042 (2015)\n            Cite this article 4361 Accesses 59 Citations Metrics details Human endometrial MSC (eMSC) are a novel source of MSC easily harvested from the highly regenerative uterine lining. We have developed protocols for eMSC isolation from single cell suspensions using magnetic bead-sorting using a perivascular marker antibody to SUSD2 and culture expansion in serum free medium (SFM). Similar to other MSC, eMSC spontaneously differentiate into fibroblasts during culture expansion decreasing their purity and efficacy. The aim of this study was to determine if A83-01, a TGF-β receptor inhibitor prevents eMSC differentiation in culture. SUSD2+ eMSC were cultured in SFM with bFGF/EGF in 5% O2/5% CO2. At passage 6, eMSC were incubated with or without A83-01 for 7 days, then analysed for MSC properties. A83-01 dose dependently promoted SUSD2+ eMSC proliferation and blocked apoptosis via the SMAD 2/3 pathway. Fewer A83-01 treated cells were autofluorescent or stained with β-galactosidase, indicating reduced senescence. A83-01-treated cells had higher cloning efficiency, differentiated into mesodermal lineages and expressed MSC phenotypic markers. These data suggest that A83-01 maintains SUSD2+ eMSC stemness, promoting proliferation by blocking senescence and apoptosis in late passage cultures through binding to TGF-β receptors. Small molecules such as A83-01 may enable the expansion of undifferentiated MSC for use in tissue engineering and cell-based therapies. Mesenchymal stem/stromal cells (MSC) have been identified in almost all adult human tissues1 since Friedenstein and colleagues discovered colony-forming fibroblasts in bone marrow in the 1970s2. MSC are typically characterised by their clonogenicity, multipotency3 and surface phenotype4. In addition, MSC home to damaged tissues5 and have anti-inflammatory and immunomodulatory properties6. Increasingly, MSC are recognized for their biological effects in repairing damaged tissues through secretion of soluble bioactive molecules, including growth factors such as vascular endothelial growth factor7, anti-fibrotic factors such as hepatocyte growth factor and prostaglandin E28, angiogenic factors9 and molecules that inhibit apoptosis and activate tissue specific progenitor cells. MSC-conditioned medium recapitulates the activity of MSC in vitro indicating a paracrine effect that initiates cellular signalling that ultimately enhance tissue repair10,11. These MSC properties have led to their use in numerous clinical trials for a variety of diseases, including graft versus host disease12, cardio-vascular disease as a cell-based therapy13 or in tissue-engineered constructs for bone (www.clinicaltrials.gov). MSC have recently been identified in the highly regenerative uterine lining (endometrium). Human endometrial mesenchymal stem/stromal cells (eMSC), like other mesenchymal stem/stromal cells are a rare group of quiescence cells (~1–4%) found in a perivascular location14,15. In the endometrium, eMSC are found in the functionalis layer that is shed during menstruation and in the remaining basalis layer from which the new functionalis grows each month16,17. eMSC can be prospectively isolated from endometrial biopsy tissues using co-expression of the MSC markers, CD140b and CD146 by flow cytometry sorting or with a single marker SUSD2 using magnetic beads14,15. eMSC isolated using the W5C5 antibody that recognises the SUSD2 antigen have typical in vitro MSC properties, in addition to reconstituting stromal tissue in vivo and significantly reducing inflammation and promoting neovascularisation when delivered as a tissue-engineering construct in an animal model of wound repair14,18. SUSD2 is a novel marker, recently identified, as an alternate to CD271 for purifying human bone marrow MSC (bmMSC)19. SUSD2 is a type I transmembrane protein that has a large extracellular region with domains known to have roles in cell adhesion, homodimerisation, signal transduction and migration20 through interaction with LGALS1 (galactosidase-binding, soluble, 1) and UGGT1 (UDP-glucose ceramide glucosyltransferase-like 1) proteins21. SUSD2 is also highly expressed in brain especially in the hippocampus where it plays a role in neuritic growth and excitatory synapses which involve its cell adhesive properties21. eMSC require expansion for use in clinical applications similar to bmMSC14,22,23. However like other MSC, eMSC undergo spontaneous differentiation to fibroblasts during the culture expansion process, decreasing their purity24. Heterogeneity and decreased efficacy of culture-expanded MSC result in reduced clinical effect. In addition, the regenerative potential of MSC declines with age25. Freshly isolated, culture expanded SUSD2+ eMSC underwent spontaneous differentiation indicated by decreasing proportions of SUSD2+ cells and increasing SUSD2− cells with increasing passage18. The MSC markers designated by the International Society of Cellular Therapy (ISCT) do not indicate the “stemness” of culture expanded MSC. During culture expansion, MSC age losing CFU activity, tri-lineage multipotency, telomere length and ability to generate neotissue in vivo, despite expressing the standard ISCT MSC markers24,26,27. For example, bmMSC lose differentiation and proliferative capacity even though expressing high levels of CD44, CD271, CD90 and CD105 during extended culture28. Thus, these typical ISCT MSC markers cannot be used to monitor the differentiation state of MSC during culture. The novel marker SUSD2 and CD146 may be superior markers to monitor the status of MSC during the culture expansion process22. The loss of clonogenicity, multipotency and onset of senescence upon extensive culture of bmMSC results in increased senescence-associated beta-galactosidase and p16 gene expression, as well as changes in DNA methylation, limiting the utility of MSC as a cell-based therapy29. The maintenance of a stem/progenitor cell population during culture expansion requires activity of signalling pathways involved in self-renewal and proliferation while preventing differentiation30. Several small molecules targeting signaling pathways involved in maintaining pluripotency or blocking differentiation have been used for pluripotent cell cultures. Inhibition of the GSK3β, MEK and TGF-β signalling pathways have been used in rat and human induced pluripotent stem cells (iPSCs) to prevent spontaneous differentiation and maintain their stemness during prolonged culture31. The ROCK inhibitor, Y27632, has been used to prevent dissociation-induced cell death of human embryonic stem cells32. The PDGFR-IV tyrosine kinase inhibitor (#521233, Calbiochem) increased expression of pluripotency genes OCT4 and NANOG and increased MSC potency from multipotent to a pluripotent state33. Transforming-growth factor beta receptor (TGF-βΡ), platelet-derived growth factor receptor (PDGF-R) and basic-fibroblast growth factor receptor (bFGFR) pathways have crucial roles in specifying MSC differentiation into osteogenic, myogenic, adipogenic and chondrogenic lineages34. Controlling MSC self-renewal and differentiation with small molecule inhibitors or activators of one or more of these key signalling pathways, should generate a homogeneous MSC population during culture expansion. The use of eMSC for cell-based therapy requires their expansion in culture conditions that supports homogenous growth and maintains self-renewal and multipotency. A83-01 is a potent selective inhibitor of the TGF-βRs ALK4, 5 and 7. A83-01 inhibits SMAD2 phosphorylation35,36, maintains self-renewal and proliferation of rat and human induced pluripotent stem cells in cultures without feeder layers35. The aim of this study was to determine whether A83-01 maintained growth and prevented spontaneous differentiation of eMSC during culture expansion. In this study, we showed that A83-01 promotes proliferation of late passage SUSD2+ cells in serum free medium (SFM), an effect mediated by SMAD2/3 signaling. A83-01 also prevented senescence and apoptosis of cultured eMSC, suggesting that TGF-β has a role in regulating SUSD2 expression and eMSC growth, apoptosis and senescence and therefore may have a role in spontaneous MSC differentiation during culture expansion. Small molecules such as A83-01 may provide an approach for the expansion of undifferentiated MSC for use in tissue engineering and cell-based therapy. In our earlier studies, we observed that SUSD2+ cells diminished in number with increasing passage18, despite their high purity on initial seeding following SUSD2 magnetic bead sorting14. To examine the effect of the TGF-βR inhibitor, A83-01 on eMSC proliferation, passage 3 eMSC were cultured in SFM in 5% O2 with A83-01 concentrations ranging from 0–10 μM for 7 days. Control medium was supplemented with vehicle. The MTS cell viability end-point assay was used to assess the effect of A83-01 on eMSC growth. As shown in Fig. 1A, A83-01 dose dependently increased the number of viable cells with maximal effect at 1 μM concentration (p < 0.05) by day 7. This result suggests that TGF-βR signaling regulates cell growth in negative manner. All further experiments were carried out with P6 eMSC using A83-01 at 1 μM concentration. A83-01 blocks the phosphorylation of SMAD2/3 (Fig. 1B) thus indicating its activity via SMAD pathway. Dose Response curve of A83-01 promotion of eMSC proliferation. (A) Passage 3 eMSC incubated A83-01 in SFM in 5%O2/5%CO2 at 37 °C for 7 days was assessed by MTS cell viability assay. Means for triplicates were obtained for each sample at each concentration, then normalised to vehicle control DMSO (100%) and plotted as mean ± SEM of n = 6 patient samples. (B) Passage 6 eMSC lysates with or without 1μM A83-01 were immunoblotted with anti-SMAD 2/3 or anti-pSMAD 2/3 antibodies. A83-01 inhibited TGF-βR-induced phosphorylation of SMAD 2/3. (C = control, T =  treated). We next examined the phenotype of A83-01 treated eMSC. Single-color flow cytometry analysis of 5 MSC markers showed that untreated P6 eMSC cultures comprised 69%-SUSD2+, 53%-CD140b+, 1%-CD146+, 95%-CD90+ and 0%-CD271+ positive cells (Fig. 2A), suggesting loss of the MSC phenotype and spontaneous differentiation. It is noteworthy that CD90, the representative ISCT MSC marker4 did not change over the period of culture and that P6 eMSC did not express CD271 (bmMSC marker) whether incubated with or without A83-01. There was a significant increase in the percentage of SUSD2+ (94%, p < 0.05) and CD140b+ (83%, p < 0.05) cells when the P6 cells were treated with 1 μM A83-01 for at least 7 days. There was also an increase in the mean fluorescence intensity for the SUSD2 marker on the SUSD2+ cells (Fig. 2B,C), indicating an increase in the number of SUSD2 molecules per cell (p < 0.05). This was also evident by immunofluorescence (Fig. 2D). However, A83-01 had no effect on the CD146 expression, which was downregulated during culture expansion (Fig. 2A). Phenotype of P6 eMSC cultured with or without A83-01 in serum free medium in 5%O2. (A) % Positive cells for MSC surface markers on passage 6 eMSC (n = 8) cultured in 1μM A83-01(black bars) or in 0.01% DMSO (white bars) for 7 days and assessed by single-colour flow cytometry. (B) Representative flow cytometric histograms of SUSD2+ eMSC treated with (black bar) and without (white bar) 1 μM A83-01 and MFI summarised in (C). (D) SUSD2 expression on control (left panel) and A83-01 treated (right panel) eMSC by immunofluorescence (red). Data are mean ± SEM of n = 8 different patient samples. **p < 0.01, ***p < 0.001. We next investigated whether inhibition of the TGF-βR signalling pathway in late passage eMSC cultures altered their MSC functional properties. The cloning efficiency of P6 A83-01 pre-treated eMSC was significantly greater (p < 0.05) than control cells (Fig. 3A,B). The A83-01 pre-treated eMSC also generated larger colonies than untreated eMSC. Functional MSC properties of P6 eMSC cultured with or without A83-01 in serum free medium. (A) Representative culture plates seeded at clonal density (50 cell/cm2). (B) Graph shows Colony Forming Efficiency of P6 eMSC pre-treated with 1μM A83-01 or 0.01% DMSO vehicle for 7 days in 5% O2 in SFM followed by clonal culture at 50 cells/cm2 in SFM for 4 weeks. (C) Multilineage mesodermal differentiation of 0.01% DMSO treated control and 1 μM A83-01 treated P6 eMSC showing adipogenic, osteogenic and chondrogenic differentiation (controls were cultured in 1% serum media) for four weeks in 5%O2. Oil Red O was used to visualise cellular lipid vesicles for adipogenic differentiation, Alizarin Red to detect calcium mineralisation for osteogenic differentiation and Alcian Blue to detect acidic polysaccharides in the extracellular matrix for cartilage differentiation. Representative images from n = 3 samples. Data are mean ± SEM of n = 6 different samples *p < 0.05. Next, we tested whether A83-01 pre-treated eMSC retained MSC multilineage differentiation capacity. P6 eMSC pre-treated with or without 1 μM A83-01 were cultured in differentiation induction media or 1% FCS growth medium (control) to assess differentiation into adipocytes, osteocytes and chondrocytes (Fig. 3C). A83-01 pre-treated and untreated cells showed similar phenotype changes in adiopogenic medium with similar numbers of cells containing Oil Red O stained lipid droplets. Similarly for osteogenic differentiation, the amount of Alizarin Red stained calcium deposits was comparable. In contrast, chondrogenic differentiation of the cell pellets was greater for the A83-01 pre-treated cells, as a strong Alcian Blue stained matrix in a cartilage-like organoid was observed, while the untreated eMSC pellet disintegrated easily with little evidence of chondroitin sulphate matrix deposition (Fig. 3C). There was no differentiation in non-induction medium. We next examined the expression of pluripotency and MSC genes suggested to have a role in maintaining MSC self-renewal. Quantitative RT-PCR of A83-01 treated and untreated cells failed to detect pluripotency genes OCT4, SOX2 and NANOG in either group (results not shown) although they were demonstrated in the human iPS cells positive control. Consistent with the flow cytometry data, SUSD2 was downregulated in the control group and highly expressed in the A83-01 treated cells (p = 0.0078) (Fig. 4). The expression of CD146 and MMP3 genes was reduced in A83-01 treated cells (p = 0.04 and p = 0.0078, respectively) (Fig. 4). There was also an increase in the expression of AOC3 (p = 0.031), a marker of SUSD2+ cells37 and FRZB (p = 0.015) (Fig. 4), a gene encoding for a Wnt ligand binding protein, in A83-01 treated group while no difference was observed in the expression of NOTCH2, NOTCH3 and DKK genes (Fig. 4). Quantitative RT-PCR analysis of MSC genes. P6 eMSC cultures treated (black squares) or untreated control (black circles) with 1 μM A83-01 in 5%O2/5%CO2/90%N at 37 °C for 7 days. qRT-PCR analysis of SUSD2, CD146, AOC3, FRZB, MMP3, DKK1, NOTCH3, NOTCH2 and NESTIN. β-Actin or GAPDH were used to normalise the mRNA level and fold change was calculated using 2−ΔΔCT. Data are mean ± SEM on n = 7 different tissue samples. *p < 0.05; **p < 0.01. To identify the mechanism of action of A83-01 in increasing eMSC proliferation (Fig. 1), we undertook cell cycle analysis (Fig. 5A) with propidium iodide to label DNA. Figure 5A,B shows that A83-01 treatment increased the proportion of cells in G2/M phase (p < 0.05) indicative of an increased rate of cell division. There were also significantly fewer A83-01 treated cells in the sub G1/G0 phase of the cycle compared with control cells indicating fewer apoptotic cells with fragmented DNA content in the A83-01 treated cells (Fig. 5A,B). We then quantified the apoptotic cells using Annexin V flow cytometry to assess early phase apoptosis. The inclusion of PI was to detect late apoptotic and necrotic cells. Culture expanded P6 eMSC significantly reduced the percentage of live cells and increased the proportion of apoptotic cells as shown by the increased binding of Annexin V to exposed phosphatidylserine (PS) on the outer leaflet of the plasma membrane (Fig. 5C,D). The increased PI staining in the untreated eMSC also indicated increased necrotic cells. These changes were mitigated by pre-treatment with 1 μM A83-01 (p < 0.05) (Fig. 5C,D). A83-01 blocks apoptosis and promotes eMSC proliferation. P6 eMSC treated with 1 μM A83-01 or 0.01% DMSO cultured for 7 days in SFM in 5%O2/5%CO2/90%N were assessed by (A) Cell cycle analysis of PI stained cells. Shows representative PI staining on a linear axis of a flow cytometry plot (B) the percentage of cells in SubG1/G0, G1, S and G2/M stages of the cell cycle (black bar A83-01 treated, White bar control). Data are mean ± SEM, n = 7 patient samples; *p < 0.05. (C) Annexin-V and PI staining. Representative flow cytometric plots. The lower left quadrant of each panel shows the viable cells, upper left early apoptotic; upper right late apoptotic and lower right necrotic cells and (D) graph showing the percentage of live, apoptotic and necrotic cells. Data are mean ± SEM, n = 6 patient samples, *p < 0.05. (E) Relative autofluorescence by flow cytometry of unstained P6 cells treated (black bar) and untreated (white bar) with 1 μM A83-01. Data are mean ± SEM, n = 10, ***p < 0.005. (F) Representative images showing the staining of senescence-associated β-galactosidase (SA-β-gal) in cultured P6 eMSC treated with or without 1 μM A83-01. To further understand the action of A83-01, we examined unstained P6 eMSC from treated and control groups by UV light to quantify autofluorescence, as a measure of senescence. As shown in Fig. 5E, control P6 eMSC were significantly more autofluorescent than the A83-01 treated P6 eMSC (p = 0.001). Therefore, we measured senile associated β-Gal (SAβ-Gal) activity by incubating cells with X-Gal. As shown in Fig. 5F, A83-01 treated P6 eMSC showed little β-Gal staining whereas the untreated control eMSC displayed blue staining indicative of senescent cells. Furthermore the A83-01-treated cells were smaller and more numerous, in agreement with our findings above. The main findings from this study are that A83-01, a small molecule TGF-βR inhibitor, prevented the typical loss of undifferentiated MSC during culture expansion. Specifically, we showed that A83-01 treatment prevented loss of SUSD2+ eMSC in late passage cultures by promoting the mitosis and proliferation of P6 SUSD2+eMSC and by preventing their apoptosis and senescence. A83-01 treated SUSD2+ cells in late passage culture retained their MSC properties, showing greater clonogenicity then untreated cells. In particular there were greater numbers of large colonies which undergo serial cloning and are more proliferative than those initiating small colonies38. Their multilineage differentiation capacity was maintained as well as expression of key MSC genes; SUSD2, AOC337 and FRZB39. We further identified that the signalling pathway blocked by A83-01 was TGF-βR mediated apoptosis via SMAD2/3 phosphorylation. Since multiple pathways work together in regulating MSC fate and TGF-βR pathway signalling is pleiotropic, targeting this pathway may provide an ideal method for maintaining undifferentiated MSC in cell production protocols for clinical use. We showed culture expansion of eMSC lead to a loss of clonogenicity and expression of SUSD2, CD140b and CD146 surface markers while CD90, a standard ISCT MSC marker does not change. This was also shown by loss of SUSD2+-expressing eMSC when induced by TGF-β1 to differentiate into smooth muscle cells40. These properties support the concept that eMSC spontaneously differentiate into fibroblasts lacking the expression of perivascular markers, clonogenicity and osteogenic and chondrogenic differentiation capacity. Further molecular characterisation of differentiation at the transcript and protein levels is feasible with qRT-PCR and western blotting respectively. TGF-βR signalling is necessary for chondrogenic differentiation34. However, while the experimental medium for eMSC culture expansion contained A83-01, the chondrogenic differentiation medium contained TGF-β1 without A83-01 to assess chondrogenic differentiation potential of A83-01 treated and untreated cells. One advantage of using small molecules rather than siRNA to modulate receptor activity is that their inhibitory effect is reversed as soon as the small molecules are removed. We were therefore able to show that chondrogenic differentiation was enhanced in A83-01 pre-treated cells. A83-01 not only increased the expression of SUSD2 proteins but also CD140b. In contrast, CD146 gene expression was greater in the untreated group but did not appear to be translated into protein as it was not detected by flow cytometry. Furthermore, expression of CD146 on cultured MSC is regulated by factors such as hypoxia, growth factors and metalloproteases41,42. Culture expanded MSC are more autofluorescent than the primary cells indicating replicative senescence and loss of proliferative ability43,44 an effect observed in P6 control eMSC which was mitigated by A83-01 treatment. Endometrial MSC are an attractive source of cells for tissue engineering and cell-based therapies because they can be harvested with minimal discomfort to patients, have standard MSC properties in vitro and in vivo and they can be cultured in serum free conditions, offering a readily available cell source for allogeneic as well as autologous use. The necessity to expand MSC for clinical use due to their rarity and their subsequent spontaneous differentiation limits the full potential of eMSC and MSC in general. TGF-β belongs to a superfamily of TGF cytokines which has multiple functions. TGF-β plays a vital role in MSC differentiation along with PDGF and FGF-2 pathways34,45. TGF-β is synthesized by endometrial stromal cells under the influence of physiological female hormones, fluctuating during different phases of menstrual cycle. TGF-β production increased in the secretory and menstrual phases but was diminished in the proliferative phase, suggesting that TGF-β promotes differentiation46. Similarly, TGF-β promoted differentiation of SUSD2+ eMSC when cultured on polyamide/gelatin meshes40. TGF-β can independently, as well as in association with Wnt and NOTCH signaling pathways, regulates proliferation and differentiation of MSC47,48. Gene profiling of purified eMSC shows that there is an increased fold change in FRZB receptor indicating an interaction with the Wnt signalling pathway. Pluripotency genes are not present in freshly isolated eMSC39 and we found that P6 eMSC did not express pluripotency markers nor did A83-01 treatment upregulate their expression. Apoptosis or programmed cell death mainly results from activation of cellular caspases. The TGF-βR pathway also participates in apoptosis via SMAD activation, in association with Death associated protein 6 and TGF-βR inducible transcription factor49,50. In epithelial cells and hepatocytes, TGF-βR induces apoptosis and inhibits proliferation49,50,51 through the activation of TGFβ-inducible early gene-1 (TIEG1) via phosphorylation of SMAD2/3 and formation of reactive oxygen species. TIEG1 inhibits cell growth and leads to apoptosis49. P6 eMSC treated with 1 μM A83-01 showed significantly increased growth by preventing apoptosis compared to the untreated cells, however it is not known if TIEG1 is involved. Human Lgr5+ liver stem cell cultures in mouse culture medium was not supported for more than three weeks and revealed highly active TGF-β signalling. This was also mitigated by blocking with A83-01 which improved cloning efficiency with extended time in culture of the liver stem cells52. A83-01 is a selective inhibitor of TGF-βR type I ALK4/5/7. It has a thiourea group in its structure, conferring copper ion chelation properties. Thioureas prevent copper mediated oxidative cellular damage by chelating copper in the medium53. One of the potential mechanisms by which A83-01 acts in SUSD2+ eMSC may be the prevention of spontaneous differentiation and apoptosis mediated via the copper chelating thiourea moiety. Our study also demonstrated for the first time that TGF-βR signalling is an essential negative regulator of SUSD2 expression through SMAD2/3 signalling in eMSC. In addition, the TGF-βR pathway is involved in regulating eMSC proliferation, senescence and apoptosis. In summary we have shown that TGF-βR signaling is involved in eMSC cell fate in vitro. A83-01, a small molecule TGF-βR inhibitor, enhanced the expression of SUSD2 and CD140b, maintaining eMSC clonogenic phenotype during prolonged culturing, promoting cell proliferation and preventing apoptosis and senescence. Small molecules such as A83-01 that promote eMSC proliferation in the undifferentiated state may provide an approach for the expansion of undifferentiated MSC for use in tissue engineering and cell-based therapies. The experimental protocols were conducted under the ethical guidelines according to the National Health and Medical Research Council (NHMRC) of Australia’s National Statement on Ethical Conduct in Human Research. Human ethics approval was obtained from the Monash Health and Monash University Human Research Ethics committees. Human endometrial tissues samples were collected from pre-menopausal women who were undergoing endometrial curette or hysterectomy for non-endometrial pathologies and who were not taking any exogenous hormones for three months prior to the surgery, following informed patient consent. eMSC were isolated according to our previously published protocol14. Briefly, endometrial tissues from hysterectomy sample were carefully scraped off the underlying myometrium. Both hysterectomy and curette tissues were mechanically minced and digested with 0.5% collagenase type I and 40 μg/ml deoxyribonuclease type I (both Worthington Biochemical Corporation) in Dulbecco’s modified Eagle’s medium (DMEM/F12) for 90 and 60 minutes, respectively in a humidified incubator at 37 °C on a rotating MACSmix (Miltenyi Biotech). The tissue digest was filtered through 40 μm cell strainer (BD Biosciences) to separate the epithelial gland fragments and undigested tissues. The red blood cells in the filtrate were separated from the single stromal cells by density gradient centrifugation using Ficoll-Paque (GE healthcare Bio-science). eMSC were obtained by incubating the stromal cells in Phycoerythrin (PE)-conjugated anti-human SUSD2 (10 μg/ml, BioLegend)) in 0.5% FCS/PBS (bead medium) and anti-PE magnetic-activated cell sorting microbeads (Miltenyi Biotec) for 30 minutes each in the dark on ice. The conjugated pellet was resuspended in bead medium and applied to a Miltenyi column (Miltenyi Biotec, #130-042-201) in a magnetic field. The separated cells, containing the SUSD2+ eMSCs in the column were eluted in bead medium and the cells counted. The SUSD2+ eMSC were initially maintained in DMEM/F12 medium containing 10% Fetal calf serum (FCS) (Invitrogen), 1% antibiotic-antimycotic (Life Technologies) and 2 mM glutamine and slowly changed to an in-house DMEM/F12 serum free medium supplemented with basic fibroblast growth factor (FGF2, 10ng/ml) and epidermal growth factor (EGF, 10 ng/ml) (SFM) at 37 °C in 5%O2/5%CO2/90%N, as described previously22. The cells were seeded at 5000 cells/cm2 density at subsequent passages in fibronectin (10 ug/ml) pre-coated culture flasks. Cell proliferation assays were performed at passage 3 by seeding 1000 cells in 100 μl SFM per well in fibronectin pre-coated 96-well plates with or without A83-01, concentrations varying from 0–10 μM. Media was changed every second day and contained A83-01 at the same concentration. Following 7 days of culture, 20 μl of MTS tetrazolium reagent (Promega) was added to each well and incubated for 2 hours and the soluble formazan product was quantified using a micro plate reader (SpectraMax Plus384; Molecular Devices) at 490 nm. Further experiments were done at passage 6 where the cells were separated into two groups, one group was treated with 1μM A83-01 and the control with (0.01% DMSO) vehicle. The data was normalised to the control and reported as a percentage. eMSC were trypsinised with TrypLETM (Life technologies, #12604-021)) and resuspended at 105 cells/tube. Cells were washed with 5% heat-inactived newborn calf serum in DMEM (bench medium) and incubated with PE-, APC- or FITC-conjugated primary antibodies or matched-isotype controls in bench medium for 30 minutes in the dark on ice. Primary antibody used was CD146 (1:1 supernatant, clone CC9, kind gift from Prof David Haylock CSIRO). PE-conjugated antibodies were SUSD2 (1:20, Biolegend, #327406), CD140b (1:20, R&D systems FAB1263P) and CD271 (1:20, Miltenyi Biotec). APC-conjugated antibody was CD90 (1:20, BD Pharmingen). Isotype control antibodies at the same concentration as the primary antibody were included for each run and were used to set the electronic negative control gate on the flow cytometer. Finally, cells were washed with bench medium and fixed with 4% paraformaldehyde (PFA) in 2%FBS/PBS. Samples were analysed using a MoFlo Flow Cytometry (Beckman Coulter) and Summit software (version 5.2., Beckman Coulter). Passage 6 (P6) eMSC were cultured on coverslips with or without 1 μM A83-01 for 7days and then fixed in 4% PFA followed by protein block (Dako, X0909) for 10 minutes each at room temperature with washing in between with PBS. PE-conjugated SUSD2 antibody (1:200, BioLegend, #327406) in 2% FCS/PBS was incubated for 2 hours at room temperature in dark. Isotype control IgG1 antibody was used as a negative control. Hoechst 33258 (1:2000, Molecular Probes) was used to visualise nuclei. Images were visualised and photographed using a Delta Vision microscope and analysed using ImageJ software (ImageJ-win32.Ink). Cell lysates were prepared using lysis buffer (50 mM Tris pH 8.0, 150 mM NaCl, 1% triton X-100) with mini protease inhibitor cocktail tablet (Roche) and phosphatase inhibitor sodium vanadate (2 mM). The following antibodies were used: anti-SMAD 2/3 antibody (#3102S), antiphospho-SMAD 2/3 (#8828S), horseradish peroxidise conjugated secondary antibody (#7074S) from Cell Signalling Technology. The specific protein was detected by treating the membrane for two minutes with enhanced chemiluminescence (# 133406, Abcam) which provides the HRP substrate and capturing the signal in X-ray films. RNA was isolated using PureLink® RNA mini Kit (Life technologies, #12183018A) and further treated with DNase (PureLinkTM DNase, Invitrogen) to obtain DNA-free total RNA. First-strand cDNA was synthesized using SuperScript III first-strand synthesis system (Invitrogen). 50 ng of cDNA was amplified and detected using TaqMan probes for OCT4, NANOG and SOX2 and SYBR Green Super Mix for SUSD2, CD146, AOC3, MMP3, FRZB, DKK1, NOTCH3, NOTCH2 and NESTIN. The PCR conditions consisted of initial denaturation at 95 °C for 10 minutes, followed by 40 cycles of denaturation at 95 °C for 15 seconds and annealing/polymerisation at 60 °C for 60 seconds. Primer sets are detained in Table 1. GAPDH or β-Actin was used as an endogenous control to normalise the target gene expression and fold change was calculated using the 2−ΔΔCT method. To assess colony-forming ability, P6eMSC pre-treated and untreated with 1 μM A83-01 for 7 days were seeded at 50 and 100 cells/cm2 on fibronectin-coated 100 mm culture dishes (BD Falcon) in SFM in a tri-gas incubator 5%O2/5%CO2/90%N for four weeks. The cells were then formalin-fixed for 10 minutes and stained with haematoxylin (AMBER SCIENTIFIC). The colonies were washed twice with distilled water and counterstained with Scott’s tap water to develop the blue colour. Colony efficiency was calculated by counting the number of colonies divided by the number of cells seeded and the percentage determined. To assess multipotency, the remaining cells were cultured in adiopogenic and osteogenic and control medium (1% fetal calf serum) on 13-mm coverslips and for chondrogenic differentiation the cells were cultured as 3D pellets in chondrogenic induction media for 4 weeks at 37 °C in 5%CO2/5%O2 as described previously22. To detect the differentiation, the cells were fixed with 4% PFA and incubated with 1% Oil Red O for adipogenesis, 4% Alizarin Red (pH 4.1) for osteogenesis and 1% Alcian blue (pH 2.5) on paraffin embedded sections (5 μm) of the micromass pellet for chondrogenesis. Stained cells were examined under an Olympus BX41 microscope (Olympus) and images were taken with 10X objective lens using the DP25 digital camera (Olympus). To assess the cell cycle status, P6 A83-01 treated and untreated cells were detached, pelleted and fixed in ice-cold 70% ethanol at 4 °C overnight. They were washed with 2%FBS/PBS and incubated with 50 μl RNAse (100 μg/ml, Sigma) at room temperature for 15 minutes. 200 μl of propidium iodide (PI) (50 μg/ml, Sigma P4170) was added and the cells were analysed immediately by flow cytometry using BD FACS CantoTM II on PI-linear scales. The data were analysed using Flow Jo 7.6.3. To assess apoptosis, P6 A83-01 treated and untreated cell-pellets were stained with Annexin V-APC/PI kit following the manufacturer’s protocol (#88–8007, eBioscience). Briefly, cells were trypsinised and resuspended in 100 μl binding buffer, 5 μl of Annexin V-APC solution was added to the cell suspension and incubated for 15 minutes at room temperature protected from light. Following washing with the binding buffer, 5 μl of PI was added to the cells suspended in 200 μl binding buffer and events immediately acquired by flow cytometry using BD FACS CantoTM II and analysed with Flow Jo 7.6.3. Senescent cells were assessed by staining for beta-galactosidase activity. P6 A83-01 treated and untreated eMSC were cultured on coverslips for 7 days as described above, then fixed in 4% PFA for 10 minutes and stained in freshly prepared X-Gal (1 mg/ml in DMSO) staining reagent (5 mM K3Fe(CN), 5 mM K4Fe(CN), 2 mM MgCl2, 150 mM NaCl) in citrate buffer at pH6 for 24 hours at 37 °C. The cells were washed twice with PBS and counter stained with nuclear fast red (Sigma-Aldrich, 0.1% w/v) for 10 minutes, then examined under an Olympus BX41 microscope (Olympus). Images were taken with 10X objective lens using the DP25 digital camera (Olympus). Non parametric Friedman’s test with Dunn’s multiple comparison post hoc tests were used to test for multiple groups and Wilcoxon matched-pairs signed rank tests were used to test for statistical significance between treated and control groups. Data are presented as mean ± standard error of mean. Differences were considered statistically significant at p < 0.05. How to cite this article: Gurung, S. et al. Inhibition of Transforming Growth Factor-β Receptor signaling promotes culture expansion of undifferentiated human Endometrial Mesenchymal Stem/stromal Cells. Sci. Rep. 5, 15042; doi: 10.1038/srep15042 (2015). Crisan, M. et al. Perivascular multipotent progenitor cells in human organs. Ann. N. Y. Acad. Sci. 1176, 118–123, 10.1111/j.1749-6632.2009.04967.x (2009). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Friedenstein, A. J. et al. Precursors for fibroblasts in different populations of hematopoietic cells as detected by the in vitro colony assay method. Exp. Hematol. 2, 83–92 (1974). CAS \n    PubMed \n    \n                    Google Scholar Pittenger, M. F. et al. Multilineage potential of adult human mesenchymal stem cells. Science 284, 143–147 (1999). Article \n    CAS \n    ADS \n    \n                    Google Scholar Dominici, M. et al. Minimal criteria for defining multipotent mesenchymal stromal cells. The International Society for Cellular Therapy position statement. Cytotherapy 8, 315–317, 10.1080/14653240600855905 (2006). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Caplan, A. I. & Bruder, S. P. Mesenchymal stem cells: building blocks for molecular medicine in the 21st century. Trends in molecular medicine 7, 259–264 (2001). Article \n    CAS \n    \n                    Google Scholar Bianco, P. “Mesenchymal” stem cells. Annu. Rev. Cell Dev. Biol. 30, 677–704, 10.1146/annurev-cellbio-100913-013132 (2014). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Burlacu, A. et al. Factors secreted by mesenchymal stem cells and endothelial progenitor cells have complementary effects on angiogenesis in vitro. Stem cells and development 22, 643–653, 10.1089/scd.2012.0273 (2013). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Dong, L. H. et al. The anti-fibrotic effects of mesenchymal stem cells on irradiated lungs via stimulating endogenous secretion of HGF and PGE2. Scientific reports 5, 8713, 10.1038/srep08713 (2015). Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Kuchroo, P. et al. Paracrine Factors Secreted by Umbilical Cord-Derived Mesenchymal Stem Cells Induce Angiogenesis In Vitro by a VEGF-Independent Pathway. Stem cells and development 24, 437–450, 10.1089/scd.2014.0184 (2015). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Takahashi, M. et al. Cytokines produced by bone marrow cells can contribute to functional improvement of the infarcted heart by protecting cardiomyocytes from ischemic injury. American journal of physiology. Heart and circulatory physiology 291, H886–893, 10.1152/ajpheart.00142.2006 (2006). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Katagiri, W., Osugi, M., Kawai, T. & Ueda, M. Novel cell-free regeneration of bone using stem cell-derived growth factors. Int. J. Oral Maxillofac. Implants 28, 1009–1016, 10.11607/jomi.3036 (2013). Article \n    PubMed \n    \n                    Google Scholar Le Blanc, K. et al. Mesenchymal stem cells for treatment of steroid-resistant, severe, acute graft-versus-host disease: a phase II study. Lancet 371, 1579–1586, 10.1016/s0140-6736(08)60690-x (2008). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Psaltis, P. J., Zannettino, A. C., Worthley, S. G. & Gronthos, S. Concise review: mesenchymal stromal cells: potential for cardiovascular repair. Stem Cells 26, 2201–2210, 10.1634/stemcells.2008-0428 (2008). Article \n    PubMed \n    \n                    Google Scholar Masuda, H. et al. A novel marker of human endometrial mesenchymal stem-like cells. Cell Transplant. 21, 2201–2214, 10.3727/096368911x637362 (2012). Article \n    PubMed \n    \n                    Google Scholar Schwab, K. E. & Gargett, C. E. Co-expression of two perivascular cell markers isolates mesenchymal stem-like cells from human endometrium. Hum. Reprod. 22, 2903–2911, 10.1093/humrep/dem265 (2007). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Gargett, C. E. Uterine stem cells: what is the evidence? Hum. Reprod. Update 13, 87–101, 10.1093/humupd/dml045 (2007). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Gargett, C. E., Chan, R. W. & Schwab, K. E. Hormone and growth factor signaling in endometrial renewal: role of stem/progenitor cells. Mol. Cell. Endocrinol. 288, 22–29, 10.1016/j.mce.2008.02.026 (2008). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Ulrich, D. et al. Human endometrial mesenchymal stem cells modulate the tissue response and mechanical behavior of polyamide mesh implants for pelvic organ prolapse repair. Tissue engineering. Part A 20, 785–798, 10.1089/ten.TEA.2013.0170 (2014). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Hans-Jorg Buhring, V. L. B., Sabrina Treml, Bernhard Schewe, Lothar Kanz and Wichard Vogel. Novel markers for the prospective isolation of human MSC. Ann. NY Acad. Sci. 1106, 262–271 (2007). Article \n    ADS \n    \n                    Google Scholar Sivasubramaniyan, K. et al. Prospective isolation of mesenchymal stem cells from human bone marrow using novel antibodies directed against Sushi domain containing 2. Stem cells and development 22, 1944–1954, 10.1089/scd.2012.0584 (2013). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Nadjar, Y., Triller, A., Bessereau, J. L. & Dumoulin, A. The Susd2 protein regulates neurite growth and excitatory synaptic density in hippocampal cultures. Mol. Cell. Neurosci. 65, 82–91, 10.1016/j.mcn.2015.02.007 (2015). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Rajaraman, G. et al. Optimization and scale-up culture of human endometrial multipotent mesenchymal stromal cells: potential for clinical application. Tissue engineering. Part C, Methods 19, 80–92, 10.1089/ten.TEC.2011.0718 (2013). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Ulrich, D., Muralitharan, R. & Gargett, C. E. Toward the use of endometrial and menstrual blood mesenchymal stem cells for cell-based therapies. Expert opinion on biological therapy 13, 1387–1400, 10.1517/14712598.2013.826187 (2013). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Baxter, M. A. et al. Study of telomere length reveals rapid aging of human marrow stromal cells following in vitro expansion. Stem Cells 22, 675–682, 10.1634/stemcells.22-5-675 (2004). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Stolzing, A., Jones, E., McGonagle, D. & Scutt, A. Age-related changes in human bone marrow-derived mesenchymal stem cells: consequences for cell therapies. Mech. Ageing Dev. 129, 163–173, 10.1016/j.mad.2007.12.002 (2008). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Banfi, A. et al. Replicative aging and gene expression in long-term cultures of human bone marrow stromal cells. Tissue Eng. 8, 901–910, 10.1089/107632702320934001 (2002). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Digirolamo, C. M. et al. Propagation and senescence of human marrow stromal cells in culture: a simple colony-forming assay identifies samples with the greatest potential to propagate and differentiate. Br. J. Haematol. 107, 275–281 (1999). Article \n    CAS \n    \n                    Google Scholar Gharibi, B. & Hughes, F. J. Effects of medium supplements on proliferation, differentiation potential and in vitro expansion of mesenchymal stem cells. Stem cells translational medicine 1, 771–782, 10.5966/sctm.2010-0031 (2012). Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Bork, S. et al. DNA methylation pattern changes upon long-term culture and aging of human mesenchymal stromal cells. Aging Cell 9, 54–63, 10.1111/j.1474-9726.2009.00535.x (2010). Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Xu, Y., Shi, Y. & Ding, S. A chemical approach to stem-cell biology and regenerative medicine. Nature 453, 338–344, 10.1038/nature07042 (2008). Article \n    CAS \n    ADS \n    PubMed \n    \n                    Google Scholar Li, W. & Ding, S. Generation of novel rat and human pluripotent stem cells by reprogramming and chemical approaches. Methods Mol. Biol. 636, 293–300, 10.1007/978-1-60761-691-7_18 (2010). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Watanabe, K. et al. A ROCK inhibitor permits survival of dissociated human embryonic stem cells. Nat. Biotechnol. 25, 681–686, 10.1038/nbt1310 (2007). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Ball, S. G., Shuttleworth, A. & Kielty, C. M. Inhibition of platelet-derived growth factor receptor signaling regulates Oct4 and Nanog expression, cell shape and mesenchymal stem cell potency. Stem Cells 30, 548–560, 10.1002/stem.1015 (2012). Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Ng, F. et al. PDGF, TGF-beta and FGF signaling is important for differentiation and growth of mesenchymal stem cells (MSCs): transcriptional profiling can identify markers and signaling pathways important in differentiation of MSCs into adipogenic, chondrogenic and osteogenic lineages. Blood 112, 295–307, 10.1182/blood-2007-07-103697 (2008). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Li, W. et al. Generation of rat and human induced pluripotent stem cells by combining genetic reprogramming and chemical inhibitors. Cell stem cell 4, 16–19, 10.1016/j.stem.2008.11.014 (2009). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Tojo, M. et al. The ALK-5 inhibitor A-83-01 inhibits Smad signaling and epithelial-to-mesenchymal transition by transforming growth factor-beta. Cancer science 96, 791–800, 10.1111/j.1349-7006.2005.00103.x (2005). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Murakami, K. et al. Decidualization induces a secretome switch in perivascular niche cells of the human endometrium. Endocrinology 155, 4542–4553, 10.1210/en.2014-1370 (2014). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Gargett, C. E. et al. Isolation and culture of epithelial progenitors and mesenchymal stem cells from human endometrium. Biol. Reprod. 80, 1136–1145, 10.1095/biolreprod.108.075226 (2009). Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Spitzer, T. L. et al. Perivascular human endometrial mesenchymal stem cells express pathways relevant to self-renewal, lineage specification and functional phenotype. Biol. Reprod. 86, 1–16, 10.1095/biolreprod.111.095885 (2012). Article \n    CAS \n    \n                    Google Scholar Su, K. et al. Induction of endometrial mesenchymal stem cells into tissue-forming cells suitable for fascial repair. Acta biomaterialia 10, 5012–5020, 10.1016/j.actbio.2014.08.031 (2014). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Rawdanowicz, T. J. et al. Matrix metalloproteinase production by cultured human endometrial stromal cells: identification of interstitial collagenase, gelatinase-A, gelatinase-B and stromelysin-1 and their differential regulation by interleukin-1 alpha and tumor necrosis factor-alpha. J. Clin. Endocrinol. Metab. 79, 530–536, 10.1210/jcem.79.2.8045973 (1994). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Boneberg, E. M., Illges, H., Legler, D. F. & Furstenberger, G. Soluble CD146 is generated by ectodomain shedding of membrane CD146 in a calcium-induced, matrix metalloprotease-dependent process. Microvasc. Res. 78, 325–331, 10.1016/j.mvr.2009.06.012 (2009). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Wagner, W. et al. Replicative senescence of mesenchymal stem cells: a continuous and organized process. PloS one 3, e2213, 10.1371/journal.pone.0002213 (2008). Article \n    CAS \n    ADS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Constantinescu, R., Constantinescu, A. T., Reichmann, H. & Janetzky, B. Neuronal differentiation and long-term culture of the human neuroblastoma line SH-SY5Y. J. Neural Transm. Suppl. 17–28 (2007). Wang, M. K. et al. Different roles of TGF-beta in the multi-lineage differentiation of stem cells. World journal of stem cells 4, 28–34, 10.4252/wjsc.v4.i5.28 (2012). Article \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Chegini, N., Zhao, Y., Williams, R. S. & Flanders, K. C. Human uterine tissue throughout the menstrual cycle expresses transforming growth factor-beta 1 (TGF beta 1), TGF beta 2, TGF beta 3 and TGF beta type II receptor messenger ribonucleic acid and protein and contains [125I]TGF beta 1-binding sites. Endocrinology 135, 439–449, 10.1210/endo.135.1.8013382 (1994). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Kurpinski, K. et al. Transforming growth factor-beta and notch signaling mediate stem cell differentiation into smooth muscle cells. Stem Cells 28, 734–742, 10.1002/stem.319 (2010). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Attisano, L. & Wrana, J. L. Signal integration in TGF-beta, WNT and Hippo pathways. F1000 prime reports 5, 17, 10.12703/p5-17 (2013). Article \n    PubMed \n    \n                    Google Scholar Ribeiro, A. et al. The transforming growth factor beta(1)-inducible transcription factor TIEG1, mediates apoptosis through oxidative stress. Hepatology 30, 1490–1497, 10.1002/hep.510300620 (1999). Article \n    CAS \n    PubMed \n    \n                    Google Scholar Black, D. et al. Transforming growth factor beta mediates hepatocyte apoptosis through Smad3 generation of reactive oxygen species. Biochimie 89, 1464–1473, 10.1016/j.biochi.2007.09.001 (2007). Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Buenemann, C. L. et al. Transforming growth factor-beta1-induced Smad signaling, cell-cycle arrest and apoptosis in hepatoma cells. Carcinogenesis 22, 447–452 (2001). Article \n    CAS \n    \n                    Google Scholar Huch, M. et al. Long-Term Culture of Genome-Stable Bipotent Stem Cells from Adult Human Liver. Cell 160, 299–312, 10.1016/j.cell.2014.11.050 (2015). Article \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Zhu, B. Z., Antholine, W. E. & Frei, B. Thiourea protects against copper-induced oxidative damage by formation of a redox-inactive thiourea-copper complex. Free Radic. Biol. Med. 32, 1333–1338 (2002). Article \n    CAS \n    \n                    Google Scholar Download references The authors acknowledge Pamelar Mamers and Germana Ryan for collection of the tissues. Department of Obstetrics and Gynaecology, Monash University, Victoria, 3800, Australia Shanti Gurung, Jerome A. Werkmeister & Caroline E. Gargett Hudson Institute of Medical Research, 27-31 Wright Street, Clayton, 3168, Victoria, Australia Shanti Gurung & Caroline E. Gargett CSIRO Manufacturing Flagship, Bag 10, Clayton South, 3168, Victoria, Australia Jerome A. Werkmeister You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar S.G. performed the experiments, collected and assembly data, analysed the data and wrote manuscript. C.E.G. conceived and designed the experiments, provided the financial support, helped with data analysis and interpretation, editing and final approval of manuscript. J.A.W. collaborated by designing, data analysis and interpretation and final approval of manuscript. The authors declare no competing financial interests. This work is licensed under a Creative Commons Attribution 4.0 International License. The images or other third party material in this article are included in the article’s Creative Commons license, unless indicated otherwise in the credit line; if the material is not included under the Creative Commons license, users will need to obtain permission from the license holder to reproduce the material. To view a copy of this license, visit http://creativecommons.org/licenses/by/4.0/ Reprints and Permissions Gurung, S., Werkmeister, J. & Gargett, C. Inhibition of Transforming Growth Factor-β Receptor signaling promotes culture expansion of undifferentiated human Endometrial Mesenchymal Stem/stromal Cells.\n                    Sci Rep 5, 15042 (2015). https://doi.org/10.1038/srep15042 Download citation Received: 15 June 2015 Accepted: 14 September 2015 Published: 13 October 2015 DOI: https://doi.org/10.1038/srep15042 Anyone you share the following link with will be able to read this content: Sorry, a shareable link is not currently available for this article.  Provided by the Springer Nature SharedIt content-sharing initiative Communications Biology (2023) Stem Cell Research & Therapy (2021) Cell and Tissue Research (2021) Tissue Engineering and Regenerative Medicine (2021) Journal of Translational Medicine (2019) By submitting a comment you agree to abide by our Terms and Community Guidelines. If you find something abusive or that does not comply with our terms or guidelines please flag it as inappropriate. Advertisement Scientific Reports (Sci Rep)\n                \n\nISSN 2045-2322 (online) © 2023 Springer Nature Limited Sign up for the Nature Briefing newsletter — what matters in science, free to your inbox daily. ",
    "title": "Inhibition of Transforming Growth Factor-β Receptor signaling promotes culture expansion of undifferentiated human Endometrial Mesenchymal Stem/stromal Cells | Scientific Reports",
    "url": "https://www.nature.com/articles/srep15042"
}