{
    "text": "In a college town with a variety of available activities, swing dancing is a hobby for many students. For Weihao “Kraken” Zheng, junior in history and journalism, a dance that once seemed foreign and consists of lifts, spins and flips is now a passion. According to Google Maps, Zheng is over 6,500 miles away from home. He grew up in Beijing, China, but has been immersed in American culture for the past four years. “My first year at K-State, I was living in the dorms,” Zheng said. “That is actually the first time I found out about swing dancing. I had studied tango before and had a little bit of knowledge about dancing, but not swing dancing.” Zheng said he met the people living on his floor in his residence hall and quickly realized just how different cultures can be. “I would hang out with several girls on the floor, and when it was time to say goodbye late at night, they would come and give me a hug,” Zheng said. “I didn’t even remember their names yet, and that made me feel very awkward.” Zheng said his friends in the dorms recognized how shy he was at first and decided they needed to expose him more to American culture and help bring him out of his shell. “They took me to Dirty Dawgs,” Zheng said.  “At first I thought I would be dancing with the girls from my dorm, but then they told me that they were not going to be dancing with me and that I needed to dance with people I did not know.” He said dancing an unfamiliar dance with unfamiliar people is what inspired him to start practicing swing dancing. “I learned about swing dancing club, which is every Monday night in the Union,” Zheng said. “The first year, I joined club and began studying the dance, and then I soon began spending basically every weekend at Dirty Dawgs.” In 2014, Zach Langford, coach and choreographer of the Swinging Spurs, approached Zheng and encouraged him to try out for the team. Zheng said he decided to accept their offer. “This was the first time I had joined a team,” Zheng said. “In China, in primary or elementary school, middle school and high school we did not have those kinds of opportunities.” Zheng said Chinese schools differ from American schools in many ways. In contrast to class structure in America, where students have each class in a different room with a different set of classmates, Zheng said Chinese students are assigned to one classroom with about 15 classmates and one teacher. “We had a physical education class that consisted of a little running so that we did not stay in the classroom all day, but we did not actually have a sports team,” Zheng said. “Some schools do, but mine did not. We focused more on studying.” Zheng, who is an only child, said he did not have a lot of experience with different kinds of people growing up, especially with people around his own age. Donita Whitney-Bammerlin, director of the Swinging Spurs and faculty adviser to the country two-step club, said Zheng brings great diversity to the team. “It is fabulous having him on the team,” Whitney-Bammerlin said. “He is the type of individual that has acclimated and gotten involved in the Midwest American culture beyond what I could do if I were in China or if the tables were turned.” Courtney Stover, senior in animal sciences and industry,  said Zheng brings great diversity and fun to the team. “He is a wild card,” Stover said. “His personality doesn’t fit in a particular category because he is a little bit of everything.” Zheng said joining the Swinging Spurs has provided him with a good sense of community. “Many of the times we can joke and be really ridiculous, but when something happens and someone needs help, we are always there for each other,” Zheng said. He also said that being a member of the Swinging Spurs has opened the door to many opportunities. Zheng said the team has performed at their choreographer’s wedding, traveled to competitions in several different states and performed at K-State sporting events. “Last April, our team traveled to Chicago, Illinois, to compete at a competition,” Zheng said. “It was our first competition, and we won first overall.” Zheng said his family supports his involvement with Swinging Spurs, but is also a little concerned. “When my family heard that I lift up girls up to the sky, they were a little worried,” Zheng said. “They are worried that I might break my back or injure myself, but overall, my mother is happy about it because I can finally do a sport.” Whitney-Bammerlin said she is amazed by what Zheng has accomplished on the team. “He is self-taught and is always interested in learning,” Whitney-Bammerlin said. “He is not afraid to get out of his comfort zone.” Zheng said he has always had a passion for learning about different cultures and is currently studying French, reads history books and learns new things every day. He also said he loves traveling in the U.S. “This summer, I went on a really long road trip — I drove about 6,000 miles,” Zheng said. “I traveled from here to Colorado, Wyoming, Utah, Nevada, Arizona and back through Colorado to Kansas.” Zheng said he plans on traveling more during the upcoming summer. “I will probably travel by myself or find a friend to travel with me,” Zhang said. “Sometimes I enjoy the alone time though.” Zheng said he has learned a lot about American culture from traveling and studying here. “Cultures are always different,” Zheng said. “If I were to point out something that was the most different here in America, I would say that the people here are really generous.” ",
    "title": "International student two-steps his way into American culture - The Collegian",
    "datetime": "2015-12-09T06:43:19+00:00",
    "url": "https://www.kstatecollegian.com/2015/12/09/international-student-two-steps-his-way-into-american-culture/"
}