{
    "text": " Iran is increasingly limiting imports of foreign cars to protect its auto industry. According to the Iranian English Economic Daily Financial Tribune and KOTRA on August 31, the Trade Promotion Organization (TPO) under the Ministry of Industry and Trade of Iran has stopped issuing import permits for automobile importers at the end of July. The TPO made the same provisional move temporarily at the end of last year. This is because the TPO is strongly moving ahead with a policy to protect its own automobile industry by narrowing import channels for foreign cars that have been flowing into Iran after cutting a nuclear deal. Iran’s automotive technology lags behind those of global car manufacturers, which lead the Iranian government to concentrate on protecting and fostering the Iranian automobile industry as it creates jobs and has a large impact on the industry. Iran has a large domestic automobile market. When it comes to industrial scales, Iran’s automobile sector is biggest after Iran's main industries, the oil and petrochemical industries. The Iranian government is blocking unreasonable foreign car imports by unofficial private foreign car importers by letting only officially licensed importers. This will enable foreign automakers to invest in Iran and solve after-sales service problems involving foreign cars, which are chronic problems in Iran. This measure is consistent with this policy direction. The Iranian Daily Financial Tribune forecast that the import permits will not be issued to private importers until new regulations on foreign car imports are approved by the cabinet. The new regulations make it mandatory for automotive importers to either choose to start production locally or to participate in joint production with local automakers in Iran. Also, total foreign car imports should not eclipse half of Iran’s local automobile production. This means that the Iranian government will virtually prevent foreign car imports by small importers which will affect not only Korean but global carmakers. In the Iranian car market, foreign cars such as Hyundai, Kia, Peugeot, Renault, Toyota, Mitsubishi and DS account for 6%. Private car importers receive car orders from Iranian consumers and import cars through Turkey or the United Arab Emirates (UAE). Iran protects its own automobile industry by building import barriers by importing tariffs of around 100% on imported cars. For this reason, the Hyundai Sonata locally retails around US$60,000 to US$70,000. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Iran Strictly Limits Car Imports including Hyundai, Kia Motors Cars - Businesskorea",
    "datetime": "2017-09-03T17:00:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=19172"
}