{
    "text": "Commentary  March 19, 2014 Higher Education Economic Studies Center for Economic Security and Opportunity The educational conveyor belt has stalled in the U.S.—at least for low-income children, argue Greg Duncan and Richard Murnane in their new book, Restoring Opportunity: The Crisis of Inequality and the Challenge for American Education. For more than seventy years, the United States has enjoyed a steady increase in educational attainment. This growth in human capital, working in tandem with technological advances, fueled the nation’s unprecedented economic progress and raised American living standards to all-time global highs. In the 1970s and 1980s, however, educational attainment growth rates stagnated and have yet to return to their former robust glory.  America’s educational slow-down is not due to a decline in the value of post-secondary education. In fact, Duncan and Murnane note that the earnings differential between high school and college graduates has widened dramatically since 1980, as advances in computer technology, the acceleration of globalization, and the decline of unionization have reduced the demand for and the wages of lower-skilled workers. Instead, the authors attribute today’s sluggish growth to climbing college tuitions and weak academic preparation in K-12, both of which have disproportionately hindered the educational progression of low-income children. Case in point: college graduation rates for high-income high schoolers jumped by nearly 20 percentage points between the 1970s and 1990s, while only increasing by 4 percentage points for low-income students. Ultimately, then, getting America back to its pre-1970s educational growth rate will require closing existing class gaps in college-prep, college attendance, and college graduation. We need to make post-secondary education the norm for everyone, not just the advantaged. (Suggestively, if we project forward the pre-1970 educational attainment trend, the average adolescent in 2010 would complete 16 years of schooling (aka, a college degree) over the course of her lifetime.) This may sound like a tall order, but it is has historical precedent: In the first half of the 20th century, the average American could ascend to the middle class (or higher) on a high school diploma alone, and our education system reflected this reality by making K-12 mandatory. In today’s economy, a high school diploma is not enough; now, more than ever, college is the gateway to the American Dream. It’s time we start thinking of postsecondary education as the new high school: a necessary component in the education of the American child. Higher Education Economic Studies Center for Economic Security and Opportunity Beth Schueler, \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMelissa Arnold Lyon, \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJoshua Bleiberg October 24, 2023 Taylor Odle, \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJennifer A. Delaney, \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPreston Magouirk October 23, 2023 Nariman Moustafa October 20, 2023 Get the latest from Brookings The Brookings Institution is a nonprofit organization based in Washington, D.C. Our mission is to conduct in-depth, nonpartisan research to improve policy and governance at local, national, and global levels. Copyright 2023 The Brookings Institution ",
    "title": "Is It Time for K-16? | Brookings",
    "url": "https://www.brookings.edu/articles/is-it-time-for-k-16/"
}