{
    "text": "Congratulations to Dawn K. Cecil ’93, M.A. ’95, on the publication of her first book. Prison Life in Popular Culture: From The Big House to Orange Is the New Black is an extensive examination of how prisons are depicted in the media and other aspects of popular culture. Dawn Cecil Today, images of prison life are found everywhere. This book examines news coverage of prisons, prisons as a marketing tool (beer, wine, tours, restaurants, and hotels), prison films and televised dramas, documentaries, music, and comedy. The overall purpose is to understand how people who do not have personal experiences with prison come to understand what prison is like. This is particularly important in the age of the imprisonment binge. What Cecil found is that much of the mainstream imagery supports the types of policies that contributed to the imprisonment binge. Luckily, now there are a variety of alternative images that give people a different side of imprisonment. Cecil’s interest in prisons can be traced back to her time at Illinois State, where she earned her bachelor’s and master’s degrees in criminal justice sciences. The very first class she took was with Professor Lois Guyon. After learning about Guyon’s time working in a women’s prison, Cecil was immediately interested and even changed her major to criminal justice sciences. Cecil feels lucky that during her time at Illinois State she had the opportunity to learn from great professors who continued to spark her interest in prisons. She remembers visiting a federal prison in Missouri with Professor Mark Fleischer, and visiting Russian prisons with Professor Frank Morn. Many years later she became interested in examining media images and the two interests came together. The book is the culmination of that work. Cecil received her Ph.D. in criminology and criminal justice from the University of Maryland in 2002. That same year, she was hired as an assistant professor in the department of criminology at the University of South Florida St. Petersburg. Currently, she is an associate professor and serves as the program coordinator for the department. Her teaching interests include criminological theory, corrections, media and crime, and gender and crime. ",
    "title": "ISU alum’s book explores how prisons depicted in pop culture - News - Illinois State",
    "datetime": "2015-10-22T15:21:31+00:00",
    "url": "https://news.illinoisstate.edu/2015/10/isu-alums-book-explores-prisons-depicted-pop-culture/"
}