{
    "text": "News Amid Boston Overdose Crisis, a Pair of Harvard Students Are Bringing Narcan to the Red Line News At First Cambridge City Council Election Forum, Candidates Clash Over Building Emissions News Harvard’s Updated Sustainability Plan Garners Optimistic Responses from Student Climate Activists News ‘Sunroof’ Singer Nicky Youre Lights Up Harvard Yard at Crimson Jam News ‘The Architect of the Whole Plan’: Harvard Law Graduate Ken Chesebro’s Path to Jan. 6 Writer’s note: this article was written before the Itaewon Halloween crowd crush that occurred on October 29th, 2022. As a result, it does not mention or engage with the tragedy. In freshman fall, I heard about a Korea-themed study break happening in my entryway. Confused as to what a “Korea” theme would entail, I decided to go. It turned out to be an evening of applying Korean face masks, playing Korean music, and eating Bonchon chicken. To be frank, it was super weird. I wasn’t offended, per se, and I’m not saying that the organizers were to blame. But the experience impacted me because it was the moment I realized that certain token elements of Korean contemporary life had come to represent my country to non-Koreans. Like croissants to France and anime to Japan, I was witnessing — in real time — my country becoming a consumable aesthetic. When I was in primary school, I was the only Korean kid in my grade. Back then, in the mid-to-late 2000s, I met people who literally did not know where Korea was. (And believe it or not, some of these people were not students, but teachers.) But as I grew up, hallyu (the Korean wave) hit Asian countries — and Australia, with its close proximity to Asia, experienced the influence fairly quickly. I started finding out that some of my non-Korean friends loved K-pop. Suddenly, they wanted me to teach them Korean and answer their questions about Korean culture. By the time I got to college, the globalization of hallyu had well and truly cemented. I saw that Seoul was now romanticized as a travel destination or place of fantasy akin to Paris or London. It was very strange to see my peers play out fictional scenarios about having a “K-drama” life in Korea — a place that held not wonder, but reality, for me. As weird as it was to be a real-life Korean person amongst all this idealized garble, I also began to feel an increasingly panicked defensiveness. Because as much as I was getting sick of hallyu, I could sense that white society was getting even sicker of it. This resentment reared its head with K-pop, which had risen too quickly to allow for proper adjustment. Non-Korean people didn’t seem to know quite what to do with it. In many cases, the reaction of choice was confusion, but sometimes, the response was straight-up racism. In 2019, an Australian network played BTS’ success for racist laughs, just one of many instances of xenophobic speech attempting to mock, emasculate, and demean BTS. Overall, it seemed like K-pop was being shelved as an intensely niche and off-putting interest; something not quite understandable, not quite acceptable, not quite comfortable, for the rest of us. The conversation shifted, though, when “Parasite” had its historical sweep at the Oscars in 2020. Suddenly, people were lauding the film as one of the best and most revolutionary works of art in recent history. Of course, this kind of over-the-top praise also engendered genuinely ugly pushback. I sensed that a kind of litmus test over “Parasite” was emerging. Whether you had watched it, and whether you had thought it was as incredible as everyone else did, became a silent indication of not just your sense of artistic taste, but where you stood on race. The same happened yet again when “Squid Game” was released on Netflix. Post-“Parasite”, it felt like “Koreanness” was now something that had risen to, and was owned by, the mainstream. But at the same time, it was a precarious tightrope walk: K-culture could never actually be the mainstream because of fundamental racial lines of power. There was thus something tokenistic and false about the conversation — Korea felt like it had become a proxy in a larger, unspoken dialogue about race. In other words, it became messy, and it still remains messy today. One side of this triangle continues to shower hyperbolic praise on Korea as a producer of profound, never-before-seen art. The second side flocks to K-pop, Korean dramas, and Korean variety programs, irresponsibly romanticizing Korean culture, life, and people. And the last side is vocally critical of K-culture’s sudden and meteoric rise – sometimes for legitimate reasons, and other times out of sheer racism or jealousy. As different as these approaches are, all of them erase the very people central to this crazy triangle – Koreans themselves. And as much as cultural sharing is important and can be productive, it’s also undeniable that, for me and others like me, it’s all been a little exhausting. Because in the span of just fifteen to twenty years, Koreans who live overseas have swung from being ignored, fetishized, erased, commodified, and romanticized — all at the whim of white society’s attitude towards our country. When I reflect on these things, I can’t help but wish I could just watch my K-dramas in peace, the way I did as a kid. When the world’s ignorance about Korea was actually kind of a blessing, in that it provided me with a tranquil cultural vacuum. Although that vacuum can never exist again, I’m now looking forward to the day when the hype dies down, and Korean arts and culture reach a sense of ambivalent, neutral normalcy instead. I know it may take months, even years, to get to that point — but it’s going to be worth it. After all, I waited about a decade for the average person to be able to point to my country on a map. What’s a little more waiting? Lina H. R. Cho ’23 is a Comparative Literature concentrator in Dunster House. Her column “Bad Art” appears on alternate Mondays. Want to keep up with breaking news? Subscribe to our email newsletter. ",
    "title": "It’s a Weird Time to be Korean in America | Opinion | The Harvard Crimson",
    "url": "https://www.thecrimson.com/article/2022/11/7/cho-korean-in-america/"
}