{
    "text": "ISRAEL AT WAR - DAY 20 J.K. Rowling defended her decision to oppose a cultural boycott of Israel in a post on her Twitter account. “The sharing of art and literature across borders constitutes an immense power for good in this world,” Rowling wrote. The Harry Potter author was criticized by a number of her fans on social media after she joined 150 British artists in signing an open letter, published by The Guardian last week, espousing cultural engagement with the Jewish state over cultural boycott. On Monday, Rowling addressed “a number of readers asking for more information about why I am not joining a cultural boycott of Israel,” saying she had “never heard of a cultural boycott ending a bloody and prolonged conflict.” Rowling argued that the impact of a cultural boycott would be felt predominantly by ordinary Israelis and not by the Israeli government, which would be the source of any policy change. She also wrote that she has “deplored most of Mr Netanyahu’s actions in office,” referring to Israeli Prime Minister Benjamin Netanyahu. “At a time when the stigmatisation of religions and ethnicities seems to be on the rise, I believe strongly that cultural dialogue and collaboration is more important than ever before and that cultural boycotts are divisive, discriminatory and counter-productive,” Rowling wrote. On Tuesday, over 300 British academics signed a public letter pledging to boycott Israel, days after a star-studded list of over 150 British writers and artists published their letter urging the opposite. The new letter, signed by 343 scholars, appeared in a full-page ad in The Guardian. “As scholars associated with British universities, we are deeply disturbed by Israel’s illegal occupation of Palestinian land, the intolerable human rights violations that it inflicts on all sections of the Palestinian people, and its apparent determination to resist any feasible settlement,” the ad reads. The signers declared that they would not “accept invitations to visit Israeli academic institutions; act as referees in any of their processes; participate in conferences funded, organized or sponsored by them, or otherwise cooperate with them.” But academics wrote that they would, “however, continue to work with our Israeli colleagues in their individual capacities.” Among the signers are Tom Kibble, a prominent British theoretical physicist at Imperial College London; Timothy Shallice, a past director of the Institute of Cognitive Neuroscience at University College London, and Iain Borden, former head of the Bartlett School of Architecture. In response to the ad, the British Ambassador to Israel David Quarrey said that the British government was firmly opposed to boycott calls and that London was “deeply committed to promoting the UK’s academic and scientific ties with Israel, as part the flourishing partnership between the two countries.” “As David Cameron has said, the UK Government will never allow those who want to boycott Israel to shut down 60 years worth of vibrant exchange and partnership that does so much to make both our countries stronger,” Quarrey said in a statement to the press Monday. Ronnie Fraser, director of the Academic Friends of Israel organization, said in a statement that the number of signers represents less than a quarter of 1 percent of the 194,245 academics working in the United Kingdom, which he said constituted a “statistically insignificant minority.” Simon Johnson, chief executive of Britain’s Jewish Leadership Council, accused the signers of employing double standards. “These academics should realize that boycotts are divisive and discriminatory and do nothing to advance peace or improve the lives of Palestinians,” he wrote in a statement Monday. Last Thursday, over 150 writers and artists published their public letter in The Guardian opposing a cultural boycott of Israel and encouraging coexistence and dialogue between Israelis and Palestinians. The list included Harry Potter author Rowling and popular historians Simon Schama and Simon Sebag Montefiore, as well as 14 members of Parliament and former cabinet member Eric Pickles. In the letter, the signatories countered a letter published in the paper in February which called for a boycott of Israel. “Artists for Palestine UK” comprised over 700 musicians, actors, writers, sculptors, painters, designers, filmmakers and technicians who vowed to maintain their pledge “until Israel respects international law and ends its colonial oppression of the Palestinians.” “Culture for Coexistence,” on the other hand, on Thursday said that it seeks “to inform and encourage dialogue about Israel and the Palestinians in the wider cultural and creative community.” “While we may not all share the same views on the policies of the Israeli government, we all share a desire for peaceful coexistence,” the letter said. “Cultural boycotts singling out Israel are divisive and discriminatory, and will not further peace. Open dialogue and interaction promote greater understanding and mutual acceptance, and it is through such understanding and acceptance that movement can be made towards a resolution of the conflict,” the letter stated. The Guardian pointed out that the list is notably absent Palestinian names. “This is essentially a British initiative – we haven’t reached out to Israelis or Palestinians,” Loraine da Costa, head of the group, told the paper. “If there are Palestinians who’d like to be part of our initiative, we’d love to reach out to them.” Are you relying on The Times of Israel for accurate and timely coverage right now? If so, please join The Times of Israel Community. For as little as $6/month, you will: We’re really pleased that you’ve read  X Times of Israel articles in the past month. That’s why we started the Times of Israel eleven years ago - to provide discerning readers like you with must-read coverage of Israel and the Jewish world. So now we have a request. Unlike other news outlets, we haven’t put up a paywall. But as the journalism we do is costly, we invite readers for whom The Times of Israel has become important to help support our work by joining The Times of Israel Community. For as little as $6 a month you can help support our quality journalism while enjoying The Times of Israel AD-FREE, as well as accessing exclusive content available only to Times of Israel Community members. Thank you, David Horovitz, Founding Editor of The Times of Israel Those We Are Missing The hostages and victims whose fate is still unknown Today's Daily Briefing Day 19 of war – Israel’s increasingly frayed ties with the UN Those We Have Lost Stories of the civilians and soldiers who have fallen since Oct. 7 & Wartime Diaries Voices and testimonies of these devastating times ",
    "title": "J.K. Rowling defends opposition to cultural boycott of Israel - The Times of Israel",
    "datetime": "2015-10-27T16:00:20+00:00",
    "url": "https://www.timesofisrael.com/j-k-rowling-defends-opposition-to-cultural-boycott-of-israel/"
}