{
    "text": "T-shirt shows a mushroom cloud created by an atomic bomb with the words: ‘Patriotism OurHistory Liberation Korea’. A Japanese television station cancelled a performance by the wildly popular Korean boyband BTS after controversy erupted over a shirt worn by a member appearing to show the mushroom cloud created by an atomic bomb. The international superstars were to perform on TV Asahi on Friday, but the station abruptly cancelled the show after a photo of member Jimin wearing the shirt received lots of online exposure. “The T-shirt that one of the members wore made headlines and became controversial,” TV Asahi said in a statement. The station discussed the “intention” behind the shirt with the band’s record label and ultimately decided to “cancel their appearance”. TV Asahi spokesman Shinya Matsuki declined further comment. BTS issued their own statement on the argument, but gave no details on why the show had been postponed.       “We apologise for disappointing fans who were looking forward to this. BTS will continue their efforts to connect with fans on stage and also through music,” the group said on their website. The offending shirt featured the phrase “PATRIOTISM OURHISTORY LIBERATION KOREA” repeated multiple times alongside an image of an atomic bomb explosion and another of Koreans celebrating liberation. BTS member Jimin reportedly wore the shirt last year, on August 15, the day on which Koreans celebrate the end of Japanese occupation in 1945. Some Japanese fans of the band expressed disgust on Twitter that their show was cancelled over a T-shirt. Ties between Japan and South Korea continue to be soured by bitter disputes over history and territory stemming from Japan’s brutal 1910-1945 colonial rule over the peninsula. Last month, Tokyo reacted furiously after South Korea’s top court ordered a Japanese steel giant to compensate victims of wartime forced labour programmes. South Korean K-pop and movie stars are extremely popular in Japan. BTS are the leading lights of the K-Pop phenomenon and made history earlier this year by becoming the first K-Pop band to top the US album charts, a sign of the genre’s growing global appeal. BTS has collaborated with Japanese American DJ and musical artist Steve Aoki and has reached No 1 on the Billboard chart. Known for their boyish good looks, floppy haircuts and meticulously choreographed dance moves, the septet has become one of South Korea’s best-known and most lucrative musical exports.          Follow Al Jazeera English: ",
    "title": "Japan TV station cancels K-Pop stars BTS over atomic-bomb T-shirt | Music News | Al Jazeera",
    "url": "https://www.aljazeera.com/news/2018/11/9/japan-tv-station-cancels-k-pop-stars-bts-over-atomic-bomb-t-shirt"
}