{
    "text": "We use\n\t\t\t\t\t\t\t\tcookies\n\t\t\t\t\t\t\t\tand other data for a number of reasons, such as keeping FT Sites reliable and secure,\n\t\t\t\t\t\t\t\tpersonalising content and ads, providing social media features and to\n\t\t\t\t\t\t\t\tanalyse how our Sites are used.  Kana Inagaki, Tokyo Roula Khalaf, Editor of the FT, selects her favourite stories in this weekly newsletter. Japan’s salarymen are saying sayonara to the country’s culture of overwork — with the backing of Prime Minister Shinzo Abe. Long days in the office followed by long nights drinking with colleagues are as much a symbol of Japan as sushi or manga comics. But the culture has been blamed for several of the country’s ills, from its dearth of babies to lacklustre productivity, while a tight labour market is shifting the balance of power from companies to workers. So, in a break with the past, Japan Inc is making a virtue of what is normal practice elsewhere in the world. Trading house Itochu hopes to lure recent graduates with earlier starting and finishing times, while printer maker Ricoh\n is banning work after 8pm. Fast Retailing, operator of the Uniqlo clothing chain, is looking to introduce a four-hour day for employees who want a better work-life balance. “Even if working hours are short, we will pay more to the employee who produces a higher result. Long hours of work do not necessarily lead to higher performance,” said Tadashi Yanai, chief executive of Fast Retailing. Robot maker Fanuc, meanwhile, plans to woo recruits to its “inconvenient” headquarters at the foot of Mount Fuji by doubling the size of its gym, and building a new tennis court and a baseball field. The corporate efforts to improve conditions chime with Mr Abe’s campaign to shake up the country’s labour market, seen as a key plank of his growth agenda. And civil servants will also get a break. Employees in the health ministry will be banned from working after 10pm from October after an attempt to clear offices by switching off the lights failed. The government last week also submitted a bill making it mandatory for workers to take at least five days of paid holiday a year. More controversial is an element of the bill requiring high-income employees in certain sectors — such as banks and brokerages — to be paid according to performance rather than the number of hours worked. Proponents say it would enhance productivity, but critics say it would increase overtime, as it need no longer be paid for. In addition, past attempts in Japan to improve the working environment for employees have largely failed. Japan still has instances of karoshi — death by overwork — and many employees still feel guilty leaving the office early. Japanese employees only took up half their holiday entitlement last year, unlike the French and Germans who used their entire allowance, according to online travel agency Expedia. The only country that ranked lower than Japan is South Korea. The new policies signal an erosion of long-held social norms — such as company loyalty — in Japan and changing attitudes toward work, especially among young employees. With the notion of lifetime employment fading, one-in-three recent graduates from universities switches jobs within three years. For Nanami Kobayashi, a 21-year-old university student searching for a job, “the most important thing is a comfortable working environment”. That means an open culture where she can speak out, decent overtime pay and guarantees on the availability of paid holiday, she says. International Edition ",
    "title": "Japan Inc says sayonara to culture of long working hours",
    "datetime": "2015-04-07T09:23:37.000Z",
    "url": "https://www.ft.com/content/6749bab6-dc25-11e4-b70d-00144feab7de"
}