{
    "text": "Korea Ginseng Corporation (KGC) is stepping up marketing efforts for red ginseng products. The company has replaced the spokesmodel for “CheongKwanJang Everytime” with a new-generation figure and is diversifying cosmetics products loaded with red ginseng. The most popular red ginseng product made by KGC is CheongKwanJang Everytime. Therefore, it is only natural that the company strategically selects promotional models for the product. This product became the talk of the town and won huge popularity as famous Korean actor Song Jung-ki eats it in the smash-hit KBS television drama “Descendents of the Sun,” which gained immense popularity in Asia, particularly in China. In the TV series, Song Jung-ki takes CheongKwanJang Everytime. After this scene was aired, Everytime became the best-selling item among CheongKwanJang products. To keep up the momentum, KGC recently selected Jung Hae-in as the new model for ChengKwanJang Everytime.  Jung Hae-in, New Model for CheongKwanJang Everytime Jung is enjoying explosive popularity as he stars in the popular TV series, \"Pretty Elder Woman Who Often Buys Me Meals.\" In this TV drama, Jung frequently eats Everytime Red Ginseng. According to KGC, ChengKwanJang Everytime is winning popularity to such an extent that many tourists buy “Jung Hae-in Red Gingseng” at duty-free shops. Red ginseng is popular as a gift for parents in Korea. The main customers of red ginseng are senior citizens. However, in recent years, young consumers also buy red ginseng as easy-to-eat products have become available. KGC explained that those in their 20s to 40s now account for half of red ginseng consumers. Red ginseng is a super food that helps to maintain the balance of the body by enhancing immunity, removing fatigue and improving blood circulation. The product is recognized as a luxury health food not only in Korea but also in Asian countries and is loved by many consumers. \"Everytime is most popular among young people and company workers in Korea,\" a KGC official said. “Jung Hae-in’s bright and healthy image makes him a good fit for the product and will contribute to improving its sales.”  Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Jung Hae-in Endorses CheongKwanJang Everytime - Businesskorea",
    "datetime": "2018-04-25T14:37:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=21874"
}