{
    "text": "Check out Justin Thorne and Wonder Girls' Yubin's new \"The Heartbroken (Kpop Remix)\" video, featuring a slew of special guests, premiering exclusively on Billboard. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin Justin Thorne witnessed the power of K-pop fans after dropping a remix of his single “The Heartbroken” featuring one of Korea’s most famous rappers, Yubin of Wonder Girls. Within 24 hours of its release, the track flew to No. 1 on the real-time Billboard Twitter Emerging Artist chart and remained high all week. To the rising singer-songwriter and former NLT member, it was that passion inspired him to incorporate his enlist his fans to co-star in his new video. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t04/01/2015 Check out the duo’s new “The Heartbroken (K-pop Remix)” video, featuring a slew of special guests, premiering exclusively on Billboard:“What’s really cool about K-pop is the fan pandemonium,” says Thorne, who’s been a longtime fan of Korean pop and cites Wonder Girls, BIGBANG and G-Dragon as favorites. “They really love the culture of K-pop. One big thing that separates K-pop from just ‘pop’ is the way fans influence things and are so great. I thought an awesome way to do this would be to involve the fans.”  Using Fusic (the app which lets users record themselves singing karaoke or lip-syncing to tracks), Thorne added his supporters to the visual who were singing both to his words and Yubin’s raps. While his famous co-star wasn’t able to make it to the actual shoot — “a little bummed about that,” adds Thorne — working with the Wonder Girl has long been on his bucket list. Top 10 K-Pop Girl Groups You Need to Know “My manager at the time, Johnny Wright, was actually working with Wonder Girls and said, ‘They want to meet you,'” Thorne recalls. “We ran down to Korean town and had some Korean BBQ with them; they were really great. Ever since then I’ve been a big fan of K-pop and the Wonder Girls especially. I said for a couple of years, I really want to do a remix with Yubin at some point. I thought she was so great, she’s so beautiful. When I did this song, ‘The Heartbroken,’ I felt like I was influenced by K-pop. I was like, ‘This is the record to do this on.’ So we called her and sure enough she was gracious enough to get on it.” “I knew Justin wanted to work with me and, if I had an opportunity, I was up for working with him as well,” Yubin tells Billboard via translator. “It was really nice to see the reaction from the fans, how I came back and featured on Justin’s track. I wasn’t expecting a huge reaction, but I had a lot of fun working with him and in the future if there’s another chance to work with Justin, I’m more than glad to work with him…It’s been like two years since I’ve rapped in English, but I listen to a lot of hip-hop and R&B in English and I follow the trends, so it wasn’t too difficult.” Wonder Girls Cover Bruno Mars Live at Billboard Studios Thorne is currently preparing his “very personal” debut EP Faces for its April 21 release date and fans can expect a new video for his track “Heartless” around the same time. Along with touring, the singer is planning another EP this summer. You can download his K-pop remix for free via Justin’s SoundCloud.  Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "title": "Justin Thorne, Wonder Girls’ Yubin & Fans Team for ‘The Heatbreaker (K-Pop Remix)’ | Billboard – Billboard",
    "datetime": "2015-04-01T18:53:14+00:00",
    "url": "https://www.billboard.com/music/music-news/justin-thorne-the-heartbroken-kpop-remix-mv-wonder-girls-yubin-premiere-6517091/"
}