{
    "text": "Blade Runner: much of the film’s appeal lies in its themes of urban isolation and disillusion Few have made a mark in film and television in the past 35 years like that of the visionary sci-fi author Philip K Dick. A glance through his adapted works reveals a trove of science fiction on screen, including classics by Ridley Scott, Steven Spielberg and Paul Verhoeven in Blade Runner, Minority Report and Total Recall. The TV adaptation of his novel The Man in the High Castle returned for a second season on Amazon Video; Philip K Dick's Electric Dreams, an entire series of short films, began last month on Channel 4; and Blade Runner 2049, Denis Villeneuve's long-awaited sequel to Scott's film, has just arrived in cinemas. Whether space-faring memory thieves, android-hunting future cops or Nazi double agents, Dick’s characters resonate with audiences long after his death. Philip K Dick: the author shortly before his death, in March 1982. Photograph: Philippe Hupp/Gamma-Rapho via Getty Blade Runner 2049: Denis Villeneuve’s sequel to Ridley Scott’s 1982 film has just arrived in cinemas The official trailer for 'Blade Runner 2049', starring Ryan Gosling and Harrison Ford, has been released. Video: Warner Bros. So what explains the longevity of the stories of an author who struggled to make ends meet, and how have works so often set in a distant future managed to live on decades after that future came and went? One clue could be Dick’s creative breadth and prolificness: he published more than 40 novels and 121 short stories in a career that spanned just 30 years. For fans of Dick adaptations there's nowhere else to start but Do Androids Dream of Electric Sheep? This 1968 novel is not commonly regarded as the finest in Dick's catalogue, but its profile was considerably enhanced when it received a spectacular interpretation, and merciful name change, in Blade Runner. Blade Runner: Harrison Ford and Edward James Olmos in the 1982 film Much of the appeal of Scott’s film, long lauded for its masterly direction, cinematography and special effects, lies in its oppressively consistent tone, the clinging, paranoid sense of the sleazy and squalid, and its themes of urban isolation and disillusion. These aspects, pervasive in Dick’s work, help to ground the film beyond Scott’s visual wizardry and Vangelis’s still unparalleled score. Those themes in Dick's writing could be why so many fans rejoiced on hearing Villeneuve was to make Blade Runner 2049: the French-Canadian director knows how to tell the quieter, more internal moments of science-fiction stories, as he showed in Arrival, his beautifully affecting alien head-scratcher from 2016. The Man in the High Castle: Rufus Sewell in the Amazon series The Man in the High Castle, by contrast, is a relatively straightforward parallel history, depicting a United States after a Nazi victory in the second World War. Now living under the totalitarian occupation of the Axis powers, pockets of American resistance, samizdat style, share a forbidden novel written by the character who gives Dick's work its name. The forbidden novel depicts a world in which the Allies won the war, resulting in a pleasing reality loop as the reader gazes in on this novel within a novel to see the layers of meaning Dick weaves through the tale. The Man in the High Castle was a hit with critics and won the 1963 Hugo science-fiction award for best novel, the highest literary accolade any work of Dick's received. Despite this acclaim it was not adapted for the screen until 2015, when Amazon launched its quietly compelling series. Dick never lived to see one of his books turned into a major film or full-length television series, although he came tantalisingly close: Blade Runner was released just three months after his death, by when he had been in financial difficulty and mental ill health for some time. A Scanner Darkly: Keanu Reeves and Winona Ryder in Richard Linklater’s rotoscoped film Dick's work is full of paranoids, loners pushed to society's fringe, and shadowy agents intent on keeping from our hero some forbidden knowledge, which makes for compelling, suspenseful plots. Their nervy style could be down to the amphetamines that Dick took so many of (as detailed in his quasi-autobiographical A Scanner Darkly – adapted, in full rotoscope glory, by Richard Linklater in 2006); he was prone to paranoid episodes, metaphysical hallucinations and extravagantly labyrinthine cosmic epiphanies. Dick believed he had been shot with an 'intelligent pink beam of light', giving him secret religious knowledge, clairvoyance and a  bad case of time displacement In February 1974, while Dick was recovering from a barbiturate he had been given for dental surgery, a young woman came to his door with fresh medication from his pharmacy. He came to believe that her necklace shot him with an “intelligent pink beam of light”, giving him secret religious knowledge, a certain degree of clairvoyance and a particularly bad case of time displacement: Dick now intermittently found himself inhabiting the ancient past as Thomas, a first-century Christian fleeing persecution by “the black, prisonlike contours of hateful Rome”. He compiled an 8,000-page journal of handwritten notes in which he documented his visionary experiences, not least the degree to which he occupied multiple planes of existence as, variously, an award-winning novelist, gnostic superman and time-travelling heretic. Twice he reported being possessed by Hellenic spirits kind enough to teach him koine, or New Testament Greek. All of which contributed to his Valis trilogy, which fizz and thrum with allusions to Gnosticism, Greek philosophy, Jungian psychology and 1960s acid rock. Minority Report: Tom Cruise in Steven Spielberg’s 2002 film Strangely, given the counterculture messaging in his work, and the Kafkaesque authoritarians in The Minority Report, Adjustment Team and Flow My Tears, the Policeman Said, Dick was a government informant. More than once he contacted the authorities to accuse fellow writers and academics of being communists or enemy agents. In 1974 he told the FBI that the Polish author Stanislaw Lem was, in fact, the creation of a team of Soviet writers whose job was to spread anti-American propaganda, presumably via abstruse science fiction. The FBI didn’t respond to Dick’s claim, but it’s worth noting that, aside from being a real person, Lem was a devoted fan of his accuser. Six months later, unaware of Dick’s allegation, Lem wrote an essay dismissing all American science fiction authors but one: Dick alone was “a visionary among the charlatans”. Philip K Dick’s Electric Dreams: Timothy Spall in The Commuter, on Channel 4 Although much of Dick’s work bears hallmarks of contemporary science fiction – space travel, robots, titles apparently designed to deter readers – many of his stories have more quotidian themes, as Channel 4’s current series nicely reflects. After the first two of its 10 episodes touched on interplanetary voyages and telepathic rebellions, the third was about an employee at a station in the London commuter belt who realises that passengers are buying tickets to a nonexistent destination. When he follows them, Ed Jacobson, who is played in The Commuter to perfection by Timothy Spall, discovers Macon Heights, a town of bucolic splendour, sunny evenings and smiling strangers – features that Londoners may find more fanciful than light-speed shifts or memory implants. Ed faces a choice: remain under Macon Heights' syrupy influence or return to the drudgery and pain of the real world. The Commuter's neat premise quietly unfolds into heartbreaking drama. 'The Commuter' shows as well as any Dick adaptation the room for thought and contemplation within a genre  often limited to laser-gun battles in space corridors The story also showcases one of Dick’s calling cards: exploration of the messier aspects of identity and human nature, of reality and perception. It shows as well as any Dick adaptation yet filmed the room for thought and contemplation within a genre so often limited to laser-gun battles in space corridors. (The seven stories still to come, four of them not until early 2018, feature Steve Buscemi and Sidse Babett Knudsen; Bryan Cranston, Liam Cunningham and Ruth Bradley; Janelle Monáe; and Greg Kinnear and Mireille Enos, among others.) Tantalisingly, Michel Gondry has spent time beginning to adapt Ubik, one of Dick's most acclaimed novels. Although he seems to have abandoned the project for now, the French director has also said he hopes to try again. This could be a dream marriage of material and adapter, in service to an author who deserves to be interpreted at his ungainly, astonishing and mind-bending best. Blade Runner 2049 is on general release; Philip K Dick's Electric Dreams is on Channel 4 on Sunday at 9pm; The Man in the High Castle is on Amazon Video Alongside the five-star reviews and Oscar wins are some less notable adaptations of Dick’s works that you might have missed. Screamers (1995): Although Dick's stories usually have unwieldy titles that are toned down for the screen, the opposite happened when the relatively sober cold-war parable Second Variety was reinterpreted as the decidedly more lurid Screamers. Fairly preposterous, and ham handed, from start to finish, this Peter Weller vehicle about miners at war with artificially intelligent machines still has a good deal of tense thrills. Paycheck (2003): Emerging at the height of Affleckmania, this moribund John Woo thriller about memory-wiping corporate espionage is, ironically, instantly forgettable. Based on the 1953 short story of the same name, the film is mainly notable for being partly responsible for Affleck's subsequent Golden Raspberry for worst actor and for having not one but two of Woo's trademark Mexican stand-offs. Next (2007): Based so loosely on Dick's The Golden Man that it arguably doesn't qualify for this list, Lee Tamahori's film depicts a world in which Nicolas Cage can see two minutes into the future. It's so bewilderingly terrible that it may just be recommendable as a guilty pleasure. If you know your Cage schlock it's better than Knowing and Drive Angry but less watchable than Bangkok Dangerous and The Wicker Man. Next: Nicolas Cage in Lee Tamahori’s bewilderingly terrible film © 2023 The Irish Times DAC © 2023 The Irish Times DAC ",
    "title": "Just because you’re paranoid ... Philip K Dick’s troubled life – The Irish Times",
    "url": "https://www.irishtimes.com/culture/film/just-because-you-re-paranoid-philip-k-dick-s-troubled-life-1.3243976"
}