{
    "text": "Share this article Roger Tafa could only ever have opened his Rebel Soul records on K Rd. Photo / Michael Craig David Merritt - street poet, raconteur - is being stalked by gentrification. \"It has been chasing me for decades,\" he sighs. \"From Parnell, to Herne Bay, to Ponsonby. Now K Rd. I guess it's a sign of the times.\" Seated on a park bench just outside St Kevin's Arcade and surrounded by his distinctive handmade poetry books, Merritt has been waging a public war with Auckland Council about street trading. But on the day we meet he is delighted to announce they've reached a gentleman's agreement. \"You won't be able to come to my arrest on Friday, 'cos it has been cancelled,\" he says, laughing. He's a beacon for passersby. Some stop to give him tokens of esteem - mandarins, cake - and others snap cellphone photos of him. The stream of well-wishers is a microcosm of K Rd. From the older Maori bloke who hands him vintage books, to the young and possibly stoned woman who soliloquises about Merritt as the \"iconic face\" of the street, the vibrant community tableau unfolds. But although today's K Rd crowd is a rainbow of colourful individuality, Merritt is despondent about the street's future. \"The developers will move in, the luxury apartments will be built and the locals will be priced out. I can see this happening here.\" Many share these fears. The development of \"luxury\" apartment buildings, including an architect-designed 143-unit block on Howe St, will intensify the population in the area. And the opening of a K Rd Auckland Rail Link station will open the street to thousands. Those old enough remember when, in the 70s, a struggling musician might live above a shop selling saris alongside a vege shop selling taro and bananas. When department stores Rendells and George Courts closed their doors on late-night Thursdays, transvestites, having finished their Nana Mouskouri impersonations for the night, hopped on the bus to the Downtown bus station with workers and shoppers. No one thought anything of it. That was what made K Rd special. Now locals fear they will be driven out by rocketing rents and replaced by moneyed hipsters and the whitewash of upper middle-class. \"There is no doubt there will be massive changes to the street, and that K Rd will become a far more expensive place in the future,\" says Vernon Tava, a member of the Waitemata Local Board. \"The new City Rail Link station will bring in large numbers of people who couldn't access it easily before.\" Then there's St Kevin's Arcade. The celebrated cultural and shopping space was recently sold to ex-Shortland St star Paul Reid. The developer was described by one local as having made his money doing up villas, \"painting them beige\" and selling them for $1 million-plus. There are fears the same fate awaits the arcade. Reid didn't wish to be interviewed but James Kermode from Match Realty, who is letting space in the arcade, hopes to assuage some of the public's fears. \"Our vision for the arcade is for it to be a home for Auckland's creative talent, somewhere customers can engage with some-thing unique. \"It will become a destination where customers can experience a genuine engagement with authentic brands.\" He says the space has been neglected for years, and hopes the renovations will help restore it to its former glory. \"There has been under-investment in St Kevin's for a long time. This is an incredible public space that locals and the wider Auckland customer have been enjoying for years,\" he says. \"The integrity of our vision and our investment in this iconic building will preserve it for generations and this needs to be celebrated.\" But some are unconvinced. Merritt believes the arcade's facelift will inevitably lead to locals being edged out. \"It's all part of life in the modern Western world,\" he says. \"I bet that within a year there won't be a single second-hand store left in the arcade. They'll be replaced by Karen Walker, Kate Sylvester and luxury brands.\" If we are to believe a press release from Bayleys Real Estate, his predictions aren't off the mark. A development a few hundred metres away at 309 K Rd - the K Rd Food Workshop - will open its doors in the next few months. The press release does little to quell gentrification fears. \"The gradual conversion of once seedy Karangahape Rd from Auckland's red-light district into an entertainment, hospitality and rejuvenated retail area has been given a major boost - with plans unveiled for a new upmarket dining and food shopping hub.\" Leah LaHood, who oversaw the tenanting of Ponsonby Central, is working with a team of architects and designers to create a space that will house a range of food and beverage \"artisans\" who will cater to a more \"discerning\" K Rd crowd. \"The past three years have seen the growing gentrification of K Rd as the striptease clubs have one by one closed or moved on,\" says LaHood. \"And the pace of this gentrification is set to gather momentum. Two new substantial high-end apartment complexes in Hereford St are at the bow wave of this evolution.\" She says the new apartment complexes will attract \"purchasers who have a certain standard they are used to and we hope to cater for that\". She sees K Rd's seedier side as a unique branding opportunity. \"The sex industry involvement with K Rd is a bonus. K Rd's brand values are that it is a creative, urban, cool environment. \"The sex industry component keeps it cool and stops it getting over commercialised. We won't see un-cool mainstream brands positioning themselves in the street.\" But Renee Coulter, co-owner of popular restaurant Coco's Cantina, is concerned developers are trying to create a \"new Ponsonby\" on the street, and cash in on the \"cool factor\". \"Why are developers so intent on replicating things that we already have and aren't particularly special or unique?\" she asks. \"Ponsonby is great; it has some of our best restaurants and designers, but parts of Ponsonby are so boring and done.\" When she and her sister, Damaris, opened Coco's Cantina 5 years ago they were seen as part of the new wave of gentrification. But they have worked with locals and are now established members of the K Rd community. For Coulter and others a key attraction of the street is its diversity. Excellent eateries and dive bars exist cheek by jowl, forming an inclusive community of people from all cultural backgrounds and walks of life. \"The diversity of this street is a main feature of its appeal. Sure this comes with issues - security mightn't be as great, it might get a bit dirty, but we find ways around this.\" People feel they have no control over changes that will destroy this delicate balance and there needs to be a co-ordinated community response to such change. \"We need a forum for the community, the council, developers and tenants to get together and share their concerns and visions for the street. We need leadership and dialogue around the changes. \"The roots here go very, very deep, and people are prepared to fight. It would be so awful to see Dunkin' Donuts and Columbus Coffee take over the street,\" she says. As well as food and night life, music is a mainstay of K Rd's culture. Music stores up and down the country are closing as MP3 downloads replace CDs, but the street's distinctive cultural space offers opportunities for passionate record sellers. Roger Tafa is the owner of the most recent record store on the strip, Rebel Soul Music. He says K Rd was a natural fit. \"Once I decided to open a record store it was only ever going to be on K Rd. It was important to be close to established stores Real Groovy, Southbound and the newish Flying Out,\" he says. He, too, is concerned at the way the area is being marketed to a newer, more affluent market. \"It's a shame that the distinctive style and feel of K Rd is now an 'asset' for developers,\" he says. \"Those of us who love K Rd can only hope the culture of the street is preserved. Luxury apartments are really the antithesis of the street. But I believe it will be a while before it becomes 'Ponsonby-fied' - so we gotta make the most of it while we can.\" Along the road in the Ironbank building, shared office space Bizdojo represents the newer side of K Rd. Housing artists, web developers and other \"creatives\", it could easily be mistaken for a San Fran tech start-up. \"Nana craft\" artist Margaret Lewis is based here. She's also on the executive committee of the K Rd Business Association. Unlike some, she feels changes are a positive sign, and points to the recent K Rd Plan, which the council developed last year, as an indication of the street's future. \"The plan makes the commitment to preserve the diversity and social structure of the street. \"There was a lot of community consultation around the plan and I think we all share a responsibility to make sure that there is always a place for everyone on K Rd.\" The plan lays down the blueprint for dealing with changes on the street, such as increased foot traffic and the intensification. It states that the council and the local board are committed to maintaining the creative heart of the street. Vernon Tava has been instrumental in the development of the plan. He acknowledges change is inevitable but feels some apocalyptic predictions overstate the dangers faced by the street. \"Yes, it will change, but not in the dramatic way that some fear,\" he says. A long-term fan of K Rd and its built heritage, Tava says he and the local board are dedicated to maintaining the street's reputation as a creative hub. \"Council and the local business association are aware of the importance of the creative community,\" he says. \"We are committed to keeping the essence of the street alive by continuing to invest in this.\" At Bizdojo, community manager of the space Gilaad Amir is also philosophical about K Rd's future. He believes one factor will always give the street its darkly urban edge. \"No matter what happens, there will always be the massive cemetery at the top of K Rd,\" he says, referring to the 5.8ha graveyard and park at the Symonds St intersection. \"Whatever developments take place, this will always be there. Even the most boring new buildings won't detract from the 150-year-old tombstones at the entrance of the road.\" If you're after a Karangahape Rd icon, you need look no further than the Las Vegas Girl. The well-endowed - and historically protected - lady of the night has loomed large over the street since the 1970s, promising late-night punters full-nude reviews, discretion guaranteed. \"What happens in Vegas, stays in Vegas,\" laughs Adrian Churn. He has been the sound and light man here for 40 years and seen the street transform from the city's Wild West to a somewhat more genteel permutation. \"A few decades back you couldn't walk down the street without the threat of getting your head kicked in by punks or biker gangs,\" he says. \"Now there is less crime, fewer street workers, and it's a lot quieter.\" The strip club is expected to be taken over by Paul Franich and Lucien Law, Auckland hospitality figures behind the transformation of Britomart. The pair are understood to have signed a lease but their plans are being kept under wraps, fuelling fears another slice of seedy glamour will be replaced. But Churn is not too worried about talk of gentrification. He believes that come what may, K Rd will retain its soul. \"I've seen things come and go over the years, and sure, it's a lot quieter than it used to be,\" he says. \"But K Rd is still K Rd and it will always be K Rd. I don't feel that any vast changes will really occur here.\" Share this article ",
    "title": "K Rd's colour under threat of whitewash - NZ Herald",
    "url": "https://www.nzherald.co.nz/nz/k-rds-colour-under-threat-of-whitewash/T5RSYOPGV7D7WSUEK2Y72Q6EGI/"
}