{
    "text": "Christmas came a little early for the Elders of the K'omoks Nation in B.C. this year. Going door-to-door, community members delivered gift boxes filled with stockings, chocolates, coppers, silver bars and more than a dozen other presents to the homes of more than 40 Elders last week as a gesture of love, respect and appreciation to the generation of knowledge keepers who are still with them. \"It's just a way of honouring and showing respect to our Elders, and showing that we value them,\" said Nicole Rempel, elected chief of the coastal nation and president of the recently created K'omoks Elders Appreciation Society. This is the fourth year Rempel, her family and community members have come together to share gift boxes with their Elders. The group has been growing every year and has now expanded into a non-profit society, encouraging a number of local businesses and individuals across B.C's Comox Valley to participate. \"Really the society is just a go-between between the K'omoks Elders and businesses who are doing well in the traditional territories,\" said Jeremy Preece, Rempel's husband. \"It's really about creating institutions of giving and making it sustainable.\" Putting together the gift boxes for the K'omoks Elders is more than a few trips to the mall or making one-click shopping picks from Amazon. Rempel said planning and creating these boxes has been a year in the making. It's a Thursday evening in early December and the top floor of the K'omoks Nation band office has been transformed into Santa's workshop. People are wearing Christmas hats, sewing stockings and wrapping gifts, and in the kitchen two women are baking sheet after sheet of chocolate chip cookies. Community members have been putting in countless hours creating handmade gifts like reindeer ornaments and hats made from woven cedar, and intricately beaded lighter cases. Preece and another community member purchased a smelter and collected copper wire throughout the year so they could create one-pound copper Christmas trees to give away. \"Of course, copper is a significant symbol of wealth,\" said Rempel. Pamela Mitchell is spending the evening in the kitchen baking cookies with Elder Donna Mitchell who insists on helping even though she's meant to be on the receiving end of these gifts. \"It's what I do. I help where I can, all the time,\" she said. Donna Mitchell said the gift-giving is especially meaningful for those who don't have immediate family members home at Christmas. She said it's come to be a day that the Elders look forward to every year. \"They wait for it, they love it… It means a lot to them to have the group come into your house,\" she said. Katherine Frank is sitting at a table wrapping the cedar reindeer ornaments woven by Pamela Mitchell. She said it's fun to be able to hang out with community members to work on something that's such a good cause. \"I think it's a good thing because, for instance, my mother [went] to residential school in Port Alberni. A lot of the Elders had childhoods perhaps where they didn't receive a lot of gifts,\" she said. While this may be an event held around Christmas, Frank said the act of giving in this way is also very true to K'omoks culture. \"It's just fun to give things away. I love giving things away,\" she said. \"And I think in our culture and in our potlatch history that was one of the things we always tried to do — to be a community, work as a community and give as a community. It was our economic system of wealth and opportunity.\" Frank now sits on the board of the K'omoks Elders Appreciation Society and said much of her role with the group has been reaching out to local businesses for donations for this year's gift boxes. Several local businesses contributed money and items this year: Thrifty Foods, TimberWest, Beaver Meadow Farms and Natural Pastures. Rempel said in total more than a dozen community members have contributed to the boxes this year as well. She said she hopes the work they're doing can inspire other nations to follow suit. She said to her, Elders have been a great source of knowledge and wisdom. She said she increasingly turns to them now that she's in elected leadership. \"When I need that guidance, I look to them first. I hope our youth see that and value that and feel comfortable in always going to their Elders and showing that appreciation for their knowledge and their wisdom,\" she said.   Chantelle Bellrichard was a reporter with CBC Indigenous based in Vancouver. Email her at chantelle.bellrichard@cbc.ca or follow her on Twitter @pieglue. Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636 It is a priority for CBC to create products that are accessible to all in Canada including people with visual, hearing, motor and cognitive challenges. Closed Captioning and Described Video is available for many CBC shows offered on CBC Gem.  ",
    "title": "K'omoks Elders Appreciation Society celebrates culture of giving as a community | CBC News",
    "url": "https://www.cbc.ca/news/indigenous/k-omoks-elders-gift-project-1.4952881"
}