{
    "text": "American schools have entered the Age of Post-Literacy. Books, long idealized as foundational shapers of intellect, no longer mold young people’s minds. While continuing to tout their merits, educators marginalize books and have not come to grips with the book’s declining role in society. Over the last few years, my high school students’ facility for print culture has atrophied markedly. They also exhibit cognitive blind spots for narratives and higher meanings. Their educations even contribute to post-literacy. I see symptoms of post-literacy vividly when I ask students to write research papers. For years, I had confidence in my ability to coach students’ research. I developed a surefire method: Let kids pursue their own interests, ask them lots of questions, proofread their drafts, give them plenty of written feedback, and reduce their anxiety by holding back on a grade until they have a strong product. It worked. It no longer does. It has become clear that my students lack cultural memory for navigating books and libraries. Neither lazy nor stupid, these kids exemplify an epistemological shift. The novelist Philip Roth described post-literacy concisely in a 2012 interview, explaining his retirement from writing. “The readership is dying out,” he told The New York Times. “I’ve been saying it for 15 years. I said the screen will kill the reader, and it has. The movie screen in the beginning, the television screen, and now the coup de grace, the computer screen.”  Pundits engage in polarized debate predicting alternately that electronic media will hasten a “dark age” of inattentiveness or usher in a renaissance of creativity. Neither position addresses my classroom dilemmas. My students’ research efforts complicate those stark assertions about technology and learning. Watching them engage online, I see kids keyboarding frantically between search engines and websites, but their choice of keywords is rudimentary.  A student interested in the privatization of the U.S. military begins searching with “mercenaries.” He skims a dozen websites but finds most irrelevant. He refines at my suggestion, adding qualifiers such as “U.S. military, private contractors,” then modifies again with “Iraq,” “Afghanistan,” and “Blackwater\"—the private military contractor. Awash in data, much of it poor-quality, he spends hours sifting while resisting my suggestions to visit his town library and search there using similar keywords. This 12th grader does not lack patience, but he is library-averse. It is difficult to convince kids that most subjects they research have been written about in books. When they show me Wikipedia entries on their topics of choice, I ask them to raid the entry’s bibliography. They resist and return to the Internet. To take students to a library is to encounter an anachronism. School libraries reflect post-literacy even in name. Many are rebranded as “media centers” or “active learning” facilities. Space once devoted to books has given way to computers, “literacy” activities, or “distance learning.” Book downsizing has left many secondary school libraries without a critical mass necessary for basic research. Our field trips to a town or college library reveal widespread unfamiliarity with print culture. Students no longer know how to follow the Dewey Decimal System. Because they make poor keyword choices, kids miss useful books. Recently, an 11th grader told me during a visit to the town library that “there are no books here on Frederick Douglass.” (He misspelled “Douglass” in the search engine.) Another junior claimed “there are no books on the imprisonment of Japanese-Americans during World War Two.” He searched only for the keywords: “World War Two.” A 12th grader tried to convince me that “since I’m writing about the Internet’s effects on kids, all the relevant sources are online.” Once they find the books, students usually have to apply for a library card in order to check them out. When I hand high schools kids a book for research, they weigh its heft and ask, “You don’t expect me to read this whole thing, do you?” I must show them how to spot an argument in an introduction, how chapter titles offer clues for relevant subject matter, and how an index gives page references for topics listed. A lack of familiarity with books is also suggested by the way kids casually refer to a monograph or biography as a “novel.”  Synthesizing information into original, compelling arguments has always been challenging for young people, but students today are more likely to stumble at this task than when I started teaching 29 years ago. Teachers contribute to intellectual fragmentation by overexuberance for tools such as PowerPoint. In 2002, academic statistician Edward R. Tufte criticized PowerPoint for distorting and manipulating thinking. He claimed that bulleted phrases on a PowerPoint slide make poor substitutes for “sentences with subjects and verbs,” cobbled into narratives. PowerPoint promotes a “faux analytical” method, Tufte asserted. Neither Tufte’s admonition nor high-profile cases of misinformation delivered via PowerPoint (consider U.S. Secretary of State Colin Powell’s 2003 United Nations presentation “proving” Iraq possessed weapons of mass destruction) have inhibited educators’ use of that technology, or other forms employed merely because they exist. I knew a teacher who had students “tweet” messages between Gatsby and Daisy: a creative use of Twitter, but also dramatically at odds with the imaginative landscape and form of F. Scott Fitzgerald’s novels. Using the same style as PowerPoint, scoring rubrics similarly contribute to constrained thinking. Quantifying intellectual endeavor, rubrics rely on adjective-heavy phrases disconnected from narratives about what makes good scholarship. Teachers use rubrics to convey an illusion of precision in grading. Doing so, we wrongly suggest that academics can be boiled down to mechanistic formulae. In a post-literate world, the late historian Eric Hobsbawm suggested, the dominant feelings are of information overload and disconnectedness. A pervasive sense exists that too much is happening too fast to understand. Hobsbawm described this “eerie” sensation in the early 1990s during the Internet’s infancy. He concluded that “most young men and women at the century’s end grow up in a sort of permanent present lacking any organic relation to the public past of the times they live in.” I believe such disconnect and overwhelm form a byproduct of the turn away from books. Among counterarguments hailing the information age as a revolution in personal enlightenment, the education researcher Sugata Mitra articulates perhaps the most sweeping variant. In a TED talk, Mitra discusses providing students with technology (laptops, the Internet, “the cloud”) to “teach themselves.” He sees schools as props for a “bureaucratic administrative machine,” itself a byproduct of Western imperialism. I applaud Mitra’s boldness and am certainly no fan of imperialism. Yet there exists troubling, long-term evidence showing that young people who most readily access these new technologies become less independent. Today’s young Americans are, in the words of Steven Mintz, a historian of the family and children, “isolate[d] and juvenilize[d] ... more than ever.” Post-literate schooling does isolate students from narrative structures conveying meaning. It also juvenilizes via technologies that oversimplify and denigrate analysis. Such tools contribute to overwhelm and disconnect: Kids drown in data bereft of higher logic. I have responded by assigning more books, selected for interest. I coach students away from taking bulleted, fragmented notes and insist they articulate higher meanings from our subject matter. I invite authors to the classroom to discuss their work. I bring boxes of books from my home and town libraries to assist research. I challenge kids’ use of technology and sweat my own. Still, I remain unsure whether such tactics do anything even to delay a post-literate future beyond my control.  A version of this article appeared in the April 02, 2014 edition of Education Week as Education in a Post-Literate Age ",
    "title": "K-12 Education in a Post-Literate Age (Opinion)",
    "datetime": "2014-03-31T16:08:44",
    "url": "https://www.edweek.org/teaching-learning/opinion-k-12-education-in-a-post-literate-age/2014/03"
}