{
    "text": "Google Translate Disclaimer A number of pages on the Government of Saskatchewan's website have been professionally translated in French. These translations are identified by a yellow box in the right or left rail that resembles the link below. The home page for French-language content on this site can be found at: Renseignements en Français Where an official translation is not available, Google™ Translate can be used. Google™ Translate is a free online language translation service that can translate text and web pages into different languages. Translations are made available to increase access to Government of Saskatchewan content for populations whose first language is not English. Software-based translations do not approach the fluency of a native speaker or possess the skill of a professional translator. The translation should not be considered exact, and may include incorrect or offensive language. The Government of Saskatchewan does not warrant the accuracy, reliability or timeliness of any information translated by this system. Some files or items cannot be translated, including graphs, photos and other file formats such as portable document formats (PDFs). Any person or entities that rely on information obtained from the system does so at his or her own risk. Government of Saskatchewan is not responsible for any damage or issues that may possibly result from using translated website content. If you have any questions about Google™ Translate, please visit:  Google™ Translate FAQs. Find services and information for Saskatchewan residents and visitors. Find services and information for doing business in Saskatchewan. Find how the Government of Saskatchewan governs and serves the province.  In Saskatchewan, Kindergarten to Grade 12 (K-12) education is a shared responsibility between the Ministry of Education, under the authority of the Minister of Education, and locally elected boards of education. The Ministry of Education has the responsibility to: The elected local school boards have responsibility to manage and administer the Kindergarten to Grade 12 school system in their school division, within the regulations and guidelines set out by the Ministry of Education. There are 27 school divisions in Saskatchewan including: Find more information and documents related to school division funding, provincial K-12 enrolment reports, and other school and school division statistics. Colour map of all school divisions in the province. Printable map of school divisions in black and white. We need your feedback to improve saskatchewan.ca. Help us improve ",
    "title": "K-12 School Divisions in Saskatchewan | PreK-12 Education, Early Learning and Schools | Government of Saskatchewan",
    "url": "https://www.saskatchewan.ca/residents/education-and-learning/prek-12-education-early-learning-and-schools/k-12-school-divisions-in-saskatchewan"
}