{
    "text": "Today's print edition Home Delivery As summer approaches with the misty other-worldliness of Japan's rainy season, Tokyo's K-Ballet graces the stage in June with a revival of the hauntingly romantic masterpiece \"Giselle.\" Six different ballerinas will perform the lead role as the production synthesizes K-Ballet's changing image from a company that showcases its virtuoso artistic director and star, Tetsuya Kumakawa to a company committed to nurturing and improving its dancers. Written in 1841 for Italy's first great ballerina, Carlotta Grisi, the title role of Giselle remains one of the most coveted roles in ballet today. An innocent peasant girl dies after her aristocratic lover's betrayal. Awakened from the dead to join the wilis, a group of forest spirits dedicated to avenging unrequited love, the ghostly Giselle must save her former lover from their retribution. The role demands incredible technical prowess and dramatic versatility. Three ballerinas mark their debut as Giselle: Shiori Asakawa, Satoko Hinata and Kayo Sasabe. Notable veteran Yuko Arai also brings her experience to the stage. Kumakawa will partner the novice ballerinas as Albrecht, while Arai will take the stage opposite Yusuke Osozawa and Shuntaro Miyao, two rising young principal soloists. Assistant director Stuart Cassidy, always a crowd favorite with his dramatic characterizations, reprises his role for the company as Hilarion, Giselle's spurned suitor driven to a fatal, exhausting dance by the wilis. One newcomer to look out for is Kayo Sasabe in the lead for nine of the 15 productions partnered by Kumakawa. Sasabe joined the company last year and Giselle will mark her first significant debut in a lead role. In a time of both misinformation and too much information, quality journalism is more crucial than ever.By subscribing, you can help us get the story right. ",
    "title": " K-ballet brings back 'Giselle' and introduces new leads - The Japan Times ",
    "datetime": "2013-05-30T00:02:32+09:00",
    "url": "https://www.japantimes.co.jp/culture/2013/05/30/stage/k-ballet-brings-back-giselle-and-introduces-new-leads/"
}