{
    "text": "HOT TOPICS Korean-language test to be held up to 8 times abroad in 2024 Korean Red Cross builds temp homes for Turkish quake victims Food Clothing and Fashion Traditional Decorative Knots, Maedeup: Donated Works by Lee Bu-ja Jinju Namgang Yudeung Festival K-Culture Korean culture is taking the world by storm. Spanning popular culture such as pop music, TV dramas and films, Hallyu (Korean Wave) is expanding its influence in sectors like literature and performing arts. Korean food is no exception. From dishes served at Buddhist temples to kimchi, bulgogi (marinated grilled beef) and bibimbap (bowl of rice mixed with meat and assorted vegetables), Korean cuisine is loved by people around the world.\n\r\nDespite the global fervor for many aspects of Korean culture, alcohol is relatively lacking in recognition. Booze is a must in a setting with good music, dance and food. So why is Korean alcohol relatively unknown to most outside of Korea?\n\r\nThe Korea.net series \"Hidden charms of Korea – Sool\" explores the nation's alcoholic beverages and culture and the stories behind them.\nSoju, which is widely known as coming in a green bottle as shown in numerous Korean films and TV series, and makgeolli (milky rice wine) comprise a small sample of the wide diversity of Korean alcohol. In the past, Koreans made alcohol in creative ways with ingredients depending on the weather and region. This series is thus an extensive look at the largely unknown appeal of Korean alcohol to be shared with the world. My review of KOCIS’ ‘Hidden Charms of Korea: SOOL’ By Honorary Reporter Preeti Rawat from India\r\nPhotos by Korean Culture and Information Service (KOCIS)\r\n\r\n \r\nKOCIS’ newly released English-language guide, \"Hidden Charms ... Feb 22,2023 The today and tomorrow of Korean alcoholic beverages By Ryoo InsuDirector of Korean Liquor Research Lab\r\n\r\nThe global alcoholic beverage market is rapidly changing. A look at common trends shows that the first is the rise i... Dec 08,2022 Exhaustive guide for those curious about Korean alcoholic beverages By Lee Ji Min \r\nDirector of traditional sool platform Daedongyeojudo \r\n\r\nTraditional alcoholic beverages are taking off on the mainstream booze market in Korea. Made from... Dec 01,2022 My sool obsession By Dustin Wessa Korean liquor sommelier\r\n\r\n I moved to Seoul in 2005 to study Korean history, and hopefully, earn a degree. The adventure saw many late nights fueled by g... Nov 24,2022 From boilermakers to luxury drinks, 4 experts discuss Korean booze culture From left are Won Spirits CEO Jay Park, Damhwa CEO Lee Jaeook, Korea Studio Sool Director Park Rokdam and Won Spirits Chief Communications Officer Kim Hee-jun.\r\n\r\nBy Min ... Nov 17,2022 Traditional Korean booze shines via 5 tastes, beautiful scents By Park Rok-dam\r\nMaster of Korean traditional alcoholic beverages\r\n\r\nTraditional Korean alcoholic beverages have five tastes: sweet, sour, bitter, astringent and spicy. U... Nov 10,2022 Traditional booze wins over seven Honorary Reporters at tasting session By Hong Kilju and Aisylu Akhmetzianova\r\nPhotos = Kim Sunjoo\r\nVideo = Lee Jun Young\r\n\r\nThe silky and milky makgeolli (rice wine), dark yellow yakju (clear liquor) and crys... Oct 27,2022 Pairing Korean food with booze (2): soju and beer Yoon Sook-ja, director of the Institute of Traditional Korean Food, recommends pairing dwaeji bulgogi (marinated grilled pork) with soju (clear liquor).\r\n\r\n... Oct 20,2022 Pairing Korean food with booze (I): makgeolli and raspberry wine Yoon Sook-ja, director of the Institute of Traditional Korean Food, recommends pairing nokdujeon (pancakes made with mung bean, pork and kimchi) with makgeolli (milky ric... Oct 13,2022 A warm and familiar feeling: drinking makgeolli in Korea By Rodrigo Coronel\r\nNicaraguan Ambassador to Korea\r\n\r\n\r\nDear reader, I begin this tale not as a reflection or even less an in-depth analysis by a leading expert, but as a... Oct 06,2022 ",
    "title": "K-Culture: Korea.net : The official website of the Republic of Korea",
    "url": "https://www.korea.net/Government/Current-Affairs/Korean-Wave?affairId=2338"
}