{
    "text": "NCT DREAM and STAYC perform at the \"THE-K Concert\" on Oct 7 at the Olympic Stadium SEOUL, South Korea, Sept. 22, 2022 /PRNewswire/ -- The Ministry of Culture, Sports and Tourism (Minister PARK Bo Gyoon, MCST) together with the Korean Foundation for International Cultural Exchange (President JUNG Kil-hwa, KOFICE) will host the \"K-Culture Festival 2022\" in Gwanghwamun Square and Jamsil Sports Complex from September 30 (Fri) to October 8 (Sat), where there is everything about Korean culture (Hallyu). This festival will capture the hearts of all on site visitors and people around the world joining in via the online live broadcast on the official YouTube channel (K-Culture Festival). 'K-Culture Festival 2022’poster Under the slogan \"INTO THE-K,\" the festival has prepared a variety of programs to help people around the world explore the Hallyu planet \"THE-K,\" which contains all the charms of Korean culture. In addition to the globally popular K-Drama, visitors will enjoy diverse music, including K-pop, indie, and hip-hop, as well as parades that contain the essence of Korean culture. The festival will also be a venue for promoting K-Culture related industries such as Korean food, beauty products and services. First, \"K-Culture Festival Eve\" will be held at Heungnyemun Square in Gyeongbokgung Palace on September 30 (Fri) from 7pm. Under the theme of \"Korean Culture, Blooming the Future in the Palace,\" the event will showcase the splendid elements of Korean culture that coordinate the past and present, including traditional Korean ink croquis and classical Korean performances. \"THE-K DRAMA Concert\", to be held at Gwanghwamun Square on October 1 (Sat), will first hold a Drama Gala Show with the leading Hallyu dramas such as , ,  and . Along with the Drama Gala Show, KYUHYUN, Kim Na-young, and Paul Kim will perfom on stage with representative drama music that remained in the heart of fans. Fans will also see K-pop stages up close on October 7th (Fri) when popular K-pop singers, including NCT DREAM, STAYC and BLANK2Y perform at the \"THE-K Concert\" held at the Olympic Stadium in Jamsil Sports Complex. In particular, \"THE-K Billboard Awards\" will be jointly held with the \"Billboard\", an American music and entertainment magazine, highlighting the achievements of K-pop singers who were on \"Billboard Chart\" for their attention-grabbing performances around the world. There is also a venue set up for K-Culture fans to communicate and exchange cultural experiences. From October 2 (Sun) to the 8 (Sat), \"THE-K Fan Fair\" will be held at Gwanghwamun Square and Jamsil Sports Complex Auxiliary Stadium for fans to experience Korean food, fashion, and characters. Popular K-pop singers like The Boyz for THE-K Talk & Stage program will add more fan-friendly festivities. \"THE-K Stage\" will be staged from October 2(Sun) to 8(Sat) by introducing hip-hop, jazz, and DJing at Gwanghwamun Square and Jamsil Sports Complex. PENTAGON, Brave Girls, VIVIZ, CIX, JK Kim Dong-wook, Jungin, Sunwoojunga, 10cm, Cheese, Stella Jang, Louis, U Sung-eun, The Quiett, Raiden, and Ginjo will be on stage. Related government organizations and other Hallyu-related industries will also be participating along with agencies affiliated with the MCST, such as the Korea Tourism Organization, Korea Creative Content Agency, King Sejong Institute Foundation, Korea Craft and Design Foundation. The Korea Agro-Fisheries & and Food Trade Corp., Korean Food Promotion Institute, and Small and Medium Business Distribution Center will attend to promote Hallyu-related industries such as agri-food, Korean food, beauty, and fashion. On October 8 (Sat), on the last day of the festival, the \"THE-K Parade\" highlighting overall Korean culture will start from Jongno 5-ga and continue to Gwanghwamun Square. The festival expects to offer locals as well as Hallyu fans around the world a meaningful experience where they become one with Korean culture as they explore the Hallyu planet \"THE-K.\" More information about this festival, visitors can visit the official website (kculturefestival.kr). MCST official said, \"The 3rd Korean Cultural Festival this year will afford fans and artists from all over the world the opportunity to enjoy everything about K-Culture (Hallyu) with drama and K-pop as the two main themes.\" The official added, \"MCST will continue to hold global Hallyu festivals where visitors can experience the essence of popular and traditional Korean culture and related industries to strengthen the spread of Hallyu.\" ",
    "title": "\"K-Culture Festival 2022\"  in Seoul from Sept 30 to Oct 8 - PR Newswire APAC",
    "url": "https://en.prnasia.com/releases/apac/-k-culture-festival-2022-in-seoul-from-sept-30-to-oct-8-376568.shtml"
}