{
    "text": "Subscribe Now! Get features like In the spring of 2017, a South Korean television drama – Descendants of the Sun (DOTS) – was aired on the Zee Zindagi channel. It was not an isolated occurrence, but part of a broader global phenomenon called Hallyu or the Korean wave. While India has been left largely untouched by this trend, it’s other Asian countries such as China, Myanmar, Japan, Philippines, Malaysia and Indonesia that have come under the charm of K-dramas (and Hallyu, at large). To define Hallyu, it’s a unique form of soft culture exported from South Korea. Since the late 1990s, there has been a meteoric rise in the popularity of Korean music, dramas and movies across Asia. The South Korean government vigorously supports the diffusion of this wave, which has now reached the shores of Europe, US, Australia and the Middle East. The popularity of DOTS in China was such that its government even issued a warning that stated: “Watching Korean dramas could be dangerous, and may even lead to legal troubles”. On Indian shores, such a manic reception for a foreign television drama was unheard of. The Hindi television industry already has a strong foothold in the country, coupled with dedicated audience bases of regional TV channels and a sizeable viewership of American and British television content. However, the airing of DOTS has now brought about a small yet seminal group of Korean drama enthusiasts. “When we decided to introduce South Korean shows like Descendants of The Sun and Boys Over Flowers on our platform, it was done as a litmus test of sorts to understand how engaged our audience would be with the content – and how they would connect with the actors onscreen. We found overwhelming acceptance. The video views for these shows ran into millions,” said Archana Anand, spokesperson of OZEE, an online platform of Zee Networks. Although India is often considered a “Hallyu wasteland”, the recent launch of a K-pop show on a premier Indian music channel indicates that the winds are changing. On September 16, VH1 India launched K-Popp’d – a Saturday feature that elusively plays K-pop music. VH1 content head Hashim D’Souza said the channel’s decision to start the segment was largely due to Twitter requests from fans of Korean popular music. The channel featured Psy when his Gangam Style became a viral sensation in 2012, but it wasn’t until July 2017 that it unleashed an entire plethora of artistes on VH1 India. Last December, the channel launched a segment called “Digital Blocks” on Twitter, where they asked viewers to send in their requests based on hashtags like #Vh1mancrushmonday and #Vh1teensday. “During this time, we noticed fan armies on our social media platforms requesting for one band in particular – BTS. To be honest, we didn’t know who BTS were. We looked it up and realised that they were a K-pop band. While we knew K-pop was big in Asia and growing across the world, we were pleasantly surprised to find that we were getting requests for it in India,” said D’Souza. The requests didn’t stop with BTS. “Soon, they were asking EXO, EXID and other artist videos – and it only kept growing over time. We realised that this was a very passionate and persistent fan base that will not relent until we air the video,” the VH1 content head said. While television channels were surprised to discover a new viewer base, a little exploration into the matter revealed this wasn’t India’s first encounter with Hallyu. “Korean dramas were shown on Firangi channel in 2008. The serials Full House and Hwang Jini were aired that year,” recalled Orlinda Fernandes, president of the India-Korea Friends Mumbai, a Korean culture fan club. Stating that Korean dramas used to appear on Indian television even before Descendants of the Sun, Fernandes recalled how Reliance Big TV offered KBS World – a South Korean channel – to its subscribers in 2009-2010. Way back in 2014, a Tamil TV channel – Puthuyugam TV – also started airing a K-serial block that featured dubbed Korean dramas. It aired some immensely popular Korean romantic dramas such as Boys over Flowers, Coffee Prince, The Heirs, My Love from the Stars and Playful Kiss. While the availability of Korean content on Indian television channels is marginal, the free flow of Hallyu material online has steadily created a robust community of avid K-drama fans in India. The Dorama Club in Chennai, which boasts of around 850 members, is one such group that brings together Korean drama fan enthusiasts. The club organises quizzes on Hallyu, K-pop and K-pop dance competitions, and imparts free Korean lessons. “The club was originally launched in 2008 as an Asian Dorama club (aimed at tutoring people in Chinese, Japanese and Korean), but when the Hallyu wave picked up around 2011 – 2012, the club started shifting its focus on Korean dramas, K-pop, Korean culture and language. We also get support from the consul general of the Republic of Korea in Chennai and other establishments,” said club founder Sanjay Ramjhi. Meanwhile, the Korean Cultural Centre in India (KCCI) – a wing of the south Korean embassy – has been diligently mapping the popularity of K-dramas in the country. Last year, it found that Korean period drama Hur Jun was broadcast on DD Bharti from January 13, 2014, to October 29, 2014, to receive viewer ratings of 34,164,000. Fast-forward to 2017, the total ratings for Descendants of the Sun –aired from February 8 to March 1 – jumped to 55,920,000. Archana Anand attributes the rise of Korean shows on the popularity index to “the awareness generated by some Bollywood films in recent times”. However, northeast India’s tryst with the Hallyu wave is almost over a decade old. Local cable networks have been airing South Korean channels KBS World and Arirang in Nagaland and Manipur since the early 2000s. The two channels telecast Korean dramas, cookery shows, K-pop music and a host of variety programmes. In neighbouring Mizoram, K-dramas dubbed in Mizo are immensely popular. While the popularity of Hallyu is rising with every passing year, it remains to be seen whether the K-wave will pick up more strength or finally ebb away. Monami Gogoi works as a content producer at Hindustan Times. She works with the online team and writes on current events. ...view detail   ",
    "title": "K-drama to K-pop: Is India finally warming up to the Korean wave? - Hindustan Times",
    "datetime": "2017-10-24T12:37:41+05:30",
    "url": "https://www.hindustantimes.com/entertainment/k-drama-to-k-pop-is-india-finally-warming-up-to-the-korean-wave/story-OEiSTa5A6DZLgXL4aKG4JM.html"
}