{
    "text": "Published daily by the\n      \nLowy Institute How K-pop and K-culture pose a threat to Kim Jong-un’s rule In recent months, North Korea’s leader Kim Jong-un has raged against the cultural influence of South Korea, calling K-pop a “vicious cancer” permeating North Korean society. This push against South Korean popular culture is nothing new for the regime. In fact, K-dramas and K-pop have long been used as a type of soft power to threaten the North’s legitimacy and create cracks in the rigid system. They offer North Koreans a glimpse into a life under capitalism, with freedoms ranging from wild hairstyles to outlandish fashion choices. In December last year, North Korea passed a law known as the “Law on the Elimination of Reactionary Thought and Culture”. This law aims to clamp down on content such as movies, serialised dramas and music from outside the state, particularly from South Korea. Those caught in possession of such material can face five to fifteen years in prison, while those distributing the content can be sentenced to life imprisonment or death. In April this year, a man is believed to have been publicly executed by firing squad in front of approximately 500 people for illegally selling CDs and USBs containing South Korean video and music content. But while his death was a clear warning, Kim Jong-un’s suppression attempts may be too late. In 2019, a survey of 200 North Korean defectors reported that 91 per cent of them had watched South Korean and foreign videos while in North Korea. In 2016, as a response to nuclear tests from the North, K-pop was blasted loud and clear in a show of defiance. Any K-drama fan will be familiar with the term “oppa”, a word that means older brother, but that has become a romantic term of endearment for an older man. According to documents received by Asia Press, Kim Jong-un considers terms such as oppa to be South Korean “puppet words”. The prevalence of these types of words among North Koreans, particularly the youth, indicates a growing South Korean cultural influence known as “Hallyu” or “Korean Wave”. This influence isn’t lost on South Koreans. In Crash Landing on You, a popular 2019 K-drama about a wealthy South Korean woman stranded in North Korea, many characters are well versed on South Korean popular culture. A soldier is relied on as an expert on South Korean affairs due to his secret enjoyment of K-dramas. A teenager in a hospital admits that she’s the biggest BTS (South Korea’s most famous boy band) fan in Pyongyang. And a vendor in a marketplace sells K-beauty products. In the demilitarised zone between the two Koreas, South Korea has installed loudspeakers that can be used to blast propaganda into North Korea. In 2016, as a response to nuclear tests from the North, K-pop was blasted loud and clear in a show of defiance. K-pop hits such as Big Bang’s Bang Bang Bang were chosen as a way to irritate the regime, boast about the South’s culture and modernisation, and pique the interest of any North Koreans listening. Kim Jong-un himself has certainly listened to and enjoyed K-pop. In 2018, when conflict between the two nations was relatively subdued, a concert was held in Pyongyang to promote peace. The concert, “Spring is Coming”, featured 11 South Korean artists, including popular girl group Red Velvet. According to North Korea’s Central News Agency, Kim Jong-un was “deeply moved” by the performance and by watching others from the North enjoy it, too. “We should hold culture and art performances frequently,” he told South Korean performers. He thanked Red Velvet for their “gift to Pyongyang’s citizens”. With the border closed to China, North Korea has lost its biggest trading partner and the economy has been crippled. However, party officials have been quick to put a spin on these success stories to undermine the influence of the South’s culture in the North. In 2019, the South Korean film Parasite made history by winning an Academy Award for Best Picture. In 2021, BTS became the first ever K-pop band to be nominated for a Grammy. Yet North Korean press described Parasite as a way to help people see that “the capitalist system is a rotten, sick society” and BTS’ achievements were labelled as the result of working under slave-like conditions. If North Koreans are consuming South Korean media, then at least there’s propaganda to discredit the South’s legitimacy. So, what sparked the change in rhetoric? The pandemic has forced North Korea to become more isolated, and as a result, Kim Jong-un is getting desperate. With the border closed to China, North Korea has lost its biggest trading partner and the economy has been crippled. To make matters worse, severe weather conditions including major floods have significantly reduced food supplies. At a political conference in June, Kim admitted that the food situation was getting “tense”. Under these conditions, the economy needs to find a way to be self-reliant, and with the threat of starvation, it is even more crucial to keep North Korean citizens in line with party propaganda. But how can a person faced with famine see people living well on TV and not feel resentment towards those responsible for their suffering? Suppression laws are unlikely to stop South Korean influence and are certain to exacerbate the country’s current woes. If North Koreans find more creative ways to access and consume foreign media, Kim Jong-un may have to add rebellion to his list of problems. Stay informed with the latest commentary and analysis on international events from experts at the Lowy Institute and around the world. The Interpreter features in-depth analysis & expert commentary on the latest international events, published daily by the Lowy Institute. © Copyright 2023\n      \nLowy Institute ",
    "title": "K-drama takes a dark turn | Lowy Institute",
    "url": "https://www.lowyinstitute.org/the-interpreter/k-drama-takes-dark-turn"
}