{
    "text": "So where does this obsession with noodles come from? History and culture Noodles have played an important role in Korean cuisine and culture since the Three Kingdoms period (57BC-AD668), with plump wheat kernel noodles being introduced around AD300. With production of wheat limited though, most noodles were made from vegetables and legumes. Wheat noodles were highly prized, cementing them as an ingredient for special occasions, with them not becoming a daily food until approximately 1945. Symbolism and double meanings In Korean temple cuisine for example, the dish kong guksu (wheat noodles in cold soybean soup) has the nickname “monastic smile”, as this rare indulgence is said to make a monk smile and their mouths water. Long noodles also equate with long life and a long-lasting marriage and are therefore eaten on birthdays, at weddings and on special occasions such as a hwangap – a 60th birthday (or 61st in Korean numbering), a celebration of cultural significance in the country. On-screen noodle eating Their historical, cultural and symbolic significance, plus a general enjoyment of noodles, goes a long way to explaining their presence in popular culture, including K-dramas. Other noodle dishes appear in Wok of Love and Mystic Pop-up Bar, and many more. Fancy a nibble? Then there’s the sexual implications. “Do you want to eat ramyeon?” or “Do you want to eat ramyeon before you go” have a similar connotation to the phrase, “Netflix and chill”. The use of the sexual innuendo is credited to the 2001 film, One Fine Spring Day, and now makes an appearance in many K-dramas, including the more recent What’s Wrong with Secretary Kim, Crash Landing on You and Run On. The fact that not everyone is yet aware of this double meaning means it is rife for dramatic, or comedic, misunderstanding. Such as the amusing scenes of confusion in the 2019 K-drama Possessed, with the male lead clueless to the intended meaning, in stark contrast to the female lead. It’s a sign of how much times have changed: that the symbolism that once equated long noodles with long life has shifted to an invitation to eat instant noodles implying something far more immediate altogether. Where are Singapore noodles from? How are century eggs made? Are French fries improperly named? And what’s the final verdict on where tikka masala was created? With the  Origins series, STYLE delves into the often surprising beginnings of iconic dishes or foods, how they’ve evolved over time and the many ways they’re enjoyed today. Want more stories like this? Sign up  here. Follow STYLE on  Facebook,  Instagram,  YouTube and  Twitter. ",
    "title": "K-drama: why are ramyeon noodles an invitation for sex? Featured in Crash Landing on You, What’s Wrong with Secretary Kim and more Korean series, this bowl of instant ramen says something saucy | South China Morning Post",
    "datetime": "2021-03-06T12:00:11+08:00",
    "url": "https://www.scmp.com/magazines/style/k-pop/k-drama/article/3124265/k-drama-why-are-ramyeon-noodles-invitation-sex"
}