{
    "text": "From music to movies, technology to food, the world has fallen in love with everything South Korean. Ahead of a big London exhibition, Tim Adams visits Seoul in search of the origins of hallyu – the Korean wave Last week, I was standing in a huge dance studio – one of 12 – near the top of a funky new office tower just north of the Han River in the South Korean capital, Seoul. The building is home to a company called SM Entertainment, which has strong claims to have invented one of the most potent cultural movements of the 21st century, the phenomenon of Korean pop music – K-pop. Each generation creates hit factories in its own image. The “SM Culture Universe” was originally the vision of a Korean pop entrepreneur called Lee Soo-man who, after a brief career as a singer and DJ, studied computer engineering in the States in the 1980s. He returned to Seoul “with the dream of globalising Korean music”. In the dance studio, his nephew Chris Lee, now the chief executive, is talking me through all the ways in which this dream came true. To begin with, K-pop idols conquered Asian charts; lately, after the extraordinary success of K-poppers BTS (the biggest-selling band in the world for the past two years, managed by rival conglomerate Hybe), they have been expanding their reach to all corners of the globe. New members of boy bands and girl bands – aged 11 upwards – are recruited by SM each year on long contracts and this building becomes their virtual home. It is designed as an inside-out place, with every room a stage set for press conferences, fan chats and livestreams; one floor is an “artist’s house”, a place where “idols” can chill or do some cooking (while their fans watch and scream outside); another is a “song camp” where songwriters from across the world are flown in on rotation to create a global sound. “One of the things we tell [new talent],” Lee says of this operation, “is that they are representing our country. If you were on an Olympic team you would have to be trained and we see no difference. If they want to be the best in the world, it takes a lot of work. They get media training. They study languages so that they can communicate with many different audiences. We teach them how to have good personalities.” One of the most successful products of that system is Taeyong, who joins our conversation. Taeyong is the leader of a group called NCT 127 (NCT stands for “neo-cultural technology”, 127 is Seoul’s line of longitude). NCT’s last album, Sticker, reached No 3 on the US Billboard chart. Like all boy band and girl band members, Taeyong has the bone structure and flawless complexion of an avatar and a kind of androgynous vulnerability. He was, he explains, spotted for his looks by SM talent agents on the street in Seoul a decade ago. “Taeyong didn’t dance well at the time,” Lee says. “He didn’t rap at all. He is now the best dancer, a great rapper. He has lived in this building, in that practising room.” Taeyong is 27, though he could be 17. As the leader of NCT 127, his responsibilities are onerous. K-pop bands are all about accessibility. Taeyong is in near-permanent contact with NCT 127’s fan community, partly through a “digital metaverse”, a kind of gamers’ dreamscape in which fans can meet virtual versions of their idols. (Two years ago, SM launched a new girl band, Aespa, in which there are four real members and four avatar members, each with detailed backstories and virtual lives.) That desire for ubiquity is not just online. “NCT 127 are one of the biggest boy bands in the world,” Lee says. “But physically there are nine of them and they are in Korea. They cannot be everywhere in the world all the time.” As a result, there are now NCTs in China and plans to roll out versions elsewhere in the world. The boy band as franchise? “Not a franchise, a cultural brand.” Even before the pandemic, SM was creating online concerts for its groups involving virtual reality and holograms. The current aim is “a 2.0 version of an online concert”. One recent live show featuring a roster of SM acts had an interactive livestreaming audience across the globe of 56 million. Parents, Lee suggests, can be sure that their kids are in safe hands. “We don’t sing about sex or drugs or clubs. We don’t sell bad dreams but good dreams.” That spirit apparently engages K-pop fan armies not so much to lust after their idols but to protect them. There have been high-profile cases of K-pop stars taking their own lives after being targeted by online abuse. Fans of BTS and NCT not only organise 24-hour vigils and legal action against critics and trolls online but also seek to do charitable works in their idols’ names. BTS last year addressed the UN on climate change. K-pop appeals, lucratively, to that generation less interested in rebellion than in policing kindness and inclusion. Before I leave his studios, Lee puts up on a screen aphotograph of where it all started. The picture comes from the Shanghai Evening Post in 2000. The original SM Entertainment boyband, H.O.T., had just held their first concert in Beijing and the newspaper headline coins the idea of hallyu – “the Korean wave”. “There is something very interesting in this photograph,” Lee says and zooms in on members of the Chinese crowd who have the Korean flag sewn on their backpacks. “There is only one reason for that flag: because they feel, perhaps for the first time, that Korea is cool.” The collective results of that Korean coolness, which has flourished across the world over the past decade or more – not only in music but also in film and video games and TV and fashion and food – will be celebrated in a major exhibition at the Victoria and Albert Museum (V&A) in London at the end of this month called Hallyu! The Korean Wave. My visit to the K-pop factory was part of a fast tour through Seoul – following the city’s principle of ppalli-ppalli (hurry-hurry) – to get a feel for where that Korean wave started and a sense of where it is likely to break next. In the book that accompanies the V&A’s Hallyu! exhibition, SM’s Lee Soo-man claims that the Korean entertainment industry has created a new paradigm for cultural export. In the past he suggests, effective “soft power” – notably, the cultural exports of Britain and the US – followed on from economic empire building. The Korean model, by contrast, was “culture first, economics second”: export the idea of “Korean cool” and watch Samsung and LG, Hyundai and Kia reap the benefits. Ever since Elvis, it has been understood that there is no more ardent love than that of teenagers for pop idols. One of the masterstrokes of the government of Korea was to recognise that such love might be weaponised, a force for national good. This project was given greater urgency by South Korea’s fragile geopolitics. During my brief hallyu tour, I spent a day up at the border with the north, inside the demilitarised zone, looking through binoculars across the rewilded no man’s land at North Koreans going about their business in distant mountain villages. It is across this border that the bluntest expression of hallyu takes place. For decades, the rival nations have bombarded each other with loudspeaker propaganda. From the north, songs eulogising Kim Jong-un are periodically amplified. From the south, in recent years, the dominant beat has been K-pop – BTS, NCT and Girls’ Generation – blasted through vast speakers. According to some North Korean defectors, the pop barrage is successful. Despite the ban on all outside media, K-pop tracks seem to have become seductive earworms in Pyongyang. Their softly subversive lyrics have been described as “cultural Trojan horses”, alongside addictive South Korean soap operas smuggled across on CDs and hard drives. “In the north, dramas and films are all about making sacrifices for the leader,” the defector Lee Je-son noted. “But across the border, shockingly, characters are seen to make sacrifices for love.” Some commentators compare the effect of samizdat and the Velvet Underground in helping to bring down the iron curtain. There is some evidence that it is having an effect, not least in chilling reports of mass executions of party officials caught with CDs imported from the south. The sense that hallyu can penetrate the most closed of societies perhaps emboldened Korean creators to believe there was no territory their work could not invade. In her book The Birth of Korean Cool (subtitled How One Country Is Conquering the World Through Pop Culture), the Korean-American journalist Euny Hong quotes Korea’s influential cultural critic Lee Moon-won about the audacity of that enterprise: “Very few countries have ever attempted to sell their pop culture to the United States.” For about a decade, when K-pop and K-dramas were ascendant across Asia, that ambition was stubbornly resisted. The unlikely detonator of the Korean wave in the English-speaking world was Gangnam Style, the 2012 track by the Seoul-based rapper Psy that became the first YouTube video to be viewed a billion times. Gangnam Style – a high-octane dig at the pretensions of Seoul’s newly minted and plastic surgery-obsessed elite – vocalised an easy and irreverent spirit at odds with received ideas of the earnestness of Korean culture. It offered dramatic evidence that the west’s complacent sense of a monopoly on irony and nuance might be under serious threat. The global success of Psy’s rap could be traced back to the dramatic rises and falls in fortune that have characterised Korean history (the peninsula has been invaded and colonised many times, without ever encroaching on its neighbours). After the Korean war, South Korea was ranked among the poorest nations in the world. With a mixture of authoritarian repression and collective will, the “hermit kingdom” had by the late 1990s turned that around to look like a tech and manufacturing success story. That rise came to an abrupt end with an economic crash in 1997, when the Korean government was forced to ask the IMF for an emergency loan of $57bn. The day of that request is still known as the Day of National Humility. In order to pay off the debt there were many collective sacrifices (including a drive for gold that saw tens of thousands of ordinary Koreans donate wedding rings to the national cause). The Seoul government still faced serious harm to Korea’s credibility as a place to do business. Former president Kim Dae-jung decided that what was needed was a massive exercise in nation rebranding. According to ministers quoted in Hong’s book: “Kim marvelled how much revenue the United States brought in from films and the UK from stage musicals. He decided to use those two countries as benchmarks for creating a pop culture industry in Korea.” After the IMF crisis, the president threw money at a new cultural content office, supported by a multibillion-dollar public-private investment fund to promote Korean creative industries and individuals. The effort was galvanised by a flood of cultural imports from Japan (if one thing unites Koreans, it is a long memory about brutal Japanese imperial rule). The drive to eclipse J-pop and J-movies with home-grown culture became a national obsession. Koreans couldn’t stop singing. The launch in 2009 of Superstar K, Korea’s version of Britain’s Got Talent, saw more than 700,000 people apply to audition. By the fourth season in 2012 that number had passed 2 million. The other strand of the Korean government’s rebranding programme was a commitment to a digital future. Broadband was delivered to nearly all Korean households by 2010. One outcome of that early adoption of technology is that the Korean wave tends to blur distinctions between real and virtual worlds. Just as K-pop stars exist both on concert stages and in an imagined metaverse, so esports merge real-world competition and online gaming. During my time in Seoul, I visited the futuristic HQ of T1, the “Manchester United of esports”, in Gangnam. As with K-pop, T1 recruits and nurtures teenage stars for its all-conquering League of Legends team. Semi-nocturnal players (the meal schedule at the T1 complex is always one step behind - breakfast is at lunchtime, dinner is in the early hours) are encouraged to interact with armies of fans online, before and after stadium-filling livestreamed matches. Faker – real name Lee Sang-hyeok – the star of the T1 (who looks a little more like Harry Potter than Cristiano Ronaldo), reportedly turned down a $20m salary recently to join a rival team. For all that virtual interactivity, there is, too, a powerfully traditional sense about much Korean culture. One night in Seoul I had dinner with 84-year-old Shim Young-soon, who is the something like a cross between Delia Smith and Elizabeth David in Korean cuisine. She appeared in her daughter’s restaurant wearing stiff Korean silks. Shim has evangelised Korean cooking for 50 years and watched it grow from being the poor relation of world cuisine to an antioxidant-rich, Michelin-star turn. Kimchi is at the heart of that revolution. The spiced cabbage dish holds a unique place in Korean hearts partly because of the collective memory of kimjang, the communal autumn ritual of massaging vats full of cabbage leaves with red pepper, salt, garlic, ginger and anchovy paste. It was kimchi – fizzing and fermenting in clay pots underground – that got Korea through the harshest winters of its war-torn history. Shim has travelled through Korean regions collecting dozens of different recipes for kimchi with records dating back to the 15th century. She puts her own health, mental and physical, down to her adherence to the subtle checks and balances of Korean cuisine. Those viral beliefs in kimchi’s health-giving properties went properly global, along with K-pop, during Covid. In between brief lectures on the importance of food preparation within a fertile marriage, Shim offered me a long and impassioned argument about the inferiority of Chinese and Japanese versions of the dish. At one point in a fabulous meal, she had a brief coughing fit. She put that down to her daughter’s introduction of an “alien” piece of parmesan crisp on an otherwise “true” Korean dish of grilled ribs. If Korean food wants to celebrate the native authenticity of its origins, however, most of the rest of its culture is exuberantly hybrid. This weekend, the first Seoul Frieze art fair is taking place, cementing the city’s reputation as south-east Asia’s art capital. Next month in London, there is a festival of crossover K-pop and K-classical. Ten years ago, the critic Lee Moon-won was suggesting that “Koreans are not good at creativity”. But just as the tiger economies had imported and copied and eclipsed western manufacturing excellence by the end of the last century, Korean artists have brought home and transformed western ideas of cool. Nowhere has that effort been more successful than in film. While Hollywood repeats ever-more bloated Marvel franchises, Korean film-makers have learned that 1970s Hollywood trick of making thoughtful, auteur-led films go mainstream. Bong Joon-ho’s Parasite was a groundbreaking Oscar success – the first foreign language winner of best picture - not for any kind of worthiness but for its brilliant contemporary storytelling, the sharp and resonant things it had to say about inequality and class and poverty and excess – subjects about which mainstream American film is mostly silent. The Netflix blockbuster Squid Game, too, gave a whole new tone of voice to its playful, compulsive, brutal take on late-stage capitalism. Squid Game was the first non-English Netflix show to top global viewing charts, breaking all previous records for the platform (in its first month, it clocked up 1.65bn hours of viewing compared with what was then the previous best, the first season of Bridgerton, with 625m hours). Its success opens up scope for more Korean exports. While I was in Seoul, a very different Korean drama, Extraordinary Attorney Woo, was a surprise fixture at the top of Netflix’s global ratings charts, above the much-hyped adaptation of Neil Gaiman’s Sandman. Extraordinary Attorney Woo is a courtroom series featuring an autistic junior barrister with case-cracking powers of recall. It proves an appetite for Korean kookiness as well as high-concept violence. The star of that show, Park Eun-bin, started out as a child actress on Korean television 27 years ago. She told me how gratifying it was to now be reaching a global audience. She said: “It’s fantastic that we can now share a lot more elements of Korea with the world.” There was a confidence that nothing needed to be modified to find those viewers, even in the west. “What works here works outside as well.” Bang Jinah is director of the Korean Culture and Information Service. In her 13 years in that department, she has seen the Korean wave move from a ripple to a deluge. “About 10 years ago, we noticed the big shift,” she said. “Before that, most of the coverage of Korea in the foreign press was about national defence. And now it is all about culture – K-pop, K-classical, K-movies. There has in this time also been a threefold increase in the number of articles.” I mentioned to her an interesting metric, the annual Good Country Index, which attempts to quantify how effective countries are in selling positive ideas of themselves. Last year, Korea was at No 6 in its list of global cultural influence (Britain was at No 23). Bang smiled. What they were doing in her department, she suggested, was really trying to emulate the effectiveness of the British Council and the BBC, those prime movers of soft power. She was surprised when I mentioned how the current British government seemed intent on starving that success story, undermining the BBC, slashing the budget of the “woke” British Council, shutting down university creative and design courses. “Why?” she asked. “Search me,” I replied. But then I guess that’s the thing about waves: for every one that advances, there are always plenty of others in retreat. Hallyu! The Korean Wave is at the Victoria and Albert Museum, London, from 24 September-25 June 2023 K-Music 2022 runs from 5 October-24 November at various London venues ",
    "title": "K-everything: the rise and rise of Korean culture | South Korea | The Guardian",
    "datetime": "2022-09-04T07:00:40.000Z",
    "url": "https://www.theguardian.com/world/2022/sep/04/korea-culture-k-pop-music-film-tv-hallyu-v-and-a"
}