{
    "text": "  Dr. Kim Jong-gap, who has helped South Korean small and medium-sized enterprises (SMEs) and venture firms make inroads into global markets in the Silicon Valley for the past 20 years, was appointed as the head of the K-ICT Born2Global Center in September last year. His past career includes a director of the iPark Silicon Valley under the former Ministry of Information & Communication that assisted in the business of South Korean venture firms and SMEs in the United States, the head of the Electronics & Telecommunications Research Institute (ETRI) USA R&D Center and a representative director of Macrovia Partners, a startup incubator located in the Silicon Valley. He has helped no less than 500 South Korean venture firms to expand their business abroad so far. “What matters the most for the overseas business of South Korean venture firms and SMEs to become successful is to think in the local way as well as the acquisition of local languages and cultures,” he stressed based on his own experience, adding, “Then, they will be able to develop and provide services that suit the needs of local customers, and also important is to have a good grip on market demands.” With regard to the name of the Born2Global Center, which is pretty distinctive, he said that the name is to aim for the concept of born global, that is, targeting global markets from the get-go instead of penetrating overseas markets after growing in the domestic market. “Another implication of the name is to turn South Korea into the center of the global market,” he mentioned. Enterprise diagnosis reports are one of the parts the K-ICT Born2Global Center is currently concentrating on the most in order to assist in the overseas expansion of promising startups. The reports are to analyze startups in terms of legal, patent, accounting, technological strength, marketability, MRD aspects and so on in determining which to help. Expert groups consisting of lawyers, patent attorneys, accountants and the like check details of consulting for each startup and manage the content, schedule and progress of their assistance. The K-ICT Born2Global Center has brought in a new program by the name of Go-to-Market Roadshow, too. The purpose of the program is to organize one-on-one business meetings between startups and local investors and accelerators reflecting IR demands on an ongoing basis. In other words, it is an intensive support for an occasion comparable to demo day events. The head of the K-ICT Born2Global Center also explained that it started public relations (PR) services this year and will provide the around-the-clock services based on an increasing level of foreign media exposure. “South Korean startups’ performance was relatively poorer than those of their U.S., Chinese and Singaporean counterparts at the Global Startup Conference 2016 Spring recently held at the COEX Convention Center and this was because of the lack of PR,” he continued to say, “Their advanced and excellent technological and service models were underestimated and failed to be publicized to a sufficient extent as the South Korean startups could not blend in due to the lack of their linguistic and cultural capabilities and this is why we are trying to help them in PR and networking by means of our public relations services.” According to him, the competitive edge of the Silicon Valley, which is a role model for a large number of startups in South Korea, lies in its robust ecosystem above anything else. “Wide spaces are open and abundant funds are available for startups there and more than 90 unicorns are continuing to enrich the ecosystem while boosting a virtuous cycle,” he explained, continuing, “I believe that such a virtuous cycle should be created in South Korea as well, led by firms successfully growing based on collaborations, and the presence of 10 or so unicorns in the country will be enough for the venture and startup ecosystem of South Korea to become mature to the point of many other countries trying to take a leaf from it in the near future.”  Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "K-ICT Born2Global Center to Enhance Promotion of Korean Startups Abroad - Businesskorea",
    "datetime": "2016-05-30T07:00:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=14825"
}