{
    "text": "Culture | Music Recently London seems to have discovered Korean food with lots of new restaurants serving delicacies that are fresh and fiery. The K-Music Festival is bringing equally intriguing musical flavours from Korea. Last night’s band, Jambinai, have acquired a cult status, having appeared at Glastonbury and other festivals round the world. This was their first London show. They are emblematic of South Korea itself — a country with deep traditional roots that is simultaneously at the cutting edge. That is the nature of Jambinai’s music. The core of the band is three musicians — Bomi Kim, Eun Yong Shim and Il Woo Lee — who play the traditional fiddle (haegeum), zither (geomungo) and oboe (piri) and electric guitar. They began with just the trio, playing extraordinary angst-ridden pieces. One slowly built on repeated plucks, electronics and screams on the fiddle building to a tumultuous climax and then leaving just the plaintive oboe playing. Then they were joined by bass guitar and drums for transcendental grooves that had the whole audience swaying. “Thanks for coming to see us even though we’re a strange band from South Korea,” said guitarist Lee. What gives them their appeal is the way they bring a thrash metal approach to traditional instruments with go-faster gizmos. The audience loved it, but perhaps didn’t know what to make of it at the same time. The K-Music Festival runs until September 30 at Rich Mix; serious.org.uk/K-Music Follow Going Out on Facebook and on Twitter @ESgoingout Overmono at the Roundhouse: pure electronic bliss with bangers galore Glastonbury boss Emily Eavis just dropped some serious headliner hints 1989 (Taylor’s Version) is (almost) ready to drop How streaming has helped make this gamer a rising star MORE ABOUT Have your say... 1 boxing 30,336 Tyson Fury vs Francis Ngannou: Fight time, undercard, latest odds, prediction, purse and ring walks 2 crime 7,119 Lewis Edwards: Paedophile police officer who incited girls to send degrading pictures is jailed for life 3 london 5,657 Clapham resident's makeshift Shetland pony enclosure sparks complaints from neighbours ",
    "title": "K-Music Festival - Jambinai review: emblematic of South Korea itself | London Evening Standard | Evening Standard",
    "datetime": "2015-09-17T17:02:26.000Z",
    "url": "https://www.standard.co.uk/culture/music/kmusic-festival-jambinai-review-emblematic-of-south-korea-itself-a2950136.html"
}