{
    "text": "K-pop is an international sensation, the great South Korean musical export that has taken the world by storm. The genre is so popular that fans in Algeria now incorporate a bit of Korean into their Berber and Arabic, and fans in the US travel from around the country to attend Korean cultural conventions called KCONs. In April, the K-pop band BTS, which has an “army” of devoted fans worldwide, sold more than 3 million copies of its eighth album before it was even released, and the video for the album’s first single broke the record for the most YouTube streams in the 24 hours after release, with 74.6 million listens (surpassing Ariana Grande’s “Thank U, Next”). But not everyone is thrilled about the rise of K-pop in general or BTS specifically. In China, where fans of BTS abound, some fear that the stylish boy band, whose seven members dye their hair, wear couture, have earrings, and use makeup, is sending the wrong message about masculinity. According to the South China Morning Post (SCMP), the Chinese state-run media condemns the young idols and their colleagues in other popular bands, calling them “sissy pants” and warning that a “sick” and “decadent” culture threatens the nation’s future. The fear isn’t confined to state-run media. In Beijing, a former schoolteacher who sees a country in the throes of a “masculinity crisis” founded the Real Man Training Club to turn teenage boys into “alpha males” with athletic activities and macho indoctrination. Of K-pop stars, Tang told the SCMP, “If you are promoting these effeminate figures, it’s a calamity for our country.” To counter that effect, Tang’s trainees exercise outdoors early in the morning. They wear headbands with the words “Real Man” and t-shirts with slogans in English, like “Power Leader.” One mother told SCMP she signed her son up for the bootcamp because “I think it’s a good opportunity for him to gradually cultivate a macho character. If you are a male, you are supposed to have those male traits.” Like Tang, she too is concerned about the state of Chinese culture, saying, “I don’t think the entertainment industry has shown good role models for society because the celebrities … exhibit a more feminine side of men. That’s the problem.” But the critics are probably not going to stem the tide of stylish boy bands, just as conservative parents have failed in the past to stop racy pop sensations. In the 1950s in the US, when Elvis Presley was becoming a national star, many were scandalized by the rock ‘n roller’s style. Elvis appeared on The Milton Berle Show in 1956 to sing “Hound Dog,” and his intense pelvis-shaking alternately thrilled and terrified the nation. Television critics called the performance vulgar and animalistic, and the American Catholic Church wrote an article in its publication headlined “Beware Elvis Presley,” warning that his popularity would lead to juvenile delinquency and a shifting morality. Now, of course, Elvis seems tame, just as BTS and the other K-pop bands made up of stylish crooners with moves will surely seem quaint someday. Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  ",
    "title": "K-pop's rise in China is fueling fears of a masculinity crisis",
    "datetime": "2019-05-11T14:01:14.730Z",
    "url": "https://qz.com/quartzy/1616944/k-pops-rise-in-china-is-fueling-fears-of-a-masculinity-crisis"
}