{
    "text": "Final hours of the On-Air Campaign. Give now! Lauren Booker\n|\t\t\t\t\t\t\t\t\t\t\t\t\tWABE January 22nd, 2019 Luchia Arecco and Sam Richardson are fans of K-pop, the music genre that’s becoming a worldwide phenomenon. Lauren Booker / WABE Atlanta is home to the KPOP STORE in USA, which is owned and operated by a family that emigrated from South Korea 15 years ago. The business, located on Buford Highway, has been selling K-pop cultural goodies, such as CDs, posters and glow sticks, for five years after transitioning from operating as a long-running video rental store. “My whole family likes K-pop, which I think helps us a lot in this business,” Daniel Lim, manager of the KPOP STORE in USA, said. “When I first moved here, there wasn’t a lot of K-pop lovers, but I wanted them to hear Korean music … Right now, I think it’s succeeding in the American market with BTS.” Korean Pop Music, or K-pop, has grown to become a multifaceted, audiovisual musical powerhouse, with its popularity stretching around the world. In Atlanta, the genre’s influence can be seen in the city’s robust K-pop scene composed of song cover groups, concert planning agencies and social media bloggers.  “It’s only in the last year or two with BTS and some [K-pop groups] that I think K-pop has actually began to appeal to mainstream audiences in the U.S.,” John Lie, author of “K-Pop: Popular Music, Cultural Amnesia, and Economic Innovation in South Korea,” said. Seven-member boy band BTS, whose chart-topping K-pop hits include “IDOL” and “Fake Love,” has made headlines for being the most tweeted-about artist in 2017, and for remaining No. 1 for the Social 50 chart for over 100 weeks since 2010. Over the years, Lim said sales have been increasing, which the local K-pop store reports to Billboard to help contribute to artists’ placement on the charts. “There are many people who love K-pop,” Lim said. Ever since K-pop pioneers Seo Taiji & Boys first hit the scene in 1992, the genre has grown to become a worldwide phenomenon, which has, in turn, helped to increase the South Korean music industry’s worth to around $5 billion. “I think one of the major reasons why people get attracted to K-pop is bright colors, loud music, pretty people and dancing,” Laine Rutledge, Atlanta-based K-pop fan and YouTuber, said. “I think that K-pop is something everyone can like.” K-pop has a mix of influences from Western music genres, including hip-hop and R&B, along with J-pop dance culture, according to “Toward a Gendered Aesthetics of K-pop.” “Initially the popularity of K-pop began among Korean Americans … who knew about K-pop from their friends or relatives or from social media, ” Lie, sociology professor at the University of California, Berkeley, said K-pop fandom can be found in the K-pop specialty shops and artist tours popping up around the U.S. and Atlanta. K-pop was designed to appeal to people outside of South Korea, according to Lie. “By the time K-pop emerged sometime in various ways in the 1990s [to] early 2000s, they had begun something that people outside of Korea could really appreciate if they were used to American-influenced pop music,” Lie said. He said the music style has staying power because the sound is constantly evolving to suit what’s trendy at the time. “It keeps on changing because the pop music charts keep on changing, the trends, what’s cool and what’s hot,” Lie said. “There is something of eternal youth in pop music.” Even though Korean isn’t Luchia Arecco’s and Sam Richardson’s first language, the music resonates with the high school students from Cumming, Georgia. (Left to right) Luchia Arecco and Sam Richardson frequent the KPOP STORE in USA. They are also a part of their school’s Appreciation for Korean Arts and Culture club. Photo credit: Lauren Booker    \n\n\n\n \n\n\t\tMugs covered with images of K-pop idols line the top of the display stands inside of the KPOP STORE in USA. Photo credit: Lauren Booker    \n\n\n\n \n\n\t\tPosters of K-pop superstars hang from the ceiling and on the windows inside of the KPOP STORE in USA located on Buford Highway. Photo credit: Lauren Booker    \n\n\n\n \n\n\t\tCushions made by BT21, a collaboration between LINE FRIENDS and BTS, are a few of the collectibles that can be bought at the KPOP STORE in USA. BTS group members created the cushions. Photo credit: Lauren Booker    \n\n\n\nArecco’s favorite K-pop band is Stray Kids, whose song “District 9” received more than 31 million views on YouTube since it debuted on the social media platform in March.\nAstro, whose hits include “Always You,” is Richardson’s favorite K-pop group. The six-member K-pop boy band’s YouTube page has more than 1 million subscribers.\n“With music, I feel like there’s no such thing as a language barrier. You can understand what they are saying just by how they are performing and you can understand their feelings just by the patterns in the songs,” Richardson said.\nArecco and Richardson are members of Strawberry Silk, a local K-Culture blog and cover group. The pair also competes in local K-pop competitions as members of Strawberry Silk’s dancing and singing cover sub-unit VIOLET-S.\nArecco is also a part of the Facebook group “Let’s Bring KPop to Atlanta,” which has more than 300 members.\n“We’ve been performers our whole life. So with K-pop, a lot of the time they are not just standing and singing. They’re singing, and they’re dancing, and they’re putting on a whole show,” Richardson, 18, said. “And so coming from a performer’s perspective, it really draws you in, whereas sometimes [with] American music, they kind of just stand there.”\nK-pop in the “Hollywood of the South”\nDynamic, live performances is one reason fans are attracted to the music genre and culture.\n“I’ve been to concerts where people are like, ‘I don’t know who these people are.’ And they come out of the concert, ‘I’m total fans.’ I’ve seen that happen so many times, and I’m like, ‘Wow the impact definitely got to them. They have definitely left a mark on their lives,’” Ashlee Rackthai, CEO of ATLocal, said.\nRackthai, 23, started ATLocal with the goal of bringing more concerts to Atlanta, to satisfy growing demand.\n“With Atlanta though, it’s the Hollywood of the South. You really can’t go wrong with the Hollywood of the South,” Rackthai said. “With the Hollywood industry making its way through here, K-pop is definitely for sure going to make it here in Atlanta.”\nThe newly started business specializes in event organization, local marketing, food catering and transportation services for K-pop events, such as the K-Expo in New York and the Paint It Rose Tour in Atlanta.\n“I’ve seen people of all ages at concerts … whenever you check the social media, I’ve always seen people [say], ‘How old are you? How old are our fans?’ And you’ll see it ranges from maybe 12, 13 to almost 40, 50, ” Neel Padhiar, marketing director of ATLocal, said. “Everybody really enjoys it.”\nRutledge, 26, hopes to see more K-pop concerts come to Atlanta in the future.\n“I feel like we are one of the bigger places when it comes to K-pop fans. We’ve got surrounding states that would come visit for events,” Laine Rutledge said. Photo credit: Lauren Booker\nShe’s been a part of the K-pop community for almost 10 years and is drawn to the culture’s collectibility. Some of the items in her K-pop collection include CD sets from her favorite bands and glowsticks.\nShe said the culture can be addicting and compared being a K-pop fan to a sports fan.\n“I think it’s easy to get wrapped up in it, because there’s always something to buy. And it’s always cute. It’s always in the nicest packaging,” Rutledge said.\nRackthai said that “once you get into K-pop there’s no going back.”\n“We’ve got a pretty big scene here. I know that we have the largest population of Korean American people living in the Southeast, at least living in Atlanta. We’re a music capital. It seems like a no-brainer,” Rutledge said. Arecco’s favorite K-pop band is Stray Kids, whose song “District 9” received more than 31 million views on YouTube since it debuted on the social media platform in March. Astro, whose hits include “Always You,” is Richardson’s favorite K-pop group. The six-member K-pop boy band’s YouTube page has more than 1 million subscribers. “With music, I feel like there’s no such thing as a language barrier. You can understand what they are saying just by how they are performing and you can understand their feelings just by the patterns in the songs,” Richardson said. Arecco and Richardson are members of Strawberry Silk, a local K-Culture blog and cover group. The pair also competes in local K-pop competitions as members of Strawberry Silk’s dancing and singing cover sub-unit VIOLET-S. Arecco is also a part of the Facebook group “Let’s Bring KPop to Atlanta,” which has more than 300 members. “We’ve been performers our whole life. So with K-pop, a lot of the time they are not just standing and singing. They’re singing, and they’re dancing, and they’re putting on a whole show,” Richardson, 18, said. “And so coming from a performer’s perspective, it really draws you in, whereas sometimes [with] American music, they kind of just stand there.” Dynamic, live performances is one reason fans are attracted to the music genre and culture. “I’ve been to concerts where people are like, ‘I don’t know who these people are.’ And they come out of the concert, ‘I’m total fans.’ I’ve seen that happen so many times, and I’m like, ‘Wow the impact definitely got to them. They have definitely left a mark on their lives,’” Ashlee Rackthai, CEO of ATLocal, said. Rackthai, 23, started ATLocal with the goal of bringing more concerts to Atlanta, to satisfy growing demand. “With Atlanta though, it’s the Hollywood of the South. You really can’t go wrong with the Hollywood of the South,” Rackthai said. “With the Hollywood industry making its way through here, K-pop is definitely for sure going to make it here in Atlanta.” The newly started business specializes in event organization, local marketing, food catering and transportation services for K-pop events, such as the K-Expo in New York and the Paint It Rose Tour in Atlanta. “I’ve seen people of all ages at concerts … whenever you check the social media, I’ve always seen people [say], ‘How old are you? How old are our fans?’ And you’ll see it ranges from maybe 12, 13 to almost 40, 50, ” Neel Padhiar, marketing director of ATLocal, said. “Everybody really enjoys it.” Rutledge, 26, hopes to see more K-pop concerts come to Atlanta in the future. She’s been a part of the K-pop community for almost 10 years and is drawn to the culture’s collectibility. Some of the items in her K-pop collection include CD sets from her favorite bands and glowsticks. She said the culture can be addicting and compared being a K-pop fan to a sports fan. “I think it’s easy to get wrapped up in it, because there’s always something to buy. And it’s always cute. It’s always in the nicest packaging,” Rutledge said. Rackthai said that “once you get into K-pop there’s no going back.” “We’ve got a pretty big scene here. I know that we have the largest population of Korean American people living in the Southeast, at least living in Atlanta. We’re a music capital. It seems like a no-brainer,” Rutledge said. Jan 17, 2022 Jan 16, 2022 Jan 15, 2022 WABE’s mission is simple: “Inform, inspire, reflect and empower our greater Atlanta community. ” We do that through the news, information, and entertainment we bring you via radio and TV, on your phone, in your car, on your smart speaker, or online at the new WABE.org—anywhere and everywhere throughout greater Atlanta. And we can only do this with your help. Please consider becoming a member of WABE today. 2015 – 2023 90.1 FM WABE 2015 – 2023 90.1 FM WABE ",
    "title": "K-pop’s Popularity Is On The Rise In Atlanta. Get To Know The Culture That’s Going Global. – WABE",
    "datetime": "2019-01-22T10:45:40+00:00",
    "url": "https://www.wabe.org/atlanta-kpop/"
}