{
    "text": "World PARIS — K-pop star Jang Wonyoung is under fire from Chinese netizens for calling a phoenix hairpin the \"look of Korea in Paris”. The netizens felt that the phoenix is a Chinese motif and that the star \"stole from their culture\". PARIS — Jang Wonyoung, South Korea’s up-and-coming K-pop star, has come under fire from Chinese netizens for what they perceive as her appropriating Chinese culture. Better known as Yonyoung, the artiste from K-pop girl group IVE recently appeared in her “first ever Paris trip vlog” in a Vogue Korea video that was uploaded on Sunday (Oct 16). The star was in Paris for jewellery brand Fred’s exhibition, titled “Fred Joaillier créateur depuis 1936”. Wonyoung walked the streets of Paris, sampled gelato and gave viewers a rundown of her outfit during the vlog. Showing off her phoenix hairpin in an updo, she said: “I also put on this hairpin to show the look of Korea in Paris.” This upset some Chinese netizens, who felt that she was \"stealing from their culture\". The hairpin from South Korean jewellery brand Naschenka features a silver phoenix sitting atop the hair pin. On Instagram, the brand described the hairpin as “a hairpin that represents the beauty of Korea. A silver hairpin originally from Korea”. A post shared by 조선 왕실 장신구 · 한복 비녀 · 뒤꽂이 · 노리개 (@nas.naschenka) Chinese internet company NetEase reported on 163.com that incensed Chinese netizens went on to Weibo to voice out that the \"phoenix has been China’s since ancient times\" and that “both the brand and Jang Wonyoung is stealing from our culture”. \"She should correct herself and apologise, saying she didn't know that the phoenix belonged to China,\" said one netizen. However, some Chinese netizens noted that Wonyoung did not mention the phoenix specifically, only that she was bringing the look of Korea to Paris with her hairpin. Hence she might have meant that she wanted to wear Korean brands internationally. Twitter users also reacted to  American K-pop news site AllKpop’s tweet on the story of the controversy surrounding the phoenix hairpin. “(The) phoenix comes from (a) Chinese myth and (the) phoenix hairpin is (a) Chinese traditional hair accessory. It is a fact. Wonyoung made a mistake,” one Twitter user said. Other Twitter users defended Wonyoung. One said that Korean phoenix hairpin designs were found in past Korean dynasties, dating all the way back to the ancient Korean states such as Baekje (18 BC – 660 AD) and Silla (57 BC – 935 AD). The user pulled out the receipts — referencing phoenix hairpins used in the Goryeo Dynasty and motifs of phoenixes used on plates, pottery and even decorating the ceiling of Korean palaces throughout various Korean dynasties. Netizens also noted that as neighbouring countries, the cross pollination of culture is inevitable and therefore having similar artefacts, themes and motifs is no surprise. “Sinosphere countries at it again,” one Twitter user lamented. “Phoenix exists in Vietnam, Japan, China and Korea culture... we are all like 5 feet away from each other, why is it so hard to understand that our culture has a lot in common?” According to the Encyclopaedia of Korea Folk Culture, the phoenix or “bonghwang” was used to decorate objects, clothing and royal buildings, largely symbolising the royalty in ancient Korea. It was regarded as a symbol of female royalties, similar to ancient China where the phoenix symbolised the Empress alongside the Emperor represented by a dragon, as reported by China Daily. This is not the first time China and South Korea are caught in a debate over supposed cultural appropriation. During the Beijing Winter Olympics held in February this year, a woman appeared wearing a hanbok — the traditional Korean dress — during the opening ceremony. The appearance of the hanbok-wearing performer in the opening ceremony sparked an outcry from South Korea as it was seen as an attempt to claim aspects of Korean culture as China’s own. The Chinese embassy in Seoul defended the decision to include a participant wearing hanbok, describing her as a representative of the joseonjok – an ethnic group with roots in Korea — among the more than 50 other ethnic groups in China, reported The Guardian. Read more of the latest in Subscribe to get daily news updates, insights and must reads delivered straight to your inbox. By clicking subscribe, I agree for my personal data to be used to send me TODAY newsletters, promotional offers and for research and analysis. Copyright 2023 © Mediacorp Pte Ltd. All rights reserved. We know it's a hassle to switch browsers but we want your experience with TODAY to be fast, secure and the best it can possibly be. To continue, upgrade to a supported browser or, for the finest experience, download the mobile app. Upgraded but still having issues? Contact us ",
    "title": "K-pop star Jang Wonyoung incurs wrath of Chinese netizens for calling phoenix hairpin 'look of Korea' - TODAY",
    "url": "https://www.todayonline.com/world/trending-k-pop-star-jang-wonyoung-incurs-wrath-chinese-netizens-calling-phoenix-hairpin-look-korea-2024861"
}