{
    "text": "On a brightly lit stage, two male K-pop stars with glowing skin and perfectly coiffed hair are nibbling either end of the same long, chocolate stick. As the stick gets smaller and smaller, they get closer and closer – and eventually a fellow K-pop idol pulls them into a kiss. In South Korea’s glitzy, highly manufactured music industry, these kinds of scenes are not uncommon. As long as it’s only for show, that is. Homophobia is still rife in South Korea, where very few mainstream music stars have come out as gay. The country has no comprehensive anti-discrimination laws to protect LGBTQ South Koreans, and compared to nearby democracies like Japan and Taiwan, the country is less accepting of same-sex couples. Taiwan has introduced same-sex marriage – and although Japan hasn’t done the same, some cities issue same-sex partnership certificates, though they’re not legally binding. There’s no such option in South Korea. There, homosexual sex is not banned, but it is illegal in the military, where almost all men must complete a stint of compulsory conscription. Despite all that, same-sex K-pop idols regularly play-act romance. On stage, they dance intimately with one another or gaze into each other’s eyes. In video clips, it’s not uncommon to see them playing games that result in them grazing lips, then dramatically recoiling to show that it was all just play. That apparent contradiction is no accident. If you come out, your fans will be so infuriated. Jungmin Kwon, author Although major labels are afraid to let stars be open about their sexuality for fear that they will hurt their career, they allow – and sometimes encourage – stars to touch each other in public. “It’s kind of sad,” said Jungmin Kwon, an academic who wrote a book called “Straight Korean Female Fans and Their Gay Fantasies.” “On the one hand it looks like the industry is very open minded to shipping culture,” she told CNN, referring to the culture among fans of imagining relationships between their favorite stars – including gay relationships. “On the other hand, they’re not that much … If you come out, your fans will be so infuriated.” To understand what’s going on, you need to go back to the 1990s. For decades, South Korea had been under military rule. It wasn’t until 1993 that the country’s first elected civilian president took office, ushering in a new era of economic growth, technological development, and a blossoming entertainment sector – including the first K-pop idols. Teenagers were hungry to consume everything about their favorite stars. But it was a time before social media, and stars didn’t share as much about their lives as they do now. Seoul's burgeoning drag scene confronts conservative attitudes So fans got creative. According to Kwon, fans were inspired by “yaoi” – a kind of Japanese manga that features gay relationships between male couples – and began making up stories about their favorite stars. But rather than drawing pictures, as was done in Japanese yaoi culture, they wrote stories so they could easily be uploaded and shared using dial-up internet. The stories often featured romance between same-sex stars. Kwon said there are several reasons that was the case. Fans often didn’t think they were worthy of their idols themselves, so they matched them with stars from the same band – and most bands were exclusively girl or boy groups. Same sex relationships were often seen as taboo, which made them more “intriguing,” said Kwon. “It was easier to find stuff with the members together (compared) with people of the opposite sex,” said 22-year-old Amber Chuah, who was into fanfiction when she was younger. “It’s world-building without the extra step of having to create the specific character and their traits.” As internet downloads ate into record sales in the 2000s, South Korea’s record labels realized they couldn’t just focus on the music – they needed to package stars in a way that would appeal to fans. BTS' army of admirers: Inside one of the world's most powerful fandoms With much of the fanfiction about same-sex romance, one of the country’s largest entertainment company, SM Entertainment, began encouraging its stars to take part in “skinship” – or touching a fellow band member, according to Kwon. It was a different approach from the West, where bands like One Direction have strenuously denied fan theories of in-band romance. Even now, K-pop labels sometimes cultivate idols’ homoerotic appeal in the hopes that it makes them more popular in fanfiction, where Kwon estimates 80% of stories involve gay story lines. That, in turn, can increase their profile – and translate into economic benefits. “K-pop idols know that it comes with the territory, and the more fans are involved in many, many different ways in the fandom, the better it is for them as performers and as celebrities,” said Michelle Cho, a professor of East Asian Studies at the University of Toronto. South Korea’s record labels are happy to let fans fantasize about idols being gay. But they don’t want gay idols be open about their sexuality. That was something 23-year-old star Holland found out firsthand. Holland – whose real name is Go Tae-seob – went through rigorous training with one of the labels (he declined to say which one). But when it came time to debut, the label was against him debuting as a gay idol. Instagram post not found. Post has been removed or is no longer public. “They said it would be bad for my image,” Holland told CNN. To Holland, that was a deal-breaker. He had been badly bullied in middle school, and it was important to him to be open about his sexuality. So he quit the label and debuted as an independent artist. “I wanted to prove that I am worthy of love, and that I’m worthy of achieving and being accomplished,” he said. “I felt that was the only way I could love myself.” K-pop stars are often subject to strict rules – many are not allowed to date publicly, as labels worry that any relationships make stars lose their mystique among fans. For the major labels, public same-sex relationships appear to be out of the question. Against that backdrop, Holland was a major break with tradition. When he debuted in 2018, he attracted a lot of positive attention overseas. But back home in South Korea, the reaction was muted – or even negative. Nevertheless, Holland remained determined to make a statement. While filming the music video for his first single “Neverland,” the director told him that there would be a 19+ rating in South Korea if the clip showed any same-sex affection. So Holland decided to include a scene where he kisses a man to prompt audiences to consider why a same-sex kiss deserved an explicit rating when a kiss between a man and a woman wouldn’t. He finds it sad when shows make stars kiss each other. “They make it into funny content to embarrass them,” Holland said. “It’s a shame that’s the limit they can go when it comes to showing homosexual interaction – it can only be portrayed as funny.” In South Korea, Holland’s decision to come out is unusual. To many celebrities, the case of television personality Hong Seok-cheon still looms large. After Hong came out publicly as gay in 2000, he was fired from his hosting job and lost other work – and author Kwon believes that harsh response has discouraged others from following suit. Timothy Rich, an associate professor at the Political Science Department of Western Kentucky University, said that any company or celebrity would be worried about the potential backlash and financial risk if a star came out. Why the past decade saw the rise and rise of East Asian pop culture “In the current climate, I suspect there would be considerable conservative backlash to any star that came out, possibly resulting in boycotts,” he told CNN. But there are reasons to think things could change. As K-pop’s international reach grows, K-pop itself is changing. In South Korea, interaction between stars is seen through a different lens – fans see it as fantasy, and there’s also more of a culture of male friends touching each other, in part because of how heteronormative the culture is. But internationally, K-pop fans see close interactions between stars as evidence of genuine relationships, and are often keen to have these confirmed so that they have stars that represent them. A star like Holland wouldn’t have been able to exist at all if it weren’t for the globalization of K-pop, said Cho, from the University of Toronto. Holland thinks things are changing: more artists appear to be indicating that they are allies of the gay community. Last year, K-pop singer Sunmi made headlines when she told concertgoers that she was an “LGBT queen,” although she later clarified that she only meant she supported the community – not that she identified as LGBT herself. Gay and trans soldiers say they were abused in South Korean military Boyband BTS is often seen as sympathetic to LGBTQ rights, although their statements in support are often vague. In the absence of confirmation, commentators have used small, inclusive clues to speculate on their stance, for example, the time the band’s leader RM tweeted Macklemore’s song “Same Love,” which promotes equal rights for gay people. The same-sex themes in fanfiction could help change people’s perspective, said Cho. Holland agreed: “It’s a start for them to naturally accept different sexualities.” But ultimately, experts believe a time when gay stars are accepted in mainstream K-pop could still be some way off. “Idol culture is pretty conservative,” Cho said. “It’s quite difficult for performers unless they reach celebrity status with the autonomy that brings … For anyone else to rock the boat is pretty difficult.” © 2023 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network. ",
    "title": "K-pop: Why it's hard for stars to be gay in South Korea | CNN",
    "datetime": "2020-01-26T00:51:03Z",
    "url": "https://www.cnn.com/2020/01/25/asia/k-pop-gay-star-intl-hnk/index.html"
}