{
    "text": "By Kwak Yeon-soo With the worldwide success of South Korean boy band BTS, 2018 has become a litmus test for K-pop’s global expansion. This year has shown how far a K-pop act can go in the United States and gain traction in Western markets. Along with their speech at the United Nations, the seven-member boy band have set multiple records, including topping the Billboard 200 chart twice and selling out concerts in Europe and North America. BTS may not be the first K-pop band to break into the US, but they have given global music fans a taste of K-pop, which often embodies catchy melodies, powerful choreography, conceptual staging and heartfelt lyrics. While K-pop is experiencing success on its own terms, many industry insiders are waiting to see which act will be the next to conquer the West. Here are three K-pop outfits acts on the rise.  Monsta X They released their second full-length album, Take 1. Are You There? fronted by the single Shoot Out,” on October 22. “I think our masculinity and aggressive hip-hop attitude are the main weapons in our arsenal. But we try to accommodate many different concepts,” I.M. said during a recent interview with the Korea Times. The band recently wrapped up their second world tour – “2018 Monsta X World Tour: The Connect” – that took 20 cities across Europe, Asia (including Hong Kong) and the Americas. “The band feel honoured to represent K-pop now the world has recognised the potential of the movement.” Member Kihyun says: “I can definitely feel the difference in how the media and producers treat us now. We feel they really care about us and our music. Some foreign producers have asked to take selfies with and asked about our upcoming album and concert plans.”  NCT 127 Since making their debut in 2016, NCT 127 are made up 10 members:― Jaehyun, Taeyong, Taeil, Johnny, Yuta, Doyoung, Winwin, Mark, Haechan and Jungwoo. The band made their presence felt in South Korea and overseas with the release of their first full-length album, Regular-Irregular, released on October 12. To date, NCT 127 are the second-highest charting K-pop boy band on the Billboard 200 albums chart, after BTS. “We’ve grown up and this album really captures our varied talents and gives us a chance to showcase our full performance abilities while experimenting with different styles and genres,” Johnny says. Stray Kids K-pop company JYP Entertainment’s rookie band, which made their debut in 2017, created a big buzz by landing their pre-debut album, Mixtape, at No 2 on the US Billboard world albums chart in January. Made up of nine finalists from the 10-episode idol survival show titled Stray Kids – that aired from October to December last year – they are seen to have enough musical talent and songwriting skills to hit the big time. The band, recognised for their powerful performances and hip-hop-laden dance tracks, have a clear goal: to make music that people in their late teens and early 20s can relate to. Stray Kids – made up of Woojin, Bang Chan, Lee Know, Changbin, Hyunjin, Han, Felix, Seungmin and I.N. – unveiled their third mini-album titled I am You on October 22. Bangchan says: I think our songs and the music have a lot of energy, and combined with our members’ teamwork, it would draw more fans in Korea and worldwide.” ",
    "title": "K-pop contenders: after BTS, three more bands that could conquer the West | South China Morning Post",
    "datetime": "2018-11-05T20:19:58+08:00",
    "url": "https://www.scmp.com/culture/music/article/2171681/k-pop-contenders-after-bts-three-more-bands-could-conquer-west"
}