{
    "text": "The craze for Korean pop music has spurred a rise in the number of young people going to South Korea to study – from countries such as France, Sweden and the US as well as the country’s Asian neighbours By Kang Hyun-kyung K-pop has gone viral in North America, Europe and the Middle East, paving the way for a music craze in regions where the genre was once seen as a foreign novelty. Now South Korea's “cultural invasion” has spurred rare demographic changes in the country – there are more foreign students in South Korea and their nationalities are more diverse. About a decade ago, Asians, mostly Chinese, dominated international student rosters. In 2017, France became one of the top 12 countries sending 1,000 or more students to South Korea. K-pop migrants are behind the changing demographics on campuses. Paulina Bonnevier, 22, a Swedish student attending Seoul National University, says K-pop was the key driver behind her decision to study in Korea. “I would have never been interested in Korea without K-pop,” she says. “K-pop was like the door that opened up for my visit to Korea.” British student Caitlin Ho, 19, says K-pop was a catalyst through which she was able to experience Korean culture, society and language. “K-pop was never really popular in my country,” she says. “It was more like if you liked K-pop, you didn't tell anyone. It was not really seen as the norm, so sometimes people would tease you for it.” The status of K-pop in Britain, however, changed after the global success of the boy band BTS, according to Ho. “I have heard from friends back home that BTS are drawing in listeners,” she says. “In my home university we established a society where people who like K-pop can come together to meet other fans and talk about it. Through this we are building a community for people to find friends with a common interest.” Dramas fans tend to come here for several days, but younger K-pop migrants stay longer to study or work and they want to know more about the country. As of October 2017, there were 123,000 foreign students in South Korea, about a 40 per cent increase from 2007. Chinese students still make up the lion's share at 55 per cent, followed by Vietnam, Japan, Mongolia and the United States. The data shows a noticeable change in demographic traits of foreign-born students. In 2009, there were only 287 French students in South Korea. The number has increased since 2012, a year after a K-pop concert featuring SM Entertainment bands and singers at Le Zenith de Paris in France and two years after Psy performed his global hit Gangnam Style near the Eiffel Tower. A source familiar with French students’ migration says K-pop is one of the reasons that prompted them to come to South Korea. “More young French people want to learn the Korean language,” she says, asking for anonymity as she was not authorised to speak to the media on the matter. “There is a Korea boom among French youth and they are intrigued by Korea because of its pop culture, food and beauty products.” ",
    "title": "K-pop’s global popularity draws foreign students to South Korea universities | South China Morning Post",
    "datetime": "2018-04-16T20:00:15+08:00",
    "url": "https://www.scmp.com/culture/music/article/2141651/k-pops-global-popularity-draws-foreign-students-south-korea"
}