{
    "text": "The girl group apologized after appearing in blackface during a clip that aired at their concert in Seoul on March 3. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tTamar Herman Korean girl group Mamamoo apologized Saturday after a video clip aired at their concert that featured the quartet in blackface. During their concert on Friday in Seoul, Mamamoo released a parody featuring them performing Mark Ronson and Bruno Mars’ “Uptown Funk” while covered in facepaint and wearing the same outfits featured in the music video. The culturally offensive act garnered attention and gained major backlash on social media. In a statement uploaded to their Facebook page on Saturday, Mamamoo apologized for their “insensitive actions” and said “there is no excuse for what we did.” Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tMamamoo\t\t\n\t\t\t\t\t\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news “We were extremely ignorant of blackface and did not understand the implications of our actions,” the group wrote. “We will be taking time to understand more about our international fans to ensure this never happens again. We hope that you will help to educate us on these and other issues so that we can become better people and better artists.”  The group also assured fans that they “love and care so much for all people of every race, sexuality, religion and gender.” The latest incident came nearly exactly a year after member Hwasa sang a cover of Beyoncé‘s “Irreplaceable” and vocalized the N-word and only a few months after Mamamoo re-released the music video for their single “Decolamanie” after a scene was criticized for perpetuating rape culture. The group has seen multiple albums appear on the World Albums chart since their debut in 2015. Racism in South Korea, especially for entertainment purposes, has become a hot topic in the country. Earlier this year, popular variety show guest Sam Okyere appeared on the television show Talking Show and discussed the discrimination he faced as a Ghanan living in the country. The clip went viral and opened up a broader discussion about race in the country. The same day as Mamamoo’s concert, the Korea Times published an article that explored racism in South Korea’s entertainment industry. K-pop itself is often criticized for cultural appropriation and stereotyping, particularly in reference to the African-American roots of hip-hop. Mamamoo is hardly alone in using blackface for comical purposes, as it is a trope that commonly surfaces on Korean television and media. In 2012, a representative of BIGBANG’s G-Dragon — one of K-pop’s most internationally renowned stars — told SPIN that an image he posted to Instagram was “taken out of context” and did not actually show the star in blackface. But, though it is common, apologies for cultural insensitivity and blackface are far and few in Korea and rarely come without international audiences clamoring for an explanation.  Read Mamamoo’s full statement here: Hello, this is Mamamoo. We are extremely sorry for our insensitive actions and use of blackface in our video while portraying Bruno Mars. There is no excuse for what we did and there are not enough words to explain how regretful we are. We are heartbroken to have hurt our international K-Pop fans so deeply. We love and care so much for all people of every race, sexuality, religion, and gender. We love all our fans and are so sorry to have hurt our fans in the black community. We understand now why our actions were wrong and we never meant to do harm with our video. We were extremely ignorant of blackface and did not understand the implications of our actions. We will be taking time to understand more about our international fans to ensure this never happens again. We hope that you will help to educate us on these and other issues so that we can become better people and better artists. Thank you so much for bringing this to our attention and allowing us to right the wrongs that we have done. Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "title": "K-Pop Girl Group Mamamoo Apologizes for Blackface ‘Uptown Funk’ Performance | Billboard – Billboard",
    "datetime": "2017-03-07T00:15:38+00:00",
    "url": "https://www.billboard.com/music/music-news/k-pop-girl-group-mamamoo-apologizes-blackface-performance-uptown-funk-7710346/"
}