{
    "text": "Just as Billboard gears up to launch its annual Women in Music celebration, one of K-pop's top females adds another accomplishment to her K-Pop Hot 100 2013 hat trick. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin Just as Billboard gears up to launch its annual Women in Music celebration, one of K-pop’s top females adds another accomplishment to her K-Pop Hot 100 2013 hat trick. Leader of girl group SISTAR, Hyorin, had already had earned No. 1s with her group, in the duo sub-unit project SISTAR19 and with a soundtrack single this year alone. Now, she adds another No. 1 with her proper solo debut.\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tExplore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news “One Way Love,” the rocking, Brave Brothers-produced confection, rockets to the top for a No. 1 debut on the K-Pop chart. The R&B-influenced “Lonely,” the other single Hyorin is promoting, lands at No. 3. \n\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tRelated\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t12/09/2013 Incredibly, with “One Way Love” Hyorin earns her seventh overall No. 1 on the chart. While specific No. 1s are only credited to the specific act promoting the single (SISTAR’s No. 1s do not officially count for each member), it’s become clear the K-diva knows the projects to which she should attach her name. With four weeks with SISTAR19’s “Gone Not Around Any Longer” at No. 1 along with a week for SISTAR’s “Give It to Me,” soundtrack single “Crazy of You” and this week’s chart topper, Hyorin has spent seven weeks at the top of the K-Pop chart this year. In addition to covering Beyonce last week, the 22-year-old has unleashed yet another English pop performance. This time, she tackled Christina Aguilera’s “Show Me How You Burlesque,” off the vocal powerhouse’s 2010 movie “Burlesque.”  With Hyorin zooming to No. 1, 2NE1’s “Missing You” has to spend a second week at the No. 2 position. Fans should not fret too much as the winter ballad is showing stronger staying power than the fierce foursome’s previous 2013 singles “Falling in Love” and “Do You Love Me.” Also, as noted below, interest has not waned for the sentimental (and at times, nude!) visual. The video for “Missing You” spends another week on Billboard’s YouTube chart. Watch a new live performance of “Missing You” below from K-pop music chart program “M COUNTDOWN.”  While Noel‘s “When The Night Comes” drops out of the Top 10 this week — and lands at No. 26 — the official single, “Being Forgotten” off new EP “Trace,” skyrockets to No. 8 this week. “Being Forgotten” is a soft, piano-driven ballad crafted by Choi Kyusung, the producer behind Noel’s K-Pop Hot 100 No. 1 “I Miss You.” Through the track, the group boasts its extensive emotional palette, illustrating a man’s heartbreak over not only losing his love but also forgetting about the relationship entirely. Watch the official music video below:  K-pop fans will notice an old Christmas favorite re-entering the chart this week. IU’s “Early Merry Christmas,” featuring MBLAQ member Thunder, was originally released in December 2010, packaged with IU’s “Real” EP. The K-Pop princess layers her sweet vocals over an electro-pop production while Thunder adds in a few rap lines, giving the song a bit of a hip-hop edge. Earlier this year, Busker Busker’s 2012 chart topper “Cherry Blossom Ending” — a bouncy indie track now representative of spring in South Korea — made a resurgence on the charts and eventually found itself back at No. 1. If the public decides IU’s “Early Merry Christmas” will be its quintessential holiday track this year — three years later — it’s not proposterous to think IU could find herself atop the K-Pop Hot 100 again if people start re-streaming the song and downloading it as their ringtone. Watch a classic performance of the holiday tune below:  K-Pop on Other Billboard Charts:—YouTube: 2NE1’s “Missing You” spends another week at No. 21, after debuting at the same position last week.—Japan Hot 100: Two holiday entries zoom into the chart this week with “Very Merry Xmas” by TVXQ! (known as Toho Shinki in Japan) debuting at No. 3 and “French Kiss” by Kara debuts at No. 24.—World Digital Songs Highlights (Only Available to Billboard Subscribers): PSY’s “Gangnam Style” is the biggest-selling K-pop song this week at No. 2 on World Digital Songs. VIXX’s “Voodoo Doll” is the second-highest, debuting at No. 4. Hyorin’s “One Way Love” debuts at No. 11. Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "title": "K-Pop Hot 100: Hyorin Sends Her ‘One Way Love’ to No. 1, 2NE1 Stays Strong at No. 2 – Billboard",
    "datetime": "2013-12-10T00:03:46+00:00",
    "url": "https://www.billboard.com/music/music-news/k-pop-hot-100-hyorin-sends-her-one-way-love-to-no-1-2ne1-stays-5819684/"
}