{
    "text": "All-girl bands such as Red Velvet, After School, 2NE1 and Twice are nothing new – such acts were performing back in the 1930s, according to a music critic’s exhibition When tracing the origins of modern K-pop girl groups such as Twice, 2NE1, Red Velvet and Girls’ Generation, many fans might point to acts such as S.E.S. and Fin. K. L., two K-pop icons from the 1990s who had a huge impact with their music and choreography. Choi Kyu-sung, a photographer-turned-music critic who recently published the book Ancestors of Girl Groups, says otherwise, based on his lifetime collection of 305 girl groups from as far back as the 1930s. “Prior to S.E.S. and Fin. K. L, there were so many great girl groups who enjoyed superstar status, only their names have been forgotten,” Choi says. He says South Korea’s first girl group were the Jeogori Sisters, who made their debut in 1935. “Jeogori” refers to the upper garment of the hanbok, the traditional Korean dress. Better-known girl group Kim Sisters, a trio formed in 1953 by famous singer Lee Nan-young comprising her teenage daughters and their cousin, even ventured to the United States and were a forerunner of hallyu, or the Korean wave, he says. “Although people say the nine-member Girls’ Generation is the prototypical girl group with many members, even larger acts existed way before them,” Choi says. He is holding an exhibition titled “Ancestors of Girl Groups”, showcasing the history of all-female Korean acts through vinyl records, cassette tapes, photos and stage costumes in Seoul, until May 27. “Girl groups reflect the public’s desires of the time. Through them, we can see what people regarded as cool – they were trendsetters,” Choi says. What follows is a timeline of the evolution of South Korean girl groups, based on Choi’s exhibition. 1930s: the birth of girl groups Before professional vocalists emerged, there were Korean gisaeng courtesans who were trained in the art of entertainment, including music. Famous female singers of the 1930s, including Wang Su-bok and Lee Eun-pa, came from the Chosen Dancing Girls School in Pyongyang that offered gisaeng training. Those entertainers performed the modern music that came after jazz along with Western styles of dance. One of the most popular forms of entertainment at the time was a satirical multi-act theatrical performance that combined music, dance and acting. It is this period which gave birth to the modern K-pop girl groups in the form of the Jeogori Sisters, who made their debut in 1935. The popular group comprised the top female signers of the time, including Lee Nang-young who was known for her song Tears of Mokpo, and Park Hyang-rim who sang the hit song My Brother is a Street Musician. They even performed in Japan. 1960s: explosive increase After the end of the 1950-53 Korean war, US military bases started to hire Korean musicians to play American pop music. Clubs inside military bases saw an explosive number of attractive girl groups who sang pop songs in revealing costumes for American soldiers, while the same singers would wear the more elegant hanbok (traditional Korean dress) to perform pop and folk music for domestic audiences. After the success of the Silver Bell Sisters, a duo who sang pop music, similar girl groups mushroomed. Girl groups of the time saw their influence extend past Asia, making forays into Europe. The Pearl Sisters, a storied duo who arrived in 1968, signalled a new era characterised by attractive singers giving flashy performances. 1980s: girl groups in decline University music festivals and singing competitions became hugely popular, and contest winners and student acts found instant stardom. However, those newcomer girl groups tended to be one-hit wonders and didn’t go on to achieve professional careers. Still, after colour television sets first appeared in Korea, the cute-looking Gukbo Sisters became popular and early versions of idol girl groups such as Trio began to emerge. 1990s: new generation emerges The 1990s girl groups were mostly the products of major talent agencies. This new generation of girl groups underwent training in singing and dancing, before debuting with superstar status. They provided a turning point in K-pop history, as male performers had previously overshadowed girl groups. S.E.S. were a Korean girl group trio formed by S.M. Entertainment in 1997, and their rival, DSP Media’s four-member girl group Fin. K. L, debuted in 1998. Beginning with the two groups, a more organised and systematic fan community appeared. 2000s: the Korean wave Girl groups are now in full bloom. Wonder Girls, formed by JYP, released multiple hit songs including Tell Me, So Hot and Nobody. SM’s Girls’ Generation saw their 2009 hit song Gee topping the local music charts for nine straight weeks. Both acts rose as cultural icons, their make-up and fashion setting trends. And now the K-pop scene is awash with all-girl acts such as After School, 2NE1 and 4Minute, who all enjoy unprecedented popularity. Read the full story at the Korea Times: ",
    "title": "K-pop icons, now and then: where it all began for today’s girl groups | South China Morning Post",
    "datetime": "2018-05-23T20:46:22+08:00",
    "url": "https://www.scmp.com/culture/music/article/2147420/k-pop-icons-now-and-then-where-it-all-began-todays-girl-groups"
}