{
    "text": "Filed under: You can’t talk about K-pop fan activism for Black Lives Matter without talking about racism in K-pop. K-pop fans gained new attention this weekend, after they claimed to have registered thousands of tickets for President Trump’s rally in Tulsa, Oklahoma, with the intention of not showing up. To the president’s dismay, the arena ended up appearing more than half empty during the rally, leading some K-pop fans to declare victory — although it’s not clear how much of that was due to the fans’ actions. The stunt was viewed by many as a demonstration of allyship with Black Lives Matter-supporting protesters and Juneteenth celebrants. It followed Korean pop music fans’ sabotage earlier this month of a surveillance app used by the Dallas Police Department — an app that the police encouraged locals to use to send tips about illegal activity among protesters. K-pop fans also recently participated in the derailment of a “White Lives Matter” hashtag, which they flooded with pictures and videos of their favorite idols. And although these actions have been celebrated by many on the left, including by politicians and protesters themselves, some music fans think it’s important to also remember that K-pop — including its fandom — has a history of cultural misappropriation and racism. In recent years, Korean pop idols have been called out for perpetuating stereotypes about black Americans and for misappropriating black culture by wearing, for example, cornrows and dreadlocks. Artists have also received some backlash for stating that they are skilled at “talking Black” and for racist acts like wearing blackface. “It sounds sort of racist because it often is racist,” Miranda Ruth Larsen, a K-pop fan and  cultural studies researcher at the University of Tokyo, whose work focuses on male Korean and Japanese idols and groups, said during an interview for the Vox podcast Reset. That said, the cultural misappropriation (a term Larsen prefers to “cultural appropriation,” which she says typically refers to a more conscious process) within K-pop shouldn’t be blamed solely on the artists. “So let’s say that a K-pop artist is wearing a controversial hairstyle — like they’re wearing dreads or they’re wearing cornrows — eight times out of 10, they did not pick that hairstyle,” Larsen said. “The decision for their hairstyle came from a company, came to a manager, came through an entire chain of command that is responsible and culpable for this bad decision.” For Larsen, making sure fans and journalists understand this history and way the industry functions is crucial. Without it, it’s impossible to get a full picture of what these recent online activism campaigns coming from K-pop fandoms represent. Listen to the episode of Reset below. Subscribe to Reset on Apple Podcasts, Google Podcasts, Spotify or wherever you listen to podcasts.  Will you support Vox’s explanatory journalism? Most news outlets make their money through advertising or subscriptions. But when it comes to what we’re trying to do at Vox, there are a couple reasons that we can't rely only on ads and subscriptions to keep the lights on. \r\n\n\r\nFirst, advertising dollars go up and down with the economy. We often only know a few months out what our advertising revenue will be, which makes it hard to plan ahead.\r\n\n\r\nSecond, we’re not in the subscriptions business. Vox is here to help everyone understand the complex issues shaping the world — not just the people who can afford to pay for a subscription. We believe that’s an important part of building a more equal society. We can’t do that if we have a paywall. \r\n \n\r\nThat’s why we also turn to you, our readers, to help us keep Vox free.  If you also believe that everyone deserves access to trusted high-quality information, will you make a gift to Vox today? $5/month $10/month $25/month $50/month We accept credit card, Apple Pay, and\n              \n\n                Google Pay. You can also contribute via The day's most important news stories, explained in your inbox. Check your inbox for a welcome email. Oops. Something went wrong. Please enter a valid email and try again. ",
    "title": "K-pop fan activism for Black Lives Matter needs context - Vox",
    "datetime": "2020-06-22T15:30:00-04:00",
    "url": "https://www.vox.com/2020/6/22/21295700/k-pop-fan-activism-black-lives-matter-trump-rally-racism-cultural-appropriation-reset-podcast"
}