{
    "text": " By providing an email address. I agree to the Terms of Use and acknowledge that I have read the Privacy Policy. Super Junior members Kangin (left) and Eunhyuk (right) during Memories. PHOTO by Hotaru Niitsu/INQUIRER.net Super Junior members Kangin (left) and Eunhyuk (right) during Memories. PHOTO by Hotaru Niitsu/INQUIRER.net SEOUL–The gift-giving culture among K-pop fans is now evolving into helping society, rather than just the stars. As K-pop’s popularity surged at home and abroad in past years, a unique fan culture of buying luxurious gifts for favored stars took root. The culture, however, is now evolving into helping society, rather than just the stars. Not so long ago, it was traditionally the norm for K-pop fans to shower stars with expensive gifts, but the trend is often frowned upon when it goes to the extreme. Avid fans of K-pop boy band Super Junior, for example, were not afraid to spend $100,000 on the idol group’s albums to help the group win the top prize at the Golden Disk Awards back in 2011. Some viewed the move as “unfair”, saying the hoarding manipulated the Awards results. This gift-giving culture started simply with fans handing over small presents to express their love for idols. But then it turned into a fierce competition among fans, who competitively bought pricey gifts, hoping to catch the eye of their stars. It made idol stars uncomfortable, as did many fans who were pushed into spending large sums of money to prove their love and loyalty. This trend, however, has seen a shift in recent years. Fans are now collecting money to donate in the name of their favorite stars instead. Some donate to create a forest or make donations to the underprivileged. “Sunny Forest” was built by fans of Sunny, a member of Girls’ Generation, for her birthday last month, following a slew of forests named after EXO, Rain, Lee Hyori, Super Junior, INFINITE, SHINee and other K-pop stars. Fans of K-pop idol group EXO-M’s Xiumin donated about $9,800 to a local charity in his name to help Ethiopian children access clean water and education, to celebrate his 24th birthday. “These days, a new culture has emerged where fans donate money to charities on their favorite stars’ birthdays, and a growing number of fans are following the trend,” said a showbiz insider. It doesn’t end there. Fans are now impressing stars by sending rather practical gifts that can be used and shared with fellow stars and teams. Fans of K-pop star Jaejoong from Korea and Japan showed their support for him by giving a large-scale gift to the team working on the MBC-TV drama “Triangle”, in which the singer is starring. The fans allegedly sent jumpers from Black Yak, socks, toothbrushes, snacks and prepared a barbeque buffet for some 180 crew members. Subscribe to our daily newsletter By providing an email address. I agree to the Terms of Use and acknowledge that I have read the Privacy Policy. Hopefully, the fans can continue to carry out such good deeds that embody their love for their favorite stars, boost their profiles and contribute to society. Subscribe to our entertainment news By providing an email address. I agree to the Terms of Use and acknowledge that I have read the Privacy Policy. We use cookies to ensure you get the best experience on our website. By continuing, you are agreeing to our use of cookies. To find out more, please click this link. ",
    "title": "K-pop fans' gift-giving culture evolves | Inquirer Entertainment",
    "datetime": "Thu, 19 Jun 2014 11:52:58 PST",
    "url": "https://entertainment.inquirer.net/145148/k-pop-fans-gift-giving-culture-evolves"
}