{
    "text": "With the summer coming, let’s take a look to see if we can learn something from how the stars eat to help us get into shape. BTS’ V has a “special” food habit If you are a real Army – the official name of BTS’ fans – you are probably already aware that V has never talked about following any type of diet to keep his body fit and trim. He seems to be blessed in the way he boasts of indulging in his favourite foods whenever he wants. But how does he stay fit then? During a live-stream on Naver, V shared his “special” food habit – not stressing while eating. He suggested just enjoying the experience and said thinking happy thoughts while eating would help you not to gain weight. This seems a little like nonsense, so perhaps his real secret was revealed during the same live-stream, when he reminded viewers that they should make exercise one of their hobbies. He even suggested that playing video games can count as exercise. IU’s “healthy” diet tips and tricks However, during her recent appearance in You Quiz on the Block, she admitted her earlier diet was too extreme and said that she had now quit the routine. She added that she could only do it during her early twenties and discouraged anyone from attempting to copy her. She said she could deal with her eating disorder much better after seeking treatment and learning to follow simple guides including eating after working out and enjoying good quality meals each day. Apart from her healthier food habits, IU has also started doing yoga. During her appearance in Hyori’s Homestay, she demonstrated better eating habits such as chewing her food slowly and also discussed her passion for yoga with Lee Hyori. It seems she has been practising hard, as we saw IU doing an impressive Salamba headstand pose on Knowing Bros. Bae Suzy enjoys a high-protein, low-carb diet In one of the episodes from Follow Me, it was disclosed that Suzy eats chicken breast, sweet potato and a cup of low-fat milk for breakfast; brown rice and salad for lunch; and two sweet potatoes for dinner. All together this makes around 1,000 calories. It’s also quite balanced: the chicken breast fulfils the need for protein, while sweet potatoes and brown rice add carbohydrates and help us feel full. She said she also goes through extreme diets if “necessary” – perhaps only consuming one chicken breast, a sweet potato and a cup of low-fat milk all day – but stressed that meeting our daily nutritional needs means consuming a balance of foods. To avoid getting bored while exercising, Suzy starts with something aerobic: jogging. She said hula-hooping also helps. And most famously – and adorably – she showed her own move she called a “penguin exercise” or “penguin dance”. During her appearance on SBS’ One Night with TV Entertainment in 2012, she said she lost weight by imitating a penguin flapping its wings. She stated “people will look and say ‘what are they doing’, but this actually is a good workout. The more you do this work out, the more you will feel your arms becoming skinnier.” Blackpink’s Jennie avoids all salt We all know salt is a really important ingredient when we cook – but for your health it’s important not to use too much. In an interview with Cosmopolitan Korea, Jennie revealed that she has become stricter with her diet, saying, “Even when other Blackpink members are eating something delicious, I just eat porridge since I’m on a no-salt diet.” She added she tends to swell when she eats a lot of salty food, which motivated her to try this no-salt approach. Often Jennie has avocado salad for lunch, and porridge and a detox juice for dinner. Want more stories like this? Sign up here. Follow STYLE on  Facebook,  Instagram,  YouTube and  Twitter. ",
    "title": "K-pop diets: how Blackpink’s Jennie, BTS’ V and IU stay in shape – from ‘not stressing’ to avoiding salt and Bae Suzy’s ‘penguin dance’ | South China Morning Post",
    "datetime": "2021-04-07T12:45:21+08:00",
    "url": "https://www.scmp.com/magazines/style/celebrity/article/3128568/k-pop-diets-how-blackpinks-jennie-bts-v-and-iu-stay-shape"
}