{
    "text": "K-pop icon BTS, a seven-member boy group which enjoys worldwide popularity, are worth more than around 4 trillion won (US$3.54 billion) to the country's economy every year, according to a recent report. The report titled “Economic Effects of BTS” was released by Hyundai Research Institute (HRI) on Dec. 18. It said the boy group's annual production inducement effect is estimated at 4.14 trillion won (US$3.67 billion). It also estimated that BTS generates 1.42 trillion won (US$1.26 billion) annually in added value. The institute projected that 796,000 foreigners on average have visited South Korea for BTS-related reasons every year since the group’s debut in 2013. BTS-related exports have totaled US$1.12 billion (1.26 trillion won), including US$233.98 million (264.28 billion won) in clothing and accessories, US$426.64 million (481.89 billion won) in cosmetics and US$456.49 million (515.61 billion won) in foodstuffs, over the same period. In short, BTS is estimated to have been responsible for 7.6 percent of the 10.4 million foreign tourists who visited the country last year and 1.7 percent of consumer exports last year. The HRI said it analyzed BTS’s contribution to the South Korean economy since its debut in July 2013 by quantifying the search volume in “Google Trend” and analyzing the impact on the value chain over tourism and consumer exports context. When the popularity of BTS increased by one point, the number of foreign tourists went up by 0.45 point three months later, exports of clothing and accessories by 0.18 point, cosmetics by 0.72 point and foodstuffs by 0.45 point in the same month. The HRI expects that BTS will generate an economic value of 41.86 trillion won (US$37.06 billion) and an added value of 14.3 trillion won (US$12.66 billion) for 10 years between 2014 and 2023 if the band continues to maintain its popularity. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "K-pop Group BTS Induces Production Worth 4 Tril. Won  per Year - Businesskorea",
    "datetime": "2018-12-19T10:36:02+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=27583"
}