{
    "text": "By De Elizabeth A new K-pop group is facing online backlash after dropping their debut music video last week. According to Mashable, EXP Edition consists of four guys from the United States who moved to South Korea in order to learn the language and produce their music. And while the members – Koki Tomlinson, Frankie DaPonte, Hunter Kohl, and Šime Košta – come from a variety of backgrounds, none of them are Korean. In the comments of their YouTube video, \"Feel Like This,\" some critics have pointed out that many K-pop groups train for years in order to prepare for their musical debut. However, as Mashable notes, EXP Edition began as a college project by a Korean artist named Bora Kim while she was attending Columbia University in New York. Kim aimed to document the making of a boy band, explaining: \"I was interested in researching the phenomenon of the Korean Wave, and the commercial success of K-pop especially, on a global scale.... I wanted to see what would happen if I made American boys into K-pop performers, by teaching them how to sing in Korean and act like Korean boys, and complicate this flow/appropriation even more, since I’m in New York, where so many talents are just one online recruitment ad away.\" That said, EXP Edition's origin hasn't exempted them from scrutiny from fans who think they are appropriating Korean culture. One YouTube commenter wrote, \"We don’t need mediocre white boys trying to be idols in Korea when they are able to become successful in literally any other part of the world.\" However, some other commenters are supportive, wishing the group luck as they make their debut in the K-pop world. Related: We Need to Hold K-Pop Idols Accountable For Their Racist Actions Check This Out: By Lexi McMenamin By Sara Delgado By Sara Delgado By Saanvi Arora More from Teen Vogue Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Teen Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "title": "K-Pop Group EXP Edition Faces Online Backlash | Teen Vogue",
    "datetime": "2017-04-17T13:18:42.925Z",
    "url": "https://www.teenvogue.com/story/k-pop-group-exp-edition-online-backlash"
}