{
    "text": "To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. By Mark Guiducci Sitting across the table at Spot, a Korean dessert bar on St. Marks Place, K-pop star CL looks every bit like a die-hard fashion girl. She’s rocking a Tom Ford chinchilla of alternating aquamarine, navy, and royal blues; her shoes are Rick Owens x Adidas; her vintage T-shirt, a Tokyo souvenir, is from a Nirvana tour that happened four years before she was born. She’s talking about her dinner last night with Alexander Wang. But to the other patrons of this little eatery, CL is a superstar; the breakout act from Korea’s biggest girl group, 2NE1; a unicorn with the silver mane to prove it. When she orders an iced green tea latte with bubbles, the waiter delivers more than a dozen sweet dishes to our table. An employee from a neighboring Korean restaurant brings her a large bag of takeout food, just to be polite. Anonymous on the streets of New York, she may as well be Rihanna in here. And the rest of us are about to see what the fuss is about. CL Born to Korean parents, CL was raised between Paris and Japan, leaving little wonder how she became such a fashion plate. “I feel like an alien sometimes, where I don’t feel like I belong anywhere,” she admits. “Culturally, I’m not 100 percent Korean. I’m very mixed, and very open.” Crucially, CL possesses a mastery of the English language and a breakthrough solo album, still in the works, that is being carefully shepherded by Belieber-in-chief Scooter Braun. CL has been in show business since she was 15—“Korea is different,” she explains over a green tea lava cake, one of our many dessert dishes, “everybody auditions for the [record] labels.” She was one-fourth of 2NE1, the Asian sensation whose biggest hit has landed 145 million hits on YouTube to date (the song’s to-the-point title translates to “I Am the Best”). “2NE1 was special because we each had different characters and styles, for individual tastes,” she says, likening the band to the Spice Girls. “I was the tough one, the tomboy.” The toughness shows through, but so does CL’s curiosity and obvious savvy for the world and her place in it. These days, CL is to 2NE1 what Beyoncé was to Destiny’s Child. Poised to break through in the West with a debut single called “Hello Bitches,” you could say CL is the anti-Adele. She might soon be called the Korean Katy, and might one day be dubbed the new Nicki. Today, however, on her 25th birthday, it’s enough to know that CL is, without a doubt, a star. By signing up you agree to our User Agreement and Privacy Policy & Cookie Statement. By David Graver By Maria Geyman By Kiana Murden By Suzie Lechtenberg By Hannah Jackson By Christian Allaire More from Vogue See More Stories © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices CN Fashion & Beauty ",
    "title": "K-Pop Star CL Is Poised to Take Fashion By Storm | Vogue",
    "datetime": "2016-02-26T10:04:04.000Z",
    "url": "https://www.vogue.com/article/k-pop-star-cl-fashion"
}