{
    "text": "The writer says it is the time for politicians to wake up and show what they can do to make South Korea a world power politically and diplomatically. Kim Seong-KonThe Korea Herald \n\n\t\t\t\t\t\t\t\tView all posts by Kim Seong-Kon → The Korea Herald View all posts by Kim Seong-Kon → October 19, 2022 SEOUL – Travelling around the world these days, we can easily see Korean pop culture’s diplomatic power. K-pop and K-film have not only let the world know about South Korea, but also significantly upgraded its international image. Recently, I found out that the most highly rated Netflix movies included two Korean films, “Handmaiden” and “Mother.” Then, I came across an intriguing article in The Guardian, entitled, “Squid Game, Blackpink, kimchi pancakes … How did South Korea become such a world power?” The article begins with the subheading “One minute everyone wants a bit of British and American culture, the next you’re on the phone desperately trying to get tickets for the latest K-pop sensation.” In that article, Zoe Williams wrote, “My kid, along with my niece, is a ‘blink,’ which means a fan of Blackpink, a girl band that US and UK media always call the most successful “South Korean” act of all time, omitting to mention that — as the most followed music act on YouTube — they really don’t need the national qualifier.” Then, she continues, “The second most followed act, incidentally, is BTS — AKA the Bangtan Boys, also South Korean.” Then Williams further points out, “Likewise, people often call Squid Game Netflix’s most successful South Korean show of all time, when it is actually Netflix’s most successful show, full stop.” According to Williams, K-pop and K-drama have already transcended the limits of South Korea as a single nation and a particular culture and has now become a universal phenomenon. Thus, she argues that the adjective “South Korean” no longer fits the description of Korean pop culture. As Williams suggests in her article, the British and American people have assumed for a long time that they are the dominant culture that influences the world. It is true that in the past, British and American popular culture has fascinated foreigners who consequently wanted to learn English. The Beatles and Hollywood are good examples that have enchanted the international community. “Then one day, wham.” Williams wrote rather humorously: “The Anglosphere lost the worldwide popularity crown, and you didn’t even notice until one of your kids wants 400 pounds to go to a concert, and another one knows how to make kimchi pancakes and the third is trailing the new opinion that K-pop is for ‘neeks’.” The same phenomenon is happening in the US, too. Many of my American friends have confessed to me that their children are huge fans of K-pop, K-drama, and K-movies. My students at UC Irvine, too, were no exception. They enormously liked BTS and Korean films. I have found that many American students at Dartmouth are also big fans of “Parasite,” “Squid Game,” “Minari,” “All of Us Are Dead,” and “Kingdom.” Some time ago, a friend of mine who teaches at Dartmouth told me that one of his female American students was very much interested in learning the Korean language because she liked K-pop so much. When she found that her professor, too, was a fan of K-pop, she was delighted and at the same time felt a strong rivalry. Obviously, the same thing goes for Japan, as well. A Japanese intellectual, Sasaki Yasuo recently wrote to me, “My granddaughter is visiting us for Xmas/ New Year holidays. She is in the Graduate School at Kyoto University and has many Korean acquaintances, and she looks like she has some knowledge of the Korean language.” Then Sasaki continues, “Korean K-pop music seems to have her glued to Korean culture, deciding that she has to learn the language for about a year. Now I understand why she used to go to Seoul so frequently with group of friends. For me, it is a good example of cultural diplomacy that both sides should learn. It is regrettable however to see our relations so deeply ruined to an irreparable magnitude.” Today, South Korean films and TV shows have won so many prestigious international film awards such as the Academy Award and the Golden Globe Award, in addition to the film festival awards at Cannes, Venice and Berlin. BTS, too, has received so many music awards, such as artist of the year at the American Music Awards, MTV Video Music Awards and many others. It is true that K-pop singers and Korean film directors/actors have done a splendid job as cultural ambassadors. They have achieved what only a few Korean politicians have done in diplomacy. In fact, we could see that our pop culture stars’ recent accomplishments greatly contributed to cultural diplomacy. Traditionally, the Korean people are very good at singing, dancing, and performing on stage. Now, their extraordinary abilities enjoy international fame and attention. It is encouraging to hear that “South Korea has become a world power” through K-pop and film. Now is the time for our politicians to wake up and show us what they can do to make South Korea a world power politically and diplomatically. Kim Seong-kon Kim Seong-kon is a professor emeritus of English at Seoul National University and a visiting scholar at Dartmouth College. The views expressed here are his own. — Ed.                       ",
    "title": "K-pop: The power of cultural diplomacy - Asia News NetworkAsia News Network",
    "datetime": "2022-10-19T08:00:10+00:00",
    "url": "https://asianews.network/k-pop-the-power-of-cultural-diplomacy/"
}