{
    "text": "Seungri, a member of K-pop boy band BigBang, went ahead with a planned concert in Seoul on Saturday despite a snowballing sex-and-drugs scandal centring on a nightclub he was formerly involved with, although he issued an apology to his fans. Ahead of the solo concert at Olympic Park in southern Seoul, Seungri said he was sorry for causing “disappointment and concern” over controversies surrounding Burning Sun, a club in the citry’s Gangnam Station area. “I didn’t show a responsible attitude even though controversy flared up at a place I openly mentioned,” Seungri said onstage. “As a celebrity, I didn’t weigh my words deeply and I was careless.” His apology came just hours after a Chinese woman under suspicion of illegally providing drugs at the club voluntarily appeared before police for questioning. The woman is alleged to have sold narcotics to VIP customers, while other club employees are accused of drugging female customers with date rape drug gamma-hydroxybutyrate (GHB) to help male VIPs rape them. The Chinese woman denied all accusations. Burning Sun is at the centre of a scandal involving drug trafficking, sexual assaults and violence against its customers. At the weekend Seoul police expanded their investigation into alleged drug use at Burning Sun nightclub to all clubs in Gangnam. The scandal broke out after the club’s security staff beat up a 28-year-old man in late November. The man later claimed that the senior club officials and police officers colluded to make him out to be an attacker, not a victim. After the incident, a woman who visited the club claimed she was drugged and raped at the hotel that houses the club. A sex tape presumed to be taken inside the club was also leaked, leading to a police raid on the club on Thursday. Seungri, who had served on the board of directors of the club and actively promoted it on TV and online, resigned from his position after the scandal, saying he hadn’t directly engaged in its management. ",
    "title": "K-pop star Seungri apologises to fans for nightclub drugs and rape scandal ahead of Seoul concert | South China Morning Post",
    "datetime": "2019-02-18T22:00:42+08:00",
    "url": "https://www.scmp.com/culture/music/article/2186590/k-pop-star-seungri-apologises-fans-nightclub-drugs-and-rape-scandal"
}