{
    "text": "The musician announced an upcoming collaboration with Justin Bieber at the awards show, which featured Stevie Wonder, Icona Pop, Ylvis and Paris Hilton. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tLee Hyo-won South Korean pop star G-Dragon won four awards, including the artist of the year honor, at the 2013 Mnet Asian Music Awards (MAMA) in Hong Kong. Honors mostly remained close to home at the local equivalent of the MTV Music Video Awards, which this year featured such international artists as Stevie Wonder. The annual South Korean music awards ceremony at the end of the week attracted a sold-out crowd of 10,000, according to organizer CJ E&M, which produced this year’s event with Hong Kong’s Media Asia Group Holdings Ltd. It was broadcast live in 94 countries to reach some 2.4 billion viewers in Asia, Europe, North America, Africa and beyond. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news G-Dragon Backstage at KCON 2013 (Exclusive Photos) Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t11/25/2013 China’s largest online video site Youku Tudou served as online media partner, while more than 40 international corporations — four times the number compared to last year — took part as sponsors. “Thanks to the participation of major media partners, we’ve achieved direct and indirect marketing/PR effects worth 260 billion won [about $245 million], with a total economic value of 1 trillion won [about $942 million],” said Shin Hyung-kwan, head executive of 2013 MAMA. “MAMA is not a simple music event but can become a model for new cultural endeavors in the music industry.” A$AP Rocky, G-Dragon Named Style Icons at Top Asian Awards G-Dragon, the leader of Big Bang who made headlines earlier this year with a K-pop duet with Missy Elliott, won additional awards, including for best music video for his solo release “Coup d’Etat,” best male artist and best dance performance by a male solo performer for “Crooked.” Paris Hilton took to the stage to present one of the awards to G-Dragon. G-Dragon also announced that he would be releasing a collaboration with Canadian pop star Justin Bieber next year. “Justin is done recording his parts, and now I have to do mine,” he said. “You can look forward to hearing it next year.” Justin Bieber, G-Dragon Record New Song Meanwhile, MAMA featured special collaborations between big-name artists. Wonder performed “I Just Called to Say I Love You” with Hyorin of K-pop girl band Sistar and Chinese pop star Aaron Kwok. The veteran artist, who took part in the awards ceremony as a UN Messenger of Peace, also took home the non-competitive “Music Makes One” Ambassador Award. Norwegian online sensations Ylvis, this year’s “favorite international act” honoree, dressed up in animal costumes to dance and sing with a fellow YouTube sensation, local girl band Crayon Pop. And Icona Pop sang hit number “I Love It” alongside 2NE1’s CL. K-pop bands, including Exo and Infinite, won other major awards. The show also honored best artists from neighboring countries based on local music charts. Winners included China’s Kwok, Thailand’s Tor Saksit, Indonesia’s SM&SH, Japan’s Kyary Pamyu Pamyu, Singapore’s Derrick Hon and Vietnam’s Thu Minh.  Here is the full list of the 2013 MAMA winners: Competitive CategoriesSong of the Year: Young-pil Cho “Bounce”Artist of the Year: G-DragonAlbum of the Year: ExoBest Dance Performance – Female Solo: CL from 2NE1 “The Baddest Female”Best Dance Performance – Female Group: Sistar “Give It to MeBest Music Video: G-Dragon “Coup D’Etat (directed by Seo Hyun-seung)Best New Female Artist: Crayon PopBest Male Artist: G-DragonBest Dance Performance – Male Solo: G-Dragon “Crooked”Best Vocal Performance – Female: Ailee “U&I”Best New Male Artist: Roy KimBest Original Soundtrack: Yoon Mi-rae “Touch Love” from the TV drama The Master’s SunBest Dance Performance Male Group: SHINeeBest Vocal Performance – Male: Lee Seung-giBest Rap Performance: Dynamic Duo “BAAM”Best Band Performance: Busker Busker “Love, at First”Best Female Group: Girls’ GenerationBest Male Group: InfiniteBest Female Artist: Lee Hyori Non-Competitive CategoriesRed Carpet Special Award: Lee Jung-hyunDiscovery of the year: BaechigiStyle in Music: SistarNext Generation Global Star: ApinkSony MDR World Wide Performer: InfiniteInternational Favorite Artist: YlvisMusic Makes One Ambassador Award: Stevie WonderBest Concert Performer: Lee Seung-chul International CategoriesBest Asian Artist –China: Aaron KwokBest Asian Artist –Thailand: Tor SaksitBest Asian Artist –Indonesia: SM&SHBest Asian Artist –Japan: Kyary Pamyu PamyuBest Asian Artist –Singapore: Derrick HonBest Asian Artist –Vietnam: Thu Minh Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "title": "K-Pop Star G-Dragon Wins Four at 2013 MAMAs – Billboard",
    "datetime": "2013-11-25T11:13:19+00:00",
    "url": "https://www.billboard.com/music/music-news/k-pop-star-g-dragon-wins-four-at-2013-mamas-5800718/"
}