{
    "text": " SEOUL, SOUTH KOREA – Media OutReach – 8 July 2021 – K-pop fans come to Twitter to talk about what’s happening. While K-pop fans already flock to Twitter for their favorite artists’ Tweets, Spaces now gives fans a way to listen to their favorite artists’ voices – live. Joining K-pop artists’ live audio conversations brings them to life in a completely new way and helps fans to feel closer to their favorites.  Many K-pop fans have already used Twitter Spaces to hear directly from their favorites. Fans of artists like NCT (@NCTsmtown), TWICE (@JYPETWICE), BamBam (@BamBam1A), LOONA (@loonatheworld), and MonstaX (@OfficialMonstaX) among many others, have been able to listen to their favorites via live audio.   Worldwide Top 5 Twitter Spaces (Jan 1~June 30, 2021)  Already, 3 of the top 5 Twitter Spaces with the most listeners in the world as of June 30, 2021 have included K-pop artists: ●  GOT7 BamBam (@BamBam1A) set the record for the most listened-to Space since launch, with his Space on June 9. BamBam’s Space was noteworthy for including an interactive Q&A with fans, where fans were able to ask BamBam their questions themselves.(https://twitter.com/BamBam1A/status/1402624948124798976) ●  NCT (@NCTsmtown) was the first K-pop artist to host a Space, and set the record for the most listened-to Space before Spaces launched to the public. NCT’s Space was also the most liked Tweet for live Spaces, despite Spaces still being in beta at the time on March 11.(https://twitter.com/NCTsmtown/status/1369945981567922176) ●  TWICE (@JYPETWICE) was the first K-pop girl group to host a Space and connect with their fans, when they led an ‘After Party’ Space of the comeback premiere live-streaming of ‘Taste of Love’ on June 9.(https://twitter.com/JYPETWICE/status/1400829738793332742)  Other notable firsts As more and more artists continue to use Spaces, fans have a chance to join artists’ Spaces as they set noteworthy firsts for K-pop artists in Spaces. In addition to the firsts set by the above artists, other firsts include Sandara Park (@krungy21, 2NE1) becoming the first K-pop artist to join a Space as a speaker, to have an interactive Q&A with fans on March 8. #KCON:TACT became the first series of K-pop talk shows on Spaces, as KCON (@KCON_official) established the Spaces with two K-pop artists with pairings like ONF (@WM_ONOFF) & ONEUS (@official_ONEUS), SF9 (@SF9official) & P1Harmony (@P1H_official), to talk about KCON (@KCON_official) events.  K-pop artists also use #TwitterBlueroom to connect with their fans via livestreamed Q&A. Now, artists are using Spaces in tandem with #TwitterBlueroom to make their live connections with their fans better. ENHYPEN (@ENHYPEN) went live on Spaces immediately before going Live on #TwitterBlueroom, giving fans who were waiting for the Blueroom a fun way to connect with the group. ASTRO (@offclASTRO) used Spaces as an after party instead, going live on #TwitterBlueroom, then switching to Twitter Spaces after the Blueroom finished for a quick surprise to delight their fans.  Even the next wave of K-pop artists can be found on Spaces. As Twitter’s recent research “K-pop Generations Analysis by Twitter Usage” shows, K-pop artists are now utilizing Twitter even before their debuts to drive excitement and gain fans, like new K-pop boy group JUST B (@JUSTB_twt), which debuted at the end of June 2021. JUST B opened its Twitter handle in advance on May 21, but everything about its debut was kept confidential. JUST B utilized Twitter Spaces as the first time that the world heard its members’ voices, which fans were able to share live with each other.  Beyond K-pop Other parts of K-culture see the benefits of Twitter Spaces, and are starting to use them more as well. Cine21(@cine21_editor), the most influential film magazine in Korea, hosted a Space for six prominent movie journalists around the 2021 #Oscars, where the journalists shared their predictions and analysis live, as well as discussed major moments like ‘Minari’ star Yuh-Jung Youn’s win. In another K-culture Space, before the #TwitterBlueroom live-streaming for the K-movie ‘The Book of Fish’, actors (Seol Gyeong-gu, Byun Yo-han) and film director (Lee Joon-ik) joined a Twitter Space to drive up excitement. Hip Hop artist Simon Dominic and popular webtoonist Jongbeom Lee are among others that have had conversations with fans on Spaces.  YeonJeong Kim, Head of Global K-pop & K-content Partnerships at Twitter, said, “One of fans’ favorite parts of #KpopTwitter is feeling closer to their favorite artists, and Twitter Spaces bring them even closer than ever before. Spaces is where live audio conversations happen, and it’s just getting started, meaning that fans can look forward to even more of their favorite K-pop, Kmovie, and Kdrama stars trying new ways to connect using Spaces live.”  K-pop fans also have used Spaces proactively to share their stories among fans and to show their support towards their favorite artists, since Twitter launched Spaces on May 4 globally. On July 2, EXO-L (EXO’s fandom) and IGOT7 (AHGASE, GOT7’s fandom) drove an ‘EXOxGOT7 Streaming Party’, hosted by fan @exo9sh, creating a ‘playlist’ together on Spaces for about 8 hours, helping the hashtag #EXOxGOT7 trend worldwide.  Follow your favorite artists on Twitter right now to get real-time updates about Topics and more.  K-pop and K-content related Twitter Spaces ●      GOT7 BamBam: https://twitter.com/BamBam1A/status/1402624948124798976 ●      NCT: https://twitter.com/NCTsmtown/status/1369945981567922176 ●      TWICE: https://twitter.com/JYPETWICE/status/1400829738793332742 ●      LOONA: https://twitter.com/loonatheworld/status/1409783712955330563 ●      JUST B: https://twitter.com/JUSTB_Official/status/1395575110250110980 ●      Sandara Park (2NE1): https://twitter.com/krungy21/status/1368924818821685254 ●      ASTRO: https://twitter.com/offclASTRO/status/1379786395246465024 ●      ENHYPEN: https://twitter.com/enhypen/status/1390283685807628292 ●      KCON:TACT: https://twitter.com/KCON_official/status/1404755569890766850https://twitter.com/KCON_official/status/1402158455251628032 ●  Kmovie – Cine21 about #Oscars: https://twitter.com/cine21_editor/status/1386207798963302400 ●      Kmovie – The Book of Fish: https://twitter.com/TwitterKorea/status/1369959546819506179  Twitter is what’s happening and what people are talking about right now. To learn more, visit about.twitter.com and follow @Twitter and @TwitterKorea. Let’s talk.  #Twitter   ",
    "title": "K-Pop is Leading 'Twitter Spaces' Globally; 3 of The Top 5 Most Listened-to Twitter Spaces Are K-Pop Artists | Macau Business",
    "datetime": "2021-07-07T16:00:00+00:00",
    "url": "https://www.macaubusiness.com/k-pop-is-leading-twitter-spaces-globally-3-of-the-top-5-most-listened-to-twitter-spaces-are-k-pop-artists/"
}