{
    "text": "Subscribe for full access to The Hollywood Reporter Subscribe for full access to The Hollywood Reporter The fashion world has all eyes on a country better known for music and skincare. By \n\n\tTamar Herman, Billboard Ruffles, unicorns, and grunge came out in full force at this week’s Concept Korea show to highlight why the fashion world has all eyes on a country better known for music and skincare. In its fourteenth season, the Korean-government sponsored show has become a New York Fashion Week staple. Backed by the sonic amalgamation of hip-hop, K-pop, and the New York Orchestra, Korean designers Yohanix, KimmyJ, and Greedilous (pronounced “greedyous”), each brought their own flair to Pier 59 on Thursday morning. Yohanix’s aggressively dark streetwear contrasted with the lines presented by KimmyJ and Greedilous as the former’s playful, fantastical outfits took their neon cues straight from the ‘70s and the latter’s bright graphics wowed the audience. Altogether, the three designers presenting at Concept Korea offered a general representation of South Korea’s populist attitude towards fashion through their highly accessible clothing lines.  Brought to New York by the Korea Creative Content Agency (KOCCA) and hosted by the Korean Ministry of Culture, Sports, and Tourism, Concept Korea’s aim is to spread up-and-coming designers and the style culture of South Korea. While K-beauty and Korean pop culture, including K-pop, television dramas, and film, have growing presence around the world, South Korea’s designers are still angling for their place in the international fashion scene. “The main objective of Concept Korea and KOCCA is to focus on the fashion more,” said Kyeonghwa Ji via translator ahead of the event. “We expect that New York Fashion Week will help raise interest in the designers and sales ahead of their upcoming shows in London, Paris, and Milan.” Korea’s fashion-forward culture has led to the country’s recognition as a burgeoning style hub and trendsetter. South Korea is often a predictor of what fashion trends eventually emerge in America and Europe. For example, Seoulites were flaunting chokers more than a year before the ’90s trend resurfaced in the U.S. The mainstay of Korean fashion is its versatility, and designers featured at Seoul Fashion Week typically eschew couture in favor of favor wearable, comfortable fashion.  Yohanix’s punk rock line meshed urbanwear with elaborate details, including asymmetrical hems, heavy metallic embellishments, and open-faced jeans creating what designer Yohan (Taegeun) Kim calls “street carpet” fashion. “It’s a combined word of streetwear and red carpet,” said Kim, who graduated from the London College of Fashion and worked with Balmain Paris before starting his own line, which has since graced popular K-pop stars like Choi Sooyong and Kim Taeyeon of Girls’ Generation. “We try to imagine that whoever is wearing our garment in the street would look like she can be on the red carpet.” Free-flowing ruffles and lace were paired with leather, spray paint smiley faces, and graphic T-shirts to create the designer’s idea of “street carpet” fashion. The youngest of the three, and fan favorite amongst K-pop stars such as f(x), Sistar, Girls’ Generation, and AOA, KimmyJ flaunted the definition of high fashion. Casual items such as bright track suits, khakis, athletic wear, and jean overalls contrasted with her poppish unicorn-emblazoned items and flowing robes based on Korean hanboks. “I wanted easy, everyday outfits that utilize special silhouettes,” KimmyJ’s Heejin Kim said via translator. “I added a lot of embroidery featuring easy western motifs and Asian aspects, and also mixed in ‘70s hip hop [style].”  The morning ended with Greedious’s flamboyantly patterned line; not a single outfit lacked the brand’s typical bold graphics. Despite the colors and wild designs, the collection featured a more professional tone than the preceding lines, showcasing business suits, blazers, slacks, and dresses alongside more casual pieces. Designer Younhee Park incorporated structured ruffles and Lucite heels into the collection for added flare. “I wanted to make a collection specifically for New York.” Park told The Hollywood Reporter via translator. “I really want to see more color in New York City. It’s all black! I made pieces that can easily be mixed and matched naturally with the black New Yorkers love so much.” Park, whose clothes have been seen on everyone from Beyonce to popular California-born K-pop star Amber from the girl group f(x), also expressed feeling more international awareness of Korean fashion following the rise of interest in K-beauty and Korean pop culture in general. “Because of the popularity in K-fashion, I feel that there’s more of an interest by the media and the world in Korean designers,” said Park. “So I’ve been able to grow more as a designer, as myself, because of it.” While Hallyu, or the Korean Wave, predominantly revolves around pop cultural exports, the phrase extends to style, occasionally referred to as K-fashion. Because of their popularity, Korean actors and K-pop stars are regarded as trendsetters worldwide and several have made appearances at New York Fashion Week in the past. While prominent Korean stars were absent from Concept Korea this year, models walked down to several K-pop songs rearranged to match the accompaniment of the New York Orchestra, including Baauer’s “Temple” featuring M.I.A and G-Dragon, the frontman of K-pop boy band BIGBANG. The finale, “Good Boy” by G-Dragon and BIGBANG’s Taeyang was a fan favorite, with many audience-members opting to stay until the end of the performance to record one of Korea’s trendiest exports and post it on Instagram. Over by 11 a.m., Concept Korea made a compelling, and stylish, argument about the artistry coming out of South Korea’s creative minds.  Sign up for THR news straight to your inbox every day Sign up for THR news straight to your inbox every day Subscribe for full access to The Hollywood Reporter Send us a tip using our anonymous form. ",
    "title": "K-Pop Fashion New York Fashion Week – The Hollywood Reporter",
    "datetime": "2016-09-08T22:17:13+00:00",
    "url": "https://www.hollywoodreporter.com/lifestyle/style/k-pop-fashion-new-york-926897/"
}