{
    "text": "Indian stocks plummeted Monday late afternoon after a circumspect start to the week, with yields on 10-year US treasuries breaching the 5% threshold for the first time since the Global Financial Crisis and stoking concerns that the persistent rise in global risk-free rates will further elevate the risk premium on emerging market assets. Torrent Pharma’s bid to acquire the stake of the promoter, the Hamied family, in Cipla has stalled over valuation differences, said people with knowledge of the matter. That has derailed plans to create one of India’s biggest pharmaceutical companies, at least for now. India is formulating a plan to lower the dependence of its supply chains on China. The Niti Aayog has been tasked with drawing up the strategy, which will focus on bridging the country’s trade deficit with its neighbor over time and suggest measures to secure supply chains from risks stemming from geopolitical developments. (Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates. ETPrime stories of the day Nassim Nicholas Taleb, the man who foresaw the 2008 crash, has another prophecy on the cards What makes TVS a clear outperformer? It’s not a Hero Splendor or a Honda Activa-like product. Is Anil Agarwal’s Vedanta sailing against high tides of mounting debt? PM Modi attends Dussehra celebrations Delhi Ramleela committees to burn Effigies of... On cam: Interrogation of captured Hamas gunmen How Gaza war could become a regional conflict B'wood celebs at Durga Puja pandal in Mumbai Hospital blast: 'Rockets were fired from Gaza' Mahua caught in her own web of lies: Shazia Ilmi Israel unrest: Top Hamas commander killed by IDF Signed affidavit voluntarily: Hiranandani Israel unrest: 'We know there's complicity by Iran' POWERED BY Voltas Beko 8 Place Settings Table Top Dishwasher (DT8S, Silver, Inbuilt Heater) 10% OFF Lenovo IdeaPad Slim 3 Intel Core i3-1115G4 11th Gen 15.6\" (39.62cm) FHD Laptop (8GB/256GB SSD/Win 11/Office 2021/3 Month Game Pass/Arctic Grey/1.65Kg), 82H803TXIN 35% OFF IFB 30 L Convection Microwave Oven (30SC4, Metallic Silver), STANDARD 29% OFF Philips Ac1215/20 Air Purifier, Long Hepa Filter Life Upto 17000 Hours, Removes 99.97% Airborne Pollutants, 4-Stage Filtration with True Hepa Filter(White) 31% OFF HUL Pureit Eco Water Saver Mineral RO+UV+MF AS wall mounted/Counter top Black 10L Water Purifier 48% OFF GoPro HERO9 Action Camera with Free Enduro Rechargeable Battery - Waterproof Action Camera with Touch Screen 5K Video 20MP Photos 1080p, Dual Screen (2 Year Warranty on Camera) 46% OFF Elica 60 cm 1200 m3/hr Filterless Autoclean Kitchen Chimney (FL 600 SLIM HAC MS NERO, Touch + Motion Sensor Control, Black) 54% OFF Trending Now Hot on Web In Case you missed it Top Calculators Top Definitions Top Videos Top Searched Companies Top Prime Articles Top Market Pages Top Story Listing Top Slideshow Private Companies Top Commodities Follow us on: Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Reason for reporting: Your Reason has been Reported to the admin. Log In/Connect with: Will be displayed Will not be displayed Will be displayed Stories you might be interested in ",
    "title": "K-Pop News: K-pop and future impacts of its dominance: Experts' views on fandom of Korean culture - The Economic Times",
    "url": "https://economictimes.indiatimes.com/news/international/us/k-pop-and-future-impacts-of-its-dominance-experts-views-on-fandom-of-korean-culture/articleshow/93691411.cms"
}