{
    "text": "The forerunners of groups such as BTS, and known as the first generation of K-pop idols, ’90s bands such as Shinhwa are getting into the music charts and will be performing live in the autumn for their legions of fans Long before boy band BTS enjoyed their spectacular rise in the global music scene, there were idols who paved the way for the rise of K-pop today. A number of so-called first generation K-pop idols including H.O.T., Shinhwa and g.o.d are putting on shows in the latter half of the year. These groups were most active from the late 1990s to the early 2000s, and ushered in the active fandom culture with large fan clubs mobilised to support the artists. The most notable among them are H.O.T., a now-disbanded five-member boy group, consisting of Moon Hee-joon, Jang Woo-hyuk, Tony An, Kangta and Lee Jae-won. The band’s debut in 1996 and had many hit songs including Candy, Happiness and We Are The Future, will make a return to the stage in mid-October for their first concert since disbanding in 2001. Although the band officially broke up more than 15 years ago, their fans’ desire to see them perform again have continuously fed rumours that a reunion was imminent. Their comeback concert in October will take place at the Seoul Olympic Stadium, where they held their last concert in 2001. Sechskies, a six-member boy band that rivalled H.O.T. in the late 1990s, will hold a concert marking their 21st anniversary as well. The band members also reunited on Infinite Challenge in 2016, more than a decade after their split in 2000. After their concert on the TV show, the group’s five active members – Eun Ji-won, Lee Jai-jin, Kim Jae-duck, Kang Sung-hoon and Jang Su-won – joined entertainment company YG Entertainment and released a remix album. Last year, to mark their 20th anniversary, the band released their long-awaited fifth album Another Light” which entered the Billboard World Albums chart at No 10. Meanwhile, Shinhwa, a six-member boy band who debuted in 1998 with Eric Mun, Lee Min-woo, Kim Dong-wan, Shin Hye-sung, Jun Jin, and Andy Lee, will celebrate their 20th anniversary this year by releasing a special album Heart, on August 28, followed by concerts on October 6 and 7. The longest-running Korean boy band in existence, with no change in its members, have continued to release albums and hold concerts under the management company its members established together in 2011. Five-member K-pop idol group g.o.d, who debuted in January 1999, are gearing up for concerts between November 30 and December 2, to commemorate their upcoming 20th anniversary. Following the departure of Yoon Kye-sang, the members pursued solo careers from 2005, but regrouped as a quintet and made a comeback in 2014. Regarding the recent massive comeback of late 1990s K-pop groups, experts say these idols provided a safe haven for the generation who were avid teenage fans when those groups were most active. “The generation who gave birth to the new fandom culture then has reached their late 30s and early 40s now. With the prolonged economic downturn for years, they are the ones who feel the economic pinches in their lives the most,” said an official at a local entertainment agency. “Although they might find the new fan culture – as seen in the TV idol survival show Produce 101 series – quite fresh, they find more comfort in those old stars’ songs they leaned on during difficult times.” ",
    "title": "K-pop comebacks: Shinhwa, H.O.T., Sechskies and g.o.d. to put on anniversary shows for fans | South China Morning Post",
    "datetime": "2018-08-22T20:00:18+08:00",
    "url": "https://www.scmp.com/culture/music/article/2160797/k-pop-comebacks-shinhwa-hot-sechskies-and-god-put-anniversary-shows"
}