{
    "text": " Super Junior and Leslie Grace promotional photo for\"Lo Siento\"  Last year, South Korea’s entertainment industry saw a major impact after being cut off from the Chinese market due to cooling political relations between the two countries over the installment of the defensive THAAD missile system. This led to renewed efforts by K-pop acts to move into the Japanese market, and even topping charts there. They also began focusing more on other markets: North America, Southeast Asia, the Middle East, all were new frontiers, but it’s to the Latin American market where one of K-pop's most monumental shifts is happening, with local interest to match the South Korean music industry's aspirations. There's been a lot of lead up. 2017 saw an increase in Latin pop-inspired K-pop songs, such as KARD’s “Hola Hola” and SF9’s “O Sole Mio,” and the first KCON in Mexico, and the trend has continued into 2018, with several releases drawing inspiration from the Latin market. The latest was put out on May 18, when BTS dropped their Love Yourself: Tear, an album that has since become the first Korean album to top the Billboard 200. One of the most talked-about songs on Tear was “Airplane pt. 2,” a tango-pop track co-written by “Havana” songwriter Ali Tamposi. Serving as a sequel to “Airplane” off of J-Hope’s Hope World mixtape from earlier this year, the track celebrates the group’s international success by comparing them to traveling mariachis. It includes shout-outs to Brazil and Mexico City, cities that the group performed in last year, and is the latest sign of K-pop’s shifting focus on Latin markets. It came on the heels of the most successful Latin Pop-K-pop song to date, Super Junior’s recent collaboration with Leslie Grace and producing duo Play-N-Skillz, “Lo Siento.” A cross-cultural song that features Korean, Spanish, and English, it is the first-ever K-pop single to land itself on Billboard’s Latin Digital Song Sales Chart, where it peaked at No. 13 upon its release in April. Unlike many past east-meets-west projects that have come out of the K-pop world, this wasn’t a one-stanza feature, or a variant of a previously-released song, like when Ricky Martin’s English-language “Vente Pa’ Ca” gained a feature from Red Velvet’s Wendy. Instead, “Lo Siento” is billed as a song by both artists, rather than Super Junior “with” or “featuring” Leslie Grace. According to Leslie Grace, “Lo Siento” came about after Super Junior decided to revisit the inspirations of 2014’s “Mamacita” for their Replay release, an extended version of last year’s Play album, spurred on by the success of hits like “Despacito” and “Mi Gente.” “They had seen the huge phenomena that has been going on in Latin pop music, and they knew that they have a huge fan base in Latin America, and had a tour coming up,” she said. A veteran boy band that blew up in 2009 with the success of their hit “Sorry Sorry,” Super Junior last performed in Latin America in 2016, when they held two Super Camp shows in Mexico. The group’s label, SM Entertainment subsidiary Label SJ, approached Play-N-Skillz, who suggested Leslie Grace as a female vocalist to feature on the track. “They called me. Yesung and some of the team members from Super Junior’s team were in the room, and they kind of explained the idea that they had, and I instantly was all for it because I loved being able to fuse different sounds and just bringing together cultures.” In a break from K-pop collaborative tradition, “Lo Siento” features Dominican-American singer Leslie Grace in a prominent role not only of the song but also in its music video, putting her on just about equal ground to the members of Super Junior instead of just appearing for a few moments and disappearing. She flew to South Korea to film with the act, and she learned the choreography so as to be able to perform it in the video and with them during Super Show 7 shows in Argentina, Peru, Santiago, and Mexico City. (The act performed it with KARD in South Korea.) Both Leslie Grace and Play-N-Skillz also had their own sets during Super Junior's concerts, which were well received by the crowd. Shifting gears from the norms of K-pop collabs paid off when the song was released on April 12, and drew immense attention, landing it on the Latin Pop Digital Song Sales Chart. Its music video also saw a lot of attention, and has since surpassed the YouTube views of every single Super Junior has put out since “Mamacita” in 2014. At the time of publication, “Lo Siento” had been viewed over 28.3 million times, while Play’s “Black Suit” was at 24.9 million. Interest from audiences in Latin America in K-pop is growing rapidly: Soompi Spanish, an offshoot of the popular English-language Korean entertainment site, has seen 40% year on year growth between the first quarters of 2017 and 2018, according to a rep. Accordingly, Super Junior is hardly the only act hoping to connect with fans in Latin America; several other artists, including BTS, KARD and Dreamcatcher, have toured there in the past. KCON, a hybrid convention and music festival dedicated to South Korean pop cultural content, brought its event to Mexico City last year. It had over 33,000 attendees, according to a representative of organizer CJ E&M. Upcoming tours, including Eric Nam's and GOT7's, will head to Mexico, where Nam filmed his recent music videos. While there has been no similar event in 2018, Leslie Grace said that will be performing with Super Junior at KCON 2018 NY in June. They’re also hoping to bring the tour back to other Latin American cities in the future. “We’re setting the bar for cross-cultural collaborations, which is something that has never been [done] in this realm and that is huge,” said Leslie Grace. “So it’s just been fulfilling to see that, at the end of the day, people connect to good music no matter what a good song in that way is really, really, really, really cool.”   ",
    "title": "K-Pop Turns Toward Latin American Market With Collaborations And Tours",
    "url": "https://www.forbes.com/sites/tamarherman/2018/05/31/k-pop-turns-towards-latin-american-market-with-collaborations-tours/"
}