{
    "text": "With music video to Idol, signature track on Love Yourself: Answer album, breaking a YouTube record, band embark on world tour by explaining its meaning: happiness only lasts for fleeting moments, so seize them K-pop stars BTS have been talking about the meaning behind their latest “Love Yourself” album and world tour. The album’s main track, Idol, is a call to “seize the day” and find happiness, band member RM said, as he likened the tour to a festival. “When you think of a festival, the preparations take a very long time, but the festival ends after a brief moment and leaves behind tonnes of garbage,” RM said at a press conference before the start of the first concert. “I think life is the same. Happiness only lasts for fleeting moments and only leaves behind a few snapshot images,” he said. “After grappling with many questions, we want to send the message that [we should] enjoy life and seize these fleeting [happy moments].” The “Love Yourself” concert tour – which was launched with two shows in Seoul last weekend – will take the band to 16 cities in the United States, Canada, Britain, the Netherlands, Germany, France and Japan and will run until February next year. The tour started after Friday’s release of Love Yourself: Answer, the finale of the four-part “Love Yourself” album series, which explores the search for identity. The single Idol contains many references to BTS’ previous songs and its video has already received around 90 million views on YouTube. The EDM song and its music video are primarily based on South African beats and, unusually, adopted elements from traditional Korean music and traditional Korean imagery such as the hanbok garment and a pavilion. The adoption of traditional Korean elements was accidental, not intentional, the members said, indicating that they picked them up while searching for images of festivities. “It wasn’t that we wanted to bring in Korean elements because we have done so well [as a Korean act],” says band member Suga. “We wanted to show something like a festival that brings together people of difference races, sexes, ages,” he said, referring to the music video’s last scene, where a diverse crowd dance with the boy band. “On this album, we wanted to free ourselves [from pressure] and play with our fans like at a party,” he said. The Idol music video broke a YouTube record by garnering more than 56.26 million views within 24 hours of its release, breaking the previous record set by Taylor Swift with Look What You Made Me Do, which accumulated 43.2 million views in its first day. Asked to pinpoint the reason for their phenomenal success at home and abroad, Suga pointed to the band’s strength in combining music packed with social messages, while RM cited the members’ single-minded focus on concert performances. “Many people see the main reason for our success as our communication skills, but I can say for sure that’s wrong,” Suga said. During the tour, BTS members who typically focus on performance – Jungkook, J-Hope and Jimin – will demonstrate more of their musical side, while the vocal and rap-focused members – V, RM and Suga – will draw on their performance skills when each of the members sing solo. “I am one of the performance members. [But this time] I will focus on rap and live singing. Since performance is my strength, I will strike a balance between them,” J-Hope said, referring to his solo performances during the world tour. After wrapping up the hugely successful “Love Yourself” series, the members have yet to plan their next project. RM said he wants to work on a new subject on how he relates and contributes to society. “I am not sure whether this is what the company [Big Hit Entertainment] is also considering (for the next production), but this much I think I can tell you,” RM said. ",
    "title": "K-pop giants BTS launch world tour after releasing final Love Yourself album, and tell fans to ‘seize the day’ | South China Morning Post",
    "datetime": "2018-08-28T20:01:18+08:00",
    "url": "https://www.scmp.com/culture/music/article/2161618/k-pop-giants-bts-launch-world-tour-after-releasing-final-love-yourself"
}