{
    "text": "We use cookies and other tracking technologies to provide services in line with the preferences you reveal while browsing the Website to show personalize content and targeted ads, analyze site traffic, and understand where our audience is coming from in order to improve your browsing experience on our Website. By continuing to browse this Website, you consent to the use of these cookies. If you wish to object such processing, please read the instructions described in our  Cookie Policy /  Privacy Policy. Interested in blogging for timesofindia.com? We will be happy to have you on board as a blogger, if you have the knack for writing. Just drop in a mail at toiblogs@timesinternet.in with a brief bio and we will get in touch with you. Riddhi Gupta, Co-founder of 1 2 101 Twenty years ago, if someone told you that songs, TV shows, and movies from a country that is 5000 km away and in a language completely foreign would be loved and cherished by millions of Indians across the country, you would have laughed. But the rise of K-pop, or Korean pop culture, especially music, has shown us that The Korean Wave, Hallyu for short, is a phenomenon unlike any other in the music world. As per an organization that represents the recorded music industry worldwide, the International Federation of the Phonographic Industry, South Korea was the fast-growing music market in 2020. The impact of the Hallyu is such that it has even helped the nation of South Korea add tremendous amounts to its economy. Take, for example, the 7-member K-Pop group BTS (also known as Bangtan Boys), who alone have helped South Korean economy gain over $4.9 billion through their art. Hallyu is the biggest cultural export out of South Korea and has become a significant driver of global culture and is represented through innumerable Netflix K-dramas and is further evident in the rising popularity of Korean skincare regimens. According to a survey done in 2021 regarding the popularity of K-pop worldwide, a vast majority felt that K-pop isn’t just for fans and is, in fact, far more popular and widely known than previously thought. It is this popularity that has led to many people aspiring to learn the unique and eye-catching K-pop dance routines not just in India but around the world. Where did it all begin? Artists Park Chae-seon and Lee Ryu-saek released the first K-pop album – Yo Pungjin Sewol, back in 1925, but K-pop as we know it today began in 1992 with the emergence of Seo Taiji and Boys. Later, K-pop gained worldwide recognition through the phenomenon termed the BTS effect after the BTS group, which set a record in 2020 for most views in 24 hours for a music video on youtube by attracting more than 101.1 million views for their hit song “Dynamite”. They broke their own record again in 2021 with the music video for “Butter”, which received over 108.2 million views on YouTube in just 24 hours of debut. Rise of Kpop in India The rise of K-Pop in India can be traced to the Northeastern states in the late 90s. The entry of K-pop in India can be attributed to a ban by separatist rebels on all forms of Indian entertainment, music and more. The ousting of Bollywood created a cultural vacuum which K-pop then filled in all its forms – music, shows, movies, and more. As years passed, The Hallyu wave remained strong and even spread to other northeastern states like Manipur, Assam, Mizoram, and Nagaland. Furthermore, it also led to the rise of local dance groups inspired by K-pop, such as The Kousins, a group from the state of Tripura that has nearly 10,000 subscribers on YouTub and does dance covers of popular K-pop songs. Elsewhere in India, the first interaction with K-pop for the majority was through the 2012 global viral hit “Gangnam Style” by singer PSY, but the meteoric rise in K-pop came during the lockdown with many Indians developing a taste for songs from K-pop bands such as BTS, Exo, Twice, Blackpink, Got7 and TXT. In 2021, BTS beat Bollywood and Tollywood singers and music to top Twitter India’s music trends. What makes K-pop so popular in India? Decoding a cultural phenomenon is never easy, but a few factors top the list. First up, of course, are the catchy melodies and lyrics of Korean songs. Many of the songs speak about an idea of love that is more pure and romantic, which is not necessarily present in today’s Western or Bollywood songs. This makes it attractive to young fans in particular. And many Korean songs have a mix of Korean lyrics with English catchphrases, which gives the songs a right mix of newness and familiarity. During the pandemic, Indians got a chance to dive deep into Korean culture and art. Before that, the language barrier was a hindrance that stood in the way of K-pop’s popularity. But during the lockdowns, Indians who were stuck at home got the time to invest in learning about K-pop and consume content. The gain in K-pop popularity during the period is evident from the data of music streaming platforms such Saavn, Gaana, Wink music, Youtube, etc. These platforms received millions of streams for songs from bands such as BTS, EXO, and BLACKPINK, many of which continue to trend among or even at the top of Bollywood and Tollywood songs even to this day. The third factor is the astounding choreography of K-pop songs. K-pop songs are choreographed with dextrous and intricate choreography that makes them truly stand out from other songs. Many K-pop stars get the chance to be in bands only after training with entertainment studios for years. The cost of training K-pop star averages around $3 million. Korean artists train for 8-9 hours a day for several weeks to learn dance moves and replicate them. And they’re so good at it that they even perform these routines flawlessly when they do live performances. In addition, entertainment companies hire choreographers from all over the world to get the perfect catchy dance moves for songs. Dance and K-pop Dance is such a big part of K-pop songs that many K-pop bands put out separate music & dance performance videos for their single songs. And these music videos are extremely popular. Blackpink’s dance performance video for & How you like that, for instance, has 1.07 billion views. This is almost the same as its official music video for the same song, which has nearly 1.08 billion views. There are entire YouTube channels devoted to teaching the dance moves from these videos. And K-pop bands also put out regular dance challenges on YouTube and Instagram, where fans can upload videos of them dancing to these tunes and win several prizes. Many youngsters with a passion and talent for dance or actually using these contests to show off their moves and earn a fan following in the process. K-pop includes elements of hip hop, b-boying and popping into its routines. Even though K-pop routines are difficult and exacting, they are not impossible to learn. With the right training and guidance, K-pop dance routines can be learned by someone who has passion and talent and dedication. However, there are not many dance teachers out there who can teach K-pop dance. And not everyone can access the best teachers because of time constraints and the place they live in. Learning online from the best teachers is a solution to this. Many online dance academies enable students to learn dance, music, and more, no matter where they stay. By learning online, students can practice the dance moves over and over again until they get it right, as the classes can be viewed any number of times they want. Most of all, by learning online, students get access to the best instructors from the comfort of their homes. They get the right guidance on how to become stage-ready and confident. The K-pop wave has only just started in India. In the years to come, we will witness its popularity rise even more, and talented K-pop fans should make use of this time to learn, grow and become the next dancing star.   Views expressed above are the author's own. Beyond the strip: If civilian suffering in Gaza is not reversed, chances of a wider Middle East conflict are wider The Gaza Trap: Of course, Israel must exercise restraint. But beyond outrage, how are Arab govts helping? Virat Kohli and the virtue of selfishness Here is how India can afford to host 2036 Olympics PM don’t preach: Stand on Hamas attack shows change in India’s foreign policy ‘Finish Hamas…remove Netanyahu…then talk peace’: In conversation with Ehud Olmert, former Israeli prime minister. He tells Rudroneel Ghosh the way forward for Israelis and Palestinians Question for Netanyahu: Who takes charge of Gaza? What’s really dangerous about the Israel-Hamas war While the Gaze is on Gaza: The last two weeks since Hamas’s brutal attack have shown that it is upon Israel to recognise that only in Palestinian well-being can it find real long-lasting security Milords, shouldn’t women decide? Interested in blogging for timesofindia.com? We will be happy to have you on board as a blogger, if you have the knack for writing. Just drop in a mail at toiblogs@timesinternet.in with a brief bio and we will get in touch with you. Chennai Talkies Juggle-Bandhi The Underage Optimist,TOI Edit Page Erratica,TOI Edit Page,Tracking Indian Communities Copyright © 2023 Bennett, Coleman & Co. Ltd. All rights reserved. For reprint rights: Times Syndication Service ",
    "title": "K-pop: The next big dancing trend on the block",
    "datetime": "2022-05-27T21:44:57+05:30",
    "url": "https://timesofindia.indiatimes.com/blogs/voices/k-pop-the-next-big-dancing-trend-on-the-block/"
}