{
    "text": "Korean girl bands TWICE and Gfriend, and boy bands BTS and Seventeen, have made the leap into the music market in Japan, and their popularity could burnish country’s image there, but experts doubt it will bring about a political warming Girl band TWICE, for instance, are red hot in Japan. The band appeared on a year-end television music show, and in February the group starred in a commercial for cellphones. Meanwhile, top boy band BTS, though less physically visible in Japan, sold 500,000 albums in the neighbouring country last year, going double platinum. These successes indicate the Japanese market is ready to rave about K-pop again. The South Korean sound’s initial popularity in Japan was led by bands such as BoA, TVXQ, Girls’ Generation and Kara. But in 2012, then-South Korean president Lee Myung-bak visited the disputed Dokdo Island (known as Takeshima Island in Japan) and diplomatic relations between Seoul and Tokyo were frozen. This affected cultural ties. But slowly, as bands such as TWICE (which have three Japanese members) appeal to Japanese music fans, and the global frenzy over the boy band BTS naturally lands in Japan, the K-pop industry is once again more willing to make big leaps into the music market there. Last month, rookie K-pop boy band Seventeen said they would release their debut Japanese album on May 30. The announcement came at a Seventeen concert in Yokohama, Japan, the first leg of the band’s 2018 Japanese Arena Tour, which also featured concerts in Osaka and Nagoya. Similarly, girl band GFriend will make their Japanese concert debut in May. For the past two years, the six-member band have gained significant popularity for such hit songs as Rough and Glass Bead. Aside from their own concerts, Seventeen and GFriend will take part in the KCON Japan convention of Korean pop culture on April 13 in Chiba, east Tokyo, joining other K-pop stars such as Wanna One, TWICE, Wooyoung of 2PM, Gugudan, Pentagon, Sunmi, Monsta X, SF9, Samuel, Stray Kids, Golden Child and Fromis 9. Solo singers Junggigo, known for the 2014 top Korean hit Some, and Samuel also released albums in Japan last month. Could this heightened surge in South Korea’s soft power – music in particular – play a role in untangling thorny, rough knots in the political arena between the two neighbouring countries? “I think it’s better to understand that the Japanese music market gives merit to Korean musicians. The criteria for gauging how active an artist is in the Japanese market should be in the number of concerts. South Korean musicians such as Big Bang used to perform there frequently,” says Jang Min-gi, project researcher at Korea Creative Content Agency. The Japanese market remains open to South Korean musicians, where their popularity can turn into long-lasting fandom. “The advancement of more Korean pop artists into the Japanese market makes sense,” Jang says. “As to whether we can anticipate heightened activity in pop culture to affect political ties, it would be realistic to assume Korea’s national image may improve in the eyes of the public, but whether that image improvement will spill over into political issues may vary by issue.” “For K-pop or hallyu [the Korean wave] to really take off in earnest, the ties between Seoul and Tokyo will have to pick up as well,” said Lee Geun, a professor of the Graduate School of International Studies at Seoul National University. How could diplomatic ties between the two turn warmer? “If … a liberal government takes power in Japan while a conservative one does in Korea,” said Lee. Read the original article in The Korea Times ",
    "title": "K-pop bands build fresh following in Japan – can Seoul harness music’s soft power to improve ties with Tokyo? | South China Morning Post",
    "datetime": "2018-03-13T20:05:25+08:00",
    "url": "https://www.scmp.com/culture/music/article/2137010/k-pop-bands-build-fresh-following-japan-can-seoul-harness-musics-soft"
}