{
    "text": "Print Yuuka Hasumi put high school in Japan on hold and flew to South Korea in February to try her chances at becoming a K-pop star, even if that means long hours of vocal and dance training, no privacy, no boyfriend, and even no phone. Hasumi, 17, joined Acopia School in Seoul, a prep school offering young Japanese a shot at K-pop stardom, teaching them the dance moves, the songs and also the language. She is one of an estimated one million other K-pop star wannabes, from South Korea and abroad, hoping to get a shot at super competitive auditions by major talent agencies that will take on just a select few as \"trainees.\" \"It is tough,\" Hasumi said in Japanese, drenched in sweat from a dance lesson she attended with 15-year-old friend Yuho Wakamatsu, also from Japan. \"Going through a strict training and taking my skill to a higher level to a perfect stage, I think that's when it is good to make a debut,\" she said. Hasumi is one of 500 or so young Japanese who join Acopia each year, paying up to $3,000 a month for training and board. The school also fixes auditions for its candidates with talent management companies that have been the driving force behind the \"Korean-wave\" pop culture that exploded onto the world stage in the past decade with acts such as global chart topping boy band BTS. The influx of Japanese talent that is reshaping the K-pop industry comes at a time of increasingly bitter political acrimony between the two countries that has damaged diplomatic ties. That the tension has done little to dent the K-pop craze among Japanese youth, and the willingness by Korean agencies to take on Japanese talent, speak to the strength of the ties between their people, according to one long-time observer. \"They're nuts about BTS over there in Japan,\" said Lee Soo-chul, board member of Seoul-Tokyo Forum, a private foundation with members of diplomats and business executives from both countries. K-pop groups, and veteran Korean musicians, are selling out concert halls throughout Japan, said Lee, a former head of Samsung Group's Japanese operations. \"There is no Korea-Japan animosity there.\" Deep Freeze Tensions rooted in Japan's 1910-1945 colonization of Korea have risen after South Korean court rulings against Japanese firms for forced labor, and amid a perception in Korea that Japan's leadership has not adequately atoned for its colonial past. But the popularity of Korean culture and K-pop music is on the rise in Japan, with many fans and artists saying they are not bothered by the diplomatic tension. \"I might get criticized for being Japanese, but I want to stand on a stage and make (South Koreans) know Japanese can be this cool,\" said Rikuya Kawasaki, a 16-year-old Japanese K-pop star hopeful who auditioned unsuccessfully in Tokyo for Acopia School. For schools and agencies, Japan's music market - the second largest after the United States and bigger than China - is a big prize and many have been on a campaign to recruit Japanese talent. \"It will be good if Japan and South Korea will get along through music,\" Hasumi told Reuters during a break from her Korean language class. Some Japanese transplants have already made it big. The three Japanese members of the girl band Twice helped make the group the second most popular act in Japan, after BTS. Their success has prompted JYP Entertainment, the South Korean agency backing Twice, to plan the launch of an idol group comprising only Japanese girls. JYP declined to comment for this story. Agency officials are reluctant to discuss their success in Japan and the infusion of Japanese talent, wary of fueling a politically charged backlash, industry sources said. Hard Road to Stardom There's no shortage of Japanese hopefuls willing to train under talent agencies' watchful eye, some having left successful careers back home in search of K-pop fame. \"I've heard stories about no free time or not being able to do what I want. But, I think all of K-pop stars who are now performing have gone down the same road,\" said Nao Niitsu, a 19-year-old college freshman from Tokyo. During a visit to Seoul paid for by her mother, herself a die-hard BTS fan, Niitsu auditioned for 10 agencies and was accepted by five. Debut is elusive, unlike in Japan where it is easier for idols to get a start and then can hone their skills and work on their appeal with the fans. Miyu Takeuchi said it wasn't a difficult decision to leave a 10-year career with a top idol band AKB48 back home in Japan to sign with the K-pop agency Mystic Entertainment in March as a trainee. Even with her experience, she has seven hours of vocal training a day and two-hour dance lessons twice a week, plus early morning Korean lessons. She is not allowed to have a boyfriend but she says she has no regrets, despite the fact there is no guarantee she will make it. \"I don't know how long my training period will be, but it has to reach a point where my coaches and management company say 'Miyu, you are a professional!'\" ($1 = 111.1600 yen)  ",
    "title": "K-Pop Stardom Lures Japanese Youth to Korea Despite Diplomatic Chill",
    "url": "https://www.voanews.com/a/k-pop-stardom-lures-japanese-youth-to-korea-despite-diplomatic-chill/4906772.html"
}