{
    "text": "K-pop celebrity BTS members are taking a break from performing. SEOUL, South Korea -- K-pop's BTS is about to get some R & R. All seven members of the all-Korean boy band are going on vacation for the first time since their debut in 2013. Representatives of the band did not specify how long of a break they'd be taking. \"BTS will be going on an official and extended period of rest and relaxation,\" Big Hit Entertainment said in a statement on Sunday. \"This [break] will provide them with a chance to enjoy the ordinary lives of young people in their 20s, albeit briefly.\" BTS is the first K-pop boy group to top Billboard's main album chart three times in the U.S. The band consists of seven members: RM, Jungkook, Jin, Suga, J-Hope, Jimin and V. Fans around the world embraced the news -- 20 minutes after Big Hit Entertainment posted the statement regarding BTS' vacation, #happyvacationbts was trending on Twitter. \"The biggest response from fans was 'Finally!,'\" Juliana White from Kansas, a BTS fan since their debut, told ABC News. \"Fans care about the members and want them to get some rest as well. Plus there's finally time to review some of the BTS content that's already been released.\" \"BTS members have strived relentlessly, producing their own songs, practicing for concerts and communicating with fans on social media. Fans wondered how they were able to keep up with all this,\" Kim Dahee, another longtime fan, told ABC News. \"I hope they take their time to freshen up enjoying what they have achieved after all those years of hard work.\"  Most BTS fans sympathized with the band's need to take some rest, but there were also fans wistful about BTS' absence. \"I'm a little worried that the popular interest in BTS may dwindle while the photos and videos they used to post online for fans almost everyday are cut off completely,\" Song Yeryung, a student majoring in communications at a Seoul-based university, told ABC News. \"Life's going to feel empty without the joy of looking at BTS' newest photos and videos.\"  A pop culture columnist in Seoul pointed out that BTS was setting a good example for other revered K-pop bands. \"BTS is setting a good precedent for other K-pop groups in that they are taking an official break from their hectic schedule,\" Ha Jae-keun, a pop culture expert in Seoul, told ABC News. \"Though it is unclear how long BTS will be away from the industry, it won't deteriorate the fame or attention they have accumulated so far.\" 24/7 coverage of breaking news and live events ",
    "title": "K-pop locomotive BTS announces break from performing - ABC News",
    "url": "https://abcnews.go.com/International/pop-locomotive-bts-takes-announces-break-performing/story?id=64919977"
}