{
    "text": "Associate Professor of Korean Studies, The University of Western Australia Joanna Elfving-Hwang does not work for, consult, own shares in or receive funding from any company or organisation that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.  University of Western Australia provides funding as a founding partner of The Conversation AU. View all partners The phenomenal success of K-pop (Korean pop music) and its biggest export bands such as BTS, EXO, Blackpink, MONSTA X and Red Velvet can largely be credited to their highly active and dedicated fandom. This is a group not to be dissed, as Channel Nine discovered recently after airing a segment on “global crazes” featuring BTS, a Billboard chart-topping band. The program’s attempt to poke fun at the band quickly drew the ire of dedicated fans (known as the BTS Army) who felt the presenters had not only disrespected the band, but also its diverse, global support base. They mounted a social media campaign, accusing Nine of racism. The hashtag #Channel9Apologise went viral and the station issued a statement apologising for offending anyone. K-pop fans often complain how Australian mainstream media is, in their view, racist and insensitive in its reporting on the groups. While it may be tempting to dismiss fan activity as evidence of highly successful marketing techniques, these fan networks actually perform an increasingly important role as a source of social belonging. Contrary to common perception, most fans are not socially withdrawn nerds – because the social aspect of K-pop fandom is central to being a true fan. Fan clubs typically consist of global networks of loosely organised local chapters, comprising diverse nationalities and ages. There are also many middle-aged and retired fans, some of whom (such as Shinhwa fans) have grown older with their idols. While there are no reliable statistics quantifying the number of K-pop fans, The Korea Foundation (which is affiliated with Korea’s ministry of foreign affairs) recently estimated the number of fans of Korean pop culture in general to be 89 million across 113 countries. BTS was the first Asian act to surpass 5 billion streams on Spotify. They have over 9 billion views on YouTube and 20.7 million Twitter followers, compared with EXO’s 5.7 million , Blackpink’s 2.5 million and MONSTA X’s 3 million. Read more:\n      Explainer: what is K-pop and J-pop? K-Pop bands are not simply perceived as pretty and talented people to be admired from afar. They are seen as the ultimate embodiment of “ideal self” achieved through hard work. The work of transforming from an ordinary mortal into a K-pop star is often well documented through groups’ official social media feeds or behind-the-scenes videos. Polished (often cosmetically enhanced) appearances are seen as the hallmark of investment in self. K-pop band members also work hard to reduce social distance between themselves and their fans; either by meeting them in person or using social media. In a recent tweet, BTS member J-Hope posted a photo in anticipation of a fan meet the following day, with the line “Thank you Army! See you tomorrow!”.  The use of purple heart emojis has a special significance, representing the connection the band and BTS fans share. Frequent livestream interactions with fans via Instagram live or South Korean video service VLive also reduce the social distance between  idols and fans, who can quickly build a real sense of attachment to their idol. As “ideal selves”, K-pop stars rarely say or do anything controversial and are thus stable, predictable role models. (Although when they do trip up, as happened recently with the former Big Bang boy band member Seungri, the fall from grace can be swift). K-pop fandom involves much more than buying merchandise or attending concerts – fans are cultural producers themselves. They run fan sites, create self-designed band merchandise and produce fan chants: lyrics shouted out during performances at collectively agreed points of the song. Fan chants are also popular in Japan, but K-pop fans have taken them to a new level. They are disseminated through fan sites and social media. Fan clubs even have unique pet names bands use, such as Exo-L (“L” for the love the band has for their fans) and V.I.P. for Big Bang (denoting how each fan is important to them). Committed K-pop fans also demonstrate their dedication through orchestrated mass voting to ensure the bands’ success in music charts and awards. In return, the idols acknowledge the importance of their fans, and actively seek to nurture this relationship. “Thank you to ARMYs for giving us such a big happiness. We will never forget the magical time we had with you at the Magic Shop”, said BTS in a tweet after wrapping up the fan meetings in Seoul and Busan. The Seoul event was beamed live to global audiences – allowing for those outside Korea to “take part” through live streaming and commenting. Philanthropy is an increasingly important part of K-pop fandom. Many fan clubs pool resources to support charities. BTS have also promoted UNICEF, joining forces with it in their Love Myself campaign, which raised more than US$1.4 million (much via direct donations from fans). Western media should also bear in mind that bands such as BTS are not popular in spite of being Korean, but precisely because they are Korean. The number of Australians learning Korean has grown exponentially over the past few years, with five major Australian Universities now offering a BA major in Korean Studies. Much of that interest has likely have been sparked by an encounter with Korean popular culture. Critics may also be wise to note that fan clubs such as the global BTS Army are increasingly succeeding in what years of government policies in Australia have failed to do: a real and meaningful desire to connect with cultures outside our borders. Copyright © 2010–2023, The Conversation ",
    "title": "K-pop fans are creative, dedicated and social - we should take them seriously",
    "url": "https://theconversation.com/k-pop-fans-are-creative-dedicated-and-social-we-should-take-them-seriously-119300"
}