{
    "text": "Now in its fifth year, the festival features dance crews, mouthwatering cuisine, and traditional Korean kids’ games. by \n    Melissa Meinzer November 13, 2021 5:00 AM Image courtesy of the K-Pop Festival and Taste of Korea The 2019 K-Pop Festival Korean culture has been having a major moment on the world stage these past few years. This Saturday, soak it in without stamping your passport at the K-Pop Festival and Taste of Korea at Clayton High School. Now in its fifth year, the festival features dance crews competing for glory (and prizes) with routines choreographed to K-Pop jams. All of that dancing—and watching—is sure to work up an appetite, and Taste of Korea has you covered there, too, with Korea’s mouthwatering cuisine. The festival started humbly with local university-affiliated troupes, but it was clear there was major demand, so it’s grown significantly. “We started at UMSL, and it was only, like, four teams competing—very small scale, but it was great and people loved it,” recalls Mindy Park, K-Fest's director, who's with the Korean American Association of St. Louis. “We were, like, ‘We’ve got to keep this going!’” This year’s event, hosted by the Korean American Association of St. Louis and sponsored by the Overseas Koreans Foundation, features nine groups competing for cash prizes. The dance crews are coming from as far as Chicago and Indiana—and only about half are university groups. “It’s just grown, we’ve gotten a lot of traction,” Park says. Besides the dancing and the food, this year brings a new aspect inspired by Netflix’s runaway hit Squid Game, an extremely high-stakes version of Korean kids’ games. If you’re familiar with the hyper-violent show, this might give you pause, but don’t worry—this is significantly lower stakes than the win-or-die situation on the show. “It’s just basically traditional games that people play as children,” says Park. Food, dancing and now traditional games. “It’s a triple threat,\" says Park. Tickets are $10 and include general seating and a bulgogi rice bowl, or $25 for VIP tickets for front section seating and a Korean buffet dinner. Doors at 2:30 p.m., show at 3 p.m., Taste of Korea at 6 p.m. Tickets are available online or at the door. Image courtesy of the K-Pop Festival and Taste of Korea November 13, 2021 5:00 AM  P.O. BOX 191606\r\n                        St. Louis, MO 63119\r\n    \t\t\t314-918-3000 Contact Us Copyright 2023 SLM Media Group. All rights reserved. ",
    "title": "K-Pop Festival and Taste of Korea comes to Clayton this weekend",
    "datetime": "2021-11-13T05:00:00",
    "url": "https://www.stlmag.com/culture/fairs-festivals/k-pop-festival-and-taste-of-korea-comes-to-clayton-this-week/"
}