{
    "text": "Some fans of HyunA and E’Dawn feel like they’ve been betrayed after the K-pop idols’ relationship was made public. Experts say while fans are more forgiving nowadays, some still feel like they have been lied to Singer Lee Yong rose to stardom in 1981 after his debut song Wind achieved phenomenal success. His popularity, however, was short-lived. Lee had lied about his marital status and was found to have a wife. He disappeared from the public eye abruptly as angry fans boycotted the singer and his performances. Despite this, K-pop singer HyunA and boyfriend E’Dawn of K-pop group Pentagon are now facing a backlash from fans after their romantic relationship was made public. South Korean music fans have changed a lot since the Lee scandal in the 1980s. They no longer see their idols as their own possessions and have become more tolerant of stars’ romantic relationships with other celebrities or ordinary people. Not only was E’Dawn excluded from a Pentagon fan club event on August 11, Triple H – a group consisting of E’Dawn, HyunA and Hui, another member of Pentagon – have cut short promotion of the new song Retro Future. Some fans are demanding that E’Dawn leave Pentagon, saying he cheated on them and the group for two years while dating HyunA. “E’Dawn has been deluding his members and fans,” Pentagon fan @daengiegu wrote on Twitter. “Based on his words and actions, intended to show love for his girlfriend, we [fans] no longer want E’Dawn to be involved with … Pentagon.” On the other hand, another Pentagon fan @itzjstdazzle from Nigeria wrote: “The fact Korean fans say it’s their culture, a culture of not allowing a grown man to date because he is an idol, is not something they should be proud of.” Regarding the backlash among some Korean fans, culture critic Ha Jae-keun says that while some have been disappointed, it didn’t mean they object to their idols dating like ordinary people. But he noted fans want their idols to control their emotions, at least in the public eye. “Regarding E’Dawn, fans may feel betrayed because they thought he was distracted by his celebrity girlfriend and he isn’t solely devoted to his role as a musician and entertainer. This sense of betrayal is behind some fans’ boycott of his CDs, concert tickets and other related goods,” Ha says. He added that HyunA may suffer less damage to her career because the veteran idol has a more mature reputation and solidified fan base. “In the early 1990s, if there were rumours of dating, female stars were attacked viciously by fans, with―some even receiving death threats. Compared to then, the situation has become much better,” he says. Some say HyunA and E’Dawn drew the ire of fans partly because they initially denied reports that they were together, but later reversed position and admitted they had been together for two years. Another critic, Park Ji-jong, says a singer’s public image plays an important role in whether their fans support their relationships. “It’s true that a majority of fans feel betrayed when they hear news about their favourite idols dating. But more and more fans are seeing it as a private issue for their idols and simply cheer them on,” Park says. Park also points out that as the entertainment industry transformed along with the liberating force of social media, idols have started to express themselves more openly and communicate with their fans directly. “HyunA and E’Dawn admitting their relationship to local media and posting a message on Instagram instead of communicating through their agency is noteworthy in understanding the shifting power game between agencies and artists,” he says. ",
    "title": "K-pop’s HyunA and E’Dawn relationship backlash shows fans still feel cheated when their idols fall in love | South China Morning Post",
    "datetime": "2018-08-17T20:03:29+08:00",
    "url": "https://www.scmp.com/culture/music/article/2159970/k-pops-hyuna-and-edawn-relationship-backlash-shows-fans-still-feel"
}