{
    "text": "Most Popular [From the Scene] Don't remember Itaewon alley as place of death, victims' families say G-Dragon booked for drug use South Korea, Qatar agree to elevate ties, forge $4.6b industry partnership Former Olympic hero battles rumors surrounding her groom-to-be S. Korea goes all out to contain lumpy skin disease Man fined for assaulting soldiers who refused to praise Kim Jong-un, Putin Yoon pitches S. Korea's investment appeal to Middle East 4-meter deep sinkhole injures 1 in central Seoul Yoon meets Park, honors father in gesture of conservative unity [News Focus] A year after Halloween crowd crush, legislation remains stalled Start your day with a roundup of key stories from The Korea Herald with news and comment on all that’s happening in Korea. Published : April 28, 2015 - 13:59 Link copied Local entertainment agencies are expanding their businesses to cosmetics, golf, gaming and tourism to take advantage of the growing popularity of K-pop culture in the Asian market. Leading the trend is YG Entertainment, which recently became one of the top music agencies in the country.  YG, which manages the rapper Psy and K-pop groups Big Bang and 2NE1, has advanced into the booming cosmetics market to capitalize on the growing popularity of Korean beauty products in the Asian market. Last year, YG Plus, an affiliate of the agency, launched its own cosmetics brand, \"Moonshot,\" and a fashion brand, Nona9on.  The company also aims to have 100 billion won ($93.32 million) by 2017 in yearly sales from the clothing brand jointly launched with Cheil Industries, the fashion unit of Samsung Group. YG didn't stop there. In March, the agency jumped into the golf business, taking over G-Ad Communications, a golf marketing firm that houses professional golfer Kim Hyo-joo. After the takeover, YG has shown a plan to advance into manufacturing golf supplies and fashion and running golf academies. The agency's competitor, JYP Entertainment, recently started a new business. On April 17, JYP signed a contract with the Hong Kong-based international beverage brand Jax Coco to sell coconut oil and coconut chips and other products from the Hong Kong company in South Korean department stores and premium supermarkets.  In December, it opened SMTown@coexartium, a multipurpose cultural space, inside the COEX shopping mall in Seoul's posh Gangnam area mainly for Chinese and Japanese tourists who are K-pop fans. Visitors can enjoy a mix of holographic and live performances, attend programs that allow them to experience the lives of K-pop artists and buy souvenirs featuring S.M.-managed artists such as EXO, TVXQ, Super Junior and Girls' Generation there. S.M. says it plans to launch a package tour of the SM Town soon for Chinese fans in collaboration with tourism agencies in China.  The entertainment agencies' moves to diversify their businesses are seen as an effort to secure a new growth engine and spread their risk. \"There would be a limit in growth if we do our own job only,\" a YG official said, requesting not to be named. \"We eventually have to start a new business to go a step further in sales or earnings.\" (Yonhap)  The Korea Herald by Herald CorporationCopyright Herald Corporation. All Rights Reserved.  ",
    "title": "\r\nK-pop label chiefs advance into other industries",
    "datetime": "2015-04-28T13:55:24+09:00",
    "url": "https://www.koreaherald.com/view.php?ud=20150428000815"
}