{
    "text": "K-pop fans may soon have more official merchandise to spend their money on, as South Korea’s entertainment industry is going all out to embrace non-fungible tokens (NFTs) and the metaverse, with big industry names planning to bet on the new technology. One of the latest K-pop talent agencies pledging to join the NFT and metaverse race is Cube Entertainment, which manages popular artists and bands including Jo Kwon, BTOB, PENTAGON, CLC and (G)I-DLE. In November, the Kosdaq-listed company teamed up with Animoca Brands to form a joint venture dedicated to building a music metaverse and issuing NFTs. In an interview with Forkast.News, Ahn Woo-Hyung, CEO of Cube, said the sky’s the limit when it comes to investing in the new technology. Cube Entertainment, which manages popular K-pop artists and bands including Jo Kwon, BTOB, PENTAGON, CLC and (G)I-DLE, is betting big on NFTs and the metaverse.CUBE's CEO says there’s \"no upper limit\" to how much it will invest in NFTs and a metaverse for concerts pic.twitter.com/03rff0rd8m “We don’t really have an upper limit on investment,” Ahn said. “There’s really no upper limit on Cube investment because we have that sense of purpose that Cube artists and members should play a role in creating new experience and new value in this field.” Ahn added the company has formed a special team since last year to study NFTs and subsequently the metaverse, and is “continuing to put a lot of thoughts into it.” Ahn said he couldn’t share too many details about upcoming projects, “but what I can tell you is that music will be at the core, and the artists’ portraits and videos will be utilized in new and creative attempts that are fun and creative.” “This could be a very important momentum not only for our company but also for the entire entertainment industry,” Ahn said. Read more: NFTs and the music industry: K-pop’s new token economy Indeed, Cube is not the only talent agency that considers NFTs and the metaverse the next big thing. Back in July, JYP — a top K-pop entertainment agency that manages popular idol acts including girl group TWICE and boy band 2PM — partnered with Dunamu, a blockchain company that operates crypto exchange Upbit, to build an NFT platform using JYP’s content. HYBE, the label behind global boy-band sensation BTS, is also actively investing in the field. Last month, it announced that it has joined hands with Dunamu to digitize BTS goods into NFTs and explore possibilities of allowing fans to collect and exchange NFTs on the company’s fan community app Weverse. In an online video briefing released in November, HYBE founder Bang Si-Hyuk said the two plan to develop an NFT business under a new joint venture, which will “allow the artist [intellectual property-based] content and products that Hybe has showcased to date to become digital assets for fans.” South Korea-based Naver Z Corporation — the operator of metaverse platform Zepeto — has just raised 223.5 billion Korean won (US$189 million) in a Series B round, which included investments from SoftBank, Mirae Asset and major K-pop agencies JYP, YG Entertainment and HYBE. For K-pop singers, the rising NFT and metaverse wave could mean a new space for them to create something fresh and cutting-edge. “As idols who produce our own works, we are very proud of the creation we make and present. I’m very excited that a new system will be established that will make it easier for me to share my creations with more people,” said Kino, the main dancer, singer and rapper in PENTAGON, which debuted in 2016, in a video interview with Forkast.News. On top of singing and dancing, Kino is also known for his talent in painting and creating art. Kino added that a big reason why the K-pop market could grow rapidly is that the industry “is not afraid of introducing and combining new technologies these days.” As the Covid-19 pandemic continues to ravage the world, big entertainment companies have been making attempts to demonstrate how tech-savvy they are by offering unique virtual experiences for fans. For example, companies have been organizing online concerts and fan meetings with what’s called a multi-view streaming system that allows fans to view the live performances from different camera positions. The metaverse also beckons with K-pop groups planning virtual concerts. Seo Eun-Kwang, the leader of boy band BTOB — which was formed by Cube in 2012 — gave a sneak peek at the new fan experience in the works. “In conversations with the band and the company, we’ve started to talk about how to hold concerts in the metaverse,” Seo said. Ahn said many K-pop fans are not just into the music. “As they start to like our music, I think they start empathizing and sharing a bond with different aspects of [the artists’] lives,” Ahn said. “So their attention encompasses not only K-pop, but also K-drama and K-culture in general. They show interest in all the cultural elements that shape us up.” Seo said the metaverse can offer performers a new way to interact with fans, or “Melody” — the name for BTOB fans. “We can meet our Melody who we haven’t met [in the metaverse], so that’s what I’m most excited about.” However, the idea of NFTs and the metaverse may be intimidating for some fans. “There will be a bit of a steep learning curve. But K-pop fans are fairly persistent, so I can see them learning about it very quickly,” said Thomas Baudinette, a lecturer at Macquarie University in Sydney whose research interests include K-pop innovations, in an interview with Forkast.News. Areum Jeong, an assistant professor who teaches Korean pop culture at Sichuan University-Pittsburgh Institute, describes K-pop fans as being highly networked and dedicated. “They’re highly organized communities with very specific communal goals,” Jeong said. “Even if fans are not familiar with the process or how things work, they will teach you. They will team up. They will come up with how-to tutorials on YouTube or Twitter in like seven different languages.” Baudinette added that the fact that many K-pop companies are jumping on the NFT and metaverse bandwagon is a bit like “monkey see, monkey do” in order not to be left behind and to satisfy a cultural drive toward innovation. “If one of your competitors does something, you need to do it or you’ll be left behind,” Baudinette said. Timmy Shen is a Taipei-based journalist at Forkast. Previously, he wrote for Caixin Global and TechNode, covering topics ranging from fintech to fan economy. He also cares about LGBT+ issues and is a shabu shabu fanatic. Timmy holds an MS degree from Columbia Journalism School. Danny is a journalist at Forkast.News. Originally from South Korea, Danny has produced content for media companies in Korea, Hong Kong and China. He holds a Bachelor of Journalism and Business Marketing from the University of Hong Kong. Delivered weekly on Thursdays An unmissable weekly round up of the biggest stories in emerging tech from an Asian perspective, featuring commentary from Forkast Editor-in-Chief Angie Lau. Check out recent editions. Delivered weekly on Thursdays An unmissable weekly round up of the biggest stories in emerging tech from an Asian perspective, featuring commentary from Forkast Editor-in-Chief Angie Lau. Check out recent editions. ",
    "title": "K-pop agency Cube bets big on NFT and metaverse",
    "datetime": "2021-12-01T20:06:00+08:00",
    "url": "https://forkast.news/k-pop-agency-cube-bets-big-on-nft-and-metaverse/"
}