{
    "text": "Their first album since the suicide of member Jonghyu last year, ‘The Story of Light’ comprises five-track EPs showcasing the distinct styles that make the band chart-topping trendsetters By Kwak Yeon-soo The first instalment of the new album, led by the track Good Evening, hit the market on May 28, and the second, including title track I Want You, was released on Monday. The second EP hit the top spot on South Korean streaming services and the iTunes world albums charts in 25 countries, including Denmark, Spain, Greece, Finland and Poland. The third part of the new album – with the title track Our Page – is set for release on June 25. The Story of Light is the first SHINee album released since the suicide of band member Jonghyun last December. The remaining members admitted they’ve struggled since, but are trying to move on. “Our new album is a collection of all the images SHINee has showcased throughout the decade,” SHINee member Key says. “The first EP tracks mirror how others view SHINee, while EP No 2 reflects how we imagine ourselves. The third EP will consist of songs with a medium-tempo R&B style.” Fellow member Minho adds: “Our ability to give every song a distinct SHINee style is what makes us strong on the charts.” Although the now four-member band has built a reputation for artistic music and high-quality performances, the band members say they want to continue to be trendsetters and try new styles of music. “We are still young, fresh and eager to experiment with new musical concepts,” member Taemin says. “If I were a woman, I would definitely have fallen in love with SHINee.” When asked where they see themselves 10 years from now, leader Onew says: “I still want to be part of SHINee, and hope our fans stay with us.” The members revealed they’ve recently renewed their contract with SM Entertainment, one of South Korea’s main entertainment companies. Read the full story at the  Korea Times ",
    "title": "K-pop stars SHINee release new album in three parts to celebrate 10th anniversary | South China Morning Post",
    "datetime": "2018-06-14T20:19:04+08:00",
    "url": "https://www.scmp.com/culture/music/article/2150623/k-pop-stars-shinee-release-new-album-three-parts-celebrate-10th"
}