{
    "text": "BTS with Korean First Lady Kim Jung-sook, culture minister Hwang Hee, Met director Max Hollein, the museum's president and CEO Dan Weiss, Mike Hearn, the Chairman of the Asian Art Department, and  NYC's Commissioner for International Affairs, Penny Abeywardena Photo by Paula Lobo, Courtesy of The Met Monday was a busy day for K-Pop superstars  BTS. This morning, the Korean boy band, freshly minted as “special presidential envoy for future  generations and culture” by South Korean President Moon Jae-in, appeared with  the leader at the 76th session of the United Nations General Assembly in New  York and spoke to the power of today’s  younger generations to create a more positive and healthy world. And in the  evening, they joined the country’s First Lady Kim Jung-sook, a classically  trained singer, and culture minister Hwang Hee at the Metropolitan Museum of  Art, to present a gift from the South Korean government of lacquerware vessels by  Chung Haecho. “The eyes of the world  are on Korean culture—Korean dramas, Korean film, Korean music—but there are still  many great Korean artists who are yet to be discovered by the world,” said BTS  leader Kim Nam-joon at a bilingual reception on the Met’s rooftop garden,  underneath Alex Da Corte’s swinging Big  Bird sculpture, which he said he was \"very fond of\" . Kim added that in their new special envoy position, BTS felt \"a special sense of pride\" of being able to support the work of other artists from their country, and are armed with the mission “to try to spread Korean culture through the world and  to everyone around the world”. The gift of five richly hued vessels, Rhythm of the Five Color Luster (2013), based on the cardinal directions and five elements of East Asian cosmology, will be included in the Met’s first exhibition dedicated to the art form, Shell and Resin: Korean Mother-of-Pearl and Lacquer (13 December-5 July 2022). The show will present around 30 examples drawn from the museum’s collection, from an exceedingly rare 12th century trefoil box from the Goryeo dynasty (918-1392) to a mixed media painting by the contemporary artist Lee Bul. Chung Haecho (정해조, b. 1945), Rhythm of the Five Color Luster (2013), lacquer and hemp Photo by Paula Lobo, Courtesy of The Met The history and technical development of Korean lacquer, which traditionally features mother-of-pearl decorations inlayed in pigmented resin, will be examined in the exhibition, as well as the style’s significance across Asia, with examples of Chinese, Japanese, and Ryukyu (Okinawan) lacquers and South Asian mother-of-pearl. Rather than using mother-of-pearl,  Chung's focuses on Korean lacquer itself—called ottchil—experimenting with pigment  recipes to create works admired for their depth of colour and luster, according  to the Met. The artist’s works are also in the collection of the British  Museum, Victoria and Albert Museum in London, and the Philadelphia Museum of  Art. “We’re deeply grateful for this generous gift of contemporary lacquer vessels, a gesture that is particularly meaningful as we look ahead to 2023—when The Met will celebrate the 25th anniversary of our Arts of Korea gallery,” said the museum’s director, Max Hollein. The museum is also currently looking to endow its curatorial position for Korean art through a challenge grant from the Korea Foundation, Hollein said, adding that he and some of the curatorial team plan to travel to Korea next spring. This is not the first example of BTS wielding their \"soft power\" as cultural ambassadors. Last January, the hit band launched a series of five major public art projects, involving collaborations between some of the world's most significant artists and curators around the world. Connect BTS took place across five cities from January to March 2020—just before the coronavirus shut down much of  the international art world—with each artist commission the result of a curator who has \"resonated with BTS's philosophy\". In a statement at the time, BTS said that \"contemporary art and music are also two different worlds. This project is especially meaningful to us because it truly represents diversity and creates a collective, positive message for the world that we value. Through this project, we hope to return the great amount of love and support from our fans, Army, and all audiences.\" The band seems to have made at least one new fan at the Met today. \"Your big hit right now is 'Permission to Dance',\" said Hollein at the gift giving. \"That's exactly what we need right now, at what I hope is the tail end of the pandemic. We need to dance more. Thank you for being here.\" ",
    "title": "K-Pop superstars BTS help present gift from Korean government to the Metropolitan Museum",
    "datetime": "2021-09-21T00:09:40.834Z",
    "url": "https://www.theartnewspaper.com/2021/09/21/k-pop-superstars-bts-help-present-gift-from-korean-government-to-the-metropolitan-museum"
}