{
    "text": "Title track from nine-member band’s fifth EP, released on Tuesday, races to the top of the pop charts in Hong Kong, Taiwan and Southeast Asia, and accompanying music video scores over 21 million views, ahead of Twice tour The newest single from K-pop girl band Twice hit the top of music charts throughout Asia and the world within hours of its release on Tuesday. What is Love? is the title track from the band’s fifth EP and is a cheery, uptempo song, written and composed by Park Jin-young, the founder and president of K-pop company JYP Entertainment. This is the second collaboration between Park and Twice, a year after their successful project Signal. The lyrics speak about girls dreaming of love after learning about it through books, films and dramas. The music video for What is Love?, which parodies several romantic films, including La La Land (2016), Romeo + Juliet (1996) and Love Letter (1995), has received more than 21 million views on YouTube. The nine-member band’s EP album What is Love? is riding atop the iTunes album charts in 14 countries, including Indonesia, the Philippines, Chile, Argentina, Denmark, and Sweden. The title track has conquered the music charts in Hong Kong, Malaysia, Singapore, Taiwan, Thailand, and Vietnam, and it looks set to climb higher in other countries. In Japan, where Twice have already earned platinum status since their debut last year, all tracks from the album, including What is Love?, Sweet Talker, Ho!,  Dejavu and Say Yes are ranked high on the Line music song chart. Since Twice made their debut in 2015 with Like Ooh-ahh, the band have achieved phenomenal success and dominated music charts. Their songs Cheer Up,  TT, Knock Knock, Signal, Likey and Heartshaker swept music streaming charts shortly after they were released. Twice kick off a series of Asian concerts on May 18 in Seoul, before moving onto Saitama and Osaka in Japan, then Singapore, Kuala Lumpur and Bangkok. ",
    "title": "K-pop girl band Twice’s new single races to top of the charts within hours in Asia and around the world | South China Morning Post",
    "datetime": "2018-04-11T11:31:01+08:00",
    "url": "https://www.scmp.com/culture/music/article/2141207/k-pop-girl-band-twices-new-single-races-top-charts-within-hours-asia"
}