{
    "text": "Korean is rapidly growing in popularity, in a language-learning boom driven by the popularity of the country's pop stars. A desire to learn the lyrics of K-Pop hits like Gangnam Style has boosted the Korean language's popularity explode in countries like the US, Canada, Thailand and Malaysia. A report by the Modern Language Association shows that Korean uptake in US universities rose by almost 14% between 2013 and 2016, while overall language enrolment was in decline. The latest statistics show 14,000 students are learning Korean in the US, compared to only 163 two decades earlier. The language learning website Duolingo launched a Korean course last year because of rising demand. It quickly attracted more than 200,000 pupils. Professor Andre Schmid has seen a rapid rise at the University of Toronto, where he researches Korean history. When the university introduced a Korean class ten years ago, it had 30 students. Today it has 150 and an even longer waiting list. It has seen similar increases in the numbers studying Korean history. Prof Schmid says this has been driven by the popularity of Korean pop music and drama, and notes that the internet has brought the K-pop craze to the most unexpected places. \"Among my students I have a young woman who grew up in an isolated farm house in Grey County Ontario, but she chose the University of Toronto because she wanted to learn all about Korea,\" says Prof Schmid. \"That would never have happened 15 years ago. The phenomenon is enabled by the rise of YouTube, such that someone like her can have access to these cultural products in such remote places,\" he says. The wave of popularity for South Korean culture is known as \"Hallyu\". It began to spread outside of Korea in the 1990s and, today, K-pop bandslike BTS sell out stadia and top music charts around the world. It has become so widespread that a UN aid agency uses K-pop as a conversation starter in a project which connects young refugees from the Middle East with western students over Skype. The Korean language is even starting to change the way foreign K-pop fans speak. A survey of K-pop followers in Algeria found that most had started using Korean words and phrases in their daily conversation. The South Korean government is capitalising on its cultural assets by setting up 130 language institutes in 50 countries. Last year, the government funded a new Institute for Korean Studies at George Washington University in the US. \"This type of centre may attract people who are interested in Korea because of pop culture at first, but they can also expose those students to other parts of Korean studies, including politics, trade, history, and more,\" says Jenna Gibson of the US-based think tank the Korea Economic Institute. But K-pop fans should be aware that learning Korean is far from easy. A US state training agency on foreign affairs ranks Korean as one of the hardest languages for English native speakers. Ji Hyun Park fled North Korea and now lives in Manchester in the UK, where she teaches English for the tutoring service Chatterbox. \"Different languages are used to speak to adults and children - words like \"hello\" and \"goodnight\" are different depending on whether you are speaking to a child or an adult,\" she says. She says pronunciation is particularly difficult for English speakers, and that the lyrics sung by K-pop stars can confuse learners because they mix Korean and English together. Ji Hyun has noticed an increase in the popularity of Korean culture in the UK. \"When Gangnam Style was popular, my son was a teenager in high school and told me that his friends were all singing it even though they didn't understand what the words meant,\" she said. Will thousands of new Korean speakers around the world make any difference for isolated North Korea? Ji Hyun, who was held in a labour camp in North Korea before she escaped and now campaigns against human rights abuses country, says it can only be a good thing. \"\"It is good that we are learning the Korean language so that in future when people meet North Koreans, they can understand more about what is happening inside North Korea,\" she said. \"And North Koreans can learn about what is happening outside their country.\" More from Global education The editor of Global education is sean.coughlan@bbc.co.uk K-pop stars BTS top US album charts Hundreds of police search for Maine gunman as 16 feared dead Israeli tanks cross into Gaza for 'targeted raid' Humanity blasted and broken: Gaza through a medic's eyes Seoul crush: Survivors still tormented a year on The unending pain of India's sewer workers Bowen: Israelis and Palestinians fear worst is yet to come How two 4-year-olds were killed and social media denied it How one of gaming's lost sequels finally got made The chaotic search for Speaker... in 120 seconds. VideoThe chaotic search for Speaker... in 120 seconds Russia goes back to prisons to feed its war machine The dark side of touch-screen tipping Humanity blasted and broken: Gaza through a medic's eyes The town telling influencers to stay away What if a rogue nation dimmed the Sun? Why so many veterinarians suffer © 2023 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking. ",
    "title": "K-pop drives boom in Korean language lessons - BBC News",
    "url": "https://www.bbc.com/news/business-44770777"
}