{
    "text": "Author: Juliette Schwak, Franklin University Switzerland South Korea is launching a roadmap to export its COVID-19 management strategy. But the plan faces several limitations due to its specificities and the new fields of competition opened up by the pandemic.   South Korea’s lauded initial success in containing COVID-19 was the result of several factors: institutional memory built after the Middle Eastern Respiratory Syndrome (MERS) crisis, a community-oriented political culture, public–private synergies and governmental interventionism. South Korea may also possess a unique climate of political trust that was established both by the handling of Park Geun-hye’s impeachment and the government’s transparent sharing of information. Many states turned to South Korea’s Moon government for help in dealing with the COVID-19 health crisis. South Korea exported its test kits around the world and donated some to its Southeast Asian partners. The governments of South Africa and Kazakhstan made official requests to receive health management support from Seoul. Despite the cultural and political foundations of South Korea’s COVID-19 management strategy, Seoul has focused on its technical response to the pandemic in exporting its model. It pursued a strategy of ‘trace, test and treat’ (3T): tracing contacts of infected patients through information and communications technology, testing on a massive scale and isolating infected individuals. The government is devising a plan to export the 3T approach through the ‘K-Quarantine’ model, for which the government has allocated 11.4 billion won (US$9.5 million). South Korea submitted this model to the International Organization for Standardization to try standardise methods like RT-PCR testing, drive-through testing centres and non-hospital quarantine centres. The Korea Trade-Investment Promotion Agency also organised a commercial exhibition in Seoul in September 2020 to promote products and technologies associated with the K-Quarantine model. The roadmap to export K-Quarantine is first and foremost an economic one, which is in line with President Moon Jae-in’s economic priorities. The emphasis on innovative technologies aligns with government investments in digitalisation to transform South Korea into a technological leader. This also conforms with long-standing efforts to export South Korea’s development experience and expertise to developing countries. South Korea has actively pursued this strategy since it joined the OECD Development Assistance Committee in 2010. The promotion of K-Quarantine has been associated with an increase in official development assistance, particularly to Southeast Asia, where access to emerging markets will prove crucial for South Korea’s struggling economy. The K-Quarantine export is a commercial strategy to secure markets for South Korea’s health industries. Exports of K-Quarantine goods have been booming, particularly in Africa, and the government is trying to capitalise by opening new markets and reviving its export-oriented economy. The Ministry of Trade, Industry and Energy clearly articulated this vision, declaring that exporting K-Quarantine was a source of pride, but also an instrument to secure bioindustry markets. The overseas capital budget for the Export-Import Bank of Korea (KEXIM) has tripled to spur South Korea’s exports. The Ministry of Finance also announced a plan to support South Korean companies’ overseas infrastructure procurement bids. In June 2020, the Public Procurement Service (under the Ministry of Economy and Finance) signed a Memorandum of Understanding with the Korea Health Industry Development Institute and the Korea Institute of Procurement to help South Korea suppliers of K-Quarantine products gain global competitiveness. The K-Quarantine Expo focused on selling K-Quarantine products to foreign buyers, and trade fairs on technology and construction were organised to produce commercial synergies. The export of K-Quarantine contributes to a strategy of economic expansion where the developing world in particular promises many untapped opportunities. This strategy responds to domestic imperatives as well. On one hand, there is the public–private nexus shaping South Korea’s political economy — some chaebol have already benefitted from the pandemic and can shape governmental strategies. On the other hand, there is pressure to restore economic growth and create jobs amid soaring unemployment. While some large export-oriented businesses have benefitted from the pandemic, small businesses have seen major losses from restrictions on commercial activities. This will worsen the increasingly dualistic nature of South Korea’s economy and labour market. Despite these efforts to export South Korea’s COVID-19 management strategy, the K-Quarantine model faces limits. A model that relies heavily on technological know-how exposes developing countries to industrial dependency, as they often lack the production capacities and infrastructure necessary to develop such technologies. Digitalisation is also far from being an unproblematic solution, notably due to its consequences on employment. K-Quarantine also has competitors. Taiwan and New Zealand have also managed the pandemic well and could offer alternative strategies. Taiwan is working with foreign counterparts on epidemic prevention, and Taiwanese exports have boomed. Meanwhile, South Korea only started to vaccinate in late February 2021, lagging behind in the competitive field of vaccine diplomacy. Another obstacle to exporting the K-Quarantine model is COVID-19 difficulties at home. A new wave of infections has led to more restrictions, ‘pandemic fatigue’ and reduced compliance with social distancing measures, particularly among young South Koreans who account for the majority of recent COVID-19 cases. Overall, South Korea’s response to the pandemic relies on a specific political–economic configuration and a political culture resulting from the country’s unique modern history and legacies of the developmental era. These foundations may not be easily replicable elsewhere. Juliette Schwak is Assistant Professor of International Relations and Political Science at Franklin University Switzerland. This article is part of an EAF special feature series on the COVID-19 crisis and its im  Δ  Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. What about Vietnam, Cuba, and New Zealand’s Covid 19 management strategy?  July – September 2023\nFor electronic copies of back issues, links to the individual articles and to subscribe to the hard copies, see the EAFQ page. ",
    "title": "K-Quarantine: exporting South Korea’s COVID-19 management strategy | East Asia Forum",
    "datetime": "2021-03-11T11:00:08+00:00",
    "url": "https://www.eastasiaforum.org/2021/03/11/k-quarantine-exporting-south-koreas-covid-19-management-strategy/"
}