{
    "text": "It’s recruitment week. Greek chapters seem to be falling at your\nfeet, pleading for you to pledge with their letters. Unfortunately, no chapter seems to have the\nconnection you’re looking for. Instead, you want to be a part of something that\nwill focus on acceptance – especially acceptance of lesbian, gay, bisexual transgender and allied community members. Look no further; K-State has two Greek chapters specifically for you.  The Beta Mu chapter of Delta Lambda Phi International Fraternity is a progressive fraternity for men who identify as gay, bisexual, transgender or as a straight ally. With only 65 percent of chapters lasting beyond their fifth year, K-State’s Beta Mu chapter has been kicking it here for more than 13 years. “I had been going to LGBT and Allies, but I wanted a deeper connection to the community,” said Rylan Sampson, treasurer of Delta Lambda Phi and graduate student in mathematics. “DLP felt more personal for me I had a lot of friends who were involved already and who roped me in. It’s kind of like the mafia: once you’re in, you’re in.” DLP’s main philanthropy is the Trevor Project, a national organization whose goal is crisis intervention and suicide prevention for LGBT individuals between the ages of 13 and 24. The fraternity goes above and beyond, contributing with other organizations that strive to make K-State and Manhattan a better place, with events like Little Apple Pride and Fight World Hunger. “There was a previous event we did in memory of Jason Dockins, the brother we lost to suicide,” Sampson said. “About a year and a half ago, we had a memorial service at his tree. His family and friends got to speak, including his big brother. It was an honor to be able to sponsor that.” Just last week, the “Lambda Men” organized a candlelight vigil for Dockins, commemorating his life five years after his passing. Surrounding the tree planted in Hale Library’s lawn, a group a friends and supporters left inspirational messages swinging in the branches. “DLP has a pretty significant place in my life for me,” Sampson said. “Before I came to K-State, I was never out because I could never feel comfortable in my hometown. I only had a few friends who I knew and that’s it. DLP to me represents embracing friendships without having to hide yourself.” For those who identify as a LGBT woman, the Delta chapter of Gamma Rho Lambda is waiting. GRL is credited to being the first national lesbian sorority. It was first formed amongst the sand dunes of Arizona State University 10 years ago. In 2005, the sorority decided to spread the hands of diversity around the country. By 2009 GRL completed its goal of adding more chapters, which was the same year K-State’s chapter was charted. Still a fairly new addition to the K-State Greek system, the three active members are ready to expand the sisterhood. Unfortunately all active members of Gamma Rho Lambda were unable to be reached during the production of this piece. Rushing for either chapter will take place both in the spring and fall. ",
    "title": "K-State's Greek System Houses LGBT Community - The Collegian",
    "datetime": "2013-09-27T05:25:46+00:00",
    "url": "https://www.kstatecollegian.com/2013/09/27/k-states-greek-system-houses-lgbt-community/"
}