{
    "text": "The K-State Alumni Center sits on the edge of campus and is known for holding meetings, luncheons and large events. But the real question is: what does it do for the students of Kansas State University? Amanda Lee, assistant director of student programs, said the center loves having students walking through the building and encourages anyone to stop by anytime to check out the building or the Wildcat memorabilia room.  They also have small conference rooms available for students to use for studying or meetings free of charge. “If you rub the bronze statue of the Wildcat’s nose, located on the Terrace, legend says that you’re guaranteed an “A” on an exam and that we’ll beat KU,” Lee said. The K-State Alumni Association has many organizations for students like Wildcats Forever, K-State Student Ambassadors, Student Alumni Board and Student Homecoming Committee. Wildcats Forever is the Student Alumni Association and is currently 1,400 members strong this year making it one of the largest student organizations on campus. “For only $20, members receive a membership T-shirt, a collectible glass and a membership card with discounts to many favorite places in town. Some of the discounts include Call Hall Dairy Bar, Acme Gift, Colbert Hills and much more,” Lee said. Wildcats Forever also included events, contests and giveaways.  Scholarships, study snacks during finals week, pizza, and K-State apparel are just a few of the prizes students can attain from the organization.  Big XII Fridays are one way to get these prizes by simply wearing the Wildcats Forever membership T-shirt on campus and stopping by one of their booths.  K-State travel coffee mugs were given away on their last Big XII Friday. “I was part of Wildcats Forever all four years of college and still use a lot of the things today.  I wear the t-shirts all the time, use the cups and coffee mugs almost every day and have some of the rally signs hanging up  in my room,” Sarah Macke, 2014 alumna, said. The connection with K-State doesn’t have to end at graduation, the Alumni Association has an affordable membership program to still be part of the K-State family. “We are number one in the Big XII for the percentage of graduates who are members for 18 consecutive years,” Megan Jurgensmeier, associate director of membership of the Alumni Association, said. Each student receives a free one-year membership to the Alumni Association as a graduation gift from their specific college.  Aside from being part of the best alumni association in the Big XII, members receive the quarterly “K-Stater” magazine, a wall calendar, a discount at Colbert Hills, insurance discounts, special prices on K-State football tickets, retail benefits at your favorite stores and much more. “I haven’t used any of the discounts yet, but I do enjoy reading the K-Stater to keep up on what is happening at K-State and to keep up on any events going on with the university,” Macke said. “I also proudly hang my calendar up in the office just to irritate my coworkers who are avid KU fans.” The Alumni Association is hosting a Grad Breakfast on Dec. 11 for December graduates, and they have Grad Bash in late spring as well.  Both have giveaways for students and have more information available about the K-State Alumni Association. ",
    "title": "K-State Alumni Association promotes school spirit during, after college - The Collegian",
    "datetime": "2014-10-24T06:47:23+00:00",
    "url": "https://www.kstatecollegian.com/2014/10/24/k-state-alumni-association-promotes-school-spirit-during-after-college/"
}