{
    "text": "Ladies in evening gowns showcased their beauty and talents to Latin rhythms in Forum Hall on Saturday for the Hispanic American Leadership Organization’s fifth annual K-State Belleza Latina Pageant. This year’s theme was “Aztec Beauty,” and the event started with a group dance by all six competitors wearing traditional Penahos headdresses and Aztec-inspired costumes designed by the contestants themselves. “Because the majority of the ladies competing are of Mexican descent, we wanted to make it something that embraces our culture and our ancestors,” Viviana Ortiz, event coordinator and junior in animal sciences and industry, said. According to Gilbert Davila, assistant principal at Junction City Middle School, the competition began in the morning with an interview portion, where contestants were asked questions about their cultural background, career ambitions and why they wanted to participate in the pageant. The second half of the event reconvened in the afternoon, where the participants competed in swimsuit, talent and evening-wear events in front of an audience of 40 attendees, Denise Torres, president of the HALO, said. Talents ranged from dancing to playing the violin. Alejandra Gonzalez, junior in Spanish, performed a spoken-word poem, in both English and Spanish, about what she said she perceives as discrimination against Hispanics in America today. “I love both of my nations, both of my cultures, both of my countries,” Gonzalez said in her poem. “I love tamales as much as I love apple pie.” Davila, a veteran judge at the competition, said he was asked three years ago to be a part of the pageant when he was an assistant professor with the Staley School of Leadership Studies. “It’s enjoyable because you get to see all the wonderful talent and really intelligent young ladies,” Davila said. “When we interview them, you can see what they’re all about, what they’re working toward and the pride they take in their culture.” According to Torres, HALO was the organization sponsoring the pageant and all the money raised at the event goes to awarding the top winners with scholarships. First place receives a prize of $500 and the runner up wins $250, Torres said. “We try to help them financially because we all know the struggle,” Torres said. First-place winner and Miss Congeniality were awarded to Gonzalez. “I’m honestly a little bit shocked,” Gonzalez said. “I wasn’t too nervous and I guess everything happens for a reason.” First runner-Up, People’s Choice Award and Miss Photogenic, were awarded to Jessica Martinez, junior in social work. “It feels awesome,” Martinez said. “I’m glad Alejandra got to win; she’s a great contestant. I really wanted that crown, but I’m glad to be first runner-up. I will definitely try again next year.” According to Torres, all six contestants at the pageant are members of HALO but it is open to any Hispanic female students interested in competing. The pageant was formed five years ago with the purpose of bringing Hispanic women together to showcase their talents and build their confidence, Torres said. “All the girls say that even though they don’t win, they definitely gain that sense of empowerment and it’s definitely a confidence-booster,” Torres said. According to Torres, HALO serves as a liaison between the Office of Diversity and other multicultural organizations and helps promote Hispanic cultural awareness. “It’s a home away from home for Hispanics across the campus,” Torres said. ",
    "title": "K-State Belleza Latina Pageant showcases culture, beauty, talent - The Collegian",
    "datetime": "2016-05-02T04:51:41+00:00",
    "url": "https://www.kstatecollegian.com/2016/05/01/k-state-belleza-latina-pageant-showcases-culture-beauty-talent/"
}