{
    "text": "This Black History Month, I felt the need to shine a light on the Black American influence on K-pop and the industry as a whole. It is no secret that Black creatives have constantly made significant impacts on the world we live in now. With inventions like the toilet paper holder, scientific leaps like landing on the moon and foodie delights like potato chips, Black Americans have laid the foundation for many things we love today. One of the biggest areas we can see Black influence in is our modern music industry. Black artists have had a strong influence on blues, R&B, rap, hip-hop and soul, as well as rock and pop music.The modern Korean ‘idol’ industry also has its roots in Black artistry. Our current definition of K-pop ‘idol music’ originated in part from the popular boy group Seo Taiji and Boys in the late ‘90s.The group drew from many Western genres like hip-hop and rap to create their sound, inspiring many new industry trends. Seo Taiji and Boys added elements of Western fashion and rap that became the blueprint for future K-groups. What’s important to note about this is that much of the inspiration they took came from popular Black American music. While in our modern music industry much praise is given to K-groups for their ability to combine many elements in their art, from fashion to choreography, recognition must be given to those who laid the foundation. Today, there have been many incidents of appropriation of Black American culture among the K-pop scene in everything from hairstyles and clothing to language. The line between cultural appropriation and appreciation becomes significantly hazed when discussed within K-pop. Popular acts wearing traditional African American clothing and hairstyles or using the ‘n-word’ in their music have crossed the line into appropriation of Black culture. I do, however, want to note that many popular K-pop acts have spoken out on the influence Black artists have had on their art and industry. BTS leader and rapper Kim Namjoon, also known as RM, has said that Nas is his biggest lyrical inspiration. The group as a whole also donated $1 million to many Black Lives Matter programs, and their fandom matched this, totaling over $2 million from the group. When K-pop artists and idols speak up and recognize the influence and inspiration they gain from Black artists, their fandoms will follow and also give acknowledgment to them. This is only a snapshot of the history of KpPop and Black influence, but it is incredibly important that we give credit where credit is due, especially when discussing groups of people who are often overlooked. Black Americans have contributed too much to culture and our world to not be recognized for their creativity, artistry and hard work. So, remember as you enjoy your next playlist of pop and K-pop music to give acknowledgement to Black artists and creators. ",
    "title": "K-Weekly: K-pop, an acknowledgment of Black culture - The Tufts Daily",
    "url": "https://www.tuftsdaily.com/article/2022/02/k-weekly-k-pop-an-acknowledgment-of-black-culture"
}