{
    "text": "The R&B singer's 'Rebellious Soul' debuts at No. 2 thanks to new exposure through reality TV. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tErika Ramirez K. Michelle has endured personal and professional woes in her career, but this week the singer hits the Billboard 200 at No. 2 with her major-label debut, “Rebellious Soul” (Atlantic Records), with 72,000 copies sold, according to Nielsen SoundScan. It’s the highest debut on the Billboard 200 for a female R&B singer’s first album since March 2001, when Marsha Ambrosius’ Late Nights & Early Mornings also entered at No. 2. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tMickey\t\t\n\t\t\t\t\t\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news K. Michelle parted ways with RCA in 2011 after initially signing with Jive Records in 2008. “I wanted to get out of my label contract because of things that I couldn’t control that happened to me. I did not get dropped. They didn’t understand me, and a part of me thinks that I didn’t understand myself,” K. Michelle says. During the season-one taping of VH1’s “Love & Hip-Hop: Atlanta,” the singer/songwriter revealed that she was abused by ex-manager and former Jive music executive Mickey “Memphitz” Wright while at the label. (Wright denies the allegations.) Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tMona Scott-Young, the Brains Behind VH1's 'Love & Hip Hop,' Sounds Off on Sexism, Reality TV and…\t\t\n\t\n\n\n\n\t08/23/2013  A resilient K. Michelle continued to garner buzz, releasing five mixtapes between 2010 and 2013. She looked to MBK Entertainment’s Jeff Robinson to manage her, who admits to being hesitant at first due to her former label struggles. “K. Michelle asked me for a while to manage and I kept saying, ‘Nope.’ But we struck up a great friendship,” Robinson says. “A lot of people felt like she came with baggage, but I believe in forming my own opinions about people. Once I fell in love with her sincerity, the naysayers brushed off my shoulders.” The singer joined the cast of “Love & Hip-Hop: Atlanta” in 2012. “The only reason I did [the show] was to get a record deal, which I got after the first season [with Warner Music Group], and promote my music,” she says. Luke Bryan Nets No. 1 Album, Katy Perry’s ‘Roar’ Tops Digital Songs Now she’s prepping for a tour and a solo VH1 reality show, but not under the umbrella of Mona Scott-Young‘s Monami Entertainment, which produces “Love & Hip-Hop: Atlanta.” “She’s doing her own show on VH1 which is not going to be anythng like ‘Love & Hip-Hop.’ It’s going to be about K. and her musical friends and their adventures,” Robinson says.  “I don’t think that particular show was for me. That’s why I got off,” she says. “Being that I’m going to stick to reality, the terms have to be right for me. I can’t let anything get in the way of building this music legacy.” Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "title": "K. Michelle Talks ‘Rebellious Soul’ Success & Upcoming Solo VH1 Show – Billboard",
    "datetime": "2013-08-23T18:12:09+00:00",
    "url": "https://www.billboard.com/music/rb-hip-hop/k-michelle-talks-rebellious-soul-success-upcoming-solo-vh1-show-5672573/"
}