{
    "text": "Kansas City has received national recognition for its wide-ranging and collaborative efforts to improve public health. The Robert Wood Johnson Foundation announced Wednesday at its headquarters in Princeton, New Jersey, that Kansas City was a recipient of a 2015 RWJF Culture of Health Prize. “It’s an exemplary community for our country in terms of thinking about where we all need to go in promoting health,” said Don Schwarz, director of the Robert Wood Johnson Foundation. Kansas City is one of eight communities receiving the award, which also includes a $25,000 cash prize. Schwarz says the foundation was particularly impressed with Kansas City’s broad definition of and approach to health. In recent years, efforts including those to reduce violence, promote mentoring, increase voter registration and improve literacy have taken their place alongside more traditional health and wellness initiatives as part of Kansas City’s public health strategy. “What this prize is about is a recognition that health is much broader than access to illness care, that the entire community has to deal with the factors that influence health where we live, shop, work, play, pray,” said Rex Archer, director of the Kansas City Health Department.  A video produced by the Robert Wood Johnson Foundation highlights Kansas City's unique approach to health./Robert Wood Johnson Foundation Archer praised numerous partners for their role in promoting health, including the city council and police department, and community outreach organizations such as Communities Creating Opportunity and AIM4Peace. As part of its broad strategy, city health leaders and partners have also been advocating for policy and legislative changes such as increasing the minimum wage and curbing predatory lending. “We’re realizing that almost every policy decision can have positive or negative health implications, and we need to be thinking those things through,” Archer said. Archer says the city’s programs have contributed to significant improvements in health and reduction in disparities, including a narrowing of the life expectancy gap between whites and black from 6.5 to 5 years in the last decade. Schwarz says communities around the country could learn from Kansas City’s example. “The breadth of participation,” said Schawrz. “The vision that says we need to focus on everyone in the community. A realization that collective impact – everyone working together to get to healthy places – all of that is important.” The other cities receiving the award include Bridgeport, Connecticut; Bronx, New York; Everett, Massachusetts; Lawrence, Massachusetts; Menominee Nation in northeastern Wisconsin; Spartanburg County, South Carolina, and Waaswaaganing Anishinaabeg (Lac du Flambeau Tribe),Wisconsin. Alex Smith is a reporter for KCUR, a partner in the Heartland Health Monitor team. ",
    "title": "Kansas City Wins National Award For ‘Culture Of Health’ | KCUR - Kansas City news and NPR",
    "datetime": "2015-10-29T18:48:30",
    "url": "https://www.kcur.org/health/2015-10-29/kansas-city-wins-national-award-for-culture-of-health"
}