{
    "text": "American K-pop fans continue to prove they're a festival force with KCON, the premiere Korean culture and K-pop experience, growing to 75,000 attendees coming to the now bi-coastal event. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin American K-pop fans continue to prove they’re a festival force with KCON, the premiere Korean culture and K-pop experience, growing to 75,000 attendees at the now bi-coastal event. According to a press release, 58,000 fans came to KCON 2015 Los Angeles, the festival’s original home, that grew to a three-day convention at the Los Angeles Convention Center with two nights of concerts at the Staples Center. Meanwhile, 17,000 attended the inaugural East Coast date that boasted a one-day convention followed by a concert that night in Newark’s Prudential Center. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tSXM Festival 2024 Announces Phase 1 Lineup: Kevin Saunderson, Loco Dice & More\t\t\n\t\n\n\n\n\t08/10/2015\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tExplore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tEric Nam\t\t\n\t\t\t\t\t\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news KCON 2015 Los Angeles: Saturday Recap + Sunday RecapKCON 2015 New York: Recap The numbers continue KCON’s exponential increase in attendance with last year drawing 42,000, their 2013 date bringing in 20,000 and the fest’s debut pulling in 10,000 in 2012. This year, KCON brought 13 K-pop acts to perform (including Girls’ Generation, Super Junior, GOT7 and Shinhwa), along with more than 227 special guests (Kim Soo Hyun, Daniel Henney, Eric Nam, Irene Kim) and 127 programs offered on site including workshops, panels and meet-and-greets. GOT7 Talk ‘Just Right’ & Give Confidence Advice to Fans at KCON 2015: Exclusive Angela Killoren, the chief marketing officer at CJ E&M America (the U.S. sect of massive Seoul-based pop culture media company) tells Billboard that a KCON in 2016 “is pretty definite” and there’s been talk at the company of expanding the New York date to be larger, potentially two days. She adds that the festival is looking for another Asian stop (past Japan, where 15,000 came to Tokyo’s Saitama Super Arena for KCON’s Japanese debut) with her hoping to eventually expand to Latin America. Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "title": "KCON Los Angeles & New York Draw 75,000 Total Attendees | Billboard – Billboard",
    "datetime": "2015-08-11T00:45:10+00:00",
    "url": "https://www.billboard.com/music/music-news/kcon-los-angeles-new-york-attendance-6656778/"
}