{
    "text": "Bringing together Korean music, culture and brands, the K-pop Music Convention, or KCON, which is held around the world, will welcome fans in Los Angeles for the 10th time on Aug. 19-21 this year. Embracing the recent K-wave, with K-pop, K-drama, K-brands, K-beauty, K-food and an overall K-lifestyle attracting attention from all around the world, various events have been organized to celebrate K-culture. KCON is the largest annual event to introduce Korean culture to the world.  Held for the first time in Los Angeles in 2012, the event then expanded to Mexico, France, New York, Abu Dhabi, Australia, Thailand and Japan. Over the last 10 years, many K-pop idol music groups performed at KCON, from BTS to Twice.    The KCON program offers many panels and expos that encourage attendees to explore Korean culture as well as dozens of concerts. It also features dance workshops where people can learn the lineup artists’ dances from many talented and renowned trainers. In addition, KCON enables fans to interact with their K-pop idols in \"hi-touch\" events where they can high-five their favorite artists, play games or simply have a Q&A session with them backstage. Due to the COVID-19 pandemic, KCON's 2020-2021 events took place online on platforms like Youtube, AISPlay and Shopee under the title “KCON: TACT.\" Even after the pandemic, KCON decided to keep streaming the events online for fans who cannot attend. Therefore, KCON 2022 initially kicked off online before the physical events started in Korea, then Japan and lastly the United States. The main KCON event, which is currently scheduled for August in Los Angeles, will also take place in Japan in October. KCON LA officially announced that Itzy, Enhypen, The Boyz, STAYC, Nmixx, WJSN and Cravity would be taking the stage at this year’s convention. The event was created by Koreaboo and organized by CJ E&M.  ",
    "title": "KCON to celebrate K-culture in Los Angeles this August | Daily Sabah\n",
    "datetime": "2022-06-17T09:06:00+03:00",
    "url": "https://www.dailysabah.com/arts/music/kcon-to-celebrate-k-culture-in-los-angeles-this-august"
}