{
    "text": "Get ready for KCON 24/7! The \"world's largest K-culture convention\" is taking things online in 2020 during the coronavirus pandemic, after postponing previously planned in-person events in New York, Los Angeles, Japan and Singapore. KCON:TACT, as it will be known, is set to stream live 24/7 from June 20–26 on the Mnet K-Pop channel. The lineup has yet to be announced, but past conventions have included performances and appearances from popular K-pop acts like NCT, Loona, Seventeen, Stray Kids, Mamamoo and more. Last year, ET caught up with tons of K-culture stars at KCON L.A. 2019, including RuPaul's Drag Race star Soju and singer Kevin Woo, who dished on his dream collabs and cover songs. \"Right now I'm listening to a lot of Ed Sheeran, so I definitely want to do an Ed Sheeran cover,\" Woo revealed, adding that Sheeran would also be a dream collaborator as well. \"Ed Sheeran, if you're watching, I'm Kevin Woo and I am totally down to do a collaboration with you!\" he added excitedly. Woo later revealed that there's another artist who's been his favorite performer for years. While answering some questions from fans, Woo revealed, \"Hands down, my ultimate [artist] in the world is Ariana Grande.\" \"I would love to collaborate with her one day,\" Woo shared. \"That would be... wow! That would be amazing.\" See more in the video below. RELATED CONTENT: KCON 2019 LA: Wengie Shares a Heartwarming Message for Her Fans (Exclusive) Kevin Woo Reveals His Dream Music Collaborators at KCON L.A. 2019 (Exclusive) KCON 2019 LA: Why Soju Wants to Return to 'RuPaul’s Drag Race' (Exclusive) Next up in 5 Example video title will go here for this video     In Other News Notifications can be turned off anytime in the browser settings. ",
    "title": "KCON 2020 Will Be Held Online Amid Coronavirus Shutdown -- And Streaming 24/7 | cbs8.com",
    "url": "https://www.cbs8.com/article/entertainment/entertainment-tonight/kcon-2020-will-be-held-online-amid-coronavirus-shutdown-and-streaming-247/603-8d02e43a-dcf2-4b55-9e01-f03b4200c230"
}