{
    "text": "By \n\n\tJeff Benjamin It was five  years ago that America found itself in the midst of its “Gangnam Style” summer with Psy’s viral hit rising on radio and horsey-dancing its way to becoming the most impactful Korean-language song on the charts to date. The fall of 2012 also marked the very first iteration of KCON, a Korean culture and music festival that started as a modest, one-day convention and concert in Irvine, California, and has since grown into a multi-day international franchise with its flagship West Coast event consistently breaking the previous year’s attendance records. After stops in Mexico and Japan, along with a New York date in June, KCON 2017 Los Angeles took over the city’s downtown area this past weekend for three days of fun at L.A. Convention Center with Saturday and Sunday featuring concerts by a slew of South Korea’s biggest pop acts at the Staples Center. Stepping foot inside the K-culture bubble that is KCON, it quickly becomes apparent that K-pop fans aren’t just supporters of the music, but devotees to Korean culture at large. Here are the best moments we caught during the weekend. Unlike at KCONs  past, the order of performances at the 2017 edition wasn’t determined by years in the industry, but by current popularity. While a 13-member boy band may sound unbelievable by Western standards, the sensational Seventeen have become monster album sellers in Korea and were clear favorites to headline Saturday. The guys were one of the few acts to add fun ad-libs during their performances (it was nearly impossible not to smile as the guys hollered “Whoa!” during “Very Nice”) while the precise choreography and formations in songs like “Don’t Wanna Cry” only seemed that much more impressive in front of an arena full of screaming fans. Is there really  life after K-pop? Kevin Woo – a California native who spent almost a decade as a member in the male outfit U-KISS before leaving this year – found a super-warm welcome at his first solo appearance on the West Coast. The hundreds of attendees at his meet-and-great event screamed every time the 25-year-old smiled and nearly passed out when he announced he was putting out personalized merchandise and would be selling it the following morning. They also followed him to his multiple appearances throughout the weekend, including a check-in at the Flower Boy Café, a makeshift coffee shop inside the convention that was staffed by dreamy, well-dressed young men that are often portrayed in Korea’s beloved drama TV shows. At Saturday’s concert,  the audience was treated not only treated to the various performers’ most recent singles, but a slew of special stages that featured tributes to classic K-pop acts. Thirteen-member female troupe Cosmic Girls ran onstage in cheerleader garb to perform their peppy singles like “Happy” and “I Wish,” and would later return for a cover of “I Need U” by K-pop’s current sensation and Billboard Music Award winner BTS, and joined male outfit SF9 for a performance of “Sorry Sorry” by veteran boy band Super Junior. While past KCONs would typically see artists perform covers of hit U.S. songs – usually with varying degrees of awkwardness – Cosmic Girls rallying up the audience for their K-pop covers indicates how the stars of the genre and their U.S. audience are growing increasingly proud of their history. In one of  KCON 2017’s most memorable stage entrances, a spotlight revealed boy band VIXX hiding their faces with traditional hand fans before they moved into a rendition of their latest single “Shangri-La.” The sextet performed the entire song whipping and flicking their fans, recreating the visuals from one of K-pop’s best music videos, a feat the band told Rolling Stone backstage required them carrying the accessories everywhere they went to grow as comfortable as possible with the props for their performances. While attendees were  wowed by Astro’s mindbendingly precise choreography and acrobatic performances during songs like their synth-y single “Baby,” the audience was also treated to homemade T-shirts by the boy band during one of their many onstage challenges. In an onstage game called “Star Goods,” the six members had one minute to design a white T-shirt with markers and stickers that they’d eventually throw into a group of eager hands hoping to get a sloppy but adorably personal piece of KCON memorabilia. Thanks to the  likes of Kygo and Justin Bieber, tropical house has taken over American radio waves, but it’s only just seeping into the K-pop scene. The quartet known as KARD, one of Korea’s few co-ed groups, got a huge response to their island-infused singles like “Hola Hola” and “Oh NaNa” even as one of the youngest groups at KCON. While K-pop doesn’t have a particularly successful history with co-ed acts, the audience’s reception to the group’s up-to-the-moment sound (even Hyojung, Seunghee and Binnie of girl group Oh My Girl came out from backstage to watch the foursome perform) indicates bright things for them. Perhaps one of  the best examples of how connected K-pop fans are to the scene was seen in the feverish response to Wanna One on the KCON stage. The boy band was created on Korea’s sensational singing competition Produce 101 – that whittles down 101 K-pop hopefuls to an 11-member boy band that will stay together for one year before the members join separate record labels. Despite the show not airing in America and Wanna One only releasing their debut EP earlier this month, the band had one of the biggest reactions of the weekend. “I can’t believe we’re here to perform for KCON LA 2017 and it’s only been two weeks since we debuted,” the boys commented when greeting the audience. In perhaps any other music industry, it wouldn’t be believable either. K-pop will forever  be associated with South Korea, but it’s becoming an international art form. Case in point: Some of the scene’s biggest hits recent have been produced by LDN Noise, the British production duo of Greg Bonnick and Hayden Chapman, who have also worked with Nick Jonas and Chris Brown. At their “Behind the Scenes With LDN Noise: The Producers of SM Entertainment” panel, the charming lads talked about some of their Number One singles in Korea (including EXO’s “Monster” and SHINee’s “View”) while also breaking down how they crafted “Forever” off EXO’s Billboard 200–charting The War album. The amount of fans asking for the guys’ autographs and photos after the session wrapped further showed how dedicated K-pop fans are to connect with those ingrained in the scene. Some lucky KCON  attendees got the chance to meet their favorite superstars, via fan signings and high-five sessions (known as a “hi touch”) with different artists at the Star Square stage. Singer-rapper Heize kicked things off with a jam-packed autograph session on Friday, while new boy band Wanna One seemingly had the entire con screaming to get a glimpse of the 11-member boy band giving high fives to a few lucky fans. Throughout the weekend, different KCON sponsors would host different artists for visits, keeping fans on their toes in case their favorite girl group or boy band (and a large security detail) might walk right by them. Even with more  veteran acts in attendance, the septet GOT7 closed down KCON, bringing singles like “Never Ever” and “Hard Carry” to an extremely enthusiastic audience that continued to scream its loudest even at the tail end of the three-day affair. Despite near-deafening roars, GOT7 member Jackson humbly told the audience, “Some people don’t know who we are” and made sure that each member got to individually greet the audience. Five years after the monster that was “Gangnam Style,” KCON 2017 Los Angles proved that K-pop is still picking up steam. We want to hear it. Send us a tip using our anonymous form. Rolling Stone is a part of Penske Media Corporation. © 2023 Rolling Stone, LLC. All rights reserved. ",
    "title": "KCON 2017 Los Angeles: 10 Best Things We Saw",
    "datetime": "2017-08-21T15:20:00+00:00",
    "url": "https://www.rollingstone.com/music/music-lists/kcon-2017-los-angeles-10-best-things-we-saw-205913/"
}