{
    "text": "Laura Sullivan \"Text neck,\" the posture formed by leaning over a cellphone while reading and texting, is a big problem, according to the author of a newly published study in the National Library of Medicine. Kenneth K. Hansraj, chief of spine surgery at New York Spine Surgery & Rehabilitation Medicine, says the bad posture can put up to 60 pounds of pressure on the upper spine — sometimes for several hours a day, depending on how often people look at their devices. \"It is an epidemic or, at least, it's a very common,\" Hansraj told The Washington Post. \"Just look around you — everyone has their heads down.\" An adult's head weighs about 10 to 12 pounds. According to Hansraj's research, which will be published next month in Surgical Technology International, tilting the head forward just 15 degrees can increase the force on the cervical spine to 27 pounds. And at 60 degrees — the common texting posture seen on sidewalks, metros and office hallways everywhere — the stress on the spine can hit 60 pounds, thanks to the forces of gravity. \"People spend an average of two to four hours a day with their heads tilted over reading and texting on their smartphones and devices. Cumulatively this is 700 to 1,400 hours a year of excess stresses seen about the cervical spine,\" Hansraj's study reads. And a high school student, according to the research, could spend 5,000 more hours hunched over this way. \"These stresses may lead to early wear, tear, degeneration, and possible surgeries,\" Hansraj writes. While it is nearly impossible to avoid technology, Hansraj says in the study that people should make an effort to look at their phones with a \"neutral spine,\" sending their eyes downward, not their heads. Proper upper spine posture, he says, is generally defined as aligning the ears with the shoulders while keeping the shoulder blades pulled back. Sponsor Message Become an NPR sponsor ",
    "title": "Keep Your Head Up: 'Text Neck' Takes A Toll On The Spine : The Two-Way : NPR",
    "url": "https://www.npr.org/sections/thetwo-way/2014/11/20/365473750/keep-your-head-up-text-neck-can-take-a-toll-on-the-spine"
}