{
    "text": "Following her mom's exit from CBS' The Talk, Kelly Osbourne has shared her thoughts on \"cancel culture\" and the role the media plays in it. She simply said, \"fuck cancel culture,\" and that \"counsel culture\" is what's actually necessary. \"The world is scary right now, but... it's an honor to be a part of the world when beautiful change is happening,\" Osbourne told Extra TV. “I didn't know what was really going on in this country because I just thought that simply being not racist was enough,\" she continued. \"It’s not, it's actually not, you have to be actively not racist and educate yourself and learn, and don't be afraid to make a mistake.\" Osbourne feels that shunning someone for their actions and words is counterproductive, and people should simply correct others and let them learn as they move forward. \"Everybody's so afraid of cancel culture I say fuck cancel culture, it’s all about counsel culture. Educate people, teach people — a gentle nudge in the right direction is so much better than a public execution,\" she said. She touched on the subject again in another interview on the Everything Iconic podcast [via NME], adding that mistakes are necessary for people to learn what is right and wrong, and thus, for change to occur. \"I’ve made mistakes. My mom’s made mistakes. Everybody’s made mistakes,\" she said. “But also, there’s two sides to every story and the media will only ever let you see the one. The one that gets the most clicks. The one that gets the most people fear mongered and outraged.” Listen to the full podcast episode below. Sharon Osbourne left The Talk in March following a string of allegations claiming that she had made racist comments on the set of the show, especially toward fellow cast members. These reports came out after Sheryl Underwood accused Osbourne of defending racism, because she had publicly voiced support for Piers Morgan.   ",
    "title": "Kelly Osbourne - F--k Cancel Culture, Everybody Makes Mistakes",
    "url": "https://loudwire.com/kelly-osbourne-cancel-culture-everybody-makes-mistakes/"
}