{
    "text": "To enjoy additional benefits CONNECT WITH US November 01, 2017 02:14 pm | Updated 02:14 pm IST - THIRUVANANTHAPURAM: COMMents SHARE READ LATER K. Satchidanan The State government has decided to confer the prestigious Ezhuthachan Puraskaram, the top literary award of the Government of Kerala, on poet-critic K. Satchidanandan. A pioneer of modernism in Malayalam poetry, a bilingual literary critic, former Editor of Indian Literature, the official journal of the Sahitya Akademi, Mr. Satchidanandan’s works have been translated into several languages. The former secretary of the Sahitya Akademi, he is a public intellectual who has upheld secular and anti-fascist position in his life and work. The prolific writer who has been making trail blazing interventions in literature and society, Mr. Satchidanandan has over 30 collections of poetry, over 25 collections of essays and another 20 odd collections of translations of poetry from various Indian and foreign languages to his credit. Announcing the award at a news conference here on Wednesday, Culture Minister A.K. Balan said Mr. Satchidanandan was chosen for the award by a jury chaired by Kerala Sahithya Academi chairman and writer Vaisakhan. The award carries a purse of ₹ 5 lakh. COMMents SHARE Kerala\n\n/\n\npoetry\n\n/\n\naward and prize BACK TO TOP Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. ",
    "title": "\n\tKerala's top literary award for K. Satchidanandan - The Hindu\n",
    "datetime": "2017-11-01T08:44:37.000Z",
    "url": "https://www.thehindu.com/news/national/kerala/keralas-top-literary-award-for-k-satchidanandan/article19960448.ece"
}