{
    "text": "Kia Motors' XCeed urban crossover has been recognized with a 2020 Red Dot design award. The ‘Product Design’ prize makes the XCeed the fourth member of the Ceed model family to receive a Red Dot prize.\r\n \r\nThe XCeed’s accolade brings Kia’s total number of Red Dot awards to 25, since the brand won its first in 2009. Most recently in 2019, the XCeed’s stablemates – the Ceed, Ceed Sportswagon and ProCeed – were each individually recognized for their design strengths by the prestigious awards program.\r\n \r\nKarim Habib, head of Kia Design Center, said, “Kia has strived for continuous quality improvements and more fascinating and interesting customer experiences. Kia’s crossover XCeed represents this new vision.”\r\n \r\nThis is the second major design prize for the XCeed and the full Ceed model family, following an iF Award for the new model at the beginning of 2020. The XCeed also received the prestigious ‘Golden Steering Wheel’ (Das Goldene Lenkrad) in Germany in 2019, and won the Urban Car Award in last year’s Women’s World Car of the Year contest.\r\n \r\nThe Kia XCeed is a new urban crossover utility vehicle (CUV) which combines compact SUV practicality with the sporty packaging and engaging handling of a hatchback. It addresses the growing desire among European drivers for cars which offer more emotion and dynamism than an SUV, both in terms of the way they look and drive.\r\n \r\nDesigned as a sporty alternative to a traditional SUV, the new CUV offers comparable levels of space for occupants and luggage, the company says. The car engages drivers with its sporty handling and comfortable, assured ride, while providing a more commanding view of the road ahead than a conventional hatchback.\r\n \r\nThe car has been designed exclusively for European customers at Kia’s European design studio in Frankfurt, Germany. It went on-sale in Europe in the second half of 2019, with more than 20,000 examples sold to-date. A new electrified variant of the car, the XCeed Plug-in Hybrid, was launched in the first quarter of 2020. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Kia XCeed Wins 2020 Red Dot ‘Product Design’ Award - Businesskorea",
    "datetime": "2020-03-30T18:02:18+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=43468"
}