{
    "text": "We’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. This was published 4 years ago Add articles to your saved list and come back to them any time. Pyongyang: Dancers in hot pants. Factories pumping out Air Jordan lookalikes. TV dramas that are actually fun to watch. North Korean pop culture, long dismissed by critics as a kitschy throwback to the dark days of Stalinism, is getting a major upgrade under leader Kim Jong-un. A guide stands in a showroom at the Ryuwon Shoe Factory in Pyongyang.Credit: AP The changes are being seen in everything from television dramas and animation programs to the variety and packaging of consumer goods, which have improved significantly under Kim. Whether it's a defensive attempt to keep up with South Korea or an indication that Kim is willing to embrace aspects of Western consumer culture that his predecessors might have viewed as suspiciously bourgeois isn't clear. \"The most important thing for us is to produce a product that suits the people's tastes,\" Kim Kyong-hui of the Ryuwon Shoe Factory said recently in the facility's showroom, which is filled with dozens of kinds of shoes for running, volleyball, soccer - even table tennis. \"The respected leader Kim Jong-un has instructed us to closely study shoes from all over the world and learn from their example,\" she added, pointing to a pair of flame-red high-top basketball shoes. To be sure, North Korea remains one of the most insular countries in the world. Change comes cautiously and anyone who openly criticises the government or leadership or is seen as a threat can expect severe repercussions. But there appears to be more of a willingness under Kim to experiment around some of the edges. A basketball shoe display at the Ryuwon Shoe Factory.Credit: AP The most visible upgrades are on television and its normal menu of propaganda programs and documentaries in praise of the leaders. Viewers of the main state-run TV network - the only channel that can be seen anywhere in the country - are now stopping their routines to watch the latest episodes of The Wild Ginseng Gatherers of the Imjin War, a historical drama set in the late 16th century, when Korea was struggling against a Japanese invasion. The anti-Japan, nationalistic theme is nothing new. A similar theme was used for Kim's first big contribution to the television line-up, an animated series reviving a popular comic from his father's era called The Boy General that made its debut in 2015. The animation, set in the Koguryo period when Korea was fighting off Chinese incursions, was such a hit that people would stop whatever they were doing to watch it. A Boy General game was created for mobile phones. New episodes are believed to be forthcoming. What the TV drama, first aired in July, and the Boy General animation share that's new is their high production values. South Korean popular girl band Red Velvet performs during a joint concert between South and North Korea in Pyongyang last year.Credit: AP The acting in the movie is grittier and more compelling, the plots more engaging and the sets and costumes are decidedly more elaborate than previous projects. Even the dialogue spoken in Japanese by the villains, played of course by North Korean actors, is generally accurate, though delivered with a heavy North Korean accent. The Boy General, meanwhile, makes skillful use of computer effects and is visually on par with some of the best animation in the world. The improvements reflect an awareness within Kim's regime that the North Korean public is increasingly familiar with foreign pop culture despite severe restrictions that make it impossible for most to travel abroad or freely experience foreign movies, music or books. That familiarity is particularly true of the North Korean elite, who are accustomed to seeing brand name products from Dior to Sony on the shelves of upscale stores in Pyongyang, the capital. Cheap knockoffs from China are common in marketplaces around the country. North Korean leader Kim Jong-un appears to be relaxing the rules a little.Credit: AP Watching South Korean movies or listening to South Korean music is illegal. But a lot makes its way over the border and, even for those who would never dream of taking that risk, the officially approved cultural fare isn't entirely void of foreign treats. Bollywood films are popular in state-run cinemas - 2009's Three Idiots with Aamir Khan, for example, was recently shown in a cinema just across the street from Kim Il-sung Square. North Korea's educational channel regularly features long clips from foreign documentaries, and dog-eared Harry Potter books are among the most popular items at the People's Grand Study House, North Korea's biggest library. North Korea's \"approach to the influx of foreign media has been to 'modernise' media production to provide an attractive and competitive product that caters to younger generations for whom older productions are no longer attractive,\" said Geoffrey See, the founder of the Choson Exchange, a Singapore-based non-profit that supports change in North Korea through exposure to knowledge and information in business, entrepreneurship and law. \"For consumer goods, it also ties into a state policy to encourage more domestic production and import substitution,\" he said. Kim's first attempt to update the pop culture scene started almost as soon as he assumed power in late 2011 with the creation of the Moranbong Band, an ensemble of female vocalists and musicians who are the \"soft face\" of his regime. Although the members all belong to the Korean People's Army, they are known for performing in miniskirts and wearing their hair fashionably short. They have released dozens of songs, all of which get lots of exposure through concert tours, DVDs and television air time. They are beginning to look a bit passe, however. In February last year, North Korea sent some of its top musicians, including a female quintet that performed in black shorts and red tops, south of the Demilitarised Zone to perform during South Korea's Pyeongchang Winter Olympics. Two months later, Kim was in the audience as the South Korean girl group Red Velvet put on what is believed to be the first real K-pop show ever held in Pyongyang. The North Korean act that performed in South Korea was so well received that Kim sent them to Beijing last month for another goodwill tour. Still, military orchestras and classically trained vocalists who perform in traditional Choson-ot gowns remain the mainstay of the Pyongyang musical scene. The girl band's performance in Beijing was backed up by the state's military chorus and orchestra, all in full uniform. More importantly, there has been no effort to delink the arts from politics. When the musical group returned to Pyongyang, Kim urged them to continue to \"conduct original artistic activities pulsating with the party's ideology\" and act \"courageously as mouthpieces of the party,\" according to state media. AP Copyright © 2023 ",
    "title": "Kim Jong-un's cultural revolution: K-pop and fancy sneakers",
    "datetime": "2019-02-13T03:26:32+00:00",
    "url": "https://www.smh.com.au/world/asia/kim-jong-un-s-cultural-revolution-k-pop-and-fancy-sneakers-20190213-p50xi8.html"
}