{
    "text": "Share this article Throughout October, Korean food will be showcased. Photo / File Eat Kimchi, watch Korean movies. dance to K-Pop music and learn to cook like a Korean master chef. Auckland's first month-long Korea festival gets underway tonight with a Talent of Korea gala concert at Westlake Boys High School. New Zealanders are being urged to attend a series of free events and performances celebrating the best of Korean food, music, art and film. University of Auckland Korean studies specialist Changzoo Song said when compared with other Asian communities such as Chinese and Indian, few Kiwis knew much about Korean culture. \"In general people in New Zealand know little about Korean culture,\" Dr Song said. \"This is partly because Korean community here has been small and their migration history is short, especially when we compare Korean with those of Chinese and Indian New Zealanders.\" Dr Song said the festival presents a good opportunity to experience aspects of Korean culture, including music, film and signature Korean food. Five free events will include Korean cooking classes with MasterChef 2014 winners Karena and Kasey Bird, a K-Pop contest at the University of Auckland and five days of free Korean movies at the Academy Cinemas. The Thieves, a 2012 South Korean action comedy directed by Choi Dong-hoon - to screen on October 20 - is the fifth highest-grossing movie in Korean film history with nearly 13 million ticket sales. A gang of South Korean thieves team up with a Hong Kong crew to steal a diamond necklace from a heavily guarded casino safe in Macau. Korean Consul General Chang soon Cha said the aim of the Korean Consulate-backed festival was to introduce New Zealand to the \"vibrant and dynamic aspects\" of Korean culture. Throughout October, shoppers at selected Pak'n Save and New World supermarkets will also get to taste Korean ice-cream, seaweed snacks, instant noodles and kimchi. Next week, students at some Auckland schools - including Takapuna Normal Intermediate, Marina View School, Mt Roskill Intermediate and Farm Cove Intermediate - will also be taught basic Korean cooking. \"I hope the festival will create opportunities to bring Korea's rich culture to life and enhance the understanding of Korea,\" Cha said. \"Korea and New Zealand have been working closely together for over 60 years, stretching back to the Korean War in the 1950s.\" This December will also mark the first anniversary New Zealand's Free Trade Agreement signing with Korea. At the last Census, there were 30,171 people who identified with the Korean ethnicity and about 22,000 lived in the Auckland region. Nine in 10 were not born in New Zealand, and the median age was 31.2 years Korea currently ranks as the sixth largest country New Zealand exports to and Koreans made up the seventh largest group of overseas visitors last year. KOREAN FESTIVAL HIGHLIGHTS • Duruje Fest and K-Pop Contest, Oct 8, 4-8pm, The University of Auckland Quad, free• Korean Film Festival, Oct 18 to 22, Academy Cinemas Lorne St, free• K-Food Cooking Master Class, Oct 16, Auckland Seafood School, by invitation• Ottchil Art from Korea, Oct 7 to Dec 17, Gus Fisher Art Gallery, free• K-Food Tasting, until Oct 29, selected Pak'n Save and New World Supermarkets, free Share this article ",
    "title": "Kimchi, K-Pop and K-movies highlights of month-long Korean Festival in Auckland - NZ Herald",
    "url": "https://www.nzherald.co.nz/nz/kimchi-k-pop-and-k-movies-highlights-of-month-long-korean-festival-in-auckland/VLC42PBKPI2R5KVRCMTUH2JZZ4/"
}