{
    "text": "Korean pop dance classes are making waves in central Auckland. Although Korean pop music (K-pop) and dance classes have been globally widespread, it has been somewhat of a subculture in New Zealand. However, in the last few years, there has been a surge in popularity with groups such as B.A.P and Seventeen, and rapper G-Dragon coming to perform in the country. K-pop is known for incorporating a variety genres such as pop, rock, hip hip, electronic and R&B. It is also known for its visual elements such as choreography. READ MORE: * World-class dancer stages K-Pop performances * Parris Goebel steps up choreography in world of K-Pop * K-pop battle at Wellington's Korean Culture Festival * The Kiwis riding the K-Pop music wave * Brothers come home with K-pop award Dance group Crave NZ have opened a studio on Queen St and recently taught their first K-pop dance class. Crave NZ is made up of Cindy Lu, Rachel Matela, Vivian Xu and Vee Xu. Their group name is a combination of their individual names. Having danced together for a year, their cover of South Korean girl group Black Pink's song As If It's Your Last has more than 300,000 views on YouTube. And in September, they will travel to Wellington for this year's K-Culture Festival, an event where people can sample Korean culture and cuisine, where they will compete in its dance competition. K-pop and K-pop dancing was different to other types of music and dance due to its theme and aesthetic, Xu said. \"It's very detailed and it's almost a sensory overload but it's captivating,\" Xu said. With a demand for classes based on songs by girl groups, Crave NZ said they were happy with the turn out. They taught their first class to the song Red Flavor by South Korean girl group Red Velvet. \"These types of classes are a way for fans to involve themselves,\" Matela said. \"It's a way of sharing love and a good way to make friends.\" University student Amanda Middeldorp said Crave NZ's dance class was a good experience. \"It was beginner friendly but complicated enough to keep it interesting,\" Middeldorp said. Fellow dance teacher Mitchell Yee started teaching K-pop dance classes in 2013 after noticing there was a demand. He said it was good exercise as it involved stretching, cardio and it was also good for the mind because there was a lot to remember. \"It's very rewarding to see people come to classes and progress as dancers,\" Yee said.​ Founded in 2012, K-Pop Planet is a University of Auckland social club which aims to promote Korean culture and music through events. Last year, the club had 240 members and now it has 330. K-Pop Planet president Jack Lin said K-pop stood out from mainstream music because it was more lively and the choreography that accompanied the songs was incredibly in sync. \"Every step has to lead onto the next which means everything flows,\" Lin said.​ K-Pop Planet member Chutima Kaewkruasri has been a fan of K-pop for 10 years and now studies audio engineering. She liked K-pop because it was an audio-visual experience and she decided to pursue audio engineering as a way to give back to it. \"K-pop has played a big part in my life,\" Kaewkruasri said. Kaewkruasri liked K-pop because it was an audio-visual experience that was well produced both on stage and behind the scenes. Crave NZ will hosts dance classes every Saturday. Visit https://www.facebook.com/cravenzofficial/ for details. © 2023 Stuff Limited ",
    "title": "Korean pop dance classes in Auckland grow in popularity | Stuff.co.nz",
    "datetime": "2017-08-22T22:27:07.232Z",
    "url": "https://www.stuff.co.nz/auckland/95694158/korean-pop-dance-classes-in-auckland-grow-in-popularity"
}