{
    "text": " As a leader in the Korean aerospace industry, Korea Aerospace Industries (KAI) is the only domestic aircraft manufacturer and total system integrator that designs and assembles world-class aircraft and satellite systems and provides life cycle support for its products. The aircraft manufacturer headquartered in Sacheon, Gyeongsang South Province, Korea is running its Sacheon 1 Facility (HQ), Sacheon 2 Facility, Seoul Office, Daejeon R&D Center, and the Sancheong Factory in Korea. It also has offices in Los Angeles, Fort Worth, and Washington DC in the US. Finally, it has an office in Turkey. It has 1,400 R&D experts experienced in the development of fixed and rotary wings. KAI builds fixed-wing aircraft (e.g. the FA-50 combat aircraft, the T-50 supersonic advanced trainer, the KT-1 basic trainer, and the KC-100 Naraon), rotary-wing aircraft (e.g. the Korean Utility Helicopter Surion), Unmanned Aerial Vehicles (UAVs), and satellites. The company is proceeding with plans to develop KF-X fighters, Light Armed Helicopters (LAHs), and Light Civil Helicopters (LCHs). On top of that, the Korean company is engaged in all areas of Maintenance, Repair, and Overhaul (MRO) for domestic aircraft, and in projects to develop commercial aircraft. It also manufactures air frames for next-generation large commercial airplanes in strategic partnership with global aerospace companies. The FA-50 was developed by KAI and Lockheed Martin, and has been used as the main trainer jet by the Korea Air Force since 2005. As a true 21st century combat aircraft equipped with radar, and air-to-air and air-to-surface missiles, the TA-50 is perfect for fighter pilot combat training and contributing to the training for elite pilots. Capable of conducting night flying operations, the TA-50 is becoming the basis for the development of KFX aircraft, helped by the cutting-edge weapon system Tactical Data Links and equipment to protect against precision-guided missiles. At the Seoul International Aerospace and Defense Exhibition (ADEX) 2013, KAI will display the KFX C-103 and the FA-50 (based on the T-50), which are considered as models for the KF-X program. It is the first time for the FA-50 to be introduced to the public. The T-50 family was exported to Indonesia in 2011, and is expected to continue its rapid climb to grab the global advanced jet trainer and attack aircraft market. The first domestically-developed KT-1 serves as a basic training aircraft for Air Force pilots with the best features and functions among aircraft in the same league. Its stability and reliability were proven with an accident-free flying record and a high operating rate. KT-1 opened a new era of Korea’s aircraft exports by penetrating into new overseas markets such as Indonesia, Turkey, and Peru. Based on technologies for military aircraft, KAI successfully developed a four-seat light aircraft called the KC-100 Naraon, the first civil aircraft that meets global industry standard certification requirements. Currently, the company is trying to develop business jets and mid-sized airplanes in order to enter the commercial aircraft market. The KUH Surion, jointly developed by KAI and Eurocopter, is a state-of-the-art helicopter that satisfies all of the 7,600 flight test items on a flight test report through 2,700 hours of test flights, including low-altitude flight tests over Alaska. The development of various LAHs for military operations and LCHs for wildfire containment and airborne patrol is expected to open up new horizons for the domestic helicopter industry. LAHs and LCHs will be unveiled at the exhibition as well. Based on technologies learned from the development of the KUH Surion, KAI is pushing ahead with plans to develop more economically-feasible small helicopters through small armed and small civil helicopters at the same time. The company will do so in collaboration with the Ministry of National Defense, and the Ministry of Trade, Industry and Energy. Korea’s first RQ-101 Songgolmae (Peregrine Falcon) tactical UAVs developed by KAI have been used for wide area surveillance (WAS), reconnaissance, and target acquisition (TA) for the Republic of Korea Army (ROK Army) since 2001. The aircraft producer has core technologies for designing and manufacturing of numerous unmanned vehicles, as well as controlling flight tests through research and development. As a developer of the ROK Army’s corps-level UAVs, it is leading the era of unmanned airplanes in the future. KAI is recognized for its world-class technologies and product quality. To take one example, it manufactures and supplies the body of Boeing’s Apache attack helicopter, along with the front fuselage and the main wings of Boeing F-15K fighter jets. As a key partner of world-leading aerospace companies Boeing and Airbus, the Korean firm is responsible for designing, building, and delivering airframes of large airplanes through its participation in international joint projects for next-generation commercial airplanes such as the A-350 and B-787. It is planning to actively seek to expand those projects with proven technologies and capabilities to drive business performance. The development of aircraft is not the only business that KAI is in. The company is moving forward MRO businesses as future core business areas. It provides MRO services for the Super Lynx Mk 99A, the P-3 maritime patrol aircraft, an airborne early warning and control (AEW&C) system, the Lockheed C-130 Hercules, and H-53 helicopters employed by the US navy. It also offers installation services for Forward Looking Infrared (FLIR) cameras on military aircraft. Among MRO businesses, those involving the KT-1, T-50, FA-50, and the KUH Surion both at home and abroad are expected to be future growth engines. In particular, KAI is the only domestic firm to hold major technologies for satellites that can be commercialized due to its participation in the whole process of developing the body frame of multiple-purpose satellites. It successfully developed the structure of satellite bus subsystems and thrust controllers for the Korea Space Launch Vehicle-1 (KSLV-1), also known as the Naro-1. The aircraft producer plans to be fully involved in the aerospace business by developing launch vehicles and exporting satellites. By 2020, it aims to be among the top 7 global aerospace companies by recording 10 trillion won in annual sales and breaking into the top 15 of global aerospace company rankings. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Korea’s Only Aircraft Manufacturer Aiming to Be among Top 7 Global Aerospace Companies by 2020 - Businesskorea",
    "datetime": "2013-10-01T09:12:54+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=2101"
}