{
    "text": "Conquering the world, one K-pop hit at a time. In seeking to raise its international profile and influence, Taiwan can take lessons from South Korea’s growing soft power. Its soft power has been expanding through the growing appeal and attraction of its popular culture (a.k.a. Korean Wave or Hallyu) worldwide. As a result, the government has vigorously promoted Korean popular culture, taking advantage of its growing popularity to enhance Korea’s international standing and national image, as well as shape foreigners’ attitudes and preferences on issues of importance to Korea. The urgent lessons of Korea’s growing soft power for Taiwan are twofold. While smaller countries cannot surpass larger countries in terms of hard power, the former can not only increase their soft power, but even surpass that of the latter. Increasing the ability to shape the attitudes and preferences of foreign peoples and their governments through cultural attraction can offset a country’s limited hard power. As in the case of Korea, Taiwan can expand its soft power to counterbalance its limited capabilities and constricted international space. More importantly, there is no limit to Taiwan’s expansion of soft power, as there is in the acquisition of hard power. The second lesson is that the most cost-effective and potent means for smaller countries to increase their soft power is to promote popular culture, in order to gain greater recognition, respect and status in the international community. In this regard, Taiwan enjoys many of the same advantages as Korea in being able to successfully launch its own “Taiwan Wave” or Tairyu. Just as greater personal and artistic freedom, made possible by democracy, has led to a renaissance of popular culture in Korea, Taiwan is well situated, as a vibrant democracy, to encourage its people to freely use their creative talents to develop innovative cultural content that can appeal to a global audience. That Taiwan has the capacity to export its popular culture was made evident in the early 2000s, when its TV dramas and pop music became popular in East Asia for a time. Taiwan also shares Korea’s expertise in highly developed information technology, which has enabled Korean entertainment companies to effectively spread Korean pop music (K-pop) worldwide by uploading K-pop content on YouTube and marketing it aggressively through social media. The Korean government’s policy to promote its popular culture in order to boost its soft power is based on two remarkable developments that have since the early 2000s. For the first time in its history, Korea’s popular culture, driven by television dramas and pop music, has global reach. It established a firm foothold in East Asia, and subsequently spread to South and Central Asia, the Middle East and North Africa, North and South America, and Europe. The emergence of Korean popular culture onto the international scene is best exemplified by the spectacular success of the Korean singer Psy’s song “Gangnam Style,” which became a genuine global hit in 2012 and subsequently set an all-time record of 2.6 billion YouTube views. To put this phenomenon in perspective, the growing popularity of Korean popular culture around the world, facilitated by YouTube and other social media, is unprecedented. In 2015, the number of foreign fans of Hallyu, including dramas, music and food, hit 35.5 million in eighty-six countries, a 63 percent increase from the year before. The Asia-Pacific region had the largest number of fans, 26.2 million, followed by the Americas with 7.58 million, Europe with 1.62 million and Africa and the Middle East with 170,000 fans. The number of active Hallyu fan clubs also increased from 1,229 to 1,493 during 2014–15, with Peru leading the way with 114 fan clubs and Hungary with 112. As these numbers attest, this maybe the first time that a popular culture of a non-Western country is making meaningful inroads into the global cultural market, which has largely been dominated by Western countries, in particular the United States. This remarkable development has caught the attention of China and Japan, which are now envious of Korea’s growing soft power and anxious to duplicate the success of the Korean Wave. China is benchmarking Korea in developing its own culture industry, with Chinese companies forming partnerships with Korean media and entertainment companies to co-develop cultural content and to enhance their own capacity to promote Chinese culture abroad. Japan has also launched its own version of the Korean Wave, named “Cool Japan,” to promote its culture and increase its cultural exports. Along with its growing global presence, Korean popular culture has been a resounding success in winning the minds and hearts of people worldwide. People who have little to no knowledge of Korea or its culture are mesmerized by its highly entertaining TV dramas (a.k.a. K-dramas), featuring attractive actors with strong acting skills; interesting, suspenseful storylines; and high production values such as beautiful cinematography, scenery and original soundtracks. But, more importantly, they emotionally identify with the themes of love, friendship and family, and the intriguing combination of traditional and modern values that define the Korean lifestyle depicted in the dramas. While Korean dramas are enjoyed by people of all ages, Korean pop music has gained a huge international young fan base, mostly in their teens and twenties, who are enthralled by the arresting visuals, style, and unique combination of group dance choreography and strong singing skills of their favorite male and female idol groups. Due to the growing presence of K-pop on the global music scene, YouTube opened a separate music channel for the first time dedicated to a single country’s music rather than based on musical genres. In 2011, there were 2.3 billion worldwide K-pop YouTube views. The growing popularity of K-pop was also reflected among Instagram users worldwide in 2015, among whom K-pop was the most mentioned music genre and K-pop stars dominated the ranking of celebrities with the most followers. Just as K-dramas have left a deep impression among foreign viewers, K-pop has become influential in molding beliefs and values, exciting the imagination, and setting new trends and tastes of young people worldwide. The cultural impact of K-pop is reflected in both the offline and online activities of its growing legion of foreign fans. As an expression of their deep emotional attachment and devotion to their favorite stars, whom they regard as role models, they have organized fan clubs with estimated 3.3 million members worldwide, and sponsored K-pop cover dance and song competitions and festivals, as well as flash mobs. They have also uploaded K-pop cover dances and songs, as well as reactions to their favorite K-pop music videos to share with other fans through online social media. The fans are not just passive consumers and receivers of cultural influence, but active in creating their own subculture through their identification with K-pop and user-created content videos to entertain and express themselves. Interestingly, the popularity of Korean dramas and pop music, in turn, has had an enormous ripple effect by generating heightened interest in Korean society, traditional culture, language, fashions and food. Fascinated by Korea, foreign fans of K-dramas and K-pop want to study, travel and work in Korea and experience Korea and its rich, diverse culture. Therefore, the Korean Wave, through TV dramas and pop music, has not only generated enormous goodwill toward and self-identification with Korea and Koreans, but also has been instrumental in shaping Korea’s image as an advanced economy, as a cultural power and as an attractive country. Due to the global reach and the cultural impact of the Korean Wave, the government has come to realize that the most cost-effective and potent means of increasing one’s soft power—the ability to shape beliefs and values, attitudes and preferences—is to take advantage of the growing popularity of its mass culture to enhance Korea’s recognition, international standing and image. This key insight is now driving an important government policy to utilize Hallyu as an effective tool for national branding and public diplomacy. President Park Geun-hye has used her state visits to foreign countries (Mexico, Peru, Brazil and Czech Republic) to showcase Korean culture by organizing and personally attending cultural performances with K-pop as its highlight. A concrete example of this policy in action is “KCON Paris 2016,” combining a concert featuring some of the top acts in K-pop with a convention showcasing Korean culture and products from Korean businesses, sponsored by one of the leading entertainment and media content companies in Korea, CJ E&M. Annual K-Pop music festival/conventions have been held in Japan (Saitama and Chiba), the United States (Los Angeles and New York), UAE (Abu Dhabi), and now recently in France (Paris), with 13,500 young French and other European fans passionately singing and chanting in Korean to the music of their idol groups. The “KCON Paris 2016” was organized in conjunction with President Park’s state visit to France to celebrate the 130th anniversary of diplomatic relations between the two countries. Park attended the K-pop concert and toured the convention site, interacting with K-pop stars and fans and drawing extensive media coverage. The government also has mobilized its foreign embassies, consulates and overseas organizations—Korean Cultural Centers and King Sejong Institutes—and formed public-private partnerships to promote Korean popular culture by sponsoring K-pop singing and dancing competitions, screening K-dramas and movies, offering K-pop dancing and singing classes and programs, and distributing K-dramas for free to foreign broadcasting companies. Korea’s largest television network, the government-funded Korean Broadcasting System (KBS), operates a TV channel broadcasting dramas, variety shows and pop music aimed at an international audience, as well as organizing K-pop concerts since 2011 in Asia (Turkey, Vietnam, Jakarta, Hong Kong and Tokyo), Latin America (Chile, Brazil and Mexico), and Europe (Paris). © Copyright 2023 Center for the National Interest All Rights Reserved ",
    "title": "Korea's Cultural Juggernaut is a Soft-Power Strategy Worth Copying | The National Interest",
    "datetime": "2016-08-04T22:47:12-04:00",
    "url": "https://nationalinterest.org/feature/koreas-cultural-juggernaut-soft-power-strategy-worth-copying-17246"
}