{
    "text": " Presidential spokesperson Park Soo-hyun said on October 30 that President Moon Jae-in presided and checked the direction of smart city promotion in a meeting with chiefs and advisors. A smart city is a futuristic city that uses information and communication technology (ICT) to link city functions to an intelligent network. President Moon promised to expand smart cities into a future growth engine in response to the Fourth Industrial Revolution during his presidential campaign. At the meeting with chiefs and advisors, it was pointed out that U-City centered on a new city still had a long way to go in data accumulation, utilization and the creation of private business. Therefore, the government decided to focus on solving urban problems through the use of big data to boost sustainability. Specific directions for the promotion of smart cities are to create a new world-class smart city, promote the Smart City New Deal project, improve smart cities’ performance and spread the performance at home and abroad. The creation of a world-class smart city is a way to implement a big data-based urban operating system under joint public-private partnership and discover and reflect new technology test beds and practical services for citizens. The government will move ahead with the Smart City New Deal project by selecting and supporting a place where early performance can be created when holding the '2017 Urban Renewal New Deal' contest and spreading the project with the place as a model case to other local governments. In addition, the government is planning to integrate existing smart city-related work that has been promoted by the central government, local governments, and the private sector into a platform to enhance smart cities’ accomplishments.   Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Korean Gov’t to Accelerate Construction of Big Data-Based Smart City - Businesskorea",
    "datetime": "2017-10-31T08:15:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=19682"
}