{
    "text": " South Korea is lagging about four years behind advanced nations in terms of preparations and responses to the Fourth Industrial Revolution, according to a recent study. The Korea Institute for Industrial Economics & Trade released a report, rating the country’s manufacturing industry at 81 of 100 points in the race toward the Fourth Industrial Revolution.\n\nWith advanced countries as the base with 100 points, the think tank measured South Korean companies’ comparative levels of preparations and responses. A gap of one year is equivalent to five points. In the category of production and manufacturing process, South Korea scored 90 points, showing a two-year gap with advanced nations, and received around 73 points and 75 points in design and brand with a large gap of five years. By industry, South Korea had no or little gaps of one year to two years with advanced countries in IT products and IT components in which the country has the global competitiveness. However, it had a six years of gap in the new industry and material industry sectors. The report said that South Korea is lagging four years behind advanced nations in terms of preparations and responses to the Fourth Industrial Revolution. By value chain, the country has the highest level of responses in production and manufacturing process but it is still lagging about two years behind advanced companies. In addition, report said that the competition source of the Fourth Industrial Revolution will be changed from production and manufacturing process to software and platform establishment. South Korea should get rid of fixed ideas about the existing manufacturing industry and industrial policy and binary thinking of manufacturing industry and service industry, and improve its competence to rapidly respond to new changes.  Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Korea's Manufacturing 4 Years Lags in 4th Industrial Revolution - Businesskorea",
    "datetime": "2017-05-25T03:00:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=18169"
}