{
    "text": "Winners of the Chicago Korean Cultural Center's Student Art Contest, \"Exploring K-Culture,\" were announced May 15 at the cultural center in Wheeling.\r\n\t\tCourtesy of Korean Cultural Center of Chicago Yoon Tae Kim, right, president of the Korean Cultural Center of Chicago is pictured with Grand Prize winner Naransolongo Batgerel.\r\n\t\tCourtesy of Korean Cultural Center of Chicago \"K-POP Meets Korean Dance,\" by Naransolongo Batgerel, took the Grand Prize in the Korean Cultural Center of Chicago's Student Art Contest.\r\n\t\tCourtesy of Korean Cultural Center of Chicago The third Chicago Korean Cultural Center-sponsored Student Art Contest accepted artworks under the theme of \"Exploring K-Culture\" and held an awards ceremony and exhibition Saturday, May 15. The Cultural Center revived the competition, which had been temporarily suspended since 2015, and set the theme of the work in view of the recent rise in the Korean culture. The opportunity to participate was expanded to all students in the Chicago area, giving a total of 92 students an opportunity to show off their talents to their fullest -- and 41 students won an award. The competition was held in four grade categories, kindergarten/elementary, elementary, middle and high school, with each level awarding first, second, and third prizes, in total 12 winners, and one Grand Prize winner  -- Naransolongo Batgerel's \"K-POP Meets Korean Dance.\" In addition, special awards, honorable mentions and artfully creative awards were selected, and commemorative T-shirts were provided to all participants. The Grand Prize winner was awarded Congressman Brad Schneider's Certificate of Award, and the four first-place winners were awarded the Mayor of Wheeling Patrick Horcher's Certificate of Award. Horcher (village of Wheeling), Scott Britton (Cook County commissioner), Liz Polmanski (deputy chief of staff), and Debbie Fandrei (Buffalo Grove Raupp Museum curator) attended the award ceremony to hand out the awards and congratulate the students. Through June 24, the awarded artworks will be exhibited at the Raupp Museum, a Buffalo Grove regional history museum at 901 Dunham Lane, in partnership with Korean Cultural Center of Chicago. • Grand Prize: \"K-POP Meets Korean Dance\" by Naransolongo Batgerel • First place: \"Korean Culture\" by Jinu Choi; \"Proud Korea\" by Seoyeon Seong; \"Traveling Around Korea\" by Dainne Park; and \"My Ancestor's Soul\" by Michael Choi. • Second place: \"Warrior and Shield Kite\" by Esther Kim; \"The Grove Day of Spring\" by Aaron Ahn; and \"The Hanbok Dance\" by Kyuri Moon. • Third place: \"Turtle Ship\" by Jason Kim; \"Korean Desserts\" by Brigid Park; \"Korea's Samul nori\" by Hudson Kim; and \"Adoring Winter Kimchi\" by Jihye Kim. Special Award: Eight students • Honorable Mention: 10 students • Artfully Creative Award: 10 students The Korean Cultural Center of Chicago, 9930 Capitol Drive, Wheeling, is a nonprofit organization whose mission is to promote and organize Korean cultural, artistic, educational and social activities. Korean Cultural Center of Chicago seeks to be a community landmark where people of all ethnicities can come together and explore Korean traditions and culture through various classes, programs and events. Approximately 80,000 people visit the cultural center annually. Korean Cultural Center of Chicago strongly encourages cross-cultural understanding that can embrace and empower all people to coexist peacefully. For information, visit www.kccoc.org or call (847) 947-4460. ",
    "title": "Korean Cultural Center hosts Student Art Contest",
    "datetime": "2021-06-02",
    "url": "https://www.dailyherald.com/submitted/20210602/korean-cultural-center-hosts-student-art-contest"
}