{
    "text": "The Chinese government’s subsidy reduction and the global economic recession halted the growth of the global electrical vehicle (EV) battery market in the second half this year. Yet LG Chem, Samsung SDI and SK Innovation managed to expand their market shares in August. SNE Research, an energy market research firm, said on Oct. 20 that overall EV battery usage totaled 7.1 gigawatt-hours (GWh) in August, down 10 percent from a year ago and the first drop in two years and 7 months since January 2017. Chinese and Japanese battery makers, except China’s leading EV battery producer CATL, are taking a considerable hit from the economic slump in China and the United States, the world’s two largest markets. The industry’s fourth maker BYD saw the usage of its batteries plummet by 61.1 percent and the fifth-placed AESC suffered a 0.6 percent decrease as well. Second-ranked Japanese maker Panasonic also suffered a 22.5 percent plunge due to sluggish sales of Tesla, its U.S. customer. Meanwhile, South Korea’s leading battery makers LG Chem, Samsung SDI and SK Innovation posted a rise in the usage of their batteries. As a result, their combined market share soared to 18.8 percent, up 7.4 percentage points from a year ago (11.4 percent). LG Chem came in third (12.6 percent) with a 79.9 percent increase in the application of its batteries from the same period last year. Samsung SDI took the sixth place (4.4 percent) with a 10 percent increase, while SK Innovation placed ninth (1.85 percent) with an 8.1 percent rise. The fast-growing Chinese EV market is faltering due to reduced government subsidies and the global economic recession. China is already in an oversupply of batteries. And now a considerable number of Chinese smaller manufacturers are dependent on government subsidies. Some analysts say that these newcomers are likely to die out one after another. In addition, the center of the global EV market is forecast to shift from China to Europe in the future. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Korea’s Top Three EV Battery Makers Increase Market Share - Businesskorea",
    "datetime": "2019-10-21T09:41:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=37177"
}