{
    "text": "The Nationthailand Add to Home Screen.     The show featured various \"hanbok\", the Korean traditional costume, modelled by special personalities like South Korean Ambassador Moon Seoung-Hyun, national taekwondo team coach Chatchai Choi, Olympic gold medalist Panipak Wongpattanakit (tennis), DJ Bookko and Chananporn Rosjan (Captain Nod), who is a descendant of a Korean War veteran and Miss Thailand Universe 2005, currently working as a captain at Thai Air Asia.  The models were attired in unusual hanbok, such as a royal robe (gonryongpo), official uniform (gwanbok) and noblemen’s robes (dopo). Ambassador Moon subsequently appointed all celebrity guests as honorary ambassadors of Korean culture. The show opened with Korean Cultural Centre instructor Kim Hyun-Ji playing the \"gayaguem\", a traditional Korean instrument, while Hanyang University adjunct professor Lee Ji-Seon, presented a “giwonmoo” performance, a traditional dance wishing people peace and prosperity.  It was also an opening ceremony for the “Hanbok in K-series”, a new Korean Cultural Centre exhibition from February 14 to April 29. The exhibition follows the massive popularity of Korean TV series in Thailand. Visitors can see various kinds of hanbok and traditional plays similar to characters from K-series. The Korean Cultural Centre also features a photo zone with famous scenes from the latest hit K-series “The King’s Affection” and “The Red Sleeve”, with the cooperation of KBS, MBC and Netflix. According to streaming analytics website FlixPatrol, “The King’s Affection” reached its highest viewing record in Thailand among the world’s Netflix users. “The Red Sleeve” also ranked high in viewing rate via Viu Thailand.  Visitors to the exhibition can dorn hanbok seen in legendary K-series including “Dae Jang Geum”, such as the \"gonryongpo\", \"dangui\" (upper garment for women), \"gwanbok\" and \"dopo\". A traditional game zone is also included so visitors can take part in “tuho” (arrow throwing) and “jegichagi” (kicking a shuttlecock), often featured in Korean TV shows. Furthermore, the centre’s 2nd floor features a hanbok exhibition titled “Uri Life” (Our Life) under cooperation with the Korea Craft & Design Foundation until March 31. For more details, visit the Facebook page (@koreanculturalcentreTH). The Korean Cultural Centre also said it plans to provide traditional wedding services or “doljabi” (a party for one-year-olds) for Thais or international couples. The centre invites those who would like to request the service to send in their “personal story with the reason for the service” to the email [email protected]. ",
    "title": "Korean Cultural Centre highlights K-series ‘hanbok’ in exhibition, fashion show",
    "datetime": "2022-02-17T16:14:00+07:00",
    "url": "https://www.nationthailand.com/lifestyle/40012459"
}