{
    "text": "All Headlines North Korea Sports Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies URL is copied. SEOUL, Oct. 1 (Yonhap) -- An inaugural Korean culture festival will kick off next week to give people from all over the world chances to enjoy Korean cultural heritage and modern trends in a virtual way, the culture ministry said Thursday. The first edition of the 2020 K-Culture Festival will be held online from Oct. 10-Nov. 29, according to the Ministry of Culture, Sports and Tourism. Led by the ministry and the Korean Foundation for International Cultural Exchange (KOFICE), the newly launched event was designed to promote the global expansion of the Korean wave, or \"hallyu,\" and help K-pop fans experience Korean cultural and artistic traditions. Super Junior-K.R.Y. a sub-group of boy band Super Junior, and girl group Red Velvet will participate in promotional events and concerts as honorary ambassadors for the festival. The \"INK Festival\" will open the K-Culture Festival, featuring K-pop concerts and introductions of food and tourist attractions of Incheon, the western port city and the country's main gateway. For the online travel program, video clips in which Korean stars show the cultural heritage of Mokpo, Jeonju, Gangneung and Andong will be uploaded every day on YouTube. K-pop concerts to be held in the four cities will be streamed online through the festival's YouTube channel and broadcast on the SBS television every Sunday from Nov. 8-29. Super Junior-K.R.Y. (L) and Red Velvet are shown in this promotional image provided by the Ministry of Culture, Sports and Tourism. (PHOTO NOT FOR SALE) (Yonhap)  brk@yna.co.kr(END) All News National North Korea Economy/Finance Biz Culture/K-pop Sports Images Videos Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies Korea in Brief Useful Links Festival Calendar Weather Advertise with Yonhap News Agency ",
    "title": "Korean culture festival to kick off virtually next week | Yonhap News Agency",
    "datetime": "2020-10-01T10:00:04+09:00",
    "url": "https://en.yna.co.kr/view/AEN20200929004400315"
}