{
    "text": " The Act on Overseas Medical Expansion and Foreign Patient Attraction Support passed the plenary session of the National Assembly on Dec. 2. It is expected that the act will allow more than 160 domestic medical institutions to go abroad and at least 500,000 foreign patients to visit Korea by 2017. According to the act, medical institutions wishing to go abroad can benefit from financial and tax incentives based on relevant laws such as the Export-Import Bank of Korea Act. Similar benefits go to agencies attracting foreign patients, too. In addition, medical advertisements are allowed at duty-free stores, airports, ports and the like and those patients returning to their countries after treatments in Korea can get follow-up services in their countries by means of telemedicine. The globalization of Korea’s medical industry is expected to result in the creation of up to 50,000 jobs a year. The medical tourism market of Korea is growing at a rapid pace these days but still lagging behind those of Thailand, Singapore, etc. Over two million foreign tourists visit Thailand a year and the size of its medical tourism market already exceeds 3 trillion won (US$3 billion). Likewise, more than one million people arrive in Singapore each year for the same purpose. Medical Tourism in India, Malaysia and the Philippines are showing a double-digit growth and the Japanese and Chinese governments are trying hard to catch up with them. Experts point out that Korea needs to provide personalized medical services, work on diverse medical tourism resources and build specialized brands if it is to remain in the game. According to the Korea Institute for Industrial Economics & Trade, Korea ranks 19th out of the 34 OECD member countries in terms of overall medical tourism competitiveness. Specifically, Korea ranks second in facility and equipment, fourth in medical service, ninth in technological level but 31st in human resources and 33rd in industrial growth potential. A key solution to this problem is digital healthcare characterized by telemedicine. In this regard, Korea signed cooperation agreements with the Czech Republic, Vietnam, the Philippines, Peru, Brazil and China this year. The Severance Hospital, Gacheon Gil Hospital, Hanyang University Hospital and many more are expected to expand their business abroad based on the MOUs. Digital healthcare will provide personalized healthcare and medical services by combining medical care with ICT. The medical industry is focusing on it as a new paradigm because it can contribute to disease prevention and management, higher medical service quality and lower medical costs. Korea, which is home to excellent medical workers and advanced ICT, can get the inside track in this field. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Korea Passed New Law for Promotion of Medical Tourism - Businesskorea",
    "datetime": "2015-12-04T05:30:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=13199"
}