{
    "text": "South Korean banks posted an aggregate interest income of 37.3 trillion won last year. In the first quarter of this year, the figure reached 9.7 trillion won. Banks’ interest income comes from the gap between deposit and lending rates. It gets bigger when the gap widens. In the backdrop of the huge interest earnings was banks’ practice of raising lending rates arbitrarily, almost to the point of manipulation. The Financial Supervisory Service (FSS) announced on June 21 the results of its recent inspection into the banks’ lending rate calculation systems. The banks subject to the inspection were Kookmin Bank, Shinhan Bank, Woori Bank, KEB Hana Bank, NH Nonghyup Bank, Industrial Bank of Korea, Citi Bank Korea, SC Bank Korea, and Busan Bank. The inspection uncovered some of the mean tricks banks used when they provided loans to their customers. The interest rate on a loan consists of two components: the standard interest rate set by the Bank of Korea, and the additional interest rate, which is determined freely by the bank based on its risk assessment. The most frequently used trick was to slap unfairly high additional interest rates on borrowers based on a falsified evaluation of their credit worthiness. To falsify borrowers’ ability to repay their debt, some banks made it look like the borrowers had no income or collateral. Mr. A, an office worker with an annual income of 83 million won, borrowed 50 million won for two years from a bank in November 2015 at an annual interest rate of 6.8%. The bank added 0.25% points to the standard interest rate if the borrower’s debt ratio (total loan to annual income) exceeded 250%, and added 0.50% point if the ratio exceeded 350%. It is from the idea that the smaller the income, the lower the repayment ability. Mr. A had an income of 83 million won a year, but in the banking industry computer system, he was entered as having no income. As a result, the debt ratio exceeded 350%, meaning the additional interest rate applied to him was 0.50% points. He paid 500,000 won more in interest on his loan. Mr. B, a business owner, borrowed 21 million won from a bank in January this year. The interest rate calculated by the computer system was 9.68%. However, for some reason, the bank has applied the highest interest rate of 13% per annum to him. Mr. B paid 280,000 won more in interest over five months. Mr. C took out a secured loan of 30 million won from a bank in March last year. The interest rate applied to him was 8.6%. Yet the bank has entered in the computer system that he offered no collateral and applied to him a credit premium of 3.7%, 2.7% points higher than the normal rate of 1%. This made him pay 960,000 won more in interest. The Financial Supervisory Service (FSS) said that it found many cases where many banks calculated interest rates wrong by giving low or no income or collateral value. An FSS official said, \"We will disclose the names of the banks as soon as we confirm the results of the inspection.” Banks sometimes calculated credit premiums assuming economic recession even when the economy was booming or applied the same credit premiums disregarding the economic fluctuations. This, in turn, increased additional interest rates. There were cases where the banks lowered prime rates when the borrowers’ credit ratings rose. When a borrower whose credit rating rose asked for a rate cut, the branch manager kept the lending rate intact by reducing the prime rate. The way these banks calculated loan interest rates was more like a crime than a commercial practice. An FSS official said, \"We believe that the banks also recognize that they often calculated interest rates in an unethical way and will refund the interest payments they overcharged to their customers.\" Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Korean Banks Found to Have Manipulated Loan Rates - Businesskorea",
    "datetime": "2018-06-21T23:46:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=23185"
}