{
    "text": "Korean information & communication technology (ICT) companies that have introduced simple payment services since 2014 are waging a second round of “pay war” with differentiated services. They are seeking to make their services “the third mobile platform” after the search and messenger platforms by adding not only financial product brokering but also shopping and travel functions. According to industry tracker WiseApp on Nov. 21, Samsung Electronics payment tool “Samsung Pay” surpassed 10.4 million monthly active users (MAU) as of last month. Samsung Pay, which was first launched in South Korea in August 2015, allows users to pay at all terminals where they can swipe a credit card by applying the magnetic secure transmission (MST) technology to smartphones. Its cumulative transaction amount in South Korea alone reached 18 trillion won (US$15.93 billion) as of April this year. Kakao Pay, a subsidiary of Kakao Corp., is on the traces of Samsung Pay. Kakao Pay is expanding the user base at the fastest pace through its Kakao Talk, the most popular messaging app in the nation. The amount of money wired or paid via Kakao Pay in Kakao Talk already exceeded 2.3 trillion won (US$2.04 billion) a month as of October this year and its MAU surpassed 130 million. Based on the achievements, Kakao Pay added Kakao Investment service on Nov. 20 to its existing payment, remittance, and billing services. On the first day of release, 970 million won (US$858,407) worth of four products were sold out. The new service has merits as users do not have to install a new app or open up a new bank account and a minimum amount of investment money is only 10,000 won (US$8.85). Kakao Pay is also planning to launch a global cross-border mobile payment service for overseas payment that enable users to pay money without cash or credit cards by scanning a QR code via their smartphones. The new service will begin in Japan in the first quarter of next year and extend to China and other Asian countries. Naver is pushing to reform its search services and will bring “Naver Pay” to the forefront of its services. Naver is now test operating the new app that enables users to check the commerce page, including shopping, and “My Pay” menu by flipping over the page to the left. As Naver Pay is available in a considerable amount of online shopping malls and stores affiliated with Naver, the range of application is expanding. The total number of Naver Pay users exceeded 26 million as of last month. Naver hasn’t disclosed any specific figures like MAU, but the industry estimates its monthly average transaction amount at around 900 billion won (US$797.17 million). NHN Entertainment is promoting “Payco” as its new future growth engine following existing key businesses such as game and contents. The service has various offline mobile simple payment methods, such as near field communication (NFC), barcode and MST. MST was first installed in August through a partnership with Samsung Pay. In particular, the company recently released “Payco shopping” and is considering the sale of special tour packages after taking over integrated travel agency Tourbaksa, focusing on adding diverse services to simple payment and remittance functions. South Korean large ICT companies have been putting a lot of efforts into the market for years because simple payment and remittance are merging as the third key mobile platform just like Naver and Daum attracted tens of millions of users and made profits from search engines and Kakao Talk and Line from messaging services in the past. To be sure, each company has a different strategy. Samsung Electronics is planning to retain smartphone users through Samung Pay and expand the user base. Kakao Pay is aiming to become “integrated financial platform” that can sell financial products and make global transactions. Naver is also seeking to increase the number of affiliated shopping malls and users through Naver Pay and establish an ecosystem. In addition, Payco is planning to construct big data through its simple payment and remittance platform and make use of it in its advertising business. Chung Ho-yoon, an analyst at Eugene Investment & Securities, said, “Domestic ICT companies will also expand their services to various financial sectors through their simple payment and remittance platforms in the future. Considering foreign cases, including China’s Alipay, the platforms are highly likely to become a financial portal in the end.” Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Korean ICT Companies Add New Functions to Their Simple Payment Services - Businesskorea",
    "datetime": "2018-11-22T10:26:40+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=26785"
}