{
    "text": "Korean Air announced on July 27 that it has conducted a special inspection of in-flight air circulation systems and high efficiency particulate air (HEPA) filters in its airplanes to ensure that their in-flight environment is safe from the COVID-19 virus. Korean Air has recently completed a special inspection of HEPA filters and in-flight air circulation systems in its aircraft to relieve anxiety about air quality among air travel passengers caused by the COVID-19 virus. Korean Air employees checked whether HEPA filters were properly installed and were contaminated. They replaced some of the HEPA filters with new ones. They also checked the overall performance of the air circulation systems including checking the operation of the air circulation fans. HEPA filters contribute to creating a virus-free clean environment in airplane cabins by filtering re-circulated air. A constant air circulation system and air flow from top to bottom minimizes the possibility of COVID-19 spread from boarding to arrival. HEPA filters are high-performance filters that effectively block various particles such as dust, viruses and bacteria. They block particles almost 100 percent as particles larger than 0.3 μm cannot pass through their inner fiber, while those smaller than 0.3 μm stick to the inner fiber. The inner fiber of the filter blocks 0.3μm particles 99.97 percent or more. For this reason, HEPA filters are used in operating rooms, aseptic rooms and medical laboratories in hospitals where sterilization is required. They can filter more than 99.9 percent of microscopic bacteria or viruses inside airplanes as they do in a hospital's sterile chamber. Saliva droplets are currently known as the medium through which the Covid-19 virus spreads and one saliva droplet is about 5 ㎛. The size of an aerosol floating in the air is about 1 μm. The COVID-19 virus itself is 0.07 ㎛ to 0.12 ㎛. This means that neither saliva droplets and aerosols nor the COVID-19 virus itself can pass through HEPA filters on airplanes. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Korean Air Carries Out Special Inspection of HEPA Filters on Airplanes - Businesskorea",
    "datetime": "2020-07-28T14:54:14+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=49650"
}