{
    "text": "All Headlines North Korea Sports Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies URL is copied. SEOUL, Jan. 5 (Yonhap) -- The King Sejong Institute Foundation (KSIF), a South Korean government entity that operates Korean language centers abroad, will focus more attention on the quality of its programs than on quantitative expansion from now on, the foundation's chief has said. \"There are indeed famous organizations like Goethe-Institut of Germany and Alliance Francaise of France which introduce their language and culture. But there is nothing like King Sejong Institute that has made such quantitative achievements in such a short period of time,\" KSIF President Kang Hyoun-hwa said during an interview with Yonhap News Agency on Thursday. \"We'll seek qualitative growth from now on for projects that we have realized thus far,\" she said. This image captured from the Website of the King Sejong Institute Foundation (KSIF) shows its president Kang Hyoun-hwa (Yonhap)  Inaugurated in September last year, the KSIF head is a Korean language specialist who majored in and taught Korean language and literature at Yonsei University and served as the head of the Korean Language and Culture Education Academy and Korean Grammar Education Academy. The foundation, launched in 2012, currently manages 172 King Sejong Institute centers in 56 countries, where about 57,000 foreigners learn the Korean language annually. Some 150,000 people are also taking the Institute's online courses. The Institute was named after Sejong the Great, the fourth king of the Joseon Dynasty (1392-1910) and inventor of the Korean alphabet \"hangeul.\" It's important to nurture long-term Korean language learners based on \"hallyu,\" or the Korean wave, Kang said, adding that foreigners should learn hangeul if they really want to know about Korean culture. \"K-pop and K-food are important tools to introduce our culture. But our ultimate goal is to share quality Korean culture (with the world),\" she said. To that end, the foundation will increase investments particularly in the institutes' human resources, including youth interns, administrative staff and teachers there, she added.(END) All News National North Korea Economy/Finance Biz Culture/K-pop Sports Images Videos Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies Korea in Brief Useful Links Festival Calendar Weather Advertise with Yonhap News Agency ",
    "title": "KSIF will concentrate on quality of Korean culture programs: chief | Yonhap News Agency",
    "datetime": "2019-01-05T09:10:00+09:00",
    "url": "https://en.yna.co.kr/view/AEN20190104009300315"
}