{
    "text": "UCLan will see a celebration of Korean food, music and costume when it hosts the Lancashire Korea Festival. The day-long event at 53 Degrees is being organised by the International Institute of Korean Studies, and will share both traditional and modern aspects of K-culture. A selection of cultural programmes will include a fashion show, K-Pop performance, traditional music, dance and costumes, handicraft workshops plus Korean snacks and drinks. Applications are open for male and female models via email to LERobertson@uclan.ac.uk with a clear photo and 150 word statement on why you want to take part. Male model applicants must be between 175cm and 180cm in height with UK shoe size 6.5 to 10. Female models must be between 160cm and 170cm in height with UK shoe size 4.5 to 7. The Lancashire Korea Festival will take place on Saturday 28 September from 12pm to 5pm. Tickets cost £5 and are available from Eventbrite or on the door in cash. Free parking is available in the Victoria car park. Follow the Facebook event for updates. Read more: Work has started on UCLan’s Civic Square and Student Centre Will you be going to the festival? Let us know in the comments below. Sign up below to receive Blog Preston's weekly newsletter. It wings its way into inboxes every Sunday rounding up our best content from the last week and a look ahead to what's happening. Find news by location, select an area of your choice to be kept up to date with the latest goings on. Find news by category, select an category of your choice to be kept up to date with the latest goings on. All rights reserved © 2008-2023 BlogPreston was founded by Ed Walker Preston based 3manfactory designed & developed the website Preston based Clook Internet host the website Blog Preston is a member of the Independent Press Standards Organisation (IPSO) Blog Preston is a Community Interest Company. Company number 08814641. Receive our digest of the biggest and best stories every Sunday to your email inbox ",
    "title": "Lancashire Korea Festival at UCLan to celebrate all aspects of K-culture |  Blog Preston",
    "url": "https://www.blogpreston.co.uk/2019/09/lancashire-korea-festival-at-uclan-to-celebrate-all-aspects-of-k-culture/"
}