{
    "text": "A lawsuit filed Monday by Juan Cobbin, a former Capitol Police sergeant and head of K-9 training, alleges a culture of racial discrimination that has plagued the department’s K-9 unit for years. Cobbin is a Black man who served as head of K-9 training intermittently from August 2013 to May 2021 and was the first African American K-9 training leader at the department. Cobbin has been shuffled in and out of the role, with the Capitol Police wanting to “place unqualified white individuals into the role,” the lawsuit states, adding that the department would bring Cobbin back into the position “to train those individuals or to help the K9 Training Unit to recover due to their mismanagement.” In October 2021, the department removed Cobbin from consideration for the head of K-9 training position, claiming he lacked minimum qualifications for the role. When Cobbin was on the 55-officer K-9 unit, he was one of six African American officers. “The truth is that Sgt. Cobbin was removed from consideration because he is African American, and he had complained about discrimination in the K9 Unit,” the lawsuit alleges. The filing, which alleges racial discrimination and retaliation, points to several various instances of alleged racial discrimination and animus over the years. Robert Spruill, an African American K-9 technician who used to  work at the Capitol Police department, met Cobbin when Cobbin started on the force in the early 2000s. Spruill provided Cobbin with a written statement about the racist treatment he had endured from white colleagues. Spruill, who has since died, gave Cobbin the statement around 2004. Spruill said when he interviewed for his K-9 position, Lt. Charles Shelton asked Spruill what he would do if a sergeant called him a racial slur while they were in the field training. Another time, Shelton was speaking with a K-9 technician who had finished a sweep of a Congressional Black Caucus dinner in which Spruill overheard Shelton ask someone if the Congressional Black Caucus was served chicken and collard greens for dinner. Spruill also recounted that his colleague told him he would never live next to anyone who was African American. When Cobbin started at K-9 in 2009, he was told by a veteran officer that some of the dogs’ names were changed because the old names were racist, the lawsuit says. In 2013, a group of white K-9 officers, spearheaded by Garrett Zborai, sent out a petition to deprive Cobbin of working as head of training; instead, they wanted Sgt. Anthony Phelps, who is white, to have the role. Phelps had never been a K-9 trainer and lacked the training and certifications Cobbin had, the lawsuit alleges. The attorney bringing this claim, Les Alderman, also represents Officer Mauricia Van Meter, who filed a sexual discrimination lawsuit against the department that names Phelps. Cobbin’s lawsuit calls attention to social media posts by K-9 technician Andy Maybo, who has previously served as the head of the Capitol Police’s union. In 2015, Baltimore Mayor Stephanie Rawlings-Blake decided to settle with the family of Freddie Gray, a Black man who died in police custody, for $6.4 million. Gray’s death earlier that year spurred riots in the city. “Maybo’s posts berated the city for settling with Gray’s family, referring to Freddie Gray as a ‘POS’ [Piece of Shit] and calling for the Mayor of Baltimore (then Stephanie Rawlings-Blake), who is African American, to be ‘placed in jail with the animals who placed all these officers in danger,’” the lawsuit states. Mayo in 2016 posted about an incident in Chester, Pa., in which an officer was shot and a suspect was killed after a traffic stop. “Referring to the African American crowd that had gathered after the event, Maybo posted ‘as for the unruly crowds … I hope more of those mutts get shot!’” according to the lawsuit. In the summer of 2020, Christopher Baranowsky, a white K-9 technician, objected to a decision by Cobbin and other African American leaders in the Special Operations Division to have the K-9 officers leave their dogs in their training facility kennels when those officers were tasked with non K-9 duties such as providing added support for larger demonstrations, the lawsuit says. Although the dogs are trained for explosive detection work and not used for crowd control situations, Baranowsky wanted the K-9 officers to have their dogs with them at all times, including when officers were assigned non-K9 duties related to large demonstrations, the lawsuit alleges. This originally became an issue when Baranowsky wanted the officers to have their dogs with them when they were assigned non-K9 duties during Black Lives Matter and related protests in summer 2020, according to the lawsuit. “Not only would the presence of K9s have created a serious danger to the public, K9s, and officers, it also would have further aggravated racial tensions following the death of George Floyd and created a public relations nightmare for the USCP, harkening back to the horrific use of police dogs to attack African American civil rights demonstrators in the 1960’s,” the lawsuit stated. Cobbin and others who were in the chain of command at the time disagreed with Baranowsky and explained the dangers and appearance of discriminatory policing tactics, the lawsuit states. Baranowsky strongly disagreed with the decision not to have the dogs accompany K-9 officers during those large demonstrations and expressed that to his superiors. In a Jan. 11, 2021, email to K-9 technicians, just days after the Capitol was attacked by supporters of former President Donald Trump, Baranowsky criticized then-Capt. Denea Newell and then-Lt. Eric Graves, both of whom are African American, for their decision-making. Baranowsky said it was a “failure of our department” to have them in the K-9 chain of command and called Cobbin a “joke.” On Jan. 12, Christopher Skomra, a K-9 technician, replied to Baranowksy’s email and expressed discontent about officers being investigated for their interactions with the rioters on Jan. 6. “I’ve been hearing from outside resources that many of our guys(10 to 15) are being investigated for helping these so called protestors????? There is video of theses guys taking ‘selfies’ with the ‘protestors’! What the fuck are we to we say to folks???JjFC we are supposed to be cops and there are videos of our guys KNEELING FOR BLM (which seems fine) and then MAGA hat being bad…send fucked up to me….,” Skomra wrote. The lawsuit notes that Michael Riley, a former Capitol Police K-9 technician, was indicted and charged with obstructing an investigation into the Jan. 6 insurrection. He is alleged to have told a man who breached the Capitol during the insurrection to delete his Facebook posts. Riley allegedly told the man who stormed the Capitol that he agrees with his political stance and subsequently deleted his communications with the man. Riley resigned from the department in October. Cobbin was removed from his role as head of K-9 training and from the K-9 unit entirely around April 30, after he complained to his superiors about the emails and shortly after he met with the Office of Professional Responsibility. Cobbin was replaced by a white sergeant who was not a certified K-9 detector dog trainer, which is a requirement for the position, the lawsuit states. Cobbin resigned from the department on Oct. 31. “Although we typically cannot comment on pending litigation. We take diversity and inclusion seriously. We will look at the allegations and provide more if we can,” a spokesperson for Capitol Police said. Officers named in the lawsuit could not be reached for comment. “This environment in which racism and bigotry took over did not happen overnight or by magic. It happened because leadership ignored the problem and indeed made it worse by their own personnel decisions,” Alderman, counsel for Cobbin, said in a statement. “Capitol Police knew about this and let it grow unchecked. Just like a garden that never gets weeded — pretty soon, it gets taken over. This is a situation that Congress needs to address, because Capitol Police and the Capitol Police Board have shown that they are incapable of doing so.” ",
    "title": "Lawsuit alleges culture of racial discrimination in Capitol Police K-9 unit",
    "datetime": "2021-11-22T18:29:15+00:00",
    "url": "https://rollcall.com/2021/11/22/lawsuit-alleges-culture-of-racial-discrimination-in-capitol-police-k-9-unit/"
}