{
    "text": "Copy this text to your clipboard and paste into your CMS  Video of Roseta Lopa at the 2017 K-Culture Festival, uploaded by her cousin on YouTube. The 2017 winner of a K-pop singing competition is set to defend her crown as Wellington gears up for the K-Culture Festival this weekend. Korean pop enthusiasts from around New Zealand will sing and dance to their favourite K-pop songs at the national contest. Two winners will compete to progress to an international online final – giving them the chance to compete in the world finals in Changwon, South Korea, later in the year. Roseta Lopa, 15, impressed the judges last year with her rendition of Come Back Home by hip-hop band 2NE1. The Porirua College student – who had a taste of stardom recently when her group Le ART went viral for their version of the New Zealand national anthem – said she was drawn into the world of K-pop by chance. “It was an accident. My sister was really interested in K-dramas, so I was reeled in by the soundtracks, which I discovered was a branch of the vast genre of K-pop. “I loved what I heard and decided to discover more artistes, modern and old.” Roseta Lopa (right) won the Vocal Category of the K-pop contest in 2017’s K-Culture Festival. The appeal of K-pop is in the lyrics and production value, said Roseta. “I love how poetic Korean songs can be. One of my most favourite aspects of K-pop is that most songs have substance with a lot of musical ingenuity in the production and writing of songs – something I feel that Western music has begun to lack.” Learning to sing in Korean was a challenge, but going through it with native speakers has helped. “It is nerve-racking performing in front of native Koreans, and very difficult as it is not a language I am fluent in. But with the exposure to the language through K-pop music over the past few years, I have sort of got the hang of it. “My tip would be to always check pronunciation with someone fluent in the language, as sometimes subtle differences in pronunciation can change the meaning of songs drastically.” Roseta, a big fan of K-pop superstar IU, also lists Ailee, BIGBANG, Lee Sun Hee and So Hyang among her favourite K-pop artistes. Any hints as to what she’ll be performing this weekend? “You’ll have to come down to hear it! Hope to see you there!” The 2018 K-Culture Festival takes place 12.30pm–6pm on Saturday, 28 July, at the Michael Fowler Centre in Wellington. As well as the K-pop contest, it features performances by hip-hop dancers Gorilla Crew, b-boy group Gamblerz, and more traditional percussion music and dance performances. – Asia Media Centre ",
    "title": "Le ART singer to defend title at K-pop singing competition",
    "url": "https://www.asiamediacentre.org.nz/news/roseta-lopa-k-pop-vocal-contest-wellington/"
}