{
    "text": " PUBLISHED : 11 Aug 2021 at 04:00 NEWSPAPER SECTION:  Life WRITER: \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPatcharawalai Sanyanusin Here's a good chance to enjoy K-culture while staying at home during lockdown. The Korean Cultural Center (KCC Thailand) presents online K-pop singing and dancing classes conducted by big names in Korea, starting next week, as well as a Korean puppet show on Aug 20, free of charge to all. As the pandemic has forced a pause of \"K-pop Academy\", which invited professional K-pop trainers to give free lessons to students in Thailand every year, the project is going virtual this year with the launch of \"Online K-pop Academy\" featuring two famous vocal and dance trainers in the K-pop industry. Choreographer Park Jun Hee, who has worked with popular K-pop idols such as Gfriend, Iz*One and Weki Meki, and appeared as a dance trainer in famous TV shows such as Idol School and UHSN by Mnet Korea, will teach K-pop dance. Her classes will run every Monday and Thursday from 6-7.30pm, from Aug 16 to Sept 2. Kevin Yoon. Kevin Yoon, who formerly trained famous K-pop artists at JYP Entertainment between 2013 and 2017 and is currently a vocal trainer at YG Entertainment and YGX Academy, will give a vocal class every Tuesday and Friday from 6-7.30pm, from Aug 17 to Sept 3 (no class on Aug 24). All classes will be conducted via Zoom. Places for the vocal training are limited to 1,000 students. Prior registrations should be made by tomorrow via bit.ly/37x4APj (dance class) and bit.ly/3CmocUG (vocal class). Exclusively on Aug 20 at 7pm, KCC Thailand in collaboration with Seoul Art Center will present an online non-verbal puppet performance featuring Dallae's Story, via its Facebook page. The story is about an ingenious girl named Dallae and her ordinary family whose lives are interrupted by the Korean War during the early 1950s. Suitable for both children and parents, the show portrays the efforts of a family to overcome the hardships of wartime in a fairy-tale-like fantasy along with Korean traditional music, glamorous sets and a uniquely vivid combination of human performers and puppets. Visit facebook.com/koreanculturalcenterTH.  Dallae's Story is a non-verbal puppet performance.  Online K-pop Academy  By subscribing, you accept the terms and conditions in our privacy policy. ",
    "title": "Learn K-culture from the comforts of home",
    "url": "https://www.bangkokpost.com/life/social-and-lifestyle/2163603"
}