{
    "text": "Leenalchi make their UK debut as part of an exciting Korean cultural festival in London this month. K-Pop band Leenalchi have made their UK debut as part of a show celebrating Korean culture. ‘Tiger is Coming’ is a festival taking place at the Coronet Theatre in London from 26 August to 1 October. The festival is a celebration of Korean contemporary art, performance and culture. As part of the festival, K-pop band Leenalchi performed three shows, from 10-12 September. The Notting Hill-based theatre paid host to the six-piece band to a rapt audience. The band’s line-up with four traditional singers, two bassists and a drummer makes them a unique offering in the K-pop genre. The cross-cultural celebration of Korean media in the UK is a part of the broad soft-power efforts of Korea in recent years to improve their artistic exports. ‘Hallyu’ or ‘Korean Wave’ is the term to describe the cultural exportation and it’s clearly worked with ‘Parasite’ winning a best picture Oscar, ‘Squid Game’ becoming the most watched Netflix show and BTS taking over the world’s music charts. Brits are massive K-pop fans, streaming the most of the genre in Europe and the 11th most in the world. For Leenalchi, Tiger is Coming is a massive opportunity to break into the UK scene alongside their peers in BTS and BlackPink. Founded in 2019, their music has a growing following, in part helped by the inclusion of their single ‘Let’s Live for Today’ on the Apple TV series ‘Pachinko’. Bassist Jang Young-gyu is also known for scoring the soundtracks to Korean horror films ‘The Wailing’ and ‘Train to Busan’. Despite their increasing recognition though, the band is unassuming of their stature. “We hear a lot from the general public that we are famous internationally,” says Lee Narae, one of the band’s lead singers. “However, we haven’t felt this popularity or experienced the hype as we’ve never performed outside of South Korea due to the global pandemic,” she adds. Because of local and international lockdowns restricting travel for almost the entirety of the band’s career, it’s not just their UK debut, it’s their first time performing outside of South Korea. “That makes this special,” Lee says. Despite their Korean lyrics, the multiple use of genres like rap, dance and bass and drum musicality makes them an international act, Lee suggests. “We believe the genre of Leenalchi’s music extends beyond K-pop. Our music started in Korea and the lyrics are written in Korean, but our identity and sound can only be fully articulated with musical instruments, just as other alternative bands.” It’s the sort of treatment that US and UK bands are often afforded when their music travels internationally, but is very much a new attitude to Korean music. That’s why cultural exchanges are so important, the band believes. The band’s biggest song is ‘Tiger is Coming’ even lends its name to the UK culture festival. “Seasons such as this are so important in sharing Korean culture with the world. Korea’s commitment to and investment in arts over recent years has meant that Korea is now being recognised and celebrated as a major hub for contemporary culture,” Lee says. Besides Leenalchi, Tiger is Coming will celebrate Korean artists from other mediums too. Choi Jeong Hwa brings a sculpture exhibition to the festival. ‘Tiger, Journey, Love’ deals with mass production, materialism and consumption culture. He uses ordinary day-to-day objects found in Korea to explore how art can be encountered in everyday life. There will also be dance films by Kim Modeun screened, as well as live dance from the Ambiguous Dance Company from 16-18 September. Theatre productions and live music shows are also part of the action packed schedule for the next month.   ",
    "title": "Leenalchi, the new K-pop band to hit the UK's shores | Euronews",
    "url": "https://www.euronews.com/culture/2022/09/13/leenalchi-the-new-k-pop-band-to-hit-the-uks-shores"
}