{
    "text": "Your employer is required to help educate you about investing. May 7, 2013&#151; -- There's a good chance you've occasionally received emails or other communications at work encouraging you to log on to a company website or attend a meeting hosted by HR people concerning your company 401(k) plan. And there's just as good a chance that you've ignored these communications. Despite this, if you're over the age of 40, you probably sometimes wonder whether you're doing enough to plan your retirement. If you don't wonder about it, you should. These two behaviors couldn't be more contradictory. If you're going to have a sufficient retirement nest egg, you have to make the right choices in the management of assets in your 401(k) plan. And to make the right choices, you need investment information and basic financial information to understand it. This is a two-way street: Your employer's obligation, under federal rules, is to provide this education. Your obligation to yourself — and your family — is to take advantage of it. If you work for a large company, it's a safe bet that your employer has a fairly robust 401(k) plan with a well-developed education program. Smaller companies don't tend to do as well as a rule, but some are fairly attentive to these matters. Regardless, education on plans and the investments in them is essential if you're to manage your plan account optimally. Large or small, your employer is nonetheless responsible for educating employees participating in their 401(k) plan about choosing and managing assets available under the plan so they can get the best outcomes. Companies may do this themselves, using HR people as educators, or outsource this function to professional advisors. Regardless of which route your company takes, it should have a written policy for plan education that spells out how information will be communicated — whether through group meetings, individual sessions with a plan advisor, written materials, dedicated plan websites, webinars or what-have-you. The policy should also spell out the information that these sessions or media should communicate, including: •\tCharacteristics of the investment options under the plan. Regarding mutual funds, this should involve the basics: what a mutual fund is, how it works, categories of companies (small-cap, mid-cap, large-cap, etc.), and the importance of reducing market risk by diversification of assets among companies of different sizes and in different industries. •\tTax advantages. The contributions you make to your 401(k) plan come out of your gross pay, so they lower your taxable income. You don't pay taxes on it until you take money out after retiring. •\tEmployer matching money. Many companies match employee contributions up to a given percentage and a given maximum. This is free money. The more you're contributing to your plan account for retirement, the more your company will contribute, within limits. •\tThe impact of fees on your net investment returns, which can make a huge difference in the long run. The federal government has recently adopted sweeping new regulations requiring employers sponsoring 401(k) plans to become aware of all fees affecting plan accounts, long a matter of benign neglect, oversight or unconcern. Employers are required to assure you receive fee disclosures and that fees are reasonable, which means eliminating investments with companies that charge too much. Your job as a consumer is to make sure this is being done. 24/7 coverage of breaking news and live events ",
    "title": "Lessons From a 401(k) Education - ABC News",
    "url": "https://abcnews.go.com/Business/lessons-401k-education/story?id=19126691"
}