{
    "text": "It is strange that the South China Morning Post would have so few articles on Chinese pop. After all, the Post is based in Hong Kong. There is also a lot to be mined in the treasure trove of Chinese pop. The Post’s many Chinese journalists are more than capable of translating trending Weibo “hot topics” for an English-speaking audience, as they do regularly with geopolitical topics with great accuracy. It would also help promote Chinese culture to non-Chinese audiences. With the increasing skill of Chinese film producers, animators and singer-songwriters, this trend will continue. The Post’s lifestyle section should reflect this, in addition to reporting on other Asian countries’ pop culture. Arlen Skazka, Melbourne An old friend told me that in Moscow, with its millions of people, I can quarrel with some people. Meanwhile, in my native town of Kyzyl in Siberia with very few inhabitants, he must be friendly with everyone. The Russian president’s message is clear. The United States might be successful in South Korea, Russia in Syria and Crimea, China in Tibet, and India in its skirmishes with Pakistan, but the four nuclear superpowers simply cannot be successful with one another. Mergen Mongush, Moscow There is no doubt Hong Kong’s public health system is under stress. The Voluntary Health Insurance Scheme introduced by the government is a step in the right direction, but will people with pre-existing conditions get any benefit from this? I have encountered few medical staff who treat patients and their family members with respect and care. In Hong Kong, not enough doctors work in the public health sector. All medical practitioners are bright and capable individuals, but some lack the ability and patience to deal with patients and stakeholders. Is it necessary that doctors should be the best students? Can we offer more students places? As for eHealth, the government should require all health records, whether public or private, to be centralised and that all citizens pay a small annual fee of HK$100 (US$13) or so to contribute to the system. So many resources are wasted because patients have to repeat the same tests when they access the public and private health systems. Sharing resources and avoiding duplication will allow for better efficiency, awareness and results. In summary, Hong Kong’s public health system needs a revamp to cater to the needs of residents. We talk about equality, but little has been achieved on this front. Our health system does not maximise output, resources – especially good doctors – are insufficient and the sector is not attracting the right talent. William Yuen, Sai Kung The carbon calculators developed by the WWF and CoolClimate Network both offer this feature. The WWF calculator compares the user’s carbon footprint with the British and world averages and encourages the user to reach a specific emissions reduction target. The Environment Bureau staff should emulate Ian Campbell, designer of a widely used carbon calculator, and tell users their carbon emissions based on questions such as the number of cars owned and whether the users are vegetarian. Yoyo Yu, Kowloon Tong ",
    "title": "Letter: Asian pop is more than just K-pop, Chinese pop culture is a treasure trove too | South China Morning Post",
    "datetime": "2021-12-16T00:30:15+08:00",
    "url": "https://www.scmp.com/comment/letters/article/3159793/asian-pop-more-just-k-pop-chinese-pop-culture-treasure-trove-too"
}