{
    "text": "LF's traditional casual brand Hazzys announced on Nov. 18 that it has recently opened a store in Ho Chi Minh City, Vietnam. The store is the brand’s second store in the city and fifth one in Vietnam. The company’s third store in the city is scheduled to open next month. The newly opened store is located at Takashiyama Department Store in the core business district of Ho Chi Minh City. It is a general store that can perfectly show the identity of Hazzys as a total brand. It will showcase Hazzys portfolio of products ranging from as clothing for men and women and golf wear to accessories. The story is 82 square meters in floor space and located in the premium clothing zone on the second floor of the department store. In mid-December, the 6th Hazzys store in Vietnam will be opened on the first floor of Landmark 81, the tallest building in Vietnam which is located in a new rich village of Ho Chi Minh City. The Landmark 81 area is considered a rising commercial zone with excellent potential to attract consumers as it is close to high-end apartments, hotels and luxury tourist facilities. Hazzys entered the Vietnamese market for the first time by opening a store at Lotte Department Store in Hanoi at the end of 2017. Until 2019, LF operated a total of four Hazzys stores in Hanoi and Ho Chi Minh City, strengthening its brand position. Hazzys' sales in the Vietnamese market grew about 50 percent on year as of the end of October 2020. Based on the huge domestic market with a population of nearly 100 million, Vietnam has recorded an average annual economic growth rate of more than 6 percent over the past 10 years. According to KOTRA, young people aged between 15 and 34 who account for about 34 percent of the total population are emerging as key consumers in the Vietnamese market. The Vietnamese market is turning into a more attractive market by an increase in the Vietnamese people, the elevation of their consumption level and the expansion of the middle class. Based on the successful settlement of its brand in Hanoi, the capital of Vietnam, and Ho Chi Minh City, an economic hub, Hazzys plans to accelerate its penetration into the Vietnamese market, where demand for high-end casual wear is on the sharp rise by building a total of 10 hub stores on Vietnam's major shopping mall distribution network by 2021. Meanwhile, Hazzys has been emerging as one of the leading cultural casual brands in the Asian fashion market since starting in China in 2007. At the moment, the fashion brand runs about 460 stores in China alone. It participated in the Shanghai Fashion Week in October. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "LF Hazzys Opens 5th Store in Vietnam, with 6th Store Due to Open in Dec. - Businesskorea",
    "datetime": "2020-11-20T15:15:04+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=55471"
}