{
    "text": " A controversy was stirred up over the quality of LG Electronics’s V30 launched on September 21. This happened less than a week after its release. Some consumers have argued that screen brightness and color are uneven. On September 25, there were a lot of complaints of consumers about the so-called 'Hanji (Korean paper)' phenomenon that some part of the LG V30’s screen appears relatively brighter in online communities such as Ppompoo, Clien, Naver Café and Mobile Café of LG Electronics. The 'Hanji (Korean paper)' phenomenon means that the display of a smartphone shows uneven brightness as if it were covered with Hanjin (Korean paper) and a little gradation. \"The lower left part is relatively bright and particularly noticeable on a dark picture of a game,\" a consumer said. \"I did not notice it in daytime. But at night I turned down brightness and turned on blue light and found that the lower left part was relatively bright and yellow,” another consumer said. \"There is a faint line. I think it's the Hanji phenomenon,\" the third consumer said. \"I am sensitive to displays and I am going to go to a service center for this issue.\" Apart from them, there were consumers’ messages such as “\"A shape that crosses the cell phone with a gray and white background stands out clearly\" and \"Color is not even as if it the display has some dirt on it.\" ”Today I tested my V30 and found that the Hanji phenomenon clearly occurred when the display is on low brightness and it is dark,” said a member of a Korean consumer community on the internet who attached a photo of his V30 display with uneven color. His message was followed with comments such as “Small OLEDs need more processing work” and “The Hanji phenomenon made me visit an LG Electronics service center. A repairman told me that he could nothing about the issue as his manual does not deal with the phenomenon.” The V30's 'Hanji phenomenon' was pointed out by foreign news services before its official launch. US IT professional media channel Ars Technica released a photo of the V30 taken on a dark background, saying, “In low brightness in a dark room, the screen is grainy and has \"dirty\" looking horizontal banding all over it.” The photo shows relatively brighter parts in the lower right and left parts of the V30. Experts say that this phenomenon of the V30 stemmed from a limit of organic light emitting diode (OLED) panels that were first loaded into the V30. LG Electronics applied OLED panels which had been used for TVs to the V30 for the first time among its flagship smartphones. For this reason, analysts at securities firms also expressed concern about the yield of mobile OLED panels to be installed in the V30. In reference to such customer complaints, LG Electronics said that it was not a product defect but a characteristic of OLEDs. \"The V30’s screen color may seem a little uneven due to the nature of OLEDs but it is not a product defect,\" an LG Electronics official said. “Consumers can feel this way as they are not used to OLEDs. There has been no complaint about the display yet.”  Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "LG V30 Users Complain about Uneven Color on Displays - Businesskorea",
    "datetime": "2017-09-27T01:00:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=19433"
}