{
    "text": "Absorbing tale of people deciding to freeze themselves until a better world arrives.    I’m Jim McKeown, welcome to Likely Stories, a weekly review of fiction, non-fiction, poetry, and biographies. Although not an avid fan of Don DeLillo, I have read a few of his novels without the urge to read all his works.  I have ranged from red hot, Underworld to luke-cold, Libra.  When I saw his latest novel, Zero K, the jacket prompted me to buy it.  I am glad I did.  While not as sweeping as Underworld, I found the premise and the prose most intriguing. Don DeLillo is an American novelist, playwright, and essayist.  Significantly, to me, his listed influences are Pynchon, Hemingway, Faulkner, Nabokov, Dostoyevsky, and last, but certainly not least, James Joyce.  This is powerhouse-central for my reading satisfaction.   I last read most of these authors before the beginning of “Likely Stories,” so I must dig some up for much needed second readings. Zero K tells the story of Ross Lockhart and his second wife, Artis, and his son Jeffrey from his first marriage to Madeline.  Ross has amassed a huge fortune, but Artis is dying of cancer.  He becomes involved as an investor in a program known as the “Convergence.”  This organization, hidden deep underground somewhere in central Asia, has developed a process for preserving a body in deep freeze -- hence “zero K” for zero degrees Kelvin, or absolute zero.  When Jeffrey learns of this plan he is, at first intrigued, but when he learns his father will join Artis even though he is not ill, he becomes horrified.  To make matters worse, Artis and Ross ask Jeffrey to “go with them,” even though he is perfectly healthy. DeLillo’s prose has an urgency to it, as he slowly unveils secrets about the organization.  Jeffrey has had some personal difficulties lately, and he is also looking for a “new world.”  Much of the novel involves discussions and speculation about death, time, re-birth, and immortality. Jeffrey, the narrator, wanders around the complex and attends lectures for family members of patients who about to die.  Few of these people have names, but Jeffrey wants to give each a name.  DeLillo writes, “Artis has spoken about being artificially herself.  Was this the character, the half fiction who would soon be transformed. Or reduced, or intensified, becoming pure self, suspended in ice?  I didn’t want to think about it.  I wanted to think about a name for the woman [speaker]. // She spoke, with pauses, about the nature of time.  What happens to the idea of continuum – past present, future – in the cryonic chamber?  Will you understand days, years and minutes?  Will this faculty diminish and die?  How human are you without your sense of time?  More human than ever?  Or do you become fetal, an unborn thing? // She looked at Miklos Szabo, the Old World professor, and I imagined him in a three-piece suit, someone from the 1930s, a renowned philosopher having an illicit romance with a woman named Magda. // ‘Time is too difficult,’ he said” (67-68). With a number of states allowing a patient to make the decision to end his or her life, this topic has been on my mind whenever I see a friend or family member kept alive with machines.  Don DiLillo’s latest novel, Zero K, is an excellent story to spark a discussion about the end of life.  5 stars. Likely Stories is a production of KWBU.  Join me again next time for Likely Stories, and happy reading! ",
    "title": "Likely Stories: Zero K by Don DeLillo",
    "datetime": "2016-09-08T12:50:00",
    "url": "https://www.kwbu.org/art-and-culture/2016-09-08/likely-stories-zero-k-by-don-delillo"
}