{
    "text": "Songs don’t get much more offensive than Lil Dicky’s “Korea,” which made its debut on the rapper’s FXX sitcom Dave on June 16. The song’s music video shows him defecating in the middle of downtown Seoul and dancing cheesily with a group of women who spin Korean flag umbrellas, as a vaguely Asian flute whistles in the background. But the scene’s tastelessness is intentional. In Dave, the comedian and rapper born Dave Burd plays an exaggeratedly clueless version of himself as a way to make sharp observations about the absurdities embedded in pop culture, race and millennial relationships. In the show’s latest episode, Burd’s character sets his sights on conquering the K-pop industry. Along the way, he exemplifies the craven attitude that some American superstars and labels have taken in scrambling to grab a piece of a rapidly growing market share. “Every single song that comes out of this country gets like 5 million, billion views in a day,” Dave explains to his perturbed intern Dan. He’s determined to capitalize on the popularity of K-pop. “It’s the best idea I’ve ever had—it’s a cheat code.” Burd’s character epitomizes the exact way not to approach K-pop. Yet the episode—written by Lee Sung Jin and featuring an extensive cameo from the K-pop megastar CL—is actually the product of a meticulous cross-cultural collaboration emphasizing sensitivity and attention to detail. “He was very aware—he did his homework and studied everything,” CL says of Burd’s approach to getting K-pop culture right. “I think this episode is putting a stamp to Western culture that K-pop existed when we look back.” Over the past few years, K-pop’s global success has reached the point that Western superstars— from Halsey to Lady Gaga to Diplo— have crossed over in the other direction to appear on K-pop songs. Burd hoped to make fun of this trend by creating a K-pop knockoff song that blatantly treated the genre as a marketing strategy as opposed to an autonomous culture. (“I got kimchi, I got it all… Kimbap that ass on the wall,” goes one of his inane lyrics on “Korea.”) To do so, Burd tapped Lee, a Dave writer and co-executive producer, to build an episode out of the concept. Lee spent his childhood in Korea and is a self-professed huge K-pop fan; he remembers growing up on artists such as Seo Taiji and the Boys, H.O.T. and Fin.K.L. While Lee drew on his own wealth of cultural knowledge, he also conducted research by interviewing several K-pop artists and executives, who highlighted two key trends with regards to working with Western artists: “We found there were a lot of people either leeching off K-pop’s momentum or finding ways to hate on it,” Lee says. Burd and Lee then laid out an episode that would explore both sides, with the song “Korea” exemplifying the first part—the leeching. The second part of this dynamic is revealed midway through the episode, as Dave and his team jump to conclusions about “the dark side of K-pop” and the ways in which K-pop artists like CL, who plays herself, might be controlled by their managers or even the mob. It’s a canny parody of how Western media has focused on these concerns amid claims that K-pop stars are forbidden to date, have grueling training schedules, and face exacting pressure from their labels and rabid fans alike. Over the past few years, several K-pop idols, including Sulli, Goo Hara and Jonghyun, have committed suicide. Yet these topics are thorny not just for their subject matter, but also because K-pop fans on social media are fiercely loyal; they’ve been known to use their collective power to shout down media they feel portrays K-pop in an unfair light. Some Western outlets now avoid these topics altogether for fear of incurring the ire of fandoms so organized, they famously derailed a Trump rally in 2020. Ultimately, the Dave team decided it was important to talk about both sides of the K-pop phenomenon. “You don’t want to ignore subjects out of fear, because how will we ever actually examine them together?” Lee says. “There’s always danger in this Twitter age that things will be taken out of context. We had a constant discussion of what our intention is and how to walk that line. Ultimately, it is a love letter to K-pop.” “If you want to address something that is rarely addressed, you need to take the risk,” CL says. “I would like to tell my fans and whoever’s watching it to look at it with more layers.” Lee wasn’t involved in Dave’s first season, and at first, he says he was skeptical of the show based on its billboards, in which Burd appeared as a phallic symbol. But last year, Lee got a text from the actor Steven Yeun, who stars in Lee’s upcoming Netflix series Beef. “He said, ‘You have to watch—it’s my favorite sitcom out,’” Lee recalls. “I finished it in a couple days, and my mind was blown. Every step of the way bent my expectations.” Lee says he’s had a similarly positive experience in the writers room, especially compared to his experiences over the last decade: he says Hollywood has had a knack for disempowering young writers of color, and using them as shields for criticism even if their ideas are discarded by the final draft. “There’s always the worry you’re gonna write something and it’s gonna turn into something else somewhere in the pipeline,” he says. But Dave, he says, had the most number of Asian writers out of any writers room he’s ever worked in, which led to different kinds of discussions and characters—and Burd gave him creative power every step of the way. “From writing to shooting to editing, he’s made me feel super involved in every microdecision,” Lee says. “That makes you feel like it’s also your show, which makes a huge difference.” CL says she was more than happy to fly from Korea to Los Angeles—which, ironically, subbed in for Seoul due to COVID protocols—to be a part of the episode. (It also probably didn’t hurt that CL and Dave share a professional link: CL is backed by management from Scooter Braun’s SB Projects, who serves as an executive producer on Dave). “It’s one of my biggest passions to represent K-pop, and I’m a big fan of his show,” she says. “It was definitely worth the two-week quarantine.” Contact us at letters@time.com. ",
    "title": "Lil Dicky Delivers a Hilarious K-Pop Episode of 'Dave' | Time",
    "datetime": "2021-06-17T13:15:07.000Z",
    "url": "https://time.com/6073900/dave-k-pop-season-2-episode/"
}