{
    "text": "Athens, Ga. – Dr. Lisa K. Nolan, a veteran educator, administrator and scholar of diseases that affect animal and human health, has been named dean of the University of Georgia College of Veterinary Medicine. Nolan is currently professor and Dr. Stephen G. Juelsgaard Dean of the Iowa State University College of Veterinary Medicine, and her appointment at UGA is effective July 1. “Dr. Nolan is one of the nation’s most respected veterinary educators and administrators, and I’m delighted that she has joined the University of Georgia’s leadership team,” said Senior Vice President for Academic Affairs and Provost Pamela Whitten. “She comes to our College of Veterinary Medicine at a time of growth in the scope and impact of its instruction, research and service, and I am confident that the best is yet to come under her leadership.” Nolan has led the College of Veterinary Medicine at Iowa State University since 2011. She co-chaired a campus-wide “One Health-One Medicine” initiative that brought faculty members from across campus together to foster new collaborations that span animal, human and ecosystem health. The initiative has resulted in several faculty hires across campus and a significant enhancement of Iowa State’s research capacity. To improve student learning outcomes, she oversaw a comprehensive curricular review, enhanced the assessment of teaching, and upgraded teaching labs and study spaces. The college met or exceeded all of its fundraising goals under her leadership, and it is now in the public phase of an ambitious campaign to increase scholarship support, enhance facilities and create additional endowed faculty chairs. “Dr. Nolan has built an extraordinary career as a researcher, professor and administrator,” said President Jere W. Morehead. “We are fortunate to have such an outstanding alumna of the University of Georgia return to campus to lead the College of Veterinary Medicine to new heights of excellence.” Prior to becoming dean of the Iowa State University College of Veterinary Medicine, Nolan was founding director of the Great Plains Institute of Food Safety at North Dakota State University and chair of the department of veterinary microbiology and preventive medicine at Iowa State. Her additional administrative experience includes service as associate dean of academic and student affairs, and associate dean of research and graduate studies. Her research focuses on bacterial diseases that impact animal health, human health and food safety. She is the author or co-author of nearly 130 peer-reviewed publications and book chapters, and her research has been funded by the U.S. Department of Agriculture, National Institutes of Health and National Science Foundation, as well as private foundations. Her patents include a vaccine and a biomarker to assess avian E. coli virulence. Nolan has received several honors over the course of her career, including being named a Fellow of the American Academy of Microbiology and an honorary diplomate of the American Veterinary Epidemiology Society. She has received the Distinguished Educator Award from the Blue Key National Honor Society, the Philbro Animal Health Excellence in Poultry Research Award and the Academic Alumnus of the Year Award from the UGA College of Veterinary Medicine, among other honors. Nolan earned her doctor of veterinary medicine degree from UGA and also earned her master’s degree and Ph.D. in medical microbiology from UGA. She earned her bachelor’s degree in biology from Valdosta State College, now Valdosta State University. “As a proud alumna, it has been thrilling to follow the College of Veterinary Medicine’s impressive growth and continuing excellence,” Nolan said. “I am honored to be able to partner with the college’s faculty, staff, students and alumni to further enhance the college’s impact on animal and human health.” UGA College of Veterinary MedicineThe UGA College of Veterinary Medicine, founded in 1946, is dedicated to training future veterinarians, to conducting research related to animal and human diseases, and to providing veterinary services for animals and their owners. Research efforts are aimed at enhancing the quality of life for animals and people, improving the productivity of poultry and livestock, and preserving a healthy interface between wildlife and people in the environment they share. The college enrolls 114 students each fall out of more than 1,100 who apply. For more information, see www.vet.uga.edu.   Whether it's your first day or your last first day, we are so excited to welcome you to another spectacular year at the University of Georgia - Go Dawgs! pic.twitter.com/p7nHE7jZfh ",
    "title": "Lisa K. Nolan named dean of UGA College of Veterinary Medicine - UGA Today",
    "datetime": "2017-02-22T02:45:21+00:00",
    "url": "https://news.uga.edu/lisa-nolan-named-veterinary-medicine-dean/"
}