{
    "text": "HOT TOPICS Korean-language test to be held up to 8 times abroad in 2024 Korean Red Cross builds temp homes for Turkish quake victims Food Clothing and Fashion Traditional Decorative Knots, Maedeup: Donated Works by Lee Bu-ja Jinju Namgang Yudeung Festival Culture Dec 27, 2022 The 33 Korean Cultural Centers (KCCs) in 28 countries this year have promoted Korean culture and spread a message of comfort and recovery from the COVID-19 pandemic through many events. With the gradual decline of the coronavirus, the hosting of more in-person events allowed direct interactions with people in the KCCs' host countries. This article is on five such events. The Korean Cultural Center (KCC) in France on May 17 held a conference on Korean Buddhist temple food at Le Cordon Bleu, the world-famous culinary school, in Paris as part of the event \"Taste Korea.\" Venerable Hong Seung, an expert in such cuisine, is shown taking a commemorative photo with participants. (KCC in Paris)  By Yoo Yeon Gyeong Throng of 50,000 people gather at K-pop Festival in Hanoi, Vietnam  The Korean Cultural Center (KCC) and Korean Embassy in Hanoi, Vietnam, on May 14 held this year's K-Pop Festival on the sidewalks next to Hoan Kiem Lake to mark the 30th anniversary of bilateral ties. About 50,000 Hanoians and foreign tourists attended the event, which included hit interactive programs like traditional games such as tuho (arrow throwing), jegichagi (kicking a shuttlecock) and tug of war, random K-pop dance on the street and photo zones. (KCC in Hanoi)   Korean Buddhist temple food attracts major attention at Paris' top gastronomical event  The KCC in France from May 12 to Sept. 16 jointly hosted \"Taste Korea,\" a Korean tourism and culture festival, with the Paris branch of the Korea Tourism Organization and the Jogye Order of Korean Buddhism to promote Korean food at \"Taste Paris,\" the top gastronomical event in the French capital. About 61,500 visited the KCC during the Taste Korea period, the most since the center's opening in 1980.  News of the event spread through word of mouth and was covered by about 130 French media outlets such as the daily Le Monde, broadcaster BFM TV and public radio station France Bleu. (KCC in France)   Kimchi program on Spain's top network attracts highest ratings of 14.3% in time slot   The KCC in Spain, in cooperation with La 1, a channel run by Spain's top public broadcaster RTVE, on May 30 aired the seventh episode of Season 10 of the hugely popular entertainment program \"Master Chef Espana.\" This program covered kimchi and a related cooking contest, with the hosts, star chefs Jordi Cruz and Pepe Rodriguez, mentioning \"kimchi,\" \"Korean food,\" \"Korean cabbage\" and \"jeotgal (fermented seafood)\" in Spanish dozens of times. The episode attracted the highest ratings in its time slot of 14.3%. (KCC in Spain)  Royal ancestral ritual music enchants at European classical music hub in Germany   The KCC in Berlin from Sept. 12-26 held a performance of the royal ancestral ritual music Jongmyo Jeryeak jointly with the National Gugak Center and Korean Embassy in Germany in four German cities -- Berlin, Hamburg, Munich and Cologne -- to commemorate the 50th anniversary of a bilateral cultural agreement.  The performance at the Berlin Philharmonic Orchestra's Grand Hall attracted 5,400 spectators including Petra Sigmund, director general for East Asia, Southeast Asia and the Pacific at Germany's Federal Foreign Office; Ingo Mix, head of the German Federal Government Commissioner for Culture and the Media; city councilors of Berlin; delegates from Japan; and Germany-based ambassadors. About 1,700 people stayed in their seats to give a 10-minute round of applause.  The KCC and the Berlin Music Festival prepared for the event for 3 1/2 years. German conductor Jurgen Bruns, who watched the concert at the hall, hailed the concert as \"unfamiliar but impressive.\" Thirty-two German media outlets including the public broadcaster BR TV and daily Frankfurter Allgemeine Zeitung covered the performance. (National Gugak Center)  Traditional farmers' percussion music rings through festival in Budapest, Hungary   Korea was the guest country of honor at this year's Festival of Folk Arts in Hungary, which attracts over 70,000 visitors from Europe. The KCC in Budapest from Aug. 19-21 showcased traditional Korean performing arts like gugak (traditional music) including samulnori (percussion music played with four instruments), Korean food and Hanbok (traditional costumes) next to Buda Castle and Matthias Church. The event attracted a long line of visitors to the Korean Booth despite summer heat that exceeded 37 degrees Celsius; the booth was named the event's most popular by the festival's organizing committee. (KCC in Hungary) Gov't signs first joint statement with S. Arabia in 43 years ",
    "title": "Looking back on 2022 via events hosted by Korean Cultural Centers abroad : Korea.net : The official website of the Republic of Korea",
    "url": "https://www.korea.net/NewsFocus/Culture/view?articleId=226611"
}