{
    "text": " The Lotte Group completed the vertical integration of its petrochemical business by striking a big deal to buy all of Samsung’s chemical affiliates on Oct. 30. The Lotte Group signed a deal to acquire the Chemical Business Division of Samsung SDI and Samsung Fine Chemicals. The mega-deal amounts to 3 trillion won (US$2.6 billion) and will go down in the history of Lotte as the largest M&A deal the company has ever orchestrated. The mega-deal between Lotte and Samsung is expected to give Lotte Chemicals the completion of the vertical integration of its petrochemical business and a golden opportunity to jump into a general chemical company. It is expected that Lotte will be able to expand its high-value-added product lineup through vertical integration, since the company has strengths in the material business that supplies materials to the synthetic resin industry. The Chemical Business Division of Samsung SDI ranks second at home and sixth in the world in terms of production capacity in the high-value-added ABS sector linked to production of materials for home appliances and electronic products, automotive interiors and exteriors . An increase in demand for ABS in China, which consumes 54 percent of global ABS production, is expected to maintain the steady growth of the ABS business. Besides, at home, the company rules in such sectors as polycarbonate (PC) used as high-impact and high-strength exterior and interior products and artificial marble. Samsung Fine Chemicals is a tech leader in chlorine-based and cellulose-based chemical products widely used in architectural, textile and medical sectors. Samsung BP Chemicals, a jointly invested company by Samsung and the U.K.’s BP, is enjoying a dominant share in the domestic acetate market. Lotte Chemical posted 14.9 trillion won (US$13.1 billion) in consolidated sales last year. Adding the acquired companies’ sales of 4.3 trillion won (US$3.8 billion), Lotte’s sales in the chemical sector are expected to hit 20 trillion won (US$17.6 billion) and generate synergies. On the other hand, Samsung SDI is expected to put all of its energies into the electric car battery business expected to grow rapidly with funds from selling off the Chemical Business Division of Samsung SDI and Samsung Fine Chemicals. This big deal, following a similar deal with the Hanwha Group in November of last year, completes Samsung’s withdrawal from the petrochemical business. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Lotte Completes Mega Chemical Deal with Samsung - Businesskorea",
    "datetime": "2015-11-02T04:00:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=12710"
}