{
    "text": "Lotte Shopping will sell off 21 Lotte Mart discount and supermarket stores in Beijing to local distributor Wumei. Lotte Shopping is also accelerating the withdrawal of its operations in other Chinese cities. Talks are underway with local distributors to dispose of Lotte Mart stores in Shanghai, Chongqing and Shenyang among others. On April 26, Lotte Shopping decided in an extraordinary board meeting to sell its Hebei corporation, which operate the 21 Lotte Mart stores in Beijing, to the local distributor Wumei Group. The includes 10 discount stores and 11 supermarkets in Beijing and the total price is about 248.5 billion won. \"We will maintain a 5% stake in the Hebei corpooration to maintain a strategic partnership with Wumei and ensure a smooth transfer of the stores,\" said an official of Lotte Shopping. According to industry sources, Lotte Shopping is reportedly in talks with China’s Liqun Group to sell 74 large discount stores under its Huadong corporation. The company is also holding negotiations with local retailers to sell off its Huazhong and Dongbei corporations. Lotte Shopping has set up four corporations in China -- Hebei, Huadong, Huazhong and Dongbei -- to operate a total of 110 discount stores and supermarkets. Lotte Shopping has also decided to execute a capital increase of 681.9 billion won to facilitate the sell-off of its stores and repay short-term borrowings. Lotte Mart is withdrawing from China after 11 years of operation in China. In 2007, Lotte Mart entered the Chinese market by acquiring eight Macro stores from a Dutch-based distributor. However, in February of last year, the Chinese government suspended 87 Lotte Mart stores in China following the Lotte Group's decision to allow the Korean government to set up the THAAD missile defense system at its golf course in Sueongju, North Gyeongsang Province. Last year, Lotte Mart's sales in China decreased 76.9% to 263 billion won from the previous year and its operating loss doubled to 268 billion won. If sales loss and wages for employees are calculated, Lotte Mart’s cumulative loss will top one trillion won in this period. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Lotte Shopping to Sell Off 21 Lotte Mart Stores in Beijing - Businesskorea",
    "datetime": "2018-04-27T10:16:48+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=21921"
}