{
    "text": "Lotte Mart announced on Nov. 6 that it opened the Food Innovation Lab in Indonesia in October this year to develop home meal kits, including Korean meals, for local consumers. The lab is modeled after the Food Innovation Center in Korea, which is led by chef Kang Leo. It is designed to drive a K-food craze in Indonesia, especially among Millennials and the generation Z who account for 40 percent of the country's population and lead consumption trends. Recently, as Korean cultural content gains great popularity among young consumers in Indonesia, the popularity of K-foods such as \"tteokbokki\" (simmered rice cake) and seasoned chicken is also growing explosively. Lotte Mart's Gandaria store in Jakarta, which is the company's representative store in Indonesia, started offering 20 kinds of Korean foods in July. Local interest in Korean foods is so high that from July to the end of October, sales in the entire home meal replacement (HMR) category at the Gandaria store grew by 70 percent compared to the previous year. The reason for its popularity is the spicy taste of Korean foods. Lotte Mart’s marketing strategy worked nicely in an Indonesian food culture in which people enjoy spicy and flavorful food. In the case of Tteokbokki which appear most frequently on Korean entertainment programs and shows, prepared volume was sold out before lunchtime, so people stood in a long line to buy Tteokbokki beginning from the morning. Paying attention to the fact that Indonesian consumers are enthusiastic about the spicy taste of Korean foods, the Gandaria store also introduced Spicy Fish Cake Gimbap with spicy fish cake in addition to Bulgogi Gimbap and Vegetable Gimbap. In addition, Yangyop Chicken (seasoned chicken with a sweet and spicy taste) is more popular than original fried chicken. Thus, the store will launch Dakgangjeong Chicken (sweet sour chicken) following Yangyop Chicken this December. Potato bread and Korean-style streusel bread with cream which became a hot topic on Korean social media are also gaining popularity as Korean desserts in Indonesia. Lotte Mart, which made a foray into Vietnam and Indonesia in 2008 is currently running a total of 64 overseas stores, 15 in Vietnam and 49 in Indonesia. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Lotte Mart Opens Food Innovation Lab in Indonesia - Businesskorea",
    "datetime": "2022-11-07T14:29:10+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=103555"
}