{
    "text": "To revisit this article, select My Account, then View saved stories To revisit this article, visit My Profile, then View saved stories By Andrew Marantz More than most comedians, Louis C.K. resists the impulse to please. He has acquired a lot of new fans in the past few years, but it’s hard to imagine that “Tomorrow Night”—an avant-garde black-and-white film C.K. wrote and directed in 1997 and distributed last week—is what they want from him. In interviews publicizing its release, he called it “a relic,” “pretty weird,” and “hard to watch.” He told David Letterman, “It’s not for everybody. That would be the tag line: ‘It’s not for everybody.’ ” The film offers a few pleasures: Steve Carell’s trying-to-suppress-a-laugh face, which is the best in the business; J. B. Smoove’s charisma and Wanda Sykes’s disdain, both of which would later become integral to “Curb Your Enthusiasm”; Rick Shapiro wearing terrible drag; a cartoonish seductress named Lola Vagina. (C.K. has always gotten a lot of mileage out of the word “vagina.”) But, on the whole, it is ponderous, rarely funny, and, indeed, hard to watch. This seems to be part of the point. Louis C.K. grew up in Newton, an affluent suburb of Boston. His father was a Harvard-trained economist. As a teen-ager, C.K. worked at a photo-developing store and a public-access TV station, where he learned the technical process of filmmaking. His admissions interview with N.Y.U.’s film school seemed to go well; but, in a fit of Joycean paralysis, he left the application blank. “I couldn’t fill out the thing,” C.K. later told the writer Jonah Weiner. “It made me want to vomit.” Instead, he took a series of gruelling jobs—as an auto mechanic, a cook at a KFC, and, eventually, a standup comic, which offered less job security but also, as it turned out, more opportunities for career advancement. It is difficult to bend C.K.’s biography into a stay-in-school parable; he has done quite well without an advanced degree. But his life choices left him with a chip on his shoulder. In his recent HBO special, C.K. said, “A fifty-five-year-old garbage man is a million times smarter than a twenty-eight-year-old with three Ph.D.s. Especially smarter than him, because this idiot has been thinking about three things for, like, fifteen years.” This is C.K.’s rebuke of his father, with whom he has a troubled relationship. It is also self-justification: I may not have studied Hegel and Uta Hagen, C.K. is saying, but I have slept in musty motels in fifty states, and I have crashed a motorcycle, and I once found a computer on the street and reassembled it by hand, and that makes me a more interesting artist. And this is C.K.’s motivating anxiety—the most conventional of anxieties, but no less powerful for being a cliché: his desire to be recognized, despite a thin C.V., as an artist. This is the common plight of the comedian with ambitions beyond comedy. It took Woody Allen decades to be perceived as a director rather than as the guy who did the bit about the moose. In Tad Friend’s Profile of Ben Stiller, Robert Downey, Jr., says, “Everyone associates Ben with clowning, when he actually has the ability to control tone and story and look to achieve something masterful.” C.K., tired of being associated solely with comedy, is eager to show that he can also make jarring art-house films, whether or not those films are “masterful.” “Louie,” C.K.’s experimental sitcom, will finally return to FX in May. His decision to release his juvenilia now, of all times, could be interpreted as a warning that the fourth season is going to be the strangest one yet. Or perhaps it is simply the latest push in C.K.’s campaign to be perceived as an auteur. “Tomorrow Night” might be bad art, but it would be difficult to deny that it is art. Photograph: Norman Ng/NBC/NBCU Photo Bank/Getty Images By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. By Vinson Cunningham By Richard Brody By Inkoo Kang By Richard Brody Sections More © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. The New Yorker may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "title": "Louis C.K.’s Motivating Anxiety | The New Yorker",
    "datetime": "2014-02-07T14:29:25.000Z",
    "url": "https://www.newyorker.com/culture/culture-desk/louis-c-k-s-motivating-anxiety"
}