{
    "text": " LS Cable & System Asia publicly announced that it submitted the securities registration statement to South Korea's Financial Supervisory Commission (FSC) on August 11 and it will go public on the nation’s main bourse, the Korea Composite Stock Price index (KOSPI) on September 22. LS C&S Asia is a holding company that LS Cable & System set up in Korea in May last year in order to list its two Vietnam-based locally incorporated operations - LS-VINA and LSCV, which hold a combined share of the highest 30 percent share in Vietnam’s cable market, on the Korean stock market. The company may list its shares on the Seoul bourse at between 10,000 won and 11,500 won (US$9.08 to 10.45), totaling 12,650,140 shares of public offering. It will forecast demand on September 5 to 6 and make public offering on the 8th to 9th. This will be the first case of an overseas subsidiary of a domestic firm making an IPO in the Korean stock market by using the special-purpose company (SPC) system. LS C&S established LS-VINA in Hai Phong City in the northern part of Viet Nam in 1996, manufacturing power cables and rapidly growing with the Vietnam’s economic growth. The company also founded LSCV in Ho Chi Minh City in southern Vietnam in 2006, beginning the production of communication cables. Their combined sales revenues in Vietnam increased by as much as 270 times in 20 years to 490 billion won (US$445.05 million) in 2015 from only 1.9 billion won (US$1.73 million) in the first year of operation in 1996. In particular, their net profits in the first half of 2016 grew 37.6 percent year on year to 8.6 billion won (US$7.81 million), maintaining the high growth rates. Myung Roh-hyun, CEO of LS C&S Asia, said, \"As Vietnam has 60 percent lower minimum wages than China and has signed the Trans-Pacific Partnership (TPP), the country is emerging as the manufacturing center in the world. Accordingly, the investments in power and communication infrastructure are expected to rise, along with the rapid economic growth. Moreover, LS C&S Asia is expected to benefit from the growth in neighboring ASEAN countries as the largest cable export company in Vietnam.” Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "LS C&S Asia to Jumpg Up to be Biggest ASEAN Cable Company - Businesskorea",
    "datetime": "2016-08-12T02:15:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=15541"
}