{
    "text": "YouTube's Global head of music also side-stepped a question about being photographed with Kanye West and a MAGA cap on \"The Breakfast Club.\" By \n\n\tA.D. Amorosi For a guy who has genuinely been at the forefront of the hip-hop business since the early 1980s, Lyor Cohen – a major league manager at Rush Productions, a boss at Def Jam,  the man behind 300 Entertainment and YouTube’s current Global Head of Music – isn’t known for being all that chatty, which is what made Cohen’s candid, history-spanning, 70-minute appearance on morning radio show “The Breakfast Club” on Wednesday (August 1) unique. Cohen gave Breakfast Club co-hosts DJ Envy, Angela Yee and Charlamagne Tha God the goods on everything from his pre-industry employment (“I worked for the National Bank of Israel”), to Drake’s rumored signing to Def Jam before his Cash Money deal (“The truth is Drake shook my hand”), to going against the grain of Jewish record executives who encouraged him not to do business with Public Enemy (Cohen took Chuck D to the Holocaust Museum out of spite), to winding up in a selfie with Universal Music Group chairman Lucian Grainge and a Trump-loving Kanye West wearing a “Make America Great Again” cap. “I didn’t see the hat… I was fully immersed in the experience [and] honored to be there,” he said of the photo opp at West’s Calabasas home.  Cohen recalled his early days entertainment job when he got to New York City was bringing Run-DMC on the road, and coming up with the phrase “Who’s house? Run’s house!” on the “Tougher Than Leather” album. He also spilled a dab of tea on several of the artists he’s known and worked with in his time, including Rich The Kid wanting to leave 300 Entertainment, and the troubled DMX (surprisingly, the no-nonsense Cohen will sign artists with drug or crime problems because he’ll take “talent over issues” any day). When Charlamagne brought up Dame Dash’s recent claims that it was Cohen who busted up Roc-A-Fella Records, Cohen told the host to ask Jay-Z and Dash about that issue. “Who’s Dame Dash? I don’t even know him,” said Cohen. Charlamagne clapped back testily, “Y’all made a lot of money together,” and threw out the notion that Cohen built his career by being a “culture vulture.” Cohen sidestepped the criticism. Then there’s the aforementioned Drake deal that still seems to deeply disappoint Cohen. “It doesn’t matter. He didn’t stop the party. I’m happy for him, and I’m happy for his fans. It’s all good. It didn’t hurt my feelings, but I’m old school. I come from a different thing.” Those old school business dealings and notions of loyalty and values were much on Cohen’s mind considering how he handles his business, in the past and in the present. There is the currency of signing new artists for big bucks based on internet memes and Instagram hits rather than time in or song craft. Cohen called that “day-trading” and would prefer to see labels returning to the old days of artist development. There is a focus, on Cohen’s part, of artists getting in on  the “You Tube hustle…. creating your own channel,  figuring out that algorithm.” Then there is the competition of throwing around million dollar deals just to land the next hot name.  “I never signed an act because I was afraid of losing them. I only signed an act because I wanted them on my label. Different mentality these days. I never signed an act because … ‘another label is interested in me,’ I say ‘Go ahead with yourself. I’m not interested in you anymore.” Modestly, he stated, “I’ve touched more rap music than everybody combined.” Cohen focused too on the question of “what is a label in the 21st Century,” and, for artists preparing to sign their name to a deal, “to do so with their eyes wide open. Labels want to sign smart.” As for executives poised for success in what Cohen calls the coming “golden age of the music business,” he predicts Quality Control‘s Kevin “Coach K” Lee and Pierre “Pee” Thomas will “make fortunes” and be the impresarios of tomorrow. Watch the full interview below.  A Variety and iHeartRadio Podcast The Business of Entertainment ",
    "title": "Lyor Cohen Says He Almost Signed Drake, Skirts Culture Vulture Claims",
    "datetime": "2018-08-02T13:00:13+00:00",
    "url": "https://variety.com/2018/music/news/lyor-cohen-breakfast-club-interview-drake-kanye-maga-hat-1202893145/"
}