{
    "text": "  Kolon Group's new art museum named Space K Seoul in Magok of western Seoul. [SPACE K SEOUL] Korean artist Do Ho Suh’s installation work ’High School Uni-Form“ juxtaposed with Chinese artist Zhang Xiaogang’s painting ’Amnesia and Memory No.16“ as part of Space K Seoul’s inaugural exhibition ’Distorted Portrait.“ [MOON SO-YOUNG] Korean artist Meekyoung Shin’s soap sculpture ’Written in Soap: A Plinth Project“ as part of Space K Seoul’s inaugural exhibition ’Distorted Portrait.“  [MOON SO-YOUNG] The view of Space K Seoul’s inaugural exhibition ’Distorted Portrait“ with German artist Andre Butzer’s painting ’Untitled(Wanderer),“ left, and Pakistani American artist Huma Bhabha’s sculpture ’One Thousand,“ right. [MOON SO-YOUNG] Korean moon jar shatters auction house record, selling for $2.5M Arts Korea Lab Picasso in 'Oppenheimer'? The link between cubism and quantum mechanics. Korea Artist Prize is back with updates and four new finalists Korean culture spreads its roots at the Parisian Art Basel fair Busan attracts world-renowned artists thanks to galleries, fairs and Lee Ufan SeMA prepares for renovation project, two new branches BTS member RM donates ₩100 million to National Museum of Modern and Contemporary Art Buk-SeMA celebrates 10 years with future-forward exhibition Richter turns a critical eye on contemporary culture in 'My Lunatic Neighbar' To write comments, please log in to one of the accounts. Standards Board Policy  (0/250자) Korea JoongAng Daily Sitemap All materials contained on this site are protected by Korean copyright law and may not be reproduced, distributed, transmitted,                    displayed, published or broadcast without the prior consent of Joins.com | Tel: 1577-0510 JoongAng Daily Co., Ltd. | Address: 48-6 Sangamsan-ro, Mapo-gu, Seoul, Republic of Korea Business registration number: 160-86-00572 | CEO: Park Chang-hee, Cheong Chul-gun Mail order business report number: 2020-Seoul Mapo-3838 ",
    "title": "Magok's Space K Seoul transforms area into arts and culture hot spot ",
    "datetime": "2020-09-28T19:28:46+0900",
    "url": "https://koreajoongangdaily.joins.com/2020/09/28/culture/artsDesign/new-museum-art-museum-Space-K-Seoul/20200928192900501.html"
}