{
    "text": " It has been found that the five largest hospitals in South Korea – Samsung Seoul, Seoul National University, Seoul Asan, Seoul St. Mary's, and Severance – are lukewarm about IBM’s medical AI solutions such as Watson for Oncology and Watson for Genomics. Instead, they are using their own solutions or working with each other. For example, Samsung Seoul Hospital signed a memorandum of understanding with Microsoft Korea in October last year to set up a new and better precision medicine system. According to the MOU, the hospital leads deep learning system development while Microsoft Korea provides AI algorithms and cloud infrastructure. “The data Watson has collected in the United States do not perfectly match with South Korean patients’ needs and conditions and its misdiagnosis rate is pretty high with the exception of basic cancer diagnosis,” said an expert, adding, “There is a tacit consensus that Watson is very expensive yet not that effective.” The effectiveness of Watson is being doubted even in the United States. Specifically, the University of Texas MD Anderson Cancer Center, which used Watson from 2012, ended its cooperation with IBM last year. This is because many of the workers at the cancer center were skeptical about the usefulness of Watson, for which their company paid no less than 70 billion won (US$63 million). “AI algorithms are open to everyone and can be used by anyone, which means the real competitive edge hinges on precise data reflecting local situations,” an industry expert explained. In the meantime, the National IT Industry Promotion Agency is planning to invest 28 billion won (US$25 million) in medical big data-based AI solution development for three years so that software serving medical staff by analyzing big data can be developed. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Major Hospitals in S. Korea Not Very Interested in Watson - Businesskorea",
    "datetime": "2018-03-28T02:15:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=21308"
}