{
    "text": " Profile Sections tv Featured More From NBC Follow NBC News A man arrested in the killing of a Baltimore tech entrepreneur was suspected of raping a woman days before and was already under surveillance, police say September 28, 2023, 12:24 PM Michael Gambon, the actor best known for playing Dumbledore in the 'Harry Potter' films, dies at 82 September 28, 2023, 8:02 AM Morning Rundown: Biden impeachment inquiry's first hearing, Powerball jackpot nears $1 billion, and Kansas City's love story with Taylor Swift September 28, 2023, 7:36 AM U.S. soldier Travis King arrives back on American soil after being expelled from North Korea September 28, 2023, 4:04 AM Remains found in Colorado are identified as Suzanne Morphew, a mom who disappeared in 2020 September 27, 2023, 5:54 PM The mother of a man suspected of killing a Baltimore tech CEO urged him to surrender, fearing police would try to kill him September 27, 2023, 2:37 PM Born and raised in Seoul, Bora Kim was interested in researching the global commercial success of K-pop, short for \"Korean pop,\" a music genre made popular in South Korea since the early 1990s that incorporates singing with highly choreographed dance moves. But after moving to New York to attend graduate school at Columbia University, she began to wonder what might happen if the members of a K-pop band were replaced with ones who were not Korean. That thought formed the genesis of the five-member boy band EXP, short for the word “experiment,” that 32-year-old Kim and two other Asian women—all of them K-pop fans—founded in early 2015. For them, EXP raises questions about the appropriation of culture and what it means for three Asian women to manage a K-pop band made up of performers who sing in Korean and who are white, black, and one member who is half-Japanese. But for some K-pop fans, EXP and its non-Korean band members are an affront to the K-pop community. “To many people in the world, K-pop is a new type of culture,” Kim told NBC News. “We serve as something that makes people think about what K-pop is and what K-pop idol groups could be.” EXP began as a thesis project for Kim, who studied sociology as an undergraduate in South Korea, during her second year in Columbia’s master of fine arts program. Signing on to the \"I'm Making a Boy Band\" project soon after were Karin Kuroda, whom Kim met while pursuing her second bachelor’s degree at the School of the Art Institute of Chicago, and Samantha Y. Shao, a Taiwanese woman who studied art management in the Netherlands. None of them had backgrounds in music. “As consumers of K-pop, becoming producers of it I think is a really important shift in terms of the fact that also we are women, and we’re Asian women,” Kuroda told NBC News, noting that K-pop bands have generally been created by large corporations in South Korea. RELATED: The American Talent Fueling Korean Pop Music's Fire “We’re here to create music and to hopefully be appreciated, and for people to actually like our product and what we are sending out into the world.” Tryouts for EXP, based in New York City, were held last November. There were three auditions in total, each drawing around 150 applicants and lasting from one to three days, Kim said. The men had to sing, dance and role play a scenario in which they spoke to reporters at a news conference after learning the band would perform at Madison Square Garden, Kim said. The applicant pool was then whittled down to between 30 and 50 hopefuls per audition. Šime Košta, a 25 year old born and raised in Croatia, was one of the men who auditioned who received a call from Shao saying he had been chosen for the band. Košta told NBC News he was ecstatic. “All the components it was made out of—music, dance, incredible fashion—it was so visually and musically appealing to me that I really fell in love with it and definitely wanted to pursue it,” he said. One of the biggest challenges for band members has been learning Korean, Košta said. EXP’s first single released in April, “Luv/Wrong,” was sung mostly in English. But with practice and language lessons, which band members attend weekly, their Korean has improved, he said. EXP’s second single, “Nolja Let's Party,” strikes more of a balance between Korean and English. The group's third single, to be released in February, entitled “Feel Like This” is almost entirely in Korean, Košta said. From the very beginning, what K-pop really is and what makes K-pop Korean were among the questions that drove the project, said Kuroda, who was born in Geneva to Japanese parents and grew up in New York. Is it language? Is it the ethnic background of the band members, managers and producers? Or is it something else? “What we mean by raising questions as artists is not just to answer them, but just to get people to start talking about something and ask them that question as well as others,” Kuroda explained. And that’s precisely what happened around the time “Luv/Wrong” came out in April. “One day we just woke up to a sea of comments, like 7,000 or 8,000, on Instagram, and everything kind of blew up,” Košta recalled. “It was very exciting and scary too because a lot of the comments were racial and homophobic slurs that were directed toward us.” https://www.instagram.com/p/-htUy6SKAZ An April 19 article posted on Koreaboo, a Korean pop culture website, made mention of the disapproving remarks K-pop fans left for EXP on social media. It also addressed another brewing controversy: that EXP was imitating the well-known K-pop group EXO, a Chinese-South Korean boy band founded in 2011 in Seoul. “To many people in the world, K-pop is a new type of culture.\" Kim dismissed those allegations. “The purpose of all this is to explore what K-pop and what K-pop fandom is,” she said, “and it’s not about making parodies.” One thing Kim and her partners have learned from the comments, she said, is that K-pop fans are very protective of K-pop culture and want to keep it Korean or, more generally, Asian. “We’re still figuring out how to communicate with these commenters and people who find our actions a bit upsetting,” Kim said. She added that the sheer volume of posters makes it difficult to respond one-by-one. “As we put more content out there—and through that content—we hope to have a more productive conversation,” Kim said. So far, EXP has appeared mostly in New York City, at both music and art venues, Kim said. On Dec. 4, the band will perform in Miami during the same week of Art Basel, a modern and contemporary art fair held annually in Basel, Miami Beach, and in Hong Kong. Kim said EXP’s biggest goal now is to perform in South Korea, but she added the group lacks the wherewithal to make that happen. To date, a Kickstarter crowdfunding campaign in May that netted EXP $30,600 in one month’s time has been the band’s principal financial means, Kim said. In addition to practicing with choreographers for 15 to 25 hours a week, some of the band members also work side jobs like singing at weddings and private parties, Košta said. As for the naysayers who disapprove of EXP, Košta said he was confident they would someday have a change of heart. “Not all of them have realized it yet, but slowly I think they’re realizing that we’re not here to offend anyone,” he said. “We’re here to create music and to hopefully be appreciated, and for people to actually like our product and what we are sending out into the world.” Follow NBC Asian America on Facebook, Twitter, and Tumblr. Chris Fuchs is a freelance journalist based in New York. His articles have appeared in Foreign Policy and the Taipei Times and in Chinese on ETToday.net, a popular Taiwanese news website. © 2023 NBC UNIVERSAL ",
    "title": "Making the K-Pop Band: Can a Non-Korean K-Pop Group Succeed?",
    "url": "https://www.nbcnews.com/news/asian-america/can-non-korean-boy-band-be-successful-k-pop-group-n474291"
}