{
    "text": "By Kelsey Kendall & Danielle Cook In Aggieville, friendships can start with strangers lighting each other’s cigarettes. In a house party, friendships can start with a stranger’s willingness to share their Jimmy John’s. Many Kansas State students have found a sense of community in spending their weekends immersed in Manhattan’s party culture, from the bars of Aggieville to private house parties. Aggieville Culture Plenty of K-State students would say when they come to Aggieville at night, they expect to have a good time with friends and drink. Aggieville has more than 15 bars to choose from, according to the Aggieville Business Association website, and on weekends people can be seen bar hopping and hanging outside the bars in groups. Jordan Irsik, senior in secondary education, said the atmosphere varies bar to bar in Aggieville, but overall, it is very welcoming and positive. “The people at Kansas State are all really friendly with each other,” Irsik said. “You rarely have any fights or anything like that. People are usually really respectful of each other, and you’re basically partying with a bunch of strangers and everyone acts like they’re best friends.” Irsik said he recalls great Tuesday nights in Aggieville with his friends. He and his friends would go out on Tuesday nights to take advantage of the cheaper prices and see where they would go. Where they decided to go depended on what they wanted to do each night. “Usually if we’re just trying to hang out, have fun, we’d just go to (So Long Saloon), but if we were trying to turn up like we used to, we’d go to (Johnny Kaw’s Sports Bar) or somewhere like that,” Irsik said. Hannah Gillespie, junior in life science, said Aggieville is a good place get groups together to forget being a student for an evening. “I feel like it’s always really relaxed,” Gillespie said. “I don’t feel like there’s a place I would go and feel uncomfortable in Aggieville.” Like Irsik, Gillespie’s favorite bar had been Rusty’s before it closed its doors last month. Aggieville has seen many changes over the years, Brett Allred, owner of Johnny Kaw’s, said. Allred recently purchased Rusty’s and also owns Shot Stop and Bomb Bar. Allred said a 2006 change in law made it easier for people to open bars in Aggieville. Since then, more bars have popped up, but they constantly change in the “feast-or-famine type market.” “There might be two or three businesses that are really full and the others don’t see much business, but because there’s so many bars now, it’s a lot different from 10 years ago when all the bars would be very busy,” Allred said. Despite the changes that have happened and what he expects will happen, Allred said people who come to Aggieville can still expect to be entertained and safe. Many people say it is important to feel safe in Aggieville when going out. Officer Tyrone Townsend with the Riley County Police has worked to do that for over a year. He said as a police officer, he has become a part of the Aggieville community. “You see a lot of the same people, which isn’t always bad,” Townsend said. “You make connections with them. I think you make them feel safe, because they get to know you.” Townsend said what he has seen in Aggieville is a community that takes care of its people, lighting cigarettes for each other, loaning phone chargers and making sure people get home safely. “This could go on, but obviously there is the bad stuff,” Townsend said. Issues officers might handle in a night are MIP, over-intoxication, DUIs or fights. Fights typically happen around the time bars close, he said. Officers pay close attention to parking lots and other places where people might congregate, because these are places where fights might happen. “Obviously you’ll see some of the fights,” Townsend said. “We’ve had in the past in some of the bars mega- mega-fights with 10 plus people. It’s just a brawl, an all-out brawl … you’re just trying to contain it.” Despite the fights and other issues an officer might face in Aggieville, Townsend said he still likes to think of the funny moments, like the night when a man came in to report a stolen car but it had actually been repossessed. Things can get crazy in Aggieville, especially working in it, but Townsend said he appreciates the community mixed with K-State students and faculty, military and locals. House Party Culture Danielle Winchester, junior in hospitality management, said she has both attended and hosted her fair share of private parties throughout her time in college, and has concluded that a majority of Manhattan house parties have a more low-key atmosphere to them than parties in other college towns. “Everybody seems to know everyone here, or if you don’t know a person (at a party), you’ve seen them somewhere, or you’re like, ‘Oh, you’re on the tennis team. My friend’s on the tennis team,’ so it all feels really connected,” Winchester said. As far as how she’s seen law enforcement’s handling of out-of-hand house parties, Winchester said Manhattan police are reasonable and respectable. “In Manhattan, cops don’t seem very rude about it,” Winchester said. “They usually give a warning at first. They come in respectfully, and they tell you the truth. I know in other places, cops will lie to you to get in the house. They’ll tell you they have a warrant when they don’t. That doesn’t seem to happen here because it’s such a family-style culture and such a tight community.” Winchester said she recalls allowing a stranger, who was a fellow K-State student, into one of her parties because they brought Jimmy John’s to share. “It wasn’t weird because everybody in Manhattan seems really nice and friendly,” Winchester said. “And I know that that’s not true for everything. Sometimes parties get too wild and sometimes things go bad, but for the most part, every party I’ve ever been to has been really respectful for a party. You know, K-State’s a community, and we’re not very big in the grand scheme of things, so everybody kind of has a connection to everybody. It’s nice. It’s safe.” ",
    "title": "Manhattan party culture creates sense of community - The Collegian",
    "datetime": "2017-03-16T06:00:00+00:00",
    "url": "https://www.kstatecollegian.com/2017/03/16/manhattan-party-culture-creates-community/"
}