{
    "text": "On Sept. 9, Forum Hall in the K-State Student Union was filled with bright lights, festive music and a welcoming atmosphere for Nepal Night. The Nepalese Student Association (NSA) organized Nepal Night to display Nepal’s culture through clothing, dancing and song. Saubhagya Shrestha, Manhattan resident and Nepal native, helped host the event. “It was just a celebration of Nepalese culture that we got to share with everyone at K-State and in Manhattan,” Shrestha said. “When I first moved here from Nepal, I kind of missed home … NSA was just like a place where I could feel like it’s Nepal again … When Nepal Night came around, I knew that I wanted to do something big in it, so I decided to MC the event.” Nepal Night was a celebration of culture with attendees up on their feet, clapping and dancing along with each of the performances. Manhattan resident Bibek Subegi expressed his excitement after the event. “It reflects our culture,” Subegi said. “We have a diverse variety of cultures, even though we are a smaller country … For example, we have different costumes in different songs and different body language.” Subegi said he heard about the event through NSA, which he likes to get involved in when he can. One of the dancers for the event was Pragyesh Dhungel, a graduate student in microbiology. He wanted Nepal Night to be able to show Nepalese culture to the world. “When we came to the US, we didn’t realize there are so many cultures here,” Dhungel said. “That was kind of new to us, and we wanted to learn about other cultures as well … We wanted to showcase our culture to the world … There are so many cultures in the campus, as well as outside.” Dhungel is also a member of NSA and said that Nepal Night was originally a way to say thank you to people who helped support and donate to their country after an earthquake in 2015. “It initially started out in that way, but we kept on doing it to show our culture to as big a mass as possible,” Dhungel said. ",
    "title": "Manhattan locals and K-State students celebrate annual Nepal Night - The Collegian",
    "datetime": "2017-09-11T05:30:00+00:00",
    "url": "https://www.kstatecollegian.com/2017/09/11/manhattan-locals-and-k-state-students-celebrate-annual-nepal-night/"
}