{
    "text": "Nous utilisons les témoins de navigation (cookies) afin d'opérer et d’améliorer nos services ainsi qu'à des fins publicitaires.\nLe respect de votre vie privée est important pour nous. Si vous n'êtes pas à l'aise avec l'utilisation de ces informations,\nveuillez revoir vos paramètres avant de poursuivre votre visite.Gérer vos témoins de navigationEn savoir plus Vous naviguez sur le site de Radio-Canada L'écrivaine britannique J. K. Rowling et la romancière canadienne Margaret Atwood Photo : John Phillips/Getty Images et Mike Coppola/Getty Images Prenez note que cet article publié en 2020 pourrait contenir des informations qui ne sont plus à jour. Plus de 150 personnalités, dont les écrivaines Margaret Atwood et J. K. Rowling ainsi que l’intellectuel Noam Chomsky, ont publié mardi une lettre dénonçant la culture du bannissement et du boycottage – cancel culture en anglais –, qui nuirait à la liberté d’expression. Cette lettre, également signée par les écrivains Salman Rushdie et Malcolm Gladwell de même que par la féministe Gloria Steinem, a été publiée, en anglais, dans Harper's Magazine (Nouvelle fenêtre) et, en français, dans Le Monde (Nouvelle fenêtre). L’échange libre des informations et des idées, qui est le moteur même des sociétés libérales, devient chaque jour plus limité, déplore la lettre. La censure, que l’on s’attendait plutôt à voir surgir du côté de la droite radicale, se répand largement aussi dans notre culture : intolérance à l’égard des opinions divergentes, goût pour l’humiliation publique et l’ostracisme, tendance à dissoudre des questions politiques complexes dans une certitude morale aveuglante. Pour appuyer son propos, la lettre met en avant le fait qu’on renvoie des rédacteurs en chef pour avoir publié des articles controversés [...]; [qu’]on empêche des journalistes d’écrire sur certains sujets; [qu’]on enquête sur des professeurs à cause des œuvres littéraires qu’ils citent en classe [...]; [et qu’]on limoge des dirigeants d’organisations pour des erreurs qui ne sont parfois que des maladresses. Saluant les puissantes manifestations en faveur de la justice raciale et sociale et les appels à davantage d’égalité et d’inclusion dans notre société, les signataires regrettent que cette nécessaire prise en compte [ait] aussi renforcé tout un ensemble de postures morales et d’engagements politiques qui risquent d’affaiblir les règles du débat public et l’acceptation des différences au profit d’un conformisme idéologique. Nous refusons tout faux choix entre la justice et la liberté qui ne peuvent exister l’une sans l’autre, ont ajouté les signataires, soulignant le besoin de laisser à celles et ceux qui écrivent de la place à l’expérimentation, à la prise de risque et même aux erreurs. Parmi les personnes ayant signé cette lettre, mentionnons donc l’auteur Salman Rushdie, visé par une fatwa de mort en 1989 pour avoir écrit le roman Les versets sataniques, et l’écrivain syrien Khaled Khalifa, dont certaines œuvres ont été interdites en Syrie. La publication de cette lettre survient après plusieurs vives critiques suscitées par des propos jugés transphobes tenus par J. K. Rowling, à qui l’on doit la saga littéraire Harry Potter. La plus récente de ces controverses date de la mi-juin. Depuis, plusieurs fanatiques de Harry Potter ont fait part – sur les réseaux sociaux et dans les médias – de leur volonté de tourner le dos à J. K. Rowling et à son œuvre, certaines personnes décidant notamment d’effacer leurs tatouages inspirés de l’univers de Harry Potter. Avec les informations de BBC News Vous souhaitez signaler une erreur?Écrivez-nous (Nouvelle fenêtre) Vous voulez signaler un événement dont vous êtes témoin?Écrivez-nous en toute confidentialité (Nouvelle fenêtre) Vous aimeriez en savoir plus sur le travail de journaliste?Consultez nos normes et pratiques journalistiques (Nouvelle fenêtre) Le tireur présumé est toujours en cavale. Ce paysage plus grand que la Belgique serait resté intact pendant plus de 34 millions d'années. « Nous nous rapprochons dangereusement de ces points qui pourraient détruire les systèmes dont notre vie … Washington suggère des « pauses » pour faciliter l'acheminement de l'aide humanitaire. Selon la ministre, les déficits des sociétés de transport de Montréal représentent 90 % des 2,5 G$ manquants. ENQUÊTE - Deux réseaux soutirent des milliers de dollars à des travailleurs philippins en toute impunité. Des experts s'inquiètent que l'octroi d'électricité au rabais à des usines soit payé par la collectivité. Les discussions en cours au Conseil des ministres sont alimentées notamment par la crise du logement. Le gouvernement provincial ne paie pas vraiment le tiers des frais d’exploitation en transport en commun. Nouvelles, analyses, reportages : deux fois par jour, recevez l’essentiel de l’actualité. ",
    "title": "Margaret Atwood et J. K. Rowling dénoncent la « culture du bannissement » | Radio-Canada.ca",
    "url": "https://ici.radio-canada.ca/nouvelle/1718181/margaret-atwood-j-k-rowling-lettre-cancel-culture"
}