{
    "text": "The Vision Fund, led by SoftBank CEO Masayoshi Son, has finally decided not to invest in Tada, a ride-hailing service, after a year-long review. The fund has reportedly been considering investing 200 billion won to 300 billion won in Tada. But as tensions among the taxi industry, political circles and government agencies continue to escalate, the fund seems to have felt uncomfortable about investing in the new mobility service. According to industry watchers, the Vision Fund gave up investment in Tada in August as the viability of the van-hailing service was questioned due to continuing conflicts between taxi companies and mobility startups. The Vision Fund is the largest technology fund in the world that was launched in 2016 by the SoftBank CEO in a partnership with Saudi Arabia’s sovereign wealth fund. The fund seriously considered investing in Tada from the end of last year. Tada was valued at more than one trillion won and the fund contemplated an investment of 200 to 300 billion won in it. Tada’s value was estimated at about 800 billion won when it raised funds through a Series E funding round early this year. Not only Vision Fund but also SK, a shareholder of SoCar, the holding company of Value Creators & Co. (VCNC), the Tada operator, considered investing in the service. If the Vision Fund had invested in Tada as planned, VCNC would have become the second company after Coupang which has received investment from the fund, It is thought that SoftBank was attracted to Toda because it is a startup representing Korea’s sharing economy. The startup announced on Oct. 7 that it planned to increase the number of its vans by more than seven times by the end of next year from the current 1,400 to 10,000. Especially sharing economy is a factor which decisively affects Son Jeong-ui’s investment decisions. Previously SoftBank has invested a huge amount of money in Uber and Grab, which provided earlier versions of Tada’s ride-hailing mobility service. It was when Tada was standing at the crossroads that Vision Fund began to reconsider its investment in the service. In July when the number of Tada subscribers surpassed one million, the Ministry of Land, Infrastructure and Transport announced the “Taxi System Reform Plan for Innovative Growth and Win-Win Development,” which virtually illegalizes the operation of Tada’s ride-hailing service. The reform plan did not include provisions on Tada drivers who have not possessed qualifications for rental car drivers or taxi drivers. It also stipulated that Tada should pay 400 thousand won a month per vehicle and purchase all the cars it operates. Apparently, Tada’s transportation business has become legalized, but the distinctions between its business and that of the existing taxi industry have disappeared. Changes were also inevitable in its business model and growth plan by stage. On Oct. 28, the Seoul Central District Prosecutor’s Office indicted Park Jae-uk, chief executive officer of VCNC and Lee Jae-woong, chief executive officer of SoCar, declaring Tada is not a rent car business but an illegal taxi business. They will face a trial without physical detention on charges of running a transportation business without a license. Based on dual liability, the corporate bodies of SoCar and VCNC are also indicted. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Masayoshi Son’s Vision Fund Gives Up Investment in Tada - Businesskorea",
    "datetime": "2019-10-31T10:38:40+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=37533"
}