{
    "text": "By Marlon Bishop The room of Samantha Alejandra, 18, in Mexico City, doubles as a shrine to her favorite K-Pop boy band, Super Junior.\n                \n                    \n                    Marlon Bishop for NPR\n                    \n                \nhide caption The room of Samantha Alejandra, 18, in Mexico City, doubles as a shrine to her favorite K-Pop boy band, Super Junior. If you want to get a sense of what Mexican teenagers are up to these days, here's an unexpected place to start: A Korean bakery in downtown Mexico City. Every Sunday, dozens of teens — mostly female — convene here to eat Korean snacks and geek out about their favorite boy bands. They're known as los k-popers – a growing subculture of Mexican kids who are crazy for Korean pop music. \"K-Pop really changed my life,\" says Samantha Alejandra, 18. \"I'm addicted to it.\" Alejandra comes from a modest family, but she saves every peso to spend on imported K-pop stuff, like a new DVD box set she just bought featuring her favorite band, Super Junior. Girls crowd around her, trying to get close to such a powerful artifact. Meanwhile on the wall, a flat-screen TV plays the latest music videos from Seoul. They're flashy, with high production values and lots of dancing. Sing-alongs occasionally erupt through the bakery. K-pop, as Korean pop music is known, burst into the US media spotlight last year when Psy's \"Gangnam Style\" went viral. Since then, K-pop has continued to expand, providing an alternative to US pop for young people around the world. Super Junior is one of the genre's most popular acts. On its recent world tour, the group spent a lot of its time in Latin America, one of K-pop's fastest growing markets. Ask any of the bakery teens how they got into K-pop and they'll give you the same answer: YouTube. \"I got bored of watching videos from the same US pop singers like Selena Gomez and Miley Cyrus,\" says Mayán Sánchez, 19. \"It's always the same thing.\" One day, Sánchez randomly clicked on a video for the Korean group Big Bang. She couldn't understand the lyrics, but she liked the outrageous styles. \"It was catchier, and had a more danceable beat. I started to look for more groups online, and I just fell completely in love,\" she says. Piecing together bits of info from the web, Mexican K-pop fans like Sánchez have started imitating Korea's intricate fandom rituals — celebrating the birthdays of their favorite stars, creating fan clubs and filming \"flash mob\" re-creations of popular dance moves. K-pop fever isn't just hitting in Mexico; it's spreading all over Latin America. When Super Junior came to Chile earlier this year, it was like a little Beatlemania. Hundreds of fans showed up to the airport to great the band, and the group sold 12,000 tickets at Santiago's biggest venue. In Peru, the music is so popular that barbers are offering \"K-pop haircuts.\" And last year, a Korean broadcaster produced an American Idol-style K-Pop reality show in Colombia. Korean boy band Super Junior performs to 12,000 Chilean fans in Santiago's Movistar Arena. Latin American audiences are also getting into K-dramas, Korean soap operas. They run on primetime in several Latin countries. At the New York offices of Dramafever, an online streaming service for Korean soaps, translators are hard at work subtitling episodes in Spanish. The company recently expanded to offer its content in Latin America this summer. Already, the region is accounting for 12 percent of the company's business — and about 35 percent of its US users are Latino. Meanwhile at the K-Pop news site AllKPop.Com, a million unique visits are coming every month from South America alone. Dramafever CEO Suk Park says these kinds of numbers have caught Korea's entertainment industry by surprise. \"Companies involved in media have been really focused on the US for many, many years,\" Park says. \"They had a really hard time penetrating the US market, not realizing that there was something brewing in Latin America. But that has been made obvious.\" Even though K-pop and K-dramas still have a relatively small piece of the market, Park thinks this could be a look into the future. Korea is proving in Latin America that its cultural industries can be competitive outside of their stronghold in Asia. \"It's that wholesome, high-polished type of entertainment that attracts a lot of people. It will make a mark, globally,\" he says. When \"Gangnam Style\" broke out last summer, lots of Latin American kids became curious about Korean culture. Mention Psy to any of the hardcore K-Pop fans at the Mexico City bakery, though, and you'll get an eye roll in response — they were totally into K-Pop before it was big. But Samantha Alejandra says that Psy does have one redeeming factor. \"At least he beat out Justin Bieber for the most views on YouTube,\" she says. \"Thank heavens.\" This story was produced in collaboration with Round Earth Media's Mexico Reporting Project. Sponsor Message Become an NPR sponsor ",
    "title": "Meet Latin America's Teenage Korean Pop Fanatics : NPR",
    "url": "https://www.npr.org/2013/12/15/251021326/meet-latin-america-s-teenage-korean-pop-fanatics"
}