{
    "text": "World-renowned, award-winning Mexican artists Agustin Cruz Prudencio and Cilau Valadez visited campus on Tuesday to put on a workshop teaching individuals about their art. “K-State is a world-class university and our art education program needs to be global, and that’s what we’re trying to do,” Trina Harlow, instructor in art education, said. Harlow played an integral role in organizing the workshop by receiving a diversity grant from the Student Governing Association. “I’d crossed paths with these artists before and really liked what they do,” Harlow said. “The high level of skill that’s involved is amazing. They’re brilliant.” Harlow said as the world changes, there is a greater need to teach diversity to children and adults alike. “A big part of my art curriculum has been multicultural projects and studying other cultures and countries and people,” Harlow said. “Art education is a really natural way to teach others about those things. As a teacher, I have to be really concerned about diversity.” Prudencio, an Oaxacan wood carver and painter, has been making art for 19 years. “I get inspiration through going to festivals and international conventions where I show my artwork,” Prudencio said. “I see the quality of other artists’ work and push myself to improve my own work.” In the morning, Prudencio goes to his workshop and starts working with machetes and knives. Eventually, he stops to eat and goes back to work. Carving a small piece might take a day, but larger pieces might take weeks or months. Valadez, a fourth-generation Huichol yarn painter, did his first piece when he was 7 years old and has been creating works of art for a living for nine years. He has a long list of commissions that he said he has to really be working on to get through. Each piece takes hours of time and focus to complete. “I live near the ocean, so when my eyes get tired or I lose focus, I grab my board and surf for a few hours before getting back to work,” Valadez said. Valadez said his paintings are “just like writing a poem.” He gets inspiration from his culture’s tradition and nature using stories and symbols to create vibrant, colorful works of art. Students were encouraged to attend the event, especially those in the education field. “I think it’s really cool,” Rylan Laudan, sophomore in elementary education, said. “The diversity of all the different projects we are getting to do that would also be very easy for elementary students to do.” Though students came to learn, it was more than just another class. “It’s always fun to get to do things from other cultures and get to experience art projects outside of class and just have fun with them and be creative,” Aubrey Berning, freshman in elementary education, said. Future educators like Berning will be able to use what they learned in the workshop for their future classrooms. “For social studies lessons and stuff like that, it will be really neat to get to use projects from a different culture than most of my students will probably know,” Berning said. The workshop also drew art enthusiasts, young and old, from a variety of groups across the Manhattan community. “I’m familiar with Huichol,” Enell Foerster, a member of the Manhattan Area Weavers and Spinners Guild, said. “I grew up in Mexico, so I wanted to come and honor the artists and participate.” While the event was a great learning opportunity for students, it was also beneficial for those who came to enjoy themselves. “It’s fun and it’s challenging,” Foerster said. “I think that’s what they’re trying to do, challenge our artistic sense.” It is Harlow’s mission to broaden the spectrum of art education on campus through workshops like this one. ",
    "title": "Mexican artists bring culture, color to campus - The Collegian",
    "datetime": "2015-02-18T04:56:38+00:00",
    "url": "https://www.kstatecollegian.com/2015/02/17/mexican-artists-bring-culture-color-to-campus/"
}