{
    "text": "The Kansas State Student Union Courtyard was filled with colorful Chinese lanterns Wednesday during the Mid-Autumn Festival hosted by the Chinese Students and Scholars Union. The Mid-Autumn Festival, also known as the Moon Festival, is a traditional Chinese celebration of the fall harvest during a full moon. The festival’s origins can be traced back to the Shang dynasty over 3,000 years ago. “This event is like Thanksgiving, but in China,” Mary Abounabhan, senior in business management, said. Yixuan Sun, senior in mass communications and member of the Chinese Students and Scholars Union, said the Mid-Autumn Festival is the reunion of family for Chinese people. Related:Manhattan Arts Center showcases local talentRead Now “This is also a good educational experience because we can introduce this festival to people from different countries,” Sun said. Read Now Kendall Borthwick, Manhattan resident, said he found the Mid-Autumn Festival to be an educational and fun experience. “Before we were married, my wife spent four years in China,” Borthwick said. “This is a way for me to learn more about the culture she loves.” Attendees at the Mid-Autumn Festival could play traditional Chinese games, with the winners receiving prizes. “The prize I want is the fan,” Borthwick said. With each game win, attendees were awarded a stamp. The more stamps collected, the higher the chance participants would win the grand prize, a giant folding fan, in the lottery drawing. Attendees also learned how to write their name in traditional Chinese characters. “Learning how to draw my name was interesting,” Borthwick said. “There’s over 20,000 characters in the Chinese language, so learning mine was good to know because it’s mine.” The festival’s mooncakes —  traditional Chinese baked desserts usually eaten during the Mid-Autumn Festival — were popular with hungry attendees. Participants could make their own mooncakes with provided flour and stuffing. Ray Luo, teaching assistant of geography, said this was a good inclusion. “Making my mooncake was my favorite thing to do,” Luo said. “My home is in China, so I’m far away. I’m glad this event provides an opportunity for me to celebrate.” Xyza Asuncion, graduate student in biological and agricultural engineering, said the Mid-Autumn Festival was very inviting. “The atmosphere is like a warm blanket,” Asuncion said. “Since it’s all Chinese, I feel very accepted. It is inviting and intriguing.” The Chinese Students and Scholars Union encourages all Chinese students to join the organization and help with future events like the Mid-Autumn Festival. “It’s a close-knit community and provides a sense of belonging,” Sun said. ",
    "title": "Mid-Autumn Festival celebrates Chinese culture in Student Union - The Collegian",
    "datetime": "2017-10-06T05:00:00+00:00",
    "url": "https://www.kstatecollegian.com/2017/10/06/mid-autumn-festival-celebrates-chinese-culture-in-student-union/"
}