{
    "text": " Profile Sections tv Featured More From NBC Follow NBC News A man arrested in the killing of a Baltimore tech entrepreneur was suspected of raping a woman days before and was already under surveillance, police say September 28, 2023, 12:24 PM Michael Gambon, the actor best known for playing Dumbledore in the 'Harry Potter' films, dies at 82 September 28, 2023, 8:02 AM Morning Rundown: Biden impeachment inquiry's first hearing, Powerball jackpot nears $1 billion, and Kansas City's love story with Taylor Swift September 28, 2023, 7:36 AM U.S. soldier Travis King arrives back on American soil after being expelled from North Korea September 28, 2023, 4:04 AM Remains found in Colorado are identified as Suzanne Morphew, a mom who disappeared in 2020 September 27, 2023, 5:54 PM The mother of a man suspected of killing a Baltimore tech CEO urged him to surrender, fearing police would try to kill him September 27, 2023, 2:37 PM It was a United Nations speech that got attention like few others — a plug for vaccines, young people and the Earth's well-being from superstar K-pop band BTS. Addressing the stage for a sustainability event, the seven-member musical juggernaut appeared before the renowned green-marbled backdrop in the General Assembly hall on Monday to help promote U.N. goals for 2030 including ending extreme poverty, preserving the planet and achieving gender equality. “Every choice we make is the beginning of change, not the end,” said RM, the band's leader. South Korean President Moon Jae-in introduced the pop stars as special presidential envoys and an “exceptionally outstanding group of young men who are connecting with the youth across the world.” The gravity of the moment wasn’t lost on the musicians standing before world leaders and U.N. Secretary-General Antonio Guterres. Nerves were evident when band member Jimin stumbled over his words while talking about young people trying to navigate the pandemic. Jimin apologized before taking a breath to recollect himself. It was a moment that prompted the “BTS ARMY” of fans to rally behind him in a show of support on social media. The artists took turns on stage during their seven-minute speech. Video of the group's speech on the United Nations’ official YouTube channel has been viewed more than 6 million times as of Monday afternoon. But it wasn't all about U.N. goals. The group also unveiled a new music video for its current hit single “Permission to Dance,” which was filmed at U.N. Headquarters in New York. The singers crooned, “Don’t need to talk the talk, just walk the walk,” while dancing their way from the General Assembly hall to the garden overlooking the East River. Since its debut in 2013, BTS has garnered global recognition for its self-produced music and activism, which also includes publicly calling out anti-Asian racism. The band topped the Billboard Hot 100 chart three times in 2020, and was nominated for prominent music awards like Billboard Music Awards and MTV Video Music Awards. Monday's speech marked the group's second appearance at the U.N. The band took part in an event in 2018, when RM spoke about its work with UNICEF. © 2023 NBC UNIVERSAL ",
    "title": "Millions tune in as K-pop stars BTS address U.N. gathering",
    "url": "https://www.nbcnews.com/pop-culture/music/millions-tune-k-pop-stars-bts-address-u-n-gathering-n1279652"
}