{
    "text": "K-State Athletics Strategic Plan\n\n\nMission\nOur mission is to foster a culture in which our student-athletes have every opportunity to reach their maximum potential academically, athletically, mentally and socially while operating an organization that is anchored by a genuine commitment to K-State, our supporters and each other.\nValues\nAt K-State, we are “Family.” Our bond envelops our students, coaches, staff, alumni, donors and fans.  The connection is constant, as we are linked from the time we are together on campus and always thereafter.\nWe strive to recruit students, coaches and administrators who are of the highest moral CHARACTER. We embrace DIVERSITY, push INNOVATION, and seek EXCELLENCE while emphasizing the significance of acting with HONESTY and INTEGRITY.  A K-Stater understands that COLLABORATION, community ENGAGEMENT and HARD WORK lead to perseverance and success throughout life.\nStrategic Priorities\n\nSupport Student-Athlete Success and Well-Being\nWin Championships\nProvide the Best Fan Experience in the Big 12\nFoster a Positive and Inclusive Department Culture\nGrow and Efficiently Manage Financial Resources\nEncourage Diversity and Inclusiveness with All Student-Athletes, Coaches and Staff\nCultivate and Promote an Atmosphere of Compliance\n\n\n\n\nSupport Student-Athlete Success and Well-Being\n\n\n\nSupporting our student-athletes in their pursuit of a top-level education, and providing them the resources and experiences necessary for success after college, is our ultimate priority.  We will:\nSupport Students Academically\r\nWe will be steadfast in providing access to proper academic resources and connection to our campus partners.  We will focus on retention of student-athletes and their progress toward timely degree completion, with additional focus on minority and first generation students.  We will dedicate resources to academic learning spaces, academic counseling staffs, specialized learning programs and technology upgrades to enhance the overall educational experience of all student-athletes.\nEnhance Skills for the Future\r\nWe will foster the development of our student-athletes to ensure a well-rounded college experience and successful transition to life after sport.  Evaluation of staffing and resources will occur on a regular basis, with emphasis placed on the continued growth of our career development programming.  We will create a comprehensive plan to guide personal, professional and leadership development from the time student-athletes step on campus to the time they graduate.\nFocus on Student-Athlete Well-Being\r\nWe will invest in the emotional well-being of our student-athletes.  We will enhance programming for mental wellness, sexual violence prevention awareness, transition to college and social issues – providing forums and better communicating available resources to our student-athletes.\nCelebrate Student-Athlete Success\r\nAppropriate benchmarking measures will be used to evaluate student-athlete support resources, staffing and programming for the overall success of the student-athlete.  This information will allow us to be intentional with our programming to prepare student-athletes to be great representatives of K-State, as well as equip the department to provide compelling content that tells each student-athlete’s story.  \n\n\n\n\n\n\nWin Championships\n\n\n\nOur goal for every sports program is to compete for Big 12 championships and to qualify for, compete and advance in the post-season. In order to accomplish this, we will:\nRecruit and Retain Top Student-Athletes\r\nWe seek to recruit student-athletes, who are incomparable competitors on the playing fields and who personify our values. Student-athletes at K-State are special and we will work tirelessly to support their educational and athletic goals. We will showcase student-athlete success, the accomplishments of the Athletics Department and the University, and the charm and positive experience of living in the “Little Apple” through multi-platform distribution of robust recruiting content.\nHire and Retain Top Coaches\r\nWe will strive to employ the most qualified coaches, who will work tirelessly to bring out the best in our student-athletes. They will embody our commitment to having winning programs without sacrificing our integrity, or the welfare of our student-athletes. We will provide our coaches with competitive salaries and benefits, while giving each coach the support necessary to reach the highest level of success.\nMaintain the Highest Quality Facilities and Equipment\r\nAs we construct new athletic facilities, we will continue the tradition of creating state-of-the art buildings that will help our student-athletes attain optimal results. In addition, we will pursue the use of cutting-edge technologies to enhance training and maximize achievements in competition.\nEmphasize Student-Athlete Performance, Health and Safety\r\nWe have dedicated nutritionists, certified athletic trainers, equipment staff and strength and conditioning coaches to support our student-athletes. We will continue to evaluate our student-athletes' needs on a consistent basis to ensure that they are receiving the resources needed to improve their performance and compete at the highest level.\n\n\n\n\n\n\nProvide the Best Fan Experience in the Big 12\n\n\n\nWe strive to create the Best Fan Experience in the Big 12 by providing a game-day environment that is safe, welcoming, engaging, entertaining and unique. Our daily interactions will focus on serving fans, donors, alumni and friends with an exceptional customer experience through accessibility and transparency in communication with the department.\n\nServe the K-State Family\r\nWe will offer a wide range of access to all members of the K-State Family, including value ticket pricing options, creative experience packages and a welcoming game day-atmosphere. We will make it as easy as possible for fans to interact with athletics staff and to attend games. We will utilize fan feedback to make data-based improvements and share these improvement plans with the K-State Family.\nEngage with K-State Students\r\nWe will develop innovative plans, collaborating with key campus partners, aimed at remaining at the forefront of cultural trends specific to the college student demographic. We will create connections and deliver lasting memories between K-State students and student-athletes, coaches and staff. We will place an emphasis on retention of students throughout their collegiate journey and relationship development to convert graduates into long-time ticket-holders and donors.\nEvolve the Game Day Experience\r\nWe will invest in technology, facilities improvements and entertainment to differentiate the K-State experience from other entertainment options and to create efficiencies in fan experience services like ticketing, parking, concessions and merchandise purchases.\nElevate the K-State Brand\r\nWe proudly embrace the responsibility of building the K-State brand throughout the state of Kansas, nationally and internationally. Expanding the reach of our digital content will occur through sharing the stories of our student-athletes’ academic and athletics achievements. Our staff will be built with talented individuals, who will be prepared to capitalize on team accomplishments.\n\n\n\n\n\n\nFoster a Positive and Inclusive Department Culture\n\n\n\nK-State Athletics values every department member. We recognize each person plays a unique role in achieving our short and long-term goals. We will operate with four critical tenants:\n\nTransparency and Execution of Vision\r\nWe will continue to improve the communication, interaction and cooperation between athletics administration, department heads, coaches, staff and student-athletes to enhance the overall academic and athletic experiences of our student-athletes.\nLive Our Mission: Make ‘Family’ Matter\r\nWe will uphold an environment in which coaches and staff feel supported, respected and enjoy coming to work every day. We will be known as a department in which employees desire to work and student-athletes are able to thrive and reach their goals. We will provide regular programming aimed at creating collaborative and supportive relationships among staff\nEmployee Support\r\nWe will strive to maintain competitive salaries and benefits while remaining fiscally responsible. Orientations and training sessions will be reviewed to ensure that employees have the information and resources needed to be successful, and all coaches and staff will receive annual feedback through supervisor evaluations.\nProvide Professional Development\r\nWe will encourage staff to be ambassadors locally, regionally, and nationally and pursue development opportunities in their field. We will share the accomplishments of our staff with the K-State Family and promote staff externally for national awards.\n\n\n\n\n\n\nGrow and Efficiently Manage Financial Resources\n\n\n\nIn order to preserve our leadership role in the Big 12 and intercollegiate athletics, it is critical that we explore all means of development and fiscal responsibility including:\nExpanding the Ahearn Fund\r\nOur National Fund for Student-Athlete Excellence will continue to grow by proactively exposing its mission to new potential members like recent graduates, alumni and friends, former student-athletes, season ticket holders and other K-State fans. We will continue to creatively enhance membership growth and retention by appropriately stewarding existing members through personal contact, membership benefits and other engagement activities.\nCollaborating with Strategic Partners\r\nWe are proud to operate with several long-term strategic partners in areas like apparel, concessions, licensing, media rights and more. We will seek creative opportunities to drive additional revenue through these present agreements, as well as look for new avenues of financial sustainability by way of partnership negotiations and new, unique affiliations.\nDelivering Facilities Improvements through Philanthropic Campaigns\r\nWe are committed to strategic fundraising in order to complement our annual fund efforts and deliver world-class facility improvements for each of our sport programs. The timeliness of executing these projects will be assisted through cultivating leadership contributions from individual donors, families, foundations and corporations.\nManaging Resources Responsibly and with Transparency\r\nWhile raising revenues is critical, how those resources are utilized and managed have a tremendous impact on the financial health of the department. We will meet current debt payment requirements by maintaining a balanced budget and remain steadfast to operating with sound fiscal judgment that includes responsible spending and investment. We will be open and transparent in communicating the details of our financial operations.\nSeeking and Evaluating Ancillary Revenue and Non-Traditional Opportunities\r\nWe will look to participate in new activities that expose the K-State brand to a broader audience through community events, entertainment, and revenue generating competitive opportunities.\n\n\n\n\n\n\nEncourage Diversity and Inclusiveness with All Student-Athletes, Coaches and Staff\n\n\n\nWe will focus on department-wide initiatives that actively promote an inclusive and diverse community through educational programming and support of all populations. Our collective efforts will include:\nIncreased Cultural Competency\r\nWe will make a concerted effort to provide relevant presentations and training on an annual basis to our student-athletes, coaches and staff. Diversity and inclusion education will be included in student-athlete orientations and new staff training and department all-staff programming. Our department will continue building on the existing relationships with the campus’s academic and social multi-cultural student groups and the International Student Center, and we will continue to embrace our leadership role in participating in multi-cultural programming and events.\nRecruitment and Retention\r\nWe will actively and intentionally recruit a diverse student-athlete population. In addition, we will be diligent in our efforts to recruit a broad set of applicants for department staff and coaching positions, including using department personnel and national resources to create diverse hiring pools.\nIdentification of Resources and Support for All\r\nTo provide a rewarding student-athlete experience, campus and department resources will be readily available to support all populations. We will also provide and promote professional development opportunities for coaches and staff through various intercollegiate organizations.\nEncouragement of International Student-Athletes\r\nWith student-athletes from more than 20 countries around the world, we recognize the importance of acclimating to a new country and to a different environment. We strive to make the transition seamless from providing appropriate resources to exposing the cultures of the student-athlete to the broader community.\n\n\n\n\n\n\nCultivate and Promote an Atmosphere of Compliance\n\n\n\nWe are committed to integrity in compliance and will adhere to following these principles:\nInstitutional Control & Head Coach Responsibility\r\nKansas State University is committed to maintaining institutional control by promoting a culture of compliance that emphasizes the shared responsibility among all staff members and student-athletes. Each staff member and non-staff member promoting the athletic interests at Kansas State University has the responsibility to ensure that they are acting in compliance with all NCAA, Big 12, and University requirements. All individuals shall understand their obligation to report any potential violations. Head coaches shall promote an atmosphere of compliance in their programs, communicate to their staff about the importance of compliance and monitor the activities of their staff members.\nTraining and Education\r\nWe will take reasonable steps to provide regular and effective rules education by communicating applicable regulations, policies and procedures to all staff, student-athletes, donors and fans. Various methods of delivering educational resources will be utilized.\nReasonable Policies and Procedures\r\nDepartment policies and procedures will be continually evaluated for effectiveness as well as to ensure that they are compliant with federal and state laws and NCAA, Big 12, institutional, and departmental rules and regulations. Policies and procedures will be implemented or updated appropriately and made readily available to all staff. We will take seriously our obligation to regularly educate department personnel on anti-discrimination and whistleblower protection policies.\nCommitment to Compliance\r\nThe President is responsible for the overall administration of the institution, which includes the athletic department. The director of athletics will exercise oversight of the compliance program and delegate authority to the compliance staff, which shall be appropriately supported and empowered to fulfill their obligation of administering an effective and ethical compliance program. K-State Athletics Strategic Plan\n\n\nMission\nOur mission is to foster a culture in which our student-athletes have every opportunity to reach their maximum potential academically, athletically, mentally and socially while operating an organization that is anchored by a genuine commitment to K-State, our supporters and each other.\nValues\nAt K-State, we are “Family.” Our bond envelops our students, coaches, staff, alumni, donors and fans.  The connection is constant, as we are linked from the time we are together on campus and always thereafter.\nWe strive to recruit students, coaches and administrators who are of the highest moral CHARACTER. We embrace DIVERSITY, push INNOVATION, and seek EXCELLENCE while emphasizing the significance of acting with HONESTY and INTEGRITY.  A K-Stater understands that COLLABORATION, community ENGAGEMENT and HARD WORK lead to perseverance and success throughout life.\nStrategic Priorities\n\nSupport Student-Athlete Success and Well-Being\nWin Championships\nProvide the Best Fan Experience in the Big 12\nFoster a Positive and Inclusive Department Culture\nGrow and Efficiently Manage Financial Resources\nEncourage Diversity and Inclusiveness with All Student-Athletes, Coaches and Staff\nCultivate and Promote an Atmosphere of Compliance\n\n\n\n\nSupport Student-Athlete Success and Well-Being\n\n\n\nSupporting our student-athletes in their pursuit of a top-level education, and providing them the resources and experiences necessary for success after college, is our ultimate priority.  We will:\nSupport Students Academically\r\nWe will be steadfast in providing access to proper academic resources and connection to our campus partners.  We will focus on retention of student-athletes and their progress toward timely degree completion, with additional focus on minority and first generation students.  We will dedicate resources to academic learning spaces, academic counseling staffs, specialized learning programs and technology upgrades to enhance the overall educational experience of all student-athletes.\nEnhance Skills for the Future\r\nWe will foster the development of our student-athletes to ensure a well-rounded college experience and successful transition to life after sport.  Evaluation of staffing and resources will occur on a regular basis, with emphasis placed on the continued growth of our career development programming.  We will create a comprehensive plan to guide personal, professional and leadership development from the time student-athletes step on campus to the time they graduate.\nFocus on Student-Athlete Well-Being\r\nWe will invest in the emotional well-being of our student-athletes.  We will enhance programming for mental wellness, sexual violence prevention awareness, transition to college and social issues – providing forums and better communicating available resources to our student-athletes.\nCelebrate Student-Athlete Success\r\nAppropriate benchmarking measures will be used to evaluate student-athlete support resources, staffing and programming for the overall success of the student-athlete.  This information will allow us to be intentional with our programming to prepare student-athletes to be great representatives of K-State, as well as equip the department to provide compelling content that tells each student-athlete’s story.  \n\n\n\n\n\n\nWin Championships\n\n\n\nOur goal for every sports program is to compete for Big 12 championships and to qualify for, compete and advance in the post-season. In order to accomplish this, we will:\nRecruit and Retain Top Student-Athletes\r\nWe seek to recruit student-athletes, who are incomparable competitors on the playing fields and who personify our values. Student-athletes at K-State are special and we will work tirelessly to support their educational and athletic goals. We will showcase student-athlete success, the accomplishments of the Athletics Department and the University, and the charm and positive experience of living in the “Little Apple” through multi-platform distribution of robust recruiting content.\nHire and Retain Top Coaches\r\nWe will strive to employ the most qualified coaches, who will work tirelessly to bring out the best in our student-athletes. They will embody our commitment to having winning programs without sacrificing our integrity, or the welfare of our student-athletes. We will provide our coaches with competitive salaries and benefits, while giving each coach the support necessary to reach the highest level of success.\nMaintain the Highest Quality Facilities and Equipment\r\nAs we construct new athletic facilities, we will continue the tradition of creating state-of-the art buildings that will help our student-athletes attain optimal results. In addition, we will pursue the use of cutting-edge technologies to enhance training and maximize achievements in competition.\nEmphasize Student-Athlete Performance, Health and Safety\r\nWe have dedicated nutritionists, certified athletic trainers, equipment staff and strength and conditioning coaches to support our student-athletes. We will continue to evaluate our student-athletes' needs on a consistent basis to ensure that they are receiving the resources needed to improve their performance and compete at the highest level.\n\n\n\n\n\n\nProvide the Best Fan Experience in the Big 12\n\n\n\nWe strive to create the Best Fan Experience in the Big 12 by providing a game-day environment that is safe, welcoming, engaging, entertaining and unique. Our daily interactions will focus on serving fans, donors, alumni and friends with an exceptional customer experience through accessibility and transparency in communication with the department.\n\nServe the K-State Family\r\nWe will offer a wide range of access to all members of the K-State Family, including value ticket pricing options, creative experience packages and a welcoming game day-atmosphere. We will make it as easy as possible for fans to interact with athletics staff and to attend games. We will utilize fan feedback to make data-based improvements and share these improvement plans with the K-State Family.\nEngage with K-State Students\r\nWe will develop innovative plans, collaborating with key campus partners, aimed at remaining at the forefront of cultural trends specific to the college student demographic. We will create connections and deliver lasting memories between K-State students and student-athletes, coaches and staff. We will place an emphasis on retention of students throughout their collegiate journey and relationship development to convert graduates into long-time ticket-holders and donors.\nEvolve the Game Day Experience\r\nWe will invest in technology, facilities improvements and entertainment to differentiate the K-State experience from other entertainment options and to create efficiencies in fan experience services like ticketing, parking, concessions and merchandise purchases.\nElevate the K-State Brand\r\nWe proudly embrace the responsibility of building the K-State brand throughout the state of Kansas, nationally and internationally. Expanding the reach of our digital content will occur through sharing the stories of our student-athletes’ academic and athletics achievements. Our staff will be built with talented individuals, who will be prepared to capitalize on team accomplishments.\n\n\n\n\n\n\nFoster a Positive and Inclusive Department Culture\n\n\n\nK-State Athletics values every department member. We recognize each person plays a unique role in achieving our short and long-term goals. We will operate with four critical tenants:\n\nTransparency and Execution of Vision\r\nWe will continue to improve the communication, interaction and cooperation between athletics administration, department heads, coaches, staff and student-athletes to enhance the overall academic and athletic experiences of our student-athletes.\nLive Our Mission: Make ‘Family’ Matter\r\nWe will uphold an environment in which coaches and staff feel supported, respected and enjoy coming to work every day. We will be known as a department in which employees desire to work and student-athletes are able to thrive and reach their goals. We will provide regular programming aimed at creating collaborative and supportive relationships among staff\nEmployee Support\r\nWe will strive to maintain competitive salaries and benefits while remaining fiscally responsible. Orientations and training sessions will be reviewed to ensure that employees have the information and resources needed to be successful, and all coaches and staff will receive annual feedback through supervisor evaluations.\nProvide Professional Development\r\nWe will encourage staff to be ambassadors locally, regionally, and nationally and pursue development opportunities in their field. We will share the accomplishments of our staff with the K-State Family and promote staff externally for national awards.\n\n\n\n\n\n\nGrow and Efficiently Manage Financial Resources\n\n\n\nIn order to preserve our leadership role in the Big 12 and intercollegiate athletics, it is critical that we explore all means of development and fiscal responsibility including:\nExpanding the Ahearn Fund\r\nOur National Fund for Student-Athlete Excellence will continue to grow by proactively exposing its mission to new potential members like recent graduates, alumni and friends, former student-athletes, season ticket holders and other K-State fans. We will continue to creatively enhance membership growth and retention by appropriately stewarding existing members through personal contact, membership benefits and other engagement activities.\nCollaborating with Strategic Partners\r\nWe are proud to operate with several long-term strategic partners in areas like apparel, concessions, licensing, media rights and more. We will seek creative opportunities to drive additional revenue through these present agreements, as well as look for new avenues of financial sustainability by way of partnership negotiations and new, unique affiliations.\nDelivering Facilities Improvements through Philanthropic Campaigns\r\nWe are committed to strategic fundraising in order to complement our annual fund efforts and deliver world-class facility improvements for each of our sport programs. The timeliness of executing these projects will be assisted through cultivating leadership contributions from individual donors, families, foundations and corporations.\nManaging Resources Responsibly and with Transparency\r\nWhile raising revenues is critical, how those resources are utilized and managed have a tremendous impact on the financial health of the department. We will meet current debt payment requirements by maintaining a balanced budget and remain steadfast to operating with sound fiscal judgment that includes responsible spending and investment. We will be open and transparent in communicating the details of our financial operations.\nSeeking and Evaluating Ancillary Revenue and Non-Traditional Opportunities\r\nWe will look to participate in new activities that expose the K-State brand to a broader audience through community events, entertainment, and revenue generating competitive opportunities.\n\n\n\n\n\n\nEncourage Diversity and Inclusiveness with All Student-Athletes, Coaches and Staff\n\n\n\nWe will focus on department-wide initiatives that actively promote an inclusive and diverse community through educational programming and support of all populations. Our collective efforts will include:\nIncreased Cultural Competency\r\nWe will make a concerted effort to provide relevant presentations and training on an annual basis to our student-athletes, coaches and staff. Diversity and inclusion education will be included in student-athlete orientations and new staff training and department all-staff programming. Our department will continue building on the existing relationships with the campus’s academic and social multi-cultural student groups and the International Student Center, and we will continue to embrace our leadership role in participating in multi-cultural programming and events.\nRecruitment and Retention\r\nWe will actively and intentionally recruit a diverse student-athlete population. In addition, we will be diligent in our efforts to recruit a broad set of applicants for department staff and coaching positions, including using department personnel and national resources to create diverse hiring pools.\nIdentification of Resources and Support for All\r\nTo provide a rewarding student-athlete experience, campus and department resources will be readily available to support all populations. We will also provide and promote professional development opportunities for coaches and staff through various intercollegiate organizations.\nEncouragement of International Student-Athletes\r\nWith student-athletes from more than 20 countries around the world, we recognize the importance of acclimating to a new country and to a different environment. We strive to make the transition seamless from providing appropriate resources to exposing the cultures of the student-athlete to the broader community.\n\n\n\n\n\n\nCultivate and Promote an Atmosphere of Compliance\n\n\n\nWe are committed to integrity in compliance and will adhere to following these principles:\nInstitutional Control & Head Coach Responsibility\r\nKansas State University is committed to maintaining institutional control by promoting a culture of compliance that emphasizes the shared responsibility among all staff members and student-athletes. Each staff member and non-staff member promoting the athletic interests at Kansas State University has the responsibility to ensure that they are acting in compliance with all NCAA, Big 12, and University requirements. All individuals shall understand their obligation to report any potential violations. Head coaches shall promote an atmosphere of compliance in their programs, communicate to their staff about the importance of compliance and monitor the activities of their staff members.\nTraining and Education\r\nWe will take reasonable steps to provide regular and effective rules education by communicating applicable regulations, policies and procedures to all staff, student-athletes, donors and fans. Various methods of delivering educational resources will be utilized.\nReasonable Policies and Procedures\r\nDepartment policies and procedures will be continually evaluated for effectiveness as well as to ensure that they are compliant with federal and state laws and NCAA, Big 12, institutional, and departmental rules and regulations. Policies and procedures will be implemented or updated appropriately and made readily available to all staff. We will take seriously our obligation to regularly educate department personnel on anti-discrimination and whistleblower protection policies.\nCommitment to Compliance\r\nThe President is responsible for the overall administration of the institution, which includes the athletic department. The director of athletics will exercise oversight of the compliance program and delegate authority to the compliance staff, which shall be appropriately supported and empowered to fulfill their obligation of administering an effective and ethical compliance program. At K-State, we are “Family.” Our bond envelops our students, coaches, staff, alumni, donors and fans.  The connection is constant, as we are linked from the time we are together on campus and always thereafter. We strive to recruit students, coaches and administrators who are of the highest moral CHARACTER. We embrace DIVERSITY, push INNOVATION, and seek EXCELLENCE while emphasizing the significance of acting with HONESTY and INTEGRITY.  A K-Stater understands that COLLABORATION, community ENGAGEMENT and HARD WORK lead to perseverance and success throughout life. Supporting our student-athletes in their pursuit of a top-level education, and providing them the resources and experiences necessary for success after college, is our ultimate priority.  We will: Support Students Academically\r\nWe will be steadfast in providing access to proper academic resources and connection to our campus partners.  We will focus on retention of student-athletes and their progress toward timely degree completion, with additional focus on minority and first generation students.  We will dedicate resources to academic learning spaces, academic counseling staffs, specialized learning programs and technology upgrades to enhance the overall educational experience of all student-athletes. Enhance Skills for the Future\r\nWe will foster the development of our student-athletes to ensure a well-rounded college experience and successful transition to life after sport.  Evaluation of staffing and resources will occur on a regular basis, with emphasis placed on the continued growth of our career development programming.  We will create a comprehensive plan to guide personal, professional and leadership development from the time student-athletes step on campus to the time they graduate. Focus on Student-Athlete Well-Being\r\nWe will invest in the emotional well-being of our student-athletes.  We will enhance programming for mental wellness, sexual violence prevention awareness, transition to college and social issues – providing forums and better communicating available resources to our student-athletes. Celebrate Student-Athlete Success\r\nAppropriate benchmarking measures will be used to evaluate student-athlete support resources, staffing and programming for the overall success of the student-athlete.  This information will allow us to be intentional with our programming to prepare student-athletes to be great representatives of K-State, as well as equip the department to provide compelling content that tells each student-athlete’s story. Our goal for every sports program is to compete for Big 12 championships and to qualify for, compete and advance in the post-season. In order to accomplish this, we will: Recruit and Retain Top Student-Athletes\r\nWe seek to recruit student-athletes, who are incomparable competitors on the playing fields and who personify our values. Student-athletes at K-State are special and we will work tirelessly to support their educational and athletic goals. We will showcase student-athlete success, the accomplishments of the Athletics Department and the University, and the charm and positive experience of living in the “Little Apple” through multi-platform distribution of robust recruiting content. Hire and Retain Top Coaches\r\nWe will strive to employ the most qualified coaches, who will work tirelessly to bring out the best in our student-athletes. They will embody our commitment to having winning programs without sacrificing our integrity, or the welfare of our student-athletes. We will provide our coaches with competitive salaries and benefits, while giving each coach the support necessary to reach the highest level of success. Maintain the Highest Quality Facilities and Equipment\r\nAs we construct new athletic facilities, we will continue the tradition of creating state-of-the art buildings that will help our student-athletes attain optimal results. In addition, we will pursue the use of cutting-edge technologies to enhance training and maximize achievements in competition. Emphasize Student-Athlete Performance, Health and Safety\r\nWe have dedicated nutritionists, certified athletic trainers, equipment staff and strength and conditioning coaches to support our student-athletes. We will continue to evaluate our student-athletes' needs on a consistent basis to ensure that they are receiving the resources needed to improve their performance and compete at the highest level. We strive to create the Best Fan Experience in the Big 12 by providing a game-day environment that is safe, welcoming, engaging, entertaining and unique. Our daily interactions will focus on serving fans, donors, alumni and friends with an exceptional customer experience through accessibility and transparency in communication with the department.\n\nServe the K-State Family\r\nWe will offer a wide range of access to all members of the K-State Family, including value ticket pricing options, creative experience packages and a welcoming game day-atmosphere. We will make it as easy as possible for fans to interact with athletics staff and to attend games. We will utilize fan feedback to make data-based improvements and share these improvement plans with the K-State Family. Engage with K-State Students\r\nWe will develop innovative plans, collaborating with key campus partners, aimed at remaining at the forefront of cultural trends specific to the college student demographic. We will create connections and deliver lasting memories between K-State students and student-athletes, coaches and staff. We will place an emphasis on retention of students throughout their collegiate journey and relationship development to convert graduates into long-time ticket-holders and donors. Evolve the Game Day Experience\r\nWe will invest in technology, facilities improvements and entertainment to differentiate the K-State experience from other entertainment options and to create efficiencies in fan experience services like ticketing, parking, concessions and merchandise purchases. Elevate the K-State Brand\r\nWe proudly embrace the responsibility of building the K-State brand throughout the state of Kansas, nationally and internationally. Expanding the reach of our digital content will occur through sharing the stories of our student-athletes’ academic and athletics achievements. Our staff will be built with talented individuals, who will be prepared to capitalize on team accomplishments. K-State Athletics values every department member. We recognize each person plays a unique role in achieving our short and long-term goals. We will operate with four critical tenants:\n\nTransparency and Execution of Vision\r\nWe will continue to improve the communication, interaction and cooperation between athletics administration, department heads, coaches, staff and student-athletes to enhance the overall academic and athletic experiences of our student-athletes. Live Our Mission: Make ‘Family’ Matter\r\nWe will uphold an environment in which coaches and staff feel supported, respected and enjoy coming to work every day. We will be known as a department in which employees desire to work and student-athletes are able to thrive and reach their goals. We will provide regular programming aimed at creating collaborative and supportive relationships among staff Employee Support\r\nWe will strive to maintain competitive salaries and benefits while remaining fiscally responsible. Orientations and training sessions will be reviewed to ensure that employees have the information and resources needed to be successful, and all coaches and staff will receive annual feedback through supervisor evaluations. Provide Professional Development\r\nWe will encourage staff to be ambassadors locally, regionally, and nationally and pursue development opportunities in their field. We will share the accomplishments of our staff with the K-State Family and promote staff externally for national awards. In order to preserve our leadership role in the Big 12 and intercollegiate athletics, it is critical that we explore all means of development and fiscal responsibility including: Expanding the Ahearn Fund\r\nOur National Fund for Student-Athlete Excellence will continue to grow by proactively exposing its mission to new potential members like recent graduates, alumni and friends, former student-athletes, season ticket holders and other K-State fans. We will continue to creatively enhance membership growth and retention by appropriately stewarding existing members through personal contact, membership benefits and other engagement activities. Collaborating with Strategic Partners\r\nWe are proud to operate with several long-term strategic partners in areas like apparel, concessions, licensing, media rights and more. We will seek creative opportunities to drive additional revenue through these present agreements, as well as look for new avenues of financial sustainability by way of partnership negotiations and new, unique affiliations. Delivering Facilities Improvements through Philanthropic Campaigns\r\nWe are committed to strategic fundraising in order to complement our annual fund efforts and deliver world-class facility improvements for each of our sport programs. The timeliness of executing these projects will be assisted through cultivating leadership contributions from individual donors, families, foundations and corporations. Managing Resources Responsibly and with Transparency\r\nWhile raising revenues is critical, how those resources are utilized and managed have a tremendous impact on the financial health of the department. We will meet current debt payment requirements by maintaining a balanced budget and remain steadfast to operating with sound fiscal judgment that includes responsible spending and investment. We will be open and transparent in communicating the details of our financial operations. Seeking and Evaluating Ancillary Revenue and Non-Traditional Opportunities\r\nWe will look to participate in new activities that expose the K-State brand to a broader audience through community events, entertainment, and revenue generating competitive opportunities. We will focus on department-wide initiatives that actively promote an inclusive and diverse community through educational programming and support of all populations. Our collective efforts will include: Increased Cultural Competency\r\nWe will make a concerted effort to provide relevant presentations and training on an annual basis to our student-athletes, coaches and staff. Diversity and inclusion education will be included in student-athlete orientations and new staff training and department all-staff programming. Our department will continue building on the existing relationships with the campus’s academic and social multi-cultural student groups and the International Student Center, and we will continue to embrace our leadership role in participating in multi-cultural programming and events. Recruitment and Retention\r\nWe will actively and intentionally recruit a diverse student-athlete population. In addition, we will be diligent in our efforts to recruit a broad set of applicants for department staff and coaching positions, including using department personnel and national resources to create diverse hiring pools. Identification of Resources and Support for All\r\nTo provide a rewarding student-athlete experience, campus and department resources will be readily available to support all populations. We will also provide and promote professional development opportunities for coaches and staff through various intercollegiate organizations. Encouragement of International Student-Athletes\r\nWith student-athletes from more than 20 countries around the world, we recognize the importance of acclimating to a new country and to a different environment. We strive to make the transition seamless from providing appropriate resources to exposing the cultures of the student-athlete to the broader community. We are committed to integrity in compliance and will adhere to following these principles: Institutional Control & Head Coach Responsibility\r\nKansas State University is committed to maintaining institutional control by promoting a culture of compliance that emphasizes the shared responsibility among all staff members and student-athletes. Each staff member and non-staff member promoting the athletic interests at Kansas State University has the responsibility to ensure that they are acting in compliance with all NCAA, Big 12, and University requirements. All individuals shall understand their obligation to report any potential violations. Head coaches shall promote an atmosphere of compliance in their programs, communicate to their staff about the importance of compliance and monitor the activities of their staff members. Training and Education\r\nWe will take reasonable steps to provide regular and effective rules education by communicating applicable regulations, policies and procedures to all staff, student-athletes, donors and fans. Various methods of delivering educational resources will be utilized. Reasonable Policies and Procedures\r\nDepartment policies and procedures will be continually evaluated for effectiveness as well as to ensure that they are compliant with federal and state laws and NCAA, Big 12, institutional, and departmental rules and regulations. Policies and procedures will be implemented or updated appropriately and made readily available to all staff. We will take seriously our obligation to regularly educate department personnel on anti-discrimination and whistleblower protection policies. Commitment to Compliance\r\nThe President is responsible for the overall administration of the institution, which includes the athletic department. The director of athletics will exercise oversight of the compliance program and delegate authority to the compliance staff, which shall be appropriately supported and empowered to fulfill their obligation of administering an effective and ethical compliance program. Thanks for visiting ! The use of software that blocks ads hinders our ability to serve you the content you came here to enjoy. We ask that you consider turning off your ad blocker so we can deliver you the best experience possible while you are here. Thank you for your support! ",
    "title": "\r\n\tMission, Values, Vision - Kansas State University Athletics\r\n",
    "url": "https://www.kstatesports.com/sports/2018/7/2/mission-values-vision.aspx"
}