{
    "text": "Mobility platforms are evolving into mobility-as-a-service (MaaS) for connecting every vehicle beyond car sharing and hailing. For example, more and more services are being launched so that travel route input on a smartphone leads to suggestion of optimal options covering taxis, bicycles and electric kickboards as well as airplanes, buses and subways and even reservation and payment can be made at once. The concept of MaaS took its first shape in Finland, where the Whim service was launched in 2016 for interconnection between every public transport component and mobility. Last year, Uber linked itself to public transport by launching Uber Transit. In South Korea, it is Kakao that is leading the trend. Kakao Mobility and Korea Railroad Corporation signed a business agreement for mobility platform-based railway services on Jan. 30. According to their plan, the Kakao T application will provide real-time train ticket reservation and the application’s parking service will be linked to train station parking lots run by the corporation. Earlier, in December last year, Kakao concluded a similar business agreement with Korean Air so that plane ticket search, payment and boarding can be done on its single mobile platform. Kakao’s subsidiary Kakao Pay is already running a simple payment system, which means the company is about to enter the MaaS market.\n\r\nTada, in the meantime, recently said that it would link public transit to its service in the mid- to long term. KST Mobility, which is running Macaron taxis, is working on MaaS as well. KST Mobility launched a pilot demand responsive transport (DRT) service with 12-passenger vans in Seoul on Feb. 14 and is working with NHN Payco for simple payment. The evolution across the world is because it is an effective way of reducing traffic congestion by reducing the number of privately owned cars. In Finland, the use of public transit has jumped from 48 percent to 74 percent and the use of privately owned cars has halved to 20 percent since the launching of Whim. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Mobility-as-a-Service Gaining Traction in South Korea - Businesskorea",
    "datetime": "2020-02-18T09:31:48+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=41450"
}