{
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, visit My Profile, then View saved stories Follow us By Taylor Glasby “Our dream was to be able to stand on a big stage. But we didn’t have any idea of how this would evolve,” says 25-year-old vocalist Minhyuk, one-seventh of the Korean pop group, Monsta X. They burst onto the K-pop landscape in 2015 and have since chalked up three albums, six EPs and hundreds of millions of YouTube views and Spotify streams. Wembley Arena is precisely the big stage their sound demands. On a sweaty July evening, rappers IM and Joohoney, and vocalists Kihyun, Hyungwon, Shownu, Wonho and Minhyuk hype a London audience into a roaring mass of adrenaline with two hours of sophisticated earworms (“Dramarama”) and EDM-laced bangers (“Hero”), all replete with complex choreography. This is K-pop at its high-octane best – immaculate showmanship balanced by a deeply forged connection between stars and fans, pulling everyone into its embrace. Coinciding with their 19-date, five continent-spanning We Are Here tour is a recently inked deal with Epic Records. English-speaker IM, the youngest at 23 and with a sharp sense of humour, calls the signing an “honour”, a sizeable opportunity to ascend to bonafide global stardom. K-pop’s boy and girl groups have been popular, although niche, outside of Asia since the late noughties. But as acts such as BTS and Blackpink storm into the mainstream, the Western music industry is rapidly opening up to the Korean wave, something unthinkable as little as two years ago. Contrary to widespread belief that it’s a self-contained genre, K-pop is an umbrella term for an entire industry, producing everything from bubblegum pop to future bass, trop to trap. Monsta X have marked their turf with a mash-up of hip hop, elastic pop melodies and tactile R&B, such as their latest single, “Who Do U Love (ft French Montana)”, which, Hyungwon – tall, fine-boned, sounds as if he’s battling the onset of a head cold – says “is a song that doesn’t care what genre it belongs to. It exists the way it is.” “In terms of putting on a show, yes, that’s common for all K-pop groups, but we convey a very specific message,” says 24-year-old Joohoney, whose staccato rap can dart from coy to combative in a single line. “We’re telling the world that no matter what, we do what we have to do. We stick to our motto and I think that appeals.” Monsta X nod in unison at that. They frequently agree with each other. Having gone through the rigorous vocal, dance and stage training that all K-pop idols undertake before debuting in a group, living together for years and working incessantly to get where they are, they've become tight knit – a family. Shownu, the group’s calm 27-year-old leader, is adamant that despite their familiarity, they continue to “learn a lot from each other. We grow together,” he says. “This is the way we are. This is the way we live.” Just like family, they’re also prone to ribbing each other mercilessly. Ask Monsta X’s resident songwriter, Wonho, if he’s inspired by his bandmates and his mouth twitches. “Only a little bit,” he replies, utterly blasé, making the others smirk. He’s not, Minhyuk points out dryly, “It’s always by Monbebe [the name of their fanbase].” Off stage, they’re dressed in sneakers, tees and jeans. They drink iced Americanos: it keeps them alert through their packed schedules. Wonho (owner of one of K-pop’s most envied physiques, which he maintains with daily two-hour workouts), who teasingly strips down to his trousers nightly onstage, perches solemnly in his chair. There's a distinct lack of ego and they never fail to make eye contact when speaking. They're so lowkey it's easy to address them as you would a friend you haven't seen in months. It’s a 180 degree turn from the Monsta X of stage and screen, where they emanate a taut, powerful and grown-up sexiness, accentuating it with smokey eye make-up, embellished jackets, chokers and leather trousers, like a cross between Mötley Crüe and Jim Morrison. For their 2018 single “Jealousy”, they wore bondage-style leather harnesses under double-breasted suits. It was sensual, provocative and divisive but Monsta X have developed a proud ownership of their duality. By Adam Cheung By Jack King By Jack King Hyungwon points out that, “We’re stage performers, so I like wearing something that shines from head to toe.” For IM, “Wearing a harness is just to express our song concept. Showing the audience what we want to show is the most important thing. We’re not ashamed. We’ve done a lot of sexual items, like harnesses and chains. We’re comfortable.” Although K-pop’s male groups still have predominantly female fanbases, it doesn’t take much effort to find male Monsta X fans discussing them on Twitter, often with the same fervency that marks a Marvel fanboy. Kihyun sees no difficulty in attracting male fans. “It’s the same way when you see a good-looking actor on screen,” he says. “You can say, ‘Wow. That’s a good-looking guy.’ And that’s how you become a fan.” K-pop might be marching into Western culture, where performative and gender-defying pop and rockstars have long been cultural icons, but male K-pop artists still receive an avalanche of hate about their race and perceived lack of masculinity. Monsta X know this is out there. They’re utterly unfazed. Minhyuk raises an eyebrow: “I don’t think the world appreciates things in the right way, in my opinion.” “What is masculinity these days?” muses IM. “I think it’s really hard to define it, overall. Everyone has their own meaning.” But, for argument’s sake, where does your own sense of masculinity come from? IM pauses for a long moment. “Having a dick,” he says bluntly, sipping coffee as his bandmates’ jaws drop and shocked laughter ripples around the table. It’s rare to see this kind of candour in a K-pop idol. “But, you know, it’s also about loving yourself, caring about yourself. That’s first. And we don’t think that women should be like ‘this’ and men should be like ‘that’,” he adds. For Joohoney, narrow-mindedness deserves only to be ignored: “People talk about masculinity and femininity but, at the end of the day, Monsta X is there to perform a show and we don’t let that affect us,” he smiles. “We do what we’re good at.” Follow us on Vero for exclusive music content and commentary, all the latest music lifestyle news and insider access into the GQ world, from behind-the-scenes insight to recommendations from our Editors and high-profile talent. Is it weird to be a man who loves K-pop girl bands? BTS fans on what the group means to them Santi is the singer-rapper bringing Nigeria's alté scene to the mainstream By Tshepo Mokoena By Adam Cheung By Rosecrans Baldwin By Josiah Gogarty By Lauren Larson By Lucy Ford By Sam Parker By Hannah Ewens See More Stories Condé Nast Britain © 2023 Condé Nast ",
    "title": "Monsta X London: the K Pop band talk world domination and destroying masculinity | British GQ",
    "datetime": "2019-07-25T05:00:00.000Z",
    "url": "https://www.gq-magazine.co.uk/culture/article/monsta-x-london"
}