{
    "text": " Profile Sections tv Featured More From NBC Follow NBC News A man arrested in the killing of a Baltimore tech entrepreneur was suspected of raping a woman days before and was already under surveillance, police say September 28, 2023, 12:24 PM Michael Gambon, the actor best known for playing Dumbledore in the 'Harry Potter' films, dies at 82 September 28, 2023, 8:02 AM Morning Rundown: Biden impeachment inquiry's first hearing, Powerball jackpot nears $1 billion, and Kansas City's love story with Taylor Swift September 28, 2023, 7:36 AM U.S. soldier Travis King arrives back on American soil after being expelled from North Korea September 28, 2023, 4:04 AM Remains found in Colorado are identified as Suzanne Morphew, a mom who disappeared in 2020 September 27, 2023, 5:54 PM The mother of a man suspected of killing a Baltimore tech CEO urged him to surrender, fearing police would try to kill him September 27, 2023, 2:37 PM When life hands you lemons, you make lemonade. When Canadian 7-year-old Quinn Callender, of Maple Ridge, British Columbia, decided to launch a lemonade stand and a crowdfunding campaign to help his friend Brayden Grozdanich get an expensive surgery, he never could have expected the overwhelming response he received. Grozdanich, who has cerebral palsy, has been undergoing painful physiotherapy to help him walk, but he now needs surgery to allow him to walk without braces, a surgery only available in New Jersey, his father told the CBC. That's when Callender stepped in. With the help of his parents, social media and a little water, lemon and sugar, 'My Buddy Brayden' was launched. On Sunday, the two boys manned the lemonade stand outside a local grocery store, and needless to say the refreshing drink (and the cause) was a hit. As of Monday, the campaign has already surpassed its $20,000 goal and raised over $48,000. Hi my name is Quinn, and this is my buddy Brayden.We are both 7 years old. We go to the same school and we are in Beaver Scouts together. Brayden has Cerebral Palsy, this makes it challenging for him to walk well because his muscles are very tight. Sometimes he can't keep up with the rest of the other Beavers and he falls down a lot. Brayden get's daily physio therapy to keep him walking. Sometimes it really hurts him. When I was at his physio, I tried to keep Brayden calm when he was in pain. My Mom told me Brayden is going to have a special surgery to help release the muscle tightness and spastic action. The surgery is not done here in Canada, only in the USA. Brayden and his Mom will be travelling there in August for the operation. Since the surgery is not done in Canada, Braydens Mom and Dad have to pay for it. The surgery will cost $20,000. Please help me raise money to help my friend Brayden, he is a really good guy.Thank you Love Quinn 'My Buddy Brayden\" official crowdfunding site Maple Ridge, B.C. boy's lemonade stand raising money for friend (CBC) --- Lou Dubois © 2023 NBC UNIVERSAL ",
    "title": "My Buddy Brayden: 7-Year-Old Raises $48K For Sick Friend's Surgery",
    "url": "https://www.nbcnews.com/pop-culture/viral/my-buddy-brayden-7-year-old-raises-48k-sick-friends-n149676"
}