{
    "text": "We are a team of professional management and journalists — one of the best in the Nepali media. Our duty toward our readers is to provide them with impartial news, bold views, in-depth analysis and thought-provoking commentary. We shall do this without fear or favor, and we shall be guided by nothing but our conscience.  7 days ago 9 days ago 9 days ago 15 days ago 16 days ago KATHMANDU, Nov 11: The Embassy of the Republic of Korea in Nepal organized the 2022 Korean Language Contest and Korean Culture Night at Hotel Himalaya on Thursday. According to a statement issued by the embassy, Suresh Adhikari, Secretary of the Ministry of Culture, Tourism and Civil Aviation of the Government of Nepal attended the event. Addressing the event, Ambassador of South Korea to Nepal, Park Chong-Suk said, “Hallyu, the Korean Wave, has become a global cultural phenomenon and Nepal is a country that has shown a particularly strong interest in various Korean cultures. These days people all over Nepal are experiencing and enjoying Korean culture, starting from numerous families watching Korean dramas and movies at home, through more than 100,000 Nepali people practicing Taekwondo, to young people enjoying K-pop music and practicing dance.” He added, “This year we have organized the K-pop World Festival in Nepal in June, the Korean Film Festival in September, the 2022 K-Culture Video Contest last month, and most recently the 2022 Korean Language Speech Contest this afternoon. The 2022 Korean Culture Night is the concluding Korean cultural event to wrap up this fruitful year.” Ambassador Park Chong-Suk also said that Nepali people’s enthusiastic interest in Korean culture will increase in the days ahead as various events are organized every year. “These interests and understanding in Korean culture will become the foundation for strengthening exchanges and cooperation between Korea and Nepal, and further promoting friendly relations between two countries,” he added. The Korean Culture Night is an event to showcase various aspects of Korean culture with the Nepali people organized by the Embassy of the Republic of Korea in Nepal since 2014.  The_Embassy_of_the_Republic_of_Korea_in_Nepal,\n                                                                                            Korean_Culture_Night,\n                                                                                            Korean_Language_Contest, Share on Facebook Share on Twitter - by Republica - by Republica - by Republica - by Republica Copyright 2023 Nepal Republic Media Pvt. ltd, nagariknetwork.com. All right\n                        reserved JDA Complex, Bag Durbar, Kathmandu P.O.Box 19300 mycity@myrepublica.com Phone Online: 01- 4263457 Phone Reception: 01-4265100 ",
    "title": "My City - S Korea Embassy in Nepal organizes 2022 Korean Language Contest and Korean Culture Night ",
    "url": "https://myrepublica.nagariknetwork.com/mycity/news/s-korea-embassy-in-nepal-organizes-2022-korean-language-contest-and-korean-culture-night"
}