{
    "text": "HOT TOPICS Korean-language test to be held up to 8 times abroad in 2024 Korean Red Cross builds temp homes for Turkish quake victims Food Clothing and Fashion Traditional Decorative Knots, Maedeup: Donated Works by Lee Bu-ja Jinju Namgang Yudeung Festival Honorary Reporters Dec 14, 2022 By Honorary Reporter Seema Thomas from India Photos = Screenshots from Korea.net's YouTube  The 2022 K-Wave Festival: Gateway to Korea, was held on Dec. 10 at the Korea International Exhibition Center, aka KINTEX, in Goyang, Gyeonggi-do Province, and livestreamed by the Korean Culture and Information Service (KOCIS) via Zoom and YouTube.  The event included year-end awards ceremonies for both Honorary Reporters and K-influencers and celebratory performances. This was the first time for me to take part in the event via webinar.  My excitement was building since the day before the event as I participated in the rehearsal with other Honorary Reporters. Despite the time differences, we all eagerly waited for the ceremony with our countries' flags, which we were requested to prepare.  The following are my top six moments from the ceremony.  Opening performance of 'Arirang' medleyHonorary Reporter from Mexico and minyo (folk music) singer Nancy Gonzalez has performed numerous times at Korea.net-sponsored events. She was joined by Laure Maro, a pansori (solo lyrical opera) singer from France, in an exquisite gugak (traditional music) performance of an \"Arirang\" medley that highlighted the traditional essence of Korea.  Honorary Reporters live from venueHonorary Reporters reported live at the scene to introduce the attractions at the venue. Ruojing Bai from China showed pavilions representing countries like the Dominican Republic, Kuwait and Colombia and those promoting Korean organizations and events like the National Intangible Heritage Museum and Korea Grand Sale. Ghada Mohamed Ali Elsayed from Egypt introduced the Digital Exhibition of selected works by Honorary Reporters, K-influencers and Talk Talk Korea and the Hall of Fame showcasing the awards for Best Honorary Reporters.  And Jasmin Mikolay from Germany covered the games section, where people could play traditional games like yunnori (four-stick board game) and tuho (arrow throwing) and arcade games like a claw machine from which one could win a cute doll.  Video montage of this year's activities by Honorary ReportersA video montage of the Honorary Reporters' journey since this year's induction ceremony made me proud to be part of this program. It emphasized the tagline \"Gateway to Korea\" as Honorary Reporters, despite differences in nationality and culture, serve as bridges connecting their countries to Korea.   Awards ceremony and acceptance speechesThe best eight Honorary Reporters and two special selections from each language were invited to Korea to attend the festival and receive their awards from Kim Geun-ho, director-general of KOCIS' Overseas Culture Promotion Bureau. The winners shared their experiences and joy and it was motivating to hear how hard they worked over the past year.  Contemporary dance showNext was a powerful and enigmatic dance performance by Choi Kyung-chul, who performed with the K-Culture Caravan. His captivating piece shifted smoothly between fast and slow movements.\n\nRaffle drawing Before the end of the first session, a raffle drawing was conducted for in-person visitors and those taking part in the webinar. Fifteen offline and five webinar participants were chosen to get surprise gifts.\nAfter a very quick hour, another wonderful experience had been etched into my memory. I am grateful to KOCIS for providing such grand ceremonies and encouraging Honorary Reporters to do better.  kalhong617@korea.kr\n\n*This article is written by a Korea.net Honorary Reporter. Our group of Honorary Reporters are from all around the world, and they share with Korea.net their love and passion for all things Korean. Gov't signs first joint statement with S. Arabia in 43 years ",
    "title": "My favorite moments from the K-wave Festival's HR awards event : Korea.net : The official website of the Republic of Korea",
    "url": "https://www.korea.net/NewsFocus/HonoraryReporters/view?articleId=225819"
}