{
    "text": " Students heading to the Northwest Territories to work could soon have an extra $2,000 in their pocket — whether they're from the territory or not. Jackson Lafferty, the territory's minister of Education, Culture and Employment, announced changes to the N.W.T. Student Financial Assistance program Thursday in the Legislative Assembly. \"We are not only engaging with our Northern students, but also encouraging Southern students to take advantage of the opportunities of living in the North,\" Lafferty said in the legislature. One of the most substantial changes is the addition of a $2,000 Northern Bonus, applied to student loan debt, for both local and non-local students who live in the Northwest Territories. Lafferty tied the announcement to the territorial government's population growth strategy, which aims to bring 2,000 people to the N.W.T. over the next four years. The government also announced numerous other improvements to the Student Financial Assistance program, including increasing loan remission rates and reducing the loan interest rate to 0 per cent for N.W.T. students who return North after completing their studies. Funding was also increased for tuition and book costs, and a 20-semester funding limit previously placed on students was removed, instead replaced with a revolving loan limit — meaning that additional funding can be accessed once students pay down their loan. An online application service was also launched on June 1 of this year. Lafferty said the changes will come into effect for the 2015/2016 academic year. Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636 It is a priority for CBC to create products that are accessible to all in Canada including people with visual, hearing, motor and cognitive challenges. Closed Captioning and Described Video is available for many CBC shows offered on CBC Gem.  ",
    "title": "N.W.T. offers $2K towards debt for students returning North | CBC News",
    "url": "https://www.cbc.ca/news/canada/north/n-w-t-offers-2k-towards-debt-for-students-returning-north-1.3101811"
}