{
    "text": "The search warrant that allowed N.W.T. wildlife officers to collect caribou samples from a Łutsel K'e culture camp has been quashed in court. Supreme Court Justice Shannon Smallwood threw out the warrant Monday morning after Larry Innes, the defence counsel for Łutsel K'e Dene First Nation, applied to have it quashed. Neither of the lawyers for the territorial government, Roger Shepard and Maren Zimmer, objected. \"The fact we are here is in itself a problem. This warrant should have never been issued, this search should have never taken place, so we are cleaning up after the fact,\" Innes told reporters after the hearing. The approval for the search warrant to be quashed shows \"vindication\" for Łutsel K'e's position, Innes said. \"They did not contest our application and agreed that the warrant was issued without authority,\" he said of the territorial government. Last month, the First Nation demanded an apology after a \"forceful invasion\" that they described as \"invasive,\" \"aggressive and disrespectful.\" The First Nation said wildlife officers helicoptered into a camp on Artillery Lake on Sept. 13 and spent hours searching family tents and teepees. Wildlife officers were investigating illegal caribou harvesting within a mobile no-hunting zone that follows the Bathurst caribou herd to protect it from hunters. They had found the carcasses of 10 caribou with significant amounts of meat still on them. News of the event, which the First Nation described as a \"raid,\" brought condemnation of officers' actions from other organizations. Dene National Chief Gerald Antoine called for the resignation of officials who directed and supported the search, and Tu Nedhé-Wiilideh MLA Richard Edjericon demanded an apology and investigation. CBC North has requested an interview with Environment and Natural Resources Minister Shane Thompson about the court decision. Shortly after the raid, Thompson issued a statement saying officers had received two independent reports from members of the public about illegal harvesting. Later in the month, the Department of Environment and Natural Resources said it would be seeking an external review of officers' actions. The matter took less than 20 minutes in the territorial courtroom as Judge Smallwood listened to the submission. Territorial lawyer Shepard said any samples seized during the search would be forfeited and any person wishing to obtain their seized caribou can go through the Wildlife Act. Now that the search warrant has been \"declared unlawful\" in court, Innes said there will be discussions in the community on what happens next, hinting at civil pursuits. \"Next step is looking at civil remedies — effectively a lawsuit against the minister for having invaded the privacy and violating the rights of the people at camp,\" he said. If the First Nation was to proceed with the lawsuit, which the defence lawyer said he thinks there are strong grounds for, they could seek damages for breach of individual privacy, sense of security and cultural dignity. Current affairs reporter Jenna Dulewich is a journalist with CBC North. She joined the team in Yellowknife in 2020, after a career in print journalism in southern Alberta. In 2017, she was awarded Excellence in Rural Reporting from News Media Canada for her reporting on the lack of emergency shelters in rural Alberta. In 2020, she won the Emerging Indigenous Journalist Award from the Canadian Association of Journalists. Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636 It is a priority for CBC to create products that are accessible to all in Canada including people with visual, hearing, motor and cognitive challenges. Closed Captioning and Described Video is available for many CBC shows offered on CBC Gem.  ",
    "title": "N.W.T. Supreme Court quashes search warrant for Lutsel K'e culture camp | CBC News",
    "url": "https://www.cbc.ca/news/canada/north/lutsel-ke-culture-camp-warrant-quashed-1.6627472"
}