{
    "text": "Fresh off a state legislative session that saw $1.5 billion devoted to early-childhood education statewide over the next five years, New York City is barreling ahead with its plans to use its sizable portion of the state aid to offer full-day prekindergarten to thousands more city 4-year-olds. But while the city is pushing hard to enroll 53,000 full-day preschoolers as of the 2014-15 school year—to the praise of early-education advocates—some observers also are offering cautions about whether other parts of the state are as prepared to make use of their shares of this year’s $340 million in funding for pre-K. And other education priorities of first-year Mayor Bill de Blasio—such as promises to expand after-school programs and to look more critically at charter schools’ space-sharing arrangements with regular public schools—were undercut by legislative action. New York City charter schools, in fact, ended up with are some of the strongest protections in the country. And no money earmarked specifically for after-school activities was included in the 2014-15 state budget measure. Mr. de Blasio, a Democrat who took office in January, originally had proposed taxing the city’s high earners to pay for the preschool expansion. That idea never got traction in the legislature. But the mayor has been nothing but positive about the outcome of the state budget deal, which will bring the city $300 million in 2014-15. The city has already launched a media blitz aimed at getting parents to enroll more 4-year-olds in the city’s program, which now has about 20,000 full-day-preschool seats. Early-education proponents in the city said they were thrilled about the new money. “We’ve been waiting more than 15 years for this day,” said Randi Levine, the project director of the Early Childhood Education Project, an initiative of Advocates for Children of New York.  In 1997, state lawmakers passed legislation to provide a half-day of pre-K for all 4-year-olds, but the state has never devoted enough funding to achieve that goal. Last year, the state created a $25 million competitive-grant program that districts could access for pre-K, but that money was “woefully insufficient” for the city, Ms. Levine said. Nancy Kolben, the executive director of the Center for Children’s Initiatives, in New York City, and a member of a pre-K working group that Mr. de Blasio created last year soon after he was elected, said that the money can now be used to get the city closer to the universal-access target. “This will allow us to do a colossal expansion this year,” Ms. Kolben said, with the goal of having more than 70,000 preschool slots available in 2015-16. “The city has been doing a very good job in looking at where is the unmet need is, and also doing a lot of outreach to the more challenging-to-reach population, such as the immigrant population.” But while New York City is moving ahead quickly, other districts in the state may not be as prepared to take advantage of the $40 million for preschool outside the city—also part of the budget agreement. The newly approved funding, like the $25 million devoted to preschool in 2013, is set up as a competitive-grant program. But while New York City has the financial resources to move ahead and wait for the state to set up a system for evaluating grant applications and rolling out reimbursements, cash-strapped districts around the state may not have the money, said Lauren J. Tobias, the director of policy for the Schuyler Center for Analysis and Advocacy. That Albany-based organization works to improve the welfare of needy children and families. “School districts don’t feel that this is funding that’s reliable or easily accessible for them,” Ms. Tobias said. “I am hopeful we are going to see more kids in pre-K in New York City. I am less confident that any other school district will be able to get started until the state is ready to go.”  Another concern for advocates is that the state will reimburse at a higher rate for preschool classrooms headed by certified teachers. Community organizations that provide preschool might have a harder time than school districts in getting certified teachers, a situation that may lead to funding disparities, said Ms. Levine of the Early Childhood Education Project. “That concerns us,” she said. “Sometimes the vulnerable [child] population is more likely to be served by community organizations.” Charter school supporters in the city were also left with something to cheer with the new protections offered by the state. As part of the budget agreement, charter schools in New York City will not have to pay rent if they are housed, or co-located, in district-owned facilities. Effective April 1, any change to a charter school’s co-location agreement must be approved by the school itself before the alteration can move forward. “We definitely think that the budget deal is a significant step forward for New York City charters and the student and families that they serve,” said Nina Rees, the president and chief executive officer of the Washington-based National Alliance for Public Charter Schools. Having the state step in to craft such legislation for a district is unusual, “but hopefully also something that other states will emulate without waiting for a district to pull back on facilities,” added Ms. Rees.  The deal was a political defeat for Mayor de Blasio, however. In February, the mayor rescinded so-called co-location agreements for three charter schools, including one that was already in operation, sparking protests from the charter school community. New York City charter schools aiming to open or expand after April 1 must receive a district-provided space, or the city will be required either to pay the cost of the lease of a privately owned facility or to allocate an additional 20 percent in per-pupil funding. The budget requires that the city provide lease aid up to a total of $40 million; after that, the state and district would split the cost 60-40. In addition, the legislative deal modified the per-pupil funding formula for all charter schools in New York state. Instead of the original formula, charter schools will now receive an additional $500 in funding per student over the next three years. The state will reimburse districts for those extra funds. In New York City, the increase will raise the per-pupil amount for charter schools from the current $13,527 to $14,027 over the next three years, representing a fairly negligible difference between the per-pupil funding increases the charter schools in the district would have received under the previous formula and the new funding formula. But in other cities—notably, in Buffalo and Rochester—the new per-pupil funding amounts for charter schools are significantly less than what they would have been had the original formula remained intact, said Bill Phillips, the president of the Northeast Charter Schools Network, an advocacy group for such schools in New York and Connecticut. “The ability to keep [charter schools] growing in New York City was absolutely critical, but we paid a very high price for that,” he said. Under the new formula, charter schools in Buffalo are expected to receive about $1.5 million less in funding next year, and charter schools in Rochester are expected to receive about $2 million less in per-pupil funding.  “Frankly, it borders on tragic for those two cities,” said Mr. Phillips. “We’ve essentially created two different classes of charter schools.” In addition, the deal does little to help the 40 percent of charter schools in New York City that are already located in privately owned facilities, he said. Lease aid is applicable only to new and expanding charter schools, not those now paying rent in privately owned spaces. The United Federation of Teachers, the New York City teachers’ union, criticized the budget deal. The deal favors charter schools and treats regular public school students as “second-class citizens,” according to UFT President Michael Mulgrew. The state deal also does not devote any money to after-school programs in New York City, another project of Mayor de Blasio’s. An earlier proposed funding plan would have taxed the city’s high earners to pay both for preschool and for after-school programs. The tax proposal has been shelved for now, which leaves no new revenue source for after-school expansion. Gov. Andrew Cuomo, a Democrat, had also proposed devoting $160 million in the budget to pay for after-school programs for 100,000 students around the state. City officials say they still plan on adding new after-school programs in the 2014-15 school year. While the state did not allocate dedicated funding for after-school programming, it did increase annual school aid for New York City by $430 million this year, bringing total state aid to $8.7 billion, and the city can use as much of that money as it wants to expand after-school initiatives. The city will announce how much it will allocate to after-school expansion when it releases its executive budget in about a month.  Currently, New York state spends about $57 million a year—about 35 percent less than it did before the recession—on after-school programming that serves some 50,000 to 60,000 students, according to Nora Niedzielski-Eichner, the executive director of the New York State Afterschool Network. Ms. Niedzielski-Eichner said the budget deal is a letdown. “New York has always invested in after-school, but what the governor had proposed was on a whole different scale,” she said. “He was talking about creating a real statewide after-school system. We were feeling we were on the cusp of something that would start to address the needs of students and families here, so it’s very disappointing that it did not end up in the final budget.” Contributing Writer Samantha Stainburn contributed to this story.A version of this article appeared in the April 16, 2014 edition of Education Week as N.Y.C. Hustles to Make Use of Pre-K Windfall From State ",
    "title": "N.Y.C. Hustles to Make Use of Pre-K Windfall",
    "datetime": "2014-04-07T15:57:06",
    "url": "https://www.edweek.org/policy-politics/n-y-c-hustles-to-make-use-of-pre-k-windfall/2014/04"
}