{
    "text": "since 2001 Write down the name of the fashion label, Naim K. Qasim. Though it has been around for about a decade, the designer by the same name has recently taken a bolder step into the spotlight. The 37-year-old soft-spoken artist just headlined a prominent fashion exhibition in Tel Aviv — Night in the House of Fashion: The Cutting Edge of Israeli Fashion Art & Design – showcasing creations by some of Israel’s top designers as well as artists from across the world. Spread the Word• Email this article to friends or colleagues• Share this article on Facebook or Twitter• Write about and link to this article on your blog• Local relevancy? Send this article to your local press Trained at the Shenkar College of Engineering and Design, until now Qasim has focused his talents in his home community of Tira, an Arab city in central Israel. He says he is known for the way he cuts dresses, his use of layers and his work with traditional elements. People come from all over to be custom-fitted for one of his unique designs. “I always take inspiration from my community, my day-to-day life,” he tells ISRAEL21c over coffee at the Tel Aviv Port. “When I connect with these sources, I feel more complete and connected to myself. Then I can tap into my inner thoughts and manifest them through creative art.” Though never instructed by his farmer parents to take a specific profession, Qasim says his choice for a fashion career raised eyebrows in the religious Muslim community in which he was raised. His family, he says, supported him throughout his journey. “If it wasn’t for my family, I wouldn’t be who I am today,” he says. What’s in a name Qasim never dreamed of becoming a fashion designer. One of nine children – he has six sisters and two brothers, one of them his twin – Qasim says he tried to drop out of high school because of boredom but his father wouldn’t allow it. Upon graduation, he set about finding a job he liked and tried his hand at carpentry, hair styling, as a gas station attendant, in construction, and as a warehouse stocker. “There was no guidance counselor back then,” he explains. It was a television show on the use of virtual mannequins that piqued his interest in the fashion world. So he applied to Shenkar. “I loved it there. It was a journey for me, a celebration,” he says. In 2001, with two local prizes for outstanding designs and an honors certificate from one of the world’s premiere fashion schools, Qasim headed to New York with big ideas and oodles of enthusiasm. Within his first few days on American soil, he interviewed with Israeli-American luxury fashion designer Elie Tahari in the hope of securing an internship, he recalls excitedly. But on his fifth day in New York, September 11, al-Qaeda wiped out any chance he had of learning the ins and outs of the fashion industry. “The attacks changed my design plans,” says Qasim. He knew that his name was a major problem. “Today, when you hear my name you think ‘fashion designer.’ Today I’m known,” he says. But in 2001, the budding designer was repeatedly connected to Sheikh Naim Qasim, the deputy secretary-general of Hezbollah. One-of-a-kind patterns His lost opportunity of a design internship did not stop Qasim from opening his first studio in his family’s Tira home in 2002, after turning his time in the US into a six-month holiday. To separate himself from the other infamous Naim Qasim, however, he named his brand Naim K. Qasim (the “K” is for Khalil, his middle name). He describes his creations as a mash-up of traditional Arabic styles with the modern world. He says he’s not interested in copying whatever is trending in New York or Paris or Milan but rather “takes ideas, rips them apart and builds them again.” Qasim’s works are designed for the women he dresses. “A person’s life is made of layers. Our skin is made of layers; there are layers of society, layers of religion. Our clothes are also layers. We live in layers,” he explains. “I try to express different layers of the culture that women go through when covering their bodies.” A few years after opening his studio, he again took time off to learn in other fashion settings. He spent time in Istanbul and Milan before reopening the studio in 2007. Since then he has focused on selling one-of-a-kind pieces to his growing client list. He has also exhibited in museums in Holon and in New York, and happily reveals the secrets he’s learned along the way with student designers. “I’m happy to help with technique, and in the end I learn from them as well,” he says. While most of his business is done from his home studio, Qasim has started to get international attention thanks to his profile on Alhoush.com, the Arab world’s e-commerce portal to contemporary art and design. He is hoping to expand his clientele with the launch of ready-to-wear lines to be sold in stores around Israel. As his participation in Night in the House of Fashion suggests, Qasim is joining the lecture beat to talk about fashion as a tool for change. “Fashion is a culture, a language; it’s not just a dress,” he says, adding that “fashion can get people talking, sharing ideas.” Read more: ",
    "title": "Naim K. Qasim adds new layer to Israeli fashion - ISRAEL21c",
    "datetime": "2013-05-14T00:00:26+00:00",
    "url": "https://www.israel21c.org/naim-k-qasim-adds-new-layer-to-israeli-fashion/"
}