{
    "text": "With Coupang scheduled to go public on the New York Stock Exchange, the nationality of the company is causing controversy again after the Japanese product boycott that started in July 2019. Coupang founder and CEO Bom Kim is a U.S. citizen. The company to go public is not Coupang Korea but Coupang LLC, its parent company that fully owns Coupang Korea. The board of Coupang LLC has 12 members and most of them are Americans. The largest shareholder in Coupang is the Vision Fund of SoftBank. The fund has invested US$3 billion in Coupang and its current shareholding in Coupang LLC is estimated at 37 percent. This is why Coupang is known as an enterprise based on Japanese money. However, the largest investor in the Vision Fund is Middle Eastern sovereign wealth funds. The first Vision Fund was launched in 2017 by the sovereign wealth funds of Saudi Arabia and Abu Dhabi investing 45 percent and 15 percent, respectively. SoftBank accounted for 28 percent and Apple, Foxconn, Qualcomm and Sharp constituted 5 percent. Still, Coupang is defining itself as a South Korean company and clarified this point in Form S-1 it submitted to the U.S. Securities and Exchange Commission on Feb. 12. “We were founded and have grown in South Korea and more than 99 percent of our business is in South Korea,” it said during the boycott campaign last year, adding, “In South Korea, we have created more than 25,000 jobs and our annual payroll is one trillion won.” In the meantime, according to investment banking industry sources, the number of domestic venture capitals and private equity funds participating in the IPO estimated at up to 55 trillion won is zero. “We cannot answer because of U.S. SEC regulations,” Coupang said as to the reason for the lack of funds from domestic institutional investors. Startup investors mentioned the size of funding. “It is likely that domestic venture capitals were ruled out because of the scale of funding,” one of them said, adding, “Another possible reason is that the CEO did not need domestic investment from the beginning in that he already started and sold two companies in the United States and is already acquainted with many local investors.” Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Nationality of Coupang Causing Controversy - Businesskorea",
    "datetime": "2021-02-18T09:13:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=60644"
}