{
    "text": "To enjoy additional benefits CONNECT WITH US August 09, 2016 12:00 am | Updated 09:01 am IST - VIJAYAWADA: COMMents SHARE READ LATER Eminent historian Prof. K.N. Panikkar delivering the fourth memorial lecture in remembrance of noted industrialist Chukkapalli Pitchaiah in Vijayawada on Monday. —Photo: V. Raju The concept of nationalism is a 19th century phenomenon and it can’t be linked to specific culture or certain customs and traditions of a particular religion, according to former JNU faculty historian and author Prof. K.N. Panikkar. Delivering a lecture on ‘Nationality and Different Perspectives’, organised by Chukkapalli Pitchaiah Foundation in Vijayawada, he said there cannot be social, cultural or economic nationalism. Prof. Panikkar was speaking on ‘Nationality and Different Perspectives’, as part of the memorial lecture organised by Chukkapalli Pitchaiah Foundation here. On the occasion, Prof. Panikkar was presented with the fourth Chukkapalli Pitchaiah Foundation award, Rs 2 lakh cash prize and a citation marking the 88th birth anniversary of the late industrialist and humanitarian. Several kinds of nationalism “Our generation had seen the nationalism which was defined as anything that opposes the British Raj. The unifying force was the anti-colonial thought and nothing else. But now we hear about several kinds of nationalism based on religion, region and culture. Such things were the order of the day in countries like Germany during Hitler’s era. Similar things are happening in this country today,” he said. Nationalism has historicity and it has so much to do with struggle for independence and post independence reforms, according to him. One cannot think of achieving nationalism through ideologies and hegemonies associated with one religion or culture in a multi-cultural society in India, he said. Prof. Panikkar said the historical conceptualisation of nationalism by the majority population, i.e., Hindus, needs to be rationalised. The definition of nationalism needs to be understood in the context of factors that unite a wide variety of groups within the country. Dynamic concept Nationalism is a dynamic concept and it has to be rediscovered and re-evaluated from time to time. The national ideologies that existed in the pre-colonial era were completely different from the one that emerged during freedom struggle. The Mughal period and the ones preceding them had different concepts of nationalism altogether, he said. ‘Arrest pseudo-nationalist ideologies’ Speaking on the occasion, retired professor of History from University of Hyderabad Prof. V. Ramakrishna, who moderated the session, said the country’s leadership should arrest such pseudo-nationalist ideologies from spreading to dangerous proportions. “Such false ideologies should be controlled from the beginning. People at the helm, who are responsible for ensuring harmony in the country, should not keep quiet and should act before it’s too late,” Prof. Ramakrishna said. COMMents SHARE BACK TO TOP Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. ",
    "title": "\n\tNationalism can’t be linked to culture: Prof. K.N. Panikkar - The Hindu\n",
    "datetime": "2016-08-08T18:30:00.000Z",
    "url": "https://www.thehindu.com/news/cities/Vijayawada/Nationalism-can%E2%80%99t-be-linked-to-culture-Prof.-K.N.-Panikkar/article14560292.ece"
}