{
    "text": "K-State is a second home to over 23,000 students. Many students hail from other states, countries or continents. Other students have an extensive ancestry right here in the United States. K-State’s Native American Student Association recognizes and celebrates their ancestry. This month, the members are hosting free events on campus to share their heritage. NASA began in the 1970s. It serves as an informational support group for Native American students and anyone interesting in learning about their history and culture. Some members are registered to Native American tribes, some are not, and some have no Native American ancestry. “Right now, we have around 10 active members and five to 10 more inactive members,” said Georgia Perez, NASA adviser and administrative specialist at the K-State Student Union business office.  This month, NASA has helped host two multicultural events and has one planned for the end of the month. On April 1, NASA co-sponsored a showing of “For the Next 7 Generations,” a film about indigenous grandmothers across the world, three of them Native American. The film was also sponsored by the American ethnic studies program, the English and women’s studies departments, and the Flint Hills Wisdom Keepers Foundation. This Wednesday, rain and storms could not stop the Oneida tribal dancers from performing. They were scheduled to dance in Bosco Student Plaza outside of the Union but moved indoors due to the weather. During the lunchtime performance, students gathered to check out what the loud jingling and upbeat tribal music, stopping to watch the dancers move in circular, poised motions. Curt Moon was one of the Men’s Northern Traditional dancers who performed and one of the Oneida tribe’s dance coordinators. Moon said his Oneida Native American heritage plays a big role in his everyday life. “I’m a real traditional guy,” Moon said. “We have four annual ceremonies and I travel to powwows and other dancing or public speaking events throughout the year.” Lorina Crain, undeclared freshman at the University of Washington, attended the performance. She is enrolled in the Paiute tribe and is from the Seattle area. For Crain, her heritage is important, but not a constant focus. “My heritage isn’t a part of my life on a day-to-day basis,” Crain said. “I usually go to powwows in the spring with my family.” The benefits of membership or affiliation do not always come without a price, Moon said. Moon said he sees and hears about negative experiences related to his tribe every day. “The Oneida reservation is close to Green Bay [Wis.], and when we go into big cities, we often get slower service or none at all,” Moon said. “People forget what we’ve been through.”  NASA members have also dealt with similar hardships. “My students feel like outsiders a lot of times,” Perez said. “Often, the students don’t even find NASA until their junior or senior year.” National Native American Heritage Month is traditionally in November, so the K-State NASA group is planning to change its future celebrations to line up with national celebrations. “November is the actual National Native American Heritage Month, so from now on we will celebrate it then,” Perez said. This will present a great opportunity for students and staff to experience the Native American culture, said Michelle Foster, senior in political science and American ethnic studies. Foster is also the multicultural co-chair of Union Program Council. “Since next semester, Native American Heritage Month will be celebrated in November, we get to see the culture twice this year,” Foster said.  NASA is underrepresented at K-State compared to other diversity groups on campus, Perez said. Even though they have been working to recruit new members, they are the only minority on campus that is decreasing — something they hope to change, Perez said.  NASA looks to increase membership and awareness of the organization by mentoring young Native Americans through USD 383, the Manhattan-Ogden school district, and by organizing more service projects and powwows. To recruit new members, current members of NASA and Union Program Council are hosting a booth at All-University Open House on April 20 from 9 a.m. to 3 p.m. They will have a booth set up on the lawn north of the Union with information, craft demonstrations and a fundraiser. For more information on NASA and events, visit k-state.edu/nasa. ",
    "title": "Native American Student Association keeps heritage, culture alive at K-State - The Collegian",
    "datetime": "2013-04-12T04:50:39+00:00",
    "url": "https://www.kstatecollegian.com/2013/04/11/native-american-student-association-keeps-heritage-culture-alive-at-k-state/"
}