{
    "text": "The Natural History Museum of Los Angeles County’s famous fin whale is enjoying a rare quiet morning — one last moment of serenity before its surroundings change completely. The 63-foot whale skeleton, which hung horizontally for more than 60 years in the museum’s original 1913 building, is now suspended in a diving position from the ceiling of the nearly completed Otis Booth Pavilion. This is the museum’s brand-new entrance, a six-story-high, multimedia-infused glass cube filled with sunlight and a view of surrounding greenery. The pavilion is fully tented at the moment, draped in a white curtain hiding the construction within. As a gentle breeze passes through, the cloth ripples, creating waves of sunlight that seem almost aquatic. Hanging midair with its nose pointed down, tail swinging upward and fins stretched out at both sides, the fin whale has something of a proud, Olympian quality, not only leading the way forward for the museum but serving as a bridge for visitors between beloved museum favorites and the new, high-tech experience to come. On June 8 the curtain lifts on the Otis Booth Pavilion and its whale of a host. The new entranceway faces 31/2 acres of the new Nature Gardens, with a thicket of wild grasses, lush oak trees and geometric succulents, all dotted with fluttering butterflies. GRAPHIC: Tour the revived Natural History Museum It also faces Exposition Boulevard and the light-rail Expo Line, which is as much a forward-looking statement as it is a practical decision. The museum hopes to maximize foot traffic and bring itself in sync with a new generation of museum-goers. “There are a lot of young people riding the subways,” says NHM director Jane Pisano. “It’s the future for L.A. So, here we are.” The Otis Booth Pavilion and gardens are just two new elements in the museum’s decade-plus, $135-million reinvention. The last few years have seen a restoration of the museum’s original building and its historic rotunda, completed in 2009; the new Age of Mammals exhibit, which opened in 2010; and a completely reimagined Dinosaur Hall, now airy and sunlit, after its 2011 debut. Nearly every aspect of the museum has been touched by renovation — more than 60% of its indoor space has been altered — from a new cafe and refurbished elevators to additional permanent exhibits, multiple areas for “citizen science” and an expanded, updated temporary gallery space. All renovations are now complete. After a black-tie celebration for the museum’s centennial year on June 8, the new Natural History Museum of Los Angeles County officially debuts in its entirety to the public on June 9. PHOTOS: Arts and culture in pictures by The Times The overhaul, funded with private donations, revenue from membership and admissions as well as annual funding from L.A. County totaling aproximately $15 million (44% of the museum’s budget), is as much a philosophical renovation as it is a physical one, says Pisano, who joined the staff in 2001 when the board of directors was just beginning to rewrite the museum’s mission. “We had a sense that we could do more, that we could do better,” Pisano says. “It was like: ‘Well, what is a 21st century Natural History Museum?’ And we’ve been on a real search to try and identify that.” With an eye toward the museum transitioning into a truly indoor-outdoor institution — one that with the new garden is as much a museum of nature as natural history — Pisano worked with existing staff, pooling ideas, and hired an impressive team to lead them forward. It included Karen Wise, vice president of education and exhibits, who steered the vision for the Nature Gardens and indoor Nature Lab, a hub for hands-on experimentation; landscape designer Mia Lehrer, who previously worked on the L.A. River Master Plan and the overhaul at Dodger Stadium; lead architect Fabian Kremkus, who designed the Palomar Medical Center in Escondido; and project manager Don Webb from Cordell Corp. It seems to be paying off. Annual attendance at the museum has increased, jumping from 674,655 in June 2002-July 2003 to 851,860 in July 2011-July 2012. Museums across the nation are undergoing changes of similar scope to stay relevant and keep attendance up in times of rapid technological, economic and cultural change. CHEAT SHEET: Spring Arts Preview The Smithsonian’s National Museum of Natural History in Washington will soon embark on a renovation of its Dinosaur Hall; it sent a fact-finding team in January to visit L.A.’s newly remodeled Dinosaur Hall for inspiration. The California Academy of Sciences in San Francisco completed a $488-million project in 2008 in which it rebuilt itself, from the ground up, with an eye toward more integrated exhibits and green design. “Museums are exploring whole new roles,” says Elizabeth Merritt, founding director of the Center for the Future of Museums. “They’re challenging the definitions of being places bounded by four walls.” In her “TrendsWatch: 2013” report, Merritt cites the NHM of L.A.’s Nature Gardens, which replaced a parking lot, as significant. As cities get denser, she explains, and living spaces get smaller, museums are stepping in to create much-needed public green space. What the NHM has done “is not unprecedented,” Merritt says, “but it’s visionary on the scale in which they did it.” Central to its new identity, the NHM has shifted focus from the institution itself to the visitor and from static, definitive displays to customizable exhibits that are more hands-on and interactive. It’s now using new technology, like giant iPad-like screens, to provide layers of information — a learning process that’s more intuitive for Internet-savvy visitors, especially children, who can go as deep as they’d like, in whatever order, not unlike Web surfing. There’s also a far more personal face to the science itself, says Pisano; over the decades, experiments were largely conducted behind closed doors, in labs deep within the belly of the museum. Increasingly, the museum has been placing scientists within view; in its second floor Dino Lab, opened in 2009, visitors have been able to watch paleontologists dusting off fossils from millions of years ago. Now in this final stage of reinvention, scientists armed with bug traps and bat boxes will venture into the Nature Gardens and Nature Lab to sort insects and conduct experiments that visitors can watch and in some cases, participate in. A fleet of 80 paid and volunteer gallery interpreters — called GIs — are also being unleashed on museum floors and in the gardens to interact with the public and answer questions. FULL COVERAGE: 2013 Spring arts preview Wise says the indoor lab — with its illustrated, interactive maps studded with 3-D, taxidermied critters and communal tables for archiving visitor observations — is a first. “There’s almost no citizen science, urban or nonurban, that has a physical presence, a location, in a museum setting,” she says. “So everything and nothing was a precedent for this — nature centers, state parks, amusement parks, video games, everything.” Taking advantage of L.A.’s climate and relative spaciousness by making the museum indoor-outdoor sets it apart from the other three big natural history museums in New York, Washington and Chicago, Pisano says. Lehrer says the maze-like gardens, with 400 types of mostly native but also drought-tolerant non-native plants, will function as a wildlife respite and an active ecological laboratory to be used for a long-term study of urban biodiversity. A big tent-like “malaise trap” for insects, set up in the gardens as well as in 25 museum members’ homes from downtown L.A. to Griffith Park, will track backyard critters over three years. Results will be stored in a new online database, called Nature Map, that the museum is co-launching in June with iNaturalist.org — and that anyone can upload information to. There’s a “living wall” made of Lodi stone and studded with succulents, a “get dirty zone” to explore soil (“don’t wear your party dress,” Lehrer says), and a blocklong “water story” patterned, in part, after the L.A. River. Gardening classes and cooking demos, for both kids and adults, will be held in the half acre of vegetable gardens. “We have an environmental crisis of big proportions and a museum of natural history has a tremendous role in making all the issues tangible and comprehensible,” Lehrer says. “If you understand the balance of nature in a real way — water conservation, the function trees perform, where food comes from — then you become a more responsible citizen.” The past is also an integral part of moving forward; so the NHM’s beloved dioramas of stuffed bison and Arabian oryx, along with other longtime favorites such as the Gem and Mineral Collection and Hall of Birds, will stay put. The dioramas have been freshened up, however, with filled-out habitats and modernized signage. The Otis Booth Pavilion was funded by a $13-million gift from the Otis Booth Foundation, a legacy of investor and former Los Angeles Times executive the late Franklin Otis Booth Jr. The Pavilion is itself an immersive oceanic experience. It’s tricked out with four types of speakers, each emitting whale sounds at different frequencies, as well as more than 33,000 LED lights on the back wall and ceiling onto which underwater graphics can be projected to create the illusion, for the visitor, of passing through a tank inhabited by a whale. “It’s a very theatrical way of animating the space,” says Kremkus. The idea to move the whale to the Otis Booth Pavilion was inspired by Kremkus’ youth growing up in Hamburg, Germany, he says. His grandmother’s remote northern village, Emmelsbull, is a hub for retired whaling captains who would proudly display the jawbones of their grandest catches outside their homes. “It’s a modern metaphor. It marks the significance of the person,” Kremkus says. “A whaling captain had a huge responsibility back then. So does this institution. In a similar way, it feeds the community with social enrichment and culture.” deborah.vankin@latimes.com It's a date Get our L.A. Goes Out newsletter, with the week's best events, to help you explore and experience our city. You may occasionally receive promotional content from the Los Angeles Times. Follow Us Deborah Vankin is an arts and culture writer for the Los Angeles Times. In what’s never a desk job, she has live-blogged her journey across Los Angeles with the L.A. County Museum of Art’s “big rock,” scaled downtown mural scaffolding with street artist Shepard Fairey, navigated the 101 freeway tracking the 1984 Olympic mural restorations and ridden Doug Aitken’s art train through the Barstow desert. Her award-winning interviews and profiles unearth the trends, issues and personalities in L.A.’s arts scene. Her work as a writer and editor has also appeared in Variety, LA Weekly and the New York Times, among other places. Originally from Philadelphia, she’s the author of the graphic novel “Poseurs.” Television Oct. 25, 2023 Image Oct. 25, 2023 Music Oct. 25, 2023 Music Oct. 25, 2023 Entertainment & Arts Oct. 25, 2023 Company Town Oct. 25, 2023 Television Oct. 25, 2023 Movies Oct. 25, 2023 Music Oct. 25, 2023 Subscribe for unlimited accessSite Map Follow Us MORE FROM THE L.A. TIMES ",
    "title": "Natural History Museum is set to dive into L.A.'s cultural scene - Los Angeles Times",
    "datetime": "2013-05-31T17:00:00",
    "url": "https://www.latimes.com/entertainment/arts/culture/la-et-cm-natural-history-museum-los-angeles-20130602-story.html"
}