{
    "text": "The competition between Naver and Kakao for in the Japanese webtoon market is in full swing. Naver announced on June 25 that it will invest 150 billion won in Naver Webtoon by participating in its capital increase. Naver Webtoon was separated from Naver in May last year after operating as an independent company since 2015. A Naver official said, \"Participation in Naver Webtoon’s capital increase is a decision to strengthen the global webtoon business. Naver Webtoon will pursue overseas markets focusing on Japan and the US.\" Naver Webtoon will cooperate with Line, Naver's Japanese subsidiary which established Line Digital Frontier last month by spinning off its cartoon business division. With the establishment of the independent company, Line plans to expand the webtoon service in Japan and Taiwan, strengthening the influence of its webtoon platform in East Asia in the long term. “Line Manga” is Japan's biggest webtoon service with cumulative downloads of 19 million times since its launch in 2013. Naver Webtoon is also rushing into the US market. A Naver official said that part of the newly injected capital will be used to accelerate the growth of its American webtoon business, which is showing a significant growth rate. It has secured more than 5 million monthly users (MAUs). Naver already invested 60 billion won in Naver Webtoon last January, showing its eagerness to invest in the webtoon business. Kakao carried out 79.859 billion won worth of capital increase for Kakao Japan, a webtoon service company in Japan. Kakao Japan operates “Piccoma,” a manga service that is available on smartphones, tablets, and personal computers. Kakao Japan scored a success by introducing an innovative business model. Piccoma breaks down a manga series into chapters and releases them one by one every day. Users can read a chapter for free if they wait 24 hours. They have to pay if they want to read the next chapter. This “free-if-you-wait” model helped the new platform attract a large number of Japanese manga lovers in a short period of time. Kakao Japan plans to apply this business model to Piccoma TV, a video streaming service the company will introduce in Japan in August. Users will be able to watch 10 minutes of free video snippets every day, and pay if they want to keep watching or wait 24 hours for the next release, according to the company. Since its launch in April 2016, Piccoma recorded 8 million downloads in two years and has become a service of 1.2 million users a day. Kakao is determined to realize its dream of overseas expansion. The company has made many futile attempts to make inroads in foreign markets. But now the success of Piccoma in Japan has brought it close to achieving its dream. . The reason the two companies are pouring resources into the Japanese webtoon market is that its future is more promising than anything else. According to a recent report by the National IT Industry Promotion Agency (NIPA), the size of the Japanese webtoon market is estimated at US$408 million (about 440 billion won) this year. It estimated that the market will continue growing by the annual growth rate of 9%, reaching US$479 million (about 516.8 billion won) in 2021. The agency said, “In Japan, the era of digital comics started in 2015 based on the government-led ‘cool Japan’ policy and the popularization of smart devices. Especially, it comes with the increasing use of apps by consumers along with the increase in the number of free apps.” It is different circumstances from the domestic webtoon market, whose growth has been slow due to the widespread illegal copying. In addition, the two companies are focusing on webtoons, an area where Korea is considered to have a strong global competitive edge. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Naver and Kakao Vying in Japanese Webtoon Market - Businesskorea",
    "datetime": "2018-06-26T18:22:48+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=23273"
}