{
    "text": "Netflix will expand investment in Korean and Asian content creators and deliver their products to the global audience, said Reed Hastings, the founder and CEO of the global video streaming service provider, in Busan on Nov. 25. Hastings was a keynote speaker of the Cultural Innovation Forum, which was held on the sidelines of the 2019 ASEAN-Korea Special Summit in Busan. He disclosed his plan to reinforce support for communities in Korea and Asia, and globally spread Asian content including the Korean Wave. \"At Netflix, we are excited to be part of this K-wave and the broader Asian-wave everyone here is working to create: ensuring more cultures are reflected on screen,\" Hastings said. He said \"Kingdom,\" Netflix's first original Korean drama produced by Korean creators and actors, is one of the best examples of Korean content that can be widely loved by audiences not only in Asia but across Europe and North America. Kingdom is a zombie mystery thriller released in January 2018. It was written by famed South Korean screenwriter Kim Eun-hee, writer of the popular 2016 TV series \"Signal.\" \"Netflix is ​​steady making efforts to tell Korean audiences great stories, and as part of such efforts, we have formed a partnership with JTBC, a Korean broadcasting company,\" Hastings added. Netflix has signed a multi-year agreement with JTBC Content Hub, a content arm of media company JTBC, on distribution of high-quality South Korean TV series. “In order to let Korean audiences enjoy Netflix content better, we are collaborating with major hardware companies such as Samsung Electronics and LG Electronics as well as pay-TV service operators such as LG U+, CJ Hello, and D’Live,\" Hastings said. Netflix is ​​expanding its partnership not only with Korean terrestrial broadcasters such as KBS, SBS and MBC but also Korean contents creators including CJ ENM. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Netflix CEO Promises to Bring Korean Cultural Content to Global Audience - Businesskorea",
    "datetime": "2019-11-26T10:22:55+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=38488"
}