{
    "text": "It is the most frequently used word in everyday language but remains repugnant in ever decreasing circles. There, where one dares not speak its name. It has become staple fare of Christmas Day television on RTÉ and the BBC, but still some insist on neutering it in print by removing its vowel and a consonant and replacing them with a pair of lonely, lovely asterisks. As in f**k. Though words of learned length and thundering sound continue to amaze the gazing rustics, it is this pert, pithy four-letter counterpart which finds most favour across all strata. Anodyne attempts at a substitute have failed. There was \"feck\" of Fr Jack in TV series Fr Ted. Doomed, not least when said to be based on the Irish feic, to see. The advent of Mrs Brown's Boys on TV, at Christmas and throughout the year, as well as the Ted films about a Teddy bear with what would once have been described as \"a filthy tongue\", has pushed fuck into the mainstream. This very familiarity is also the greatest threat to its impressive power as a form of expression. It may lessen its effectiveness as a swear word, thus possibly promoting a health crisis as swearing is good for you. Studies in the UK have shown that swearing eases pain, is cathartic, helps bonding and lets off destructive steam. Such studies, however, are not to be interpreted as a licence to spout. Over-use kills the goodness in swearing. As with all things moderation is recommended when it comes to swearing, including moderation in moderation as the odd binge of swear words can also be necessary. Fuck, as if you didn't know, is a verb describing the sex act. It is believed to have originated in England around the early 1500s and is said to be related to the Dutch (sure!) \"fokken\", meaning to thrust or copulate, and the Swedish (of course!!) \"focka\", to copulate with, strike or push. It's remarkable the people who have been intimidated by it. In 1948, American tough guy writer Norman Mailer used the word \"fug\" instead of it in his novel The Naked and the Dead. Later he was introduced to that wonderful wit Dorothy Parker, who responded: \"So you're the man who can't spell 'fuck'.\" [ inaword@irishtimes.com ] © 2023 The Irish Times DAC © 2023 The Irish Times DAC ",
    "title": "Never mind the asterisks: A brief history of the word f**k – The Irish Times",
    "url": "https://www.irishtimes.com/culture/never-mind-the-asterisks-a-brief-history-of-the-word-f-k-1.2397332"
}