{
    "text": "NEW YORK — There are diverse references to art in the office of Philippe Vergne, the man who will be the next director of Los Angeles’ Museum of Contemporary Art: a framed photo of artist Walter de Maria’s “The Lightning Field,” a glossy picture of a work by Swiss artist Thomas Hirschhorn, and a porcelain toilet plunger, signed “R. Mutt,” a reference to Marcel Duchamp’s 1917 “Fountain” — a porcelain urinal. That last one is a joke from a donor, but the pieces give some indication of what Los Angeles will be getting in the director of one of its foremost art institutions — experience with artists in both Europe and the American West and a wry sense of humor that touches on even the serious subject of contemporary art. Oh, and a healthy dose of ambition. “This is the artist’s institution,” said Vergne, 47, paraphrasing the founding principle of MOCA: “The Artist’s Museum.” “For me, it has to be the most innovative institution in this country.” TIMELINE: MOCA in flux The French-born Vergne will arrive after a rocky period for MOCA in which Jeffrey Deitch, an ambitious former art dealer untested in running a museum, isolated artists and staff with his managerial style and the type of exhibitions he chose. Currently the director of the Dia Art Foundation in New York, Vergne has a collegial reputation. With his floppy blondish hair, French accent and tall stature, he looks the part of a rising star in the art world. Though he was chief curator and deputy director at the Walker Art Center in Minneapolis before moving to Dia, Vergne said he has no plans to curate shows himself. Instead, he’ll collaborate with curators, artists and board members to reestablish MOCA as it had been envisioned by its founders in 1979. “My role as a director is to enable curators to be what they are at the highest level. By doing that, you enable the artist,” he said in his airy office in New York’s Chelsea neighborhood. From Chelsea, he oversees operations at Dia:Beacon, the open, modern art museum built in a former Nabisco facility along the Hudson River outside the city, and is working to reestablish Dia in Manhattan in a building the foundation recently purchased. Vergne was first introduced to art by his mother, an art historian, and said that when he was young, seeing an installation by the German performing artist and sculptor Joseph Beuys as well as a Salvador Dali exhibition at the Pompidou Center in Paris helped open his eyes to the diverse potential of art. (The 1979 Dali exhibition was organized by the Pompidou’s Pontus Hulten, who would become MOCA’s founding director.) GRAPHIC: MOCA’s ups and downs with Jeffrey Deitch But familiar as he is with Europe, Vergne said he appreciates how the Los Angeles art scene isn’t oriented toward Europe in the way that New York is. He knows Los Angeles and its art scene well. His wife, curator Sylvia Chivaratanond, is from Los Angeles, and the couple were married in Topanga Canyon. Her family still lives near Calabasas and the couple brings their 2-year-old son to L.A. frequently to visit his grandparents. Vergne’s first visit to Los Angeles was in 1995 to visit the artist Chris Burden in his Topanga Canyon studio. The first installation he curated at the Walker was by L.A. artist Mike Kelley, whose touring retrospective will open at MOCA March 31. Vergne said he’s excited to revisit Kelley’s “Pay for Your Pleasure,” which MOCA acquired in 1988, when he arrives in Los Angeles, and grins a child’s glee when talking about his favorite works. He even makes Los Angeles art jokes — when asked about the millions of Angelenos who have never visited MOCA, he said, “What are they, under a rock? And I’m not talking about LACMA,” in reference to Michael Heizer’s “Levitated Mass” at LACMA, a 340-ton rock positioned above a narrow walkway. PHOTOS: Arts and culture by The Times Catherine Opie, one of the artist trustees who resigned from MOCA’s board in protest over Deitch’s direction of the museum, knows Vergne from a residency at the Walker Art Center more than a decade ago. His personality and sense of humor puts artists at ease, said Opie by phone. “He is incredibly gifted with being social, and his sense of humor, and he can talk to pretty much anybody,” said Opie, who was on MOCA’s search committee. Vergne will “be an artist-centric director,” she said, and “restore the confidence of artists in L.A. that MOCA is a place to be excited about.” A first step in making MOCA more artist-centric would be to invite the four artists who resigned from the institution’s board to rejoin it, said Cindy Bernard, a Los Angeles artist who co-founded MOCA Mobilization in 2008, when the museum came close to shutting down, as a MOCA watchdog of sorts. Vergne hopes to strike a balance, enhancing MOCA’s presence on the international scene while keeping in mind local artists and visitors. But he’ll do all of that alongside the staff and board members who make MOCA what it is, he said. CRITICS’ PICKS: What to watch, where to go, what to eat “I need to work closely with the board and staff in place; they know the institution, they sustain the institution, and they carried it on,” he said. “I need their expertise and their institutional history to make the right decisions.” It’s his collaborative nature that is most striking to Yasmil Raymond, who worked with Vergne at the Walker Art Center, and then followed him to Dia, where she was appointed curator in 2009. Vergne always tried to push the boundaries of contemporary art while not deviating too far from the museum’s history, she said. He did that by talking frequently to artists, staff members and board members. “Everything had to be questioned many times and debated, and that line of inquiry is wonderful,” she said. “He was really trying to bring together both the vision of the artists and the mission of the institution.” But he has his work cut out for him at MOCA. PHOTOS: Art by Banksy A year ago, MOCA was dealing with a series of financial problems. LACMA made an offer to take it over, and talk swirled about establishing partnerships with other museums. But in March the board announced it would remain independent and launched a fundraising campaign to lift the endowment to $100 million. The museum said this month that it had reached that goal and will proceed toward a new goal of $150 million. Eli Broad, one of MOCA’s top donors, had been giving $3 million a year for exhibitions, but the five-year agreement in 2008 has ended. His own museum, the Broad, will open across Grand Avenue from MOCA this year. The Broad will be free except for special exhibitions, while MOCA costs $12, though MOCA has said it is exploring the idea of adjusting its admission fees. “I like the idea of free, but I don’t know if everything should be free,” Vergne said. He said he has only a superficial knowledge of the institution’s finances — he doesn’t even have a contract. He said his first order of business will be to hire a chief curator, but he isn’t sure how much hiring he’ll do beyond that. Besides, Vergne said, more money doesn’t always make for the best exhibitions. Rather, a museum improves its programming by adjusting its vision. That means thinking about its collection, potential acquisitions, commissioning works and creating dialogue with artists on pieces of work. PHOTOS: Site specific dance “All these questions might look simple, but from the answer to these questions, the notion of innovation can appear,” he said, gesturing with his hands as he tried to explain, and then using both hands to push his hair back on his head, a habit that makes him appear ready to roll up his sleeves and begin to work. One way Vergne managed his budget at Dia drew criticism. Last year, Dia announced that it would auction pieces of its collection, including works by Cy Twombly, to acquire artworks that have been on loan to Dia:Beacon. Two of Dia’s founders filed a lawsuit to block the auction, which they subsequently withdrew; a brother of one of the founders wrote Vergne a letter of protest that became public. Vergne defends the decision and said the artworks purchased were integral to Dia’s history. The criticism over selling the Twombly was “totally fair,” he said, but he and his colleagues studied Dia’s collection and looked at its strengths and its redundancies. “We’re a little bit like gardeners — there is no growth without pruning,” he said. Vergne said he doesn’t know MOCA’s collection well enough to know if it too needs “pruning.” But he said he’s already losing sleep trying to figure out the next steps for the museum. His adrenaline is still pumping from the fateful call from MOCA board co-chair Maurice Marciano. “It’s a great honor, and it’s an incredible, almost overwhelming responsibility,” he said. “The legacy of this institution is so unique.” alana.semuels@latimes.com Times staff writer Mike Boehm contributed to this report.   It's a date Get our L.A. Goes Out newsletter, with the week's best events, to help you explore and experience our city. You may occasionally receive promotional content from the Los Angeles Times. Alana Semuels is a former staff writer for the Los Angeles Times. Television Oct. 25, 2023 Image Oct. 25, 2023 Music Oct. 25, 2023 Music Oct. 25, 2023 Entertainment & Arts Oct. 25, 2023 Company Town Oct. 25, 2023 Television Oct. 25, 2023 Movies Oct. 25, 2023 Music Oct. 25, 2023 Subscribe for unlimited accessSite Map Follow Us MORE FROM THE L.A. TIMES ",
    "title": "New MOCA director Philippe Vergne plans an artist-enabling museum - Los Angeles Times",
    "datetime": "2014-01-21T13:00:00",
    "url": "https://www.latimes.com/entertainment/arts/culture/la-et-cm-moca-philippe-vergne-profile-20140121-story.html"
}