{
    "text": "Plus You are not permitted to download, save or email this image. Visit image gallery to purchase the image. Dunedin City Council community arts adviser Craig Monk (left) and Creative Dunedin Partnership chairman Cr Aaron Hawkins. PHOTO: JOSHUA RIDDIFORD\r\n\r\n \n\nDunedin not-for-profit arts and culture organisations have the opportunity to vie for a share of a new $60,000 fund.  The Art and Culture Capability Fund has been established by the Dunedin City Council and Otago Community Trust. Applications to the fund are open until September 29. The council has committed $30,000 towards the fund, which has been matched by the Otago Community Trust. Creative Dunedin Partnership chairman Cr Aaron Hawkins said the fund was for established organisations which were already contributing to \"the cultural and social wellbeing of our community''. Otago Community Trust donations manager Carol Melville said groups applying for funding would need to specify short and long-term goals and how increasing their group's capability would contribute to the city's arts and culture strategy, \"Ara Toi''. A committee would be formed comprising representatives from the council and trust to decide which applications were funded. The fund would be administered by the trust. Each application would be considered for a contribution of up to $10,000 to assist with a capability building project. Cr Hawkins said the fund would help free up organisations to focus more of their energies on creative pursuits and less time on \"sweating about the survival of their organisation''. The fund was available to organisations within the city to tailor to their specific needs, such as issues around governance and fundraising, he said. Council community arts adviser Craig Monk said if the city supported organisations to grow, that would have a positive broader economic impact on the city. Mr Monk said the fund was not available for groups to hire staff for regular operations, make capital expenditures, subsidise shortfalls or pay allowances, wages or personal expenses for staff, governance groups or volunteers. Cr Hawkins said there was an element of \"suck it and see'' to the fund, which would be assessed after the completion of projects funded in the first round. \"It's a pilot programme. If we're overwhelmed by applications, that will prove that there's demand for this kind of work.'' The fund is only available to organisations in Dunedin. JOSHUA.RIDDIFORD @thestar.co.nz SUBSCRIBER  Advertisement SUBSCRIBER SUBSCRIBER ",
    "title": "New $60k arts, culture fund | Otago Daily Times Online News",
    "datetime": "2017-08-13T06:00:00+12:00",
    "url": "https://www.odt.co.nz/news/dunedin/new-60k-arts-culture-fund"
}