{
    "text": "SINGAPORE - Singapore's strength comes from its individual cultures - Chinese, Malay, Indian - and the fact that these are not exclusive, Minister for Home Affairs and Law K. Shanmugam said on Monday (Jan 30). Speaking at an annual Chinese New Year gathering at the new Singapore Chinese Cultural Centre (SCCC) at Shenton Way, he emphasized that the Republic's culture is unique. \"We are not China Chinese, we are not Indian Indians, we are not Malaysian Malays,\" he said. \"We are Singaporean Chinese, we are Singaporean Indians and we are Singaporean Malays. And that is different from all these countries.\" And the Chinese community in Singapore has strongly supported that overarching Singaporean approach even as it highlights the importance of its own culture, he said. Mr Shanmugam noted that culture is key to helping Singaporeans navigate an uncertain global environment, citing the populist uprisings in Western countries which have resulted in political leaders taking extreme measures \"which may or may not work\". He said: \"To have the courage and conviction, you need to be strongly rooted, and rooting comes from culture. (If) we forget that, I think Singapore will not be Singapore, and we will be buffeted and turned over at the first big wave.\" That is why the new Chinese Cultural Centre is essential to Singapore's success, as it will help develop and promote the country's unique Chinese culture among the younger generation, he said. First announced in January 2012, the $110 million, 11-storey centre has a multi-purpose hall, a 532-seat theatre, a rooftop garden, studios for recitals and music recordings and rooms for talks and exhibitions. Mr Shanmugam said the centre \"has a purpose far beyond just the organisation of cultural activities\". \"It has to become a centre for our people to fuse together and build our own culture, taking and drawing from 5,000 years of history,\" he added. \"That is what will make us strong.\" More than 800 community leaders, government officials and representatives from all sectors of society attended the event, jointly organised by SCCC, the Singapore Federation of Chinese Clan Associations (SFCCA) and Business China. A number of Ministers and MPs were also present. Apart from Mr Shanmugam who was guest-of-honour, the others included Health Minister Gan Kim Yong, Minister in the Prime Minister's Office Chan Chun Sing, and Education Ministers Ng Chee Meng and Ong Ye Kung. Mr Liang Eng Hwa, an MP for Holland-Bukit Timah GRC, said the centre is a sign of the Chinese community moving ahead with the times. Its location downtown will help reach out to professionals working nearby, who can take part in activities and programmes after work, he added. SFCCA president Chua Thian Poh said some Chinese values transcend race, and \"act as pillars of support for racial harmony and social stability\" in multi-racial Singapore. \"It is therefore a worthwhile exercise to ensure such values are passed down to future generations, and to encourage our youth and other communities to understand these values in greater depth,\" he added. roysim@sph.com.sg Join ST's WhatsApp Channel and get the latest news and must-reads. Read 3 articles and stand to win rewards Spin the wheel now MCI (P) 066/10/2023. Published by SPH Media Limited, Co. Regn. No. 202120748H. Copyright © 2023 SPH Media Limited. All rights reserved. ",
    "title": "New Chinese cultural centre essential to Singapore's success, says K. Shanmugam | The Straits Times",
    "datetime": "2017-01-30T17:30:51+08:00",
    "url": "https://www.straitstimes.com/singapore/new-chinese-cultural-centre-essential-to-singapores-success-says-k-shanmugam"
}