{
    "text": "NXC Corp. CEO Kim Jung-ju has recently informed potential buyers of his company of his decision to scrap the bidding process. Kim recently sent an e-mail to participants in the public tender through Morgan Stanley, the leading manager of the sale. He also individually contacted the leaders of the consortiums which took part in the tender, such as Netmarble Corp., Kakao Corp. and MBK Partners LP. In the e-mail, Kim dryly said that he would not select a preferred bidder considering market conditions. He did not mention any specific reason for scrapping his plans. The bidding process lasted for five months. NXC Corp. carried out a preliminary bid in February and drew up a shortlist in March but delayed the tender scheduled for May. The deal seemed to be failing, but the company proceeded with the tender process, and participants were waiting for the announcement of a preferred bidder. But Kim has decided cancel the tender. A big price gap is said to be the biggest reason that Kim failed to choose a preferred bidder. There was a large gap between Kim and the market in the estimated value of Kim’s stakes in NXC Corp., the holding company of Nexon Group that controls Nexon Co., Korea’s largest gaming company listed on the Tokyo Stock Exchange. Kim thought that the 98.64 percent stake held by himself and his wife was worth 15 trillion won (US$12.72 billion), but most participants offered a lower price. The absence of strong global strategic investors (SIs) was one of the reasons for the failure. Kim expected that multinational companies, such as The Walt Disney Co., Amazon.com Inc. and Tencent Holdings Ltd., would participate in the tender but all refused to do so. Kim preferred an SI that can operate existing games and develop and distribute new games. However, Kakao and Netmarble, which were the only SIs that participated in the tender, did not even secure letters of commitment (LOCs) from their partners. Financial investors (FIs) which secured LOCs early and took part in the bid failed to turn Kim’s mind. As Kim officially scrapped his plans to sell his stake in NXC, it seems to be difficult to openly proceed with the sale of Nexon for a while. Instead, he is expected to focus on raising the growth potential of Nexon. This is because he confirmed the market’s view that although the company has its cash cows – MapleStory and Dungeon Fighter – they are not enough. Kim is forecast to raise the corporate value through an aggressive M&A strategy as new game products are needed to have an additional growth. In fact, Nexon bought an additional stake worth 110 billion won (US$93.28 million) in Swedish gaming firm Embark Studiosin July 1, making it its subsidiary. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Nexon Founder Scraps Plan to Sell Majority Stake in Holding Company - Businesskorea",
    "datetime": "2019-07-09T11:03:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=33701"
}