{
    "text": "Ahead of Make It Pop's first season finale on May 1, Billboard chatted exclusively with the rapper/actor/TV exec about the show, what he's learned form K-pop, Wonder Girls and more. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin Nearly everything about Nickelodeon’s new show Make It Pop sounds similar to what TV fans have already seen — including the platform (musical-comedy, just in time for Glee‘s finale) and the setting (a boarding school a la Zoey 101) — but its main inspiration is where things get unique. Make It Pop is inspired by Korean pop culture, with executive producers Nick Cannon and Thomas W. Lynch (The Secret World of Alex Mack, Class of 3000) betting on K-pop’s colorful and bubbly aesthetic to draw viewers with new episodes every weeknight which has, so far, delivered strong, consistent ratings for Nick’s young viewers. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t04/28/2015\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tExplore\t\t\n\t\n\nSee latest videos, charts and news\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tBusta Rhymes\t\t\n\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tKy-Mani Marley\t\t\n\t\t\t\t\t\n\n\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news While the audience may be new to the glossy world of Girls’ Generation, f(x) and 2NE1, one of its creators is not. Cannon had worked closely with the Wonder Girls on their eponymous TeenNick film in 2012, introducing him to the highly stylized Korean entertainment world. Ahead of Make It Pop‘s first season finale on May 1, Billboard chatted exclusively with the rapper/actor/TV exec about the show, his love of “magnifying” sub-cultures and more.Why is the world ready for a K-pop-inspired TV show? I always say, “America’s last to the party.” Honestly. It’s such a global phenomenon that I’ve witnessed over the years from traveling abroad. A few years back there was a girl group with a Nickelodeon movie called the School Gyrls, from that there was the Wonder Girls and that’s when I was really introduced to Korean pop and thought, “This is amazing.” I became a fan of the culture. What specifically drew you to the culture? The main reason is the admiration and respect for the fans, how they treat the artist and how they really become this real community. That’s the thing that opened my eyes initially. And then when you see the quality in the music and the videos, the imaging and how detailed everything was; the pop-art feel. I thought it was just really cool, the way they presented it. Obviously, we’ve always had girl groups and boy bands and all that stuff in the states. But to see the detail, the hard work and the dedication in K-pop culture, I’d never seen anything like it.  So far, that mostly thrives online and on YouTube. What was your vision with Make It Pop and how do you make that translate on television? I would say Make It Pop was inspired by that world, but not necessarily trying to be authentic because, ultimately, at the end of the day we’re making a television show for Nickelodeon. I found there were similarities, like the colors, the fun, the music, uplifting stories, all those things were synonymous with the world and I just wanted to focus on all those aspects so, like, “Hey, we can bring all the things that people love about K-pop culture, love about Nickelodeon culture, bring those worlds together, and I think we have a hit show.”What were you looking for when it came to casting? You actually have Sun Hi played by Megan Lee, who was a pop singer in South Korea. We were blessed to be able to have Megan Lee on the show. I want to say, man, over the course of about two years, I’ve seen thousands of young girls and actors for this show. To know that we were going to have three [stars]…we were not going to go through this until we have the right group of girls, and we definitely found the right group. Did you learn anything from working with Wonder Girls? The Wonder Girls’ TeenNick Movie definitely helped. It was originally inspired by that. I was introduced to the K-pop world through the Wonder Girls. Those girls are so amazing. They were so professional, so well-versed in everything entertainment…very stylized, very fashionable, very funny, I wanted to implement all of those things into the show as well. Working with the Wonder Girls was great training for Make It Pop. K-pop fans can be very defensive and there was a petition with almost 10,000 signatures demanding you cancel the show before it aired. Did you notice any negativity brooding?  It’s interesting because while in development, I think there was a press release that went out that I was doing a K-pop show. I would go online seeing tweets here and there about this…I didn’t understand why the fans were kind of upset. It intrigued me like, “Why would they be mad about a big show, that’s not really even trying to be a K-pop show, but something that’s inspired by paying tribute to their world?” because, obviously, they didn’t know what the show was about. I could imagine that someone like myself, who’s not in K-pop, you hear they’re doing “a K-pop show,” it wouldn’t make you that excited. But I reached out to a few of the people who were concerned — that’s the beauty of being online and social media — [I asked], “Why are you guys upset?” And they were saying how much this world and these artists means to them. And I totally respected that. I assured the ones that I actually talked to that this show would do nothing but uplift the culture and pay respect to it… Ironically, since the show has aired, I’ve seen nothing but positive tweets and everything online, they’re already starting fansites and stuff. I’m like, “Yo! We did our job. We did what we came to do.” I’m sure a lot of those fans would like to know, are you a personal fan of any other Korean acts? I’ve had the opportunity of working close with JYP [Entertainment] and J.Y. Park, but I probably also would get in trouble if I chose anyone because you know how serious it is! I got to say everything that came from JYP and all of their acts have always been wonderful and the ones I’ve been supporting throughout the years. J.Y. Park Gives Psy a Run for His Money With Ode to Big Butts, ‘Who’s Your Mama?’ What else are you up to this year?  I’m doing a lot of stuff. In the music space, with Wild ‘N Out, we’re actually releasing some music from a lot of the artists. I’m starting photography for King of the Dancehall, a film I’m starring in, directing in and wrote in Jamaica that’s about the dancehall culture. Myself, Busta Rhymes, Beenie Man, Ky-Mani Marley, everybody in that dancehall culture because I feel like that’s another sort of culture that doesn’t have the opportunity to kind of have its time in cinema. You see all these kind of watered-down dance movies, but you never seen one about Jamaican culture. Sounds like it might be a new-age version of Dancehall Queen. Yeah, yeah! I mean obviously, I was inspired by everything from Dancehall Queen to The Harder They Come, movies that really pay respect to Jamaican culture. Between the cast and what we’re really trying to accomplish, I feel like we’re going to be one that people will reference when talking about the world of dancehall. I feel like I’ve done that quite a few times, in different aspects of my career. Like in Drumline, shedding like HBCU marching band sub-culture, Roll Bounce, even this thing with what we’re talking about with K-pop, the Wonder Girls and Make It Pop. I feel like anytime I get an opportunity to shine a light, to put the middle American magnifying glass on a sub-culture and kind of pay respect to it, I feel like I’m doing my job in entertainment. Make It Pop airs weeknights on Nickelodeon at 7:00pm EST. Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "title": "Nick Cannon’s ‘Make It Pop’: How He Mixed K-Pop & Nickelodeon Culture for Hit Kids Show – Billboard",
    "datetime": "2015-04-28T18:42:30+00:00",
    "url": "https://www.billboard.com/music/music-news/nick-cannon-make-it-pop-interview-6539046/"
}