{
    "text": "By Kim Jae-heun Women were allegedly given date rape drugs at a club in Seoul linked to K-pop star Seungri, a member of boy band BigBang, so their VIP customers can sexual assault them, says a member of the club. A man who claims to be a VIP member of the club said staff at the Burning Sun nightclub regularly texted rich customers to tell them they had women “ready” for them, according to South Korean broadcaster MBC. He said that on one occasion, a staff member sent him a picture of a naked, unconscious woman telling him that he could take advantage of her. “They talk like they are talking about food or something. Staff there say they also have sex with women after drugging them,” he said. It is suspected that the date rape drug, gamma-hydroxyButyrate (GHB) is being frequently administered at the club. The drug acts as a psychoactive neurotransmitter that induces intoxication, mild euphoria and grogginess, and causes memory loss. “A few days later, the staffer sent me another text message with a video clip showing an intoxicated woman being raped. He told me the women did not know they were being filmed because they were drugged,” the customer said. He added that he received similar text messages and photos about once a fortnight for five months until December. They were sent usually at 10pm when the nightclub opened. The man also revealed that staff at the club select young women to drug for rich Chinese customers who spend 30 million won (US$26,500) a visit. “They told me they drugged young girls for Chinese VIPs and received big tips in return,” he said. After the latest allegations, the Seoul Metropolitan Police Agency questioned Burning Sun CEO Lee Moon-ho on Wednesday. Officers searched the club on Thursday for evidence of the drug as well as the Yeoksam Police Precinct station, near the club, to investigate allegations of corruption. A customer had earlier raised suspicions that Yeoksam police officers were “protecting” the club. The customer said he had been attacked by club staff members when he attempted to stop a sexual assault. He says he was then also attacked by police officers that he had called for help. Nearly 20,000 people have signed a petition calling for a thorough investigation into the club. Burning Sun is also known as “Seungri’s Club”. The K-pop star had previously described himself as the “owner and manager” of the club on television shows. However, after the allegations of the sexual assaults emerged, club staff said Seungri was not an owner of Burning Sun, but did assist in club management. ",
    "title": "Nightclub linked to K-pop star Seungri investigated over alleged drugging and sexual assault of women | South China Morning Post",
    "datetime": "2019-02-15T18:31:30+08:00",
    "url": "https://www.scmp.com/culture/music/article/2186260/nightclub-linked-k-pop-star-seungri-investigated-over-alleged-drugging"
}