{
    "text": "Nongshim announced on July 14 that sales of its U.S. subsidiary reached an all-time high of an estimated US$164 million in the first half of 2020, up 35 percent from a year earlier. Nongshim's strong business performance in the U.S. market is attributable to brisk sales of its instant noodle products in the mainstream market of the United States. Nongshim’s Shin Ramyun has become a favorite food for local residents in the United States. The spread of COVID-19 in the United States has further boosted demand for Nongshim noodles as more consumers stocked up on them as an emergency food. Scott Ellis, a purchasing manager at Kroger, said that demand for Nongshim noodles increased as many consumers changed their perception of the products from a snack to a meal replacement. He added that as cooking at home has become the new normal amid the spread of COVID-19, a growing number of American people enjoy Nongshim noodles at home by tailoring them to match their flavor and dietary preferences. This phenomenon pushed up sales of instant noodles at large retailers such as Wal-Mart, Costco, Kroger, and Sam’s Club. Ramen sales at Wal-Mart, Costco and Amazon ballooned 35 percent, 51 percent, and 79 percent in the first half of 2020. \"Since we started supplying Shin Ramyun to all Wal-Mart stores in the United States in 2017, we have been building a strong distribution network in the mainstream market in the United States,” a Nongshim official said. “Nongshim is one of the few foreign food brands sold throughout the United States.\" The largest contributor to Nongshim’s success in the U.S. market is definitely Shin Ramyun. Sales of Shin Ramyun in the first half of 2020 reached about US$48 million, up 25 percent from a year ago. Nongshim promoted Shin Ramyun by setting up special sales stands at large stores and operating Shin Ramyun buses in New York and Las Vegas. In particular, the growth of Shin Ramyun Black stood out. Shin Ramyun Black's first-half sales grew 49 percent on year to US$13.5 million. Shin Ramyun Black is gaining in popularity among American consumers with its unique soup and chewy noodles. Nongshim expects sales momentum for Shin Ramyun Black to continue amid the home cooking trend in the United States. The popularity of Shin Ramyun Black has been reported by major U.S. media outlets after spreading by word of mouth among American consumers. Recently, the New York Times picked Shin Ramyun Black as the world's most delicious ramyun. In an article titled \"The Best Instant Noodles\" on Wirecutter, a product review site of the New York Times, Shin Ramyun Black proudly topped the world's best 11 instant noodles, beating several Japanese noodles. In addition, in 2019, the LA Times ranked Shin Ramyun Black as one of the top ramyun brands in the world. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Nongshim Enjoys a Spike in Ramen Sales in the U.S. - Businesskorea",
    "datetime": "2020-07-14T09:50:50+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=48905"
}