{
    "text": "Stanford University The Walter H. Shorenstein Asia-Pacific Research Center is part of the Freeman Spogli Institute for International Studies South Korea’s cultural wave has swept across the world. Known as Hallyu, the Korean Wave spans music, film, TV, fashion, and food, expressing soft power that engages global audiences and transforms the ways in which they view and consume pop culture. North Korea, by contrast, is a systemic abuser of human rights and remains fixed on the pursuit of military might that poses regional and international threats. These two divergent aspects of Korea that intrigue scholars and the public alike were the focus of a conference that marked the 20th anniversary of the Korea Program at Stanford’s Walter H. Shorenstein Asia-Pacific Research Center (APARC). The two-day event, held on May 19 and May 20, convened leaders from academia, government, and the entertainment industry to explore how to translate the wide fascination with South Korea’s pop culture wave and North Korea’s geopolitics into an increased academic interest in Korea and to envision new horizons for the field of Korean studies. The conference featured keynote addresses by Ban Ki-moon, former United Nations secretary-general, and Soo-Man Lee, founder and chief producer of SM Entertainment, and a presentation by SUHO, leader of K-pop group EXO. They joined long-time Korea Program supporters and members of the general public and Stanford community, who came together to celebrate the accomplishments of the Korea Program in its first two decades and consider its future. The event drew robust audiences both in person and online, including a large number of enthusiastic Stanford students and tens of thousands of viewers who watched the event livestream. As he welcomed conference attendees, Stanford sociologist Gi-Wook Shin, the William J. Perry Professor of Contemporary Korea and founding director of the Korea Program, explained that the goal in gathering participants and presenters who represent deep and varied interests in Korea is to highlight the importance of Korean studies programs and build bridges between the United States and Korea, creating a lasting impact well beyond campus. Shin, who also serves as APARC director, reflected on the efforts made to build a thriving Stanford research hub on contemporary Korea. These include establishing a Korean collection at the East Asia Library, recruiting faculty with expertise in both the social sciences and the humanities, academic publishing, offering training and fellowship opportunities, and events programming. The conference’s dual focus on North Korea’s geopolitics and South Korea’s Hallyu reflects Shin’s commitment to expanding the range of inquiry about Korea. “To understand contemporary Korea and further Korean studies, it is critical to couple the traditional focus on the Peninsula’s security dilemma with a broader examination of Korean society and culture,” he said. Professor of International Studies Michael McFaul, director of the Freeman Spogli Institute for International Studies, the parent organization of APARC and the Korea Program, and Professor of Jewish Studies Gabriella Safran, the senior associate dean for humanities and arts, contributed additional welcome remarks, symbolizing the Korea Program’s bridging of both the social science and humanities fields. Safran observed that Korean studies instruction at Stanford has been designed to engage the university community broadly and highlighted the evolution of Stanford students’ understanding of popular culture, thanks in part to the rising popularity of the Korean Wave. The morning session of the conference opened with a panel on North Korea. Attendees heard from Siegfried Hecker, professor emeritus in management science and engineering, about the prospects for a renewed diplomacy policy with North Korea; from Kim Sook, former ROK ambassador to the United Nations, about the status of inter-Korean relations and North Korea’s efforts to stave off a COVID-19 crisis; and from Joohee Cho, Seoul bureau chief at ABC News, about the challenges of reporting from and on North Korea and the need to better understand North Korean society beyond the trope of the diplomacy of denuclearization. Ambassador Kim, who is also a former fellow with the Korea Program, is one of many Program alumni from the academic, policy, and industry sectors. Speakers on the following panel represented the scope of expertise of the Program’s alumni community and the wide-ranging training and fellowship opportunities the Program facilitates. The panel brought together Paul Chang, associate professor of sociology at Harvard University, Joon-woo Park, former ROK ambassador to the EU and Singapore, Jong Chun Woo, former president of Stanford APARC-Seoul Forum, and Megan Faircloth, a Stanford Senior in the Department of East Asian Languages and Cultures, to consider the Korea Program’s past, present, and vision for the future. Delivering the keynote address on the first day of the conference, former UN Secretary-General Ban Ki-moon focused on the paradox of the two Koreas. On the one hand, the Republic of Korea has followed a remarkable national development trajectory to become a powerhouse of cultural and artistic creativity – “a global soft power pace-setter,” said Mr. Ban. On the other hand, North Korea, with its stunted development, is seen as a global pariah, and its fixation on hard power suffocates the creativity, innovation, and culture of its own people through systemic repression, state control, and censorship. But hard power and soft power are not the only two paths, Mr. Ban stated. He went on to explain that a truly advanced country should embrace a forward-thinking national identity of smart power, combining and ultimately transcending hard power- and soft power-related attributes and characteristics. “In an uncertain future, I am certain that Korea’s ascension into a smart power can advance a common destiny for all, one rooted in peace, sustainability, and prosperity,” said Mr. Ban. The best way to achieve this vision, he concluded, is to educate new generations to embody the principles of global citizenship and help them live in harmony and peace with other human beings, irrespective of their nationality. The soft and hard power strategies of the two Koreas are also the focus of two new documentaries commissioned by the Korea Program. Focused on K-pop and the North Korean human rights crisis, the films are intended to help scholars in teaching students about these two topics. The conference included the unveiling of the documentaries’ trailers and a discussion with film director Hark Joon Lee. The complete documentaries will be released later this year. There is no doubt that the speaker who most charmed conference attendees and the multitudes of global viewers who watched the event livestream was SUHO, leader of K-pop group EXO. “Today, I am here as the guardian of EXO and K-pop,” SUHO said at the start of his speech, referring to the meaning of his stage name. He went on to talk about his decade-long experience as a K-pop artist and the hard work and level of detail that go into the complex choreography of the K-pop dances, emphasizing the special, social media-driven emotional bond K-pop artists share with their global fanbase and noting how many fans take a deeper interest in Korean culture because they follow EXO. Hallyu has no borders and no longer stops at one specific art form, concluded SUHO. “We are witnessing its expansion into our society from every angle: music, dramas, movies, food, education, and more. K-culture is more than a passing trend. It’s a global phenomenon that will continue to grow and evolve,” he said. Joining SUHO for a discussion of the Korean Wave were Stanford’s Marci Kwon, assistant professor of art and art history, and Angela Killoren, CEO of CJ ENM America, Inc., who oversees U.S. operations for the South Korean entertainment conglomerate that is known for its multiple Academy Award-winning movie “Parasite” and popular K-dramas such as “Crash Landing on You.” Killoren described the evolution of the global adoption of K-dramas, largely made possible by their distribution through Netflix, and offered insights into the drivers and shapers of the rise of Korean entertainment. According to Killoren, unlike the predominantly male gaze-driven entertainment forms in other cultures, Korean entertainment content caters to the female gaze, as befitting the consumer side of the Korean economy that has been driven by the purchasing power of women The second day of the conference convened leading academics to examine how to translate the wide interest in North Korea and K-pop into Korean studies. Panelists included Michelle Cho, assistant professor of East Asian studies at the University of Toronto, David Kang, professor of international relations and business at USC, and Stanford’s own Yumi Moon, associate professor of history, and Dafna Zur, associate professor of East Asian languages and cultures and director of the Center for East Asian Studies. The panelists agreed on the importance of funding and supporting the study of Korean language in higher education, providing students with tools to articulate their knowledge and experience and help them arrive at insights that are personal, meaningful, and constructive; and fostering and supporting junior faculty. The discussion was followed by a lively Q&A session that engaged many student attendees. The conference concluded with a keynote speech by Soo-Man Lee, founder and chief producer of SM Entertainment. SM is one of South Korea's largest entertainment companies and is famous for fostering and popularizing the careers of a myriad of K-pop groups and stars — including the likes of aespa, NCT, Red Velvet, SUPER JUNIOR, and EXO — and for leading the worldwide K-pop phenomenon and the musical side of Hallyu Lee recounted his roots as “K-pop’s first mover,” explaining how K-pop music expanded globally and how it demonstrates the power of content amid exponential technological revolution. “It connects the hearts of people around the world beyond generations and ideologies,” he said. Lee described SM’s systematic production and management system, which he coined “Culture Technology (CT)” and which includes casting, training, content production, and marketing. This so-called CT system is the “growth engine of K-pop,” he noted. He elaborated on his vision for a future of K-pop that centers on the “Play2Create” (P2C) ecosystem and combines metaverse technology. Within this blockchain-based ecosystem, which Lee says forms part of a new creator economy, fans, or “prosumers” can proactively use the original SM intellectual property to enjoy and create new content through recreation. The ultimate vision of K-pop and Hallyu is to contribute to human creativity, concluded Lee. The conference made headlines in Korean media and elsewhere. Explore selected media coverage, the event press release, conference agenda, and YouTube playlist including the full livestream recordings via the links below Event page and complete agenda Event press release General inquiries\n650-723-4581 Learn more about how your support makes a difference or make a gift now © Stanford University, Stanford, California 94305. ",
    "title": "North Korea’s Geopolitics, South Korea’s Pop Culture Wave Take Center Stage at Korea Program’s 20th Anniversary Conference | FSI",
    "url": "https://aparc.fsi.stanford.edu/news/north-korea%E2%80%99s-geopolitics-south-korea%E2%80%99s-pop-culture-wave-take-center-stage-korea-program%E2%80%99s-20th"
}