{
    "text": "Students can find many unique buildings and monuments on the K-State campus. Here is a short list of sites that every student should visit before leaving the university. And, since all of these places are conveniently located on campus, many of these places can be seen in one day. The Marianna Kistler Beach Museum of Art offers many different exhibits and styles of art. The museum’s exhibits rotate throughout the year in an effort to bring new and diverse art to campus. The museum is open from 10 a.m. to 5 p.m. Tuesday through Saturday and from noon to 5 p.m. on Sundays. Admission is free. Attending a show at McCain Auditorium is something everyone in Manhattan should do at least once. A wide variety of shows, theater, dance and music is brought to McCain Auditorium every season in a program that offers a show for all tastes and interests. Upcoming acts include the band Foreigner on Sept. 8 and the Blue Man Group on Sept. 25. The World War II Memorial, “Tags of Honor,” is a recognition of the many K-State students and faculty who served during World War II. Designed by Tim D. Chapman and dedicated on Memorial Day 2011, the commemorative dog tag statue features a reflective surface that brings viewers into the art. The historic model for the sculpture was the actual dog tags of K-State alum and Manhattan resident John Lindholm, a 1949 K-State graduate. The memorial is displayed in the outdoor plaza on the east side of McCain Auditorium. Anderson Hall is a state-recognized historic building. The bells that ring every hour were installed in the tower in 1965, and the building has previously held a canteen, a barber shop and a chapel. Many students will enter this building to visit the Division of Financial Services, the Office of the Registrar or the Office of Military Affairs. The Bluemont Bell, located in the Holen Courtyard outside of Bluemont Hall, is a monument every student should see. Originally created at Bluemont College, just a mile west of the original K-State campus, it was used to call students to class. A hidden treasure on campus is the Seaton Hall Courtyard. This small sanctuary is tucked away between Seaton Hall and Seaton Court and offers a serene place for students to sit and eat lunch or study in between classes. Lover’s Lane is a road that runs east-west on the K-State campus, connecting Mid-Campus Drive with Manhattan Avenue. Located at the intersection near Anderson Lawn, Bluemont Hall and Eisenhower Hall, the Lover’s Lane sign is a classic place to celebrate college romance with a kiss and to take photos. The Quinlan Natural Area is a small section of nature preserved along Petticoat Lane, between the Strong Complex and the rest of campus. The wooded area includes a bridge that allows students to cross over a small, babbling creek and benches for students to study or eat a meal while outside. Memorial Stadium offers a wide variety of of features for students, hosting many sporting events and club activities as well as providing classrooms. Also called Old Stadium, it houses a full-sized track and football field and plenty of stairs. Located outside of Old Stadium, the Senior Sidewalk is a good place for current students to see the names, years and majors of previous K-State students. The bronze Powercat statue at Old Stadium is something all students should see or take a photo by. It’s a monument many students use as a way to commemorate their time at K-State. The Helen L. Graves Family Courtyard is located near the Johnson Center for Basic Cancer Research, which is located close to Ackert Hall. It is a very soothing, relaxing place to sit and work on homework at one of the tables while listening to the sounds of nature and the courtyard’s small waterfall. There are many other wonderful places to visit on the K-State campus. One of those places is Radina’s Coffeehouse and Roastery in the Leadership Studies Building. It offers indoor and outdoor seating for students to study and enjoy coffee and snacks. The Quad is an attractive site for students to study outdoors or just lounge under a tree, and it also includes a stone sundial in the center. Students can often be seen slacklining between trees in the Quad. Another place all students should see before leaving K-State is the Great Room, located on the second floor of Hale Library, which has also been dubbed “the Harry Potter Room” for its cavernous size, large benches and tables and enormous windows. Weber Arena is where the K-State Rodeo is hosted annually — two things every student should experience. Sept. 28-29, Weber Arena will be filled with college rodeo enthusiasts cheering as contestants rope and race for cash and prizes. K-State also offers a lively theater scene with venues like Nichols Theatre and the Purple Masque. The School of Music, Theatre and Dance as well as the Ebony Theatre produce several performances each semester, and students should not leave K-State without attending at least one. There is something on this campus for everyone. Your niche may be anything from arts to athletics; that’s the beauty of the K-State family — there is something for every individual. ",
    "title": "Notable features on K-State campus not to be missed - The Collegian",
    "datetime": "2013-08-27T01:20:23+00:00",
    "url": "https://www.kstatecollegian.com/2013/08/26/notable-features-on-k-state-campus-not-to-be-missed/"
}