{
    "text": "About time someone’s had the guts to say it! Obviously, this generation is entirely too consumed in social media and technology, to the point that we didn’t even see this one coming. Star of the hit Netflix series, Orange Is The New Black, Taylor Schilling didn’t hold her tongue on the topic in the new June issue of ELLE Canada. Schilling expresses that the internet only makes you feel more alone, depending on likes and comments from others about your lifestyle is not the direction for true happiness. “There is something so sad about going online and seeing almost everyone shouting ‘Notice me, notice me!’ Which is such a human desire—to be acknowledged,” she says. “But me responding to that with some sort of ‘You’re noticed, you’re seen’ only perpetuates the loneliness. Because I’m not seeing you; I’m not noticing you.”  Schilling, 30, believes that validation should not be dependent on social media. Does she have a point? Ladies lets rewind and think about it here – How many time’s have you gone shopping and thought about how many likes you’d get on Instagram with this? Be honest because that’s the problem. Taylor went on in to explain that people on social media sites are not being truthful and she’d rather live in the real world than in these platforms. “It has almost become a defiant thing at this point because I do not believe this celebrity Kim Kardashian culture is what I signed up for,” she tells the magazine. “I’d rather create something honest than try to create something for a social-media account.”  It’s very unlikely to run into someone without a social media profile regardless of what site. She explains that it takes more courage to be real online than in real life. “It takes a lot of bravery to be authentic and honest and to take that social mask off in order to connect with another human being. So much of what makes us who we are is smoothed away online. And what truly connects us is the wrinkles, not the smoothness.” Would you dare putting a photo up where everything wasn’t On Fleek ? Taylor Schilling may be hitting the nail right on the head. -Tia Long (@Bytialong)  elle canadakim kardashiannetflix seriesorange is the new blacksocial mediataylor schilling Entertainment is my job, Hip Hop is my passion, and Writing is my craft. \r\nTwitter/IG -  @bytialong\r\nemail - contact.tialong@gmail.com ",
    "title": "OITNB Star Taylor Schilling Shuts Down Social Media Fame, and The Kim K Culture! - The Source",
    "datetime": "2015-05-04T00:21:34+00:00",
    "url": "https://thesource.com/2015/05/03/oitnb-star-taylor-schilling-shuts-down-social-media-fame-and-the-kim-k-culture/"
}