{
    "text": "To revisit this article, select My Account, then View saved stories To revisit this article, visit My Profile, then View saved stories By Sarah Larson At the Joey L. photography studio in Greenpoint, Brooklyn, on a recent Tuesday, Michael K. Williams, the actor best known for playing Omar Little, on “The Wire,” sat under lights and a parabolic umbrella, holding a vape pen, his elbows on his knees. He looked concerned. Joey L., crouching, took photographs. “Need a Way Out,” by Maino, played. Williams wore his own clothes: a gray Valentino sports coat, black leather Yves Saint Laurent biker pants with elaborately zippered knees (“I keep ’em open, get the little breeze,” he said later), and black-and-white Rick Owens zippered high-tops. “We gave him notes: something super simple. Classic,” Molly Kaplan, a multimedia producer for the A.C.L.U., said. Williams is the A.C.L.U.’s new ambassador for ending mass incarceration, and the photographs from the session will be used in an upcoming ad campaign advocating reform of the criminal-justice system. The crew took a break—the next shots would be outside, on a fire escape—and Williams stood up and danced a little. “Tears of Joy,” by Rick Ross, played. (“Tell me, Lord, will I be dealing dope? I want to take my mama to the Poconos.”) Williams plays Rick Ross’s namesake, the eighties drug dealer Rick Ross, in the recent movie “Kill the Messenger.” “He’s become a very good friend of mine,” Williams said, of the real Rick Ross. “He’s not what we might think a drug dealer might be, which is this menacing, coldhearted, callous killer. He’s actually mild-mannered, kind, sensitive, friendly, warm. He had aspirations of becoming a tennis player.” Williams grew up in a housing project in East Flatbush. He has relatives who have done time for drug offenses, and he has been an addict himself. “Arresting people, or ruining people’s lives for a small, nonviolent charge, like marijuana, drug addiction, or mental illness, is not the way to go,” he said. “Those are health issues, not criminal issues. It’s the grace of God that I wasn’t imprisoned for my antics growing up.” Link copied “You’re da Man,” by Nas, came on. “I love Nas,” Williams said, moving to the beat. “He gets me in my A.C.L.U. state of mind.” Williams started out as a dancer. When he was twenty-five, his face was slashed in a bar fight. He began to be cast in tough-guy roles, and worked with Tupac Shakur and Martin Scorsese. In 2002, he was cast on “The Wire” as Omar—a gay, principled, “Farmer in the Dell”-whistling Robin Hood figure who makes his living robbing drug dealers. Barack Obama called Omar his favorite character on his favorite TV show. “Omar was life-changing for me,” Williams said. “I went so deep into his psyche that the lines of reality as to who was Michael and who was Omar got blurred.” An assistant brought him a brownie, which he ate with a spoon. “I had low self-esteem,” he said. “I was, like, Mike is corny! I’m gonna be this Omar dude. It was like that was my Spider-Man suit. Peter Parker was the corny kid in glasses, but he put that Spider-Man suit on, it was on and poppin’.” After the role ended, he said, his addiction “kicked back up again.” But he made it out, with “time, healing, meditation. A little therapy—never hurt nobody.” Williams now lives in Williamsburg. “I’m a huge fan of how beautiful Brooklyn has become, but I do have an issue with the gentrification,” he said. “I feel grateful that I’ve got a second chance at life, to be able to afford to live the way I do, coming from where I come from.” He paused. “If anybody should live here, it should be me,” he said, and laughed. But it feels “a little lonely.” “I don’t see a lot of blacks in Williamsburg at all,” he went on. “Sometimes, when I see, you know, antics on the weekend, I’d feel safer in the Vanderveer projects, where I grew up. I understand that kind of crazy. When I see the people in Williamsburg get crazy, I’m, like, O.K., where’s this going? If they were black, the police would probably be pouncing on them. I kind of just go in the house.” In his next role, on a new HBO miniseries, “Crime,” he plays an inmate. His character, Freddy, “runs Rikers Island,” the notoriously grim city jail. “Mass incarceration, there we go again,” he said. The ad campaign begins this spring, but Williams’s role is already under way: shortly after the Ferguson grand jury failed to indict the police officer who killed Michael Brown, the A.C.L.U. tweeted an image of Williams urging trust-building “between police and the communities they’re sworn to protect.” Last Wednesday, Williams e-mailed further thoughts. “Mike Brown’s death is a request for us to look at the young men in Ferguson and places like it with humanity and have our local governments and courts do the same,” he wrote. Later that day, a grand jury in Staten Island failed to indict the officer who killed Eric Garner. ♦ By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. By Clare Malone By Susan B. Glasser By Ted Geltner By Sunita Puri Sections More © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. The New Yorker may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "title": "Omar Little, A.C.L.U. Ambassador | The New Yorker",
    "datetime": "2014-12-08T00:00:38.000Z",
    "url": "https://www.newyorker.com/magazine/2014/12/15/way"
}