{
    "text": "© 2023 SJC Media. THE TRAGICALLY HIP ‘Every mix tape I ever made had at least one Hip song on it,’ says the Weakerthans’ John K. Samson By Michael Barclay\n\n August 10, 2016 John K. Samson of The Weakerthans. (Noel Vasquez/Getty) Update: Gord Downie died Oct. 17, 2017. Read his obituary here. John K. Samson is the singer/songwriter at the core of Winnipeg band the Weakerthans, whose four albums feature perhaps the only rock lyricist of the generation after the Tragically Hip who is in Gord Downie’s league. Naturally, the two share a mutual admiration. Samson also co-runs the publishing house ARP Books, which focuses on poetry, politics and fiction. A: I had the first EP that had “Last American Exit,” I bought it when it came out. Since then it’s been a constant, despite my various phases of musical intolerance. For a while there I would only listen to certain things, like a lot of teenagers do. But the Tragically Hip is a ribbon that’s been with me pretty much my entire musical life. Every mix tape I ever made had at least one Hip song on it. Right from the outset I feel like Gord built so much room into his songs. There was so much space in them that he created. He made me think of songwriting as full of boundless possibilities in a way that—well, that a lot of songwriters do, but that was the first time I thought a song could really contain multitudes. A: Yeah, I think of his voice as Whitman-esque. He has a poetic voice that contains multitudes, both the suppleness of the instrument of his voice, and just the lyrical boundaries that he pushes, which are really always thrilling to me. A: Yes, exactly. They’re taking this almost readymade form—that sounds denigrating, but I don’t feel that it is. They’re playing rock music that is really democratic. When you hear it, you think other people can play it. Adding Gord’s voice to that is really powerful, because when you hear that voice and those words, you realize what the potential for that can be. It’s full of potential in ways that most rock bands don’t pursue. MORE: We’re following the Tragically Hip—and their fans—across Canada A: He’s always paddling forward as a writer. There is no recycling. He’s not going over things he’s gone over before, like other writers do—like I certainly do. I feel like I go back to touchstones that are dependable for me. He is always striving. I always go into listening to a new record by Gord solo or the Hip and think, “Well, I know what this is going to be, lyrically.” Every song starts and then I think, “Oh, I have no idea where that comes from.” He has this entirely original voice, both literal and metaphorical. A: Thanks. That’s something I’ve certainly taken from writers like Gord is that there is a whole potential for breaking out of meter. Even if you don’t do it, you’re permitted to. He gave a lot of writers permission to do that, to expand and push out the borders of what a rock song can contain. A: I feel the Hip has handled that so beautifully. They’ve been so inclusive, openly connected to their audience, totally unprejudiced, un-cliqueish, uncool. I don’t think they’re ever doubted their audience’s value as this huge cross-section of people. I feel like he’s such a generous writer. He never dumbs it down. MORE: On the Tragically Hip’s ‘golden thread’ A: When we opened for them around 2006, there was a New Year’s Eve show in Hamilton at Copps Coliseum, and that was pretty drunken. Being their opening act can be difficult, and I was worried because I know the tenacity of their fans. But once I was doing it, and there would be these murmurs and choruses of “Hip, Hip, Hip” during quiet songs, I thought it would really bother me. But they weren’t insulting the opening act, they were just incredibly excited to the point where they couldn’t contain themselves before what’s about to happen. Then when you see the Hip come on stage and see the greatest frontman I’ve ever seen engage with an audience, you realize why: it’s a thrilling, emotional, beautiful thing. After that, I thought, I don’t begrudge them at all! That was revelatory for me. A: One of the wonderful things about music these days is that it’s less cliqueish, and then you just look at them for what they are, which is remarkable. Phantom Power is probably my favourite. It felt to me that at that point in their career [1998] they could have phoned it in for the rest of their lives and people would be happy with that. Then they came out with this bustling, really vivid and forthright record that sounds to me like a band’s first or second record. Those are usually the ones that are the most exciting and durable; you build a body of songs that are really tested—all those reasons why the first couple of records by a band really define a band. I feel like Phantom Power feels like one of those records, even though it’s 10 years after the debut. Some of their records don’t always hit for me, but there’s always something on them. A: In 2005 when they played at the Junos in Winnipeg, and we were on tour. Someone called me and said that during their performance, Gord had slipped some of my lyrics into one of their songs. It’s still one of the most thrilling things I’ve ever heard. Then they invited us to open some shows. They were all super generous and kind people and Gord and I emailed a bit and we’ve stayed in touch a bit. I certainly always cherish those communications. A: I can’t say that we did. There’s never really been time for that. A: It is, yeah. A: I do, yeah. But I wouldn’t know where to start with Gord. A: No one else writes like Gord, so it’s difficult to compare him. He can work in the abstract and still somehow be really specific. He lets parts of his consciousness in that most writers aren’t able to do, myself included. I don’t feel like I have that access to the surreal and the somehow beautifully meaningful non-sequitur—that fits perfectly. I can never figure that out, how he does that. Still, somehow, the songs feel rooted in a place. I was listening to this interview with [fiction writer] George Saunders the other day, and he said something about how the role of a writer is to build a more detailed world. I think it applies to what Gord is doing with his body of work, which is to build a more detailed world and there’s something really political about that. A: A more detailed world is a more complicated and complex one, and therefore a more empathetic one. I feel Gord’s lyrics are exceptionally empathetic, or that’s what they accomplish. The fact that they can cross all those cultural cliques and boundaries really amplifies that, to me. Michael Barclay is the co-author of Have Not Been the Same: The CanRock Renaissance 1985-95. MORE ABOUT GORD DOWNIE: © 2023 SJC Media. ",
    "title": "On the Tragically Hip's 'beautifully meaningful non-sequiturs'",
    "datetime": "2016-08-10T20:31:40+00:00",
    "url": "https://macleans.ca/culture/on-the-tragically-hips-beautifully-meaningful-non-sequiturs/"
}