{
    "text": "Share this article Seoul: The online festival is a backstage pass to Korean culture. Photo / Unsplash, Sava Bobov On the verge of global superstardom, 2020 was a mixed year for Korea's top cultural exports. Last year the Bangtan Boys (BTS) broke 15 Guinness World Records for international chart topping success and Bong-Joon Ho took the Oscar for best picture back to Seoul for Parasite – the first foreign language film ever to win the accolade. It was a shame then, the year Korean culture went global, international travel shut down. However, Korea's pop-stars, movie makers and celebrities are determined not to let the purple patch pass them by and many have gone online to cash in on this new-found global success. In November the snappily named \"Bang Bang Con: The Live\" became the world's largest online concert, broadcast from Seoul to 756,000 fans in 100 countries. That's 15 Eden Park stadiums, and $24m in ticket sales at once. via GIPHY Musical acts and artists are determined to ride the Korean Wave wherever it takes them. For the Inside K-Pop festival this means ditching the stadium concerts for a day in the life on the streets of Seoul. A programme of online events invites fans for a week of fashion, photography and fast food. As it turns out the internet has helped foster an appetite for all aspects of the Korean culture - from movies and music to obscure internet trends. via GIPHY The phenomenon of Mukbang –  a genre of video broadcast in which thousands of strangers watch someone else eat – has fostered a huge online community outside Korea. It's a thing. Next week the virtual K-pop festival hopes to give travellers and music fans around the world a taste of life on the Korean peninsula. A collaboration between Warner Music Korea and online booking platform Airbnb, there will be 14 online events focusing on a different aspect of the country's culture. Each one hosted by a famous face from the music scene. via GIPHY Experiences include a Mukbang tour of Korean convenience store food with Monsta X, a doe-eyed photography tour of Seoul with Handong and a tour of a traditional Hanok guest house at the Gyeongbokgung palace. The festival is running from 25-30 January, in English, Korean, Chinese or Japanese. Ticketed via the Airbnb website, events go on sale on 21 January. Ever wanted to eat kimchi with a K-pop star? This is you chance. Share this article The Biden administration said it will invest US$26 million to address the problems. ",
    "title": "Online K-Pop festival gives backstage pass to Korean culture - NZ Herald",
    "url": "https://www.nzherald.co.nz/travel/online-k-pop-festival-gives-backstage-pass-to-korean-culture/IPPG3FN3IS5WWYLGSP4U2B7764/"
}