{
    "text": "For centuries, Paphos, in south-western Cyprus, served as a center of the cult of Aphrodite, the Greek goddess of love and beauty. A sculpture park along the coast has been created for the ECOC year. The bronze sculpture \"Sol Alter,\" by Cypriot artist Yiota Ioannidou, pays tribute to  Aphrodite. It depicts a young woman who looks after the place where Aphrodite lived and wants to be like her. Aphrodite is said to have landed here when she rose from the sea. The legendary Pétra tou Romioú, also known as Aphrodite's rock, is just 25 kilometers outside of Paphos - a must-see for tourists exploring the island's breathtaking beaches. The eastern Mediterranean island is home to some unique archaeological treasures. In 1962 a farmer discovered marvelous mosaics in his field. The well-preserved mosaics can be viewed from wooden walkways. They once adorned ancient Roman villas. Like a picture book of Greek mythology, they depict scenes with deities such as Apollo and Daphne. To mark the ECOC year there will a performance of the comedy \"Lysistrata\" by Aristophanes. In it the women refuse sex with their husbands until a treaty for peace has been signed. The coniferous trees typical of the island are also depicted in the mosaics. Cedar wood was in great demand, as it is very resilient and repels insects. Nowadays the native Cyprus cedar (Cedrus brevifolia) is protected. In the \"Valley of the Cedars\" visitors can enjoy a stroll and a picnic in the shade of the trees. At the height of summer, temperatures can reach up to 40 degrees Celsius (104° F). The famous \"Tombs of the Kings\" date back to the 3rd century B.C. They are not actually the final resting places of royalty, but instead of wealthy citizens who had mausoleums built, some even with their own drinking fountains. The Egyptian-inspired tombs, along with the ancient mosaics, are all part of the Archaeological Park, which has been listed a UNESCO World Heritage Site since 1980. Lára Bay is one of the few places in the Mediterranean where sea turtles lay their eggs. They have been a protected species on the island of Cyprus since 1971. Tourists are asked not to drive onto beaches between May and August, as that is when the animals hatch and quickly make their way across the sand into the sea. Weather-wise Paphos as European Culture Capital has its advantages. In January at the start of the events temperatures measure around 15 degrees Celsius - ideal for many open-air music, theater and dance events. On May 1st, 2017 the Berlin Philharmonic Orchestra will be giving their Europe Concert on the promenade - certainly a highlight for the region's 60,000 inhabitants and the many visitors. Cyprus is some 70 kilometers south of Turkey and fewer than 100 kilometers west of Syria. Cuisine here has been greatly influenced by oriental flavors. Typical are meze: platters of tidbits such as salads, vegetables, grilled halloumi cheese, mashed olives, meatballs and sweet soutzoukos - almonds covered in a jelly made of boiled grape juice, rosewater, cinnamon and pistachio tree gum. The holiday season is long on Cyprus. Even in the autumn, temperatures reach 35 degrees Celsius and the water temperate of the Mediterranean here is 27 degrees. In 2016, because of security concerns in neighboring countries such as Turkey, Egypt and Tunisia, more tourists than expected (3 million) traveled to the Greek part of the island. The northern part has been occupied by Turkey since 1974. In 2017 holidaymakers can look forward to more than 300 cultural events in Paphos. The international airport makes getting there easy. You can even go skiing until March. The slopes in the Troodos Mountains are almost literally divine - the ski lifts called Hera, Hermes and, of course, Aphrodite. The most challenging slope is named after the king of the gods, Zeus. ",
    "title": "Paphos 2017 -  European Capital of Culture  – DW – 01/03/2017",
    "url": "https://www.dw.com/en/paphos-2017-european-capital-of-culture/g-36760884"
}