{
    "text": "After two decades of struggle, the Butchalla people have won an important battle in the campaign to rename Queensland’s tourism hot spot. The resolution of the title claim at a beachside hearing on Friday is a significant step, but convincing the wider public and overseas tourists, is a whole new challenge The Butchalla people who thrived on its shores for at least 5,000 years call the place K’gari. Literally, “paradise”. Almost everyone else knows the island by the surname of a shipwrecked Scottish woman, Eliza Fraser, whose tales of “captivity” by the Butchalla in the 1830s spread throughout the colony in inverse proportion to their reliability. But Fraser Island’s original appellation is on the way to being formally restored, with a native title claim by the Butchalla resolved in a beachside hearing on Friday by a federal court judge, Berna Collier. This is likely to lead to the island becoming the latest in a series of Australian landmarks whose ancient names have been hoisted in modern times alongside their colonial ones. Just how long it might take for Fraser Island to become K’gari in law – let alone in the imaginations of all Australians as well as the many foreigners drawn to it like a magnet each year – is moot. Recent history has shown that the renaming of famous Australian places – such as Ayers Rock to Uluru – can be slow to gain purchase, especially overseas. But for Bronwyn De Satge of the Wondunna, one of six clans of the Butchalla that have spent the past two decades fighting for native title, the name can wait, for now at least. “This is what we’re hoping to be able to achieve down the track. There is a general consensus among the Butchalla people that that would be the preferred name: K’gari,” she says. The Butchalla’s claim to K’gari was endorsed days before the 2012 state election, in one of the final acts of the outgoing Labor state government of Anna Bligh. The long battle for recognition was ignited by luminary elders such as the late Aunty Olga Miller. De Satge says it is a day of “great significance” for the Butchalla, leaving her “absolutely overjoyed but tinged with sadness” that Miller and others are not there to see it. Some 400 Butchalla people are expected to bear witness to a modern ceremony to formally recognise the hold of traditional law and lore over a glittering, World Heritage-listed jewel in the natural Australian landscape. A formal pact will uphold their descendants’ right to hunt, camp, build campfires and temporary shelters, conduct birth and initiation rites, bury their dead and maintain places of cultural significance across 1,640 sq km of sand dunes, rainforest and freshwater lakes. The natural bounties of the world’s largest sand island helped make it Australia’s most densely populated area outside the Gulf of Carpentaria before the British invasion, according to the late anthropologist Norman Tindale. “Such densities seem possible chiefly when fish and reef products are freely available,” he wrote in his 1974 book Aboriginal Tribes of Australia. James Bracefell, one of the early “bundas” or ex-convicts to live among the Butchalla, told before his death in 1842 of seeing thousands of people gather to watch ceremonial combat on the beach. Within 50 years of colonial land grabs, massacres by police and internment in government- and church-run concentration camps, the Butchalla’s numbers had dwindled from more than 2,000 to 117. The survivors’ final forced exile to north Queensland in 1904 by the decree of their Anglican “protectors” was “one of the blackest pages in the history of the British empire”, wrote one angry correspondent to the Maryborough Chronicle. Ironically, a key driver for the Butchalla’s demise, according to historians, was the story told by the very Eliza Fraser after whom the island came to be named. She claimed mistreatment at the hands of local people after surviving the wreck of her husband’s alcohol-laden ship on a nearby reef in 1836. The spread of those stories – though they were contradicted by contemporaneous accounts from fellow survivors – helped seal both the island’s English name and the fate of its traditional owners. The restoration of native title 110 years after banishment is more than a symbolic salve for the modern Butchalla. Queensland South Native Title Services, which helped propel the claim, notes it also presents economic opportunities “through eco-tourism and related business development supply chains”. The island, after the eviction of loggers allowing the regeneration of rainforest and the denial of miners eyeing silica projects in the 1970s, provided one of Queensland’s first “eco-tourism” destinations. Daniel Gschwind, the chief executive of the Queensland Tourism Industry Council, says it’s easy for locals to forget the special nature of the island’s popular resorts, which offers World Heritage-listed wilderness “literally at your room’s front door”. But the resorts and the island more broadly generate “huge appeal” to overseas visitors lured by the prospect of “sand dunes, the freshwater lake swimming, the driving on the beach, the camping, the wildlife, the dugongs to the south, the whales on the ocean side”. “We sometimes become blase about this but you have magnificent fauna and flora right on your room’s doorstep: birds, wallabies, dingos, very close and very real,” Gschwind says. “The freshwater lakes, the sand island, the fact there’s such a prolific rainforest on a sand island, its post-colonialisation history of logging being re-converted to a pristine environment; there’s a very interesting history attached to this and it’s certainly highly recognised as one of the must-do things on many backpackers’ list.” So what will the likely name change mean for the island? For all its ignominious origins, the name Fraser Island is certainly a “brand”, according to Gschwind, and one that resonates strongly overseas. “Particularly in the European market, we have many visitors, it’s remarkable, the first thing they say is: ‘We’re doing Brisbane, Fraser island and the Great Barrier Reef. In Queensland that’s what we do’,” he says. Sooner or later, it’s probably going to be K’gari. However, aside from the minor challenge of pronunciation – the “k” in K’gari is silent, and the “r” sounded with a slight roll of the tongue – recent history has shown that colonial names die hard. Despite the “dual naming” of Ayers Rock as Uluru 21 years ago, the latter is still likely to invoke mystified looks in the UK, for example. Gschwind says there are signs this is changing. “Increasingly, yes, [Uluru] does appear in travel guides, in tour offerings, the two names do appear and sometimes people ask, sometimes people need to be informed,” he says. But for practicality’s sake, both names will continue to be used in tandem on K’gari, Gschwind says. “I think it’s certainly possible to run with two types of names … like in the Uluru/Ayers Rock scenario, both terms still appear,” he says. “It’s not an unusual thing for names to change, not just in Australia but around the world: look at cities like Istanbul, which has changed names many times. “So it’s not unusual and I think as long as it’s handled with some sensitivity and some common sense, that we make sure people understand it’s the same place, it doesn’t present a problem.” De Satge agrees. “When there’s talk around confusion, I say, well, no, all our overseas visitors that visit regional areas in Australia know that Uluru is Ayers Rock, they know that Boodjamulla is Lawn Hill national park,” she says. After the marathon effort of winning native title, having K’gari formally gazetted as the name alongside Fraser Island seems some way off for the Butchalla. De Satge says it’s “early days yet but it’s something that we’re looking to be working on … after negotiations and when the time is right, because it is a long process”. “I believe it’s going to be quite lengthy but I don’t I think it would hurt to say, this is what the Butchalla would like to see,” she says. Poetic justice alone would make it so, long before the ink dries on any government papers. ",
    "title": "Paradise restored: K'gari native title success the start of a new story for Fraser Island | Indigenous Australians | The Guardian",
    "datetime": "2014-10-24T01:50:29.000Z",
    "url": "https://www.theguardian.com/australia-news/2014/oct/24/-sp-paradise-restored-kgari-native-title-success-the-start-of-a-new-story-for-fraser-island"
}