{
    "text": "While candidates battle over book lists, kids fall behind in the classroom and worry about bullying and school shootings. by \n    Sunni Bean November 4, 2022 5:15 AM Matthew Barakat/AP Photo Students at McLean High School in McLean, Virginia, walk out of classes on September 27, 2022, to protest Republican Gov. Glenn Youngkin’s proposed changes to the state’s guidance on district policies for transgender students. Long-standing concerns about K-12 academic issues have burst into the open as pandemic-weary school district administrators try to recover from declines in student achievement, teachers fleeing the profession, threats to school safety, and other issues exacerbated by the COVID-19 pandemic. But this election season, many parents are frustrated that culture war debates on race and gender have taken precedence over getting students back on track in math and reading after months of the online-only instruction that left many children struggling to catch up. And Democrats are going into Election Day with a PR problem: Despite decades of K-12-friendly fiscal policies and strong alliances with teachers unions, Democratic candidates are finding themselves on the defensive as Republicans move to rebrand themselves as a so-called “party of parents.” A September ParentsTogether/Ipsos poll found parents’ top concerns are bullying and mental health (30 percent), and gun violence (29 percent), followed closely by seeing children being prepared for success in life (25 percent) and interference from politicians in K-12 education (23 percent). Moreover, they found that overwhelming majorities of Democratic and Republican parents support talking about issues of race and gender in age-appropriate ways and believe that, as the survey authors noted, “lessons about racism prepare children to build a better future for everyone as opposed to feeling that lessons about racism are harmful to children.” Democratic candidates are finding themselves on the defensive as Republicans move to rebrand themselves as a so-called “party of parents.” A recent Democrats for Education Reform survey found that nearly half of parents report they have more trust in Republicans to handle making up for ground lost during COVID even though the party has spent weeks focused on steering parents to assert themselves on much narrower issues, such as how American history is taught in schools. While candidates bicker, parents watch their children’s schools become mired in ideological battles over lesson plans instead of longer-term intellectual growth. Chris Jackson, an Ipsos senior vice president, told the Prospect, “Clearly, Americans seem to recognize that a lot of these efforts that are happening—the book bans, what was colloquially referred to as ‘Don’t say gay’ legislation—and all these kinds of things are political stunts.” He adds, “They’re not really about protecting children, they’re about politicians advancing their own careers.” GOP lawmakers have introduced bills in 42 states to ban a legal theory that is not taught in public elementary and high schools. Republican candidates have supported 1,600 book bans in schools nationwide over the last school year, with the specific goal of removing certain titles that deal with gender and race. But Democratic candidates who try to focus on education policy are often drowned out by far-right Republican opponents who denounce specific instructional methods, books, and other instructional tools. They have also doubled down on critical race theory, a legal concept studied in law schools that explores how racism is embedded in the country’s law and institutions. Two years of virtual learning gave parents the unparalleled opportunity to get a much closer look at K-12 instruction and learning. But for most parents today, it isn’t the curriculum their child’s school uses that they are most concerned about; it is reading and mental health support, and the aftermath of the Uvalde massacre. (There have been 40 school shootings this year, according to Education Week’s data, the most since the news outlet started tracking them in 2018.) There are warning signs at all grade levels. High school seniors’ ACT scores have sunk to a 30-year low, and reading levels for nine-year-olds had the steepest drop since 1990, a critical age for reading comprehension and a predictor for future academic success. Children who struggle to read by third grade are four times as likely as their peers to drop out of high school, and make up 88 percent of students who fail to receive a high school diploma. Failing to obtain a high school diploma limits job prospects and increases susceptibility to at-risk social behaviors. Profound social problems exist as well. “Kids are coming to school hungry, needing love and attention, and without the proper clothes,” says Beth Deel, a mother of two and an art teacher at an elementary school in Roanoke, Virginia. “In some cases, they’re dealing with trauma on a daily basis in their home lives.” She continues, “It’s absurd to be talking about the things that politicians are talking about, that are so abstract. What we’re doing though, is we’re meeting kids where they’re at and with what they need.” Deel points to last year’s governor’s race in Virginia as the preview for this year’s contests. Republican Glenn Youngkin narrowly beat former Democratic Gov. Terry McAuliffe after effectively labeling him as the candidate who opposed “parents’ rights.” “We need suburban white women, and the parent vote, and here’s how we’re gonna get it” is how she describes the GOP’s strategy. “So, if [Republicans] win, that’s the formula they’re going to try and push for the next presidential election.” Yet Democratic candidates are the ones getting blamed for culture-war messaging, even though the GOP is the party that is doubling down on a “parental rights” message that has little to do with grade-level instruction in reading and math. The DFER poll found that 54 percent of respondents thought Democrats were more focused on how race and gender issues are being taught rather than getting students back on track; 48 percent thought Republicans were more focused on the culture-war issues than academics. “Democrats aren’t getting across the message that their policies can actually remedy it,” says Victoria Fosdal, the national director of communications for Democrats for Education Reform. “Democrats are committed to equity; because we’ve led on education, and we need to be louder about the investments that we are making.” Sunni Bean is an editorial intern at The American Prospect. November 4, 2022 5:15 AM TAP depends on your support We’ve said it before: The greatest threat to democracy from the media isn’t disinformation, it’s the paywall. When you support The American Prospect, you’re supporting fellow readers who aren’t able to give, and countering the class system for information. Please, become a member, or make a one-time donation, today. Thank you! About the Prospect / Contact Info Browse Archive / Back Issues Subscription Services Privacy Policy DONATE TO THE PROSPECT   Copyright 2023 | The American Prospect, Inc. | All Rights Reserved ",
    "title": "Parents Fear Culture Wars Have Hijacked K-12 Learning - The American Prospect",
    "datetime": "2022-11-04T05:15:00",
    "url": "https://prospect.org/education/parents-fear-culture-wars-have-hijacked-k-12-learning/"
}