{
    "text": "To revisit this article, select My Account, then View saved stories To revisit this article, visit My Profile, then View saved stories By Andrea K. Scott “Honey, I twisted through more damn traffic today,” reads the new white-on-pink mural by Ed Ruscha, above the High Line at Twenty-second Street. On a recent afternoon, the text doubled as a caption for a live-action cartoon, as a man on a scooter wove his way through a gaggle of tourists. Nearby, teen-agers held up handwritten signs advertising free hugs and yelled, “It’s emotional Tuesday!” Performance art? No, students from the neighborhood’s Fashion Industries high school, blowing off steam. It can be hard to distinguish what’s art and what’s not on the High Line. “Archeo,” a new exhibition of eight outdoor sculptures by seven young artists, organized by the park’s nimble curator, Cecilia Alemani, plays to the idea of the High Line as a latter-day Readymade. Marcel Duchamp turned his bicycle wheel, snow shovel, and bottle rack into art with scant alteration. But the former elevated railway, once overgrown and abandoned, is now so groomed and urban-chic that it’s a ready-made backdrop for Instagram. The site’s history surfaces in one of the show’s strongest works: Marianne Vitale’s “Common Crossings,” five salvaged railroad switches (they allow trains to change tracks), installed vertically. Below Twenty-fifth Street, the steel totems stand sentry, strange hybrids of Richard Serra and Easter Island. A few blocks south, in another twist on the Readymade, Yngve Holen sets down a pair of gleaming industrial washing-machine drums in a glib piece, titled “Sensitive 4 Detergent,” that does little more than turn a patch of the High Line into a hillbilly front yard. “Plop art” is a derogatory term for public sculpture, coined in the late nineteen-sixties to describe inert minimalism in corporate plazas. In “Archeo,” Isabelle Cornaro is guilty of plopping. Her “God Boxes,” above Gansevoort Street, are black monoliths embellished with casts of stars and twisted rope—the effect is Louise Nevelson lite. Gavin Kenyon’s gray, fur-flecked blob on a polychrome base, at Thirtieth Street, is ironically titled “Realism Marching Triumphantly Into the City,” and seems aimed at deflating the grandiosity of classical monuments. A bull’s-eye it’s not. In the shade of a magnolia tree near Twenty-sixth Street, a flesh-pink slab by Antoine Catala sidesteps inertia through a combination of technical ingenuity and old-fashioned creepiness: a curved green prosthesis on the front of the sculpture slowly expands and contracts, as if breathing. A few yards to the south, Jessica Jackson Hutchins has a homier take on the concept of sculptures as bodies: her ceramic assemblage kicks back in a hammock, slung so far under the walkway that it’s easy to miss. Bodies at rest become the city’s restless bodies in motion in Josh Kline’s brilliant “Skittles,” near the Standard hotel. An illuminated deli display case is stocked with rows of colorful drinks in ridiculous flavors—“Williamsburg,” “Big Data,” “Nightlife”—made from surprising ingredients. (“Condo” blends coconut water, HDMI cable, infant formula, turmeric, and yoga mats.) Think of “Skittles” as Duchamp’s “Bottle Rack,” updated for the age of aspirational marketing, when even a smoothie can be spun as a status symbol. The case is locked and the bottles are beyond reach, but you can press your nose to the glass. ♦ By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. By Nicole Rudick By Jackson Arn By Emily Lordi By Vince Aletti Sections More © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. The New Yorker may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "title": "Parklife | The New Yorker",
    "datetime": "2014-06-02T00:00:00.000Z",
    "url": "https://www.newyorker.com/magazine/2014/06/09/parklife"
}