{
    "text": "Center for American Progress Donate  See all topics See all states See all topics  Search\n\nSearch Center for American Progress Many of the popular notions that underlie American gun culture are based on a reality that never existed. Advancing Racial Equity and Justice, Gun Violence Prevention, Racial Equity and Justice Vice President, Communications jcusick@americanprogress.org Director, Federal Affairs pgordon@americanprogress.org Senior Director, Safety and Justice Campaign; Director, State and Local Government Affairs jparshall@americanprogress.org After last year’s massacre at Sandy Hook Elementary School in Newtown, Connecticut, Lisa Hix wondered about the nature of Americans’ fascination with guns. She must have wondered the same thing yesterday when she heard that a student at a middle school in Sparks, Nevada, opened fire with a handgun just after the morning bell welcomed his classmates for the day’s classes, killing a teacher, wounding two students, then killing himself. Hix isn’t unfamiliar with gun culture, nor is she a prudish zealot. She grew up in Stillwater, Oklahoma, where many people consider guns to be as much a part of the natural world as rocks, trees, or blades of grass. She’s never owned or fired a weapon, but she thinks they’re legal products that responsible people have a right to own. But after 20-year-old Adam Lanza fatally shot 20 children and 6 adults at Sandy Hook, she heard some people argue that schoolteachers should arm themselves. But wait, she thought—“my mom is a schoolteacher, and wouldn’t that create more danger for her?” The vision of her mother in the crossfire of a school shootout wouldn’t leave her head. Hix is an associate editor at Collectors Weekly, a magazine that focuses on the social and cultural history of objects such as clothing, machines, and antique collectibles, and she proposed writing an article about guns. For the three years she had written for the print and online versions of the magazine, no one had examined the role that firearms have played in our national mythology. It only made sense, Hix reasoned, to learn the true story of gun culture in America and to explain “Why Americans Love Guns.” What she discovered is a fascinating, counterintuitive history lesson, far removed from the idealized textbook tales passed along in schools and the erroneous romantic notions of Hollywood filmmakers: It’s true that the history of United States is inextricably entwined with the history of gun manufacturing. And perhaps that’s why the fervor for unrestricted gun rights never dies down, even when chaos breaks out. Without firearms and the determined settlers carrying them, this country would be a fraction of its size, never realizing what we called the Manifest Destiny to span the American continent coast to coast. But the real history of the Old West is far less noble and clear-cut than the legends we hold in our collective imagination. Hix reports that in the early days of this nation, exploration and settling in the westernmost frontier lands was a “boundless source of possibility and hope.” All a man needed was his will, his wits, and his wife to tame the West and create a family in the wilderness. These settlers packed into their covered wagons and brought American longrifles—also known as Kentucky rifles—to be used for hunting and self-defense. As Hix observed, it “was simply a necessity.” What’s more, it was a booming business. As settlers and explorers pushed the United States’ boundaries toward the Pacific in the 1800s, eastern industrialists like Samuel Colt in Hartford, Connecticut; Horace Smith and Daniel B. Wesson in Springfield, Massachusetts; and Oliver Winchester in New Haven, Connecticut, saw easy profits of gun manufacturing. As Hix reported: While the rough-and-tumble Westerners had no love for the elite industrialists of the East Coast, ironically, it was those companies and their precision manufacturing that gave the white settlers the upper hand in the 1800s, as they revolutionized gun technology between 1830 and 1870. Certain Native American tribes had access to firearms—which they would also use to lord over enemy tribes—but the white man got the lightest, fastest, and most accurate guns first. And so an American myth emerged. The wild, wild West was won through the barrel of a Colt .45 or a Winchester repeating rifle. This tale, told often and colorfully enough without regard to supporting facts, assumed a patina of truth because it affirmed the young and expanding nation’s image of itself. All this gun-blazing storytelling was mostly fanciful imaginings, manufactured in pulp literature and codified on celluloid reels. To emphasize how reality was something far less dramatic, Hix quoted Bob Boze Bell, executive editor of True West magazine, who cast doubt over the shoot ‘em up version of the taming of the West: “There are a thousand movies made about them, so you’d think that there were gunfights every day,” Bell says. “And when you read the diaries or you talk to the old-timers, they’ll say things like, ‘Why, I never saw anybody pull a gun in anger, and I lived on the range for 40 years.’ Did most people settle their differences in court? Yeah, probably. Did they use their fists more than their guns? Yes. Were there a lot of deaths from shooting in saloons? Oh yeah. It was a wild time. It’s safe to say that the West had its moments. And what we celebrate in legend are those dramatic moments. They weren’t all the time, and they were not like Hollywood portrays, but if you portrayed it real, nobody would go see the movie.” In a phone interview, Hix told me that the reactions to her article, which was posted earlier this month on the magazine’s website, have been “both positive and quiet,” despite her pre-posting apprehension that the article might upset both gun advocates and gun haters. She added: I wasn’t trying to push my opinions about guns. But I was trying to get at the truth of the frontier reality because the frontier is so distinctly American. And we don’t really understand what that life was really like, except from the movies, and that’s not an accurate representation. We need to have a better understanding of guns in our nation’s culture. New York Times art critic Edward Rothstein seems to agree. He picked up on a cultural movement to bring more veracity into Western folklore, noting in two recent museum reviews that a surging revisionist undercurrent is redefining the role guns played in our national narrative. From the Autry National Center in Los Angeles, he wrote: At stake is the mythology of the American West — a founding myth at once great and fearsome, inspiring and rived — which for decades has been challenged by a conglomeration of competing claims. … One new gallery, “Western Frontiers,” for example, tries to reconfigure the traditional vision of the West by replacing the shootout at the O.K. Corral display with a sober exploration of the role of guns. Its tone is self-consciously low-key. And at the Buffalo Bill Museum in Cody, Wyoming, Rothstein was struck by the efforts to tell the story of gay people in the old West alongside “one of the world’s largest collections of American and European firearms”: The exhibition affirms what the center as a whole demonstrates: that behind the mythologizing is something worth cherishing, even if it is flawed, complex and still evolving. For Hix, writing about guns proved to be an extension of her cultural canon, one that is more objective about America’s self-portrait. “I’ve come to a greater understanding of how hard it is to extract guns from America’s notions of itself,” she said. “I realize now how difficult it is to change gun laws. I don’t know if it’s impossible, but it will require changing our understanding of our nation’s culture first.” That sounds right to me. To reduce gun violence, we must learn the facts of our history and place guns in the proper cultural context. Then, perhaps, sanity will guide our understanding toward preventing senseless gun violence. Sam Fulwood III is a Senior Fellow at the Center for American Progress and Director of the CAP Leadership Institute. His work with the Center’s Progress 2050 project examines the impact of policies on the nation when there will be no clear racial or ethnic majority by the year 2050. The positions of American Progress, and our policy experts, are independent, and the findings and conclusions presented are those of American Progress alone. A full list of supporters is available here. American Progress would like to acknowledge the many generous supporters who make our work possible. Senior Fellow Oct 14, 2023 Patrick Gaspard Oct 23, 2023 Natasha Murphy Oct 19, 2023 Rose Khattar,  Maureen Coffey Oct 19, 2023 Nick Wilson,  Chandler Hall,  Hai-Lam Phan,  4 More\nMatt Gossage,  Ashley Joo,  Ronnie Rivera,  Ala Al Sadi Center for American Progress The Center for American Progress is an independent nonpartisan policy institute that is dedicated to improving the lives of all Americans through bold, progressive ideas, as well as strong leadership and concerted action. Our aim is not just to change the conversation, but to change the country. Sign Up This site is protected by reCAPTCHA and the Google\tPrivacy Policy and Terms of Service apply.  Learn about our sister organization, the Center for American Progress Action Fund, an advocacy organization dedicated to improving the lives of all Americans. ©2023 Center for American Progress ",
    "title": "Parsing Myth from Reality in U.S. Gun Culture - Center for American Progress",
    "url": "https://www.americanprogress.org/article/race-and-beyond-parsing-myth-from-reality-in-u-s-gun-culture/"
}