{
    "text": "To enjoy additional benefits CONNECT WITH US July 22, 2016 08:37 pm | Updated July 23, 2016 01:34 pm IST COMMents SHARE READ LATER New Delhi, 21/07/2016: Metro Plus --- K Pop fans at the Korean Culture Centre in New Delhi on July 19,2016. Photo: R. V. Moorthy Twenty-year-old Vidheesha Kudipudi has the seven names and the complicated spellings of BTS — her favourite K-Pop band – on her fingertips. She knows their albums and songs by rote even though she isn’t familiar with the language. But never mind! There are apps which provide her with accurate English translations for K-Pop tracks. “The initial lines are always in English, so you know the essence of the song,” adds Vidheesha. Vidheesha is as ardent a fan can get about K-Pop, the genre of music from South Korea, which is making inroads into the country. “I have become happier ever since I started to listen to K-Pop. I lived in the U.S. for some time and used to be depressed about not having many friends, and once I started listening to K-Pop, I had a long list of pals,” says the fourth-year student of Computer Science Engineering. At the young girl’s residence in Thippasandra in Bangalore, there is not an inch of space left on the walls of her room, as they are filled with posters of BTS and other South Korean pop stars. For a long time, the Hallyu (flow of Korea) Wave remained restricted to the Northeast region, but over the years, it has spread to other parts of the country too. Psy’s ‘Gangnam Style’ going viral in 2012 deserves major credit for it. The first K-Pop group that visited India was N-Sonic in 2014, as a judge for the K-Pop contest grand finale organised by Korean Cultural Centre India (KCCI) in Delhi. Because of the immense demand from their fans, the band had to come back in January 2015 for a three-city tour (Chennai, Ahmedabad, Guwahati) followed by a fan meet in Delhi.  For Chennai-based Sanjay Ramjhi, it was a passion that turned into a profession. Though he has a background in marketing, Sanjay today works as a freelance Korean interpreter. “I started with Japanese and then diverted towards Korean, like a lot of others,” says Sanjay. In 2007, he floated the Dorama Club with just 10 members, with the prime focus on Japanese culture. In 2016, the club has more than 200 active members, who collectively organise one big-scale event every three months, alongside small regular fan meet-ups. The focus has completely shifted to Korean culture. “The group can be easily divided into two — K-Pop fans and K-Drama fans. Very few like me like both. Ninety five per cent of the members are women and they absolutely love K-Pop stars. They find Korean men good-looking. There is nothing great about the lyrics in K-Pop, but what fans love about their acts are the fashion statements and its choreography,” explains Sanjay, adding that the 6,000-strong community of Koreans residing in Chennai is another reason for K-Pop’s rising popularity in the State. Its special link with Korea can be gauged from the presence of three Korean banks – Shinwa, Hana and Woori, in addition to automobile and steel giants like Hyundai, Posco and Kotra, a trade and investment promotion outfit. But even then, why and how this genre of music is finding roots in a country where film industries are already producing well-coordinated choreography, glamorous outfits and catchy numbers can be baffling. Lucy Nelia, editor-in-chief at www.destinationkpop.com (India) puts things in perspective. “I think the appeal of K-Pop lies with its concept of fresh, colourful, youthfulness, with a certain amount of innocence that you do not see in other music industries anymore. Despite the usual cynicism, the fact remains that it connects with the youth in a huge way.” Hailing from Manipur, Lucy is helping KCCI with the ongoing K-Pop contest. The contest, which began in 2013 with 50-60 applications, received around 200 entries this year. Those participating include those who have been long-time K-Pop lovers and recent converts like Bharti Gupta in Delhi and Aarcha S. Kumar in Bangalore. A knock-on effect of K-Pop’s entry into India is the increased interest in the Korean language. “There are about 70-100 people learning the language at InKo currently. And then there are those who are learning business Korean too. It is a very recent shift towards Asia that has taken place in our country,” says Rathi Jafer, director of InKo Centre in Chennai. It was due to software engineer N. Jayashree’s online petition that the K-Pop contest came to the South of India. Passionate about Korean culture, she felt bad about the absence of Korean language classes in India. “It led to Bangalore hosting the regional round of the K-Pop contest with the help of Samsung. While there were 10 entries from the city last year, the number went up to 50 this year,” says Jayashree, who was closely involved with the event held recently in Bangalore. An active K-Pop fan, Jayashree reveals that there is a vibrant community of K-Pop lovers, who meet at Korean restaurants to discuss all things Korean. A lot of them go to Brigade Road to buy their favourite K-Pop star’s jacket, shoes and other related accessories. But fans like Vidheesha order it on the U.S. eBay site. “I have bought jackets, albums and posters online, and now that I am planning to go abroad for higher studies, I want to give it to other K-Pop fans in the city. I am running quizzes and other small contests related to K-Pop. I am asking people to send me sketches of their favourite pop stars. The winners will receive albums and other paraphernalia from the collection. But I can’t part with my BTS stuff. I love their music. They do songs about prejudice against youth. Even their debut song ‘No more dream’ was about finding one’s own path,” expresses the young fan. She is also hosting a small K-Pop get-together at her home today.Vidheesha’s craze for K-Pop is complemented by Prerna Tiwari in Delhi. One of the most active K-Pop fans in the Capital, she is engaged with the group’s physical and virtual activities, K-Pop flash mobs and supporting KCCI. “I have even designed sweat shirts with ‘I love K-Pop’ written over it. K-Pop, unlike Bollywood, feels very real. Every band releases two videos, one which is the complete track and the other which has just their dancing. We see those videos and practise. They release behind-the-scenes videos, seeing which you feel that they are like you and me and not sitting in a castle,” says Prerna. Popular K-Pop bands BTS: Also known as Bangtan Boys, it is a seven-member boy band and possibly commands the highest following in India. Their popularity transcends boundaries. Twitter even launched the first-ever K-Pop emoji featuring the band. Exo: Another band that has found die-hard fans in India. This South Korean-Chinese boy band debuted in 2012 with 12 members but later separated into two Exo-K and Exo-M. Girls’ Generation: Also known as SNSD, with eight members, it is the biggest hit among girl bands. ‘Gee’, ‘I got a boy’, ‘The Boys’, and ‘Mr Taxi’ are some of their popular numbers. The group has even released a music album in Japanese. SHINee, Got7, Big Bang (one of the oldest), AOA (Ace of Angels), SS501, are other popular bands with an incredible following here. What is K-Pop? K-Pop stands for Korean pop, a genre which originated in South Korea. It includes different styles like dance-pop, pop ballad, electro-pop, R&B, and hip-hop music. The videos are characterised by excellent choreography, chic fashion and groovy music. K-pop fan groups in India Bangalore BKF – (a group of 120 fans on WhatsApp) Bangalore Kpop Fans (200 fans connected on Facebook) Chennai Dorama Club – (200 members which meet regularly at InKo Centre at Adyar Club Gate Road) Dorama Club (a hyperactive WhatsApp group of about 80 members) Delhi Delhi K-Drama and K-Pop fan club – (more than 350 members on Facebook) Delhi KDrama KPop Fan Club – (Fan page on Facebook) K-Pop contest India The grand finale of the K-Pop contest is going to happen in Chennai for the first time. Happening since 2012, the contest is travelling to South India. It will be held in Sir Mutha Venkatasubba Rao Concert Hall on July 30. Eddy and Simba of the popular Korean band JJCC formed by Jackie Chan will judge the event. The final round will have winners of regional rounds from seven cities – Delhi, Kolkata, Bangalore, Patna, Mumbai, Sikkim and Chennai. COMMents SHARE The Hindu MetroPlus BACK TO TOP Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. ",
    "title": "\n\tPepped up on K-pop | The music genre of K-pop is increasingly becoming popular in India - The Hindu\n",
    "datetime": "2016-07-22T15:07:22.000Z",
    "url": "https://www.thehindu.com/features/metroplus/Pepped-up-on-K-pop/article14504718.ece"
}