{
    "text": "Indian classical music filled All Faiths Chapel Tuesday night. The K-State chapter of the Society for the Promotion of Indian Classical Music and Culture Amongst Youth hosted three preeminent Indian classical musicians as part of the Raga Spring Fest, an exhibition of Indian classical music. The musical group aims to expose the public to the rich, thousands-year-old tradition of Indian music, Subhen Chatterjee, tabla player, said. “We want to project not only the musical beauty, but the rich tradition the music holds,” Chatterjee said. Chatterjee said he has been playing the tabla, a traditional Hindustani percussion instrument, since he was 5 years old. He said he has devoted his life to learning and mastering the instrument. “You have to start by practicing under a guru, a master of the instrument,” he said. “Then from there you have to apply your life to it. You are a demonstration of the music.” The group’s two-and-a-half hour performance consisted of movements of traditional Indian music, most of which was improvised by the musicians on the spot, Chatterjee said. “In Indian music, nothing is fixed,” he said to the audience. “Everything is fixed, but really nothing is fixed. Look up here, we have no paper music.” Mita Nag, sitar player, said she hopes the audience can relate to the spiritual side of Indian classical music. Nag, who has played the sitar for nearly 42 years, said the music helps musicians share their souls with the people who are listening. “We want to share the sound of the music and our souls with the people,” Nag said. “When you play this music, you feel unified with the audience, but also with the universe.” The group paused for a brief intermission, then resumed the performance by taking questions from the crowd relating to musical composition, the history of Indian music and their experiences playing the music. The performance closed with a musical tour of India, where the group played music inspired by different parts of the country. Joydeep Mitra, president of the Society for the Promotion of Indian Classical Music and Culture Amongst Youth and graduate student in computer science, said he believes public concerts exhibiting Indian music expose people to new styles of music and sounds they may not have heard before. “From an American perspective, it is an opportunity to have a more diverse view of music that is different from the Western style,” Mitra said. “Indian music is very improvised, very diverse and structured much differently than what people are used to.” Mitra said Tuesday night’s performance was the second of its kind hosted by SPIC MACAY, the first of which drew a larger crowd; however, he was satisfied with Tuesday night’s turnout. “It’s always good to have more people show up, but I’d definitely say tonight has been very successful,” Mitra said. ",
    "title": "Performers share culture through Indian music - The Collegian",
    "datetime": "2016-04-20T06:47:01+00:00",
    "url": "https://www.kstatecollegian.com/2016/04/20/performers-share-culture-through-indian-music/"
}