{
    "text": "Thank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\n            the best experience, we recommend you use a more up to date browser (or turn off compatibility mode in\n            Internet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles\n            and JavaScript. Advertisement Scientific Reports\nvolume 6, Article number: 20519 (2016)\n            Cite this article 4001 Accesses 81 Citations 7 Altmetric Metrics details Most bacterial cells are stressed and as a result, some become tolerant to antibiotics by entering a dormant state known as persistence. The key intracellular metabolite that has been linked to this persister state is guanosine tetraphosphate (ppGpp), the alarmone that was first linked to nutrient stress. In Escherichia coli, ppGpp redirects protein production during nutrient stress by interacting with RNA polymerase directly and by inhibiting several proteins. Consistently, increased levels of ppGpp lead to increased persistence; but, the mechanism by which elevated ppGpp translates into persistence has not been determined. Hence, we explored persistence in the absence of ppGpp so that the underlying mechanism of persister cell formation could be explored. We found that persister cells still form, although at lower levels, in the absence of ppGpp. Additionally, the toxin/antitoxin systems that we investigated (MqsR, MazF, GhoT and YafQ) remain able to increase persistence dramatically in the absence of ppGpp. By overproducing each E. coli protein from the 4287 plasmid vectors of the ASKA library and selecting for increased persistence in the absence of ppGpp (via a relA spoT mutant), we identified five new proteins, YihS, PntA, YqjE, FocA and Zur, that increase persistence simply by reducing cell growth. Microbial infections are the leading cause of death worldwide1 and one of the main causes of these recurring infections are persister cells2, those cells that are highly tolerant to traditional antibiotics. This tolerance to antibiotics is not due to genetic change3 but instead due to metabolic inactivity as demonstrated by both the initial discoverers of persisters3,4 and by a subsequent study showing a reduction in protein translation and ATP production converts nearly all exponentially-growing cells to persister cells5. Persister cells may arise stochastically6 but are formed primarily through environmental influence5,7,8,9,10,11. The mechanism of persister cell formation has been elusive in that deletion studies have yielded little insight to date12, but two common elements are dependence on guanosine tetraphosphate (ppGpp) and on toxins of toxin/antitoxin (TA) systems. In Escherichia coli, ppGpp is produced as a response to nutrient starvation and other stresses (e.g., acid stress) and serves to shift transcription away from loci required for rapid growth and toward those needed for stress survival13. In E. coli, ppGpp is produced via RelA and SpoT (which can also degrade ppGpp)13,14. RelA and SpoT homologs involved in ppGpp metabolism have been characterized in other bacteria as well14. ppGpp alters transcription via interactions with RNA polymerase and by activation of RpoS (sigmaS), the stress response sigma factor for the stationary phase and RpoE (sigmaE), the stress response sigma factor for misfolded proteins in the periplasm13. ppGpp also directly reduces DNA replication and protein synthesis13,14. Generally, the function of ppGpp as a repressor or activator of target genes is dictated by the presence of GC-rich or AT-rich sequences present in the promoter region14. TA systems are found in most bacteria and are primarily used by the cell to reduce metabolism15. TA systems were first linked to persistence in 198316 through mutagenesis and the identification of high persistence (hip) mutant hipA7 that increases persistence. The hipBA locus encodes a toxin/antitoxin module, in which the HipA toxin phosphorylates the active center of the aminoacyl-tRNA synthetase GltX to inhibit translation17; however, the two substitutions of the HipA7 toxin variant (G22S and D291A) render the protein non-toxic, so the mechanism by which HipA7 increases persistence is not known and is not via increased toxicity of a TA pair18. Other links between TA systems and persistence include that production of most toxins increase persistence; for example, production of toxin RelE increases persistence 10,000-fold19. Also, deleting several individual TA loci has been shown to reduce persistence: mqsR and mqsRA20,21,22, tisAB/istR7 and yafQ23. Critically, ppGpp was linked to toxin/antitoxins in 199624 since ppGpp is required for MazF toxicity (MazF is an endonuclease toxin of the type 2 MazF/MazE TA system) and ppGpp was shown in 200318 to be required for persistence of the HipA7 variant. Therefore, ppGpp and TA systems are intimately linked to persistence. The mechanism by which ppGpp activates toxins of TA systems has not been determined definitively. It has been proposed that production of polyphosphate, due to elevated ppGpp levels resulting from stochastic events, activates Lon protease and that activated Lon then degrades antitoxins, which would result in activated toxins25. However, in vitro, Lon is not activated by polyphosphate but instead is deactivated by it26 and deletions in lon have no effect on persistence against aminoglycosides or β-lactams12. Furthermore, deleting ppk, which encodes the enzyme that produces polyphosphate, has little impact on persistence against aminoglycosides12. Oddly, for the YoeB/YefM TA system, one of the TA systems upon which the polyphosphate model is based25, degradation of YefM antitoxin has been shown by the same lab in a subsequent publication to be independent of ppGpp and polyphosphate27. Critically, this model25 also neglects persister formation in response to environmental stress since it relies solely on stochastic generation of persister cells28. Additionally, although ppGpp is required, Lon protease and polyphosphate are not related to persistence that stems from activation of TA systems in which the antitoxin is an antisense RNA rather than a protein28. Therefore, the link between polyphosphate and toxin activation via Lon protease is controversial and the underlying mechanisms for persister cell formation via ppGpp have not been fully elucidated. There are several alternative ways to induce persistence. Treatment with antibiotics that reduce transcription, translation and energy production (ATP) have been shown to increase persistence drastically5. In addition, antibiotics like fluoroquinolones that trigger the SOS response via DNA strand breaks, induce persistence in E. coli29. Furthermore, pre-treatment with both acid (pH 2.5) and hydrogen peroxide (20 mM) increases persistence by four orders of magnitude30. Therefore, there are several distinct ways to trigger persister cell formation but the consistent feature is that cells that are less fit have increased persistence30. To explore further mechanisms of persistence, we chose to simplify the system by studying persister cell formation in the absence of ppGpp. Using a selection method that relies on increased persistence, we screened the 4287 gene expression vectors of the ASKA library and identified five novel proteins that increase persistence dramatically. We found that ppGpp is not essential for forming persister cells and that proteins which simply reduce growth increase persistence in the absence of ppGpp. For this work, we primarily utilized ciprofloxacin at 100X the minimum inhibitory concentration (MIC; 0.05 μg/mL)31; ciprofloxacin is a fluoroquinolone antibiotic that inhibits DNA replication to kill both growing and non-growing cells, but not persister cells32 and is commonly used in persister studies at concentrations well above its MIC31,33. Previously, we demonstrated31 that ciprofloxacin tolerance is due to persistence rather than spontaneous genetic resistance by measuring the tolerance of E. coli K-12 cultures after three rounds of ciprofloxacin treatment (5 μg/mL for 3 h) and subsequent regrowth of persisters in fresh media. There was no observable increase in ciprofloxacin survival after each round of regrowth and no colonies were detectable on agar plates with 5 μg/mL ciprofloxacin, showing that there were no resistant cells31. Therefore, throughout this work, the number of ciprofloxacin-tolerant cells indicates the number of persister cells. To further explore the mechanisms by which cells become persistent, we initially investigated the role of Lon, Clp and ppGpp with persistence to ciprofloxacin and ampicillin. The absence of Lon had little impact on the number of persister cells with both antibiotics (Fig. 1A,B) and the absence of Clp reduced tolerance 1.9 ± 0.3 fold with ciprofloxacin (Fig. 1A) and increased tolerance to ampicillin (3 ± 2 to 17 ± 2 fold) (Fig. 1B). Therefore, Lon and Clp protease are not important for creating persister cells under the utilized growth conditions. Role of Lon, Clp and ppGpp in persister cells. Ciprofloxacin (5 μg/mL) and ampicillin (100 μg/mL) were added to stationary-phase cells and exponential-phase cells, respectively and hourly measurements of cell viability were obtained. (A,B) Persister cell formation in BW15113 Δlon (“No Lon”) and BW15113 ΔclpP (“No ClpP”). Host BW25113 is “Wild-type E. coli”. (C,D) Persister cell formation in the absence of ppGpp using MG1655 (“wild-type E. coli”) and the ppGpp-minus strain (MG1655 ΔrelA ΔspoT, “No ppGpp”). Four independent cultures were tested. Means and standard deviations for two representative cultures are shown. Since Lon and Clp proteases were not important for persister cell formation, we tested persistence in the absence of ppGpp by using an E. coli ΔrelA ΔspoT mutant previously shown to be devoid of ppGpp34. We found that in the absence of ppGpp, tolerance to ciprofloxacin is reduced about 100-fold (Fig. 1C) and tolerance to ampicillin is not affected after long times, 8 h (Fig. 1D). Critically, persister cells still form with both antibiotics. Hence, ppGpp is not essential for forming persister cells. To obtain further evidence that ppGpp is not essential for forming persister cells in E. coli, we tested whether the production of various toxins of TA systems still increased persistence in the ppGpp-minus strain. We used ampicillin at 100 μg/mL (10X MIC) for 3 h because ampicillin was used for previous persister studies with toxin expression8,20,35. In addition, we tested ciprofloxacin tolerance at 5 μg/mL (100X MIC), since persister cells have different tolerances to different antibiotics22,36. For all the strains tested, the activity of each toxin was verified by demonstrating inhibition of cell growth. For the ribosome-independent toxin MqsR37, which cleaves mRNA at 5′-GCU-3′ sites, the increase in tolerance to ampicillin and ciprofloxacin was higher with ppGpp (1,150 ± 30 fold and 4,586 ± 74, respectively) vs. without ppGpp (188 ± 20 fold and 2,600 ± 80 fold, respectively) (p < 0.005) (Fig. 2A,B). For another ribosome-independent toxin, MazF, which cleaves mRNA at 5′-ACA-3′ sites38, the increase in tolerance to ampicillin and ciprofloxacin was also higher with ppGpp (497 ± 2 fold and 2,641 ± 22 fold, respectively) vs. without ppGpp (146 ± 3 fold and 433 ± 50 fold, respectively) (p < 0.0005) (Fig. 2A,B). For the membrane-damaging toxin GhoT35,39, the same trend of higher tolerance to ampicillin and ciprofloxacin was seen with ppGpp (203 ± 12 fold and 91 ± 6 fold, respectively) than without ppGpp (71 ± 8 fold and 22 ± 5 fold, respectively) (p < 0.05) (Fig. 2A,B). For the endoribonuclease YafQ, which blocks translation elongation through mRNA cleavage at in-frame 5′-AAA-G/A-3′ sequences via its association with the 50S ribosomal subunit8,40, the increase in tolerance to ampicillin was higher without ppGpp (370 ± 24 fold) than with ppGpp (180 ± 12 fold) (p < 0.05), however, the tolerance to ciprofloxacin was higher with ppGpp (4,545 ± 534 fold) than without ppGpp (130 ± 4) (p < 0.05) (Fig. 2A,B). Critically, for all four of the toxins tested, production of the toxins led to substantial increases in persistence in the absence of ppGpp, which demonstrates that ppGpp is not necessary for persistence with these toxins. Toxins of TA systems increase persistence in the absence of ppGpp. Ampicillin (100 μg/mL) and ciprofloxacin (5 μg/mL) were added to exponentially-growing cells after 2 h induction of the toxins. “No ppGpp” indicates the MG1655 ΔrelA ΔspoT strain (red bars) and “Wild-type” indicates MG1655 (black bars). Fold changes indicate the increase in persistence relative to the strains harboring the empty plasmid pCA24N. Means and standard deviations for two independent cultures are shown. Statistical analysis was performed by Student’s unpaired two-tailed t-test (*p < 0.05; **p < 0.005; and ***p < 0.0005). To discern insights into the mechanism by which cells become persistent in the absence of ppGpp, we reasoned that persistence would increase in the ΔrelA ΔspoT strain if a persistence-inducing protein is produced. Hence, we pooled the ASKA library of E. coli proteins produced in the backbone pCA24N under control of the lac promoter (IPTG-inducible), electroporated them into the ΔrelA ΔspoT strain and isolated cells that were enriched through multiple rounds of treatment with ciprofloxacin (5 μg/mL); ciprofloxacin kills non-persister cells41 so the strains producing the proteins most important for persistence were selected. Specific proteins were identified by plating the persisters and sequencing their ASKA plasmids. Eight different insert sizes were found out of the 30 colonies analyzed by polymerase chain reaction (PCR) screening; the inserts ranged from about 450 bp to 1700 bp compared to about 200 bp for the empty vector pCA24N. Sequencing identified plasmids containing sequences for yihS+, pntA+, yqjE+, focA+, zur+, mazF+, yhrC+ (pseudogene) and the intergenic region between fepB and entC. yihS+ (n = 3, 10%), pntA+ (n = 2, 7%), focA+ (n = 2, 7%) and mazF+ (n = 2, 7%) were nearly evenly distributed, whereas yqjE+ (n = 6, 20%) and zur+ (n = 7, 23%) and the intergenic region (n = 7, 23%) were present at higher frequencies. The pseudogene yrhC (n = 1, 3%) was present with a lower frequency. For simplicity, pseudogene yrhC+ and the intergenic region were not used for further study. Therefore, using this selection technique, we identified five new proteins (YihS, PntA, YqjE, FocA and Zur) important for increasing persistence dramatically in the absence of ppGpp (Fig. 3). We also identified toxin MazF of the MazF/MazE TA system which verified our approach since MazF has been shown to increase persistence42 and we demonstrated this persistence in the ppGpp-minus background (Fig. 2). Toxic proteins of non-TA systems increase persistence in the absence of ppGpp. Ampicillin (100 μg/mL) and ciprofloxacin (5 μg/mL) were added to exponentially-growing cells after inducing production of the toxic proteins for 2 h. “No ppGpp” indicates the MG1655 ΔrelA ΔspoT strain (red bars) and “Wild-type” indicates MG1655 (black bars). Fold change indicates the increase in persistence relative to the strains harboring the empty plasmid pCA24N. Means and standard deviations for two independent cultures are shown. Statistical analysis was performed by Student’s unpaired two-tailed t-test (*p < 0.05). YihS is an isomerase involved in metabolism of sulfoquinovose, a sulfonic acid derivative of glucose43; producing YihS increased tolerance to both ampicillin and ciprofloxacin more without ppGpp (112 ± 13 fold and 124 ± 13 fold, respectively) compared to with ppGpp (4 ± 1 fold and 28 ± 1 fold, respectively), (p < 0.05). Notably, YihS is not toxic in the wild-type strain and is only toxic in the ppGpp-minus strain. PntA is a membrane bound proton-translocating transhydrogenase, which couples reduction of NADP with NADH44; the increase in tolerance to ampicillin and ciprofloxacin from PntA was comparable with ppGpp (116 ± 41 fold and 71 ± 2 fold, respectively) and without ppGpp (58 ± 2 fold and 166 ± 33 fold, respectively). YqjE is a putative inner membrane protein; it also increased tolerance similarly with and without ppGpp to both ampicillin (201 ± 9 fold with ppGpp vs. 120 ± 5 fold without ppGpp) and ciprofloxacin (445 ± 136 fold with ppGpp vs. 233 ± 53 fold without ppGpp). Similarly, for FocA, which is a pH-dependent bidirectional formate transport channel45, the increase in tolerance to ampicillin was comparable with ppGpp (15 ± 4 fold) and without ppGpp (39 ± 17 fold) and the tolerance to ciprofloxacin was higher without ppGpp (159 ± 31 fold) compared to with ppGpp (44 ± 10 fold) (p < 0.05). Zur is a repressor of zinc transporters ZnuABC46 and ZinT47. Like FocA, the increase in tolerance to ampicillin by Zur was comparable with ppGpp (12 ± 2 fold) and without ppGpp (127 ± 38 fold) and tolerance to ciprofloxacin was higher without ppGpp (324 ± 53 fold) compared to with ppGpp (56 ± 6 fold) (p < 0.05) (Fig. 3). Therefore, all the identified proteins increased persistence for both antibiotics with or without ppGpp. To confirm that the increased persistence without ppGpp was due to reduced growth, the growth rates during production of these proteins in the ppGpp-minus strain were determined and found to be significantly lower in the ppGpp-minus strain with these five proteins, compared to the empty vector pCA24N control (Fig. 4, Table S1). The growth rates of the ppGpp-minus, ∆lon and ∆clpP strains were also determined and these strains grew slightly slower compared to the wild-type strain (Fig. S1, Table S1). As expected, the toxin MazF reduced growth (Fig. 4, Table S1). Therefore, the five new persister-inducing proteins identified in the absence of ppGpp by the ASKA selection method reduced growth dramatically. Toxic proteins of non-TA systems reduce the growth rate in the absence of ppGpp. Growth rates of MG1655 ΔrelA ΔspoT carrying the empty vector pCA24N and pCA24N containing genes for newly-identified, non-TA toxic proteins (YihS, PntA, YqjE, FocA and Zur). MazF, a TA toxin (also found during ASKA screening) was used as a positive control. Means and standard deviations for at least two independent cultures are shown. Our results indicate clearly that persister cells form in the absence of ppGpp. The implication of this finding is that if current drugs focus on reducing ppGpp to reduce persisters, these multi-drug tolerant bacteria will still form and when they revive, reconstitute an infection. Hence, approaches that go beyond a reduction in ppGpp are needed. Our results are in stark contrast to the current model which maintains that ppGpp is required for persistence25. Our results also refute that Lon protease is required for persistence48. Clearly we were able to make persister cells, although at reduced levels, in the absence of ppGpp and Lon (and Clp) had little impact on persister cell formation in our assays. In contrast, our results with toxins MqsR, MazF, GhoT and YafQ are consistent with those of the same group which found toxins MazF, RelB and YafO increase persistence without ppGpp, polyphosphate and Lon49. Clearly the current model which states that persistence occurs through ppGpp, polyphosphate and Lon holds only for specialized cases (e.g., weak toxins like HipA) and is (i) not suitable for most type 2 TA systems (e.g., toxins MqsR, YafQ, MazF, RelB and YafO), (ii) not suitable for type 1 TA systems (RNA antitoxin)28, (iii) not suitable for type 3 TA systems (RNA antitoxin) and (iv) not suitable for type 5 TA systems (RNase antitoxin) including GhoT. Moreover, a recent report found that the type 2 TA system YefM/YoeB is independent of ppGpp and polyphosphate27. In addition to well-characterized toxins of TA systems that increased persistence in the absence of ppGpp, we identified several proteins from our search of all E. coli proteins that increased persistence; these proteins (YihS, PntA, YqjE, FocA and Zur) have never been linked previously to persistence. The distinguishing feature of these proteins is that all of these proteins increase persistence simply by reducing cell growth. Given that many labs have searched largely in vain for a coherent cause of persistence using such techniques as transposon-sequencing12, protein expression50 and gene knockouts51,52, it seems reasonable to conclude that the propensity of a cell to enter the persister state is simply inversely related to its growth rate. This explains why the cell activates production of toxins from TA systems; i.e., as a response to stress, cells reduce growth and a subpopulation becomes persistent. Furthermore, our results fit well with those found previously that show decreasing growth in a chemostat leads to greater persistence; using three antibiotics (ciprofloxacin, tetracycline and benzyldimethyl-tetradecyl ammonium chloride) the authors53 found persistence could be increased up to 90–100% by reducing the specific growth rate to 0.1 h−1. Our results are also consistent with the finding that proteins that are unrelated to TA system toxins that are toxic, such as E. coli DnaJ of the DnaJ/DnaK/GrpE chaperon system and PmrC of Salmonella enterica serovar Typhimurium, also increase persistence in the presence of ppGpp54. Therefore, persistence increases as growth decreases and persistence is not solely dependent on ppGpp. The bacterial strains and plasmids used are listed in Table 1. E. coli strains were routinely grown in LB55. Chloramphenicol (Cm; 30 μg/mL) was utilized to maintain the pCA24N-based plasmids39 and all strains were grown at 37 °C. The ΔrelA ΔspoT mutation was confirmed via PCR and by DNA sequencing using primers (Rel F: 5′-ACGCTGGCTCGGGATAGC, Rel R: 5′-CATCCACCAGGTCAATCTTCAC, SpoT F: 5′-CGCTGGTACCGGAAGAAAAC, SpoT R: 5′-CACCTGTACCCAGCTGTTACTACC). To ensure the correct genotype, the overnight cultures of ΔrelA ΔspoT cells were always checked for lack of growth on minimal medium plates by washing with normal saline, diluting 1,000 fold (to avoid nutrient especially amino acids carry over), plating on M9 glucose56 (0.4%) agar and incubating for 18 h. The same culture grew after 10−6 dilution on LB agar plates and wild-type MG1655 grew well on the M9 glucose (0.4%) agar plates. This indicates that the ΔrelA ΔspoT is a true mutant having a ppGpp-minus phenotype. To confirm the ΔrelA ΔspoT strains producing toxins were correct, cell growth was checked by plating cells containing plasmid pCA24N and derivatives on LB Cm30 + 1 mM IPTG agar plates as well as on M9 glucose (0.4%) agar plates to show that strains with the toxins did not grow on either of these two plates, confirming the toxin toxicity as well as ppGpp-minus phenotype. For strains without plasmids, cells were grown to the late-stationary phase (16 h, 250 rpm) for ciprofloxacin treatments or to the exponential phase (16 h grown culture diluted 1:1000 and regrown to a turbidity of ~0.8 at 600 nm) for ampicillin treatments in 25 mL of LB media. A 1 mL culture was used for a drop assay (10 μL × 3) to check cell viability at 0 h. The remaining stationary phase and exponential phase cultures were treated with ciprofloxacin (5 μg/mL) and ampicillin (100 μg/mL), respectively, shaken at 250 rpm and the cell viability was tested every hour by taking 1 mL of culture, centrifuging at 10,000 rpm for 3 min, resuspending the cells in 1 mL of normal saline (0.85% NaCl) and performing a drop assay. At least two independent cultures were used. For strains harboring plasmids, cells were diluted to a turbidity of ~0.05 at 600 nm with 25 mL of LB broth and incubated with shaking at 250 rpm until reaching a turbidity of ~0.2. The cultures were then induced with 1 mM IPTG for 2 h at 250 rpm. The cells were harvested by centrifugation at 8,000 rpm for 5 min and resuspended in LB broth to remove IPTG. A 1 mL aliquot was serially diluted for a drop assay to check cell viability. The culture (5 mL) was treated with 100 μg/mL ampicillin and with 5 μg/mL ciprofloxacin for 3 h at 250 rpm. After 3 h, 1 mL of culture was centrifuged at 10,000 rpm for 3 min, the supernatant was discarded and the cells were resuspended in 1 mL of normal saline. Then, the cell suspension was serially diluted for a drop assay to check cell viability. ΔrelA ΔspoT cells were transformed with 40 ng of pooled ASKA plasmid DNA and cells were allowed to recover by incubating in 1 mL of SOC media for 1 h at 250 rpm. For the first round of selection, 1 mL of culture was inoculated into 25 mL of LB broth and incubated at 250 rpm until reaching a turbidity at 600 nm of ~0.2 followed by induction with 0.2 mM IPTG until reaching a turbidity of ~0.8. The culture was treated with 5 μg/mL of ciprofloxacin for 3 h at 250 rpm and 1 mL was taken for plating. For the second and third rounds of selection, cells from the previous round were washed, diluted 1:100 into 25 mL of fresh LB and incubated overnight at 250 rpm. Cultures were diluted to a turbidity of ~0.05 at 600 nm in fresh LB and incubated at 250 rpm until reaching a turbidity of ~0.2. Then, as in the first round, cells were induced with IPTG, treated with ciprofloxacin and 1 mL of culture was used for plating. Thirty colonies were randomly screened by PCR with pCA24N-specific primers to check the insert (Forward: 5′-GCCCTTTCGTCTTCACCTCG-3′ and Reverse: 5′-GAACAAATCCAGATGGAGTTCTGAGGT-3′). pCA24N (empty vector) DNA was used to compare the insert size. Colonies yielding PCR products with different insert sizes (higher than pCA24N) were sequenced and the genes were identified using a BLAST search against the BW25113 genome sequence. At least two colonies with the same insert sizes were sequenced. For strains with plasmids, overnight cultures were diluted to a turbidity of ~0.05 at 600 nm and incubated with shaking (250 rpm). IPTG (1 mM) was added at a turbidity of ~0.2 (0 h) to induce the gene on the pCA24N plasmid and the turbidity was monitored. For strains without a plasmid, overnight cultures were 1:1000 diluted and incubated with shaking (250 rpm) followed by monitoring of turbidity. At least two independent cultures were used. How to cite this article: Chowdhury, N. et al. Persistence Increases in the Absence of the Alarmone Guanosine Tetraphosphate by Reducing Cell Growth. Sci. Rep. 6, 20519; doi: 10.1038/srep20519 (2016). Rasko, D. A. & Sperandio, V. Anti-virulence strategies to combat bacteria-mediated disease. Nat. Rev. Drug. Discov. 9, 117–128 (2010). CAS \n    PubMed \n    \n                    Google Scholar Fauvart, M., De Groote, V. N. & Michiels, J. Role of persister cells in chronic infections: clinical relevance and perspectives on anti-persister therapies. J. Med. Microbiol. 60, 699–709 (2011). PubMed \n    \n                    Google Scholar Bigger, J. W. Treatment of Staphylococcal Infections with Penicillin by Intermittent Sterilisation. Lancet 244, 497–500 (1944). Google Scholar Hobby, G. L., Meyer, K. & Chaffee, E. Observations on the Mechanism of Action of Penicillin. Exp. Biol. Med. 50, 281–285 (1942). CAS \n    \n                    Google Scholar Kwan, B. W., Valenta, J. A., Benedik, M. J. & Wood, T. K. Arrested protein synthesis increases persister-like cell formation. Antimicrob. Agents Chemother. 57, 1468–1473 (2013). CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Balaban, N. Q., Merrin, J., Chait, R., Kowalik, L. & Leibler, S. Bacterial persistence as a phenotypic switch. Science 305, 1622–1625 (2004). ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Dörr, T., Vulić, M. & Lewis, K. Ciprofloxacin causes persister formation by inducing the TisB toxin in Escherichia coli. PLoS Biol. 8, e1000317 (2010). PubMed \n    PubMed Central \n    \n                    Google Scholar Hu, Y., Kwan, B. W., Osbourne, D. O., Benedik, M. J. & Wood, T. K. Toxin YafQ increases persister cell formation by reducing indole signalling. Environ. Microbiol. 17, 1275–1285 (2015). CAS \n    PubMed \n    \n                    Google Scholar Kwan, B. W., Osbourne, D. O., Hu, Y., Benedik, M. J. & Wood, T. K. Phosphodiesterase DosP increases persistence by reducing cAMP which reduces the signal indole. Biotechnol. Bioeng. 112, 588–600 (2015). CAS \n    PubMed \n    \n                    Google Scholar Möker, N., Dean, C. R. & Tao, J. Pseudomonas aeruginosa Increases Formation of Multidrug-Tolerant Persister Cells in Response to Quorum-Sensing Signaling Molecules. J. Bacteriol. 192, 1946–1955 (2010). PubMed \n    PubMed Central \n    \n                    Google Scholar Vega, N. M., Allison, K. R., Khalil, A. S. & Collins, J. J. Signaling-mediated bacterial persister formation. Nat. Chem. Biol. 8, 431–433 (2012). CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Shan, Y., Lazinski, D., Rowe, S., Camilli, A. & Lewis, K. Genetic Basis of Persister Tolerance to Aminoglycosides in Escherichia coli. mBio 6, e00078–00015 (2015). PubMed \n    PubMed Central \n    \n                    Google Scholar Dalebroux, Z. D. & Swanson, M. S. ppGpp: magic beyond RNA polymerase. Nat. Rev. Microbiol. 10, 203–212 (2012). CAS \n    PubMed \n    \n                    Google Scholar Gaca, A. O., Colomer-Winter, C. & Lemos, J. A. Many means to a common end: the intricacies of (p)ppGpp metabolism and its control of bacterial homeostasis. J. Bacteriol. 197, 1146–1156 (2015). CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Wang, X. & Wood, T. K. Toxin-antitoxin systems influence biofilm and persister cell formation and the general stress response. Appl. Environ. Microbiol. 77, 5577–5583 (2011). CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Moyed, H. S. & Bertrand, K. P. hipA, a newly recognized gene of Escherichia coli K-12 that affects frequency of persistence after inhibition of murein synthesis. J. Bacteriol. 155, 768–775 (1983). CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Germain, E., Castro-Roa, D., Zenkin, N. & Gerdes, K. Molecular Mechanism of Bacterial Persistence by HipA. Mol. Cell 52, 248–254 (2013). CAS \n    PubMed \n    \n                    Google Scholar Korch, S. B., Henderson, T. A. & Hill, T. M. Characterization of the hipA7 allele of Escherichia coli and evidence that high persistence is governed by (p)ppGpp synthesis. Mol. Microbiol. 50, 1199–1213 (2003). CAS \n    PubMed \n    \n                    Google Scholar Keren, I., Shah, D., Spoering, A., Kaldalu, N. & Lewis, K. Specialized persister cells and the mechanism of multidrug tolerance in Escherichia coli. J. Bacteriol. 186, 8172–8180 (2004). CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Kim, Y. & Wood, T. K. Toxins Hha and CspD and small RNA regulator Hfq are involved in persister cell formation through MqsR in Escherichia coli. Biochem. Biophys. Res. Commun. 391, 209–213 (2010). CAS \n    PubMed \n    \n                    Google Scholar Luidalepp, H., Jõers, A., Kaldalu, N. & Tenson, T. Age of Inoculum Strongly Influences Persister Frequency and Can Mask Effects of Mutations Implicated in Altered Persistence. J. Bacteriol. 193, 3598–3605 (2011). CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Wu, N. et al. Ranking of persister genes in the same Escherichia coli genetic background demonstrates varying importance of individual persister genes in tolerance to different antibiotics. Front. Microbiol. 6, 1003 (2015). PubMed \n    PubMed Central \n    \n                    Google Scholar Harrison, J. J. et al. The chromosomal toxin gene yafQ is a determinant of multidrug tolerance for Escherichia coli growing in a biofilm. Antimicrob. Agents Chemother. 53, 2253–2258 (2009). CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Aizenman, E., Engelberg-Kulka, H. & Glaser, G. An Escherichia coli chromosomal “addiction module” regulated by guanosine 3′,5′-bispyrophosphate: a model for programmed bacterial cell death. Proc. Natl. Acad. Sci. USA 93, 6059–6063 (1996). ADS \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Maisonneuve, E., Castro-Camargo, M. & Gerdes, K. (p)ppGpp Controls Bacterial Persistence by Stochastic Induction of Toxin-Antitoxin Activity. Cell 154, 1140–1150 (2013). CAS \n    PubMed \n    \n                    Google Scholar Osbourne, D. O., Soo, V. W. C., Konieczny, I. & Wood, T. K. Polyphosphate, cyclic AMP, guanosine tetraphosphate and c-di-GMP reduce in vitro Lon activity. Bioengineered 5, 264–268 (2014). PubMed \n    PubMed Central \n    \n                    Google Scholar Ramisetty, B. C. M. Regulation of yefM/yoeB toxin antitoxin system is independent of ppGpp and inorganic polyphosphate in Escherichia coli. bioRxiv, doi: 10.1101/021162 (2015). Verstraeten, N. et al. Obg and Membrane Depolarization Are Part of a Microbial Bet-Hedging Strategy that Leads to Antibiotic Tolerance. Mol. Cell 59, 9–21 (2015). CAS \n    PubMed \n    \n                    Google Scholar Dörr, T., Lewis, K. & Vulić, M. SOS response induces persistence to fluoroquinolones in Escherichia coli. PLoS Genet. 5, e1000760 (2009). PubMed \n    PubMed Central \n    \n                    Google Scholar Hong, S. H., Wang, X., O’Connor, H. F., Benedik, M. J. & Wood, T. K. Bacterial persistence increases as environmental fitness decreases. Microb. Biotechnol. 5, 509–522 (2012). PubMed \n    PubMed Central \n    \n                    Google Scholar Kwan, B. W., Chowdhury, N. & Wood, T. K. Combatting Bacterial Infections by Killing Persister Cells with Mitomycin C. Environ. Microbiol. 17, 4406–4414 (2015). CAS \n    PubMed \n    \n                    Google Scholar Sanders, C. C. Ciprofloxacin: in vitro activity, mechanism of action and resistance. Rev. Infect. Dis. 10, 516–527 (1988). CAS \n    PubMed \n    \n                    Google Scholar Conlon, B. P. et al. Activated ClpP kills persisters and eradicates a chronic biofilm infection. Nature 503, 365–370 (2013). ADS \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Traxler, M. F. et al. The global, ppGpp-mediated stringent response to amino acid starvation in Escherichia coli. Mol. Microbiol. 68, 1128–1148 (2008). CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Wang, X. et al. A Novel Type V TA System Where mRNA for Toxin GhoT is Cleaved by Antitoxin GhoS. Nat. Chem. Biol. 8, 855–861 (2012). CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Hofsteenge, N., van Nimwegen, E. & Silander, O. K. Quantitative analysis of persister fractions suggests different mechanisms of formation among environmental isolates of E. coli. BMC Microbiol. 13, 25 (2013). PubMed \n    PubMed Central \n    \n                    Google Scholar Brown, B. L. et al. Three dimensional structure of the MqsR:MqsA complex: A novel toxin:antitoxin pair comprised of a toxin homologous to RelE and an antitoxin with unique properties. PLoS Pathog. 5, e1000706 (2009). PubMed \n    PubMed Central \n    \n                    Google Scholar Zhang, Y. et al. MazF cleaves cellular mRNAs specifically at ACA to block protein synthesis in Escherichia coli. Mol. Cell 12, 913–923 (2003). CAS \n    PubMed \n    \n                    Google Scholar Cheng, H.-Y. et al. Toxin GhoT of the GhoT/GhoS toxin/antitoxin system damages the cell membrane to reduce adenosine triphosphate and to reduce growth under stress. Environ. Microbiol. 16, 1741–1754 (2014). CAS \n    PubMed \n    \n                    Google Scholar Prysak, M. H. et al. Bacterial toxin YafQ is an endoribonuclease that associates with the ribosome and blocks translation elongation through sequence-specific and frame-dependent mRNA cleavage. Mol. Microbiol. 71, 1071–1087 (2009). CAS \n    PubMed \n    \n                    Google Scholar Elliott, T. S. J., Shelton, A. & Greenwood, D. The response of Escherichia coli to ciprofloxacin and norfloxacin. J. Med. Microbiol. 23, 83–88 (1987). CAS \n    PubMed \n    \n                    Google Scholar Tripathi, A., Dewan, P. C., Siddique, S. A. & Varadarajan, R. MazF-induced Growth Inhibition and Persister Generation in Escherichia coli. J. Biol. Chem. 289, 4191–4205 (2014). CAS \n    PubMed \n    \n                    Google Scholar Denger, K. et al. Sulphoglycolysis in Escherichia coli K-12 closes a gap in the biogeochemical sulphur cycle. Nature 507, 114–117 (2014). ADS \n    CAS \n    PubMed \n    \n                    Google Scholar Sauer, U., Canonaco, F., Heri, S., Perrenoud, A. & Fischer, E. The soluble and membrane-bound transhydrogenases UdhA and PntAB have divergent functions in NADPH metabolism of Escherichia coli. J. Biol. Chem. 279, 6613–6619 (2004). CAS \n    PubMed \n    \n                    Google Scholar Lu, W. et al. pH-dependent gating in a FocA formate channel. Science 332, 352–354 (2011). ADS \n    PubMed \n    \n                    Google Scholar Patzer, S. I. & Hantke, K. The zinc-responsive regulator Zur and its control of the znu gene cluster encoding the ZnuABC zinc uptake system in Escherichia coli. J. Biol. Chem. 275, 24321–24332 (2000). CAS \n    PubMed \n    \n                    Google Scholar Graham, A. I. et al. Severe zinc depletion of Escherichia coli: roles for high affinity zinc binding by ZinT, zinc transport and zinc-independent proteins. J. Biol. Chem. 284, 18377–18389 (2009). CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Maisonneuve, E., Shakespeare, L. J., Jørgensen, M. G. & Gerdes, K. Bacterial persistence by RNA endonucleases. Proc. Natl. Acad. Sci. USA 108, 13206–13211 (2011). ADS \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Germain, E., Roghanian, M., Gerdes, K. & Maisonneuve, E. Stochastic induction of persister cells by HipA through (p)ppGpp-mediated activation of mRNA endonucleases. Proc. Natl. Acad. Sci. USA 112, 5171–5176 (2015). ADS \n    CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Spoering, A. L., Vulić, M. & Lewis, K. GlpD and PlsB Participate in Persister Cell Formation in Escherichia coli. J. Bacteriol. 188, 5136–5144 (2006). CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Hu, Y. & Coates, A. R. M. Transposon mutagenesis identifies genes which control antimicrobial drug tolerance in stationary-phase Escherichia coli. FEMS Microbiol. Lett. 243, 117–124 (2005). CAS \n    PubMed \n    \n                    Google Scholar Hansen, S., Lewis, K. & Vulic, M. Role of global regulators and nucleotide metabolism in antibiotic tolerance in Escherichia coli. Antimicrob. Agents Chemother. 52, 2718–2726 (2008). CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Sufya, N., Allison, D. G. & Gilbert, P. Clonal variation in maximum specific growth rate and susceptibility towards antimicrobials. J. Appl. Microbiol. 95, 1261–1267 (2003). CAS \n    PubMed \n    \n                    Google Scholar Vazquez-Laslop, N., Lee, H. & Neyfakh, A. A. Increased persistence in Escherichia coli caused by controlled expression of toxins or other unrelated proteins. J. Bacteriol. 188, 3494–3497 (2006). CAS \n    PubMed \n    PubMed Central \n    \n                    Google Scholar Sambrook, J., Fritsch, E. F. & Maniatis, T. Molecular cloning: a laboratory manual. 2nd edn, Vol. 2 (Cold Spring Harbor Laboratory Press, 1989). Rodriguez, R. L. & Tait, R. C. Recombinant DNA techniques: an introduction. (The Benjamin/Cummings Publiching Company, Inc., 1983). Baba, T. et al. Construction of Escherichia coli K-12 in-frame, single-gene knockout mutants: the Keio collection. Mol. Syst. Biol. 2, 2006.0008 (2006). PubMed \n    PubMed Central \n    \n                    Google Scholar Guyer, M. S., Reed, R. R., Steitz, J. A. & Low, K. B. Identification of a sex-factor-affinity site in E. coli as gamma delta. Cold Spring Harb. Symp. Quant. Biol. 45, 135–140 (1981). CAS \n    PubMed \n    \n                    Google Scholar Kitagawa, M. et al. Complete set of ORF clones of Escherichia coli ASKA library (a complete set of E. coli K-12 ORF archive): unique resources for biological research. DNA Res. 12, 291–299 (2005). CAS \n    PubMed \n    \n                    Google Scholar Download references This work was supported by the Army Research Office (W911NF-14-1-0279). T.K.W. is the Biotechnology Endowed Professor at the Pennsylvania State University. We are grateful for the Keio and ASKA strains provided by the National Institute of Genetics of Japan. Department of Chemical Engineering, Pennsylvania State University, University Park, Pennsylvania, 16802-4400, USA Nityananda Chowdhury, Brian W. Kwan & Thomas K. Wood Department of Biochemistry and Molecular Biology, Pennsylvania State University, University Park, Pennsylvania, 16802-4400, USA Thomas K. Wood You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar You can also search for this author in\n                        PubMed Google Scholar T.K.W. conceived the project and N.C. and B.W.K. performed the experiments. T.K.W. and N.C. wrote the manuscript and all authors reviewed the manuscript. The authors declare no competing financial interests. This work is licensed under a Creative Commons Attribution 4.0 International License. The images or other third party material in this article are included in the article’s Creative Commons license, unless indicated otherwise in the credit line; if the material is not included under the Creative Commons license, users will need to obtain permission from the license holder to reproduce the material. To view a copy of this license, visit http://creativecommons.org/licenses/by/4.0/ Reprints and Permissions Chowdhury, N., Kwan, B. & Wood, T. Persistence Increases in the Absence of the Alarmone Guanosine Tetraphosphate by Reducing Cell Growth.\n                    Sci Rep 6, 20519 (2016). https://doi.org/10.1038/srep20519 Download citation Received: 30 October 2015 Accepted: 07 January 2016 Published: 03 February 2016 DOI: https://doi.org/10.1038/srep20519 Anyone you share the following link with will be able to read this content: Sorry, a shareable link is not currently available for this article.  Provided by the Springer Nature SharedIt content-sharing initiative Scientific Reports (2022) Scientific Reports (2022) Applied Microbiology and Biotechnology (2020) Scientific Reports (2019) Cell Discovery (2019) By submitting a comment you agree to abide by our Terms and Community Guidelines. If you find something abusive or that does not comply with our terms or guidelines please flag it as inappropriate. Advertisement Scientific Reports (Sci Rep)\n                \n\nISSN 2045-2322 (online) © 2023 Springer Nature Limited Sign up for the Nature Briefing newsletter — what matters in science, free to your inbox daily. ",
    "title": "Persistence Increases in the Absence of the Alarmone Guanosine Tetraphosphate by Reducing Cell Growth | Scientific Reports",
    "url": "https://www.nature.com/articles/srep20519"
}