{
    "text": "To revisit this article, select My Account, then View saved stories To revisit this article, visit My Profile, then View saved stories By Aaron Bady In Philip K. Dick’s alternative-history novel “The Man in the High Castle,” from 1962, a single, terrifyingly plausible shift in history has produced a radically transformed world. In 1933, Franklin Delano Roosevelt is assassinated at a rally in Florida, setting off a chain of disastrous events: after Republicans take power and reverse the New Deal, the U.S. neither recovers from the Great Depression nor enters the Second World War. Decades later, the world is ruled by fascist powers. What had been the United States is now divided between an eastern Nazi-ruled “American Reich” and a West Coast partially occupied by the Japanese empire. Like many works of counterfactual history, this nightmarish fictional world provokes a sense of relief mixed with horror: it didn’t happen here, but it all too easily could have. When a TV adaptation of “The Man in the High Castle” first premièred, on Amazon, in late 2015, a profoundly misguided promotional campaign decorated New York City subway cars in the iconography of Nazi Germany and imperial Japan, forcing passengers to get a taste of life in the show’s alternate world. The ads were met with immediate and widespread protest—even the Mayor of New York condemned the campaign—and were quickly removed. A year later, the show’s second season has arrived amid a resurgence of real-life white nationalism, a post-election spike in hate crimes, and the bizarre spectacle of G.O.P. policymakers citing Second World War-era internment camps as legal precedent for a Muslim registry. As a man with a vocal admiration for authoritarian leaders is about to be sworn into the White House, the show has attained a grim new resonance that its creator, Frank Spotnitz, could never have predicted. And though Amazon has been eager to capitalize on this unexpected timeliness, the show’s substantial flaws, especially in its second season, are only magnified by the moment into which it has arrived. The series opens in 1962 on the West Coast, where the Japanese empire rules with an iron fist: Americans are second-class citizens, bowing and deferring to occupiers whose racial and cultural superiority have become a fact of life and law. On the East Coast, white Americans have made an easier transition to fascism: non-Aryan people, and their culture, have been eradicated, and what remains is uncomfortably reminiscent of the most “white bread” American culture of the nineteen-fifties and sixties—a Nazi version of “Dragnet” always seems to be playing on TV in the background, while Rock Hudson and Doris Day are in the movies and on the radio. In San Francisco, Juliana Crain (Alexa Davalos) studies aikido and lives with her mother; her boyfriend, Frank Frink (Rupert Evans), hides his Jewish ancestry and works in a factory that supplies American kitsch for patronizing Japanese customers. When Juliana’s sister entrusts her with a newsreel that appears to show a different version of reality—in which the U.S. won the war—and then the sister is seemingly killed, Juliana sets out to find the mysterious collector behind the reel, “the man in the high castle.” In her quest, she gets entangled with the young Joe Blake (Luke Kleintank), an undercover Nazi who has embedded with the Resistance to find and kill the collector. The show, like Dick’s novel, is most provocative when it shows Americans adapting to fascism with an alarming smoothness. In a chilling scene in the pilot episode, for instance, Joe gets a flat tire as he is driving a truck carrying one of the contraband newsreels west across the American Reich. A local sheriff in a Nazi armband stops to assist him and demands to see his papers, but the tension in their exchange quickly fades to a disquieting nothing. The Nazi fixes Joe’s flat, the two men chat about their memories of the war, and—in passing—the sheriff explains that the strange dust floating down on them, like snow, is ashes from the local hospital crematorium: “Tuesdays, they burn cripples, the terminally ill,” he says. “Drags on the state.” Then, after the friendly Nazi offers Joe his own lunch and some tips for the road, he goes on his way. For those not targeted for elimination, the show suggests—for nice young white men like Joe Blake in particular—the American Reich would not be terrifying at all. It might, in fact, look a lot like the America we already know. In the second season, the series has doubled down on its vision of a startling fascist normalcy, shifting its focus to the home lives of Nazis and the bureaucratic politics of fascism. The result is a kind of prestige-TV version of Hannah Arendt’s banality of evil, in which fascist leaders are shown to be not übervillains but yet another version of the complex cable-drama antihero. The Kempeitai officer charged with maintaining order in San Francisco, Chief Inspector Takeshi Kido (Joel de la Fuente), for instance, put Frank Frink’s sister and her two children to death in a gas chamber in Season 1. Yet it becomes worryingly easy to overlook his atrocious misdeeds, because he is otherwise consistently portrayed as a man of character, integrity, and patriotism. In Season 2, he struggles to keep the Crown Prince of Japan safe on a visit to San Francisco, and his selfless commitment to duty is beyond reproach; indeed, his efforts to unravel a Nazi plot result in him literally saving the world from nuclear war. Similarly, in the first season, Obergruppenführer John Smith (Rufus Sewell), a high-ranking, American-born S.S. officer, was the show’s primary antagonist, an expert emotional manipulator who terrorized subordinates and innocents alike. But Season 2 shows him to be a devoted husband and father, with a white-picket-fence home life straight out of nineteen-fifties television. As the second season progresses, Smith is rocked by the discovery that his only son has an inherited genetic disorder—and is therefore condemned to be euthanized by the state. These story lines invite the same question that Americans have asked often in the past two months: Is empathy really what is needed? In another year, the show’s insistence on humanizing fascists might have seemed like a provocative choice—an effort, like Arendt’s, to understand how normal people can find it in themselves to commit the worst atrocities. In 2017, however—when it is more urgent than ever to distinguish right from wrong, real news from fake, and differences of political opinion from the dangerous undermining of democracy—it feels instead like a pernicious cynicism. At the same time, the series depicts the ideological excesses of the Resistance in the most unforgiving light. More like Al Qaeda than French partisans of the nineteen-forties, they are grim, unsympathetic zealots, who use scattershot terror tactics and have no qualms about causing the suffering of innocent bystanders. As Frank Frink gets caught up in the Resistance—to the dismay of Juliana and his best friend, Ed (D. J. Qualls)—his increasing militancy is portrayed as moral desperation, a loss of faith in anything but self-destructive violence. He resolves, eventually, to become a suicide bomber. This nihilism would have been alien to Philip K. Dick. It is telling that Obergruppenführer John Smith, Chief Inspector Takeshi Kido, and the Resistance are all original inventions of the Amazon series. Dick’s “The Man in the High Castle” focussed on how everyday people struggle to carve out lives of integrity in the face of evil, even while knowing—perhaps especially while knowing—that their actions will not ultimately change the course of history. In the novel, Frank Frink’s primary struggle is how to be an artist, not how to overthrow the Reich. In Dick’s view, this, too, was a form of resistance: his major theme as a novelist was the unavoidable complicity of living “normally” under empire; he believed in evil because he saw it everywhere. But if there wasn’t much hope in Dick’s fiction, that was exactly the point of writing it: even in the midst of a triumphant fascist dystopia, the quest for intellectual autonomy lived on in the dissident imaginations of those who could envision a different kind of world. It is telling, too, that the “man in the high castle” was in Dick’s novel not a collector of film reels but a novelist—an eccentric inventor of alt-histories who served as a stand-in for Dick himself. The character was, above all, a tribute to artists who dare to resist power in dark times. We will find his successors elsewhere. By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. By Adam Gopnik By Jonathan Blitzer By Janet Malcolm By Robert A. Caro Sections More © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. The New Yorker may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "title": "Philip K. Dick's Vision for Resisting Fascism in America | The New Yorker",
    "datetime": "2017-01-17T15:08:13.000Z",
    "url": "https://www.newyorker.com/culture/cultural-comment/philip-k-dicks-intellectual-vision-for-living-in-a-fascist-america"
}