{
    "text": "The time for squeamishness about spoilers is over. Let's get down to the details of Philip K Dick's Ubik. The book is largely told from the viewpoint of Joe Chip, who works for an agency of \"anti-psis\" that stops telepaths invading other people's privacy. This \"prudence organisation\" is run by a man called Runciter with the assistance of his wife, who has died physically but is kept in a state of \"half-life\" in a \"cold-pac\" specialised \"moratorium\" where Runciter is able to communicate with her. Most of the Runciter agency's energy is dedicated to fighting a rival organisation of telepaths, run by Ray Hollis, that uses its powers to carry out corporate espionage and cause trouble. It looks as though they are about to have a grand showdown when Runciter takes Joe Chip and the top operatives in his organisation to the moon, where he has been offered a big, well-paying job taking on telepaths. This work has been arranged by Stanton Mick, a man with a nose like \"the rubber bulb on a new Delhi taxi horn, soft and squeezable. And loud. The loudest nose, he thought, that I have ever seen.\" As well as looking like a sound, Stanton Mick turns out to be a trap laid by Hollis. He isn't a man at all, but a \"self-destruct humanoid bomb\". He blows up … At which point, I can hand the narrative baton over to Runciter himself. Late on in the book, he states boldly: This explanation about Conley shows why time has been going backwards for Chip – why he has, apparently, landed in 1939. It's all Pat. And it must be her who is causing Joe's fellow anti-psis to die suddenly, by turning incredibly old and drying up. Of course, this being a Philip K Dick novel, there's more than one possibility about this time-slippage. As Reading Group contributor Craig Hughes puts it, \"the much more radical notion of previous structures existing in the sub-strata of reality and emanating forward\". But I think Runciter's interpretation could accommodate that, too. It's still Pat, only operating in a different way. Even so, Runciter hasn't explained everything. He hasn't, for instance, accounted for the fact that Joe saw Runciter die in the bomb explosion on the moon. It makes no sense that Runciter should be communicating with him in this way – and even less sense that messages from Runciter keep cropping up on TV, on signs, inside cigarette packets on store shelves. Luckily, there is an alternative thesis. This one is provided by the novelist Stanislaw Lem. He says it was actually Chip who almost died in the explosion on the moon: So, it's actually Runciter who lived and is trying to communicate with Joe? Lem goes on (and on): I'm sorry for the length of that quote – but it's a fantastic summary of how events work in the book. Or at least, it would be, if it actually worked. As Lem himself points out, there's a major flaw in this explanation, too. If everyone died, who put them all in cold storage and brought them back from the moon? You can see that I'm now in trouble. I also realise that I've expended 1,000 words without even mentioning Ubik, the substance that, true to its derivation from the Latin \"ubique\", is found everywhere in the book. Ubik appears most often in the form of an aerosol spray; it seems to counter time-regression and save the lives of those to whom it is applied. It could be taken as a divine symbol. It could be a more straightforward phallic symbol, as theorbys points out. It could be what enables Runciter to manifest in Joe's world. It could also be some kind of anti-psychedelic, the thing that will bring Joe back to sobriety and reality. I especially like that last idea. Remember how we learned early on that Joe had spent the night getting \"pizzled on papapot\"? Could it be that the entire novel is Joe's exhausted, paranoid, drugged-up delusion? Maybe he never got out of his apartment after his argument with the door. Maybe all the confusion is just inside his head? The appeal of that last theory is that you could use it, like Ubik, to clear up nearly all the incidents in the book. It's just a shame that this house of cards is blown apart by that wonderful final chapter, which is told from Runciter's perspective, and notes his alarm when Chip's face starts appearing on his money … At which point, I give up. If anyone has a coherent summary that wraps up all the conflict in the novel, I'd love to hear it, but I suspect the task is impossible. Not, I should stress, through any fault on the author's part. This is a book that gives real meaning to the cliche \"defies explanation\". Like reality – what we see as reality, anyway – Ubik doesn't make much coherent sense. The unease, the difficulty, the contradictions are partly the point. It's all about the realisation that things aren't as they seem – that everything you thought you knew is wrong. As reading group contributor Mexican2 puts it: Mexican2 went on to say. For want of a better word, I'd say \"squishy\" is ideal. You can't get a firm grip on Ubik. Try and squeeze it, and it moves. The more you look at it, the more it changes shape. I'm amazed Philip K Dick managed to keep it still long enough to get it on the page at all. ",
    "title": "Philip K Dick's Ubik: a masterpiece of malleability | Philip K Dick | The Guardian",
    "datetime": "2014-03-18T12:16:32.000Z",
    "url": "https://www.theguardian.com/books/booksblog/2014/mar/18/philip-k-dick-ubik-reading-group"
}