{
    "text": "The first thing to say about Ubik is that it's a serious piece of writing. It's an unashamedly entertaining fast read, it's full of pulp fiction tropes and daft jokes, the language is simple and possibly even workmanlike, but in the immediate aftermath of reading it, I'm mightily impressed. And more than a little confused. Ubik juggles notions of reality and the limits of imagination with consummate skill, while chucking up endless extra balls relating to time-travel, subjective viewpoints, morality and immortality, divine intervention and structural integrity, Plato and Buddha. Everything blurs, it's impossible to follow any one element individually, but watching them all whir round together is mesmerising. The second thing to say is that this reading experience is so exhilarating, and – variously – surprising, bewildering and unexpected, that I'm worried about spoiling it for anyone else. I don't want to talk too much about the plot and mechanics of the story for fear of giving away the secrets that Philip K Dick so expertly unlocks and conceals. For this first piece I'll aim instead to talk about less plot-oriented aspects of the book and author. First, in case you were wondering, here's Philip K Dick's assessment of the book's themes: I'm glad that's cleared up. The inside of this man's head must have been a fascinating and terrifying place to be. On that subject, one of my favourite insights into Philip K Dick's imaginative reality comes from the story told in Lawrence Sutin's Divine Invasions: A Life of Philip K Dick. In 1958, the novelist and his second wife decided to move out of Berkeley to be beside the sea, across the bay in Sausalito. They stayed in the apartment they had rented for just one night. When he woke up in the morning \"and saw nothing but water, his response, as a good Jungian, was to see the vast bay as a sign of his own overwhelming unconscious forces. Back to Berkeley they went.\" The same biography also contains a fine insight into Dick's thoughts on the nature of science fiction, dating from his first discovery of the genre. In 1940, aged 12, he bought a magazine called Stirring Science Stories, mistaking it for a non-fiction magazine Popular Science. \"I was most amazed,\" Dick said later. \"Stories about science? At once I recognised the magic which I had found, in earlier times, in the Oz books – this magic now coupled not with magic wands but with science … In any case my view became magic equals science … and science (of the future) equals magic.\" That magical science is visible throughout Ubik. Meanwhile, the \"science (of the future)\" in Ubik is a subject I can discuss without giving too much away, I hope. Reading group contributor jmschrei made an interesting related comment on last week's post: Probably the last time I saw a typewriter in use was around 1992. And that is also, actually, when the book is set. (Or parts of the book. But let's not get too deep into that yet!) The interesting thing about this date is that it's less than 30 years after the book was written, in 1966. Dick was describing a future that he might reasonably have hoped to see, had his depressingly early death not intervened. Making much of this imaginary 1992 familiar was almost certainly a deliberate device. That peculiar anachronism adds to the unsettling atmosphere and constant feeling of time moving in and out of focus. One minute the characters are sitting at typewriters and putting music on a record player (albeit a super-duper one), the next they are blasting off for the moon. The other notable feature of the technology Dick employs to make his characters' world seem so strange is that it's often funny – and can be strangely prescient, for all that it is out of time. Who today wouldn't immediately think of the internet when reading that the protagonist Joe Chip has a machine upon which he can \"set the dial for low gossip?\" Who wouldn't also think of the internet when seeing how easily the technology can track Joe Chip and how much it knows about his personal habits? Who wouldn't feel a shiver of uneasy recognition? At the other extreme, the idea of a talking door that refuses to let Joe out until he pays it a fee is wonderfully ludicrous. Especially since it enjoys arguing with him so much: \"'You discover I'm right',\" the door said. It sounded smug.\" In a brilliant and provocative essay on Ubik (originally highlighted by reading group contributor everythingsperfect - so thanks!) Stanislaw Lem, the author of Solaris, writes: \"There is no point in estimating the futurological likelihood of such details in this novel as those apartment and refrigerator doors which the tenant is forced to argue with—for these are fictional ingredients created for the purpose of doing two jobs at once: to introduce the reader into a world decidedly different from the present-day one, and to convey a certain message to him by means of this world.\" It could be said that Lem has almost comically avoided the most important thing about the argument with the fridge - which is that it's funny. But I'd certainly agree with him about the way Dick uses his future objects. They add texture and meaning to the story and its world – not to mention useful contrast and something solid to grasp when this world starts to slip away. But let's save that astonishing breakdown for next week. Until then, one last intimation of the delights the book has in store from Stanislaw Lem: \"[Dick] leaves the reader at the end on the battlefield, enveloped in the aura of a mystery as grotesque as it is strange.\" ",
    "title": "Philip K Dick's funny and peculiar near-futurology | Philip K Dick | The Guardian",
    "datetime": "2014-03-11T16:00:51.000Z",
    "url": "https://www.theguardian.com/books/booksblog/2014/mar/11/philip-k-dick-ubik-reading-group"
}