{
    "text": " Nov. 7, 2022  EPISODE DETAILS Michigan State University Interim President Teresa K. Woodruff joins Russ White on MSUToday.\n\nSHOW NOTES Woodruff reflects on this “heavy moment for the institution,” President Stanley’s legacy, and her new role guiding MSU.\n\n“Being president is not something that I sought and, right up until the last minute, didn't expect in many ways. There have been a series of abrupt changes at MSU. I also appreciate that for many within Spartan nation, this seems like something that has a little bit of familiarity to it.\n\n“I want to reassure everyone that we really are writing a new chapter. I used a word this week, Russ. It’s ‘stagility.’ I hope we’re moving to a time of stability and stabilizing the core of the institution. But we still need to be agile and be able to work ahead. That agility and stability is enabled by what President Stanley has done in providing for all of us a living strategic plan. It is enabling the campus.  We have an inspiring faculty and academic staff, and I think they'll be able to do their good work as we move forward.\n\n“My hope is that as we move into this new era, we'll also be able to maintain our health, the health of others, the health of the planet, and all the while open the door as wide as possible to the broadest community possible. This is part of the university strategic plan. Part of President Stanley's extraordinary legacy is to have built three strategic plans for this institution, including the RVSM and DEI plans.\n\n“As remarkable as all of this is to the foundation for the future, he also led us through the first several years of the Covid pandemic, and his training in infectious diseases was critical. None of us could have foreseen that would've been as timely as that was. And that was particularly true prior to the therapeutics and vaccines that are really part of our arsenal today.\n\n“The most salient part of the work led by President Stanley is that these are not his plans. And he would say that to all of us. He has said on many occasion that it's not the Stanley plan; it is the strategic vision of the campus for its future. I know that as we live out our shared plan that was the product of a visionary and principled leader that we are so grateful for what he did in enabling our ability to move forward.”\n\nWhy did you want to be interim president?\n\n“I said when I came to MSU two years ago that I wanted to be a transformative leader in a time of transition. I saw excellence in abundance at this institution. The fundamentals of MSU are unchanged. I also knew then and now that policy and practice need to be aligned in order for folks to do their best work. This is a campus of extraordinarily principled and ethical people from our faculty to our staff. We continue to work toward a more perfect and just way to relate to each other. Leadership opportunities abound. I think people are called to leadership moments. And so that is what buoys me every day. I'm really pleased to come in and provide my own leadership together with a lot of other folks who are on this journey. Together we'll move Michigan State forward.”\n\nWhat do you want Spartan Nation to know as your presidency begins, and what are some of your immediate priorities?\n\n“I remain honored and humbled to be in this role, and I can say I was honored and humbled to be in the provost role. I will serve this institution to the best of my capabilities. I want people to know that I'm honored to have been adopted into Spartan Nation, and I feel like I'm really, really a part of the family, as does my husband, Tom O'Halloran.” O’Halloran is a Michigan State University Foundation Professor of Microbiology & Molecular Genetics and Chemistry.\n\n“I really want Spartan Nation to know just how extraordinary our entire staff is. They are the ones who enable this living learning campus environment, who keep our buildings in excellent shape, who support grant submissions and who create the context in which this academic success is possible. The people who make this university great are our fundamentals. I'd love for Spartan Nation to know that.”\n\nTalk about culture, community, and communication and how you'll emphasize building trust, affirming transparency, and advancing strategic initiatives.\n\n“I want to be out and about introducing myself, listening, hearing, and really communicating in ways that are bidirectional so that I can really be part of every day of this campus. And I think as much as we communicate, we can build the community. There have been some of the parts of the fabric that have been pulled apart. Some of the threads are a little thread bear, and we want to knit that back together and really come together around community.\n\n“And then culture. There is a special way in which everyone within the Michigan State environment really loves this organization. Last week, a lot of people were telling me to hang in there. Everybody's telling me they bleed green. To really communicate effectively and to build that community and leave the institution in a culture that feels stable and supported and enabled to do their best work, we have to really focus on building trust. We want people to know that we are trusted partners on both sides. We need to really make sure folks know they can trust us by having information.\n\n“In a trusting relationship, I am committed to providing as much information as I can, to gathering as much evidence from as many sources I can, and then acting in the best and most principled way on behalf of the university. And if people can believe in that, then I think we're going to be able to advance our strategic initiatives.”\n\nSummarize some takeaways and what you mean when you say you're all in for MSU.\n\n“I'm all in for MSU. We’re planning today for tomorrow's future. We all have to be in to be part of the solution. We all have to be on board. We don't have time for people to fall prey to cynicism. I can understand how that may happen, but we have to be all in for MSU. This is an exciting time. We're on an upward trajectory. Don't be on the sidelines. We're really moving.”\n\nKeep up with MSU Interim President Woodruff at president.msu.edu and on Instagram @MSU_Pres. MSU Today airs Saturdays at 5 p.m. and Sundays at 5 a.m. on WKAR News/Talk and Sundays at 8 p.m. on 760 WJR. Find “MSU Today with Russ White” on Spotify, Apple Podcasts, and wherever you get your shows.\n\nWhat is MSU Today with Russ White?\n\nMSU Today is a lively look at Michigan State University-related people, places, events and attitudes put into focus by Russ White. The show airs Saturdays at 5 P.M. and Sundays at 5 A.M. on 102.3 FM and AM 870 WKAR, and 8 P.M. on AM 760 WJR. Russ White more content from this collection IN DEPTH Story Oct. 25, 2023 Story Oct. 25, 2023 Story Oct. 25, 2023 Subscribe to the MSUToday Weekly Update to receive timely news, groundbreaking research, inspiring videos, Spartan profiles and more. Enjoy a curated collection of stories, photos, videos and featured content from across campus, delivered each Wednesday afternoon. Help us deliver content you’re most interested in. Check the topics you would like to read about. You are now signed up to receive the MSUToday Weekly Update. The email is a quick and easy way to stay updated on the latest news about Spartans and the work they’re doing on campus and around the world. \r Spartans Will.\r Jennifer Trenkamp, MSUToday editor  If you're having\r\n\r\n            accessibility issues, please let us know. ",
    "title": "Podcast: Culture, community, communications and 'stagility' guide Interim President Teresa K. Woodruff | MSUToday | Michigan State University",
    "url": "https://msutoday.msu.edu/news/2022/podcast-culture-community-communications-and-stagility?collection=517cd93c-39a3-4ec2-821f-caf6a8de50a5"
}