{
    "text": "South Korea’s policymakers created an industry worth $83 billion out of K-pop and K-drama. Could other countries do the same? Government and governance, Trade and industry, Arts, culture & society | Southeast Asia, The Pacific, The World, Australia, Asia, East Asia, South Asia 23 November 2015 When the Asian Financial Crisis hit South Korea, it took an entertaining approach to putting its economy back on track, writes Kim-Marie Spence.  Can a country use pop stars as part of its development strategy in the way companies use pop stars to sell their products? Hallyu says yes. Economic development has traditionally meant a focus on industrialisation, poverty alleviation and other such concerns. But in early 1990s, Britain’s Greater London Council led the way in using cultural industries as part of its urban development strategy. The success of this scheme prompted Tony Blair’s New Labour government to adopt the same approach, coining the term ‘creative industries’ in the process.  The late 1990s was marked by a global move towards creative industries-led development strategies, mostly through support for heritage, arts, media and other creative businesses. One area that this global push didn’t go near was pop music. That step was taken by South Korea – a country now as well-known for its catchy and commercial K-pop and hugely-successful K-drama as it is for electronics and kimchi. These Korean pop stars are a product of a wider content development strategy, itself fairly revolutionary among emerging economies. Winston Churchill once said ‘never let a good crisis go to waste’ and the South Korean government did not. The Asian Financial Crisis (AFC) of the late 1990s was the impetus for the adoption of creative content as a pillar of South Korea’s development strategy. The AFC had exposed the limitations of an economic model that relied heavily on the chaebols and low-cost manufacturing – resulting in over-leveraged banks and a deteriorating financial system. The Asian Financial Crisis’ impact on South Korea was such that an IMF loan (of USD $58 billion) had to be negotiated for the country. Then-President Kim Dae-jung had seen how much the United States earned from its film industry and likewise the United Kingdom from stage musicals. He decided to use these as models for a similar creative industries-led model of development. South Korean K-pop band A pink. Image by Republic of Korea: https://www.flickr.com/photos/koreanet/8156731249/in/album-72157626585071327/ Seeing the content-centric industries as an economic option was brave, as the riskiness of these industries is well-documented. The American economist Richard Caves wrote of the ‘nobody knows’ factor of the creative industries – nobody knows what will be successful before it goes to market. South Korea wasn’t the first country to try to use creative industries as a springboard to economic success. South Africa, for example, made a concerted effort with fashion and film, while others have focused on local-level creative projects, often with an urban regeneration goal, as with London. The South Korean government, however, threw its weight and its funding behind the full gamut of creative industries including film, television, technology, games and music and saw these various industries as just different aspects of the overarching content industry. This government intervention in the creative industries set South Korea apart from creative industry powerhouses such as the USA and the UK. The US had traditionally left the majority funding of the arts to private and philanthropic entities, which often led to high art or a technology-centric focus. The UK, on the other hand, had a Department of Culture, Media and Sports with nationwide initiatives for supporting creative industries. But these initiatives were focused on excellence and access and engaged an ‘arm’s length’ approach in funding, as in the US. The South Koreans, on the other hand, focused on intellectual property rights and innovation, and sought to actively support the content industries through funding, expertise and technology. The main agency involved was the aptly-named Korea Creative Content Agency, which was initially established with a budget of US$50 million dollars. The success of South Korea’s scheme means that its annual budget is now around US$500 million dollars – in addition to another billion-dollar fund available for pop culture projects. Innovation in the creative industries is so engrained in South Korea that the country’s Ministry of Culture, Sports and Technology even has a technology division which works on, among other things, cultural technology to improve the concert- going experience, through innovations like holograms. K-pop may be an emerging trend in the West, but it represents the second, not the first, wave of Hallyu. Hallyu is a name coined by Chinese journalists meaning ‘Korean Wave’ to describe the newfound popularity of Korean goods and products enhanced and fronted by its (popular) pop culture. The first Hallyu had been led by Korean drama (K-drama). When K-drama started in the late 1990s, it was, for broadcasters, a cheap alternative to buying American soap operas. These days K-drama episodes command a higher price in Asia than either American or British soap operas. In the 1990s, each K-drama episode cost broadcasters US$750 – prices which are now up US$20,000, an over twentyfold increase. So successful has K-drama been that at one point over 40 per cent of the Japanese population had watched the hit K-drama Winter Sonata. K-pop star Psy. Image by Republic of Korea: https://www.flickr.com/photos/koreanet/20291216975/in/album-72157626585071327/ Both K-pop and K-drama are trojan horses for other Korean goods. K-pop’s popular groups, such as Big Bang, Girls Generation, 2NE1, Super Junior and others, also market other Korean goods. The consumption of Korean electronics, cosmetics, automobiles, clothes and even tourism are, to a large extent, driven by the lifestyles of K-pop stars and K-drama plots. In Korea, the stars are the national and private sector brand strategy for Korea Inc. These actors and pop artistes have become the face of South Korea tourism. Premier K-pop girl group Girls Generation, for example, was once a South Korea Tourism Ambassador. Similarly AOA’s Seolhyun (K-pop star) and actor Lee Min Ho are the ambassadors for 2016-2018 Years of Korean Tourism. In an era obsessed with celebrity, it’s strange that other countries have not chosen to base some aspect of their economic strategy on their celebrity-creating industries as the South Koreans have done, especially as the potential rewards are so great. The Korean wave was worth US$83.2 billion in 2012 according to the South Korean government Ministry of Culture, Sports & Tourism. K-pop alone accounted for US$5.3 billion of those earnings directly. Perhaps others haven’t tried to create their own content wave because they don’t take celebrity and, by extension, the industries that create them, seriously? The Kardashian financial juggernaut is a prime example. Kim Kardashian alone is worth US$52.3 million, according to Forbes’ 2015 Celebrity List. However, that still has not translated into respect for the celebrity family, despite the high ratings. Is it the inability to see the creative industries as economic options equal to other industries that have prevented other governments, even those with the economic resources of South Korea, from choosing to back their creative industries? It may take another crisis or another brave policymaker for a country to use pop stars as part of their development strategy, and produce pop stars the way countries built factories in the past. But the example of South Korea shows it is possible for pop stars to bring an economy back from the brink and make it sing.  This article is based on an upcoming presentation from the author at the Crawford School PhD Conference on 24 November 2015. This annual free to attend event brings together some of the school’s PhD scholars with major international speakers who will this year look at the future of regional groupings among Asia-Pacific countries: https://crawford.anu.edu.au/news-events/events/6157/crawford-school-phd-conference-2015-friends-and-partners-future-regional All countries invest in culture..\nThe United States invest in culture.. France also invest in culture\nBrazil also invest in culture…\nIt is a natural phenomenon..  People naturally enjoy other countries culture\nJapan and china invest more in culture than Korea..There is evidence\nThe word so called Hallyu(Korean Wave) was mentioned in the Chinese media in the 1990’s All governments do invest in cultural industry. However, the policy towards pop culture industry varies from one to another. How about Indian government’s attitude towards Bollywood and Beijing’s idea of management of cultural industry. It is different in policy making. The K-pop is one the most typical examples that could represent how public policy making has worked on pop industry at least in a positive way. While its neighbour India or China may be not the same. Thank you for your comments, Karter. While it is true that most countries spend on culture, not every country sees it as part of their economic or development strategy. In addition, pop culture in particular is not often seen as ‘culture’ in the way that heritage sectors, such as national monuments, folk art et cetera. Congratulations Kim Mary for this most interesting article!  Lets hope Cultural Policy Makers of the Caribbean open theirs eyes and mind …..to the richness that is around them and make some constructive decisions!!All the best for your presentation of the day! Love from Lorraine Many thanks Lorraine for your compliments! The presentation went quite well. All the best! Back to Top Kim-Marie Spence is a Jamaican PhD scholar in Public Policy at the Australian National University. Her area of interest is creative economy and development in the global South. See All Press Ctrl+C to copy ",
    "title": "Pop stardom as a development strategy - Policy Forum",
    "datetime": "2015-11-23T00:51:01+00:00",
    "url": "https://www.policyforum.net/pop-stardom-as-a-development-strategy/"
}