{
    "text": "Many don’t know but South Korean culture or K-culture trends began in the 1980s. Today South Korea is considered a major exporter of popular culture. It started with the K-dramas then the K-pop which spread like a wildfire all across East, Southeast and South Asia.\nThe development of social networking services and online video sharing platforms, especially YouTube played a big role in the K-culture explosion worldwide.\nThis heavily impacted contemporary cultures, such as the music industry, film industry, television industry, and behavioural aspects of various people throughout the world and India.\nWebtoons\nIt originated in South Korea, but now it has gained immense traction among those aged between 15-24. This new wave has been getting more and more comic readers turning to them. It is visible in the number of monthly active users of Kross Komics, which is a webtoon app. Today the app has crossed 3 million downloads since it commenced service in India in December 2019, and currently has 1.1 million monthly active users.\nK-pop\nIt is short for Korean popular music, which is a music genre that also originated in South Korea as part of South Korean culture. The genres take their influence from all around the world, such as pop, experimental, rock, jazz, gospel, hip-hop, R&B, reggae, electronic dance, folk, country, and classical on top of their traditional Korean music roots. Psy’s “Gangnam Style” achieved widespread coverage in mainstream media along with artists like BTS, also known as the Bangtan Boys, BoA and Rain, who are currently very popular in India.\nK-Drama\nThe Korean Drama which is now famously called K- Drama. They are Korean language television series that are made in South Korea. Today Korean dramas are very popular in India, but during the late 1990s and around 2000 Korean dramas began their popularity particularly in Manipur, Assam, Meghalaya, Sikkim, Arunachal Pradesh, Tripura, Mizoram and Nagaland as well as parts of the eastern states like West Bengal and more recently in the southern state Tamil Nadu.\nKorean Cuisine\nKoreans usually have grilled meats which are accompanied by wonderfully spicy and sour shreds of cabbage. It’s called Kimchi. Kimchi is preserved cabbage (also made with other vegetables) that is the cornerstone of Korean cooking. Local inquiries for dishes such as Korean fried chicken, Korean style Ramyeon, Kimchi, gimbap, kimchi-jjigae started flooding in after Korean Expatriates listed their canteens on online food delivery platforms. (IANS) 0 ",
    "title": "Popular Korean culture trends visible among Indian youths - The Shillong Times",
    "datetime": "2021-07-18T20:30:42+00:00",
    "url": "https://theshillongtimes.com/2021/07/19/popular-korean-culture-trends-visible-among-indian-youths/"
}