{
    "text": "  In the 1950s and 1960s, gay and lesbian clubs dotted the Kansas City metro area. Bars, with names like The Ivanhoe Cabaret and The Terrace, \"were widely viewed as having some of the finest entertainment around,\" according to the News-Telegraph in a 1992 article. But these drag balls, also called \"tea parties\" or \"private birthday parties,\" were mostly underground events. More than 200 vintage photographs documenting the drag ball culture from 1958 to 1968 at The Jewel Box and The Colony, both popular spots on Troost, were discovered recently but separately by artists Robert Heishman and Michael Boles. In 2006, Heishman, then an undergraduate at the Kansas City Art Institute, found a slide carousel at a salvage yard in the West Bottoms; he bought it for $2. \"The first image I looked at was this picture of a man in a kimono that was incredibly colorful — it was just a stunning image to behold,\" he told New York Magazine. In the images, men and women in drag pose in front of clubs and in party scenes. In 2008, Boles found more slides in a shoebox while helping a friend move just off Troost. There were family photos, as well as images of drag queens, and personal letters and stories. The two longtime friends realized the similarities between the images in 2012, and that they were shot by the same yet-to-be-identified photographer, \"Jack.\" \"Well, we believe it’s someone named Jack, but he’s still sort of an elusive figure at this point. We have some leads, but at the time being we’re still trying to figure all that out,\" Boles told New York Magazine. Boles, Heishman, and writer Emily Henson are working alongside the Gay and Lesbian Archives of Mid-America (GLAMA) at UMKC, to establish the \"Private Birthday Party\" collection. The name refers to signs stating \"private birthday party\" that were placed on doors of clubs during drag balls. \"At a time when most gay and lesbian Kansas Citians shied away from cameras owing to a fear of arrest, loss of employment, or worse, these amazing photos are truly a unique look in to a past otherwise forgotten,\" said Stuart Hinds, director of special collections at UMKC, in an email. A debut of the Private Birthday Party collection takes place on Thursday, April 17 at The Guild, 1621 Locust St., Kansas City, Mo. A new exhibit called \"Out from the Shadows: Scenes From Gay Bar Culture in 1960s Kansas City\" at the UMKC Miller Nichols Library, 800 E. 51st St., Kansas City, Mo., also shows images from the collection. ",
    "title": "Portraits And Party Scenes From Kansas City's Drag Ball Culture Revealed | KCUR - Kansas City news and NPR",
    "datetime": "2014-04-09T17:37:11",
    "url": "https://www.kcur.org/arts-life/2014-04-09/portraits-and-party-scenes-from-kansas-citys-drag-ball-culture-revealed"
}