{
    "text": "A serious case can be made that the most decorated head coach at K-State is Patrick Sweeney, who is at the helm of the Wildcats rowing program. The 11th-year head coach has two Olympic medals as the former head coach of the Belgian national team — one gold and one bronze — as well as one silver and one bronze medal as a coxswain for the British National Team. He has also collected 10 medals — five as a coach and five as a coxswain — at the World Championships during his time in the sport. In addition to his international experience and successes, Sweeney won four national titles as the head coach at the University of California from 1980-87. In his first year at California, he brought about the school’s first-ever women’s national championship. So why did a man with so much success at the highest level of his sport decide to become the head coach of a fledgling rowing program at K-State in 2003? “I was looking for a challenge,” Sweeney said. “I’ve done all those things, and I was looking for a place that had an athletic department that was willing to do something. Everything seemed to fit in and [K-State] wanted to take a program that was struggling and build it to a program that was doing something and creating great opportunities.” Since taking over in 2003, Sweeney has elevated the rowing program at K-State to new heights and has kept recruiting mostly within the state of Kansas, while other elite programs like Texas and Oklahoma heavily recruit foreign talent. When he came to Manhattan, the team’s roster included only about 30 girls. Now, it has swelled to over 90. Sweeney reached his pinnacle in Manhattan in the 2008-09 season, when his First Varsity 8 boat grabbed the gold medal at the Big 12 championship. But Sweeney’s ultimate goal at K-State has been to create a competitive rowing program that uses primarily Kansas high school athletes. According to the team’s media guide, over 80 percent of the team’s current roster is from Kansas. Also, only five percent of the roster had any prior rowing experience before coming to K-State. Sweeney said he finds a sense of satisfaction in turning around a group of former high school athletes who never rowed and putting them on a competitive level with elite Big 12 teams. “The more I do it here, the more I enjoy it,” Sweeney said. That’s probably why Sweeney just signed a five-year contract extension last offseason that will keep him in Manhattan for the foreseeable future. Sweeney and his family, which includes his wife Martha and his daughter Toula, love it in Manhattan, and Sweeney said  that’s a big reason he is staying put at K-State. “I wanted to get out of international rowing. It was time for me to move out and find a place for the family. I still feel that way,” Sweeney said. The future of the rowing program under Sweeney is brighter than ever with the addition of the Intercollegiate Rowing Center, a training facility located in the same complex as Bill Snyder Family Stadium, Bramlage Coliseum and the Basketball Training Facility. “We haven’t reached the goal yet. We’re still building. With the new facility coming in, it’s opening up another challenge,” Sweeney said. In past years, the Wildcats have struggled to train in the winter due to poor weather, which prevents the team from training on the water. With no training facility as a backup, the rowing team was limited almost strictly to strength training in the Vanier Football Complex and would go months without technical training. Now, with the new facility, Sweeney said the program should see noticeable results in the coming seasons. “We got to a point where we knew what we were doing and we were making progress, but we were sort of plateauing out,” Sweeney said. “This gives us the next kick up. It means that over the next two, three and four years we should see the program get better.” As the Wildcats continue to make progress on the water, Sweeney’s contract extension guarantees that one of the most decorated rowers in the world will be guiding the program as it looks to reach unprecedented levels of success. But it is that international experience that Sweeney says has allowed him to create a progressive culture at K-State. “I think anybody that’s been doing it as long, I would hope they respect what they’ve done,” Sweeney said. “That shines through on a daily basis. I hope what I do makes sense to them and they can see that it’s working.” ",
    "title": "Powercat Profile: Head rowing coach Patrick Sweeney - The Collegian",
    "datetime": "2013-10-16T06:00:46+00:00",
    "url": "https://www.kstatecollegian.com/2013/10/16/powercat-profile-head-rowing-coach-patrick-sweeney/"
}