{
    "text": "By William Huntsberry A new study finds that students who attend state-funded pre-K are less likely to need special education programs later on in school.\n                \n                    \n                    iStockphoto\n                    \n                \nhide caption A new study finds that students who attend state-funded pre-K are less likely to need special education programs later on in school. Attending state-funded prekindergarten substantially reduces the likelihood that students will end up in special education programs later on, according to a new study by researchers at Duke University. The study examined 13 years' worth of data from students enrolled in More at Four, a state-funded program for 4-year-olds in North Carolina. By the third grade, the researchers found, children in the program were 32 percent less likely to end up in a special education program. Children who were part of Smart Start, a health services program, saw a 10 percent drop. Combined, the two programs accounted for a 39 percent reduction. While More at Four costs roughly $1,100 per child, the authors noted, educating a special-needs student costs twice as much as an average student; in North Carolina, that would be around $16,000 per year. And those costs can roll over year after year. President Obama has called for universal preschool for 4-year-olds, and this new research could add impetus to the growing efforts in the states. Currently, 40 states fund some sort of preschool program, according to the Council of Chief State School Officers. Andrew McEachin, an education policy researcher at North Carolina State University who was not involved in the research, said its findings are important as states debate expanded funding for these programs. \"Policymakers at the state level will have to ask themselves: 'Do we fund education for 0- to 5-year-olds, because if we don't, we may spend more for special education in third grade?' \" McEachin said. The study provided a system-wide look at statewide pre-K, but he noted that it did examine program quality. In fact, the researchers found that, regardless of quality, the more money spent on preschool, the less likely a child would end up in special education later on. According to the study's lead author, Clara Muschkin, the findings challenge other research showing that any benefits from preschool wash out early. Seeing benefits in third grade, she noted, qualifies as a \"long-lasting\" impact. \"This certainly is an important way to reduce disadvantages for children before they arrive at school,\" said Muschkin. \"Maybe with early intervention, they don't need any special services later on at all. That's a cost savings that's there.\" The study bolsters earlier work by the same Duke team of researchers, which showed that both programs increased children's reading and math scores in the third grade. Sponsor Message Become an NPR sponsor ",
    "title": "Pre-K Pays Off By Lowering Special Ed Placements : NPR Ed : NPR",
    "url": "https://www.npr.org/sections/ed/2015/02/04/383571989/pre-k-pays-off-by-lowering-special-ed-placements"
}