{
    "text": "Please select Recommendations and/or countries from the drop-down list on the right side. Back\n\n\n\n\t\t\t\t\t\tPreservation of underwater archaeological sites, European project coordinated in Copenhagen ©SASMAP consortium Location of the initiative: DENMARK Relation to Strategy 21 Recommendations: K9 - Develop study and research programmes that reflect the needs of the heritage sector and share the findings Brief description of the initiative: Europe’s sea floor is a treasure trove of cultural heritage. Shipwrecks, submerged or sunken cities and significant archaeological sites largely remain undiscovered or are yet to be fully investigated. UNESCO estimates that there are over 3,000,000 shipwrecks on the floors of the world’s oceans, whose contents remain to be explored. An increasing number of offshore and subsea developments such as wind farms, pipelines and cables have resulted in a greater demand for new methods of managing and preserving this priceless heritage. Across Europe, a consortium of seven research institutions and four small companies from seven countries - Denmark, Germany, Greece, Italy, The Netherlands, Sweden and the United Kingdom - came together to form an ambitious group aiming to change the state of marine archaeology and conservation in Europe for the better. The Department of Conservation and Natural Science at the National Museum of Denmark coordinated the team who carried out the project SASMAP (Development of Tools and Techniques to Survey, Assess, Stabilise, Monitor and Preserve Underwater Archaeological Sites). Objectives of the initiative: The consortium has taken great strides in the development of new methodologies with the objective of locating, assessing and safeguarding Europe’s underwater cultural heritage and has trialled these new methods in several sites in European waters. These include the ancient harbour of Sounion in Greece, the submerged prehistoric settlement site of Tudse Hage in Denmark, the Roman town of Baia in Italy and a 17th-century shipwreck in The Netherlands. The research was carried out with a fresh approach and brought together an impressive group of researchers in marine archaeology and conservation, in situ preservation, wood degradation, marine geochemistry and marine geophysics. The protection of these sites was one of the main concerns of the team when developing these new tools and methods. These innovative technologies and methodologies have had a large scale impact and have contributed greatly to maritime archaeology. The locating of underwater archaeological sites, assessing the state of preservation of waterlogged wood and general stabilisation are just some of the techniques which have been improved by SASMAP. Brief assessment of the initiative’s results: The SASMAP project is an example of best-practice in dealing with underwater preservation and praised the consortium’s commitment to further disseminating their findings to heritage professionals around the world. There’s hope that the work to preserve our too often forgotten, underwater, heritage will continue across Europe. Online resources: Contact: Prof David Gregory\n[email protected]  ",
    "title": "Preservation of underwater archaeological sites, European project coordinated in Copenhagen - Culture and Cultural Heritage",
    "url": "https://www.coe.int/en/web/culture-and-heritage/-/preservation-of-underwater-archaeological-sites-european-project-coordinated-in-copenhagen"
}