{
    "text": "Assistant professor of history Kristin Mulready-Stone’s office on the third floor of Eisenhower Hall was once an attic. Now, it is filled with general and East Asian history textbooks and East Asian art. It’s hard to not want to take a book off a shelf and start flipping through it. Everything is neat, from her bookshelves to her desk with copies of her new book, “Mobilizing Shanghai Youth,” sitting in a stack. Mulready-Stone specializes in the history of modern China. She has a passion not only for education, but also for teaching diverse material to broaden a sense of understanding about the east Asian culture. Mulready attended Tufts University for her undergraduate in Asian studies, and received her doctorate in philosophy, Chinese history at Yale University. Mulready-Stone said her  undergraduate experience was terrific. “I loved being in college, and I got to just about everything I wanted to do,” Mulready-Stone said. When asked how she got to K-State, Mulready-Stone simply said, “You go where the jobs are.” When her husband, whom she met at Yale, was hired by K-State in 1999, they moved to Manhattan together. Shortly after moving, Mulready-Stone went back to China to finish her dissertation research. When she returned, the history department wanted to give her opportunities to teach. She also worked at the Institute for Military History as the coordinator for grants and programs where she did grant writing. Grant writing lead to her becoming the institute’s assistant director. In 2008, Mulready underwent the interview process to teach full-time at K-State. “I had made my own reputation by the time that happened,” Mulready-Stone said. “I had accomplished some things in my teaching and my grant writing before that.” Mulready-Stone fell in love with East Asian culture because of experiences she had in her younger years. She went to a high school that offered many languages, including Chinese, which was offered because of the Geraldine Dodge Grant.  China had started to open up after Mao Zedong, 1st chairman of the Central Committee of the Communist Party of China, died and Chinese was being pushed in her school. Although her father had encouraged her to take Chinese, she was hesitant at first. She was adamant that learning Spanish was enough and the right way to go. During her junior year of high school she took a humanities class, which introduced her to many different topics. “(We) studied everything,” Mulready-Stone said. “History of the world, music of the world, literature, architecture and art.” One of the units was a East Asian comparative religions study. “I loved it,” Mulready-Stone said. “It just grabbed me, and I thought it was fascinating to study all these religions and philosophies.” Due to a scheduling conflict, she had a free period her senior year of high school at the same time Chinese was offered, and she enrolled in the class. She then only applied to colleges where courses in Chinese were offered. At Tufts University, she started over and took  the beginning Chinese language course. “I started college thinking I would be a English or Spanish major, but by the end of my freshman year I was thinking about East Asian studies,” Mulready-Stone said. As an East Asian studies major, Mulready-Stone studied language, history, literature and political science, with a focus on China and Japan. As an undergraduate, Mulready-Stone went to China and began her path to being a professor. Mulready-Stone’s path to becoming a professor started with the 1989 Tiananmen Square uprising, which occurred during her undergraduate years. She had been studying up on Chinese-related issues and noticed that no one was aware of what was going on, and found herself explaining the situation to people repeatedly. At the end of her senior year, her professor advised her to go to graduate school. “A combination of knowing I could do it and having the encouragement from a very influential professor, and having a strong belief that China’s emergence was important for people to study and learn this at the most basic level,” Mulready-Stone said. Her colleague, Charles Sanders, associate professor of history, spoke of Mulready-Stone’s skills as a professor. “Professor Mulready-Stone is a marvelous colleague, a truly exceptional professor,” Sanders said. “She works hard to create and deliver outstanding coursework, and she spares no effort to assist her students in every manner possible.” Mulready-Stone said the thing she’s most passionate about in her professional life is “absolutely the teaching.” Even with her book out, she said that teaching is her first love, professionally. “Mulready imparts with her lectures not only the experiences of figures in Asian history, but the mores and events that shaped their principle decisions,” Garrett Parkins, senior in mechanical engineering, said. “In addition to her time well-spent in the classroom, she has also been willing to meet with me on several occasions to further discuss certain facets of East Asian study.  On one occasion, she helped me lend context  to several photographs taken by a relative of mine who had served in China as part of the U.S. Asiatic Fleet immediately preceding World War II.” In her personal life, her family and children come first – but Mulready-Stone is also passionate about the violin, which she has been playing for 36 years. She said she is also interested in cooking, gardening and landscaping. “It’s part of who I am,” Mulready-Stone said. “My family is my love and my life, and my music is my passion.” Her book “Mobilizing Shanghai Youth” is a revised and published version of her dissertation over Shanghai youth and Chinese youth in general – not to be mistaken with student protests that coincide with Chinese youth. “There are so many books published on student protests in China,” Mulready-Stone said. “So I thought, ‘There were books on student protests, but no books on youth.'” Her adviser, historian and Yale University professor Jonathan D. Spence, is one of the biggest names in Chinese history in the western world. Spence was intrigued and advised her to pursue the topic, which he said could be published. The practices Spence instilled in Mulready-Stone, both directly and indirectly, about how to be a teacher, have an impact on her teaching today. “She’s an amazing teacher,” Sam Easley, junior in history, said. “I always felt like I could go and get advice from her and she actually cared about my grade and understanding of her course.” Mulready-Stone has a broad expertise in many areas, and her passion for East Asian studies has earned her the love and admiration of her students, colleagues and the K-State family. ",
    "title": "Professor shares love for teaching, passion for East Asian culture - The Collegian",
    "datetime": "2015-03-10T05:42:38+00:00",
    "url": "https://www.kstatecollegian.com/2015/03/10/professor-shares-love-for-teaching-passion-for-east-asian-culture/"
}