{
    "text": "How the Prudential Center in Newark became K-pop's East Coast home with the arena executives talking why K-pop is good business -- monetarily and socially. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin For the third year in a row, K-pop fans will flock to Newark’s massive Prudential Center to make their annual pilgrimage to the East Coast iteration of KCON. For all day on June 24 and 25, headliners like Highlight, CNBLUE, TWICE, GFriend and NCT 127 perform and meet fans during two days and nights of non-stop panels, workshops, fan meetings and concerts. The world’s biggest K-pop and Korean-culture festival has spent six years jumping venues for its landmark event in California, but when it came time to open an East Coast stop, The Rock was eager to step up.  K-pop shows started becoming a regular experience for Prudential Center in 2011 — mind you, before PSY‘s “Gangnam Style” blowup in summer of 2012 — with the arena reporting nearly 130,000 people come through their doors, grossing around $17.43 million in ticket sales, all in the name of K-pop. But as Prudential Center’s executive vice president of entertainment programming Sean Saadeh explains, the appeal goes beyond money. “It’s great business in a lot of different ways,” he says. “Not just financially, but from a branding standpoint, the social aspect and the bringing in news fans to Prudential Center as well as the city of Newark.” Saadeh says diverse programming has been a cornerstone of the venue with Korean-pop concerts making that goal easy. “I was actually surprised at how diverse the fanbase was,” the exec adds, citing BIGBANG‘s two 2015 shows as his first eye-opening moment. “Initially, I thought it was going to be Korean fans or a majority of Korean fans, but everyone loves this music. I love that and it continues to diversify over time.” 2016 and 2017 concerts by the likes of EXO and BTS created some of the most fervent responses. “It’s incredible to see how quickly the tickets move,” says vice president of entertainment programming Brian Gale. “We put EXO tickets on time at 8 p.m., which was a very weird time to do that, and within 20 minutes we were about 1,500 tickets shy of a sellout.” “I was blown away with the intensity of the fanbase,” adds Saadeh. “BTS was ridiculous. I think they sold out quicker than when Bruce Springsteen went on sale. There’s such a huge demand.”  The famously passionate and connected K-pop fan makes the venue not only see gains on social media, but forces them to step up their facility game. “If you do something well, [fans] will talk about it in the community,” Gale adds, with Pru Center adamant that K-pop is their top social-media content, boasting nine of their 10 most fan-engaged pieces of content coming from Korean acts. “They talk online, they talk on blogs, they’re very active. I think from a facility standpoint, it’s exciting to see them talking in that market atmosphere. When things go well, it keeps you in line to do things well because they talk.” That buzz — along with an outdoor plaza, private practice facility and parking lots surrounding the building ideal for outdoor activities — helped Prudential land the East Coast location when KCON was looking to expand. “I love that we’re involved at the very front end when these acts get introduced to the United States,” Saadeh shares. “It’s the reason why We’ve become this ‘East Coast home of K-pop’ which is something really embraced from the get-go and I think it’s part of the reason why we’ve been so successful.” With a steady stream of three to four shows planned a year along with expanded space and dedication to the ongoing KCON fest — which will be seen by this year’s heavier emphasis on K-food trucks and food programming taking over an adjacent parking lot — Prudential Center sees K-pop’s future as reminiscent of mania over Beatles or Backstreet Boys. “It’s such an incredible experience,” Saadeh marvels. “They’re lining up 24, 48 hours outside of the building and when we open the doors, the passion to get to the front of the stage, it reminds of a different era quite frankly.” Daily newsletters straight to your inbox Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "title": "Prudential Center: How It Became the ‘East Coast Home of K-Pop’ Ahead of KCON 2017 New York | Billboard – Billboard",
    "datetime": "2017-06-23T17:25:57+00:00",
    "url": "https://www.billboard.com/pro/kcon-2017-ny-prudential-center-kpop-east-coast-home/"
}