{
    "text": "With a familiar cast of characters and an equally hilarious plot line, PSY has another win with his \"Gentleman\" music video. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin The love for PSY’s “Gangnam Style” certainly hasn’t slowed with the horsey dance video currently at over 1.5 billion views on YouTube. Its follow-up gives viewers more of what they want: crazy PSY! The music video for “Gentleman,” released Saturday morning (April 13), follows a similar style to “Gangnam” and its much-loved antics. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tPSY\t\t\n\t\t\t\t\t\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news PSY Pays Tribute to Beyonce At South Korea Concert Those well-versed in “Gangnam Style” will see familiar faces like the dancing man in the yellow suit (aka comedian Yoo Jae Suk), the man in the cowboy hat who dances over PSY in an elevator (aka entertainer/businessman Noh Hong Chul) and hoards of hilarious senior citizens. But, “Gentleman” has an added sexual twist. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t04/13/2013  Despite the new single being titled “Gentleman” the video showcases the K-pop king being anything but. He’s pulling chairs out from beneath beautiful women, making little kids cry and attempting to pull off sunbathing girls’ tops. That is, until popular and sexy K-pop singer Ga In shows up in a body-hugging football outfit. Now, the tables are turned on PSY who is having chairs pulled out from underneath him.  Ga In is a member of popular K-pop girl group Brown Eyed Girls who also has her own successful solo career–her single “Bloom” peaked at No. 2 on the K-Pop Hot 100 in October and latest single “Brunch” just debuted at No. 36 this week. She is PSY’s new co-star a la HyunA (a member of girl group 4minute and solo star herself) in “Gangnam Style.” The subtle hip-shaking choreography featured throughout “Gentleman” is actually homage to her group’s mammoth 2009 hit “Abracadabra.” The single helped usher in a wave of electro-pop to Korea with its slick production, vocal-distorting effects topped off with a sugary sweet catchy hook. PSY had previously teased that Koreans knew the main dance move of the video very well and “Abracadabra” has stood the test of time as a major hit in the ever-changing K-pop culture. See the original, racy music video below:   It was revealed that PSY had only finished filming his music video to “Gentleman” this week. At times, the video looks a bit like a behind-the-scenes look at “Gangnam Style.” But that doesn’t make it any less entertaining. Will it break the view count for “Gangnam Style”? Several months will need to go by prove that, but with over 50,000 attending his concert in Korea tonight and around 150,000 watching via a YouTube stream, there’s definitely no lack of hype for PSY’s new single. Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "title": "PSY ‘Gentleman’ Music Video: Watch the Follow-Up Visual to ‘Gangnam Style’ – Billboard",
    "datetime": "2013-04-13T13:00:00+00:00",
    "url": "https://www.billboard.com/music/music-news/psy-gentleman-music-video-watch-the-follow-up-visual-to-gangnam-1557385/"
}