{
    "text": "Aspiring farmers and entertainers ought to be computer whizzes, according to the Silicon Valley Education Foundation. The nonprofit organization invited more than two dozen education and business leaders from across California last week to discuss how to make that happen. Amid growing demand from students and industry leaders, the event is one of the first statewide initiatives to discuss the future for a formal computer science curriculum for California’s K-12 schools. “We need to rethink whether we need to be more aggressive in our approach,” said Michael Kirst, president of the state Board of Education. Fewer than half of California high schools offer computer science, and only 13% offer an AP course in the subject, according to data from the state Education Department. A variety of classes are offered, but there are no statewide guidelines for integrating the subject into classrooms. “Offering a potpourri of courses might not be the ideal thing,” Kirst said. “There is no clear consensus on what students need to know and need to be able to do.” The purpose of the round table discussion was not to take action but to identify what students should learn, how to raise awareness about computer science courses and how to increase access to them. “It’s the start of a conversation,” said Muhammed Chaudhry, Silicon Valley Education Foundation’s president and chief executive. Representatives from schools, the College Board, Computer Science Teachers Assn., tech companies and other organizations discussed creating policies that make computer classes accessible and encourage students to take them. For example, giving teachers professional development opportunities could raise the number of instructors qualified to teach computational thinking and problem solving. Giving students science or math credits for computer science courses could also be an incentive for students to enroll. Some suggested making computer science a requirement for graduation. There are already many competing requirements in California’s educational landscape, though, including adhering to new Common Core learning goals. “If the state would require students to take computer science, we’d have to pay for it,” Kirst said. “Moreover, mandating something is very difficult because you have to make sure what you’re mandating is exactly right for everyone in the state.” Chaudhry said computer science is “such a 21st century skill, we can’t afford to wait … to introduce it.” Companies across all fields are hungry for computer-savvy workers. Hadi Partovi, founder of Code.org, a nonprofit that advocates for computer science classes and one of the round table’s featured presenters, said that there are 75,000 open computer science jobs in the state. A 22% increase in the number of jobs for software developers is expected by 2022, according to the U.S. Bureau of Labor Statistics, twice the average job growth rate. The issue has picked up steam in politics and pop culture. Currently, four of eight proposed bills to advance computer science in classrooms have passed the Assembly and state Senate, according to Government Technology, a magazine that covers the role of information technology in state and local governments. Last year, Mark Zuckerberg, Bill Gates and celebrities such as musician will.i.am and Chris Bosh of the NBA participated in a YouTube video that went viral and called on everyone to learn to how to program computers. “California is a leader in providing what our workforce needs,” Chaudhry said. “California has the potential to be a leader in this.” sara.hayden@latimes.com Twitter: @haydensaraa Start your day right Sign up for Essential California for news, features and recommendations from the L.A. Times and beyond in your inbox six days a week. You may occasionally receive promotional content from the Los Angeles Times. California Oct. 24, 2023 California Oct. 21, 2023 California Oct. 19, 2023 California Oct. 19, 2023 California California Travel & Experiences Company Town Climate & Environment California Oct. 25, 2023 California Oct. 25, 2023 California Oct. 25, 2023 California Oct. 25, 2023 California Oct. 25, 2023 Subscribe for unlimited accessSite Map Follow Us MORE FROM THE L.A. TIMES ",
    "title": "Pushing the Start button on a computer science curriculum for K-12 schools - Los Angeles Times",
    "datetime": "2014-09-02T04:32:00",
    "url": "https://www.latimes.com/local/education/la-me-computer-science-20140902-story.html"
}