{
    "text": "LIVE UPDATES: Shooter at large after at least 15 killed and dozens hurt in Lewiston, Maine  More from NBC © 2022 NBCNEWS.COM PYEONGCHANG, South Korea — As the flames were extinguished at the end of South America’s first Olympic Games on Sunday night, the focus shifted from Rio to an unprecedented series of spectacles in East Asia. The next Winter Olympics will be held in the ski resort of PyeongChang, followed by Summer Olympics in Tokyo two years later and another Winter Games in Beijing in 2022. The closing ceremony in Rio started the clock ticking for 547 days until PyeongChang 2018. And South Koreans can’t wait. In the nearly finished skating arena, former Olympic skating gold medalist and organizer Kim So-Hee told NBC News that \"we are a little bit nervous, but we are so excited.\" The venue, one of six impressive new facilities, will be ready in November to hold test events. “We are ready,\" Kim added. “We’ve been watching Rio and the people of Korea are very excited to welcome all the world’s top skaters here.” PyeongChang won the bid to host the Games at the third attempt, having narrowly lost the votes won by Vancouver and Sochi. They are determined to make their Games memorable. “We want to host the best Winter Games ever made,” said Lee Hee-beom, the president of PyeongChang's Organizing Committee. “All the venues will be ready by the end of October this year. We will be ready to host a historic Games.” And they will cost a lot less than the last Winter Olympics. Korea will spend $13 billion, nearly four times less than Russia spent on the Sochi Olympics, the most expensive in history. Ninety percent of that spending is on the infrastructure that will benefit a region that has long languished as one of the most backwards in Korea. A new high-speed train will whisk spectators from Seoul in under an hour. It now takes nearly three hours to make the journey from the capital. The organizers hope new roads and venues will make the mountainous area in Korea’s East a magnet for tourists and skiers from across Asia. The facilities rising fast from Korea’s red earth are all within 30 minutes of each other, as Korea aims to hold the most compact and athlete-friendly Games to date. They also hope there will be no repeat of their last Olympics — Seoul 1988 — when their neighbors from Communist North Korea boycotted the Games. “Those who love peace ... have the obligation to participate, so there is no exception including North Korea,\" Lee added. “I hope these Games can improve relations with North Korea, true to the spirit of the Olympics.\" PyeongChang added that capital letter \"C\" to the middle of its name to avoid confusion with the Pyongyang, the capital of North Korea. There was real concern that some people might board planes for the Communist country by mistake, so rebranding the city was seen as vital to getting its name on the global map. The organizers are also hoping one other, vital component won’t be missing from their Games — snow. PyeongChang is always well below-freezing in February, when the Games will begin, but its snowfall is variable. “Even without snow from the skies, we will make snow,” Lee said. \"Artificial snow! We have lots of snow makers. No snow, no problem!\" South Korea is not known as one of the world’s great skiing nations but competitors from the U.S. and Europe were enthusiastic about the slopes during test events in PyeongChang earlier this year. The country does excel at skating— both of the speed and figure varieties. Yuna Kim struck gold in the latter in Vancouver six years ago and became a national heroine and cultural icon. During a tour of construction sites in PyeongChang this week, workers waved at what for Koreans is her instantly recognizable face. The figure skater marveled at the build up to the Olympics in her home country. “I’ll never forget the moment PyeongChang was chosen as the host city ... and now I’m excited,\" she told NBC News. \"Korean fans have so much energy and there’ll be such a great atmosphere at the venues that I’m sure we will make these the best Games ever.\" They’re certainly praying for success. At the ancient Buddhist temple of Woljeongsa in lush forest high above PyongeChang, Vice-Abbot Ja Kwang says “for 1,000 days we have been praying to Buddha for success ... We want a success ... but anyway, this country is smiling!” Smiling, and sleepless for some. Lee, who bears responsibility for delivering the Games on time and on budget, says while he was in Rio trying to learn lessons, he woke most nights to write down things that went through his mind. And by day, he walked around with “yellow note papers stuffed in my pockets.\" Without using the word “mistakes,” Lee highlighted areas where Rio has been openly criticized as areas he aimed to improve on: transportation, accommodation and volunteers. This week's heatwave in PyeongChang, its cable cars rising amid lush, almost tropical forest and the green slopes of the downhill ski area make it hard to imagine the Winter Olympics here. But an army of construction workers and the almost constant din of bulldozers herald the start — in just 78 weeks — of one of the Olympic movement’s most culturally rich and promising Games: K-culture on ice. © 2022 NBC UNIVERSAL ",
    "title": "PyeongChang 2018 Winter Olympics: Think K-Culture on Ice",
    "url": "https://www.nbcnews.com/mach/news/pyeongchang-2018-winter-olympics-think-k-culture-ice-ncna634256"
}