{
    "text": "US-China Today spoke with Lindsay Roberts about K-pop culture and the popular Korean boy group BTS . Originally published by US-China Today on January 2, 2019. Written by Lindsay Cai and Vivian Zhu. In the last few years, the music genre of K-pop has grown increasingly popular among American and international audiences. The K-pop boy band BTS stands out among South Korea’s most successful idol groups, achieving widespread population and acclaim among youth across the globe. US-China Today interviewed Lindsay Roberts to discuss this pop culture phenomenon in the context of the Chinese and US music and entertainment industries. As the main editor and writer of Seoulbeats, Lindsay Roberts has extensive experience on South Korean culture and entertainment. She is currently pursuing a PhD in East Asian Languages and Cultures at the University of Southern California. Her research areas include contemporary South Korean cinema and other visual medias with a focus on topics concerning ecocriticism, eating culture, consumable as related to nationalism and South Korean zombie cinema as related to the issue of South Korean specific ecocriticism. We know that you are a professional in the field of Korean pop culture – can you introduce a little bit more about BTS to those who haven’t heard about them before? What is your impression about them? What is the general impression of BTS perceived in both the United States and China? Actually there are lots of popular K-pop groups before BTS such as BigBang and Girl Generation, but BTS is an outstanding case among all those groups, opening up a new type of music worldwide, of K-pop in America and China. Because of China’s geographical location near South Korea, China has more chances to connect to Korean pop music. On the other hand, the United States has not experienced much Korean culture, so Americans are hesitant to open their doors to such a new genre of music. But despite those historic factors, BTS has now become a noted group that occupies worldwide influence in both the United States and China. What are unique features and characteristics of BTS that distinguish them from such massive pop music groups (referring to other American and Chinese pop groups)? How do they market themselves? There are a number of factors. One of the issues is that Korean companies try to localize themselves to fit in with American culture. But they seem to be disingenuous towards American audience and lose their own music styles. BTS, on the contrary, behave as themselves. Their company, Big Hit, is a small-scale entertainment agency in South Korea. Compared with famous companies, such as SM, YG or JYP, small companies are more willing to accept foreign press exposure and [have] less restriction over their artists. For example, they try to keep the artist’s own music style while contribute to American hip-pop culture. Timing is also another important factor. Korean culture has raised national awareness in both China and America recently. For instance, after the song “Gangnam Style” by PSY was released in 2012, Korean culture such as K-drama and Korean food became more popular. This opened the door for BTS to gain foreign fandoms as well. BTS’s popularity has been a long-term process. Now, we can see BTS everywhere. BTS is not just an idol group in the entertainment industry, but they are also influential cultural ambassadors. For example, BTS gave a speech at theUnited Nations, built the fund with UNICEF. Can you address on that? Using K-pop as soft power to spread Korean culture is always a goal. In that respect, BTS seems to deliver their message genuinely. They have developed a theme of “love yourself” through a series of albums. This special theme aim to encourage people to define who they are. Because of their message, people differentiate BTS from other purely pop groups. Aside from them, BTS composed their own songs and wrote lyrics. For an instance, BTS member RM, wrote his own English Raps. Their high connectivity of music truly defines their uniqueness. I think this LOVE YOURSELF campaign has done very well. Actually BTS is not the first group to cooperate with non-profit organizations. Donation is a fandom tradition where Korean fans donate rice or water to poor countries to show support for their artists. However, those fans are limited by language. Because of BTS’s growing influence, foreign fans began to follow this tradition and become involved in non-profit campaigns. Would you share past and present situations of entertainment in LA? Are there any huge shifts of how Korean pop entertainment appeals to massive audiences in China? What caused Korean groups to enter the international market? Eight years ago, Korean groups had little exposure to American people. LA is special because there is a large Korean population here. However, people in many other areas in the United States do not have as many opportunities? to get to know Korean culture. Individuals Korean artists rarely have concerts in other US areas. During this period, as people have become more aware of the rise of Korean culture, K-pop has become mainstream in the music industry. The reason for Korean entering the international market is South Korea’s limited audiences. Fans are generally youngsters with little economic support, and most Chinese and Korean fans dedicate themselves to only one group. Such a fan culture is not sustainable for the current oversaturated Korean entertainment industry. Most groups began to expand their influence to a national level. What is the focus, respectively, of Chinese and American entertainment industry? How do they mostly attract to the public? Compared with them, in what way do Korean act in exporting their culture to other countries? Pop culture in America became established a long time ago, so their music market is sufficiently mature. Most hip-pop culture originated from American pop culture. China nowadays has begun to focus on pop culture development and launching many C-pop reality shows. However, China still needs to take a little longer time to find their own media image. But, K-pop can be an effective example to learn from. There are many good singers and musical groups in China. However, they struggle to achieve international popularity influence. For example, in Spotify, it’s difficult to find any trace of Chinese pop song sources and promotions, whereas Korean musicians connects closely to music platform (doing daily advertisements). How do you think the Chinese music industry can learn from Korean entertainment’s success? There are two reasons to explain this situation. Firstly, it is hard to get in touch with C-pop through only Mandarin because the language barrier prevents much interest from audiences outside China. There’s so little sources for them to keep track of Chinese latest entertainment industry, thus attracting less audiences in global. Secondly, mass social media platforms like YouTube are the key. For example, every Korean group has its own YouTube Channel. However, due to Chinese limitation on Internet policy, it is difficult for foreigners to listen and get into Chinese music. Why do you think some Chinese singers choose to join Korean groups to debut?  The Chinese market lacks a complete trainee system to train potential singers, whereas the Korean entertainment industry has an advanced managing system. This Korean managing system keeps long-going popularity for present Korean groups. Unlike most people who gained undeserved fame overnight and disappeared in a very short time, this systematic trainee system is skilled at developing artists with continued performances in a relatively long term. Because of that, China nowadays has started to imitate such a system and played a Chinese elimination show Idol Producer to gain attention on this topic. Also, we know there are even some Asian Americans choose to join Korean groups to debut because it is much more difficult for Asian Americans to gain success in the in the music industry in the United States. Joining Korean groups to debut is a good way to realize their music dreams. Meanwhile, a rising Korean culture changes the Americans’’ stereotypical perception towards Asians. Such timing is is somewhat thanks to BTS’s huge influence. Header photo by @bts_bighit Tags: Tencent, NetEase and other successful Chinese video game companies are aiming to expand and deepen their reach in overseas markets. They've enjoyed success, but some less well-known firms such as MiHoYo earn the bulk of their revenues abroad. Lisa Cosmas Hanson, CEO of Niko Partners, analyzes the hurdles Chinese firms confront and discusses the strategies they use. Are they succeeding? Technonationalism is on the rise in both the U.S. and China. Mahbani and McLaughlin were on the ground in Hong Kong and provide this history of the Hong Kong pro-democracy movement centered around a cast of core activists, culminating in the 2019 mass protests and Beijing's crackdown. Bill Einreinhofer is an Emmy Award-winning documentary producer/director and emeritus chair of the New York Film Academy's Broadcast Journalism department. USC US-China Institute 3502 Watt Way, ASC G24 Los Angeles, CA 90089-0281 Phone: 213-821-4382 Fax: 213-821-2382 uschina@usc.edu china.usc.edu © 2023 USC US-China Institute. All rights reserved. ",
    "title": "Q&A With Lindsay Roberts On K-Pop’s Influence In China And The United States | US-China Institute",
    "url": "https://china.usc.edu/qa-lindsay-roberts-k-pops-influence-china-and-united-states"
}