{
    "text": "Katie Collins Traditional generational theory that ties classic youth concerns to literal age is broken, a new report on generation branding will say. Instead, the impact of the internet and globalisation means that people of many ages are exhibiting identity-defining behaviours, such as attempting to prove why they are unique, which are traditionally associated with the young. Youthmode: A Report on Freedom has been drawn up jointly by K-HOLE, a trend forecasting group in New York, and Box 1824, a Sao Paulo-based research organisation, and will be presented on 18 October at the 89plus marathon event hosted by London's Serpentine Gallery. The multidisciplinary event is based around examining the impact that our networked society and global economy have had on today's younger generations. Along with the presentation of Youthmode, the marathon will include talks from Nick D'Aloisio and Jake Davis -- both of whom are speakers at Wired 2013 this week. K-HOLE and Box 1824 wanted to examine the way generational branding is used by marketers to ascribe certain behaviours and social expectations to a group of a people based purely on age. \"We spent a very long time talking through what we thought was at play with the project of trying to brand a new generation,\" Emily Segal from K-HOLE tells Wired.co.uk. By Matt Kamen By WIRED By Matt Kamen By Peter Guest Marketers themselves have struggled with this question, having failed to identify the factors that define generational linearity in the digitally native youth of today, leading them to declare that demography is dead. The reason for this is the way we all -- young and not-so young alike -- behave now we are on the internet. \"The behaviours we're seeing based purely on age aren't really as indicative as other behaviours based on more psychological or emotional factors,\" says Segal. \"Nonetheless, no-one's really come forward with a new solution and our take was because this whole project of trying to brand generations in the traditional way is done, it doesn't work anymore, that we need a new way of thinking of about what it means to be young.\" To us, the reason there's a shift is that now the crisis of being special is everyone's crisis because of the internet and globalisation\nEmily Segal, K-HOLE The groups came up with the idea of youth as a mode, or as an attitude of being -- hence Youthmode -- rather than as an age-related phase people pass through. It's partially defined by something the report is calling our \"Mass Indie\" culture, which is based on the idea that everyone concentrates so hard on what makes them unique and special that they end up in a state of sameness due to their preoccupation with proving their difference. One example, says Segal, is the proliferation of internet and tech startups with made-up names that all end up almost indistinguishable from one another. \"What we address in this report is the idea of a crisis of what it means to be special is no longer limited to young people,\" she says. She draws on the Catcher in the Rye as an example of how in the twentieth century, behaviour relating to an individual's crisis of their own specialness, including attempts to assert individuality, rebelling against the mainstream and exposing hypocrisy, were very much associated with youth. \"To us, the reason there's a shift is that now the crisis of being special is everyone's crisis because of the internet and globalisation.\" One of the ideas behind Mass Indie is that it tricks us into thinking we are celebrated because of our difference, when in fact what we're seeing is homogenisation and mainstreaming of difference. As the report puts it: \"just because Mass Indie is pro-diversity, it doesn't mean it's post-scarcity.\" This is more an observation of something we all participate in rather than a declaration of a cultural crisis, says Segal, but it is problematic in terms of alienation and a lack of real cultural innovation. The report instead proposes a new model, which it calls \"Normcore\" and is based on the idea of opting into sameness and looking for opportunities to create connections, rather than focusing on self-differentiation. \"Once upon a time people were born into communities and had to find their individuality. Today people are born individuals and have to find their communities. It's no longer subversive to create exclusive circles of people in the know. The real feat is finding where there's potential for connection to spring up,\" the report says. Normcore is an emergent model and to adopt it would rely significantly on reshaping the way society thinks about what it actually means to be cool and be consumers. Segal will be presenting these ideas and discussing them in more detail along with other members of K-Hole and Box 1824 teams on stage at Serpentine Marathon this weekend. By Matt Kamen By WIRED By Matt Kamen By Peter Guest By WIRED By Matt Burgess By Grace Browne By Amit Katwala © Condé Nast Britain 2023. ",
    "title": "Report: 'the crisis of what it means to be special is no longer limited to the young' | WIRED UK",
    "datetime": "2013-10-18T11:55:00.000Z",
    "url": "https://www.wired.co.uk/article/serpentine-89plus-marathon"
}