{
    "text": "A media report from Taiwan says that TSMC, the world’s No. 1 foundry based in Taiwan, has purchased in advance more than 50 percent of EUV lithography equipment that will be produced by ASML of the Netherlands in 2021. Samsung began to use EUV lithography equipment last year to produce 7-nanometer semiconductors. TSMC has signed a contract with ASML to purchase more than 13 pieces of EUV lithography equipment in 2021, the Taiwanese media outlet DigiTimes reported. This means TSMC has secured half of ASML's annual EUV lithography equipment output as the Dutch company produces 25 or 26 pieces a year. ASML is the world’s only producer of EUV lithography equipment, which costs about 150 billion won per piece. Korean companies cannot be expected to localize the equipment in the near future. Samsung Electronics vice chairman Lee Jae-yong flew to Eindhoven in October to meet with the ASML CEO and ask for an early delivery of the EUV equipment the company has ordered. The more EUV equipment TSMC buys, the less will be left for Samsung Electronics. \"By the end of 2021, TSMC will have more than 50 pieces of EUV lithography equipment. This means that the Taiwanese chipmaker will have about 20 pieces more than Samsung,\" the DigiTimes quoted a semiconductor industry insider as saying. Samsung Electronics has decided to use EUV lithography equipment not only in foundry processes but in DRAM produciton. Its purpose is to establish economies of scale by utilizing EUV lithography equipment in both memory semiconductor and system semiconductor production. The reason why TSMC purchased EUV lithography equipment in advance is that it is busy meeting rushing orders for 7-nm and 5-nm products. If a company outsources production of 7-nm or sub-7-nm chips to TSMC, it has to wait a year or so before receiving the finished products. TSMC has a comparative advantage over Samsung in packaging that combines DRAMs and NAND flashes with system semiconductors. Currently, TSMC is using the latest 5-nm line to make chips for Apple and AMD. The latest chipset A14 Bionic for Apple's iPhone 12 was mass-produced using TSMC's 5-nm process. The A14 Bionic is at least 50 percent better in performance than competing chips. So does Apple’s latest GPU, Apple said with confidence at the time of taking the wraps off the iPhone 12. Competing chips mentioned at the time are Qualcomm's Snapdragon and Samsung's Exynos. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Report Says TSMC Ahead of Samsung Electronics in EUV Lithography Equipment Ownership - Businesskorea",
    "datetime": "2020-11-17T14:51:56+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=55209"
}