{
    "text": "By Mark Memmott Army Brig. Gen. Jeffrey Sinclair as he arrived for his court-martial case Thursday at Fort Bragg in Fayetteville, N.C.\n                \n                    \n                    Chris Keane /Reuters/Landov\n                    \n                \nhide caption Army Brig. Gen. Jeffrey Sinclair as he arrived for his court-martial case Thursday at Fort Bragg in Fayetteville, N.C. Army Brig. Gen. Jeffrey Sinclair avoided jail time Thursday and instead \"was reprimanded and fined a total of $20,000 for inappropriate relationships with three subordinates in a closely watched court case,\" The Associated Press reports from Fort Bragg, N.C. According to The New York Times, Sinclair will \"forfeit $5,000 a month in pay for four months, but was allowed to keep his pension.\" Sinclair was not demoted or dismissed from the military, NPR's Tom Bowman adds. He reports that \"any reduction in rank would be determined by a military board, once the general decides to retire.\" The 51-year-old Sinclair, as we've written, was accused of sexually assaulting a subordinate, but struck a deal with prosecutors to plead guilty to lesser charges. NPR's Bowman has previously reported about how the prosecution's case came apart: \"The charges stemmed from an affair Sinclair had with his accuser, an Army captain, that continued for several years while both served in Iraq and Afghanistan. \"The case began to unravel when the prosecution learned that Sinclair's accuser continued their affair after the alleged assault. \"Also, the judge in the case determined that senior Army officials in the Pentagon unduly influenced the case when they rejected an earlier plea agreement, fearing political repercussions.\" As the AP notes, the Sinclair case came \"as the military works to curb sexual misconduct and Congress considers military justice reforms aimed at helping assault victims.\" Update at 5:30 p.m. ET: Bowman reports on All Things Considered that the sentence was so surprising that Sinclair's defense attorney was heard to say \"wow\" when it was read. \"The defense basically agreed, in the plea deal, that Gen. Sinclair should face jail time,\" Bowman says. \"I spoke with several military lawyers who said the army is shooting itself in foot,\" he says. \"I spoke with victims' advocates who said this shows the system is all about cronyism.\" Sponsor Message Become an NPR sponsor ",
    "title": "Reprimand, $20K Fine, No Jail Time For General's Sexual Misconduct : The Two-Way : NPR",
    "url": "https://www.npr.org/sections/thetwo-way/2014/03/20/291888006/reprimand-20k-fine-no-jail-time-for-generals-misconduct"
}