{
    "text": " SUMMARY This is AI generated summarization, which may have errors. For context, always refer to the full article.  MANILA, Philippines – Beside a bus station in Manila stands a derelict building where the homeless usually sleep. The paint has been peeling off its walls over the years as more and more graffiti cover its exterior. For more than a decade now, the Manila Metropolitan Theater has looked less like a national cultural treasure and more like a forgotten piece of history. But it is slowly coming back to life. Two days after the 84th anniversary of the inauguration of the theater, the National Commission for Culture and the Arts (NCAA) formally kicked off the restoration of the MET – called “METamorphosis” – with a clean-up drive powered by architecture student-volunteers. “This is important because buildings are not just structures. They anchor our collective memory and they are documents of our national identity,” said Gerard Lico, head architect of METamorphosis. “For me, personally, it’s an honor to revive the MET kasi ‘yung (because of its) cultural significance,” said Juancho Agoncillo, a 5th year architecture student from the University of the Philippines-Diliman. Then, now, and the future The MET’s cultural significance lies not only in the historical events it hosted but also in the fact that it is “the only existing art deco building in its scale and integrity in Asia,” as declared by heritage conservation experts. Its interior is decorated with artworks and ornaments created by National Artist for Visual Arts Fernando Amorsolo and Italian sculptor Franceso Monti. It was bought by the National Commission for Culture and the Arts from the Government Service Insurance System in June 2015. The P270-million sale which cost the NCCA 30% of its budget will require an additional P350 million-P500 million for it to be functional. While water supply has already been restored to the theater, there is still a long way to go. According to Lico, they plan to repair the theater, which is also prone to flooding, and refurbish its original Italian art-deco elements that are merged with indigenous Filipino motifs.  However, the obstacles do not only lie in restoring the Philippines’ first national theater to its previous glory. Foreseeable problems Aside from funding, one of the major challenges that the team faces is its sustainability amid competing forms of media. More than restoring its physical beauty, Lico and the NCCA want to add more to its original purpose. “We really have to reinvent the building to make it relevant. It’s the same building but with a new function,” he said. While there are no final plans yet, they envision a MET that is more than a theater; a cultural hub that is “relevant to our present condition.” In line with this, they will be conducting several focus group discussions about possible concepts and will be open to suggestions from the public via their Facebook page. “We don’t want to impose. When you impose the function of the building, eventually it will fail kasi hindi siya nanggaling sa tao (because it did not come from the people),” explained Lico. Involving the audience Mikaela Burbano, a 3rd year architecture student who participated in the clean-up, volunteered because she wanted to see the interior of the MET. Ever since she was a child, she has passed by the building and looked at it with a mix of admiration and curiosity. When she first stepped into the dark theater during the launch, the first word that popped into her mind was “sketchy.”  “Pero at the same time, nakikita ko ‘yung hope,” she said. (But at the same time, I saw hope.) “Yung iba kasi nawalan na ng hope. Actually ‘yung daddy ko sabi niya, ‘Noong college ako, sabi ire-restore ‘yan. Nag-retire na ako, sabi pa rin ire-restore ‘yan. Ikaw college ka, antayin mo na ma-restore na naman ‘yan,” she added. (Others have already lost hope. Actually, my dad said, “When I was in college they said they would restore the MET. When I retired, that’s still what they said. You’re now in college, just wait again for it to be restored.”) The delays were caused by funding and ownership issues. Although the NCCA aims to complete the restoration in the next two to 3 years, NCCA executive director Adeline Suemith admitted that this is a moving target. “Sana tuloy-tuloy na….Ang restoration ng mga gusaling ito ay hindi puwedeng madaliin,” Suemith said. (I hope this will continue. The restoration of buildings like these cannot be done haphazardly.) “Mas malaki ‘yung chance ma-achieve ‘yung goal ‘pag mas maraming magka-interes at mag-volunteer,” said Burbano. (There is a better chance of achieving our goals if more people are interested and are willing to volunteer.)  The NCCA will call for more volunteers over the next few months because it wants the theater to belong to the audience as well. “We want the public to have a stake, to have a sense of ownership. The moment people start cleaning it; para silang naglilinis ng bahay (it’s like they’re cleaning a house). So you empower them to possess the building so nagkakaroon ng (they have) emotional attachment…it’s an act of professing allegiance to a heritage building,” said Lico. – Rappler.com Error. Please abide by Rappler's commenting guidelines. There are no comments yet. Add your comment to start the conversation. JOIN OUR NEWSLETTER Fearless reporting delivered to you follow us    ",
    "title": "Restoring the MET, reviving culture",
    "datetime": "2015-12-13T03:00:07+00:00",
    "url": "https://www.rappler.com/life-and-style/arts-culture/115826-metropolitan-theater-reviving-culture/"
}