{
    "text": "Although Pier Paolo Pasolini was best known as an Italian filmmaker, he called himself a poet and his Wikipedia entry begins by also describing him as a journalist, philosopher, linguist, novelist, playwright, filmmaker, columnist, actor, painter, political figure and all-around visionary thinker. The Monday Evening Concerts biography of Rolf Riehm describes the 75-year-old German composer as “a political being” whose work encompasses “philosophical reflection, historical fact, myth, fairy tale, recollection, scientific argument, the elevated and the trivial, current social and political findings” and whatnot. None of this tells us anything about the transgressive extremes of these artists, about the levels of sordid brutality or ethereal beauty to which their works could sink or rise. But there was no missing those extremes in Riehm’s “Pasolini in Ostia,” a subversive musical representation, as well as musical subversion, of reports of Pasolini’s 1975 murder outside Rome. PHOTOS: Arts and culture by The Times Although Riehm is a much bigger deal in Germany than in this country (he has no English-language Wikipedia entry), Monday Evening Concerts began championing him two years ago with a crazy piece about Stephen Hawking, and that led to the series commissioning “Pasolini.” The premiere was Monday night at the Zipper Concert Hall of the Colburn School. The context is complex and, no doubt intentionally, confusing. Riehm writes in his description of his new work — a quartet for soprano, piano, cello and irritatingly loud and incessant percussion — that his model is Bach’s St. Matthew Passion. Pasolini had a Matthew obsession; his third film was his soberly sensual “The Gospel According to Matthew.” In his quasi Pasolini Passion, which the composer calls a micro-oratorio, Riehm begins the first of four “arias” (feral vocal extravaganzas, in fact, sounding nothing like arias) with the line Bach used in his “St. Matthew”: “He was arrested.” Only Riehm’s he is no He. The convict was a bug-eyed 17-year-old male prostitute nicknamed the Frog accused of running over Pasolini in a sex crime. Italian justice leaves holes, however, and the possibility remains that Pasolini, an outspoken Communist, was a political target and the Frog a patsy. Whatever happened that terrible day in Ostia, no saints were on hand, and Riehm’s Passion is a revelation of a passion gone astray, a descent into hell. An arresting soprano, in all senses, Alice Teyssier was required to maintain an impossibly high tessitura for nearly half an hour. She got breaks, occasionally asked to calmly read texts or mimic eating olives and spitting out the pits. The text itself ranged from spoken description of the arrest to howls. In moments of hushed piety, Riehm required Teyssier to assume Jesus’ arm motions from Pasolini’s “Matthew.” IN CASE YOU MISSED IT: Tony Awards nominations Now and then pianist Rei Nakamura, cellist Jeremiah Campbell and percussionist Jonathan Hepfer — all terrific — were on her side; mostly, though, they were not and used as weapons for Riehmian shock and awe. Nothing in the score is meant to happen gradually or naturally, but rather as trauma, as if this were a Passion of startling mistakes. We were, at least, prepared for trouble. The half-hour “Pasolini” came at the end of a long and peculiar program that began with the U.S. premiere of a related Riehm piece, “Lenz in Moscow.” Between Riehm’s premieres was a traditional piano recital by Alexander Lonquich, who is well known in Germany and has been recording for more than 30 years. But he has seldom come to the United States, and this was his Los Angeles debut. “Lenz in Moscow,” completed two years ago, is for trumpet, trombone, piano, cello, guitar, percussion and a recorded speaker. It characterizes in again wildly unmannered outbursts the incident of the 18th century German philosopher Jakob Lenz being found dead on the streets of Moscow. What did Lonquich playing Schumann’s “Kreisleriana,” Schubert’s short Allegretto in C minor and Janácek’s Sonata possibly have to do with Riehm? Not much, as far as the material went. But Lonquich plays spookily the way Riehm writes. There is no middle ground with him. He is a ferocious percussion player, focused and furious in his attacks on the keyboard. His other side is seamless lyricism and a heavy foot on the petal causing thick sonorities to ring long. Lonquich chose the unkempt early version of “Kreisleriana,” rather than the smoother-edged and much more common revision, slightly tying in fantastical Schumann with fantastical Riehm. In this 35-minute series of short pieces, the pianist went straight for Schumann’s split personality, as though riffing off a line from Riehm’s “Lenz” about “infantile schizophrenic references.” It was exciting. Schubert was bathed in a soft blanket of sound. In his Janácek, Lonquich rattled the walls. But Riehm did more. He rattled sanity and soul. mark.swed@latimes.com It's a date Get our L.A. Goes Out newsletter, with the week's best events, to help you explore and experience our city. You may occasionally receive promotional content from the Los Angeles Times. Follow Us Mark Swed has been the classical music critic of the Los Angeles Times since 1996. Television Oct. 25, 2023 Image Oct. 25, 2023 Music Oct. 25, 2023 Music Oct. 25, 2023 Entertainment & Arts Oct. 25, 2023 Company Town Oct. 25, 2023 Television Oct. 25, 2023 Movies Oct. 25, 2023 Music Oct. 25, 2023 Subscribe for unlimited accessSite Map Follow Us MORE FROM THE L.A. TIMES ",
    "title": "Review: A night of Riehm rattles and excites - Los Angeles Times",
    "datetime": "2013-05-01T01:39:00",
    "url": "https://www.latimes.com/entertainment/arts/culture/la-et-cm-monday-evening-concerts-review-20130501-story.html"
}