{
    "text": "Korean pop has its own term, sasaeng, to describe the underground teen-idol culture’s more extreme forms of creepy devotion, which can be measured on the tear-streaked faces of fans. But now that K-pop has crossed over into America, where top acts such as G-Dragon and Girls’ Generation have major-label record deals, it seems fair to expect the genre’s arena shows to get by on more than sasaeng fever alone. On Saturday, opening night of the South Korean pop-culture extravaganza KCON at a crowded Los Angeles Memorial Sports Arena, the lineup featuring mostly sweet-and-scrubbed-up boy-band acts such as B1A4, Teen Top and Vixx (with the saltier rapper G-Dragon headlining) followed a similar -- and very safe -- pattern. Acts that have won U.S. audiences with rousing high-gloss music videos were still figuring out how to hold a big stage. Some may argue that they don’t need to -- that the communal fun, shared dance moves and web of celebrity gossip that drive K-pop are enough. But watching KCON unfold, one couldn’t help but feel that K-pop still needs a way to meet American expectations for live shows. The concert began with Vixx, a boy band that formed, like many such acts, on a singing competition show. Like almost all vocals at KCON, though, the members of Vixx appeared to be lip-syncing. The group’s dance-centric set was quick, composed and quite mellow -- a world away from the surprisingly edgy video for Vixx’s hit “On and On,” where members are in chains in a grotty prison camp. B1A4, one of several acts making their U.S. live debuts here, came off much the same. In its video for “Lonely,” the group croons a pillowy slow jam in a winter storm. At KCON, by contrast, the five members wore schoolboy uniforms and squirted water guns at the audience. Like Vixx, B1A4 used the roundabout stage to acknowledge the whole crowd, true to K-pop conventions. But only on the techno-pop closer “Baby Good Night” did the band really get rowdy. IU, a young jazz-inspired singer, was the only female act to perform Saturday. (Sunday’s bill, with Girls’ Generation and Spica, is more varied.) She had a sprightly stage presence, and as a solo female singer, she’s breaking the molds for K-pop stardom. But the night only truly ramped up with Teen Top, a repeat performer at KCON that has gotten better since last year. The band added some streetwear swagger into its glossy pop, just enough to liven up singles like “I Wanna Love,” whose video is a shout-out to Wong Kar-wai’s dark Hong Kong romance “Chungking Express.” G-Dragon is K-pop’s most significant figure, as far as the genre’s Western ambitions are concerned. After rising in the boy band Big Bang, he transitioned to a solo career that has straddled American hip-hop, K-pop and electronic dance music. At last last year’s KCON, he performed with rapper Missy Elliott; he’s since cut singles with electronica producers Skrillex and Diplo. He’s the hope for K-pop on U.S. radio. G-Dragon’s electro-rap singles such as “One of a Kind” and “Crayon” are minimalist and fiery and absolutely belong at festivals like Hard Summer. His set at this year’s KCON was a bit pop-centric, but his visual aesthetic was perfect. (His dancers wore patches from the punk band GBH, and he looked to be wearing a promo T-shirt from the ‘90s flick “Waiting to Exhale.”) G-Dragon could be the pivot, the K-pop person who stops being so nice and starts being truly challenging. For the genre’s second wave in America, that would be a great place to start. Follow @AugustBrown for breaking music news. It's a date Get our L.A. Goes Out newsletter, with the week's best events, to help you explore and experience our city. You may occasionally receive promotional content from the Los Angeles Times. Follow Us August Brown covers pop music, the music industry and nightlife policy at the Los Angeles Times. Music Oct. 25, 2023 Music Oct. 25, 2023 Music Oct. 25, 2023 Sports Oct. 25, 2023 Entertainment & Arts Oct. 24, 2023 Oct. 24, 2023 Entertainment & Arts Oct. 24, 2023 Oct. 24, 2023 Entertainment & Arts Oct. 24, 2023 Subscribe for unlimited accessSite Map Follow Us MORE FROM THE L.A. TIMES ",
    "title": "Review: G-Dragon, Teen Top and B1A4 make K-pop's next moves at KCON - Los Angeles Times",
    "datetime": "2014-08-11T00:23:00",
    "url": "https://www.latimes.com/entertainment/music/posts/la-et-ms-gdragon-teen-top-b1a4-kpop-kcon-20140810-story.html"
}