{
    "text": "Four young women stand together firmly in front of hundreds of trumpets as brass blares in the background. The words “BLACKPINK in your area” ring out as the scenery quickly shifts to one of a woman in a puffy white dress landing on top of two giant swans. She then begins rapping aggressively. This is the beginning to K-pop group BLACKPINK’s new music video that sets up listeners for a powerful EP. “Kill This Love” is K-pop girl group BLACKPINK’s second EP. The group consists of four female members, Jisoo, Jennie, Rosé and Lisa. The titular track, “Kill This Love,” is an empowering song about moving on from a painful relationship. The track boasts strong marching band–like instrumentals and offers smooth transitions from intense rapping to melodic singing. The transitions from the verses to the chorus highlight each of the members’ excellent vocal abilities. The song also complements their signature choreography — a detail that is important because intricate dance numbers are a staple of K-pop music. The members’ dancing is synchronized with the beats of the song, especially during the chorus. The second song on the EP is titled “Don’t Know What To Do.” The beginning is soothing and calming, embracing the group’s delicate side before suddenly jumping into an upbeat EDM chorus. The chorus is also in English, making it easier for K-pop fans from all over the world to sing along. The most impressive song on the EP is “Kick It.” The song’s chorus is addicting and explosive, setting it apart from all of the other songs, even the title track. The ending is especially powerful and implements a prominent chant that tempts listeners to sing along cheerfully. Another exciting aspect is the full-English rap performed by a group member, Lisa. The flow is extremely catchy and goes along with the beat seamlessly. “Hope Not” highlights the members’ voices as being steady and gentle. The acoustic track is serene and calm and is perfect to listen to in a relaxed setting. The ballad shows a different side to BLACKPINK as it strays away from the group’s usually upbeat, pop vibe. In the past, the group only released one ballad song in its entire discography, so the addition of “Hope Not” is rather exciting because it shows BLACKPINK’s musical potential. The last song on the EP is a remix of the group’s previous hit single “Ddu-Du Ddu-Du.” This is the only track that fails to impress. The beats do not flow with the melody and putting the two elements together feels forced. Ultimately, the remix is a confusing mixture of cacophonous sounds. The EP would be perfect if not for the inclusion of this disappointing song. “Kill This Love” is the perfect EP to sing and dance along to. It highlights the vocal abilities of the group and is a strong addition to BLACKPINK’s already powerful history. Although the remix ends the album on a slightly sour note, the perfection of the rest of the EP overpowers any trace of disappointment. Your donation will support The Ithacan's student journalists in their effort to keep the Ithaca College and wider Ithaca community informed. Your contribution will allow us to purchase equipment and cover our annual website hosting costs. The Student News Site of Ithaca College ",
    "title": "Review: Album from female K-pop group is a powerful offering – The Ithacan",
    "url": "https://theithacan.org/34169/life-culture/reviews/review-album-from-female-k-pop-group-is-a-powerful-offering/"
}