{
    "text": "SAN DIEGO — No hard feelings, Shakespeare, but it sure is a pleasant change when one of those outdoor summer festivals devoted to your work offers audiences something beyond another smilingly superficial encounter with “As You Like It.” There are only so many times a spectator can stroll through a prettified Forest of Arden before getting a theatrical strain of Lyme disease. It’s been ages since I’ve seen “Rosencrantz and Guildenstern Are Dead,” Tom Stoppard’s metapharcical romp (to coin a genre), in which “Hamlet” is glimpsed through the oblique perspective of the prince’s twin buddies, sent to spy on him by Gertrude and Claudius in that Elsinore castle of murder, adultery and occult intrigue. And now thanks to Adrian Noble, the departing artistic director of the Old Globe’s Shakespeare Festival, this madcap caper is enjoying a sprightly San Diego revival. Running in repertory with “The Merchant of Venice” (also directed by Noble) and “A Midsummer Night’s Dream,” this gamboling production dresses Shakespeare in Beckettian clothing. Not literally, mind you. The costumes designed by Deirdre Clancy for Noble’s swift-footed staging have a classical bearing. But Stoppard’s philosophizing playfulness is clearly indebted to the music hall absurdism of “Waiting for Godot.” PHOTOS: Arts and culture in pictures by The Times “When ‘Godot’ was first done, it liberated something for anybody writing plays,” Stoppard himself has acknowledged. “It redefined the minima of theatrical validity. It was as simple as that.” In “Rosencrantz and Guildenstern,” the Czech-born, English-bred playwright considers many of the same questions pondered by Hamlet: Does fate or free will define our character? What is the point of action when death, our common end, is staring us in the face? But the tone of inquiry is too bouncily meta-theatrical for tragic melancholy. The demise of Rosencrantz and Guildenstern is reported as an incidental afterthought at the conclusion of “Hamlet,” but in Stoppard’s knockabout treatment, the death of these two cheerfully opportunistic fellows is the main act. What is it like to be a character on the margins of a tumultuous drama? Apparently, there’s a lot of waiting around while the protagonist talks to himself ad nauseam. CHEAT SHEET: Spring Arts Preview “Shouldn’t we be doing something — constructive?” Rosencrantz (John Lavelle) inquires of Guildenstern (Jay Whittaker), in a manner that freely invokes Beckett’s “Godot.” “I feel like a spectator — an appalling business,” this mischievous rascal jokes while staring at the audience. “The only thing that makes it bearable is the irrational belief that somebody interesting will come on in a minute.” Guildenstern’s response sums up the metaphysical plight of being cast, like most of us muddling humans, in an ancillary role: “What a fine persecution — to be kept intrigued without ever quite being enlightened.” Stoppard’s fertile wit keeps this three-act drama pulsing along without too much strain. A subtle pathos, along with the playwright’s verbal sophistication, prevents the play from degenerating into a collegiate vaudeville. The situation of Rosencrantz and Guildenstern is at once a theatrical problem and an existential one. Left so often to their own devices as the royal melodrama swirls around them (trailed by a film crew in one of Noble’s clever directorial liberties), these two clownish figures are filled with terrifying forebodings. PHOTOS: Best in theater for 2012 For advice on how to handle their confounding parts, they turn to the Player (a superbly hammy Sherman Howard), who as leader of the troupe that comes to entertain Hamlet and the court, clearly has a wealth of stage experience to call up. But he merely tells them, “Uncertainty is the normal state. You’re nobody special.” The subject matter darkens considerably, but the language remains spry. At moments, it attains a comic lyricism that’s as funny as it is piercing. When Rosencrantz cries out in exasperation, “Incidents! All we get is incidents! Dear God, is it too much to expect a little sustained action?!”, one laughs but with a haunting recognition. Lavelle draws out Rosencrantz’s affectionate naiveté. He’s softer and more happily bumbling than Whittaker’s Guildenstern, who’s leaner, angrier and more aware of starker realities. The two actors might not have the most natural rapport — ideally, the play would star Jim Carrey and his clone — but they bring a sharp clarity to their theatrical maneuvers. They also outshine, as they’re supposed to, those cast in the roles of Hamlet (Lucas Hall), Polonius (Charles Janasz), Gertrude (Ryman Sneed) and Claudius (Triney Sandoval), among other principals from Shakespeare’s original. In the inverted world of “Rosencrantz and Guildenstern,” the supporting players are the superstars, no matter how anxious they might be about the sketchy nature of their parts. Barry Edelstein, the Old Globe’s artistic director, is taking over the reins of the Shakespeare Festival, and as the former director of the New York Public Theater’s Shakespeare Initiative, he brings a great fund of experience to the job. He’s sure to vary the menu, as Noble has done during his four-year tenure. Expect to see not only more work from Shakespeare’s contemporaries but also modern classics with an unexpected Shakespearean scope. charles.mcnulty@latimes.com twitter.com\\charlesmcnulty ‘Rosencrantz and Guildenstern Are Dead’ Where: The Old Globe, 1363 Old Globe Way, Balboa Park, San Diego When: Contact theater for schedule. Ends Sept. 26. Tickets: $29-$94 Info: (619) 234-5623 or https://www.theoldglobe.org Running time: 2 hours, 20 minutes  It's a date Get our L.A. Goes Out newsletter, with the week's best events, to help you explore and experience our city. You may occasionally receive promotional content from the Los Angeles Times. Follow Us Charles McNulty is the theater critic of the Los Angeles Times. He received his doctorate in dramaturgy and dramatic criticism from the Yale School of Drama. Television Oct. 25, 2023 Image Oct. 25, 2023 Music Oct. 25, 2023 Music Oct. 25, 2023 Entertainment & Arts Oct. 25, 2023 Company Town Oct. 25, 2023 Television Oct. 25, 2023 Movies Oct. 25, 2023 Music Oct. 25, 2023 Subscribe for unlimited accessSite Map Follow Us MORE FROM THE L.A. TIMES ",
    "title": "Review: Welcome return of ''Rosencrantz and Guildenstern' - Los Angeles Times",
    "datetime": "2013-08-06T01:20:00",
    "url": "https://www.latimes.com/entertainment/arts/culture/la-et-cm-rosencrantz-guildenstern-review-20130806-story.html"
}