{
    "text": "Please donate. Your support has never been more vital to the ROM. Help more people access art, culture and nature.\nInclude the ROM in your will  TORONTO, September 1, 2022 – After a couple of years off, ROM (Royal Ontario Museum) is getting RAD again and bringing back ROM After Dark (#ROMAfterDark), the Museum's monthly evening cultural social event for adults (19+). The popular series features curated performances and music, gallery access and a night out on the town with an eclectic mix of bar refreshments and food from themed pop-up stations. ROM is launching the new season of ROM s Dark with RAD: K-Culture on Friday, September 16, 2022, from 7:30 PM - 11:30 PM. RAD returns for six more Friday evenings with new themes and new things to do and enjoy: October 28, November 25, December 31, January 20, February 10, and March 24. Tickets for RAD: K-Culture go on sale to the general public starting August 31. Tickets are $30. ROM Members get 10% off. For guaranteed entry, it is recommended that tickets be purchased online in advance at  https://www.rom.on.ca/en/whats-on/rom-after-dark  Headlining RAD: K-Culture will be performances by the band P1Harmony, featuring Markham’s own Korean-Canadian singer Yoon Keeho. Since debuting in 2020 with the release of Siren they have come out with five new albums including the recent Harmony: Zero In, with the title song Doom Du Doom which has been viewed on YouTube over ten million times as their fanbase grows. While driven by K-pop’s signature musical hooks, this edition of RAD will showcase a variety of Korean arts and culture in the forms of animation, calligraphy, fashion, music and dance. Visitors can join in and display their moves with Dance like a K-pop Star with Toronto’s RPM Dance Crew, take a shot at Korean Karaoke stardom or get dancing with DJ Yuka K and DJ Korea Town Acid. Sample Korean animation shorts with Manimals by Oh Jihyeon, Apartment by Lee Jui, and Shining Night by Yang Hyeonseo. For a more relaxed vibe, visitors can enjoy Korean tea tasting with certified tea sommelier Soo Park of Soocha Tea, groove to Korean Contemporary Jazz or enjoy the instrumental meditation sounds from Korean Traditional Music Association in Canada musician. Visitors can don traditional attire in the Hanbok selfie station, a type of traditional dress that remains an important part of Korean culture and worn on special occasions. RAD lineup for 2022-2023 season September 16, 2022    RAD: K-Culture – get things shaking with K-pop band P1Harmony and a host of Korean contemporary culture.\n\tOctober 28, 2022         RAD: Fantastic Beasts – a Halloween spooktacular! Admission includes access to the exhibition Fantastic Beasts: The Wonder of Nature.\n\tNovember 25, 2022     RAD: Being Legendary – explore Indigenous presence and knowledge with access to the exhibition Kent Monkman: Being Legendary, the landmark solo exhibition by this internationally acclaimed Cree artist. \n\tDecember 31, 2022     RAD: NYE @ ROM – out with the old and in with the new with this New Year's Eve celebration! Admission includes access to the exhibition Fantastic Beasts: The Wonder of Nature, Kent Monkman: Being Legendary, and Wildlife Photographer of the Year.\n\tJanuary 20, 2023         RAD: Design TO – get stylin’ and cultured. Includes admission to the exhibition Canadian Modern. \n\tFebruary 10, 2023       RAD: Love Struck – share some ROM love in celebration of Valentine's Day. Admission includes access to the exhibition, Kent Monkman: Being Legendary, Canadian Modern, and Wildlife Photographer of the Year.\n\tMarch 24, 2023            RAD: Humanity – enjoy peace, love and understanding in honour of Women's Month, International Transgender Day Of Visibility, and International Day Of Truth & Human Rights. Last Entry: 10:30 PM. Entrance for RAD is by the Michael Lee-Chin Crystal entrance on Bloor St. West. ROM After Dark K-Culture is made possible by the generous support of the Embassy of the Republic of Korea, the Korean Cultural Centre Canada, FNC Entertainment, the K-Pop Cover Dance Festival, KOCIS (Korean Culture and Information Service), the Seoul Shinmun Daily, Korean Consulate General in Toronto and Korean Tourism Organization.  -30- Social Media Community Guidelines Subscribe to our eNews and bring art, culture and nature to your inbox. ROM acknowledges that this museum sits on the ancestral lands of the Wendat, the Haudenosaunee Confederacy, and the Anishinaabek Nation, which includes the Mississaugas of the Credit First Nation, since time immemorial to today. An agency of the Government of Ontario ",
    "title": "ROM After Dark Returns | Royal Ontario Museum",
    "url": "https://www.rom.on.ca/en/about-us/newsroom/press-releases/rom-after-dark-returns"
}