{
    "text": " The New Northern Policy driven by the Moon Jae-in administration has been designed to promote cooperations primarily with Russia, which have been frequently halted whenever North and South Korea relations are strained, through the economy. South Korea seeks to extend its economic territory through the One Belt and One Road project with China and the New Northern Policy with Russia. However, the country cannot completely rule out the possibility of policy collision as the United States and Japan are expected to push strong with “Free and Open Indo-Pacific Strategy.” According to the KOTRA on December 7, Russia accounted for a mere 0.2 percent of South Korea’s total overseas investments as of 2016. It also took up only 1.5 percent of South Korea’s whole trade. It is too small for trades between the world’s 11th largest economy South Korea and the 12th largest Russia. Taking a look at the trend of trade between South Korea and Russia, South Korea’s exports to Russia stood at US$4.6 billion (5.03 trillion won) as of 2015, down 53.7 percent from a year earlier. Its imports from Russia also dropped 27.8 percent to US$11.3 billion (12.37 trillion won) over the same period. South Korea’s exports to Russia slightly bounced back to US$5.1 billion (5.58 trillion won) last year. However, cars and car components still accounted for 40 percent of the total exports. It is time to come up with a strategy to diversify export items. This is why the government has decided to cooperate with Russia in nine sectors including marine products, agriculture, electricity, railroad, North Pole Route, gas, shipbuilding, port and industrial complex. South Korea’s key industries, such as car, shipbuilding and textile, have reached its full growth and China’s growth has already slowed down. So, it definitely needs to create a new growth engine. Moreover, the government needs to diversity its export market, which is concentrated on China and the U.S. in order to achieve an additional expansion of trade, passing the “US$1 trillion (1,094.5 trillion won)” mark for the first time in three years. With the New Northern Policy, the government expects that the Eurasian Economic Union (EAEU), which the country is in talks for a free trade agreement (FTA), will be a new opportunity for domestic companies. The EAEU is an economic union that comprises five Commonwealth of Independent States (CIS) countries of Russia, Kazakhstan, Belarus, Kyrgyzstan and Armenia. It is rich in natural resources, like crude oil and gas, and has a huge internal market with a population of 180 million. The Presidential Committee on Northern Economic Cooperation (PCNEC), which held the first meeting on December 7, plans to operate a task force by nine sectors and come up with a road map on northern economic cooperation, including specific action plans, by April next year. In addition, it will seek for concrete cooperation projects with the Ministry for Development of Russian Far East and release an interim report at the Eastern Economic Forum in September next year. The PCNEC plays a role as a control tower that helps push organic policies between the branches of the government. Starting with the establishment of diplomatic relations with the Soviet Union in 1990 and with China in 1992, the former government had pushed ahead with the New Northern Policy in many different forms. Considering the fact that South Korea has seen its trade and investment with China surge since the two countries formed bilateral ties, the country still has a meager economic cooperation with Eurasian countries, including Russia. The move focusing on the economy not the politics is applicable to not only Russia but also China. South Korean President Moon Jae-in will visit China next week accompanied by a large-scale economic mission. In particular, President Moon will visit Chongqing, the hub of the One Belt One Road project which is a Chinese President Xi Jinping's signature policy. According to China’s conception, the countries connecting with the One Belt One Road project have a population of 4.4 billion and a gross domestic product (GDP) of US$2.1 trillion (2,298.45 trillion won), taking up 63 percent of the world’s population and 29 percent of the world’s GDP. When South Korea aggressively responds to the One Belt One Road project and seeks to improve relations, it will be able to extend and diversify its economic territory. South Korea depends on shipping and flight for distribution as it has a blocked land route due to the national division. So, it can secure a stable land route. Meanwhile, the New Northern Policy is positive in the way that it is an expansion of economic cooperation beyond politics. However, it can conflict with policies of the U.S. and Japan. The U.S. government presented its new Asian policy “Indo-Pacific strategy,” replacing the previous “Asia-Pacific strategy,” during President Donald Trump's Asia tour early last month. The Indo-Pacific strategy is to strengthen a wide security and economic cooperation between U.S. allies and friendly countries, such as Australia and India, in order to hold back China’s advance into ocean. The South Korean government is still taking a step back from it. However, there are growing concerns that South Korea can be caught in the middle between the U.S. and Russia or China when the government declares to participate in China’s One Belt One Road project in earnest or the North Korea risk mounts up. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "S. Korea Tries to Extend Economic Territory by Strengthening Cooperation with Northern Countries - Businesskorea",
    "datetime": "2017-12-07T23:30:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=20030"
}