{
    "text": " Samsung Electronics, the world’s largest TV producer, and Netflix, the world’s largest streaming service provider, have decided to carry out a joint promotional event in the near future in order to strengthen the partnership. However, there is a delicate power game behind between manufacturer and content company. According to industry sources on March 27, Netflix asked Samsung Electronics to include a Netflix button in the 2016 smart TV models and offered a huge incentive this year. The Netflix’s move is aimed at solidifying the monopoly in the streaming market by embedding its service in Samsung Electronics’ products which account for 27 percent of the global TV market. Netflix has been accelerating the global market invasion beyond the U.S. from last year. The company, which currently has over 70 million paid subscribers in 50 countries worldwide, has recently tapped into the Korean market, following Japan. It also plans to aggressively enter the markets of 200 countries by 2017. In the process, its partnership with Samsung Electronics, which leads the global TV market, will be a great help However, Samsung Electronics turned down Netflix’s offer after much consideration. This is because Samsung can have a partnership with the company but cannot change the design of TV products for Netflix. In particular, Samsung’s management thought that it is not right to design products, which are biased to a specific company, and grant the dominating leadership as the smart TV ecosystem is growing based on various content companies. An industry official said, “Netflix’s is to imprint its logo on TVs just like Intel did in the PC market in the past. But, Samsung think that it is not desirable for manufacturer to directly choose the priority list of various contents, such as cable, TV, Internet, YouTube and game, for consumers.” The reason why Samsung Electronics is reluctant to go into partnerships with a specific firm is that the company seeks to establish its own smart TV-based smart home ecosystem. Earlier this year, Samsung Electronics decided not to join the partnership in the smart home operating system, “Brillo and Weave,” led by Google, and set up its own system. The company is currently developing the smart home platform, based on its own platforms “Artik” and “Tizen.” As smart TVs, which supports online streaming services, are becoming popular, the competition in the content industry is getting intense. Following Netflix, Amazon, Hulu and HBO are getting into the paid streaming service market successively, and Hollywood studios and many cable TV service providers are releasing a streaming service. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Samsung Electronics Refuses Netflix’s Request to Include Netflix Button in Smart TVs - Businesskorea",
    "datetime": "2016-03-28T01:30:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=14222"
}