{
    "text": " Samsung Electronics is preparing to roll out its next strategic smartphone Galaxy S9 series. The Korean smartphone giant set parts for the Galaxy S9 and Galaxy S9 Plus and started to receive them from suppliers. The new smartphone will be mass-produced beginning January as a finished product. Then, the new model will be unveiled in February and launched in March. According to the smartphone industry on December 26, Samsung Electronics began ordering parts for the Galaxy S9 series. As the start of the process, the company began to roll out main boards. Samsung decided to adopt a ‘substrate-like PCB (SLP),’ a next-generation high density interconnected (HDI) board. 60% of total demand for boards will be filled with SLPs. Samsung Electro-Mechanics, Korea Circuit, Daedeok GDS, and Ibiden took charge of mass producing the first volume. Isu Exaboard was named as a supplier, but the company will be able to produce products in February as the company made slow progress in preparations. SLPs standing for 'substrate like PCBs' is a combination of the 'modified semi additive process' (MSAP) used for semiconductor substrate manufacturing and HDI technology. The gist is to make microcircuits which were difficult to make with existing methods as MSAP. The purpose is to support high performance while making substrates smaller. Samsung also began mass production of camera modules for the Galaxy S9. According to the smartphone industry, Partron and Power Logics are rolling out front camera modules used for selfies. The front camera is composed of an iris recognition camera and a general photographing camera. The Galaxy S9 model with a small display will have an integrated camera module where an iris recognition camera and a general photographing camera are integrated. The Galaxy S Plus model will have two separate cameras. Partron was chosen as the main vendor of the front camera for the Galaxy S9 while Power Logics will supply the main front camera for the Galaxy S9 Plus model. MCNEX and Cammsys will participate in supplying parts for the Galaxy S9 and S9 Plus models, respectively according to a dual-supplier system. Samsung Electronics divides suppliers into its primary and secondary suppliers based on their development and production capabilities to ensure stable supply of parts. A dual camera will be loaded into the Galaxy S9 Plus model. This is the first time Samsung loads its Galaxy S series, its flagship smartphone with a dual camera. However, the Galaxy S9 model, like the previous one, will have a single camera. This means that Samsung made the decision after taking into consideration the Galaxy S9’s differences with the Galaxy S9 Plus, unit price, and so on. Samsung Electronics will take the wrap off the Galaxy S9 series in Barcelona, Spain in late February 2018, and launch it in early March. It is expected that Samsung will produce finished products of the Galaxy S9 for about two months from January and release it worldwide at the same time. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Samsung Electronics Begins to Place Orders for Major Parts of Galaxy S9 - Businesskorea",
    "datetime": "2017-12-27T00:15:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=20167"
}