{
    "text": " Samsung SDI (CEO Park Sang-jin) was recognized in London yesterday as a leading company in Energy Storage Systems (ESSs). The local company revealed that it received a Company of the Year Award for Energy Storage in Europe 2014 at the Frost & Sullivan Awards held in London, England on May 14 (local time). Global research company Frost & Sullivan selects and awards companies with remarkable achievements, by industry, every year. Samsung was previously a recipient of the best quality and innovation award for its lithium-ion secondary cells at the Frost & Sullivan Awards ceremony in 2009. The company, having explored the ESS European market ahead of its competition, concluded several large-scale ESS provision contracts and received the first quality certification for lithium-ion ESS from the Association for Electrical, Electronic & Information Technologies (VDE). These activities ar why the company was designated as company of the year for ESS in the European region. Starting with inking the provision contract with Italy’s Enel to provide 1 MWh ESSs in April 2013, the company signed a provision deal to provide 10MWh ESSs to German electricity company WEMAG jointly with German company Younicos in the same month. The contract is the largest electricity-storing ESS provision contract in Europe. In July 2013, after grabbing UK Power Networks’ 11MWh ESS provision contract together with S&C Electric Company, the company gained initial market dominance in Europe’s big 3 ESS markets. Samsung SDI ES Managing Director Kim Woo-chan said, “Via the award this time, Samsung SDI has been recognized as the leading company in the European ESS market. We will push forward with our efforts to become the best ESS company in the world.” The company also hit a homerun by concluding a massive ESS provision contract amounting to 1 trillion won (US$974 million) on May 7 to provide some 300,000 household ESS units to Japan’s Nichicon. The company is staying far ahead of the pack with over a 60 percent market share in Japan’s household ESS market. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Samsung SDI Wins Award for Energy Storage Systems - Businesskorea",
    "datetime": "2014-05-15T06:17:30+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=4665"
}