{
    "text": "For the 10th consecutive year, Samsung has been selected as the most favored brand among Russian consumers. Samsung ranked first in the 2020 Top 20 Brands list recently announced by Russian brand market research firm Online Market Intelligence (OMI). Samsung came in with 17.9 percent of the votes. However, the percentage of votes it earned dropped 0.6 percentage points from 18.5 percent in 2019. It was followed by Adidas with 12.2 percent, Nike with 11.7 percent, and Apple with 9.7 percent. The rankings of the top four companies remained unchanged compared to 2019. Bosh (5.8 percent), Sony (4.8 percent), Xiaomi (4.6 percent) and Coca Cola (4.6 percent), LG (4.1 percent) and Jara (3.1 percent) were included in the top 10 list. LG remained at 9th place as it did in 2019, but it gained 4.1 percent this year, up 0.6 percentage point from the previous year. The three new companies among the top 20 brands are Huawei (13th), Pepsi (17th), and Levi’s (20th). Until 2017, none of the Chinese companies were listed on OMI's annual list of the top 20 brands. Then, in 2018, Xiaomi ranked 11th for the first time as a Chinese company. In 2020, Huawei newly joined the club. Samsung was first placed on the list in 2008 when OMI began its announcement and then came in first in 2009. Then, the Korean tech giant gave up its lead to Nokia in 2010, but retook the top spot in 2011. Since then, Samsung has not missed the No. 1 spot among Russia's most beloved brands for 10 years running from 2011 to 2020. By product category, Samsung has topped the \"Household Appliances\" category for 12 consecutive years and the cell phones and electronics categories for 8 and 10 consecutive years, respectively since 2009. Meanwhile, the OMI's rankings was based on a survey of 1,500 people living in 13 cities including Moscow and St. Petersburg where more than 1 million people live. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Samsung Named Most Beloved Brand in Russia for 10 Years in Row - Businesskorea",
    "datetime": "2020-11-02T14:16:01+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=54272"
}