{
    "text": " Samsung Biologics has entered into a strategic partnership with Kanaph Therapeutics, a Korean biotech startup, to develop KNP-301, a bi-specific Fc fusion protein intended to treat retinal diseases, the company announced on Sept. 24. According to Kanaph Therapeutics, KNP-301 is designed to target autoimmune diseases by inhibiting the alternative pathway of the complement system. With the benefits of its bi-specific approach, it aims to successfully treat complement-mediated and angiogenesis driven retinal diseases by suppressing both C3b and VEGF simultaneously. Under the agreement, Samsung Biologics will provide a full scope of its CDO services from cell line development, process development, non-clinical and clinical material manufacturing to IND submission. \"We are proud to announce our partnership with Kanaph Therapeutics for the development of their first biologics program,\" said Kim Tae-han, CEO of Samsung Biologics. “This partnership marks our standing as the most reliable CDMO partner with leading capabilities of providing high-quality development services. We will leverage our extensive expertise to expedite Kanaph Therapeutics’ success in bringing advanced treatments for retinal disease to address the unmet medical needs of patients.” “We have decided to work with Samsung Biologics for the development of our first biologic program, in preparation for our global clinical trials,” said Lee Byoung-chul, CEO of Kanaph Therapeutics. “This will mark the beginning of many biologic molecules in our pipeline to be developed for the clinic. In addition to partnering with a global CDMO such as Samsung Biologics, we will drive for the successful outcome of our regulatory and clinical strategies in partnership with our specialized KOLs and experienced CROs.” Kanaph Therapeutics raised US$6 million from Timefolio Asset Management and Meritz Securities for its Series A financing in 2019. It also secured a seed investment of approximately US$2 million for its drug discovery and development activities.  Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Samsung Biologics Forges Strategic Partnership with Kanaph Therapeutics - Businesskorea",
    "datetime": "2020-09-24T11:07:42+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=52334"
}