{
    "text": " Jun Dong-soo, president of Samsung Electronics CE Division’s health and medical equipment business and CEO of Samsung Medison, stressed that he will achieve a rebound in the medical device business this year, wiping out the recent Samsung Medison sell-off rumors. During the Korea International Medical & Hospital Equipment Show (KIMES) opened at COEX in Samsung-dong, Seoul, on March 17, he said, “The animal medical device market is small but we see a new possibility. The market will grow as long as the quality of human life is improved.” Samsung Electronics introduced “PT10V,” an in vitro diagnostics (IVD) device for animals, at the expo, tapping into the market. The PT10V can take up to 13 tests for animals, including dog, cat and horse, at the same time, and check test results in only 10 minutes. The product was released in August last year, and a total of 270 units was already sold in the domestic market. In addition, Samsung Electronics and Samsung Medison unveiled medical devices in diverse areas, such as radiology, obstetrics and gynecology (OB/GYN), internal medicine and neurosurgery. At the radiology exhibit zone, the companies displayed “GC85A,” a mounted premium digital X-ray system that boasts of its high-quality imaging engine and convenience, and “GM60A,” a movable X-ray system that can be free to move and be used at the hospital. At the OB/GYN zone, they presented “WS80A,” a premium ultrasound system that can realistically show and diagnose the fetus through the volume rendering technology. Moreover, the two introduced a new ultrasound system “HS60,” which will be launched at the market at home and abroad this year, in advance.  Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Samsung Medison to Make Breakthrough in Animal Medical Device Market - Businesskorea",
    "datetime": "2016-03-18T01:45:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=14134"
}