{
    "text": " Global IT companies are scrambling to secure 3D hologram tech, which is considered the representative future market, along with virtual reality (VR). Large and small technology companies, including Samsung Electronics, Apple and Microsoft, and research institutions in many countries are currently developing 3D hologram tech. Experts expect that the technology will expand from the existing entertainment sector to the healthcare, industry and art areas in the next five years. According to the United States Patent and Trademark Office (USPTO) on Dec. 27, Samsung Electronics has recently been awarded a key patent regarding holographic 3D printing technology. With more than three years of development by Samsung Electronics, it is an innovative technology that creates 3D holographic images using specific wavelengths of light. The detailed driving system is still undisclosed. A hologram is a display of three-dimensional information using the interference of light caused by two laser beams. In addition to Samsung, Apple has been accelerating the investment in technology related to holography from last year. Apple secured a patent for the display technology, which can create 3D holographic images using lasers, micro lenses and censors. The technology, named “interactive holographic display,” is designed to eventually make use of holograms in mobile devices, such as smartphones and tablet PCs. Also, Microsoft has recently introduced its hologram computing device, called a “HoloLens,” attracting attention. Microsoft HoloLens is a sort of helmet computer featuring various censors, high performance chips and Windows 10, which projects virtual images on top of actual images. It independently operates without phones or additional power required. Experts forecast that the hologram market will expand into diverse areas, including the medical care, architecture, car, and art sectors in the future. In the medical sector, particularly, research is already being carried out to create 3D images of tomograms taken with X-rays and ultrasonic waves. The National Museum of Poland displays ancient relics in which major cultural assets are reproduced in similar holographic images. According to the Electronics and Telecommunications Research Institute of Korea, the global hologram market is showing an average annual growth rate of 13 percent, and is predicted to create a 35 trillion won (US$30.02 billion) market in 2020. In 2025, the market is expected be almost double to 75 trillion won (US$64.32 billion), becoming one of the largest markets in the imaging media and display industries. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Samsung Acquires US Patent for 3D Holographic Smartphones - Businesskorea",
    "datetime": "2015-12-29T02:15:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=13424"
}