{
    "text": "The Financial Express By Reya Mehrotra In June, British influencer Oli London (who identifies as non-binary and uses the pronouns they/them) underwent 18 surgeries to look like Jimin, a member of the popular South Korean boy band BTS. In a video shared post the surgery, London said they identify as Korean. “I identify as Korean… that’s just my culture, that’s my home country, that’s exactly how I look now.” London’s case might be one of a kind, but no one can dispute the raging popularity of South Korean pop culture today. The K-wave, which started some years back, has now spread around the world, captivating people across cultures. One of the earliest examples of the world being swept up by Korean culture was the 2012 song Gangnam Style by South Korean singer Park Jae-Sang, popularly known as Psy. As he hopped to the peppy beats with his wrists locked in front, the singer made the world groove with him. The song went on to become the first music video ever on YouTube to reach a billion views. Gangnam Style became immensely popular in India, too, with cricketer Virat Kohli doing the dance after India won the 2013 ICC Champions Trophy tournament. Almost a decade later, India and the world are head over heels in love with not just Korea’s music, but also its films, TV shows, beauty, skincare, food and much more. The latest Korean import to have charmed Indians are webtoons. A type of digital comic, webtoons have seen a huge surge in popularity with the launch of Korean digital comics platform Kross Komics in December 2019. An animated life The story of the origin of South Korean webtoons is an interesting one. It all started between 1910 and 1945 when Japanese culture infiltrated Korea as the latter occupied the former. With it, came the influence of manga (Japanese comics)—interestingly, manhwa, the general Korean term for comics and print cartoons, comes from the Chinese word manhua meaning impromptu drawings. When Korea was under Japanese occupation, political cartoons became popular in newspapers. Decades later, in the 2000s, manhwa got a digital makeover and came to be called ‘webtoon’. The main difference between Japanese manga and Korean manhwa lies in how they are made, says Hyunwoo Thomas Kim, co-founder, president and CEO, Kross Komics, which caters to all age groups and offers webtoons across genres. “Japanese manga, originally made for paper-based reading, is usually black/white and reads horizontally, while Korean webtoons, made specifically for smartphones, read vertically and are full of colour… the main difference lies in the culture from where they originate. Also, Korean webtoons lean slightly more towards romance, fantasy stories, and cater to young females, while Japanese manga is wider in terms of genres and might lean slightly more towards the young male population,” Kim explains. Indians, new to the concept of webtoon, are lapping it up. In its first year, Kross Komics witnessed a million downloads, tripling that number in the second year. What has also helped perhaps is the desi makeover (changing character names to local ones) that Kross Komics gave some of its webtoons to make them more relatable before entering the Indian market. “The culture and digital consumption preferences between the two countries are very similar. We do have a couple of webtoons that have Indianised graphics and characters,” shares Kim, adding that they plan to open their platform to Indian artists to contribute in the future, and will also update their app for better features later this month. There are other South Korean webtoon platforms too—like Daum Webtoon, Naver Webtoon and Kakao Webtoon—that are competing in the global webtoon market. Launched in 2014, Naver Webtoon remains the biggest such Korean platform, reaching millions of users daily. As per reports, in February, it invested 33.4 billion won in Content First, which operates Tappytoon, the second-largest digital comics platform in the US, to acquire 25% of its shares. Its rival Kakao Webtoon is not far behind either. In May, it purchased US-based digital reading app Tapas and inked a $440-million deal with fiction app Radish. That’s not all. In May, it also launched in Thailand and Taiwan. Naver, however, claimed it was ahead of Kakao in both the countries. There are Korean web portals as well like Spottoon, Lezhin Comics and Toomics, which are translating webtoons for a larger audience base. Language no barrier For Delhi-based research consultant Smritima D Lama, the love for Korean culture started more than a decade ago in 2007-08 when her sister was studying in Darjeeling and would buy and watch CDs of Korean dramas. Soon, she got her mother and sister hooked as well. While her sister has taken training to learn the language because she loves the culture so much, the rest of them can understand the basics. The brevity of their shows (spanning around 12-16 episodes each) and easy availability today thanks to OTT platforms keep fans engaged, she says. Watching the shows, Lama also found herself getting fascinated with Korean food, and today, they make popular Korean dishes like tteok-bokki (stir-fried rice cakes), sundubu-jjigae (soft tofu stew), kimchi (salted and fermented vegetables) and cold noodles in soy milk regularly at home. According to Hwang Il-Yong, director, Korean Cultural Centre India (KCCI), the Press and Culture Department of the Embassy of the Republic of Korea in India, the Korean food craze in the country, inspired by K-dramas, started with kimchi. “We have noticed that Korean food has been localised and customised by Indians, so we can now find kimchi curry, kimchi pakora and chana dal tikki (inspired from gamja-jeon, or potato pancake),” shares Delhi-based Il-Yong. This has led to Korean restaurants popping up in metro cities and online delivery portals Zomato and Swiggy enhancing their reach to consumers. South Korean noodles, in particular, are doing good business on portals like BigBasket, Flipkart and Amazon—according to the ministry of commerce and industry, the import statistics of Korean noodles in India witnessed a growth of 162% in volume in 2020 and this is expected to grow by 178% in 2021. Korean food was one reason Lama jumped at the chance of visiting Korea in February 2020. Lama says she wanted to try out authentic Korean dishes to ensure what they were making at home was right. “My father had to attend a seminar in Korea for about 10 days, so I travelled with him a few days before and took time out to explore Korea,” she says. Post her visit, Lama also picked up bits of the Korean skincare regime. So crazy she is about everything Korean, in fact, that when her parents once asked her to get married, she laughingly replied, “If I get someone from Korea, why not!” Like Lama, many in the country became fans of K-culture through their films and dramas, which came to India in the early 2000s, starting from the north-east, says KCCI’s Hwang Il-Yong. Since then, there has been no looking back. Heo Jun TV series aired on Doordarshan in 2014 and received 34 million views, while Descendants of The Sun received 56 million views on ZEE5 in 2017. Then, of course, there is the Oscar-winning movie Parasite and Minari on Amazon Prime. MX Player and Zing, too, boast of successful K-dramas on their respective platforms. In a way, Korean films and dramas have broken the monopoly of American films and shows in the country. When it comes to K-drama, language is no barrier, especially with subtitles, says a Netflix spokesperson. “Stories made in Korea are watched by the world and it is exciting to see the growing love and fandom for Korean stories in India. With subtitles and dubs, the language barrier has lowered, and our members have discovered and enjoyed authentic K-content.” Compared to 2019, in fact, the viewing of K-content across Asia went up four times in 2020. Some of the most popular titles were Kingdom S2, The King: Eternal Monarch, Start-Up, It’s Okay to Not Be Okay and What’s Wrong with Secretary Kim. Sweet Home, a horror series, was watched by 22 million member households in its first four weeks on Netflix. With the viewing of K-dramas on Netflix in India increasing more than 370% in 2020 over 2019, the platform this year has announced Korean stories across genres and formats. Apart from its partnerships with Korean producers, including CJ ENM/Studio Dragon and JTBC, Netflix plans to invest nearly $500 million to churn out more content from this part of Asia. Gangnam Style’s global success was just a hint of the massive K-wave that would take over the world a few years later, believes Kross Komics’ Kim. Today, BTS, Girls’ Generation, EXO, Blackpink, Super Junior are some of the popular music bands riding the K-pop curve. Audio streaming and media services platform Spotify shares that the streaming of K-pop on Spotify in India has been phenomenal ever since they launched in the country and is predominantly led by BTS—when the band dropped its song Butter this year, there was a huge uptick in engagement. Led by 15- to 24-year-olds, the streams are led by female listeners. The horizon for Korean content widened exponentially after Parasite (2019) won the Oscar, says Il-Yong. In India, especially, demand for Korean language courses has been increasing steeply, following the government’s announcement of the National Education Policy in July 2020—Korean is now one of the Indian government’s recommended foreign languages. Jawahalal Nehru University, Delhi University and Jamia Milia Islamia have started Korean language courses and programmes. On Spotify, too, listeners are actively streaming podcasts like Learn Korean with David and Talk To Me In Korean: Core Korean Grammar. KCCI, too, has also signed MoUs with several schools to provide Korean language training to students. Additionally, it is hosting an online photo exhibition to mark the 71st anniversary of the 1950 Korean War. Titled Korean War Special Exhibition—60 Para Field Ambulance, the exhibition, which runs till August 25, pays homage to the 60 Para Field Ambulance (which provided medical support to the injured) and the joint efforts of Indian and Korean troops in the war. Another recent online event, ‘K-Insider Challenge, K Cinema & Drama’, organised by the KCCI for fans of Korean culture in India, had over one million views on KCCI’s social networking channels. The centre shares that other events like ‘Kimchi Introduction’ had over one million cumulative views of all posts by 132 participants, followed by the ‘K Beauty’ event that exceeded two million views with 419 participants—it talked about Korean beauty products, Korean-style makeup and skincare tips during the 12-day participation period. The ‘K Cinema & Drama’ event had 172 participants. The events were held this year at different intervals starting from January and ending on July 4. Krossing borders Hyundai, Samsung, LG Electronics, Kia Motors all have one thing in common—they are all South Korean in origin. Years ago, these brands established their place in the global market. Today, with the K-wave creating a stir among a larger customer pool, people are willing to purchase competitively-priced and fancy Korean products, be it K-beauty or K-health. Delhi-based South Korean e-commerce portal Korikart has seen phenomenal response from across India since its launch in 2018. The pandemic, especially inflated their numbers as they witnessed 300% growth in sales since March 2020 and are currently reporting over 40-50% month-on-month growth, says Seo Youngdoo, CEO and founder, Korikart. The reason behind the boom was work from home, which allowed more people to consume Korean content. K-food, K-beauty and healthy and immunity-boosting products like Korean ginseng tea, sweet ginger tea powder, kimchi seaweed, etc, have been selling like hotcakes, says Youngdoo. Popular lifestyle retailer Nykaa, too, has added scores of Korean skincare brands on its site, owing to huge demand. Nykaa, in fact, was the first to introduce globally popular South Korean brands like The Face Shop, Tony Moly, Innisfree, Laneige, Klairs, Etude House, Belief, etc, to India. This, in turn, encouraged Korean skincare luxury brands like Sulwhasoo to retail exclusively on Nykaa. Consumers are intrigued by things like the glass skin concept and the ‘no-makeup’ makeup look, the origins of which can be traced to South Korea, says a spokesperson from Nykaa. The growing popularity of South Korean pop music and drama has also acted as a catalyst and led to increased demand in the country, the spokesperson adds. As per Bengaluru-based Chytra Anand, founder of skin and hair clinic Kosmoderma, Indians’ preferences for natural ways to enhance skin health, their liking for pale skin tones and natural skin-whitening therapies have led to the love for K-beauty. The popularity is also peaking with Korean brands launching ‘unique’ products made with mushroom, snail mucin, bee venom, carrot seed oil, etc, she says. QUOTE 1: Korean food has been localised and customised by Indians… we can now find kimchi curry, kimchi pakora, etc — Hwang Il-Yong, director, Korean Cultural Centre India, the Press and Culture Department of the Embassy of the Republic of Korea in India QUOTE 2: Indians’ preferences for natural ways to enhance skin health, their liking for pale skin tones and natural skin-whitening therapies have led to the love for K-beauty — Chytra Anand, founder, Kosmoderma, a skin & hair clinic QUOTE 3: We witnessed 300% growth in sales since March 2020 and are currently reporting over 40-50% month-on-month growth — Seo Youngdoo, CEO & founder, Korikart, a Delhi-based South Korean e-commerce portal Get live Share Market updates, Stock Market Quotes, and the latest India News and business news on Financial Express. Download the Financial Express App for the latest finance news.   ",
    "title": "Say K for Kulture: From K-beauty, K-pop, K-dramas, K-food to K-toons, South Korean pop culture has become a rage - Lifestyle News | The Financial Express",
    "url": "https://www.financialexpress.com/lifestyle/say-k-for-kulture-from-k-beauty-k-pop-k-dramas-k-food-to-k-toons-south-korean-pop-culture-has-become-a-rage/2292396/"
}