{
    "text": "Diperbarui: \nJum'at, 13 September 2019 17:37 WIB\n\n\nDiterbitkan: \nJum'at, 13 September 2019 17:25 WIB Kapanlagi.com - Jakarta kembali akan dihebohkan oleh festival musik yang akan dimeriahkan sederet artis K-Pop. Acara itu bertajuk Follow Gyeonggi K-Culture FESTA 2019 yang akan digelar pada 19-20 Oktober 2019 di Istora Senayan, Jakarta. Acara ini adalah dalam rangka merayakan kerjasama ASEAN dan Korea yang telah terjalin selama 30 tahun. Indonesia salah satu negara yang memiliki ketertarikan terhadap industri musik, budaya dan pariwisata Korea membuat pemerintah Provinsi Gyeonggi-do, Korea memilih Indonesia sebagai Negara pertama diselenggarakannya Follow Gyeonggi K-Culture FESTA 2019. Nantinya acara ini juga akan dihadiri oleh banyak perusahaan Korea yang bergerak di bidang tour dan travel yang akan memberikan tips berwisata dari 31 kota di Gyeonggi-do dan ada beragam program lainnya untuk memeriahkan festival ini.    Follow Gyeonggi K-­Culture FESTA 2019 Acara yang melibatkan kerjasama antara Gyeonggi-Do, Gyeonggi Tourism dan JoongAngIlBo ini pun akan menghadirkan sederet artis top Korea.\"Kami ingin menghadirkan beragam kebudayaan Korea sekaligus menunjukkan kepada warga Indonesia bahwa Gyeonggi-do merupakan pusat dari kebudayaan Korea. Untuk menarik pengunjung pada event ini kami hadirkan artis-artis top Korea,\" ujar Lee Dong Ryoul dari Gyeonggi Tourism Organization dalam siaran pers yang diterima Kapanlagi.com, Jum'at (13/9).Pada 19 Oktober akan menghadirkan JBJ95, Kim Jong Kook, Epik High, DIA, VAV, Baek A Yeon, GWSN, 1Million. Sementara pada 20 Oktober akan dimeriahkan oleh Taemin SHINee, RGP (HaHa & Skull), Hwang Chi Yeul, Lovelyz, The Rose, Yellow Bee, 1Million. Tak hanya mereka karena masih ada dua line up yang dirahasiakan. \"Kami ingin menghadirkan beragam kebudayaan Korea sekaligus menunjukkan kepada warga Indonesia bahwa Gyeonggi-do merupakan pusat dari kebudayaan Korea. Untuk menarik pengunjung pada event ini kami hadirkan artis-artis top Korea,\" ujar Lee Dong Ryoul dari Gyeonggi Tourism Organization dalam siaran pers yang diterima Kapanlagi.com, Jum'at (13/9).Pada 19 Oktober akan menghadirkan JBJ95, Kim Jong Kook, Epik High, DIA, VAV, Baek A Yeon, GWSN, 1Million. Sementara pada 20 Oktober akan dimeriahkan oleh Taemin SHINee, RGP (HaHa & Skull), Hwang Chi Yeul, Lovelyz, The Rose, Yellow Bee, 1Million. Tak hanya mereka karena masih ada dua line up yang dirahasiakan. \"Kami ingin menghadirkan beragam kebudayaan Korea sekaligus menunjukkan kepada warga Indonesia bahwa Gyeonggi-do merupakan pusat dari kebudayaan Korea. Untuk menarik pengunjung pada event ini kami hadirkan artis-artis top Korea,\" ujar Lee Dong Ryoul dari Gyeonggi Tourism Organization dalam siaran pers yang diterima Kapanlagi.com, Jum'at (13/9).Pada 19 Oktober akan menghadirkan JBJ95, Kim Jong Kook, Epik High, DIA, VAV, Baek A Yeon, GWSN, 1Million. Sementara pada 20 Oktober akan dimeriahkan oleh Taemin SHINee, RGP (HaHa & Skull), Hwang Chi Yeul, Lovelyz, The Rose, Yellow Bee, 1Million. Tak hanya mereka karena masih ada dua line up yang dirahasiakan. Pada 19 Oktober akan menghadirkan JBJ95, Kim Jong Kook, Epik High, DIA, VAV, Baek A Yeon, GWSN, 1Million. Sementara pada 20 Oktober akan dimeriahkan oleh Taemin SHINee, RGP (HaHa & Skull), Hwang Chi Yeul, Lovelyz, The Rose, Yellow Bee, 1Million. Tak hanya mereka karena masih ada dua line up yang dirahasiakan. Pada 19 Oktober akan menghadirkan JBJ95, Kim Jong Kook, Epik High, DIA, VAV, Baek A Yeon, GWSN, 1Million. Sementara pada 20 Oktober akan dimeriahkan oleh Taemin SHINee, RGP (HaHa & Skull), Hwang Chi Yeul, Lovelyz, The Rose, Yellow Bee, 1Million. Tak hanya mereka karena masih ada dua line up yang dirahasiakan. Tidak gratis, pihak penyelenggara pun akan menjual tiket yang akan dimulai pada 20 September 2019. Untuk informasi lebih lanjut bisa follow instagram @follow.gyeonggi.#Jangan LewatkanAcara Super Junior dan TVXQ 'Analog Trip in Indonesia' Tayang Oktober MendatangBak Dilan, Gombalan Jaemin NCT Dream Sukses Bikin Fans BaperCurhat Bahagia Zara JKT48 Ketemu NCT Dream, Akui Sudah Lama Suka HaechanGara-Gara Ini, Haechan NCT dan Zara JKT48 Dijodohkan FansNCT Dream Buka Penampilan Bawakan 'My First and Last' di Konser Korean Wave\n\n\nAdvertisement #Jangan LewatkanAcara Super Junior dan TVXQ 'Analog Trip in Indonesia' Tayang Oktober MendatangBak Dilan, Gombalan Jaemin NCT Dream Sukses Bikin Fans BaperCurhat Bahagia Zara JKT48 Ketemu NCT Dream, Akui Sudah Lama Suka HaechanGara-Gara Ini, Haechan NCT dan Zara JKT48 Dijodohkan FansNCT Dream Buka Penampilan Bawakan 'My First and Last' di Konser Korean Wave\n\n\nAdvertisement #Jangan LewatkanAcara Super Junior dan TVXQ 'Analog Trip in Indonesia' Tayang Oktober MendatangBak Dilan, Gombalan Jaemin NCT Dream Sukses Bikin Fans BaperCurhat Bahagia Zara JKT48 Ketemu NCT Dream, Akui Sudah Lama Suka HaechanGara-Gara Ini, Haechan NCT dan Zara JKT48 Dijodohkan FansNCT Dream Buka Penampilan Bawakan 'My First and Last' di Konser Korean Wave Advertisement (kpl/rhm/jje) ",
    "title": "Sederet Artis K-Pop Akan Ramaikan Follow Gyeonggi K-Culture FESTA 2019 di Jakarta - KapanLagi.com",
    "url": "https://www.kapanlagi.com/korea/sederet-artis-k-pop-akan-ramaikan-follow-gyeonggi-k-194173culture-festa-2019-di-jakarta-999bbd.html"
}