{
    "text": "Students Noela Park, Ginny Lee, Jorge Kcomt and Amy Choi (clockwise from top) perform K-pop choreographies and original dances as members of SEOULA, a UCLA-based dance group. (Quanzhao “Ari” He/Daily Bruin) Members from SEOULA performed and filmed a K-pop dance in tunnels underneath Downtown LA. SEOULA, a UCLA-based dance club open to both UCLA and non-UCLA students, performs K-pop dances and song covers as well as original choreography for its YouTube channel. As the club’s name suggests, SEOULA blends elements of Korean culture, particularly K-pop from Seoul, with elements of American culture, such as the large K-pop fan base in LA, said Ginny Lee, a third-year psychology student and a co-founder and dance coordinator for SEOULA. “We’re Korean (and) we all have lived in Seoul at least once in our lifetime,” Lee said. “We decided to combine Seoul and LA because that’s one of our other identities. We’re just combining two identities together.” The club was originally created for the Korean American Student Association at UCLA but branched off in January 2017, Lee said. Because KASA lacked a dance team, the only exposure she had to dancing was performing alone in her room or KASA’s annual dance-off for freshmen, so she decided to start a new organization that would focus on choreography in a group setting, she said. “It’s just really hard to gather a group of people to do covers with,” Lee said. “The fact that we accomplished that goal … of getting people who have the same interests as us, same interest in dancing, just making a team for that, I feel very accomplished.” SEOULA stands out from other dance groups on campus because they focus on videography and dance workshops instead of competitions, said co-founder and dance coordinator Amy Choi, a third-year political science student. She said SEOULA’s main way to increase publicity is through YouTube videos, so members invest as much effort in creating their videos as they do in creating the dances themselves. The group tries out different backgrounds, locations and camera angles, constantly refilming to adjust for poor lighting or camera shots, she said. “If we’re going to put something out there, we might as well entertain the viewers, might as well put in all we can do to make it creative, make it different,” Choi said. “Every time we just experiment to see what works and what doesn’t.” Jorge Kcomt, a first-year bioengineering student and SEOULA member, said when the team filmed a dance for the song “BOSS” by NCT U, they performed in tunnels underneath City Hall to match the dark, edgy tones of the song. For more uplifting songs, they performed at locations like Santa Monica or Venice Beach. Although members choose locations based on the songs’ themes or vibes, some of the locations inherently lend an American aspect to the videos, Kcomt said. Other places they have danced at include LACMA and the UCLA campus. “It wouldn’t be the same if we rented out a studio and just filmed our dances there. When given the opportunity we definitely like to showcase and utilize all the amazing scenery LA has to offer,” Kcomt said. Besides practices that lead up to a video, Kcomt said SEOULA hosts dance workshops for members, teaching American hip-hop dances and uploading the workshop videos for later viewing. Choi said SEOULA’s workshops are open to other students as well, and sometimes the club invites other dancers to teach the workshops. “(Workshops exist) so that SEOULA members can get dance training because we believe being a versatile dancer is important, not just limited to K-pop,” Choi said. Although the channel only started last year, it has amassed over 22,000 subscribers and 1.9 million total views, with viewership spanning countries like the United States, Brazil and South Korea. Choi said the channel will only grow exponentially from here on out and hopes SEOULA members do not get caught up with the numbers, but instead remember why they joined in the first place.  “We originally started this for fun, and in the end, we want people to enjoy it,” Choi said. “(Our members) essentially love to dance, they want to improve, they’re here to improve.” A family is Brentwood is looking for a babysitter/nanny. The job includes after school pickups a few times a week, Saturday night and Thursday nights would be on an alternating schedule and Sundays on occasion. This is a long term and stable job you can count on with guaranteed minimum hours agreed upon. Contact 310-487-9518 ",
    "title": "SEOULA dance club combines Korean and American culture, showcases LA scenery - Daily Bruin",
    "url": "https://new.dailybruin.com/post/seoula-dance-club-combines-korean-and-american-culture-showcases-la-scenery"
}