{
    "text": "By Genevieve Valentine Your purchase helps support NPR programming. How? \"Well, irony really does better unelaborated, but if you insist.\" Ah, grimdark. It's become shorthand for a subgenre of fantasy fiction that claims to trade on the psychology of those sword-toting heroes, and the dark realism behind all those kingdom politics. But there are arguments over who fits the definition — George R.R. Martin? Kameron Hurley? Shakespeare? — and whether the nickname is a useful genre marker or just a needle. Some, like Joe Abercrombie, have embraced the term (his Twitter handle is @lordgrimdark). Others see it as a dismissive term for fantasy that's dismantling tropes, a stamp unfairly applied. In the latter camp is Richard K. Morgan. He's the author of the Land Fit for Heroes series (2008's The Steel Remains, 2011's The Cold Commands, and last year's The Dark Defiles), which casually straddles the lines between quest fantasy, political thriller and science fiction. However, it straddles no lines about some of its tropes: the Land Fit for Heroes is as grim and as dark as it gets. In some ways, the structure of the books allows for nothing else. Faded military hero and current outcast Ringil is on a slow slide to the bottom from the very beginning, where a hardboiled missing-persons case leads him to the dwenda, a race of half-unreal magicians determined to remake the world in their image. Archeth is an adviser to the sadistic Emperor, and an alien — abandoned by the rest of her race when they traveled to some other star — who walks a knife's edge to avoid being killed for either reason. Steppe clanmaster Egar struggles to keep his cultural traditions in the face of colonization that, in some ways, is better than what it replaced. And despite the time Morgan dedicates to his protagonists, they're so knee-deep in plot that they occasionally take on a badass-soldier sameness — though he makes clear that those are the only types who live for very long; somebody draws serious blood every few chapters. There are signs everywhere that Morgan is trying to move beyond traditional epic fantasy. There's no such thing as a kingdom united: Every place holds potential for civil war, veterans from the last war still wander the streets, forgotten, and language barriers crop up regularly. Ringil is a character of color in a world urbane enough that it rarely matters. (Archeth is also of color, but her alien-species origins are unmistakable, with all the slurs that entails.) Both characters are also queer, though Archeth's desires often slip under the radar, and Ringil is the one dodging challenges from those who find his sexuality an offense. The undertow of the realm's politics proves solid ground for Morgan; power corrupts absolutely, and even omnipotence can't stop the unexpected. In particular, the dwenda are only as lovely as they are sadistic (they mount the heads of their condemned alive on tree trunks, the series' most unsettling image). By The Dark Defiles, their quest to raise a fallen savior via magic sword sounds a bit overdone, but the larger world — in which Ringil appeals for help to something older, or even just something else — suggests an open game board and builds tension across the alternating narratives. And some of the thematic grit feels like a refreshing sidestep: Wars declared a thousand miles away suddenly darken our heroes' doors; gods appear mostly to unbelievers because they take more secular initiative. (The deliberately contemporary dialogue will either work for you or it won't. A good litmus test is the petulant god from the epigraph, who later laments: \"F******* mortals. You know, it's — I'm so sick of this s***. Where's the respect?\") But in this intriguing grimdark world, Morgan seems to want to prove just how bad things really are. It's here the series suffers from an excess of excess. For him, the way to dismantle heroic battles is not to make fighting futile (fighting is, it seems, the most effective way to manage anything), but to make it hyper-bloody, with blow-by-blow battles aplenty; the way to handle sexuality is to deliver sex scenes that are, well, blow-by-blow. The Steel Remains is perhaps the worst offender, with a sex-slave MacGuffin and a veritable parade of throwaway rapes that function more as signposts for degenerate behavior than as anything the narrative addresses with particular care. Morgan's prose becomes more polished with every book (any series is a time capsule of style), but his sexual politics are a streak of continued carelessness. That rescued MacGuffin vanishes without a word once her use as a plot point is served, and even with major characters, sexual violence lacks much weight beyond shock value: At one point, Ringil orders a gang rape, framed as just another downward step for him. The cycles-of-violence concept — Ringil is a rape victim who uses it to terrorize others in turn — is present, but Ringil's unaware of it, and the book quickly dismisses it, undercutting any of its thematic power. Mixing issues of representation with grimdark is also delicate work, and Morgan often stumbles. Ringil lusts after most men who cross his path (at one point, he's lost in thoughts of a colleague bathing — a homophobic standard brought to life without interrogation). And amid Ringil's attempts to reclaim \"faggot,\" Morgan keeps the word a punchline, aimed for the reader to share. Archeth's sexuality reads benignly but recognizably masculine, the Swimsuit Edition of lust. The rest is just so much carnal wallpaper through slavery or in brothels; the only profession available to women seems to be the oldest one. It's an interesting lack of imagination for a series otherwise so wholehearted in its scope. Most notably, Morgan interweaves distinctly science-fictional elements into the more standard fantasy tropes with casual confidence: Archeth argues matters of state with the mechanical Helmsman of her ancestors' spaceships. In The Dark Defiles, Morgan goes even further, playing gleefully fast and loose with Clarke's Third Law — that science-fiction axiom that any sufficiently advanced technology is indistinguishable from magic. As Ringil sinks into the otherworldly Gray Places, he meets ghosts of alternate realities, trading stories that might have been and occasionally glimpsing the future. (Next to the bootstraps realism of Egar and the SF mystique of Archeth, Ringil's adventures are so complex, conditional and deus ex machina that you have to assume that's the point.) Even astronomy gets some tweaks: Everyone's adventures play out under the Saturn-esque band that arcs dim light across the sky. Ringil alone, on his visits to the Gray Places where time is flexible, occasionally spies a pockmarked moon. At heart, this series — and The Dark Defiles in particular — is about how far you're willing to go: the reader through every last rape, sword blow and eyeball-poaching; Ringil's willingness to sacrifice humanity to be the most insouciant black mage in town; and Morgan, in carrying through the promises he long ago set up without lionizing the darkness he's commenting on. He doesn't always succeed; with so much to balance, The Dark Defiles can feel like a spell with one or two key words missing. But if you're curious, that grim, dark story is whole and waiting. Genevieve Valentine's latest book is The Girls at the Kingfisher Club. Sponsor Message Become an NPR sponsor ",
    "title": "Series Review: 'A Land Fit For Heroes' By Richard K. Morgan : NPR",
    "url": "https://www.npr.org/2015/01/25/378611261/for-a-taste-of-grimdark-visit-the-land-fit-for-heroes"
}