{
    "text": "Global K-pop sensation SEVENTEEN delivered a show-stopping performance at the LA3C festival that took place at the Los Angeles State Historic Park on December 10. During their hour-long set, the thirteen members brought the audience in the park to their feet by performing some of their biggest hits, including HOT, Rock With You, and Left & Right. The vocal performance and rap team also delivered individual sets with Second Life, Highlight, and Game Boy. The _World singers amazed CARATS (the band's official fandom) with the holiday version of their first-ever English-language single Darl+ing. However, the highlight of their entire set was a six-time repeat performance of Very Nice, which they sang due to the audience's high demand before they closed out the evening. The multicultural thirteen-member boy group received the Building K-Culture Bridges: Culture Ambassador Award along with HYBE's chairman Bang Si-hyuk at a ceremony held by LA3C in Los Angeles' Hammer Museum on December 9. The award recognized the idol group, which has Korean, American, and Chinese members, for their contribution in bridging the gap between Asian and American cultures through their music. Accepting the award, SEVENTEEN said: They further continued: Meanwhile, Bang Si-hyuk, aka Bang PD, said: The K-pop superstars created history in Los Angeles by headlining the first-ever LA3C festival alongside some of the biggest names in the music industry, including Snoop Dogg and Megan Thee Stallion, and CARATS could not be more proud. While many of them showed their support by attending the show in large numbers, other international fans took to Twitter to show their love for the artists. They congratulated the members for the cultural ambassador award and on their very successful debut US festival performance. SEVENTEEN, comprising of S. Coups, Jeonghan, Joshua, Hoshi, Wonwoo, Woozi, DK, Mingyu, Seungkwan, Vernon, and Dino, will next be seen attending the 2022 Asian Artist Awards in Japan. The event is scheduled to take place at Nippon Gaishi Hall in Nagoya, Japan, on December 13. Quick Links   ",
    "title": "SEVENTEEN performs at LA3C; Receives Building K-ulture Bridges: Culture Ambassador Award",
    "datetime": "2022-12-11T11:45:44+00:00",
    "url": "https://www.sportskeeda.com/pop-culture/news-seventeen-performs-la3c-receives-building-k-ulture-bridges-culture-ambassador-award"
}