{
    "text": "To enjoy additional benefits CONNECT WITH US May 26, 2016 04:37 pm | Updated 04:37 pm IST - Hyderabad: COMMents SHARE READ LATER Eminent Odissi dancer Sharon Lowen Photo: S.Subramanium For those of us who have lived through artistic Telugu movies of the 80s and 90s and still think the world of directors like K.Vishwanath, Singeetham Srinivasa Rao, Bapu and such others who were a league apart, a rewind to\nSwarna Kamalam days is not a memory to be awoken; it has always been a treasured picture. The American Odissi dancer who made a ‘guest’ appearance in the movie (\nSwarna Kamalam ) also made her presence a memorable one. There were many movies with foreigners earlier and later on, but Sharon Lowen lingers in the memory. Why? Perhaps there was something very Indian about this American danseuse that mutely pointed a finger towards our own neglect of native tradition. Two decades later, time stands still, or so it seems, when you set eyes on her now as she cordially invites you to take a seat beside her on the cushioned couch. Her house is a reflection of herself: artistically Indian with huge wooden temple figurines and doorway that speak of Odissi culture. What is even more striking are her sentiments which are astonishingly Indian than that of our present day women. She loves to take personal care of her aged mother whom she has flown from the USA to Delhi to be with her for the rest of her life. “I will take care of her even if she lives to be 108 which I’m sure she would,” she says dotingly. Dressed in a sari with her signature hairdo and a red bindi on her forehead, she attracts a question from any visitor to which she candidly goes back to her\nSwarna Kamalam days. When the director asked her to wear western dress, at least pants or jeans, in a scene where she doesn’t dance, to reiterate her American identity, “I said I’m sorry Vishwanathji, I don’t wear anything but sari. You can make me speak in English and let the audience know I come from America.” says Sharon laughing. Her passion for dance doesn’t begin and end with learning the genre and performing. She is a learned dance practitioner who has studied the modern Western dance, the ballet and then it was Manipuri, Mayurbhanj Chhau and Odissi both in theory and practice. “Among the million minuses with foreigners, there is a plus point or two and one of them is, we know that we don’t know what we are learning; hence we ask questions, not irrelevant or irreverent. We ask to equip ourselves with knowledge without which we know we cannot move forward seriously. I don’t have the language (be it any regional language of India or Sanskrit) but I have the text to read, know the connotation, the era, the ethos. And even if my audience doesn’t know the words of the text, I visualise it for them through my abhinaya or if they are educated in the text viewers, well then my interpretation will bring a different angle to the fore. I like taking the text and bringing it to life,” she explains. Quoting an instance to reiterate her statement, Sharon says that for a change she wanted to deviate from the routine shringara (rasa) and so she took up Thyagaraja kriti,\nNidhi chaala sukhama... picturising a Rama that was ultimate reality to the poet. She taught dance in Michigan University and had more than 200 lec-dems to her credit. If she wished she could continue in the US then why India. “I wanted to learn from the great gurus, I wasn’t so much bothered about performing unlike others of my age then. There is so much to learn. And my interest in Odissi was kindled by Guru Kelucharan. His workshops were like one-on-one classes. Abhinaya was my forte and his generosity moulded me into what I’m known to be today.” The mention of\nSwarna Kamalam and Sharon’s memory is vivid. “I was on the Doordarshan dance programmes a lot those days. And one fine day, my door bell rings and there I find Rajan Misra (Benaras gharana) enter with another gentleman. They said a very famous Telugu movie director wanted me for a short dance appearance in his story. I was delighted but then when it was suggested I do a Kuchipudi dance, I did not agree since I was getting established in Manipuri and Odissi and now I didn’t want a new label. He readily agreed. Not just that, he made way for an Odissi background in the movie, a brief Manipuri dance by Bhanupriya. I had to condense the 14-minute odd Pallavi into seven minutes; back to my Guruji who did it willingly for me! Film dancing though classical is very different from dancing on television. I was asked to direct the mudras in the last dance number of Bhanupriya’s to make it look classical. I never wanted to do any more films because the first one was the top and any other would only be lower to it,” she signs off complimenting her favourite director whom she holds in high esteem till date. COMMents SHARE Friday Review BACK TO TOP Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. ",
    "title": "\n\tSharon Lowen, an envoy of Indian culture - The Hindu\n",
    "datetime": "2016-05-26T11:07:09.000Z",
    "url": "https://www.thehindu.com/features/friday-review/sharon-lowen-an-envoy-of-indian-culture/article8649957.ece"
}