{
    "text": "Group has twice topped the US Billboard charts, yet must still serve in the military, unlike their classical colleagues Do pop stars make good soldiers, or are their talents better put to use promoting Korean culture around the world? This is a question dogging South Korea’s military leaders as they mull revising rules about who qualifies for an exemption from mandatory service. Currently nearly all men must serve for a minimum of 21 months, a measure seen as a deterrent against North Korean aggression. But medals in certain sporting events and top spots in international and domestic arts competitions serve as one of the very few ways out. After South Korea’s men’s football team won gold at the Asian Games, automatically granting members of the squad the right to skip the army, it reignited the debate over conscription. The victory was made all the more dramatic since it was the last chance for Tottenham Hotspur forward Son Heung-min to avoid conscription, which could have ended his career. Music fans have called for exemptions for successful K-pop stars, pointing to the group BTS and their second US chart-topping album this week. Prime minister Lee Nak-yon seemed to suggest the rules should be expanded to cover artists like BTS, and urged the military to “come up with a more reasonable measure by reflecting the public’s growing demands”. One opposition lawmaker was more direct: “If you win a classic music competition such as in violin and piano, military exemption is granted. However, winning a pop music competition, say the Billboard albums chart, gets you nothing.” Public opinion on the issue remains sharply divided and a recent poll showed 48% were in favour of increasing incentives while 44% were opposed. Yet the complaints about unfair treatment for sport stars and the lack of recognition for musical acts that have spread Korean culture globally may have fallen on deaf ears – military officials have said they might cut the number of exemptions in the future. “The Ministry of National Defense is considering abolishing the policy, but nothing specific has been confirmed about a timeline,” the ministry said in a statement, according to the Korea Times. The review comes even as officials plan to reduce the overall size of the military, from 618,000 to 500,000 personnel and shorten service to about 18 months. The current system stretches back to 1973. In 1988, when Seoul prepared to host the Olympics, the rules were revised to allow winners of any medal to avoid conscription. ",
    "title": "Should K-pop go bang? South Korean stars BTS caught in conscription debate | South Korea | The Guardian",
    "datetime": "2018-09-05T05:09:44.000Z",
    "url": "https://www.theguardian.com/world/2018/sep/05/k-pop-south-korean-stars-bts-conscription-debate"
}