{
    "text": "SK Innovation is poised to enter the battery recycling market in China. The company, which decided last month to build an electric vehicle (EV) battery separator plant in Jiangsu Province, plans to focus on expanding its network with Chinese partners as the volume of EV battery replacement in China is expected to jump starting from 2020. According to industry sources on Nov. 28, SK Innovation will attend a conference on battery recycling to be held in Tianjin on Nov. 29. It is the only participant among Korean EV battery companies. At the conference, researchers from SK Innovation will introduce its waste battery cathode recycling technology. A SK Innovation official said, \"Batteries with a residual value of 70% to 80% or more can be reused as energy storage devices (ESS), but for batteries that are difficult to reuse due to their low performance, we can extract rare metals such as lithium, cobalt and manganese and recycle them to manufacture EV batteries.\" Industry watchers say that SK Innovation's participation in this conference is its first move to advance into the waste battery recycling market in China, which is expected to greatly expand in the future. The China Battery Association estimates that the EV waste battery recycling industry will be worth 6.5 billion yuan (1.575 trillion won) by 2020. The China Automotive Technology and Research Center (CATARC), a government-run research institute specializing in automobile technology, estimates that the amount of waste batteries in China will reach 200,000 tons in 2020 and 350,000 tons in 2025. To solve such a problem, the Chinese government announced the first whitelist of waste battery recycling company in September. However, EV battery manufacturers such as CATL and BYD were not on the list. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "SK Innovation to Enter Chinese EV Battery Recycling Market - Businesskorea",
    "datetime": "2018-11-29T11:18:01+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=27009"
}