{
    "text": "Commentary  November 20, 2014 Children & Families Economic Studies Center for Economic Security and Opportunity There is a lively debate about the promise of universal pre-K for narrowing education gaps and promoting more social mobility. So far the focus has been on availability and cost – but it turns out that rates of attendance may matter a great deal. Chicago has been at the forefront of making pre-K available to its residents, and researchers at the Consortium on Chicago School Research have now studied pre-school absence rates across their city. They find strong connections between attendance rates and rates of learning – especially for those who start behind. Pre-K only really helps if the kids show up. First, lots of preschoolers are absent. Forty-five percent of them are “chronically absent”—in other words, they miss at least 10% of school days:  A range of factors influenced Pre-K attendance. Low-income children and children of color were more likely to be chronically absent, and health was the most common reason for missed days, according to parents and teachers. Children whose families depended on emergency rooms for medical care were more likely to miss school. Children of color were sick more often, which forced them to stay home in greater numbers. Lack of transportation also prevented many children from attending, as did half-day programming–parents struggled to fit preschool around their work schedules. Chicago has sought to address these problems, although the funding has raised controversy. Not only do the most at-risk kids miss the most days; they suffer more for it than their peers. All chronically absent kids scored lower on exit tests (regardless of baseline skills levels), but those who started out behind fared the worst (see Figure 3). It’s worth noting that absenteeism is associated with both lower  cognitive skills and lower social-emotional skills, which help form the foundation for later success.  The Chicago study also shows that absenteeism at the pre-K level is associated with lower reading scores at the end the second grade:  Of course, there are many other factors at work here, but this study suggests that efforts to improve attendance during pre-K may alleviate some of the need for remedial efforts a few years later. High-quality pre-K has great potential, even if many programs fail to realize it. But policymakers around the country should take note: it is not enough just to provide services; at-risk kids need to make use of them. Woody Allen once said that “showing up is 80 percent of life.” Turns out, this is true even before kindergarten. Related Content Julia B. Isaacs, \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tEmily Roessel September 4, 2008 Richard V. Reeves March 26, 2015 Edward Rodrigue, \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRichard V. Reeves January 21, 2015 Related Books Julia B. Isaacs, \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tEmily Roessel September 4, 2008 Richard V. Reeves March 26, 2015 Edward Rodrigue, \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRichard V. Reeves January 21, 2015 Authors  Children & Families Economic Studies Center for Economic Security and Opportunity Beth Schueler, \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMelissa Arnold Lyon, \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJoshua Bleiberg October 24, 2023 Taylor Odle, \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJennifer A. Delaney, \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPreston Magouirk October 23, 2023 Nariman Moustafa October 20, 2023 Get the latest from Brookings The Brookings Institution is a nonprofit organization based in Washington, D.C. Our mission is to conduct in-depth, nonpartisan research to improve policy and governance at local, national, and global levels. Copyright 2023 The Brookings Institution ",
    "title": "Skipping School is Bad News, Even for Pre-K | Brookings",
    "url": "https://www.brookings.edu/articles/skipping-school-is-bad-news-even-for-pre-k/"
}