{
    "text": "The K-pop superstars wile out in the visual to their Electronic/Dance Songs chart hit. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin As any fan will tell you that, at their wildest, K-pop videos remain rather tame. But in Skrillex‘s “Dirty Vibe” video, two of K-pop’s biggest stars, CL and G-Dragon, get wild and unleash a previously unseen side of themselves. Check out the flashy visual to the track that also features Diplo co-producing: Explore\t\t\n\t\n\nSee latest videos, charts and news\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tDiplo\t\t\n\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tSkrillex\t\t\n\t\t\t\t\t\n\n\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news In the clip, the stars don some of their most ferocious looks yet: The BIGBANG leader rocks his “Good Boy” braids adorned with lollipops, a bandana over his mouth and pants dripping with silver chains; while 2NE1‘s “Baddest Female” dons multiple couture-raver costumes, a huge lock as a necklace and a spray-painted mohawk. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t12/15/2014 But the most remarkable part of the video is their attitudes as the artists confidently drop their delectably dirty lines and are more than happy to throw up a middle finger to the camera. G-Dragon and CL have never been conventional K-pop stars, but they completely throw out the scene’s rule book here. Premiered on RedBull.com, Skrillex spoke a little about how the collaboration together. “We met in Korea when I was out there playing a show,” he said. “At the time I was working on that track with Diplo. I played it for them and really wanted them to write something for it. So the whole thing happened very organically.” The DJ/producer also said his love for K-pop goes further than this one collabo. “I have always loved the culture of K-pop,” he added. “G-Dragon and CL are such inspiring artists for me. I love the Korean’s crazy over-the-top fashion and how it translates into the music. It’s just really fun music.” Lifted off his Recess album that peaked at No. 4 on the Billboard 200, “Dirty Vibe” reached No. 19 on Billboard‘s Hot Dance/Electronic Songs chart so far — marking the inaugural appearances for both G-Dragon and CL on the ranking. Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "title": "Skrillex’s ‘Dirty Vibe’ Video: Watch CL & G-Dragon Get Crazy | Billboard – Billboard",
    "datetime": "2014-12-16T01:47:40+00:00",
    "url": "https://www.billboard.com/music/music-news/skrillex-dirty-vibe-video-diplo-cl-g-dragon-mv-6406376/"
}