{
    "text": "SM Entertainment CEO Sung Su Lee doesn’t often do interviews. So when he does speak publicly, it’s worth listening very closely to find out what makes the wheels turn at the K-pop giant he’s in charge of, whose roster features stars like EXO, Girls Generation and Shinee. Lee appeared as a keynote speaker at 2021 STARTUP:CON last week and shared some insight into SM’s vision for the future of K-pop. He also announced SM’s ambitious goal of wanting to make Seoul, already the birthplace of K-Pop and K-culture, “the mecca of global culture.” The executive, who joined SM Entertainment in 2005 as part of the A&R team, argued in his speech that K-pop is “not just a genre of music, but a genre of content”. At the centre of SM’s content strategy is the SM Culture Universe (SMCU), which, Lee explained, is a “future entertainment universe that connects the world through culture without any boundaries between reality and virtual reality”. SMCU is essentially a character-led universe akin to cinematic universes like those created by comic giants Marvel or D.C. Explaining the concept around SMCU at the company’s ‘SM Congress 2021’ back in June, Sung Su Lee said that it “can be thought of as SM’s metaverse, inviting K-pop fans around the world to appreciate our music and stories via various platforms”. He added in his speech last week that SMCU “will not only include our original content, but also [content] recreated by the fans”. This is achieved specifically through the company’s ‘Pink Blood Project’, a fan engagement platform that supports what it calls ‘prosumers’ – SM fans who create their own content inspired by SM’s acts. The origins of the SMCU, Sung Su Lee told the audience last week, are rooted in SM founder and Executive Producer Soo-Man Lee’s prediction of “the future becoming a world of robots and celebrities, as well as avatars”. As such, said Sung Su Lee, SM Entertainment has “been preparing for the future [i.e. virtual] content era for decades”. The company’s big expansion into the rising virtual artist space, and its introduction of SMCU concept, arrived in October last year with the launch of aespa – a ‘Metaverse Girl Group’ featuring four human members and four virtual counterparts. According to Sung Su Lee, SMCU is a “massive virtual world that starts with aespa’s storytelling”. The name “aespa” is a combination of ‘ae’ (initials for ‘avatar’ and ‘experience’) and ‘aspect’, which, SM says, represents “the meeting of another self and experiencing a new world”. The group’s debut single Black Mamba, released in November 2020, surpassed 21 million views within its first 24 hours. And in May this year, SM released Episode 1 of aespa’s big-budget cinematic comic-esque film, also called Black Mamba (see below). Sung Su Lee explained that “the main keyword” of the company’s universe is ‘KWANGYA’, which he says “holds a symbolic meaning as it encompasses both real and virtual worlds”. “K-Pop fans call our relocated SM Headquarters in Seongsu-Dong and the Seoul Forest area KWANGYA,” he explained. “It’s our goal for ‘KWANGYA,’ an infinite virtual universe, to expand as the concept of space that refers to our new location and become the landmark of SMCU.” Sung Su Lee’s latest speech arrived several weeks after it was reported that 20% of SM Entertainment is up for sale, including over 18% of the shares owned by founder and executive producer Lee Soo Man. Quoting ‘investment banking insiders’, Korean news site AllKpop reports that it’s likely that either Kakao Entertainment or CJ Entertainment – the production company behind Korean blockbuster movie Parasite – will swoop for the stake in the music company. Citing sources again, AllKpop reports further that CJ is Lee Soo Man’s preferred choice and is currently looking like the ‘strongest buyer candidate’. If CJ and SM, were to go into business together, it wouldn’t mark the first time that SM has worked with a titan of the film world. Sung Su Lee noted in his speech that back in 2010, SM Entertainment and Canadian film maker James Cameron – who created box office smash Avatar – teamed up to create 3D content. “Despite being a music-based culture content company for over 20 years, SM has always understood the importance of incorporating the latest technologies of time such as IT and AI into our content and have been implementing such (technologies) for over 20 years.” Sung Su Lee, SM Entertainment “It was very ahead of time back then, but when producer James Cameron’s Avatar swept the world with its 3D content, SM had already finished the related R&D, which allowed us to establish a consortium with Samsung Electronics and [Cameron] to showcase Girls’ Generation’s 3D music video right away,” explained Sung Su Lee last week. He added: “Despite being a music-based culture contents company for over 20 years, SM has always understood the importance of incorporating the latest technologies of time such as IT and AI into our contents and have been implementing such [technologies] for over 20 years. “Now, in an era where IT, AI and contents cross boundaries and take place in companies and various contents, we, as a content company, would like to work with and support innovative, technology-based start-up companies.” Elsewhere in his speech, Lee said that the SMCU was created “through decades of accumulated killer content and IP expansion” and, that it is this “metaverse-styled future content that SM strives for”. As an example of IP expansion, Lee introduced the company’s ‘Remastering Project,’ which aims to boost the quality of SM’s original music videos as well as re-mastering the company’s original tracks, which he says “are SM’s precious assets and the history of K-Pop”. “When viewing the structure of K-POP from the perspective of a global trend called Metaverse in the post-COVID era, K-POP can be seen as a new form of cultural IP content never-before-seen in existing genres of music.” Sung Su Lee Continued Lee: “When viewing the structure of K-Pop from the perspective of a global trend called metaverse in the post-COVID era, K-Pop can be seen as a new form of cultural IP content never-before-seen in existing genres of music. “This is SMCU as based off the worldview we are creating, and we will reach the next level by creating an expanding universe of metaverse-styled IP content that connects the various and independent IPs of artists, music, music videos, performances, etc. within SMCU to one another.”Music Business Worldwide The best of MBW, plus the most important music biz stories on the web. Delivered for FREE, direct to your inbox each day. ",
    "title": "SM Entertainment is making music’s answer to Marvel’s universe",
    "datetime": "2021-10-18T13:51+00:00",
    "url": "https://www.musicbusinessworldwide.com/can-music-mimic-marvel-sm-entertainment-ceo-sung-su-lee-on-building-k-pops-answer-to-a-cinematic-superhero-universe/"
}