{
    "text": "In her bi-weekly column, Social Anxiety, Emilie Friedlander peeks underneath the artifacts of contemporary culture to question what it all really means. Last month, a coworker of mine sent over a puzzling little fashion editorial she'd stumbled upon on Vogue's website. The headline was \"7 Basic Fall Looks to Embrace Your Inner #Basic,\" and unlike the scores of thinkpieces about the white female appropriation of the word \"basic\" that have cropped up on the internet this past week (including, most recently, one about how analyzing it to begin with is a pretty \"basic\" thing to do), it seemed to be saying that being basic was a good thing. \"Essentially, the #Basic look is just another version of uniform dressing that doesn't require frills or rummaging through closets to find suitable items,\" reads the introduction, by Liana Satenstein. \"There's the infusion of classic staples that can be worn for years to come.\" Rather than split hairs about the word's etymological evolution as an insult—seeded nearly 30 years ago in a song called \"Meeting in the Ladies Room\" by all-black R&B group Klymaxx, then used in a Kreayshawn song lyric, then frankensteined by middle class white women as a term for other middle class white women who like pumpkin spice lattes—it celebrated the idea of \"basic dressing\" in the very literal sense, connoting a very functional fashion philosophy based on \"streamlining\" the process by which we arm ourselves for the scenarios of everyday life. Among the article's consumer recommendations, there was a clean-cut black blazer for the #9T05 work grind, a classic beige trench for Sunday #BRUNCHWITHTHEFAM, and even a royal blue maxi dress for evenings out with the ladies (#YESWAYROSE). Somewhat more cartoonishly, there was was a tank top emblazoned with the words \"FIND YOUR SOUL\" for presumed regular Soul Cycle sessions, and a matching bracelet and earrings set on the off chance that you're out at a fancy dinner with your beau and he happens to pop the question (#SHESAIDYES). Personally, I didn't find that particular date look to be very \"no-frills\" at all, although I was intrigued by the article's assumption that present-day urban life—presumably for the female, heterosexual, cis-identifying, relatively affluent sector of the city-dwelling demographic—could be broken down into a set of standard, universally applicable activities and behaviors. More than a celebration of wearing \"basic\" threads, it felt like a celebration of living a so-called \"basic\" life, and doing things that \"basic\" women do, like work desk jobs and drink rosé and work out at brand-name gyms and have boyfriends that propose to them. Even more confusingly, it framed this prideful ordinariness not as an alternative to the fashion-conscious life, but as the latest style craze in an endless stream of crazes: \"Honestly, if the last season was all about the Tevas and Seinfeld-esque faded jeans of the #normcore phenomenon, this season is literally all about being #Basic.\" Notice that the writer doesn't use the word \"dressing,\" or \"looking,\" but the style-transcending, all-encompassing \"being.\" This past week, much space has been devoted to the pernicious assumptions about gender and class embedded within the \"basic bitch\" insult. Writing for New York magazine, in the trendpiece that sparked this week's \"basic\" trendpiece trend, Noreen Malone argued that calling a woman \"basic\" for her taste in Uggs and seasonal coffee drinks masks a latent materialist attitude, a judgment of another person based on that person's lack of discriminating good taste as a consumer. Pointing to the term's growing usage as a white-female-on-white-female insult today, she says it's also an unknowing \"endorsement\" of a \"male hierarchy of culture,\" one that undermines the conventionally \"female\" consumption patterns, as well as the women who adopt them. As BuzzFeed's Anne Helen Petersen subsequently pointed out, there's something inherently class conscious about using the word \"basic.\" In a mainstream cultural landscape where \"weird\" is cool, and where any clothing item or song or book or movie or culinary habit—no matter how far off the beaten path—is fair game for viral hysteria, there's an inherent anxiety about being \"ordinary,\" a fear that liking ordinary, mass market consumer items is a red herring for a lack of sophistication and education—a lack of \"class in the colloquial sense.\" Being afraid of being \"basic,\" Petersen suggests, is essentially being afraid of conformity. \"And in 2014 America, the way we measure conformity isn't in how we speak in political beliefs, but in consumer and social media habits. We declare our individuality via our capacity to consume differently—to mix purchases from Target with those from quirky Etsy shows—and to tweet, use Facebook, or pin in a way that separates us from others.\" Petersen's observations about class anxiety are astute, although, I think it's worth pointing out that when white middle class women use the word \"basic,\" they aren't always necessarily using it as an insult. The aforementioned Vogue article, which came out a month before Malone's piece, was, after all, an attempt to lay a finger on \"basic being\" as a trend, as an identity to aspire to and put money towards. Malone's article opens with the observation that \"to dress 'normal' is the height of chic,\" even if she doesn't return to the idea later on, and BuzzFeed has presumably generated their fair share of ad revenue churning out \"basic\"-themed quizzes and lists. Back in April, I wiled away a good 30 minutes on a friend's couch taking that website's \"How Basic Are You\" quiz, making my way down a list of 119 potential personal preferences meant to determine whether or not I was deserving of the tag. (Some that applied to me: \"You LOVE bagels\"; \"You can't get enough of the different versions of 'Barre Method'; \"You've blamed bad things on Mercury being in retrograde.\") From a young age, I've always identified as a person with very particularized taste in music and movies and style, but there was something strangely pleasurable in identifying some of the ways in which I wasn't necessarily different from my peers. Finding out that I was a \"little basic,\" as I did from the quiz, felt a little bit like being part of a club I didn't know I was a part of—a club of people who just liked what they liked and didn't care about being \"different\" or \"special.\" To judge from the number of times that the quiz has been viewed (nearly 2 million times), I can imagine that a lot of people out there were drawn to the quiz (and eager to share the quiz with their girlfriends) for a similar reason. Still, I think that first item on the BuzzFeed \"basic\" index is probably the most revealing one: \"You don't think you're basic.\" Here, I'm reminded a little of the mainstream discourse surrounding hipster culture throughout the '00s, where everybody seemed to believe that hipsters, by definition, refuse to admit that they are hipsters. Basic culture may be diametrically opposed to that very taste-obsessed subculture, but it represents a similar brand of conflicted self-identification: we want to be \"basic\" on some level, but we don't want to be so basic that we're unable to call it in ourselves and others. Being basic can be a point of pride, as long as we know that we're being basic, and are able to identify our more mainstream affinities as knowing ones. It all comes back to distinguishing ourselves based on the consumer choices we make, which was probably the thing that irritated a lot of people about the \"normcore\" style trend, when New York magazine's Fiona Duncan sparked a massive conversation about it this past February: hipster culture had become so colonized by the mainstream that hipsters were beginning to differentiate themselves through the adoption of mainstream styles and tastes, crowded out of their own game in a world where being \"different\" was becoming the norm. That's the thing about basic culture and normcore culture: they're kind of the same thing, even if they're coming at self-definition from opposite sides of the mainstream/subcultural divide. The one may be obsessed with Ugg Boots and French manicures, and the other with Tevas and Umbros, but both are examples of locating \"cool\" in unexpected places, of feeding the trend cycle with new materials to feast itself on and then discard. Neither represents a permanent solution to the problem of affirming one's individuality and uniqueness in a world where everybody is trying to do the same thing, imprisoned as we are within a virtual ecosystem that encourages us to express ourselves by sharing the things we \"like.\" It's definitely a first world problem—after all, not everybody has the privilege of worrying about whether they come across as \"too mainstream\" or too \"niche\"—but I also think it's an outgrowth of a very human need, and one that we need not necessarily be ashamed of. We long to be appreciated for our particularities as humans, but we're trapped in an uphill battle of having to express those particularities through things. To that end, though, I think there's something that we can take away from normcore (and by extension, maybe the \"basic\" phenomenon, too). It's there in Fiona Duncan's original exposé, where she correctly identifies the term \"normcore\" as the brainchild of a self-described \"trend-forecasting group\" called K-Hole. If you log onto their website, you can download a PDF booklet where they break down the meaning of the term. Even before normcore became \"a thing,\" the shadowy New York marketing company behind the term already seemed to be aware that the wider internet would interpret the concept as just another hipster exercise in being \"too cool for school,\" and to warn against it: \"Individuality was once the path to personal freedom—a way to lead life on your own terms. But the terms keep getting more and more specific, making us more and more isolated. Normcore seeks the freedom that comes with non-exclusivity. It finds liberation in being nothing special, and realizes that adaptability leads to belonging.\" Unlike \"Mass Indie\"—per K-Hole, the cultural phenomenon whereby we define ourselves by being \"different\"—real normcore doesn't \"appropriate an aestheticized version of the mainstream,\" as a lot of the movement's detractors seem to believe it does. Instead, K-Hole writes, \"it just cops to the situation at hand,\" understanding fashion to be something functional and situation-specific, a matter of blending in with the other people around you so that superficial differences are eradicated and a more meaningful kind of connecting can arise. When you're at a baseball game, you dress like a person at a baseball game, and when you're at a Justin Timberlake show, you dress like a person at a Justin Timberlake show. It's kind of like the Vogue article, where you narrow your wardrobe down to the different generic \"uniforms\" you need to engage with the scenarios of everyday life, only the possible scenarios are infinite, and preferably not ones you're used to engaging with. It doesn't seem like a very easy thing to pull off (in fact, there's are arguments to be made about how that sort of adaptability presumes a degree of privilege that not everybody has), but I think there's a nugget of wisdom behind it. Maybe it's time that we stopped worrying so much about clothes, because there are other ways to define ourselves, other ways to connect. And maybe, though she's defined the term \"basic\" in various ways, Kreayshawn was trying to say the same thing in \"Gucci Gucci,\" when she first repurposed the term for the white female demographic: Gucci Gucci, Louis Louis, Fendi Fendi, Prada/ Them basic bitches wear that shit so I don't even bother. ",
    "title": "Social Anxiety: Why Basic Culture Is Just Normcore 2.0 | The FADER",
    "url": "https://www.thefader.com/2014/10/23/social-anxiety-basic-culture-normcore"
}