{
    "text": "By Carrie Johnson , Bill Chappell The U.S. holds more prisoners in solitary confinement than any other democratic country, according to critics of the treatment. Here, an immigrant detainee makes a call from his \"segregation cell\" at a detention facility in Adelanto, Calif., last November.\n                \n                    \n                    John Moore/Getty Images\n                    \n                \nhide caption The U.S. holds more prisoners in solitary confinement than any other democratic country, according to critics of the treatment. Here, an immigrant detainee makes a call from his \"segregation cell\" at a detention facility in Adelanto, Calif., last November. Former prisoners spoke about the effects of solitary confinement Tuesday, in a congressional hearing aimed at banning the treatment for some inmates. The federal push to reduce solitary confinement is being led by Sen. Dick Durbin, D-Ill., who calls it \"a human rights issue we can't ignore.\" Inmates who are held in solitary confinement spend 23 hours a day in small windowless cells, receiving their food on trays that are pushed through a slot in the cell's door. The use of solitary confinement is also extremely expensive and counterproductive, according to a news release from the Senate Subcommittee on the Constitution, Civil Rights and Human Rights,which Durbin leads. NPR Justice Correspondent Carrie Johnson, who attended today's hearing, says that Durbin's calls for change, which is aimed only at the rules governing juveniles, pregnant women and the mentally ill, come as some states have already begun to cut the use of solitary confinement. \"In the last couple of years, a lot of factors have come together,\" Carrie tells Melissa Block on All Things Considered. She'll also report on the issue for Morning Edition Wednesday. \"There have been efforts by states to save a lot of money and reduce violence in prisons,\" Carrie says. \"And also, a critical mass of advocacy by the ACLU and some researchers,\" she says, along with bipartisan interest in the issue. \"One fact that came out today was that it costs about $78,000 a year to house someone in the federal prison system in solitary,\" Carrie says. \"That's three times as much as it costs to put somebody in a regular prison unit.\" Carrie says that states \"have been leading the way\" in curbing solitary confinement. New York recently announced a broad revamping of its prison poliicies last week, for instance, spurred by a federal lawsuit in which critics said \" thousands of inmates — some of them pregnant or mentally ill — are being held for months and even years in isolation, often for minor infractions,\" as NPR's Brian Mann reported. Mississippi, Maine, and Texas have also taken up the issue. Today, Durbin and his allies urged more states and the federal government to ban the use of solitary confinement. \"The United States holds more prisoners in solitary confinement than any other democratic nation in the world,\" Durbin said ahead of the session. \"The dramatic expansion of the use of solitary confinement is a human rights issue we can't ignore.\" Carrie calls the testimony that was given by former prisoners on Capitol Hill today \"incredible.\" Particularly moving were the words of former inmate Damon Thibodeaux, who was exonerated after serving nearly 15 years in solitary confinement in a Louisiana prison. \"Humans cannot survive without food and water,\" Thibodeaux told the senators. \"They can't survive without sleep. But they also can't survive without hope.\" \"Years on end in solitary, particularly on death row, will drain that hope from anyone. Because in solitary there's nothing to live for,\" he said. \"After realizing what my existence would be like for years on end, until I was either executed or exonerated, I was on the verge of committing what was basically suicide by state,\" Thibodeaux said, \"by voluntarily giving up my legal rights and allowing the state to carry out the sentence of death.\" He asked, \"What does it say about us as a nation that even before the law allows the state to execute a person, we're willing to let it kill them bit by bit and day by day, by subjecting them to solitary confinement?\" Interest in today's hearing was so intense that its location was shifted to a new venue on the Hill. The witness list included Piper Kerman, author of the memoir Orange Is the New Black, based on her own experience in prison. Kerman said that for women in prison, the risk of solitary confinement can make them reluctant to speak up about rape and other abuses, for fear of possible retribution. \"The terrible threat of isolation makes women afraid to report abuse, and serves as a powerful disincentive to ask for help or justice,\" she said. The proposed changes are meeting with resistance from prison officials and guards, whose union president, Eric Young, said today that \"isolation or segregation is a vital tool to prevent anarchy in prisons,\" Carrie says. And the director of the Federal Bureau of Prisons, Charles E. Samuels, Jr., said that there are inmates, such as gang leaders, who must be separated from the rest of the prison population. \"If they see that we will lower our standards, we will not hold individuals accountable, it puts our staff at risk,\" he said. \"It puts other prisoners at risk.\" The Senate panel released information today stating that of the more than 2.3 million people who are in America's jails and prisons, \"the United States held over 80,000 people in some kind of restricted detention.\" Sponsor Message Become an NPR sponsor ",
    "title": "Solitary Confinement Costs $78K Per Inmate And Should Be Curbed, Critics Say : The Two-Way : NPR",
    "url": "https://www.npr.org/sections/thetwo-way/2014/02/25/282672593/solitary-confinement-costs-78k-per-inmate-and-should-be-curbed-critics-say"
}