{
    "text": "AKB48’s Team K during the final performance of the 2014 revival of their fourth stage show “Saishuu Bell ga naru” in the AKB48 Theatre in Akihabara, Tokyo on April 16. AKS, Courtesy photo. Angelica WallingfordDecember 10, 2014 Looking back, 2008 was a very interesting year for music. Michael Jackson’s “Thriller” reached its 25th anniversary, pop punk pioneers The Get Up Kids reunited and indie rock darlings the Dum Dum Girls formed in Los Angeles. Meanwhile, 5,579 miles away on the eighth floor of the Don Quixote building in Akihabara, Tokyo, the J-pop idol pop group AKB48’s own Team K was gearing up for opening night of its 4th stage show, “Saishuu Bell ga naru” — translated to “The Last Bell Rings” — one of the best stages and albums to ever hit the stage. AKB48 is arguably the biggest and most successful idol group in Japan with single after single ranking on Japan’s Oricon charts. AKB48 is divided into five Teams — A, K, B, 4 and 8 — and follows an “idols you can meet” concept that involves direct contact with fans via various events and teams rotate performing different stages, or a set list unique to that team, in the AKB48 Theater on a daily basis. What makes “Saishuu Bell” such a good album is that it’s an eclectic musical mixture. The album is a really good balance of the typical sugary sweet cute idol songs and a cooler more mature sound that plays to the strengths of the original Team K, made up of the second wave of AKB48 members. Unofficially led at the time by one of Team K’s central members and future captain, Sayaka Akimoto, “Saishuu Bell” is a prime example of how being an idol doesn’t necessarily equate to performing and placing oneself into the stereotypical idol box. The song “Oshibe to Meshibe to yoru no Chouchou” — translated to “The Stamen, The Pistil and The Evening Butterfly” — explores the girl’s sexier side and pretty much throws the image of the cute and energetic J-pop idol out the window. Sung by former members Megumi Ohori and Tomomi Kasai, the song is sung as a sexy back and forth between the two about forbidden affair. Ohori’s mature voice contrasts Kasai’s higher pitched voice and the two play off each other perfectly. The song by itself is quite the listening experience but watching them perform it takes it to another level. Even though various members have performed this song over the years, there’s a reason why the original is always the definitive version. The titular song “Saishuu Bell ga naru” was written from the perspective of the girls taking their future in their own hands and going for what they really want in life. The song starts out with a guitar heavy instrumental that contrasts the girls somewhat soft way of singing. Singing two at a time for the lines in the verses the 16 voices come together to belt out this powerful chorus with the occasional cascading harmony for the off-centered lyrics. “Saishuu Bell ga naru” is one of the landmark Team K songs that is performed over and over again, whether it be on the small AKB48 theater stage or the massive stage at the Tokyo Dome. “Sasae” — translated to “Support” — is an emotional song written by AKB48’s producer Yasushi Akimoto about the trials and tribulations that the girls in the original Team K went through as a unit and the strong bond they share because of it. What makes this song so good is that you can feel the girl’s emotions as they sing, especially when they’re singing together. Musically, the song is a very straightforward slow pop song and unlike many of AKB48’s other songs, doesn’t try to mask the emotional lyrics with upbeat, catchy and rhythmic music. It’s a song that supposed to be emotional and the unlikely perfect candidate for an album closer. All in all, “Saishuu Bell ga naru” is one of the best stages and albums to come out during AKB48’s stellar nine year reign as one of Japan’s most successful groups. The album is a testament to just how talented the second generation of AKB48 was and how there will never really be a team to fill their shoes. As far as the language barrier goes, there’s always websites and translator to help out with that. Just sit back and enjoy the music. Music is an international language after all. Your donation will support the student journalists of San Diego City College. Your contribution will allow us to purchase equipment, cover the cost of training and travel to conferences, and fund student scholarships. Credit card donations are not tax deductible. Instead, those donations must be made by check. Please contact adviser Nicole Vargas for more information at [email protected]. Your donation will support the student journalists of San Diego City College. Learn more at sdcitytimes.com/donate. ARTS & CULTURE Indigenous food huitlacoche comes to City College, bringing path to food sovereignty, connection with ancestral roots ARTS & CULTURE VIDEO: “Mr. Burns: A Post-Electric Play” opens at City College ARTS & CULTURE RADIO: ‘Indie Live in San Diego’ highlights best sounds from local bands ARTS & CULTURE City College music debuts live-audience streaming series with mariachi group (with video) ARTS & CULTURE City College professors unmask the science of superheroes ARTS & CULTURE Former child actor returns to City College, performing in ‘Salvation Road’ ARTS & CULTURE City College’s first play of the season to open Oct. 6 ARTS & CULTURE 6 World Cultures events you don’t want to miss this October at City College ARTS & CULTURE Experimental fiber artist gives tufting demonstration at City College ARTS & CULTURE Local musician works to build San Diego rock music scene The news site of San Diego City College ",
    "title": "SoundBreak: AKB48’s Team K steps out of the classic J-pop box – City Times",
    "url": "https://sdcitytimes.com/arts/2014/12/09/soundbreak-akb48s-team-k-steps-out-of-the-classic-j-pop-box/"
}