{
    "text": "Tchai Kim Youngjin, Hanbok Collection (2015) Image courtesy of ygkplus, BAE YOON YOUNG Curators at the Victoria and Albert Museum in London (V&A) will examine how South Korean popular culture has been exported the world over in a major exhibition opening next year. “Hallyu! The Korean Wave\" (24 September-25 June 2023) is the first exhibition of its kind to showcase the colourful and dynamic popular culture of South Korea. Rising to prominence in the late 1990s, the first tides of hallyu, meaning Korean Wave, rippled across Asia before becoming a worldwide phenomenon that challenges the currents of global pop culture today,” says a V&A press statement. K-Pop (Korean pop music) has dominated the global music industry with groups such as BTS, regarded as the most successful boyband in the world, riding the wave. How South Korean trends have impacted on cinema, drama, music, fandom, beauty and fashion worldwide will be explored in the exhibition. “More information will be released down the line,” says a V&A spokeswoman regarding the show’s content. In a stroke of cultural diplomacy, the show is supported by the Ministry of Culture, Sports and Tourism of the Republic of Korea. Journalist Christine Ro outlined in a BBC report last year how successive South Korea governments have pursued a strategy of exporting pop culture worldwide following the Asian financial crash in the late 1990s. “Hallyu, or the ‘Korean wave’ of culture, has been a deliberate tool of soft power. South Korea isn’t alone in this; many countries invest in cultural councils and exchanges partly to strengthen diplomatic aims. But the South Korean government’s push for cultural power has had remarkably quick success,” Ro says. Watercolour from The Tale of Jemima Puddle-Duck by Beatrix Potter, 1908, England. Courtesy of National Trust and Frederick Warne & Co. Photo © National Trust / Robert Thrift Other V&A shows lined up for next year include a celebration of the life and work of the British children’s author Beatrix Potter (Beatrix Potter: Drawn to Nature, 12 February-25 September 2022). The exhibition, organised with the National Trust heritage body, will include letters, photographs, watercolours and drawings, highlighting Potter’s achievements as a natural scientist as well as the creator of enduring characters such as Peter Rabbit. In a show tailor made for the gender-conscious 21st century, Fashioning Masculinities: The Art of Menswear (19 March-6 November 2022) unpicks how designers and artists have constructed and interpreted masculinity over the centuries with historical items from the V&A such as Renaissance paintings included as reference points. Kofi Ansah 'Indigo' Couture 1997 - Narh & Linda - Photo © 1997 Eric Don- Arthur _ www.EricDonArthur.com Africa Fashion (11 June-16 April 2023) will include more than 250 works by designers such as Kofi Ansah from Ghana, Folashade “Shade” Thomas-Fahm and Alphadi from Nigeria, and Chris Seydou from Mali. The exhibition looks at the flourishing of art and music across the continent which fuelled the fashion renaissance. Christine Checinska, curator of African and African diaspora fashion at the museum, told The Guardian: “This exhibition tells the story of the fashion scene which came out of the years of independence. It will be a game-changer, because we’ll be speaking about African fashion from an African perspective.” At V&A Dundee, the museum’s Scottish satellite branch, Plastic: Remaking Our World (29 October 2022-5 February 2023) will examine issues around the ubiquitous material that dominates our everyday lives, especially the threat to the world’s oceans from plastic pollution. The exhibition will feature product design, graphics, architecture and fashion items from the collections of the V&A and Vitra Design Museum in Weil am Rhein. In 2023, another V&A Dundee show puts a new spin on tartan (2 April-3 September 2023), the fabric that is the bedrock of Scottish national attire. “Tartan is a textile which is adored and derided, inspiring great works of art and design, and representative of unity and dissent, tradition and rebellion,” says a V&A statement. ",
    "title": "South Korea's rapid rise to global pop cultural dominance will be explored in new Victoria & Albert Museum exhibition",
    "datetime": "2021-07-07T11:06:04.411Z",
    "url": "https://www.theartnewspaper.com/2021/07/07/south-koreas-rapid-rise-to-global-pop-cultural-dominance-will-be-explored-in-new-victoria-and-albert-museum-exhibition"
}