{
    "text": "Korean Cubically Imagined An immersive art exhibition called Korea: Cubically Imagined is being held at the Art Centre at Mall of the Emirates in Dubai. All photos: Pawan Singh / The National A new exhibition at Mall of the Emirates is allowing visitors to immerse themselves in South Korean culture, in the heart of Dubai. Korea: Cubically Imagined is a collaborative event between the Korea Creative Content Agency and the Korean Cultural Centre in the UAE, which is taking place until November 30 at the mall's Art Centre. The free exhibition comprises 20 types of content, including a stage experience of BTS's Permission to Dance on Stage — Las Vegas and a VR screening of scenes from Parasite, the acclaimed Korean film that won four Oscars, including Best Picture, in 2020. The event also features a variety of striking digital art installations that bring to life the busy and dynamic corners of Seoul, including a nine-metre-high waterfall in motion and Mount Geumgang, one of Korea's most beloved scenic spots. “The exhibition is one of a kind,” said Jasper, from Dubai-based K-pop dance group The Pixies, at the opening on Wednesday. The group performed to five songs including Blackpink's Shut Down and Hype boy by NewJeans. “The highlight of the night for us was watching the BTS concert on screen while waving our light-sticks and singing our favourite songs with them,\" he added. “We were super excited. It's always an honour to perform and represent the K-pop dance community here in the UAE as well as spreading our love and passion for  Korean culture and K-pop.\" In the UAE, the Hallyu wave, a term to describe the global craze for Korean culture, has grown significantly over the past few years, said Jasper. \"With many Korean and K-pop conventions, concerts and exhibitions taking place yearly, they have introduced not only the growing and energetic world of K-pop but also the beauty of the Korean culture to many people leaving them interested to learn and explore more.” Free, until November 30, Art Centre, Mall of the Emirates, www.malloftheemirates.com Scroll through the gallery below to see the BTS pop-up shop that recently came to Dubai BTS Pop Up Store Fans of record-breaking K-pop group BTS queued up at the opening of the official BTS Pop-Up: Space of BTS shop in BurJuman mall in Dubai. All photos: Antonie Robertson / The National The Arts Edit A guide to arts and culture from a Middle Eastern perspective ",
    "title": "South Korean culture showcase launches in Dubai, including a mini BTS concert",
    "url": "https://www.thenationalnews.com/arts-culture/art-design/2022/11/17/south-korean-culture-showcase-launches-in-dubai-including-a-mini-bts-concert/"
}