{
    "text": "Discover Thomson Reuters By Joyce Lee 4 Min Read * First-ever Korean casino resort to open in Q1 2017 * Shares up more than sevenfold since start of 2011 * Proximity to rich northeastern China a plus-exec SEOUL, Aug 6 (Reuters) - South Korea’s biggest casino operator believes there is enough Chinese demand to go around even as more Asian countries target mainland gamblers. Paradise Co Ltd and Japanese partner Sega Sammy Holdings Inc are set to break ground in October on the country’s first integrated casino resort. Their Paradise City project near South Korea’s main Incheon airport should open in early 2017, a year ahead of a nearby project planned by U.S.-based Caesars Entertainment Corp and Hong Kong’s Lippo Ltd. The company is banking on South Korea’s proximity to northeast China and the popularity of Korean culture as a draw for Chinese gamblers who bet billions in places like Macau. The number of Chinese tourists to South Korea grew nearly 53 percent last year. South Korea’s total casino revenue was about $2.5 billion in 2013, less than 6 percent of Macau’s. “There will be more rich people in China, and they will need to travel,” Choi Jong-hwan, CEO of Paradise Sega Sammy Co, said in an interview. “This is a megatrend.” Investors have sent Paradise shares up more than sevenfold since the start of 2011, the year the Seoul-based company tied up with Sega Sammy. Last month, Paradise raised 285.8 billion won ($276.54 million) in a sale of treasury shares. The joint venture plans to open the first phase of the resort with casino, hotel, shopping, entertainment and convention facilities, at a cost of about 1 trillion won. The phase will include 120 tables, 400 slot machines and 300 electronic gaming tables, small by the standards of mega-resorts elsewhere. Choi said the company will also rely on junket operators to bring in 20-30 percent of its business, compared to the current 5 percent at its other casinos. Junket operators bring in high-rollers from China. The resort will also play up its “Korean-ness” because “Korea is a hot place right now,” Choi said. “The main content that we will be showing to the Chinese VIPs will be Korean culture,” such as K-pop and local food, he said. The conservative Korean culture at the moment has mostly kept South Koreans from fully enjoying gambling. The country’s only “open” casino at which Koreans can gamble is in a remote ex-mining town three hours from Seoul. But the casino, operated by Kangwon Land Inc, earned 1.28 trillion won ($1.24 billion) in revenue last year, nearly equal the 1.37 trillion won earned in the country’s 16 smaller foreigner-only casinos. South Korea also faces potential competition from neighbouring Japan, which may open the country to casino gambling by 2020. “Many of the Koreans will be travelling into Japan to play the casinos and at that time, maybe the Korean government could be thinking of putting in an ‘open’ casino,” Choi said. Choi said Paradise City is not planned with the expectation that South Korea will eventually allow locals, but others say they see little chance the socially conservative country will ease the ban. The relatively small size of the planned resorts is also a drawback, said Seo Won-seok, a professor of hotel and tourism management at Kyung Hee University. “The integrated resorts planned for South Korea aren’t landmarks like Marina Bay Sands (in Singapore). These are small resorts that won’t be able to draw the crowd by their presence alone,” he said. Others are hoping he’s wrong. A consortium of Genting Singapore Plc and Landing International Development Ltd plans a $2.2 billion casino resort on Jeju Island, a southern tourist spot popular with Chinese visitors, although those plans have been slowed by local opposition. Global operators like Las Vegas Sands and Melco Crown have also expressed interest in South Korea, if locals are allowed to gamble. 1 US dollar = 1,033.50 Korean won Additional reporting by Farah Master; Editing by Tony Munroe and Matt Driskill Our Standards: The Thomson Reuters Trust Principles. All quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays. ",
    "title": "South Korea casino operator joins fray for Chinese high-rollers | Reuters",
    "url": "https://www.reuters.com/article/southkorea-gambling-paradise-idUSL4N0QA1BC20140806"
}