{
    "text": "In the young adult Korean show Record of Youth, when an aspiring actor named Sa Hye-jun asked his girlfriend Ahn Jeong-ha, a make-up artist, the permission to kiss her, the minds of many fans were blown. The male protagonist, played by Park Bo-gum, had asked for consent from the female lead, essayed by Park So-dam, star of the multiple Oscar-winning film Parasite. “Permission? In a K-drama?? I have tears of joy for K-dramas evolving so much,” noted a fan on the YouTube video of the scene. The high-school-ish yet toxic narrative of the opinionated girl falling for the bad boy with a heart of gold, like in the popular Boys Over Flowers, has given way to K-dramas like Run, that showed the romance between a retired athlete and his interpreter, and Hot Stove League where there is no romance between the lead protagonists. K-content has gone big across the globe in recent years, including in India, and Koreans believe it has a lot to do with the ability of the country to offer variety, track trends in the global market and revisit stereotypes. Visual effects artist Hayoung Jo said she tunes into K-dramas once or twice a year to “catch up with the trends and watch the most highlighted shows”. Jo, who moved from Siheung-si city, Geonggi-do province in South Korea to Toronto around seven years ago, likes these dramas because of the “cultural background”. “I feel more attached to the Korean culture than western culture and that makes me easily resonate with the characters in the drama scenes,” she added. According to Jo, K-dramas are undergoing some “good changes”. “For example, there was a prevailing idea that women should get married before their 30s in order to raise their kids, but now the female characters in K-dramas are mostly over 30 and more career-oriented compared to the woman in the ’90s-’00s, which is reflecting the idea of gender equality in Korean society,” the VFX artist, who has worked on the hit Disney Plus series The Mandalorian, said. K-drama lovers agree that there are certain tropes that have been done to death in the shows and one sub-genre that needs to go away is the ‘Cinderella’ story. Many hit series including Secret Garden, starring Ha Ji-won and Hyun Bin, and Coffee Prince, featuring Gong Yoo and Yoon Eun-hye, have used the fairytale as the outline in the past. “I am glad that K-dramas are trying new things other than Cinderella stories; they are too lame,” Jo added. Min Kim, a Toronto-based VFX artist who hails from Busan, said the usual 12-or 16-episode format makes for a crisp plot. “We can watch two episodes weekly as they drop. It is relaxing to watch a K-drama after work with my family. (The limited series format) makes the storyline quite intense,” the VFX artist, who has worked on the survival action drama Greenland and Amazon’s hit superhero series The Boys, said. Ga-yeon Kim, who hails from Seoul’s Gangnam district, said she was fed up with the strong female character stereotype in K-dramas where the woman may appear “headstrong and outspoken” but the show would use these personality traits to eventually fuel a romance. “I felt that K-dramas have rewarded females who are easily swayed and have punished or labelled the character as a bad person if they were confident in what is right for them. I think K-dramas should celebrate, humanise, and diversify the types of women by championing their success even if it exceeds the success of male characters without villainising them,” the Toronto-based elementary public school teacher told PTI. She, however, had a change of heart after her mother told her that there are “improvements” in the new dramas, such as It’s Ok To Not Be Okay and Kill Me Heal Me, shows that dealt with mental health issues and childhood trauma. “I find this to be great news because there are so many issues in Korea and around the world that need to be addressed such as mental health, equal rights, poverty, and etc.” With all things Korean — drama, cinema, music, beauty products, and food — going global, Ga-yeon Kim believes the reason behind the content gaining momentum is the competence of the Korean industry in studying and replicating what people have liked in the past. She added, “Korea is also great at innovating and adding on to these dramas, movies, and music. For instance, I hear that K-dramas and K-pop are adhering to current relatable problems faced by the younger audience, such as anxiety, depression, work-home balance, etc.” Jo said K-pop, through bands like BTS and Blackpink, and dramas had synergy effects on the rising interest in Korean content around the world. “If a K-drama gains popularity, people may also pay attention to K-pop and vice versa. As many people overseas noticed K-culture and its value, they are digging hidden gems too which never caught interest from people before,” she added. Asked what could be the contributing factors to the rising international interest in the country, BTS member Jung Kook told PTI last year, “We believe South Korean culture is very beautiful and attractive, which is portrayed through diverse contents such as movies, dramas, music, etc. As artists representing South Korea, we also want to share this with the rest of the world.” Beomgyu, a member of the Korean boy group TXT, said South Korea narrates “relatable stories” which makes them resonate around the world. “Wherever you may be or wherever you’re from, I think our shared experiences of living through these times together serve as the basis for stories that many people can relate to. I’d like to say that that’s the biggest reason why many people are resonating with our stories and culture now,” he told PTI in June 2021.  ",
    "title": "South Koreans decode the rising global popularity of K-dramas | Television News - The Indian Express",
    "datetime": "2021-08-03T21:27:25+05:30",
    "url": "https://indianexpress.com/article/entertainment/television/south-koreans-decode-the-rising-global-popularity-of-k-dramas-7436843/"
}