{
    "text": "Read The Diplomat, Know The Asia-Pacific Can Park breathe new life into a Korea-Mexico FTA? President Park Geun-hye and Mexican President Enrique Peña Nieto attending an official welcoming ceremony at the National Palace in Mexico City. After attending the 2016 Nuclear Security Summit on April 1 in Washington D.C., South Korean President Park Geun-hye and Mexican President Enrique Peña Nieto headed down to Mexico City to hold their second bilateral summit, albeit the first one hosted by one of the two countries. Before that, Park and Peña Nieto had met at the sidelines of the APEC Annual Summit in Bali, Indonesia, in October 2013. Unlike bilateral talks in Bali, however, where middle power diplomacy was strongly emphasized, the aggressive pursuit of economic diplomacy was at the core of South Korea’s agenda for the April 2-5 Korea-Mexico summit. Park’s state visit to Mexico comes exactly a year after her first official trip to Latin America, where she attended bilateral summits in Colombia, Peru, Chile, and Brazil. Each of these countries have seen their relations with Korea strengthened within the last decade, as reflected by the upgrading of the level of bilateral relations and the gradual expansion of cooperation to non-economic areas. Among these upgrades, the “Strategic Partnership for Common Prosperity in the 21st Century” subscribed by Korea and Mexico in 2005 was especially relevant, as it was the first of its kind in the region. Accordingly, in their recent summit Park and Peña Nieto vowed to give renewed influx to their strategic partnership, all the while emphasizing the importance of the two countries’ roles as leading actors in the Asia-Pacific region. Thus, while it was not the first time a Korean president visited Mexico (former president Lee Myung-bak was there twice, in 2010 and 2012), the 2016 summit may prove to be particularly important for Korea-Mexico relations. Further, their increasing cooperation on global issues in multilateral spaces such as APEC, the G20, or the United Nations, particularly so through their leadership of MIKTA, underscores the growing relevance of these middle powers’ partnership. During the summit, the Mexican president and other high level officials were keen to highlight such global aspects of the Mexico-Korea relationship, with Peña Nieto calling for closer bilateral cooperation “in order to successfully meet the challenges and opportunities of our time.” Park, however, while also referring to the Korea-Mexico middle powers’ partnership, clearly showed a greater preoccupation with advancing South Korea’s economic diplomacy agenda. It seems illustrative that even at the outset of the K-Soul cultural event held in Mexico’s Metropolitan Theater on April 3, President Park ultimately highlighted the economic potential of cultural cooperation under the banner of so-called “creative industries.” Accompanied in her trip by a delegation representing about 150 Korean businesses, Park actively called for resuming FTA negotiations in her address to the Korea-Mexico Business Forum and in the joint statement released with her Mexican counterpart on April 4. Get briefed on the story of the week, and developing stories to watch across the Asia-Pacific. Working-level talks for a Korea-Mexico FTA have been in place since 2005, and official negotiations launched in 2007, but the talks stalled in 2008, facing strong opposition from Mexico’s metallurgical and automobile industries and suffering from the setbacks of the global financial crisis. Moreover, at the time, Mexico was strongly focused on advancing regional free trade mechanisms, such as the Trans-Pacific Partnership agreement. But with the TPP now in its ratification stage, the Mexican government has expressed a renewed interest in a bilateral FTA with South Korea, while also vowing to support Korea’s own entry into the TPP. Enjoying this article? Click here to subscribe for full access. As a result, in their joint media statement, Park and Peña Nieto announced the establishment of a working-level team set to discuss the resumption of negotiations as soon as next October. They also oversaw the signing of 34 Memorandums of Understanding (MOUs), of which 29 cover economic sectors such as industry and energy, infrastructure, and high-value industries such as ICTs and health and medical industries. Other agreements are expected to expand cooperation in—seemingly—non-economic areas as education, culture, and sports. As of last year, Mexico had become Korea’s largest trading partner in Latin America, while Korea stood as Mexico’s sixth trading partner and its second largest source of Asian foreign direct investment (Japan being the first). Moreover, trade between both countries has expanded by about 12 times in the last 20 years, going from $1.2 billion in 1993 to about $14.4 billion in 2015. An FTA would undoubtedly further add to those figures. Korea is strongly interested in investing in energy and infrastructure, which are among the key sectors prioritized by the economic reform plans pushed forward by Peña Nieto’s government. However, despite strong political commitment on both sides, negotiations for a Korea-Mexico FTA are likely to be met with significant resistance, particularly on the Mexican side. As was the case in 2008, while the Mexican electronic, agricultural, and food sectors favor an FTA with Korea, metallurgical and automobile industries remain skeptical about the benefits of such an agreement. Further, concerns have been recurrently voiced about the asymmetrical nature of Korea-Mexico’s trade ties, which has seen negative figures for Mexico since the 1990s. Similar concerns have been expressed by other Latin American countries which have subscribed or are currently negotiating free-trade agreements with Korea. A case in point in this matter is the ongoing dispute between Kia Motors and the local government in the northern Mexican state of Nuevo Leon, regarding the incentives offered to the Korean company for establishing an assembly plant in that region, which is set to start operations from next May. Under the original agreement, about $618 million were offered to the company in tax breaks, amounting to 28 percent of the total investment by Kia Motors. However, the new governor of Nuevo Leon has been pushing for a renegotiation of the contract (signed by the previous administration), arguing that the incentives greatly surpass the tax incentives limit of 5 percent of the total investment as per Nuevo Leon’s Investment and Employment Promotion Law. Although this particular dispute may well be colored by domestic political rifts in Mexico, it further underscores prevalent concerns about the unbalanced nature of trade between the two countries. Perhaps aiming to ease this perception, Park repeatedly pointed at the opportunities that an FTA would represent for both countries. In an interview with Mexico’s leading daily El Universal, Park stated that if signed, a free trade agreement “could create a win-win situation, as it could open a new gateway in Northeast Asia for Mexico, while South Korea can expand its access to North, Central and South America.” All-in-all, despite Korea’s undeniable upper-hand in the relation, Mexico can definitely benefit from expanded trade with Korea not only in terms of exports but also FDI, job creation, technology-transfer and knowledge-sharing, and further access to Asian markets. For Korea, the resumption of FTA negotiations with Mexico would further add to the on-going trend of deeper economic relations with Latin America. Such a win is likely to be later framed by Korean foreign policymakers as a victory in the country’s network-building for middle power diplomacy. But in reality, it underscores the true nature of Korea’s outreach to Latin America: all-out economic diplomacy. Anaïs Faure holds a Master in Korean Studies from the Academy of Korean Studies and a Master in Development Policy from the KDI School of Public Policy and Management, both in Korea. Her main research interests include Korea-Latin America relations and Korea’s role in international development cooperation.          ",
    "title": "South Korea’s All-Out Economic Diplomacy in Mexico – The Diplomat",
    "url": "https://thediplomat.com/2016/04/south-koreas-all-out-economic-diplomacy-in-mexico/"
}