{
    "text": "The country's notoriously unregulated entertainment industry will have to guarantee minors the right to sleep, learn and say no to being sexualized. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tLee Hyo-won A new law introduced in South Korea will forbid underage singers and actors from taking part in overnight performances and productions or from being coerced into sexualized portrayals. A bill passed by the Korean National Assembly in January will go into legal effect July 29, following the six-month notification period, with the aim of improving working conditions in the local entertainment sector. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news Korea’s showbiz is notoriously improvisational and unregulated. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tMatt Rife's 'Natural Selection' Comedy Special Premiere Date Announced\t\t\n\t\n\n\n\n\t07/08/2014 In-demand K-pop stars — many of whom are teenage “idols” — have been known to rehearse and perform without sleep, while Korean TV dramas are notorious for going into production without a complete script, providing actors their lines on a day-to-day basis before shooting scenes, often overnight. On film sets, actors are often exposed to dangers unthinkable in other national entertainment industries, as many performers are encouraged to carry out stunts themselves, which the Korean government partially addressed recently by financing ambulances for action projects. Under the new law, underage stars will be guaranteed the basic rights to learn, rest and sleep, though exceptions can be made for projects requiring long-distance travel. Weekly working hours for children under 15 are not to exceed 35 hours, while those for minors over 15 (aged 15-18) are limited to 40 hours. Minors cannot work between 10 p.m. and 6 a.m., unless their guardians give consent. It will also be illegal to coerce minors into wearing revealing stage costumes or dancing sexually suggestive choreography routines. Breaking the law will result in a recommendation of correction from the culture ministry, and failure to comply will yield a fine of roughly $10,000. In addition, one can face up to five years in prison for forcing underage talent to act out rape or sexual harassment scenes. Onlookers have voiced concern, for example, about 14-year-old actress Kim Sae-ron’s engaging yet disconcerting performance in the child abuse drama “A Girl at My Door,” which premiered earlier this year at Cannes. One may also face up to two years in prison or a $10,000 fine for employing minors in commercial endorsements for drugs or venues and items deemed harmful for juveniles.  Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "title": "South Korean Law to Protect Young K-Pop Stars From Sexualization, Overwork – Billboard",
    "datetime": "2014-07-08T13:17:50+00:00",
    "url": "https://www.billboard.com/music/music-news/south-korean-law-to-protect-young-k-pop-stars-from-sexualization-6150361/"
}