{
    "text": "Half of Forestella’s debut album Evolution features tracks closer to K-pop style than the classical crossover music that made them famous, in an attempt to widen their appeal. But what will the hard-core crossover fans think? Male quartet Forestella, winner of South Korea’s classical crossover audition programme Phantom Singer Season 2 last year, have released their debut album, Evolution. While the four singers initially rose to fame performing classical numbers, the album finds them moving in a more K-pop direction, thanks to production work by the same team that has worked with South Korean idols such as BTS and Twice. At a press conference held to announce the release, the four singers shared their excitement about their career and their ambitions to hit the Billboard charts in the US. “I think this is just our first step toward Billboard,” said tenor and group leader Cho Min-gyu. The quartet consists of two professional opera singers (Cho and bass Ko Woo-rim), one pop singer (Bae Doo-hoon) and one amateur singer, former chemist Kang Hyung-ho, who used to work at a research lab. The album consists of remixes of songs that were performed during the audition show as well as new songs specially composed for the group. The song You Are My Star was composed by renowned production team ZigZag Note, which has worked with big-name K-pop acts such as BTS, B1A4, Twice, BoA and Apink. Hard-core crossover fans, however, may be disappointed at their selection because half of the songs on the 13-track album are closer to K-pop than classical crossover music. “Instead of offering more of the type of songs we performed on Phantom Singer, we wanted to try new things,” Bae said, when asked about the K-pop style songs on the album. “We thought it would be worthwhile just to challenge ourselves and enjoy the process. “It wasn’t our initial plan to go in the direction of K-pop. We just wanted to sing songs in our style. In the process, we leaned toward popular tastes so that more people can enjoy our music.” Cho said the group mulled over their style a lot. “This album tends to be more of a K-pop style but I think it’s because it’s our first album. That’s why it’s called Evolution. We were struggling between artistry and mass appeal, but we wanted to have everything on the album. So we thought why not? Because it’s meant to be crossover,” he said. “Every song is different but there’s one single thread: the guitar. Every song has the guitar and it’s what holds the album together.” Kang added that trying new things is precisely what Forestella is about. “If we did something that was the same as what we did before, that wouldn’t be Forestella. So the concept became K-pop this time, which means it’s very likely that our next album will be far from K-pop. The fact that our two opera singers are trying K-pop style is in itself an innovation,” he said. Forestella are inevitably being compared with their predecessor and fellow crossover group Forte di Quattro, who won the first season of Phantom Singer and gained enormous popularity. Their nationwide tours rapidly sold out and now they are also eyeing overseas markets, with a concert scheduled in Japan for April 13. Read the original article in  The Korea Times ",
    "title": "South Korean classical quartet Forestella go K-pop style as they target US and local Korean markets | South China Morning Post",
    "datetime": "2018-03-20T20:01:24+08:00",
    "url": "https://www.scmp.com/culture/music/article/2137984/south-korean-classical-quartet-forestella-go-k-pop-style-they-target"
}