{
    "text": "SPC Group announced on Aug. 3 that its five products and one brand have been chosen as winners at Red Dot Design Award 2020. The group had 6 winners at the world-renowned design competition in 2019. The group's product design award winners included Paris Baguette's Traditional Gift Package and Pocket Sand Package, and SPC Samlip's Mouth Watering Bakery, Bizeun and Jeju Tart Package. The award winner in the brand design category was \"City Deli,\" a fine casual snack store brand. Paris Baguette's Traditional Gift Package is a modern reinterpretation of the beauty of traditional Korean refreshments such as Yanggaeng (sweetened and jellied bean paste) and Hwagwaja (Korean confections). It drew a favorable evaluation with its pastel-toned color and gold foil typefaces with a subtly embossed part. A major prize went to Pocket Sand Package which intuitively and tactfully expresses the characteristics of its ingredients with a graphic design that makes consumers feel as if strawberry and blueberry jam flew on the package. SPC Samlip visually incorporates differentiated raw materials and manufacturing methods in the package of its premium bakery brand Mouth Watering Bakery. Its retro-style typefaces and restrained graphic design also received good reviews. Jeju Premium Tart Gift shows emotional illustrations of Jeju's clean nature and specialties including green tea and tangerines. Pure Gift Set of SPC Samlip's rice cake cafe brand Bizeun was praised for expressing the unique identity of the Korean people through a pure white package symbolizing white porcelain and a Korean topcoat. City Deli, a fine casual snack store brand launched by SPC Samlip in 2019, won a major prize in the brand design category. City Deli’s brand design was created in collaboration with Britain's world-renowned design studio, Charlie Smith Design. In particular, the judges said that the brand design has a wonderful harmony among the color neon green which symbolizes freshness, urban straight lines and the logo and fonts expressing a skyline. SPC Group also won six awards at the Red Dot Awards 2019 in 2019. In the same year, the business group became a triple crown winner at the German iF Awards, one of the world's top three design awards, with Dunkin Donuts' DD Universe, No: Lid,\" a natural decomposition paper cup that does not require a straw, and a Baskin Robbins package, which collaborated with pop artist duo \"Claig & Karl.\" Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "SPC Group's 5 Products and 1 Brand Chosen as Winners of Red Dot Design Award 2020 - Businesskorea",
    "datetime": "2020-08-04T11:29:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=49988"
}