{
    "text": "Searching for your content... In-Language News Contact Us 888-776-0942\n\nfrom 8 AM - 10 PM ET Special K Encourages Women to Fight Fat Talk News provided by 09 Dec, 2013, 08:00 ET Share this article BATTLE CREEK, Mich., Dec. 9, 2013 /PRNewswire/ -- As women strive to get back on track this New Year, Special K has partnered with world-renowned supermodel and actress Tyra Banks to help shift the weight management conversation to a more positive one. Special K® has shown that positivity is important to weight management success1 but, unfortunately, 93 percent of women Fat Talk.2 Fat Talk is contagious – and it's weighing women down. Whether sparked by an unflattering photo or shopping for jeans, these negative comments women make about their own bodies and others are a destructive and significant barrier to weight-management success. \"I know firsthand how much criticizing your body negatively affects self-esteem, but as a role model, I try to maintain a positive attitude and healthy approach to managing my weight,\" says Banks. \"That's why I'm excited to partner with Special K to help empower women to not only feel confident about their bodies, but also to remove those negative thoughts and show them how to employ tips and tricks to make their least liked physical attributes look better.\" \"I know firsthand how much criticizing your body negatively affects self-esteem, but as a role model, I try to maintain a positive attitude and healthy approach to managing my weight,\" says Banks. \"That's why I'm excited to partner with Special K to help empower women to not only feel confident about their bodies, but also to remove those negative thoughts and show them how to employ tips and tricks to make their least liked physical attributes look better.\" As a partner to women along their weight management journey, Special K offers many delicious, guilt-free products, including snack and breakfast options that provide protein and fiber. Women can also visit www.FightFatTalk.com to help SHHHHut down Fat Talk (#FightFatTalk). Fat Talk is so embedded in everyday conversations that it has become a barrier to managing weight. According to a recent survey, nearly half of women say that they engage in Fat Talk because they feel it's better to criticize themselves before others do so. Interestingly, 63% of women surveyed said when they notice themselves or their friends engaging in Fat Talk, they don't try to stop or change the conversation – and 62% of women say they feel compelled to engage in Fat Talk about themselves when they hear other women doing so. 3 To help women with their weight management journey this New Year, Special K offers a variety of delicious food options and is inviting them to participate in the Special K Challenge, an easy, effective way for women to kick-start their weight-management plan in 2014. For more information about the Special K Challenge, visit www.SpecialK.com. Suggested Tweets: About Kellogg CompanyAt Kellogg Company (NYSE: K), we are driven to enrich and delight the world through foods and brands that matter. With 2012 sales of $14.2 billion, Kellogg is the world's leading cereal company; second largest producer of cookies, crackers and savory snacks; and a leading North American frozen foods company. Every day, our well-loved brands nourish families so they can flourish and thrive. These brands include Kellogg's®, Keebler®, Special K®, Pringles®, Frosted Flakes®, Pop-Tarts®, Corn Flakes®, Rice Krispies®, Kashi®, Cheez-It®, Eggo®, Coco Pops®, Mini-Wheats®, and many more. Because we believe in the power of breakfast, we focus our philanthropic efforts on global hunger relief through our Breakfasts for Better Days™ initiative, providing 1 billion servings of cereal and snacks - more than half of which are breakfast - to children and families in need by the end of 2016. To learn more about our responsible business leadership, foods that delight and how we strive to make a difference in our communities around the world, visit www.kelloggcompany.com. 1 Edelman Berland Special K Study \"Positivity and Weight Management: A Look at the Gains,\" Sept. 2012 2 Psychology of Women Quarterly, March 2011 vol. 35 no. 1 18-28 3 Impulse Research Corp, Kellogg's Special K Resolution Fat Talk Survey 2013 Image with caption: \"Special K\". Image available at: http://photos.prnewswire.com/prnh/20131209/MM28829-a Image with caption: \"Special K Resolution Fat Talk Survey Infographic\". Image available at: http://photos.prnewswire.com/prnh/20131209/MM28829-INFO-b Image with caption: \"Tyra Banks Shhhh\". Image available at: http://photos.prnewswire.com/prnh/20131209/MM28829-c SOURCE Kellogg Company Kellogg Company (NYSE: K) announced that 2023 third quarter financial results, which includes financial results for the period ended September 30,... With traditional meat consumers making up almost half of new plant-based protein buyers, MorningStar Farms' latest innovation is sure to satisfy... Health Care & Hospitals Food & Beverages Household, Consumer & Cosmetics Entertainment Sign up to get PRN’s top stories and curated news delivered to your inbox weekly!  ",
    "title": "Special K® Partners With Tyra Banks To Help Women Achieve Weight Management Goals This New Year",
    "url": "https://www.prnewswire.com/news-releases/special-k-partners-with-tyra-banks-to-help-women-achieve-weight-management-goals-this-new-year-235040781.html"
}