{
    "text": "  Ssangyong Engineering & Construction (E&C) won three overseas construction projects valued at about 330 billion won (US$279.42 million) in Dubai, Singapore and Equatorial Guinea at the same time. The company won a US$170 million (200.77 billion won) deal from the Investment Corporation of Dubai (ICD) for constructing an urban center in Deira, the coastal area of Dubai. This is the first phase of the district 3. The project, which is directly financed and developed by the ICD, the majority stake owner of Ssangyong E&C, is to divide Deira into two stages and transform it into a modern tourist complex. Deira is the old downtown area and the region in where Gold Souk, the largest gold market in the Middle East, is located. As the first project in the first phase of the US$1 billion (1.18 trillion won) development scheme, Ssangyong E&C will build a 14-story hotel with the total floor area of 161,859 square meters, two 16-story and 14-story residential buildings and a 10-story office building in the district 3. The company also reached a deal with City Developments Limited, which is under Singapore’s HongLeong Group, one of the largest private developers, to build the condominium ForestWoods at US$82 million (968.42 trilion won). Ssangyong E&C will be in charge of design and construction of seven condominiums with12-stories with 2 levels of ground floors, which can hold 519 households in total, near the Serangoon MRT station, a residential town located in the North-East Region of Singapore. The company also obtained an order to participate in a government-initiated construction project worth 30 billion won (US$25.4 million) in Equatorial Guinea of Africa. Since 2011, it has bagged 14 project deals worth a total of US$500 million (590.5 billion won) in the country alone. Meanwhile, Ssangyong E&C has so far carried out 150 construction projects in 20 countries, amounting to US$10.2 billion (12.05 trillion won). It currently runs five corporations and 14 overseas offices around the world, and a total of 18 projects worth US$3 billion (3.54 trillion won) are underway in eight countries.  Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Ssangyong E&C Wins$280M Deals in Dubai, Singapore, Equatorial Guinea - Businesskorea",
    "datetime": "2016-11-25T03:15:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=16592"
}