{
    "text": "In 2013, The Times documented part of the “Station to Station” art show. Here, DJ Dan Deacon performs at the “Station to Station” downtown L.A. event. The morning after Station to Station’s desert happening in Barstow, project mastermind Doug Aitken looked a bit weary -- but blissfully so. Over breakfast in a motel lobby -- a tad scruffy and sunburned from nearly three weeks on the rails leading a band of artists, musicians and other creative types on a cross-country art show -- Aitken was still basking in the glow of the prior evening’s success. It had been a happening in the warm desert winds, infused with the scent of beer and grilled bratwurst, with glowing art yurts and performances by No Age, Lucky Dragons, Cold Cave and Cat Power. Beck headlined, and artist Peter Coffin launched an aluminum UFO, with 3,000 multicolored LED lights, into the night sky. On Wednesday, across the Hampton Inn’s lobby breakfast buffet, other equally scruffy train passengers could be heard muttering sentence fragments -- in wowed intonations -- containing the words “UFO” and “awesome.” CHEATSHEET: Fall arts preview 2013 “There was this quality to it, this sense of oneness and connectedness at once,” said Aitken, who rose at dawn that morning to watch the sun rise by the motel pool. “The night almost had a molecular quality.” On the shuttle to the train, the Lucky Dragons’ Sarah Rara and Luke Fischbeck were more spry, as they’d just joined the art caravan in Barstow. Rara said the evening had not been an anomaly to her. “We see this kind of thing a lot in Europe,” she said. “Festivals where art and music mix more. But the location -- [Southern] California in the desert with this UFO at the end -- was amazing.” Do the Lucky Dragons like trains, seeing as that’s what’s in store for the day? “I love trains!” they both cooed in unison, sitting upright and beaming. “But I like walking better,” Rara said. “Yeah,” agreed Fischbeck. “It would have been amazing if they’d gone cross-country on foot instead. And, like, sponsored by a shoe company.” The art train left Barstow completely devoid of ceremony. Luggage was routinely tossed into the storage car and hazy, happy passengers climbed aboard and settled into the train’s distinctly different compartments – the cozy, stylized Levis car, with its furry white seat padding and New Mexican-inspired blankets; the chipper and more bustling dining car adorned with brightly colored Jorge Pardo-created place mats; the more austere but awe-inspiring, completely glassed-in “Superdome,” showcasing the morphing landscape whizzing by. PHOTOS: Arts and culture in pictures by The Times As the train cut through the desert, “Station” music producer Justin Stanley tweaked a squeaky, synthesized choo-choo track in the recording car. Over the course of Aitken’s art odyssey, several bands have recorded or created original music here, he said -- Thurston Moore, Ariel Pink, Cold Cave, Eleanor Friedberger and John Maloney, among them. On Wednesday, it was Lucky Dragons’ turn. Wearing headphones, Rara and Fischbeck sat silently, mono-focused, adjusting knobs and switches on their instruments, getting ready to make their music. “No band has had a preconceived idea of what they wanted to do,” Stanley said. “But they all seem inspired by the space and the traffic that comes through here. Whereas in a normal recording situation, you’re locked in a room. So there have been a few train-inspired songs that have come out of this.” In the background, a drum-like sculpture by artist Olafur Eliasson rattled and swayed. An ink-stained ball rolled across its circular, white surface, leaving scratchy, black trails that collectively make up a kinetic map of the journey. Cat Power, whose real name is Chan Marshall, sat patiently off to the side, waiting her turn to record. She entertained herself by picking through a box of about a dozen silver and turquoise rings she’d bought when the train passed through Winslow, Ariz. Power has been with the train a long time, she said. “Yeah, it was 1932,” she joked in an old-timey voice. “The dust bowl, had a radio show, rolled into town ...” She ran her hands through her short, choppy blond hair in mock exasperation, her fingers now stacked with all the chunky rings in her box. “No, seriously, I came on the train in Santa Fe. Last night was my third show. But I can’t play Los Angeles because I have to get home, I have sooo much to do.” Most everyone on the trip may be far from home and sleep-deprived, but no one is suffering for lack of anything to eat. Independent chef Leif Hedendal, who has worked with Chez Panisse’s Alice Waters, was busy roasting pans of cauliflower and squash for the afternoon’s lunch. How has it been going for the sole chef on a train packed with artists and musicians? “It’s been crazy hectic,” Hedendal said. “The cooking part, on the train while it’s moving, is crazy -- but the whole trip itself has been super-fun!” As the train passed through farmland outside of Hesperia, and the landscape outside morphed from a blur of dusty brown to a more lush green, Tony Bennett’s album “I Wanna Be Around” filled the dining car. Journalists aboard for the day snapped photos through the glimmering, sunlit windows, members of Aitken’s “content team” reviewed photos and video of the previous night’s performance on their smartphones, and some performers -- such as auctioneer Tony Goodman and whip-cracker Chris Camp, who have appeared at every Station to Station stop so far with auctioneer Denise Shearin -- reviewed their acts. “Our act is rhythmic and, for me, climactic,” Goodman said. “Yeah, but if I hear one more whip pun, I’m gonna snap!” Camp quipped, nailing a pun about a pun. In the recording car, as the train sped closer and closer to Los Angeles, Aitken took care of business, adding his name to the other artists’ signatures on Station to Station posters that will soon be available on Crowdrise.com. Proceeds from the fundraising effort will be split evenly among nine cultural institutions, the Los Angeles County Museum of Art, New York’s MoMa PS1 and the San Francisco Museum of Modern Art among them, to support nontraditional art in museums. The nine individualized cars of the art train -- each a rollicking capsule unto itself brimming with quirky stories, new friendships and creative collaborations at various stages -- pulled into Union Station midafternoon. As the downtown skyline rolled into view, in the recording car, the spacey, experimental track that Lucky Dragons had created (in private, to minimize foot traffic through the car) reverberated from the speakers. Interspersed throughout the song was the previously recorded rumble and spark of the train and its tracks. A fitting end to the day’s journey. ALSO: Station to Station: Beck in Barstow For LACMA’s ‘old’ buildings, no time like the present Wilshire and LACMA are a new world for Peter Zumthor Twitter/@debvankin  It's a date Get our L.A. Goes Out newsletter, with the week's best events, to help you explore and experience our city. You may occasionally receive promotional content from the Los Angeles Times. Follow Us Deborah Vankin is an arts and culture writer for the Los Angeles Times. In what’s never a desk job, she has live-blogged her journey across Los Angeles with the L.A. County Museum of Art’s “big rock,” scaled downtown mural scaffolding with street artist Shepard Fairey, navigated the 101 freeway tracking the 1984 Olympic mural restorations and ridden Doug Aitken’s art train through the Barstow desert. Her award-winning interviews and profiles unearth the trends, issues and personalities in L.A.’s arts scene. Her work as a writer and editor has also appeared in Variety, LA Weekly and the New York Times, among other places. Originally from Philadelphia, she’s the author of the graphic novel “Poseurs.” Television Oct. 25, 2023 Image Oct. 25, 2023 Music Oct. 25, 2023 Music Oct. 25, 2023 Entertainment & Arts Oct. 25, 2023 Company Town Oct. 25, 2023 Television Oct. 25, 2023 Movies Oct. 25, 2023 Music Oct. 25, 2023 Subscribe for unlimited accessSite Map Follow Us MORE FROM THE L.A. TIMES ",
    "title": "Station to Station: Inside the trip from Barstow to L.A. - Los Angeles Times",
    "datetime": "2013-09-26T13:00:00",
    "url": "https://www.latimes.com/entertainment/arts/culture/la-et-cm-station-to-station-20130925-story.html"
}