{
    "text": "The British comedian talks Trump, marriage equality and why he’s telling golliwog jokes in his show at the Melbourne international comedy festival Stephen K Amos is back in Australia after 12 months of touring the globe and his new show, World Famous, takes aim at the nationalism and casual racism he encountered over an especially strange year. In the midst of his run at the Melbourne international comedy festival, Amos shares his thoughts on Pauline Hanson’s return, the continued fight over the Racial Discrimination Act and marriage equality, the significance of a British black comedian making Australia laugh at – and re-examine – its national crises, and the chaos he leaves in his wake. Simon Miraudo: Your new show, World Famous, is all about spending a year travelling the world and performing comedy. But with everything that’s gone on over the past year has the world even been in the mood for comedy? What did you find on your travels? Stephen K Amos: Ah, well that’s the oxymoron, if you like, of the show, because the title in itself is a bit of an anomaly. I have indeed travelled around the world but it’s the state of the world itself that is going to be the subject of the show. Some of the places you toured include England, Scotland, Greece, Germany. Do you ever wonder if global chaos is directly following your tour schedule? [Laughs] I think I do a show to leave people with humour and fun times and laughter but instead it’s leaving a path of destruction. I don’t think [Cyclone] Debbie’s got anything on me. Your show does deal with all these things that have gone down all around the world. You’ve got Brexit, Donald Trump, the rise of nationalism. In your time as a touring comedian, have you noticed the world changing? Is this a new world we’re in, or is the drama just more apparent today? You know, that’s a really good question. I’ve noticed the world changing only in the last sort of five or six years, and I put it solely down to the advent of social media, and the fact that we can now literally hear and see other people’s opinions. The fear-mongering has started. With the whole Brexit thing in the UK, nobody saw it coming. With the whole Trump thing, nobody saw it coming. But what it has revealed is that there has been a bubbling undercurrent of fear and hysteria and fake news. The whole refugee crisis dominated people’s consciousness; the terrorism, that dominated the consciousness. There’s an undercurrent of fear and people are tapping into that fear and it’s divided the whole world. It’s extraordinary. Do you find people are coming to your show as a sort of haven of sanity? To talk about these sorts of things that are very distressing, but in an amusing manner? Or do you get audiences who reject some of the things you’re digging into? Well, I would like to think that the audience that comes to my show are people from different walks of life, different political persuasions, different backgrounds. There’s actually no point me doing my style of comedy with a room full of people who simply agree with me. If I at least make someone think, or put a spin on something that might change their point of view, that is good. I do my show for laughs, not necessarily applause breaks, if that makes sense? You know, people sitting there going, “Yes, he’s right. Yes! Ra-ra-ra.” I want you to laugh and then I pull the rug from under your feet by making you think about quite important points. Did you get a chance to go to America over the last couple of years, as part of your tour? I’ve been to America. I’ve been all across Europe. And the weirdest thing about going to America and going to Europe and coming to Australia, particularly before last year anyway, was how bizarre your political culture is. I’d been laughing at you all from a kind of higher ground level, if you will. And then we had the Brexit thing. Now the joke’s on us. It’s really, really strange to have the shoe on the other foot. But it’s also quite enlightening. Your new show also looks at freedom of speech. I’m not sure if you’re aware, but in Australia at the moment, there’s this ongoing debate over the Racial Discrimination Act. I am fully aware. [Laughs] [Laughs] OK, so you’ve been to Australia many times, and you’ve travelled to other countries. Would you say Australia has less free speech than other nations? I think the problem may be because there used to be this notion that Australia was just this melting pot, and everybody and anyone could come in. Therefore, everyone is a bit laid back and can take a joke. That whole notion of, “Oh, you can say what you like here.” However, because of the rise of the refugee crisis and the fact that not everyone can come here, the whole mood and attitude has changed. So, you can’t say anything you like anymore. Some people say it’s [political correctness] gone mad. Now, we all know when PC has gone mad; you know, [censoring] Baa Baa Black Sheep, blackboard, etc. If you say “PC gone mad” because you can’t say what you’d like any more, then what is it you wanted to say that you can’t say any more? And ask yourself if that’s OK. It’s like this casual racism – not just in Australia but in a global sense – is starting to evolve into more blatant racism; more emboldened racism. But you’re in the rare profession where you get to be up close and personal with people from all over the globe. On the granular level, are people becoming more racist, do you find? More emboldened? When you have the undercurrent of fear, when you have people like Pauline Hanson being an elected politician … 20 years ago she was complaining about all the Asians who are bombarding these lands. Twenty years later, it’s now the Muslims who are bombarding the lands and the refugees. Will it ever end? And that kind of legitimises people going, “Yeah, the country is full.” The country isn’t full. That’s a fact. And also, you need to ask yourself, “Where did you come from? Where were the protests when you and your family arrived here?” These things happen in cycles and, as long as you’re blaming somebody else, you’re not looking at yourself. My thing is compassion. Years ago, a lot of Jewish refugees were fleeing Europe, but were being taken into various countries, which is obviously a good thing. Fast forward all these years, some of these refugees are now Muslims, but that’s apparently a problem, because of a minority who are claiming atrocities around the world, some of which may not even be committed by someone with affiliation to said organisation, as you recently found out with what had happened in London [the Westminster attack in March], which at the time was claimed to have been an Isis-orchestrated event. And then, you know, we found out days later he’s got no ties with Isis or they can’t find any. Before we found this news out, already all over social media was speculation and abuse; that horrible picture of this woman with a hijab on and on her telephone that went viral. People were going, “Look at her, offensive woman who doesn’t care.” All sorts of things. And it’s really quite sad because communication is the key. That’s what we should be doing: talking. That’s probably why we invented all these social media forums but each one that gets invented gets soon taken down by stupid people talking absolute nonsense. Do you ever get homesick when these scary things happen all around the world? Do you ever wish, “I don’t want to be touring right now,” or, “I don’t want to be away doing my comedy; I just want to go home and be in my safe space for a bit”? Do you know what though? That’s interesting, again. No, is my answer. I do a joke literally about that subject. No, because I think to have that safe space and to have that fear is falling into the exact thing we should be pulling away from. When I do my shows, people come up to me or I hear things from people after the show: “My dad’s never seen you before. He thought you were really great. He was surprised to learn that you were gay.” That kind of thing fills me with joy, because in my mind I like to think I’ve changed someone’s perception – because I’m pretty sure if the person didn’t bring his dad to the show, he wouldn’t have chosen to go on his own. Also in the show I am tackling casual racism because I talk about things people have said to me or things I’ve witnessed, and I’m throwing it out there in your face. I’m doing a big section on golliwogs, which came off the back of a story I heard that happened in Toowoomba. There was a Christmas display where a shop decided, under the words “White Christmas”, to feature five golliwogs. Did you hear that story? No, I hadn’t heard that one. Oh, please, Google that story. It’s extraordinary. I started trying [this bit] out in Adelaide and the audience would literally flinch when I mentioned the word golliwog. But because of the demographic of my audience, I was 99% sure there are people in that audience who have a golliwog or had a golliwog or don’t see the connotations. So, my little section, which, first and foremost, is funny, is also quite informative, and hopefully will make people think. What keeps bringing you back to Australia, specifically? What do you get out of these Australian shows compared with other places? This is probably a hard thing to kind of stomach or put into words. Basically, the connection between the UK and Australia is very, very obvious, very apparent. Australia, in my lifetime and my parents’, had a policy of making Australia white, if you will. So coming here as a British black comedian, knowing the history of this place and how the Indigenous people have been treated, historically, coming out here and doing the jokes and the subjects I tackle to the audience who are coming to my shows, as one of the few black – British or international – acts who come here is quite important to me. Almost like a sense of rebellion? I think that’s a bit of a harsh word because the audiences here have been very, very good, in terms of supporting what I do. They like what I do. And, like I say, I do it for the jokes but there is also an undercurrent of stuff going through. For example in the past I’ve talked about Coon cheese, I’ve talked about the Chicos jelly babies, or whatever they’re called. It’s all done with a glint in the eye, but there’s a real message going through there. Whenever you come back, are you surprised that marriage equality still isn’t a thing here? I am genuinely surprised and I’ll tell you why I’m surprised: because there’s something called the court of public opinion. When you have something like Mardi Gras, which is the biggest type of parade of its kind in the world, bar none, and not just a parade itself but a week before the parade – yet, that doesn’t sway the government to think public opinion is really on the side of this? It doesn’t make sense, and I don’t get that some people in power are worried about the conservative right or the Christian movement. When that poor young man got punched in the head and died of a single blow, instantly they changed the lockout laws of Sydney and kind of ruined the club scene, if you will. If that can happen that quickly, just on one incident, yet they completely ignore thousands and thousands of people who are showing support for the LGBT community and for marriage equality … it just doesn’t make any sense. This interview has been edited and condensed for clarity Stephen K Amos plays the Melbourne international comedy festival until 23 April. He plays the Sydney comedy festival from 28 April to 30 April and the Perth comedy festival from 4 May to 7 May. He can also be seen in Hobart on 22 April ",
    "title": "Stephen K Amos: 'I want you to laugh and then I pull the rug from under your feet' | Stephen K Amos | The Guardian",
    "datetime": "2017-04-04T00:41:03.000Z",
    "url": "https://www.theguardian.com/stage/2017/apr/04/stephen-k-amos-i-want-you-to-laugh-and-then-i-pull-the-rug-from-under-your-feet"
}