{
    "text": "Writers overwhelmingly use Orwell's novel to describe the surveillance state—which makes it easy to forget who's really oppressed today. As any intelligence operative knows, isolated facts don't tell you much. If some random person mentions a bomb somewhere on the Internet, is that a threat? A joke? A mistake?  To understand data you need a context and a narrative. You need to be able to put it in a story. So it makes sense that, in trying to understand the intelligence community itself, journalists and reporters use stories too. The PEN American Center, a group that works to advance literature and freedom expression, just released a study looking at the metaphors reporters used to explain the revelations about NSA spying in June 2013. Examining the work of 105 authors and 60 news outlets over two months, PEN found that journalists most often used metaphors of collecting (9.31 percent), but other approaches included nautical metaphors  (tentacles, trawling, leviathan), war metaphors (blitz, invade), and metaphors of authoritarianism (totalitarian, police state, Nazi.) PEN also found that journalists used literary analogies to try to explain NSA surveillance. Or rather, they used one literary analogy. George Orwell's 1984 was the only work referenced. Orwell's ubiquity is not exactly a surprise—Rebecca Rosen wrote about how central 1984 is to these discussions here at The Atlantic last June. Still, the fact that 1984 is the only book PEN could find cited shows a striking lack of imagination. To paraphrase a quote by Benjamin Cardozo that the PEN site references, the use of Orwell seems, in this case, not to liberate thought, but to enslave it. How does Orwell enslave thought? Rosen mentions legal scholar Daniel J. Solove, who has argued that focusing on Orwell means that we center surveillance as a problem rather than the \"inscrutable\" bureaucracy that grows up to process information and make decisions about citizens in secret. Solove suggests that Kafka's The Trial would be a better touchstone. You many not care if some computer recorded which website you just visited, but finding yourself on a no-fly list for some unknown reason can be a nightmare. Perhaps a more central problem with using Orwell, though, is that Orwell imagined not just a totalitarian state, but a totalizing one. The Party in 1984 controls everything and watches everyone. People have no rights, no power—even language and metaphors themselves are officially vetted by the state machinery. This isn't the world we live in, and, as Solove says, it's not the world we're \"heading toward\" either. Most people, most of the time, are not directly confronted with a police state. That \"most people\" is, I think, crucial. There are, after all, some citizens who are watched and controlled in a systematic manner. Our massive prison population, for example, experiences surveillance and control on a par with that of Winston in 1984. Arun Kundnani, in his recently published The Muslims Are Coming, argues that Muslim communities in the U.S. are systematically infiltrated and observed in a manner comparable to the police states under Communism (a blueprint for 1984).  Police profiling programs like stop and frisk are designed to give the authorities the power to regulate young black and Hispanic men, while leaving others largely unmolested. Big Brother is watching you—but only if \"you\" fit certain criteria. Orwell doesn't capture that reality—but there are books that do. Philip K. Dick's 1968 Do Androids Dream of Electric Sheep?, for one, is set in a run-down future dystopia that is dilapidated rather than authoritarian. The protagonist, Rick Deckard, is a policeman, but he doesn't spy on his neighbors or terrorize the general populace. Instead, he is focused on identifying, tracking down, and destroying androids. The surveillance apparatus and the murderous force of the state are targeted, specifically, towards those defined as different. The fact that the difference is hard to see, or that Deckard at times thinks he himself might be an android, suggests the extent to which policing one group can bleed into policing everyone. But it also emphasizes the importance of difference, and the way that a vision of normality, of good guys and bad guys, is central to police power. Big Brother may stomp on a face forever, but that face isn't his own face. Surveillance—Decker's android test—codifies or creates differences, and those differences (of gender, religion, race) in turn justify surveillance. Maureen F. McHugh's 1992 China Mountain Zhang is set in a future controlled by Communist China—which you'd think would be the perfect setting for an Orwellian authoritarian nightmare. But McHugh's Communist authorities don't try to control everyone the way Big Brother does. Instead, McHugh's world looks more like ours, where \"normal\" people don't have to think about the state too much. On the other hand, the protagonist, Zhang, who is gay, has to lie about his sexuality whenever he uses electronic communications, and one of his lovers is hounded to death by the police. Zhang also has to hide the fact that he has been genetically altered; he is originally Hispanic, but his parents changed him in the womb to appear Chinese in order to advance his career prospects. Zhang dissembles about the gene-splicing through much of his life—until he manages to move up economically to a level where the state doesn't really care anymore. Facing surveillance and consequent control depends in the novel on a range of intersecting factors. Oppression is distributed unequally. Androids and China Mountain Zhang are both much less well-known than 1984—in part, I think, because they're both more nuanced. Orwell's dystopia doesn't acknowledges the existence of race or religion as vectors of oppression, and hardly touches on class except to suggest that the proles experience less surveillance than do Party members. In many ways, the horror of 1984 is not so much the vision of total oppression as it is the vision of total oppression visited on “normal” white English people. Orwell's novel is often thought of as an extrapolation from Stalin and Hitler, but Orwell's most direct experience of tyranny was as the oppressor in Britain's Indian colonial administration. In that sense, 1984 is in the tradition of War of the Worlds or John Christopher's Tripod  series, in which aliens invade earth and treat the English just the way they've treated the people in their colonies. Using Orwell to understand NSA spying, then, ends up functioning as a distortion by metaphor. It suggests that all of us are equally targeted, and that the problem is that all of us are equally targeted—that middle-class non-marginal people are going to be stomped by Big Brother. The truth, though, is that the NSA data will likely be used primarily, as it always has been, against the androids and the Zhangs—which is why we need to try to find a metaphor that addresses not just liberty, but justice. ",
    "title": "Stop Comparing the NSA to 1984 (and Start Comparing It to Philip K. Dick) - The Atlantic",
    "datetime": "2014-04-09T11:31:00Z",
    "url": "https://www.theatlantic.com/entertainment/archive/2014/04/stop-comparing-the-nsa-to-em-1984-em-and-start-comparing-it-to-philip-k-dick/360353/"
}