{
    "text": "All Headlines North Korea Sports Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies URL is copied. SEOUL, June 18 (Yonhap) -- Nine-piece K-pop boy band Stray Kids has been chosen as South Korea's honorary ambassador promoting Korean cultural content overseas, a government agency said Tuesday. With the appointment, Stray Kids will join the Korean Culture and Information Service's various events over the following year to promote the global image of South Korea as well as its increasingly popular cultural content, known as hallyu, according to the agency. The organization under the Ministry of Culture, Sports and Tourism has worked with other high-profile boy bands -- BTS in 2016, EXO in 2017 and WINNER in 2018 -- to promote the global content competition event it hosts every year. But it's the first time a K-pop band has been officially named as the government body's honorary ambassador, it said. The news came one day before the band was to drop its new album \"Cle 2: Yellow Wood,\" whose main track is \"Unveil: Track.\" Debuting in 2018, Stray Kids dominated the scene for K-pop rookies last year and emerged as one of the most promising young K-pop bands of late. Kim Tae-hoon, the head of the Korean Culture and Information Service, said \"I hope young people around the world can become more familiar with Korea and step up their interest in the country through Stray Kids.\" This photo provided by the Ministry of Culture, Sports and Tourism shows K-pop group Stray Kids posing for photos after being named as an honorary ambassador for the Korean Culture and Information Service. (PHOTO NOT FOR SALE) (Yonhap)  pbr@yna.co.kr(END) All News National North Korea Economy/Finance Biz Culture/K-pop Sports Images Videos Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies Korea in Brief Useful Links Festival Calendar Weather Advertise with Yonhap News Agency ",
    "title": "Stray Kids chosen as honorary ambassador for Korean culture | Yonhap News Agency",
    "datetime": "2019-06-18T15:41:57+09:00",
    "url": "https://en.yna.co.kr/view/AEN20190618005700315"
}