{
    "text": "To revisit this article, select My Account, then View saved stories To revisit this article, visit My Profile, then View saved stories By Andrea K. Scott René Magritte was a pop-culture meme years before there was an Internet. In 1951, when CBS aired a new logo—a stylized eye hovering in a cloud-clotted sky—it bore an uncanny resemblance to his painting “The False Mirror” (1928). (The sky was later removed by the network.) Over the years, Magritte’s art has been hijacked for designs ranging from the Beatles’ record label to a Volkswagen ad to a bowler-hat light fixture. The Belgian Surrealist, who died in 1967, at age sixty-eight, is still going viral: in April, an anonymous artist started a Tumblr called Super Magritte, reimagining the artist’s works as 8-bit designs by Nintendo. In one case, the locomotive that floats indelibly in the fireplace of the painting “Time Transfixed” (1938) is replaced by Super Mario’s slow-moving bullet. Magritte’s enduring popularity has edged his once shocking imagery into the realm of cliché. But his radical use of language and his transposition of the banal and the unnerving set a precedent. Would the enigmas of Jasper Johns’s flags or Ed Ruscha’s deadpan pairing of image and text have been conceivable otherwise? Magritte, who dressed like a banker and was known to paint at his dining-room table, saw himself as a “secret agent” in the war on bourgeois values. He once said of his mission, “Too often by a twist of thought, we tend to reduce what is strange to what is familiar. I intend to restore the familiar to the strange.’’ New Yorkers can recapture that strangeness in “Magritte: The Mystery of the Ordinary, 1926-1938,” at MOMA (co-organized with the Art Institute of Chicago and the Menil Collection). The exhibition focusses on a dozen watershed years, starting with works that Magritte made for his first solo show, in Brussels—the reviews were not great, but they established him as Belgium’s only Surrealist and prompted him to move to the outskirts of Paris. There, he had a furiously productive three years (he made more than a hundred works in 1928 alone), but returned home in 1930, after the stock-market crash. The show ends in 1938, the year Magritte said, in a now famous lecture, “Surrealism claims for our waking life a freedom similar to that which we have in our dreams.” “The False Mirror” and “Time Transfixed” are among the more than eighty works here, as is “The Treachery of Images” (1929), which pairs the likeness of a pipe with the words “ Ceci n’est pas une pipe.” It may be art’s most famous one-liner, but it’s a startlingly modernist proposition: this isn’t a pipe, it’s a picture. After viewing the show, consider ducking into the museum’s store, where a Magrittean item, designed by Tibor Kalman, has been a best-seller for years. It’s a nondescript black umbrella, until you open it—and a cloudy blue sky is revealed. (“Magritte: The Mystery of the Ordinary, 1926-1938” opens at MOMA on Sept. 28 and runs through Jan. 12.) ♦ By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. By Patrick Radden Keefe By Nathan Heller By Amanda Gefter By Joshua Rothman Sections More © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. The New Yorker may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "title": "Strange Days | The New Yorker",
    "datetime": "2013-09-16T00:00:00.000Z",
    "url": "https://www.newyorker.com/magazine/2013/09/23/strange-days"
}