{
    "text": "Vassar College's student newspaper of record since 1866 By Yvette Hu Posted on October 31, 2019 in Opinions [CW: This article mentions suicide, depression and eating disorders.] I heard the news over breakfast with my friends at the Deece. “Did you hear that Sulli committed suicide?” For a moment, my mind went blank. “What the fuck?” were the first and only words that could burst out of my mouth. A mix of shock and anger sped through my veins and turned into a stirring sensation in my chest. On Oct. 14, 25-year-old South Korean singer and actor Sulli, legal name Choi Jin-ri, was found dead by her manager in her apartment south of Seoul. The police suspect a suicide, but are still investigating. (Metro, “Former f(x) star Sulli’s cause of death confirmed suspected suicide,” 10.14.2019). Within hours of the suicide, Sulli’s manager, an employee of SM Entertainment, allegedly stated to the police that the young singer had suffered from severe depression (The Washington Post, “How a K-pop star’s death reveals the truth about our society,” 10.15.2019). Sulli was a former member of K-pop girl band f(x). Ever since she withdrew from the band to focus on a career in acting in 2015, she has been the target of online vitriol and gossip. First, she was condemned for selfishly quitting the band to pursue her solo career. Then her romantic relationship with singer Choiza—who’s 14 years her senior—incited wild disapproval among netizens, who flooded her Instagram with hate messages (Channel Korea, “What’s Sulli and Choiza’s Relationship Like Now, After Their Breakup?” 04.27.2019). The commenters were not only uncomfortable with the relatively large age gap, but also angry that Sulli violated an unspoken rule that disallows K-pop idols to openly discuss their love lives. The fiercest wave of online verbal abuse hit Sulli after she posted a series of photos—which the commenters called “crazy”— showing her not wearing a bra. Opponents claimed that her photos were overly sexual and called her a “psycho.” The rampant slut-shaming continued even after Sulli explained on the talk show “The Night of Hate Comments” why she chose not to wear underwear. According to her, whether to wear underwear is her freedom, and underwear is not good for her health since the wired bra could cause problems with digestion (JTBC, “The Night of Hate Comments,” 06.21.2019). Throughout her career, I was not a fan of Sulli and didn’t follow her news actively. Yet, I involuntarily took in tons of news about her, as coverages on her popped out on a frequent basis online—not just in South Korea but also in my home country of China. I came to ignore the constant coverage of Sulli because I never took an interest in pop news. I also chose to ignore it, I must admit, in an attempt to escape the side of me which struggled with a love-hate relationship with K-pop. Sulli’s suicide reopened that valve for me, reminding me anew of the perils of K-pop culture. K-pop initially seized my attention when I was in middle school. Back then, I was a big fan of Bigbang and 2ne1, both bands under label YG Entertainment. I started listening to music produced by YG artists exclusively. The high-quality song production and charismatic stage manner of the company’s groups stood out to me, when compared to other groups that focused more on the artists’ cute and flawless appearance. I consciously set myself apart from those fans who fetishize their idols’ appearance over everything else. But the more I was exposed to the whole scope of K-pop culture, the more I came to accept the beauty myth that the industry sold to me: that the only beauty standard for girls is to be skinny, that we should all have impeccable skin. In this world, bluntly put, girls are measured by their appearances: “Good legs,” “ant waist,” “right angle shoulders.” Such vocabulary went beyond fan culture to invade my day-to-day life as I saw my peers commenting on each other’s photo posts using these rudimentary metrics. You could easily find tons of videos online made by girls to document themselves following a certain K-pop idol’s diet strategy. It took me years—going through disordered eating and studying feminist theory—to discern the toxicity of K-pop body culture on the mental and physical health of everybody involved, artists and fans alike. At first, I found it difficult to admit that something I was passionate about was built on the objectification of women. For a while, I cut myself off from almost all K-pop related content I used to watch or listen to because I couldn’t reconcile my conflicted emotions. What was I consuming when I watched those music videos? What kind of reality am I bringing myself into? It is fortunate to see that intensified demands for more regulation of cyberbullying has forced the Korean government to take action against anonymous, hateful comments. Reportedly, the National Assembly claims they will begin debating a bill, already dubbed “Sulli’s law,” later this year (The Guardian, “K-pop under scrutiny over ‘toxic fandom’ after death of Sulli,” 10.18.2019). Nonetheless, online violence is not the single cause of Sulli’s tragedy. Whether or not the press and government put more focus on punishing internet haters, the potential for the problematic K-showbusiness to remain unregulated is alarming. It is worth mentioning that SM Entertainment put Sulli under an intense working schedule, even when her depression had become more severe. (Jiemian, “Sulli’s Suicide: Will Her Tragedy Become An Opportunity to Reflect On Cyber-violence and Entertainment Industry?” 10.21.2019) Knowing that Sulli was dealing with depression, SM had her go on “Night of the Hate Comments”, and read out loud the bullying messages publicly, which made her re-experience all of the negative emotions. Besides Sulli’s case, extreme diet regimens, grueling training schedules and the minimal privacy afforded to K-pop idols have gone under-discussed for years. In 2016, Oh My Girl’s JinE announced that she would halt all onstage activities after being diagnosed with anorexia (The Korea Herald, “Dangerously skinny K-pop girl groups,” 09.26.2016). Three years later, the industry still has not imposed regulations to address the severe diet culture within the industry. Losing weight continues to be an unspoken must when female and male idols come back with their new albums, as pressure rises from the companies, the culture and even the artists themselves. To cultivate a better behaved online public may be relatively easy, but to fuss with the business side—where capital and politics are intertwined—is way more risky. If the industry sticks with what it does right now, and no external force tries to intervene, will tragedies like Sulli’s reoccur? That’s a question, or rather a reality, to think about. I’m so sad to hear about this.. tbh I didn’t know Sulli that well, I’ve only ever heard one of her songs but I could tell she had a unique personality and I don’t get why people shamed her so much for her different choices!??\nShe can love who she wants to no matter the age gap, she can wear no underwear if she wants!! But people pls be more aware of how u say things and comment to idols bcoz they are just like as and they’ve worked so so hard to try create the music that we love?\nHearing this and about how members of MONDTA X Wonho is leaving … makes me think differently about kpop.. I’ve tried giving up on it many times but part of me can’t and it’s quite annoying ..\nAny way people just need to be more respectful, sulli probably had a few personal problems that no one knew of and she couldn’t share it without feeling like hated on Pls be respectful to the people that try to make u happy and if u don’t like what they have said or done then pls just leave ..:? We will miss u Sulli Just happened again!! Goo Hara of former Girl group Kara just committed suicide or so it appears. K-Pop industry has a major crisis now and that goes far beyond just YG’s troubles. From bad management practices which are downright abuse in some cases. To a toxic Idol fan culture. Which would make any normal person think twice about jumping into an industry. Which in many cases can be a death sentence. But the K-Pop industry itself is in part to blame. Fostering an unhealthy culture which only further creates conditions ripe for abuse. What some of these Idols have to go through is inhuman.  Korean government needs to do more here as well. Stop the stigma of mental illness and start educating the public. R.I.P. Hara ? Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment.   Δ CORRECTION POLICY:The Miscellany News will only accept corrections for any misquotes, misrepresentations or factual errors for an article within the semester it is printed. The Miscellany News is not responsible for the views presented within its Opinions pages. Staff editorials are the only articles that reflect the opinion of a two-thirds majority of the Editorial Board. ",
    "title": "Sulli committed suicide, but will K-pop culture change? – The Miscellany News",
    "url": "https://miscellanynews.org/2019/10/31/opinions/sulli-committed-suicide-but-will-k-pop-culture-change/"
}