{
    "text": "In an industry that rewards performers for their silence off stage, K-pop star Sulli was a rebel. The actress-singer rose to prominence as a member of girl band f(x). But she came to be known for speaking out on mental health issues, cyberbullying and women's rights - issues that remain sensitive in a conservative society like South Korea. The 25-year-old died at home on Monday. She is being remembered by her fans as someone who made sure her voice was heard. As one music critic put it: \"She laughed when she wanted to laugh and cried when she wanted to cry. She brazenly spoke out. She didn't fit the mould.\" Sulli, whose real name was Choi Jin-ri, entered the Korean entertainment scene in 2005 when she was just 11 years old. She went on to audition for SM Entertainment, one of Korea's biggest entertainment companies, and was accepted as a trainee, a much-coveted gig. In 2009, she made her debut with K-pop girl group f(x). The then five-member group's debut album - 피노키오 or Pinocchio - topped the Korean charts and they became one of the biggest K-pop girl groups. \"f(x) is arguably one of the most musically innovative groups that K-pop has ever seen,\" said K-pop writer Joshua Calixto. \"The group was known for its genre-spanning music that, while undeniably catchy, came adorned with unfamiliar or unexpected elements that twisted conventions.\" They were also one of the first K-pop acts to be recognised internationally, starring at US festival South by Southwest (SXSW) in 2013 - a time when K-pop bands like BTS had not quite begun to make their mark in the West. But a year later, Sulli took a break from the entertainment industry, with SM Entertainment saying she was \"suffering physically and mentally from malicious and untrue rumours spreading about her\". In 2015, she officially quit the group and decided to focus primarily on acting. In 2018, she returned to singing, releasing a solo debut single with SM titled Goblin, in which she played a character with dissociative identity disorder, previously known as multiple personality disorder. Allow YouTube content? This article contains content provided by Google YouTube. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Google’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’. She was also a talk show host on a programme known as The Night of Hate Comments, which featured celebrities talking about their experiences with hate comments and cyberbullying. What really made her stand out was her outspokenness - a trait not common among K-pop stars, who often remain very private about their lives and thoughts. The K-pop industry is also known for the pressure it puts on its idols to maintain a wholesome image. \"K-pop artists are called 'idols' in Korea... [beings] that must be ideal, perfect people and performers at all times even in their personal lives,\" said K-pop columnist Jeff Benjamin. Sulli defied this. \"Female K-pop stars are expected to be cute and lovely while being obedient to public reception. Sulli didn't fit this mould. She was one who intentionally raised her voice and wanted to be heard,\" said Yoonha Kim, a K-pop critic based in Korea. She spoke openly about her struggles with mental health issues, cyberbullying - and even her romantic relationships, which many K-pop stars are banned from doing by their management. The 25 year old insisted women should be free to dress as they pleased, and she herself was often strongly criticised for not wearing a bra in public. \"When I first posted a 'no bra' photo there was a lot of talk about it. I was scared and could have hidden, but the reason I didn't is that I want to change peoples' prejudices about that. Part of me also wanted to say: 'This isn't that big of a deal,'\" she told an interviewer. For all this, she was openly attacked by online trolls, many of whom deemed her actions \"controversial\", from her attire to the pictures she posted. \"To many of Sulli's critics,  even something as innocuous as posting pictures [of herself] with her boyfriend was considered a controversial move,\" said Calixto. But she continued speaking out, firm in her conviction that her haters had no right to silence her. \"She brazenly spoke out based on her own beliefs. These nonconforming, loud and bold female stars have to risk their entire career to be who they are,\" said Kim. Sulli was found dead at her home on Monday. The initial police report said there was no sign of foul play. Her close friends said she had been depressed before her death. Several idols have since spoken out about the need for better support for stars in the K-pop industry, and the pressures they are under. Kim Dong Wan, of boyband Shinhwa, wrote on Instagram that many stars were \"fighting a battle within themselves, debating how much sickness can they bear in their hearts and continue to work, all for the sake of the sweetness that money and fame provides\". Family and friends of Sulli, including her former f(x) band mates, attended her funeral on Thursday. The funeral was initially closed to the media and fans, but SM Entertainment later allowed fans in to bid farewell. Thousands of fans have also paid tribute to her online. \"Let's remember Sulli more for the things she fought for,\" said one comment on Twitter.  \"She's one of the few famous and outspoken Korean figures that openly talks about feminism, mental disorders, and body positivity. A true trailblazer.\" \"I think people who cared about women's rights supported her in one way or another,\" said Kim. \"Many Korean women are [now] voicing their desire to fight. Even if she can't hear it anymore, I hope it will comfort her a little on her way.\" Reporting by Yvette Tan and Wonsang Kim K-pop star Sulli found dead aged 25 Gangnam: The scandal rocking the playground of K-pop K-Pop star quits tour due to 'extreme anxiety' How Carl Jung helped write the new BTS album Hundreds of police search for Maine gunman as 16 feared dead Israeli tanks cross into Gaza for 'targeted raid' Humanity blasted and broken: Gaza through a medic's eyes Seoul crush: Survivors still tormented a year on The unending pain of India's sewer workers Bowen: Israelis and Palestinians fear worst is yet to come How two 4-year-olds were killed and social media denied it How one of gaming's lost sequels finally got made The chaotic search for Speaker... in 120 seconds. VideoThe chaotic search for Speaker... in 120 seconds Russia goes back to prisons to feed its war machine The dark side of touch-screen tipping Humanity blasted and broken: Gaza through a medic's eyes The town telling influencers to stay away What if a rogue nation dimmed the Sun? Why so many veterinarians suffer © 2023 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking. ",
    "title": "Sulli: The woman who rebelled against the K-pop world - BBC News",
    "url": "https://www.bbc.com/news/world-asia-50051575"
}