{
    "text": " Superstar Sulli's death sparks conversation about South Korea's high-pressure K-Pop industry An emergency warning is in place for Undullah in Queensland. Keep up to date with ABC Emergency Sulli was once called the Kim Kardashian of Korea — a superstar K-Pop idol who was famous for posting Instagram selfies without a bra under her shirt, and advocating for abortion reform and mental health in a country where going public about such things is still taboo. But the suicide this week of the 25-year-old actress and singer, whose real name was Choi Jin-ri, has sparked a conversation among her grief-stricken fans about South Korea's high-pressure culture and the even higher expectations on the way women must look and behave in a country that still struggles with feminism. What pushed Sulli to end her life — alone on the second floor of her luxury home  —  is a tragedy that can never be fully understood. Sulli starred in her first movie at age 11 and was adored for her flawless features and ethereal presence. But she told her fans many times that beneath the gloss of her apparently perfect life, she was not coping. \"My life is actually empty, so I feel like I'm lying to everyone by pretending to be happy on the outside,\" she said in June on a TV show that asks guests to read out the words of their online trolls. She suffered from panic disorder and social phobia so great it led her to quit her girl group f(x) in 2014. She felt there was no-one she could turn to for help. \"Even close people left me,\" she said. \"I was hurt by them and felt there was nobody who understands me, which made me fall apart.\" From the outside Sulli seemed on top of the world. She had just released her first solo album, Goblin, which also marked a return to singing after a stint focused on film. In her final Instagram post to her 6.6 million followers, she shot a video of a stack of designer handbags that had been sent to her as a freebie from an admiring sponsor. Her feed was full of pictures of her with stunning hair and makeup, at glamourous events, with glamourous people. The only clue to her state of mind, perhaps, was her final selfie: her usually perfect complexion looked puffy as she gazed seriously, forlornly, at the camera. Sulli's death is not the first to rock the K-pop world. But the shock suicides of Jongyun, a member of the group SHINee, in 2017, and Ahn So Jin from Baby Kara in 2015, did nothing to change the culture of an industry so toxic that it has been described as \"an infectious disease\". South Korea is well known for imposing intense academic pressure on its youth and pushing school students to excel within a rigid template for success: studying at top university is expected, but almost impossibly competitive and expensive, followed by a job-for-life at a Korean multi-national. But a career as a K-Pop star is now a serious alternative job pathway, says Joanna Elfving-Hwang, associate professor of Korean Studies at the University of Western Australia. Many K-Pop stars, like Sulli, are not from wealthy families meaning a top university education is out of reach. But a K-Pop career delivers a different kind of success that also adds a rags-to-riches glow to their image. But there is a price to pay. K-Pop is controlled by powerful management companies that manufacture stars by pushing wannabes through gruelling auditions on reality TV that attract tens of thousands of hopefuls. Sulli was managed by South Korea's largest entertainment company, SM Entertainment. The chosen ones, like Sulli who auditioned for SM in 2009, are signed up to low-earning \"slave contracts\" that lock them in to years of dance and voice training, language studies and often, plastic surgery (including shaving the bone from their jaw to create a sought-after 'v' shape), before sending them out onto the stage to \"sell dreams\". Every aspect of their lives is controlled by the contract — even their relationships  —  and idols are encouraged to create intense \"parasocial relationships\" with their social media followers, Dr Elfving-Hwang says. She says idols must be constantly visible and available on social media to maintain these symbiotic relationships with their fans and management companies. \"The idea is that the fans feel that they get to know the idol very well,\" she says. \"That's how K-Pop works. As an idol you need these core fans to ensure your celebrity status. They decide whether a company drops you or not. You have to share your life with them on social media and cultivate that online relationship.\" As a result it's almost impossible for the stars to switch off. With long hours of training and rehearsing, and maintaining a social media façade to drive their popularity, there are few hours in the day for the idol to actually be themselves. Sulli lamented during a recent TV appearance that her public image didn't match who she was: \"When I met people in the past, even before saying hello, I felt like I should explain myself: This isn't who I am! The rumours aren't true!\" For many who have been picked up by management companies as young teenagers, it can be wearing, Dr Elfving-Hwang says. \"A lot don't have any meaningful way of dealing with it in private because they live their life so publicly. The fans adore them and yet in a way own them,\" she says. If the idol is not available that imagined relationship breaks down and the response from fans can be vicious: trolling and online bullying of stars is endemic. Dr Elfving-Hwang says Sulli was especially vulnerable to the toxic \"anti-fans\" who stalk the idols on social media because she was trying to break free of the highly controlled world that made her famous. \"Feminism is not hip in Korea and she got done badly. She got a lot of hate,\" she says. Sulli's apparent transgressions seem insignificant in a Western context: her solo album was seen by some fans as a betrayal of her group f(x); she was photographed holding hands in the street with her boyfriend, rapper Choiza, which violated South Korea's notions of public modesty not to mention her contract. Then there were the braless social media posts. \"When I first posted pictures of me braless, there were so many different reactions. I could have been frightened and hide, but I didn't. I wanted people's prejudices to disappear,\" Sulli said.\" But perhaps Sulli's greatest mistake was livestreaming a drunken restaurant dinner with friends. Trolls were merciless and Sulli accused her critics of \"gaze rape\". \"I wish people would look at me and think, \"Well, someone like that exists!\". Accept the difference,\" she said. But with so much money at stake there is little patience for messing with the formula. Many Westerners first discovered Korean pop music via Psy's 2012 monster hit Gangnam Style  —  which pokes fun at Seoul's district of Gangnam where K-Pop was born and until recently held the record as YouTube's most-watched video. Yet the K-Pop juggernaut began long before that. South Korea began pushing its cultural exports following 1998's economic crisis as a way to promote tourism, exports and boost the country's international image. The success of the strategy was phenomenal. In 2018 Korea's cultural exports  —  including K-Pop  —  earned $US9.4 billion and has been estimated to deliver a five-times return on investment. South Korea now even uses K-Pop as a propaganda tool: blasting songs across the border into North Korea, which must in turn do very little for the mental health of those in Kim Jong-Un's People's Republic. While the circumstances driving the suicides of K-Pop stars are unique, the country's performers are not alone in suffering mental health problems. In Australia, more than one third of performing artists report concerns about their mental health and up to 25 per cent have considered or attempted suicide, according to research by Entertainment Assist, a charity that raises awareness about mental health and wellbeing in the Australian entertainment industry. Levels of anxiety and depression are up to 10 times that of the general population. Chloe Dallimore, an actress and equity federal president of the union Media Entertainment and Arts Alliance, says unconventional hours, emotionally intense work and often long periods of unemployment can impact performers emotionally, physically and financially. But unlike South Korea, conversations around mental health are encouraged. The union has a Wellness Committee that provides programs such as training performers as \"mental health first aiders\", Ms Dallimore says. The Arts Wellbeing Collective in Melbourne also offers resources for performing artists, including a 24-hour helpline. In South Korea, Sulli's death has opened a new conversation about mental health and K-Pop. The industry's vulnerable young idols will be desperately hoping it can make a difference. We acknowledge Aboriginal and Torres Strait Islander peoples as the First Australians and Traditional Custodians of the lands where we live, learn, and work. This service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced. AEST = Australian Eastern Standard Time which is 10 hours ahead of GMT (Greenwich Mean Time) ",
    "title": "Superstar Sulli's death sparks conversation about South Korea's high-pressure K-Pop industry - ABC News",
    "datetime": "2019-10-19T18:00:22+00:00",
    "url": "https://www.abc.net.au/news/2019-10-20/behind-death-of-k-pop-superstar-sulli-south-korea-culture/11616584"
}