{
    "text": "SOUTH KOREA. Lotte Duty Free today started its big-budget global marketing and branding campaign of original video content, the LDF Original Series. The campaign is designed to boost duty free shopping and reinforce international travel’s rapid recovery. The monthly series, running from October through to February 2023, features some of South Korea’s most successful K-Culture superstars. The first in the series (25-27 October) features K-pop boyband sensation Stray Kids. The content includes three short love-triangle drama videos, one released each day, starring the band’s members. The content, including drama, variety shows and music videos, can be viewed on Lotte Duty Free’s official social media channels and via its LDF Magazine. It is available in Korean, Chinese and English. If the cumulative number of views exceeds five million, Lotte Duty Free will release behind-the-scenes photos and videos of the shoot through both its official social media channels and LDF Magazine. K-pop megastars Stray Kids are the first to feature in the series To commemorate the launch of the LDF Original Series, Lotte Duty Free is providing a link to a promotional page for customers who watch the video. Korean customers who spend more than US$500 at Lotte Duty Free can participate in the Japan Travel Package Giveaway, including accommodation and air tickets and a payback event in which the entire purchase amount is paid in LDF PAY.  An overseas shipping service discount page allows foreign customers to purchase Korean cosmetics, fashion items and sunglasses at discounts of up to -30%. Get ready to bring some famous Stray Kids into your home. Lotte Duty Free teases the series on Instagram. Lotte Duty Free previews the series on YouTube channel LDF TV Following on from Stray Kids, a drama featuring the multi-talented superstar Lee Joon-ho will be shown in November. Lee is a singer, songwriter, dancer, composer and actor, and member of the boyband 2PM. The video will be pre-released on 19 November at the Lee Jun-ho fan meeting themed ‘Lotte Duty Free Family Premier with Lee Joon-ho’ and then posted on the official social media channels. Fans can apply to join the pre-release event by making an online purchase by 31 October. Other big names taking part include Aespa in December, Twice in January, and Super Junior in February. Lotte Duty Free Head of Marketing Lee Sang-jin said: “We have created this branding campaign so that customers globally can enjoy duty free shopping more easily in line with the recovery from the pandemic.” He added that the series also allows for a wider audience to enjoy and understand more about K-culture.   A post shared by 롯데면세점 (@lottedutyfree)  Follow The Moodie Davitt Report on Linkedin:  Share this article: Lotte Duty Free responds in creative fashion to a slower than anticipated recovery of inbound tourism in the wake of a widespread economic downturn and rising prices. Read More LDF House is a space designed to provide customers with a differentiated experience and present what Lotte Duty Free called “a new paradigm” in duty free shopping. Read More Lotte Duty Free said that this certification is testament to their comprehensive process in identifying and preventing compliance risks in advance. Read More The beauty brand’s fragrance and cosmetic lines feature natural ingredients and are developed in collaboration with dermatologists and paediatricians. Read More ",
    "title": "Superstar boy band Stray Kids star as Lotte Duty Free launches LDF Original Series : The Moodie Davitt Report -The Moodie Davitt Report          ",
    "datetime": "2022-10-25T05:32:48+00:00",
    "url": "https://www.moodiedavittreport.com/superstar-boy-band-stray-kids-star-as-lotte-duty-free-launches-ldf-original-series/"
}