{
    "text": "Thu, Oct 26, 2023 | Rabi Al-Thani 11, 1445 Partner Content By KT Engage  Published: Thu 3 Mar 2022, 11:54 AM Last updated: Wed 23 Mar 2022, 2:48 PM The Grace & Co. and Gallery The Grace have been introducing and promoting Korean artists and their works to the Middle East art market since 2016. The K-Art exhibition in Dubai 2022 is a part of their cultural mission to promote the excellence and beauty of Korean culture. 'K-Art in Dubai 2022' will be held to introduce various works by Korean artists that show the diversity and dynamism of Korean culture. Therefore, this exhibition will present work in painting, photography, and sculpture categories. Artists Kim Jong-sook, Myung-Keun Koh, Hannah Shin, Jin-hyoung Son, Sang-yeob Lee, Ji-yeon Jeon and Da-un Jeong will participate. The exhibition will be held from March 6 to 13 at 8th Street Studios, Dubai. Visitors will be able to witness the works more vividly through the exhibition in an open studio rather than a rigid white cube. The timings will be from 11 am to 6 pm. Meanwhile, before the full-scale exhibition, there will be a separate opening event on March 4, at 5 pm at the Park Hyatt, Creek Resort. Ban Ki-moon, who served as the eighth UN Secretary-General, is scheduled to deliver a congratulatory speech at the opening. In addition, a congratulatory performance by cellist Meehea Ryo, who is active in Europe, and a tape-cutting ceremony along with reception catering for distinguished guests will take place. The main artist of the exhibition is Kim Jong-sook, who has been working with Swarovski crystals since 2005. She is presenting dreamy and splendid works by adding materials such as sparkling and colourful crystals to the aesthetics of traditional ink-and-water paintings of the Joseon Dynasty. Kim Jong-sook first draws traditional landscape paintings with acrylic and then embroiders various jewels such as crystals, opals, and pearls on the painting by hand, reinterpreting them in a modern way. Kim Jong-sook is supported by the Swarovski headquarters in Austria and Korea and was introduced to the US and Europe by an Artnet auction specialist in New York in 2012. She is already an artist with a strong overseas collector's base. She received international attention when her work was featured in the New York Times in 2017. Artificial landscape - doubble diamond, mixed media and Swarovski's cut crystals on canvas, 199.0(h) x 199.0(w)cm, 2012  Artificial landscape - louminous crystal 3, mixed media and Swarovski's cut crystals on canvas, 194.4 x 194.4cm, 2018  For more information Call : +821093726602 Instagram : gallerythegrace Email : james@thegraceandco.com ",
    "title": "Swaying to the K-Culture - News | Khaleej Times",
    "url": "https://www.khaleejtimes.com/kt-engage/swaying-to-the-k-culture"
}