{
    "text": "To revisit this article, select My Account, then View saved stories To revisit this article, visit My Profile, then View saved stories By Judith Thurman William James liked to quote Søren Kierkegaard’s famous assertion that “we live forward, but we understand backwards.” Kierkegaard, the great Danish philosopher of subjectivity, would have been two hundred years old on May 5th, and, looking back, we can see that ironic, angst-ridden modern literature begins with him. Strindberg, Ibsen, Nietzsche, Kafka, Borges, Camus, Sartre, and Wittgenstein are among his heirs—and without him, where would Woody Allen be? Kierkegaard did most of his seminal writing under assumed names: Victor Eremita (“Either/Or”); Johannes de Silentio (“Fear and Trembling”); Anti-Climacus (“The Sickness Unto Death”); Hilarious Bookbinder (“Stages on Life’s Way”); Vigilius Haufniensis (“The Concept of Anxiety”). The point of these impostures, he explained, when he finally acknowledged them, was to disavow, or—to use a postmodern notion that he pioneered—to “destabilize” his authority as a narrator. “Revelation is marked by mystery,” he wrote, “eternal happiness by suffering, the certitude of faith by uncertainty, easiness by difficulty, truth by absurdity.” It was not for him to dictate the meaning of a text (Kierkegaard’s meanings are contradictory), but for his readers to exercise their autonomy in apprehending it. The name “Kierkegaard” means “graveyard,” and “Søren” is an affectionate Danish moniker for the Devil. Søren’s father, Michael, was a former shepherd from Jutland who became, improbably, one of the richest merchants in Denmark. He had cursed God as a young man, and he later became guiltily religious. His pietism and depression (“tungsind,” Kierkegaard called it, heaviness of spirit) had a Jupiterian gravity that his son struggled all his life to escape. In his attacks on the Danish Church, and his heretical writings as theologian, Kierkegaard called for the individual to reject Christian dogma, and to embrace God with a “leap of faith.” The patriarch’s shadow falls darkly on his son’s work (the story of Abraham and Isaac is central to it), but Kierkegaard’s mother, Ane, is never mentioned. She had been the family housemaid before Michael married her. They had seven children (Søren was the youngest) and lost five of them. Søren’s surviving sibling, an older brother, became a bishop. His own existence as a dandy and an esthete (though also as a self-publisher) was financed, grudgingly, by his father. By the time of his death, at forty-two, in 1855, of mysterious causes, Kierkegaard had, in both senses, exhausted his patrimony. * * * Kierkegaard’s bicentennial is being celebrated with a show of his manuscripts at the Royal Library, in Copenhagen, that runs until September, and with readings, conferences, online forums, and a contemporary radio drama, “The Kierkegaard Syndrome,” about an anguished Web designer. But there has been nothing like the multi-million-dollar extravaganza that the Danes staged eight years ago, when Hans Christian Andersen turned two hundred and Tina Turner was flown in to jazz up the festivities. Instead of a rock diva, Paul Holdengräber, a host of literary conversations at the New York Public Library, was imported to moderate a panel on Kierkegaard with the American novelist Siri Hustvedt; the French philosopher Pascal Bruckner; and René Redzepi, the celebrity chef of Noma, the only native. Andersen, of course, has always been a global crowd-pleaser, who, as the Danes like to say, writes about “the galoshes of happiness,” while Kierkegaard, who writes about “the place where the shoe hurts,” is famously, if not perversely, difficult. Part of his allure for what a friend calls “all those smart-ass, hyper-intellectuals in Paris and Brooklyn” may be that he makes the average reader feel stupid. But even Wittgenstein could say, with awe, “He is too deep for me.” When I was learning Danish, I tried to read him in the original, but he is one of those rare stylists whose thought and diction are so unpredictable and rife with paradox that you can never guess a word that you don’t know from its context. “People understand me so little that they do not even understand when I complain of being misunderstood,” Kierkegaard wrote in his journal. This predicament was satirized, with apt impiety, by Politiken, the leading Danish newspaper, which, on May 4th, published a sort of “Kierkegaard for Dummies” in cartoon form. A “Parental Advisory” warned readers about “explicit content,” and not only because the cartoons were raunchy (one of the characters, a buxom female television presenter, trades oral sex for commentary from a Kierkegaard expert who looks like a monkey), but because “correct reading of this section can lead to irreversible enlightenment.” If your soul has bunions, however, reading Kierkegaard may inflame them: he invented self-doubt in its modern form. “Either/Or,” for example, ought really to be subtitled “Neither.” Kierkegaard, who has often been called the father of existentialism, champions the examined life, and the conscious choice that informs it—yet he mocks choice as futile. “I see it all perfectly,” he wrote. “There are two possible situations—one can either do this or that. My honest opinion and my friendly advice is this: do it or do not do it—you will regret both.” (The advice was proffered, originally, to anyone contemplating marriage. In the cartoon supplement, a duck holds forth on the either/or of putting croutons in your salad.) * * * Before my recent visit to Copenhagen, I was last at the Royal Library in the mid-nineteen-seventies, when I spent two summers doing research for a biography of Karen Blixen. (Blixen, i.e., Isak Dinesen, probably comes third on the list of Danish writers best known to den store verden—“the great world”—as the Danes call the real estate beyond their borders. The dialectic that Kierkegaard elaborates in “Either/Or”—a conflict between the “ethical” and the “sensuous-esthetic”; the instinctual and the moral life; the artist and the bourgeois—had shaped the Scandinavian culture in which she came of age.) The grand old reading room hasn’t changed, except for the ubiquity of laptops—I worked on index cards, with a pencil, as ink wasn’t allowed. The Kierkegaard show, however, occupies a basement gallery in the 1999 extension to the 1906 edifice, which is known as the “Black Diamond.” (It is a sharply angled, trapezoidal excrescence of smoky glass and marble that overlooks the water.) Vitrines that reverently display yellowed manuscripts covered with minuscule handwriting and doodles do not, generally, make for an exciting show, but Cristina Black, who designed the installation, and its curator, Bruno Svindborg, have created a dynamic, eerie spatial narrative that reminded me (sort of) of “Sleep No More.” You descend into a long hall, claustrophobically narrow and deep. This corridor is lined with thirteen mysterious doorways, each about twelve feet high. The hand-hewn pine doors are outlined by neon-orange molding. Each leads to a darkened chamber with a surreal feature or special effect—a mirrored floor; crumpled papers strewn about; a giant empty chair; electronic plopping sounds; random bric-a-brac (a toy revolver, a light bulb, rubber spiders, a Rubik’s Cube) dangling from the ceiling—that pertains to a period or to a theme. In the room dedicated to Kierkegaard’s tormented romance with the teen-age Regine Olsen (his behavior as an “out and out scoundrel,” as he put it, forced her to break their engagement, and she married someone else, but they continued to love each other), the illumination comes from a blue window. But are you inside or outside? That is one of Kierkegaard’s essential questions—about the individual in relation to society; the mind in relation to its productions, and the nature of self. Kierkegaard was a sublime tease, like his alter ego Johannes, the narrator of “The Seducer’s Diary.” It is said that he did ultimately confide the meaning of life to a scrap of paper, but that scrap has never been found. Or perhaps it is sitting in a vitrine behind the last door in the corridor at the Library. You try the handle to no avail, then you notice the plaque: “Ingen Adgang” (“no entry”). Illustration by David Hughes. By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. By Rebecca Mead By David O’Neill By Ryan Ruby Sections More © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. The New Yorker may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "title": "Søren K.’s Two-Hundredth Birthday | The New Yorker",
    "datetime": "2013-05-20T15:29:18.000Z",
    "url": "https://www.newyorker.com/books/page-turner/sren-k-s-two-hundredth-birthday"
}