{
    "text": "Teen Top, EXO, 2AM and more acts will perform at KCON 2013, the U.S.-based convention devoted to K-pop music in Los Angeles on August 24 and 25. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin Billboard can exclusively report that K-pop boy band Teen Top will join fellow male groups EXO and 2AM to perform and meet fans at KCON 2013. The U.S.-based convention devoted to K-pop culture marks Teen Top’s very first U.S. appearance when they hit Los Angeles on Aug. 24 and 25. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news As previously reported, KCON 2013 promises artist meet-and-greets, photo ops, celebrity panels, contests and fan workshops. As well, the convention will host the very first U.S.-based episode of popular Korean music chart show, “M COUNTDOWN.” Every weekend, K-pop stars perform current singles on these various music programs. An act is announced as a winner at the end of every “M COUNTDOWN” episode based on the current single’s digital sales, album sales, global fan votes and more. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t07/15/2013 At least three more acts will be added to the lineup in the coming weeks.  Teen Top earned their highest-charting K-Pop Hot 100 hit when February single “Miss Right” peaked at No. 7 following their first full-length album, “No. 1.” EXO’s latest single, “Wolf,” gave the 12-member group their first sizable hit at No. 25. And in March, longtime favorites 2AM returned with the new track “One Spring Day,” peaking at No. 3, plus landed five other new songs on the chart. 2AM hit No. 1 in April 2012 when “I Wonder If You Hurt Like Me” reigned for two weeks in 2012. Fans will also be able to get inside the brain of one K-pop idol. Bekkah, a former member of girl group After School, will host a panel titled, “Day in the Life of a K-Pop Artist” where she will “take [attendees] on a rollercoaster journey through her perspective on living life as a member of a leading K-Pop idol group.” Bekkah’s last After School music video was 2011 hit “Shampoo” (below) before she graduated from the popular outfit. > Tickets go on sale today (Monday, July 15) at 1:00 p.m. EST (10:00 a.m. PST) and prices range from $60 to a $300 VIP package. They can be purchased at KCON’s website here. Billboard’s own K-Town columnist @Jeff__Benjamin will speak on KCON panel “Spreading the Goodness of K-Pop!” on Sunday, August 25, from 11:00 a.m. to 12:00 p.m. in Panel Tent #1. More info here. Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "title": "Teen Top, EXO, 2AM Coming to KCON 2013 – Billboard",
    "datetime": "2013-07-15T14:00:00+00:00",
    "url": "https://www.billboard.com/music/music-news/teen-top-exo-2am-coming-to-kcon-2013-1569329/"
}