{
    "text": "By \n\n\tScott Rafferty Mike Krzyzewski has  won five NCAA championships and mentored some of this generation’s greatest basketball players during his 35-year career at Duke, and no coach in Division I hoops has won more games. And yet, despite being a Hall of Famer who regularly rubs shoulders with the likes of LeBron James, Kobe Bryant and President Obama, he was a nervous wreck when he first met Queen Bey. You’ve probably seen the photo of Coach K and Beyoncé posing together, taken a few years ago, when he was presenting James with Sports Illustrated‘s Sportsman of the Year award. What you can’t see, though, is the normally unflappable court general sweating bullets and shaking in his sneakers from merely being in her presence. As Coach K explained to local station WRAL, he was snapping a photo with Jay Z and LeBron – you know, as one does – toward the end of the event when the fan inside of him decided it was finally time to meet Beyoncé, who was sitting a couple of seats away from him all night long. But instead of asking someone like her husband to make the introduction, he mustered the courage to do it himself…and that’s when it all started to go pear shaped.  The best in their respective professions… A photo posted by Duke Basketball (@dukeblueplanet) on Dec 6, 2012 at 6:56am PST  “I had to meet her,” Krzyzewski remembered. “So I said ‘I’m Coach K’ and she says ‘Coach, I just heard you speak for 10 minutes. I know who you are.’ So I felt like 13. Then I asked her – something I hardly ever ask anyone to do – would you please take a picture with me?” Sadly, the picture didn’t go smoothly, either. “My face is all red and I look like I’m 11,” he sheepishly explained. “It doesn’t show her patting me on the head.” Trending\n\t\n\t\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tAt Least 22 Dead and Suspect at Large in Maine Shooting\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tDuran Duran Have Gone Fully Goth on Their New Album. Wait, What?\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBob Lee’s Murder Shook San Francisco. What Really Happened?\t\t\n\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tChristine McVie Estate and Pat Benatar Sell Catalogs With Biggest Hits Don’t feel bad, coach. It’s nice to know that, despite all your success, you’re still just another loyal drone in the Beyhive. We want to hear it. Send us a tip using our anonymous form. Rolling Stone is a part of Penske Media Corporation. © 2023 Rolling Stone, LLC. All rights reserved. ",
    "title": "That Time Beyonce Turned Coach K Into an 11 Year Old",
    "datetime": "2015-07-08T14:26:00+00:00",
    "url": "https://www.rollingstone.com/culture/culture-sports/that-time-beyonce-turned-coach-k-into-an-11-year-old-52622/"
}