{
    "text": "Although top Korean dramas like Squid Game are suddenly generating a lot of international attention for Korean entertainment, Korean culture and entertainment have permeated global media for several years, and top-charting Korean musicians in particular have been making an incredible impression on American media. The relationship between Korean entertainment fans and the quick spread of Korean media is extremely important to note when observing how the Korean wave has made an impact on American pop culture. For example, because of the language barrier between Korean media, which rarely ever uses English, and international fans, political, social and cultural misunderstandings and conflicts can arise. However, that hasn’t stopped Korean entertainment from becoming popular among an extremely diverse audience. Korean pop music first made an imprint in American media through artists like Park Jin Young (JYP), BoA, Girls Generation and Wonder Girls, who not only debuted in America but also produced songs for already well-established American talent and worked with famous American producers. However, K-pop really took off in the U.S. around 2012 with Psy’s “Gangnam Style.” Currently, groups such as BTS and Blackpink and their collaborations with Western artists have made them household names in American pop culture. For example, BTS holds the record for the greatest number of YouTube views in 24 hours, generating almost 110 million views in this short amount of time. This band and many others break record after record for the number of YouTube views and albums sold, and several Korean music artists regularly chart on Billboard’s Hot 100. Hannah Lee, an accounting junior and a teaching assistant for UTD’s Korean Language Club (KLC), said that though people have been interacting with Korean culture for a while, stan culture has definitely amplified the new K-pop wave. Stan culture can be defined as a group of people coming together to share and discuss a topic that they are passionate about. Usually, these communities are found on social media sites such as Twitter and are made up of different people from all over the world. The Korean wave, which appears to be a sudden topic of interest but has actually been gradually gaining an international following, has been exemplified by stan culture and the creation of “fandoms” for different Korean idols, actors and actresses. Yet, an unintended consequence of stan culture being such a driving force in popularizing Korean entertainment in America is that misunderstandings about Korean culture can arise. “Misconceptions and miscommunications about what our culture is like can be really frustrating because it can cause a lot of disagreements when there shouldn’t be any,” Lee said. “There is a lot of sexism and toxic beauty standards in Korean culture that need to be dismantled, and I think international fans are helping with that aspect … but then there are some things that people call out that is just basic Korean culture.” One of the examples that Lee mentioned involved an idol named Young Jae who is from a popular boy band called Got7. International fans criticized him for wearing an earring and rings that resembled the Swastika in relation to Nazi Germany. However, the jewelry that he was wearing was actually a symbol representative of his religion, Buddhism, and since there is a large number of Buddhists in Korea, Korean fans knew that his jewelry symbolized his religion. In cases such as this, ignorance surrounding certain aspects of Korean culture can lead to false portrayals of Korean artists, and issues like this are exacerbated by stan culture and Korean entertainment’s wide international following. Nonetheless, the Korean wave has attracted millions of fans, and regardless of whether fans can speak or understand Korean, they support their favorite Korean artists and enjoy Korean media to a great extent. Blanca Diaz, a global business junior and a member of KLC, said, “When you compare [K-dramas] to the shows we have here, there really isn’t anything like K-dramas. I could say the same thing about Spanish TV shows like Telenovelas. If I compare Telenovelas to K-dramas, they aren’t the same thing; they both have their own way of expressing themselves. I think the interest surrounding [K-dramas] also involves the way it portrays Koreans in their culture … that’s the root of it.” The attraction to Korean entertainment will continue to expand, especially if Netflix continues churning out top K-dramas like Squid Game. In the span of almost two months, this show has become so popular that Netflix announced it is the most viewed show in 90 countries and is on its way to becoming the company’s most popular series. K-dramas almost always highlight a specific aspect of Korean traditional or social culture, and many dramas aim to expose inequalities found in Korean society, giving audiences insight into the political climate and historical context of the country. According to an article by NPR, one reason that Squid Game is so popular internationally is because of its commentary on the nature of capitalism, social hierarchy and treatment of culturally different people. While all these issues can be seen in Korea’s social culture, they reflect present issues in America as well. Yet, more nuanced cultural details such as the intelligently chosen names for two of the drama’s characters – Sae Byeok and Ji Yeong – reflect aspects of Korea’s culture that not many international fans may grasp. The names connect to the characters’ backstories in the drama. “Korean entertainment brought more diversity into American culture,” Lee said. “I feel like people are willing to talk about the lack of diversity in Hollywood a lot more after they’ve seen the K-pop wave coming in … so we have been getting more Asian representation in media recently, which I think is great.” ",
    "title": "The rise of Korean culture around the globe – THE MERCURY",
    "datetime": "2021-11-01T19:45:00+00:00",
    "url": "https://utdmercury.com/the-rise-of-korean-culture-around-the-globe/"
}