{
    "text": "- Korea’s first ever metaverse concert, through ZEPETO Live -\n- HAHAHOHO Gyeongju World, where the cultural heritage of the Silla Dynasty can be explored in charming Gyeongju, will also celebrate its grand opening - The Ministry of Culture, Sports, and Tourism and the Korea Tourism Organization have organized the K-VIBE CONCERT, a metaverse concert made possible through XR. The K-VIBE CONCERT is held on December 8th. It will feature leading musical artists representing K-Pop from the 1st to the 4th generation, including BoA, SHINee's Key, aespa, DJ Raiden, Brave Girls, Mommy Son, and Wonstein. The dance crew LACHICA, immensely popular following their appearance on the Street Woman Fighter TV program, will also be in attendance, performing a dance highlighting Korea's unique character. (Graphic: Business Wire) The Ministry of Culture, Sports, and Tourism and the Korea Tourism Organization have organized the K-VIBE CONCERT, a metaverse concert made possible through XR. The K-VIBE CONCERT is held on December 8th. It will feature leading musical artists representing K-Pop from the 1st to the 4th generation, including BoA, SHINee's Key, aespa, DJ Raiden, Brave Girls, Mommy Son, and Wonstein. The dance crew LACHICA, immensely popular following their appearance on the Street Woman Fighter TV program, will also be in attendance, performing a dance highlighting Korea's unique character. (Graphic: Business Wire)  SEOUL, South Korea--(BUSINESS WIRE)--In response to Korea's shift to the “Living with COVID-19” (phased recovery of daily living) era and our world's ongoing transition to digital, the Ministry of Culture, Sports, and Tourism (Minister: Hee Hwang) and the Korea Tourism Organization (KTO; President: Young-bae Ahn) have organized the K-VIBE CONCERT, a metaverse concert made possible through extended reality (XR). The K-VIBE CONCERT will be held on December 8th and will utilize XR, a core technology of the metaverse. By introducing people all over the world to the beauty and wonders of Korea, the event is expected to both provide a new way to experience the country, and spark a desire to travel there. The concert brings together various aspects of the Korean Wave, from K-Pop and dance to dramas, beauty, and webtoons, to offer the audience a rich, diverse experience and garner international attention, and will feature many leading musical artists representing K-Pop from the 1st to the 4th generation, including BoA, SHINee's Key, aespa, DJ Raiden, Brave Girls, Mommy Son, and Wonstein. The dance crew LACHICA, immensely popular following their appearance on the Street Woman Fighter TV program, will also be in attendance, performing a dance highlighting Korea's unique character. In addition, the international appeal of popular figures such as global webtoon artist Yaongyi, who will host “Explaining Core Korean Beauty Tips,” will serve as an inspiration for people throughout the world to visit Korea. The event will be hosted by interpreter and broadcaster Hyun-mo Ahn and Anupam Tripathi, who has received worldwide fame for his role in the Netflix series Squid Game. Their unique chemistry is expected to add further entertainment value to the event. ZEPETO Live, a service provided by ZEPETO, Asia's largest metaverse platform, will be utilized to host K-VIBE CONCERT, Korea's first ever metaverse concert. With this service, the KTO will be able to broadcast K-VIBE CONCERT to people around the world. And on December 2nd, the KTO also released the map for HAHAHOHO Gyeongju World, which offers visitors a chance to experience the cultural heritage of the Silla Dynasty. Gyeongju's relics of the glory of the Silla Dynasty, such as Cheomseongdae Observatory, Cheonmachong Tomb, Poseokjeong Site, Donggung Place and Weolji Pond, and Tomb of King Michu, as well as modern sites like Hwangnidan-gil, have been recreated in the metaverse as part of HAHAHOHO Gyeongju World, providing a space where visitors can experience Korea's cultural heritage sites and modern Korea's hip local culture together. This will allow the KTO to increase awareness of the Silla Dynasty's cultural heritage, while promoting Korea's unique style, seen at sites such as Gyochon Traditional Village, to the world. The KTO has also virtually recreated Gyeongju hotspots, such as Hwangnam Bakery, Yangji Dabang, and Sina Self Photography Studio, and is also collaborating with small local businesses on ESG (environmental/social/governance) matters. As well, the KTO plans to offer perks such as discount coupons and photo coupons to HAHAHOHO Gyeongju World visitors, which can be used at Hwangnam Bakery, Yangji Dabang, and Sina Self Photography Studio. These coupons are available for download until December 31st, 2021, and can be used by visitors to Gyeongju until the end of 2022. The KTO is also collaborating with Korean Air on running a photo zone and offering free gifts. In addition, the KTO is planning to hold a “confirmation shot” event to promote the map experience. Choongsub Oh, Director of the KTO's Brand Marketing Team, said, “With the recent success of a variety of Korean Wave content, the world is watching Korea. The K-VIBE CONCERT will be an opportunity to inspire people all over the world to visit Korea. We hope to see high interest in the K-VIBE CONCERT, which through ZEPETO will be Korea's first metaverse concert, as well as HAHAHOHO Gyeongju World, which will allow visitors to experience Gyeongju's cultural heritage and contemporary culture.”  Korea Tourism Organization\nBrand Marketing Team\nChoongsub Oh\n+82-33-738-3331\nocs@knto.or.kr Kichan Nam\n+82-33-738-3335\nyuki4@knto.or.kr K-VIBE CONCERT is held on December 8th and will utilize XR. Lineup: BoA, SHINee's Key, aespa, DJ Raiden, Brave Girls, Mommy Son, Wonstein , LACHIC Korea Tourism Organization\nBrand Marketing Team\nChoongsub Oh\n+82-33-738-3331\nocs@knto.or.kr Kichan Nam\n+82-33-738-3335\nyuki4@knto.or.kr ",
    "title": "The Korea Tourism Organization, Showcasing Korea’s Local Strength! Experience the Metaverse! The K-VIBE CONCERT Brings the Metaverse to Life Through Extended Reality | Business Wire",
    "url": "https://www.businesswire.com/news/home/20211202006074/en/The-Korea-Tourism-Organization-Showcasing-Korea%E2%80%99s-Local-Strength%21-Experience-the-Metaverse%21-The-K-VIBE-CONCERT-Brings-the-Metaverse-to-Life-Through-Extended-Reality"
}