{
    "text": "The partnership extends the pair’s K-pop music metaverse AniCube joint venture (Left) Sebastien Borget, Co-founder of The Sandbox / (Right) Ahn Woohyung, CEO of Cube Ent. Credit: The Sandbox/Cube Ent. share key takeaways Animoca Brands’ metaverse gaming subsidiary The Sandbox has partnered with South Korea’s Cube Entertainment in an ambitious bid to spread Korean culture to the rest of the world via the development of digital assets. According to a press release on Wednesday, the companies’ announcement extends upon a joint venture last month between the pair of their music metaverse AniCube based on K-pop. Short for Korean popular music, K-pop originated in South Korea and attracts a massive following in places like China and Japan. The partnership will focus on the collaboration for business expansion as they seek to bring in various outside companies into the metaverse and hold events to introduce them to Korean culture, the companies said. Cube is the world’s fifth-largest K-pop company following behind others such as BigHit and the Big Three. The company clocked net revenue exceeding 52.95 billion Korean won ($43.9 million) last year. As an initial step, a cultural space known as the “K-Culture complex” will be established on plots of virtual land owned by Cube inside The Sandbox’s open metaverse. The Sandbox is a decentralized Ethereum-based gaming universe that lets users create and monetize non-fungible tokens (NFTs). In January, the company committed $50 million to a new accelerator program for budding startups looking to build atop its ecosystem. With the partnership, Cube will be charged with preparing content relating to Korean culture via multiple partnerships with Korean companies while The Sandbox will provide technical support, per the release. “Cube is truly embracing the spirit of the open Metaverse by moving one step further into The Sandbox via its K-culture hub, where it is actively curating local brands and partners of their main K-POP label,” said The Sandbox co-founder Sebastien Borget. Don’t miss the next big story – join our free daily newsletter. Follow Sam Bankman-Fried’s trial with the latest news from the courtroom. Newsletter Blockworks Daily  Upcoming Events Digital Asset Summit 2024 | London MON - WED, MARCH 18 - 20, 2024 Blockworks’ Digital Asset Summit (DAS) will take place March 18-20, 2024 at The Hilton London Metropole. Why London? Momentum. London has become one of the world’s hottest crypto hubs. Innovation is thriving, new institutional investors are flocking in, and regulators like […] buy tickets recent research Research The onchain perps vertical within DeFi has proven its ability to generate substantial revenue and remains a sector poised for growth as more crypto activity migrates from CEXs to onchain venues. Can dYdX, the clear market leader today, thrive as a standalone appchain, or will implementation risk and large supply overhangs be too much for the protocol to overcome? by Sam Martin /  Breaking headlines across our core coverage categories. DeFi The transition from MATIC to POL is part of the Polygon ecosystem’s 2.0 plans People The announcement caps a period of will-he-or-won’t-he speculation about the ex-CEO’s potential testimony Op-Ed Two Blockworks editors toss around the legal question of the day: Should Sam Bankman-Fried testify in court? DeFi The crux of the matter is the definition of scaling, Charbonneau explains DeFi The DeFi credit marketplace secured 150,000 OP tokens and will be launching undercollateralized lending products on Optimism Finance The iShares Bitcoin Trust — a proposed product the SEC is considering — first appeared on the list in August, DTCC spokesperson says newsletter Blockworks Daily Newsletter Get the daily newsletter that helps thousands of investors understand the markets. blockworks research Unlock crypto's most powerful research platform. Our research packs a punch and gives you actionable takeaways for each topic. Blockworks Inc. 133 W 19th St., New York, NY 10011 ",
    "title": "The Sandbox Lands Cube Entertainment To Bring 'K-Culture' to the Masses - Blockworks",
    "url": "https://blockworks.co/news/the-sandbox-lands-cube-entertainment-to-bring-k-culture-to-the-masses"
}