{
    "text": "NPR's Steve Inskeep talks to author Fatima Bhutto about her latest book: New Kings of the World: Dispatches from Bollywood, Dizi and K-Pop. NOEL KING, HOST: The days of America's cultural dominance are over. The writer Fatima Bhutto contends this in her new book.FATIMA BHUTTO: I am a child of American culture. Even growing up in Syria in the 1980s, all my reference points were really American.KING: This was in part because U.S. troops were deployed all over the world after World War II.BHUTTO: A lot of American pop culture was spread through the U.S. defense complex.KING: But not so much anymore, according to Bhutto's new book. It's called \"The New Kings Of The World\" (ph). She writes about the rise of Turkish TV, Korean pop music and Bollywood movies. She talked to Steve about the book.BHUTTO: What's phenomenal is Turkey. The Turkish today are the second-largest distributors of television, second only to the Americans. Their shows are - they don't like to be called soap operas. They call dizi. The production value is very high. And they've got fans from Eastern Europe to Chile to everywhere in between. They broke out first in the Middle East. So their first success happened in the Arab world. And then from there, they just ballooned. They're everywhere. I was in Peru, in Lima in a market, looking at DVDs. And I was given boxes and boxes of Turkish dizi to buy. They're really popular right now in Spain. They're growing in Western Europe, in Italy and Spain in particular. And they've got, I mean, audiences in the hundreds of millions.STEVE INSKEEP, HOST: Wow. What is happening in a Turkish drama that would make it different and, to some people, more appealing than some American drama?BHUTTO: Well, Turkish dramas are a great balance of modern and traditional. So the values, the ethics, the morality of Turkish dizi is quite traditional. These are dramas centered in the family. They're about people struggling to live dignified, noble lives rather than to live lives of plenty or, you know, consumerist lives.INSKEEP: So are you telling me that in certain somewhat more traditional or more conservative societies, this appeals in a way that an American drama might not?BHUTTO: Oh, it appeals hugely because if you're watching an American drama with your family, and let's say you come from a conservative background somewhere in India, you won't know where to look for most of the show because there's violence. There's sex. There's drugs. There's profanity. And the Turkish dizi, on the other hand, are quite chaste while still being modern. Some things really are unusual if you compare them to American dramas. So, for example, the hero of a Turkish dizi will never hold a gun. He just will not be an employer of violence. On the other hand, they are based on love stories. There's a lot of love triangles in Turkish dizi. I mean, it's chaste. But there's a lot of tension.INSKEEP: So you've given us an idea how it is that Turkish soap operas have permeated the globe. How did K-pop get there from South Korea?BHUTTO: K-pop essentially is born out of the 1997 financial crisis, the Asian crisis. At that time, Korea had been very heavily dependent on industrial behemoths, you know, like Samsung or Hyundai. And when the crisis hit Korea, the country was plunged into mass confusion. They had to take what, at that time, was one of the - the largest, I think, IMF bailouts in history until that point. And they had to seriously consider how to rebuild their economy. And the president at that time, President Kim Dae-jung, was inspired by Hollywood blockbusters and Andrew Lloyd Webber's musicals. And he figured that pop culture doesn't require organizational infrastructure. You just need talent and time. And so the Korean state started to invest very heavily from the late '90s into information technology, into the Internet and into culture.INSKEEP: I think I hear you saying that K-pop is - just as there is state-directed capitalism, this was kind of state-directed culturalism.BHUTTO: Yes. And it's very capitalistic in the sense that it's industrialized. So Korean music studios spend years and hundreds of thousands of dollars training their K-pop stars. They will spend, I mean, maybe three years, five years learning how to sing, how to speak different languages, how to talk, how to dance, how to do everything before you've ever even heard of them.INSKEEP: Wow. We've gotten this far in the conversation without yet mentioning Bollywood.BHUTTO: (Laughter) Yes. Bollywood is an enormous industry. I mean, it's the largest cinematic industry in the world. It beats Hollywood. There's drama. There's comedy. They have a bit of everything in them. And they're fascinating because they are a mirror to Indian society and culture at any given time. And they reflect very much what's happening in the country. Since neoliberalism hit India, they're really just films about shopping and going on vacation in Europe. So they have changed. And, of course, the Bollywood films of today, of 2019 are pretty propagandistic.INSKEEP: So I'm trying to figure out how you summarize the way the world is changing. And I keep being drawn back to national security terms. The United States was regarded as the world's sole superpower for a while. Are there other cultural superpowers now rising?BHUTTO: I think that's what's so exciting about the time we live in. Hollywood is no longer the center. America is no longer the center. Now we have a multipolar world. So Turkey is a center. India is a center. Pakistan is a center. China is certainly a center. Nigeria is a center. South America - so many centers. And I think that's - I mean, as a viewer, as a listener, I find that really, really exciting.INSKEEP: It is intriguing. But at the same time, some of the countries you just mentioned are by no means free.BHUTTO: No. And I think that we go to entertainment innocently. But everyone, of course, producing culture is coding political agendas and messages into their cultural products. China is doing that as much as America does that. You know, Hollywood loves films and shows of, you know, the great FBI chief and the great CIA agent. And we should view that with the same kind of distance we might view a Russian film, let's say. But I think so long as we have ourselves divided between the task of being entertained and also being thoughtful, then there's no problem to watch culture from anywhere.INSKEEP: Fatima Bhutto is the author of \"New Kings Of The World: Dispatches From Bollywood, Dizi And K-Pop.\" Thanks so much.BHUTTO: Thank you. NOEL KING, HOST: The days of America's cultural dominance are over. The writer Fatima Bhutto contends this in her new book. FATIMA BHUTTO: I am a child of American culture. Even growing up in Syria in the 1980s, all my reference points were really American. KING: This was in part because U.S. troops were deployed all over the world after World War II. BHUTTO: A lot of American pop culture was spread through the U.S. defense complex. KING: But not so much anymore, according to Bhutto's new book. It's called \"The New Kings Of The World\" (ph). She writes about the rise of Turkish TV, Korean pop music and Bollywood movies. She talked to Steve about the book. BHUTTO: What's phenomenal is Turkey. The Turkish today are the second-largest distributors of television, second only to the Americans. Their shows are - they don't like to be called soap operas. They call dizi. The production value is very high. And they've got fans from Eastern Europe to Chile to everywhere in between. They broke out first in the Middle East. So their first success happened in the Arab world. And then from there, they just ballooned. They're everywhere. I was in Peru, in Lima in a market, looking at DVDs. And I was given boxes and boxes of Turkish dizi to buy. They're really popular right now in Spain. They're growing in Western Europe, in Italy and Spain in particular. And they've got, I mean, audiences in the hundreds of millions. STEVE INSKEEP, HOST: Wow. What is happening in a Turkish drama that would make it different and, to some people, more appealing than some American drama? BHUTTO: Well, Turkish dramas are a great balance of modern and traditional. So the values, the ethics, the morality of Turkish dizi is quite traditional. These are dramas centered in the family. They're about people struggling to live dignified, noble lives rather than to live lives of plenty or, you know, consumerist lives. INSKEEP: So are you telling me that in certain somewhat more traditional or more conservative societies, this appeals in a way that an American drama might not? BHUTTO: Oh, it appeals hugely because if you're watching an American drama with your family, and let's say you come from a conservative background somewhere in India, you won't know where to look for most of the show because there's violence. There's sex. There's drugs. There's profanity. And the Turkish dizi, on the other hand, are quite chaste while still being modern. Some things really are unusual if you compare them to American dramas. So, for example, the hero of a Turkish dizi will never hold a gun. He just will not be an employer of violence. On the other hand, they are based on love stories. There's a lot of love triangles in Turkish dizi. I mean, it's chaste. But there's a lot of tension. INSKEEP: So you've given us an idea how it is that Turkish soap operas have permeated the globe. How did K-pop get there from South Korea? BHUTTO: K-pop essentially is born out of the 1997 financial crisis, the Asian crisis. At that time, Korea had been very heavily dependent on industrial behemoths, you know, like Samsung or Hyundai. And when the crisis hit Korea, the country was plunged into mass confusion. They had to take what, at that time, was one of the - the largest, I think, IMF bailouts in history until that point. And they had to seriously consider how to rebuild their economy. And the president at that time, President Kim Dae-jung, was inspired by Hollywood blockbusters and Andrew Lloyd Webber's musicals. And he figured that pop culture doesn't require organizational infrastructure. You just need talent and time. And so the Korean state started to invest very heavily from the late '90s into information technology, into the Internet and into culture. INSKEEP: I think I hear you saying that K-pop is - just as there is state-directed capitalism, this was kind of state-directed culturalism. BHUTTO: Yes. And it's very capitalistic in the sense that it's industrialized. So Korean music studios spend years and hundreds of thousands of dollars training their K-pop stars. They will spend, I mean, maybe three years, five years learning how to sing, how to speak different languages, how to talk, how to dance, how to do everything before you've ever even heard of them. INSKEEP: Wow. We've gotten this far in the conversation without yet mentioning Bollywood. BHUTTO: (Laughter) Yes. Bollywood is an enormous industry. I mean, it's the largest cinematic industry in the world. It beats Hollywood. There's drama. There's comedy. They have a bit of everything in them. And they're fascinating because they are a mirror to Indian society and culture at any given time. And they reflect very much what's happening in the country. Since neoliberalism hit India, they're really just films about shopping and going on vacation in Europe. So they have changed. And, of course, the Bollywood films of today, of 2019 are pretty propagandistic. INSKEEP: So I'm trying to figure out how you summarize the way the world is changing. And I keep being drawn back to national security terms. The United States was regarded as the world's sole superpower for a while. Are there other cultural superpowers now rising? BHUTTO: I think that's what's so exciting about the time we live in. Hollywood is no longer the center. America is no longer the center. Now we have a multipolar world. So Turkey is a center. India is a center. Pakistan is a center. China is certainly a center. Nigeria is a center. South America - so many centers. And I think that's - I mean, as a viewer, as a listener, I find that really, really exciting. INSKEEP: It is intriguing. But at the same time, some of the countries you just mentioned are by no means free. BHUTTO: No. And I think that we go to entertainment innocently. But everyone, of course, producing culture is coding political agendas and messages into their cultural products. China is doing that as much as America does that. You know, Hollywood loves films and shows of, you know, the great FBI chief and the great CIA agent. And we should view that with the same kind of distance we might view a Russian film, let's say. But I think so long as we have ourselves divided between the task of being entertained and also being thoughtful, then there's no problem to watch culture from anywhere. INSKEEP: Fatima Bhutto is the author of \"New Kings Of The World: Dispatches From Bollywood, Dizi And K-Pop.\" Thanks so much. BHUTTO: Thank you. Copyright © 2019 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information. NPR transcripts are created on a rush deadline by an NPR contractor. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record. Sponsor Message Become an NPR sponsor ",
    "title": "The Days Of American Culture Dominance Are Over, Author Says : NPR",
    "url": "https://www.npr.org/2019/09/27/764946119/the-days-of-american-culture-dominance-are-over-author-says"
}