{
    "text": "To revisit this article, select My Account, then View saved stories To revisit this article, visit My Profile, then View saved stories By Julie Phillips Politics has been obsessing a lot of people lately, and Ursula K. Le Guin is far from immune to bouts of political anger. In an e-mail to me last winter, she wrote that she felt “eaten up” with frustration at the ongoing occupation of an eastern Oregon wildlife refuge by an armed band of antigovernment agitators led by the brothers Ammon and Ryan Bundy. She was distressed by the damage they had done to scientific programs and to historical artifacts belonging to the local Paiute tribe, and critical of the F.B.I. for being so slow to remove these “hairy gunslinging fake cowboys” from public property. She had been mildly cheered up, she added, by following a Twitter feed with the hashtag #BundyEroticFanFic. The high desert of eastern Oregon is one of Le Guin’s places. She often goes there in the summer with her husband, Charles, a professor emeritus of history at Portland State University, to a ranch on the stony ridge of Steens Mountain, overlooking the refuge. She has led writing workshops at the Malheur Field Station, a group of weather-beaten buildings used mainly by biologists and birders, and published a book of poems and sketches of the area, with photographs by Roger Dorband, called “Out Here.” She likes the awareness the desert gives her of distance, emptiness, and geological time. In a poem, “A Meditation in the Desert,” she imagines a stone being “full / of slower, longer thoughts than mind can have.” She has roots in eastern Oregon that go back to the early days of white settlement. Not long ago, she told me excitedly that she’d rediscovered records in the attic of her grandmother’s childhood: “My great-grandfather, with my grandmother age eleven, moved from California to Oregon in 1873. . . . They drove three hundred and fifty head of cattle up through Nevada and built a stone house on the back side of Steens Mountain. I don’t think he made a claim; there was nowhere to make it. He was one of the very first ranchers in what is still very desolate country.” The family stayed there for five years before they moved on, in search of new grass or less isolation—her grandmother didn’t say. The story gives hints of what Le Guin already knew: that the empty spaces of America have a past, and that loneliness and loss are mixed up with the glory. The history of America is one of conflicting fantasies: clashes over what stories are told and who gets to tell them. If the Bundy brothers were in love with one side of the American dream—stories of wars fought and won, land taken and tamed—Le Guin has spent a career exploring another, distinctly less triumphalist side. She sees herself as a Western writer, though her work has had a wide range of settings, from the Oregon coast to an anarchist utopia and a California that exists in the future but resembles the past. Keeping an ambivalent distance from the centers of literary power, she makes room in her work for other voices. She has always defended the fantastic, by which she means not formulaic fantasy or “McMagic” but the imagination as a subversive force. “Imagination, working at full strength, can shake us out of our fatal, adoring self-absorption,” she has written, “and make us look up and see—with terror or with relief—that the world does not in fact belong to us at all.” When I met Le Guin at her house in Portland this summer, she was in a happier mood. Coming out onto the back porch, where I was sitting with Charles in the late-afternoon sun, to offer us a bourbon-and-ice, she was positively cheerful, her deeply lined, expressive face bright under a cap of short white hair, her low, warm woodwind voice rising into an easy laugh. The bourbon is part of the couple’s evening ritual: when they don’t have company, they have a drink before dinner and take turns reading to each other. On the hillside below us, two scrub jays traded remarks through the trees. The cheerfulness was relative, she told me: it was partly because a conference call set for earlier that day, with the fantasy writer Neil Gaiman and some film people who had a project to propose, had been postponed, leaving her with enough energy for a conversation. Her back is bent now with age—she’ll be eighty-seven this month—and she has to be careful with a resource she once had in abundance. “My stamina gives out so damn fast these days,” she said. The house where Le Guin has lived for more than fifty years has, in certain respects, come to resemble its owner. Past the barriers at the entrance—Charles’s menacingly thorny roses, the lion’s-head knocker that guards the door—the dark-panelled Craftsman living room, with its Victorian feel, might stand for her books set in Europe, or for the great nineteenth-century novels she has always loved, with their warmth, humanity, and moral concern. The front hall is surveyed by a row of British Museum reproductions of the Lewis chessmen, souvenirs of the Le Guins’ two sabbatical years in London, when their three children were small. Some of her awards are in the attic, but she keeps several, notably her first Hugo, from 1970, discreetly displayed in the hall on the way to the kitchen. A place of honor at the right of the fireplace is given to a portrait of Virginia Woolf, a hand-colored print that is a treasured gift from a writer friend. Later, I went with her into the kitchen, where it’s easy to end up in the Le Guin household. It’s a homey room with white appliances, cream cabinets, and no sign of steel or marble, as indifferent to fashion as its owners. Le Guin dresses well, but casually, favoring T-shirts, and wears little jewelry, though occasionally she puts on earrings fastened with clips or magnets. “You put the stone in front and a tiny magnet behind your earlobe,” she explains. “The trouble is that if you bend down near the stove, for instance, all of a sudden your earrings go wham!—and hit the stove. It’s kind of exciting.” Europe ends and the West begins outside the windows, on the back porch, with its view stretching over the Willamette River, past the city, to three volcanoes of the Cascade Range: the white peak of Mt. Adams, distant Mt. Rainier, and the sullen ash heap of Mt. St. Helens. The span of it evokes the feeling of distance and isolation that runs through her work, and the awareness, more often found in science than in fiction, that what we can comprehend is a small part of everything there is to know. Imaginative literature, she has written, asks us “to allow that our perception of reality may be incomplete, our interpretation of it arbitrary or mistaken.” Michael Chabon, a friend and admirer, sees her as “untiringly opening her work up to a perspective, to a nature that feels somehow beyond human, and yet fully human and recognizable. She gives us a view from the other side.” To talk to Le Guin is to encounter alternatives. At her house, the writer is present, but so is Le Guin the mother of three, the faculty wife: the woman writing fantasy in tandem with her daily life. I asked her recently about a particularly violent story that she wrote in her early thirties, in two days, while organizing a fifth-birthday party for her elder daughter. “It’s funny how you can live on several planes, isn’t it?” she said. She resists attempts to separate her more mainstream work from her science fiction. She is a genre author who is also a literary author, not one or the other but indivisibly both. Le Guin can be polemical, prone to what one close friend calls “tirades” on questions she feels strongly about. I once watched her participate in a panel discussion on gender and literature at WisCon, an annual gathering of feminist science-fiction writers, readers, and academics in Madison, Wisconsin. Scowling like a snapping turtle, she sat waiting for illogical remarks, which she then gently but firmly tore to bits. Yet a conversation with Le Guin is often full of comic asides, laughter, and—a particularly Le Guin trait—good-natured snorts. Humor seems to be her way of taking the edge off the polemic, as well as an introvert’s channel of communication. Behind even the lightest remarks, one is aware of a keen intelligence and a lifetime of thought, held back for the purposes of casual conversation. She has never felt at home temperamentally with establishments of any kind. But now she finds the establishment wanting to hear what she has to say. Her criticism of the economics of publishing—objections to Amazon, a fight with Google over its digitization of copyrighted books—is widely reported in the news. Earlier this year, a Kickstarter campaign for a documentary about Le Guin, by the filmmaker Arwen Curry, raised more than two hundred thousand dollars, nearly three times the requested amount. In 2000, the Library of Congress declared her a “living legend,” a designation that has made its way into many introductions to her readings. Last month, her “Orsinian Tales” and the novel “Malafrena” appeared as a volume in the Library of America. (She and Philip Roth are the only living novelists included in the series.) “I am getting really sick of being referred to as ‘the legendary,’ ” she protests, laughing. “I’m right here. I have gravity. A body and all that.” In the late nineteen-thirties, in a tall house in Berkeley, California, a girl climbs out the attic window onto the roof in search of solitude. If she scrambles far enough up the redwood shingles, she can reach her own Mt. Olympus, the roof’s peak. From here, she can gaze out over the rough blue of the bay to the city of San Francisco, row upon row of white houses climbing the hills above the water. The city is strange to her—she rarely ventures so far from home—but the view is hers, and splendid. Beyond it she knows there are islands with a magical name: the Farallons. She imagines them as “the loneliest place, the farthest west you could go.” Meanwhile, inside the house, the girl’s father is at work, thinking about myths, magic, songs, cultural patterns—the proper territory of a professor of anthropology. From him she will take a model for creative work in the midst of a rich family life, as well as the belief that the real room of one’s own is in the writer’s mind. Years later, she tells a friend that if she ended up writing about wizards “perhaps it’s because I grew up with one.” Ursula Kroeber was born in Berkeley, in 1929, into a family busy with the reading, recording, telling, and inventing of stories. She grew up listening to her aunt Betsy’s memories of a pioneer childhood and to California Indian legends retold by her father. One legend of the Yurok people says that, far out in the Pacific Ocean but not farther than a canoe can paddle, the rim of the sky makes waves by beating on the surface of the water. On every twelfth upswing, the sky moves a little more slowly, so that a skilled navigator has enough time to slip beneath its rim, reach the outer ocean, and dance all night on the shore of another world. Ursula absorbed these stories, together with the books she read: children’s classics, Norse myths, Irish folktales, the Iliad. In her father’s library, she discovered Romantic poetry and Eastern philosophy, especially the Tao Te Ching. She and her brother Karl supplemented these with science-fiction magazines. With Karl, the closest to her in age of her three brothers, she played King Arthur’s knights, in armor made of cardboard boxes. The two also made up tales of political intrigue and exploration set in a stuffed-toy world called the Animal Kingdom. This storytelling later gave her a feeling of kinship with the Brontës, whose Gondal and Angria, she says, were “the ‘genius version’ of what Karl and I did.” Her father was Alfred L. Kroeber, one of the most influential cultural anthropologists of the past century. A New Yorker from a prosperous German immigrant family, he went west in 1900, when he was twenty-four, and did field work among the Indians of Northern California. Throughout his career, he learned about cultures that were rapidly being transformed or destroyed from men and women who were among the last survivors of their people. At a time when the dominant story of America was one of European conquest, Ursula was aware, through her father and his Indian friends who came to the house, that there were other stories to tell and other judgments that might be made. Link copied Ursula’s mother was Theodora Kracaw Kroeber, born in Denver in 1897 and raised in the mining town of Telluride. A friend of Le Guin’s recalls seeing her, at the house in Berkeley, “coming down the long staircase, a majestic-looking woman with a long gown and a great big Indian silver and turquoise necklace. She was very stately.” Theodora took to writing in her late fifties, and produced “Ishi in Two Worlds,” a nonfiction account of the last survivor of the Yahi people. Le Guin loved her mother and admired her psychological gifts. But she says that their relationship also contained “something darker and stranger” that she has never quite understood. “We were very lucky, because we never had to act that out. But if I see daughters and mothers act it out toward each other it doesn’t shock me or surprise me. It’s there.” The Kroeber household was full of voices as well as stories. Alfred liked to pose philosophical questions or puzzles over the dinner table and ask his four children about anything that interested them. The kids were encouraged to take an active part in the conversation, but, as the little sister, Ursula rarely got a word in: “There were too many people, and I was outshouted by everybody else.” Learning how to be heard taught her persistence and gave her a tendency to appear fiercer than she is. “People think I mean everything I say and am full of conviction, often, when I’m actually just floating balloons and ready for a discussion or argument or further pursuit of the subject. It’s my fault—I speak so passionately. Probably because, as the youngest and shrillest child of an extraordinarily articulate and passionate family, I could only be heard by charging over the top, shouting, ‘Marchons, marchons! Qu’un sang impur abreuve nos sillons!’ every time I entertained a passing opinion.” Le Guin’s work combines a Berkeleyite’s love of alternative thought with a strong scientific bent that she sees as an inheritance from her father. In her fiction, she has tried to balance the analytical and the intuitive. “Both directions strike me as becoming more and more sterile the farther you follow them,” she says. “It’s when they can combine that you get something fertile and living and leading forward. Mysticism—which is a word my father held in contempt, basically—and scientific factualism, need for evidence, and so on . . . I do try to juggle them, quite consciously.” If it was difficult to be the youngest and most precocious of the Kroeber children, leaving the house to enter the world made Ursula feel like “an exile in a Siberia of adolescent social mores.” In the fall of 1944, at fourteen, small for her age, disguised in the sweater, skirt, and loafers of a “bobby-soxer” (a term that still makes her shudder), she began her first year at Berkeley High School, a huge, impersonal institution where popularity mattered more than learning, and fitting in was the ideal. When Le Guin speaks of her teen-age years, she speaks of loneliness, confusion, and the pain of being among people who have no use for one’s gifts. “You’re just dropped into this dreadful place, and there are no explanations why and no directions what to do.” She found a refuge in the public library, reading Austen and the Brontës, Turgenev and Shelley. In fiction, she could satisfy her deep romantic streak: she fell in love with Prince Andrei in “War and Peace” and once, at thirteen, defaced a library book by cutting out a still of Laurence Olivier’s Mr. Darcy and taking it home to look at in private, guilty rapture. From Thomas Hardy she learned to handle strong feelings in fiction by pouring them into landscapes, letting the settings carry part of the emotional charge. “There’s a patronizing word for that: the ‘pathetic fallacy,’ ” she says. “It’s not a fallacy; it’s art.” As a child, she was painfully shy, and she still alludes to anxieties that she keeps hidden from the world. I caught a glimpse of that when she asked me, cautiously, “Wouldn’t you say that anybody who thought as much about balance as I do in my work probably felt some threat to their balance?” After a long pause, she added, “Of course all adolescents are out of balance, and very aware of it. To become adult can certainly feel like walking a high wire, can’t it? If my foot slips, I’m gone. I’m dead.” Equilibrium is a central metaphor in Le Guin’s great works about adolescence, the six-volume Earthsea series, which began in 1968 with “A Wizard of Earthsea.” That book follows Ged, a lonely teen-ager with a gift for magic, who at wizards’ school learns a painful lesson in achieving balance rather than forcing change. There’s little resemblance between the school on Roke Island, with its Taoist magic (a mage is taught to “do by not doing”), and Harry Potter’s Hogwarts. There is some resemblance between Ged, the provincial boy with a chip on his shoulder, and Ursula Kroeber, the Californian in jeans arriving at Radcliffe College in 1947, all books and opinions, never before out of her home state, eager to prove herself as a poet. Her Radcliffe friend Jean Taylor Kroeber, who became her sister-in-law, recalls that, before she and Ursula bonded over Russian literature, jokes, and music, she found her “a little frightening. It’s not that she meant to be, but that’s the way it came across . . . that there was a good chance that she was ahead of you, in wherever the conversation was going. And one rather brief acute remark could set you back on your heels.” Ursula had her first clash with the literary establishment when she and a friend signed up to read submissions for a new Radcliffe literary magazine, Signature. Rona Jaffe worked on the magazine, and its undergraduate contributors included Edward Gorey, Harold Brodkey, and Adrienne Rich, whose poem “Storm Warnings” was published there. The magazine accepted nothing of Ursula’s, and she found those fellow-students “cliquish and unfriendly”: “Their comments on what we submitted ourselves, even the comments on our comments, were often remarkably savage and dismissive. We got out again and gratefully went back to our invisibility.” When Rich won the Yale Younger Poets Prize in her senior year, Le Guin, still unpublished, felt pangs of envy. On top of that, Radcliffe women were given a double message, receiving an excellent education while knowing, in Rich’s words, that “the real power (and money) were invested in Harvard’s institutions, from which we were excluded.” Though Radcliffe has long since become part of Harvard, Cambridge remains a place of mixed emotions for Le Guin. She has told me both that her college years were wonderful and that she has come to dislike the institution; the two emotions shadow each other. Her senior year was marred by a handsome and arrogant Harvard student, an accidental pregnancy, a broken heart, and an illegal abortion. “I’m often startled at the depth of my anger at Harvard,” she told me. “I know some of the reasons for it, but it wouldn’t be so immediate and uncontrollable if it were accessible to reason. I did get a splendid education there—there was wonderful Widener, the Fogg, the elmy campus, which I remember fondly. But the anger’s there like a mine, ready to go off at a quiver of the ground.” Le Guin graduated from Radcliffe with a degree in French, in 1951. Over the decade that followed, she wrote poems, short stories, and at least four novels. She submitted them to publishers; they came back with encouraging rejections. She felt her way tentatively forward, unsure of her direction, lacking models. American literature was still under the spell of Hemingway, Faulkner, Richard Wright; realism held sway, and there was little interest in play or fantasy. “I was going in another direction than the critically approved culture was,” Le Guin has said. “I was never going to be Norman Mailer or Saul Bellow. I didn’t know who my fellow-writers were. There didn’t seem to be anybody doing what I wanted to do.” She was alarmed by the literary rivalries of the period; she remembers thinking, “I’m not competing with all these guys and their empires and territories. I just want to write my stories and dig my own garden.” Instead, she found “allies in foreigners I never met,” reading Woolf’s “Orlando,” Isak Dinesen’s “Seven Gothic Tales,” and the short stories of Sylvia Townsend Warner, with their playful and revelatory shifts of perspective. She also became fascinated by the premature, failed revolutions of 1830 and the passionate political documents of the Romantic period, such as “My Prisons,” by the Italian poet and patriot Silvio Pellico. “Books like that were very exciting to me because I could handle them better than I could the contemporary works,” she says. They opened up “the distance that I needed, and probably have always needed, between me and the raw, implacable fact that’s going on right now. I’ve never really been able to handle that. If it’s right in my face, I can’t see it.” Some writers of her generation embraced confessional literature and, later, memoir. Le Guin has always preferred self-concealment to self-exposure. In the introduction to the Library of America volume, she writes, “I have no interest in confession. My games are transformation and invention.” In college, she began setting her fiction in an imaginary Eastern European country called Orsinia and found that it freed her up as a writer. Away from the “small and stony” ground of realism, her imagination began to flourish. Orsinia also gave her the distance to comment, indirectly, on Communist repression, the persecutions of the McCarthy era, the unfreedom of the age, and her decision to follow her own path. During the fifties, she worked on “Malafrena,” a novel about a young nobleman who obeys his moral compass by fighting for freedom of speech and thought. Freedom is “a human need, like bread, like water,” he insists. Pressed to define it, he replies, “Freedom consists in doing what you can do best, your work, what you have to do.” For Le Guin freedom is a complex ideal and a word “too big and too old” to be devalued as a platitude or appropriated by hypocrites. “Of course it gets misused,” she says. “But I don’t think you can really damage the word freedom or liberty.” Another of Le Guin’s places is Cannon Beach, a summer town on the Oregon coast where she and Charles have a small house on a street leading to the ocean. Although she claims to share her father’s “incapacity for reminiscence,” she and I went there to talk about her past. The prospect made her uncomfortable at first, and when we entered the shut-up house she threw nervous energy into cleaning, enlisting me to stand on a chair and brush cobwebs off the ceiling. At a little kitchen table, over tea served in the indestructible handmade earthenware mugs of the seventies, she commented, somewhat defiantly, that she had always taken pleasure in cooking and keeping house. It sounded like criticism of the heroic writer, alone in his garret, but there’s more to it than that. She feels that marriage and family have given her a stability that supported her writing—the freedom of solitude within the solidity of household life. “An artist can go off into the private world they create, and maybe not be so good at finding the way out again,” she told me. “This could be one reason I’ve always been grateful for having a family and doing housework, and the stupid ordinary stuff that has to be done that you cannot let go.” When Ursula graduated from Radcliffe, her plan was to get her doctorate and become an academic, like her three older brothers. She got her master’s in Romance languages at Columbia University, then received a Fulbright fellowship to do research in France for her dissertation. On the boat going over, she met Charles LeGuin, a historian with an attractive Georgia accent who was writing his thesis on the French Revolution. They shared a sense of humor; they liked the same books; in Paris, they went together to the opera and the Louvre. Within two weeks they were engaged. When they applied for a marriage license, a “triumphant bureaucrat” told Charles his Breton name was “spelled wrong” without a space, so when they married they both took the name Le Guin. Ursula abandoned her Ph.D. thesis on medieval French poetry, and while Charles finished researching his own thesis she read, wrote, and talked with him about Europe and revolution. Charles became the first reader for all her work, made sure she got time to write, and when they had children shared in their care. They spent the next few years in Georgia and Idaho, until, in 1959, Charles got the job at Portland State. Ursula recalls flying up from Berkeley with a child on her lap and pregnant with her second. “The plane came in low up the Willamette Valley and circled the city, and I was in tears, it was so beautiful. I thought, My God, I’m going to live there.” Link copied Stubbornness and a self-confessed arrogance about her work helped Le Guin through her unpublished years. Then and now, she feels that she is the best judge of her writing; she is unmoved by literary trends, and not easily swayed by editorial suggestion. “Writing was always my inmost way of being in the world,” she says, but that made rejections increasingly painful: “I suffered a good deal from the contradiction between knowing writing was the job I was born for and finding nowhere to have that knowledge confirmed.” Then, in 1961 and 1962, two of Le Guin’s stories were published. One, set in Orsinia, a meditation on the consolations of art, went to a small literary journal. The second, about a junior professor liberated from academia by an act of magic, was bought by the science-fiction magazine Fantastic. “I just didn’t know what to do with my stuff until I stumbled into science fiction and fantasy,” Le Guin says. “And then, of course, they knew what to do with it.” “They” were the editors, fans, and fellow-authors who gave her an audience for her work. If science fiction was down-market, it was at least a market. More than that, genre supplied a ready-made set of tools, including spaceships, planets, and aliens, plus a realm—the future—that set no limits on the imagination. She found that science fiction suited what she called, in a letter to her mother, her “peculiar” talent, and she felt a lightheartedness in her writing that had to do with letting go of ambitions and constraints. In the fall of 1966, when she was thirty-seven, Le Guin began “A Wizard of Earthsea.” In the next few years—which also saw her march against the Vietnam War and dance in a conga line with Allen Ginsberg, when he came to Portland to read Vedas for peace—she produced her great early work, including, in quick succession, “The Left Hand of Darkness,” “The Lathe of Heaven,” “The Farthest Shore,” and “The Dispossessed,” her ambitious novel of anarchist utopia. Science fiction opened her up further to writing from alien points of view—composing the political manifesto of an ant, wondering what it would be like if humans had the seasonal sexuality of birds, imagining love in a society in which a marriage involves four people. Le Guin says her ambition has always been “not just trying to get into other minds but other beings.” She adds, “Somewhere in the nineteenth century a line got drawn: you can’t do this for grownups. But fantasy and science fiction just kind of walked around the line.” Another use of the fantastic for Le Guin was to bring her ethical concerns into her fiction without becoming didactic. Take a metaphor far enough and it becomes a parable, as with her widely anthologized story “The Ones Who Walk Away from Omelas.” Le Guin’s story begins with an ethical question posed by William James: If all could be made blissfully happy by the fact that one person was being kept in torment, would we accept that condition? She gives the problem just enough reality for the reader to picture the single abused child and feel the consequences of the bargain. Her influential thought experiment “The Left Hand of Darkness” uses this strategy to explore gender and alterity. Genly Ai, a man from a future Earth, arrives on the planet Gethen, which is inhabited by human beings who are neither male nor female but, for a few days a month, in a sexual phase, can become either. Ai, as a permanent male, is to them a “pervert.” His isolation and wariness are mirrored in the landscape of Gethen, a place of perpetual winter. No one trusts Ai but Estraven, a Gethenian who is in exile; these two characters take turns narrating the book, so that we see how strange they appear to each other, and how they struggle to connect. Among the book’s central themes are balance—light is the left hand of darkness, the Gethenian saying goes—and trust. These are set against anxieties about otherness, about control and the loss of it. Estraven hopes that Ai can prevent impending war between two rival states, and asks him: “Do you know, by your own experience, what patriotism is?” “No,” I said, shaken by the force of that intense personality suddenly turning itself wholly upon me. “I don’t think I do. If by patriotism you don’t mean the love of one’s homeland, for that I do know.” “No, I don’t mean love, when I say patriotism. I mean fear. The fear of the other. And its expressions are political, not poetical: hate, rivalry, aggression. It grows in us, that fear.” To fulfill this mission, Ai must see beyond his own narrow perspective and learn to trust, even love, this person whose nature calls his own into question. The novel earned Le Guin her first Hugo and Nebula awards, the top honors in science fiction; her migration from the margins was well under way. Despite her growing success, she suffered periods of depression in the nineteen-sixties—“dark passages that I had to work through” is how she described them to me, as if they were vexed sequences in a novel. She wrote them into her fiction, she added, in the Earthsea novel “The Farthest Shore,” exploring a metaphor she borrowed from Rilke’s “Duino Elegies”: depression as a journey through the silent land of the dead. Another difficult time for her came in the long period that began after “The Dispossessed” was published, in 1974, when she was rethinking the subjects of her work. She had been writing about imaginary revolutions, but by then an actual liberation movement, feminism, was gaining traction. In the light of “the personal is political,” her “Left Hand of Darkness” seemed to some readers too oblique and metaphorical, her sense of play not illuminating but evasive. Up until then, almost all of Le Guin’s protagonists had been male, and she wasn’t sure how to write from a woman’s perspective, especially since she had long resisted writing directly from personal experience. As a wife and mother who had always had her husband’s support, she was wary of the angry anti-family rhetoric of some mid-nineteen-seventies feminists. She explained, “I had lost confidence in the kind of writing I had been doing because I was (mostly unconsciously) struggling to learn how to write as a woman, not as an ‘honorary man’ as before, and with a freedom that scared me.” She went on working steadily, writing short stories, essays, poetry, and young-adult fiction. She revised and published some of her older work: “Orsinian Tales” (which was a finalist for a National Book Award) appeared in 1976; “Malafrena” in 1979. She did begin writing from female points of view. But her turn to “writing as a woman,” while it won her new readers, alienated part of her old audience. Some of her new work was criticized as unsubtle or moralistic. Her mother died in 1979, a painful loss. She came to think of this time as “the dark hard place.” Le Guin emerged from this period by stepping over the boundaries that separated science fiction and literature. Starting in the nineteen-eighties, she published some of her most accomplished work—fiction that was realist, magic realist, postmodernist, and sui generis. She wrote the Borgesian feminist parable “She Unnames Them,” and in 1985 an experimental tour de force of a novel, “Always Coming Home.” She produced “Sur,” the epic tale of an all-female Antarctic exploring party that may be her greatest and funniest feminist statement. Her short stories began appearing in The New Yorker, where her editor, Charles McGrath, saw in her an ability to “transform genre fiction into something higher.” In fact, it was the mainstream that ended up transformed. By breaking down the walls of genre, Le Guin handed new tools to twenty-first-century writers working in what Chabon calls the “borderlands,” the place where the fantastic enters literature. A group of writers as unlike as Chabon, Molly Gloss, Kelly Link, Karen Joy Fowler, Junot Díaz, Jonathan Lethem, Victor LaValle, Zadie Smith, and David Mitchell began to explore what’s possible when they combine elements of realism and fantasy. The fantasy and science-fiction scholar Brian Attebery has noted that “every writer I know who talks about Ursula talks about a sense of having been invited or empowered to do something.” Given that many of Le Guin’s protagonists have dark skin, the science-fiction writer N. K. Jemisin speaks of the importance to her and others of encountering in fantasy someone who looked like them. Karen Joy Fowler, a friend of Le Guin’s whose novel “We Are All Completely Beside Ourselves” questions the nature of the human-animal bond, says that Le Guin offered her alternatives to realism by bringing the fantastic out of its “underdog position.” For writers, she says, Le Guin “makes you think many things are possible that you maybe didn’t think were possible.” Le Guin still has strong feelings about artistic liberty. In November, 2014, she travelled to New York with her son, Theo, to accept the Distinguished Contribution medal at the National Book Awards ceremony. In a new collection of nonfiction, “Words Are My Matter,” she writes that drafting her six-minute speech took her six months. “I rethought and replanned it, anxiously, over and over. Even on a poem, I’ve never worked so long and so obsessively, or with so little assurance that what I was saying was right, was what I ought to say.” But, having clashed with corporate publishing in the past, she felt an obligation to take the industry to task. Standing at the lectern, she gave an uncharacteristically apologetic smile. Then she scowled at her audience of editors and publishers and unleashed a tirade. “I see sales departments given control over editorial. I see my own publishers, in a silly panic of ignorance and greed, charging public libraries for an e-book six or seven times more than they charge customers. . . . And I see a lot of us, the producers, who write the books and make the books, accepting this—letting commodity profiteers sell us like deodorant and tell us what to publish, and what to write.” Instead, she admonished them, “We’ll need writers who can remember freedom—poets, visionaries—realists of a larger reality.” At her conclusion, members of the audience hesitated, looked around, and then slowly rose to their feet for an ovation. Starting in the nineteen-nineties, Le Guin returned in earnest to historical fiction, in “Lavinia,” and to science fiction and fantasy. Some of her best late work in this mode appears in “The Found and the Lost,” a new eight-hundred-plus-page compendium of her novellas. But a few years ago Le Guin stopped writing fiction, saying it took an energy she didn’t have—although she doesn’t rule out anything in the future. “Never” and “last,” she wrote in a recent blog post, “are closing words. Having spent a good deal of my life trying to open closed doors and windows, I have no intention of going around slamming them shut now.” She still gives readings, which attract a notably youthful audience. And she writes nonfiction, including book reviews for the Guardian, in which she is glowing in her enthusiasms and fierce in her dislikes. (The enthusiasms include works by Saramago, Rushdie, and Atwood; the dislikes include present-tense narration, fiction about “dysfunctional American suburban families,” and mainstream writers who attempt science fiction without understanding its rules.) She is turning more now to poetry; her most recent collection, “Late in the Day,” was published last year. She told me she was writing some poems exploring extreme old age, playing with the metaphor of an explorer’s sea voyage to the West. “I think some testimony from the late eighties could be useful to people,” she said. Then she added, laughing, “Other people in their late eighties might want to read it. I don’t know about anybody in their late fifties: ‘Oh, God, I don’t want to go there.’ ” At the house in Cannon Beach, she showed me the family’s photo albums. Over the years, Le Guin’s author photos show a steady progression from a wary young woman, ill at ease in front of the camera, to someone more at home in a public role. But I had asked about the private photos, and here was Ursula, age six or seven, with short black hair, bare-legged on dusty California ground, playing with a toy car and staring into the distance at something unseen. “I like that one,” she told me. “I look feral. I guess I was rather feral.” Then there was Ursula at the Arc de Triomphe, a gamine holding an armful of roses, and Charles, looking dashing in a new Parisian coat, climbing Mont Sainte-Victoire. Infants enter the pictures, then small children. In a photo of Ursula in her twenties, she glances up from a typewriter with a look I’d come to recognize: startled, her eyes unfocussed, her thoughts in a place the camera can’t follow. The next morning, Le Guin stood in the front yard of her house at the edge of the world, feeding a family of crows. The sun was out, and a block away the surf beat gently on the broad beach, where the town meets the waters of the North Pacific. Here the land seemed undone by the unknown distances of the ocean, and Le Guin seemed to be standing where the forces met, gazing beyond her garden to some farther shore. ♦ By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. By Dana Goodyear By Ursula K. Le Guin By Yiyun Li Sections More © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. The New Yorker may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "title": "The Fantastic Ursula K. Le Guin | The New Yorker",
    "datetime": "2016-10-10T00:00:00.000Z",
    "url": "https://www.newyorker.com/magazine/2016/10/17/the-fantastic-ursula-k-le-guin"
}