{
    "text": "Sections Now mainstream, the hippie food changed vegetarian culture forever in 1982 K. Annabelle Smith As of 2013, 7.3 million Americans are vegetarian. Even Burger King, a company that was built on burgers (obviously), offers a no-meat patty in the United States and other countries. And this year, the commercially sold veggie burger turns 32, and its inventor, Gregory Sams, remembers when he first came up with the idea. The London-based natural food restaurant owner called it the “VegeBurger” when it first hit the market. Though recipes for a “vegetable burger” without meat have been cited in print as early as 1969, when Sams released his product in 1982, the word “Vege” or what Americans now know as “veggie,” was a relatively new thing—in fact, it didn’t enter the lexicon until the late ’70s. The term “veggie burgers” was cited in the Camden (AR) News in 1976, but it meant a hamburger with vegetables on top. But before Sams sold the product commercially, he and his brother Craig were paving the road in the United Kingdom for a vegetarian diet. Though vegetarianism has a history that dates back to ancient Egypt, in the late ’60s a no-meat diet was less common in the UK than today—it was reserved for the hippies. Growing up, Sams was the only vegetarian in his class. In the United States, vegetarianism wasn't trendy until 1971 when Frances Moore Lappé's bestseller Diet for a Small Planet hit shelves. By the late ’60s, at age 19, Sams opened SEED, a macrobiotic restaurant in a basement in the Paddington neighborhood of London. Its menu included rice, veggies, seaweed, unleavened bread, miso and some seed ingredients like sunflower or sesame. Sams would switch up the specials to surprise regulars like John Lennon and Yoko Ono. Though this holistic approach to food originated in Japan, macrobiotic restaurants like SEED didn't become popular in Europe until the latter half of the '70s. (Lennon and Ono, of course, contributed to the fad’s rise.) SEED is where Sams first made a meatless patty for his customers. He’d make seitan by kneading flour under a running tap for a half hour, flavoring it with tamari, mixing it with aduki beans and oat flakes, and forming a patty out of it. Fun Fact: At the height of SEED’s success, Lennon and Ono enjoyed the food so much that when Ono was hospitalized, Sams hand delivered the special of the day to her bedside. (Sams recalls Lennon once saying that the \"carrot nituke\" was the tastiest carrot dish he had ever eaten).  The brothers had also been exploring other ventures—Craig started a whole meal bread bakery and Gregory went into wholesale natural food distribution. Both businesses were eventually united under the Harmony Foods brand. After some time, the brothers ran into financial troubles and they needed a plan. “I ended up creating the ‘VegeBurger’ to save the company,” Sams says. “Every time you saw meat alternative products coming out, they were more expensive [than the meat options]. I thought ‘That’s not how it should be.’” He spent six months mixing different quantities of four main ingredients—wheat gluten, sesame, soy and oats—into the right texture. Then he’d add dried herbs, tomato and onion. His idea wasn’t like the frozen patties you find at the grocery store today, like Morningstar or Boca. The first product would be sold in dried food packets. You’d rehydrate the mix, form it into a patty, and cook it up. The goal was to reach a larger market by creating the perfect dried version of the oat patties he’d make at SEED. The hardest part for Sams? He had never eaten a real burger before. He had been a vegetarian since the age of 10 when his father gave up meat as a New Year’s resolution. There weren’t too many people eating that way in his class. He even lost a girlfriend because of it (her dad ran a restaurant whose most popular dish was called “Joe’s Chile Con Carne”). “I was creating the VegeBurger with this image of what a burger should be like. There was a lot of trial and error,” he says. “It was a big moment for me when my long-suffering wife asked for a second bite.” Once he nailed down the recipe, Sams sold all of his shares of Harmony Foods, to his brother and launched the Realeat Company from his spare bedroom. He wanted out of the restaurant biz and the VegeBurger was his ticket into the commercial food world.  In a pre-launch test cited by the local newspaper The Observer, a Carrefour hypermarket near Southampton sold 2,000 packets (of four burgers) in the first three weeks. With the initial success from the pre-launch, Sams expanded to other grocers including Sainsbury and Safeway. Each packet of dry mix with four patties sold for about 56 pence comparable to other popular meat burgers that went for 75 to 85 pence each on average. Between the original dry mix and the frozen VegeBurger that made its debut in 1984 through a licensing agreement, approximately seven million are eaten every year. That’s one every four seconds, 24 hours a day. By the time Sams sold Realeat in 1988, the total went up to 13 million. The VegeBurger was the first of many meatless patties entering the market at the time. It's probable that versions of Sams's VegeBurger were already appearing in restaurants predating his business, but the VegeBurger was the first to reach the commercial, natural foods market. Most restaurants offered a “vegetarian option,” but it was often something along the lines of an omelette or a cheese salad. A popular alternative to a classic British roast dinner was something called a “nut loaf.” But by 1985 (the VegeBurger was flying off the shelves at this point), Portland, Oregon, restaurant owner Paul Wenner founded Gardenburger, Inc. and released its first vegetable-based burger commercially by 1992. The following year, Boca Burger Inc. was founded. By 2002 Boca, which was acquired by Kraft Foods, was bringing in more than 70 million dollars annually. But if you’re into the idea of making a fresh meatless patty, Mother Jones has a great list of homemade alternatives to the frozen, soy-based burgers you’re used to seeing at the store. Even though Sams advocates for his original dried recipe, nothing beats the handmade patties he made at SEED for John and Yoko, he says. Get the latest Travel & Culture stories in your inbox. K. Annabelle Smith\n|\n\n| READ MORE K. Annabelle Smith is a writer based in Santa Fe, New Mexico who covers a wide variety of topics for Smithsonian.com. Her work also appears in OutsideOnline.com and Esquire.com. Explore Subscribe Newsletters Our Partners Terms of Use © 2023 Smithsonian Magazine\nPrivacy Statement\nCookie Policy\nTerms of Use\nAdvertising Notice\nYour Privacy Rights\nCookie Settings © 2023 Smithsonian Magazine\nPrivacy Statement\nCookie Policy\nTerms of Use\nAdvertising Notice\nYour Privacy Rights\nCookie Settings ",
    "title": "The History of the Veggie Burger | Arts & Culture|\n Smithsonian Magazine",
    "url": "https://www.smithsonianmag.com/arts-culture/history-veggie-burger-180950163/"
}