{
    "text": "Filed under: China’s hysteria over the US-Korea missile defense deal is getting weird. China is not happy about Washington’s agreement with Seoul to build a missile shield system, known as THAAD, in South Korea to protect the close US ally from North Korean attacks. Beijing has condemned it in unusually blunt terms, with a Foreign Ministry spokesperson warning that China felt “firm opposition and strong dissatisfaction” about the new defensive system. Other than issuing angry statements, though, China actually can’t do much to stop the installation of the THAAD system, which began Tuesday. It’s taking out its anger on Korean pop culture instead. From TV dramas to fried chicken, South Korean products are especially popular among young people in China. They’re also one of South Korea’s biggest exports, earning the country a record $5.3 billion in 2014. China is tapping into that popularity in an attempt to hurt South Korea economically. Korean TV shows and K-pop music videos have been blocked from streaming in China — one of their biggest and most lucrative markets — Chinese internet users have posted about boycotting Korean beauty products, and Korean celebrities have canceled tours in China. It may not involve guns or military attacks, but the fierce Chinese counterattack is a pushback against foreign influence, and an attempt to further solidify Beijing’s dominance in the region. The latest victim of China’s crackdown on all things South Korean is the country’s fifth-largest conglomerate, Lotte Group. Lotte, known for its milk-flavored soda, koala-shaped biscuits, retail, electronics, and more, has experienced disruptions in its Chinese and international websites starting Tuesday night, according to the South China Morning Post. Attempts to access both websites on Thursday were also unsuccessful. These disruptions are likely the result of a cyberattack by unidentified Chinese hackers. Lotte said in a statement Thursday that the cyberattackers were using Chinese IP addresses, suggesting that the attack is from China. Lotte spokesperson Kim Min Suk told Reuters, “The [two] websites have been down and we are working to get them back online.” The cyberattack comes after Lotte agreed on Monday to sell one of its golf courses in southeast Korea to the government, land that would be used to host the missile defense system when its installation begins sometime later this year. Developed by the United States, THAAD would provide missile defense to US forces stationed in South Korea and protect against North Korean attacks. While the US has emphasized that THAAD will focus solely on North Korean nuclear and missile threats, China is still concerned that the system could be used against it. China has previously warned Lotte against handing over its land to the Korean government, and launched investigations into Lotte’s Chinese locations after Lotte first hinted at selling the golf course. Lotte is an enormous conglomerate, but individual South Korean artists are also feeling the sting. It’s not the first time that China has targeted Korean pop culture to make its political points. Soon after South Korea officially agreed to allow the construction of THAAD on its soil in July 2016, several Korean celebrities and K-pop bands had their events canceled in China. EXO, a K-pop boy band hugely popular in China, canceled two concerts in August that were to be held in Shanghai, according to the New York Times. Korean drama stars Kim Woo Bin and Suzy Bae also canceled their Beijing fan meet in August. Since then, there have been reports that many big Korean entertainment companies are avoiding China altogether and focusing publicity elsewhere. South Korean culture is a big deal among Chinese young people — fashion, cosmetics, music, food, TV shows, even the language define what’s cool in the world’s most populous country. In Beijing and cities around China, it’s easy to find Korean barbecue restaurants blasting K-pop and displaying posters of attractive celebrities. In 2016, the Korean romantic drama Uncontrollably Fond had more than 4.1 billion views on China’s version of YouTube, Youku, according to Yonhap, South Korea’s largest news agency. The popularity of another drama, Descendants of the Sun, prompted the Chinese Ministry of Public Security to warn Chinese citizens against watching too many episodes. “Watching Korean dramas could be dangerous, and may even lead to legal troubles,” the ministry ominously posted on its social media page. But even though Chinese citizens apparently love Korean culture, they have expressed support for the government’s tough stance against Korean businesses and culture. Xinhua, one of the Chinese government’s media mouthpieces, reported in August 2016 that 80 percent of Chinese people would support a ban of South Korean stars appearing in Chinese TV shows. “It reflects Chinese placing love for their home country before popularity of entertainment stars,” said Xinhua. In the past few days, Chinese internet users have reiterated their love of China and have called for boycotts of Korean products, especially on Weibo, a blogging site similar to Twitter. One Weibo user posted, “Starting now, don’t watch Korean dramas and boycott Korean goods.” Will you support Vox’s explanatory journalism? Most news outlets make their money through advertising or subscriptions. But when it comes to what we’re trying to do at Vox, there are a couple reasons that we can't rely only on ads and subscriptions to keep the lights on. \r\n\n\r\nFirst, advertising dollars go up and down with the economy. We often only know a few months out what our advertising revenue will be, which makes it hard to plan ahead.\r\n\n\r\nSecond, we’re not in the subscriptions business. Vox is here to help everyone understand the complex issues shaping the world — not just the people who can afford to pay for a subscription. We believe that’s an important part of building a more equal society. We can’t do that if we have a paywall. \r\n \n\r\nThat’s why we also turn to you, our readers, to help us keep Vox free.  If you also believe that everyone deserves access to trusted high-quality information, will you make a gift to Vox today? $5/month $10/month $25/month $50/month We accept credit card, Apple Pay, and\n              \n\n                Google Pay. You can also contribute via The day's most important news stories, explained in your inbox. Check your inbox for a welcome email. Oops. Something went wrong. Please enter a valid email and try again. ",
    "title": "The surprising reason why China is blocking South Korean music videos and TV - Vox",
    "datetime": "2017-03-03T11:00:02-05:00",
    "url": "https://www.vox.com/latest-news/2017/3/3/14795636/china-south-korea-pop-culture-kpop-attacks-thaad"
}