{
    "text": "Inspired by pop stars and encouraged by culture that equates success with physical beauty, the \"self-racism subtext\" of buying an ideal Korean face When 17-year-old Hailey Kim looks in the mirror, she doesn't see a pretty person. Her face is too round, she thinks; her lips too thin, her nose not quite right. Her reflection fuels a cosmetic surgery wish list -- bigger lips, higher cheeks, and a more delicate chin. Unhappiness with appearance is de rigueur for many teenagers, but for Korean Americans perhaps more than any other ethnic group, this is increasingly being addressed with a scalpel. California-born Kim has already undergone two procedures: a nose job and double eyelid surgery. These have given her eyes a Western crease and made her nose small and high. Kim had full support from her family for these operations. And why shouldn't she? Her mother and aunts have all had similar operations. Kim hopes to study psychology when she goes to college, but she's deferring for a year so she can work and save money for more surgery. \"My cousin had her nose and eyes done, my mom had her eyes done, and my aunts had noses and eyes done, all in Korea,\" she says. \"I found out about this when I was in elementary school.\" None of these operations, however, are as radical as what she wants to do next. Kim recently read about a relatively new cosmetic procedure that is colloquially known as V-line surgery. It involves breaking and shaving the jawline to create a V-shaped face. This surgery is popular amongst young Korean pop stars, who have their faces reshaped to give them elfin, anime-like appearances. The V-line shape gives the face a certain fragility, and its childlike appeal has won Kim over. \"I hope to achieve a slimmer, oval face from the procedure,\" Kim says. \"I just want to better myself. My wants may be drastic, but I'm not trying to look exactly like someone else.\" Dr. David A. Koslovsky, a maxillofacial surgeon at Columbia College of Dental Medicine, performs the V-line operation regularly, though he has a different name for it. \"I perform corrective jaw surgery,\" he says. \"This is first and foremost a functional procedure for when teeth are misaligned. It does have an aesthetic benefit, but that's not why we do it. It's a complex, risky procedure. You could have permanent numbness, and there have been cases where people have died from this operation.\" It's also extremely painful. The jaws are wired together for six weeks, and it can take six months for the swelling to disappear. But the danger and the physical pain -- and the possible confusion of seeing a totally different person in the mirror -- is seen as a small price to pay by many Korean American women. To understand why, you have to go to South Korea. Remarkably, one in five South Korean women has had some form of cosmetic surgery, compared to around one in 20 in the U.S., according to the International Society of Aesthetic Plastic Surgeons. A powerful Korean consumer culture over the past two or three decades has made Korean women equate beauty with professional and economic success. Feminist criticisms of body objectification are barely heard, and the racial argument that this surgery is a form of \"trying to look white\" has faded -- due to the rise of Korean pop music culture. K-pop has created a completely new beauty aesthetic that nods to Caucasian features but doesn't replicate them. K-pop culture -- think \"Gangnam Style\" -- and its look have spread across East Asia and into the Asian community in the United States. This popularity -- and the value placed on the surgery behind the stars -- has meant that South Korea is now synonymous with medical tourism, and has established itself as an epicenter for all sorts of cosmetic surgery. Mihija Sohn, Miss Korea 1960 looks nothing like Sung-hye Lee, the winner of Miss Korea 2012. Miss 1960's face is full, her nose is flat, and her eyes are small. Beauty in the 1960s had a very natural slant to it. Women were expected to enhance rather than alter their physical beings. This is in direct contrast to the identikit images of contestants in pageants over the last decade, where contestant pageant teams often feature a consulting surgeon on staff. \"Older standards of beauty were big body, wide hips, and good to make baby,\" says Bae Seonghee, a 16-year-old schoolgirl from Gumi, South Korea. \"Eyes there were slanty and sleepy.\" Seonghee giggles and hides behind her long bangs. She's elbowed by her classmate Kang NaYeon on her left, and she shrugs and looks up again. \"Pretty is a small head, big eyes, and high nose and forehead,\" she says earnestly. Seonghee is practicing English as part of her school curriculum, and she motions to different parts of her face as she speaks. Gumi is a small rural town, 115 miles south of Seoul, and the girls at Gumi High School are less sophisticated than their city counterparts. Out of the seven girls I spoke with, only one had even been to the capital. But cosmetic surgery isn't an urban, cosmopolitan phenomenon in South Korea. It's becoming a nationwide obsession. For the girls of Gumi, it's driven by videos from the WonderGirls and Girls Generation, girl groups that launched with 17 to 20-year-old singers. They all have small faces, large eyes, and tiny button noses. Chins are pointed, cheeks are wide, and their faces glow artificially, imbuing them with the anime quality. A big industry ensures they stay that way. Everything, from their vocals to their face shape, is manufactured by their management companies. Cosmetic surgery is a large part of creating the K-pop image. Many of the K-pop idols even act as spokespeople for surgical companies. In a video on the Cinderella Clinic website, singer G.Na says, \"This clinic is where Dr. Jong Phil is. As you are aware he gives a really kind consultation. Come and become more beautiful.\" The stars don't actually admit to actually having had the surgery, but it is so rampant among them that numerous websites exist dedicated to analyzing who got what where. \"I like Girls Generation,\" said Korean schoolgirl Kim RyeoGyeong. \"They have double eyelid and a small face; a round forehead -- from an implant. They say they didn't do any surgery, but I know they did.\" As James Turnbull, a writer and lecturer in Korea on feminism and pop culture, noted, \"The idea here is that you like the appearance of the 'idols' and you should try and look like them.\" \"K-pop is a package that's not confined to the music,\" he said. Before the K-pop boom, Korean youth already were being brought up on a diet of surgery, so the idea of an operation to look like their favorite starlet is socially acceptable. Children are considered an embodiment and reflection of their parents' status, and to this end they are shaped and molded -- through intense schooling, but also through surgery to be the best they can be. Notions of beauty and productivity are married together. 16-year-old Chae Jeongwon, a schoolgirl at Gumi High School, has grown up with the understanding that she'll have double eyelid surgery one day. \"It's a present for senior schoolgirls,\" she wrote, in an essay about Korean surgery. \"They say, Mommy, if you get my eyes or nose, my scores are better than before. Please!\" The stress on aesthetics-by-knife is part of a strange cultural mix of the modern and the ancient in South Korea today. Families embrace traditional routines such as dining and living together, but equally encourage their children to work 18 hour days at school. The country is the most wired in the world, with the highest rate of smartphone usage -- 67 percent -- and 95 percent of Korean homes having internet access. Technology pervades every part of life, from keyless doors -- you type in a passcode -- to karaoke studios on trains. In this setting, women need to juggle the cultural expectations of being productive, engaged citizens, with the expectations of femininity and beauty that is also demanded from them. \"There are strict rules about women's appearance in the workplace,\" Turnbull said. \"Standards are far harsher than Western countries.\" Job applicants, for example, are commonly required to submit a headshot with their resume. Beauty is prized almost everywhere in the world, but in South Korea its value is upfront and open. South Korean employers scrutinize the looks of the applicants -- in search for physical attractiveness -- in addition to their professional qualifications. Sharon Hejiin Lee, an assistant professor in the department of social and cultural analysis at New York University, explains that, right or wrong, Korean women are themselves propagating these expectations. \"There's a real problem when you make generalizations about a whole country full of women, that they're all culturally duped,\" Hejiin Lee said in an interview. \"There are certain economic situations happening in Korea and America that might impel different choices. We -- Americans -- might not see plastic surgery on the same level here that we see in Korea. But we do see people looking to the consumer market for help in their personal lives. Weigh that through an economic framework, and it's what you're seeing in Korea today.\" \"In Korea, for a woman to be capable, it's not enough just to have a certain skill set \" she said. \"You have to be beautiful as well. After the Korean economic crisis in 1997, competition for jobs led to the surgery boom; people trying to get a leg up in the job market any way they can.\" In Gumi, Kang NaYeon is getting eyelid surgery as a present from her parents when she finishes her school exams. \"Companies don't like to hire people who have had eye and nose surgery,\" she said. \"There's a small backlash against it now, but they still only hire pretty people. Because of this, parents let children have surgery even younger so it looks more natural as they mature.\" Kang NaYeon said she is a \"little scared\" about having surgery. \"They use a knife or scissors. A cut here and here and then stitches,\" she gestures. None of this was so when the American plastic surgeon Dr. Ralph Millard arrived in South Korea in 1954. Korea was a Japanese colony during the first half of the twentieth century, and then was virtually leveled during the Korean War, which lasted from 1950 to 1953. Millard was chief plastic surgeon for the United States Marine Corps. Part of his role was to help treat Korean accident and burn victims. However, Millard decided to \"help\" in a different way than planned. He performed what Korean academic journals say was the first recorded double eyelid operation in South Korea. Millard's reasoning was that creating a more Western look would help Asians assimilate better into an emerging international economy. \"The Asian eyelid produces a passive expression which seems to epitomize the stoical and unemotional manner of the Oriental,\" he wrote later in The American Journal of Ophthalmology. The surgery quickly caught on. Its first clientele were Korean prostitutes who were trying to appeal to American soldiers. Surgery for beautification purposes worked its way into mainstream culture. It became commonplace for Korean women to have eyelid operations to give themselves the Western crease, or \"double eyelid.\" The first cosmetic surgery clinic opened in Korea in 1961, and year on year, the numbers of women undergoing cosmetic operations doubled and then tripled. Double eyelids are still today the most popular procedure. Asian rhinoplasty -- a nose job -- is second. It extends and shapes the nose, to make the Asian profile \"less flat.\" The two operations are so common that they are not called surgery, but a \"procedure.\" These two procedures have led to questions of whether Korean women were trying to look Western. \"Often times when Asian American women opt to get surgery, people automatically assume it's because they want to look white, but often you find the pressure to engage in these surgeries coming from their own families, from their connections abroad,\" said Lee, the NYU professor. \"When we think of it as just the desire to look white, we're not really giving credit to the surgery industry that flourishes by reprinting people's features.\" Dr. Hyuenong Park, a surgeon at the OZ Cosmetic Clinic in Korea, agrees. \"A small and slim face is ideal to most of people now,\" he said. \"Even though many Caucasians have small and slim faces, it doesn't mean Asians want to look like Caucasians. If you inspect some Caucasian celebrities, you find many examples of prominent jaws and high cheekbones. But if you inspect Asian celebrities, they all have small jaws and cheekbones.\" Dr. Park said that changes to ethnic features are the main reason patients come to him. \"Most Asians have wide skulls and big faces,\" he said. \"Even a slightly wide jaw can make them look heavy, dull, and mean. Jaw reduction can make their face smaller, slimmer, and nicer.\" This perspective ties into what Dr. Eugenia Kaw calls the \"self-racism subtext.\" Her research paper, \"Medicalization of Racial Features,\"focused on how Asian Americans viewed themselves, and how they were influenced by cultural perspectives. \"It boils down to physical traits being connected to negative characteristics,\" she said. \"Now it's written as if one was trying to right racial ideology. It's insidious -- not like women who opt for surgery out of empowerment and choice.\" Dr. Kaw's background is in anthropology and her paper has been established as one of the first discourses on Asian American surgery. Two decades later, much of her research is still highly relevant. She wrote that the \"alteration of Asian American women of facial features is less of a transforming process, and more of a normalizing one, \"to allow them to fit in with their Western peers. While this might be true for some procedures -- such as rhinoplasty and eyelid surgery -- the V-line face is unique to Asians. It stands out rather than conforms to American sensibilities of beauty. Dr. Kaw is unfamiliar with V-line surgery. \"It was never mentioned when I did my research at all,\" she said. \"It's a new thing -- it wasn't around 20 years ago.\" Helping the rise of V-line surgery is the laissez faire attitude about recovery implications. This is due to the relatively short recovery time of nose and eyelid surgery, traditionally viewed as operations with minimal side effects. These surgeries are so common that patients rarely take more than a day or two off to recover. The same can't be said for the V-line surgery, but not everyone is aware of that. Typically, a surgeon will make a three-centimeter incision through the mouth, and then insert a three to six millimeter saw or rasp. This is done under general anesthesia. Parts of the jawbone may be removed and the remaining jaw slid backwards or forwards, depending on the agreed-upon outcome. The jaw may then be fixed into place with a titanium plate, using titanium screws or gauge wires. Side effects vary from bleeding and infection to hematoma and facial nerve palsy. What is considered a heavy-duty operation in the maxillofacial dental world is considered a common everyday, operation in Korea, and the altered face shape has created a distance between the women and their ethnic background. It also has created an identikit model, a face stamped out of a mold, and a replacement of one's identity with one of conformity. \"When you go to the Gangnam area in Seoul, many girls' faces are similar,\" said schoolgirl Chae Jeongwon. \"So many people have plastic surgeries in Gangnam, but famous doctors are limited. So, many girls have had surgery by same doctor.\" \"Many people will look and say: I know that pretty girl. She did rotation cut, nose, and eye.\" *** Back in New York, Dr. John Kang's practice is benefitting from the Asian American desire to have cosmetic surgery. He has two offices. One overlooks Central Park, with baroque style fireplaces and a marbled floor. His other is in Flushing, Queens, a predominantly Asian area. Dr. Kang offers consultations and injectables in the Manhattan office and performs surgery in Queens. \"I'm all about creating a more harmonious look to the face,\" he told me. His face is smooth and unlined, and his skin is bright and clear. When he talks, his hands hit the mahogany tabletop for emphasis. \"Good surgery is like a vase,\" he said. \"Surgery gives it a nice strong base, but you see the vase.\" Dr. Kang's philosophy is about helping nature along. \"I always try to copy the natural look, give face the ideal shape it should have been born with,\" he said. Twenty-four-year-old Miss Lee sits on a leather dentist chair in Dr. Kang's office. Her dark hair is pulled back from her face and a small gold cross rests on her neck. Methodically, Dr. Kang marks up her face with a black felt tip pen, drawing dots along the bridge of her nose and circling spaces on her chin. Her hands twitch in her lap, idly stroking the rabbit ears on her iPhone case. She is here for fillers, hyaluronic acid, and calcium extracts that will sit inside her face and reshape her profile. They are a temporary alternative to a nose job and a chin implant, and she will have product under her skin for around six months. A fashion student at NYU, Lee wants a more feminine face. Her nose turns crimson as the syringe enters it, and Dr. Kang taps the top of the bridge. \"See this,\" he says. \"This is a barren area. I'm going to bring it up for elegance. Nothing extreme, just working with what she has got.\" More injections follow. Miss Lee looks into a hand mirror. Her nose is red and her chin a little puffy, but her profile has noticeably changed. \"Is it going to stay this big?\" she asks the doctor. \"This is just swelling from the injections,\" he assures her. \"Within a week it will be much smaller.\" He turns to me. \"If she likes this, we might do the real thing next time. I'm a surgeon, I can't help but view the face that way.\" Dr. Kang's gently, gently approach means he doesn't offer V-line surgery. He does offer a non-surgical V-line procedure though, injecting Botox into the masseter muscle of the face. This muscle is what enlarges when you chew. By using Botox, it hypertrophies, minimizing the look of the jaw. Hailey Kim doesn't feel that Botox would give her face enough of a change, and she is reluctant to trust an American scalpel. \"Korea is way more advanced and does not charge so much,\" she said. \"Just because a doctor is Korean, it doesn't mean they have the experience a doctor in Korea would have, nor the similar advanced techniques.\" The cost of all surgeries in Korea are, in fact, about a third of the U.S. South Korean doctors also constantly innovate and experiment with cutting edge technology. Professor Hejiin Lee said that many Korean Americans have only been in the U.S. a few generations and still have deep roots to Korean culture. \"They believe in K-pop culture and want to look like their favorite actresses,\" she noted. \"They probably know an aunt who had surgery in Korea and looks amazing. We often think of America and us flowing in one direction -- and culturally dominant in this direction. And what this illustrates is that it's really circular and moving in many different directions.\" Clinics in Korea offer the V-line operation to medical tourists and say they only need \"stay a week\" to see the procedure out. Dr. Spiegel, a U.S.-based surgeon who offers this procedure, says he is wary of people going abroad for surgery. \"There are some great surgeons for this abroad,\" said Spiegel. \"But just because the price is low, there may be other complications. I often see people who need revisions -- and a doctor in another country might end up costing you more if you have any issues.\" Dr. Park disagrees. \"After a week all the postoperative care is ended and there is nothing that I can help them with.\" Doron Ringler, chief resident at the maxillofacial oral surgery unit of Columbia College of Dental Medicine, has other ideas. \"When we perform the V-line -- we call it orthognathic surgery -- we have regular follow-ups with the patients. We see them every week for six weeks, and then every three to five months for a year or two.\" Ringler frowns, and adjusts the collar of his starched lab coat. \"A small percentage of patients have some form of relapse, so it's important to monitor them.\" *** Korean culture is still changing, and the shifting nature of the attitude towards physical appearance -- like the economy -- will surely continue to change. The mad rush to economic growth and wealth will likely weaken as the economy matures. The pressure on beauty may diminish. This February, cabin crew for Korean Airlines participated in makeup training, a mandatory requirement for all new stewardesses. This year, there were more than the usual numbers in the room. Korean Air now requires male cabin crew to attend -- and to learn how to blush and bronze themselves. Male cosmetic surgery is also on the rise, though they still only make up a small percentage of operations. Here we can see an equality of inequality emerging; both sexes are placed under similar beauty pressures. On a more uplifting note, during the same month, stewardesses at Asiana Airlines were successful in changing their restrictive dress code, which forbade them to wear pants. They were supported by The National Human Rights Commission of Korea (NHRC), which disputed the airline rule that a \"skirt-only policy was to emphasize the company's brand of high-class Korean beauty.\" The NHRC argued this by saying that \"no other Korean airlines compel female flight crew to wear skirts, so the regulations could be viewed as excessive.\" Professor Hejiin Lee finds this mini revolution positive: \"Korea is an amazing place because it changes so quickly. The Korea that my parents left in the seventies is vastly different from the Korea that exists today.\" She pauses, smiles, and continues, \"The ability for young generations of Asian Americans to have this dynamic relationship with Asia is on a much larger scale than it was before; due to the Internet. We'll see Asian American identities merging with Asia proper, but it will be different. It is pop culture that really introduces the idea of how transformation of your body can lead to success; maybe you too can become a pop star.\" Ringler, from the Columbia College of Dental Medicine, said he has never had a patient ask for jaw surgery for aesthetic reasons. \"There are plenty of other ways to change the jaw without surgery,\" he said. \"There are all sorts of implants and things like that. Remember, when you move the jaw backwards you make the airwaves smaller.\" Schoolgirl Kang NaYeon is still unsure about having surgery in Korea. \"A small face is pretty,\" she says. \"But creating a V-line is so dangerous. When people do it here, they update their will first in case of emergency.\" NaYeon shudders. She has some hope for change in Korean beauty -- but it's not what you might think. \"I think if technology gets more advanced, maybe in the future everyone will get surgery, and then everyone will be beautiful!\" Hailey Kim is still saving up for her operation, and sees no reason not to go through with it. \"There is nothing wrong with accepting yourself or changing yourself to be happy. Whatever you decide to do, people will always judge you, but they can only bring you down if you let them.\" As Koreans and Korean Americans embrace this possibility of transformation and take it to what may seem to be extremes, it can also be seen as a natural progression for those raised in a culture with enormous pressure on its citizens -- another box ticked on the way to being the best. ",
    "title": "The K-Pop Plastic Surgery Obsession - The Atlantic",
    "datetime": "2013-05-24T17:20:54Z",
    "url": "https://www.theatlantic.com/health/archive/2013/05/the-k-pop-plastic-surgery-obsession/276215/"
}