{
    "text": "Cory Turner Teachers, parents and politicians have long wrestled with the question: How important is preschool? A new answer comes in the form of a study — out of Vanderbilt University in Nashville, Tenn. — that is as clear as it is controversial. The focus of the research is Tennessee's Voluntary Pre-K program. It's state-funded preschool on a grand scale, serving 18,000 of the state's poorest children, costing about $86 million a year and built on one big assumption: That the answer to that earlier question is, \"Very.\" And Vanderbilt researcher Dale Farran says that at first glance, her team's results showed a big positive impact. \"The children who'd had the Voluntary Pre-K program were much better prepared for kindergarten by all of our achievement measures — significantly so,\" Farran says. The Vanderbilt researchers followed nearly 800 children through the program along with a smaller control group of kids, most of whom did not attend pre-K. Here's where the controversy starts: By the end of kindergarten, Farran noticed something odd in the data: \"The children who had not had pre-K caught up,\" she says. Keep in mind, all of the kids in the study are low-income, which makes the team's next headline even stranger. \"By the end of second grade,\" Farran says, \"the children who'd had state pre-K were underperforming the control children. And that continued into third grade.\" Let me repeat that: The kids who'd gotten no pre-K started doing a little better than the kids who got state-funded pre-K. That kind of return on investment would make any politician queasy. And Monday, Tennessee Gov. Bill Haslam made clear he'll be doing a cost-benefit analysis. \"We'll take this as data to evaluate [the program's] effectiveness versus other things that we might do — increasing technology, paying teachers more, other investments that we want to make in K-12 education,\" Haslam, a Republican, told reporters. The Tennessee governor also said something surprising in light of the findings — that he still believes \"quality\" pre-K can have an impact. It turns out that one word — \"quality\" — is the secret decoder ring you need to understand this study and its remarkable findings. \"If your program isn't very good, you can't expect it to have long-term impact on kids,\" says Steven Barnett, director of the National Institute for Early Education Research at Rutgers University. He helped create the benchmarks that many states use to measure the quality of their pre-K programs. Barnett says Tennessee's program looks good on paper but that the state made a few key mistakes when it scaled the program up to more than 900 classrooms across 95 counties. First, it created no mechanism for quality control to make sure teachers were following best practices from one end of the state to the other. Also, Barnett says, the state underfunded the program. That's why Vanderbilt's Farran says her research is not a failing grade for all preschool. \"It's like saying spinach is really good for you,\" Farran says, \"but we can't afford spinach. But here, I've got this Easter grass. Maybe that will be just as good.\" That's right, Easter grass — that shiny, plastic stuff you layer into an Easter basket. This isn't the first report to show no lasting benefit from pre-K, and it's likely that it won't be the last. But it doesn't contradict research like this, this and this that show high-quality preschool can work. The difference is, some of the biggest benefits have come from relatively small, expensive programs that reached children earlier and often provided more services. The challenge for states is not figuring out what works. It's figuring out how to pay for what works — then make it stretch across a state without turning spinach into plastic. Sponsor Message Become an NPR sponsor ",
    "title": "The Tennessee Pre-K Debate: Spinach Vs. Easter Grass : NPR Ed : NPR",
    "url": "https://www.npr.org/sections/ed/2015/09/29/444217919/the-tennessee-pre-k-debate-spinach-vs-easter-grass"
}