{
    "text": "By Park Jin-ha Last Saturday, the CGV cinema in Seoul was turned into a something resembling a concert hall. Fans waited in long queues to watch live concert footage of K-pop megastars BTS on the big screen. And just like at the real concert, fans chanted the names of the BTS members and passionately waved glow sticks. Love Yourself in Seoul, a documentary released on Saturday that focused on BTS’ “Love Yourself” concert series in the city, attracted more than 180,000 people over two days, making it the country’s second-biggest ever opening weekend for a film. It is BTS’ second film in just two and a half months. Its first, Burn the Stage: The Movie, garnered an audience of 2 million in some 70 countries and regions following its release in November 2018. Their second documentary was released in 3,800 cinemas in 96 countries including the US and the UK on Saturday. But it’s not just films – the power of the BTS brand is being felt industry-wide. Along with BTS films, the stories of the seven-member boy band have been or will be made into books, digital comics and mobile games. The upcoming BTS book and the BTS digital comics titled Save Me, unveiled through the Naver Webtoon digital comics service platform earlier this month, share BTS’ world views, as featured in their The Most Beautiful Moment in Life music videos. The BTS book, to be officially release on March 5, is titled The Most Beautiful Moment in Life: The Notes 1 and depicts the anxieties and uncertainties of young boys as they confront their futures. In the form of a diary, it builds on a theme that runs through the booklets contained in BTS’ The Most Beautiful Moment in Life album from 2015. The 234-page book will be published in Korean, English and Japanese. The web shop for BTS’ label, Big Hit Entertainment, started taking pre-orders on January 21. While there have been many books published about BTS since the band rose to global stardom, expectations are high for the upcoming book as it is the first put together by BTS’ agency and because BTS members are known to borrow from literary works and enjoy reading in general. Observers note that BTS’ cross-industry movement is different from other K-pop artists. “Everything about BTS is different from existing K-pop groups, from their inception to the way they have created a phenomenon,” pop culture critic Kang Moon said. “Usually, when artists are satisfied with just creating music, they lack the motivation to exert a social influence, but BTS have become a social sensation by sending various messages and are continuously communicating with fans around the world by creating omnidirectional content.” One music industry insider points out that BTS have succeeded in achieving global fame similar to the Marvel comics universe. “BTS have established a solid domain in the global content market. As seen in Marvel films and cartoons that pursue a shared world and have expanded into various content channels, BTS have created an overarching theme that branches off to expand and develop content across various genres and media,” the official said. ",
    "title": "The power of K-pop supergroup BTS is felt industry wide as band release films, books and comics | South China Morning Post",
    "datetime": "2019-01-30T02:32:53+08:00",
    "url": "https://www.scmp.com/culture/music/article/2184058/power-k-pop-supergroup-bts-felt-industry-wide-band-release-films-books"
}