{
    "text": "Meet Twice, the nine-member girl group taking over your 2020. If you’ve found yourself coming across Korean pop music on your Spotify playlists, blasting from the speakers at your favorite coffee shop, or dominating your television screens, you’re not alone. K-pop is not only a popular music genre, it’s one that’s already taken over the world. And, yes, it’s evolved far beyond the genre solely relegated to a certain sunnies-sporting, Gangnam style-rocking, middle-aged man. Almost a decade later, the biggest pop groups, hottest singles, and best music videos happen to be imported from South Korea. Chances are, you’ve probably heard of at least one of them, like the mega-popular BTS. The seven-member group who have gone on to sell out stadiums for their tours worldwide aren’t only the biggest K-pop act, they’re the hottest boy band in the world. Period. Of course, BTS is hardly the only K-pop band becoming a household name. The girls are slaying it too. In particular, Twice, a nine-member band with ladies from Korea, Japan, and Taiwan, is becoming the highest-selling girl group in Asia. The band has hit singles ranging from “Cheer Up,” “TT,” “Knock Knock,” and last year’s bop “Fancy You.” Since their debut in 2015, Twice have gone on to win 90 music awards and sell out stadiums from Japan to the United States, all while becoming the most popular girl group in K-pop history. And they’re coming to take over the Western world as well. Their latest EP, Feel Special, is their eighth Korean album and arguably most popular to date, beating their previous record for first-week sales. The album’s eponymously titled lead single eventually hit number one on Billboard’s World Digital Song Sales. “Feel Special” is an uplifting track with a bright, groovy bass beat in the background and revealing lyrics up front, with the women unafraid to show their true selves to the world. It’s especially empowering as one of the group members, Mina, has taken a temporary leave of absence after announcing her experiences with anxiety. “I just wanted to hide / Didn’t wanna face the world,” the lyrics go. “Then you appeared before me / With a warm smile.” Harper’s BAZAAR caught up with the girls—Nayeon, Jeongyeon, Momo, Sana, Jihyo, Mina, Dahyun, Chaeyoung, and Tzuyu—to talk about their career, new year goals, and, of course, fashion and beauty. Nayeon: Being in the public eye and basically growing up in the spotlight, we are always responsible for our actions. Because we have done so many amazing things and grown so much in the last few years, I believe I’ve definitely matured and realized how special the people in my life are to me. Dahyun: I’m always thinking about something new, something cool that we can do to make our fans happy! These thoughts, and efforts to make those thoughts come true, really help me grow as a person. I always keep in mind that being Twice, we will of course be in the spotlight, but that attention is amazing because it means people are supporting us. I appreciate all the people who give us love. Jeongyeon: The end of the year is coming up quickly, so our team is preparing for award ceremonies and performances. We are so busy these days! My resolution for 2020 is to have a healthier and more positive mind-set than in 2019. Mina: I’m getting ready for 2019 to end and am looking forward to 2020! Same as Jeongyeon, I want to be healthy and happy in the new year. Jihyo: Of course, there are things I regret, but I try not to think too much about it because I know that I cannot change them! Instead, I try to be positive and make different choices when I find myself in a similar situation. Why regret things you can’t change when you can just learn and grow from them? I think it’s hard to have a proudest moment to date, because I never know what’s coming! Something that I’m proud of now can be replaced with something even better in a week, who knows. I think it’s all about moving forward. Chaeyoung: My answer is quite different from Jihyo’s. I don’t regret anything! Maybe there’s something, but since I can’t remember it, it must have not been that big of a deal. For me, the proudest moment was when we won first place in the music show program. Momo: We get to wear a lot of pretty and fancy clothes for our performances and videos, so in my daily life, I like to be really comfortable. I love to wear training suits, but if I’m in the mood to dress up a little nicer, I do! Jihyo: During “Cheer Up” and “TT,” I used to wear really bright and vivid-colored clothes that fit the team’s concept. However, these days, I am really liking more fancy and mature styles. Jeongyeon: Actually, no. I change into comfortable clothes and head to the airport just like that. It is too much of a hassle to change clothes when you’re on the plane. Mina: Same as Jeongyeon, I don’t change either. Instead, we like to bring masks or hats to cover our faces. Nayeon: I usually choose to wear more comfortable clothes! No matter how pretty or designer the clothes are, I don’t like to wear anything that is uncomfortable. That’s why I have various styles of training suits. Sana: I think I wear various kinds of clothes, not really limited to a certain style. But when it gets colder, I love to go for furry clothes, like the teddy bear jackets. I also like to wear cardigans and mufflers. Rose gold is my favorite color, so those are the accessories that catch my eye first. Chaeyoung: I am totally in love with vintage clothes. I am really into the hippie look and pieces like vivid-colored stockings. I also love customizing my own clothes! My favorite designer is Vivienne Westwood. I love her makeup and her overall style. Nayeon: I really loved the look from “Dance the Night Away.” Usually summer colors and vibes go well with Twice, I think, because we’re bright and fresh. Also, I liked the purple color concept of “Feel Special,” but that’s just because my favorite color is purple! Sana: My favorite look has to be from “Feel Special.” In the video, I had the wet pink hair, which looked like I was out in the rain. I also tried more tone-downed makeup, which was quite different from what I usually get. It was definitely new for me, but I liked experimenting with my look. Also, the scene where I’m wearing a blue dress, I really liked the hair and makeup there. Dahyun: I usually shop online. My whole style mantra is that outfits should be comfortable. I think Once might know this, but I have a lot of comfortable clothes. My checkered-style pants that I wore to our fan meetings are one of my favorite pieces. Tzuyu: I like to shop both online and in-store. I wear and buy clothes that catch my eye. It can be anything I think will look good. I don’t have my own philosophy about clothes, because I think everyone has their own unique style. My style even changes based on my mood. Momo: I try to be very cautious when washing my face. Washing your face for too long is not good for your skin, so I always keep a small timer next to me to tell me how many seconds I have to wash each part of my face. I also love face masks. Tzuyu: My skin is quite dry, so I always make sure my skin care products are very moisturizing. Jihyo: My favorite product is lip balm. My lips get very dry easily, so I’m always applying lip balm. Sometimes when I needed it most, I could never find a tube, so now I make sure I have different kinds of lip balms here and there, so it’s ready for me whenever I need it. Mina: My favorite and absolute must-have product is cleansing oil. Because we are onstage so often, we are always wearing heavy makeup. It’s so important for us to take all the makeup off when we’re done with our shows, so we can’t live without the cleansing oil. Taking your makeup off is just as important as putting it on, I believe. Chaeyoung: I don’t have a favorite makeup product, but I am always thinking of how I can enhance my beauty from the inside. What you put inside your body is very important and helpful too. For example, I try to eat a lot of vegetables to get glowing skin. Nayeon: I am pretty bad at doing my makeup myself, so these days, I am learning from a makeup artist. I treat my face as a sketchbook and am gradually trying things that I learned from the artist. Jeongyeon: I also learned from makeup artists like Nayeon said. Whenever we had free time from our busy schedules, I would be practicing in the dressing rooms. When I’m going about my daily life and not performing, I don’t wear makeup so that I can let my skin rest. Sana: I try and follow what our makeup artists show us, but it never works as well as when they do it! I guess there’s a reason they are the experts in their field. Mina: Preparing for our stage performances would be a good example. We get to wear amazing outfits and have really pretty makeup, it’s so much fun to dress up. We always want to put on a good show, so we have to memorize all the choreography and make sure we’re keeping high energy levels throughout the show. The costumes and makeup are like our armor; we become more confident and powerful in them onstage. We feel like we can face anything! Sana: I agree! Of course, everyone’s goal is to be just as confident without fashion and beauty, but of course, those things do help with that. For instance, I love to try different lip colors, and with every different color lipstick, I feel my whole energy and vibe change. Beauty and fashion are so powerful. Momo: At first, not having Mina with us made us all feel lonely, and there was an emptiness without her. However, Mina is trying her best to participate, so even when she’s not with us in person, she’s still always with us in spirit. I really thank her for being there when she can, but I do believe that all members being healthy and happy is the priority. Sana: Not having Mina there really made me realize that I have to cherish people and show them I love them as much as I can. Everybody has their own hardships and their own struggles. Because of this, I think we became a stronger team overall. Tzuyu: We were all relieved to hear that Mina will come back after resting. I am sure that she will join us onstage again someday, and I really thank her for doing her best to overcome her struggles. She thought about us and cared for us, even when she wasn’t feeling well, and we all want her to get better. We really depend on each other to get through any hardships in our lives. Jackson Howard and Jonathan Escoffery on Books Hozier, King of Whatever You Need Him to Be Roxane Gay Has Opinions Cleo Wade Wants You to Embrace the Heartbreak Latine Stories and Magical Realism The 10 Most Memorable Hip-Hop Fashion Looks A New Bad Bunny Album Arrives This Friday See All of Beyoncé’s Major Renaissance Tour Looks Eight Latinx Artists Reshaping NYC’s Art Scene Safiya Sinclair’s Escape Through Beauty Jorja Smith Regains Control on “Falling or Flying” Beyoncé’s Renaissance Tour Is Headed to Theaters A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "title": "The Biggest K-pop Group in the World on Fashion, Beauty and the Struggles of Fame",
    "datetime": "2020-01-24T14:00:00Z",
    "url": "https://www.harpersbazaar.com/culture/art-books-music/a30551139/twice-k-pop-interview/"
}