{
    "text": "Professor of Anthropology and Folkore, University of Oregon Philip W. Scher does not work for, consult, own shares in or receive funding from any company or organisation that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment. View all partners On Jan. 22, Ursula K. Le Guin died in Portland, Oregon. Since then, much has been written memorializing her genre-defying body of work, her contributions to feminism and science fiction, and her broad interest in human society and government. But as a cultural anthropologist, I’ve always been interested in the relationship between Le Guin and her father, anthropologist Alfred Louis Kroeber. Kroeber’s ideas – which had a profound influence on his daughter’s writing – stemmed from an important development in the discipline of anthropology, one that viewed human culture as something that wasn’t ingrained, and had to be taught and learned. Kroeber’s mentor was a Columbia University anthropologist named Franz Boas. Kroeber was especially drawn to Boas’ newly developed notion of culture and the broader theory of “cultural relativism.” Cultural relativism emerged in the late 19th century as an alternative to theories like social Darwinism that linked culture to evolution. These theories – widely accepted at the time – tended to rank human societies on an evolutionary scale. Not surprisingly, Western European civilizations were seen as the pinnacle of culture. But Boas proposed something radically different. He insisted, based on field-based research, that humans live in stunningly diverse cultural worlds shaped by language, which creates institutions, aesthetics, and ideas and notions of right and wrong. He further argued that each society needs to reproduce its culture through teaching and learning. Kroeber described culture as “superorganic.” According to this idea, the “civilizational achievements” of any group of people weren’t passed down biologically and could only be taught. If we’re deprived of our access to human instruction – books, guides, teachers – we won’t know how to build buildings, write poetry and compose music. Humans, Kroeber knew, are hardwired to create, but there’s no such thing as a “hereditary memory” that allows a people to intuitively know how to recreate specific things. He told the hypothetical story of a baby taken from France and brought to China. She would, he argued, grow up speaking perfect Chinese and would know no French. His point – as obvious as it might seem today – was that there was no hereditary quality to “Frenchness” that would carry over, genetically, to a child born of French parents. The idea of culture as “superorganic” says that people are organic lifeforms, like ants or dogs or fish, but culture is “added” to them, which influences their behaviors. Ants and dogs don’t need culture to reproduce their behaviors: Raised in isolation from their own kind, they still do the things they were programmed to do. Kroeber, along with many of his fellow anthropologists, were drawn to these ideas because they depicted culture as universally human, but not universally rankable, racially predetermined or inherently more or less sophisticated. For example, it was common in the late 19th century for expansionists to justify their imperialist ambitions with “scientific” evidence that Native Americans were culturally inferior. They pointed to language: Native Americans, they claimed, didn’t have words for the passage of time. For this reason, they couldn’t grasp a complex concept like history. But Kroeber and his colleagues pointed out the Hopi did have a complex way of reckoning time. They just didn’t count things, like days or hours, using the same terminology they might use to count men, or rocks or clouds, which are objects you can actually see. To the Hopi, a day is in no way like a rock. So it shouldn’t be treated as such. Kroeber’s peers included African-American anthropologist and folklorist Zora Neale Hurston, Jewish linguist and anthropologist Edward Sapir, and female scholars such as Ruth Benedict and Margaret Mead. All grappled with discrimination and cultural denigration. In response, Kroeber was compelled to write that history, geography and the environment influenced cultural differences. No culture simply emerged naturally. “Social agencies are so tremendously influential on every one of us,” he wrote, “that it is very difficult to find any test that, if distinctive racial faculties were inborn, would fairly reveal the degree to which they are inborn.” The only reason, according to Kroeber, that someone would insist on innate  differences between human population would be to preserve the status quo: societies built on racial discrimination and colonialism. Throughout her childhood in Berkeley, California, Ursula Le Guin was exposed to these ideas. They very likely formed the basis of her worldview. Her writing was never simply about creating a magical or strange world. It was about crafting a laboratory to play with identities – race, ethnicity, gender, sexuality or class – in a way that forced readers to think about how cultural prejudice colored their views of other people. “Entertaining them is all well and good,” she told New York Times reporter John Wray, “but does it make them think?” With Le Guin, it always struck me that the point of her imagined universes was precisely to show that nothing human was universal, and that what was “alien” was only a matter of perspective. In “The Left Hand of Darkness,” Le Guin tackled the idea of gender norms. Here, I think she was channeling Margaret Mead’s breakthrough study “Sex and Temperament in Three Primitive Societies,” in which Mead was able to demonstrate that gender norms can significantly diverge across cultures. In “The Word for World Is Forest,” Le Guin didn’t simply pen an environmentalist fable about the destruction of a forest and its people. She built off the insights of indigenous scholars like Vine Deloria Jr., who put native peoples’ voices and worldviews at the center of the indigenous rights movement. In “The Dispossessed,” she contrasts the different political systems of two neighboring worlds not to argue which one is best, per se, but to show that in order for these systems to exist, humans need to actively participate in and reproduce them. In 2015 I planned an anthropology class that I hoped could use speculative fiction and fantasy as a way to understand basic concepts in cultural anthropology. The class was built around Kroeber and Le Guin. A mutual friend gave my syllabus to Le Guin, and she wrote to me. She suggested some other works to include and seemed to appreciate the concept of the course. “I think my pa would be tickled,” she wrote, “that he and I have ended up on the same [syallabus].” Copyright © 2010–2023, The Conversation ",
    "title": "The education of Ursula Le Guin",
    "url": "https://theconversation.com/the-education-of-ursula-le-guin-90681"
}