{
    "text": "Hosted by Kurt Braunohler and with some of America’s best comics making guest appearances, this multi-format podcast is bizarre, confusing and funny Kurt Braunohler has been kidnapping people for three years now. He’s a comedian who takes his victims … er, guests to secret destinations and lets them loose. But kidnapping comedians is not Braunohler’s only interest. He also loves pets, boats and surfing, and features them all in his multi-format podcast, the K Ohle. Why you should listen: “That’s a deep question for a comedian,” says Braunohler when asked why he wanted to start a podcast. “You have to look into your soul and ask ‘Why did I begin this journey?’ Truthfully, though, I started it so people could listen to me talk more.” As a working comedian, Braunohler crisscrosses the country making people laugh in clubs and festivals all over America. He soon realized that a podcast would let him connect with fans around the globe outside of his standup shows and repeat plays of his album, How Do I Land? “When I tour, I realize that there’s all these people in the middle of the country who only have access to me through my podcast,” said Braunohler. “And it’s nice to stay in touch with people.” He didn’t want to do another podcast where a comedian talks to another comedian about comedy, though. “There are so many of those,” Braunohler said. “I wanted to make it a little different – and maybe I made it too different.” The K Ohle podcast as it now exists is not the original iteration of the show. “Originally the podcast I wanted to do was called the Boat Show and it was only me talking about boats with people,” Braunohler said. “I don’t know anything about boats, but I love talking about them.” While this may sound patently ridiculous, that happens to be Braunohler’s forte. This is a man who once jet-skied down the Mississippi river in a tuxedo wetsuit, drove a giant butt across country, and also hired a skywriter to write, “How do I land?” in the sky over Los Angeles. In that context, launching a podcast about a subject he knew nothing about wouldn’t be that strange for him. “It was going to be kind of an improvised podcast where we would pretend we were boat experts, or boatswains as we call them,” Braunohler said. “I realized that no one was going to like this other than me.” Instead, under the guidance of Nerdist, Braunohler decided to launch a multi-format podcast that combined three different shows under the umbrella of The K Ohle. There’s The Boat Show where guests like Paul Scheer, Brett Gelman and Scott Aukerman have all shown up to talk about boats. “It’s so wildly unpopular,” said Braunohler, laughing. “But it still brings me great joy.” Then there’s Pet-O-Philia, also known as The Animal Show for People Who Think Animals are Dumb, where comedians like Sara Schaefer, Jenny Slate, Chris Gethard or Braunohler’s longtime comedy partner Kristen Schaal come and talk about their beloved pets. Then there’s Get Lost, where Braunohler blindfolds his guest and drives them to a secret destination for some urban exploring. “I think the Get Lost are my favorite,” Braunohler said. “It has everything that I want in a podcast – a little danger, a little bit of history, and genuine fear.” The idea for this facet of the show came from Braunohler’s days running around the streets of New York City in the early 2000s as part of the Psychogeography Project. It was an immersive game/psychological experiment where Braunohler and his cohorts would rent three passenger vans, fill them with up to 45 blindfolded (willing) participants, and drive them to undisclosed locations around New York. They would then have to figure out where they were and then race each other to get home. “So I was familiar with blindfolding people and taking them places,” explained Braunohler. “I thought it would be a great podcast even though it goes against the idea of a podcast, in that I’m taking people somewhere and we’re just describing weird places.” It is not a typical podcast interview, but it makes for a surprisingly fun listen, even when, occasionally, the guests get truly frightened during their investigations. “Rory Scoville was definitely scared at the abandoned nuclear missile silo I took him to,” Braunohler said. The show’s unusual format has worked, too. Over the last three years the K Ohle has welcomed a roster of guests made up of some of the brightest comedy talent in America, including Nick Kroll, Kumail Nanjiani, Paul F Tompkins, Eugene Mirman, Grace Helbig, Jonah Ray, Emily Heller and many more. He’s also been known to make the show a family affair, interviewing his wife, comedian Lauren Cook, and even his dog, Zelda. From time to time Braunohler throws a new format into the mix. There are Emotional Hangs and JKs where Braunohler works solo, and Killer Rips, where he goes surfing. In short, you never know what you’re going to get when you tune in to The K Ohle, but that’s half the fun. Where to start: The Boat Show with Paul F Tompkins; Get Lost with Jad Abumrad and Julia Solis; Pet-o-Philia with Kristen Schaal This article contains affiliate links, which means we may earn a small commission if a reader clicks through and\n        makes a purchase. All our journalism is independent and is in no way influenced by any advertiser or commercial initiative.\n        By clicking on an affiliate link, you accept that third-party cookies will be set.\n        More information. ",
    "title": "The K Ohle: a comedy podcast to get lost in | Culture | The Guardian",
    "datetime": "2016-02-20T13:00:50.000Z",
    "url": "https://www.theguardian.com/culture/2016/feb/20/the-k-ohle-a-comedy-podcast-to-get-lost-in"
}