{
    "text": "LAS VEGAS, NEVADA - OCTOBER 15: Abraham Ancer of Mexico celebrates with his caddie Benji Thompson ... [+] after holing out from the 14th fairway for a double eagle during the second round of THE CJ CUP @ SUMMIT at The Summit Club on October 15, 2021 in Las Vegas, Nevada. (Photo by Christian Petersen/Getty Images) A Korean conglomerate is hosting the CJ Cup this weekend on the heels of a massive moment for the country’s golf clout. Last Sunday for the first time Korean players won simultaneously on the world’s top golf tours. Sunjae Im topped the leaderboard at the Shriners Children’s Open while red-hot Jin Young Ko went wire to wire at the Cognizant Founders Cup shooting 63, 68, 69 and 66 to tie Annika Sorenstam’s 14 consecutive rounds under-70 record. The first three editions of the CJ Cup were staged at the Nine Bridges Golf Club on South Korea’s JeJu Island before hopping the Pacific and relocating to Nevada last year due to pandemic travel restrictions. While the Seoul headquartered holding company originally intended their golf tournament’s move to the Las Vegas area to be one and done, Covid-19’s staying power scuttled their best laid plans. While Korean golf fans watch the leaderboard action at the Summit Club and wait for their country’s lone PGA Tour stop to return home, the title sponsor is utilizing the event as a strategic vehicle to promote the global expansion of their shelf stable food brand Bibigo. The line of mandu dumplings, ready-made meals, go-chu jang sauces and Korean BBQ marinades are now distributed across the country in stores like Costco, Harris Teeter, Kroger\nKR\n, and Walmart\nWMT\n. Twenty-one percent of Bibigo’s 2020 international sales came from the U.S. last year and the company projects that figure will continue to strengthen. “We made a significant improvement in our product distribution in grocery channels which is up over 60% and Bibigo’s dumpling products achieved the No. 1 market share in their product category in June of this year,” Wookho Kyeong, chief marketing officer of CJ CheilJedang, says. “Our vision is to make Bibigo a global brand and for every consumer on the globe to have our products in their pantry or freezer. We want to be a part of their everyday life. To do that we need global marketing tools to expose our brand to increase awareness among global consumers and the CJ Cup in that respect contributes a lot and is televised across the whole world,” he adds. EL SEGUNDO, CA - September 20:  Jeanie Buss, CEO / Governor / Co-owner of the Los Angeles Lakers, ... [+] left, and Sun-Ho Lee, Bibigo Head of Global Business Planning, hold a jersey featuring the Bibigo logo, as the Lakers host a 2021-2022 season kick-off event to unveil and announce a new global marketing partnership with Bibigo, which will appear on the Lakers jersey at the UCLA Health Training Center in El Segundo on Monday, Sept. 20, 2021. (Allen J. Schaben / Los Angeles Times via Getty Images) The company’s experience with the CJ Cup whet their appetite to pursue a bigger sports marketing deals. Last month in a big marketing flex, Bibigo signed a $100 million jersey patch deal with the Los Angeles Lakers. “Our thought was we better connect with Generation Z who are more digital savvy media consumers. To [reach this audience] basketball is the right tool and the Lakers is the perfect match,” Kyeong says The brand did have a recent misfire in their U.S. expansion plans in 2019 when they opened a few locations of a build your own bibimbap bowl chain called Bibigo Kitchen in 2019 that would completely shutter in less than a year. In retrospect Kyeong admits that the build out may have been mistimed, but he believes the fast casual concept may still have merit. “My personal point of view is we opened Bibigo restaurants too early when there was not a solid base of Bibigo awareness and product distribution. Possibly we will bring it back when we believe that our packaged food in supermarkets and club channels is able to create synergy with the restaurant business. When the time is right, we can consider it,” Kyeong says.  ",
    "title": "The CJ Cup’s Extended Vegas Vacation Has Helped K-Culture Proliferate",
    "url": "https://www.forbes.com/sites/mikedojc/2021/10/16/the-cj-cups-extended-vegas-vacation-has-helped-proliferate-k-culture/"
}