{
    "text": "Government support for creative industries, and marketing, created new cultural perceptions.  The sweeping popularity of South Korean pop culture, known as ‘Hallyu’, is a modern phenomenon; a reinvention of the small Asian country through the export of its music, TV, beauty products, food and technology, which have gained unprecedented popularity across the continent and beyond. While the roots of K-pop date back two decades, it was the 2012 smash hit ‘Gangnam Style’ that really catapulted the genre onto the international stage. The video for the song became the first on YouTube to surpass 1 billion views (it has now passed 3.2 billion), landing singer Psy shows around the world and even a meeting with then-UN Secretary General, Ban Ki-Moon. K-pop was firmly on the map, and the Korean government was an active supporter. Keen to boost the economy, it invested in subsidies for the creative industries, marketing campaigns capitalising on its cultural and entertainment industries and tax-free shopping destinations for visitors. Neighbouring China is one of the biggest markets for ‘K-Beauty’, soap operas and music, and the Korean Customs Service says exports of South Korean cosmetics to China increased 87% in January year-on-year to reach US$151 million. Soap operas from Korea enjoy phenomenal popularity. ‘Descendants of the Sun’ was the first Korean drama to be released simultaneously in both countries, notching up billions of Chinese views. But Hallyu is much more than a regional phenomenon. This year, seven-member South Korean boy band BTS—who have 16 million followers on Twitter and have released their own special edition cans of Coca-Cola—became the first K-pop stars to make the No.1 spot on the US ‘Billboard 200’ chart. Views of the top 200 K-pop artists have tripled since ‘Gangnam Style’ in 2012, according to YouTube: they were watched 24 billion times in 2016, with 80% of views coming from outside South Korea. Streaming services QQ Music, Spotify, Apple Music and AccuRadio now have dedicated K-pop channels and in the US there are even K-pop festivals, like Kcon. In December, K-pop fans sponsored ad campaigns in New York’s Times Square and the US streaming site Twitch, a subsidiary of Amazon, has also recently announced a deal to exclusively stream 26 Korean dramas. Thanks to Hallyu, South Korea has created new cultural perceptions and is now considered\na global hub for pop culture, fine cuisine, high-tech cities and unique entertainment superstars. Top news, insights and analysis every weekday Sign up for Campaign Bulletins A Mindshare China loyalist of over 24-years, Low is instrumental for commercial gains as well as client and staff retention. SOUNDING BOARD: Head of Instagram, Adam Mosseri, admitted earlier this year that users have moved away from traditional social media platforms to direct messages, closed communities, and group chats. But is ad spend moving to reflect this shift? Taking over from incumbents TBWA Singapore, TSLA's remit will include all integrated campaigns, marketing strategy, product campaigns, digital and social communications development, and more. Following the reveal of Asia's F-list by Clean Creatives this week, Research director Nayantara Dutta opines why even if creatives and agencies have the best of intentions, they may still end up being complicit with polluters in Asia. Terms & Conditions / Contact Us © Haymarket Media Ltd. ",
    "title": "\r\n\tThe ‘Hallyu Wave’: How Korean culture spread across the world | Marketing | Campaign Asia\r\n",
    "url": "https://www.campaignasia.com/article/the-hallyu-wave-how-korean-culture-spread-across-the-world/447647"
}