{
    "text": "The Plant drew on the chicken and beer joints of Korea and their offspring on New York’s Lower East Side in creating the brilliant branding and interiors for Wing Wing, a new fast food spot in central London. Written by:\n    Emily Gosling 23 June 2017 All bright popping colours and Memphis-like patterns, the energy of the whole thing is inspired by K-Pop. The agency created a bespoke wordmark which features the Korean characters for \"Chimaek\", and a was logo created from the “WW” to be used across the identity. \"The bright colours and bold graphics are matched with equally provocative copy, creating a fun, engaging experience,\" says The Plant. These are echoed in the interiors of the space, which use abstracted patterns and see cute little icons adorn the concrete walls and floors. All in all, it’s a knowingly Instagram-savvy spot. \"A hyperreal space that reflects the colour and energy of K-Pop, the aim of the space is to create a mood that's both fast food and cool bar,\" the agency adds. The Plant’s designs are shown across all touch-points including the Wing Wing menu systems, website and uniforms. Share: Twitter\nPinterest\nFacebook 28 September 2023 20 September 2023 19 September 2023 19 September 2023 18 September 2023 Join 45,000 creatives to enjoy a regular dose of inspiration and motivation, delivered to your inbox every Tuesday. Check your email to complete signup. Newsletter signup confirmed. Thank you! Please enter a valid email address. 19 October 2023 19 October 2023 19 October 2023 18 October 2023 19 October 2023 24 October 2023 22 June 2017 23 June 2017 23 June 2017 22 June 2017 23 June 2017 22 June 2017 22 June 2017 23 June 2017 🎉 Check your email to complete signup Creative Boom celebrates, inspires and supports the creative community. Launched in 2009, we explore the best in creativity and deliver news, inspiration, insight and advice to help you succeed. Creative Boom™ © 2023 Creative Boom Ltd. Registered in England and Wales #07437294. ",
    "title": "The Plant's K-Pop inspired, Memphis-like branding for Korean fast food joint Wing Wing | Creative Boom",
    "datetime": "2017-06-23T07:00:00+01:00",
    "url": "https://www.creativeboom.com/inspiration/the-plant-wing-wing/"
}