{
    "text": " Robert Hiltonsmith studies retirement security and has written on the subject for The Washington Post and Newsweek.\n                \n                    \n                    Demos\n                    \n                \nhide caption Robert Hiltonsmith studies retirement security and has written on the subject for The Washington Post and Newsweek. A couple generations ago, when older Americans retired they could rely on pension plans to support them. Then, in the late 1970s and early 1980s, many companies switched their retirement plans over to 401(k) accounts. The security of workers' retirement savings suddenly became subject to the vagaries of the stock market. What's more, the financial institutions that manage 401(k)s charge a host of hidden fees to plan participants, says Robert Hiltonsmith, a policy analyst at the New York-based think tank Demos. He researches retirement security, tax policy, health care and the labor market. \"There's a good reason that people don't know they pay fees,\" Hiltonsmith tells Fresh Air's Terry Gross. \"[It's] because when you open up your statement there's not a table right there in front of you ... — especially before some recent reforms — just saying, 'Here's the fees and here's what you paid,' or it's not like as part of your statement, 'OK, here's your returns and then minus the fees.' \" Hiltonsmith says these fees are where financial companies find the money to pay their expenses. \"[T]hat's a bad thing,\" he says, \"because [the fees] can have a really big effect on whether you end up with a decent-sized nest egg or, you know, are looking at it in horror at age 65 or 67.\"  All the risks fall on the individual, Hiltonsmith says. \"Now,\" he says, \"you can work as potentially hard as possible and play by the rules and still not be able to retire with some dignity.\" TERRY GROSS, HOST: This is FRESH AIR. I'm Terry Gross. If you're worried about how you're going to afford to retire, whether that's in the next few years or the next few decades, this interview is unlikely to make you more optimistic, but you'll probably learn a few things you didn't know about personal retirement accounts like 401(k)s.For example, did you know that you pay fees to the financial services company that manages your retirement account? And those fees can add up to a lot of money without you even realizing it. My guest, Robert Hiltonsmith, is a policy analyst at Demos, a public policy research organization. He provides research and analysis on retirement security, tax policy, health care and the labor market.You may have seen him on the recent PBS \"Frontline\" edition called \"The Retirement Gamble.\" Robert Hiltonsmith, welcome to FRESH AIR. Before we talk about some of the things most people don't know about their own 401(k)s, may I ask: How old are you?ROBERT HILTONSMITH: I am 31 years old, Terry.GROSS: Most people aren't thinking about retirement at your age, and people who are contributing to retirement funds at your age usually are trying to contribute as little as possible. So what got you so interested in learning about 401(k)s and retirement options?HILTONSMITH: Well, I have noticed a lot of people my age, it isn't exactly the first topic that draws them, even people who get into economics, you know. But I think it was a pretty natural draw for me. You know, my grandparents actually never went to college, worked hard their whole lives, my father's parents this is, and retired honestly to a pretty meager retirement.They had Social Security, which is great, and it was wonderful, but that was basically all they had. My dad was the first person in his family to go to college, actually got a Ph.D., now is about to retire and is hopefully going to get to retire with at least some measure of comfort. And so just seeing what's supposed to be part of the American dream, you know, or the American middle class being able to work hard and then retire with some measure of comfort and then seeing - looking at myself and my generation and worrying about that, all of a sudden I was like, you know, people don't talk about this enough, but they should be.GROSS: So let's start with the basics, with 401(k)s. I'm not going to assume that everybody knows what they are. I want you to explain what a 401(k) is.HILTONSMITH: Sure, no, I think it is an often confusing topic, which is part of the problem with it, honestly. So 401(k)s are one type of these individual accounts, 403(b)s, 457s, IRAs, they're all in the same kind of class. And what they all are is, like, individual retirement savings accounts where you or your employer,  sometimes if you're lucky enough, can put money every paycheck or every year into it, and it's invested in some kind of stocks, bonds, assets.And then when you're hoping to retire, you have what you and your employer have put into it. And this is, you know, in contrast to the traditional pension, which is what my parents and previous generations had, which really promised a kind of set benefit for a number of years of service. So you work 30 years, and you get X amount, right, versus the 401(k), where you get out what you put in.GROSS: Plus any profits from the stock market because usually in a 401(k) or any of these other plans, you're investing in a mutual fund, and if the fund goes up, you've got more money, but of course if the market tanks and your fund goes down, you've lost money, you've lost money that you put away in your retirement account.HILTONSMITH: Right, and that's indeed one of the major problems with them and one of the real drawbacks to them when compared to these traditional pensions, right. And we've seen the weaknesses of that in the past, you know, several years especially but past 10 years really. You know, people have been looking at their 401(k) statements, those of whom are brave enough to open them even, as I am even myself not sometimes, you know, and seeing, geez, this thing isn't really going up at all, or it's going way down, you know, and that's a - that's really one of kind of the drawbacks to them is that, you know, you are completely dependent on these financial markets, which as you know can be pretty opaque and a scary place to have your money these days.GROSS: Most people don't know that there are fees involved with their 401(k)s. What are these fees? Because there's different kinds of fees that your money in your retirement account might be subject to.HILTONSMITH: Right, no, there are indeed many types of fees, and there's a good reason that people don't know that they pay fees because when you open up your statement, there's not a table right there in front of you, or there wasn't especially before some recent reforms, you know, just saying here's the fees and here's what you paid.Or it's not like as part of your statement you see OK here's your returns and then minus the fees. They are pretty hidden. But there are indeed on every account lots of different fees that you pay for investment management, for account bookkeeping, for the advertising of the Fidelity or E*TRADE advertisements you see on TV. You pay for all of those costs because for these mutual funds and other financial companies, that's the only place they get their revenue from is from you, is from the assets you've entrusted to them.So there's actually a huge myriad of them, but they are really hidden, unfortunately, and that's a bad thing because they can have a really big effect on whether you end up with a decent sized nest egg or are looking at it in horror at age 65 or 67 or whatever.GROSS: So are these fees like flat fees, or are they a percentage of everything that you have in your account, or are they a percentage of what you've earned that year in profits? How are they calculated?HILTONSMITH: Well, in some ways it might be more appropriate if they're a percentage of the profits, since that's what we're giving our money over to these mutual funds and companies for, right, is to actually earn us a return. But unfortunately they actually area percentage of what your total assets, what you actually have, your total account balance.So, you know, these fees are bundled, and if you dig deep into these documents, they're kind of summarized under this expense ratio, though there are actually more fees than that, and the expense ratio might be one percent, for example. So every year you pay one percent of everything you've got in your retirement account.So if you've got $50,000, you pay one percent of that or 500 bucks.GROSS: So if you have $50,000, and you pay 500 bucks in one year, I mean that's a lot, but how does that change over all the years that you're working, say over 30 years or 25 years or more?HILTONSMITH: Exactly and that's where these fees really add up because you might think oh, I paid 500 bucks, well that's a lot, but it's not that much. But really you pay 500 bucks this year when you're 30 or 35, and that $500 that you paid, if you hadn't had to pay it, would have been sitting in your account hopefully accumulating returns and would have turned into much more than that by the time you got to retirement age.So that's the real hidden part of these fees. Not only are they not out there and up front, but you don't really realize how much they can cost you over a lifetime.GROSS: So let me see if I understand this correctly. So say I have $50,000 in my retirement account, and I've paid a one percent fee on that this year, $500. Next year, I have $52,000 in my retirement account. I'm going to have to pay that one percent fee again not only on the extra $2,000, but on the $50,000 that I paid one percent on last year, right...HILTONSMITH: That's exactly right.GROSS: I'm paying one percent on that same money every year that it's in the account.HILTONSMITH: That's a really good way to think of it actually. You pay that fee on what is in essence the same $50,000 base over and over and over and over again. And not only do you pay that on that same base, but remember that $500 that you paid let's say that first year, if you hadn't had to pay it, it would have been sitting in your account, and that $500 would have turned into $1,000 or $2,000.So it really just kind of spirals when you try to think about how much you've really paid over a lifetime. It really - you really get some kind of shocking numbers when you try to make that kind of calculation.GROSS: What are some of the shocking numbers you came up with?HILTONSMITH: Well in my report that I did on fees, I basically found that using some average fee numbers that I get from the industry, you could pay as much as 30 percent, basically, of your account in fees. So this means that if there had been no fees, your account is 30 percent lower than it would have been at retirement, right, if there had been no fees.The upshot is this one percent turns into this 30 percent is kind of the magic of the - or not magic but the bad part about how this actually works out.GROSS: So as shocking as that might sound, isn't that the way it also works for private investors in mutual funds or working through a stockbroker? I mean, you pay a fee for you money to be handled by a broker or by a mutual fund, right?HILTONSMITH: It certainly is, you know, whether you're a private investor or an institutional investor like a pension fund, or, you know, you're investing a hedge fund, any of these things, right, you're exactly right. You pay fees on any of these transactions. But the part about it that's shocking or frustrating, I guess, is that you really don't need to be paying fees this high to get decent returns.But because of the structure of the market and of 401(k)s as they are, you kind of get locked into paying these kind of fees when you really shouldn't have to be to get a decent return.GROSS: Why don't I need to be paying fees that high?HILTONSMITH: Well, so, I mean, the first thing, the easiest example, is index funds. An index fund like Vanguard, who may be the most famous company that they built their whole model on offering index funds, you can get the stock market average returns, six or seven or eight percent a year, and only pay a small fraction of what you would in fees as if you had put that money in what they refer to as actively managed funds or these other kind of funds where people, instead of just tracking like the S&P 500, they actually try to beat the market, these active managers.So that's the issue. Most of the funds out there are actively managed funds, so you end up paying more than you need to.GROSS: So just to clarify, an index fund is what?HILTONSMITH: An index fund is basically, it's what the name says. It's a fund that the only investment strategy is to track a particular index. So the S&P 500 index is maybe one of the most famous ones, and that's the 500 biggest companies in the United States, right, the stocks of those companies. And so the managers of these funds, all they do is buy and sell shares just to match what this S&P 500 index did that day. So they're literally just tracking the market is another way to put it.And so if you're invested in one of these index funds, you rise as the market rises, and you fall just as the market falls.GROSS: And the other funds are based on the assumption that a good financial expert can beat the market and do better than the index fund would.HILTONSMITH: Exactly, and unfortunately evidence has proven that that's just not the case, that in fact very few people beat the market consistently over time, and there's a good reason for that: because they're the ones also making the market. So if they beat the market consistently, then the market would be higher or lower, right. I mean, the market would be higher, it wouldn't be the market.It's kind of part of the structure of the market. They can't beat the market consistently or else everyone would be doing what they're doing.GROSS: If you're just joining us, my guest is Robert Hiltonsmith, and he is a policy analyst at the think tank Demos, and he, his specialty is retirement security, but he's also written about tax policy, fiscal policy, health care, the labor market, education. Robert, let's take a short break here, and then we'll talk some more about the ins and outs of retirement accounts and some of the things we should know, OK?HILTONSMITH: Great.GROSS: This is FRESH AIR.(SOUNDBITE OF MUSIC)GROSS: If you're just joining us, my guest is Robert Hiltonsmith, who is a policy analyst at the think-tank Demos, and we're talking about one of his areas of expertise, which is retirement security, and we're focusing in on 401(k)s and some of the things you might not know about your retirement plan.So let's get back to fees. When you were looking to find the fees on your statement, and I should mention that as of last July there's a regulation that says the fees have to be included on your statement. Before we get to how they're included, before they were included, when you were looking to find your fees, what did you have to do to find out what the charges were?HILTONSMITH: Well, it was a lot more digging than I thought it would be initially. I had to go into my 401(k)'s website online portal, and you had to go through a ton of layers and dig down deep into kind of a plan document statement and then go on to page 15 or something of that, and finally there was a table with all the funds in the plan. And then there's one little lonely column that said exp ratio.And if you did a little more digging, you found out the exp ratio was expense ratio, which is most of the fees, investment management, marketing and stuff, all kind of lumped into one. I was kind of surprised myself how much digging you had to do because you couldn't find it just on your statement or as you would think, like, with a bank account it would say minus 500 for fees.Like when you have an ATM fee, it says minus two dollars or whatever, right. You know, that wasn't the case and still isn't the case, actually.GROSS: Well, ever since last July it's mandated that a 401(k) or another retirement plan has to tell you about the fees that you're paying, but how do they have to tell you? Is it easy to find?HILTONSMITH: Unfortunately, again this is just my experience from talking with a lot of people, but all the people I've talked to, it generally has not been easy to find. Unfortunately, it's not too much of an improvement over the old thing. At least now, mostly there's a table of these fees in your quarterly statement if you open it up, though unfortunately I've found that a lot of people, myself included, still aren't even seeing that table, which is I guess another story itself.But generally now if you open your quarterly statement, somewhere there'll be a table that says - saying here's what you've invested in, and here's the fees you paid on those investments this year, this quarter maybe more appropriately. But that table could be on page one of the statement, or it could be on page 24 of the statement. There's no real standardization or even how that table appears or shows up.So unfortunately, it's only a little improvement from the situation that I found when I was looking into this.GROSS: So we were talking about the fees in 401(k) mutual funds, and you were mentioning that some people advocate index funds, and these are funds that are basically created to just mirror what, say, the S&P 500 does. So if the S&P 500 goes up, you've gone up, if it goes down, you've gone down. What do you think are some of the pros and cons of putting your money in an index fund?The fees are going to be lower, so that's a plus.HILTONSMITH: Right, the major plus is the fees are lower, and over time that should translate actually into higher returns for you, and it's kind of proven that it does. But the negatives, of course, is that you are still a creature of the stock market, so to say. You rise with the market, and you fall with the market.So for example in 2008, even if you had been invested in an index fund, you still would have lost 37 percent or, you know, about like a third of your whole balance, basically. So it's better, you know, the index funds are better in that you should be getting higher returns and paying lower fees to get those returns, but you still have to deal with this real uncertainty, which is one of the many fundamental flaws of 401(k)s.GROSS: In the pension era, when, you know, many workers had a guaranteed pension, there was somebody at the company who managed the money, and you were guaranteed a certain amount. You didn't have to worry about which funds it was being invested in or any of that. And now the individual worker has to make very complex investing decisions about which fund they're going to put their money in and whether it's going to be an index fund or not.And it, I don't know what these funds are when I look at them.HILTONSMITH: I don't either.(LAUGHTER)GROSS: And I not only don't have the time to do the research, I wouldn't understand it even if I did. I'm not at all convinced that unless I kind of went back to college...(LAUGHTER)GROSS: You know, that I'd really understand the difference between one fund and another and be able to figure out which fund was going to bring me the biggest returns from my money. So there's this idea that choice is a really great option, and we have choices, you know, many of us workers, in what we're going to put our retirement money in. But was the premise also that we'd understand the choices that we have before us?HILTONSMITH: That's exactly right, Terry, and that's a really great way to put it. That's exactly what this arrangement, you know, this 401(k) would require for it actually to work for people, right, is that we would indeed all have to be literally financial experts on the side of our regular jobs, you know, and have to understand these things inside and out.And even then, actually, there's only so far that would get us, right, because you've got a list of mutual funds, and you can look at OK, here's how it did in the past year or five years or 10 years, and you can know the fees and do all this stuff. But you don't - you still fundamentally don't know what's going to happen in the next few years, right.You can say oh, well, this one did the best in the past 10 years. Well, unfortunately there's research showing that sometimes the funds that did best in the past couple years do the worst in the next couple years, right, exactly the opposite of what you would think, kind of a correction, almost, in a sense.So it's really a losing battle, a losing proposition for all of us, and that's really exactly one of the problems with these things, that even if everyone were as educated as possible, and a lot of people say oh, you know, we just need to - people just need to be more financially educated, no that's not going to fix things.You know, we - the fundamental problem is that we're on our own, and all the risk is being of retirement, you know, whether it's this risk of the market going up and down or picking the wrong investments or even outliving our savings. The risk is all on us.GROSS: I think most of the investment companies that have 401(k)s and other retirement funds also have financial experts who can offer you advice in person or, you know, on their toll-free number. But you've pointed out they're not fiduciaries, they're financial advisors. What's the difference, and why does that matter?HILTONSMITH: That's right, and that's another one of the big problems with this. A fiduciary is someone who is legally bound to act in their client's best interest, right, and the vast majority of financial representatives are not fiduciaries. What this means is saying they're not fiduciaries means they are not obligated to act in your best interest. Their job is to maximize the returns and the shareholder profits for their companies, right.So in one sense they actually have an incentive to steer you to the highest fee funds because those are the funds that bring them the most money, and that's kind of one of the unfortunate things about this arrangement is that they're not required to act in your best interest.But that doesn't mean that there aren't a lot of them out there who nonetheless are still acting in their clients' best interests. You know, there are plenty of people who really do believe their duty is to serve their clients as well as possible. But unfortunately that is not always the case, right. There are many cases where people are out there really just to maximize their own or their company's return, and that's really one of the problems of the system.So you're saying you have to be on your guard, that if the person you're consulting with isn't, you know, a fiduciary representative, if they're just a financial representative, you want to make sure that they're not just selling you a vehicle because it has a high fee, and the company's going to make more profit.Right, exactly. That's one of the difficult parts of this whole transaction is if they're not a fiduciary, exactly right, you do have to do your best to ascertain how much they're acting in your best interest or if they are at all, and that can sometimes be difficult to figure out.GROSS: Robert Hiltonsmith will talk more about retirement accounts in the second half of the show. He's a policy analyst at the public policy organization Demos. I'm Terry Gross, and this is FRESH AIR.(SOUNDBITE OF MUSIC)GROSS: This is FRESH AIR. I'm Terry Gross. We're talking about personal retirement accounts with Robert Hiltonsmith, a policy analyst who has written about retirement security and other economic issues for the public policy organization Demos.If you have a 401(k), you probably have to make complicated decisions about which funds to put your money in. Your employer has to make a difficult decision too, which financial services company to go with to manage employees' retirement accounts.How does an employer go about shopping for a company? And do those companies, you know, try to entice employers to sign up with them?HILTONSMITH: They do indeed. In fact, we've been going through this process at Demos recently.GROSS: Looking for a 401(k) company?HILTONSMITH: A new 401(k) company. Yeah, to switch over from our old one. That was actually, I'll tell you, on the first day that I started at Demos, I, you know, even though I didn't know that much about retirement at the time, I knew a few companies out there that I thought were better companies and we weren't with one of those. And so the first day I was there, I wrote down: goal, switch Demos' 401(k) over to this. So we've been going through that, you know, you take bids and presentations from different companies, so they all come and a bunch of people in suits come and try to tell you why their plan is the best and they have a big fancy glossy book that has dozens of pages, information in there, and 300 million different fees. If you want to talk about fees, expense ratios are one of them. There are a million more different fees especially employers have to think about. And that's exactly what happens. And unfortunately, like in an organization like Demos, we only have about 40, 45 people working for us and there's no one who works full-time on retirement who is like an HR manager or benefits manager, so it's really down to me and a couple of others to sit down with these and try to decipher which is the best bid. And it can be pretty daunting because you're like, well, this one looks better than this one way, but this one has lower fees, but this one has these funds in it, and it's a really daunting process. But unfortunately employers are exactly the ones who are legally obligated to pick the best plan, right, they are the fiduciaries. So it's not the investment advisers, it's actually employers who are legally obligated to provide the lowest fee, best return plan. And in fact, we've seen some lawsuits recently when employers failed to do that - Wal-Mart potentially most notably.GROSS: What were they sued for?HILTONSMITH: For failing in their fiduciary duty, right, for having a bad 401(k). They had to pay back to the people in their 401(k)s because they had high fees or poor returns or both.GROSS: So your employer has a fiduciary responsibility to choose the best plan possible. The assumption is your HR person has the capability of choosing the best plan possible.HILTONSMITH: Right. Exactly. So, but yeah, I mean in many cases - especially with small businesses - this isn't the case. Again, to go back to Demos' example, the people sitting there choosing were me, the director of administration, who is a wonderful and awesomely capable person but wears 500 different hats, you know. I studied it obviously some, but even I don't certainly know all the ins and outs of it and so, I mean especially with small businesses it can really basically be an impossible task.GROSS: So we've been talking about some of the problems with 401(k)s. It's a fairly new development in retirement, you know, in retirement law. Congress passed a law creating 401(k)s in 1978.HILTONSMITH: Mm-hmm.GROSS: What was the motivation back then? Can you take us back to 1978?HILTONSMITH: So Congress passed a law. It was actually part of a tax bill that was passed. The motivation was basically the IRS came to Congress and said we want a way to better tax executive bonuses, because right now at that point bonuses were getting taxed at this very low rate and, you know, their regular tax rate was really high. So they came up with this idea that you could set aside a portion of your compensation as deferred compensation and you wouldn't pay taxes on it now but you'd pay taxes on it later. But when you pay taxes later, it would be taxed as regular income, not as this bonus income. And that's actually why they created these things, was literally to try to tax high paid executives. But because of certain nondiscrimination laws, they actually had to open up these plans, these vehicles, to everybody in the company, they couldn't just offer them to the executives. And then some very smart people realized, hey, you know, we could sell these as retirement plans and even as alternatives to a traditional pension, and that's exactly what happened throughout the '80s and '90s - especially as the economy was changing, old firms were closing, new ones were opening, when they sold these things, says hey, this is a better option than the traditional pension. And it is a better option for employers, they don't have to take nearly as much of the risk as they did.GROSS: What kind of risk do employers take on when they have a pension fund?HILTONSMITH: Almost all of it.GROSS: Because they're obligated to pay you a certain amount whether the stock market is doing well or not.HILTONSMITH: Exactly. And that's unfortunately some of the - when we've seen pensions, the pensions that are left in the news recently, that's what we've seen when the financial crash happened. A lot of them became underfunded, though it's a much more complex story than that. But basically, when there's been cases that ruled literally when you sign your initial contract with the employer, they are obligated to pay you the pension that is part of that contract no matter what. So even from day one, as you start accruing credit, they are obligated to pay that regardless of what happens in the future with investment returns and with their own profits and everything. So, you know, there are some ways in which it could be a pretty difficult arrangement for employers in some ways, you know, because they promised this big chunk of money without really knowing what was going to happen with their own finances or with the market and, you know, that did cause some problems.GROSS: Was there a lot of lobbying in 1978 to pass this law creating 401(k)s? And if so, who was doing the lobbying?HILTONSMITH: There was almost no lobbying back then. This thing almost passed unnoticed and it really wasn't till the mid-'80s that people almost even began noticing this provision existed. First, the people who were going around selling these plans were selling them as supplemental plans. You're selling on top of your traditional pension where your employees, particularly your higher paid employees, can save. And then it wasn't till the mid-'80s - or even early '90s -that a lot of companies started realizing, hey, we can actually use these things instead of traditional pensions. So what happens is the original thing passed almost unnoticed, but then there had been a ton of revisions in the year since, right. There's actually been a lot of tightening of rules and scrutiny with traditional pensions and continued loosening of the rules around 401(k)s and expansion of them. So once people kind of realized what these things could be used for, then there was a lot of lobbying on both sides to really make these things into these, the primary plans that we see today.GROSS: If you're just joining us, we're talking about retirement security. It's one of the areas of expertise of my guest Robert Hiltonsmith who is a policy analyst with the think tank Demos.You are part of a coalition called Retirement USA...HILTONSMITH: Mm-hmm.GROSS: ...that's concerned about inadequacies with the country's private retirement system, and Retirement USA is proposing an alternative. Give us some of the highlights of the alternative this coalition has proposed.HILTONSMITH: There's been two ideas that have been proposed. One, of course, has been proposed for many years - which is just to expand Social Security. But as you know, that given the current climate, doing something like that would be a difficult proposition - to say the least - when mostly we're talking about Social Security cuts. So instead the coalition has come up with this plan that basically is to create an individual account that is administered by a state or by the federal government but is privately managed, right, that all the funds are invested in the private market. It's kind of a hybrid, a compromise between a traditional pension and a 401(k), right, in that it is an individual account, you know, you do - at retirement you get out what you put in and, you know, what you and your employer put in in the returns, but instead of having all these options, the funds are pooled and invested as a pool and the professional investment managers do the investing. And at retirement there's an option to kind of covert your lump sum into an annuity, a lifetime stream of income, something that kind of resembles traditional pensions. So it's kind of a hybrid between these two and one we think is a fair compromise, given the state of the U.S. economy and also the needs of individuals.GROSS: You write that it's going to be harder for younger workers to retire comfortably than it's going to be for baby boomers. So why do you think, you know, that, you know, Gen Xers and Millennials are going to have a more difficult time retiring?HILTONSMITH: There is a ton of reasons wrapped up in there. Everything from the stagnation of wages that we've seen, you know, wages and salaries are pretty much, have been flat for a long time, basically except for mostly very highly educated workers, and even they haven't seen much of a rise. You know, a lot of costs are increasing at the same time. We know that health care costs at least up until recently were spiraling out of control. And then couple that with, you know, specifically the demise of the traditional pension. A lot of baby boomers still had these traditional pensions and not that many Gen Xers and very few Millennials are going to have these traditional pensions. So that coupled with also, you know, threats to Social Security, the potential that it could be cut some and the potential that we might get less in Social Security benefits than our parents or previous generations did, that all of those things and others could combine to really make it a pretty difficult proposition to retire.GROSS: Robert Hiltonsmith, thanks so much for talking with us.HILTONSMITH: Well, thanks very much for having me on, Terry. It was really a pleasure.GROSS: Robert Hiltonsmith is a policy analyst at the public policy organization Demos. You'll find links to a couple of his papers about retirement on our website, freshair.npr.org. TERRY GROSS, HOST: This is FRESH AIR. I'm Terry Gross. If you're worried about how you're going to afford to retire, whether that's in the next few years or the next few decades, this interview is unlikely to make you more optimistic, but you'll probably learn a few things you didn't know about personal retirement accounts like 401(k)s. For example, did you know that you pay fees to the financial services company that manages your retirement account? And those fees can add up to a lot of money without you even realizing it. My guest, Robert Hiltonsmith, is a policy analyst at Demos, a public policy research organization. He provides research and analysis on retirement security, tax policy, health care and the labor market. You may have seen him on the recent PBS \"Frontline\" edition called \"The Retirement Gamble.\" Robert Hiltonsmith, welcome to FRESH AIR. Before we talk about some of the things most people don't know about their own 401(k)s, may I ask: How old are you? ROBERT HILTONSMITH: I am 31 years old, Terry. GROSS: Most people aren't thinking about retirement at your age, and people who are contributing to retirement funds at your age usually are trying to contribute as little as possible. So what got you so interested in learning about 401(k)s and retirement options? HILTONSMITH: Well, I have noticed a lot of people my age, it isn't exactly the first topic that draws them, even people who get into economics, you know. But I think it was a pretty natural draw for me. You know, my grandparents actually never went to college, worked hard their whole lives, my father's parents this is, and retired honestly to a pretty meager retirement. They had Social Security, which is great, and it was wonderful, but that was basically all they had. My dad was the first person in his family to go to college, actually got a Ph.D., now is about to retire and is hopefully going to get to retire with at least some measure of comfort. And so just seeing what's supposed to be part of the American dream, you know, or the American middle class being able to work hard and then retire with some measure of comfort and then seeing - looking at myself and my generation and worrying about that, all of a sudden I was like, you know, people don't talk about this enough, but they should be. GROSS: So let's start with the basics, with 401(k)s. I'm not going to assume that everybody knows what they are. I want you to explain what a 401(k) is. HILTONSMITH: Sure, no, I think it is an often confusing topic, which is part of the problem with it, honestly. So 401(k)s are one type of these individual accounts, 403(b)s, 457s, IRAs, they're all in the same kind of class. And what they all are is, like, individual retirement savings accounts where you or your employer,  sometimes if you're lucky enough, can put money every paycheck or every year into it, and it's invested in some kind of stocks, bonds, assets. And then when you're hoping to retire, you have what you and your employer have put into it. And this is, you know, in contrast to the traditional pension, which is what my parents and previous generations had, which really promised a kind of set benefit for a number of years of service. So you work 30 years, and you get X amount, right, versus the 401(k), where you get out what you put in. GROSS: Plus any profits from the stock market because usually in a 401(k) or any of these other plans, you're investing in a mutual fund, and if the fund goes up, you've got more money, but of course if the market tanks and your fund goes down, you've lost money, you've lost money that you put away in your retirement account. HILTONSMITH: Right, and that's indeed one of the major problems with them and one of the real drawbacks to them when compared to these traditional pensions, right. And we've seen the weaknesses of that in the past, you know, several years especially but past 10 years really. You know, people have been looking at their 401(k) statements, those of whom are brave enough to open them even, as I am even myself not sometimes, you know, and seeing, geez, this thing isn't really going up at all, or it's going way down, you know, and that's a - that's really one of kind of the drawbacks to them is that, you know, you are completely dependent on these financial markets, which as you know can be pretty opaque and a scary place to have your money these days. GROSS: Most people don't know that there are fees involved with their 401(k)s. What are these fees? Because there's different kinds of fees that your money in your retirement account might be subject to. HILTONSMITH: Right, no, there are indeed many types of fees, and there's a good reason that people don't know that they pay fees because when you open up your statement, there's not a table right there in front of you, or there wasn't especially before some recent reforms, you know, just saying here's the fees and here's what you paid. Or it's not like as part of your statement you see OK here's your returns and then minus the fees. They are pretty hidden. But there are indeed on every account lots of different fees that you pay for investment management, for account bookkeeping, for the advertising of the Fidelity or E*TRADE advertisements you see on TV. You pay for all of those costs because for these mutual funds and other financial companies, that's the only place they get their revenue from is from you, is from the assets you've entrusted to them. So there's actually a huge myriad of them, but they are really hidden, unfortunately, and that's a bad thing because they can have a really big effect on whether you end up with a decent sized nest egg or are looking at it in horror at age 65 or 67 or whatever. GROSS: So are these fees like flat fees, or are they a percentage of everything that you have in your account, or are they a percentage of what you've earned that year in profits? How are they calculated? HILTONSMITH: Well, in some ways it might be more appropriate if they're a percentage of the profits, since that's what we're giving our money over to these mutual funds and companies for, right, is to actually earn us a return. But unfortunately they actually area percentage of what your total assets, what you actually have, your total account balance. So, you know, these fees are bundled, and if you dig deep into these documents, they're kind of summarized under this expense ratio, though there are actually more fees than that, and the expense ratio might be one percent, for example. So every year you pay one percent of everything you've got in your retirement account. So if you've got $50,000, you pay one percent of that or 500 bucks. GROSS: So if you have $50,000, and you pay 500 bucks in one year, I mean that's a lot, but how does that change over all the years that you're working, say over 30 years or 25 years or more? HILTONSMITH: Exactly and that's where these fees really add up because you might think oh, I paid 500 bucks, well that's a lot, but it's not that much. But really you pay 500 bucks this year when you're 30 or 35, and that $500 that you paid, if you hadn't had to pay it, would have been sitting in your account hopefully accumulating returns and would have turned into much more than that by the time you got to retirement age. So that's the real hidden part of these fees. Not only are they not out there and up front, but you don't really realize how much they can cost you over a lifetime. GROSS: So let me see if I understand this correctly. So say I have $50,000 in my retirement account, and I've paid a one percent fee on that this year, $500. Next year, I have $52,000 in my retirement account. I'm going to have to pay that one percent fee again not only on the extra $2,000, but on the $50,000 that I paid one percent on last year, right... HILTONSMITH: That's exactly right. GROSS: I'm paying one percent on that same money every year that it's in the account. HILTONSMITH: That's a really good way to think of it actually. You pay that fee on what is in essence the same $50,000 base over and over and over and over again. And not only do you pay that on that same base, but remember that $500 that you paid let's say that first year, if you hadn't had to pay it, it would have been sitting in your account, and that $500 would have turned into $1,000 or $2,000. So it really just kind of spirals when you try to think about how much you've really paid over a lifetime. It really - you really get some kind of shocking numbers when you try to make that kind of calculation. GROSS: What are some of the shocking numbers you came up with? HILTONSMITH: Well in my report that I did on fees, I basically found that using some average fee numbers that I get from the industry, you could pay as much as 30 percent, basically, of your account in fees. So this means that if there had been no fees, your account is 30 percent lower than it would have been at retirement, right, if there had been no fees. The upshot is this one percent turns into this 30 percent is kind of the magic of the - or not magic but the bad part about how this actually works out. GROSS: So as shocking as that might sound, isn't that the way it also works for private investors in mutual funds or working through a stockbroker? I mean, you pay a fee for you money to be handled by a broker or by a mutual fund, right? HILTONSMITH: It certainly is, you know, whether you're a private investor or an institutional investor like a pension fund, or, you know, you're investing a hedge fund, any of these things, right, you're exactly right. You pay fees on any of these transactions. But the part about it that's shocking or frustrating, I guess, is that you really don't need to be paying fees this high to get decent returns. But because of the structure of the market and of 401(k)s as they are, you kind of get locked into paying these kind of fees when you really shouldn't have to be to get a decent return. GROSS: Why don't I need to be paying fees that high? HILTONSMITH: Well, so, I mean, the first thing, the easiest example, is index funds. An index fund like Vanguard, who may be the most famous company that they built their whole model on offering index funds, you can get the stock market average returns, six or seven or eight percent a year, and only pay a small fraction of what you would in fees as if you had put that money in what they refer to as actively managed funds or these other kind of funds where people, instead of just tracking like the S&P 500, they actually try to beat the market, these active managers. So that's the issue. Most of the funds out there are actively managed funds, so you end up paying more than you need to. GROSS: So just to clarify, an index fund is what? HILTONSMITH: An index fund is basically, it's what the name says. It's a fund that the only investment strategy is to track a particular index. So the S&P 500 index is maybe one of the most famous ones, and that's the 500 biggest companies in the United States, right, the stocks of those companies. And so the managers of these funds, all they do is buy and sell shares just to match what this S&P 500 index did that day. So they're literally just tracking the market is another way to put it. And so if you're invested in one of these index funds, you rise as the market rises, and you fall just as the market falls. GROSS: And the other funds are based on the assumption that a good financial expert can beat the market and do better than the index fund would. HILTONSMITH: Exactly, and unfortunately evidence has proven that that's just not the case, that in fact very few people beat the market consistently over time, and there's a good reason for that: because they're the ones also making the market. So if they beat the market consistently, then the market would be higher or lower, right. I mean, the market would be higher, it wouldn't be the market. It's kind of part of the structure of the market. They can't beat the market consistently or else everyone would be doing what they're doing. GROSS: If you're just joining us, my guest is Robert Hiltonsmith, and he is a policy analyst at the think tank Demos, and he, his specialty is retirement security, but he's also written about tax policy, fiscal policy, health care, the labor market, education. Robert, let's take a short break here, and then we'll talk some more about the ins and outs of retirement accounts and some of the things we should know, OK? HILTONSMITH: Great. GROSS: This is FRESH AIR. (SOUNDBITE OF MUSIC) GROSS: If you're just joining us, my guest is Robert Hiltonsmith, who is a policy analyst at the think-tank Demos, and we're talking about one of his areas of expertise, which is retirement security, and we're focusing in on 401(k)s and some of the things you might not know about your retirement plan. So let's get back to fees. When you were looking to find the fees on your statement, and I should mention that as of last July there's a regulation that says the fees have to be included on your statement. Before we get to how they're included, before they were included, when you were looking to find your fees, what did you have to do to find out what the charges were? HILTONSMITH: Well, it was a lot more digging than I thought it would be initially. I had to go into my 401(k)'s website online portal, and you had to go through a ton of layers and dig down deep into kind of a plan document statement and then go on to page 15 or something of that, and finally there was a table with all the funds in the plan. And then there's one little lonely column that said exp ratio. And if you did a little more digging, you found out the exp ratio was expense ratio, which is most of the fees, investment management, marketing and stuff, all kind of lumped into one. I was kind of surprised myself how much digging you had to do because you couldn't find it just on your statement or as you would think, like, with a bank account it would say minus 500 for fees. Like when you have an ATM fee, it says minus two dollars or whatever, right. You know, that wasn't the case and still isn't the case, actually. GROSS: Well, ever since last July it's mandated that a 401(k) or another retirement plan has to tell you about the fees that you're paying, but how do they have to tell you? Is it easy to find? HILTONSMITH: Unfortunately, again this is just my experience from talking with a lot of people, but all the people I've talked to, it generally has not been easy to find. Unfortunately, it's not too much of an improvement over the old thing. At least now, mostly there's a table of these fees in your quarterly statement if you open it up, though unfortunately I've found that a lot of people, myself included, still aren't even seeing that table, which is I guess another story itself. But generally now if you open your quarterly statement, somewhere there'll be a table that says - saying here's what you've invested in, and here's the fees you paid on those investments this year, this quarter maybe more appropriately. But that table could be on page one of the statement, or it could be on page 24 of the statement. There's no real standardization or even how that table appears or shows up. So unfortunately, it's only a little improvement from the situation that I found when I was looking into this. GROSS: So we were talking about the fees in 401(k) mutual funds, and you were mentioning that some people advocate index funds, and these are funds that are basically created to just mirror what, say, the S&P 500 does. So if the S&P 500 goes up, you've gone up, if it goes down, you've gone down. What do you think are some of the pros and cons of putting your money in an index fund? The fees are going to be lower, so that's a plus. HILTONSMITH: Right, the major plus is the fees are lower, and over time that should translate actually into higher returns for you, and it's kind of proven that it does. But the negatives, of course, is that you are still a creature of the stock market, so to say. You rise with the market, and you fall with the market. So for example in 2008, even if you had been invested in an index fund, you still would have lost 37 percent or, you know, about like a third of your whole balance, basically. So it's better, you know, the index funds are better in that you should be getting higher returns and paying lower fees to get those returns, but you still have to deal with this real uncertainty, which is one of the many fundamental flaws of 401(k)s. GROSS: In the pension era, when, you know, many workers had a guaranteed pension, there was somebody at the company who managed the money, and you were guaranteed a certain amount. You didn't have to worry about which funds it was being invested in or any of that. And now the individual worker has to make very complex investing decisions about which fund they're going to put their money in and whether it's going to be an index fund or not. And it, I don't know what these funds are when I look at them. HILTONSMITH: I don't either. (LAUGHTER) GROSS: And I not only don't have the time to do the research, I wouldn't understand it even if I did. I'm not at all convinced that unless I kind of went back to college... (LAUGHTER) GROSS: You know, that I'd really understand the difference between one fund and another and be able to figure out which fund was going to bring me the biggest returns from my money. So there's this idea that choice is a really great option, and we have choices, you know, many of us workers, in what we're going to put our retirement money in. But was the premise also that we'd understand the choices that we have before us? HILTONSMITH: That's exactly right, Terry, and that's a really great way to put it. That's exactly what this arrangement, you know, this 401(k) would require for it actually to work for people, right, is that we would indeed all have to be literally financial experts on the side of our regular jobs, you know, and have to understand these things inside and out. And even then, actually, there's only so far that would get us, right, because you've got a list of mutual funds, and you can look at OK, here's how it did in the past year or five years or 10 years, and you can know the fees and do all this stuff. But you don't - you still fundamentally don't know what's going to happen in the next few years, right. You can say oh, well, this one did the best in the past 10 years. Well, unfortunately there's research showing that sometimes the funds that did best in the past couple years do the worst in the next couple years, right, exactly the opposite of what you would think, kind of a correction, almost, in a sense. So it's really a losing battle, a losing proposition for all of us, and that's really exactly one of the problems with these things, that even if everyone were as educated as possible, and a lot of people say oh, you know, we just need to - people just need to be more financially educated, no that's not going to fix things. You know, we - the fundamental problem is that we're on our own, and all the risk is being of retirement, you know, whether it's this risk of the market going up and down or picking the wrong investments or even outliving our savings. The risk is all on us. GROSS: I think most of the investment companies that have 401(k)s and other retirement funds also have financial experts who can offer you advice in person or, you know, on their toll-free number. But you've pointed out they're not fiduciaries, they're financial advisors. What's the difference, and why does that matter? HILTONSMITH: That's right, and that's another one of the big problems with this. A fiduciary is someone who is legally bound to act in their client's best interest, right, and the vast majority of financial representatives are not fiduciaries. What this means is saying they're not fiduciaries means they are not obligated to act in your best interest. Their job is to maximize the returns and the shareholder profits for their companies, right. So in one sense they actually have an incentive to steer you to the highest fee funds because those are the funds that bring them the most money, and that's kind of one of the unfortunate things about this arrangement is that they're not required to act in your best interest. But that doesn't mean that there aren't a lot of them out there who nonetheless are still acting in their clients' best interests. You know, there are plenty of people who really do believe their duty is to serve their clients as well as possible. But unfortunately that is not always the case, right. There are many cases where people are out there really just to maximize their own or their company's return, and that's really one of the problems of the system. So you're saying you have to be on your guard, that if the person you're consulting with isn't, you know, a fiduciary representative, if they're just a financial representative, you want to make sure that they're not just selling you a vehicle because it has a high fee, and the company's going to make more profit. Right, exactly. That's one of the difficult parts of this whole transaction is if they're not a fiduciary, exactly right, you do have to do your best to ascertain how much they're acting in your best interest or if they are at all, and that can sometimes be difficult to figure out. GROSS: Robert Hiltonsmith will talk more about retirement accounts in the second half of the show. He's a policy analyst at the public policy organization Demos. I'm Terry Gross, and this is FRESH AIR. (SOUNDBITE OF MUSIC) GROSS: This is FRESH AIR. I'm Terry Gross. We're talking about personal retirement accounts with Robert Hiltonsmith, a policy analyst who has written about retirement security and other economic issues for the public policy organization Demos. If you have a 401(k), you probably have to make complicated decisions about which funds to put your money in. Your employer has to make a difficult decision too, which financial services company to go with to manage employees' retirement accounts. How does an employer go about shopping for a company? And do those companies, you know, try to entice employers to sign up with them? HILTONSMITH: They do indeed. In fact, we've been going through this process at Demos recently. GROSS: Looking for a 401(k) company? HILTONSMITH: A new 401(k) company. Yeah, to switch over from our old one. That was actually, I'll tell you, on the first day that I started at Demos, I, you know, even though I didn't know that much about retirement at the time, I knew a few companies out there that I thought were better companies and we weren't with one of those. And so the first day I was there, I wrote down: goal, switch Demos' 401(k) over to this. So we've been going through that, you know, you take bids and presentations from different companies, so they all come and a bunch of people in suits come and try to tell you why their plan is the best and they have a big fancy glossy book that has dozens of pages, information in there, and 300 million different fees. If you want to talk about fees, expense ratios are one of them. There are a million more different fees especially employers have to think about. And that's exactly what happens. And unfortunately, like in an organization like Demos, we only have about 40, 45 people working for us and there's no one who works full-time on retirement who is like an HR manager or benefits manager, so it's really down to me and a couple of others to sit down with these and try to decipher which is the best bid. And it can be pretty daunting because you're like, well, this one looks better than this one way, but this one has lower fees, but this one has these funds in it, and it's a really daunting process. But unfortunately employers are exactly the ones who are legally obligated to pick the best plan, right, they are the fiduciaries. So it's not the investment advisers, it's actually employers who are legally obligated to provide the lowest fee, best return plan. And in fact, we've seen some lawsuits recently when employers failed to do that - Wal-Mart potentially most notably. GROSS: What were they sued for? HILTONSMITH: For failing in their fiduciary duty, right, for having a bad 401(k). They had to pay back to the people in their 401(k)s because they had high fees or poor returns or both. GROSS: So your employer has a fiduciary responsibility to choose the best plan possible. The assumption is your HR person has the capability of choosing the best plan possible. HILTONSMITH: Right. Exactly. So, but yeah, I mean in many cases - especially with small businesses - this isn't the case. Again, to go back to Demos' example, the people sitting there choosing were me, the director of administration, who is a wonderful and awesomely capable person but wears 500 different hats, you know. I studied it obviously some, but even I don't certainly know all the ins and outs of it and so, I mean especially with small businesses it can really basically be an impossible task. GROSS: So we've been talking about some of the problems with 401(k)s. It's a fairly new development in retirement, you know, in retirement law. Congress passed a law creating 401(k)s in 1978. HILTONSMITH: Mm-hmm. GROSS: What was the motivation back then? Can you take us back to 1978? HILTONSMITH: So Congress passed a law. It was actually part of a tax bill that was passed. The motivation was basically the IRS came to Congress and said we want a way to better tax executive bonuses, because right now at that point bonuses were getting taxed at this very low rate and, you know, their regular tax rate was really high. So they came up with this idea that you could set aside a portion of your compensation as deferred compensation and you wouldn't pay taxes on it now but you'd pay taxes on it later. But when you pay taxes later, it would be taxed as regular income, not as this bonus income. And that's actually why they created these things, was literally to try to tax high paid executives. But because of certain nondiscrimination laws, they actually had to open up these plans, these vehicles, to everybody in the company, they couldn't just offer them to the executives. And then some very smart people realized, hey, you know, we could sell these as retirement plans and even as alternatives to a traditional pension, and that's exactly what happened throughout the '80s and '90s - especially as the economy was changing, old firms were closing, new ones were opening, when they sold these things, says hey, this is a better option than the traditional pension. And it is a better option for employers, they don't have to take nearly as much of the risk as they did. GROSS: What kind of risk do employers take on when they have a pension fund? HILTONSMITH: Almost all of it. GROSS: Because they're obligated to pay you a certain amount whether the stock market is doing well or not. HILTONSMITH: Exactly. And that's unfortunately some of the - when we've seen pensions, the pensions that are left in the news recently, that's what we've seen when the financial crash happened. A lot of them became underfunded, though it's a much more complex story than that. But basically, when there's been cases that ruled literally when you sign your initial contract with the employer, they are obligated to pay you the pension that is part of that contract no matter what. So even from day one, as you start accruing credit, they are obligated to pay that regardless of what happens in the future with investment returns and with their own profits and everything. So, you know, there are some ways in which it could be a pretty difficult arrangement for employers in some ways, you know, because they promised this big chunk of money without really knowing what was going to happen with their own finances or with the market and, you know, that did cause some problems. GROSS: Was there a lot of lobbying in 1978 to pass this law creating 401(k)s? And if so, who was doing the lobbying? HILTONSMITH: There was almost no lobbying back then. This thing almost passed unnoticed and it really wasn't till the mid-'80s that people almost even began noticing this provision existed. First, the people who were going around selling these plans were selling them as supplemental plans. You're selling on top of your traditional pension where your employees, particularly your higher paid employees, can save. And then it wasn't till the mid-'80s - or even early '90s -that a lot of companies started realizing, hey, we can actually use these things instead of traditional pensions. So what happens is the original thing passed almost unnoticed, but then there had been a ton of revisions in the year since, right. There's actually been a lot of tightening of rules and scrutiny with traditional pensions and continued loosening of the rules around 401(k)s and expansion of them. So once people kind of realized what these things could be used for, then there was a lot of lobbying on both sides to really make these things into these, the primary plans that we see today. GROSS: If you're just joining us, we're talking about retirement security. It's one of the areas of expertise of my guest Robert Hiltonsmith who is a policy analyst with the think tank Demos. You are part of a coalition called Retirement USA... HILTONSMITH: Mm-hmm. GROSS: ...that's concerned about inadequacies with the country's private retirement system, and Retirement USA is proposing an alternative. Give us some of the highlights of the alternative this coalition has proposed. HILTONSMITH: There's been two ideas that have been proposed. One, of course, has been proposed for many years - which is just to expand Social Security. But as you know, that given the current climate, doing something like that would be a difficult proposition - to say the least - when mostly we're talking about Social Security cuts. So instead the coalition has come up with this plan that basically is to create an individual account that is administered by a state or by the federal government but is privately managed, right, that all the funds are invested in the private market. It's kind of a hybrid, a compromise between a traditional pension and a 401(k), right, in that it is an individual account, you know, you do - at retirement you get out what you put in and, you know, what you and your employer put in in the returns, but instead of having all these options, the funds are pooled and invested as a pool and the professional investment managers do the investing. And at retirement there's an option to kind of covert your lump sum into an annuity, a lifetime stream of income, something that kind of resembles traditional pensions. So it's kind of a hybrid between these two and one we think is a fair compromise, given the state of the U.S. economy and also the needs of individuals. GROSS: You write that it's going to be harder for younger workers to retire comfortably than it's going to be for baby boomers. So why do you think, you know, that, you know, Gen Xers and Millennials are going to have a more difficult time retiring? HILTONSMITH: There is a ton of reasons wrapped up in there. Everything from the stagnation of wages that we've seen, you know, wages and salaries are pretty much, have been flat for a long time, basically except for mostly very highly educated workers, and even they haven't seen much of a rise. You know, a lot of costs are increasing at the same time. We know that health care costs at least up until recently were spiraling out of control. And then couple that with, you know, specifically the demise of the traditional pension. A lot of baby boomers still had these traditional pensions and not that many Gen Xers and very few Millennials are going to have these traditional pensions. So that coupled with also, you know, threats to Social Security, the potential that it could be cut some and the potential that we might get less in Social Security benefits than our parents or previous generations did, that all of those things and others could combine to really make it a pretty difficult proposition to retire. GROSS: Robert Hiltonsmith, thanks so much for talking with us. HILTONSMITH: Well, thanks very much for having me on, Terry. It was really a pleasure. GROSS: Robert Hiltonsmith is a policy analyst at the public policy organization Demos. You'll find links to a couple of his papers about retirement on our website, freshair.npr.org. Copyright © 2013 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information. NPR transcripts are created on a rush deadline by an NPR contractor. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record. Sponsor Message Become an NPR sponsor ",
    "title": "The Tricky Business Of Retirement: Hidden 401(K) Fees  : NPR",
    "url": "https://www.npr.org/2013/05/16/184221956/the-tricky-business-of-retirement-hidden-401-k-fees"
}