{
    "text": "With sales of South Korean duty free stores hitting a new record of 12 trillion won (US$10.16 billion) in the first half of this year, The Shilla Duty Free, the travel retail arm of Hotel Shilla, also made the top three duty free operators in the world after Lotte. The Shilla Duty Free recorded 5.49 billion euros (US$6.16 billion or 7.27 trillion won) in sales last year, moving up two notches to the third place, according to data from The Moodie Davitt Report, a U.K.-based travel retail consultancy, on July 16 (local time). Swiss-based Dufry maintained the number one spot with 7.69 billion euros (US$8.62 billion or 10.18 trillion won), while Lotte Duty Free remained second with 6.09 billion euros (8.07 trillion won). In regard to the great leap of domestic travel retailers, The Moodie Davitt Report said, “Lotte maintained the number two spot, driven by an expansion of the ‘Daigong’ market, and Shilla outpaced France-based Lagardere Travel Retail, which lurched into fifth place, with performance improvement last year. The Shilla Duty Free’s performance far exceeds the 31 percent growth of the South Korean duty free market and its market share increased from 24 percent to 25 percent.” Daigong refers to Chinese merchants who purchase tax-free goods in South Korea and sell them in China. In addition, the report noted that China, which was a major consumer in the duty free market, is gradually establishing itself as a supplier. Sales of China Duty-free Products Group (CDFG) stood at 4.39 billion euros (US$4.93 billion or 5.82 trillion won) last year, up 118 percent from a year earlier. It moved up four spots from eighth to fourth, closing in on Lotte and Shilla. The Shilla Duty Free was able to make the top three list largely due to expansion of the South Korean duty free market. Sales of domestic duty free stores came to 11.66 trillion won (US$9.87 billion) from January to June this year, far surpassing 9.76 trillion won (US$8.26 billion) in the second half of last year, which was the highest-ever half-year figure, according to data from the Korea Duty Free Shops Association on July 17. However, experts point out that a sales growth driven by Daigong will not lead to improvement in profitability. Most duty free stores in South Korea, including the top three – Lotte, Shilla and Shinsegae -- pay large commissions to Chinese travel agencies in return for brining Chinese customers to them. The Korea Customs Service said the total commissions paid by duty free shops surged from 563 billion won (US$476.71 million) in 2015 to 1.32 trillion won (US$1.12 billion) in 2018. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "The Shilla Duty Free Joins the Ranks of World’s Top 3 Travel Retailers - Businesskorea",
    "datetime": "2019-07-18T10:59:49+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=34032"
}