{
    "text": "clockThis article was published more than 3 years ago In the past few weeks, fans of Korean pop music (K-pop) have been making waves in U.S. politics. They were credited with crashing the iWatch Dallas app by uploading short clips of K-pop stars. Similarly they uploaded K-pop content and used the hashtag #WhiteLivesMatter to render it useless for white nationalists looking for one another. The One in an Army fan collective organized a matching donation of $1 million in 24 hours to match a donation to Black Lives Matter causes by premier K-pop group BTS. Adding to the list of accomplishments: embarrassing President Trump by contributing to a mass of bogus registrations for his Tulsa rally. What is K-pop, and why are its fans so active in American politics? K-pop is a cultural force with music groups ranking high across different Billboard charts globally (in 2019, BTS had three No. 1 albums). And it’s not just music. With the success of “Parasite” on the movie award circuit and Netflix’s array of Korean dramas, it’s plain to see — Korean pop culture is beloved in the United States. K-pop fans participating in these activities in English-speaking Internet spaces are primarily American, but their political activism is rooted in fan practices adapted from Korean popular culture. Americans have long consumed Korean entertainment. Starting during the Korean War, the U.S. Army contracted Korean singers, dancers and musicians to entertain the troops. Artists were expected to learn American songs by memory from listening to them on the military radio station AFKN (American Forces Korea Network). In the late 1950s, the Kim Sisters left Korea for Las Vegas, where they performed American songs, Korean folk songs and new compositions while appearing frequently on American television throughout the 1960s and 1970s. But over the past 30 years, Korea began exporting its pop music on a massive scale. Korean media underwent liberalization in the late 1980s along with the state’s democratization. 1992 marked a turning point in the emergence of contemporary K-pop, which incorporates contemporary hip-hop elements. K-pop remains identifiable through its choreographed dancing and slick pop productions. As the popular music industry developed in Korea, it was designed to keep fans highly engaged through pinning stars' hopes on the activities of their fans. Fans were encouraged to “raise” singers who emerged as music “idols.” They organized as fans of a single group or solo idol, and campaigned on their idols’ behalf — showing up at events in the designated fandom color ready to demonstrate their love and amplify the popularity of their idols. This public support mattered in the Korean media universe: Idols with well-organized fandoms were lifted up by the support. Letter-writing campaigns and demonstrations resulted in more media coverage. Fans could put pressure on companies to support beloved idols’ new releases or give them less exhausting schedules for practice and media appearances. And, of course, it resulted in cassette and CD sales. Success left fans increasingly empowered to interject in idols’ careers to a point where entertainment agencies performed a very difficult balancing act as fans combated agencies’ rigid control of the stars with their own demands. This role for fans created controversy. During the late 1990s, Korean media began depicting their devotion to their idols as dangerous, casting fans as stalkers with obsessive behavior. Anti-fans also emerged to promote conspiracies, such as through a campaign to smear the educational credentials of EPIK HIGH member Tablo in 2010, an incident that led to death threats against his family, and ultimately a criminal investigation of one of the instigators of the rumors. This fandom also created new pressures for artists. Idols received generous gifts (called jogong, or tribute, in Korean): stuffed animals, friendship bracelets and knitted scarves, as well as luxury watches and handbags bought with funds pooled by fan clubs. If idols were ever caught throwing out or being unthankful for the gifts, they were heavily criticized. When asking fans to stop sending gifts didn’t work, artists instead asked fans to donate or volunteer in their name. This both relieved K-pop stars of the burden of gifts and improved the reputation of idols and fans in the eyes of the public. By the early 2000s, fans were giving large bundled donations to elder-care facilities, orphanages and homes for the disabled in Korea and donating for projects of reforestation, sanitation and food security in other countries around the globe. After fans had organized donations or done volunteer work, they would send idols a photo of receipts or a group photo as evidence. Other popular causes included supplying formula for babies, medical relief, educational expenses and arts (especially music and dance) classes. Part of idol fandom became extending one’s time or money to help others. As a result, this concept of fandom applied pressure on K-pop stars to keep a clean, upright and responsible image. Idols are meant to be both approachable, as demonstrated in televised and streamed content, and aspirational — attractive and modeling exemplary behavior. This has made many idols reluctant to embrace politics; it reduces their attractiveness as advertising models (over 60 percent of ads in Korea feature famous faces). But it transformed them into key figures in promoting civic engagement, public service and nonpartisan causes such as education, animal welfare and disaster relief. Supergroup BTS in particular has told fans to love themselves and to speak their own truth, while modeling contributions to and care for wider social issues. Although K-pop idols and most fans may remain largely focused on social rather than overtly political causes, the tools of political organizing and online activism have taken root. And so, K-pop fans have emerged as empowered, socially conscious, globally minded, LGBTQ-friendly and attentive to issues of racism and discrimination, because in multiethnic countries such as the United States, fans are often ethnic minorities themselves. Social media has accelerated existing fan dynamics and made them global. Twitter has given fans around the world a chance to observe effective online campaign tactics, all of which can be applied to causes beyond K-pop. Now, digital natives congregate on Twitter, Tik Tok and Twitch, expanding the arena of K-pop fandom. As the Black Lives Matter movement generated massive attention after the death of George Floyd in Minneapolis police custody, K-pop fans on Twitter, acting on their own but inspired by the advice by groups such as BTS to speak their own truth, began changing their screen names to reflect their support of BLM. Shared appeals to donate to bail funds or show up for marches appeared back to back with links to K-pop media and photos evincing “thirst” (desire) for the attractive young stars. Now that these fans have flexed and the world has seen their power, the real question is what campaigns and goals they will choose next. ",
    "title": "The K-pop revolution and what it means for American politics - The Washington Post",
    "datetime": "2020-06-24T10:00:53.379Z",
    "url": "https://www.washingtonpost.com/outlook/2020/06/24/what-is-k-pop-how-did-its-fans-humiliate-president-trump/"
}