{
    "text": "Frequently Searched Top Issues Political Thought International Government Spending Energy & Environment Legal and Judicial National Security Domestic Policy Culture Economy Authors:\nLindsey Burke, Ph.D., \n                                              Jonathan Butcher, \n                                              Emilie Kao\n                                  and\n                              Mike Gonzalez Summary School boards wield considerable power over education, particularly in curriculum issues, but few Americans are knowledgeable about their locally elected members. A national study on the views of parents and school board members over current debates about K–12 content and policy show that the two are generally aligned. The results of this survey can help parents to engage with local school boards to ensure that their children have the best education opportunities. Select a Section  1/0 The COVID-19 pandemic has presented parents with an opportunity to reassess what their children are being taught in schools across the country. The pandemic created “accidental homeschoolers” of more than 50 million school-aged children and their parents, and in so doing, gave many the opportunity to take an in-depth look at what public schools are teaching. This opportunity came at the same time that schools began to adopt The New York Times’ 1619 Project, with an estimated 4,500 classrooms having incorporated the content.REF Although The 1619 Project and civics instruction has come to the forefront of instructional content this year, perennial issues, such as character education, school discipline policy, and values-based instruction, also remain important to families. More than 14,000 school boards and 100,000 school board members across the country determine the shape and content of such curriculum in their school districts, holding the key to how these various issues are addressed in American classrooms. Yet, school boards have a democracy deficit. Informed citizens know a great deal about the candidates at the top of the federal ticket, with declining knowledge in descending order about the President and Vice President, Senators, and then Members of the House. After that, voters know a fair amount about candidates for Governor or mayor, a bit about Lieutenant Governor, Attorney General, and county executive, and then a bit less about candidates for the state legislatures and city councils. At the bottom of the knowledge base come elected school board members. What many, if not most, Americans know about the candidates is what they learned when they stopped by the teachers’ unions table just before stepping into the voting booth. According to John E. Chubb, former distinguished visiting fellow at the Hoover Institution, Yet, as Chubb explains, Writing in 2001, Chubb said that turnout in school board elections “is the lowest of any general election, averaging perhaps 10 percent of local voters.”REF Little has changed today, according to research.REF The Heritage Foundation commissioned this nationally representative survey to better understand the views of parents and school board members on current debates about content and policy in K–12 schools across the country. The opinions of school board members generally align with those of parents, though differences exist. This Special Report presents those findings, and provides an overview of school boards, their composition, and how parents can engage with these local governing entities. Every school district in America has an associated board of education, and nationwide, an estimated 95 percent of school board members are elected by local voters to their positions on those boards, with members generally serving four-year terms.REF Notably, the nearly 100,000 school board members across the country comprise the largest group of elected officials in America.REF School boards wield considerable power over everything from curriculum and instruction to school bus routes and superintendent hiring and pay. In general, school boards determine or influence district budgets, governing policies, collective bargaining processes, spending, construction projects, curriculum and textbook acquisition, and school calendars, among numerous other duties. As locally elected boards, school boards are theoretically representative of the political makeup of the families they represent. Indeed, as Michael Ford and Douglas Ihrke of the Brookings Institution found, that is largely the case. Ford and Ihrke’s survey of more than 5,000 school board members across the country found a relatively even ideological split: 49 percent identified as moderate or nonpartisan, 31 percent identified as conservative, and 19 percent identified as liberal.REF Although there is relative ideological balance in the political leanings of school board members, special interest groups are able to shape the policies promulgated by these boards to a large degree. That is in part because a century ago, in an attempt to get school boards out of politics, Progressive-era reformers slated school board elections to be held as off-year political races. Yet this decision had the opposite effect of what was intended. With low-turnout, unions—inherently political entities—were and are able to define the local education narrative.REF Extremely low voter turnout for school board races, again, estimated at approximately 10 percent of the voting age population,REF “provides an opening for special interest groups—most prominently labor unions—to capture school boards.”REF That is how unions are able to exert outsized influence on the proposals that ultimately become policy. To better understand the views of parents and school board members on a host of current issues, The Heritage Foundation commissioned Braun Research to conduct a nationally representative survey of parents of K–12 students, along with a separate, targeted sample of school board members across the country. A total of 1,001 parents participated in the survey, from an initial outreach of 5,225, for a response rate of 22.1 percent and a margin of error of +/– 3.1 percentage points (95 percent confidence level). The survey used an online platform and was conducted from April 3, 2020, to May 28, 2020. Braun Research administered a second survey to a sample of school board members across the country. This non-probability-based sampling was conducted using a list of school board members across the country pulled from publicly available contact information on school board websites researched by Heritage Foundation analysts. The survey used an online platform with follow-up communications conducted by phone. In all, 566 school board members participated in the survey out of a total of 24,347 contacted, for a response rate of 2.4 percent and a margin of error of +/– 4.12 percentage points (95 percent confidence level). The survey was conducted from May 1, 2020, to June 9, 2020. In the nationally representative survey of parents of school-aged children, 77.6 percent of parents in the sample sent their children to traditional public schools, 12.7 percent sent their children to private schools, 7.6 percent reported they homeschooled their children—a figure that could be slightly higher than usual due to the COVID-19 pandemic—and 6.7 percent of parents reported they sent their children to public charter schools. Among the parent sample, 74 percent were white, 11.7 percent were black, 4.3 percent were Asian, and 21 percent were Hispanic. Twenty-two percent of parents in the survey held a bachelor’s degree, and 14 percent held a graduate degree. The political leanings of the parent respondents were equally divided, with 32 percent identifying as Democrats, 34 percent identifying as Republicans, and 28 percent identifying as Independents. The regional distribution of respondents was in line with the population distribution as reported by the U.S. Census Bureau (22 percent in the Midwest, 16 percent in the Northeast, 24 percent in the West, and 38 in the percent South). Although the parent portion of this survey is nationally representative, reflective of the overall makeup of families across the country, the school board portion of the survey had higher levels of representation among members in the Southeast, and were somewhat wealthier and had higher levels of education than the general public. For example, a little more than half of the school board members in the study were from the Southeast, and 53 percent held a graduate degree. Sixty-five percent of school board member respondents were white, 11 percent were black, less than 1 percent were Asian, and 7 percent were Hispanic. Twenty-six percent of the school board respondents identified as Democrats, 31 percent as Republicans, and 26 percent as Independents. More than 96 percent of the school board respondents in the survey were elected to their positions, and just 3.7 percent were appointed. For the full survey methodology, see Appendix B. Survey questions and findings are grouped into three overarching categories: (1) the 1619 Project and civics education; (2) character education, the Success Sequence, and Restorative Justice; and (3) sexual orientation and gender identity (SOGI) and life issues in schools. The 1619 Project and Civics Education. Although parents are generally satisfied with the civics instruction delivered in K–12 schools, a finding that holds across demographic groups, school board members disagree. Nearly two-thirds of school board members believe that schools do not provide enough instruction in civics. Parents and school board members have mixed feelings on recent revisions of history, such as the 1619 Project. Journalists at The New York Times published the 1619 Project in 2019, an effort to rethink the founding date of America “to reframe U.S. history by marking the year when the first enslaved Africans arrived on Virginia soil as our nation’s foundational date.” More than 4,500 classrooms have begun to incorporate the 1619 Project into their curricula, using prompts, such as “what examples of hypocrisy in the founding of the U.S. does [the writer] supply? What evidence can you see for how ‘some might argue that this nation was founded not as a democracy but as a slaveocracy’?”REF Fifty percent of all parents and 70 percent of school board members said that they do not want schools to use instructional material based on the idea that slavery is the “center of our national narrative.” Parents are nearly equally divided (47 percent to 46 percent) on whether curricula for schoolchildren should promote the view that America’s founding ideals of liberty and equality were false when they were written. School board members were not divided on this issue; a full 71 percent said “no” when asked whether schoolchildren should be taught that the founding ideals are false. Parents (57 percent) and school board members (65 percent) do not believe that schools should reframe American history to teach children that the United States is tainted by slavery and racism. With regard to what students should be taught about America’s slavery past, 70 percent of parents and 74 percent of school board members believe that students should be taught that slavery was a tragedy that harmed the nation, but that freedom and prosperity represent who Americans are as a nation, offering a beacon to those wanting to immigrate here. Just 25 percent of parents and 17 percent of school board members believe that students should be taught that the founding ideals of liberty and equality were false when they were written and America’s history must be reframed. However, among African American parents, 44 percent responded that they believe that schools should reframe American history. Fifty-two percent still disagreed with this idea. Among all parents, a majority (59 percent) want their children to continue to learn that the year 1776—not 1619—is the birth of America; 33 percent of all parents want their children to learn that the founding was in 1619. However, among younger parents, ages 18 to 39, support for the birth year of the nation being changed to 1619 rose to 49 percent; among African American parents that support increased to 65 percent. Among school board respondents, 73 percent believe that students should continue to learn that the year of the American founding was in 1776; just 16 percent would like students to learn that the founding year was in 1619. A slight majority of parents (55 percent) believe that “social justice” should be taught in schools, and concur with the idea that educators “must acknowledge the existence of White supremacy culture as a primary root cause of institutional racism, structural racism, and White privilege.”REF School board members disagreed, with 53 percent saying that they do not believe such content should be taught. Character Education, the Success Sequence, and Restorative Justice. Most parents believe that character and virtue should be cornerstones of education in America. More than eight in 10 parents (83 percent) want schools to instill character and virtue in children—a finding that largely holds across demographic groups. Close to nine out of 10 (89 percent) school board members believe that schools should teach character and virtue education. Some of the strongest levels of support for a given policy was that of the “success sequence”—the term coined for the research demonstrating that graduating high school, getting a job, and getting married before having children significantly reduces the likelihood of an individual ending up in poverty. Among parents, 72 percent believe that schools should explicitly teach the success sequence, as did 60 percent of school board members. A plurality of parents (47 percent) and majority of school board members (58 percent) do not believe that schools should engage in “restorative justice” practices, which employ meetings between victims and offenders instead of punishment for the offenders. Sexual Orientation and Gender Identity. Parents (66 percent) and school board members (80 percent) do not believe that schools should teach young children in kindergarten and elementary school about sexual activity, sexual orientation, or gender identity issues. Although some public school districts have policies that prevent school staff from disclosing information about a child’s gender identity to families, parents (70 percent) and school board members (59 percent) believe that schools should inform parents that their child identifies as transgender or has questions related to his or her gender identity. Although parents are equally split (45 percent to 45 percent) on whether they want the federal government to require all public schools to provide students with “unfettered access” to the bathrooms, locker rooms, and changing facilities aligned with their professed gender identity, school board members (64 percent) overwhelming responded that they do not want the federal government to do so. Life Issues. Although parents (61 percent) and school board members (68 percent) believe that schools should provide students with information about contraception, both groups draw the line at abortion. Parents (62 percent) and school board members (70 percent) do not believe that schools should provide students with information on how to get an abortion. The 1619 Project editors’ refusal to correct factual errors and misrepresentations of history in the essays creates two pedagogical problems. The 1619 Project poses two problems for parents, policymakers, educators, scholars, and students. The first problem, one that even scholars who view the project as a whole favorably, have documented, is that the project’s essays contain factual inaccuracies.REF Thus the project’s curricular materials created by the Pulitzer Center in conjunction with the Times’ editors are literally transmitting false information. The errors that historians have cited since the project’s launch in 2019 include seemingly basic issues, such as the date of the first arrival of slaves in the New World and motivations behind the American Revolution to descriptions of the complex foundational ideas undergirding the 19th-century American economy, with more in between. As for the chronology of events concerning slavery in the New World, Spanish explorers brought slaves to what is now Florida some 50 years before 1619.REF The original text of the project, however, discounts this fact and thereby the plight of these slaves and says that the “country’s true birth date…was in late August 1619,” when slaves arrived in the Virginia colony.REF Likewise, one of the lead essay’s central claims is that colonists fought the American Revolution to preserve slavery.REF As noted by multiple scholars, substantial evidence contradicts the notion that the British were prepared to end slavery in the colonies at the time of the revolution, so colonists did not need to defend the practice from the British.REF In refuting this specific claim from the project, Northwestern University professor Leslie Harris says, “Although slavery was certainly an issue in the American Revolution, the protection of slavery was not one of the main reasons the 13 Colonies went to war.”REF The project’s essay on the roots of American capitalism also contains inaccuracies. The author of this piece, Matthew Desmond, says that in today’s economy everything is “tracked, recorded and analyzed, via vertical reporting systems, double-entry record-keeping and precise quantification…. It feels like a cutting-edge approach to management, but many of these techniques that we now take for granted were developed by and for large plantations.”REF Yet as explained by Phillip Magness at the American Institute for Economic Research in The 1619 Project: A Critique, “The history of double-entry bookkeeping and business measurement predates plantation slavery by several centuries with origins that are directly traceable to the banking families of late medieval Italy.”REF Furthermore, the increases in cotton production in Southern states in the early 19th century that Desmond discusses were not due to “a devil’s bargain between double-entry bookkeeping and systematized beatings of slaves,” says Magness. Rather, research demonstrates that the increases resulted from “biological innovation,” such as more robust strains of seeds and other farming practices.REF Magness explains that researchers, such as Alan Olmstead, Paul Rhode, and Stanley Engerman have castigated the source that Desmond cites to support this assertion, with Engerman saying of this shoddy evidence that it has “surprising omissions from the writings on slavery of the past half-century.”REF Both the essay containing the inaccuracies about colonial slavery and Desmond’s essay are included in the Pulitzer Center’s “Reading Guide” for K–12 curriculum and are featured in recent promotional material for the curriculum, all of which presents the text containing the errors to students.REF This leads to the second pedagogical problem with the 1619 Project: The editors’ refusal to make substantive corrections elevates the project’s chosen narrative about slavery, even when it contains factual errors, over accurate instruction. This re-orients the ultimate objective of teaching and scholarship away from the pursuit of truth and toward ideological ends based on false claims. The Times’ editors addressed scholars’ critiques of the project in subsequent messages to readers, but the editors’ responses do not resolve the pedagogical problems. For example, editor Jake Silverstein announced a modest change in March 2020 to Nikole Hannah-Jones’s essay after historians pointed to the false statement about colonists’ motivation for fighting the revolution. Silverstein said the text now reads “some” colonists fought to preserve slavery.REF This edit does not correct the claim so much as make sure that the issue of race is still included in the statement. The edit keeps the statement consistent with the project’s overall theme of “reframing” American history around slavery, despite evidence to the contrary. The facts, then, matter less than the narrative. Silverstein also wrote that his team “heard from several scholars” who “wish it had included some mention of African slavery in Spanish Florida during the century before 1619.”REF As with all of the other corrections suggested by historians, except the colonists’ reason for fighting the revolution, Silverstein says that the editors refused to make changes even when the evidence supporting alternative conclusions is substantial. He writes that editors “stand by the logic” of the essays’ text, but “this feedback has helped us think about the importance of considering the prehistory of the period our project addresses.”REF Students will not benefit from Times editors “thinking” about the issue without corrections to the text and curricular materials. Today, educators and students face still more difficulties with the project because scholars have uncovered inconsistencies in the text between the original publication and the version available online.REF These unannounced changes concern the project’s thesis statements, making the text and its main ideas nothing short of unreliable. For example, the original text that appeared in print emphasized the project’s claim that American’s founding date was in late August 1619.REF The original editor’s note said, “What if, however, we were to tell you that [to consider July 4, 1776, as the year of the nation’s birth], which is taught in our schools and unanimously celebrated every Fourth of July, is wrong, and that the country’s true birth date, the moment that its defining contradictions came into the world, was in late August of 1619?”REF At some point last year, though, editors revised the content without announcement and removed the statement that 1776 “is wrong” and that the country’s true birth date was in August 1619, leaving the text vague about reframing the country’s history around “slavery and the contributions of black Americans.”REF With this revision, Times editors weakened their own central claim that when slaves arrived in the colony of Virginia “was the moment [America] began,” not to mention acting with questionable journalistic practices.REF Despite Silverstein’s statement that these unannounced changes were “small discrepancies,” the authors of this Special Report are not the only ones to contend the changes are significant. Times columnist Bret Stephens agreed with Magness that these “were not minor points.”REF Yet Silverstein says, “But 14 months after its publication, its ‘core premises’ remain unshaken and indispensable,” despite the factual errors.REF The 1619 Project teaches false information, and the lesson that students will learn from it is that truth matters less than the idea an author wants to communicate. Scholarship, then, is not an effort to ask questions and find the truth, but an exercise in defending preconceived ideas. Such a disposition may be appropriate for writing fiction, but not for composing something the Times describes as a project that “accurately [presents] history to readers of The New York Times”—readers and now children in classrooms using 1619 Project curricular materials.REF Not Teaching the Habits of the Success Sequence, Despite Parental Wishes. Public schools are not values-neutral spaces. As James Hunter and Ryan Olsen of the Institute for Advanced Studies in Culture have noted, schools have “distinctive ideals, beliefs, obligations, prohibitions, and commitments—many implicit and some explicit.”REF The different principles and values that schools cultivate deeply affect students’ beliefs and behaviors—a reality understood by parents. In recent years, education researchers have started to explore the impact of teaching the “success sequence” to students. As Ron Haskins and Isabel Sawhill first suggested, individuals who graduate high school, get a job or go to college, get married, and then have children—that is, they wait to have children until they are married—have a high chance of avoiding poverty and joining the middle class.REF And, as Wendy Wang and Brad Wilcox have found, 97 percent of Millennials who follow the success sequence do, indeed, avoid poverty. Their same research found that 91 percent of black young adults who followed the success sequence avoided poverty.REF Yet, many young Americans are not following this sequence. As Ian Rowe has detailed, among mothers age 25 and younger, 61 percent of white children and 91 percent of black children are born out of wedlock today. As Rowe suggests, “If we really want to help young people break the intergenerational cycle of poverty, we need a serious effort to reframe the decisions governing passage into young adulthood.”REF Based on the findings of The Heritage Foundation survey presented in this Special Report, parents agree. As the survey found, a full 72 percent of parents said they would like their child’s school to teach the success sequence; 60 percent of school board members agreed. As Rowe concludes, “There is no guarantee in life, but at a time when a global pandemic is highlighting entrenched and growing inequities, depriving young people of the very information that could empower them to succeed is irresponsible.”REF New research from Albert Cheng, Wendy Wang, Patrick Wolf, and W. Bradford Wilcox—presented in “The Protestant Family Ethic: What Do Protestant, Catholic, Private, and Public Schooling Have to Do with Marriage, Divorce, and Non-marital Childbearing?”—suggests that parents are right to want schools to talk about the success sequence with students. The study finds that students who attended private schools are more likely to be in a stable marriage, with a particular advantage for individuals who attended Protestant schools. A full 63 percent of individuals who had attended Protestant private schools had forged stable marriages, compared with 53 percent of those who attended secular private schools, 49 percent of adults who had attended Catholic schools, and 42 percent of those who attended public schools.REF Those outcomes could be due in part to the fact that private schools may be more open to discussing the success sequence. Yet, as the authors of the study note, “When it comes to family life, many public schools just avoid talking about loaded matters touching on marriage, divorce, and non-marital childbearing.”REF The findings from this survey suggest that public schools should not shy away from talking to students about the outcomes documented by success sequence researchers. While religiously affiliated private schools may have discussions with students framed in normative terms, public schools should present students with the data about likely life outcomes based on different decisions they can make as individuals. Doing so will equip students with important information about the choices they can make to help—or impede—their climb up the ladder of upward economic mobility. Curricula and Policies on Sexual Orientation and Gender Identity (SOGI), Contraception, and Abortion, Despite Parental Wishes. Parents throughout the country and from across the political spectrum have expressed concerns about SOGI school policies and curricula, citing risks to student health, safety, and privacy as well as the undermining of parental rights.REF Mandatory instruction on sensitive areas like sexuality can undermine parents’ constitutional right to raise and educate their children according to their own beliefs and values. The promotion of the unscientific belief that gender is fluid could also accelerate the increase in minors experiencing gender dysphoria and seeking “transgender medical treatment” with detrimental and irreversible health effects.REF And both students and parents have described the negative impact of gender identity policies in single-sex spaces on privacy and safety of other students. A number of prominent national lesbian, gay, bisexual, and transgender (LGBT) activist groups advocate the development and implementation of SOGI curricula, touting their alignment with Common Core requirements and support from the National Education Association.REF Reading lists of LGBT-themed books are provided for all grade levels. Picture books, such as I Am Jazz and Jacob’s New Dress explain to kindergarteners that it is possible for a girl to be born in a boy’s body, and vice versa.REF Graphics, such as “The Gender Unicorn”REF (variants include the Genderbread Person and the Gender Snowperson) display gender, biological sex, and sexual orientation as existing on a spectrum, with students encouraged to mark their own self-identified location along it. And although 66 percent of parents in the Heritage survey state that they do not want young children to be taught these concepts in school, there are multiple incidents of parents reporting that their elementary-age children were upset and confused by lessons based on transgender ideology that were given without notice or opt-outs to parents.REF Because lesson plans teach students that traditional views about SOGI ideology are backwards and hateful, parents argue that this undermines their right to instruct their own children about marriage, sexuality, and gender. It is the prerogative of parents, not the state, to determine what children are taught about fundamental moral, religious, and philosophical issues. Despite the fact that 70 percent of parents want their schools to inform them if their child identifies as transgender or has questions related to his or her gender identity, schools continue to conceal this information. This has led to multiple lawsuits. In Madison, Wisconsin, 14 parents sued their school district arguing that the policy of concealing information about a student’s gender confusion from parents violated their constitutional rights.REF In Oregon, parents sued their school district after a teacher asked their eight-year-old son if he was transgender, leading to “significant emotional confusion” for which he was prescribed anxiety medication.REF Single-sex private facilities (such as bathrooms, locker rooms, and shower facilities) were explicitly permitted by a regulation after Congress passed Title IX of the 1972 Educational Amendments prohibiting sex discrimination in education.REF In Boyertown, Pennsylvania, both male and female students sued their school district after it adopted transgender policies in single-sex bathrooms and locker rooms, arguing that these policies violated their privacy, safety, and equality rights.REFAnd in Decatur, Georgia, Pascha Thomas, the mother of a kindergarten girl who was sexually assaulted by a boy who identified as “gender-fluid” filed a complaint with the U.S. Department of Education arguing that the district’s transgender restroom policy violated Title IX.REF In 2019, the House of Representatives passed the Equality Act, which adds sexual orientation and gender identity as protected classes to the 1964 Civil Rights Act. It would create a federal mandate that all public schools adopt gender identity policies in private facilities and athletics. It could also lead to federal courts ordering schools to adopt SOGI curricula, taking away power from states, school boards, and parents.REF Both parents and school board members responded favorably to schools providing students with information about contraception, and do not believe that schools should provide information on accessing an abortion. But policymakers and parents should be aware that pro-abortion actors within the sexual education community believe that abortion is inseparable from sex education curricula and advocate comprehensive sexuality education (CSE) and policies that address contraception, emergency contraception, such as the morning-after pill, and abortion.REF “Comprehensive” policies that emphasize risk reduction are not the same—or as effective—as policies that emphasize sexual risk avoidance (SRA).REF CSE does not necessarily take a position on whether high school students should abstain from sexual activity.REF SRA education goes beyond simply providing medically accurate information about aspects related to sexual activity, like contraception and sexually transmitted diseases. SRA incorporates proven pathways to future flourishing, such as the success sequence and education about healthy relationships and decision-making skills. Ultimately, parents have a right to determine what kind of education related to SOGI, contraception, and abortion is appropriate for their child and when their child will receive it. Parents should be aware of the educational curricula that their child will be exposed to and have the right to review any associated materials, including reading assignments, computer programs, and homework. Policymakers should ensure that parents have the ability to opt in rather than the responsibility of opting out (or having no choice at all) for all sexual education programs. Based on results from this first-of-its kind nationally representative survey of parents, along with a subset of school board members, on their opinions on the culture of K–12 education in America, government officials at all levels should better align policy with evidence on the mental and physical health of children. Most important, policymakers should make it easier for parents to select schools that reflect their values and goals for their children. Parents also have a role to play, making their voices heard at the local school board level. In order to enable more parents to select learning environments for their children that meet their needs and align with their values, Congress should: In order to increase school accountability to parents and expand educational opportunity, state policymakers should: The Heritage Foundation recently released The Not-So-Great Society: A Parents’ Guide to Education, focusing on the many programs and policies that came out of President Lyndon Johnson’s War on Poverty, which began in 1965.REF The Parents’ Guide includes ways in which families can engage with local school boards, including: Lindsey M. Burke, PhD, is Director of the Center for Education Policy, and the Will Skillman Fellow in Education, of the Institute for Family, Community, and Opportunity, at The Heritage Foundation. Jonathan Butcher is Senior Policy Analyst in the Center for Education Policy of the Institute for Family, Community, and Opportunity. Emilie Kao is Director of the Richard and Helen DeVos Center for Religion and Civil Society, of the Institute for Family, Community, and Opportunity. Mike Gonzalez is Senior Fellow in the Douglas and Sarah Allison Center for Foreign Policy, of the Kathryn and Shelby Cullom Davis Institute for National Security and Foreign Policy, and Angeles T. Arredondo E Pluribus Unum Fellow at The Heritage Foundation.                            Braun Research, Incorporated provided the following information on the survey methodology. Survey Project & Profile: Parents of School-Aged Children. Title: Culture of American K–12 Education: A Nationally Representative Survey of School Board Members and Families Survey Funder: The Heritage Foundation Survey Data Collection & Quality Control: Braun Research, Inc. (BRI) Interview Dates: April 3, 2020, through May 28, 2020 Interview Method: Online Interview Length: 10.2 minutes Language(s): English Sample Frames: Parents of School-Aged Children, K–12 Sampling Method: Non-Probability-Based Sampling Margin of Error: N=1,001: +/–3.1 percentage points (95 percent confidence level) Weighting: *Weighted on the following factors (to statistics shown later in this report): Gender, Race, Ethnicity and Education.    Methods Summary. The “Culture of American K–12 Education: A Nationally Representative Survey of School Board Members and Families” project, commissioned by The Heritage Foundation and conducted by Braun Research, Inc. (BRI), interviewed adults ages 18+ who are parents of school-aged children (K–12), in the United States, including in the District of Columbia. A total of 1,001 general-population interviews were conducted using an online methodology from April 3, 2020, through May 28, 2020. The margin of sampling error for this study is +/–3.1 percentage points (95 percent confidence level). All respondents were asked a series of screener questions to ensure relevance and qualification: IF YES TO 4: 4(a). Please select the grade(s) in which your child or children are currently in school: 4(b). What type of school does your child/do your children attend? [randomize responses 1 to 4] MULTIPLE RESPONSES ALLOWED BRI programmed and hosted this national web-based survey for parents of school-aged children (K–12). A total of N=1,001 parents participated in the online survey from an initial outreach of 5,225 persons e-mailed between April 3, 2020, and May 28, 2020. These individuals were randomly selected from the opt-in nonprobability online pool of panelists; n=637 persons terminated as disqualified. The margin of sampling error for the online, parent sample (N=1,001) of interviews is +/–3.1 percentage points. See Appendix B Table 2 for details on sample dispositions and response rates.    Weighting Procedures and Analysis. Weighting is generally used in survey analysis to compensate for sample designs and patterns of non-response that might bias results. ** We weighted on the following factors (to statistics shown later in this report): Gender, Race, Ethnicity, and Education. Survey Project & Profile: School Board Members. Survey Data Collection & Quality Control: Braun Research, Inc. (BRI) Interview Dates: May 1, 2020, through June 9, 2020 Interview Method: Online and Telephone Interview Length: 14.2 minutes Language(s): English Sample Frames: School Board Members (for schools across grades K–12) Sampling Method: Non-Probability-Based Sampling (online) via list provided by The Heritage Foundation; telephone sampling from this same list Margin of Error: N=566: +/–4.12 percentage points (95 percent confidence level) Weighting? No weighting    Oversampling and Minimum Targets? No Methods Summary. The “Culture of American K–12 Education: A Nationally Representative Survey of School Board Members and Families” project, commissioned by The Heritage Foundation and conducted by BRI, interviewed adults 18+ who are current school board members of schools, across grades K–12, in the United States, including in the District of Columbia. A total of 566 school-board-member interviews were conducted using an online and telephone methodology from May 1, 2020, through June 9, 2020. The margin of sampling error for this study is +/–4.12 percentage points (95 percent confidence level). We did not weight the data in this study. All respondents were shown an introduction screen and were asked a series of screening questions to ensure relevance and qualification: The Heritage Foundation provided BRI with a list of 24,347 school board members, along with e-mail addresses and some phone numbers to enable completion of this project. Within the sample file, we had a total of N=17,860 people with e-mail addresses, n=65 people with phone numbers, and n=6,422 with neither an e-mail address nor a phone number. A total of N=564 school board members participated in the online survey from May 1, 2020, through June 9, 2020. During these same dates a total of n=2 people (one of whom also had an e-mail address) participated in the telephone survey. A total of n=41 individuals was terminated for disqualification. BRI programmed and hosted this national web-based survey for school board members of grades K–12. BRI programmed and hosted both the online and telephone versions of this survey. The margin of sampling error for the online, school board sample (N=566) of interviews is +/–4.12 percentage points. See Appendix B Table 4 for details on sample dispositions and response rates.    Braun Research, Inc. (BRI). The Braun Research network of companies, founded in 1995, engages in data collection via telephone and Internet for various survey research firms, government and advertising agencies, local community organizations, local and national business groups, foundations, universities and academic entities, as well as religious organizations. In 25 years, Braun Research has conducted over 11,000 research projects by telephone, Internet, and mail worldwide. The work we execute requires us to perform all work up to standards required by the various research organizations, such as the American Association for Public Opinion Research (AAPOR). In fact, Paul Braun has served as a past President of the New Jersey Chapter of AAPOR. (http://www.braunresearch.com) Director, Center for Education Policy Will Skillman Senior Research Fellow in Education Policy Visiting Fellow, DeVos Center for Life, Religion, and Family Angeles T. Arredondo E Pluribus Unum Senior Fellow COMMENTARY  5 min read COMMENTARY  7 min read COMMENTARY  4 min read Subscribe to email updates Follow us © 2023, The Heritage Foundation ",
    "title": "The Culture of American K–12 Education: A National Survey of Parents and School Board Members | The Heritage Foundation",
    "url": "https://www.heritage.org/education/report/the-culture-american-k-12-education-national-survey-parents-and-school-board"
}