{
    "text": "Few trends in K-12 ed tech are as hot—or as under-researched—as “Maker” education. The term generally refers to using a wide variety of hands-on activities (such as building, computer programming, and sewing) to support academic learning and the development of a mindset that values playfulness and experimentation, growth and iteration, and collaboration and community. Typically, “Making” involves attempting to solve a particular problem, creating a physical or digital artifact, and sharing that product with a larger audience. Often, such work is guided by the notion that process is more important than results.  The Maker Movement has its roots outside of school, in institutions such as science museums and in the informal activities that everyday people have taken part in for generations. It began exploding about a decade ago, thanks in large part to the enthusiastic audience of Make magazine and the popularity of public events such as Maker Faires (the most well-known of which was hosted by President Barack Obama at the White House in 2014.) The rise of cheap digital tools, including microcontroller platforms such as Arduino and rapid-prototyping tools such as 3-D printers, has in recent years lent the movement a decidedly techie flavor. Efforts to bring Making and “Maker spaces” into K-12 schools are still “nascent,” said Erica Halverson, an associate professor of curriculum and instruction at the University of Wisconsin-Madison and a leading researcher into Maker education. But that’s changing fast. “I’ve seen a range of models, from putting a Maker space into the school, to importing Maker practices into classrooms, to working with an external Maker space to build connections between what happens in the classroom and in spaces outside of school,” Halverson said in an interview.  While exciting, that trend has begat a number of questions and tensions, many of which are just now beginning to be explored by researchers. Among the most significant: For those interested in reading more, following is a (non-comprehensive) roundup of nine recent books, essays, and research studies exploring Maker education in K-12. The list is drawn in part from work presented this past weekend at the annual conference of the American Educational Research Association, held here. 1. The Maker Movement in Education (Erica R. Halverson, University of Wisconsin-Madison, and Kimberly M. Sheridan, George Mason University, in the Harvard Educational Review, Winter 2014.) This oft-cited essay offers a context for analyzing and understanding the Maker Movement, focusing on the distinctions between Making (activities), Maker spaces (communities of practice, usually centered around a physical space), and Makers (a personal identity.) In addition to offering a concise history of the Maker Movement, its roots, and concerns and questions that have arisen around it, Halverson and Sheridan discuss the tensions associated with bringing Making into schools.  “Bringing the Maker Movement into the education conversation has the potential to transform how we understand ‘what counts’ as learning, as a learner, and as learning environment,” they write. At the same time, however, “perhaps the greatest challenge to embracing the Maker Movement in K-12 schools...is the need to standardize [and] define ‘what works’ for learning.” 2. The Promise of the Maker Movement for Education(Lee Martin, University of California-Davis, in the Journal of Pre-College Engineering Education Research, 2015.) Three elements of the movement are key to turning ‘Making’ into a good learning experience, Martin writes: Affordable digital tools that can provide young people with new ways to interact with physical materials; a community infrastructure (in the form of meetings, events, and online social networking) that cultivates the sharing of ideas and examples; and a “Maker mindset” that encourages students to “believe they can learn to do anything.” When Maker education is happening right, Martin contends, it can help students develop not just content-area expertise, but also interest in learning and an identity as a learner. As yet, though, “empirical evidence specifically about making is limited,” Martin acknowledges. 3. Invent to Learn: Making, Tinkering, and Engineering in the Classroom(Sylvia Martinez and Gary Stager, 2013)  The seminal handbook for teachers and educators who want to bring Maker Education into their schools and classrooms. See this 2014 Q&A I did with the authors. 4. Making Through the Lens of Culture and Power: Toward Transformative Visions for Educational Equity (Shirin Vossoughi, Northwestern University and Paula Hooper and Meg Escudé, Exploratorium, forthcoming in the Summer 2016 issue of the Harvard Educational Review.) This essay critiques prevalent notions of Maker education as too focused on white middle-class males and their interests. As a result of that focus, the authors contend, the “histories, needs, assets, and experiences of working-class students and students of color” are too often ignored and devalued in Maker education, and efforts around equity are often focused on bringing such students into unfamiliar or unwelcoming spaces, rather than changing the spaces themselves. What can be done? First, the authors say, those involved in Maker education need to be willing to tackle educational injustices, such as ensuring that Making is not limited to well-resourced schools. Second, the notion of what constitutes legitimate Maker activities needs to be broadened to include community-based practices from multiple cultures (think more sewing and crafting, in addition to computer science and robotics.) And third, Maker education needs to include a heavy focus on effective pedagogy, including a willingness to avoid fetishizing “self-directed learning” and instead focus on ensuring that teachers in Maker spaces know how to support all students.  5. Resourceful and Inclusive: Towards Design Principles for Makerspaces (Kimberly M. Sheridan, Abigail W. Konopasky, Asia Williams, Grace J.J. Wingo, George Mason University, paper presented at AERA 2016.) Key to making an effective Maker Space that works for all students, the authors write, is encouraging “resourcefulness,” or the ability of participants to draw not just on their own internal skills and experiences, but the assets of other people and their surrounding communities. Through case studies at two very different Maker Spaces (one a community-based site in a low-income neighborhood in Detroit, the other a digital game-design program run in partnership with their university), the authors identify three design strategies they believe can make this possible: When it’s all working, the authors write, “each member [of the Maker space] is looking for opportunities to solve their own and others’ needs and wants,” while adults are focused on creating new possibilities for youth inside the space and new connections and opportunities for youth out in the world. 6. Making Publics: The Iterative Design of High School Makerspaces (Amy Stornaiuolo and Phil Nichols, University of Pennsylvania, paper presented at AERA 2016.) A relative handful of new or redesigned high schools around the country are organizing themselves around the Maker approach, including the pseudonymous Collaborative Design School that served as the case study for this paper.  Attempting to integrate “Making” practices and philosophies into K-12 schools in struggling urban districts can lead to big challenges, the authors found. One of the biggest: Trying to convince low-income students of color (too often labeled as failures) and district administrators (too often obsessed with labeling schools as failures) that failure can in fact be a valuable way to learn. The case-study school’s “emphasis on trial and error, experimentation, and productive failure sat in uneasy alignment to the school’s competency-based curriculum and assessment practices,” the authors wrote. “Many of the students expressed trepidation or anxiety about how their participation in the [Maker space] ‘counted,’ and some expressed reluctance to change material they had worked hard to complete.” To counteract this dynamic, the school (and researchers, who worked as participant-observers) attempted to engage the students with multiple audiences, through presentations, conferences, research projects, and the like. They found that it can work—\"for some students, in some ways, at some times.” “In other words,” the authors wrote, “‘Making’ should not be understood as an inherently liberatory or transformative set of practices, and ‘Maker spaces’ should not be positioned as panaceas that can be inserted into classrooms as an autonomous fix for ‘failing’ schools and ‘at-risk’ students.”  7. Electronic Textiles as Disruptive Designs: Supporting and Challenging Maker Activities in Schools (Yasmin B. Kafai and Kristin A. Searle, University of Pennsylvania and Deborah A. Fields, Utah State University, in the Harvard Educational Review, 2014.) E-textiles “challenge current Making conventions” as well as popular conceptions about computer-science-related teaching and learning, the authors write, because they incorporate “soft” materials and practices, such as sewing, that are often associated with femininity. Through observing a series of making workshops for high school students, they conclude that working with e-textiles can have a number of benefits, including making the basics of how technology works more transparent to students; valuing aesthetics as a way of supporting student engagement and learning; and challenging students’ preconceived notions about who gets to work with computers. 8. Sewing Electronics in Science Class: Improving Student Interest in Science (Jiangyue Gu, Colby Tofel-Grehl, Deborah A. Fields, Chongning Sun, Cathy Maahs-Fladung, Utah State University. Paper presented at AERA 2016). The researchers behind this study employed a quasi-experimental design in which 8th graders in a rural middle school were assigned to one of two science-class units on circuitry. Both of the units were taught by the same teacher, but one was taught using traditional methods and materials, and the other was taught using e-textiles. The researchers found that academic performance between the groups was the same, but the students who took part in the e-textiles unit (which involved sewing and hands-on Making activities focused around projects the students got to choose themselves) showed increased interest in science and reported receiving increased encouragement to pursue science from their friends, families, and teachers.  Those changed attitudes can be particularly important in helping middle schoolers from groups that are traditionally underrepresented in STEM pursue related academic programs, the authors believe. “Because students could embody their personal interests in their e-textile projects, they might have been more interested in sharing their projects with family and friends, providing a context for potential change in the ways those viewers perceived and identified them with science in positive ways,” they wrote. 9. “Spill Your Ideas With No Judgment\": Exploring How a ‘Judgment-Free’ Youth Community Makerspace Supports African-American Girls’ Engagement and Identity Work as Community Makers and Engineers” (Edna Tan and Faith Brown Freeman, University of North Carolina, Greensboro. Paper presented at AERA 2016). Researchers have tended to focus on why many African-American girls don’t identify as scientists and often end up excluded from higher-level science courses, identifying factors ranging from disparaging assumptions and stereotypes held by their teachers to low expectations from their guidance counselors. What’s needed now, Tan and Brown Freeman contend, are solutions. And the starting point for that is “judgment-free” spaces that “intentionally, mindfully, and consistently seek to position African-American girls...as capable youth Makers.” The authors argue that happens through the following strategies:    See also: A version of this news article first appeared in the Digital Education blog. ",
    "title": "The Maker Movement in K-12 Education: A Guide to Emerging Research",
    "datetime": "2016-04-11T13:00:00",
    "url": "https://www.edweek.org/teaching-learning/the-maker-movement-in-k-12-education-a-guide-to-emerging-research/2016/04"
}