{
    "text": "The late actor, best known for his work on The Wire, devoted himself fully to every role, no matter the size. First comes a whistled tune—“The Farmer in the Dell,” delivered with extra menace. Then the sight of him—Omar Little, played by Michael K. Williams, stalking the streets of Baltimore in a billowing duster concealing a shotgun. Omar was the most indelible character on The Wire, one of TV’s greatest dramas, and the show was most viewers’ introduction to Williams, a captivating screen presence who was found dead yesterday in Brooklyn at the age of 54. Williams demonstrated versatility far beyond that one character: “Michael K. Williams Is More Than Omar From The Wire,” declared the headline of an excellent 2017 profile of the actor. But on hearing of his death, I couldn’t help but think of his swaggering entrance on that show back in 2002, when he was a near-total unknown. Though The Wire was about the impassable institutional lines drawn between cops and criminals, Omar belonged to neither world, a stickup artist who robbed drug dealers and kept to his own moral code. From the first minute, Williams spun to life a singular character who was intimidating, unpredictable, and devilishly wry—a standout in a series littered with career-best performances. Born and raised in East Flatbush, Brooklyn, Williams worked as a dancer and model in his 20s, scraping by with appearances in Madonna and George Michael videos. He was spotted by the rapper and actor Tupac Shakur, who lobbied for his casting in a small role in the film Bullet; he also popped up in Martin Scorsese’s Bringing Out the Dead and an episode of The Sopranos. The long scar on his face, obtained in a fight when he was 25 years old, made his visage all the more transfixing: He said he landed the role of Omar in one audition. The part was initially meant to be a recurring, not major, role, but Williams made Omar too unforgettable a character. He was an unpredictable element in a story about the inevitability of status quo, where any attempt to reform policing or drug dealing would eventually sputter and die. Omar’s individuality (he was gay at a time when crime TV was overwhelmingly straight) and his ability to carve out a somewhat moral space in an immoral world already made him fascinating. But Williams imbued him with emotional power, making Omar a figure who elicited awe and fear every time he tromped the streets, whistling. Read: How The Wire found its Omar: ‘The Omars of the world are warriors’ Hard as it is to imagine now, The Wire was actually a little-seen show when it first aired on HBO, though its critical acclaim eventually pulled in a wider audience by the end of its run, in 2008. After The Wire, Williams worked consistently, turning in a major effort whether he was guest-starring on Law & Order or appearing in huge movies such as 12 Years a Slave and Inherent Vice. Though he shaped many fine film performances, television was where he was handed the meatiest material. On HBO’s Boardwalk Empire, he played Chalky White, a Black gangster in 1920s Atlantic City who proudly vied for influence alongside Mafia bosses. With the TV film Bessie, he received an Emmy nomination for playing Jack Gee, the tempestuous husband of the singer Bessie Smith. In The Night Of, he collected another Emmy nod as a brutal prisoner ruling over Rikers Island. The great but underseen SundanceTV drama Hap and Leonard, based on Joe R. Lansdale’s novels, cast him as Leonard Pine, a gay Vietnam War veteran nursing anger issues and PTSD. Most recently, he secured his fifth Emmy nomination for his work as the mysterious patriarch Montrose Freeman in HBO’s Lovecraft Country. What distinguished all of Williams’s work was the deep integrity he lent any role, big or small. He played criminals, activists, professors; his characters were gay and straight, villainous and lovable. But all of them felt rooted in reality, no matter how lurid the material. Williams seemed incapable of delivering a half-hearted performance; he was too fearless an artist for that. He would sometimes return to his old neighborhood in East Flatbush—to the Vanderveer Estates (since renamed Flatbush Gardens), where he grew up—in order to research roles. He candidly discussed his issues with drug addiction, which persisted through his time on The Wire and beyond, and hosted documentary series on topics such as the juvenile justice system and black-market trade. Williams’s focus as a public figure was on trying to connect with youths who were struggling as he once had, creating new opportunities in theater and performance, and advocating for community-led public-safety solutions. “I just want people to remember me as one cool-ass dude, you know? Someone who cared,” he once said in an interview. “And I would never want anybody to say, ‘Oh, he forgot where he came from.’ That would hurt me the most.” ",
    "title": "The Humanity in Michael K. Williams’s Acting - The Atlantic",
    "datetime": "2021-09-07T15:45:07Z",
    "url": "https://www.theatlantic.com/culture/archive/2021/09/michael-k-williams/620001/"
}