{
    "text": "Super Junior, TVXQ and JYJ will be bolstered by stars completing their time in military Many male celebrities are wary of enlistment, fearing their fans will forget them while they are out of the spotlight. For some, though, military service has been a boon; actors Song Joong-ki (Descendants of the Sun) and Yoo Seung-ho (Remember - War of the Son) shed their boyish image in fatigues and were able to take on more mature roles when they returned from military service. Eight celebrities will complete their service this year. The first to return will be singer-actor Kim Hyun-joong. Kim enlisted in May 2015, and served in a border patrol at Paju, in Gyeonggi province. He is set to return to the screen in February and will draw a lot of media attention due to an ongoing legal battle with his ex-girlfriend. She sued him for 1.6 billion won (HK$10.3 million) in damages due to emotional stress from a miscarriage, and subsequently gave birth to Kim’s child a month before his enlistment. A court ruled there was insufficient evidence to prove her claim but she has appealed against the court’s decision. Next to be discharged from military service is TVXQ’s Yunho. The 30-year-old singer, who enlisted in July 2015, will return to civilian life in April. Yunho served in a military band and was honoured for his service in May 2016. Super Junior’s Eunhyuk and Donghae will return to K-pop three months after Yunho. Eunhyuk, who enlisted in October 2015 and also served in a military band, will be discharged in July. Donghae, who joined the military two days after Eunhyuk and served in the police, will also be discharged in the same month. In August, three more pop idols – TVXQ’s Changmin, Super Junior’s Choi Si-won and JYJ’s Park Yoo-chun – will resume their musical careers. Changmin and Choi enlisted as police conscripts on the same day in November 2015. The last one to return will be singer-actor Lee Seung-gi. He enlisted in February 2016 and will be discharged in October. Lee released a single, I’m Joining the Military, before his enlistment. ",
    "title": "The eight K-pop boy band idols that fans can’t wait to see return from military service in 2017 | South China Morning Post",
    "datetime": "2017-01-05T07:02:00+08:00",
    "url": "https://www.scmp.com/culture/music/article/2059286/eight-k-pop-boy-band-idols-fans-cant-wait-see-return-military-service"
}