{
    "text": "An impressive insider’s account of the wave of Asian culture now sweeping the world Earlier this year, the Tiger Mother Amy Chua and her husband, Jed Rubenfeld, published a book in which she argued that the secret of success lay in the “triple package” of “a superiority complex, a feeling of insecurity, and impulse control”. The couple claimed these characteristics explained the above-average achievement of certain ethnic and religious groups in the United States, including Mormons and immigrants from China and India. Now comes the fabulously snarky Korean-American author Euny Hong to back them up with a fascinating tale of a nation that appears to have used the same triple package to motivate itself from third-world poverty to economic and cultural success over the past 50 years. She describes a population schooled with military discipline, assured of their superiority to their communist neighbour to the north, yet living in constant fear of nuclear obliteration. Born and raised in Chicago until her family moved back to Seoul in 1985 (when she was 12), Hong is perfectly positioned to understand this complex Korean psyche while retaining enough distance (and cynicism) to evaluate it objectively and explain it to Western readers like me who thought that Psy’s 2012 pop hit Gangnam Style was a fluke. VISIT: Our complete guide to the best books to read, from novels to histories and memoirs It turns out that Korea has made the unusual decision to gamble its future on the global export of its slick, bright K-culture. You get just a taste of how serious they are about this when you hear that in 2009, when illegal music downloads meant the South Korean record industry was losing money, the government invested £54 million to rescue K-pop. And it paid off. An addiction to Korean pop music, television drama and video games has already spread across Asia and is making rapid inroads into South America, Europe and the Middle East. Anyone over 40 in Korea understands poverty. Now they are targeting other poor-but-rising countries with soap-opera storylines to hook them in and build an aspiration attachment to Korean products when consumer cash becomes available. They’re coming for the first world too. Hands up if you own a Korean-made Samsung Galaxy or LG television. Both Samsung and LG were in trouble after the Asian economic crisis of 1997. It was a source of national shame that the country was forced to ask the IMF for a loan of £34 billion, although because of cuts and a huge donation of private funds, it ended up borrowing only £11.5 billion and paid it back two years early. When Hong moved to Seoul in 1985 Samsung’s white goods were so poorly regarded it was known as “Samsuck”. And by 1994 Korea was so far behind the rest of the world’s analogue technology it ditched attempts to compete and went digital. The government wired the entire country for broadband. Samsung and LG developed digital phones and televisions and by the time the West caught up, the products were ready for collection. The Samsung Galaxy is now the bestselling mobile phone in the world. Much the same happened with pop music. Rock’n’roll was banned in the Seventies so they just skipped ahead with the electronica that’s driving the modern K-pop phenomenon. Its stars are drilled from a young age in dancing and proper decorum. Although his anti-social antics are comically tame by Western standards, Psy is a rebel because – Shock! Horror! – he didn’t study very hard at school. According to one article, he walked on the grass when there was a sign telling him not to. When he was seven. Apparently this was when even his mother gave up on him. Hong relates all this with wit and often anger. She weaves personal stories of being made to hop around the school playground like a bunny with insightful political and cultural analysis. She’s impressed by Korea’s achievements and thinks there’s a chance K-culture can still engulf us all. But she’s no sucker for the triple package. Or for the much-vaunted Korean concept of “han” – defined as “a form of rage arising from the fact that the universe can never pay off the debt it owes”. She makes you wonder what it profits a nation to gain the eyes and ears of the world if its soul remains unsatisfied. The Birth of Korean Cool by Euny Hong 267pp, Simon & Schuster, Telegraph offer price: £13.49 (PLUS £1.95 p&p) (RRP £14.99, ebook £7.99). Call 0844 871 1514 or visit books.telegraph.co.uk READ: Best books of 2014 ",
    "title": "The Birth of Korean Cool by Euny Hong, review: 'fabulously snarky'",
    "url": "https://www.telegraph.co.uk/culture/books/bookreviews/11002937/The-Birth-of-Korean-Cool-by-Euny-Hong-review-fabulously-snarky.html"
}