{
    "text": "Sections American South A Smithsonian magazine special report It started as a cost-saving workaround but stuck around for tradition’s sake K. Annabelle Smith Mardi Gras revelers in New Orleans may be needing all sorts of hangover cures this week, and they couldn’t do better if they visited the legendary Cafe du Monde and ordered beignets and coffee. The coffee, however, won’t taste quite the same and its not because your stomach is reconfiguring itself in its post-Bacchanalian recovery. Café du Monde, as part of what has become a New Orleans tradition, makes their coffee with chicory, the root of a blue-flowered perennial plant.\n\nThough the root has been cultivated since ancient Egypt, chicory has been roasted, ground and mixed with coffee in France since the 19th century. (The term chicory is an anglicised French word, the original being chicoree.) The root traditionally was used on its own in tea or in medicinal remedies to treat jaundice, liver enlargement gout and rheumatism. Coffee, meanwhile, first came to European markets in the 17th century and quickly spread throughout the continent. Within decades, coffee houses arose in London, Amsterdam, Paris and other centers of global trade. The coffee/chicory mixture probably began in Holland, but the drink wasn’t widely considered until 1801 when it was introduced to France by two men, M. Orban of Liege and M. Giraud of Homing, according to 19th-century writer Peter Simmonds in his Coffee and Chicory: Their Culture, Chemical Composition, Preparation for Market and Consumption. According to Simmonds’s “On the Culture and Commerce of Chicory”, the industry around the plant erupted in the first half of the 19th century. In 1835, France exported 1.25 million pounds of chicory and 25 years later, that figure had ballooned to 16 million pounds. Belgium and Denmark reported similar levels of consumption. “In some parts of Germany,” Simmonds writes, “the women are becoming regular chicory topers, making of it an important part of their daily sustenance.” American interest in chicory shared a corollary path to popularity, but first coffee had to take root as the beverage of choice. After British taxes on tea imports and an infamous tea party rocked the colonies, the locals acquired a preference for coffee. The French, meanwhile, had their own claims in North America as well as the Caribbean, establishing coffee plantations in Haiti and post-slave-rebellion, Cuba. In founding the city of New Orleans at the mouth of the Mississippi in 1718, France solidified its trade access to the continent. Coffee crops would soon follow and become part of the city’s culture, even as ownership of the port would switch from French to Spanish to French and finally to the United States over the course of the next 85 years. By 1840, the port of New Orleans was the second largest importer of coffee in the United States. But during the American Civil War, Louisianans looked to adding chicory root to their coffee when Union naval blockades cut off the port of New Orleans. With shipments coming to a halt, desperate New Orleanians looking for their coffee fix began mixing things with coffee to stretch out the supply. Acorns or beets (cafe de betterave) also did the trick. Though chicory alone is devoid of the alkaloid that gives you a caffeine buzz, the grounds taste similar and can be sold at a lower rate. Some manufacturers roasted chicory with two pounds of lard for every “hundredthweight,” or cwt, of chicory \"to give the chicory a better face.” Parsnips were also added occasionally, Even burnt sugar was sold to coffee dealers and coffee-house keepers under the name of \"black jack,\" according to an 1874 article published in the Chemical News and Journal of Industrial Science. Chicory coffee was cheap and for this reason, it’s been used in times of coffee shortage or economic crisis, like the Civil War and the Great Depression. It’s also been used to stretch supplies in prisons. But if you ask a New Orleans native, it’s all about the tradition. In addition to being delicious, the chicory in a café au lait (chicory coffee with hot milk) is an essential part of the city’s history. Per William Ukers’ All About Coffee: The old-time coffee houses of New Orleans were situated within the original area of the city, the section bounded by the river, Canal Street, Esplanade Avenue and Rampart Street. In the early days most of the big business of the city was transacted in the coffee houses. \"When you look at the coffee aisle, you'll find the chicory brands are limited to about three,\" Burt Benrud, Vice President of Cafe du Monde says. \"They really all originate here in New Orleans.\" Today, very little chicory is grown commercially in the United States for use in coffee. Cafe du Monde, for example sources its roasts from a company in Leroux, France. Fun Fact: \"Chicory\" is also the common name in the United States for curly endive. It’s a fancy lettuce you might find at your local high-end grocery store or farmer’s market. This kind of chicory also does not contain caffeine and it certainly doesn’t pair well with a beignet. Get the latest Travel & Culture stories in your inbox. K. Annabelle Smith\n|\n\n| READ MORE K. Annabelle Smith is a writer based in Santa Fe, New Mexico who covers a wide variety of topics for Smithsonian.com. Her work also appears in OutsideOnline.com and Esquire.com. Explore Subscribe Newsletters Our Partners Terms of Use © 2023 Smithsonian Magazine\nPrivacy Statement\nCookie Policy\nTerms of Use\nAdvertising Notice\nYour Privacy Rights\nCookie Settings © 2023 Smithsonian Magazine\nPrivacy Statement\nCookie Policy\nTerms of Use\nAdvertising Notice\nYour Privacy Rights\nCookie Settings ",
    "title": "The History of the Chicory Coffee Mix That New Orleans Made Its Own | Arts & Culture|\n Smithsonian Magazine",
    "url": "https://www.smithsonianmag.com/arts-culture/chicory-coffee-mix-new-orleans-made-own-comes-180949950/"
}