{
    "text": "Fifty (one) years on, Eli Lee analyses the realities and unrealities behind one of the seminal science fiction writer's densest novels  Known for writing novels that distort, contradict and flat-out deny reality, Philip K Dick is a science fiction legend. Though he died when he was only 53, Dick was amazingly prolific in his relatively short lifetime, producing 44 novels and 121 short stories – a phenomenal amount by anyone’s standards. He had a reputation as a drug-addled paranoiac – I’ve long imagined him sitting at home in Orange County, California, the shades pulled down to stop the light coming in, typing away all dogged and intense, stopping only to top up on amphetamines. Maybe that’s unfair, but the point remains that he was obsessive; the kind of man who would do whatever it took to get his writing done. And he wrote fiction not because he wanted praise for pretty sentences; he wrote it because he saw himself as a philosopher, and he found fiction the most natural way to get his ideas across. The Man in the High Castle (TMITHC) was published in 1962, only about a decade into his career, and a good five years before he started cranking out the famous stuff like Do Androids Dream of Electric Sheep?, VALIS and UBIK. He’d already published a clutch of novels in the 1950s, but TMITHC, which won the Hugo Award in 1963, was the first to show he had serious literary chops. It’s an alternative history, based on the premise that the Axis powers have won World War II and divided the globe into three: most of it is Reich-ruled; the Japanese-led Pacific States of America (PSA) controls a sliver of territory in the Far East and California; and then there’s an even smaller sliver of buffer zone in the Rocky Mountains. Its characters are mostly people living under Japanese rule in San Francisco, and it’s from their perspective that Dick poses the question: what if the Allies hadn’t won the war? TMITHC can, of course, never answer this question with any real certainty but envisions the possibilities brilliantly. The world-building is vivid, especially in the deliberately snarky touches – like Hitler being still alive in an Austrian sanatorium, crawling towards death with syphilis of the brain. Its rich complexity helps Dick, and his readers, explore the two big questions that preoccupied him his whole life – as he says in his essay “How to Build a Universe that Doesn’t Fall Apart Two Days Later” – ‘What does it mean to be human?’ and ‘What is reality?’ These are questions that science fiction is best poised to answer: for one thing, sci-fi is all about playing with what it means to be human (if you’re not bound to the flesh, you can go on playing forever), and as for the question of what reality is, well, it has all of science (and fiction) at its disposal to answer that. One classic sci-fi convention is to keep most of an imagined universe recognizable and prosaic, twisting and tweaking just a few things to create a sharp estrangement effect. Dick believed that this sense of dislocation – this “convulsive shock in the reader’s mind” – was necessary if sci-fi was going to seduce us successfully; that it must create a world that is both familiar and strange, all at once. The alternative history of TMITHC is a shining example: its world and people are recognizable – even the incongruences have their roots in reality – but there’s something alien lurking there. A constant shadow. So put the existential questions and the parallel universe together, and you might guess that Dick chose to write TMITHC as a dual-purpose critical allegory - to show how terribly shit things could have been, and to show how terribly shit they are. TMITHC was written at the height of the Cold War, not long after the failed Bay of Pigs invasion and JFK’s Vienna Summit with Nikita Krushchev, and with any alternative history, of course, you’re duty-bound to look at the writer’s context. But the Nazi regime in the novel creates such a claustrophobic atmosphere that it sort of closes in on you: there’s one scene where they’re running through the list of successors to Bormann (Dick’s choice of Reich Chancellor) and personality profiles of Goebbels, Goering, Heydrich, von Schirach and Seyss-Inquart are offered up. It’s bone-chilling; the stuff of horror stories. Of course it is. And so, when you’re reading it, you’re not thinking about the Cold War. You’re thinking about how gut wrenchingly sickening the Nazis were. (And in the novel, they’ve gone onto wipe out Africa and Eastern Europe too – it’s a horror fully realised.) You’re plunged into it, and it’s not so easy to sit back and think of metatextual references. But what this does, instead, is take us right back to that central question: what does it mean to be human? If the Nazis are on one end of the spectrum – in that one aspect of being human is having the capacity to embody evil – then other characters in the novel balance this out, and (luckily) Dick places us mostly in their shoes. There’s Mr Tagomi, a high-ranking official in the Japanese Trade Mission in San Francisco, riddled with classic Dickian melancholy about the moral numbness of the world around him; Frank Fink, a Jewish jewelry craftsman, working for a firm that specializes in fake historical American artifacts (US culture having been repressed and then reappearing as kitsch paraphernalia of a lost time, fetishized by the Japanese); and Frank’s estranged wife, Julianna, who’s living out in the Rocky Mountain States. Dick pulls us into their personal struggles of survival, illuminating the whole by focusing on the detail. We aren’t at the heart of the nastiness but on the periphery, yet the lives of the people here are still entirely circumscribed by the Fascist machine. With their plans and hopes skewered by politics and power, they’re all in the deepest of shit. And what do they do? They consult the I Ching. Escaping Fascism, they pursue Taoism. Here, the novel’s morality is pretty unsubtle – the one main character who doesn’t use the I Ching is also the only racist among them.  This may all sound kind of tenuous, but it’s not unusual for spirituality to inveigle its way into sci-fi; especially not a PKD novel. Or think of the works of Arthur C. Clarke or Roger Zelazny, or even consider Battlestar Galactica – sci-fi is obsessed with man’s solitude in the universe. It cries out for explanations – which comes right back to those two questions Dick asks and, in turn asks us to ask, about humanity and reality. It might seem odd to mix spirituality with political tension and ideological oppression, but Dick is clawing at the root to find out what really matters, when all is said and done, it has its role to play. So, then, why does he create these extreme situations, these end-of-world, post-end-of-world, and what-world-are-we-talking-about-anyway scenarios? I was listening to a bunch of Dick experts (ha ha) discuss this, on the radio show Expanding Mind and given all the wars, paranoia, confusion, flipped scripts and dissolving realities, I was surprised at what they identified as the most important point of his writing: they decided it was empathy. That’s what they pulled out from the (notoriously sloppy) prose, from the memory-wiping to the electric sheep: empathy. And it’s true. If it’s about anything, TMITHC is about that. All PKD’s novels are. We’re meant to empathise with ordinary people in shitty situations – because to be human is to struggle and we’re all in shitty situations. What matters is to have empathy. As Dick said:\n    “You know, people think that the author wants to be immortal, to be remembered through his work. No. I want Mr. Tagomi always to be remembered. My characters are composites of what I've actually seen people do, and the only way for them to be remembered is through my books.” As for the reality-baiting, it comes into TMITHC by way of the I Ching. As I said previously, one of the best things about sci-fi is the way in which it loosens the ground under your feet. There are some PKD novels where this happens constantly, where the characters aren’t sure if what’s real is (really) real or just a simulacra, but no such ruptures happen here. Yet, at its conclusion, the novel’s reality does fall apart, and what happens is both brilliant and confusing. The main characters are all reading a novel called The Grasshopper Lies Heavy (catchy!) about the Allies winning the war. It’s banned by the Reich yet available in the PSA and its enigmatic author lives in the Rocky Mountain States. Juliana goes to find him – he’s the “Man in the High Castle” of the title. (It’s hard to explain what happens now without spoiling the ending, so consider yourselves warned.) Still here? Okay. When Juliana meets the author, he says that the I Ching (at the time believed by Dick to be “a superb cosmology and science,” though he later refuted this) guided his hand in writing The Grasshopper Lies Heavy, dictating the plot to him via the hexagrams that appeared when he consulted it. Then, in classic PKD headfuck-style, it’s revealed that what happens in The Grasshopper Lies Heavy is in fact reality, and that the world of TMITHC is the fiction. And that’s it. It’s an abrupt ending, and it leaves us at the wormhole between the unreal universe of the book we’re reading, and the real universe of the book inside the book we’re reading. (Ouch. I’m not even sure if that’s a wormhole.) What did Dick intend by inverting reality like this? There’s something in the fact that the world of The Grasshopper Lies Heavy doesn’t match our reality completely, but its fictions are more consistent with our truths, so we have to journey through the artificial in order to get back to the real. Distinguishing between manufactured pseudorealities and the truth is a Dickian theme – this is the guy, after all, who chose to live next to Disneyland because he appreciated the way its ersatz reality fucked with his head. And time as not inexorable but malleable fits in with Dick’s insistence that reality is volatile; that it constantly changes, collapses and opens up into elsewheres. Sure, this is an obvious sci-fi trope, but it’s not just one of those hypotheses SF writers make up to fuck with our heads. Both in quantum physics, and in all the subjective realities that collide to create consensus reality, ‘reality’ is far from static or fully knowable. Later on, Dick would choose to explain all this away with a seriously weird Gnostic vision. After a theophany in 1974, he would come to believe he was a persecuted Christian in 1st Century Rome (it’s a long story, by all accounts). But at the time of THITHC, he was still searching for answers. He was saying: what if the world isn’t what it appears to be? Who are we then? Fifty years down the line, they’re still as good-a-questions to ask as any.  Follow @theQuietusBooks on Twitter for more Share this article: If you love what we do, you can help tQ to continue bringing you the best in cultural criticism and new music by joining one of our subscription tiers. As well as the unparalleled joy of keeping the publication alive, you'll receive benefits including exclusive editorial, podcasts, and specially-commissioned music by some of our favourite artists. To find out more, click here. Support tQ's work by becoming a subscriber and enjoy the benefits of bonus essays, podcasts and exclusively-commissioned new music. To find out more, click here. As a wholly independent publication, we rely entirely on our ad bookings to keep The Quietus going. Please whitelist our site in order to continue to access The Quietus. ",
    "title": "The Quietus | Features | Tome On The Range | Axis Of Empathy: Philip K Dick's The Man In The High Castle Revisited",
    "url": "https://thequietus.com/articles/11051-philip-k-dick-man-high-castle-revisited"
}