{
    "text": "It might seem like PSY single-handedly started the K-pop phenomenon, but here's a look back at the \"Idol\" acts who kicked things off in the '90s. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJessica Oak It might seem to many that PSY single-handedly started the K-pop phenomenon that has swept the globe. With “Gangnam Style,” his sound and comedic choreography have broken YouTube records, notching over 1.7 billion views since its July 2012 and drawing international attention. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news However, at the core of K-pop, there are “idols.” Their combination of Western and Eastern sounds, perfectly in-sync choreography and fashion choices have all helped K-pop stand out among other genres. Here, Billboard takes a closer look at the history of idol groups. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t08/06/2013 Idol groups hit the scene in the 1990s. The idol phenomenon came about after the 1992 debut of Seo Taiji and Boys, a trio of hip-hop singer/rappers who fused American pop music with Korean lyrics. Thanks to their ability to meld Eastern and Western styles, Seo Taiji and Boys experienced immense popularity in Korea. Seeing their popularity as an opportunity for profit, entertainment companies jumped on this new style of music, and began creating copy-cat groups.  Seo Taiji and Boys were so influential in changing Korea’s modern popular music that most followers mark the date of their debut as the definitive genesis of K-pop. After Seo Taiji and Boys came a renaissance period in which a first generation of idol groups, such as boy bands H.O.T. and Sechs Kies, became incredibly popular and amassed large, passionate and extremely competitive fandoms. The ’90s-style idol creation formula was so successful, it remains the norm today. The idols continue to evolve, but their roots remain the same. Second-generation idol groups TVXQ! and BEAST assumed a charisma reminiscent of H.O.T. and Sechs Kies. Even promotional strategies have been passed down from generation to generation of idol groups. Time and time again, the success formula for promotion has proven to be a hip-hop-based lead single followed up by a fun dance track or a ballad, and idol groups follow this formula almost religiously.   Second-generation idols also borrow the over-the-top fashion sense, unique hairstyling and meticulously choreographed dance moves from their predecessors. First-generation idols built the foundation for current idols. For an example, g.o.d., who had fangirls swooning with their boy-next-door wholesomeness, can be compared to current idol groups like 2AM, as these two groups interact more with fans and give off a friendlier vibe, unlike H.O.T. and Sechs Kies, who were all about a sort of snobby mysteriousness. Likewise, the debut singles of both B.A.P and H.O.T. show similar musical roots, both displaying strong hip-hop tones with a unique twist. B.A.P.s debut track, “Warrior,” and the H.O.T. smash hit “Warrior’s Descendent” both deal with school violence and the the groups both use “shouting” vocal methods in the bridge of the song. The charismatic, highly technical choreography is also very similar. The six-member group Apink currently stands out from most girl groups, ones who have been attracting viewers for their skin-showing outfits and provocative dance moves. Apink’s innocent, schoolgirl charms resemble first-generation girl groups such as S.E.S. and Fink.l.   Perhaps what is most astounding is that the formula created twenty years ago by Seo Taiji and Boys and followed by idol groups today has proven effective not only on the Korean peninsula, but worldwide. While the fashion and musical stylings that idols use are constantly evolving to conform to current popular culture, the roots that Seo Taiji planted have not only managed to remain firm, but have allowed newly created branches to grow and reach every corner of the globe. Today, idols have gone international, performing concerts from Rio De Janiero to Paris and Los Angeles to Bangkok. Their fans are no longer exclusively Korean speakers — one can conduct a simple Internet search and find the lyrics to K-pop songs translated by fans into Arabic, French, Vietnamese and more. While new idol groups continue to push the envelope with new concepts, styles and sounds, it’s clear that they remain true to the foundation created by Seo Taiji and Boys, a group that in 1992, probably never imagined that their influence would carry K-pop across borders and oceans 20 years later. (Additional reporting by Hannah Waitt) Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "title": "The Root of K-Pop: The Influences of Today’s Biggest Acts – Billboard",
    "datetime": "2013-08-06T13:00:00+00:00",
    "url": "https://www.billboard.com/music/music-news/the-root-of-k-pop-the-influences-of-todays-biggest-acts-5638224/"
}