{
    "text": "Today's Digital Daily Today's Digital Daily The universal appeal and of South Korean pop culture movements have launched a new era of lifestyle trends and multicultural ambassadors in Asia. SEOUL — K-pop, K-dramas, K-beauty, K-fashion and other “K” factors that make up the “K-wave” have built up such a following that South Korean celebrities such as K-pop singer G-Dragon or actress Jun Ji-hyun arguably have more global recognition than current South Korea President Moon Jae-in. South Korean cultural exports are popular around the world because they are well-packaged and marketed; the K-wave’s strength lies in its ability to appeal to a variety of different cultures, even in spite of the notorious insularity of South Korean culture and language. “It’s called K-pop, but it isn’t super Korean,” said Michael Hurt, a pop culture expert and visual sociology professor of foreign studies at Hankuk University. “It isn’t traditional hanbok-wearing people dancing, eating bibimbap. You see they’re Asian, but you don’t mark them as [South] Korean.…The power isn’t in the Korean-ness of it, but in that it’s a kind of cultural technology.” Related Articles\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tBeauty Features\n\t\n\n\n\n\t\n\t\t\tFounderSix Raises $12 Million in Funding\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tFashion Scoops\n\t\n\n\n\n\t\n\t\t\tGwyneth Paltrow to Pick Up Honor for Goop at CFDA Fashion Awards International brands have taken notice, and many of them are harnessing the star power and marketing prowess behind the K-wave to bring products, collections and specific messages to new audiences in Asia. Earlier this year, Tod’s tapped K-pop star Krystal from f(x) as the Italian luxury brand’s first-ever Asian model in its latest regional campaign; Luhan, a former member of EXO, has been fronting Asia-wide ads for French beauty brand L’Occitane since June, and Fendi backed the launch of a new capsule collection with Taeyang from boy band Big Bang in late August. “Someone like Taeyang — why would Fendi choose to do a collaboration with him versus someone like Rihanna or a more Western star? [Just look] at his Instagram data, which is fascinating,” said Kim Leitzes, chief executive officer and founder of Parklu, a digital platform that connects brands with Chinese influencers. “He has 7.6 million followers on Instagram; 90 percent of his followers are under the age of 35….You can only imagine what these numbers would look like if Instagram wasn’t blocked in China. “In his case he doesn’t look like the classic Fendi customer and they’re looking to attract the younger Asian demographic.…The average luxury consumer in North America and Europe is 40 to 60 years old. In China [and other parts of Asia] they’re in their 30s,” she added. Some brands, like H&M, have taken it a step further by launching their own Korean street-style collections. In 2016, H&M’s “K-fashion” limited-edition capsule collection sold exclusively in China, Hong Kong, Taiwan and Japan was well-received by K-pop and K-fashion fans in the region.  Since the 1800s, the Korean peninsula has been described as a “hermit kingdom,” an isolationist territory with its own unique culture, social customs and norms. But while the term is still sometimes used to describe North Korea’s Communist dictatorship, South Korea, which only became a democracy in the late Nineties and which remains one of the most ethnically and culturally homogenous nations in the world, has managed to become a remarkably influential pop culture purveyor and trendsetter over the last 10 years. Nowadays, glossy, well-produced music videos featuring the choreographed moves of K-pop stars and picture-perfect soap operas, as famed for their melodramatic storylines as the Gucci dresses and Jimmy Choos worn by the immaculately styled heroines in them, are the new symbols of modern South Korea. South Korean pop culture has become hugely popular in part due to the fast-paced rate of digitalization — social media, mobile phone culture — and globalization in recent years, but it is not an isolated phenomenon in East Asian culture. Japan, Hong Kong, Taiwan and South Korea have each respectively experienced what economists once called an “East Asian renaissance” over the past 30 years. The K-wave shares much in common with older movements such as the golden era of Hong Kong cinema between the Eighties and Nineties, during which Cantopop music also reigned and Triad and gangster-influenced fashion and films represented the dominant regional counterculture at the time. There also was the popular and influential J-rock — Japanese rock — scene led by “visual kei” bands such as the flamboyantly dressed and elaborately coiffed Glay and L’Arc-en-Ciel in the late Nineties and Aughts. Experts say millenias of shared histories, along with culturally similar values and tastes, have enabled the region’s nations to engage in powerful pop culture exchanges. “If we look at China, [South] Korea, Japan, we have philosophies like Confucianism. The lifestyle is a bit similar, the value system is a bit similar; people are not too extroverted, they’re more introverted; they have shared phenotypes and look alike. They have the same appreciation for what is beautiful, whereas compared to the U.S., it’s very out there,” said Bettina Ding, a consultant at Cherry Blossoms, a marketing research firm in Hong Kong. “I think the Chinese in particular would prefer a more digested version of U.S. pop culture, which is what we see in [South] Korea and Japan.”  Over the past decade, South Korea has remained the dominant cultural influencer in East Asia, despite the longstanding nuclear threat from the North looming over the peninsula; ongoing territorial disputes with Japan over Dokdo or Takeshima Island, and even during political tension over China’s strict stance against South Korea’s Terminal High Altitude Area Defense anti-ballistic missile system — which has led to a nationwide ban on South Korean entertainment imports and tourism. “Some countries don’t like other countries — and if a trend is popular in one country they don’t want it in [their] country,” said Simon Collins, founder of the Fashion Culture Design conference and visiting mentor to Seoul Fashion Week, recalling his experience as creative director at Nike Asia, where he oversaw regional collaborations with brands like Comme des Garçons and Issey Miyake. “That was mostly in the past, but for the time being to some extent it’s still there.” China’s ban in particular stands to have a major effect on the South Korean tourism and entertainment industries; it hasn’t seem to have curbed the overall demand for Korean pop culture on the continent. MORE: South Korean Industries Hit Hard by THAAD >> “If we take mainland Chinese youths, especially the current post-Nineties generation, they’re relatively less affected by such complex histories,” Ding said. “Chinese youth have had a long history of being open to being influenced by foreign trends.” In this new age of consumption, rather than looking at traditional identities such as ethnicity or nationality — you are what you buy, Hurt said. “I define myself through the things I buy, the fashion tribes I belong to, the sites I read….On that level, for instance, Japanese and [South] Korean people have a lot in common,” he said. “I think the way consumptive habits happen in places like Japan, China, [South] Korea, Malaysia, Indonesia — people buy things in similar ways in these countries. And [South] Korea has defined a very appealing way of linking fashion, music, makeup to [consumers’ identities].” Forward-thinking international brands, like Hong Kong-based K-fashion retailer H:Connect, are increasingly channeling these new attitudes and identities.  H:Connect, which first launched in 2013, is best known for ad campaigns featuring South Korean celebrities in a variety of preppy blouses, cartoon T-shirts, skinny jeans and other clean-cut street-style-inspired basics. “The K-pop trend had been permeating Asia all the way from Korea to Southeast Asia,” said Brian Lee, manager of Branded Lifestyle, parent company of H:Connect and a division of Fung Retailing Group. “I knew that we had to take part in this cultural movement. So with K-pop culture as anchor, we launched our brand. It turns out when you have the right brand positioning and the flexibility in store format you can grow a brand very quickly. “From a brand perspective, consumers are very clear on what they like. If something is good, consumers don’t really care about what country it’s from,” Lee continued. “After all, Asia is a group of pretty tight countries when it comes to entertainment and fashion culture.” The brand has worked with South Korean celebrities including Yoona Lim from K-pop group Girls Generation, who often draws tens of thousands of fans during in-store meet and greets throughout Asia. “I think for Asian fans, especially in high growth countries such as China and Vietnam where people are motivated to improve their lives, these idols represent dream and hope,” Lee said. “They represent a potential version of a better ‘me’.” “The South Korean entertainment system [tends to] incubate young idols to become pan-Asian idols, they’re very good at that,” Ding said. “They have strong personalities, which allows brands to choose a particular person with a particular character so it communicates to a particular market.” For this reason, more relatable multicultural K-pop celebrities with crossover appeal such as Kris Wu and Luhan, who are respectively Chinese-American and Chinese former members of wildly popular boy band EXO, are especially bankable for the brands they front.  “For example, Kris Wu’s bad boy image appeals to a particular market,” Ding said. Wu, who collaborated with Burberry to curate pieces for his own Burberry ad campaign in 2016, is credited with bringing a fresh street-style sensibility to the British brand, as well as boosting its sales in China. With his K-pop aesthetic, and multilingual abilities, Wu speaks English, Korean, Cantonese and Mandarin and embodies a new generation of K-wave entertainers going global. “I think whenever a person, whether it’s a celebrity or KOL, when they can speak the language or connect with people — that is their currency in social media,” Leitzes said. “When an influencer can speak to that it adds a whole other layer. Multicultural identities are helpful in this world.” The growing importance of the role of multicultural ambassadors is undeniable, as KOLs vie for pan-Asian — if not global — appeal. “Some of the South Korean celebrities I have worked with can spend up to an hour to rehearse a phrase in Mandarin,” Lee said. “Just so that when she says it in front of fans, she would sound more native.” Sign up for WWD news straight to your inbox every day Get all the top news stories and alerts straight to your inbox. Get all the top news stories and alerts straight to your inbox. Send us a tip using our anonymous form. WWD and Women's Wear Daily are part of Penske Media Corporation. © 2023 Fairchild Publishing, LLC. All Rights Reserved. ",
    "title": "The Transcultural Appeal of the K-Wave – WWD",
    "datetime": "2017-12-27T05:01:02+00:00",
    "url": "https://wwd.com/business-news/business-features/korea-kpop-appeal-11021118/"
}