{
    "text": "As the lines between real and fake blur, Americans increasingly chase the idea of authenticity. The first step may be to consider self-knowledge, truthfulness, and other building blocks on the road to personal growth. Verified by Psychology Today Posted December 3, 2022\n\n|\n\n\nReviewed by Lybi Ma What do Korean beauty products and the depiction of Jesus’s race have in common? Korean culture, known as K-Culture, refers to a worldwide obsession with various domains of Korean culture, BTS and Squid Game; it also certainly includes a keen interest in Korean beauty products. Whenever I lead the short-term, South Korean study abroad program for students from my U.S. institution, students love checking out the ubiquitous beauty product shops in Seoul. But the White and non-White students often tell contrasting and troubling stories after visiting the stores; Black and Brown students recount not being able to find products that match their skin, whereas White students —also obviously foreigners in Korea—report little trouble (an apt illustration of racial privilege). Students also observe and reflect upon the striking advertising in public settings (like subway cars) of skin whitening products and plastic surgery clinics promoting a beauty standard that overtly declares, beauty = white facial features. And White American students recount anecdotes of complete strangers fawning over their lighter skin, whereas the BIPOC students, more often than not, report a range of responses from others— some favorable, others clearly unfavorable, and a few that are downright confusing. Clearly, a beauty standard that upholds lighter skin as the ideal permeates much of Korean culture. There is another way that the preference for lighter skin enters the picture in the Korean setting; namely, in religion. This is especially true in the depiction of Jesus in artistic form (for example, in paintings). I have been living in Korea for the last three months to care for a hospitalized family member, and this has afforded me ample opportunity to soak in various depictions of Christianity in public (or at least, visible) settings (in church banners, printed church bulletins). I have been especially struck by the unchallenged acceptance of Jesus as a White man in artistic renderings. I am not aware of any empirical studies or public surveys on this topic in Korea, perhaps that itself is telling. But in other parts of the world, there are some intriguing findings regarding people’s perception of Jesus’s race. For example, according to a YouGovAmerica survey, most people in the U.S. have an accurate understanding that Jesus should be depicted as Middle Eastern (65 percent) to be historically accurate, but a sizable percentage also say that it is acceptable to portray Jesus as White (60 percent; Smith, 2020). Similarly, supporting the idea that what people believe is not necessarily aligned with the reality of their contexts, more Britons admit that they see Jesus portrayed as White (58 percent) in their everyday settings compared with Jesus portrayed as Middle Eastern (22 percent; Smith, 2021). At this point, you might wonder: What is the big deal about how Jesus is artistically depicted in terms of his race? Research suggests that the depiction of Jesus’s race in artistic renderings has consequences. A fascinating and important study of this topic based on a U.S. college sample (Howard et al., 2021) reported that the belief that Jesus was a White man was associated with more: Back to my earlier question about the commonality of Korean beauty products and portrayals of Jesus as White: Both uphold whiteness as the standard. Every time I visit South Korea, I am somewhat encouraged by the gradual progress that I observe in the thoughtfulness behind, for example, public advertisements featuring diverse models. Although there is still a long way to go, whenever I walk into a makeup store, I observe an intentional effort to broaden the representation. This is, anecdotally, a notable change compared with the widespread use of White models in the past. Similarly, I hope that Korean society, and Korean Christian communities, in particular, will become more discerning of the different ways that Christianity is depicted in public spheres, and as needed, counter a “non-White Jesus” narrative. I realize that the problem of portraying Jesus as a White person is just one manifestation of deeply rooted issues that require unpacking from historical, theological, and sociological perspectives. At the same time, as a psychologist, I would argue that there are tangible behavioral modifications possible at the individual, family, and societal levels that will collectively be a step in a helpful direction. Such an effort might be as simple as altering public renderings of Jesus to be more historically accurate. It might involve scholars interrogating the validity of Western symbols that are so prevalent in Korean Christianity. Religious leaders should be more intentional in their use of religious images in their work, especially apropos as we approach this time of the year when images of Christianity are all around us. And parents should dialogue with their children about the myth of White Jesus whenever they encounter it. References Howard, S., Vine, K. T., & Kennedy, K. C. (2021). “Jesus was a White man too!”: The relationship between beliefs about Jesus’s race, racial attitudes, and ideologies that maintain racial hierarchies. Psychology of Religion & Spirituality. Advance online publication. https://doi.org/10.1037/rel0000374 Neville, H. A., Lilly, R. L., Duran, G., Lee, R. M., & Browne, L. (2000). Construction and initial validation of the Color-Blind Racial Attitudes Scale (CoBRAS). Journal of Counseling Psychology, 47(1), 59–70. https://doi.org/10.1037/0022-0167.47.1.59 Smith, M. (2020, December 22). What race can Jesus and Santa be? YouGovAmerica. https://today.yougov.com/topics/lifestyle/articles-reports/2020/12/22/what-race-can-jesus-and-santa-be Smith, M. (2021, December 23). What race can Jesus be? https://yougov.co.uk/topics/society/articles-reports/2021/12/23/what-race-can-jesus-be Paul Youngbin Kim, Ph.D., is a professor of psychology at Seattle Pacific University. Get the help you need from a therapist near you–a FREE service from Psychology Today. Psychology Today © 2023 Sussex Publishers, LLC As the lines between real and fake blur, Americans increasingly chase the idea of authenticity. The first step may be to consider self-knowledge, truthfulness, and other building blocks on the road to personal growth. ",
    "title": "The Science of Korean Beauty Products and Whiteness | Psychology Today",
    "url": "https://www.psychologytoday.com/intl/blog/culture-religion-and-psychology/202212/the-science-korean-beauty-products-and-whiteness"
}