{
    "text": "To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. Angela Watercutter Just as every generation has its own Batman (we're Team Keaton, FWIW), every generation has its own Batmobile. Whether it looks like a Lincoln or a war machine, it's still clearly the non-discreet hero whip of the Dark Knight. In 1963, that roadster was a tricked-out Oldsmobile 88 that toured the country promoting All Star Dairies' Batman-themed ice cream. \"Batman's Batmobile,\" as local newspaper clippings referred to it, was created when All Star was an official DC Comics' licensee, but the car went missing sometime after 1966. It had been returned to its original owner (All Star had merely rented it), who turned around and sold it for $200. It eventually wound up in a New Hampshire field, where it sat for decades before being discovered and excavated in 2008. (It looked like this when they found it.) The car—now completely restored—will go up for auction next month. Opening bid? $90,000. \"This is a great piece of lost pop culture and Americana,\" Margaret Barrett, director of entertainment and music at Heritage Auctions, which is handling the auction, said in a statement. \"After it was removed from the field, it went through a few owners before the most recent owner, Toy Car Exchange, put the car through a painstaking frame up restoration with the original engine and other original parts lovingly restored and rebuilt.\" Heritage expects the roadster to bring in a lot more than its opening bid—perhaps $500,000 or more—and it might be worth every penny: After acquiring the car, Toy Car Exchange took it to a shop in Sacramento that spent three years stripping it and restoring it. The final ride looks as slick, if not better, than the Batmobile from the 1966 Batman TV show—and definitely better than the Tumbler from the Christopher Nolan films. And if that isn't worth the price of a new Lamborghini, we don't know what is. Check out the Batmobile in the gallery above. It goes on the Heritage Auctions' block on Dec. 6. Andy Greenberg Megan Farokhmanesh Julian Chokkattu Matt Burgess Angela Watercutter Jennifer M. Wood Jennifer M. Wood Reece Rogers Kate Knibbs Khari Johnson Jennifer M. Wood Gideon Lichfield More From WIRED Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. WIRED may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "title": "This Restored 1963 Batmobile Could Cost You a Cool $500K | WIRED",
    "datetime": "2014-11-25T11:30:53.000Z",
    "url": "https://www.wired.com/2014/11/missing-1963-batmobile-auction/"
}