{
    "text": "The last of the former Cannabis Culture dispensaries in Toronto, once synonymous with Marc and Jodie Emery, will close this weekend after becoming a frequent target of police raids — a consequence the marijuana activists blame on the government's support of licensed producers. The dispensaries were making pot available in contravention of the law, until recreational marijuana is actually legalized by the government, a process expected to happen in July 2018. But former owner Jodie Emery said she believes dispensaries in Toronto have been raided more frequently in the past year because the federal Liberals want to keep the recreational weed market clear for the licensed producers already selling medical marijuana. \"We're seeing a government and corporate push to exclude the pioneers, to literally put us in handcuffs and throw us into cages while they move in to open up their own shops to sell their own pot.\" The Emerys divested themselves of their Cannabis Culture shops in Toronto on March 10, as part of their $30,000 bail conditions on possession and drug trafficking charges. Jodie Emery said the couple decided to open the storefronts to fund their activism — and because she believed the franchise model would be successful once Ottawa legalized pot. \"We wanted to have our spot in this industry, because we've earned it and we deserve it ...after 10 years of being broke and suffering through prison and court,\" she said. The 461 Church St. location was reborn as the Village Cannabis Dispensary after the Emerys sold it to Jamie McConnell, the store's former manager. McConnell said his landlord will no longer rent to the dispensary, something he said has happened because of pressure from the police raids and the city.   \"I was planning on being here forever, my goal was jail or the landlord locking me out. It looks like the landlord locked me out.\" He said he believes it's better to have marijuana \"activists and users\" sell the products than licensed producers, because they know first-hand what makes a quality product.  \"I don't know what the government's going to do as far as legalization, but I'm not going to stop.\" But Andrea Hill, a corporate and securities lawyer with the firm SkyLaw who represents several regulated marijuana firms, said the dispensaries have been shut down because what they're doing is illegal. It has nothing to do with the regulated medical marijuana industry. And those licensed producers have been pioneers in the industry as well, she said. \"They've put themselves on the line just as much as anyone else,\" the lawyer said. \"If a business is operating outside of the law and it can't make it and it has to shut down I think that means that the law wins — and that people who play by the rules win, at the end of the day. I think that's a good thing. Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636 It is a priority for CBC to create products that are accessible to all in Canada including people with visual, hearing, motor and cognitive challenges. Closed Captioning and Described Video is available for many CBC shows offered on CBC Gem.  ",
    "title": "Toronto dispensaries once owned by the Prince of Pot will all shut down this weekend | CBC News",
    "url": "https://www.cbc.ca/news/canada/toronto/pot-cannabis-culture-raids-1.4062171"
}