{
    "text": " Toxic substances, such as preservative and disinfectants, had been found in foods imported from China. According to the Ministry of Food and Drug Safety (MFDS) on September 13, six cases of kimchi imported from China were found to contain preservative, including propionic acid and dehydroacetic acid, in the past six months. In short, China-made kimchi that was not safe to eat was imported once a month. The ministry discovered that “Kimchi Ssadagu (cheap),” which was produced by a food company in Qingdao, China, contained 46 milligram of propionic acid per kilogram in June and discarded the products. The use of preservatives, like propionic acid, is allowed to make some breads and cheese with only a certain amount but is prohibited to make kimchi. The consumption of excessively preservatives can cause abdominal cramping and nausea as well as rash, rhinitis and male hypogonadism. In July, cyclamate, an artificial sweetener which is banned from using in the United States and South Korea as a potential precarcinogen, had been found in green onion kimchi products imported from China. In this regard, the food safety authorities said, “Preservatives found in the product are not harmful enough to cause serious health problems. We don’t have any plans to conduct a survey whether the kimchi product of controversy has been distributed to the domestic market.” More than 200,000 tons of kimchi made in China are imported to South Korea a year, accounting for most of the total kimchi imports. According to the “Improper Food Imported from China in Past Three Years” report submitted to the National Assembly by the MFDS, 0.027 milligram of malachite green had been found in China-made Korean bullhead per kilogram in April. Malachite green is a disinfectant that was used to remove parasite and water mold by aquaculturists in the past, but it is now prohibited from using due to its carcinogenic potential. Professor Kim Jin-man of Department of Food Science and Biotechnology of Animal Resources at Konkuk University said, “It means that food scares in 2005 such as Chinese kimchi with parasitic eggs and eel with malachite green, can reoccur now. The government should strengthen the food safety management.” Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Toxic Substances Found in Foods Imported from China - Businesskorea",
    "datetime": "2017-09-15T06:00:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=19324"
}