{
    "text": "Camila Domonoske The new poet laureate of the United States, Tracy K. Smith, visits the Library of Congress Poetry and Literature Center in Washington, D.C., last month.\n                \n                    \n                    Shawn Miller/Library of Congress\n                    \n                \nhide caption The new poet laureate of the United States, Tracy K. Smith, visits the Library of Congress Poetry and Literature Center in Washington, D.C., last month. Tracy K. Smith knows many readers are intimidated by line breaks. She knows people don't like identifying consonance, assonance or alliteration. But Smith — the newly announced 22nd Poet Laureate Consultant in Poetry of the United States — wants to help America push past that anxiety. \"What do you hear? What do you feel? What does this remind you of?\" she asks NPR. \"These are all real and valid reactions to a poem.\" The poet laureate is appointed by the librarian of Congress and fills the role for a year. Smith takes the mantle from Juan Felipe Herrera, who has served two terms. Librarian of Congress Carla Hayden said in a statement that Smith's work \"brings history and memory to life\" and \"calls on the power of literature as well as science, religion and pop culture.\" The job doesn't come with a lengthy description. The Library of Congress \"keeps to a modest minimum the specific official duties,\" as the statement put it, so each new poet can have maximum freedom. But the library notes that many recent poet laureates have sought to expand the audience for poetry. \"I think the responsibility really is to just help raise the awareness of poetry and its value in our culture,\" Smith tells NPR. \"To me that means talking to people — getting off the usual path of literary festivals and university reading series and talking to people who might not even yet be readers of poetry. \"I would love to go to places where people might be struggling, where people might wonder if there are voices out there for them,\" she says. Smith, 45, is the Pulitzer Prize-winning author of three books of poetry. Born in Massachusetts, she grew up near an Air Force base in California as the youngest, by far, of five children. She went to Harvard and Columbia, was a poetry fellow at Stanford and now teaches at Princeton. You might have heard her voice on NPR. Several years ago, she spent a day with the network and wrote a poem about the news. In recent years, Smith has been exploring other forms. Among other things, she's currently working on two operas. One, with composer Judd Greenstein and video artist Joshua Frankel, is about two competing visions of progress in New York City. The other, with composer Gregory Spears, is about the legacy of slavery \"and how it shapes our sense of what is possible for moment to moment in our everyday lives,\" she says. She has also written well-received nonfiction. Her recent memoir, Ordinary Light, describes her mother's death from cancer and explores her experiences growing up black in suburban Northern California reared by parents with deep roots in the American South. \"I feel that as a person of color I've always been interested in the stories that are quiet and the stories that often get overlooked,\" Smith says. \"I think that inevitably I'm aware of these margins and I'm curious about them because I know what it feels like to be [outside] of one.\" As poet laureate, she says, \"I think it will be very easy to say, 'Let's have a diversity of voices, perspectives, experiences, aesthetics that we draw from. And let's listen.' \" Poems, Smith says, house contradictions and disrupt certainties — and, fundamentally, \"connect us more fully to our own inner lives and to the lives of others.\" Her Pulitzer Prize-winning 2011 collection, Life On Mars, explores the infinite expanses of space and plays with the tropes of science fiction. It also draws on her father's experience as an engineer on the Hubble Space Telescope. But sometimes no telescope is necessary. Smith can find the vast and profound in the smallest of domestic spaces. In \"The Universe as Primal Scream,\" reflecting on a noisy neighbor, Smith wonders if the children screaming upstairs will \"hit/the magic decibel\" and carry the whole building off to the afterlife: ... If this is it — if this is whatTheir cries are cocked toward — let the skyPass from blue, to red, to molten gold,To black. Let the heaven we inherit approach. ... I'm readyTo meet what refuses to let us keep anythingFor long. What teases us with blessings,Bends us with grief. And she traveled from the \"workaday\" world to the \"brief ecstasy of being\" as she addressed her daughter before conception in \"When Your Small Form Tumbled Into Me,\" which she read for NPR in 2013. Smith tells NPR that poetry, as a form, is comfortable with the expansion from the personal to the cosmic. \"It's most closely akin to the logic of our dream lives,\" she says. \"I think poems trust that quick associative leaping, that disruption of the ordinary. \" Another poem leaps from one glistening star to another — from outer space to the genius of David Bowie. \"Don't You Wonder, Sometimes?\" found new readers after Bowie's death as it circulated online, passed from one mourner to another. The poem reads, in part: ... there are occasions When a man his size can meetYour eyes for just a blip of timeAnd send a thought like SHINESHINE SHINE SHINE SHINEStraight to your mind. Bowie,I want to believe you. Want to feelYour will like the wind before rain. \"A poem gives me a chance to have an encounter with a feeling, with an experience, with a wish, with an idea,\" Smith said. \"When that poem became useful to other people I was — I was grateful.\" Smith says she's been thinking, lately, about how people turn to poetry in fraught times. \"It's often those large moments where big things happen, where loss occurs — or in moments of isolation, where a voice on a page that's saying, 'I have lived, I have felt, I have questions, and I have wishes,' where that's consoling.\" One of her goals as poet laureate is to make even more people aware that poems are, as she puts it, \"another resource that you can turn to\" in times of uncertainty. \"What excites me is that I'm an ambassador for poetry, which is something that I wholeheartedly believe in and that has been an anchor and a force of stability and consolation throughout my life,\" she says. \"I think that's good news.\" Sponsor Message Become an NPR sponsor ",
    "title": "Tracy K. Smith Named New U.S. Poet Laureate; Calls Poems Her 'Anchor' : The Two-Way : NPR",
    "url": "https://www.npr.org/sections/thetwo-way/2017/06/14/531784281/tracy-k-smith-new-u-s-poet-laureate-calls-poems-her-anchor"
}