{
    "text": "The Observer is a student-run, daily print & online newspaper serving Notre Dame, Saint Mary's & Holy Cross. Learn about us. Maria Leontaras and Maeve Filbin | Thursday, September 6, 2018 Tracy K. Smith, the 22nd Poet Laureate of the U.S., spoke at the annual Saint Mary’s Christian Culture Lecture on Wednesday night. The acclaimed writer shared her beliefs on the connections between poetry and faith, read her work and explained the Christian undertones of her writings. Smith said faith and poetry provide an opportunity for spiritual and personal awakening. “Poetry is one of the languages that puts us in touch with our higher selves,” she said.  “Poetry, like the language of belief, puts us in touch, if we let it, with our eternal selves. Spiritual belief has given us a vocabulary for wonder, for the miraculous and indescribable. In so doing, it has argued compellingly for the necessity of metaphor as a means of making familiar and intimate what we otherwise could not comprehend.” Smith said the use of metaphor is especially prevalent in the New Testament of the Bible and provides Christ and the disciples with a way to transmit not only information, but also awe. “The Gospels offer language-based proof that there is no such thing as seeing eye to eye, no such thing as having the exact same experience as anyone else,” she said. “In their accounts of Christ’s time on earth, Matthew, Mark, Luke and John create together a single story, complete with perspectival shifts, lapses and any contradictions as corroborations. That these different writings of experience work together toward creating a unified and dynamic whole, despite the gaps and variations distinguishing them from one another, strikes me as, well, poetic.” The layered perspectives, imaginations, sensibilities and vocabularies of the Gospels reveal a singular, universal truth, Smith said. “This may be the history of all religions, all the various vocabularies devised to transmit what is fundamentally beyond us,” she said. “And so the most fruitful attempts at bearing witness are necessarily expansive, drawing upon disparate and sometimes desperate resources.” Smith said she prefers to focus on accounts of Christianity that relate to “the experience of wonder rather than demystifying or domesticating its source.” “Like the language of spiritual awakening, poems seek to be living words — vehicles for transmitting a sense of the strange and the powerful from speaker to reader,” she said. “And like the parable, poems offer tools that foster an ongoing and repeatable state of wonder. They impart to the reader a new kind of awareness, a new kind of sensitivity. The language of poetry makes you more attentive of the world beyond you, even as it serves to enlarge your vocabulary for the world within you.” Though poetry and Christianity do not share the same terms, Smith said, the two share a commonality that allows exploration of the world and oneself. “Christianity doesn’t exist without devotion to Christ,” Smith said.  “Poetry’s devotions are many. But, if I back up far enough, I see that the two share a mode. I think the creative state which is beholden to something unseen lives both outside and within the self and is similar to the state of openness, humility, compassion and receptivity at the root of Christ’s message about the kingdom of God, which also lives both outside and within the self.” Reading and writing poetry requires an act of submission, Smith said, through which one becomes a beholden stranger and places personal knowledge aside to make room for new discoveries. Smith said the revelations of poetry and faith come from outside of logic. “As a writer and a spiritual being, I’m striving towards that which puts me in touch even only imaginatively with the largeness around and within,” Smith said. Smith said her work, “Life on Mars,” draws unconsciously, even involuntarily, upon her experiences with faith. Her 2012 Pulitzer Prize-awarded poetry collection started as a method of exploring her anxieties about the future of America through extrapolation. However, after the death of Smith’s father, she said the book became a way to wrestle with her grief and create a satisfying sense of where his spirit resided. Imagining the afterlife through the lens of outer space helped Smith come to terms with death and those in her life who had died. “Space became a really useful backdrop for [imaging my father’s place in the afterlife],” she said. “I grew up in the Church. I grew up with the image of God in the Sistine Chapel, and I didn’t want my father to be circumscribed on something that seemed that graspable. I wanted to find a way of making the God that I entrusted [my father] to as large as math, as large as the universe, and so the poems relentlessly led me in that direction.” Smith’s poem “It & Co.” portrayed a God that Smith said she believed was greater than the one she already knew. “The first draft of this poem was a second person address to the God on the ceiling [of the Sistine Chapel] … I felt almost blasphemous,” she said. “I felt almost worried that maybe I should hedge my bets and change my approach. And so the pronoun changed and became ‘it,’ and ‘it’ allowed me to create a vast, unhuman, unknowable version of God that oddly enough was more consoling.” The unknowable, unattainable version of God Smith portrays through her work reflects her thoughts on what poetry is, she said. Smith said she allows herself to pose questions that can remain unanswered throughout her work and said she encourages others to embrace this notion in their writing. “A poem is not a puzzle,” Smith said. “It’s not written by someone who has figured something out and then hidden it inside of fancy language. A poem is a root towards reckoning with and building from real, urgent material, questions or experiences. Even if it’s a poem about joy, it seems to gather something more from the recollection of it than is possible in the actual moment.” Though Smith believes poetry does not always need to answer its own questions, she said poetry can still be purposeful in enacting change. “I do [see poetry as activism] for a lot of reasons, partly because of overt subject matter which challenges something,” Smith said. “I also think that poetry is a form of resisting the degradation of English and thought and conversation and social interaction and curiosity. That feels like an activist mechanism to say that mindful language, thoughtfully wielded and carefully listened to and discussed can make things better, can make us realer to each other, can make our feelings realer to each other. It feels like a tool of activism.” Share This Story About Maria Leontaras Maria Leontaras is a senior at Saint Mary's pursuing a student-designed major in Interactive Journalism with minors in mathematics and Journalism, Ethics and Democracy. Maria used to serve as the Editor-in-Chief of The Observer when she wasn't busy tweeting about movies and One Direction. About Maeve Filbin Maeve is a senior studying political science and economics at Saint Mary's, as well as Journalism, Ethics and Democracy at Notre Dame. She serves as an Assistant Managing Editor of The Observer, and thinks everyone should support student journalism. Journalist Jelani Cobb explored America’s history of racism as well as its present existence Tuesday... Hide Sidebar Subscribe to Our Newsletters Submit a Question for \nThe Observer Sports Mailbag Advertisement Advertisement Advertisement Advertisement Advertisement Advertisement To uncover the truth and report it accurately. Site Links Donations Like what you see? Help support student-run publications. Social Phone: (574) 631-7471 / Fax: (574) 631-6927 / Address: The Observer / P.O. Box 779 / Notre Dame, IN 46556  Email: [email protected] ",
    "title": "Tracy K. Smith explores Christianity's connection to poetry // The Observer",
    "datetime": "2018-09-06T04:05:40+00:00",
    "url": "https://ndsmcobserver.com/2018/09/tracy-k-smith-explores-poetry/"
}