{
    "text": "The tragic suicide of SHINee member Kim Jong-hyun (known as Jonghyun) has left fans across the globe heartbroken, mourning the loss of such a young talent. His death will have many thinking about the notoriously competitive, brutal K-pop industry and wondering if it is a healthy development in Korean society. It also touches on the issue of possible correlation between a competitive culture and suicide, which obviously has implications for Hong Kong. Locally, the cutthroat competition for university placement and job interviews is embraced by students and graduates as a sure-fire way to climb the social ladder, be successful and gain happiness. The notion that standard of living hinges on the level of academic qualifications is so ingrained in the minds of locals that few question the validity of the argument that a university degree guarantees a decent income. Still, children have been taught since they were young that excelling academically is the path they should take to be successful. This mentality raises questions: who and what define success? Is success sustainable if it involves only wealth and fame? It’s obvious that the word “success” should take on a broader meaning than a narrow definition of earning a lot of money. Every year, society has churned out countless meek people who can score high marks on tests but have no idea how to communicate with people or lead a project. Admittedly, successful test-takers aren’t necessarily successful employees; successful employees aren’t equivalent to successful people; successful people may not lead fulfilling, contented lives. Few notice the above-mentioned cold, hard facts and find themselves stuck in the endless loop of pursuing unattainable goals, with many harming their health, sacrificing relationships or even taking their own lives in the process. At what cost should success be pursued? Yes, economic and societal development rely on a relentless work ethic on the part of citizens. Yet when suicide is seen by many as the only way out of the pressure they suffer, should society, parents and citizens collectively reflect on whether human lives are a cost too dear to pay for short-lived success? Jason Tang, Tin Shui Wai ",
    "title": "Tragedy shows dark side of competitive and brutal K-pop industry | South China Morning Post",
    "datetime": "2017-12-20T16:30:05+08:00",
    "url": "https://www.scmp.com/comment/letters/article/2125091/tragedy-shows-dark-side-competitive-and-brutal-k-pop-industry"
}