{
    "text": "ASTRO adds two new High Definition (HD) Korean channels - Oh!K HD (Astro Channel 394) and Channel M HD (Astro Channel 395) which are available for free preview from Feb 16 until Feb 28. Subsequently, Oh!K HD and Channel M HD will be part of Astro's new Korean Pack offering, priced at RM10 monthly. Agnes Rozario, Vice President, Content Management Group, Astro, said, \"Astro was the first in Malaysia to bring dedicated 24/7 Korean channels to fans via KBS World and ONE HD channels. Today, KBS World is accessible to all Astro customers and ONE HD is one of the most watched channels both on TV and Astro on the Go (AOTG). Channel M is one of the strongest Asian youth and music oriented channels in the region and has been at the forefront of spreading K-culture throughout the world. Oh!K HD offers the best and latest of MBC in Korea. With our total offering of Channel M HD, Oh!K HD, ONE HD and KBS World, Astro becomes the unrivalled destination for K-entertainment across drama, K-pop and Variety entertainment all in HD and available on the screen of your choice be it on TV or AOTG on PC, Tablet or smartphone.\" \"Oh!K HD and Channel M HD will also broadcast shows just hours after its first broadcast in Korea ensuring that Astro remains the easiest and fastest way for customers to watch their favourite Korean shows. Hence, we're confident that these new HD channels will be well received by our customers.\" Oh!K HD (Channel 394)brings premium drama series and variety shows and music programming by the Korean broadcaster MBC, with drama titles such as, Shine or Go Crazy, broadcasted Same Day as Korea; Rosy Lovers and Four Legendary Witches. Popular Variety and Music content shown on the channel include Infinite Challenge and I am a Singer (Season 3). Home to the popular MNet Asian Music Awards(MAMA), Channel M HD (Channel 395)offers comprehensive content from the latest 'Hallyu' trend, from K-Pop, variety, drama and lifestyle programmes. Channel M HD delivers the latest K-Pop content with the popular music chart programme, M!COUNTDOWN shown 24 hours after its Korean premiere. Other popular programmes include the drama Bad Guys; and variety programmes, Over Flower Series, Get It Beauty, Pony's Diary, and K Chef Battlefield 2. Subtitles in English, Bahasa Malaysia and Mandarin will be available for the programmes on both channels and selected programmes can be watched dubbed in Mandarin and Bahasa Malaysia. For the added convenience of customers of Korean Pack, they can enjoy viewing their favouOh!K HD and Channel M HD are also available on Astro on the Go giving our customers the ability to choose the screen of their choice be it on TV, online or on mobile. For more information, please visit www.astro.com.my/koreanpack 46050 Petaling Jaya, Selangor, Malaysia Tel: +603-7784 6688 Fax: +603-7785 2624 / +603-7785 2625 ",
    "title": "Two Korean-language channels launched on Astro",
    "url": "https://www.thesundaily.my/archive/1329508-ARarch295691"
}