{
    "text": "The proportion of Samsung Electronics’s China sales in its global total reached the highest point in 2018 since the Korean electronics giant began to release sales figures by regions. Samsung Electronics' 2018 sales in China amounted to 54.78 trillion won, 32.2 percent of the company’s global total, industry sources said on April 8. This was the highest percentage since 2012 when the company began disclosing regional sales. This is attributed to a sharp increase in demand for semiconductors sparked off by the rapid growth of IT manufacturing in China. For Korean chipmakers such as Samsung Electronics and SK Hynix, China account for the largest share of their sales, while their domestic sales hold only 5 percent or less of the total. However, Samsung Electronics’s semiconductor exports to China are likely to be hit hard by the U.S.-China trade war that broke out in 2018. In fact, while Samsung Electronics's semiconductor operating profit in the first quarter of 2019 is expected to stay at slightly over four trillion won, about half of that of the previous quarter, analysts say that a shrinkage in China’s demand may have greatly impacted the result. The point is how Samsung Electronics will break thorough this situation. If the US and China trade wars are prolonged, even if prices of semiconductors rebound, a slumping Chinese economy may hinder Samsung Electronics’s rebound in earnings. The Chinese government projected its economic growth rate for this year at 6.0 percent to 6.5 percent, lower than last year's economic growth rate of 6.6 percent. If China decides to increase imports of U.S.-made semiconductors as a negotiation card in the U.S.-China trade war, it will give additional damage to Samsung Electronics. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "U.S.-China Trade War May Hurt Samsung Electronics’ Performance in China - Businesskorea",
    "datetime": "2019-04-09T11:02:59+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=30717"
}