{
    "text": "The U.S. government has escalated its trade war with China by restricting exports of U.S. semiconductor production equipment to a Chinese state-backed chipmaker. According to wire reports, the U.S. Department of Commerce said on Oct. 30 that it had put Fujian Jinhua Integrated Circuit Co. (JHICC) on a list of entities that cannot purchase components, software and technology good from U.S. firms. The action was taken as the U.S. administration is concerned about the risks that the Chinese company could pose to U.S. security when it is allowed to import semiconductor equipment from U.S. firms. JHICC is one of the new Chinese chipmakers that have been preparing mass production of memory chips. If the company floods the market with cheap products, the Commerce Department’s logic goes, it could threaten the survival of U.S. chipmakers, which supply their products to the U.S. military. If U.S. chipmakers go out of business and cannot supply their products to the U.S. military, U.S. national security will be threatened. It is unclear how the U.S. government’s latest action will affect the Chinese chipmaker. Some Korean analysts say that JHICC will not be able to produce chips as planned if it cannot acquire U.S. equipment. The company was expected to start mass production next year. Reuters quoted Linley Gwennap, a chip expert and president of the Linley Group, as saying, “It’s pretty much impossible to build a leading-edge fab (semiconductor plant) without buying equipment from American companies.” Gwennap said suppliers such as Applied Materials Inc., Lam Research Corp. and KLA-Tencor Corp. were likely supplying equipment to Fujian Jinhua. Korean analysts say the U.S. action will benefit Korea’s two chipmakers, Samsung Electronics and SK Hynix. The stock price of Samsung Electronics gained 2.29% to close at 42,350 won on Oct. 30. SK Hynix also earned 2.10% to finish at 68,200 won. The U.S. move is certain to escalate the ongoing trade dispute between the two superpowers. Reuters reported that the action “is likely to ignite new tensions between Beijing and Washington since the JHICC is at the heart of the ‘Made in China 2025’ program to develop new high-technology industries.” According to the Reuters report, Micron, a U.S. memory chip producer with factories in Virginia and Utah, has accused JHICC and Taiwanese partner United Microelectronics Corp of stealing its chip designs in a lawsuit in California. In turn, the companies countersued Micron in China, where courts sided with them and banned some of Micron’s chips in China. “When a foreign company engages in activity contrary to our national security interests, we will take strong action to protect our national security,” Commerce Secretary Wilbur Ross said in a statement. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "U.S. Restricts Exports of Chip Production Equipment to Chinese Chipmaker Fujian Jinhua - Businesskorea",
    "datetime": "2018-10-30T17:34:00+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=26153"
}