{
    "text": "Aug. 6, the anniversary of the U.S. bombing of Hiroshima during World War II, is a date that has been ingrained in the consciousness of artist elin o’Hara slavick for as long as she can remember. The daughter of activist parents, she vividly remembers attending the annual Hiroshima Day in Monument Square in her hometown of Portland, Maine, in the 1970s, listening to her parents’ oratory. It wasn’t until 2008 that she finally had a chance to visit the Japanese city with her family when her epidemiologist husband received a fellowship to study there. Once there, she embarked on a project to document what remains of Hiroshima and what disappeared that fateful day in 1945. The results are presented in the book “After Hiroshima” (Daylight Books). “I wanted to show people what was lost,” said the art professor at the University of North Carolina, Chapel Hill, aware that her unusual method of using actual artifacts that survived the blast could cause ethical concerns. CRITICS’ PICKS: What to watch, where to go, what to eat Contrasting graphic images commonly associated with the bombing, her 56 photographic works aim to show remnants in a poetic form to think about Hiroshima in a new way. She focused on objects such as a lone blue bottle, a hair comb or the countertop from one of the few remaining buildings that withstood the blast. The images include a series of photographs, cyanotypes and rubbings of bombed objects and surfaces. For the series of cyanotypes, slavick borrowed artifacts from the Hiroshima Peace Museum’s 90,000-piece collection donated by families of survivors. Objects were placed on sunprint paper, exposed to the sun, then rinsed with water. Exposure is a key element in her process whether it’s exposure to radiation, sun or light. The result is a white object surrounded by a cool bluish background emanating a celestial, shadowy effect. ART: Can you guess the high price? “It’s not the thing itself, it’s also the shadow,” she noted. “When the bomb exploded it basically incinerated people, plants, bridges, everything, leaving either black or white ‘death’ shadows.” The rubbings of the floors, countertops and a bank vault door were taken from the former Imperial Bank, which was close to the hypocenter of the bomb. It remained in business until 1992, when it was converted into a cultural center where the artist held her first show of Hiroshima images in 2011. It was important for slavick to place the paper directly on the A-bomb surfaces such as the parquet floor in the bank or leaves gathered from one of the 60 trees that survived the bombing, to connect to the process tangibly. FULL COVERAGE: 2013 Spring arts preview She’d rub a black wax crayon on the paper over the object to create a negative imprint, which was then made into a silver gelatin contact print. The results resemble X-rays, internally illuminated. “It’s more symbolic and conceptual,” slavick noted. “A way to think about this lingering trauma and the effects of radiation.” Exposure is the thread running through her work, from the sun, light, radiation or history. The political artist struggles with the ethics of creating art that is aesthetically beautiful from such a horrific event. Through art she feels she can reach people in a different way. “I do think beauty can be radical and subversive,” said slavick, who dealt with the same dilemma with her first book, “Bomb After Bomb: A Violent Cartography.” “In the essay for ‘After Hiroshima,’ my former professor, James Elkins writes that he doesn’t know if my project is ethically sufficient but it’s ethically necessary.” An exhibition of slavick’s Hiroshima art will be on view at the Stephen Cohen gallery in Los Angeles from Sept. 19 to Nov. 2. calendar@latimes.com ----------------------- Hiroshima anniversary events Remembering Sadoko, Hiroshima girl of “Thousand Paper Cranes” story Through Tuesday, Japanese American Cultural & Community Center, Little Tokyo. Jackson Browne concert 8 p.m. Tuesday Aratani Theatre, Japanese American Cultural & Community Center, Little Tokyo https://www.jaccc.org/sadako.php Candlelight vigil in Santa Monica 6 to 8 p.m. Tuesday Santa Monica Civic Center, at the 26-foot-tall nuclear mushroom cloud “Chain Reaction” peace sculpture, 1800 block of Main Street just north of Pico Boulevard https://www.psr.org/news-events/events/hiroshima-remembrance.html It's a date Get our L.A. Goes Out newsletter, with the week's best events, to help you explore and experience our city. You may occasionally receive promotional content from the Los Angeles Times. Television Oct. 25, 2023 Image Oct. 25, 2023 Music Oct. 25, 2023 Music Oct. 25, 2023 Entertainment & Arts Oct. 25, 2023 Company Town Oct. 25, 2023 Television Oct. 25, 2023 Movies Oct. 25, 2023 Music Oct. 25, 2023 Subscribe for unlimited accessSite Map Follow Us MORE FROM THE L.A. TIMES ",
    "title": "U.S. bombing seen through artist's eye in 'After Hiroshima' book - Los Angeles Times",
    "datetime": "2013-08-03T16:00:00",
    "url": "https://www.latimes.com/entertainment/arts/culture/la-et-cm-hiroshima-art-elin-ohara-story.html"
}