{
    "text": "Eyder Peralta Occupy protesters get sprayed at University of California, Davis, on Nov. 18, 2011.\n                \n\n                    YouTube\n                    \n\nhide caption Occupy protesters get sprayed at University of California, Davis, on Nov. 18, 2011. The former University of California police officer, who gained international notoriety for pepper spraying student protesters almost two years ago, is back in the news: Today, the university said it would pay John Pike $38,059 in workers' compensation. Pike claimed that the death threats that followed the incident caused him depression and anxiety. The Davis Enterprise reports that an independent psychiatrist said he had a \"moderate\" disability. The Enterprise adds: \"Administrative Law Judge Harter approved the settlement agreement between Pike and the University of California on Oct. 16. 'This case has been resolved in accordance with state law and processes on workers' compensation,' UC Davis spokesman Andy Fell said in an email message. Sacramento attorney Jason Marcus, who represented Pike, declined to comment on Wednesday. \"Bernie Goldsmith, a Davis lawyer supportive of the protesters, said that the settlement 'sends a clear message to the next officer nervously facing off with a group of passive, unarmed students: Go on ahead. Brutalize them. Trample their rights. You will be well taken care of.'\" If you don't remember, video of the incident went viral back in November 2011. It came at the height of the Occupy Wall Street movement and it shows Pike methodically dousing peaceful protesters with pepper spray. Pike eventually left the university and never faced criminal charges. The university agreed to pay $1 million to settle a lawsuit filed by the protesters. Doing the math, The Atlantic notes that Pike will get a little more than each of the 21 protesters got in their settlement. Sponsor Message Become an NPR sponsor ",
    "title": "UC Davis' 'Pepper Spray Cop' Wins $38K In Workers' Comp  : The Two-Way : NPR",
    "url": "https://www.npr.org/sections/thetwo-way/2013/10/23/240343882/uc-davis-pepper-spray-cop-wins-38k-in-workers-comp"
}