{
    "text": "A pharmaceutical mogul who traveled the world collecting objects made by native artists and left them to a trust in London probably never would have guessed that 30,000 of those works would end up at UCLA’s Fowler Museum. Now, with the museum turning 50 with a celebratory splash of exhibitions, one might ask: What would Sir Henry Wellcome think? The mega collector — who was born in a Wisconsin log cabin in 1853 and died a titled Englishman in 1936 — would probably be surprised that the African and Pacific core of the Los Angeles museum’s 120,000-piece holding of world arts consists of works he selected. But he would surely see reflections of his intellectual spirit, in which art and life are part of the same fabric. “We like to say that we have invented a unique niche for ourselves, somewhere between being an art museum and an ethnography or anthropology museum,” Fowler director Marla C. Berns says. “We are an art museum, but a very particular kind, with the important goal of exploring why people make art. What are the contexts? What are the meanings?” PHOTOS: Arts and culture in pictures by The Times The Fowler’s mix of collections, exhibitions and other programs is unlike anything else in Southern California, if not the nation. The museum’s long-term exhibition, “Intersections: World Arts, Local Lives,” offers about 250 of its finest objects from Africa, Asia, the Pacific and the Americas with explanations of how people use them. On any given day, visitors might also see a deeply researched, historical presentation of art from Central Nigeria; an up-to-the-minute confrontation of safe-sex issues, in the form of couture dresses made of condoms by Brazilian artist Adriana Bertini; a collection of hand-painted shop signs from Cambodia; or a broad survey of the art of tea. “The great thing about the Fowler is that we can pretty much do what we want,” Berns says. But not without a lot of thought. “One thing I have always appreciated about the Fowler,” says Thomas K. Seligman, an African art specialist and retired director of the Cantor Center for Visual Arts at Stanford University, “is that they always approach a subject academically but also programmatically for the community and the schools. You have an exhibition geared for the public, but not simplistic or trivial, while at the same time you have a very scholarly catalog.” “Fowler at Fifty” might have been an occasion to recap greatest hits, including the 1993 blockbuster, “Royal Tombs of Sipan,” featuring ancient gold and silver jewelry from Peru, and a spectacular 2010 presentation of Nick Cave’s dance costumes. CHEATSHEET: Fall arts preview 2013 Instead, visitors will find eight mini-shows, each dedicated to a particular strength of the museum’s collection and approached in a different way. Part of the point, Berns says, is to show that collections are always open to new interpretations. Many of the 1,000 featured objects, including feathered cloaks made by Maori peoples of New Zealand and collected by Wellcome, will come out of storage for the first time. Others, such as items selected by artist Amalia Mesa-Bains, will appear in a surprising setting. Her installation, “New World Wunderkammer,” will consist of three “cabinets of curiosity” representing Africa, the indigenous Americas and a mix of New World cultures. A show of Yoruba artworks depicting twins will include an installation by artist Simone Leigh using hundreds of West African plastic dolls. Ancient Peruvian textiles will be seen in terms of their influence on contemporary weaving. Additional shows will highlight the art of New Guinea’s Sepik River region, Zulu adornment and ancient Mexican ceramics. It’s impossible to say what Wellcome would make of all this, but he would probably appreciate the breadth of material and inquiry. Wellcome fell under the spell of Native American lore and the wonders of his uncle’s drugstore during his youth in America. He moved to England in 1880 and made a fortune with Burroughs Wellcome & Co., a pharmaceutical firm, while amassing 1.5 million books and objects related to the history of medicine and worldwide cultures. Although Wellcome did much of the buying himself, he set up a network of scouts and agents to find desirable objects — and hold prices down by hiding his identity. He never realized his dream of displaying his collection in a gigantic Museum of Man. Part of his legacy is preserved at the Wellcome Collection, a museum in London that explores connections between medicine, life and art. But many thousands of his treasures have been dispersed. Los Angeles’ windfall is credited to Franklin D. Murphy, chancellor of UCLA from 1960 to 1968 and chairman and chief executive of Times Mirror Co., the former parent company of the Los Angeles Times, from 1968 to 1980. Murphy, who got acquainted with Wellcome trustees before taking charge of UCLA, established the first version of the Fowler — the Laboratory of Ethnic Arts and Technology — in 1963 and secured the Wellcome donation in 1965. The bonanza of South Pacific sculptures, Benin bronzes, Congo ivories, pre-Columbian ceramics and stone carvings, Peruvian textiles and gold from South and Central America provided a rich resource for exhibitions at the university’s Haines Hall and Wight Art Gallery as the laboratory evolved into the Museum of Cultural History. In 1992, it finally got its own building and yet another name, in honor of collector and inventor Francis E. Fowler, who donated a collection of silver to the museum along with financial support. The museum has received many other collections, including African and Indonesian art from Jerome Lionel Joss, Mexican textiles and folk art from Donald and Dorothy Cordry, pre-Columbian Peruvian ceramics from Herbert L. and Ann Lucas, and African musical instruments from Robert and Helen Kuhn. The UCLA institution is in league with other university museums across the country, including Yale University Art Museum and anthropology museums at the University of Pennsylvania, UC Berkeley and Harvard University. But their collections differ in breadth, depth and countries represented, and the Fowler has developed a distinctive program with long tentacles. “Central Nigeria Unmasked: Arts of the Benue River Valley,” an exhibition organized with the Musée du Quai Branly in Paris, opened in Los Angeles in 2011 and traveled to Stanford and the Smithsonian’s National Museum of African Art in Washington, D.C., before closing in France. The Fowler has obviously grown and expanded its reach over the last half-century. (To prepare for its birthday exhibitions and programs, it will be closed from Oct. 2 through 12.) But its mission and values haven’t changed, Berns says. “When this museum was founded, it was called a laboratory. I would say that we are still a laboratory. The idea that this is a place to test and experiment and look at new approaches is as true today as it was then.” calendar@latimes.com  It's a date Get our L.A. Goes Out newsletter, with the week's best events, to help you explore and experience our city. You may occasionally receive promotional content from the Los Angeles Times. Television Oct. 25, 2023 Image Oct. 25, 2023 Music Oct. 25, 2023 Music Oct. 25, 2023 Entertainment & Arts Oct. 25, 2023 Company Town Oct. 25, 2023 Television Oct. 25, 2023 Movies Oct. 25, 2023 Music Oct. 25, 2023 Subscribe for unlimited accessSite Map Follow Us MORE FROM THE L.A. TIMES ",
    "title": "UCLA's Fowler Museum turns 50 in worldly fashion - Los Angeles Times",
    "datetime": "2013-09-28T15:00:00",
    "url": "https://www.latimes.com/entertainment/arts/culture/la-et-cm-ucla-fowler-museum-50-20130929-story.html"
}