{
    "text": "World KUALA LUMPUR — Local fans of Korean pop culture, or K-pop, have expressed their willingness to travel to other countries if the strict ruling by Malaysian Islamic Development Department (Jakim) will deter their favourite bands from performing in Malaysia. Concerts and stage shows in Malaysia have come under scrutiny recently after a three-minute online video showed tudung-clad Muslim fans being hugged and kissed by K-pop artistes B14A at a mini-concert at the Life Centre in Jalan Sultan Ismail, Kuala Lumpur. Photo: Screengrab from YouTube KUALA LUMPUR — Local fans of Korean pop culture, or K-pop, have expressed their willingness to travel to other countries if the strict ruling by Malaysian Islamic Development Department (Jakim) will deter their favourite bands from performing in Malaysia. Venus, an administrator for a local online K-pop fan club, said many fans were unhappy with Jakim's knee-jerk reaction which came months after the controversy involving tudung-clad Malay girls being hugged and kissed by members of a Korean pop band at a concert in January. She said the authorities appeared to be targeting the K-pop fans but somehow overlooked the local entertainment scenes, which also contained many inappropriate acts when interacting with their fans. “A lot of the K-pop fans will not hesitate to go overseas to watch their idols’ perform if the artistes do not want to come here due to the strict ruling by the authorities,” she said. The diehard fans, she added, are willing to put in extra hours at work just to collect enough money and get the chance to watch their favourite artistes perform up close. Venus was responding to the latest guidelines posted by Jakim last week for artistes and entertainers looking to perform in the country, which imposed strict limitations on personality, dressing, behaviour and performances. The guidelines also imposed gender segregation for the audiences at concerts and shows, and clamped down on music and lyrics that contained elements of “worship”. She said there was no reason for the authorities to react in such a way because some of the guidelines had already been adhered to by concert organisers and entertainment companies when they bring artistes into the country. “They take their own initiatives and look into the religious sensitivities in Malaysia.” she said. She cited the concert by Taeyang from Big Bang, where he took it upon himself to wear gloves to shaking hand with local female fans and GOT7's performances at KL Live, where fans were required to sign an undertaking letter to avoid any untoward incident. Venus added that guidelines such as gender segregation would also be hard to implement and a logistical nightmare. She questioned if such a move would really solve social problems. “How sure are they that by segregating, problems like before can be avoided?\" she said, referring to the hugging incident. A diehard K-Pop fan, Mia said Jakim's guidelines which were based on arising issues only gave the wrong perception on Islam. “I don’t have any problems with the guidelines, but it has to be implemented slowly. We also have a lot of non-Muslims here in Malaysia, and they don’t mind if the artistes wear sexy attires. \"To implement something, it has to be fair,” the 24-year-old said, adding that personally she didn’t mind the gender segregation rule as it would make her more comfortable when attending concerts. “We do not want outsiders to view the implementation wrongly, as they (the authority) only do something when an issue arises. If there is no issue, nothing is being done.” she said. Another fan, who wanted to be known as Raihanna Aleesya, said she had no qualms with the guidelines but felt the authorities should also take into consideration the non-Muslims attending the same concerts. \"As guidelines, it is good. But separating men and women, I think we have to look at it from another angle... This is because we are living in a multi-racial and multi-religious country. We need to respect other races and also followers of other beliefs,\" she added. Jakim yesterday (April 21) explained that the guidelines released recently were only an update to the existing ones and did not contain any enforcement element. Its director-general Othman Mustapha reportedly said that the objective was to educate the entertainment industry and that the guidelines were not a law. Professionals in the music industry however were unsure if the guidelines would be well-received, especially from non-Muslims fans. Mr Muzzafar Salleh, producer at music label Erama Creative, said: “It is probably true that the majority of the Malay fans will agree with such ruling (gender segregation). But, what about the Chinese and Indian fans?” He said that as an entertainment company, they had no problems with the guidelines and would adhere accordingly once implemented. Like the fans, Mr Muzaffar also wondered about the authorities' knee-jerk reaction to the matter which came as a result of arising problems. “Honestly, it will not have too big of an effect in terms of the arrival of foreign artistes into Malaysia. They can understand and will adhere to the rules imposed in the country.” “Question is, why now. It is like the ruling is being imposed due to certain issues,” he said. Meanwhile, Recording Industry Association of Malaysia (RIM) president Norman Abdul Halim said RIM would only announced its stand on the matter after a meeting this Friday. “We are also studying the addition to the guidelines and will see if there will be any overlapping with other existing regulations, laws, and conducts,” he said. THE MALAYSIAN INSIDER Read more of the latest in Subscribe to get daily news updates, insights and must reads delivered straight to your inbox. By clicking subscribe, I agree for my personal data to be used to send me TODAY newsletters, promotional offers and for research and analysis. Copyright 2023 © Mediacorp Pte Ltd. All rights reserved. We know it's a hassle to switch browsers but we want your experience with TODAY to be fast, secure and the best it can possibly be. To continue, upgrade to a supported browser or, for the finest experience, download the mobile app. Upgraded but still having issues? Contact us ",
    "title": "Unhappy with strict guidelines, Malaysia’s K-pop fans consider going overseas for gigs - TODAY",
    "url": "https://www.todayonline.com/world/asia/unhappy-strict-guidelines-malaysias-k-pop-fans-consider-going-overseas-gigs"
}