{
    "text": "The idea of a headphone opera was hatched over drinks at a downtown Mexican bar. The production design was partly inspired by flash mobs and silent disco. And the setting won’t be a proscenium theater, but the majestically melancholy Union Station train terminal in downtown Los Angeles. These are someways in which Saturday night’s world premiere performance of “Invisible Cities” won’t be a conventional night at the opera, and why the audience it attracts likely won’t be conventional either. CHEAT SHEET: Fall arts preview Written by New York composer Christopher Cerrone, with a text adapted from Italo Calvino’s shimmering, philosophical novel of the same name, “Invisible Cities” is being presented by the Industry, the aesthetically renegade L.A.-based opera company led by Yuval Sharon, and L.A. Dance Project, the artist collective co-founded by choreographer-dancer Benjamin Millepied. For the site-specific production, the roughly 200 audience members will wear wireless headphones. The eight singers’ voices and the 11 musicians’ instruments will be beamed directly to listeners, as if whispering in their ears. Meanwhile, the performers, including eight dancers, gradually will reveal themselves to the audience as the 70-minute, intermission-less work progresses “It will be up to the audience to decide how they see it, if they go into certain rooms, or if they decide to just stay in one place and let the opera pass them by,” says Sharon, 34. PHOTOS: Arts and culture in pictures by The Times Since it was founded three years ago, the Industry has been attracting a young, diverse constituency whose members may be more accustomed to attending Burning Man and EDM raves than an umpteenth staging of “Madame Butterfly.” Chad Smith, vice president of artistic planning for the Los Angeles Philharmonic, says that the Industry has added an important new dimension to the region’s operatic ecosystem. “Yuval is doing something that the L.A. Phil and L.A. Opera can’t do,” Smith says. “He is staging this work in such a unique way for a very limited audience that becomes experiential because it’s happening outside of a traditional opera company or a traditional orchestra, and outside of a traditional venue.” The Industry’s signature approach combines 21st century technology, multi-disciplinary postmodern staging, site-specific production design and eclectic, avant-garde scores. RELATED: A tour of L.A. boulevards Its 2012 coming-out production, staged in an Atwater Crossing warehouse, was “Crescent City,” the voodoo-haunted “hyper-opera” by composer Anne LeBaron and Douglas Kearneythat included giant video screens transmitting live imagery of the action from hand-held cameras. Last spring, at the Hammer Museum, the Industry unveiled six operatic works-in-progress for its inaugural First Take series, a West Coast version of the VOX series that Sharon ran for New York City Opera before he moved to Los Angeles. The “Invisible Cities” production team, most in their late 20s or early 30s, know that the opera has a technological gee-whiz factor that makes it a lure for the city’s young, creative classes. “It’s going to be a collection that starts with people that have never seen an opera show in their lives, together with people that are ongoing opera fans,” says Danielle Agami, the production’s choreographer. PHOTOS: LA Opera through the years But the collaborators emphasize that their aim isn’t simply to dangle hipster-bait for denizens of downtown and Echo Park. “Opera has always been a wonderful opportunity to work with technology because it provides a dramatic rationale to do so,” Cerrone says. “So we’re not adding headphones because it’s cool, although it is, but because we’re trying to find a new way into experiencing a dramatic work.” “Invisible Cities” came about organically through an old-fashioned, decidedly low-tech ritual: an after-work chat in 2011 at La Cita bar, the Hill Street watering hole, between Sharon and E. Martin Gimenez, the Industry’s chief sound designer, following an L.A. Opera production of “The Turn of the Screw.” Gimenez proposed the idea of doing a headphone opera, a concept that originated with silent discos, in which dancers wear headphones that allow them to hear DJs spinning records in an otherwise audio-free dance hall. The technology already had been co-opted by theatrical groups such as London’s Punchdrunk, which used it for an adaptation of “Macbeth.” Gimenez suggested using it for a site-specific opera production at an art-friendly location such as the Getty Villa or LACMA. But Sharon proposed Union Station. That left one question: which opera? Sharon had known about “Invisible Cities” since Cerrone submitted an early version of it to the VOX series in 2009 . Like Calvino’s book, Cerrone’s opera posits an imaginary conversation between Kublai Khan and Marco Polo, in which the Venetian explorer mentally conjures the great cities of the aging Khan’s empire. Lyrical and intensely inward-looking, the book slowly pulls the reader into its ruminative head space. “I know it sounds like some sort of sound bite, but I literally read the first page, thought it was gorgeous, and started playing the first notes of the overture,” Cerrone says. Sharon, however, was skeptical. “My first thought was, This is never going to work as an opera,because it’s so perfect as a book, and it’s a literary experience.” Yet, as soon as Sharon began studying Cerrone’s piece, with its non-linear narrative structure and falling-note harmonics that seemed to decay in mid-air, he realized that the composer had succeeded in capturing the introspective, otherworldly atmosphere of Calvino’s story. In June 2012, he sent Cerrone a Facebook message proposing “Invisible Cities” as The Industry’s follow-up to “Crescent City.” Sharon and Cerrone believe that Union Station, as an architectural nexus of Jazz Age optimism and high-speed-rail futurism, and with its constant ebb and flow of transient humanity, is the ideal location for an opera about real and imaginary destinations. “What I’m actually hoping,” says Cerrone with a laugh, “is that the weirdness of the audience will counter-act the weirdness” of the performers. reed.johnson@latimes.com ----------------------------- ‘Invisible Cities’ Where: Union Station, downtown L.A. When: 7 p.m. Saturday; 7:30 and 10 p.m. Oct. 24, 26, 29, 31, Nov. 5, 8. Cost: $45-$75; $25 only for 10 p.m. Oct. 29 and Nov. 5. Info: https://invisiblecitiesopera.com/tickets/ It's a date Get our L.A. Goes Out newsletter, with the week's best events, to help you explore and experience our city. You may occasionally receive promotional content from the Los Angeles Times. Follow Us Reed Johnson es editor de Los Angeles Times en Español. En 2018, se reincorporó a Los Angeles Times como editor asistente. Johnson había trabajado anteriormente para The Times como escritor de 2000 a 2014, incluidos cuatro años y medio como escritor de cultura latinoamericana del periódico, con sede en la Ciudad de México. También ha trabajado como reportero para el Wall Street Journal, con sede en São Paulo, Brasil; como editor de Zócalo Public Square; y como reportero del Detroit News, el L.A. Daily News y el Times-Union de Rochester, Nueva York. Television Oct. 25, 2023 Image Oct. 25, 2023 Music Oct. 25, 2023 Music Oct. 25, 2023 Entertainment & Arts Oct. 25, 2023 Company Town Oct. 25, 2023 Television Oct. 25, 2023 Movies Oct. 25, 2023 Music Oct. 25, 2023 Subscribe for unlimited accessSite Map Follow Us MORE FROM THE L.A. TIMES ",
    "title": "Union Station the platform for the opera 'Invisible Cities' - Los Angeles Times",
    "datetime": "2013-10-19T13:00:00",
    "url": "https://www.latimes.com/entertainment/arts/culture/la-et-cm-invisible-cities-union-station-story.html"
}