{
    "text": "Amid a boycott of Japan-made goods and services triggered by Japan’s exclusion of South Korea from its whitelist of trusted trade partners, the number of customers paying with credit and debit cards at Uniqlo, one of the most popular Japanese retailers in South Korea, halved in July. The number of customers who made a purchase with a credit or debit card at major Japanese fashion and accessory brands’ offline and online stores in South Korea declined by up to 50 percent in July compared to a year ago, according to data on personal credit and debit card payments from one of South Korea’s biggest card issuers. Uniqlo, one of Japan`s successful SPA brands, showed the largest drop. The number of customers paying with a credit card from July 1 to 31 dropped by 50 percent compared to the same period last year. It fell by 46 percent from June right before South Korea began a boycott of Japanese products and services. Uniqlo launched a huge summer sale in July. It has become the main target of the boycott because of an executive's remark that South Korean consumer movement \"would not last for long.\" The brand issued apologies twice but failed to placate the public. Muji, a Japanese lifestyle brand, also saw the number of its customers making a purchase with credit and debit cards in July plunge by 37 percent from a year earlier and 41 percent from the previous month. The figure of Descente, a Japanese sports clothing and accessories brand, fell by 30 percent from the same period last year and 26 percent from a month ago. In addition, the number of customers paying with credit and debit cards at ABCMart, Japan’s largest shoes chain store, dropped by 16 percent in July from a year earlier and 6 percent from the previous month.\n\r\nThis is in stark contrast to a significant growth in the past, though it was the data on card payment for a month. The number of customers who made a purchase with credit and debit cards at Muji and Uniqlo grew by 15 percent and 3 percent, respectively, in June from the same month last year. However, the figure hasslumped after the boycott of Japanese products spread across Korea in July. FRL Korea, the South Korean subsidiary of Uniqlo, posted 1.37 trillion won (US$1.14 billion) in sales and 234.40 billion won (US$193.88 million) in operating profit based on the data of fiscal year 2019. Its sales surpassed 1 trillion won (US$827.13 million) for four years in a row. Never miss another article! Enter your email address below to receive our free daily newsletter: ",
    "title": "Uniqlo Suffers 50% Plunge in Credit Card Payment in Korea in July - Businesskorea",
    "datetime": "2019-08-09T09:02:29+09:00",
    "url": "https://www.businesskorea.co.kr/news/articleView.html?idxno=34771"
}