{
    "text": "  Netmarble's latest collaboration with Big Hit Entertainment, BTS Universe Story. [NETMARBLE] Boy band BTS Netmarble’s latest mobile game BTS Universe Story. [NETMARBLE] Local game company Smilegate's IP of first-person shooter (FPS) game CrossFire made into a drama with the same title in China. [SMILEGATE] The Witcher game, left, and a Netflix remake, right. [SCREEN CAPTURE, NETFLIX] BTS joined forces with first-person shooter game Fortnite, developed by U.S. publisher Epic Games, to reveal a new version of its music video for the latest single ’Dynamite“ on Sept. 26. [BIG HIT ENTERTAINMENT] Girl group Blackpink also collaborated with the mobile version of local shooter game PlayerUnknown’s Battlegrounds, by playing the band’s track ’How You Like That“ (2020) as the background music for players waiting at the ’lobby“ at the beginning of the game. [YG ENTERTAINMENT] Solo artist Baek A-yeon to release first digital single in over two years Le Sserafim's Kim Chae-won returns to group activities after flu recovery Former (G) I-DLE member Soojin makes solo debut with dance performance Singer Chungha named Wemade and Wemix's promotional model Fans already suspected G-Dragon's illegal drug use A lot rides on success of Netmarble's Cross Worlds In the new BTS game, power comes at a price Blackpink to drop music video for song for band's video game BTS Universe Story Netmarble’s Marvel Future Revolution to be released in second half To write comments, please log in to one of the accounts. Standards Board Policy  (0/250자) Korea JoongAng Daily Sitemap All materials contained on this site are protected by Korean copyright law and may not be reproduced, distributed, transmitted,                    displayed, published or broadcast without the prior consent of Joins.com | Tel: 1577-0510 JoongAng Daily Co., Ltd. | Address: 48-6 Sangamsan-ro, Mapo-gu, Seoul, Republic of Korea Business registration number: 160-86-00572 | CEO: Park Chang-hee, Cheong Chul-gun Mail order business report number: 2020-Seoul Mapo-3838 ",
    "title": "Universes collide when IP is expanded across sectors",
    "datetime": "2020-10-06T17:09:42+0900",
    "url": "https://koreajoongangdaily.joins.com/2020/10/06/entertainment/kpop/game-entertainment-IP/20201006171000462.html"
}