{
    "text": "From 'Harry Potter' to 'Moana,' here's how the late author's fantasy series influenced your favorite art Christian Holub is a writer covering comics and other geeky pop culture. He's still mad about 'Firefly' getting canceled. Unlike some famous authors, the late Ursula K. Le Guin has not given her name to a descriptive adjective. We do not talk about “Le Guin-esque” works the way we might call something Dickensian, but all the same, she has had a remarkable influence on literature and pop culture. Because Le Guin wrote so many different kinds of books, her influence has been diverse. But it is her fantasy series in particular, the cycle of books set across the island-filled world of Earthsea, that have had the most noticeable impact on some of the biggest pop culture phenomena of the last few decades. Harry Potter and Hogwarts, for instance, are nearly unimaginable without the wizard school of Roke, where Le Guin first sent young Ged Sparrowhawk in 1968’s A Wizard of Earthsea. Like the Boy Who Lived, Ged has been singled out for a great destiny as a young boy (the very first paragraph of the book notes that he will grow up to be “both dragonlord and Archmage”), but before reaching that point, he has a lot to learn: Not only what words to say with which spell, but how to regard and use power, how to help the oppressed, and how to connect with friends. They are each tied to their magical enemies; Harry is forever connected to the dark lord who tried to kill him as a child, just as Ged is haunted by the shadow he released into the world as an arrogant adolescent. The two wizardly protagonists even possess a physical resemblance, in that they both bear significant scars on their face from those aforementioned enemies. “I didn’t feel she ripped me off, as some people did,” Le Guin said of Harry Potter author J.K. Rowling in a 2005 interview, “though she could have been more gracious about her predecessors. My incredulity was at the critics who found the first book wonderfully original. She has many virtues, but originality isn’t one of them. That hurt.” Someone who was slightly more open about Le Guin’s influence on their fantasy work was Christopher Paolini, who published the popular young-adult fantasy novel Eragon in 2003. Paolini borrowed heavily from Earthsea while constructing his world of Alagaesia. The magic used by his Dragon Riders works almost identically to that wielded by the wizards of Earthsea: Both rely on knowing the “true names” of objects and people in order to exert mystical power over them, and over-exerting one’s magic can often take a physical toll. Perhaps most importantly of all, both Earthsea and Eragon were adapted into terrible films. Speaking of the awful Earthsea adaptation, there is actually one major element of the series that both Rowling and Paolini eschewed, and showed Le Guin to be far ahead of her time. Very few characters in Earthsea have white skin. Ged has red-brown skin, as does his royal young friend Prince Arren and most of their other associates. The priestess Tenar (in some ways the real protagonist of the Earthsea books) has white skin, but only because she hails from the faraway Kargish lands, full of barbarians and people ignorant of magic. As Le Guin wrote in 2004 responding to the adaptation’s whitewashing, “I didn’t see why everybody in science fiction had to be a honky named Bob or Joe or Bill. I didn’t see why everybody in heroic fantasy had to be white (and why all the leading women had ‘violet eyes’). It didn’t even make sense. Whites are a minority on Earth now — why wouldn’t they still be either a minority, or just swallowed up in the larger colored gene pool, in the future?” Modern advocates of diverse representation in pop culture, constantly finding themselves explaining why it’s weird for (to name one example) an Eastern wizard called the Ancient One to be played by a white woman, are probably used to asking these same questions, even years later. Thankfully, some in the entertainment industry are finally starting to produce big-name stories with diverse characters. Disney’s Moana is a shining example of this. Every human character in the film is Polynesian, including the god Maui (Dwayne Johnson). Even better, little is made of Moana’s gender; her father expects her to inherit his tribal leadership just the same as if she’d been born a boy. Sailing from island to island in a small boat across a world covered mostly in water, Moana and Maui greatly resemble Ged and Arren in The Farthest Shore, when they set off sailing in the old wizard’s faithful boat Lookfar. Both these pairs, each consisting of an elder sorcerer and a younger ruler-to-be, are sailing to find out what’s making their world sick (and both find out that it ultimately has something to do with an unresolved issue in the sorcerer’s past). But Moana doesn’t just share surface-level similarities with the Earthsea Cycle. Both works also emphasize the importance of knowing oneself and discovering your true name. At the beginning of the film, Moana’s people are constrained to a single island, but her soul yearns to sail the sea, and she pursues her true nature on a quest of self-realization that eventually brings others along with her. Like Ged, Moana’s great triumph comes when she becomes so self-aware that she’s also able to see the true nature of her opponent, and so resolve the conflict plaguing her world. Though Le Guin often railed against the problem of “endemic trilogitis” in fantasy, her first three Earthsea books (A Wizard of Earthsea, The Tombs of Atuan, and The Farthest Shore) were published within a few years of each other, making it seem like she had contributed her own fantasy trilogy to the tradition. Le Guin finally returned with a fourth installment, Tehanu, nearly 20 years after The Farthest Shore. Though the novel won awards, it also alienated some longtime fans for its radical departure from the tropes of the earlier books. Here, Ged and Tenar are older; their shining youthful power has been drained away, leaving them better-suited to care for an abused young girl than take off on heroic quests across the seas. In a fit of despair, Ged tells Tenar that losing his magic felt “like pouring out a little water, a cup of water onto the sand. In the Dry Land. I had to do that. But now I have nothing to drink. And what difference, what difference did it make, does it make, one cup of water in all the desert? Is the desert gone?” Reading it now, that monologue strikes one as eerily similar to the old, cranky Luke Skywalker we meet in self-imposed exile in Star Wars: The Last Jedi. Like Ged, Luke worries that all his years of struggle and sacrifice ultimately failed to make the world better (and he frets about these worries on a rocky island one could easily imagine finding in the Earthsea Archipelago). Luke destroyed the Death Star, redeemed Darth Vader, and overthrew the Emperor, but in his failure to keep young Ben Solo on the path of light, didn’t he end up just reproducing the very evil he fought against for so long? Similarly, Ged wonders whether his various battles against evil actually helped Earthsea at all. Both of these stories are startling; watching characters we first met as swaggering heroes confront obsolescence and futility is meant to be an unsettling experience. But some fans have taken issue with them for other reasons — namely, their centering of female characters. As Ged and Luke mourn their failures, the women around them (Rey, Leia, Tenar) take their place at the frontlines of the struggle against evil. These storytelling decisions so enraged some fans that they made a custom edit of The Last Jedi with all the women removed — which dropped the runtime down to a measly 46 minutes. As always, Le Guin was ahead of her time. Writing about Tehanu years after its release, she noted, “Some readers who identified with Ged as a male power figure thought I’d betrayed and degraded him in some sort of feminist spasm of revenge. So far as I know, I had no spasms and didn’t betray Ged. Quite the opposite, I think. In Tehanu he can become, finally, fully a man. He is no longer the servant of his power.” And yet, at the end of The Last Jedi, it’s not clear that very much has changed in the Star Wars galaxy. Rey may have taken on Luke’s Jedi mantle, but she finds herself in roughly the same position, leading a small scrappy rebellion against an overwhelming imperial evil. This is where Le Guin’s many successors have failed to honor her example. Le Guin never wrote the same book twice, and each Earthsea novel tackles different themes — some of them, like The Tombs of Atuan and Tehanu, even criticize and respond to other installments. Earthsea’s mark is visible in all the wizard schools, diverse characters, and spiritual warrior-monks who dot our pop culture landscape. But to truly honor Le Guin’s legacy, storytellers should try to always seek new storytelling horizons. How else will we learn new things, new ways of being in the world? After all, as the song goes in Earthsea, “farther west than west, beyond the land, my people are dancing on the other wind…” ",
    "title": "Ursula K. Le Guin's Earthsea: Mapping the book's pop culture influence",
    "url": "https://ew.com/books/2018/01/25/ursula-le-guin-earthsea-pop-culture-influence/"
}