{
    "text": "Print Not even an honorary National Book Award kept Ursula K. Le Guin from being surprised by her latest tribute: membership in the American Academy of Arts and Letters.\n\n\"My reputation was made as a writer of fantasy and science fiction, a literature that has mostly gone without such honors,'' she told The Associated Press recently.\n\nKnown for such classics as \"The Left Hand of Darkness'' and \"The Dispossessed,'' Le Guin has won numerous science fiction and fantasy awards, but only in recent years has she received more literary recognition, notably a National Book Award medal in 2014. The arts academy, an honorary society with a core membership of 250 writers, artists, composers and architects, once shunned \"genre'' writers such as Le Guin. Even such giants as science fiction writer Ray Bradbury and crime novelist Elmore Leonard never got in.\n\nAcademy member Michael Chabon, the Pulitzer Prize-winning novelist, advocated for Le Guin.\n\n\"As a deviser of worlds, as a literary stylist, as a social critic and as a storyteller, Le Guin has no peer,\" he wrote in his recommendation, shared with the AP, that she be admitted. \"From the time of her first published work in the mid-1960s, she began to push against the confines of science fiction, bringing to bear an anthropologist's acute eye for large social textures and mythic structures, a fierce egalitarianism and a remarkable gift of language, without ever renouncing the sense of wonder and the spirit of play inherent in her genre of origin.''\n\nThe 87-year-old Le Guin is one of 14 new core members, the academy told the AP. Others include fiction writers Junot Diaz, Ann Patchett, Amy Hempel and Colum McCann, former U.S. poet laureate Kay Ryan and fellow poets Henri Cole and Edward Hirsch. The academy also voted in the artists Mary Heilmann, Julie Mehretu and Stanley Whitney, architect Annabelle Selldorf and composers Melinda Wagner and Julia Wolfe.\n\nThree foreign honorary members were added: authors Chimamanda Ngozi Adichie and Zadie Smith and composer Kaija Saariaho.\n\nThe arts academy was founded in 1898, with members since ranging from Henry James and William Dean Howells to Chuck Close and Stephen Sondheim. The new inductees will be formally welcomed at a ceremony at the New York-based academy in May, where academy member Joyce Carol Oates will deliver the centennial Blashfield Foundation keynote address. Previous speakers have included Helen Keller, Robert Frost and Robert Caro. Patchett, author of the acclaimed \"Bel Canto\" and most recently \"Commonwealth,\" said she had tears in her eyes after learning she had been selected. Years earlier, she had been given a prize by the academy, presented to her by John Updike.\n\n\"They could have just given me the Getting-To-Eat-Lunch-With John-Updike award and that would have been the biggest thrill of my life,\" she told the AP. \"This is an institution where all of my heroes gather. I am very moved that they've invited me in.\"\n\nDiaz, winner of the Pulitzer Prize for his novel \"The Brief Wondrous Life of Oscar Wao,\" told the AP that he was surprised to get into the academy, in part because he was informed in an old-fashioned way - by letter.\n\n\"No one sends letters anymore,\" he wrote recently in a more prevalent form of communication, email.\n\nLe Guin lives in Portland, Oregon, and will not be attending the May ceremony. For a time, she didn't even know she had been chosen. Blame it on the risks of sending paper letters.\n\n\"[T]he academy's written invitation never got to me,'' she said, adding that she feared comparisons to Bob Dylan, who took more than two weeks to personally respond to winning the Nobel Prize for literature. \"I found out they'd been waiting days or weeks for a reply. I thought: 'Oh, no, they'll think I've been pulling a Dylan on them!'\"  ",
    "title": "Ursula K. Le Guin, Ann Patchett Voted into Arts Academy",
    "url": "https://www.voanews.com/a/le-guin-patchett-voted-into-arts-academy/3743021.html"
}