{
    "text": "Fantasy author accuses the online giant of using its market dominance ‘to control what we write and what we read’ The grande dame of fantasy Ursula K Le Guin has weighed in forcefully to the debate about Amazon’s role in publishing. In a blogpost on the site Book View Cafe, entitled “Up the Amazon with the BS Machine, or Why I Keep Asking You Not to Buy Books from Amazon”, the American author has spoken out against what she describes as the company’s increasing influence not only on the bookselling market but also on which books get published, promoted and read. Her fierce conclusion is: “Every book purchase made from Amazon is a vote for a culture without content and without contentment.” After an analysis of how the “Best Seller Machine” has worked in the last decades, Le Guin writes that the online retailer is changing the culture of publishing. The Amazon model, she writes, is “easy salability, heavy marketing, super-competitive pricing, then trash and replace”. The ideal book, under this template, is “a safe commodity, a commercial product written to the specifications of the current market, that will hit the BS list, get to the top, and vanish. Sell it fast, sell it cheap, dump it, sell the next thing.” She adds that “any publisher willing to print a book that isn’t easy to market, or to keep books that sell modestly but steadily in print, is bucking this trend. Most of them are small houses. The few big publishers that now continue functioning at all under the deliberately destructive pressure of Amazon marketing strategies are increasingly controlled by that pressure.” The tech giant is not only trying to control the bookselling industry but also the publishing world, she writes: “Amazon uses the BS Machine to sell us sweetened fat to live on, so we begin to think that’s what literature is.” She assures her readers that her “only quarrel with Amazon is when it comes to how they market books and how they use their success in marketing to control not only bookselling, but book publication: what we write and what we read.” She stressed that she has no issue with other areas of the tech giant’s business, including self-publishing: “Amazon and I are not at war. There are vast areas in which my peaceful indifference to what Amazon is and does can only be surpassed by Amazon’s presumably equally placid indifference to what I say and do. If you like to buy household goods or whatever through Amazon, that’s totally fine with me. If you think Amazon is a great place to self-publish your book, I may have a question or two in mind, but still, it’s fine with me, and none of my business anyhow.” Other high-profile authors who have protested against the tech giant’s growing power include Stephen King, Donna Tartt, Paul Auster, James Patterson, John Grisham and Jennifer Egan, all of whom signed the campaign against the online retailer over its dispute with Hachette last year. ",
    "title": "Ursula K Le Guin launches broadside on Amazon's 'sell it fast, sell it cheap' policy | Ursula K Le Guin | The Guardian",
    "datetime": "2015-06-03T16:11:18.000Z",
    "url": "https://www.theguardian.com/books/2015/jun/03/ursula-k-le-guin-amazon-bs-machine"
}