{
    "text": "Korean cultural seduction cascades in waves around London’s V&A. Birds do it, bees do it, even educated fleas do it, let’s do it, let’s Gangnam Style. July 15, 2012 marked a watershed moment in contemporary global culture. South Korean singer, songwriter and producer Park Jae-Sang, better known as PSY, posted the music video “Gangnam Style” on YouTube. And … Kapow. Lift-off! The adrenaline-fuelled vibe, pink suits and quirky horse-riding dance moves went viral overnight, busting multiple sales and viewing analytics, inspiring endless parodies and gathering prestigious awards and global followers in its wake. From Kim and Kanye, Madonna, Britney, Twitter founder Jack Dorsey and film director Steven Spielberg, to West Indian cricketer Chris Gayle, sprinter Usain Bolt, footballer Cristiano Ronaldo, tennis royalty Novak Djokovic and Rafael Nadal, to real royalty Zara Phillips (granddaughter of the late Queen Elizabeth II), artists Ai Wei Wei and Anish Kapoor, to fashion model Heidi Klum, socialite Paris Hilton, British prime ministers Boris Johnson and David Cameron, and UN secretary-general Ban Ki-moon, the world couldn’t scroll and scream “Gangnam” fast enough, and crack out its terpsichorean equine prowess in a digital wave of electronic excitation and adulation; if you hadn’t Gangnam Styled, you hadn’t lived. By May 2014, two billion views later, Google had to recalibrate its play counter, never imagining a video being watched in numbers greater than a 32-bit integer. (Even former Google CEO Eric Schmidt had done the pony dance.) Today, “Gangnam Style” boasts an explosive 4.5-billion-plus YouTube views and the number is still rising. Remarks one commenter: “This guy technically ruled the world for a time.” Hard it is to believe then, that Gangnam, Seoul’s most glamorous and affluent burb, was 50 years ago just a poor, desolate area of rice paddy fields, bordered by the empty concrete shells of apartment blocks that dotted the banks of the river. This contrast and the hyper-accelerated pace of change, from a once-colonised country reliant on forestry, fishing and farming, to a government-funded aspirational trend-setting, tech-savvy cultural superpower, and its global impact on the creative industries of cinema, drama, music, fandom, beauty and fashion, comprises London’s Victoria & Albert Museum’s Hallyu! The Korean Wave. Hallyu means “wave” in Korean and the narrative wave provoked by PSY (a multi-screen presentation of “Gangnam Style” opens the exhibition) is celebrated and updated to the now-surging waves of Korean culture (Hallyu 3.0) in which films and TV shows such as Parasite and Netflix’s Squid Game, or boy bands and girl bands such as BTS and BLACKPINK (on the back of bands like Big Bang and Major Girls) have come to dominate the global consciousness, or K-onsciousness, and one in which idols and fans now wield digital social, economic, ambassadorial and even political influence. And it’s dazzling and dizzying and K-ataclysmically compelling. And comes fast, furious and fantabulously exhilarating in Korea’s new “attention economy”. Blink and you miss it, or “Blinks” that is, the name given to fans of the insanely popular girl-quartet BLACKPINK. (All groups in Korea have fandoms with specific names and each band and their fandoms accessorise with their own light-stick design, a kind of totemic glamorous wand with which they make tribal lightwaves at concerts.) BLACKPINK are Jisoo, Rosé, Lisa and Jennie, K-pop’s current darlings, one minute appointed by Boris Johnson as COP26 climate-change advocates in Glasgow – “This is our planet, this is our future, climate change will affect us all” – and the next becoming the first female K-pop group to perform at the 2022 MTV Video Music Awards at New Jersey’s Prudential Center in August. And did you see them slay their new single “Pink Venom”, rocking signature all-black ensembles with soft-pink accents and pitch-perfect choreography? OMFG!, O.M.F.G!, OMFKG! “Pink Venom”, the pre-release single from BLACKPINK’s new album Born Pink, is Spotify’s most-streamed by a female artist in a single day in 2022, and had 90.4 million views – the biggest 24-hour music video debut record in 2022, on YouTube. It currently has 338 million views. And, wait for it, 3.6 million comments, a swirling, confessional collective of obsessing, fan-girling and K-goddessing. And this month the K-Pop Supernovas will launch the Born Pink World Tour on October 25, starting with American and European dates, before reaching Asia’s capitals next year – Bangkok, Kuala Lumpur and Singapore among them. Meanwhile, megawatt boy band BTS met US President Joe Biden at the White House in June and posed in the “finger heart” gesture, popularised by K-pop idols, underlining their anti-hate crime message. BTS has topped the Billboard album charts and became the first K-pop group to speak at the United Nations, helping to launch Unicef ’s Generation Unlimited campaign, promoting education, employment and empowerment for young people globally. The UN noted “most heads of state coming to the General Assembly are 60-plus years old” and stressed the need for younger generations to get involved. Cue BTS (whose fans are known as Army), reflecting the group’s ability to attract and influence global youth by means of fast-moving digital technologies and networked communications. Army fandom then promotes and spreads their idols’ stories and values via social media. And, hey presto, hallyu emerges not only as a core component of Korea’s economic competitiveness, but also as a powerful resource for social influence and cultural diplomacy on a global level. Rosalie Kim, curator of the Hallyu exhibition, reinforces the status of K-pop idol groups. “Their use of social-media platforms has been common industry practice, and the perceived reciprocal engagement between fans and idols is now typical of contemporary music consumption. Many top-tier K-pop idols, including BLACKPINK, Exo and Twice, have extensively utilised social media to foster audiences for their music.” And she singles out BTS. “They’re particularly well known for their social-media use, with their Top Social Artist awards between the late 2010s and the early 2020s directly related to their extensive engagement with fans, which is perceived as one of their primary strengths.” And then there’s next-gen K-poppery. In October 2020, SM Entertainment created a new girl group, aespa (their fans are MY,  which means “the most precious friend”), combining real idol members and virtual “ae” counterparts. Although aespa’s formation led to fierce digital debate in Korea over the potential for dehumanisation, the band has become a success, having one of the biggest K-pop single hits of 2021 “Next Level” and their EP Savage debuting at number 20 on the US Billboard chart. But in an exhibition that contains so many “champagne” moments of the Korean Wave (a set from Parasite, outfits from Squid Game, a vast multi-screen installation by “electronic superhighway” artist Nam June Paik and K-fashion from Kye to Miss Sohee) the boldest standout is artist Gwon Osang’s gigantic sculpture of K-pop royalty G-Dragon (former Big Bang member often called the King of K-Pop), standing like an angelic matador over his androgynous foe. Gwon collaborated with YG Entertainment and G-Dragon on the work. “The proposal was that I would sculpt a large G-Dragon statue, but I was given complete autonomy and the final form resulted in two GD figures fighting each other,” Gwon tells us. Think of it as 2GD in 3D. G-Dragon went to Gwon’s studio who “remembers photographing G-Dragon’s cat Ai and his dog Gaho, and preferring Ai: “Ai was a lovely and gentle cat.” Gwon assembled images of G-Dragon’s face and outfits from the internet and reconstructed them for his sculpture. Given that the King of K-Pop had been famous for almost a decade, Gwon sees his work as a kind of homage. “I thought the statue was a great opportunity to archive the past 10 years of G-Dragon’s time as a singer,” he says. “The sculpture represents the human’s omnipresent conflict in a distinguished way.” In retrospect, the currents of the Korean Wave were already building at the turn of the millennium, long before we’d heard of G-Dragon, but in cinema. Director Bong Joon-ho’s satirical debut, Barking Dogs Never Bite, set the tone that evolved into his Oscar-winning Parasite in 2019, and then the game-changer came on a Monday morning when we visited Ciné-Art cinema in Wan Chai, Hong Kong, and watched unknown Korean actress Jun Ji Hyun acting tough in director Kwak Jae-yong’s romantic comedy My Sassy Girl (2001). Sassy was based on a true story told in blog posts by Kim Ho-sik, who later adapted the material into a novel. Jun’s character outdrank and “bullied” her meek onscreen boyfriend (Cha Tae-hyun) through a mixture of withering glares and emasculating insults. The film was the highest-grossing comedy of all time in South Korea, and Jun’s performance earned the adoration of regional audiences and made her the poster girl of South Korean – and pan-Asian – cinema. In the overwhelmingly patriarchal societies of Japan, Korea, China and, to a certain extent, Hong Kong, Jun’s individualistic and carefree approach to life and romance resonated with a group of contemporary girls who were finding their voices and identities on nascent digital and pre-social media platforms (and vitally young Japanese who were shifting their entertainment allegiances from Tokyo to Seoul). Jun was the girl of the future. Fast-forward to the Korea of 2022, and Jun, along with luminous actresses Song Hye-kyo and Kim Tae-hee, are known as Tae-Hye-Ji (“the troika”). Yoojin Choi, exhibition curator at the V&A and co-collaborator with Kim, is declarative on the subject of Jun’s contribution to early hallyu. “Jun Ji-Hyun was the first to create or stimulate the notion of fandom in a way that’s now ubiquitous in K-culture. And she’s still doing it.” That fandom emanated from girls and boys alike. And My Sassy Girl woke the West up to the potential in Korean cinema in a way Bong’s Barking Dogs hadn’t (Jun was the first Korean actress to grace the pages of US Vogue), and spawned a glut of global adaptations in India, the US, China and even Lithuania. Remarkably, recent remakes include the Philippines (2021) and one this year in Indonesia. Hallyu: Korean Wave is this year’s (and so advanced maybe the next decade’s) must-see show. You even get to flex your “Gangnam Style” dance moves. How. K-ool. Is. That? We heart the K-Wave. We are ‘fandom’. And we need those light sticks!  Yes, I agree to the Privacy Policy Thank you for your subscription. Subscribe to our newsletter to get the latest updates.  Thank you for your subscription. ",
    "title": "V&A explores Korean culture in exhibition \"Hallyu! The Korean Wave\"",
    "datetime": "2022-10-13T02:00:00+00:00",
    "url": "https://www.prestigeonline.com/hk/lifestyle/art-plus-design/victoria-and-albert-museum-korean-wave-exhibition/"
}