{
    "text": "Spend a few minutes browsing social media, or watch groups of travelers posing in front of a popular tourist attraction, and you’re bound to come across it: attractive young Asians flashing smiles and making the V-for-Victory sign (or peace sign). The raised index and middle fingers, with palm facing outward, are as much a part of Asian portraiture as saying cheese is to English speakers. But why? To non-Asians, the gesture seems so intrinsically woven into the popular culture of Beijing, Osaka or Taipei as to make it seem that it was forever thus — but, in fact, its earliest origins date back no further than the late 1960s, and the gesture didn’t really find widespread acceptance until the late 1980s. Some say it began with Janet Lynn. The American figure skater was favored to take home gold in the 1972 Olympics in Japan. But the 18-year-old’s dream came crashing down when she fell during her performance. The gold medal was gone. She knew it, and Japan knew it. But instead of grimacing, the shaggy-haired blonde simply smiled. Lynn’s behavior ran charmingly counter to the Japanese norm of saving face, and in doing so earned her legions of Japanese fans. “They could not understand how I could smile knowing that I could not win anything,” said Lynn, who eventually went home with a bronze, in a telephone interview. “I couldn’t go anywhere the next day without mobs of people. It was like I was a rock star, people giving me things, trying to shake my hands.” Lynn became a media sensation in Japan and the recipient of thousands of fan letters. During media tours around Japan in the years following the Olympics, she habitually flashed the V-sign. A cultural phenomenon was born. Or rather, it was consolidated — because the V-sign was already entering mainstream consciousness through manga. In the 1968 baseball comic Kyojin no Hoshi (Star of the Giants), a protagonist struggling with father issues, and the pressure of competition, gets his dad’s tacit approval when the elder throws him a “V” before a big game. The volleyball manga Sain wa V!  (V Is the Sign) was created shortly after and was adapted into a television series with an infectious earworm of a theme that features the chant “V-I-C-T-O-R-Y!” It was probably advertising that gave the gesture its biggest boost, however. Though Lynn had some influence on the widespread use of the V-sign in photos, Japanese media attribute the biggest role to Jun Inoue, singer with the popular band the Spiders. Inoue happened to be a celebrity spokesperson for Konica cameras, and supposedly flashed a spontaneous V-sign during the filming of a Konica commercial. “In Japan, I have seen the Inoue Jun theory advanced most often as an explanation for the origin of this practice,” Jason Karlin, an associate professor at the University of Tokyo and an expert on Japanese media culture, tells TIME. “I think the practice is a testament to the power of the media, especially television, in postwar Japan for propagating new tastes and practices.” With the mass production of cameras, and a sudden surge in women’s and girls’ magazines in the 1980s, the aesthetics of kawaii — a visual culture superficially based on cuteness — took off. Suddenly, more women were posing for more shots, and more shots of women were being shared. V-signs proliferated much like today’s “duck face” pouts on Instagram and Facebook. “The V-sign was (and still is) often recommended as a technique to make girls’ faces appear smaller and cuter,” says Karlin. Laura Miller, a professor of Japanese studies and anthropology at the University of Missouri at St. Louis, stresses the role played by women in popularizing the gesture in photos. She recalls hearing girls say piisu, or peace, while making the sign in the early 1970s. “Like so much else in Japanese culture, the creative agents in Japan are often young women, but they are rarely recognized for their cultural innovations,” she wrote in an email to TIME. When Japanese pop culture began to spread around East Asia in the 1980s (prior to the emergence of K-pop in this century), the fashionable V-sign found itself exported to mainland China, Hong Kong, Taiwan and South Korea (where it already enjoyed some recognition because of the decades-long presence of the U.S. military). These days, the habit is everywhere that Asians are. However, most young Asians who make the gesture in photos do so without thinking and are baffled when asked why they do it. Some say they’re aping celebrities, while others say it’s a mannerism that alleviates awkwardness when posing. “I need something to do with my hands,” says Suhiyuh Seo, a young student from Busan, South Korea. Little children do it without even being taught. “I don’t know why,” says 4-year-old Imma Liu of Hong Kong — but she says she feels “happy” when she does it. Perhaps that’s all that matters. Contact us at letters@time.com. ",
    "title": "V-Sign: Why East Asians Make Peace Signs in Photos | Time",
    "datetime": "2014-08-04T08:27:33.000Z",
    "url": "https://time.com/2980357/asia-photos-peace-sign-v-janet-lynn-konica-jun-inoue/"
}