{
    "text": "The virtual celebration was hosted by Carolina Navigators, which offers opportunities for undergraduates to inspire younger students to learn more about global issues, cultures and languages. Carolina Navigators, a service-learning and global education outreach program at the University of North Carolina at Chapel Hill, took K-12 classes around the world in its 14th biannual Virtual Cultural Festival on April 23. A total of 27 classes and nearly 700 K-12 students attended at least one of the three sessions offered throughout the day by joining the presentations on Zoom or by watching on YouTube as the presentations were livestreamed. Nine North Carolina counties were represented among the schools in attendance, and one class joined from Texas. The virtual format wasn’t new to Carolina Navigators since the program has been connecting with classrooms virtually for the past decade. Sessions were presented by Carolina Navigators undergraduate student interns. The program’s interns have extensive experience or expertise in intercultural exchange. This semester they created and shared presentations about transportation in El Salvador and Cuba, wildlife in Peru and Thailand, and governments of Cuba, China and India. Carolina Navigators offers opportunities for undergraduate student interns at UNC-Chapel Hill to inspire younger students to learn more about global issues, cultures and languages. Although the COVID-19 pandemic has widely disrupted international travel and regular classroom activities, the Virtual Cultural Festival gave undergraduate student interns and K-12 students a way to connect. “The level of engagement, regardless of the barriers due to COVID, was amazing,” said Samantha Rivera ’21, who has interned with Carolina Navigators since 2019. Rivera grew up in a Salvadoran household and studied abroad in Tunisia in 2020. During her presentation, she spoke about different types of transportation in El Salvador and concluded with a question-and-answer session that covered Tunisia as well. “Students had many questions about El Salvador and Tunisia,” said Rivera. “I felt that although they have not experienced being abroad, I was able to provide them with a sense of what it is like.” Many students who virtually attended the festival said that they would like to travel and learn about more countries. After attending one session, Alex, a second-grader at Oakley Elementary School in Asheville, North Carolina, said that he would like to live in Peru one day. “The students had so many questions about traveling, and many said they wanted to visit the countries that we focused on in our presentations,” said Ava Elliot ’23, who presented on transportation in Cuba. “It is very rewarding to know that I may have inspired a kid to go have their own experience in a country outside the U.S.” Carolina Navigators aims to present on topics that are relevant to educators’ classroom lesson plans and the North Carolina Standard Course of Study. “My second-graders loved the presentations. They were interested in learning more about the countries and the personal connections of the presenters,” said Sarah Mills, a teacher at Dillard Drive Elementary School in Raleigh, North Carolina. “They were also making great connections to the wildlife they saw from Peru and Thailand and topics discussed for Earth Day! This experience was a great way to expand their global perspectives.” Carolina Navigators interns also give virtual presentations to individual classes during the school year. This year they partnered with a second-grade class in Martin County, North Carolina, to give the class a total of nine presentations on topics like sports in India and Cuba. They upload recordings of these presentations, as well as those given during their Virtual Cultural Festivals, to their YouTube channel, which currently has over 500 videos. Carolina Navigators shares digital and tangible global education resources with North Carolina K-14 educators throughout the school year. In addition to virtual presentations, the program offers North Carolina classrooms the use of its culture kits, collections of authentic and educational cultural items from countries around the world that educators use to teach students about life and cultures in other countries. Carolina Navigators currently offers a selection of 200 culture kits that represent 146 different countries, cultures or global themes, and they continue adding new kits to their inventory each year. Anyone in North Carolina, ranging from teachers to community members, can borrow a culture kit free of charge with shipping costs covered by Carolina Navigators. Double Tar Heel Maribel Carrion established the Carrion Global Experiences Fund to open more opportunities to see the world. The Phillips Passport Initiative covers the cost of an international travel necessity for first-year and transfer undergraduates. A delegation from UNC-Chapel Hill discussed shared interests and collaboration with the German university’s new president. In this University Day video, Tar Heels representing faculty, staff, students, alumni and board members talk about how Carolina serves the state. When we understand the complex causes, says researcher Diana Fishbein, we can intervene to prevent substance abuse. © 2023 The University of North Carolina at Chapel Hill ",
    "title": "Virtual Cultural Festival promotes intercultural education in K-12 classrooms | UNC-Chapel Hill",
    "datetime": "2021-06-22T13:58:00+00:00",
    "url": "https://www.unc.edu/posts/2021/06/22/virtual-cultural-festival-promotes-intercultural-education-in-k-12-classrooms/"
}