{
    "text": "In a bid to retain a taste of summer, Edmonton's Heritage Festival is planning to go ahead in a virtual format for 2020. The cultural festival featuring food and fun from around the world is a summer highlight, taking place at Hawrelak Park on the August long weekend. This year, the festival will still be celebrated, but with entertainment and food orders moving online, organizers said in a news release Friday. \"We regret not being able to join together, as in the past, to participate in a collective celebration of cultural diversity,\" said festival executive director Jim Gibbon. \"But we recognize the challenges we are all dealing with at this time and large crowds are neither appropriate nor acceptable during the pandemic.\" The announcement came one day after Alberta's Chief Medical Health Officer, Dr. Deena Hinshaw, made it clear that current restrictions prohibiting gatherings of more than 15 people will remain in effect through the summer, effectively cancelling the festival season in its usual format. On Thursday, K-Days, the 10-day summer exhibition that happens every July, announced that it will not take place this summer. A news release from Northlands confirmed that the 141st running of the event, which had been scheduled to begin July 17, will be postponed until 2021. \"We felt this was the best way to proceed during such an unprecedented global situation. We are very disappointed but we know it's the right decision based on the information we have today,\" Peter Male, Northlands president and CEO, said in the release. The organization felt it would not be possible to stage the event giving the ongoing concerns about COVID-19, the release said. The annual parade that traditionally kicks off the event had been cancelled in February, due to economic realities. Organizers of Taste of Edmonton said Thursday that the annual summer event, scheduled for July 16-26, is being postponed until the summer of 2021. The new dates will be July 22-Aug. 1, 2021. \"The health and safety of our staff, restaurant partners, volunteers, and Edmontonians is a responsibility that we take very seriously,\" Donovan Vienneau, general manager of Events Edmonton, said in a news release. \"Now more than ever, Edmontonians need the enjoyment of so many amazing local restaurants and entertainment. However, following the guidelines set out by governing bodies about mass gatherings, our organization felt strongly that Taste of Edmonton 2020 cannot proceed in these unprecedented times.\" COVID-19 has also caused the cancellation of the Edmonton Folk Music Festival, the Fringe Theatre Festival, the Freewill Shakespeare Festival, the Edmonton International Jazz Festival and the International Street Performers Festival. NextFest will move its events online. The Whyte Avenue Art Walk has also been called off in favour of small art displays in the windows of shuttered businesses. Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636 It is a priority for CBC to create products that are accessible to all in Canada including people with visual, hearing, motor and cognitive challenges. Closed Captioning and Described Video is available for many CBC shows offered on CBC Gem.  ",
    "title": "Virtual Heritage Festival, with online culture and food ordering, aims to keep taste of summer | CBC News",
    "url": "https://www.cbc.ca/news/canada/edmonton/k-days-edmonton-coronavirus-cancelled-1.5542460"
}