{
    "text": "Feed the fanatics on your list with these books and boxed sets—and one gleaming Ron Burgundy bust—vetted by the Vulture editors. (Note: While this slideshow will sometimes direct you to New York City merchants to buy a product, they are available everywhere or online.) *This article originally appeared in the December 9, 2013 issue of New York Magazine. The Carol Burnett Show: Christmas with Carol Charlie Brown and Rudolph are tired. Start a new holiday tradition with Christmas-related absurdity fro... The Carol Burnett Show: Christmas with Carol Charlie Brown and Rudolph are tired. Start a new holiday tradition with Christmas-related absurdity from this year’s Mark Twain Award for American Humor winner, Carol Burnett ($13 at shoppbs.org). Breaking Bad: The Complete Series Even without the Blu-rays, special features, and commemorative coins, this package is worth it for the Los Pollos ... Breaking Bad: The Complete Series Even without the Blu-rays, special features, and commemorative coins, this package is worth it for the Los Pollos Hermanos apron ($210 at Barnes & Noble, 555 Fifth Ave., at 46th St.; 212-697-3048). Downton Tabby, By Chris Kelly Prepare for the January 5 premiere of Downton Abbey’s fourth season with a story about what happens when a group of fa... Downton Tabby, By Chris Kelly Prepare for the January 5 premiere of Downton Abbey’s fourth season with a story about what happens when a group of fat and sassy aristocats confront inevitable social change ($10 at simonandschuster.com). Dexter: The Complete Series Dexter ended after eight seasons this year. Relive the blood splatters and moral contradictions with this Blu-ray collec... Dexter: The Complete Series Dexter ended after eight seasons this year. Relive the blood splatters and moral contradictions with this Blu-ray collection ($322 at Kim’s Video & Music, 121 First Ave., nr. St. Marks Pl.; 212-533-7390). Orange is the New Black: My Year in a Women’s Prison, by Piper Kerman Some of the details are different from the Netflix version (“Pornstache” is “G... Orange is the New Black: My Year in a Women’s Prison, by Piper Kerman Some of the details are different from the Netflix version (“Pornstache” is “Gay Pornstar”), but fans of the show should read the book ($10 at amazon.com). The Walking Dead: Cutting-Room Floor This long-awaited collection gathers plotlines Robert Kirkman left unexplored while writing the graphic novels ... The Walking Dead: Cutting-Room Floor This long-awaited collection gathers plotlines Robert Kirkman left unexplored while writing the graphic novels that became cable’s biggest show ($12 at barnesandnoble.com). Johnny Carson, By Henry Bushkin Despite appearing on TV nearly every night, Carson was an inscrutable figure. His lawyer and best bud Henry Bushkin ... Johnny Carson, By Henry Bushkin Despite appearing on TV nearly every night, Carson was an inscrutable figure. His lawyer and best bud Henry Bushkin aims to end that ($28 at Shakespeare & Co., 939 Lexington Ave., nr. 68th St.; 212-570-0201). Duck Commander Duck Call Yes, this Uncle Si duck call makes it easier to kill defenseless birds. But it’s also a great way to announce the start of ... Duck Commander Duck Call Yes, this Uncle Si duck call makes it easier to kill defenseless birds. But it’s also a great way to announce the start of your Duck Dynasty watching party ($25 at shop.aetv.com). The Bridge: Season One The U.S.-Mexico border is the setting for the first season of FX’s gripping, gritty, and sometimes grisly drama that’s on its... The Bridge: Season One The U.S.-Mexico border is the setting for the first season of FX’s gripping, gritty, and sometimes grisly drama that’s on its way to must-watch status ($42 at amazon.com). Absolutely Fabulous: Absolutely All of It All the seasons, all the specials, and all of Edina Monsoon’s pathetic attempts to live on the cutting edg... Absolutely Fabulous: Absolutely All of It All the seasons, all the specials, and all of Edina Monsoon’s pathetic attempts to live on the cutting edge of cool—it’s all here, and it’s all stuffed into a faux-lizard-skin purse ($149 at shoppbs.org). Furious Cool: Richard Pryor and the World That Made Him, by David and Joe Henry Enraptured by Pryor since childhood, the brothers Henry created a po... Furious Cool: Richard Pryor and the World That Made Him, by David and Joe Henry Enraptured by Pryor since childhood, the brothers Henry created a portrait of a figure as tragic as he was hilarious ($26 at the Drama Bookshop, 250 W. 40th St., nr. Eighth Ave.; 212-944-0595). Peanuts Every Sunday: 1952–1955, by Charles M. Schulz The first four years of Schulz’s comic strip provide a glimpse of an artist who’d go on to dra... Peanuts Every Sunday: 1952–1955, by Charles M. Schulz The first four years of Schulz’s comic strip provide a glimpse of an artist who’d go on to draw “Peanuts” long enough to fill nine more coffee-table books ($32 at barnesandnoble.com). DIY Alice Munro Collection It’s hard to go wrong when starting a collection of the recent Nobel winner’s work. These three titles are good places to... DIY Alice Munro Collection It’s hard to go wrong when starting a collection of the recent Nobel winner’s work. These three titles are good places to start ($16 each at Word, 126 Franklin St., at Milton St., Greenpoint; 718-383-0096). Doctor Sleep, by Stephen King It took 36 years, but King finally gave The Shining the sequel it deserved. The now middle-aged Danny Torrance attempt... Doctor Sleep, by Stephen King It took 36 years, but King finally gave The Shining the sequel it deserved. The now middle-aged Danny Torrance attempts to save a girl from parasitic immortals ($30 at Greenlight Bookstore, 686 Fulton St., at S. Portland Ave., Ft. Greene; 718-246-0200). Favorite Author Doll This Etsy store peddles palm-size versions of the world’s greatest writers, including Kurt Vonnegut, Agatha Christie, and Dorot... Favorite Author Doll This Etsy store peddles palm-size versions of the world’s greatest writers, including Kurt Vonnegut, Agatha Christie, and Dorothy Parker. If Danielle Steele is more your speed, the artist takes custom orders too ($43 at etsy.com/shop/UneekDollDesigns). The Graphic Canon, by Various Artists Comic artists from around the world interpret Western civilization’s literary canon, from Gilgamesh to Infinit... The Graphic Canon, by Various Artists Comic artists from around the world interpret Western civilization’s literary canon, from Gilgamesh to Infinite Jest, in the styles they know best ($105 at Word). A Story Lately Told: Coming of Age in Ireland, London, and New York, by Anjelica Huston The actress opens up about her early days, from child... A Story Lately Told: Coming of Age in Ireland, London, and New York, by Anjelica Huston The actress opens up about her early days, from childhood with her enigmatic father to her time as a muse in seventies New York ($17 at barnesandnoble.com). Opening Ceremony x Elvis sweater The design on this wool sweater mimics the Buick-size “Taking Care of Business” ring Elvis used to rock in his more... Opening Ceremony x Elvis sweater The design on this wool sweater mimics the Buick-size “Taking Care of Business” ring Elvis used to rock in his more bloated days. BTO fans will appreciate it too ($355 at openingceremony.us). The Clash Sound System Boxed Set Bassist Paul Simonon designed this absurdly comprehensive set, which includes albums, dog tags, and a poster tube t... The Clash Sound System Boxed Set Bassist Paul Simonon designed this absurdly comprehensive set, which includes albums, dog tags, and a poster tube that looks like a giant, Clash-branded cigarette ($222 at barnesandnoble.com). Daft Punk Random Access Memories Necklace A dedicated Daft Punk fan painstakingly replicated the necklaces Thomas and Guy-Manuel wear in the “Get Lu... Daft Punk Random Access Memories Necklace A dedicated Daft Punk fan painstakingly replicated the necklaces Thomas and Guy-Manuel wear in the “Get Lucky” video ($50 at etsy.com/shop/SorenzoProps). Wu-Tang Brand Bike From the State Bicycle Co. comes the ultimate Brooklyn accessory endorsed by a group from Staten Island: a black-and-yellow fixie... Wu-Tang Brand Bike From the State Bicycle Co. comes the ultimate Brooklyn accessory endorsed by a group from Staten Island: a black-and-yellow fixie for those who like bringing the ruckus on two wheels ($600 at statebicycle.com). RiRi Hearts M.A.C Holiday Collection Rihanna’s back with another M.A.C collaboration. This holiday collection, out December 5, includes her coveted ... RiRi Hearts M.A.C Holiday Collection Rihanna’s back with another M.A.C collaboration. This holiday collection, out December 5, includes her coveted red RiRi Woo lipstick ($303 for the collection at maccosmetics.com). Ella Fitzgerald: The Voice of Jazz Boxed Set Fifty-seven years after it was founded to release Fitzgerald’s music, Verve Records honors the legendar... Ella Fitzgerald: The Voice of Jazz Boxed Set Fifty-seven years after it was founded to release Fitzgerald’s music, Verve Records honors the legendary jazz vocalist with a ten-disc boxed set that offers six decades of perfect pitch ($127 amazon.com). The Julie Ruin Tote No punk-rock bag collection is complete without this tote name-checking Kathleen Hanna’s latest band. Carry it with your Le Tigr... The Julie Ruin Tote No punk-rock bag collection is complete without this tote name-checking Kathleen Hanna’s latest band. Carry it with your Le Tigre and Bikini Kill totes to complete the trilogy ($15 at thejulieruin.kungfustore.com). APC x Kanye T-shirt Yeezy spent two years working with French label APC to ensure every article of clothing they made fit “in the kingdom of dopenes... APC x Kanye T-shirt Yeezy spent two years working with French label APC to ensure every article of clothing they made fit “in the kingdom of dopeness.” And what’s doper than a plain white tee that costs as much as a speeding ticket? ($120 at apc.fr) Sly & The Family Stone Higher! Boxed Set Sony celebrates Sly Stone’s 70th birthday with a collection of the shirtless funk legend’s songs, seven... Sly & The Family Stone Higher! Boxed Set Sony celebrates Sly Stone’s 70th birthday with a collection of the shirtless funk legend’s songs, seventeen of which are previously unreleased. ($60 at Barnes & Noble). Bob Dylan Complete Album Collection Vol. One Why buy the 47-disc collection with hardcover book and other odd ephemera when it’s all available on th... Bob Dylan Complete Album Collection Vol. One Why buy the 47-disc collection with hardcover book and other odd ephemera when it’s all available on this tiny USB stick that comes in a novelty harmonica ($249 at amazon.com). Melissa McCarthy DIY Boxed Set Relive the year of Melissa with the two movies in which she starred (The Heat, Identity Thief) and the one she stole ... Melissa McCarthy DIY Boxed Set Relive the year of Melissa with the two movies in which she starred (The Heat, Identity Thief) and the one she stole with an erotic cameo (The Hangover III) ($18, $13, and $25 at bestbuy.com). Effie Trinket Barbie The best parts of this Hunger Games–themed Barbie are all the accessories, and the worst is that her hair only comes in one col... Effie Trinket Barbie The best parts of this Hunger Games–themed Barbie are all the accessories, and the worst is that her hair only comes in one color. But that’s what spray paint is for ($30 at Toys ’R’ Us, 1514 Broadway, nr. Seventh Ave.; 646-366-8800). Nashville Robert Altman’s tale of interconnectedness in the Music City gets the Criterion treatment for those purists who prefer their Nashville wit... Nashville Robert Altman’s tale of interconnectedness in the Music City gets the Criterion treatment for those purists who prefer their Nashville with more Linnea Reese and less Rayna James ($20 at Barnes & Noble). Clint Eastwood: Twenty-Film Collection Watch Eastwood’s trademark look evolve from tough-guy scowl to old-guy grimace with this career-spanning Blu-... Clint Eastwood: Twenty-Film Collection Watch Eastwood’s trademark look evolve from tough-guy scowl to old-guy grimace with this career-spanning Blu-ray collection that renders his raisin-y face in flawless 1080p ($130 at Kim’s Video & Music). Ron Burgundy Bust With any luck, this faux-bronze bust will allow the Ferrell fanatic in your life to profess his love for Anchorman without incessa... Ron Burgundy Bust With any luck, this faux-bronze bust will allow the Ferrell fanatic in your life to profess his love for Anchorman without incessantly quoting the movie. Or its sequel, out December 20 ($24 at urbanoutfitters.com; preorder starting December 5). Cornetto Trilogy The World’s End, Hot Fuzz, and Shaun of the Dead aren’t a true trilogy, but writers Simon Pegg and Edgar Wright did squeeze a refer... Cornetto Trilogy The World’s End, Hot Fuzz, and Shaun of the Dead aren’t a true trilogy, but writers Simon Pegg and Edgar Wright did squeeze a reference to Cornetto ice cream into each ($43 at amazon.com). The Wes Anderson Collection New York’s Matt Zoller Seitz says “detail-obsessed fetishists” will enjoy his book on Anderson, which has as much whimsy... The Wes Anderson Collection New York’s Matt Zoller Seitz says “detail-obsessed fetishists” will enjoy his book on Anderson, which has as much whimsy as any of his movies ($40 at Book Court, 163 Court St., nr. Dean St., Boerum Hill; 718-875-3677). Man of Steel Collector’s Edition Perfect for both Superman fanatics and fitness freaks, thanks to the behind-the-scenes look at the workouts Henry C... Man of Steel Collector’s Edition Perfect for both Superman fanatics and fitness freaks, thanks to the behind-the-scenes look at the workouts Henry Cavill did to get his superhero body ($41 at Barnes & Noble). Star Wars: Frames After sorting through more than a million frames spanning six Star Wars films, George Lucas plucked out 1,416 of his favorites, wh... Star Wars: Frames After sorting through more than a million frames spanning six Star Wars films, George Lucas plucked out 1,416 of his favorites, which are presented as gorgeous works of photography in these two volumes ($150 at abramsbooks.com). Twilight Forever: The Complete Saga Boxed Set After buying the books, the movie tickets, and the T-shirts, make one final Twilight purchase with thi... Twilight Forever: The Complete Saga Boxed Set After buying the books, the movie tickets, and the T-shirts, make one final Twilight purchase with this Blu-ray set with more special features than Taylor Lautner’s torso ($59 at Barnes & Noble). ",
    "title": "Vulture’s 2013 Pop-Culture Gift Guide - Slideshow - Vulture",
    "url": "https://www.vulture.com/2013/11/pop-culture-gift-guide.html"
}