{
    "text": "By Kyle O'Brien on Oct. 7, 2021 - 9:21 AM Wieden+Kennedy has hired Jai Tedeschi as global director of culture and operations, a new role on the independent network’s global leadership team. Tedeschi was formerly R/GA’s vice president and global executive director of culture and operations. In the new role, Tedeschi will help evolve the agency’s structures and systems to support its values, beliefs and goals related to culture, equity and inclusion. She will also lead the agency’s future of work implementation. “I have always admired Wieden+Kennedy and couldn’t pass up the opportunity to join the global leadership team at a really exciting, transformative time,” Tedeschi said in a statement. “I am excited to be part of the evolution and implementation of systems that enable us to diffuse positive experiences consistently, that build on the agency’s strong culture, across the whole place. I’m here to ensure we do what we say and our people feel what we do.” Tedeschi spent eight years at R/GA in various leadership roles. As director and culture operations, she worked with the agency’s operations and talent teams to enact change initiatives. Previous positions include head of digital production at adam&eve DDB and production director at Lowe and AKQA. “(Wieden+Kennedy has) always been a place where people can come and be themselves and make things that feel personal, that mean something more than just making ads … When we met Jai, we knew she was going to play a huge part in our next chapter,” Neal Arthur, chief operating officer at W+K, said in a statement. Tedeschi’s hiring is the latest addition to Wieden+Kennedy’s global leadership team. Late last year, the agency elevated New York managing director Arthur to chief operating officer and executive creative director Karl Lieberman to chief creative officer. 2021 has been a year of business growth, according to the agency. It added 51 new clients globally through projects or longer term partnerships, including taking on global creative strategy and major initiatives for Visa.  Send an anonymous tip   Senior Director of Marketing with Swank Motion PicturesCollaborative StrategiesSt. Louis, Missouri Assistant Professor - Advertising Data Strategy - #0772...Syracuse UniversitySyracuse, New York Mower Endowed Professor of Persuasive CommunicationsSyracuse UniversitySyracuse, New York © 2023 Adweek, LLC - All Rights Reserved ",
    "title": "W+K Names Jai Tedeschi Global Director of Culture",
    "url": "https://www.adweek.com/agencyspy/wiedenkennedy-names-jai-tedeschi-as-global-director-of-culture-operations/174000/"
}