{
    "text": "Kanye West has been in New York this week, taking in Hood By Air and taunting Ray J on Fallon. Last night, he held court at a listening event for Pusha T's new album, My Name is My Name (October 8th, Def Jam), held at Industria Superstudio in Manhattan's Meatpacking District. A little \"gone off that Goose,\" he delivered the above introduction speech, captured by Miss Info. (The format—bare art space, candid intro, resembled Kanye's own June listening party for Yeezus.) As he defended his decision to \"stand by\" Pusha and attacked \"culture vultures\" and \"corporations,\" a woman yelled, Kanye, keep going baby! Indeed. Read a transcript of Ye's speech, via Miss Info: Aye yo this Yeezy right now speaking to y’all. This the heart of the muthaf**king city, act y’all ain’t have that muthaf**king Clipse album and shit. Act like y’all ain’t base y’all whole shit, whole lifestyle off this ni**a Pusha T. Everything is Pusha T. Pyrex Vision, that’s Pusha T. Fear of God, that’s Pusha T. This ni**a the heart of the muthaf**king culture for you culture vultures. This the only ni**a spitting that wild muthaf**king hip-hop shit right now, that’s why I stand next to this ni**a. I don’t give a f**k about none of these corporations, none of these f**king sellouts, this muthaf**king Pusha T. This is the f**k we make. We make good music, we make good music. We don’t give a f**k about how much god damn money you make, we make good music. I’m a (_____ _____ _______ ?) off that Goose right now, I might get loose right now. We don’t give a f**k…..we don’t give a f**k. Ni**a this is that culture. This is that culture….for everybody stealing the culture, for all ni**as trying to do their camo prints at MAGIC this is for fu**king Pusha T. All these ni**as trying to extend their muthaf**king t-shirts, trying to throw numbers on the back of their shit….this muthaf**king Pusha T. “I have a t-shirt line, cause I got numbers at the back of my shit,” F**k you. This DONDA, this Matt Williams, this Virgil Abloh, this Ferris Bueller, this is muthaf**king Pusha T. I’m done. ",
    "title": "Watch Kanye West Rant About “Culture Vultures” at Pusha T’s Listening Party | The FADER",
    "url": "https://www.thefader.com/2013/09/12/watch-kanye-west-rant-about-culture-vultures-at-pusha-ts-listening-party"
}