{
    "text": "Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world Americas+1 212 318 2000 EMEA+44 20 7330 7500 Asia Pacific+65 6212 1000 Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world Americas+1 212 318 2000 EMEA+44 20 7330 7500 Asia Pacific+65 6212 1000 The Pulse with Francine Lacqua is all about conversations with high profile guests in the beating heart of global business, economics, finance and politics. Based in London, we go wherever the story is, bringing you exclusive interviews and market-moving scoops. Overnight on Wall Street is morning in Europe. Bloomberg Daybreak Europe, anchored live from London, tracks breaking news in Europe and around the world. Markets never sleep, and neither does Bloomberg News. Monitor your investments 24 hours a day, around the clock from around the globe. Mike Amiri was raised in Los Angeles’s most famous neighborhood, Hollywood, during the excess of the ’80s hair metal scene. The son of Iranian immigrants, he was transfixed by the music, culture and fashion coming out of clubs like the Roxy. So when he launched his eponymous luxury brand in 2013--with $30,000 of his own money--he married those aesthetics with an obsessive craftsmanship and the most opulent fabrics available. Nine years later, his brand has opened stores around the world, shows regularly at Paris Fashion Week and is projected to earn more than $350 million in 2023. Amiri has created a new, uniquely American vision of what a fashion house should be in the 21st century. The Incredible Rise of the Celsius Energy Drink Japan Mobility Show Returns With Carmakers Vying to Show Off Future EVs US GDP Data to Show Temporary Boost from Summer-Spending Frenzy German Businesses Trim Investment Plans Zambia Reaches Deal With Bondholders on Debt Restructuring Mercedes, Volkswagen Brace for Tougher Times as Margins Fall Japan Mobility Show Returns With Carmakers Vying to Show Off Future EVs Think Tank Urges US to Get Even Stricter With China Over Chips SK Hynix Says Won’t Agree to Western Digital-Kioxia Merger Apple Plans AirPods Overhaul With New Low- and High-End Models, USB-C Headphones Google, Nvidia Back AI Startup That Helps Combat Chip Shortage Microsoft Sales Top Estimates as Cloud Growth Picks Up Steam Synthesia Sells Its Uncanny AI Avatars to Nearly Half of the Fortune 100 Companies Ukraine Recap: Zelenskiy to Urge EU to Tighten Russia Sanctions US-China Ties Quietly Improving Even as Global Turmoil Surges Brazil Congress Approves Bill to Tax the Rich, Raise Revenues Griffin Says Scrutiny of SEC Basis Trade ‘Utterly Beyond Me’ How to Maximize Your Odds for a Hotel Upgrade Taylor Swift Mania Sparks Record-Breaking Jump in UOB Card Fees Markets in an Era of Clashing Superpowers Italian Bonds Are at the Mercy of the ECB Is Natural Gas About to Become a Buyer’s Market? The War That Broke Social Media Sam Bankman-Fried Takes Stand in Reminder of Crypto’s Epic Fall X, One Year Later: How Elon Musk Made a Mess of Twitter’s Business Google, Bank Coalition Pledge Billions to Underserved Businesses EU Says “Shocking and Shameful” Racism Is Getting Worse EU Markets Watchdog Says Companies Spending More on ESG Rich Nations Must Speed Up Climate Action to Meet Paris Goals as Carbon Budget Shrinks NYC Mayor Warns of ‘Draconian’ Steps If Migrant Flow Continues Oil Bosses Try to Sell Tax-Leery Texans $1.4 Billion School Bond The Minnesota Mayor Making Space for Monarch Butterflies Bitcoin Faces Reality Check if ETF Launches Spark ‘Sell-the-News’ Pivot Sam Bankman-Fried Takes Stand in Reminder of Crypto’s Epic Fall FTX Claims Rise After Potential Bidders for Shuttered Exchange Emerge Duke University head coach Mike Krzyzewski explains his approach to building teamwork. He speaks during an interview with Bloomberg's Matt Miller and Scarlet Fu on \"Bloomberg Markets.\" (Source: Bloomberg) ",
    "title": "Watch Duke's Coach K on Creating Teamwork Among Players - Bloomberg",
    "url": "https://www.bloomberg.com/news/videos/2016-09-13/duke-s-coach-k-how-to-build-teamwork"
}