{
    "text": "Microsoft lets girl group 2NE1 do the talking in a new commercial to brilliantly shade Apple and declare \"I Am the Best\" by using the K-pop hit for its soundtrack. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin Technology companies doing side-by-side comparisons in TV ads is nothing new. But subtly shading your competition by soundtracking the ad with a foreign language hit is rather brilliant. For its new Surface Pro 3 tablet laptop, Microsoft shows where its product excels compared to the Macbook Air. The ad never comes out and says it, but by synching a song from K-pop group 2NE1, Microsoft is declaring “I am the best” …in Korean, that is. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\t2ne1\t\t\n\t\t\t\t\t\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news   One of 2NE1’s signature and fiercest tracks, “I Am the Best” is a cocky anthem to celebrate all the things to love about oneself. With more than 96 million views on YouTube, the dance-rap-pop hybrid is one of the most-viewed vids ever for a K-pop act and had itself a pop culture moment Stateside when the girls performed it on “The Bachelor” earlier this year. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t08/13/2014 2NE1’s Top 5 Music Videos While Apple execs may not catch the clever shade upon first listen, loads of K-pop fans were delighted by the placement, and by hearing a Korean act in a U.S.-focused commercial. Hear the full version of 2NE1’s “I Am the Best” below.  Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "title": "Watch Microsoft Brilliantly Shade Apple With 2NE1’s K-Pop Hit in New Ad | Billboard – Billboard",
    "datetime": "2014-08-14T00:30:34+00:00",
    "url": "https://www.billboard.com/music/music-news/microsoft-commercial-2ne1-i-am-the-best-k-pop-ad-apple-6214538/"
}