{
    "text": "Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world Americas+1 212 318 2000 EMEA+44 20 7330 7500 Asia Pacific+65 6212 1000 Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world Americas+1 212 318 2000 EMEA+44 20 7330 7500 Asia Pacific+65 6212 1000 Bloomberg Brief delivers the market news, data and analysis you need to set your agenda. Bloomberg Daybreak, anchored from New York, Boston, Washington DC and San Francisco provides listeners with everything they need to know. Hear the latest economic, business and market news, as well as global, national, and local news. Giant Leap explores how startups and governments are cashing in on the commercialization of space. House Republicans Finally Pick A Speaker: Big Take Podcast Hong Kong Exports Fall Again as Weak Demand Persists US GDP Data to Show Temporary Boost from Summer-Spending Frenzy German Businesses Trim Investment Plans Zambia Reaches Deal With Bondholders on Debt Restructuring NY natural history museum changing how it looks after thousands of human remains in collection Hyundai’s Profit Beats Estimates on Luxury Car and EV Growth Battery Makers Hunt for Graphite Ahead of China Controls Hollywood Actors Fighting Over ‘Basic Principles’ of AI Replicas Land Rover Electric Defender Will Be Made in Slovakia in Blow to UK’s Auto Ambitions Hollywood Actors Fighting Over ‘Basic Principles’ of AI Replicas Google, Nvidia Back AI Startup That Helps Combat Chip Shortage Microsoft Sales Top Estimates as Cloud Growth Picks Up Steam Ukraine Recap: Zelenskiy to Urge EU to Tighten Russia Sanctions US-China Ties Quietly Improving Even as Global Turmoil Surges Brazil Congress Approves Bill to Tax the Rich, Raise Revenues Griffin Says Scrutiny of SEC Basis Trade ‘Utterly Beyond Me’ How to Maximize Your Odds for a Hotel Upgrade Taylor Swift Mania Sparks Jump in Singapore Bank’s Card Fees China Is Beating the US in the Race for the Seabed’s Riches Markets in an Era of Clashing Superpowers Italian Bonds Are at the Mercy of the ECB The War That Broke Social Media Sam Bankman-Fried Takes Stand in Reminder of Crypto’s Epic Fall X, One Year Later: How Elon Musk Made a Mess of Twitter’s Business Thailand Renews Efforts to Guarantee Rights of Same-Sex Couples Google, Bank Coalition Pledge Billions to Underserved Businesses Tesla’s Cybertruck Will Test America’s Great Political Divide EU Markets Watchdog Says Companies Spending More on ESG NYC Mayor Warns of ‘Draconian’ Steps If Migrant Flow Continues Oil Bosses Try to Sell Tax-Leery Texans $1.4 Billion School Bond The Minnesota Mayor Making Space for Monarch Butterflies Bitcoin Faces Reality Check if ETF Launches Spark ‘Sell-the-News’ Pivot Sam Bankman-Fried Takes Stand in Reminder of Crypto’s Epic Fall FTX Claims Rise After Potential Bidders for Shuttered Exchange Emerge Duke University head coach Mike Krzyzewski explains his approach to building teamwork. He speaks during an interview with Bloomberg's Matt Miller and Scarlet Fu on \"Bloomberg Markets.\" (Source: Bloomberg) ",
    "title": "Watch Duke's Coach K on Creating Teamwork Among Players - Bloomberg",
    "url": "https://www.bloomberg.com/news/videos/2016-09-13/duke-s-coach-k-how-to-build-teamwork"
}