{
    "text": "Unsupported Browser Detected.It seems the web browser you're using doesn't support some of the features of this site. For the best experience, we recommend using a modern browser that supports the features of this website. We recommend Google Chrome, Mozilla Firefox, or Microsoft Edge  Dire times bear great ideas. The Coronavirus pandemic has put immense financial pressure on the performing arts and the entertainment business. And while the commodification of culture isn't something new per se, the K-Pop industry may be the pinnacle of a centuries long development. Being in an industry that heavily relies on foreign markets, K-Pop production companies have been very active in finding new ways to reach their audience. In September, leading key players and experts talked about what made K-Pop pop out during these hard times. Our Key Takeaways K-Pop's paradigm shift can be mainly attributed to the industry’s reaction to the ongoing pandemic. K-Pop production companies like SM Entertainment Group – one of the five top K-Pop giants – pioneered the online concert. These concerts feature impressively innovative technology that allow fans to experience the concerts from the comfort of their home. This includes the use of augmented reality (AR) visuals, where backdrops, graphics, lyrics and even entire digital characters may be superimposed onto or combined with live stage footage. Live video chat allows for direct interaction with fans. Bluetooth-paired light sticks sync over the Internet with AR visuals whose movement can be seen by concert viewers – just as though they’re there. Among South Korea’s major exports, K-Pop was ranked 13th in 2018, outgrowing home appliances – formerly a cornerstone of Korea’s post-war export economy. A contributing factor to K-Pop’s monetary success was the companies’ diversification in terms of monetization and their foray into global markets. K-Pop as it is now is a highly streamlined and structured industry involving several layers of producers, directors and other actors – down to all the casting, training, production and marketing agencies –, which by experts is considered to be another pillar of its success. Timely reactions to cultural and market changes is seen as the key to growth. This is also what drives the unique way the industry manages media crossovers rarely seen in other markets. Finally, products may be localized and adapted to individual markets. In this context, online concerts are seen as one way to continue this steady pace of innovation. Beneath the entire business system, industry leaders are aware that fandom is what supports this continuing K-Pop wave and are therefore very eager to keep the fire lit through interactivity and the aforementioned media crossovers. They are confident that they have figured out the recipe for success, or that they will do so when the time comes for another round of innovation.  About the Webcast This virtual dialogue on K-Culture was co-hosted by the Korea Foundation (KF) and Asia Society Switzerland, in collaboration with the Korea Cultural Industry Forum (KCIF).  The Speakers Young Min Kim is Group CEO of the SM Entertainment Group. SM Entertainment is South Korea's largest entertainment company and one of the drivers behind the musical side of “Hallyu”, represting, among others, artists like SuperM, Girls' Generation, Shinee, f(x), or EXO. Mr. Kim joined SM Entertainment in 1999 and held c-level positions within the group since 2005. He currently also holds the positions of CEO, Beyond LIVE Corporation, and CEO, SM Entertainment Japan Plus. For his work he received several awards, among others, the TV Chosun ‘Korea’s Influential CEO’ Global Management Award, and the Redcross Achievement Award. Prof. Jang Woo Lee is a professor of business administration at Kyungpook National University. He serves as chairman of the Institute for Success and Economy, chairman of the Daegu International Musical Festival, co-chairman of the Innovation Economy, and co-chair of the Korea Culture Industry Forum. He serves as a member of the National Economic Advisory Council (fair economy subcommittee), a member of the Creative Economy Advisory Committee of the Ministry of Science, ICT and Future Planning (MSIP) and a member of the Presidential Council on Future Planning, the President’s Association of Korean Business Administration, the chairman of the Small and Medium Business Association, and the president of the Korea Strategic Management Association. He has won the U.S. Journal of Management's Top Editorial Award. He has published more than ten books since Han Management in 1994, including First Mover: Leaders of the Fourth Industrial Revolution in 2017, and recently Creative Management. Prof. Jeong Min Ko is a professor of Culture and Arts at the Hongik University Business School. He also currently serves as the president of the Future Industry Strategy Institute (FISI), a think tank providing research and consulting services in the fields of creative industry and arts, the knowledge service industry, the “Korean wave,” and the cultural industry. He served as vice chairman in Korean Film Council from 2011 to 2014. Before joining Hongik University, Dr. Ko was a senior researcher majoring in cultural industry, cultural marketing and “Korean Wave” at the Samsung Economic Research Institute (SERI) for 24 years. During this period, he also worked at the Samsung Entertainment Group, as the planning director. Throughout his career, Dr. Ko has published numerous books and academic papers on the cultural/entertainment industry and the “Korean wave.” His books include Cultural Content Management Strategy (2007), Hallyu Forever (2009), Hallyu and Management. Asia Society takes no institutional position on policy issues and has no affiliation with any government.\nThe views expressed by Asia Society staff, fellows, experts, report authors, program speakers, board members, and other affiliates are solely their own. Learn more.   ",
    "title": "Webcast on K-Culture: 'The Interactivity Between the Fan and the Artist Is Key' | Asia Society",
    "url": "https://asiasociety.org/switzerland/webcast-k-culture-interactivity-between-fan-and-artist-key"
}