{
    "text": "Korea's longest-running boy band, Shinhwa, proves that staying relevant isn't about pretending you're young. It's about embracing your age. The Backstreet Boys release their 20th-anniversary album In a World Like This next week, the group's first record since This is Us came out in 2009. The members have been making the usual promotion-cycle rounds: going on a comeback tour, dropping by radio stations, appearing on morning shows. But the fact that this group is turning two decades old means it's been together for longer than many of today's most plugged-in pop music listeners have been on Earth. And the band's popularity isn't what it once was; Backstreet's last album, This Is Us, debuted at No. 9 on the US Billboard 200 and only produced two singles of middling success. The group toured with New Kids on the Block in 2011, which cashed in on the nostalgia of people converted more than a decade ago but probably didn't mint many new fans.  The Backstreet Boys have discussed how the music market has changed significantly since the days of \"As Long as You Love Me,\" so they are aware that grabbing young listeners won't be easy. In an interview with The Wall Street Journal, member Kevin Richardson discusses how today's mass audience constantly expects new content from artists because of social media, which wasn't around when the Backstreet Boys were at their peak. So to attract new fans, the boy group of yesteryear may need to readjust its strategy. Luckily, they have a model to imitate: Shinhwa, the Korean equivalent of the Backstreet Boys. Korea's pop industry is much younger than America's own, but its trends mirror those in the U.S.: dubstep, autotune, music competition shows, etc. But unlike in America of late, Korea has latched onto group acts with particular ferocity. It has turned the production of boy and girl collectives (called \"idol groups\") into a science, designing them to do way more than sing and dance. While K-pop is beginning to incorporate more variety in musical styles and artists -- thanks in part to said competition shows -- idol groups still dominate and ultimately are where the money is. In 2012 alone, a staggering 61 group acts and duos made their debuts, 33 of which were male. So K-pop knows a thing or two about boy bands. Rewind to 1998, when SM Entertainment debuted a group called Shinhwa. The six-membered boy band would go on to release four studio albums and win 17 music awards under SM before leaving the label in 2003. They are currently the longest-running male musical group in Korea, recently releasing their 11th studio album to commemorate their 15th anniversary. As a group, Shinhwa is five years younger than the Backstreet Boys, but its approach to becoming the most prominent men-who-used-to-be-boys band of its home country is years ahead of Nick Carter & co. All six of Shinhwa's members are in their 30s, and those physically fit to do so have completed their government-mandated stints in the army. In their 15 years together as a group, they've consistently released music, gone on tour, and appeared on television. Their 2012 album The Return sold more than 80,000 copies last year, which is a solid number in Korea for a group coming back after a four-year hiatus, competing against artists in an oversaturated market. Currently, some members act, others make music, and some are even involved in helping produce the next generation of idol groups. All of this keeps Shinhwa on the Korean public's ears and minds. Aside from Shinhwa's omnipresence, an integral part to the group's longevity is smart self-awareness. In a recent episode of SNL Korea that Shinhwa hosted, the members poked fun of themselves in a skit aptly titled \"A Night at the Museum.\" They play much younger versions of themselves, acting literally as relics from another time, on display for visitors to mock. Dressed in boy-band garb from a past decade, Shinhwa stand in formation as young museum goers express confusion at the group's identity, not recognizing who they are. In a Digital Short from the same episode, Shinhwa play life-insurance salesmen, selling a product called \"Idol Retirement Insurance Plan,\" a package designed to provide retired idols with fawning fans to celebrate birthday parties with, ass-kissing from active artists, and most importantly, stalkers to make the retired idols feel young and well-loved. The skits are tame, but their self-condescension shows that Shinhwa gets it. It's charming to see the band members acknowledge the ridiculousness of people their age performing synchronized routines to pop songs aimed at teens, to see them show some awareness that they could soon become actual has-beens. What the Backstreet Boys can learn from Shinhwa, then, is to get over the awkwardness of being grown men in a boy band and embrace the jokes thrown their way. Their current promotional strategy, however, isn't really helping on that front. They're dating themselves constantly by harping on old slogans (\"Backstreet's back!\") with complete earnestness. They over-rely on puns that only older fans would get, or worse yet, puns that will only serve to trigger sneers from younger pop fans (\"Can't believe Millennium went Number One 14 years ago today! You guys continue to make us feel Larger Than Life. :)\"). They participated in Letterman's \"Top 10\" segment to sing updated lyrics to their best-known songs, referencing Justin Bieber's monkey problems and making an obvious Chris Christie fat joke--a shtick that made them seem like out-of-touch uncles trying too hard to show they're up on pop culture. Another point of comparison lies in the K-pop outfit's variety show, \"Shinhwa Broadcast,\" which brings on a wide array of younger groups. In the episodes, both the guests and Shinhwa play games and compete, among other activities. It's a hit, and great for Shinhwa's public image. Bringing on popular, young groups both helps rope in their fans and gives Shinhwa the opportunity to be \"one of the guys\" with the younger crowd, situating them as still-relevant peers as well as influential elders. Korean culture has strict hierarchies in place, which makes fostering relationships between younger groups and older groups easier. While these junior-senior relationships don't exactly translate over to America, the Backstreet Boys should realize that younger groups on the scene -- and their fans -- can help them. What's more, the group could not have asked for a better time to return: Boy bands are becoming mainstream again. Though acts like One Direction and The Wanted are careful to make the distinction that they're more \"band\" than \"boy,\" they remain five-membered pop groups that heavily rely on their looks and youth to influence the desires (and wallets) of hormonal teens. Nobody's saying that the Backstreet Boys need to bro out with One Direction. (But can you imagine?) What they do need is to realize that connecting with the younger crop of artists would make them appear less outdated. They need to take full advantage of social media, and of the producers and execs out there who would love to sit a veteran boy group together with a young, hot European one. They need a lightly self-mocking SNL appearance. Maybe they could line up some interesting endorsement deals. The possibilities seem endless, but whatever the solution, it doesn't involve \"Backstreet's back.\" ",
    "title": "What the Backstreet Boys Could Learn From K-Pop - The Atlantic",
    "datetime": "2013-07-23T15:19:41Z",
    "url": "https://www.theatlantic.com/entertainment/archive/2013/07/what-the-backstreet-boys-could-learn-from-k-pop/278036/"
}