{
    "text": "HOT TOPICS Korean-language test to be held up to 8 times abroad in 2024 Korean Red Cross builds temp homes for Turkish quake victims Food Clothing and Fashion Traditional Decorative Knots, Maedeup: Donated Works by Lee Bu-ja Jinju Namgang Yudeung Festival Honorary Reporters Jan 31, 2020 By Honorary Reporter Diana Kassandra Almarez from Philippines\r\nPhotos= Korea.net DB  Korea.net is the Korean government's official web portal that works to build and reinforce a meaningful relationship between Korea and the world. Cultural exchange between Korea and other nations is an important aspect of creating a community without borders that shares peace, prosperity and values. Korea.net Honorary Reporters are part of this mission. They work in nine languages -- English, Chinese, Arabic, Spanish, Russian, French, German, Japanese and Vietnamese -- to promote their Korea to the world. Through unique media content, the reporters create a channel through which the public can deepen its understanding and appreciation of Korea. \nAnother year brings another round of annual recruiting for Honorary Reporters. The complete details and application process are available on the Korea.net site, but first, here is what Honorary Reporters do for Korea.net.   1. Writing\r\nSince everyone in the Honorary Reporters family loves Korea, we create our own stories in sharing our admiration of Korean culture. You don't need to be pressured in thinking of the topics you want to write on as long as it expresses your love for Korea and how you do your Korea. Honorary Reporters mostly write about their experiences in K-pop, K-dramas, K-food and anything related to Korea. They also write about Korea-related events in their own countries like Seollal (Lunar New Year) or Hangeul Day celebrations. They also write about updates on Korea and other information helpful to fellow tourists and visitors in Korea. Moreover, Korea holds lots of events for tourists and foreign residents every year, so Honorary Reporters attend such events and share their experiences.\n\n2. Videos and photographs\r\nCertain Honorary Reporters create video content on YouTube to show how Korea is part of their lifestyles. If you're a photographer who loves taking photos of Korea, use your photos to promote how beautiful Korea is. You can also write a photo essay and submit it to Korea.net.\r\nThe diverse topics include recent trips to Korea, tips on living there, information on the country, and other related events such as cultural programs and K-pop concerts. \n\n3. Cartoons and illustrations\r\nCreative Honorary Reporters also produce webtoons (online cartoons) and other illustrations showing Korean culture and traditions. A good example is webtoon artist Diya Mitra, an Honorary Reporter from the U.K. who shows her talents and love of Korea through webtoons.\n\n4. Social media\r\nAre you an active user of social networking sites with a passion for Korea? Then joining Honorary Reporters is for you. You can post everything Korean to your hearts' content on your social media accounts. Share your photos, videos and written stories about Korea on your SNS as much as you like. \n\n5. Collaboration with fellow Honorary Reporters\r\nHonorary Reporters form a family who are encouraged to collaborate with fellow Honorary Reporters in generating new content. Most of us get invited to and participate in Korea-related events by the Korean Embassy and Korean Cultural Center in a country. Such events are a great way to meet fellow Honorary Reporters and brainstorm interesting ideas for Korea.net content. You should meet everyone on board because they are willing to help and share with you their journey in the program.   chaey0726@korea.kr\n\n*This article is written by a Korea.net Honorary Reporter. Our group of Honorary Reporters are from all around the world, and they share with Korea.net their love and passion for all things Korean Gov't signs first joint statement with S. Arabia in 43 years ",
    "title": "What we do as Honorary Reporters : Korea.net : The official website of the Republic of Korea",
    "url": "https://www.korea.net/NewsFocus/HonoraryReporters/view?articleId=182043"
}