{
    "text": "Sections What the Heck Do I Do With The labor-intensive crop is absolutely worth the effort K. Annabelle Smith Found in the wild along the Mediterranean, from Morocco and Portugal to Libya and Croatia, a cardoon is a thistle that tastes like a bitter version of a giant artichoke with small, prickly flower heads. But unlike an artichoke, you eat the stems, not the flower buds. The edible part looks like a celery stalk and the flowers look like something Eeyore would enjoy. In addition to having a really fun name to say out loud, the cardoon is a member of the daisy family and a popular ingredient in Italian dishes. The perennial is planted in late January to February and harvested in early spring. It’s also a very expensive and labor-intensive crop. When grown commercially, the plant is blanched, or protected from sunlight while growing, which involves covering the plant with dirt so chlorophyll doesn’t form. Blanching makes the plant more tender and easier to cook. The price of cardoons at farmer’s markets and high-end grocers varies, though you can grow your own from a $3 packet of seeds. Cardoons are labor-intensive in the preparation department, too. Like an artichoke, it takes a lot of work for little reward. A six-pound globe artichoke yields about two pounds of edible stalk. The outer skin of the stalk is made up of tough ridges that must be removed before consuming the vegetable. Sometimes, recipes call for hours of soaking prior to frying them. But like most labors of love, the end result is often worth your trouble. So what the heck can you do with them, anyway? 1) Fry them After removing the outer skin and ridges, what’s left of the cardoon should be cut into two- to three-inch pieces and then soaked. If you’re pressed for time, peel, cut and soak a day ahead and keep them covered in the fridge overnight. This Food52 recipe involves poaching the vegetable for 20-30 minutes prior to breading and frying. It’s a tough and bitter veggie that requires water to bring out the tenderness. Once you’ve finished with the hard part—the waiting, mostly—frying cardoons is like frying anything else: dip in egg, roll in batter, fry in oil until deliciously golden brown. Grate parmesan cheese as desired. 2) Eat them raw; Dip them You’ve gotta peel away the outer layer to get to the good stuff, but the bitter, artichoke flavor can work on its own. Like celery, raw or plain cardoons dip well in nut butter or hummus. Cardoons are traditionally used as a dipping item in the Italian dish, Bagna cauda, a buttery anchovy sauce that is served like fondue. The cardoon is simmered until tender, drained and then dipped into the warm sauce.\n\n3) Make Cheese\n\nThe dried flowers of a cardoon have enzymes that are often used to curdle milk or for making cheese. The way it works: the flower heads are mixed with milk and the liquid curdles. It’s not as strong as calf’s rennet, so the curdling happens more slowly, but it often yields a creamier texture in the finished product. In Portugal, where the cardoon is popular, several cheeses rely on the vegetable rennet, including Serra da Estrela, Azeitao and Nisa (D.O.P.), which have an earthy, tanginess to them for this reason. 4) Put it in stew Because the fibrous plant requires so much soaking and stewing, a slow cooker or crock pot is perfect for cardoon prep. Any soup you might add celery to works for the cardoon. Put the cardoon in first, as it needs the most time in water. But after a half hour or so, add any veggies or meat you like with seasonings. If you don’t have a slow cooker, you can also boil the cardoon pieces, puree them and add the puree to other soups. This recipe from the New York Times pairs cardoons with oysters and mushrooms for a New England-y take on the Mediterranean veggie. 5) Grow them, because they’re pretty The flower buds aren’t edible, but they are gorgeous. They’re grown ornamentally for their purple-blue hue and silvery leaves, which can grow up to five feet tall. Occasionally, a plant will produce white blooms, but the silver is what makes it most eye-catching in a garden. The Telegraph cites Graham Stuart Thomas, a writer on perennials, who called the cardoon the “grandest of all silverlings.” Careful, though: cardoons grow like weeds once planted. Get the latest Travel & Culture stories in your inbox. K. Annabelle Smith\n|\n\n| READ MORE K. Annabelle Smith is a writer based in Santa Fe, New Mexico who covers a wide variety of topics for Smithsonian.com. Her work also appears in OutsideOnline.com and Esquire.com. Explore Subscribe Newsletters Our Partners Terms of Use © 2023 Smithsonian Magazine\nPrivacy Statement\nCookie Policy\nTerms of Use\nAdvertising Notice\nYour Privacy Rights\nCookie Settings © 2023 Smithsonian Magazine\nPrivacy Statement\nCookie Policy\nTerms of Use\nAdvertising Notice\nYour Privacy Rights\nCookie Settings ",
    "title": "What the Heck Do I Do With a Cardoon? | Arts & Culture|\n Smithsonian Magazine",
    "url": "https://www.smithsonianmag.com/arts-culture/what-heck-do-i-do-cardoon-180950301/"
}