{
    "text": "Education Week is the #1 source of high-quality news and insights on K-12 education. Sign up for our EdWeek Update newsletter to get stories like this delivered to your inbox daily.  Is “critical race theory” a way of understanding how American racism has shaped public policy, or a divisive discourse that pits people of color against white people? Liberals and conservatives are in sharp disagreement. The topic has exploded in the public arena this spring—especially in K-12, where numerous state legislatures are debating bills seeking to ban its use in the classroom. In truth, the divides are not nearly as neat as they may seem. The events of the last decade have increased public awareness about things like housing segregation, the impacts of criminal justice policy in the 1990s, and the legacy of enslavement on Black Americans. But there is much less consensus on what the government’s role should be in righting these past wrongs. Add children and schooling into the mix and the debate becomes especially volatile. School boards, superintendents, even principals and teachers are already facing questions about critical race theory, and there are significant disagreements even among experts about its precise definition as well as how its tenets should inform K-12 policy and practice. This explainer is meant only as a starting point to help educators grasp core aspects of the current debate. Critical race theory is an academic concept that is more than 40 years old. The core idea is that race is a social construct, and that racism is not merely the product of individual bias or prejudice, but also something embedded in legal systems and policies. The basic tenets of critical race theory, or CRT, emerged out of a framework for legal analysis in the late 1970s and early 1980s created by legal scholars Derrick Bell, Kimberlé Crenshaw, and Richard Delgado, among others. A good example is when, in the 1930s, government officials literally drew lines around areas deemed poor financial risks, often explicitly due to the racial composition of inhabitants. Banks subsequently refused to offer mortgages to Black people in those areas.  Today, those same patterns of discrimination live on through facially race-blind policies, like single-family zoning that prevents the building of affordable housing in advantaged, majority-white neighborhoods and, thus, stymies racial desegregation efforts. CRT also has ties to other intellectual currents, including the work of sociologists and literary theorists who studied links between political power, social organization, and language. And its ideas have since informed other fields, like the humanities, the social sciences, and teacher education. This academic understanding of critical race theory differs from representation in recent popular books and, especially, from its portrayal by critics—often, though not exclusively, conservative Republicans. Critics charge that the theory leads to negative dynamics, such as a focus on group identity over universal, shared traits; divides people into “oppressed” and “oppressor” groups; and urges intolerance. Thus, there is a good deal of confusion over what CRT means, as well as its relationship to other terms, like “anti-racism” and “social justice,” with which it is often conflated. To an extent, the term “critical race theory” is now cited as the basis of all diversity and inclusion efforts regardless of how much it’s actually informed those programs. One conservative organization, the Heritage Foundation, recently attributed a whole host of issuestoCRT, including the 2020 Black Lives Matter protests, LGBTQ clubs in schools, diversity training in federal agencies and organizations, California’s recent ethnic studies model curriculum, the free-speech debate on college campuses, and alternatives to exclusionary discipline—such as the Promise program in Broward County, Fla., that some parents blame for the Parkland school shootings. “When followed to its logical conclusion, CRT is destructive and rejects the fundamental ideas on which our constitutional republic is based,” the organization claimed.  (A good parallel here is how popular ideas of the common core learning standards grew to encompass far more than what those standards said on paper.) The theory says that racism is part of everyday life, so people—white or nonwhite—who don’t intend to be racist can nevertheless make choices that fuel racism. Some critics claim that the theory advocates discriminating against white people in order to achieve equity. They mainly aim those accusations at theorists who advocate for policies that explicitly take race into account. (The writer Ibram X. Kendi, whose recent popular book How to Be An Antiracist suggests that discrimination that creates equity can be considered anti-racist, is often cited in this context.) Fundamentally, though, the disagreement springs from different conceptions of racism. CRT puts an emphasis on outcomes, not merely on individuals’ own beliefs, and it calls on these outcomes to be examined and rectified. Among lawyers, teachers, policymakers, and the general public, there are many disagreements about how precisely to do those things, and to what extent race should be explicitly appealed to or referred to in the process. Here’s a helpful illustration to keep in mind in understanding this complex idea. In a 2007 U.S. Supreme Court school-assignment case on whether race could be a factor in maintaining diversity in K-12 schools, Chief Justice John Roberts’ opinion famously concluded: “The way to stop discrimination on the basis of race is to stop discriminating on the basis of race.” But during oral arguments, then-justice Ruth Bader Ginsburg said: “It’s very hard for me to see how you can have a racial objective but a nonracial means to get there.” All these different ideas grow out of longstanding, tenacious intellectual debates. Critical race theory emerged out of postmodernist thought, which tends to be skeptical of the idea of universal values, objective knowledge, individual merit, Enlightenment rationalism, and liberalism—tenets that conservatives tend to hold dear. Scholars who study critical race theory in education look at how policies and practices in K-12 education contribute to persistent racial inequalities in education, and advocate for ways to change them. Among the topics they’ve studied: racially segregated schools, the underfunding of majority-Black and Latino school districts, disproportionate disciplining of Black students, barriers to gifted programs and selective-admission high schools, and curricula that reinforce racist ideas. Critical race theory is not a synonym for culturally relevant teaching, which emerged in the 1990s. This teaching approach seeks to affirm students’ ethnic and racial backgrounds and is intellectually rigorous. But it’s related in that one of its aims is to help students identify and critique the causes of social inequality in their own lives.  Many educators support, to one degree or another, culturally relevant teaching and other strategies to make schools feel safe and supportive for Black students and other underserved populations. (Students of color make up the majority of school-aged children.) But they don’t necessarily identify these activities as CRT-related.  As one teacher-educator put it: “The way we usually see any of this in a classroom is: ‘Have I thought about how my Black kids feel? And made a space for them, so that they can be successful?’ That is the level I think it stays at, for most teachers.” Like others interviewed for this explainer, the teacher-educator did not want to be named out of fear of online harassment. An emerging subtext among some critics is that curricular excellence can’t coexist alongside culturally responsive teaching or anti-racist work. Their argument goes that efforts to change grading practices or make the curriculum less Eurocentric will ultimately harm Black students, or hold them to a less high standard. As with CRT in general, its popular representation in schools has been far less nuanced. A recent poll by the advocacy group Parents Defending Education claimed some schools were teaching that “white people are inherently privileged, while Black and other people of color are inherently oppressed and victimized”; that “achieving racial justice and equality between racial groups requires discriminating against people based on their whiteness”; and that “the United States was founded on racism.” Thus much of the current debate appears to spring not from the academic texts, but from fear among critics that students—especially white students—will be exposed to supposedly damaging or self-demoralizing ideas. While some district officials have issued mission statements, resolutions, or spoken about changes in their policies using some of the discourse of CRT, it’s not clear to what degree educators are explicitly teaching the concepts, or even using curriculum materials or other methods that implicitly draw on them. For one thing, scholars say, much scholarship on CRT is written in academic language or published in journals not easily accessible to K-12 teachers. As of mid-May, legislation purporting to outlaw CRT in schools has passed in Idaho, Iowa, Oklahoma, and Tennessee and have been proposed in various other statehouses. The bills are so vaguely written that it’s unclear what they will affirmatively cover. Could a teacher who wants to talk about a factual instance of state-sponsored racism—like the establishment of Jim Crow, the series of laws that prevented Black Americans from voting or holding office and separated them from white people in public spaces—be considered in violation of these laws? It’s also unclear whether these new bills are constitutional, or whether they impermissibly restrict free speech. It would be extremely difficult, in any case, to police what goes on inside hundreds of thousands of classrooms. But social studies educators fear that such laws could have a chilling effect on teachers who might self-censor their own lessons out of concern for parent or administrator complaints. As English teacher Mike Stein told Chalkbeat Tennessee about the new law: “History teachers can not adequately teach about the Trail of Tears, the Civil War, and the civil rights movement. English teachers will have to avoid teaching almost any text by an African American author because many of them mention racism to various extents.”  The laws could also become a tool to attack other pieces of the curriculum, including ethnic studies and “action civics”—an approach to civics education that asks students to research local civic problems and propose solutions. The charge that schools are indoctrinating students in a harmful theory or political mindset is a longstanding one, historians note. CRT appears to be the latest salvo in this ongoing debate. In the early and mid-20th century,the concern was about socialism or Marxism. The conservative American Legion, beginning in the 1930s, sought to rid schools of progressive-minded textbooks that encouraged students to consider economic inequality; two decades later the John Birch Society raised similar criticisms about school materials. As with CRT criticisms, the fear was that students would be somehow harmed by exposure to these ideas. As the school-aged population became more diverse, these debates have been inflected through the lens of race and ethnic representation, including disagreements over multiculturalism and ethnic studies, the ongoing “canon wars” over which texts should make up the English curriculum, and the so-called “ebonics” debates over the status of Black vernacular English in schools.  In history, the debates have focused on the balance among patriotism and American exceptionalism, on one hand, and the country’s history of exclusion and violence towards Indigenous people and the enslavement of African Americans on the other—between its ideals and its practices. Those tensions led to the implosion of a 1994 attempt to set national history standards. A current example that has fueled much of the recent round of CRT criticism is the New York Times’ 1619 Project,which sought to put the history and effects of enslavement—as well as Black Americans’ contributions to democratic reforms—at the center of American history.  The culture wars are always, at some level, battled out within schools, historians say. “It’s because they’re nervous about broad social things, but they’re talking in the language of school and school curriculum,” said one historian of education. “That’s the vocabulary, but the actual grammar is anxiety about shifting social power relations.”  The literature on critical race theory is vast. Here are some starting points to learn more about it, culturally relevant teaching, and the conservative backlash to CRT. Brittany Aronson & Judson Laughter. “The Theory and Practice of Culturally Relevant Education: A Synthesis of Research Across Content Areas.” Review of Educational Research March 2016, Vol. 86 No. 1. (2016); Kimberlé Crenshaw, ed. Critical Race Theory: The Key Writings That Formed the Movement. The New Press. (1996); Gloria Ladson-Billings, “Toward a Theory of Culturally Relevant Pedagogy,” American Educational Research Journal Vol. 32 No. 3. (1995); Gloria Ladson-Billings, “Just what is critical race theory and what’s it doing in a nice field like education?” International Journal of Qualitative Studies in Education Vol 11. No. 1. (1998); Jonathan Butcher and Mike Gonzalez. “Critical Race Theory, the New Intolerance, and Its Grip on America.” Heritage Foundation. (2020); Richard Delgado and Jean Stefancic. Critical Race Theory: An Introduction. 3rd ed. New York, NY: New York University Press. (2017); Shelly Brown-Jeffy & Jewell E. Cooper, “Toward a Conceptual Framework of Culturally Relevant Pedagogy: An Overview of the Conceptual and Theoretical Literature.” Teacher Education Quarterly, Winter 2011. A version of this article appeared in the June 02, 2021 edition of Education Week as What Is Critical Race Theory, and Why Is It Under Attack? ",
    "title": "What Is Critical Race Theory, and Why Is It Under Attack?",
    "datetime": "2021-05-18T16:53:34.289",
    "url": "https://www.edweek.org/leadership/what-is-critical-race-theory-and-why-is-it-under-attack/2021/05"
}