{
    "text": "Standup comedian Stephen K Amos’s jaunty sitcom What Does The K Stand For? (Radio 4) reaches the end of its second series with possibly the best episode yet. With shades of Chris Rock’s Everybody Hates Chris, Amos takes us back to his 80s childhood, growing up gay and black in a dysfunctional household. “Our family would have been a great test case for social services,” narrates the grown-up Amos. At the heart of the high-pitched domestic mayhem is his mother Virginia (played by the great Ellen Thomas), a bellowing matriarch with a set of idiosyncrasies bigger than her hair. Pre-dinner poetry and a habit of belting out extremely literal songs about her everyday activities are just the tip of the iceberg. Young Stephen is looking for an escape (“I once ran away from home and when I came back my parents had moved”) and finds it in the unexpected form of the Shake n’ Vac advert. His decision to imitate not only the irritatingly catchy jingle but also the lady in the advert leads Virginia to exclaim: “Why are you wearing my high heels, Stephen? You disgust me: your calves are not shapely enough for a four-inch heel!” Playing it broad by mixing farce with double entendres, the sitcom is slightly uneven: although the family are drawn with wit and sympathy, minor characters like the actress-turned-teacher Miss Bliss feel less like real people than excuses to weave in a few good dad jokes (“My Lazy Susan took a bit of a battering over the weekend,” Miss Bliss says at one point). What lifts the show are the elements of diaspora life weaved throughout, as when Aunty Princess visits from Nigeria and accuses Virginia of cultural betrayal (“You have adopted too many fine and fancy British ways”). Stephen defends the family by suggesting she should “go back home”, prompting him to reflect that he has turned into his own racist enemy. It’s unexpectedly thoughtful stuff, suggesting the third series may be even better. ",
    "title": "What Does The K Stand For? review: ‘slightly uneven, but full of wit and sympathy’ | Radio | The Guardian",
    "datetime": "2015-02-12T17:30:02.000Z",
    "url": "https://www.theguardian.com/tv-and-radio/2015/feb/12/what-does-k-stand-for-radio-review"
}