{
    "text": "Sections What the Heck Do I Do With These flower stalks are in season and they’re delicious K. Annabelle Smith Summer is around the corner and grocery stores are brimming over with new produce varieties. Some, like asparagus and peaches are old favorites, others might just make you scratch your head. Garlic scapes, for example. Botanically speaking, scapes are leafless flower stalks of a plant that grow directly from the root. Garlic scapes, then, are the thin, green curlicues that grow directly from the root of a hard-necked variety of garlic plant. The scapes need to be harvested early in the season, typically late spring or early summer so that the actual garlic bulb can form for harvest later in the season. If left to grow, the scapes flower and draw nutrients and flavor away from the actual bulb, leaving the greens as a discarded byproduct. But these days, it’s hard not to find them at a farmers’ market. Scapes look great, and would be fun as a garnish or in a salad, but there are a surprising number of ways you can eat them. Ask any farmer and they’ll tell you to treat scapes as you would green onions--the difference? The mild garlic flavor and touch of sweetness makes these little wispies an adventurous addition to the kitchen. 1) Make a killer pesto Pesto is great on so many things: pasta, toast, salad even. But put some garlic scape pesto on your homemade pizza and watch your dinner guests melt with glee. Combine one cup chopped scapes, ¼ cup pine nuts, a half cup of olive oil, ¼ cup Parmesan, salt and pepper into a food processor. The best part about scape pesto? It doesn’t oxidize and turn brown like basil pesto, so it has a longer shelf life in your refrigerator. 2) Get in pickle Garlic scapes are only available for a few weeks during the year (May through late June) and if you want scapes on top of your pizza in January, pickling them is your only option. “Foodie with Family” single-name blogger Rebecca is a huge fan of scapes all year long, but she doesn’t recommend eating them before any social gatherings. Pickled, garlic scapes have a more complex flavor--a bit of vinegar and a touch of spice. And it only takes ten minutes to jar them. Coil the washed scapes into a sterilized Mason jar, sprinkle your favorite spices and seasonings (e.g. red pepper flakes, black peppercorn, mustard seed) to taste on top. Meanwhile in a pot, bring vinegar, water, salt and sugar to a boil and pour it over the scapes. (see her recipe for exact measurements). Close up the lid and let sit in your fridge for six weeks. By jarring them, the scapes will last up to six to eight months without any canning necessary. Unabashedly serve with wine and cheese at your next dinner party; if everyone has garlic breath, nobody has bad breath. 3) Roast them This is possibly one of the easiest preparations out there. Preheat the oven to 350 degrees Fahrenheit, toss the washed scapes on a cookie sheet with olive oil and salt, and cook until crispy. Make sure to spread the scapes out on the pan so they can crisp evenly. Serve as a side dish with your summer salad. 4) Mix them with hummus Take out the food processor again--it’s time for scape hummus. Hint: this is another painfully easy recipe. Combine a half cup of chopped scapes with two cans of drained chickpeas, one cup of tahini, two tablespoons of olive oil, a touch of lemon juice and blend. Serve with chopped veggies, pita bread or put it on a fresh sandwich for lunch. 5) Make everything butter! There are two ways to make scape butter: Just chop up scapes and puree with a stick of butter or “from scratch”. If you’ve got a few days, get your hands on some locally-produced cream, add some cultured buttermilk and let it sit for three days or so. Then mix it in a food processor to churn the cream into butter and flavor the mix evenly. But if you want to take a more old fashioned route, no one’s stopping you. Get the latest Travel & Culture stories in your inbox. K. Annabelle Smith\n|\n\n| READ MORE K. Annabelle Smith is a writer based in Santa Fe, New Mexico who covers a wide variety of topics for Smithsonian.com. Her work also appears in OutsideOnline.com and Esquire.com. Explore Subscribe Newsletters Our Partners Terms of Use © 2023 Smithsonian Magazine\nPrivacy Statement\nCookie Policy\nTerms of Use\nAdvertising Notice\nYour Privacy Rights\nCookie Settings © 2023 Smithsonian Magazine\nPrivacy Statement\nCookie Policy\nTerms of Use\nAdvertising Notice\nYour Privacy Rights\nCookie Settings ",
    "title": "What the Heck Do I Do With Garlic Scapes? | Arts & Culture|\n Smithsonian Magazine",
    "url": "https://www.smithsonianmag.com/arts-culture/what-heck-do-i-do-garlic-scapes-180951722/"
}