{
    "text": "Fans often adore their idols from a distance, but some sasaeng – obsessed fans – take their love to a creepy, and at times, criminal level. In one case, a groupie broke into the house of a member from K-pop act TVXQ and took a photo By Dong Sun-hwa What makes some people get so obsessed that they turn into sasaeng – K-pop fans who pursue their idols to the point of not just offending them but making them feel threatened? “People, especially teenagers, in Korea are lacking opportunities to enjoy cultural activities, which I believe is one of the crucial factors that gave birth to the sasaeng phenomenon,” says Kwak Keum-joo, a professor of psychology at Seoul National University. Sasaeng means private life in Korean, but in this case it refers to obsessive fans. “In their early days, they mostly watched television and listened to K-pop, instead of enjoying a variety of hobbies such as playing instruments and sports. They often do not have other pastimes and hence they get obsessed with their only hobby to the degree that it inflicts damage on the stars,” he says. Kwak says the media is partly responsible for the phenomenon, as it focuses too much on hallyu – Korean pop culture – not allowing people to appreciate diversity. “Hallyu has apparently enhanced national prestige, as the case of boy band BTS shows – but it also gave rise to sasaeng and obsession, which I see as the downside of the hallyu fever.” Some sasaeng fans chase stars all day, while others wait for them in front of their homes. Such fans have been harassing stars since 1990s, as idol groups such as H.O.T. began rocking Korea. In one case, a fan broke into K-pop act TVXQ’s residence and took a photo, which they sent to the group. Sasaeng fans crashed the wedding of EXO member Baekhyun’s brother and took photos. Jackson Wang of K-pop boy band GOT7 was even involved in a car accident in 2016 because of a taxi containing sasaeng following the rapper. “Even among fans, they have competitions to stand out and to get more attention from the stars,” Kwak says. “They want to boast that they are ‘different’.” However, Kwak adds that even though they sometimes discover private information about the stars using inappropriate means, they usually do not reveal it because it could ruin the careers of their idols. In addition, they are also reluctant to share the information that they consider exclusive. Agencies often fear sasaeng will reveal sensitive information about K-pop stars. But as the sasaeng are considered superfans, the stars could lose followers if agencies treat them unfavourably. Legal action is not seen as the best solution. Stalking, one of the most common wrongdoings committed by the sasaeng, is considered a minor offence in Korea, attracting a fine of only 100,000 won (US$89). “Stars have to raise their voices if they want to bring about changes,” Kwak says. “This requires courage and could upset some fans. But still, they need to be firm and let the fans clearly know what is right and what is wrong.”  ",
    "title": "When K-pop superfans turn ugly – the dark side of the Korean pop culture phenomenon, where admiration turns to obsession | South China Morning Post",
    "datetime": "2018-08-06T22:00:28+08:00",
    "url": "https://www.scmp.com/culture/music/article/2158408/when-k-pop-superfans-turn-ugly-dark-side-korean-pop-culture-phenomenon"
}