{
    "text": "Chris Arnold Many Americans with 401(k) plans don't know if they're paying any fees. Pay too much, and it could take a chunk out of your nest egg.\n                \n                    \n                    Annette Elizabeth Allen/NPR\n                    \n                \nhide caption Many Americans with 401(k) plans don't know if they're paying any fees. Pay too much, and it could take a chunk out of your nest egg. Are the mutual funds you invest in efficient wealth generators or overpriced losers sucking money out of your retirement account with fees? It turns out most Americans don't know. We asked the members of NPR's Your Money and Your Life Facebook group, and most respondents said they had \"no idea\" if the investments in their 401(k)s or IRAs were \"good, bad or ugly.\" That holds true with broader surveys as well. \"Sixty percent of people don't know they're paying any fees at all in their 401(k) plan,\" says Laurie Rowley, president of the nonprofit National Association of Retirement Plan Participants. NPR asked her and other experts to explain how people can get their retirement portfolios in good shape. Get Out Of High-Cost Mutual Funds Rowley says people need to be aware that they are paying fees, and they need to find out how big those fees are. \"Fees make a huge, dramatic impact on your total savings nest egg,\" Rowley says. A 2 percent annual fee might sound small, but it eats up half of your earnings over 35 years. Review your plan and pick just a few of the lowest cost funds, Rowley says. Going Low If you don't look at the fees when you're picking mutual funds, you're basically making a blind guess at what seems good. You shouldn't be approaching your investments like a contestant on the classic game show, Let's Make A Deal. That's the one where contestants choose what's behind curtain number 1, 2 or 3. They might win a new car or get \"zonked\" when the curtain pulls back to reveal a pile of junk. \"You can definitely get zonked in a bunch of these plans,\" says Ian Ayres, a Yale law professor who studies excessive fees in 401(k) plans. \"Many plans offer funds that no reasonable person should invest in.\" He has studied thousands of 401(k) plans across the country and found that many have options that are like booby traps for unwary workers. \"These are rip-off funds,\" Ayres says. Therefore, he says, when you look at the funds offered by your employer's plan, \"avoid those that charge over 1 percent a year.\" He says if your plan has options with fees below 0.5 percent, those are the funds you want to pick. Ayres says that'll go a long way toward building up your nest egg over time. (For more detailed information on what a good retirement portfolio looks like, see this story in our series.) What If You're Stuck In A Bad Plan? Anybody can find out what fees they're being charged in their retirement plan by asking their employer. The plan provider has to give you that information by law, as well as a disclosure statement showing the annual fees or \"expense ratios\" for all the other investment options in the plan. So what can you do if all the options look expensive? Complain about it, Ayres says. He says he has seen some companies shop around and get better plans after employees pushed for a change. The site Brightscope.com rates 401(k) plans on a scale of 0 to 100 at thousands of companies. BrightScope CEO Mike Alfred says if your company has a bad rating, that might get the attention of upper managers if you point it out. \"You have a little more leverage as an individual if you go to the HR department and say, 'Look, I mean, this information is freely available on the Internet, and it shows that our plan is very expensive,' \" Alfred says. If that doesn't work, some people create a better retirement plan on the side. Both Ayres and Rowley say, fees aside, you want to save as much as you can; if your company offers a match, contribute enough there so you don't lose free money. You can put up to an additional $5,500 a year into an IRA; then you get to choose from the most competitively priced funds around. Sponsor Message Become an NPR sponsor ",
    "title": "When High Fees Stink Up Your 401(k), What Can You Do? : NPR",
    "url": "https://www.npr.org/2015/10/30/453163154/when-high-fees-stink-up-your-401-k-what-you-can-do"
}