{
    "text": "North Korea is doubling down on its culture war, warning citizens to stay away from all things South Korean – including its fashion, music, hairstyles and even slang. In the past decade, South Korea has emerged as a formidable cultural force, with products from makeup to K-pop and K-drama finding enthusiastic fans around the world. But one place trying to stop South Korean influence from permeating its borders is its neighbor to the north. For decades, North Korea has been almost completely closed off from the rest of the world, with tight control over what information gets in or out. Foreign materials including movies and books are banned, with only a few state-sanctioned exceptions; those caught with foreign contraband often face severe punishment, defectors say. Restrictions have softened somewhat in recent decades, however, as North Korea’s relationship with China expanded. Tentative steps to open up have allowed some South Korean elements, including parts of its pop culture, to seep into the hermit nation – especially in recent years, when relations thawed between the two countries. But the situation in North Korea is now fast deteriorating – and strict rules have snapped back into place, in a crackdown reminiscent of its earlier, more isolated history. North Korea isn't talking to the South anymore. Experts say it could be trying to manufacture a crisis Earlier this month, South Korean lawmaker Ha Tae-keung said after attending a briefing by the country’s spy agency that North Korea’s regime was implementing strict rules on how young people dress and speak. For instance, South Korean women often use the term “oppa” for their romantic partners – it’s now forbidden in the North. Instead, North Korean women must refer to their lovers as “male comrades,” said Ha. Propaganda videos in the country also denounce behaviors that show “foreign influence,” such as public displays of affection. Those who violate the rules are the “sworn enemy of the revolution,” Ha said, citing South Korea’s National Intelligence Service. Last Sunday, the regime blasted foreign ways of life in an article in state-run newspaper Rodong Sinmun, urging young people to be “faithful to the calling of their country.” “Struggle in the field of ideology and culture is a war without gunfire,” said the article, citing North Korean leader Kim Jong Un. Without specifically naming South Korea, it added that losing the culture war would “bring many times more serious consequences than on the battlefield.” Clothing, hairstyles and language were “a reflection of the state of thought and spirit,” it added. “Even if young people sing and dance, they should sing and dance to the melodies and rhythms that fit the needs of the times and the national sentiment of our people, and flourish our style of culture.” These restrictions may seem outlandish – but things like slang, innocuous on the surface, represent a much more complicated struggle over power and control, experts say. And North Korea’s tolerance for foreign influence is in constant flux, shifting alongside its economic wellbeing and international diplomacy. North Korea’s relationship with South Korea has remained fraught since the Korean War ended with an armistice in 1953. No peace treaty was ever signed, meaning the war never formally ended. North Korea had once been among the most industrially developed parts of East Asia, said Andrei Lankov, director of the Korea Risk Group and professor at Kookmin University in Seoul. But after decades of isolation, its people now live in grinding poverty. The North Korean economy spiraled downward in the 1990s after the collapse of the Soviet Union, which ended the flow of aid into the country, leaving China as the country’s biggest trading partner. By contrast, South Korea is Asia’s fourth-largest economy, with a GDP per capita on par with European nations like France and Italy. Its soft power has boomed as cultural exports like music, food and beauty products gained popularity around the world. That’s why North Korea is so wary of allowing any foreign influence such as South Korean slang, said Lankov – because it means “acknowledging that the alternative model of society worked, and the North Korea model did not.” North Koreans who adopt South Korean mannerisms – fashion, hairstyles, vocabulary – thus indicate two things, Lankov added: access to banned materials, and “an indication of admiration and sympathy” toward South Korea.” Why North Korea wants nothing to do with South Korea The potency of this soft power relies upon the vast inequity between the countries. People are dying of hunger in North Korea, where supply shortages mean the prices of some staple food items are skyrocketing. Kim has acknowledged the “tense food situation,” though he blamed it on a series of typhoons and floods. It’s not necessarily that North Korean leaders fear a mass uprising from a disgruntled public, said Lankov – the regime is “brutal” enough to punish “everybody who will dare to open his or her mouth.” But rising knowledge about the outside world, and about just how much worse things are in North Korea, could erode the regime’s legitimacy and its entire ideological framework – similar to how the clamor for Western goods in 1980s Soviet Russia contributed to public disillusionment and its eventual fall. “It absolutely does pose a threat if young North Koreans are watching South Korean dramas and seeing what life is like for Koreans outside their country, because they’re seeing images of Seoul, of how well they’re living, how freely they’re living,” said Jean Lee, senior fellow at the US-based Wilson Center and the former Pyongyang bureau chief for the Associated Press. And young people are the biggest target of the crackdown because they’re “the most vulnerable to new influences,” Lankov said. “Older people don’t want change … But all the new ideas are spreading among the younger generation.” Talks between the North and South have started and stalled numerous times over the years – and North Korea’s attitude toward foreign pop culture appears to have relaxed and hardened accordingly. After Kim assumed power in 2011, he initially favored a more liberal approach, said Lankov – even allowing some Western music, and forming an all-girl North Korean band. Lee, who was based in the capital Pyongyang during those early years, said foreign influences became apparent as the rules relaxed. North Koreans would casually drop South Korean slang as a “sly way to hint that they were watching South Korean dramas,” she said. Tourist attractions began to adopt English signage. Elite North Koreans were allowed to travel more, primarily to China. But Kim soon adopted a more conservative approach, and began cracking down on USBs and other technology that could be used to smuggle in information, said Lankov. Tensions escalated in 2016 and 2017 with a series of North Korean missile launches. But relations began thawing after South Korean President Moon Jae-in took office – by the end of 2018, Moon and Kim had vowed to formally end the Korean War and work toward complete denuclearization. That same month, Kim and his wife attended a rare concert of South Korean singers and performers in Pyongyang – the first time in more than a decade that South Korean musicians had traveled to North Korea. The same switch happens in the South too, Lee said, where North Korean products and culture become “trendy” during times of diplomacy, and taboo when tensions rise. “It’s the political climate that affects pop culture,” she added. But talks faltered in 2019 after a summit between Kim and US President Donald Trump fell apart, and communication ultimately broke down. By early 2020, the country completely shut its borders due to Covid-19, cutting off nearly all trade with China, its main economic lifeline. The state of North Korea’s economy often dictates its restrictions. And with the country in increasingly dire straits, the regime isn’t taking any risks. In December, North Korea passed a new law to prevent the spread of content not approved by government censors; this February, Kim suggested greater controls on societal content could be coming; the following month, a North Korean propaganda website accused K-pop record labels of “slave-like exploitation.” North Korea blasts K-pop industry as 'slave-like exploitation' amid crackdown on foreign media It’s impossible to say for sure what triggered Kim’s latest crackdown on foreign influence in the past two to three years, said Lee – but she added it could be linked to the border closures and extreme economic hardship. “Goods and people are not going across the border, so they can’t get the things that they want or crave, she said. “So what we know from this edict that was passed down is that they’re telling their people, stop craving that stuff. And (they’re) phrasing it in a way that’s about North Korean identity – let’s get back to our tradition, our language, who we are, and not be so covetous of foreign things.” But, she added, things can change quickly depending on the state of inter-Korea diplomacy. “The party is constantly changing the rules about what’s acceptable when it comes to foreign content, and the people have to pay attention,” she said. And the message now is: “There may have been a period where it was okay to covet these things, to crave these foreign goods. But it’s no longer okay.” © 2023 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network. ",
    "title": "Why North Korea thinks K-pop and youth slang can topple a regime | CNN",
    "datetime": "2021-07-24T01:14:54Z",
    "url": "https://www.cnn.com/2021/07/23/asia/north-korea-culture-war-kpop-intl-hnk-dst/index.html"
}