{
    "text": "Jung Soo-jung, better known as Krystal, is a lead vocalist and central dance performer of the K-pop girl group f(x). She turns 25 on October 24 – and is also this year celebrating 10 years in the entertainment spotlight. Krystal is not only a well-known K-pop celebrity, but also an actress in various K-dramas – a media-strafing approach which has helped her win over a wider share of global fans. Keep on reading to learn more about why Krystal has conquered millions of hearts and minds alike. International Beauty – ‘The Goddess’ Krystal and her group f(x) released their first single La Cha Ta in 2009. After her first stage performance, she won over legions of fans of all genders – both for her great performance, but also her stunning looks. Krystal’s beauty has been appreciated internationally. While shooting a K-entertainment programme f(x) Koala in Japan, in 2010, Krystal was “road-casted” by Japanese TV producers who didn’t recognise her as a celebrity, but were struck by her look while she was casually walking down the street. Although ultimately Krystal rejected the role, the spontaneous casting, based on her looks alone, surely demonstrates her striking beauty. Krystal was also cast as the first K-pop celebrity to act as a “Goddess of Beauty” in the K-drama series Bride of the Water God. Fans praised her role as a chic, gorgeous goddess. A native speaker of both Korean and English Krystal – whose official English name is Chrystal Soo Jung – was in fact born in San Francisco. She holds dual citizenship of both South Korea and the US. And after attending Seoul’s Korea Kent Foreign School, Krystal’s fluency in both tongues has helped her connect with fans worldwide. And it’s not just English that Krystal excels at academically. She currently attends Sungkyunkwan University (SKKU), one of Korea’s best universities, where she majors in Performance Arts (Acting) and is currently taking a gap year due to her celebrity career. Other celebrities to attend SKKU include Cha Eun-woo of Astro and Song Joong-ki. Success as an actress, singer and fashion icon? As a lead vocalist at the heart of f(x), Krystal has won numerous music awards. Over the 10 years of her musical career, Krystal and her group have always shown great performances in every album, with different concepts behind each release. Krystal however is not only a great singer but also an acclaimed actress. She won the Newcomer Comedy Award at the 2010 MBC Entertainment Awards in 2010, for her debut K-drama performance More Charming By The Day. Her performance career has also evolved offshoots into the fashion industry. Krystal has won various fashion awards for her well-known styles – and modelled for the likes of Japanese chain Uniqlo – even while her group was taking a break. The Jung Sisters – Jessica and Krystal Krystal and Jessica are the most well-known K-pop celebrity sisters. As they have both been celebrated for their outstanding beauty, they are often referred to as having the “Jung Genes” – named after their family name. The Jung Sisters are famous for having a close relationship. They often refer to each other during interviews and share common interests and personalities. The way they annoy each other often allows fans to feel more engaged with the sisters, a homely relatability which contrasts with their surreal celebrity looks. Krystal and Jessica have collaborated in various magazines and advertisements together, laying bare the sisterly synergy between the two. Want more stories like this? Sign up  here. Follow STYLE on  Facebook,  Instagram,  YouTube and  Twitter . K-pop star Krystal Jung of girl group f(x) celebrates 10 years in the spotlight this year. Sister of Jessica Jung of Girls’ Generation and one of the beloved ‘Jung Sisters’ – we chronicle the star who’s earned the nickname ‘The Goddess’ ",
    "title": "Why Krystal Jung, star of Jessica & Krystal, is K-pop’s true ‘Goddess’ of brains and beauty | South China Morning Post",
    "datetime": "2019-10-24T13:36:27+08:00",
    "url": "https://www.scmp.com/magazines/style/celebrity/article/3034353/why-fx-star-krystal-jung-k-pops-true-goddess-brains-and"
}