{
    "text": "Among the reasons fans give are the ‘everything cannot’ mentality of government officials and the way K-pop artistes treat their fans. PETALING JAYA: The death of K-pop star Kim Jong-hyun that triggered a public tribute in Kuala Lumpur has raised questions over why Malaysian youths are drawn to the K-pop culture more than local talents. Some have named this a “phenomenon” as the K-pop culture influence seems to be growing in Malaysia, especially among youths. There are local-based fan clubs and youths who have picked up the Korean language just to communicate with K-pop stars during fan-meets. Some even fly to South Korea to attend concerts there. The question remains as to why these youths are more attracted to artistes abroad than locally-bred talents. Speaking to FMT, an avid K-pop follower and former entertainment writer, Faie Kimi, 34, said there was too much unnecessary gossip circulated about local artistes. “I’m not saying they are perfect, but there isn’t so much scandal and gossip surrounding Korean artistes. Overall, they portray a positive image. “There aren’t many unique characters in the local music scene. It’s not that Malaysian youths are not interested, but there is a lack of local talents who are on par with international artistes,” she said. Another reason Faie gave was that K-pop artistes’ fan servicing was one of the best compared with local artistes. “That is one reason why many are attracted and are loyal fans. The artistes appreciate their fans and they make the effort to organise fan-meets. “For me, I was attracted to the K-pop culture because of the positive vibes they portray and the constant cheerful tone they set. “This got me interested to learn a new language. It even got me interested in their economic growth, how they excel in work and how they were once far behind Malaysia and today they are one of the leading countries in technology,” she said. In addition, Faie said there was also a narrow mindset among Malaysians. Hence the controversial comments over the recent vigil held by scores of fans in KL for the late K-pop star Jong-hyun who was believed to have committed suicide due to depression although he was at the height of popularity. “In Malaysia, nothing is allowed (semua tak boleh). It isn’t surprising that youths have shifted their attention to the artistic scene of other countries,” said Faie. Namewee has to show his talents abroad Faie’s explanation perhaps provides an insight into a lack of support for local talents, with the home ministry recently even “rejecting” popular local singer Namewee. Namewee, who is embarking on his “4896 world tour” concert series, had recently uploaded a video clip expressing his discontent over his concert application being turned down by the home ministry. In the video, Namewee said he and his concert organisers had recently applied directly to the ministry for permission to hold the concert. However, he claimed, ministry officials told him “not to submit” the application. “They didn’t reject me directly. Instead, they asked me not to submit my application, because according to them, if I had submitted my application and they had to reject it, it would be awkward. “They told me that something ‘big’ will be happening between February and April, so it would be inconvenient to have any concerts held then. “So they said it would be better if we don’t submit the forms,” said Namewee. The numbers “4896”, when pronounced consecutively, represent a homonym for a colloquial Hokkien phrase which means “very strong”. However, he said, it was really weird when he did checks online and found that K-pop stars, Jay Chou (Taiwanese singer) and also Jacky Cheung (Hong Kong artiste) would be here in January and February “I don’t understand why they didn’t allow me to submit my application. So, in conclusion, my concert will be nowhere in sight here in Malaysia. “I am really disappointed as I really wanted to come back and meet all my friends. “So for those of you who want to support my show, you can catch me at my second stop in Singapore (Feb 3, 2018). “I will be holding the concerts in other countries but they are very far away from Malaysia, so Singapore is the nearest,” he said. Namewee said his concert in Taipei had been well received. He added that he did not mind if Malaysians wanted to wait until the application was approved, but he expressed uncertainty about the approval for his concert in Malaysia. “I don’t mind if Malaysians want to wait but I really don’t know when it will be held and we were unable to submit the forms. “I have been away for the past two years working hard to promote Malaysia. “I hope the Malaysian government has taken note of what I have done. Please don’t judge me with preconceived ideas. Please stop putting labels on me unnecessarily. “I think everyone should have their freedom of speech and their moments when they express themselves. “I hope the government will approve my concert. At least they haven’t rejected me. There is kindness to be found everywhere,” he said. Namewee, whose real name is Wee Meng Chee, is a 34-year-old Muar-born singer-songwriter-rapper and filmmaker. He shot to fame in 2007 after releasing a controversial song titled Negarakuku, a remake of the national anthem of Malaysia. Namewee is known for his music videos that are commentaries on Malaysian current affairs. He was previously arrested over the sensitivity of his song lyrics but was not charged. In recent years, he has been making movies, including his first release, Nasi Lemak 2.0. He was invited to collaborate with notable Taiwanese pop-stars such as Leehom and G.E.M. The unsuccessful application for his 4896 concert tour will not be his first experience of “rejection” as his 2013 movie Banglasia was banned in Malaysia. The film premiere had to be moved to Singapore. Namewee may not be categorised as a mainstream artiste, but it is local talents like him who have created a sub-culture among youths. Unfortunately, this seems to be the “fate” of budding talents. Indirectly, such negative vibes appear to be deterring youths from “investing” their time and interest on local talents. Namewee courts controversy again with latest video  Namewee: Why run when I’m not guilty?  Street tribute for late K-pop star broken up by cops  M’sians slam mufti for criticising Muslims at candlelight vigil  ",
    "title": "Why Malaysians prefer K-pop, not local, talents | Free Malaysia Today (FMT)",
    "datetime": "2017-12-28T09:15:37+08:00",
    "url": "https://www.freemalaysiatoday.com/category/nation/2017/12/28/why-malaysians-prefer-k-pop-not-local-talents/"
}