{
    "text": "\"If you ask our daughters,\" she said in a frank interview on work-life balance, \"I'm not sure they will say that I've been a good mom.\" ASPEN, Colo.—While interviewing Indra K. Nooyi, the CEO of PepsiC0, at the Aspen Ideas Festival Monday*, David Bradley, who owns The Atlantic, asked two questions that elicited as frank a discussion of work-life balance as I've seen from a U.S. CEO. Below is a lightly edited transcript. The second question was preceded by a brief discussion of Anne-Marie Slaughter's \"Why Women Still Can't Have It All.\" Q. You come home one day as president of the company, just appointed, and your mom is not that impressed. Would you tell that story? This is about 14 years ago. I was working in the office. I work very late, and we were in the middle of the Quaker Oats acquisition. And I got a call about 9:30 in the night from the existing chairman and CEO at that time. He said, Indra, we're going to announce you as president and put you on the board of directors... I was overwhelmed, because look at my background and where I came from—to be president of an iconic American company and to be on the board of directors, I thought something special had happened to me. So rather than stay and work until midnight which I normally would've done because I had so much work to do, I decided to go home and share the good news with my family. I got home about 10, got into the garage, and my mother was waiting at the top of the stairs. And I said, \"Mom, I've got great news for you.\" She said, \"let the news wait. Can you go out and get some milk?\" I looked in the garage and it looked like my husband was home. I said, \"what time did he get home?\" She said \"8 o'clock.\" I said, \"Why didn't you ask him to buy the milk?\" \"He's tired.\" Okay. We have a couple of help at home, \"why didn't you ask them to get the milk?\" She said, \"I forgot.\" She said just get the milk. We need it for the morning. So like a dutiful daughter, I went out and got the milk and came back. I banged it on the counter and I said, \"I had great news for you. I've just been told that I'm going to be president on the Board of Directors. And all that you want me to do is go out and get the milk, what kind of a mom are you?\" And she said to me, \"let me explain something to you. You might be president of PepsiCo. You might be on the board of directors. But when you enter this house, you're the wife, you're the daughter, you're the daughter-in-law, you're the mother. You're all of that. Nobody else can take that place. So leave that damned crown in the garage. And don't bring it into the house. You know I've never seen that crown.\" Q. What's your opinion about whether women can have it all? I don't think women can have it all. I just don't think so. We pretend we have it all. We pretend we can have it all. My husband and I have been married for 34 years. And we have two daughters. And every day you have to make a decision about whether you are going to be a wife or a mother, in fact many times during the day you have to make those decisions. And you have to co-opt a lot of people to help you. We co-opted our families to help us. We plan our lives meticulously so we can be decent parents. But if you ask our daughters, I'm not sure they will say that I've been a good mom. I'm not sure. And I try all kinds of coping mechanisms. I'll tell you a story that happened when my daughter went to Catholic school. Every Wednesday morning they had class coffee with the mothers. Class coffee for a working woman—how is it going to work? How am I going to take off 9 o'clock on Wednesday mornings? So I missed most class coffees. My daughter would come home and she would list off all the mothers that were there and say, \"You were not there, mom.\" The first few times I would die with guilt. But I developed coping mechanisms. I called the school and I said, \"give me a list of mothers that are not there.\" So when she came home in the evening she said, \"You were not there, you were not there.\" And I said, \"ah ha, Mrs. Redd wasn't there, Mrs. So and So wasn't there. So I'm not the only bad mother.\" You know, you have to cope, because you die with guilt. You just die with guilt. My observation, David, is that the biological clock and the career clock are in total conflict with each other. Total, complete conflict. When you have to have kids you have to build your career. Just as you're rising to middle management your kids need you because they're teenagers, they need you for the teenage years. And that's the time your husband becomes a teenager too, so he needs you (laughing). They need you too. What do you do? And as you grow even more, your parents need you because they're aging. So we're screwed. We have no... we cannot have it all. Do you know what? Coping mechanisms. Train people at work. Train your family to be your extended family. You know what? When I'm in PepsiCo I travel a lot, and when my kids were tiny, especially my second one, we had strict rules on playing Nintendo. She'd call the office, and she didn't care if I was in China, Japan, India, wherever. She'd call the office, the receptionist would pick up the phone, \"Can I speak to my mommy?\" Everybody knows if somebody says, 'Can I speak to mommy?' It's my daughter. So she'd say, \"Yes, Tyra, what can I do for you?\" \"I want to play Nintendo.\" So she has a set of questions. \"Have you finished your homework?\" Etc. I say this because that's what it takes. She goes through the questions and she says, \"Okay, you can play Nintendo half an hour.\" Then she leaves me a message. \"Tyra called at 5. This is the sequence of questions I went through. I've given her permission.\" So it's seamless parenting. But if you don't do that, I'm serious, if you don't develop mechanisms with your secretaries, with the extended office, with everybody around you, it cannot work. You know, stay at home mothering was a full time job. Being a CEO for a company is three full time jobs rolled into one. How can you do justice to all? You can't. The person who hurts the most through this whole thing is your spouse. There's no question about it. You know, Raj always said, you know what, your list is PepsioCo, PepsiCo, PepsiCo, our two kids, your mom, and then at the bottom of the list is me. There are two ways to look at it. (laughing) You should be happy you're on the list. So don't complain. (laughing) He is on the list. He is very much on the list. But you know, (laughing) sorry, David. * The Atlantic co-hosts the Aspen Ideas Festival with the Aspen Institute. PepsiCo is an event sponsor.  ",
    "title": "Why PepsiCo CEO Indra K. Nooyi Can't Have It All - The Atlantic",
    "datetime": "2014-07-01T13:59:38Z",
    "url": "https://www.theatlantic.com/business/archive/2014/07/why-pepsico-ceo-indra-k-nooyi-cant-have-it-all/373750/"
}