{
    "text": "Sections How the fruit got a bad rap from the beginning K. Annabelle Smith  The deadly, deadly tomato. Photo Credit: *Kicki* via Compfight cc In the late 1700s, a large percentage of Europeans feared the tomato. A nickname for the fruit was the “poison apple” because it was thought that aristocrats got sick and died after eating them, but the truth of the matter was that wealthy Europeans used pewter plates, which were high in lead content. Because tomatoes are so high in acidity, when placed on this particular tableware, the fruit would leach lead from the plate, resulting in many deaths from lead poisoning. No one made this connection between plate and poison at the time; the tomato was picked as the culprit. Around 1880, with the invention of the pizza in Naples, the tomato grew widespread in popularity in Europe. But there’s a little more to the story behind the misunderstood fruit’s stint of unpopularity in England and America, as Andrew F. Smith details in his The Tomato in America: Early History, Culture, and Cookery. The tomato didn’t get blamed just for what was really lead poisoning. Before the fruit made its way to the table in North America, it was classified as a deadly nightshade, a poisonous family of Solanaceae plants that contain toxins called tropane alkaloids. One of the earliest-known European references to the food was made by the Italian herbalist, Pietro Andrae Matthioli, who first classified the “golden apple” as a nightshade and a mandrake—a category of food known as an aphrodisiac. The mandrake has a history that dates back to the Old Testament; it is referenced twice as the Hebrew word dudaim, which roughly translates to “love apple.” (In Genesis, the mandrake is used as a love potion). Matthioli’s classification of the tomato as a mandrake had later ramifications. Like similar fruits and vegetables in the solanaceae family—the eggplant for example, the tomato garnered a shady reputation for being both poisonous and a source of temptation. (Editor’s note: This sentence has been edited to clarify that it was the mandrake, not the tomato, that is believed to have been referenced in the Old Testament) But what really did the tomato in, according to Smith’s research, was John Gerard’s publication of Herball in 1597 which drew heavily from the agricultural works of Dodoens and l’Ecluse (1553). According to Smith, most of the information (which was inaccurate to begin with) was plagiarized by Gerard, a barber-surgeon who misspelled words like Lycoperticum in the collection’s rushed final product. Smith quotes Gerard: Gerard considered ‘the whole plant’ to be ‘of ranke and stinking savour.’… The fruit was corrupt which he left to every man’s censure. While the leaves and stalk of the tomato plant are toxic, the fruit is not. Gerard’s opinion of the tomato, though based on a fallacy, prevailed in Britain and in the British North American colonies for over 200 years. Around this time it was also believed that tomatoes were best eaten in hotter countries, like the fruit’s place of origin in Mesoamerica. The tomato was eaten by the Aztecs as early as 700 AD and called the “tomatl,” (its name in Nahuatl), and wasn’t grown in Britain until the 1590s. In the early 16th century, Spanish conquistadors returning from expeditions in Mexico and other parts of Mesoamerica were thought to have first introduced the seeds to southern Europe. Some researchers credit Cortez with bringing the seeds to Europe in 1519 for ornamental purposes. Up until the late 1800s in cooler climates, tomatoes were solely grown for ornamental purposes in gardens rather than for eating. Smith continues: John Parkinson the apothecary to King James I and botanist for King Charles I, procalimed that while love apples were eaten by the people in the hot countries to ‘coole and quench the heate and thirst of the hot stomaches,” British gardeners grew them only for curiousity and fo the beauty of the fruit. The first known reference to tomato in the British North American Colonies was published in herbalist William Salmon’s Botanologia printed in 1710 which places the tomato in the Carolinas. The tomato became an acceptable edible fruit in many regions, but the United States of America weren’t as united in the 18th and early 19th century. Word of the tomato spread slowly along with plenty of myths and questions from farmers. Many knew how to grow them, but not how to cook the food. By 1822, hundreds of tomato recipes appeared in local periodicals and newspapers, but fears and rumors of the plant’s potential poison lingered. By the 1830s when the love apple was cultivated in New York, a new concern emerged. The Green Tomato Worm, measuring three to four inches in length with a horn sticking out of its back, began taking over tomato patches across the state.  According to The Illustrated Annual Register of Rural Affairs and Cultivator Almanac (1867) edited by J.J. Thomas, it was believed that a mere brush with such a worm could result in death.  The description is chilling: The tomato in all of our gardens is infested with a very large thick-bodied green worm, with oblique white sterols along its sides, and a curved thorn-like horn at the end of its back. According to Smith’s research, even Ralph Waldo Emerson feared the presence of the tomato-loving worms: They were “an object of much terror, it being currently regarded as poisonous and imparting a poisonous quality to the fruit if it should chance to crawl upon it.” Around the same time period, a man by the name of Dr. Fuller in New York was quoted in The Syracuse Standard, saying he had found a five-inch tomato worm in his garden. He captured the worm in a bottle and said it was “poisonous as a rattlesnake” when it would throw spittle at its prey. According to Fuller’s account, once the skin came into contact with the spittle, it swelled immediately. A few hours later, the victim would seize up and die. It was a “new enemy to human existence,” he said. Luckily, an entomologist by the name of Benjamin Walsh argued that the dreaded tomato worm wouldn’t hurt a flea. Thomas continues: Now that we have become familiarized with it these fears have all vanished, and we have become quite indifferent towards this creature, knowing it to be merely an ugly-looking worm which eats some of the leaves of the tomato… The fear, it seems, had subsided. With the rise of agricultural societies, farmers began investigating the tomato’s use and experimented with different varieties. According to Smith, back in the 1850s the name tomato was so highly regarded that it was used to sell other plants at market. By 1897, innovator Joseph Campbell figured out that tomatoes keep well when canned and popularized condensed tomato soup. Today, tomatoes are consumed around the world in countless varieties: heirlooms, romas, cherry tomatoes—to name a few. More than one and a half billion tons of tomatoes are produced commercially every year. In 2009, the United States alone produced 3.32 billion pounds of fresh-market tomatoes. But some of the plant’s night-shady past seems to have followed the tomato in pop culture. In the 1978 musical drama/ comedy “Attack of the Killer Tomatoes,” giant red blobs of the fruit terrorize the country. “The nation is in chaos. Can nothing stop this tomato onslaught?” Get the latest Travel & Culture stories in your inbox. K. Annabelle Smith\n|\n\n| READ MORE K. Annabelle Smith is a writer based in Santa Fe, New Mexico who covers a wide variety of topics for Smithsonian.com. Her work also appears in OutsideOnline.com and Esquire.com. Explore Subscribe Newsletters Our Partners Terms of Use © 2023 Smithsonian Magazine\nPrivacy Statement\nCookie Policy\nTerms of Use\nAdvertising Notice\nYour Privacy Rights\nCookie Settings © 2023 Smithsonian Magazine\nPrivacy Statement\nCookie Policy\nTerms of Use\nAdvertising Notice\nYour Privacy Rights\nCookie Settings ",
    "title": "Why the Tomato Was Feared in Europe for More Than 200 Years | Arts & Culture|\n Smithsonian Magazine",
    "url": "https://www.smithsonianmag.com/arts-culture/why-the-tomato-was-feared-in-europe-for-more-than-200-years-863735/"
}