{
    "text": "They’ve helped South Korean stars dominate charts and break records on social media. Now, some K-pop fans are claiming another victory: helping foil United States President Donald Trump’s return to the campaign trail. K-pop fans are taking over 'White Lives Matter' and other anti-Black hashtags with memes and fancams of their favorite stars Ahead of his Saturday night rally in Tulsa, Oklahoma, Trump bragged that he had about 1 million RSVPs. But when the arena didn’t even reach its 19,000-person capacity, many people online were quick to give K-pop fans and TikTok users at least partial credit for the low turnout. Prior to the rally, people on social media platforms TikTok and Twitter encouraged people to register to attend Trump’s event – and not attend. One video, with more than 300,000 views, called on fans of South Korean mega group BTS in particular to join the trolling campaign. Following the rally, Democratic Rep. Alexandria Ocasio-Cortez tweeted at Trump campaign manager Brad Parscale, telling him he had been “rocked” by teens on TikTok flooding the Trump campaign with fake ticket reservations. “Kpop allies, we see and appreciate your contributions in the fight for justice too,” she added. It’s not clear how much of a role the social media campaign – or K-pop fans – had in the low turnout. Trump 2020 campaign manager Brad Parscale told CNN Sunday that “leftists and online trolls” who thought they had impacted rally attendance “don’t know what they’re talking about or how our rallies work.” He added bogus numbers had been weeded out, saying “these phony ticket requests never factor into our thinking.” But the fact that K-pop fans may have been involved shouldn’t come as a surprise – it’s part of a long history of social activism and charity work led by online devotees. In the past month alone, K-pop fans have used their vast social media networks to effect change. Earlier this month, K-pop fans drowned out racist voices by posting images of K-pop groups using anti-Black hashtags, such as #WhiteLivesMatter. After the Dallas Police Department asked people on Twitter to submit video of “illegal activity from the protests” to its IWatch Dallas app, K-pop fans flooded the app with fancams – or clips of K-pop idols – prompting the app to crash. And after popular boy band BTS donated $1 million to support the Black Lives Matter movement, BTS fan-based charity fundraising group “One In An ARMY” helped raise another $1 million for the cause. “Given the diversity of ARMY (the name of BTS’ fandom) and their oft-expressed strong desire to help others, it’s unsurprising that ARMY wanted to support the Black Lives Matter movement,” the group said in a statement at the time. To the uninitiated, good causes and K-pop might seem like an unlikely marriage. But K-pop fans have been doing good work for the community for decades, said CedarBough Saeji, a visiting assistant professor in Asian Languages and Cultures at Indiana University, Bloomington. In the world of K-pop, music stars are known as idols, and are expected to set an example of how to act in society. They inspire passionate fandoms – and in the past, some idols would receive thousands of gifts a day from their ardent fans, Saeji said. Around two decades ago, K-pop groups began asking their fans to stop sending gifts and instead give to charity, she said. Since then, K-pop fandoms in South Korea have done volunteer work and donated to charity in their idol’s name. Super Junior’s fans donated bags of rice to the Salvation Army, for instance, while Block B fans raised money to build a well in Cambodia, CNN affiliate SBS reported. This all had the effect of making the idol in question look like they were contributing to society – and portraying fans as more than obsessive devotees. BTS' army of admirers: Inside one of the world's most powerful fandoms “Fans practice such activities not only for local charities, but also as a way of promoting their stars,” Sun Jung, from the National University of Singapore, wrote in a 2012 research paper. She noted that, while K-pop fandoms can “create a nuisance” online, they can also lead to new forms of social activism. Even now, members of BTS’s ARMY are told not to give any gifts to the pop stars, aside from handwritten letters. At BTS concerts, there are often bins for donating goods to local charities, Saeji said. And as K-pop has gone global, international fanbases have continued that spirit of donating or doing good work in their idol’s name. In March 2018, BTS fan Erika Overton, a Brooklyn native in her late 30s, co-founded One In An ARMY, a fan collective which partners with non-profits to encourage the fandom to make small donations to a chosen cause. According to its website, the group has helped raise money to fund meals for Syrian refugees and formula for babies in Venezuela. Last year, Overton told CNN that she saw supporting projects to help those in need as a natural extension of being a BTS fan. “They put a lot of effort into giving us of themselves and their music and their sincerity … the ARMY really wants to give back in their name.” While there are some groups – such as One In An ARMY – which come together for social causes, much of the work K-pop fans do isn’t through an organized chain of command. Why the past decade saw the rise and rise of East Asian pop culture K-pop fandoms unite organically to get their idol’s name to trend on Twitter on their birthday, or stream their favorite band’s songs and videos as many times as possible so they get to the top of the music charts. The go-to space tends to be Twitter, meaning fans understand how to use algorithms to achieve their goals. It’s not a big leap to use that same process of organizing online for social issues. “It is literally just people who are in contact with people through social media,” Saeji says. “This is happening naturally.” In the US, K-pop fans tend to be outward-looking and progressive, and many are people of color or members of the LGBTQ community, Saeji said. Given that, it’s not surprising that K-pop fandoms would be active in their support of Black Lives Matter – or opposing Trump. The real takeaway from K-pop fans’ recent successes isn’t necessarily the power of K-pop fandoms, but the power of young people, says Saeji. “Young people today know how to organize online,” she said. “They do have political opinions and they are interested in politics and making political change.” CNN’s Alicia Lee and Donie O’Sullivan contributed reporting. © 2023 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network. ",
    "title": "Why K-pop fans being credited with disrupting Trump's rally shouldn't be a surprise | CNN",
    "datetime": "2020-06-22T07:35:52Z",
    "url": "https://www.cnn.com/2020/06/22/asia/k-pop-fandom-activism-intl-hnk/index.html"
}