{
    "text": "Agenda-setting intelligence, analysis and advice for the global fashion community. SEOUL, Korea — Missile tests are cooling relations between China and South Korea and the impact is being felt in some unlikely places. When South Korea decided to deploy a US Terminal High-Altitude Area Defense (Thaad) anti-missile system last month, policy makers in Beijing were angered. Chinese officials viewed the Thaad deployment as another American effort to contain China, arguing that the shield, designed to protect the South against North Korea’s nuclear threat, covered more Chinese territory than both the Koreas combined. And despite President Obama’s response to the contrary after last week’s G20 Summit, China remains unconvinced. “While not necessarily provocative in spirit, these missiles are viewed as alarming to China, as South Korea is a close ally and beneficiary of the US, China’s chief international ‘frenemy,’” explains Brian Buchwald, co-founder and chief executive of consumer intelligence firm Bomoda. Now, signs of retaliation have emerged, with China taking aim at South Korea’s prize cultural exports, namely K-pop and its hugely popular Korean television shows. “The Chinese government has cancelled virtually all public and television appearances for Korean stars,” says Buchwald. Indeed, since August, Jiangsu television network has blurred the images of some K-pop stars on TV, including Gangnam Style’s Psy and boy band iKon. Meanwhile, a fan meet-up event in Beijing with celebrities Kim Woo-bin and Suzy Bae of the South Korean drama “Uncontrollably Fond” was reportedly postponed without further explanation. The phenomenon known as Hallyu, or \"Korean Wave,\" is huge in China. Since the early 2000s, what Korean pop stars eat, wear and use has had a big influence on Chinese consumers, some of whom spend their time in South Korea visiting spots where popular K-drama series are filmed, buying Korean cosmetics and eating local food. Its youth culture and the pop music and TV celebrities have become incredibly powerful in China and Japan. At $280 billion a year, South Korea’s trade with China is significant. “The whole Korean culture effect, from travel, entertainment and food to fashion and beauty, has made most things ‘from Korea’ popular,” says Deborah Cheng, vice president of marketing at I.T., a multi-brand fashion retailer in Hong Kong, which stocks Korean labels, such as Stylenanda, J Koo, Kye, Steve J & Yoni P, and Juun J. Hallyu has also boosted South Korea’s popularity as a tourist destination, with over 13 million visitors entering the country in 2015, with China the leading source of visitors, accounting for 5.9 million tourists, according to the Korea Tourism Organisation. Growing dependence on the Chinese market means that China’s recent displeasure matters greatly to South Korean firms. “A potential ban on South Korean imports to China would be huge. South Korea is a ‘net-exporter’ of goods and is much more reliant on this practice than neighbours like Japan. As approximately one quarter of South Korea’s exports are destined for China, any shakeup in this relationship could yield a nosedive for South Korea’s economy,” says Buchwald. Thanks to their influence on the Chinese market, K-pop stars are now valuable commodities to global luxury brands as well as Korean companies. Chanel, Gucci, Swarovski, Alexander Wang, Moschino and more have previously worked with K-pop stars and provided them with front row seats at their fashion shows. \"Today, South Korea is the most influential country in Asia, with its energy and creativity, its youth culture and the pop music and TV celebrities, who have become incredibly powerful in China and Japan,\" said Bruno Pavlovsky, president of fashion at Chanel, which offered front row seats to \"Stairway to Heaven\" actress Park Shin-hye and Big Bang band members G-Dragon and Taeyang at its Resort 2015 show in Seoul. Seen from this perspective, the ripple effect of souring relations between China and South Korea could have serious implications for global fashion and luxury brands. Lane Crawford, which has department stores throughout China and Hong Kong, sells Korean menswear brands such as Woo Young Mi and earlier this year, in April, announced they would start selling Korean womenswear. “However, with the tightening of government approval on Korean artists’ appearances and events, and the possible restriction of Korean TV and movie distribution in China, the influence of Korean culture may cool off a bit and the craze for Korean products will eventually lessen due to the lack of promotion and overexposure,” says I.T.’s Cheng. AmorePacific has already been hit with the consequences. Shares of the South Korean cosmetics manufacturer, which houses over 26 brands including Sulwhasoo, Etude House and Laneige, fell more than 4 percent after China’s opposition to Thaad, losing more than 1 trillion won (almost $886 million) in value in just one day. While AmorePacific’s makeup brands have entered parts of Southeast Asia and the US over the past year, sales from these locations are meagre compared to those from China. Meanwhile, shares of other South Korea companies that rely on Chinese demand have fallen amid strained relations between the two countries. Talent agencies SM Entertainment, parent company of Girls’ Generation, and YG Entertainment, which received an $80 million investment from LVMH’s Asia capital arm in 2014, have seen their share prices slide by over 20 percent since July. According to Chaebul, Korea’s leading stock website, the dispute with China has caused more than 160 billion won ($141.8 million) of damage to the leaders of South Korea’s top-tier entertainment companies thus far. The craze for Korean products will eventually lessen due to the lack of promotion and overexposure. But it’s not the first instance in which China has been involved in a diplomatic dispute affecting trade ties. Political relations between China and Norway were strained in 2010 after the Nobel Peace Prize was awarded to dissident Liu Xiaobo and salmon exports from the Nordic country to China were discontinued for the next five years. Japan’s contested claim of islands also claimed by China threatened its trading relationship with China in 2012. The diplomatic discord led to Chinese protesters ransacking Japanese retailers, smashing storefronts and setting fires to cars and even a Panasonic Corporation plant.  During this period, Fast Retailing closed 42 of its Uniqlo stores in China. The question many market observers want answered now is how long the current tensions could last and their impact on industries dependant on South Korea’s Hallyu phenomenon. According to Bomoda’s Buchwald, China’s attitude is “pervasive” and a grudge against South Korea is “unlikely to dissipate in 2016.” “More rounds of sticks and carrots can be expected from Chinese leadership,” agrees Dr Kent Deng, associate professor in economic history at the London School of Economics. “It’s necessary for China to keep countries like South Korea on their toes. But China will be very measured. If it sees the danger of losing South Korea completely to the US, China will compromise. Their ultimate goal, really, is to keep the US off the Western Pacific.” Nonetheless, that doesn’t mean that Hallyu’s impact won’t remain in the long run. “South Korean culture has been a major influence on the Chinese, especially its youth. As they grow older, they will certainly have had imbued in them an appreciation of South Korean music, art and fashion, which they’ll pass onto their kids and so on,” says Buchwald. “Despite the sabre-rattling, both China and South Korea gain significantly from the current relationship,” Buchwald continues. “My advice to South Korean entrepreneurs and investors is to stay the course. Near term volatility is a reality. But those are also the moments that separate out true businesses from the pretenders. It may mean operating more leanly or growing more slowly, but it’s no reason to walk away.” Related Articles: [ South Korea, Climbing the Ranks of Asia's 'A League' ] [ Decoding Chanel’s South Korean Spectacle ] © 2023 The Business of Fashion. All rights reserved. For more information read our Terms & Conditions At the latest edition of China’s top fashion week, brands adapted their designs for a more value-minded shopper as retail buyers prepared for a softer local market. As the country’s economy moves into deflationary territory, manufacturing output declines and a real estate crisis worsens, some consumers are becoming increasingly cautious. Its flagship brand struggled following the departure of its creative director but better growth was seen at other labels. After years of outsized growth in prestige cosmetics, consumers have pulled back on the typically recession-proof category. The essential daily round-up of fashion news, analysis, and breaking news alerts. Our newsletters may include 3rd-party advertising, by subscribing you agree to the Terms and Conditions & Privacy Policy.   ",
    "title": "Will China Burst the K-Pop Bubble? | BoF",
    "url": "https://www.businessoffashion.com/articles/china/china-south-korea-kpop-bubble-burst-thaad-missile/"
}