{
    "text": "Will South Korean K-pop sensation BTS perform in North Korea next year? The ruling Democratic Party of Korea (DPK) certainly wants it to happen. The party’s National Assembly’s Culture, Sports, and Tourism Committee chairman Ahn Min-suk said this week the DPK is keen to expand inter-Korean exchanges. “The committee will push forward the idea of BTS hosting a concert in Pyongyang sometime next year,” Ahn told KBS Radio 1 on Wednesday. “We have to explore all possible paths – such an exchange in the fields of culture, sports and art is achievable if the two Koreas cooperate without considering other concerned nations. “Hence, I regard it is an assignment of our people to have an enthusiastic culture, sports and art exchange together before the sanctions against the North are lifted.” BTS’s agency, Big Hit Entertainment, did not react to Ahn’s comments. According to Han Song-yi, a North Korean defector who runs an online broadcasting channel in South Korea, the boy band are popular in the North. She said fans exchange up-to-date information about BTS using “secret codes” to avoid the regime’s crackdown on South Korean cultural content. BTS, which rewrote K-pop history by conquering the Billboard 200 albums chart in the United States, had a heroic homecoming in October after a hectic overseas schedule. The band will embark on an Asian tour next week. Want more stories like this? Sign up  here. Follow STYLE on  Facebook,  Instagram and  Twitter The boy band behind hits ‘Blood Sweat & Tears’, ‘Save Me’ and ‘Fake Love’ have been targeted by officials from Pyongyang as relations between the neighbours continue to improve ",
    "title": "Will South Korea’s K-pop stars BTS perform in North Korea next year? | South China Morning Post",
    "datetime": "2018-11-10T14:04:31+08:00",
    "url": "https://www.scmp.com/magazines/style/news-trends/article/2172447/will-south-koreas-k-pop-stars-bts-perform-north-korea"
}