{
    "text": "Read The Diplomat, Know The Asia-Pacific BTS joining the Korean military is a compulsory obligation, one with increased meaning as tension builds on the Korean Peninsula and around the world. Fans of South Korean K-pop band BTS show their postcards of BTS member Jin as they arrived for the concert “BTS Permission to dance on stage-Seoul” at Seoul Olympic stadium in Seoul, South Korea, Thursday, March 10, 2022. On March 24, 1958, Elvis Presley joined the U.S. Army and history will rhyme again in late 2022 when BTS abandons their fandom army to “accept the call of duty” and join the South Korean military. The collaborations, the tours, the fan meetups, and most importantly, the climb on the Billboard charts and pictures with Lady Gaga will all halt in the interest of national service. Much of the world will cry, literally, due to the intense devotion of their large fanbase. BTS joining the South Korean military is a compulsory obligation, one with increased meaning as tension builds on the Korean Peninsula and around the world. Even Germany has restarted conversations about mandatory military service in light of the war in Ukraine. While the world has been focused on Russia, North Korea increases its belligerence and seems closer than ever to resuming testing nuclear weapons while increasing ballistic missile tests. BTS’s contribution to the defense of Korea might be minimal in material fact, but their service will likely result in a massive boost in national pride and natural enlistments, demonstrating a very different form of the Korean cultural wave, Hallyu. The soft power of cultural attraction offered by K-pop will transform into something very unique when directed domestically. National Service and Entertainment Get briefed on the story of the week, and developing stories to watch across the Asia-Pacific. Of course, having larger-than-life pop culture figures serve in the military at the height of their fame is not new. Elvis served for a little under two years in Germany. At the time, Elvis was basking in the success of “Jailhouse Rock” and shooting “King Creole.” The everlasting musical “Bye Bye Birdie” mimics the hysteria of Elvis entering military service with the plot focused on Conrad Birdie (a stand-in for Elvis) getting “one last kiss” from a fan. Elvis noted at the time, “It’s a duty I’ve got to fill and I am going to do it.” Enjoying this article? Click here to subscribe for full access. After his service ended in 1960, Elvis released the album “Elvis is Back” and later that year he starred in “G.I Blues,” a quasi-recreation of his time in the service. His career continued unhindered, but service might have accelerated his descent into drugs, which started during that period. Another prominent example is Ted Williams, who joined the U.S. Navy, choosing the Marine Corps, in the prime of his career. He served for three years during World War II and was recalled into service for the Korean War. Williams’ Hall of Fame statistics are impressive but losing over four years during his prime could have had a potentially devastating impact on his long-term place in the record books. Yet, this is not how Williams remembers the issue, remarking once, “People will tell me what a shame it was I had to go back into the service a second time, but I’m kinda glad I did… Besides, I am a U.S. Marine and I’ll be one till I die.” BTS will be challenged in similar ways, hopefully not by war, but by the interruption of their careers at a prime moment. Continued success touring, in record sales, and awards will all come to a dramatic halt during their service, which will last at minimum 18 months. A New Form of Hallyu Soft power is a form of power projection that depends on cultural attraction rather than blunt military force. Hallyu is the Korean Wave, a massive government-supported project of projecting South Korean cultural power (K-culture) to the world through K-dramas, K-pop, and K-food. The overall renaissance of Korean culture after the economic collapse of the late 1990s is now even challenging China and the U.S. for influence throughout Asia. Yet, Hallyu is an externally directed expression of international cultural power. Through the immense economic success of South Korea and even their tight victory against COVID-19, Korea is experiencing a total renaissance globally with Korean actors, models, and chefs all in high demand. V from BTS made the darling of American pop music, Oliva Rodrigo, blush during the band’s recent Grammy performance. The members of Blackpink took Paris fashion week by storm. Twice toured the U.S. to sold out venues, far surpassing prior tours by all K-pop girl bands. And groups few average pop fans have heard of like NCT Dream, IVE, Loona, and the Stray Kids are all conquering the Billboard Charts in 2022. Now it’s time to look inward. The conflict in Ukraine demonstrates the potential devastation unleashed on modern cities in total war and the utility of a rapid, technologically capable defense to destroy a massed aggressor. Everyone from teachers, lawyers, and former boxing champions have been central to the defense of Ukraine. If South Korea was ever invaded by the North, much of the same process would be critical for national survival. While a draft is unimaginable in the United States, maintaining a system of national service – even though it can be considered modern day slavery – is critical for enabling South Korea’s defense. As Morris Janowitz once noted, the concept of a citizen-soldier depends on obligatory service to enable deterrence. As a counter, Ronald Krebs argued that the faith in military service to build a nation might be misplaced as the stated benefits (including socialization of norms, contact with society, and the transformation of elites) all produced mixed empirical results. Furthermore, Insook Kwon analyzed in detail how men’s conscription serves to construct a range of masculinized privileges in South Korea. With both positive and negative impacts, mandatory military service can transform and divide a nation at risk. In any case, national service is not an antiquated notion given the realities of geopolitics. The Process of National Service Enjoying this article? Click here to subscribe for full access. South Korea’s Constitution states that “All citizens shall have the duty of national defense.” By law,  every able-bodied Korean man is obligated to start serving in the military from the year in which he turns 18. The age to enter service depends on various factors –  including education –  but normally Koreans sign up by the year in which they turn 28 at the latest. In December 2020, the month in which BTS’s oldest member, Jin, turned 28, an amendment was introduced in the Military Service Act that allows some artists that excel in popular culture to postpone their mandatory service. A presidential enforcement decree now stipulates that artists that received a decoration in the Order of Cultural Merit  can request to delay their service by two years. Thus far, BTS is the only K-pop band that has received such an award, as recipients of the fifth-class Hwagwan Order of Cultural Merit in 2018. Time is running out for Jin, who turns 30 at the end of the year. Amendments have been debated countless times with recent efforts to apparently get President-elect Yoon Suk-yeol to exempt BTS falling on deaf ears. BTS’s company and backer, HYBE, has been left to manage the situation. It appears more than likely that BTS will enter service sooner rather than later. HYBE has urged the Korean Parliament to make a decision by May 10 when President Moon Jae-in’s term ends, to avoid “endless discussion.” Yonhap News Agency recently noted that society is torn over the question and that BTS abdicating their duty might alienate the population. In principle, all Korean men – including the Kings of K-pop – should be treated equally and take pride in serving. Notoriously, Korean entertainer Steve Yoo took U.S. citizenship in 2002 to avoid military service and was swiftly deported for desertion a year after winning the Dance Music Award at the MNet awards. More is at stake than just the status of BTS. HYBE is a publicly listed corporation that witnessed dips in its stock with news that BTS might be entering military service. It is estimated by the Hyundai Research Institute that BTS’s contribution to the South Korean economy was valued at $3.54 billion in 2018 and a Harvard Business Review case study in 2020 suggested the value is as much as $4.9 billion. While there are allowances made for some athletes, classical musicians, and others, music idols have always been made to complete their military service. And BTS appears willing to accept their fate. Jin called conscription an “important duty for our country,” adding that “when duty calls – we’ll be ready to respond and do our best.” The business risks for BTS are high, after impressive sales for two recent tours in the U.S. since the restrictions of the pandemic. Much of the income for artists comes through touring and the resulting merchandise sales. But BTS can minimize this harm by banking a series of songs, possibly filming videos and recording songs while on leave like Elvis did, hopefully avoiding the errors of Psy, of Gangnam Style fame, who was re-drafted after being found negligent in his duties at a software company he worked at in lieu of military service, for holding concerts and appearing on variety TV shows. BTS could release a movie, or drama, all filmed before entering the service, and they could re-emerge by telling the story of their service to their devoted fans. Duty and Hallyu It is likely that BTS will emerge from military service even stronger, possibly gaining perspective and a break from fame where they can focus on extending their productive artistic lives, writing songs, and developing the complex choreography they are known for, all from the barracks. With re-emergence and success, BTS will provide its greatest boost for Korean society by demonstrating that it is possible to serve both the nation and the self, that both ideals are complementary. If Hallyu is going to work as an external strategy of influence, it must work domestically too. Without domestic support the entire K-pop industry falls apart since it is a system dependent on Korean talent and staff even if the song writers and idols are becoming increasingly more international. These are not frivolous questions and challenges. Geopolitics has been altered over time by popular culture. The central question of duty remains: duty to whom? The self, the fans, the culture, or the nation? Being an example of a selfless member of society willing to risk it all for the state will likely be immensely beneficial to the Korean national mythology. North Korea can produce all the slick videos of the latest missile launch they want while the Korean military will have BTS and all the other dominant K-pop acts that will follow their sunbaenims (elders) into service. Brandon Valeriano is a senior fellow at the Cato Institute and a senior distinguished fellow at the Marine Corps University. He currently stans Loona and is trying to learn Itzy’s shoulder dance to no avail. Aleydis Nissen is an FWO and F.R.S.-FNRS research fellow at Leiden University, VUB and ULB. She previously discussed the meaning of BTS’s lyrics.          ",
    "title": "Will BTS Join the Real Army? – The Diplomat",
    "url": "https://thediplomat.com/2022/05/will-bts-join-the-real-army/"
}