{
    "text": "K-pop juggernaut BTS staged gigs in 23 cities around the globe during its world tour this year, but the seven-piece band did not perform in one rather noteworthy neighbouring country – China. The 2019 Cannes-winning comedy-thriller Parasite, by South Korean auteur Bong Joon-ho, was to be screened at a Chinese film festival in July, but China suddenly called it off due to a “technical reason”. These are just a few examples of China's “unofficial” restrictions on hallyu, or Korean culture, imposed since 2016. It is believed to be part of Beijing's retaliation against Seoul triggered by a dispute over deployment of a US missile defence system – the Terminal High Altitude Area Defence (THAAD) – on Korean soil. China saw the deployment as “threatening” to its national security. But Korea set up the system in Seongju, North Gyeongsang Province, in 2017. In the aftermath, Korean films, dramas and concerts were practically banned in China. “China today aims to boost its domestic entertainment industry with its own strength. It has received help from Korean culture and joined forces with Seoul to foster its own industry, but now it believes the country has already gained a foothold to stand alone. Hence, Beijing thinks hallyu is unnecessary for them.” Nevertheless, hallyu's resurgence in China is still in doubt and recent events are not signs of an easing of restrictions, according to an expert and an industry source. China’s top diplomat, Foreign Minister Wang Yi, also visited Seoul but didn't give any indication that China would lift the constraints. The cause of the crackdown “THAAD seems to be a pretext for the restrictions,” said Lim Dae-geun, a professor of Chinese cinema studies at Hankuk University of Foreign Studies (HUFS). “The gist of the matter is the Chinese government's overall stance and attitude toward foreign cultures. Unless China changes its tune, it will be challenging for hallyu to enjoy the popularity it did before 2016. “China today aims to boost its domestic entertainment industry with its own strength. It has received help from Korean culture and joined forces with Seoul to foster its own industry, but now it believes the country has already gained a foothold to stand alone. Hence, Beijing thinks hallyu is unnecessary for them.” A K-pop music label official, who asked not to be named, also thinks China looks “indifferent to the hallyu constraints”. He said China has been paying more attention to disseminating its own culture. In fact, the quality of Chinese cultural content is known to have evolved rapidly, with numerous creations such as the sci-fi blockbuster The Wandering Earth (2019), made by filmmaker Frant Gwo, earning international acclaim. Many say China, which has long dreamt of conquering the global content market, will realise its dream soon and become the next cultural icon of Asia. “Regarding the K-pop stars' fan signing events in China, they are merely small-scale occasions inviting hundreds of people, which don't need the Chinese government's permission to take place,” the official said. “We still cannot get acceptance from the government when it comes to large-size hallyu events.” According to Lim, another rationale behind the restrictions is the underlying ideology detected in Korean content. “Hallyu is a blend of American, Japanese and Hong Kong culture, which is based on capitalism,” he said. “Thus, hallyu content implicitly contains American and Western ideas such as political democratisation, social justice and gender issues. China wants to block the 'reckless' entrance of such content that it believes problematic, knowing the influence of pop culture could be tremendous.” Some Korean content makes it through the net, such a recent festival screening of the 1993 film Seopyeonje, an award-winning movie revolving around a family of “pansori” (traditional Korean musical storytelling) singers. “In fact, China has recently been accepting less ideological content from Seoul,” added Lim. “The government presumably found [Seopyeonje] unproblematic, because it merely discloses Korea's traditional culture.” Fresh strategies For Korean entertainers, the Chinese market is too lucrative to give up on pursuing, but there may be other strategies that can be employed to earn access to Chinese capital. “China has been setting its sights on Southeast Asian markets and has been taking part in various cultural cooperation projects with nations like Thailand and Indonesia,” Lim said. “Hence, Korea could join this 'team.' Seoul could form the trilateral cooperation system without coming to the forefront to re-enter the Chinese market.” Hong Kong and Taiwan could also function as “bridges” to China, according to Lim. But as of now, the situation has become complicated by Hong Kong’s ongoing anti-government protests. Lim says there are other opportunities in the pre-production and post-production markets. “We don't have to sell or export solely finished products made in Korea,” he said. “In terms of movies, Korean writers can sell their scenarios to Beijing and the technicians can do their bit in the editing of the Chinese flicks. “Another tactic is to keep an eye on the distribution of Chinese content in Korea. Although it is not about exporting hallyu, we can still make profits by assisting the distribution of process in Korea.” Want more stories like this? Sign up  here. Follow STYLE on  Facebook,  Instagram,  YouTube and  Twitter . K-pop, K-drama and ‘hallyu’ pop culture has taken the globe by storm in 2019, but next-door neighbour China tightly restricts Korean artists’ access – do recent visits by Winner, Got7 and Seventeen suggest thawing diplomatic relations? ",
    "title": "Will BTS ever perform in China? How K-pop and Korean culture is being kept out of Asia’s largest market | South China Morning Post",
    "datetime": "2019-12-06T16:53:39+08:00",
    "url": "https://www.scmp.com/magazines/style/celebrity/article/3040955/will-bts-ever-perform-china-how-k-pop-and-korean-culture"
}