{
    "text": "Frank Langfitt The video for PSY's new song, \"Gentlemen.\" There was another big story on the Korean peninsula over the weekend, but it wasn't about the guy in the north with the missiles and the threats. No, this story was about the guy in the south with the shades and the goofy dance moves, South Korean K-Pop star PSY. The singer released a new video at a concert Saturday in Seoul for his song \"Gentleman,\" the follow-up to his monster hit \"Gangnam Style,\" which at last count had been viewed more than 1.5 billion times on YouTube. Tens of thousands of people converged on the city's World Cup stadium for the show, excited to hear his new song and see the new video. PSY has been under pressure in South Korea to see if he can follow up the phenomenal success of \"Gangnam Style.\" \"I have really high expectations for how this one is going to turn out,\" Lee Han Sun, a 33-year-old power plant engineer, said as he headed inside with 50,000 other PSY fans for the sold-out concert. \" 'Gangnam Style' had such a huge impact, and I expect this one to have an even larger one.\" The audio for the single, \"Gentleman,\" came out Saturday morning, and Lee likes what he's heard so far. But he was waiting on the key element: the video. Some here wonder if PSY — or anyone — can match the success of \"Gangnam,\" which took Korean pop, also known as K-Pop, global. Even Lee worries that PSY could become a global one-hit wonder. \"I heard the new single and, honestly, I don't know,\" Lee said, thinking more like a critic than a fan. \"I think maybe there's a 30 percent chance it will flop.\" By Sunday morning, millions had seen the video. Reaction in Gangnam — the wealthy, fashionable district in Seoul that PSY parodied with his absurd, lassoing, horse-riding dance — was mixed. At a Gangnam mall, Kim Kyung Ah, a 21-year-old film student at Seoul's Dong Kuk University, sat with her boyfriend around the corner from a Baskin-Robbins. She said the new video — full of hip-thrusting, slapstick and big dance numbers — was similar to \"Gangnam\" and a bit of a letdown. \"Because PSY was a big hit internationally, I had this expectation that he was going to produce something of quality that befits his reputation,\" Kim said. \"But he copied this one dance move from a famous girl group, so I thought it wasn't as fresh as I expected.\" Kim's boyfriend, Lee Ju Yong, a freelance photographer who is from Gangnam, agreed. He also thought the new video had too much product placement. Some overseas viewers found some of the video's crude humor, such as PSY unsnapping a woman's bikini top, offensive. Although the new video did not live up to their expectations, the couple are still PSY fans, and Kim is proud of what PSY has done to boost their country's image. \"He's promoting Korea to the rest of the world,\" she said, \"and spreading K-Pop.\" That is a lot more than can be said for that guy with the missiles up north. Sponsor Message Become an NPR sponsor ",
    "title": "Will Lightning Strike Twice For K-Pop's PSY? : NPR",
    "url": "https://www.npr.org/2013/04/14/177204417/will-lightning-strike-twice-for-south-koreas-psy"
}