{
    "text": "Stanford University The Walter H. Shorenstein Asia-Pacific Research Center is part of the Freeman Spogli Institute for International Studies This essay originally appeared in Korean on August 1 in Sindonga (New East Asia), Korea’s oldest monthly magazine (established 1931), as part of a monthly column, \"Shin’s Reflections on Korea.\" Translated by Raymond Ha. A PDF version of this essay is also available to download. In June, I was contacted by the staff of “60 Minutes” at CBS. They were interested in producing an in-depth analysis of how the Korean Wave, also known as K-culture or Hallyu, became a global phenomenon. While press coverage of K-pop and K-dramas is now commonplace, they added, there has not yet been a comprehensive and systematic treatment of the subject in the U.S. mainstream media. They had caught wind of the Stanford Korea Program’s May conference, which addressed North Korea issues and the Korean Wave, and they asked me for help in reaching out to experts and practitioners in Korea’s music, entertainment, and beauty industries, as well as to relevant government officials. In planning the 20th anniversary event for the Korea Program at Stanford’s Shorenstein Asia-Pacific Research Center (APARC), we chose to focus on North Korea and the Korean Wave for good reason. These two topics are the main gateways through which students and the American public become interested in Korean Peninsula issues. Instead of hosting a conventional academic conference, we wanted to celebrate the occasion by inviting a diverse group of academics, students, policymakers, and artists to discuss timely issues that would attract the greatest public attention. The conference drew much more interest than we could ever have hoped for. From the moment we opened online registration for attendees, there was a flood of students and outside participants who were eager to attend. On the day of the conference, Stanford’s communications team, as well as our own team at APARC, publicized the event on Twitter. The sheer excitement of students and fans who had come to see Suho, the leader of K-pop group Exo, created a unique atmosphere that no one would expect to witness at an academic conference.[1] (I should note that Suho came to discuss K-pop as a panelist, not to give a performance.) K-pop has seized the attention of the American public, and the interest in the Korean Wave from the staff at “60 Minutes” is only one indication of this trend. Next year, it will have been 40 years since I arrived in Seattle to begin my graduate studies in the United States. It has been over 30 years since I began to research and teach about Korea-related issues as an assistant professor at the University of Iowa. Two decades have now passed since the creation of the Korea Program at Stanford. When I reflect upon my time in the United States, the enthusiasm and excitement toward Korea and Korean culture that I saw at the Korea Program’s 20th anniversary conference are truly remarkable. Forty years ago, South Korea was a developing country that had thrown off the shackles of poverty but remained under the control of a dictatorship. Thirty years ago, it was a fledgling democracy that had just established the Korea Foundation, under its Ministry of Foreign Affairs, to promote international awareness and understanding of Korea. Twenty years ago, the world turned its eyes to North Korea as Pyongyang’s weapons of mass destruction posed a growing threat to international peace and security. Today, the deep interest in and fascination with Korean culture among both students and the general public is unprecedented. Can Korea’s soft power, embodied by K-pop and K-dramas, take root as a lasting force? Korea is now an economic powerhouse with the 10th largest economy in the world, but can it also become a cultural powerhouse with global influence? We may look back on the Korean Wave as a passing trend, a flash in the pan. On the other hand, it could be an opportunity for South Korea to overcome the so-called Korea discount, in which the market “prices in” instability arising from the security threat posed by North Korea. The soft power of the Korean Wave could enable South Korea to transform this disadvantage into a “Korea premium” instead. Historically, the Korean War has been the single most important event in shaping American perceptions of South Korea.[2] “M*A*S*H,” a comedy drama that portrayed the day-to-day experiences of army surgeons and nursing officers in a mobile army surgical hospital located in Uijeongbu during the Korean War, was still on the air when I arrived in Seattle to begin my graduate studies in the 1980s.[3] This show ran for a total of 11 seasons from 1972 to 1983, and it is regarded as one of the best U.S. television dramas of all time. As a result, “M*A*S*H” had a powerful impact on how the American public perceived South Korea, which was seen as a poor, war-torn country that relied on American aid. The economic growth that occurred during South Korea’s developmental authoritarian era also helped shape American perceptions of the country. People began to speak of the Miracle on the Han River, just as they had labeled Germany’s post-World War II recovery as the Miracle on the Rhine. Clothes and shoes manufactured in South Korea found their way into the U.S. market, followed by Hyundai’s Excel and black-and-white TVs from Samsung Electronics. Academics from various disciplines, including economics, sociology, political science, and anthropology, began to produce research on South Korea. Alice Amsden, a political economist who taught at MIT, predicted in Asia’s Next Giant (1989) that South Korea would become a major economic power in Asia. However, the prevailing view in the United States was that South Korea would not overtake Japan as Asia’s economic leader. Instead, it was believed that it would seek to emulate Japan as one of several “flying geese.” Ezra Vogel, a leading scholar of East Asia who taught at Harvard for many years, rose to academic prominence with Japan as Number One (1979) and labeled South Korea, Taiwan, Hong Kong, and Singapore as the “four little dragons” in a later work. The historian Carter Eckert published Offspring of Empire (1991), which traces the origins of Korean capitalism to Japanese colonial rule. Allegations of U.S. culpability in the massacre of civilians during the Gwangju Uprising of May 1980 gave rise to greater interest in South Korea’s politics, social movements, and its ethnic nationalist ideology. Specifically, the emergence of anti-Americanism in South Korea attracted attention from both intellectuals and the general public in the United States.[4] Even though South Korea experienced a serious financial crisis in the late 1990s, it was recognized by the United States and the broader international community as a country that had successfully achieved both industrialization and democratization in the post-World War II era. It joined the OECD in 1996 and was a founding member of the G20. Once a recipient of foreign aid, it now provides official development assistance to developing countries. Hyundai has grown from producing the Pony to the Genesis. Samsung Electronics has moved on from manufacturing black-and-white TV sets to become one of the leading TV brands across the world and commands a sizable share of the global semiconductor market. In terms of its political evolution, South Korea is regarded as a leading example of a country that successfully transitioned to democracy during the “Third Wave” of democratization, which began in the 1970s. It is extremely difficult to find examples of countries that underwent both political and economic development in a relatively short period of time since the end of World War II. South Korea’s transformation is an incredible achievement by any measure. Accordingly, U.S. perceptions of South Korea and its people have also gradually improved. There is an opposing force at play, however. Whenever news about North Korea dominates the headlines in the United States, this reinforces negative views of Korea as a whole. For example, a total of around 5,000 articles about the Korean Peninsula appeared in the New York Times, Washington Post, and Wall Street Journal between 1992 and 2003. Among articles about South Korea, 41% focused on economic issues. For North Korea, 65% of articles addressed national security and 9% focused on human rights. Taken together, the leading topic of discussion among all articles about the Korean Peninsula was North Korea’s weapons of mass destruction (30%). Needless to say, articles about this subject took on a very negative tone. In this way, the emphasis and tone of U.S. media coverage created a highly unfavorable image of both North Korea and the Korean Peninsula.[5] Since the first North Korean nuclear crisis erupted in 1993, there have been growing concerns in the United States about the security threat posed by North Korea’s weapons of mass destruction—specifically, its nuclear weapons and intercontinental ballistic missiles. Before then, North Korea was simply regarded as the Hermit Kingdom, a poor country run by a dictatorship. It was now seen as a serious threat to the security of the Korean Peninsula and the United States, not just by those in the Beltway, but also among the American public. Lectures and seminars about Korean Peninsula issues often gravitated toward North Korea, not South Korea. U.S. interest in North Korea peaked during the Trump administration, when the leaders of the two countries met for the first time in Singapore in 2018. Among younger Americans in particular, there is also a great deal of interest in North Korea’s human rights situation. Colleges and universities across the United States have hosted lectures and conferences that address this subject, inviting experts and North Korean escapees to come and speak to students. The North Korean human rights issue has also played a role in strengthening negative perceptions of Korea in the United States. While there has been markedly less interest in North Korea during the Biden administration, North Korea’s nuclear weapons and its human rights record remain key issues of interest for the American public. Unfortunately, not all attention toward the Korean Peninsula is good attention. The security threat posed by North Korea has given rise to the so-called Korea discount, which is also known as the Korea risk: when foreign investors determine whether to invest in South Korea, they consider its geopolitical situation in addition to economic factors. If North Korea raises tensions in the region by conducting a nuclear test or launching ballistic missiles, the Korea discount worsens. Even though South Korea is not responsible for creating instability, it suffers the consequences. In recent years, however, a positive force powerful enough to overwhelm the negative effects of the Korea discount has captured the imagination of the American public: the Korean Wave. The fascination with K-pop and K-dramas is no longer confined to specific demographics, such as young women or Asian Americans. Korean culture is a topic of daily conversation not only on college campuses, but also in restaurants, shops, and on the street. Before there was K-pop or K-dramas, Korean athletes attracted attention in the United States. Park Chan-Ho had an illustrious career in major league baseball, followed by Kim Byung-Hyun and Ryu Hyun-Jin. In women’s golf, Pak Se-Ri paved the way for Park Inbee and Ko Jin-Young. These athletes made positive contributions by expanding American interest in Korea beyond economic and security issues. While there are only a handful of Korean athletes in the MLB and they do not have a large impact on the league as a whole, Korean golfers dominate the rankings in the LPGA. Commentators have quipped that it should be renamed the KLPGA, and there are even grumblings that the prevalence of Korean players could adversely impact the league in terms of ad revenues and TV ratings. Compared to sports, Korea’s pop music and dramas have seeped into a much wider cross-section of the American public. There are still certain limits in terms of appealing to U.S. mainstream media, but Korean culture is now recognized as a distinctive culture in its own right, not as an imitation of Chinese or Japanese culture. Psy’s “Gangnam Style” took the music scene by storm in 2012, and BTS has swept the Billboard charts on multiple occasions since then. Bong Joon-Ho won best director at the Oscars for “Parasite” in 2020, and Youn Yuh-Jung won best supporting actress for her role in “Minari” the following year. Netflix is flooded with a variety of Korean content, and BTS’s “Dynamite” and the drama “Crash Landing on You” are brought up in day-to-day conversation among many Americans. As a result, there has been a surge of interest in Korea among students. K-pop–related student groups have popped up in college campuses across the United States. (Stanford is no exception. XTRM, a K-pop dance team that debuted in 2013, has around 30 members.) Amidst an overall decline in enrollments for foreign language classes, Korean has seen a dramatic increase. According to a 2019 report from the Modern Language Association of America, enrollment in Korean language classes at the undergraduate and graduate levels has increased by 95% between 2006 to 2016. This was the most notable growth during this period for foreign languages with an enrollment of at least 1,000.[6] The Korean Wave arrived at America’s shores long after it had already swept across other regions. It first surged through Japan, China, and Southeast Asian countries in the late 1990s before spreading to Europe and Latin America. Korean films received accolades at the Cannes Film Festival before Bong Joon-Ho and Youn Yuh-Jung were recognized at the Oscars. At this year’s Cannes, Korean cinema was a force to be reckoned with. Park Chan-Wook won best director for “Decision to Leave,” and Song Kang-Ho won best actor for his performance in “Broker.” K-pop and K-dramas are also extremely popular in India, where few would have expected Korean culture to take root. There, interest in learning Korean is growing rapidly, and the Indian government has added Korean to the list of foreign languages that can be taught at secondary schools.[7] Now that Korean culture has planted a flag even in the United States, which exercises cultural hegemony across the world, it would not be an exaggeration to say that Hallyu has become a truly global phenomenon. In light of the global ascendance of Korean culture, I began to discuss Hallyu as a key subject in my Korean studies classes two years ago. I also witnessed firsthand the considerable power and potential of Korean dramas and movies, many of which I watched on online streaming services during the pandemic. After Pak Se-Ri appeared on the scene, Korean golfers have continued to dominate the LPGA. It is exciting to imagine a future in which the Korean Wave becomes a lasting force that grows and evolves, thereby enhancing Korea’s soft power across the world. I am not an expert in cultural studies, and I am certainly not a specialist in K-pop or K-dramas. Moreover, the success of K-pop and K-dramas cannot necessarily be explained by a single, overarching narrative. As a sociologist, however, my impressions of the global success of Korean culture are as follows. The main reason behind the widespread popularity of Korean culture across the world is that it transcends the particularities of Korean society. It reflects the zeitgeist and addresses issues of universal concern in a sophisticated and attractive manner. In its early stages, Hallyu resonated with a primarily Asian audience, including those in Japan and China. In its present form, however, K-culture resonates with a global audience. Following the 2007–09 Great Recession, people across the world contended with problems such as extreme inequality, refugee crises, and a hyper-competitive society. Korea’s artists skillfully dissected these issues. “Parasite” provides a compelling portrait of inequality. The powerful narrative of “Squid Game” represents capitalism as a raw life-or-death contest. BTS has long struck a chord with discontented youth who are worn out by ever-increasing competition. In “Paradise,” a song on their third album “Love Yourself: Tear,” which topped the Billboard 200 Chart, BTS declares that “it’s okay to not have a dream.” Popular culture is at its most powerful when it honestly confronts and examines contemporary issues in a way that is entertaining and elicits empathy. It captures the thoughts, emotions, and sentiments of those in the audience. It portrays a way of life and represents a set of values that feels authentic to them. British bands such as the Beatles, Pink Floyd, Queen, and Coldplay achieved enormous global popularity precisely because their songs spoke to the issues of the day and reflected the atmosphere of the times. The same holds true for French cinema, which dominated the global movie scene from the 1950s to the 1970s. French movies from this era closely examine the role of the individual and the family in a rapidly changing society. It could be too early to tell, but the expanding global reach of Korea’s movies, dramas, and music can perhaps be explained by their ability to encapsulate the zeitgeist of the 21st century. Another reason behind the success of Hallyu is its effective use of online platforms. Korean movies and dramas were able to swiftly enter the global media market thanks to platforms such as Netflix and Apple TV. It is difficult to imagine “Squid Game” or “Crash Landing on You” becoming incredibly popular in a short span of time without OTT (over-the-top) media platforms. Such platforms are also dominant in the music industry, where CD albums have become largely obsolete. Consumers can purchase songs online or access streaming services. Korea was well-positioned to compete in this global market with its strong IT sector, and Korean artists soon leaped to the top of the Billboard charts. Furthermore, K-pop groups have created fandoms by communicating with fans through social media platforms such as V Live and Instagram Live. K-pop is now expanding its reach into the metaverse, in step with the current era of artificial intelligence. The third and final reason for K-culture’s popularity is that it captured a niche market by producing unique works that do not neatly conform with the norms of Western liberal democratic societies or authoritarian societies. K-pop artists—idol groups in particular—have achieved success by deftly combining emotionally resonant songs with brilliant, perfectly synchronized choreography. These artists, who undergo rigorous training from a young age and put in countless hours of practice, are capable of stunning group performances. Combining this element with music seized the attention of fans across the globe. Such group performances are difficult to envision among artists in Western societies, and authoritarian countries such as China or North Korea may be capable of mass choreography, but only for political purposes. In his keynote speech during the 20th anniversary event for Stanford’s Korea Program, Soo-Man Lee, a K-pop pioneer and the founder and chief producer of SM Entertainment, labeled the process of creating such works of art as “culture technology” (CT). According to Lee, SM Entertainment has developed CT, which is a management system that creates and propagates culture in four steps: casting (identifying talent), training, content producing, and marketing. Other entertainment companies in Korea essentially follow the same template. This ecosystem gives rise to a uniquely Korean style of music and art. Despite its successes, it is unclear if K-pop and K-dramas will be able to achieve lasting global popularity. BTS’s recent announcement of a break from group activities illustrates some of the challenges facing the K-pop industry. These include prolonged and intensive group training, without regard for individual privacy or mental health; South Korea’s compulsory military service for males; and debates about the equitable distribution of K-pop’s massive revenues. In an article about BTS’s break, Nikkei Asia pointed to the prevailing culture of the K-pop industry as the reason why BTS members openly admitted to suffering from burnout. During the announcement, BTS leader RM did not hold back in saying that “the problem with K-pop and the whole idol system is that they don’t give you time to mature [as a person].”[8] There continue to be doubts and debates about whether the CT system pioneered by SM Entertainment, which has been the driving force behind K-pop’s growth, is a sustainable model. Furthermore, it is vital to foster the next generation of industry leaders. Miky Lee of CJ ENM played a pivotal role in the globalization of Korean dramas, and Soo-Man Lee (SM Entertainment), Yang Hyun-Suk (formerly YG Entertainment), Park Jin-Young (JYP Entertainment), and Bang Si-Hyuk (HYBE) represent the first generation of K-pop pioneers. In the decades to come, there will need to be new leaders who can take their place and carry K-culture into the future. For Hallyu to remain a core element of Korea’s soft power, it is also important for the government to refrain from undue interference in the cultural sector. It can be tempting for officials to invite K-culture stars to government events or feature them in overseas public diplomacy initiatives. For example, the Moon Jae-In administration included the idol group Red Velvet in a delegation of musicians who performed at a concert in Pyongyang in April 2018. The Yoon Suk-Yeol administration also drew criticism for proposing the idea of featuring BTS at its inauguration ceremony this May. Many of Red Velvet’s global fans did not take kindly to seeing their favorite artists take pictures with a dictator. Similarly, ARMY (BTS’s fandom) did not welcome the idea of BTS performing at the inauguration of a president who is widely regarded as an “anti-feminist.” The government must stay away from such political controversies and quietly support Korea’s artists behind the scenes, enabling K-culture to find its place on the global stage. Consider, for instance, how Beijing set up Confucius Institutes in an effort to promote its soft power, only to fan the flames of anti-China sentiment. The current Yoon administration would also do well to recall how its predecessor prematurely sang the praises of “K-disease control” during the pandemic, which some in the international community saw as nothing more than tooting one’s own horn. At the same time, Korea’s global stars would do well to raise their own voices on global issues. Their growing influence on the world stage entails a greater sense of responsibility. During my class discussions with Stanford students, who are captivated by K-pop, I often hear comments about this issue. One student found it strange that K-pop artists do not speak out against racism, given K-pop’s global stature. Another asked, “Do Korea’s artists know that pro-democracy protestors in Asian countries like Myanmar are singing K-pop songs?” Some also ask the question that motivated this essay: “Is K-pop sustainable?” One might counter that these students are viewing K-pop through a distinctly American lens. Nonetheless, their comments and questions are deeply relevant to the future of the Korean Wave. K-pop artists must be able to raise their voice not only on global issues like climate change, but also on issues that are at once universal and distinctly Korean, such as North Korean human rights. In this vein, BTS’s visit to the White House in May to speak out against anti-Asian hate crimes was a welcome turn of events. To engage in such advocacy, artists must be well-informed on global issues so that they are able to formulate their own opinions and speak for themselves. As mentioned above, however, it will be important to strictly avoid undue political entanglements on such occasions going forward. Finally, there is a need to host forums where artists and industry leaders can exchange views with academics and professionals in relevant fields. For the Korean Wave to become a lasting force that enhances Korea’s soft power, there must be opportunities for artists, industry leaders, and academics to put their heads together and hold extensive discussions about the problems facing K-culture and what direction it should take in the future. It will not be enough to only hold fan meetings. If K-pop fizzles out, there will no longer be enough fans left to attend such events. At the 20th anniversary conference for Stanford’s Korea Program, Suho of Exo and Angela Killoren, the CEO of CJ ENM America, directly engaged with professors and students. Even though this was a small first step, it proved to be a highly informative and productive discussion. Moreover, it is important for those in academia to discuss how best to capture and rigorously analyze subjects of popular interest. Adequate support should be furnished to students who wish to research the Korean Wave, both in terms of research materials and financial resources. Professorships or postdoctoral fellowships dedicated to the Korean Wave could also be considered. The Korea Foundation or the Academy of Korean Studies could play a meaningful role in this regard.[9] Korea is a major economic and military power in its own right, but it is in a challenging geopolitical neighborhood. It will be difficult for Korea to surpass China or Japan in terms of hard power. China has replaced Japan as Asia’s leading economic power, and Korea continues to suffer from the disadvantage of the Korea discount. Although Korea was immensely successful in being a “fast follower” in its trajectory of economic development, it now faces significant obstacles in its attempts to become a “first mover.” Samsung’s smartphones, for example, have not been able to leapfrog the iPhone. The story could be different in the realm of culture, however. The Korean Wave, which has unique characteristics and continues to evolve in intriguing directions, could become a first mover on the global cultural scene. As K-pop, K-dramas, and Korean movies become more prominent, Korea’s soft power is rapidly growing as well. There is nothing better than the power of culture in improving a country’s image in the eyes of the world. For example, Sweden is commonly associated with ABBA and the welfare state. The Netherlands is regarded as a land of canals, and the country of Rembrandt and Van Gogh. Hallyu has now given Korea a golden opportunity to change the Korea discount into a Korea premium. In his autobiography, Kim Gu, a leader of Korea’s independence movement under Japanese colonial rule, wrote about his hopes for Korea:[10] “I want our country to become the most beautiful country in the world, not the most rich or powerful country in the world. As we have suffered the pain of invasion, I do not want our country to invade others. We only need to be prosperous enough to sustain the livelihoods of our people, and our military only needs to be strong enough to defend against foreign invasions. The only thing I want our country to possess without bounds is the noble strength of culture. The power of culture brings happiness to our lives, and also to the lives of others.” The Korean Wave has opened the door for Korea to become a cultural superpower, just as Kim Gu yearned for almost a century ago. I eagerly await the day his dream becomes true.  [1] Suho is the leader and lead vocalist of Exo, a boy group that debuted under SM Entertainment in 2012. Exo has sold millions of albums and embarked on multiple tours across the world. Suho has established himself as an acclaimed solo artist and has acted in several movies, dramas, and musicals. [2] According to a May 2021 estimate by the U.S. Department of Veterans Affairs, nearly 1.8 million Americans served in the Korean War. See “America’s Wars,” https://www.va.gov/opa/publications/factsheets/fs_americas_wars.pdf. [3] Uijeongbu, which lies immediately north of Seoul, hosted eight U.S. military bases for many decades following the 1953 armistice because of its strategic importance in defending the South Korean capital. The military units at these bases have since been relocated south to Camp Humphreys in Pyeongtaek, and most of the land has been returned to the city of Uijeongbu. See Sarah Kim, “U.S. returns land in Yongsan and other bases to Korea,” Korea JoongAng Daily, February 27, 2022. https://koreajoongangdaily.joins.com/2022/02/27/national/defense/US-Forces-Korea-USFK-Yongsan-Garrison/20220227155134728.html. [4] I have analyzed the subject of anti-Americanism in South Korea in my own work as well. For example, see Gi-Wook Shin, “South Korean Anti-Americanism: A Comparative Perspective,” Asian Survey 36, no. 8 (1996): 787–803. [5] For a more detailed discussion of these issues, see Gi-Wook Shin, One Alliance, Two Lenses: U.S.-Korea Relations in a New Era (Stanford: Stanford University Press, 2010). [6] Dennis Looney and Natalia Lusin, “Enrollments in Languages Other Than English in United States Institutions of Higher Education, Summer 2016 and Fall 2016: Final Report,” Modern Language Association, June 2019. https://www.mla.org/content/download/110154/2406932/2016-Enrollments-Final-Report.pdf. [7] Preeti Rawat, “Korean adopted in India as elective for 2nd foreign language,” Korea.net, August 12, 2020. https://www.korea.net/NewsFocus/HonoraryReporters/view?articleId=188619. [8] Kotaro Hosokawa, “BTS Hiatus Reveals Soft Underbelly of K-pop Industry,” Nikkei Asia, June 16, 2022. https://asia.nikkei.com/Business/Media-Entertainment/BTS-hiatus-reveals-soft-underbelly-of-K-pop-industry. [9] As noted above, the Korea Foundation (https://en.kf.or.kr/) was established under the Ministry of Foreign Affairs in 1991 to “promote proper awareness and understanding of Korea, and to enhance goodwill and friendship throughout the international community through a diverse array of international exchange activities.” The Academy of Korean Studies (http://intl.aks.ac.kr/english/), founded in 1978, is a public institution under the Ministry of Education that aims “to promote Korean studies and culture.” [10] Born in 1876, Kim Gu is one of the most influential figures in Korea’s modern history. He served as the president of the Provisional Government of the Republic of Korea (Korea’s government-in-exile). Following Korea’s liberation in 1945 and subsequent division along the 38th parallel, he sought to achieve reunification. He was assassinated in 1949 amidst the political turmoil that engulfed the Korean Peninsula between 1945 and the outbreak of the Korean War in 1950. His pen name was Baekbeom, and his autobiography is thus entitled Baekbeom Ilji (Baekbeom’s diaries). General inquiries\n650-723-4581 Learn more about how your support makes a difference or make a gift now © Stanford University, Stanford, California 94305. ",
    "title": "Will Hallyu Swell to a Tidal Wave? Korea's Future as a Cultural Superpower | FSI",
    "url": "https://aparc.fsi.stanford.edu/news/will-hallyu-swell-tidal-wave-koreas-future-cultural-superpower"
}