{
    "text": "published author share on Kasikornbank (KBank) took home the gold award for 'Excellence in Leadership Development' and the bronze award for 'Excellence in Innovative Use of HR Tech' at the inaugural HR Excellence Awards 2021, Thailand. In this interview, Sansana Sukhanunth, CHRO, Kasikornbank (pictured above), affirms how the bank's people strategy equips the HR team to be forward thinking while making sure that all initiatives tie back very clearly to the desired outcomes and key results under each pillar of this strategy. Q What is your organisation’s winning HR strategy, and what are some of the milestones you’ve accomplished along this journey? Our HR strategy is in line with the bank’s strategy to deliver excellent customer experience in order to empower every customer’s life and business. To enable KBank employees to do that, our strategy is anchored on the four Us – 'Uplift people & talent, Untangle organisation, Unify culture, and Upgrade HR'. It has been a very busy year for us, with 19 squads running in HR to deliver programmes under these pillars. The key highlights of our achievements to date include our 'Leadership in Action' programme, re-aligning the HR operating model to support the bank’s growth strategy, and moving towards an agile way of work in our focus areas. Additionally, given the current remote working situation, we have launched wellbeing programmes company-wide to ensure that we look after the work and life of our people and improve engagement. We continue to foster innovation and community, and successfully launched the K-Idea portal as a channel for all employees to submit and vote for new ideas for improving our products & services, productivity, and employee experience. These ideas are then selected for actual implementation.  Q How has this strategy helped you achieve your HR priorities, and what role has the leadership played in helping make this initiative a reality? It keeps us focused. To serve the business in serving its customers, HR needs to be forward thinking while making sure that all initiatives tie back very clearly to the desired outcomes and key results under each pillar. Our leadership plays a crucial role as we believe that transformation needs to start from the top. Leaders have to start by first transforming themselves; we therefore place emphasis on our purposeful and practical leadership development programme - to create self-awareness, to co-create a way of work, to have empathy and open communication, and of course to adopt an agile leadership and mindset. Our leaders need to live the K-Culture and exhibit the desired behaviours in engaging our employees.  Q Unexpected roadblocks are part and parcel of executing any initiative. What were some of the barriers that you and your team experienced while rolling this out, and how did you successfully get past them? Our biggest challenge is that we have over 30,000 employees within our group. We have built a great legacy, but with the world changing so rapidly, how do we shift an organisation this size? How do we move forward together to make sure that we stay at the forefront of modern banking, and even go beyond banking? Everything is now centered around our customers – and there is so much more potential in helping them succeed via channels that are integrated into their everyday lives. This requires our people to think out of the box, embrace innovation, and break down siloes. HR has been working on shifting our mindset, and to reskill and upskill to transform on every front. The bank has made good progress as evidenced by the recent products that we have developed, including social banking on the LINE BK platform in collaboration with LINE Corporation Co., Ltd. Our customers can now transfer funds to their LINE Friends, and open accounts, receive real-time notifications on transactions, and receive loan services with instant approval. LINE BK offers a nano credit line to provide much-needed liquidity to SMEs and people who want to start a business.  Another example is MAKE by KBank, an application designed to meet the needs of the new generation. Its functions allow connections with other app users, including funds transfer via Bluetooth with no account and telephone number or QR code required, and categorisation of e-wallets/pockets into various groups according to their objective, without the need to open multiple accounts. HR still needs to work hand-in-hand with the business to help our talents to keep moving forward and live up to their full potential. We also stress on making sure that we bring everyone along on this journey and leave no one behind. This strong messaging, backed up by the actions from our leadership, has created the forward momentum needed for us to grow. Q As evidenced by the win, this initiative clearly delivered some amazing results. What was your gameplan for measuring ROI? What are some proud achievements you can share with us on this front? We set out by clearly defining our objectives that are linked to the larger goal that we want to achieve. We then make sure that every team tracks against the targeted key results, which gets monitored through our quarterly review. One measurement of course would be to see if our investments are paying off in terms of productivity – which is indicated by the HCROI. We exceeded our target of 4.05 times and achieved 4.15. On top of that, we aim for our initiatives to result in higher employee engagement, measured through our engagement survey results, where we are standing above average for APAC financial industry (from Kincentric Employee Engagement Survey). The bank also has been recognised for our innovations, winning the Best Digital Bank for CX – Thailand (LINE BK Powered by KBank), Best Fintech for Digital CX-Alternative Wealth Management(FinVest), and Outstanding Innovation in Digital CX for Investment Product/Service as well as Platform/Website from The Digital Banker. Lastly, KBank was selected as a member of the Dow Jones Sustainability Index (DJSI) family for 2021, in both the DJSI World and Emerging Markets Indices, for the sixth year running – the first bank in Thailand to do so – while also earning the highest scores in the corporate governance and economic dimension among all banks across the globe.  Q We’re now seeing HR manage portfolios that were previously considered far from their job description. In your view, what are the top three skills and attributes of today’s successful CHRO? Firstly, I think that we need to be purpose-driven. It is very important that we connect the people to the organisation’s purpose, and in doing so allow our people to also fulfil their own purpose at work and in life. Secondly, the CHRO needs to be able to execute with speed and agility, anticipate and adapt to business needs, understand who we are solving for and who we need to involve to get the problem solved, and get things done. Of course, this requires the third attribute, which is trust. The CHRO must attain credibility, be able to influence others, and become the go-to person and trusted advisor for the organisation. All images / Provided by KBank Read more interviews on why organisations have won trophies for their HR practices - head over to our Winning Secrets' section! Follow us on Telegram and on Instagram @humanresourcesonline for all the latest HR and manpower news from around the region! share on Follow us on  Telegram and on Instagram @humanresourcesonline for all the latest HR and manpower news from around the region! Related topics Free newsletter Get the daily lowdown on Asia's top Human Resources stories. We break down the big and messy topics of the day so you're updated on the most important developments in Asia's Human Resources development – for free. humanresourcesonline.net. is an online publication of Lighthouse Independent Media. ©  Lighthouse Independent Media. All rights reserved. Human Resources Online is not responsible for the content of external sites. ",
    "title": "Winning Secrets: How leaders, HR and the workforce at Kasikornbank live the 'K-Culture' | Human Resources Online",
    "url": "https://www.humanresourcesonline.net/winning-secrets-how-leaders-hr-and-the-workforce-at-kasikornbank-live-the-k-culture"
}