{
    "text": "The winners of the 2022 Korean Popular Culture & Arts Awards have been announced! The Korean Popular Culture & Arts Awards are government prizes that recognize the work of artists in various fields who have contributed to the development of popular culture. This year’s ceremony was held on November 24 at the National Theater of Korea. The event was hosted by actor Park Sun Ho and former announcer Jang Ye Won with congratulatory performances given by Aiki and her dance crew Hook, Paul Kim, and Oh My Girl’s YooA. Director Park Chan Wook and the late actress Kang Soo Yeon were awarded the evening’s greatest honors with the Eungwan Order of Cultural Merit (Second Class). The late actress Kang Soo Yeon, who passed away in May, made her debut as a child actress at the young age of four. Kang Soo Yeon emerged as a world star following her role in director Im Kwon Taek’s 1987 film “The Surrogate Woman.” For this role, Kang Soo Yeon took home the Best Actress Award at the 1987 Venice International Film Festival, becoming the first Korean actor – male or female – to win an award at a major film festival. This same year, Kang Soo Yeon was awarded the Okgwan Order of Cultural Merit (4th Class) for her achievements. In a video message, director Im Kwon Taek shared, “An actor who can win awards at global film festivals has emerged. The status of Korean film has risen significantly. [Kang Soo Yeon] was the kind of actress who was incredibly confident, made her convictions clear, and clearly carried them out.” Kang Soo Yeon’s younger sister Kang Soo Kyung received the award in her place. She commented, “While coming here, I was reminded of when my sister received the Okgwan Order of Cultural Merit in 1987. I’ve thought a lot about what it would be like if she was here. This year, it’s been 53 years since my sister’s debut. I hope my sister remembers and is comforted by how many people recognize how diligently she lived while doing her best for a long period of time, and is resting well in a good place. I sincerely thank everyone who remembers actress Kang Soo Yeon.” Earlier this year, director Park Chan Wook set a new record for the most awards received by a Korean filmmaker at the Cannes Film Festival after winning Best Director for his 2022 film “Decision to Leave.” As he is currently filming abroad, Park Chan Wook gave his acceptance speech in a video message. He shared, “There are a lot of times where my films do not portray our country and our citizens as very beautiful or respectful identities, so I’m not sure if I’m allowed to receive an Order of Merit given by the country.” He continued, “However, I believe that it’s an artist’s duty to honestly view and depict humans and society. I will think of this as recognition of my efforts and in the future too, I will brush up my act and dig into this world and the human race with an even more thorough attitude.” In total, five people received an Order of Cultural Merit, six received Presidential Commendations, eight received Prime Minister’s commendations, and 10 artists/groups received Minister of Culture, Sports and Tourism’s Commendations. See the full list of winners below! Eungwan Order of Cultural Merit (2nd Class) Director Park Chan Wook, actress Kang Soo Yeon (deceased) Bogwan Order of Cultural Merit (3rd Class) Actor Song Kang Ho, screenwriter Park Jin Sook, cartoon artist Heo Young Man A post shared by 2022 대한민국 대중문화예술상 (@k.culture.awards) Presidential Commendation Voice actress Hong Seung Ok, film score composer Byun Sung Yong, actor Kim Yoon Seok, singer Kim Hyun Chul, screenwriter Park Hae Young, music director Bang Joon Seok (deceased) A post shared by 2022 대한민국 대중문화예술상 (@k.culture.awards) Prime Minister’s Commendation Actor Lee Sung Min, singer Jang Pil Soon, comedian Park Myung Soo, band Jaurim, director Yeon Sang Ho, producer Kim Ji Yeon, singer Zico, cartoon artist Kim Bo Tong A post shared by 2022 대한민국 대중문화예술상 (@k.culture.awards) Minister of Culture, Sports, and Tourism’s Commendation TXT, aespa, voice actor Kim Young Sun, musical actress Kim Sun Young, producer Han Seung Won, actress Jeon Mi Do, comedian Hong Hyun Hee, choreographer Aiki, singer Paul Kim A post shared by 2022 대한민국 대중문화예술상 (@k.culture.awards) Congratulations to all the winners! Watch Song Kang Ho in “The King’s Letters” below: Watch Now Source (1)  ",
    "title": "Winners Of 2022 Korean Popular Culture & Arts Awards | Soompi",
    "datetime": "1669317424",
    "url": "https://www.soompi.com/article/1555730wpp/winners-of-2022-korean-popular-culture-arts-awards"
}