{
    "text": "The Korean department at Arizona State University's School of International Letters and Cultures (SILC) is one of the college’s fastest growing programs, with more students benefiting every year. Senior Simon Huynh, in pursuit of his thesis project, found out exactly what that growth and energy meant. “I originally got involved with SILC on a recommendation to find an honors thesis director,” Huynh said. \"SILC has a very open faculty, willing to help you. Their level of expertise is very high.” \n\nSimon Huynh used School of International Letters and Cultures classes to explore Korean culture for his thesis project. \nDownload Full Image\n\nHuynh’s thesis project for Barrett, The Honors College, analyzes how Korean popular culture, or K-pop music, is influenced by videos, livestreams and reality television. “The goal of my thesis was to see how various social media tools generate a very interactive, very invested fan base for K-pop. Something very unique about K-pop is how organized the fans are around a particular group,” Huynh explained. He said this ranges from active fan clubs to wide-scale donations in a band’s name. Huynh himself has listened to K-pop since middle school, but realized his interest had thesis potential after learning about Professor Jiwon Shin’s class on Korean popular culture. Shin became Huynh’s director. “Studying culture enables you to obtain and widen your lens of perception,” Huynh said. “You’re able to see people for who they are. In my study of Korean culture, I’ve come to appreciate both the differences and the similarities between my original culture … Vietnamese American.”Huynh credits his thesis and Shin with helping him become more aware of other cultures and more empathetic of cultural differences. In the future, students can get even more out of the Korean department than Huynh was able to, thanks to the addition of a Korean minor to SILC degree options. The Korean minor will empower students to explore technological, economic and political realities tied in with Korean language and culture. Korea is at the center of geopolitical, security and global conversations. SILC wants students to be part of those conversations. “My professors are actually trying to help me publish my thesis,” Huynh said. “I think that’s a huge step I didn’t consider, but they want to help me build that step. … It’s important for me to share my culture and understand other people’s culture.” “I originally got involved with SILC on a recommendation to find an honors thesis director,” Huynh said. \"SILC has a very open faculty, willing to help you. Their level of expertise is very high.” \n\nSimon Huynh used School of International Letters and Cultures classes to explore Korean culture for his thesis project. \nDownload Full Image\n\nHuynh’s thesis project for Barrett, The Honors College, analyzes how Korean popular culture, or K-pop music, is influenced by videos, livestreams and reality television. “The goal of my thesis was to see how various social media tools generate a very interactive, very invested fan base for K-pop. Something very unique about K-pop is how organized the fans are around a particular group,” Huynh explained. He said this ranges from active fan clubs to wide-scale donations in a band’s name. Huynh himself has listened to K-pop since middle school, but realized his interest had thesis potential after learning about Professor Jiwon Shin’s class on Korean popular culture. Shin became Huynh’s director. “Studying culture enables you to obtain and widen your lens of perception,” Huynh said. “You’re able to see people for who they are. In my study of Korean culture, I’ve come to appreciate both the differences and the similarities between my original culture … Vietnamese American.”Huynh credits his thesis and Shin with helping him become more aware of other cultures and more empathetic of cultural differences. In the future, students can get even more out of the Korean department than Huynh was able to, thanks to the addition of a Korean minor to SILC degree options. The Korean minor will empower students to explore technological, economic and political realities tied in with Korean language and culture. Korea is at the center of geopolitical, security and global conversations. SILC wants students to be part of those conversations. “My professors are actually trying to help me publish my thesis,” Huynh said. “I think that’s a huge step I didn’t consider, but they want to help me build that step. … It’s important for me to share my culture and understand other people’s culture.” Huynh’s thesis project for Barrett, The Honors College, analyzes how Korean popular culture, or K-pop music, is influenced by videos, livestreams and reality television. “The goal of my thesis was to see how various social media tools generate a very interactive, very invested fan base for K-pop. Something very unique about K-pop is how organized the fans are around a particular group,” Huynh explained. He said this ranges from active fan clubs to wide-scale donations in a band’s name. Huynh himself has listened to K-pop since middle school, but realized his interest had thesis potential after learning about Professor Jiwon Shin’s class on Korean popular culture. Shin became Huynh’s director. “Studying culture enables you to obtain and widen your lens of perception,” Huynh said. “You’re able to see people for who they are. In my study of Korean culture, I’ve come to appreciate both the differences and the similarities between my original culture … Vietnamese American.”Huynh credits his thesis and Shin with helping him become more aware of other cultures and more empathetic of cultural differences. In the future, students can get even more out of the Korean department than Huynh was able to, thanks to the addition of a Korean minor to SILC degree options. The Korean minor will empower students to explore technological, economic and political realities tied in with Korean language and culture. Korea is at the center of geopolitical, security and global conversations. SILC wants students to be part of those conversations. “My professors are actually trying to help me publish my thesis,” Huynh said. “I think that’s a huge step I didn’t consider, but they want to help me build that step. … It’s important for me to share my culture and understand other people’s culture.” “The goal of my thesis was to see how various social media tools generate a very interactive, very invested fan base for K-pop. Something very unique about K-pop is how organized the fans are around a particular group,” Huynh explained. He said this ranges from active fan clubs to wide-scale donations in a band’s name. Huynh himself has listened to K-pop since middle school, but realized his interest had thesis potential after learning about Professor Jiwon Shin’s class on Korean popular culture. Shin became Huynh’s director. “Studying culture enables you to obtain and widen your lens of perception,” Huynh said. “You’re able to see people for who they are. In my study of Korean culture, I’ve come to appreciate both the differences and the similarities between my original culture … Vietnamese American.”Huynh credits his thesis and Shin with helping him become more aware of other cultures and more empathetic of cultural differences. In the future, students can get even more out of the Korean department than Huynh was able to, thanks to the addition of a Korean minor to SILC degree options. The Korean minor will empower students to explore technological, economic and political realities tied in with Korean language and culture. Korea is at the center of geopolitical, security and global conversations. SILC wants students to be part of those conversations. “My professors are actually trying to help me publish my thesis,” Huynh said. “I think that’s a huge step I didn’t consider, but they want to help me build that step. … It’s important for me to share my culture and understand other people’s culture.” He said this ranges from active fan clubs to wide-scale donations in a band’s name. Huynh himself has listened to K-pop since middle school, but realized his interest had thesis potential after learning about Professor Jiwon Shin’s class on Korean popular culture. Shin became Huynh’s director. “Studying culture enables you to obtain and widen your lens of perception,” Huynh said. “You’re able to see people for who they are. In my study of Korean culture, I’ve come to appreciate both the differences and the similarities between my original culture … Vietnamese American.”Huynh credits his thesis and Shin with helping him become more aware of other cultures and more empathetic of cultural differences. In the future, students can get even more out of the Korean department than Huynh was able to, thanks to the addition of a Korean minor to SILC degree options. The Korean minor will empower students to explore technological, economic and political realities tied in with Korean language and culture. Korea is at the center of geopolitical, security and global conversations. SILC wants students to be part of those conversations. “My professors are actually trying to help me publish my thesis,” Huynh said. “I think that’s a huge step I didn’t consider, but they want to help me build that step. … It’s important for me to share my culture and understand other people’s culture.” “Studying culture enables you to obtain and widen your lens of perception,” Huynh said. “You’re able to see people for who they are. In my study of Korean culture, I’ve come to appreciate both the differences and the similarities between my original culture … Vietnamese American.”Huynh credits his thesis and Shin with helping him become more aware of other cultures and more empathetic of cultural differences. In the future, students can get even more out of the Korean department than Huynh was able to, thanks to the addition of a Korean minor to SILC degree options. The Korean minor will empower students to explore technological, economic and political realities tied in with Korean language and culture. Korea is at the center of geopolitical, security and global conversations. SILC wants students to be part of those conversations. “My professors are actually trying to help me publish my thesis,” Huynh said. “I think that’s a huge step I didn’t consider, but they want to help me build that step. … It’s important for me to share my culture and understand other people’s culture.” Huynh credits his thesis and Shin with helping him become more aware of other cultures and more empathetic of cultural differences. In the future, students can get even more out of the Korean department than Huynh was able to, thanks to the addition of a Korean minor to SILC degree options. The Korean minor will empower students to explore technological, economic and political realities tied in with Korean language and culture. Korea is at the center of geopolitical, security and global conversations. SILC wants students to be part of those conversations. “My professors are actually trying to help me publish my thesis,” Huynh said. “I think that’s a huge step I didn’t consider, but they want to help me build that step. … It’s important for me to share my culture and understand other people’s culture.” The Korean minor will empower students to explore technological, economic and political realities tied in with Korean language and culture. Korea is at the center of geopolitical, security and global conversations. SILC wants students to be part of those conversations. “My professors are actually trying to help me publish my thesis,” Huynh said. “I think that’s a huge step I didn’t consider, but they want to help me build that step. … It’s important for me to share my culture and understand other people’s culture.” “My professors are actually trying to help me publish my thesis,” Huynh said. “I think that’s a huge step I didn’t consider, but they want to help me build that step. … It’s important for me to share my culture and understand other people’s culture.” grsandle@asu.edu Last semester, two Arizona State University students in Jewish studies courses used their final project assignments as opportunities for creative expression, exhibiting the material that they learned in their courses through art and music.Rather than simply writing a research paper on a topic of Judaism that their class had studied during the semester, students Alison Sigala and Samuel Opie channe... Last semester, two Arizona State University students in Jewish studies courses used their final project assignments as opportunities for creative expression, exhibiting the material that they learned in their courses through art and music.Rather than simply writing a research paper on a topic of Judaism that their class had studied during the semester, students Alison Sigala and Samuel Opie channeled their talents and areas of academic study, producing something truly unique.                        \n\nStudent Alison Sigala channeled medieval art for her scroll project depicting images from the Hebrew Bible. \nDownload Full Image\n\nSigala is an intermediate art majorin the Herberger Institute for Design and the Arts who is passionate about studying and producing art, such as drawings. Opie is a Russian language major and interested in Russian history and culture. He also sings for an a cappella group, writes songs and creates music.\nHistory lecturer Timothy Langille, who teaches courses on the Hebrew Bible and Jewish history at ASU's School of Historical, Philosophical and Religious Studies, said these two students definitely went above and beyond the final project requirements.While taking REL/JST 315: Hebrew Bible, Sigala crafted a highly elaborate scroll with medieval-like art, which portrays the stories from the first two chapters of Ezekiel in the Hebrew Bible. It also relates to one of the units discussed in this class, “book cultures versus scroll cultures,” according to Langille. Sigala is fascinated by art from the classical and Renaissance eras and “flipping stereotypes on their heads.” Most works of art during these historical periods consist of impeccable and “pretty” images portraying biblical events using things like head-halos and gold-leaf art, Sigala said. Yet, the scroll, which she created on mulberry printmaking paper using acrylic paints and sharpie ink, is a lot more raw and visceral with its colors and imagery.Her artwork depicts the biblical scene of Ezekiel receiving an incredible vision from God, who calls him to become a prophet. In this story about Ezekiel’s journey, “it's really hard to imagine that, from words to actual pictures, because it’s described very strangely,” Sigala said. Ezekiel receives a scroll from God and then eats it, and Sigala said this inspired her to use a scroll and artistically represent how this vision would actually look.From the top to the bottom of the scroll, Sigala took the events described in Ezekiel and chronologically translated the language into a visually captivating representation.The “Call to Prophecy” from Ezekiel 1 contains some of the most “over-the-top imagery in the Hebrew Bible,” in Langille’s opinion. “So to actually conceptualize it and produce this is pretty amazing,” he said.Opie, who was taking the course HST/JST 230: Intro to Jewish Civilization, used an online computer program to write sheet music dedicated to one of the poems written about the Russian pogroms that erupted in 1903. \"Upon the Slaughter,\" written by famed Hebrew poet Hayim Nahman Bialik, is based on the deadly anti-Jewish riots that occurred in Kishinev, which was the capital of the Russian Empire at the time.Opie included four different vocal parts in his sheet music: soprano, alto, tenor and bass. Langille was thrilled when he realized they were channeling what they learned in class into original forms of art.“It shows they care,\" he said. \"It’s exciting for a professor. When you get something exceptional like this, it brings the same joy of a flawless, well-written research paper.” Rather than simply writing a research paper on a topic of Judaism that their class had studied during the semester, students Alison Sigala and Samuel Opie channeled their talents and areas of academic study, producing something truly unique.                        \n\nStudent Alison Sigala channeled medieval art for her scroll project depicting images from the Hebrew Bible. \nDownload Full Image\n\nSigala is an intermediate art majorin the Herberger Institute for Design and the Arts who is passionate about studying and producing art, such as drawings. Opie is a Russian language major and interested in Russian history and culture. He also sings for an a cappella group, writes songs and creates music.\nHistory lecturer Timothy Langille, who teaches courses on the Hebrew Bible and Jewish history at ASU's School of Historical, Philosophical and Religious Studies, said these two students definitely went above and beyond the final project requirements.While taking REL/JST 315: Hebrew Bible, Sigala crafted a highly elaborate scroll with medieval-like art, which portrays the stories from the first two chapters of Ezekiel in the Hebrew Bible. It also relates to one of the units discussed in this class, “book cultures versus scroll cultures,” according to Langille. Sigala is fascinated by art from the classical and Renaissance eras and “flipping stereotypes on their heads.” Most works of art during these historical periods consist of impeccable and “pretty” images portraying biblical events using things like head-halos and gold-leaf art, Sigala said. Yet, the scroll, which she created on mulberry printmaking paper using acrylic paints and sharpie ink, is a lot more raw and visceral with its colors and imagery.Her artwork depicts the biblical scene of Ezekiel receiving an incredible vision from God, who calls him to become a prophet. In this story about Ezekiel’s journey, “it's really hard to imagine that, from words to actual pictures, because it’s described very strangely,” Sigala said. Ezekiel receives a scroll from God and then eats it, and Sigala said this inspired her to use a scroll and artistically represent how this vision would actually look.From the top to the bottom of the scroll, Sigala took the events described in Ezekiel and chronologically translated the language into a visually captivating representation.The “Call to Prophecy” from Ezekiel 1 contains some of the most “over-the-top imagery in the Hebrew Bible,” in Langille’s opinion. “So to actually conceptualize it and produce this is pretty amazing,” he said.Opie, who was taking the course HST/JST 230: Intro to Jewish Civilization, used an online computer program to write sheet music dedicated to one of the poems written about the Russian pogroms that erupted in 1903. \"Upon the Slaughter,\" written by famed Hebrew poet Hayim Nahman Bialik, is based on the deadly anti-Jewish riots that occurred in Kishinev, which was the capital of the Russian Empire at the time.Opie included four different vocal parts in his sheet music: soprano, alto, tenor and bass. Langille was thrilled when he realized they were channeling what they learned in class into original forms of art.“It shows they care,\" he said. \"It’s exciting for a professor. When you get something exceptional like this, it brings the same joy of a flawless, well-written research paper.” Sigala is an intermediate art majorin the Herberger Institute for Design and the Arts who is passionate about studying and producing art, such as drawings. Opie is a Russian language major and interested in Russian history and culture. He also sings for an a cappella group, writes songs and creates music. History lecturer Timothy Langille, who teaches courses on the Hebrew Bible and Jewish history at ASU's School of Historical, Philosophical and Religious Studies, said these two students definitely went above and beyond the final project requirements.While taking REL/JST 315: Hebrew Bible, Sigala crafted a highly elaborate scroll with medieval-like art, which portrays the stories from the first two chapters of Ezekiel in the Hebrew Bible. It also relates to one of the units discussed in this class, “book cultures versus scroll cultures,” according to Langille. Sigala is fascinated by art from the classical and Renaissance eras and “flipping stereotypes on their heads.” Most works of art during these historical periods consist of impeccable and “pretty” images portraying biblical events using things like head-halos and gold-leaf art, Sigala said. Yet, the scroll, which she created on mulberry printmaking paper using acrylic paints and sharpie ink, is a lot more raw and visceral with its colors and imagery.Her artwork depicts the biblical scene of Ezekiel receiving an incredible vision from God, who calls him to become a prophet. In this story about Ezekiel’s journey, “it's really hard to imagine that, from words to actual pictures, because it’s described very strangely,” Sigala said. Ezekiel receives a scroll from God and then eats it, and Sigala said this inspired her to use a scroll and artistically represent how this vision would actually look.From the top to the bottom of the scroll, Sigala took the events described in Ezekiel and chronologically translated the language into a visually captivating representation.The “Call to Prophecy” from Ezekiel 1 contains some of the most “over-the-top imagery in the Hebrew Bible,” in Langille’s opinion. “So to actually conceptualize it and produce this is pretty amazing,” he said.Opie, who was taking the course HST/JST 230: Intro to Jewish Civilization, used an online computer program to write sheet music dedicated to one of the poems written about the Russian pogroms that erupted in 1903. \"Upon the Slaughter,\" written by famed Hebrew poet Hayim Nahman Bialik, is based on the deadly anti-Jewish riots that occurred in Kishinev, which was the capital of the Russian Empire at the time.Opie included four different vocal parts in his sheet music: soprano, alto, tenor and bass. Langille was thrilled when he realized they were channeling what they learned in class into original forms of art.“It shows they care,\" he said. \"It’s exciting for a professor. When you get something exceptional like this, it brings the same joy of a flawless, well-written research paper.” While taking REL/JST 315: Hebrew Bible, Sigala crafted a highly elaborate scroll with medieval-like art, which portrays the stories from the first two chapters of Ezekiel in the Hebrew Bible. It also relates to one of the units discussed in this class, “book cultures versus scroll cultures,” according to Langille. Sigala is fascinated by art from the classical and Renaissance eras and “flipping stereotypes on their heads.” Most works of art during these historical periods consist of impeccable and “pretty” images portraying biblical events using things like head-halos and gold-leaf art, Sigala said. Yet, the scroll, which she created on mulberry printmaking paper using acrylic paints and sharpie ink, is a lot more raw and visceral with its colors and imagery.Her artwork depicts the biblical scene of Ezekiel receiving an incredible vision from God, who calls him to become a prophet. In this story about Ezekiel’s journey, “it's really hard to imagine that, from words to actual pictures, because it’s described very strangely,” Sigala said. Ezekiel receives a scroll from God and then eats it, and Sigala said this inspired her to use a scroll and artistically represent how this vision would actually look.From the top to the bottom of the scroll, Sigala took the events described in Ezekiel and chronologically translated the language into a visually captivating representation.The “Call to Prophecy” from Ezekiel 1 contains some of the most “over-the-top imagery in the Hebrew Bible,” in Langille’s opinion. “So to actually conceptualize it and produce this is pretty amazing,” he said.Opie, who was taking the course HST/JST 230: Intro to Jewish Civilization, used an online computer program to write sheet music dedicated to one of the poems written about the Russian pogroms that erupted in 1903. \"Upon the Slaughter,\" written by famed Hebrew poet Hayim Nahman Bialik, is based on the deadly anti-Jewish riots that occurred in Kishinev, which was the capital of the Russian Empire at the time.Opie included four different vocal parts in his sheet music: soprano, alto, tenor and bass. Langille was thrilled when he realized they were channeling what they learned in class into original forms of art.“It shows they care,\" he said. \"It’s exciting for a professor. When you get something exceptional like this, it brings the same joy of a flawless, well-written research paper.” Sigala is fascinated by art from the classical and Renaissance eras and “flipping stereotypes on their heads.” Most works of art during these historical periods consist of impeccable and “pretty” images portraying biblical events using things like head-halos and gold-leaf art, Sigala said. Yet, the scroll, which she created on mulberry printmaking paper using acrylic paints and sharpie ink, is a lot more raw and visceral with its colors and imagery.Her artwork depicts the biblical scene of Ezekiel receiving an incredible vision from God, who calls him to become a prophet. In this story about Ezekiel’s journey, “it's really hard to imagine that, from words to actual pictures, because it’s described very strangely,” Sigala said. Ezekiel receives a scroll from God and then eats it, and Sigala said this inspired her to use a scroll and artistically represent how this vision would actually look.From the top to the bottom of the scroll, Sigala took the events described in Ezekiel and chronologically translated the language into a visually captivating representation.The “Call to Prophecy” from Ezekiel 1 contains some of the most “over-the-top imagery in the Hebrew Bible,” in Langille’s opinion. “So to actually conceptualize it and produce this is pretty amazing,” he said.Opie, who was taking the course HST/JST 230: Intro to Jewish Civilization, used an online computer program to write sheet music dedicated to one of the poems written about the Russian pogroms that erupted in 1903. \"Upon the Slaughter,\" written by famed Hebrew poet Hayim Nahman Bialik, is based on the deadly anti-Jewish riots that occurred in Kishinev, which was the capital of the Russian Empire at the time.Opie included four different vocal parts in his sheet music: soprano, alto, tenor and bass. Langille was thrilled when he realized they were channeling what they learned in class into original forms of art.“It shows they care,\" he said. \"It’s exciting for a professor. When you get something exceptional like this, it brings the same joy of a flawless, well-written research paper.” Her artwork depicts the biblical scene of Ezekiel receiving an incredible vision from God, who calls him to become a prophet. In this story about Ezekiel’s journey, “it's really hard to imagine that, from words to actual pictures, because it’s described very strangely,” Sigala said. Ezekiel receives a scroll from God and then eats it, and Sigala said this inspired her to use a scroll and artistically represent how this vision would actually look.From the top to the bottom of the scroll, Sigala took the events described in Ezekiel and chronologically translated the language into a visually captivating representation.The “Call to Prophecy” from Ezekiel 1 contains some of the most “over-the-top imagery in the Hebrew Bible,” in Langille’s opinion. “So to actually conceptualize it and produce this is pretty amazing,” he said.Opie, who was taking the course HST/JST 230: Intro to Jewish Civilization, used an online computer program to write sheet music dedicated to one of the poems written about the Russian pogroms that erupted in 1903. \"Upon the Slaughter,\" written by famed Hebrew poet Hayim Nahman Bialik, is based on the deadly anti-Jewish riots that occurred in Kishinev, which was the capital of the Russian Empire at the time.Opie included four different vocal parts in his sheet music: soprano, alto, tenor and bass. Langille was thrilled when he realized they were channeling what they learned in class into original forms of art.“It shows they care,\" he said. \"It’s exciting for a professor. When you get something exceptional like this, it brings the same joy of a flawless, well-written research paper.” From the top to the bottom of the scroll, Sigala took the events described in Ezekiel and chronologically translated the language into a visually captivating representation.The “Call to Prophecy” from Ezekiel 1 contains some of the most “over-the-top imagery in the Hebrew Bible,” in Langille’s opinion. “So to actually conceptualize it and produce this is pretty amazing,” he said.Opie, who was taking the course HST/JST 230: Intro to Jewish Civilization, used an online computer program to write sheet music dedicated to one of the poems written about the Russian pogroms that erupted in 1903. \"Upon the Slaughter,\" written by famed Hebrew poet Hayim Nahman Bialik, is based on the deadly anti-Jewish riots that occurred in Kishinev, which was the capital of the Russian Empire at the time.Opie included four different vocal parts in his sheet music: soprano, alto, tenor and bass. Langille was thrilled when he realized they were channeling what they learned in class into original forms of art.“It shows they care,\" he said. \"It’s exciting for a professor. When you get something exceptional like this, it brings the same joy of a flawless, well-written research paper.” The “Call to Prophecy” from Ezekiel 1 contains some of the most “over-the-top imagery in the Hebrew Bible,” in Langille’s opinion. “So to actually conceptualize it and produce this is pretty amazing,” he said.Opie, who was taking the course HST/JST 230: Intro to Jewish Civilization, used an online computer program to write sheet music dedicated to one of the poems written about the Russian pogroms that erupted in 1903. \"Upon the Slaughter,\" written by famed Hebrew poet Hayim Nahman Bialik, is based on the deadly anti-Jewish riots that occurred in Kishinev, which was the capital of the Russian Empire at the time.Opie included four different vocal parts in his sheet music: soprano, alto, tenor and bass. Langille was thrilled when he realized they were channeling what they learned in class into original forms of art.“It shows they care,\" he said. \"It’s exciting for a professor. When you get something exceptional like this, it brings the same joy of a flawless, well-written research paper.” Opie, who was taking the course HST/JST 230: Intro to Jewish Civilization, used an online computer program to write sheet music dedicated to one of the poems written about the Russian pogroms that erupted in 1903. \"Upon the Slaughter,\" written by famed Hebrew poet Hayim Nahman Bialik, is based on the deadly anti-Jewish riots that occurred in Kishinev, which was the capital of the Russian Empire at the time.Opie included four different vocal parts in his sheet music: soprano, alto, tenor and bass. Langille was thrilled when he realized they were channeling what they learned in class into original forms of art.“It shows they care,\" he said. \"It’s exciting for a professor. When you get something exceptional like this, it brings the same joy of a flawless, well-written research paper.” Opie included four different vocal parts in his sheet music: soprano, alto, tenor and bass. Langille was thrilled when he realized they were channeling what they learned in class into original forms of art.“It shows they care,\" he said. \"It’s exciting for a professor. When you get something exceptional like this, it brings the same joy of a flawless, well-written research paper.” Langille was thrilled when he realized they were channeling what they learned in class into original forms of art.“It shows they care,\" he said. \"It’s exciting for a professor. When you get something exceptional like this, it brings the same joy of a flawless, well-written research paper.” “It shows they care,\" he said. \"It’s exciting for a professor. When you get something exceptional like this, it brings the same joy of a flawless, well-written research paper.” Student Alison Sigala created a painted scroll based on chapters of Ezekiel in the Hebrew Bible for her final project in REL/JST 315: Hebrew Bible. Student Alison Sigala created a painted scroll based on chapters of Ezekiel in the Hebrew Bible for her final project in REL/JST 315: Hebrew Bible. A close-up of Sigala's scroll project . A close-up of Sigala's scroll project . Student Samuel Opie created sheet music to accompany the poem \"Upon the Slaughter\" for his final project in HST/JST 230: Intro to Jewish Civilization. Student Samuel Opie created sheet music to accompany the poem \"Upon the Slaughter\" for his final project in HST/JST 230: Intro to Jewish Civilization. Opie included four different vocal parts in his sheet music for his final project. Opie included four different vocal parts in his sheet music for his final project. Communications specialist, School of Historical, Philosophical and Religious Studies 480-727-3203\nerica.may@asu.edu Contact us ",
    "title": "With thesis project, student discovers Korean culture through ASU school | ASU News",
    "datetime": "2018-04-09T09:26:00-07:00",
    "url": "https://news.asu.edu/20180409-discoveries-asu-simon-huynh-korean-culture-silc"
}