{
    "text": "© THE INTERCEPT ALL RIGHTS RESERVED The Medal of Honor will be awarded to Britt Slabinski, who was banned from SEAL Team 6 for alleged war crimes. On May 7, the White House announced that President Donald Trump would award a retired SEAL Team 6 sniper the Medal of Honor, the nation’s highest decoration for battlefield valor. Normally, the presentation of the Medal of Honor is a solemn and meaningful recognition of bravery and heroism. But the announcement of the award for Britt Slabinski — and the concurrent decision to give the same award to John Chapman, a deceased Air Force combat controller — came after a yearslong campaign to recognize disputed events 16 years ago on a remote mountain in Afghanistan. The awards have exposed a rift in the special operations community, a long-running argument pitting the Air Force against the Navy SEALs. More significantly, the decision to award a Medal of Honor to Slabinski represents the enduring failure of the SEALs, the Pentagon, Congress, and the White House to reckon with the dark history of SEAL Team 6 in the post-9/11 wars. All these authorities have refused to conduct any meaningful or robust oversight of a group of elite commandos who have committed war crimes abroad and gone to great lengths to cover them up. On March 3, 2002, a small SEAL Team 6 reconnaissance team led by Slabinski landed atop Takur Ghar, a 10,000-foot peak above the Shah-i-Kot valley in eastern Afghanistan, near the Pakistan border. The mission was part of the U.S. military’s Operation Anaconda, a multi-day effort to squeeze out and kill the last large group of Al Qaeda militants and Taliban fighters hiding in the valley. As it attempted to land, the helicopter took fire from Al Qaeda fighters, and SEAL Neil Roberts fell from the back of the helicopter. The helicopter was heading back to a nearby base when Slabinski and his team realized they had lost a teammate. For two hours, SEAL Team 6 and officers from the Joint Special Operations Command scrambled a rescue force to recover Roberts. Again their helicopter took fire as it landed near the top. Slabinski and his team, including John Chapman, rushed out amid small arms fire from the Al Qaeda militants. The team split and Chapman was hit two minutes after engaging the militants. With additional teammates severely wounded, and believing Chapman was dead, Slabinski ordered his SEAL team to retreat down the mountain. A quick reaction force, consisting mostly of Army Rangers, then engaged in a pitched battle for control of Takur Ghar, as Slabinski called in airstrikes from his position down the side of the mountain. Ultimately, Roberts, Chapman, and five others were killed over the course of the battle, which became known as Roberts Ridge. Air Force Tech. Sgt. John Chapman, who died at the battle of Roberts Ridge, March 3,  2002, in Afghanistan. These details are largely agreed upon. Chapman and Slabinski both received service crosses, the military’s second-highest award. After Roberts’s body was recovered, the military determined that he had been mutilated, a horrific act that led SEAL Team 6 operators to engage in a cycle of vengeance against enemy fighters in both Afghanistan and Iraq. From practically the moment Slabinski and his team returned to Bagram Air Base, others in the special operations community questioned whether he had erred in his assessment that Chapman was dead and retreated with a member of his team still alive. In 2016, after the Pentagon began reassessing silver stars and service crosses awarded during the war on terror, the Air Force put together forensics and drone video that they claimed showed Chapman got up after Slabinski and the SEALs retreated and continued to fight, alone and outnumbered, before succumbing to his wounds. The SEALs disagreed, and Rear Adm. Timothy Szymanski, the commanding officer of Naval Special Warfare, pushed for an upgrade for Slabinski’s service cross. Both current and former military members say the inter-service fight between the SEALs and the Air Force special operations command has been ugly and unbecoming. According to a Navy officer, the SEALs made several efforts to block an upgrade for Chapman, infuriating the Air Force. Presentations of the Medal of Honor are almost always fraught with questions about whether the awards are handed out to make those involved in operations feel better about a loss of life. There’s “always some kind of solace sought in decorating someone with the award,” said one of Slabinski’s former leaders at SEAL Team 6, who spent more than 30 years in Special Operations. “A lot of it has to do with politics and rank and stature and always, in my opinion, the more dynamic and public the screw-up, the more likely it is that someone is going to get highly decorated.” Another of Slabinski’s former teammates said 25 years of experience as a SEAL convinced him that the award system for valorous action has little integrity. “One of my commanders told me point-blank: The bigger the fuck-up, the bigger the award.” The retired SEAL leader, who studied the battle at Roberts Ridge extensively for the military and discussed the events with Slabinski, said the issue was not whether Chapman or Slabinski were deserving of a medal upgrade, but why the military was motivated to extend that honor so many years later. “This is the madness of the Medal of Honor,” he said. “Rarely is it granted when things go well.” By awarding both Chapman and Slabinski the Medal of Honor, the Pentagon presents an impossible version of what happened on Roberts Ridge. By awarding it to Chapman, the military endorses the view that Chapman survived his initial injuries and fought with valor after Slabinski and his SEAL team retreated down the mountain. If that’s true, then Slabinski left his teammate behind, violating the first rule of special operations. By awarding Slabinski the Medal of Honor, the military essentially ignores the Chapman narrative and supports the notion that Slabinski’s actions that day were heroic. Both versions of what happened at Takur Ghar cannot be true. But the argument over how Slabinski determined Chapman was dead, and when Chapman may have died, is really a distraction from the true significance  of what came down from Takur Ghar after the battle for Roberts Ridge. Rear Adm. Tim Szymanski led the push for Britt Slabinski’s Medal of Honor and promoted him after he was barred from SEAL Team 6 for suspected war crimes.\nPhoto: U.S. NavyNo one pushed for the upgrade more than Szymanski, according to both current and former Navy officers. Members of SEAL Team 6 have told me they believe the award is meant, in large part, to help validate and cover up a series of ultimately fatal decisions taken by Szymanski and other senior SEAL Team 6 officers. Rear Adm. Tim Szymanski led the push for Britt Slabinski’s Medal of Honor and promoted him after he was barred from SEAL Team 6 for suspected war crimes. As the SEAL Team 6 operations officer at Bagram Air Base, Szymanski was the mission planner for Slabinski’s reconnaissance team. Szymanski and his superior officers effectively limited Slabinski’s options, forcing him to land on what they later discovered was a well-established enemy position, rather than allowing the team to land lower on the mountain and clandestinely patrol the top. The former unit leader who served several years with Szymanski said he had no doubt that his former teammate pushed for the upgrade to assuage his own guilt about putting Slabinski and his team in what became a disastrous position. Slabinski’s military career did not end on March 4, 2002. He spent another 12 years in the military, almost all of it at SEAL Team 6, where he ended up as a senior enlisted leader. For many, he was a legendary SEAL. Inside the secret world of what the military refers to as a “Tier 1” unit, however, Slabinski is part of another legacy, one which also stems from what happened during Roberts Ridge. That legacy involves Szymanski as well. In the days after Takur Ghar, Slabinski and others in SEAL Team 6 sought “payback” for Roberts, Chapman, and the other casualties. Slabinski later told author Malcolm MacPherson, in a taped interview obtained by The Intercept, that a few days after the battle, his team ambushed and killed nearly two dozen Al Qaeda fighters headed toward the Pakistan border. After the militants had been killed, Slabinski described a form of “therapy”: I mean, talk about the funny stuff we do. After I shot this dude in the head, there was a guy who had his feet, just his feet, sticking out of some little rut or something over here. I mean, he was dead, but people have got nerves. I shot him about 20 times in the legs, and every time you’d kick him, er, shoot him, he would kick up, you could see his body twitching and all that. It was like a game. Like, ‘hey look at this dude,’ and the guy would just twitch again. It was just good therapy. It was really good therapy for everybody who was there. Audio from an unpublished interview with Britt Slabinksi conducted by Malcolm MacPherson, author of a 2005 book on the battle of Roberts Ridge. For almost four years after Roberts Ridge, SEAL Team 6 intentionally limited Slabinski’s battlefield exposure. The trauma from Roberts Ridge was clear — and Slabinski has said that he still sees fighters moving in slow motion from that day. In 2007, Slabinski was sent back to Afghanistan as a squadron master chief, which made him the senior noncommissioned officer of Blue Squadron. His two-year assignment at Blue came as the SEAL Team 6 leadership began receiving reports that small groups of SEALs were committing what they believed were war crimes: cutting, mutilating, and otherwise desecrating enemy fighters with knives and custom-made hatchets. In addition, SEAL Team 6 operators were “canoeing” dead or dying enemy targets — firing bullets at close range to the top of the skull, splitting it open at the forehead and exposing the brain matter. In late 2007, members of Blue Squadron were twice investigated by Naval Criminal Investigative Service and JSOC. The first investigation resulted from allegations that a SEAL had attempted to behead a Taliban fighter in southern Afghanistan after Slabinski told his men he wanted a “head on a platter.” As I reported in 2017, Slabinski told his superiors and later investigators that there had been no beheading, saying there was “no foul play.” A former investigator with direct knowledge of the case told me that it was clear from the beginning of the beheading investigation that SEAL Team 6 had brought in NCIS to conclude that no war crime had occurred. “We knew we’d been called in to give them the result they wanted — that everyone was clean,” the former Navy officer said. The NCIS investigation was part of the cover-up. Shortly after the beheading incident, Slabinski’s team was accused of killing unarmed men in an operation. That investigation, too, resulted in the SEALs being cleared. Three years later, in 2010, Slabinski was up for a promotion when SEAL Team 6 decided to re-examine his tour with Blue Squadron. The command confirmed that Slabinski had in fact covered up the attempted beheading. Slabinski also admitted he had given an illegal order for his men to shoot all males on an operation regardless of whether or not they were armed, according to a person with direct knowledge of the investigation. Ultimately, however, the military concluded all the men killed during that operation were armed. As a result of these inquiries, a group of 10 SEAL Team 6 leaders later voted unanimously to ban Slabinski from ever serving at the command again. After Slabinski’s admission, the most senior enlisted member of SEAL Team 6 told him, “That’s not what we’re about. We can’t have you here.” As I reported in 2017, one of Slabinski’s former superiors said: “To this day, he thinks the guys turned on him. Well, they did. What we didn’t do was turn him in. You will step over the line and you start dehumanizing people. You really do. And it takes the team, it takes individuals to pull you back. And part of that was getting rid of Britt Slabinski.” Naval Special Warfare has consistently stated that the allegations against Slabinski and SEAL Team 6 are “unfounded,” and that each has been “previously investigated and determined to be not substantiated.” Despite months of my repeated inquires to SEAL Team 6 and Naval Special Warfare, no one would answer a simple question: If no crimes had been committed, why bar Slabinski from SEAL Team 6? Syzmanski and Slabinski did not respond to requests for comment. The answer lies in how effective and widespread the culture of lies and cover-ups has been at SEAL Team 6. In each of Slabinski’s 2007 investigations, both NCIS and JSOC found no evidence of violations of the laws of armed conflict, as they describe war crimes. But three years later, a small group of unit leaders quickly substantiated the allegations and even secured a confession. The command thus demonstrated that it was perfectly capable of determining the truth for internal purposes — and once again proved it was unwilling to expose even its pariahs to external scrutiny or justice. After learning that he would never again serve at SEAL Team 6,  Slabinski was thrown a lifeline by Szymanski, then commodore of Naval Special Warfare Group 2, who selected him to be his command master chief. His career should have been over, yet he was given a promotion. Some inside SEAL Team 6 were stunned. From their perspective, Szymanski had willingly requested a suspected war criminal to be his senior noncommissioned officer. When asked why he would bring in Slabinski after he was thrown out of SEAL Team 6 for alleged war crimes, a SEAL Team 6 leader told me that Szymanski told his fellow SEALs that their community could not shun a war hero. In their time commanding Group 2, Szymanski and Slabinski helped craft what has become the unofficial Navy SEAL creed, which ends with this: I serve with honor on and off the battlefield. The ability to control my emotions and my actions, regardless of circumstance, sets me apart from other men. Uncompromising integrity is my standard. My character and honor are steadfast. My word is my bond. In 2015, after he retired, Slabinski gave an on-the-record interview to the New York Times in which he denied giving the illegal order to shoot any man. He also implied that it was his leadership and discipline that prevented the near-beheading in 2007. In the view of senior SEAL Team 6 leaders, Slabinski had lied. Even worse, he’d done so while speaking to the press. For that sin, SEAL Team 6 added Slabinski to the “rock of shame,” a list of former members of SEAL Team 6 who were no longer welcome to visit the command. Already barred from serving at SEAL Team 6, Slabinski was now physically banished. “That’s what’s wrong with my community,” a former SEAL Team 6 leader told me last year. “Our sense of what’s right and what’s wrong is warped. No one was upset that he ordered a beheading or all the men shot even if they were unarmed. They were mad because he spoke to the New York Times and lied.” One of the regulations governing military awards, including the Medal of Honor, states that “no medal, cross, or bar, or associated emblem or insignia may be awarded or presented to any person or to his representative if his service after he distinguished himself has not been honorable.” By the military’s own standard, Slabinski should have been disqualified from the Medal of Honor for his actions in subsequent deployments to Afghanistan. But Slabinski’s dishonorable actions are only a part of a much larger problem. Senior officers of SEAL Team 6 bear the ultimate responsibility, both for tactical failures, such as the decisions that placed Slabinski’s team at the top of Takur Ghar, and for leadership failures, for turning a blind eye to a broad pattern of war crimes and other military misconduct. For 15 years, as SEAL Team 6 senior officers and leaders received reports that their operators were skinning, scalping, canoeing, and otherwise mutilating enemy corpses with custom-made hatchets in Afghanistan and Iraq, they either ignored the warnings or helped cover them up. “By giving Slabinski the award, you close the door on our criminal history,” said the former SEAL Team 6 leader. “The cover-up wins. You’ve closed this ugly part of our command’s history, and everyone gets away with it. What everyone learns from this is that cover-ups work — don’t say anything bad about your teammates, keep quiet and we’ll get through it. It’s disgraceful.” Correction: May 22, 2018 A previous version of this article stated that John Chapman’s Medal of Honor was announced by the White House on May 7  along with Britt Slabinski’s. Although Chapman’s medal had been approved, it has not yet been formally announced. Top photo: An undated official portrait of retired Master Chief Special Warfare Operator (SEAL) Britt K. Slabinski. James Risen Exclusive interviews with Daniel Ellsberg and a long-buried memo reveal new details about one of the 20th century's biggest scoops. Nick Turse The senator’s proposal would require Biden to withdraw forces from the West African nation within 30 days. Voices Jon Schwarz Echoing George W. Bush on 9/11, a Misgav Institute report shows how political leaders find a chilling silver lining in the suffering of their own. Ben Stockton, Amy Westervelt Sultan Al Jaber, CEO of the UAE’s national oil company, secured the COP28 presidency despite questions over his green credentials. © The Intercept. All rights reserved ",
    "title": "With Medal of Honor, SEAL Team 6 Rewards a Culture of War Crimes - The Intercept",
    "datetime": "2018-05-22T16:01:58+00:00",
    "url": "https://theintercept.com/2018/05/22/medal-of-honor-navy-seal-team-6-britt-slabinski/"
}