{
    "text": "Vinh Trang Pagoda near My Tho, a Vietnamese city known as the \"Gateway to the Mekong Delta\" KALAMAZOO, Mich.—The U.S. Department of Education has awarded a $362,000 Undergraduate International Studies and Foreign Language Grant to Western Michigan University and its consortium partner, Kalamazoo College. The three-year grant will support a community-based education program called the Southwest Michigan Education Initiative on the East Indian Ocean. This program will enhance global, humanities-based education for students and faculty members and address a key language need expressed by West Michigan residents of South Asian and Southeast Asian descent. \"We want this project to be responsive to the needs of our community,\" explains Dr. Jane E. Blyth, interim associate provost and executive director of WMU's Haenicke Institute for Global Education, \"and at the same time strengthen the global engagement of Western Michigan University and Kalamazoo College.\" Over the three-year life of the grant funding, the WMU and K College partners will design workshops for faculty members at both institutions who are interested in incorporating South Asia- and Southeast Asia-related topics into their courses. These semester-long, intercollegial workshops will focus on methods and strategies to integrate that content into existing courses at both schools. \"The more faculty who incorporate this content into their pre-existing courses, the greater the impact we expect to see,\" says Blyth, who serves as the grant program's co-principal investigator. WMU will offer courses in Vietnamese and Hindi/Urdu languages through the Department of World Languages and Literatures under the guidance of its department chair, Dr. Molly Lynde-Recchia. In addition, the colleges of Arts and Sciences and Fine Arts will expand offerings in content-related courses about South and Southeast Asia. New classes on the Bollywood film industry, Vietnamese performance traditions, and new media among diasporic Southeast and South Asian populations are expected to draw student interest. The consortium also will develop more study abroad programs, internships with local cultural organizations and other opportunities for WMU and K College students to interact with people from the two targeted regions. The Southwest Michigan Education Initiative on the East Indian Ocean draws on the expertise and experience of faculty at both institutions. Dr. Alexander M. Cannon, WMU assistant professor of music history and ethnomusicology and a scholar of Vietnamese traditional music, is the grant program's other co-principal investigator. He will facilitate workshops and activities related to Southeast Asia. Dr. Nathan L.M. Tabor, WMU assistant professor of history and a scholar of South Asia, is the program's manager. Dr. Carol Anderson, K College professor of religion, will coordinate with Tabor on the workshops and activities related to South Asia. A substantial number of people who reside in West Michigan trace their heritage to South Asian nations such as Afghanistan, Bangladesh, India, Nepal and Pakistan and to Southeast Asian nations such as Cambodia, Indonesia, Malaysia, the Philippines, Singapore, Thailand and Vietnam. The 2010 U.S. Census reports that southwest Michigan is home to more than 3,500 people of South Asian ancestry. The Southeast Asian population in southwest and West Michigan includes nearly 6,000 people of Vietnamese descent alone, most of them residing around Grand Rapids. \"Many of our young people can't communicate with their elders due to language barriers,\" says Phillip Nguyen, president of the Vietnamese-American Community of Grand Rapids, which is a community partner on the grant project. \"The Vietnamese classes offer our community's young people a chance to learn their parents' language while receiving college credit for it.\" Cannon notes that the language classes and other grant program activities should generate greater interest in South and Southeast Asia locally. \"The initiative is unique,\" he adds. \"It brings together expertise, especially in Vietnam and South Asia, and proposes that the historical connections between our area of Michigan and the East Indian Ocean region remain strong.\" For more information on language offerings and other aspects of the grant program, visit wmich.edu/global or contact Nathan Tabor at nathan.tabor@wmich.edu or (269) 387-4643. For more WMU news, arts and events, visit wmich.edu/news. Western Michigan UniversityKalamazoo MI 49008-5200 USA(269) 387-1000Contact WMU WMU Notice of Non-DiscriminationLand Acknowledgment Statement © 2023 All rights reserved. ",
    "title": "WMU, K College grant to bolster Asian language and culture classes | WMU News | Western Michigan University",
    "datetime": "2017-04-07T18:04:18-04:00",
    "url": "https://wmich.edu/news/2017/04/39247"
}