{
    "text": "In subsistence economy, women may have moved settlements after marriage PLOS image: Location of sampled sites and other CW sites mentioned in the text.\nview more Credit: Map by K-G Sj&ouml;gren, using public domain data. Women in Corded Ware Culture may have been highly mobile and may have married outside their social group, according to a study published May 25, 2016 in the open-access journal PLOS ONE by Karl-Göran Sjögren from Göteborg University, Sweden, and colleagues. The Corded Ware Culture is archaeologically defined by material traits, such as the burial of the dead under barrows alongside characteristic cord-ornamented pottery, and existed in much of Europe from ca. 2800-2200 cal. B.C. To better understand this culture, the authors of the present study examined human bones and teeth from seven sites in Southern Germany dating from different periods of Corded Ware culture, including two large cemeteries. They used carbon dating and additional dietary isotope analysis to assess the diet and mobility of the population during this period. The researchers found great dietary variation both between and within sites, indicating that the people of the Corded Ware culture subsisted in a variety of ways. Like humans in earlier cultures, they consumed both animal and plant matter. However, it is likely that at least some sites practiced more intense dairy and arable farming than in previous periods. Around 42% of individuals buried in one of the large cemetery sites were found to be non-local, with many females likely to have originated from elsewhere. This result may indicate that women across generations in this culture were very mobile. The authors suggest that their evidence of varied diet and mobility supports the possibility of a stable system of female exogamy, where women married outside of their social group and moved to their husbands' settlements, in Corded Ware Culture. Karl-Göran Sjögren notes: \"Our results suggest that Corded Ware groups in southern Germany were highly mobile, especially the women. We interpret this as indicating a pattern of female exogamy, involving different groups with differing economic strategies, and suggesting a complex pattern of social exchange and economic diversity in Late Neolithic Europe.\" ### In your coverage please use this URL to provide access to the freely available paper: http://dx.plos.org/10.1371/journal.pone.0155083 Citation: Sjögren K-G, Price TD, Kristiansen K (2016) Diet and Mobility in the Corded Ware of Central Europe. PLoS ONE 11(5): e0155083. doi:10.1371/journal.pone.0155083 Funding: European Research Council, Advanced Grant ERC-2010-AdG -Proposal n° 269442 THE RISE https://erc.europa.eu/. Competing Interests: The authors have declared that no competing interests exist. Journal\nPLoS ONE\n\n\nDOI\n10.1371/journal.pone.0155083 PLoS ONE 10.1371/journal.pone.0155083 Disclaimer: AAAS and EurekAlert! are not responsible for the accuracy of news releases posted to EurekAlert! by contributing institutions or for the use of any information through the EurekAlert system. Media Contact Beth Jones\n\n\n                onepress@plos.org PLOS   Copyright © 2023 by the American Association for the Advancement of Science (AAAS) Copyright © 2023 by the American Association for the Advancement of Science (AAAS)  ",
    "title": "Women in southern Germany Corded Ware culture | EurekAlert!",
    "url": "https://www.eurekalert.org/pub_releases/2016-05/p-wis051916.php"
}