{
    "text": "Sign up to the GCR newsletter for free, delivered direct to your inbox. Reach 97,000 UK and global construction experts. The project is being handled by the company’s CJ LiveCity subsidiary in partnership with Los Angeles-based Anschutz Entertainment Group (AEG), and will be located in Greater Seoul’s Goyang City. Speaking in June, when the tie-up with AEG was announced, Michael Kim, CJ LiveCity’s chief executive, said: “This collaboration combines CJ’s long-standing cultural business capabilities with AEG’s venue development and operations expertise and its global live touring and promotions capacities. “Seoul Metropolitan Arena, which will be designed by a leading architectural firm, is expected to be a competitive venue not only across Asia, but also globally due to performances of K-Pop as well as world-renowned artists.” The arena, which will hold its first show in 2024, is designed to accommodate 20,000 indoor attendees with another 40,000 watching from outside. The aim is to hold up to 190 events a year. According to CJ Group, it will be equipped with “the most powerful live performance infrastructure in the world”, suggesting spectacular visual effects and a powerful PA system. CJ Group is hoping to use the stadium as the anchor of a “Live K-content experience district”, which it said could attract fifth of K-pop’s estimated 100 million fans each year. As well as the arena, there will be a studio complex, a K-culture-themed entertainment district and waterfront park. As well as K-pop, AEG said in a June press release that the stadium could be a stop on world tours by acts such as Justin Bieber, Paul McCartney, Elton John, Shawn Mendes, Celine Dion, Khalid, Taylor Swift, the Rolling Stones and Katy Perry. As well as the physical developments, CJ is hoping to be one of the first companies to enter the “metaverse” – a virtual reality experience that enables fully immersion in a digital environment in which an “infinite audience” can interact and communicate with each other in real time as well as enjoy “a content experience beyond time and space constraints”. ",
    "title": "Work begins on K-pop’s 60,000-capacity stadium home - Global Construction Review",
    "datetime": "2021-11-03T13:10:05+00:00",
    "url": "https://www.globalconstructionreview.com/works-begins-on-k-pops-60000-capacity-stadium-home/"
}