{
    "text": "HOT TOPICS Korean-language test to be held up to 8 times abroad in 2024 Korean Red Cross builds temp homes for Turkish quake victims Food Clothing and Fashion Traditional Decorative Knots, Maedeup: Donated Works by Lee Bu-ja Jinju Namgang Yudeung Festival Policies Nov 25, 2022 Minister of Culture, Sports and Tourism Park Bo Gyoon (left) on Nov. 23 takes a commemorative photo with Qatari Minister of Culture Abdulrahman Al Thani in Doha, Qatar. By Park Hye Ri Photos = Ministry of Culture, Sports and Tourism Minister of Culture, Sports and Tourism Park Bo Gyoon on Nov. 23 in Doha, Qatar, held talks with Qatari Minister of Culture Abdulrahman Al Thani on expanding bilateral exchanges in culture and sports using the Qatar World Cup as an opportunity.  \"Like the lyrics of the official World Cup song 'Dreamers' sung by Jungkook of BTS at the opening ceremony, the Qatar World Cup started off as a festival of dreams combining sports, culture, architecture and IT,\" Minister Park said.  \"The prospects for exchange and cooperation between K-culture, which people around the world are passionate about, and Qatari culture, which blends tradition and the present and future, are huge with considerable potential for expansion.\" In response, Minister Al Thani said the joint performance of Jungkook and Qatari singer Fahad Al Kubaisi at the ceremony was a vibrant scene of bilateral cultural and artistic exchange. \"To strengthen cultural and artistic cooperation between our countries, let's prepare a way to use social networking services and hold detailed discussions between officials from both sides,\" he added.  The two minsters also agreed to push for exchange and cooperation in museums and libraries, something that had been suspended due to the COVID-19 pandemic.  Minister of Culture, Sports and Tourism Park Bo Gyoon (left) on Nov. 23 in Doha, Qatar, holds bilateral talks with Qatari Minister of Culture Abdulrahman Al Thani. Gov't signs first joint statement with S. Arabia in 43 years ",
    "title": "World Cup offers chance to boost ties with Qatar in culture, sports : Korea.net : The official website of the Republic of Korea",
    "url": "https://www.korea.net/NewsFocus/policies/view?articleId=224902"
}