{
    "text": "Culture | Books The Evening Standard's journalism is supported by our readers. When you purchase through links on our site, we may earn an affiliate commission. Zero K is not easy reading. Don DeLillo’s novels have always tended to be verbal installations as much as they are stories, descriptions of spaces, floatings of ideas, gnomic sayings. Here, in his 16th, published at the age of 80, this static style takes over almost completely. The title refers to absolute zero, minus 273.15 degrees centigrade, for this is a novel about cryonics, the freezing of dead people in the hope that future technologies will allow them to be revived. Part One  of the novel, 154 of its 274 pages, is a protracted description of a vast, mostly underground, cryogenics operation, called the Convergence, located on the borders between Kyrgyzstan and Kazakhstan. The first-person narrator, 34-year-old Jeff, has been flown there by his billionaire father Ross Lockhart, one of the main backers of the project, to witness his terminally ill stepmother, Artis, enter into this suspended animation. Jeff, whose loyalties lie with his own mother, Madeleine, whose deathbed he attended, is sceptical of the entire set-up. Although not a Catholic, he once attended church on Ash Wednesday and had his forehead imprinted by the priest’s thumb: “Dust thou art... And to dust thou shalt return.” Nevertheless, he explores the Convergence, cut deep into the rock. One of the place’s features is a screen showing the disasters afflicting the world outside — floods, fires, wars, terrorism — a device which allows DeLillo to indulge extensively in his favourite technique of describing apocalyptic imagery at arm’s length (ekphrasis) rather than addressing reality itself. Yet Jeff remains convinced that what he is seeing is no more than “a highly precise medical procedure guided by mass delusion, by superstition and arrogance and self-deception”. He sees the whole endeavour as the final purchase of a man driven and shaped by money. The section ends with the disembodied monologue of Artemis, whose brain continues to stir — “am I someone or is it just the words themselves that make me think I am someone” — amounting to little more than a poor pastiche of Beckett. Part two of the novel, much more readable, sees Jeff back in New York, turning down his father’s job offer, describing his changing relationship with a teacher, Emma, who has a strange son adopted from the Ukraine, Stak. They visit an art gallery displaying a single huge natural rock and Jeff quotes Heidegger: “Man alone exists. Rocks are, but they do not exist. Trees are, but they do not exist. Horses are, but they do not exist.” But he returns to the Convergence to see his father voluntarily join Artis in frozen animation and visits the hall in which the dormants are held. “This was pure spectacle, a single entity, the bodies regal in their cryonic bearing. It was a form of visionary art, it was body art with broad implications,” he observes. But for himself he knows: “I’d never felt more human than I did when my mother lay in bed, dying.” The novel ends in fragmentary observations, closing with an epiphany evidently experienced by DeLillo himself, a moment, once or twice a year, when the sun’s rays align perfectly with the street grid in Manhattan, as if the city were one gigantic henge — “the full solar disk, bleeding into the streets...  An intimate touch of Earth and Sun...” Zero K, behind its abstractions and opacities, bafflements and removals, embraces mortality. “Ordinary moments make the life,” one of the novel’s simplest sentences tells us. Zero K is far from an ordinary novel — though not entirely for its own good. From £20, Amazon, Buy it now The Wood for the Trees: The Long View of Nature from a Small Wood by Richard Fortey- review This Must be the Place by Maggie O’Farrell- review Serious Sweet by A L Kennedy- review Strangers in Our Midst: The Political Philosophy of Immigration by David Miller- review MORE ABOUT Have your say... 1 boxing 30,336 Tyson Fury vs Francis Ngannou: Fight time, undercard, latest odds, prediction, purse and ring walks 2 crime 7,119 Lewis Edwards: Paedophile police officer who incited girls to send degrading pictures is jailed for life 3 london 5,657 Clapham resident's makeshift Shetland pony enclosure sparks complaints from neighbours ",
    "title": "Zero K by Don DeLillo - review | London Evening Standard | Evening Standard",
    "datetime": "2016-05-19T16:56:49.000Z",
    "url": "https://www.standard.co.uk/culture/books/zero-k-by-don-delillo-review-a3252556.html"
}