{
    "text": "The Łutsel K'e Dene First Nation is demanding an apology and investigation from the Northwest Territories government after a \"forceful invasion\" of a cultural camp Tuesday that they described as \"invasive,\" \"aggressive and disrespectful.\" According to the First Nation, wildlife officers helicoptered into a camp on Artillery Lake on Sept. 13 and spent hours searching family tents and teepees. They were investigating illegal caribou harvesting within a mobile no-hunting zone that follows the Bathurst caribou herd to protect it from hunters, given the incredibly low number of animals now in the herd. Larry Innes, the lawyer for the Łutsel K'e Dene First Nation, said details of what happened are still coming in. \"The officers indicated that they had a tip that people were harvesting within the closed zone for the Bathurst caribou,\" he said. \"They then presented a warrant and indicated they had authority to search the camp for evidence of illegal hunting.\" The camp is about 150 kilometres away from the mobile zone, Innes said. Harvesters were using charter planes to access areas near the mobile hunting zone, but the First Nation doesn't have any information to suggest harvesting took place within the mobile zone. He said officers went through every tent, cache and location where meat was stored at the camp, and took samples of meat, hair and bone. \"During that time, they explained that if anyone interfered with their investigation, they would be charged with obstruction and that additional officers were available to execute the warrant by force if necessary,\" he said. No one has been charged yet, he said. The First Nation intends to challenge the validity of the warrant. In a statement Thursday morning, Environment and Natural Resources Minister Shane Thompson confirmed officers went to the camp to execute a search warrant. Neither Thompson nor anyone from the environment department were willing to be interviewed. Thompson stated officers found the carcasses of 10 caribou within the mobile zone and \"a significant amount of suspected wasted edible meat was identified.\" He said officers received two independent reports from members of the public on Monday about illegal harvesting. \"Officers initiated a field investigation at the site as well as at a secondary location working under the authority of the Wildlife Act, with a search warrant,\" he wrote. The department can't share a lot of details, he said, because an active investigation is underway. Thompson added many wildlife officers with his department have lived in the North for a long time. \"Caribou are important to them, the communities they live and work in and to elders,\" he stated. \"Investigations like this are challenging. Enforcement of the mobile zone is an important part of the collaborative conservation measures we are taking to conserve the Bathurst herd.\" The Bathurst herd has dwindled from 470,000 animals in 1986 to about 6,200 in 2021. In a news release Wednesday evening, the Łutsel K'e Dene First Nation's acting chief Charlie Catholique said they're seeking a full explanation and apology from the territorial government. Iris Catholique, the Thaidene Nëné manager for Łutsel K'e Dene First Nation, declined an interview. However, in the news release, she wrote that children were crying and elders were traumatized during the tent-by-tent search. \"We are shocked that the GNWT would carry out what amounted to a forceful invasion of our cultural camp,\" Catholique stated. \"This was a completely unreasonable search and an unnecessary violation of our Aboriginal and treaty rights. It reminds us that all the talk about reconciliation and new relationships is just talk until there is a real change in how other governments deal with us on the ground.\" Catholique described the search as a \"serious setback\" in the relationship between the territorial government and the Łutsel K'e people. Innes said the camp, which had about 80 people, is located at a former village site for the Łutsel K'e people — a site of huge significance and importance to families who grew up there. The raid happened in front of elders, children and guests from across Canada and the world, he said. \"Shock and outrage only begins to describe the depth of people's reaction to this,\" he said. \"For elders who lived through a period where they quite literally feared wildlife officers, before constitutional protections for Indigenous rights were implemented in Canadian law, this was a hugely triggering event.\" Innes said he, too, was shocked by the raid, given the constitutional protections that exist against unreasonable searches and seizures in people's homes. He said the territory's Wildlife Act defines tents as homes. \"I'm confounded. I can't believe that officers were able to obtain a warrant to search, in effect, an entire village, on allegations of illegal harvesting,\" he said. \"That would be like police obtaining a warrant to search an entire community on an allegation that someone in the community might have committed a crime. It stretches the bounds of what the law allows.\" In his statement, Thompson said the government values its partnership with the First Nation and wants to keep working together to protect caribou. \"ENR also recognizes and supports the importance of traditional on-the-land activities, seasonal hunting camps, culture camps and traditional lifestyles,\" he wrote, adding the department \"sincerely acknowledges\" the First Nation's efforts toward conserving caribou. Reporter April Hudson is a digital journalist with CBC News in Yellowknife. After a career in print journalism in the N.W.T. and Alberta, she joined CBC North in 2021. You can reach her at april.hudson@cbc.ca. With files from Marc Winkler Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636 It is a priority for CBC to create products that are accessible to all in Canada including people with visual, hearing, motor and cognitive challenges. Closed Captioning and Described Video is available for many CBC shows offered on CBC Gem.  ",
    "title": "Łutsel K'e Dene First Nation decries 'forceful invasion' of culture camp by wildlife officers | CBC News",
    "url": "https://www.cbc.ca/news/canada/north/lutsel-k-e-culture-camp-raid-1.6583814"
}