{
    "text": "Information on the 2021 K-Culture Festival. The K-Culture Festival is a signature, global Hallyu festival introducing various aspects of Korean culture. This year, the festival will be held at KINTEX in Goyang from November 13 to 14. This year’s festival not only puts a spotlight on the Hallyu fans but also takes a step further to provide a sense of belonging and accomplishment for them under a metaverse concept of ‘FANIVERSE’ and a slogan of ‘BIT: Bright / Together.’ K-pop concert and Korean culture experience and exhibition fan engagement programs will open, and fans can participate in ‘2021 K-Culture Festival Campaign Song Creation Contest,’ the first fan engagement program for this year. (Graphic: Business Wire) Information on the 2021 K-Culture Festival. The K-Culture Festival is a signature, global Hallyu festival introducing various aspects of Korean culture. This year, the festival will be held at KINTEX in Goyang from November 13 to 14. This year’s festival not only puts a spotlight on the Hallyu fans but also takes a step further to provide a sense of belonging and accomplishment for them under a metaverse concept of ‘FANIVERSE’ and a slogan of ‘BIT: Bright / Together.’ K-pop concert and Korean culture experience and exhibition fan engagement programs will open, and fans can participate in ‘2021 K-Culture Festival Campaign Song Creation Contest,’ the first fan engagement program for this year. (Graphic: Business Wire)  SEOUL, South Korea--(BUSINESS WIRE)--The Ministry of Culture, Sports and Tourism of the Republic of Korea (MCST, Minister Hwang Hee) and Korean Foundation for International Cultural Exchange (KOFICE, President Jung Kil-hwa) are hosting the ‘2021 K-Culture Festival’ this coming November. Celebrating its second year, the ‘K-Culture Festival’ is a signature, global Hallyu festival introducing various aspects of Korean culture, ranging from Korean food, beauty, and fashion to K-pop at its core. The festival provides a stage for Hallyu fans across the globe to experience Korean culture and interact with one another. This year’s ‘K-Culture Festival’ not only puts a spotlight on the fans but also takes a step further to provide a sense of belonging and accomplishment for them under a metaverse concept of ‘FANIVERSE,’ which is a coined term combining ‘fan’ and ‘universe,’ and a slogan of ‘BIT: Bright / Together.’ Moreover, the festival is designed to let the fans transition and change their role from a follower of culture to an actual leader of culture. On September 13, MCST and KOFICE appointed Kim Hyung-suk as the Chief Director for the festival. Chief Director Kim has been selected based on his pop music composing skills, credentials of discovering and producing top-class artists in Korea, and experiences of leading popular events in the past. As Chief Director, he will oversee the K-Culture Festival, scheduled to be held in November, from the planning stage to managing the event and directing the Campaign Song Creation Contest. This year's festival will be held at KINTEX in Goyang for two days from November 13 to 14, with the following programs for Hallyu fans around the world: K-pop concert, and Korean culture experience and exhibition fan engagement programs. In particular, on November 14, the second day of the event, the campaign song produced by Chief Director Kim Hyung-suk and a Hallyu fan will be presented as the finale song amid performances focused on K-pop by famous local and foreign artists with global fandoms. The first fan engagement program for this year is the ‘2021 K-Culture Festival Campaign Song Creation Contest’ as an effort to overcome COVID-19. With the theme of the digital music contest aligning with the festival’s slogan ‘BIT: Bright / Together’, any global Hallyu fan can participate in the contest. With a total of three winners, the first, second, and third place winners will receive prize money of KRW 10 million, KRW 5 million, and KRW 1 million, respectively. In particular, the no. 1 winner will be given the privilege to work with composer Kim Hyung-suk and release the official music for the festival as well as record the song in collaboration with popular K-pop singers. In order for a fair judging process, KOFICE formed a judging panel comprised of experts in the pop culture sector so composer Kim Hyung-suk and Lee Hyun-seung, lyricist Yang Jae-seon, producer Junjaman will evaluate based on the following criteria: suitability of theme; originality; balance and completeness; utilization and mass appeal. Chief Director Kim Hyung-suk said, “Korea’s pop culture is gaining more attention thanks to local and global fans so it’s not an overstatement to say that fandom is at the core of the Hallyu Wave. Aligning with the ‘FANIVERSE’ concept, we hope that the ‘2021 Korean Culture Festival’ becomes a festival where both artists and fans can enjoy and shine together.” To find out more about ‘2021 K-Culture Festival’ and ‘2021 K-Culture Festival Campaign Song Creation Contest’, visit the event’s official website at kculturefestival.kr.  For Korean Foundation for International Cultural Exchange (KOFICE)\nEdelman Korea\nYoungwoo Kim\n+82-2-2022-8237, +82-70-5223-1758\nSeoulKOFICE@edelman.com Hana Choi\n+82-2-2022-8212, +82-70-5223-1758\nSeoulKOFICE@edelman.com ‘2021 K-Culture Festival’ will be held this November to provide a stage for Hallyu fans to experience Korean culture and interact with one another. For Korean Foundation for International Cultural Exchange (KOFICE)\nEdelman Korea\nYoungwoo Kim\n+82-2-2022-8237, +82-70-5223-1758\nSeoulKOFICE@edelman.com Hana Choi\n+82-2-2022-8212, +82-70-5223-1758\nSeoulKOFICE@edelman.com ",
    "title": "‘2021 K-Culture Festival’ Gathers Fans to Shine Alongside Their Favorite K-pop Artists | Business Wire",
    "url": "https://www.businesswire.com/news/home/20210915005438/en/%E2%80%982021-K-Culture-Festival%E2%80%99-Gathers-Fans-to-Shine-Alongside-Their-Favorite-K-pop-Artists"
}