{
    "text": "By Ko Dong-hwan Apparently upset over bad reviews for the new film Um Bok-dong, the lead actor, K-pop star Rain, took out his frustration on Instagram while reportedly in a drunken state. The actor-singer born Jung Ji-hoon wrote that he had done his best, that he had been worrying day and night and that he hoped those who saw the film would recognise his sincerity. He asked them to “remember at least the name Um Bok-dong”. The film is a historical drama set during the period of Japanese rule about a Korean cyclist named Um Bok-dong who inspired downtrodden Koreans. Reviewers have questioned whether Um deserves to be called a patriot because he allegedly stole the bicycle he rode in a race against Japanese competitors. The reviewers questioned the film’s historical accuracy, leading some people to rate the film poorly ahead of its official release on February 27. The CEO of entertainment agency Rain Company said Jung had “had a few drinks” and was “fine with the film’s possible failure at the box office”. In his seventh film following Hollywood action flicks Speed Racer (2008) and Ninja Assassin (2009), Jung, 37, portrays the title character. The actor reportedly rode more than 20,000km (12,400 miles) on a bicycle to train for the role. Jung, who rose to stardom after debuting as a solo act in 2002, previously told a Korean media outlet that he wanted to preserve his “identities” as an actor, singer and TV personality. Rain, who worked under Korean K-pop powerhouse JYP Entertainment until 2008, said he had recently been in contact with cinema students to pursue his interest in making independent films. “I don’t mind minor roles,” he said. “People ask me why people like me would film an indie film, but I need new opportunities to get involved in filming.” ",
    "title": "‘Drunk’ K-pop idol Rain defends his latest film on Instagram after it was slated by critics | South China Morning Post",
    "datetime": "2019-02-26T22:17:32+08:00",
    "url": "https://www.scmp.com/lifestyle/arts-culture/article/2187699/drunk-k-pop-idol-rain-defends-his-latest-film-instagram-after"
}