{
    "text": "By Kwak Yeon-soo Alongside the rip-roaring success of K-pop, the genre’s music videos also have staying power in the age of YouTube. The platform’s views and comments are seen as useful gauges of a music video’s success. The colourful, choreography-heavy video for Idol, a song by K-pop sensation BTS, set a record this year as the most-viewed Korean music video within a 24-hour period on YouTube, garnering a staggering 45 million views. To date, it holds second place among all genres following Ariana Grande’s clip for Thank U, Next. And the video for Ddu-du-Ddu-du by K-pop group Blackpink is ranked fifth, amassing 36.2 million views in one day. The people behind the videos rarely receive any recognition. Praising creative direction isn’t a priority for mainstream fans – they are more interested in the performers’ looks and voices. “We music video directors aren’t recognised by the public much because we work behind the camera,” said music video director Kim Sung-wook. “I’m totally fine with that, but I just hope they take notice of talented directors who have great potential but fewer opportunities in this field.” Kim, an acclaimed director known for making music videos with unique creativity and sensitivity, earned fame after working on BTS music videos, including Dope, Save Me, Young Forever, Not Today and MIC Drop. Other K-pop stars he has worked with include Red Velvet, Big Bang’s Taeyang and Shinee’s Taemin. He shared his experiences of working with several artists. “I’ve worked with BTS on several of their tracks. Their performances are very powerful and they don’t need a lot of clutter around them.” “I’ve seen them rise to the top, but they’ve always been consistent in their manners – kind, humble and grateful,” he said. Working with Taeyang was like a dream come true for him. “I’ve been a huge fan of his since Big Bang’s debut. On set, he was a breeze to work with. Standing on a glacier in Alaska with him was an unforgettable experience,” Kim recalled. Asked if trends affect the videos, he says: “Of course I need to be aware of big trends, but what’s more important is to identify which of the trends fit with the artist’s style.” In 2014, his music videos began to receive more attention with Red Velvet’s music video Happiness. The huge response to this video came as a pleasant surprise. Since Red Velvet were a new act, the record label had an idea of where they wanted to go with this video project to shape the group’s direction. “If you are working with an act, you have to be extra cautious because you have to consider what you can do to take them to a different level,” Kim said. Kim was originally a professional snowboarder, and even competed in South Korea’s national team. He dropped out of university while majoring in physical education and has not had any formal film or fine arts education. He went from making dynamic snowboarding clips to directing K-pop music videos. In 2007, Kim founded GDW, a Seoul-based film, motion and 3D studio specialising in creating commercials, music videos and documentaries. “Before I earned recognition for making music videos, I had worked on numerous sports and fashion films, corporate PR videos and commercials,” Kim said. Kim said making music videos wasn’t that different from making sports videos. “As a long-time boarder, what I consider the most important when shooting is rhythm, speed and balance.” Those elements, he says, create dynamic narratives filled with vigour and artistry. In contrast, he always avoids still shots and redundancy. “Many K-pop music videos feature still shots of artists’ faces to emphasise their good looks, but I focus on their moves because they carry energy and natural charms,” Kim said. As a director, he believes it’s important to remember that fans are going to watch his videos numerous times. To keep their attention and focus, a director should add a lot of depth and to pay attention to the details. “It goes beyond the props, the shooting and the editing. It needs to be multi-layered, and hopefully each time they watch it, they’re able to pick up little details they hadn’t noticed before,” Kim said. His goals are to continue directing music videos and working with talented people. “I love performance videos and dance videos, and I want to do as much as I can while maintaining high production values,” Kim said. “In the future, I would love to work with foreign artists as well, like Kendrick Lamar. I love being able to influence culture the way that I was influenced and tell a story through an artist’s point of view. It’s a really cool thing to be a part of.” ",
    "title": "‘Humble’ BTS, ‘unforgettable’ Taeyang – K-pop video director on working with the biggest stars | South China Morning Post",
    "datetime": "2018-12-17T21:01:03+08:00",
    "url": "https://www.scmp.com/culture/music/article/2178277/humble-bts-unforgettable-taeyang-k-pop-video-director-working-biggest"
}