{
    "text": "Veteran K-pop singer and Hollywood actor Rain says he will keep his baby daughter out of the public spotlight, in line with his principles as a sworn family man. The star, born Jung Ji-hoon, also described society as “too scary to live in”. “Previously I thought it was possible to talk about my family happily,” he said. “But now, if I opened up to the public my child and bragged about how we live, I think it would somehow come back to haunt me. I will build a wall between my family and my job.” Saying he “doesn’t want his family to get hurt”, the 37-year-old said he had become wary about “talking about my family openly”. Rain – who has appeared in Hollywood films such as the 2008 sci-fi action film Speed Racer and Ninja Assassin from 2009 – married actress Kim Tae-hee in 2017. Their first child was born the same year. Rain confessed he “loses his temper” when other people crossed the line with his family members. Admitting he became a “public toy” after entering show business, Rain said he could understand if he was “played with and thrown away”, but he planned to preserve his “identities” as an actor, singer and TV personality. Rain’s latest film Um Bok-dong, a historical drama based on a true story about a Korean cyclist during the period under Japanese rule, arrives in theatres on February 27. But for his next project, Rain has been in contact with cinema students to pursue his interest in making independent films. “I don’t mind minor roles,” he said. “People ask me why people like me would film an indie movie, but I need new opportunities to get involved in filming.” ",
    "title": "‘I’ll build a wall between my family and job.’ K-pop idol and actor Rain wants his baby out of public eye | South China Morning Post",
    "datetime": "2019-02-23T22:32:36+08:00",
    "url": "https://www.scmp.com/lifestyle/arts-culture/article/2187240/ill-build-wall-between-my-family-and-job-k-pop-idol-and-actor"
}