{
    "text": "The Ars Nova immersive theater experience \"KPOP\" uses the Korean entertainment industry as a vehicle to question identity in the 21st century. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tTamar Herman A peaking diva bemoans the career of her youthful successor. A boy band on the verge of breaking up fights internally while trying to get one final hit. A girl group struggles with identity and self. A foreign business tries to enter the American market. This is ostensibly the plot of KPOP, a new Off-Broadway immersive theater experience. But the bilingual show — built to emulate the linguistic chaos non-English-speakers face in the U.S. — isn’t merely an entertaining few hours to take in a basic understanding of one of the fastest paced subcultures in the world: it’s a reflection on what it means to be Korean and/or American in the era of globalization, a world largely shaped by America’s military and pop culture dominance. A rarity for New York theater and near impossibility in American media in 2017, the entire show is performed by people of color, with all but one castmember — “Single Ladies” dancer Ebony Williams– of Asian descent.  “It’s been a lens for me to think about my immigration [to the US], to think about what it means to be a Korean-American here,” Jason Kim, who wrote the play’s book and co-conceived the show, tells Billboard. “[To] think about myself as someone who grew up abroad, listening to different kinds of music that had a relationship to American pop music and just sort of thinking about all of these things as a way to understand the world. I thought that was really something worth pursuing.” An industry shaped by the continuous U.S. military presence depositing American media into South Korea’s cultural identity, K-Pop is a phenomenon that’s swept the world, with young so-called idol acts releasing music that has resonated with fans throughout the globe. It began in earnest in the late ‘90s, when Kim was a child, and gained prominence half a decade later, when Psy’s “Gangnam Style” captivated the world. Right now, it’s the boy band BTS who has all eyes on it; the boy band just became the first K-pop act to break into the top 10 of the Billboard 200.  “I think the one thing that I felt [towards “Gangnam Style”] was a strong sense of joy and pride,” says Kim. “But also I kept wondering [how] America was receiving the music because I noticed that kind of irony in the song and I wasn’t quite sure how that irony was being received. And if you think about Psy, and if you sort of become more familiar with his work, he’s very subversive and, in fact, very culturally and politically intelligent and in commenting on a lot of issues that are going on in Seoul. And it made me think about pop music and about K-pop, both as a medium that can exist over there in Seoul and also abroad here.” It is there, where music meets identity, that KPOP places itself. The show focuses on the fictional JTM Entertainment, run by a Korean couple played by James Saito and Vanessa Kai. Their goal, like that of many South Korean entertainment companies, is to bring K-pop to American audiences and opts to localize the music created in an Asian music industry. The immersive experience brings the audience in as a focus group, witnessing the preparations of MwE — played by Ashley Park who will appear as one of The Plastics in the premiere run of Mean Girls the Musical — who has spent her youth striving for the top; Special K, a girl group that is threatened by individual aspirations and concerns; and F8, a boy band past its prime who has a new Korean-American member (Jason Tam) who is rejected by the rest of the group mates based primarily on his perceived Americanized Korean-ness.  None of the struggles are beyond the reality of K-pop, though rather than a critique of the Korean entertainment industry, KPOP uses K-pop as a lens to focus on the racism Asians face in the U.S. and globally. The immersive experience forces the audience to confront racism head-on, with characters directly discussing the stereotyping — and intentional Americanizing — of people of color in American media, the lack of truly diverse spaces in Hollywood or the U.S. music industry, and how assimilation in the age of globalization puts many immigrants in a space that is neither here nor there. Racial identity is a focal point of the show, which continuously raises the question of what it means to be Korean-American in 2017 through a variety of situations as Korean and English are woven together throughout the scenes and songs. According to Helen Park, who wrote the music & lyrics alongside Max Vernon, it was both her and Kim’s experiences as immigrants that helped shape much of the immersive experience. “Because you don’t know anything that’s going on,” she says, referring to how much of the show takes place in Korean. “I don’t think a lot of Americans have experienced that and I feel like the show is kind of forcing them to.” The U.S’s colonial attitude towards South Korea is put at the forefront of KPOP, as it draws attention to how the former’s continuous post-Korean War military presence laid the groundwork for a relationship between American pop music and Korean pop music. It also explains how this led to the South Korean entertainment industry building itself up as a product to be exported, and at times supplant the American media it was initially spurred by. “[KPOP] became an amazing way, I think, to really, in an unbelievably entertaining way, to confront an American audience with a shining example of the far more globalized world that we live in and the way the boundaries between cultures tremble far more,” says director Teddy Bergman. “And in those boundaries you can ask a lot of complicated questions about sense of self and sense of place.” While fraught with political and racial discourse, KPOP is also, at times, laugh out loud funny and a commentary on the actual K-pop industry, touching on the rapid pace of an industry that thrives on youth and beauty. As far as the soundtrack, KPOP, like the music it’s named after, explores a wide range of genres and artistic interpretations. The show weaves dozens of bilingual songs into the plot, including a finale performance that features a stand out or two that could easily compete on Korean music charts. KPOP, commissioned by Ars Nova in association with Ma-Yi Theater + Woodshed Collective, opened on Sept. 5. It is sold out through its final regular show on Oct. 7, but recently announced that performances will be extended through Oct. 9-21.  Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "title": "‘KPOP’ Off-Broadway Show Explores Race, Identity & the Fame Machine | Billboard – Billboard",
    "datetime": "2017-09-25T14:23:42+00:00",
    "url": "https://www.billboard.com/culture/lifestyle/kpop-off-broadway-show-race-identity-7972940/"
}