{
    "text": "By Kim Jae-heun The South Korean government’s new guidelines for local broadcasters and TV show producers have sparked controversy over a suggestion that they refrain from showing too many K-pop stars that have similar appearances. The Ministry of Gender Equality and Family released the revised guidelines on Saturday in an effort to prevent “lookism”, or prejudice on the grounds of a person’s appearance. One of the clauses recommends restricting the number of idol singers appearing on a TV show at any given time, saying this could promote narrow standards of beauty among young viewers who admire K-pop groups. “Are the singers on TV music shows twins? They seriously look identical. Most are idol group members,” the guidelines say. “Most of them are skinny and have similar hairstyles and make-up with outfits exposing their bodies.” However, some observers questioned whether the government was attempting to regulate beauty standards. Ha Tae-keung, of the minor opposition Bareunmirae Party, wrote in a Facebook post: “The gender ministry says K-pop idols should not star together on television because they are all skinny and pretty with pale skin. What’s the difference between this and the crackdowns on the length of hair and skirts during the military dictatorship of Chun Doo-hwan?” The politician said the matter was one of individual taste, not something to be regulated by the government. But others said they understood the intent behind the guidelines, adding that outfits worn by some girl-group members were too sexual. “I agree with the ministry’s efforts to make changes in broadcasting scenes where commercialisation of sex is prevalent,” an internet user said. The ministry said on Monday that the guidelines were only aimed at raising awareness about the negative effects of “lookism”, adding that the recommendations were not mandatory and TV producers could decide whether to follow them. ",
    "title": "‘They seriously look identical’: South Korea to limit K-pop stars on TV if they look too similar | South China Morning Post",
    "datetime": "2019-02-20T02:32:25+08:00",
    "url": "https://www.scmp.com/lifestyle/arts-culture/article/2186748/they-seriously-look-identical-south-korea-limit-k-pop-stars"
}