{
    "text": "A 21-day long Training cum Production on Manipur Classical Dance is being held in Imphal West. ByIFP Bureau Updated 10 Dec 2022, 1:11 pm Pointing out that influences of westernisation and K-pop culture among the youths have become a great threat to the culture of Manipur, assistant professor of Manipur University of Culture, Manju Elangbam, on Saturday stressed the need for parents to encourage Manipur culture among their wards. Pointing out that influences of westernisation and K-pop culture among the youths have become a great threat to the culture of Manipur, assistant professor of Manipur University of Culture, Manju Elangbam, on Saturday stressed the need for parents to encourage Manipur culture among their wards. Speaking at the 21-day long “Training cum Production on Manipur Classical Dance” at KMTR Hall in Imphal West, the assistant professor said that westernisation and K-pop culture is just an imitation and not a culture. Speaking at the 21-day long “Training cum Production on Manipur Classical Dance” at KMTR Hall in Imphal West, the assistant professor said that westernisation and K-pop culture is just an imitation and not a culture. Being blessed with diverse culture, Manipur is a land filled with folk arts, tribal dances and music, classical dances among others, he said, adding it is the duty of all the generations to preserve and promote the culture of Manipur. Being blessed with diverse culture, Manipur is a land filled with folk arts, tribal dances and music, classical dances among others, he said, adding it is the duty of all the generations to preserve and promote the culture of Manipur. Manju said that the idea behind the training programme is to pull off the youths from the external materialistic world and give a platform to explore the internal spiritual world. Manju said that the idea behind the training programme is to pull off the youths from the external materialistic world and give a platform to explore the internal spiritual world. Delivering the keynote address, programme coordinator, BC Tekcham, said that as learning classical dance is a time-consuming process, 21 days is a limited period. Delivering the keynote address, programme coordinator, BC Tekcham, said that as learning classical dance is a time-consuming process, 21 days is a limited period. However, it is believed that, he said, the trainers will be able to learn thoroughly at least the basic knowledge during this training which will have the opportunities to learn from various eminent gurus who will be attending as visiting gurus. However, it is believed that, he said, the trainers will be able to learn thoroughly at least the basic knowledge during this training which will have the opportunities to learn from various eminent gurus who will be attending as visiting gurus. All the trainers will be given an opportunity to showcase their talents on what they have learned during the closing ceremony of the training programme which falls on December 30, Tekcham added. All the trainers will be given an opportunity to showcase their talents on what they have learned during the closing ceremony of the training programme which falls on December 30, Tekcham added. As many as 20 selected students will be attending the 21-day long training programme organised by Devishori Foundation for Arts and Culture Efforts (D-FACE) under the sponsorship of the Culture Ministry. the programme. As many as 20 selected students will be attending the 21-day long training programme organised by Devishori Foundation for Arts and Culture Efforts (D-FACE) under the sponsorship of the Culture Ministry. the programme. A lecture cum demonstration on Manipuri Classical Dance was also given by assistant professor L Subhadra Devi of the department of Dance and Music, MU, on the opening day of the programme. A lecture cum demonstration on Manipuri Classical Dance was also given by assistant professor L Subhadra Devi of the department of Dance and Music, MU, on the opening day of the programme. It was attended by director of JNMDA P Bilash as chief guest, president of Leimarolsinggi Seishakkol S Reena as guest of honour while director of KMTR and state awardee Y Sadananda presided over the opening ceremony. It was attended by director of JNMDA P Bilash as chief guest, president of Leimarolsinggi Seishakkol S Reena as guest of honour while director of KMTR and state awardee Y Sadananda presided over the opening ceremony.    First published:10 Dec 2022, 1:11 pm Tags:manipur culturemanipuri artmanipur classical dance IFP Bureau IMPHAL, Manipur 2023 © Imphal Free Press. All Rights Reserved. ",
    "title": "‘Westernisation and K-pop a threat to Manipur culture’",
    "url": "https://www.ifp.co.in/art/westernisation-and-k-pop-a-threat-to-manipur-culture"
}