{
    "text": "To revisit this article, select My Account, then View saved stories To revisit this article, visit My Profile, then View saved stories By Jessie Wender This week’s issue of the magazine includes a photograph from Hassan Hajjaj’s series “ ’Kesh Angels.” Hajjaj, who is fifty-three, was born in Morocco and moved to London in his teens, where he worked as a d.j., a promoter, a stylist, and a designer. Before taking up photography, in his late twenties, Hajjaj returned to Morocco to work as an assistant on a photography shoot for a fashion magazine. He says that he was frustrated to see his native country used only as a backdrop for Western women and clothing, and that the experience pushed him to make Morocco a prominent subject in his own work. Hajjaj’s portraits draw on the work of African luminaries such as Malik Sidibe and Seydou Keita, but they also retain a modern feel, juxtaposing traditional Muslim clothing —hijabs, niqabs, babouches, and abayas—with Moroccan biker culture and famous Western brands, like Nike and Louis Vuitton. Hajjaj uses his friends as models, and he designs their outfits with traditional prints and counterfeit brand-name fabrics from markets in London and Marrakesh. He also builds the frames for these pictures from found objects: Legos with Arabic lettering, cans of Fanta, boxes of chicken stock. Hajjaj’s first solo show in New York opens tonight, at the Taymour Grahne gallery, in Tribeca, and is on view through March 8th. All photographs courtesy Taymour Grahne gallery, New York, and Rose Issa Projects, London. By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. By Naomi Fry By David O’Neill By Nina Mesfin By Nicole Rudick Sections More © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. The New Yorker may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "title": "’Kesh Angels | The New Yorker",
    "datetime": "2014-01-24T11:26:34.000Z",
    "url": "https://www.newyorker.com/culture/photo-booth/kesh-angels"
}