{
    "text": "To revisit this article, select My Account, then View saved stories To revisit this article, visit My Profile, then View saved stories By Siobhán Bohnacker “A Country Road. A Tree. Evening.” These, famously, are the shorthand coördinates for the postapocalyptic, existential terrain of Samuel Beckett’s “Waiting for Godot,” which premièred in Paris, in 1953, at the Théâtre de Babylone, under the direction of Roger Blin. In the magazine this week, Hilton Als reviews the director Sean Mathias’s current reprisal, at the Cort Theatre, calling the play “a poem with more clues than exposition.” Many of “Godot” ’s clues lie in its strict technical specifications, for which Beckett was famous. The stage directions serve the twofold purpose of both unlocking and enhancing the play’s gloomy mystery. In the pastoral opening scene, we meet the play’s main protagonists, Estragon and Vladimir. On a country road, with a lonely, barren tree as their post, the tramps wait idly for the elusive Godot. Soon, the moon rises, and the text suggests a resemblance to Caspar David Friedrich’s painting “Two Men Contemplating the Moon,” which Beckett hinted to a friend was a visual inspiration for “Godot.” Act II begins with the stage directions “Next Day. Same Time. Same Place.” The tree now has leaves, and Pozzo and Lucky, a master and a slave, respectively, have been struck blind and dumb. Time has passed, yet we have no sense of accumulation. In seeming perpetuity, and perhaps in vain, Estragon and Vladimir continue to wait—and we with them. As the Irish critic Vivian Mercier wrote, “Waiting for Godot” is a play in which “nothing happens, twice.” The aesthetic of “Waiting for Godot” centers on the notion of the lieu vague. The playwright abstracts the scene until it scarcely exists. Beckett’s minimalism has received various design treatments in the past fifty years, both in traditional theatres and more unexpected locations. In 1957, the gallows of the San Quentin prison provided the backdrop for a production organized by an ensemble of inmates. The Youth Theatre in besieged Sarajevo was the setting for Susan Sontag’s candlelit revival, in 1993, and the multimedia artist Paul Chan took a literal approach, in 2007, staging Godot outdoors at dusk, on a road in post-Katrina New Orleans. In such instances, Beckett’s technical specifications are treated according to locality and available resources, exemplifying the play’s everyman, everywhere appeal. Beckett, who oversaw many productions of his play, was unafraid to criticize set designers who he thought failed to capture the over-all look of “Godot”; he particularly disliked the busy design of the first English-language production, directed by Peter Hall, in London, in 1955. He was, however, characteristically reticent on the subject of the play’s setting, and told Roger Blin, “The only thing I’m sure of is that they’re wearing bowler hats.” In 1961, Beckett turned to the Italian sculptor Alberto Giacometti, his Left Bank drinking companion, for help in the run-up to a forthcoming Paris revival of “Godot.” Designing the tree confounded them both. “We spent the whole night in the studio with that plaster tree,” Giacometti said, “trying to make it sparser, smaller, the branches thinner. It never looked any good, and neither he nor I liked it. And we kept saying to each other, Perhaps like this ….” In their indecisiveness, Beckett and Giacometti have their dramatic equivalents in Estragon and Vladimir. What motivates Beckett’s protagonists is the pursuit of the Absolute, similar to the two artists’ persistent, deep-rooted doubt that they would ever find the perfect artistic form. A paradigm for the human condition, “Godot” oscillates between the tangible and real and that which remains invisible and unknowable. The set designer’s task is to evoke the enigmatic void of the space between the two. So how is a designer to attempt a contemporary Godot stage set? In the Cort Theatre production, the designer Stephen Brimson Lewis decided against the artifice of “a painted backdrop and fake muddy road.” Instead, Estragon (Ian McKellen) and Vladimir (Patrick Stewart) wait on the stage of a decrepit, deserted theatre, flanked by balconies that are replicas of those at the Cort. The tree—a real one—sprouts out from between wooden planks, and the upstage is the brick wall of the theatre. “A lot of Beckett’s material is instinctive and instinctual,” Lewis told me. “You don’t over intellectualize it when you’re designing it. You just try to react to it. I didn’t respond to ‘country,’ but I responded to ‘a tree,’ to ‘evening,’ and to everything else.” There is, of course, no definitive imagining of the tree or, indeed, of any of Beckett’s clues. The props are mere representations, nothing more. As Beckett once said, “All true grace is in the economical.” “Godot” is economical in form and in language, as well as in aesthetic. Yet Beckett’s reductionist approach can only go so far. “You can’t present a blank canvas,” said Lewis. “Everything that you do as an artist will have a specific quality to it, because you interpret through your taste, your experience, and your way of looking at the world. Then you can ask yourself, ‘Is that O.K., Mr. Beckett?’ ” Top: The first production of, “Godot,” directed by Roger Blin, who also starred as Pozzo (far right). Photograph by Roger Viollet/Getty. Middle image: Grove/Atlantic. Bottom: Samuel Beckett and Alberto Giacometti in the sculptor’s studio, working on the tree for “Godot,” in Paris, 1961. Photograph by Georges Pierre/Corbis. By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. By Richard Brody By Vinson Cunningham By Richard Brody By Ryan Ruby Sections More © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. The New Yorker may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "title": "“Is That O.K., Mr. Beckett?” | The New Yorker",
    "datetime": "2013-12-04T17:14:54.000Z",
    "url": "https://www.newyorker.com/culture/culture-desk/is-that-o-k-mr-beckett"
}