{
    "title": "'Do you wanna be white?' Korean skincare brand sparks backlash by posing controversial question on a billboard in New York | Daily Mail Online",
    "text": "By Annabel Fenwick Elliott Published:  22:41 BST, 8 July 2014   |  Updated:  22:49 BST, 8 July 2014 56 View  comments A Korean skincare advertisement is courting controversy in New York after it posed a disturbing question to its potential U.S. customers. 'Do you wanna be white?' the billboard reads, showing an ethereal Korean model with extremely pale skin. The ad is pushing Elisha Coy's new Always Nuddy CC Cream, a tinted moisturizer boasting 'skin-whitening' properties. Korean culture blog Noonci spotted the ad in Koreatown, Queens, and scathingly labeled it: 'The perfect advertisement. [It] sells an impossible dream while also making its potential consumers feel worse about themselves.' Bold: A Korean skincare brand has made a risky break into the U.S cosmetics market with this billboard, which was spotted in New York's Queens-based Koreatown, sparking less than favorable responses  Although it is well-established that pale skin is highly desirable for Korean women, the direct nature of Elisha Coy's billboard has called into question whether it could simply be a case of 'lost in translation,' according to Noonci. Regardless, the brand, which sells its products mainly in Korea, China, Hong Kong and Japan, clearly plays into its target market's quest for lighter skin. The product description on Elisha Coy's website claims the cream is 'skin-whitening functionality approved,' and suggests: 'The more you apply, the better your skin looks!' Before and after: Elisha Coy, which mainly sells in Korea, Hong Kong, China and Japan is touting the skin-whitening properties of its Always Nuddy CC Cream (pictured, a blogger demonstrating its effects)   The cream, which costs $30 in the U.S., is a hybrid of 'BB cream' - a type of beauty balm popular in the East and Southeast Asia - and tinted foundation; and its marketing images display distinct smoothing and whitening effects on its models. South Korea is widely reported to have some of the strictest and most unattainable beauty standards in the world. An estimated one in five South Korean women will undergo plastic surgery at some point in her life, and according to one American schoolteacher located there, this appearance fixation starts at a young age. Julie Lurie spoke to This American Life last year, claiming that there are full-length mirrors and weighing scales on every floor of the all-girls school she works at. Big business: In Korea, pale skin and Caucasian features are highly desirable for women, with an estimated one in five getting plastic surgery to alter their appearance during their life 'When you are applying for university or you’re applying for a job here, you put a picture of yourself on your resume or your application,' she explains. 'It is sort of taken for granted that how you look will often go into the decision of if you get into that university or if you get that job.' Skin-whitening, while common in many parts of the world, remains a controversial practice closer to home. Several American-based celebrities of color have come under fire over the years for allegedly bleaching their skin, including Rihanna, Nicki Minaj and Beyonce. 'It is sort of taken for granted that how you look will often go into the decision of if you get into that university or if you get that job.' In August 2008, for example, cosmetics giant L’Oreal found itself in hot water when it was accused of ‘whitewashing’ Beyonce's skin in an advert by digitally lightening it. Ironically of course, pale-skinned Caucasians from America and Europe have been enthusiastically darkening their skin to gain the highly desirable sun tan since the early 20th Century. And if there was a single person responsible for popularizing sun tans, it was Coco Chanel, who frequently sunned herself on yachts in the Mediterranean and declared in 1929: 'A girl simply has to be tanned.' It seems that whatever your natural skin color, there are always different hues to be desired. It remains rare however, in the cosmopolitan city of New York at least, for a beauty brand to be quite so straight-forward in its approach about a lightening treatment. Elisha Coy did not return MailOnline's request for comment. Share what you think The comments below have been moderated in advance. The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. We are no longer accepting comments on this article. Published by Associated Newspapers Ltd Part of the Daily Mail, The Mail on Sunday & Metro Media Group ",
    "datetime": "2014-07-08T22:41:49+0100",
    "url": "https://www.dailymail.co.uk/femail/article-2684956/Do-wanna-white-Korean-skincare-brand-sparks-backlash-posing-controversial-question-billboard-New-York.html"
}