{
    "title": "'Dracula' Choreographer On The Beauty And Danger Of The Count | KCUR - Kansas City news and NPR",
    "text": "It's been nearly 120 years since the publication of Bram Stoker's gothic novel Dracula. But his tale of the Count, who stalks living creatures and survives on their blood, continues to this day to be interpreted and popularized in theater, television, film, and dance. This season, the Kansas City Ballet is staging choreographer Michael Pink's Dracula, based on Stoker's classic work. Pink, artistic director of Milwaukee Ballet Company, spent two weeks in rehearsals with the Kansas City Ballet as they prepared for performances of the three-act ballet. According to Pink,  Dracula is a combination of dance and theater that's \"sinister and sensual at the same time, breathtaking yet horrific.\" Interview Highlights: Choreographer Michael Pink On the \"unspoken power\" of Dracula \"I think the beauty of it and the power of it is that the role of Dracula is somewhat unspoken. If you go through the book, he has relatively few lines, relatively few text moments. So, you think, what is it about it? It's a presence, it's about the way he is, his unspoken power, his sense of invincibility. \"The fact that he has eternity to exist, so he's in no rush to do anything. He has this perceived incredible strength. He can change from being a man to an animal, a lizard or a bat. So, really he's invincible.\" On the beauty and danger of a kiss on the neck \"He is not motivated by one sexual act, whatsoever, the fact that he draws blood from somebody by kissing them on the neck. I didn't want it to be fangs and a (makes sound of a hiss and a snarl) moment. I wanted it to be a sensual moment. It's a gentle moment, it's a kiss on the neck. But we as an audience know exactly when Dracula kissed you on the neck, there's something else going on there. \"This idea that you can have this incredible, wonderful, sensual, almost passionate moment of him taking the blood from the neck of Lucy, for example...You have this juxtaposition of something that's sublimely beautiful, but, ultimately, so, so dangerous, and devilish. So it plays to both sides.\" On Dracula's appeal to men and women \"I think people are fundamentally in love with him. They see him as the anti-hero; he's wonderful and yet, he's pure evil. But people relate to him as this incredibly beautiful, handsome man - men and women. People are terrified by him, but people relate to him... \"There's this incredible sense, you feel like you can't resist him... \"There's a wonderful duet between him and Jonathan Harker at the end of Act 1...it just has this incredible sense of when two people come together, the power struggle and the sense of keeping your identity is incredibly strong. And the music is so powerful that you get swept along.\" The Kansas City Ballet presents 'Dracula,' February 21 - March 2, 2014, at the Kauffman Center for the Performing Arts, 1601 Broadway, Kansas City, Mo. 816-931-2232. ",
    "datetime": "2014-02-21T18:54:06",
    "url": "https://www.kcur.org/arts-life/2014-02-21/dracula-choreographer-on-the-beauty-and-danger-of-the-count"
}