{
    "title": "'I'm a K-Beauty Influencer—This is My Routine For Glowing Skin'",
    "text": "My first exposure to Korean beauty (K-Beauty) was through Korean TV dramas. They were really popular when I was growing up in Jakarta. My mom would watch them and I would see the Korean actors' skin looking so good. Sometimes they would put product placements in the dramas so I'd get to know the brands and I'd think that was perhaps how the actors achieved this look of beautiful \"glass skin.\" I had very bad acne from the age of 12, so I had a lot of experience going to dermatologists and taking different medications, and going through the redness, peeling and flaking side effects of that. Acne is not just a pimple or redness on your skin, it's how it affects your confidence and mental health. It was such a huge part of my teenage years. Since then I've been really into taking care of my skin, because I found that just taking prescription medications didn't work for my acne-prone skin. I had to do maintenance work to keep the results. That's where I got into K-Beauty. At around 15 or 16 I began looking for K-beauty products in Asia but at that point it wasn't as big outside of South Korea. The first product I bought was the Tomato line from the Korean brand Skin Food, because it was pretty affordable. It was a little more expensive than average, but a lot more interesting than the drugstore products that I had. My first encounter with K-beauty was a little confusing actually, because they have multiple steps, known as the \"10 steps.\" That includes double cleansing, exfoliation, toner, essence, a sheet mask and moisturizer. I just knew to use a cleanser, moisturiser and sunscreen! I learned a lot about skincare layering. I then moved to China for my bachelors degree in medicine and because it's a lot closer to South Korea, they have more exposure to South Korean products and I got to explore more. During my studies I found out that I am very passionate about skin, that's when I decided I wanted to do more research into dermatology. If you think about where the best place is to look at skincare and skin health, especially in Asia, South Korea is at the top of the list. Their skincare is just so diverse and there are so many products that are affordable. Luckily, I entered Seoul National University and completed a masters integrated PhD in dermatology there over three and a half years. I just graduated in September 2021. While living in South Korea, I noticed that the majority of people there seemed to invest in their skin. People were passionate about taking care of their skin, even before they had any issues. For example, being willing to do the ten steps of skincare even though it's very time consuming. Even men might have a toner, serum and sunscreen, whereas in other countries that could be seen as unusual. K-Beauty has brought products like sheet masks, essences (which are more like a serum) and ampoules (small vials of intensive treatments) and innovative sunscreens to the wider market, and way before there were other exfoliators like AHA and BHA were popular, Korean products used exfoliants. K-Beauty comes out with a lot of innovations, like cotton pads drenched in essence that have exfoliators to help take off the dead skin cells. I lived in South Korea for three and a half years, but I don't think I'm the right person to go into the cultural background of K-beauty because I'm not Korean. Charlotte Cho's book about K-Beauty, The Little Book of Skincare, is good at explaining more about K-beauty. The first year I moved to South Korea, I lived in a dormitory that was right next to the biggest skincare retailers in the country, so whenever I finished school I spent time in the stores, looked at the products, bought them and tried them on my skin. As I began testing more K-Beauty products, I saw they were really good, and affordable, and I started sharing my reviews of K-beauty products on Instagram. That's when I started seeing a lot of misinformation online, so I felt like I should write more than reviews of products, I should also provide general information about skincare. I started making skincare cheat sheets, and sharing which ingredients are better to combine with others to work in a complimentary way. I shared what I had learned during my studies, but also as a user. A post shared by Claudia Christin (@funskincare) I would see misinformation, not just about products but also about DIY skincare; like putting lemon or toothpaste or baking soda on skin. DIY skincare can do more harm than good if not done correctly. To me, there is no absolute right or wrong with skincare, but I saw a lot of key opinion leaders, or influencers, being very firm with their perspective and judging other people. That creates a lot of confusion online. I try to be very neutral and just provide information that is backed up by science and my own experience as a user. Once the pandemic hit and people had more time for their skincare, my Instagram started to pick up. People weren't wearing makeup and were perhaps getting more anxious about the condition of their skin than they should. Since K-Beauty's popularity was also peaking during that time, people just happened to find my Instagram account. I'm lucky because there are other influencers in skincare like James Welsh and Liah Yoo, who befriended me and shared information I posted on Instagram. Because I have a science background I'm always fascinated by new findings about different plant extracts that have a lot of skin benefits. The Korean brand IOPE always comes up with innovative ingredients and technologies that amaze me. Despite the problems in South Korea around SPF testing in some K-Beauty sunscreens a few years back, I still think the textures are amazing. The most important thing about sunscreen is that it should be comfortable so people apply as much as they want and reapply when they need to. Sunscreen in South Korea has such great texture, how it applies on the skin is really amazing, but I make sure any I use have all been verified by the Korea Food & Drug Administration (KFDA). Other than sunscreen, my favorite K-Beauty products are toner and serum. My favorite serum is Krave's Great Barrier Relief. Toning isn't an essential step because it's a really nice addition to your skincare routine. Right now I live in a really hot and humid climate in Jakarta, so a toner is such a burst of hydration for my skin. In South Korea there are so many options with toners in terms of the extracts they include and the textures. They're really refreshing. I don't do a ten step routine; I realized that my skin reacts better with less products compared to more. I've also reached a point where as a skincare influencer I have been exposed to so many products that I don't necessarily want to catch up with every new trend, I want to cut down and become more conscious of the impact of our skincare routine on the earth. I felt bad that I used so many products that may or may not have a positive impact on my skin. And, the more layers of product you put on your skin, the more risk of irritation. Right now, for my morning routine I start out with Keep Cool Soothe Bamboo serum cleanser, followed by Keep Cool Soothe Bamboo toner and then Krave Beauty Oat So Simple water cream and finally, Beauty of Joseon's probiotic sunscreen. I actually skip a moisturizer in the morning if my sunscreen is moisturizing. But if it's a little on the matte side, I will add a moisturizer like this in. At night time I double cleanse. At the moment I'm using Rovectin Clean Marine Micellar Deep Cleansing Water cleansing balm, then I use the same Keep Cool cleanser and toner as in the morning, followed by a serum of course. My favorite active ingredient in serum is retinol, which has brightening and anti-ageing effects, so I'm using Perfect Renew Youth Retinol Pro. I top it all off with Somethinc Supple Power moisturizer. It's simple, I don't use multiple layers of essences or ampoules of product. In summer, I just use less product and lighter based moisturizer. I also use more sunscreen; typically a sunscreen stick or powder for reapplication while using makeup. For me, the most important product for skin care is sunscreen. Then it's skin hydration. It's so important and it can come from multiple types of products: toners, serums, ampoules or moisturizers. You can layer three, four, or five products. It's up to you and it depends on your skin's needs. Skin is a reflection of our internal health and water is so crucial for that. If we drink enough water it will reflect in how our skin looks, but if your skin is dehydrated, drinking gallons of water won't help that much compared to applying moisturizer. Using K-Beauty has changed my skin for the better and the process of learning about K-Beauty has really taught me a lot about my skin; what it likes and doesn't like. At the moment, my skin is stable, with just a few breakouts when I am on my period. It's definitely a lot better than it used to be. In 2022, the trends I predict for K-Beauty will be, of course, finding new plant extracts that have properties that benefit skin. I foresee more retinol based products, but what will be different from other countries' retinol products is that K-beauty retinol products tend to be more gentle and suitable for all skin. I think that's what makes K-beauty different. Laser treatments and skin treatments from an aesthetician or a dermatologist are very affordable and accessible in South Korea, and so the gentler retinol products are used for skin maintenance after in-clinic facial treatments. I also think a lot more people will be more conscious about the impact of skincare and the consumption of beauty products. Brands will move further towards using less plastics in packaging and developing recycling programs. A post shared by Claudia Christin (@funskincare) With the increase in skincare products, a lot of brands do sell to people's insecurities. Aging is a natural process that we should embrace and skincare should go along in parallel with that; not to stop the process, but to make the best of our skin. I think the marketing side of products shifts the perspective, because something that sells is tapping into people's insecurities. So brands may focus on wrinkles, pores and imperfections and give the illusion that when you use their products it will change skin for the better and give poreless, flawless skin like an actor or actress. A lot more people are sounding out that skin isn't supposed to be perfect. Skin influencers like James Welsh have started to highlight that skin isn't supposed to be perfect and flawless skin isn't real. People that we see in magazines and online are often filtered or showing the best side of themselves. In the future, I'd like to make an impact on the beauty industry as a whole. Skincare is more than what we put on top of our skin. I'd like to help brands create products that are impactful and not just money-making machines. And, it's not only the products, it's also your lifestyle, the food you eat and the stress you are going through; it all affects your skin. I want to have a positive impact and help people realize it's not just about the products you buy. Claudia Christin MBBS, Ph.D (derm) is a skincare expert living in Jakarta, Indonesia. You can follow her on Instagram @funskincare or find out more at funfunteatime.wordpress.com. All views expressed in this article are the author's own. As told to Jenny Haward. Newsweek is committed to challenging conventional wisdom and finding connections in the search for common ground. Newsweek is committed to challenging conventional wisdom and finding connections in the search for common ground.  To read how Newsweek uses AI as a newsroom tool, Click here. ",
    "datetime": "2022-01-10T04:00:00-05:00",
    "url": "https://www.newsweek.com/k-beauty-glowing-skin-skincare-products-1666491"
}