{
    "title": "(LEAD) South Korean first lady attends K-beauty fest in Busan | Yonhap News Agency",
    "text": "All Headlines North Korea Sports Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies URL is copied. (ATTN: UPDATES with quotes, photo) BUSAN, Nov. 26 (Yonhap) -- South Korean first lady Kim Jung-sook attended a K-beauty festival with the spouses of Association of Southeast Asian Nations (ASEAN) leaders Tuesday, where they tested various beauty products made by Korean cosmetics companies. The festival, themed \"ASEAN Beauty, Make up Our Dreams,\" took place at the Busan Exhibition and Convention Center in the southeastern port city of Busan on the sidelines of the two-day South Korea-ASEAN special summit. First lady Kim Jung-sook (C) and the spouses of Association of Southeast Asian Nations (ASEAN) leaders take part in a K-beauty festival held on the sidelines of the Korea-ASEAN special summit in Busan on Nov. 26, 2019. (Yonhap)  During a reception ahead of the festival, Kim told her ASEAN counterparts that \"seeing (them) often makes (them) feel like close neighbors and even closer than a family,\" while they replied they feel like \"sisters.\" Kim and the spouses visited the \"Brand K zone\" where they were briefed on K-beauty and products manufactured by the country's small and medium-sized enterprises (SMEs) by Park Young-sun, minister of SMEs and startups. They then went to visit a booth run by South Korean cosmetics giant AmorePacific Corp., where they saw the production process of 3D facial masks and tested a small beauty gadget that can measure skin hydration and condition. Kim recommended the product to the guests, saying the portable device may be useful during their overseas trips. They also visited the \"Korea-ASEAN zone\" where Korean cosmetics companies showcased products using ingredients from ASEAN member countries, such as noni and peanut from Philippines and Myanmar. The participants went on to participate in a program called \"Dream Stage\" where a Vietnamese student studying in South Korea spoke about her dream of becoming a beauty expert after she was inspired by K-pop and K-beauty. Other students from ASEAN countries, who are studying in the country, or children with parents from ASEAN countries, also took part in the program. First lady Kim Jung-sook (C) poses with spouses of Association of Southeast Asian Nations (ASEAN) leaders during a K-beauty festival held on the sidelines of the Korea-ASEAN special summit in Busan on Nov. 26, 2019. (Yonhap)  Kim and the spouses wrapped up their visit to the beauty festival with a group photo shoot. \"K-beauty products fit better to Asian skin tones rather than western products,\" she said as they again passed the Brand K zone after the group shot. \"The 10 ASEAN member countries (together make up) a young market where people in their 20s and 30s account for a large portion of the combined population of 640 million,\" Minister Park said. \"(We will) contribute to the prosperity of South Korea and ASEAN by suggesting a model for shared growth (based on) K-beauty,\" she said. mlee@yna.co.kr(END) All News National North Korea Economy/Finance Biz Culture/K-pop Sports Images Videos Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies Korea in Brief Useful Links Festival Calendar Weather Advertise with Yonhap News Agency ",
    "datetime": "2019-11-26T17:53:43+09:00",
    "url": "https://en.yna.co.kr/view/AEN20191126008351315"
}