{
    "title": "(Yonhap Feature) Streets of 'K-beauty mecca' Myeongdong remain empty amid prolonged pandemic | Yonhap News Agency",
    "text": "All Headlines North Korea Sports Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies URL is copied. By Kim Eun-jung SEOUL, July 21 (Yonhap) -- It's time to get ready for the summer holiday season, but shops in Myeongdong, a major shopping district in downtown Seoul, remain eerily quiet with \"For Lease\" signs attached to many storefronts along the main road. Long gone are the days when clerks at cosmetic shops promoted new products to Chinese travelers and packs of people tried snacks in front of street food vendors. Once called the \"K-beauty mecca\" with shops of major cosmetic and fashion brands, the empty streets of Myeongdong stand in stark contrast to the long line of people at a nearby COVID-19 testing center in front of Seoul Station. \"There have been ups and down in Myeongdong, but it is the worst crisis I've experienced since I've been working here for nearly 10 years,\" an accessory shop owner, identified by his last name Park, told Yonhap News. \"I was expecting things to be better in the summer season as more people received their vaccine shots, but the recent situation dashed hopes for a rebound anytime soon.\" Few people walk down the main street of Myeongdong in downtown Seoul on July 18, 2021. (Yonhap)  The dramatic fall of the nation's most expensive retail strip is a grim symbol of the suffering of many business owners and other industries relying on travelers as Asia's fourth-largest economy is still battling the pandemic, which began here in January 2020. The greater Seoul area, home to half of the country's 51.3 million population, has been under the highest level of social distancing measures since last week as it has emerged as a hot virus spot amid the fourth wave of the pandemic. Without Chinese tourists, the biggest consumer group to the area, cosmetic and fashion brands, as well as hotels and restaurants, have exited the area over the past year. In the wake of the shrinking sales, major cosmetic companies, including AmorePacific Co. and LG Household & Health Care Ltd., as well as other budget brands, have closed several of their road shops in Myeongdong, with their ripped off signboards serving as a reminder of their pre-pandemic boom. The storefronts of old cosmetic shops with removed signs in Myeongdong, the main shopping district in downtown Seoul, are seen in this photo taken July 14, 2021. (Yonhap)  Deep-pocketed foreign fashion brands have also exited from the district one after another and shifted their focus to online channels. Swedish fashion brand H&M closed its shop in Myeongdong in November, and Japanese brand Uniqlo's four-story outlet shut its doors in January, following the suit of their competitors. Several budget hotels, including Lotte City Hotel, Tmark Grand Hotel and Skypark Myeongdong Central, are now up for sale after several seasons of a high vacancy rate. Some small restaurants and cafes remain closed with a lack of customers amid shortened business operation hours under the toughest distancing rules in place. Under the Level 4 rules, gatherings of more than two people are banned after 6 p.m., and restaurants and cafes are only allowed to have dine-in customers until 10 p.m., while nightclubs and bars are ordered to shut down. As a result, 38.4 percent of midsized and large shops in Myeongdong were closed at end-March, sharply up from 7.4 percent a year earlier, according to data by the Korea Real Estate Board. A Korean restaurant in Myeongdong has a for lease sign on July 14, 2021. (Yonhap)  Business owners in the area say Myeongdong took a heavier blow from the travel restrictions due to its heavy focus on foreign travelers, compared with mom-and-pop shops in residential areas and department stores that are regularly visited by local customers. They say changes were imminent even before the pandemic due to slowing sales amid high rental and labor costs, but the unprecedented virus outbreak only accelerated its collapse. \"There have been calls in recent years to bring changes here to diversify its streets, but it faced a dramatic change due to the coronavirus,\" a senior official at Myeongdong business association said by phone. \"As about 90 percent of customers here were foreign travelers, its businesses have failed to attract locals in times like this.\" The number of incoming travelers in the nation dropped 85.6 percent on-year to 2.5 million last year due to travel restrictions imposed against COVID-19, according to the state-run Korea Tourism Organization (KTO). Only about 60,000 Chinese visited the nation in the first four months of this year, plunging from 1.83 million in 2019 and 610,000 in 2020. Despite the recent slump, many expect Myeongdong will remain the capital's central shopping and tourism spot once life gets back to normal, considering its evolution from an art and culture scene to a multicultural shopping and food bazaar over the last decades. Lee Myung-shin, who used to hang out in Myeongdong during her student years, says she expects Myeongdong to regain its vibe in the post-pandemic era, hoping it transforms from a boring tourist trap to a trendy place with unique things to do, eat and see. \"My office is near Myeongdong, but I rarely go there because many shops seem like they are targeted at foreign travelers,\" Lee said. \"I feel sorry that Myeongdong has become empty, but I hope this will provide it a chance for it to be reborn as a hip place that can appeal to both travelers and locals.\" ejkim@yna.co.kr(END) All News National North Korea Economy/Finance Biz Culture/K-pop Sports Images Videos Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies Korea in Brief Useful Links Festival Calendar Weather Advertise with Yonhap News Agency ",
    "datetime": "2021-07-21T07:45:01+09:00",
    "url": "https://en.yna.co.kr/view/AEN20210720003500320"
}