{
    "title": "10 K-beauty styles of 2019: Blackpink’s Jennie wore blue eyeshadow, Mamamoo’s Hwasa sported pink lipstick, but what were the other Korean make-up trends? | South China Morning Post",
    "text": "The year 2019 was a colourful one in K-beauty, where colour trends largely dictated which make-up styles would make the year’s trendiest looks. Steering away from last year’s looks, 2019 was all about embracing colour (and glitter! and sparkles!) – a welcome break from the nudes of 2018. And when it came to skincare, we finally admitted hardly any of us had time for a 10-step skincare routine. Below are the most popular K-beauty trends of 2019, and a few we may still see in 2020. 1. Living coral The moment Living Coral was declared Pantone colour of the year, K-beauty brands were quick to offer fresh coral-hued products. Actress and singer Suzy (Bae Su-ji) was one of the first to wear the completely coral look, which gained a lot of attention when she posted it on her Instagram page. From peaches and creams to pinks and roses, we saw endless amalgamations of Living Coral and similar shades. Clearly, coral make-up was the nudes and neutrals of 2019. The trend also paved the way for all-in-one products, such as cream blushes and colour sticks that can be used on the lips, cheeks and lids. 2. Bold, bright fuchsia lips In the summer of 2019, Allure named matt pink lips a trend of the moment. Gradient lips and MLBB (My Lips But Better) shades be gone, as bolder and brighter statement hues such as fuchsia, hot pink and orange-red in velvet and matt finishes started to take over. Mamamoo’s Hwasa wore a thick, full and voluminous pout with over-accessorised hair and a colourful outfit to make a fashion statement. 3. Barely-there lashes With lips as the season’s main focal point, thin and sparse lashes became the trend, too. Volume and thickness were out, and in came the natural-looking, youthful look that came with barely-there lashes, which Allure also lists as one of the biggest K-beauty trends of the year. 4. “Skipcare” At the start of the year, becoming minimalist was all the rage. People looked for ways to declutter, streamline and simplify their lifestyles, getting rid of things that no longer sparked joy. And the beauty department wasn’t spared from all the purging. Perhaps in response to the 10- to 15-multi-step skincare routine of 2018, a new trend emerged: “skipcare”, or the skincare diet. The trend is all about having a customised regimen tailor-fit to address specific skincare concerns. Instead of obsessing over the steps, skipcare prioritises efficiency, as Vogue reported, and prefers the use of multitasking products that can target more than one skin issue and therefore allow you to “skip steps”. 5. Sparkly eyes Almost every hit music video from 2019’s top girl groups had members sporting bejewelled eyes, from gilded eyeliner to diamantes in place of eye highlighter. The sparkly eye emerged as a real-life, wearable version of the trend. One could go as far as creating an intricate smoky eye using all-sparkly eyeshadow, or achieve an everyday look by dabbing sparkly eyeshadow all over the lids using just the fingertips. 6. Rainbow sherbet eyeshadow Another eye-centric craze was rainbow-coloured eye shadow, a trend also seen on many idol members. Case in point: Sunmi in her Lalalay video displayed her comeback stage looks. Eye shadow art using canary yellow, lime green, aqua and lavender, to name a few, were a perfect match for the colourful hair clips, bold lips and confectionery-coloured nails that were also in season. 7. Metallic hair At first, Living Coral was the hair colour du jour; followed by the soft, petal pink, cherry blossom hair and the similar candyfloss hair. Electric blue was then seen on many male idol group members and soon, metallic hair colours were spotted on girl members, too. A stark contrast to the pastel, fruity hues that emerged from the salons earlier this year, metallic hair gives a moodier and dreamier vibe, using ash as a base colour, complemented with dramatic colour tones in teal, violet and lavender. Check out Twice’s Feel Special, Mamamoo’s Hip, and IU’s Blueming videos for hair inspiration. 8. Cream skin Following the glass skin trend, Refinery29 reported a new movement in skincare: cream skin. SoKo Glam co-founder Charlotte Cho tells StyleCaster cream skin is all about having a more “condensed and time-efficient” skincare routine. The hero product of the trend is a “cream skin” lotion that’s a milky fusion of a toner and a moisturiser. Recently, skincare brands have started creating their own “cream skin” products and, as predicted by Cho, they are expected to become even more popular in 2020. 9. Wine lips Towards the end of the year, lip looks have gone bolder and darker than ever, transitioning from hot pinks to inky red wine hues. We’ve seen IU wear darker lip shades in Hotel de Luna, and recently Red Velvet members all wore fierce-looking pouts in deep red, plum and black in their just-released music video, Psycho. 10. Blue eyeshadow Last but not least, just as the year started with a coral craze heavily influenced by the colour of the year, will 2020 see K-beauty looks in blue? One beauty ’gram that became popular this year was BlackPink’s Jennie sporting an electric blue-and-silver-eyeshadow look. If that’s any indication of the beauty trends to come, 2020 will definitely see interesting renditions of messages of the day in Classic Blue. Want more stories like this? Sign up  here. Follow STYLE on  Facebook,  Instagram,  YouTube and  Twitter . Korean actress Suzy wore corals, K-pop members sported new trends in music videos and everyone embraced colour and a bit of sparkle this year ",
    "datetime": "2019-12-30T13:00:10+08:00",
    "url": "https://www.scmp.com/magazines/style/celebrity/article/3043685/10-k-beauty-styles-2019-blackpinks-jennie-wore-blue"
}