{
    "title": "10-Step Korean Beauty Routine: I Tried It And Here's What Happened | Women's Health",
    "text": "Women's Health may earn commission from the links on this page, but we only feature products we believe in. Why Trust Us? So many products, so little time. As someone who tried to combat her cystic acne as a teen with countless (failed) prescribed medications, I'm very skeptical (and dare I say salty) when it comes to skin care. But I’m even saltier when someone gushes that some mystical, witchcraft-infused lotion magically cured their splotchy complexion, like a coworker did one day in the bathroom. “I use a 10-step Korean beauty routine every morning,” she explained after I complimented her on her clear skin. Although I curiously Googled the term back at my desk, I was skeptical. The idea that a complicated face-washing routine could transform your skin seemed like a total gimmick to me. Since that conversation with my coworker, however, the multi-step K-beauty routine has regularly been making headlines, with its users touting complete skin-clearing and brightening benefits—with the pictures to show. And according to Alicia Yoon, founder of K-Beauty site Peach and Lily and licensed esthetician, the success has a cultural link. “The success of the Korean skin-care routine starts with the history of Korean culture itself,” says Yoon. “Several hundred years ago, beauty was always linked to healthy skin. Today, it’s really no different—having healthy skin minus photo aging is considered beautiful.” Yoon says that her understanding of healthy skin was seen as necessity, rather than vanity, when growing up. “When I was a 3-year-old, my mom taught me to brush my teeth and moisturize simultaneously.” Could this philosophy work for me? In other words, if I tried to improve the health of my skin from the inside out, rather than simply covering the issue with an expensive cream, could I truly improve my face? “The good news,\" Yoon told me, “your skin is doing pretty well for how little you’re doing to it.” That's because I’m a one-and-done kind of girl when it comes to skin care, mainly because I always felt like it took time from what really mattered: My makeup application, or sleep. I was really dreading this laborious nightly 10-step routine. Yoon worked with me to come up with a customized 10-step routine with products geared specifically for my skin needs (oily and acne-prone). Here's how it went down:  The first step, an oil cleanser/makeup remover, seemed simple enough. I used Blithe Anti-Polluaging Himalayan Pink Salt Cleansing Water ($36, glowrecipe.com), a clear liquid with a very subtle presence of oil. It felt hardly greasy and swiped off my day’s makeup—waterproof mascara and all—in a single pad. “It’s very common to start the 10-step routine with an oil cleanser,” explains Yoo. “It’s a great way to remove makeup. If you use a water-based cleanser, it can actually push impurities deeper into pores instead of drawing them out.” (We also like this makeup remover and cleansing oil from Meow Meow Tweet, available in the Women's Health Boutique.)   I’m not sure what gimmicks or magic I was expecting with this 10-step K-beauty routine, but the second step (a foam cleanser) was just as no-frills as the first. I used the Glow Recipe Blueberry Bounce Gentle Cleanser ($34, sephora.com), with a faint (but delicious) blueberry aroma. The substance lathered into a gentle foam that was easy to wash off. Seem familiar? This is the popular double-cleansing method that K-beauty devotees swear by. “The foam cleanser will draw any impurities the oil cleanser was unable to get to,” says Yoon.   With countless boxes of similar-looking products sprawled on the bathroom countertop, my OCD eventually went into overdrive, as I meticulously labeled each box ‘Step 1,’ ‘Step 2,’ ‘Step 3’ to keep my sanity intact. This categorizing really helped by Step 3, which contained two products for the same day—one for the morning (Be the Skin Botanical Pore Toner, $25, peachandlily.com) and one for the evening (AHA & BHA Daily Clean Toner, $15, amazon.com). Toners help remove any extra residue the foam or oil cleansers miss in Steps 1 and 2, says Yoon. Your face is also particularly exposed after a cleansing, so they also help immediately coat your bare skin with a bounty of nutrients and minerals. I immediately felt a tingle on my face while using both toners. According to Yoon, this is due to the hyaluronic acid, which is both super moisturizing and responsible for cellular turnover for dark spots. Despite the acidity, she says it’s safe for everyday use. \"Within seconds of cleansing, you want to put on your toner—when the skin is still wet. This will ensure your face won’t dry out.\"   In addition to being gifted with cystic, hormonal acne, my skin also has a knack for not healing very well, which has left me with a slew of dark spots. For this, Yoon recommended adding a small weekly dose of Vitamin C to my routine not in fruit or capsule form, but a powder. (For the uninitiated, Vitamin C helps the body make collagen, which helps repair skin as well as keep it firm and youthful.) I mixed the mustard-y Vitamin C Boost Powder ($29, peachandlily.com) into my toner, and looked in the mirror, hoping for instantaneous results. “Use very, very little at first,” Yoon says. “You really have to build Vitamin C up for it to be effective.” Damn! Find out why you're still struggling with acne: ​ ​   “Essence is the most important step of the 10-step routine,” Yoon explains. The \"essence\" is a super-concentrated formula of active ingredients. Although the ingredients themselves may differ from product to product depending on what kind of skin it's meant for, the goal of every essence is the same: To target the skin on a cellular level, revitalizing and brightening along the way. “Although some types are watery and some are viscous, the key is that the substance is mineral-rich and will penetrate your skin deeper than any of the other steps,\" Yoon says. I used Cremorlab Mineral Treatment Essence ($36, amazon.com), which had a similar consistency to the toner. I’ve found other cream-like essences on the market, so I should note that Yoon suggested products specifically for my skin—someone with a dryer complexion or sans pimples might benefit from a thicker version.   Although most other steps of the multi-step K-beauty routine are fairly one-size-fits-all, when it comes to serums, personalization is key. They are designed to target specific issues you may be having with your skin, such as brightening dark spots or smoothing wrinkles. “Serums can (and should) be mix-and-match to fit your unique skin type,” explains Yoon. While receiving a personalized skin-care routine from a K-beauty company founder isn’t really standard (I realize how lucky I am!), Yoon says that most K-beauty products specify what skin type the substance is ideal for. Also, it can be a matter of preference (i.e. smell, consistency). Be the Skin Purifying White Waterful Serum ($39, peachandlily.com) had a smooth, creamy consistency and great clean smell. So it definitely won in the personal preference department for me!   By the 7th step of my K-beauty journey, I was seriously contemplating funneling the products into an Excel spreadsheet to avoid mass confusion. By the mask step, the product would be new each day, whether a sheet mask (a thin cotton sheet infused with serums to address particular skin-care issues) or penetrative sleeping mask (a thick moisturizer-like cream that you leave on overnight while you sleep). I should add that I’m not entirely a newb to K-beauty, as I’ve forayed into sheet mask experimentation in a previous article. But I’d consider those starter-pack masks. The ones I used were next-level, as I quickly found from the clear, Matrix-like Whamisa Organic Hydrogel Sheet Mask ($9, glowrecipe.com) that made me feel especially extraterrestrial as it hydrated my skin. And while the Caolion Blackhead 02 Bubble Pore Pack ($26, target.com) I applied on another day didn’t have that same viral video-worthy effect as you see on other expanding face masks, it had a ridiculously cool tingling feeling. The Eco Your Skin Lavender Bedside Mask ($26, peachandlily.com), which was supposed to soothe and clear up skin, smelled (and felt) like a cloud. “Sheet masks are a fast way to get a lot of nutrients to your skin, but you should only be using them two to three times a week,” says Yoon. However, you can alternate between sheet masks and sleeping masks every other day, as Yoon directed me to do for the sake of my week-long experiment.   After the mask, the 10-step routine becomes more familiar—somewhat. At the eye cream step of the long routine, I can definitively say that this was the first time I ever applied the mucus from a snail directly to my eyelid. Much to my relief, however, the Mizon Snail Repair Eye Cream ($10, target.com) had no distinctive smell (although I’m not really sure what the backside of a snail would smell like) and had a silky texture. What’s more, Yoon says that snail mucus contains a natural antibacterial property.   After swiping snail goop across my eyeballs, it felt nice to retreat back to a familiar skin-care routine step: Plain old moisturizing. Yoon recommended I try two different creams—Make P:Rem Safe Relief Cream ($36, glowrecipe.com), for a non-greasy day moisturizer that wouldn't irritate my acne-prone skin, and Altopalm Undermakeup Daytime Moisturizer to be used before bed—although it says \"daytime moisturizer,\" the cream is super-hydrating and better at nighttime for my oily self. When I would get to this point in the routine at night, I would remember that coworker who gushed about K-beauty in the bathroom explaining how she did the process each morning, too. As my face at this point in the process always resembled a greasy pan, I really couldn’t see how that was even possible.   Do you ever get mildly annoyed (like me) when celebrities reveal their “biggest” beauty secret and it’s regular SPF application? But there really is merit to that statement. “SPF application in the 10-step routine is immensely important,” Yoon says. After all, good sunscreen application has obvious benefits at protecting your skin from sun damage. (Plus, it's one of the easiest ways to prevent lines and wrinkles as you age.) Naturally, you would only do part of the routine in the morning. One big caveat I’ve had with continuous application, especially when I'm at work instead of pool-side, is the grease factor. But thankfully, the Lagom Cellus Sun Gel ($23, peachandlily.com) that Yoon recommended was light and super matte.   Aside from the mornings after I wore sheet masks, the results after my week-long experiment were less-than-dramatic. I even had a few pimples sprout. But as Yoon assured me, when it comes to a multi-step skin-care program, instant gratification completely misses the point. “A 10-step Korean beauty routine is about consistency and long-term results—you won’t see miracles overnight,” says Yoon. “The goal is to foster health from the inside-out with a gentle approach, and inspire a lifelong dedication to skin care.” And while 10 steps sounds like a LOT, the fact of the matter is that you're really not doing all of the steps all at once every morning and night. For example, you'd only apply SPF in in the mornings, and the face mask step is recommended only every few days. As someone who stumbled into her apartment after a night out and still managed to complete the routine in full (albeit my bathroom was littered with cleansing pads and mysterious spills the next day), I’d consider my dedication to better skin care more than begun.  10 Best Boob Tapes For All-Day Lift And Support 🙌 The Best Facial Tools Of 2023 14 Best Laser Hair Removal Devices Of 2023 What To Know About Phenol Peels, Per Experts 11 Reasons Why Your Face Looks So Swollen 8 Best Derma Rollers Of 2023, Per Experts The 16 Best Hydrating Face Masks 19 Best Dark Spot Correctors, Per Dermatologists The Best Night Creams Of 2023, Per Dermatologists A Guide To The Best Gua Sha Tools 11 Best Face Razors For Women, Per Dermatologists 13 Best Wrinkle Creams, Per Skincare Experts A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2017-08-01T14:27:31Z",
    "url": "https://www.womenshealthmag.com/beauty/a19910263/10-step-skin-care-routine/"
}