{
    "title": "11 K-Beauty Trends to Try in 2022 | Vogue",
    "text": "To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. By Tish Weinstock All products featured on Vogue are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission. As we wave goodbye to 2021, it’s time to start thinking about those new year’s resolutions. So, what commitment will you be making to yourself in 2022? One good place to start is with your skin—and the K-Beauty trends bound to take over in 2022. While eating clean and drinking less (especially after the holiday festivities), are obvious choices, let us make the case for specifically looking after your skin, the body’s largest organ. And who better to advise on how to do this than the industry’s leading K-beauty and skin care experts? From fermented tea and kombucha to red onion, these are the upcoming K-beauty trends you need to know about. “In 2022, there is going to be a lot more retinol-based skin care, and more unexpected findings on plant extracts that turn out to have beneficial properties, like red onion. On top of that, there is going to be a tremendous increase in awareness around the sustainable packaging and beauty movement.” This content can also be viewed on the site it originates from.  Then I Met You Birch Milk Refining Toner SOKO GLAM  Goodal Green Tangerine Vita C Dark Circle Eye Cream SOKO GLAM “I think we will continue to see a move towards more vegan-friendly products and more sustainable packaging. It appears the market is moving away from sheet masks due to their single-use consumption, and more towards wash-off masks. I’m also seeing many brands come out with more sensitive skin-friendly formulas and gentle, unscented formulations. Products featuring fermented ingredients which are known for their anti-aging properties as well are becoming popular, such as fermented tea and kombucha.”  Benton Fermentation Essence SOKO GLAM  Skinfood Rice Wash-Off Face Mask SOKO GLAM “I’m seeing a big trend towards simplifying routines. Not that we’ve abandoned multi-step routines, but multi-use products are really shining bright and catching people’s attention. Any products that pamper the skin but also save time at the sink seem to be the new darlings.”  Good (Skin) Days On The Bright Side Moisturizer SOKO GLAM  Beauty of Joseon Glow Serum SOKO GLAM “My trend for 2022 K-beauty would be more efficacy-based skincare products that highlight ingredients like vitamin C, retinol, and AHA/BHAs. With COVID-19 not going away anytime soon, more and more people are looking for ways to keep their skin in good condition at home after wearing a mask all day. [Look out for] multi-purpose yet efficacious skincare that can target different skin needs like anti-aging, skin brightening, fewer breakouts, and skin-smoothing.”  Klairs Freshly Juice Vitamin C Drop SOKO GLAM  Isntree Clear Skin 8% AHA Essence SOKO GLAM “Vitamin A is still very popular, so I expect that more Korean brands will release retinol products in 2022. We will also see more skin care products that treat maskne, and makeup that is long-lasting which can be used while wearing a face mask, like transfer-proof lip products and cushion foundation that transfers less.”  Dr. Different Vitalift-A Forte SOKO GLAM  Tony Moly Plump-Kin Retinol Eye Cream SOKO GLAM “I see a rise in minimalist beauty, with formulas that contain no more than 10 ingredients for customers with sensitive skin. Brands like iUNIK are at the forefront of this trend. Sensitive skin is an increasing issue, and is definitely related to our stressful lifestyle and city pollution. “The pursuit of a healthy glow is very popular—being confident in your own skin and focussing on healthy skin is one of the main trends in Korean beauty. Forget glass skin, opt for a simple routine with nourishing and brightening ingredients, like propolis and hyaluronic acid.”  The Plant Base Waterfall Moist Balanced Hyaluronic Acid 100 SOKO GLAM  Sulwhasoo Gentle Cleansing Oil Makeup Remover SULWHASOO “In 2022, based on consumer insights and what we see labs developing, I believe the big Korean beauty trends will focus on innovative ways for ingredients to be absorbed into the skin. For example, our Peach Slices Deep Blemish Microdarts deliver ingredients through our melt-tech. “I also see continued innovation in sustainable ingredients and packaging, including compostable packaging for single-use items, like the Shangpree Marine Jewel Capsules. I’m also excited for new kinds of ingredients that can be created in labs in a more eco-friendly way.” “Skin barrier repair and managing sensitive skin continue to be major trends. Delivering active ingredients and keeping skin dewy while calm will be big for 2022.”  Peach & Lily Shangpree Marine Jewel Capsule SOKO GLAM  Peach & Lily Peach Slices Deep Blemish Microdarts SOKO GLAM “For the past decade, the demand for at-home and high-tech beauty devices, such as full-face LED masks and ultrasonic facial cleansers, has steadily increased. COVID has certainly accelerated this trend, with at-home beauty tech innovations now in demand globally. My prediction is that your next beauty product from Korea could come not from your typical Korean skincare brand, but a Korean tech giant, such as LG or Samsung.”  Dr. Dennis Gross SpectraLite™ FaceWare Pro DR. DENNIS GROSS  Vanity Planet Essia Ultrasonic Exfoliating Skin Spatula VANITY PLANET By signing up you agree to our User Agreement and Privacy Policy & Cookie Statement. By Kiana Murden By Kiana Murden By Hannah Coates By Jenny Berg By Kiana Murden By Kiana Murden More from Vogue See More Stories © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices CN Fashion & Beauty ",
    "datetime": "2021-12-28T14:00:00.000Z",
    "url": "https://www.vogue.com/article/k-beauty-trends-to-try-in-2022"
}