{
    "title": "12 Game-Changing Korean Beauty Trends For 2021 | British Vogue",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, select My Account, then View saved stories To revisit this article, visit My Profile, then View saved stories To revisit this article, select My Account, then View saved stories We may earn a commission if you buy something from any affiliate links on our site. By Tish Weinstock Snail mucin. Bee venom. Glass skin. These are just some of the beauty trends to emerge from South Korea in the past five years. Whether you’ve dabbled in a bit of donkey milk (good for rejuvenating the skin with protein and fatty acids) or you’ve played it safe with a weekly face mask, K-beauty is everywhere right now. In fact, Allied Market Research says that by 2026, the K-beauty market will be worth an estimated £15bn, while according to Jenni Middleton, director of beauty at WGSN, “during the coronavirus pandemic, consumers searched more for K-beauty, looking for innovative products to add to their lockdown beauty regimes.” Like most cultural phenomena, K-beauty is ever-changing — what was big last year may not be as popular this year. As Middleton observes, we’re seeing the traditional 10-step routine give way to a more minimalist approach as conscious consumers react against fast fashion and excessive packaging. Elsewhere, playful gimmicks such as colour-changing effects or jelly-like substances are being passed over in favour of science-backed formulas. To find out more about the biggest K-beauty trends of 2021, we spoke to some of the industry’s leading skincare experts. “Hanbang ingredients are traditional herbal ingredients used in Korean medicines and they’ve long been a staple in Korean life. For example, ginseng root, houttuynia cordata, sacred lotus and rehmannia boast anti-ageing, anti-inflammation and regenerative properties.” This content can also be viewed on the site it originates from. “K-beauty has been incorporating more acid into its products, but with a gentle approach that focuses on striking the balance: too much can irritate and aggravate your skin, too little will yield no results, so products with an optimal amount is key. Use the right balance of AHAs and BHAs (plant and animal-derived acids) to gently exfoliate dead skin cells and smooth skin texture.” “Carrot seed oil is an unsung hero at the moment, although it has been used in K-beauty for more than 10 years. It contains vitamin A and is a great antioxidant. It’s anti-ageing, anti-fungal, anti-bacterial, and anti-inflammatory — so it’s ideal for anyone looking to brighten up their skin.” “K-beauty’s ‘skin first’ approach will continue through 2021, especially given that self-care and skincare are so important right now. There’s no denying retinol’s powerful anti-ageing properties, but the K-beauty approach uses a lower percentage, so the skin stays healthier and less irritated. Retinol is highly efficacious without causing unnecessary damage.” “2021 is less about what’s ‘buzzy’ and more about what’s tried and true, with a focus on calming the skin. Centella asiatica [a herb grown in Asia, known for being anti-inflammatory] — or cica — is huge right now. With everyone dealing with the prolonged stress of the pandemic and dreaded ‘maskne’, soothing irritated, angry skin seems to be at the forefront of people’s minds. Cica is the ingredient that everyone wants to add to their routine.” “More brands are developing products free of chemical additives, artificial ingredients and fragrance. Products will be even more gentle with effective plant-based ingredients and many brands are becoming vegan as well. Consumers are more aware of what they put on their skin.” “This year, inner and outer wellness brands and products will gain more popularity. For example, brands that focus on pre-, pro-, and postbiotics; microbiome-friendly skincare; and consumable supplements, which benefit both the skin and the gut. By Alice Cary By Hannah Jackson By Hannah Coates This content can also be viewed on the site it originates from. “K-beauty will shift more towards a holistic approach, linking skincare and internal health. I take probiotic supplements for my bouts of eczema and I love using K-beauty products with fermented ingredients. I regularly use 107 — it uses aged [seven and 10-year-old] vinegar [that promotes good gut health]. Their vinegar tastes delicious with honey!” “A few years back, we were oversaturated with the ‘10-step Korean skincare routine’. The ‘skincare diet’ [using fewer products and steps] that followed was a pushback against that, but it was too restrictive for those who wanted more results than could be attained with just the basics. “Flexible minimalism is a focus on clean and simple product lines, which makes customising your routine easier. There will also be a push towards pared-back lists of ingredients. Single and minimal ingredients are appealing because of their simplicity and high concentration of the hero component.” “Skincare has a functional element — it has to work and deliver results — but I expect products that provide meditative, soothing, and spa-like moments to take off in a big way. They can transport you mentally and emotionally to another headspace.” “We’ve started seeing ‘skipcare’ as a K-beauty trend, where the focus is on a pared-down, simple, and minimalist routine. We will be seeing more efficient and effective multitasking and versatile products — what we like to call ‘hyphenates’ or ‘hybrid’ skincare.” By Alice Cary By Hannah Jackson By Hannah Coates This content can also be viewed on the site it originates from. “The belief that ‘skin is a reflection of your mental state’ comes from Korea and growing up, my mother emphasised this to me many times. We’ll see more barrier-strengthening ingredients that boost immunity, such as mushrooms, plus detoxifying herbs including mugwort and ginger. Ceramides [which form a protective layer to help prevent moisture loss and visible skin damage] will make a comeback, too.” “In Korea, many body-care rituals originate from the bathhouse culture, where milk treatments are slathered on the face and body, and baths are steeped with skin-beneficial ingredients such as green tea and probiotics. During a difficult year, personal self-care has taken on new importance for many, so we expect to see the definition to include all of the skin, from head to toe.” More from British Vogue: By Hannah Coates By Hannah Coates By Lauren Valenti By Naomi Pike More from Vogue Condé Nast Britain © 2023 Condé Nast ",
    "datetime": "2021-01-18T07:00:00.000Z",
    "url": "https://www.vogue.co.uk/beauty/article/korean-beauty-trends"
}