{
    "title": "12 Problems You Can Relate To If You Love Korean Beauty Products",
    "text": "Korean beauty is a way of life. Once you’ve used your first BB cream, you’ll find yourself drawn to sheet masks. Essences will call out your name. Suddenly, you will find yourself pressing toner into your bestie’s skin at a sleepover. Everyone you know will only receive Korean skincare and makeup as birthday gifts from you. This, my friends, is what it’s like to be obsessed, addicted, and hopelessly in love with Korean beauty products. Table of Contents In a bid to make skin look fairer (did you think only India is racist?) K-beauty brands often have limited shade ranges, with most products in the range giving really white-looking coverage. So, when your BB cream is one among three shades, you end up looking like a vampire with glass skin.  Somehow, the gradient lip tints which look adorable on K-pop stars end up looking like a paan stain when you try to do it, proving yet again, that life is unfair! Actually creating a lip tint or stain is another problem. You either end up staining your entire mouth, or only stain the inner rim. How does one evenly do just the right amount? We’ll never know! It feels really boujee to layer on skincare product after product, but that good feeling goes for a toss when you see the light-reflective surface that is your skin after being doused in different kinds of creams, essences, oils, ampoules, emulsions, serums, lotions, and more.  Take it from an acne-prone person: that much skincare can destroy skin which is easily clogged or porous or oily. Oily skin definitely doesn’t need such a heavy routine, and cannot breathe when all these products are layered on. So, if you love using all these different skincare buys step-wise but have oily skin, tread carefully! Here’s the trouble with the 90% of K-beauty users- we don’t sleep in attention position without our face touching our pillows. So, all that sticky skincare- be it the gooey essence left on our face by sheet masks, or moisturising sleeping packs- leave our pillows soaked with skincare.  Despite priding yourself on your beauty knowledge, the confusingly similar viscosity of K-beauty product throws you off your skincare layering game completely. Why is this serum as sticky and light as the ampoule? Why is my essence as watery as the toner? Why is this OTHER serum as oily as an…oil? We. Need. ANSWERS! Once you dip that cushion puff into your foundation, there is no going back. It gets tinted and tainted, and never looks like the clean, colour-free product it was, when you got it, regardless of how much you wash it. So basically, there is no way of knowing if it is clean even after you clean it. While shimmer shadows look divine on the pan, they are definitely not solid or opaque enough to show up on your lids, resulting in a sheer smattering of sparkles on your lids. If you have deeper skin or veiny lids, you need a primer or base matte shadow to get the look, making even simple eye makeup a long process.  via GIPHY The Korean beauty market doesn’t play around when it comes to packaging. With aesthetically-pleasing packaging being the bare minimum, sometimes they go plain wild and colourful with the jars and bottles they sell product in. One is often tempted to shell out extra money just because something will look good in one’s beauty bag.  That sweet winged tip, the doll-eyes, the round pop of blush on the apples and even the sweet and sheer lipstick synonymous with K-beauty remind one of a small child. As much as you enjoy this look, wearing it *can* result in clubs denying you entry without ID.  Korean beauty enthusiasts can relate to saving the packet of a used sheet mask, only to use the leftover essence as skincare later. Plus, each purchase comes with loads of teeny tiny samples of more products we are also probably going to end up purchasing too, making our dressing tables a packet-strewn mess! Read iDiva for the latest in Bollywood, fashion looks, beauty and lifestyle news. Don't worry, We'll not spam you & You can unsubscribe with us any time. ",
    "datetime": "Fri, 20 Jul 2018 04:00:00 GMT",
    "url": "https://www.idiva.com/beauty/tips/12-problems-you-can-relate-to-if-you-love-korean-beauty-products/17076968"
}