{
    "title": "14 K-Beauty Skin Care Products For Sensitive Skin That I Swear By",
    "text": "(Beauty Report Card) It’s gentle and leaves my face feeling fresh. I’ve become more meticulous about my skin care routine as I age. Twelve-year-old me used to apply my mother’s Pond’s cream all over my face and call it a day, but now 29-year-old me uses products like rose toner, hydrating serums, and whipped argan oil face butter. (I’m fancy, I know.) My collection of beauty go-tos has expanded significantly, especially when it comes to amassing K-beauty skin care products for sensitive skin. (I have extra dry skin, can’t handle overly fragrant lotions or wipes, and I’m prone to hormonal breakouts.) I’ve found that K-beauty items, overall, are less likely to irritate my face and body compared to other non-Asian brands out there. You’ll find cult-favorite labels from Seoul like Innisfree and Dr. Jart in my bathroom cabinet to new favs like Schwanen Garten. (I’ll also never leave for a vacation without packing my trusty COSRX pimple patches.) Over the years, I assumed that K-beauty skin care formulations worked the best for me because, well, I’m Asian, but I decided to dig a little deeper into why the products actually work. I spoke with Charlotte Cho — an esthetician, author, and founder of K-beauty brand Soko Glam — who clued me in. “Due to the yellow dust phenomenon that occurs in Korea and can often irritate skin, Korean people identify with sensitive and dry skin, so many Korean beauty products are formulated to cater to those skin concerns,” Cho shares. “K-beauty provides great innovative and traditional ingredients that work to soothe, calm, and fortify — to make the skin stronger. Centella asiatica [an antioxidant-rich, medicinal herb], houttuynia cordata [a medicinal and edible herb], and lotus are all great examples of gentle yet fortifying ingredients. [Meanwhile] antioxidants, like ginseng and licorice, tackle inflammation, free radical damage, and dryness.” She adds that this approach to skin care ingredients is a tad different than how the Western world views it. “Western skin care is [more] active centered. Actives are skin care ingredients like retinol, vitamin C, and acids that are a bit more intense and can cause some irritation,” she says. Though many people use active products without any irritation, I, personally, haven’t found the right concoction yet. I mainly stick to intensive, hydrating K-beauty treatments and anything labeled as “gentle” or “sensitive.” For those on the opposite end of the dry spectrum — e.g. you have oily but sensitive skin — Cho emphasizes that there are plenty of K-beauty products to assist with those needs, as well. “This skin type requires more gentle, yet impactful, classic Korean skin care ingredients like green tea, licorice root extract, and snail mucin,” she says. “Building up and nourishing the skin barrier is key.” If you have sensitive skin, perhaps it’s time to incorporate a K-beauty product or two that’s targeted to your needs. I’ve included a few of my favorite gentle must haves, ahead, along with several of Cho’s personal recommendations. Join me on the K-beauty train — I’m never hopping off. We only include products that have been independently selected by TZR’s editorial team. However, we may receive a portion of sales if you purchase a product through a link in this article. ",
    "datetime": null,
    "url": "https://www.thezoereport.com/beauty/k-beauty-skin-care-products-for-sensitive-skin"
}