{
    "title": "15 Cult-Favorite Korean Beauty Products You Can Buy on Amazon | Glamour",
    "text": "By Leah Prinzivalli Korean beauty has basically become synonymous with \"stuff that's worth your time and money.\" As the rest of the world catches on to K-beauty's innovations from new ingredients to product delivery methods to packaging, there's pretty much nothing we can do but clear space on our top shelves. But like any good thing in the world of beauty, it's hard to know where to start—and shop. That's where Amazon comes in. We rounded up cult-favorite cleansers, BB creams, and masks galore that will actually make you want to add steps your skin care regimen. Just don't blame us when you're late for work. Skincare obsessives, let's all book a trip together to South Korea's Jeju Island. The island's volcanic ash makes for enriched soil, which in turn, K-beauty companies like The Face Shop have harnessed into some powerful potions. This mud pack is formulated to draw out skin impurities with literal ash from the freaking volcano. While social media has helped the US embrace DIY trends like the Instagram-friendly avocado face mask, brands like SkinFood have known the power of natural antioxidants in food for decades. Rice's natural exfoliant powers means it can brighten skin and give you that smooth, supple feeling without any redness. If busy mornings mean you often have to cut a few steps out of your skin care routine, meet the splash mask. Meant for use in your shower and washed off within seconds, it's used like a cleanser with the quick rejuvenating power of a mask. OK, it sounds like something out of Anne of Green Gables, but donkey milk is packed with skin-brightening Vitamin C. If only for the sake of a good sheet mask, embrace your inner farmer. TonyMoly doesn't just do it for the packaging: This undereye balm is made with nourishing bamboo. Add in seawater and ingredients to soothe fine lines, and you've got a cooling, brightening gel. Ever thought to yourself, \"I wish my BB cream were even more effective?\" Me neither, but somehow they found a way to make it happen with the cushion compact. The application method means product is never cakey, and Missha's compacts have a lightweight, glowy finish. By Andrea Navarro By Emily Tannenbaum By Elizabeth Logan Snail extract has gotten plenty of \"wait... seriously?\" buzz as the holy grail of Korean skin care products. As someone who will try anything once in the name of good skin, might I suggest starting at the top with this 92-percent snail extract cream formulated to soothe acne scars, anti-aging concerns, and even sunburns. The \"aqua\" in the product name comes from a mix of mint water and marine jelly, which combine to give skin the \"bouncy\" look beloved in K-beauty. According to Amazon reviewers, this BB cream lasts all day, even on oily skin. No small feat! Yes, K-beauty is famous for its skin care, but it can still make a killer eye product. This cult-favorite has won awards for its precision felt tip, not to mention for generally making it easy for non-makeup artists to complete successful winged eyeliner. We still get a kick out of this clay-to-foam cleansing technology. Choose the version that best fits your skin's needs, be it oil control or moisturizing, and slather on the quick-drying mask before rinsing it off as a cleanser. By Andrea Navarro By Emily Tannenbaum By Elizabeth Logan Skip the messy DIY and opt for this egg yolk- and white-formulated facial mousse. Egg white brightens and egg yolk moisturizes skin, all in this ten minute mask. It's essences like these that make a 10-step skincare routine seem 100 percent natural. It's hydrating, formulated with rich lotus flower and hyaluronic acid, and yes, adds a soothing step to your nightly ritual. Another import from South Korea's beauty island, this serum is made with oil from the vitamin-rich camelia flower. Is anyone else ready to just move to Jeju? This rose mist has something that most others don't: actual, naturally fermented rose petals, right in the bottle. Aside from the display-worthy packaging, the mist is water-free, making it extra moisturizing to spritz on over makeup during the day (or anytime you need a little hydration in your life). By Andrea Navarro By Emily Tannenbaum By Elizabeth Logan Not to be a skin care nerd, but anyone who has truly radiant skin is up on their regular exfoliation. This AmorePacific peel is gentle enough to use daily to lift dead skin cells so your skin can actually show off all that hard cleansing-moisturizing-masking work you put into it. By Andrea Navarro By Ariana Yaptangco By Jake Smith By Melanie Curry More from Glamour See More Stories © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Glamour may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "datetime": "2016-10-19T22:43:00.413Z",
    "url": "https://www.glamour.com/gallery/best-korean-beauty-products-amazon"
}