{
    "title": "15 Reasons Your Makeup Looks Bad",
    "text": "We may earn commission from links on this page, but we only recommend products we love. Promise. Michelle Obama's personal makeup artist Carl Ray shares tips for creating a flawless makeup looks, just in case you're doing your face completely wrong. 1. Your foundation doesn't match your skin tone, thus your head is a different color from the rest of your body. Unless you're dressing up as a vampire, avoid this. You don't want any lines of demarcation between your face, neck, and chest. To make sure you get the right shade when you're out shopping, swipe a sample of the product over your jawline to see if it blends seamlessly. 2. Your under-eye concealer is too light. There's a difference between subtly brightening your under-eye area and making it glow in a bad way. Cancel out any darkness with a peach-toned concealer (this shade is universally flattering and helps cancel out blue tones). Then, top it with a liquid concealer that contains light reflecting particles and matches your skin tone perfectly. Try YSL Touche Èclat. If your under-eye concoction tends to crease midday, dust a translucent powder that's flesh-toned over it. 3. You're concealing pimples with a  concealer that is too bright. When you have a pimple, you want to take the attention away from it, not draw attention to it. By covering it with a lighter concealer, you're basically putting tiny lights around it saying, \"Look at me!\" Learn how to perfectly conceal blemishes here. 4. You don't blend your foundation onto your chest when it's exposed. If you're  wearing something that reveals your décolletage, you have to extend your foundation  onto your chest. Otherwise, you'll end up looking two-toned, which is not sexy. Use a damp makeup sponge, like the Beauty Blender, to spread your foundation onto your neck and chest seamlessly. 5. You skip your ears when you're applying foundation. Whether you're wearing your hair up or down when you go out, run your foundation brush over your ears to make your skin match the rest of your face.When celebs are on the red carpet, for instance, flash bulbs catch every bit of exposed skin, and doing this makes them look more even. 6. You're making a statement in too many many areas of your face. Some celebrities can pull off a smoky eye and red lip with ease, but in IRL it can look like a bit too much. Choose one area to doll up (your eyes or your lips) and go. 7. Your false lashes look obvious. False lashes can go wrong really quickly. If you're not getting them professionally done and you want to use a full strip, make sure to apply the band of lashes as close to your lash line as you can; once they dry, apply eyeliner over it. This will help mask where the falsies begin and end. Otherwise, if you're good at putting on individual lashes, they're always more natural-looking. 8. You've contoured your face, but didn't blend it properly. So you look more chiseled, but not in a good way. Find a bronzing tutorial here to learn how to shade your skin seamlessly. 9. Your blush is in the wrong place. Blush is supposed to fake flushed cheeks. Natural flushing occurs on the apples of your cheeks and a little bit below. Blush shouldn't get too close to your nose (which can mimic the redness around your nostrils that you get when you're stuffed up), and it shouldn't go up to your temples in a harsh manner. It should be diffused from the apples of your cheeks outward toward your temples, leaving you fresh-faced. 10. Your winged liner looks wonky. Winged liner, which is meant to elongate the eye, should be super crisp and extend outward at the perfect angle, as though you're extending your lower lash line. Want to nail your winged liner every single time? Click here for a how-to. 11. Your smoky eye isn't properly blended. Your eyes don't have to resemble a map for people to find them. Sure, you can apply different shades of shadow, but then diffuse it with a brush. 12. Your lower liner travels down your face midday. Who doesn't want a sexy, smudgy eye? But smudge it close to your lower lash line  and make sure it does't travel  to your cheek after several hours. A quick fix: Almay Makeup Eraser Sticks, which you can pop in your purse and use to take away any makeup fallout that happens as the night goes on. 13. Your lipstick bleeds into the skin around your mouth. To keep your lipstick in place, look for a long wearing lip color that will stay in place longer. Try CoverGirl Outlast All Day Lipcolor. Or, enlist the help of a clear lip liner, like Lipstick Queen Invisible Lip Liner, which creates a barrier along your lips, making your shade stay put. 14. You wear a brick brown-tinted eye liner that makes you look tired. A reddish-brown liner doesn't do you any favors, since the red tones in it can cause your eyes to look red and make you look more tired or ill. Instead, opt for a navy, gray, aubergine, or true brown liner, if you don't want to wear black. These shades will enhance your eye color and make the whites of your eyes pop, leaving you looking wide awake. 15. Your brows are too defined. If you have to draw your brows on because you've over-plucked them, that's one thing, but if you're trying to enhance what you already have, all you need is a light dusting of a brow powder one shade lighter than your brow hair, like Anastasia Brow Powder Duo, applied with a slant-tip brush or a few swipes of a brow mascara, like Maybelline New York Eye Studio Brow Drama. Brows are meant to look feathery and full (this style makes you look more youthful, too), rather than so defined they look fake. Follow Carly on Twitter. Carly Cardellino was the beauty director at Cosmopolitan. If you follow her Instagram, then you know she'll try just about any beauty trend or treatment once (the pics of her purple hair are on IG to prove it). But her favorite part about being in beauty is finding the most effective products, and then sharing that intel with others—because who wants to spend money on stuff that doesn't work? No one, that's who. Her most recent discovery: De La Cruz Sulfur Ointment, which will change your blemish-clearing game! Hopefully through the beauty stories she writes—and the experiences she shares—you can see exactly why she's in this business. FYI, Your Eyes Need A Hydrating Eye Cream (!!) Every $$$ Le Labo Perfume, Ranked Your 101 Guide to Laser Treatments for Acne Scars 19 Genius Serums That'll Smooth and Firm Your Skin FYI: Amazon Is Having a Major Beauty Sale RN Black Friday Dyson Airwrap Deals? Yes, Pls! You Can’t Miss These Black Friday Beauty Sales Simply the Best Shampoos for Thinning Hair, Period I Tested All the Viral Sol De Janeiro Perfumes These Bath Gift Sets = Immediate R&R Alert: I Found Drunk Elephant Bronzing Drop Dupes 25 Face Serums For Supremely Glowy Skin A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2014-11-24T22:55:32Z",
    "url": "https://www.cosmopolitan.com/style-beauty/beauty/advice/a33577/reasons-your-makeup-looks-bad/"
}