{
    "title": "2013: When Filipinos dazzled the world",
    "text": " SUMMARY This is AI generated summarization, which may have errors. For context, always refer to the full article. MANILA, Philippines – It’s been a year of happy memories – despite the devastation. For beauty pageant enthusiasts, 2013 will be most remembered as the year when we reigned. Rappler’s Life and Style Section compiles its biggest news from the year that’s about to end. Year of Filipina beauty  After coming on top in 3 beauty pageants, the Philippines made its mark as the “country of the year,” besting constant frontrunner Venezuela. The year 2013 saw Filipina beauties conquer the Miss World, Miss Supranational and Miss International pageants: Watch Rappler’s interview with Miss World 2013 Megan Young here:  Aside from the top winners, other beauty queens from the Philippines also placed in several different pageants. The Philippines joined the pageant world’s “Big Four” this year, and surpassed Venezuela, a country famous for regularly producing beauty queens but which failed to place in Miss International in 2013. (Venezuela has won the Miss Universe crown 6 times and Miss World 5 times). Bea Rose Santiago’s win in Miss International was made more sentimental by her 30-second speech in the final round, which she dedicated to her kababayan affected Super Typhoon Yolanda (Haiyan): “The whole world saw how my country, the Philippines, suffered. The agony of my people was felt. But one by one, country to country came to help. I would like to thank all the nations that helped my country. In our darkest hours, you have opened my eyes and my heart to how important it is to support each other. If I become Miss International, I will uphold international camaraderie to sustain the spirit of sympathy and to continually share the message of hope. I believe that whatever calamity may come to us, as long as we have each other, there will be hope.” Filipino pride Speaking of a winning streak, it wasn’t just about beauty pageants for us this year. Filipino contestant Jonathan Yabut won in this year’s The Apprentice (Asia). He is now working as – what else? – the apprentice of Malaysian Business Mogul and Air Asia CEO Tony Fernandes, learning the ropes of his business and earning a 7-figure salary. Watch our interview with Yabut in August:  Birth of an heir Duchess of Cambridge Kate gave birth to George on July 22. After days of waiting, the world was given a glimpse of Prince William’s son. As they left the hospital on July 23, Prince William told reporters: “I’ll have to remind him of his tardiness when he’s older, I know you’ve all been out here waiting a long time.” Prince George is third in line to the British throne. Controversial, honest opinions  In August, a guest columnist for Rappler sparked online controversy after publishing her honest, tongue-in-cheek piece on one-night stands. Janina Suarez’ (not her real name) article was seen by some as liberating, and by others as offensive. The online reactions gave birth to her second piece – another true, straight-to-the-point essay about what really defines a woman. Love her or hate her, Janina’s honesty and spunk make her a winner. Loss and heartbreak In October, a 7.2-magnitude earthquake shook Bohol, Cebu, and other parts of the Visayas and Mindanao. The earthquake flattened schools, homes, small buildings – and even churches that were built were hundreds of years ago. Loboc, Dauis, Baclayon, and Loay churches were among those that were heavily damaged. Netizens grieved the damage and the loss of historical relics while the Heritage Conservation Society called on to the Philippine government to allot funds for reconstruction and restoration of the damaged heritage churches. What lifestyle stories did we miss? Let us know through your comments below. – Rappler.com Error. Please abide by Rappler's commenting guidelines. There are no comments yet. Add your comment to start the conversation. JOIN OUR NEWSLETTER Fearless reporting delivered to you follow us    ",
    "datetime": "2013-12-25T02:00:00+00:00",
    "url": "https://www.rappler.com/life-and-style/46305-life-and-style-2013-yearender/"
}