{
    "title": "22 Genius Eyeliner Hacks Every Woman Needs to Know",
    "text": "Never let your winged liner make you late for work again. 1. Make your eye makeup last longer by setting your eyeliner with a matching eye shadow. First, line your eyes with a pencil liner, and then lightly dust eye shadow in the same shade on top  to hold the liner in place. 2. Use a pencil liner as a guide for tricky  liquid liners. If your hand isn't steady enough for liquid eyeliner, line your eyes first with a pencil liner, and then trace over it with liquid. 3. Make a less pigmented eyeshadow more vibrant by covering your eyelid with a white eyeliner first. This will help cancel out the color of your skin, creating an even base for the shadow and making the color pop. 4. Create your own custom eyeliner with a wet liner brush and eyeshadow. The wet brush will darken the pigments a bit and create a sharp look like a liner. 5. If you have monolids, use a gel or liquid liner and draw a thick arch to create the perfect line. If your eyelids hide your eyeliner, try drawing an arched line above your lash line a little thicker than you think. When you open your eyes, you'll have perfect-size lines. 6. Use white eyeliner as a brow highlighter for an instant eye lift. Line below and above your eyebrows with a thick white liner, and smudge it out with a sponge brush to define your brows. 7. Make your own gel liner by warming the tip of a kohl liner with a lighter. Hold the tip of the liner right above the flame for a few seconds, and then test the pencil on the back of your hand before lining your eyes. 8. If getting a perfect line is too challenging, draw a rough line first, and then sharpen it with a cotton swab and petroleum jelly. Sometimes erasing mistakes is easier than trying to nail it the first time. 9. For a really natural look, tightline your liner by applying it in between the lashes instead of across the top of the lash line. The easiest way to do this is to fill in your top lashes from the underside. This will make your eyelashes look fuller but won't leave you looking too made up. 10. Simplify drawing a straight line by lining your eyes with dots first, and then connecting them. Make sure your dots aren't too big. They should be the same size that you'd like the width of your line to be. 11. Create an eye-opening ombré effect by fading a lighter color into a darker eyeliner. Start at the inner corner of your eye and line the first three-quarters of your lash line with a light eyeliner, such as white. Then, grab a darker eyeliner and line the outside corner of your eye, then move toward the middle of your eye and stop halfway. Grab a sponge brush and begin blending the middle section where the two colors overlap. 12. Use the edges and curves of a spoon to master the perfect cat-eye shape. Use the handle of the spoon to draw the angled line and the curve of the spoon to create the shape.  Then fill it in to finish the flick. 13. If your eyeliner is crumbly, freeze it for 10 minutes before lining your eyes. To prevent eyeliner crumbles from messing up the rest of your makeup, freeze the liner to help it regain its shape. 14. Fix smudges with a skin-colored eyeliner. If you've smudged your liner a bit too much, draw over it with a skin-colored liner instead of wiping it off and starting over. This is also a great trick if you want to make the line super-sharp. 15. Use the edge of a business card to get the perfect flick. Try tracing the line if freehand drawing is too tricky. 16. Line your waterline with white liner to make your eyes appear bigger. Lining the inner rims of your eyes with a dark eyeliner is great for a smoky eye look but can oftentimes make your eyes appear slimmer. Opt for a white liner for a brighter, bigger look. 17. Add glitter liner to instantly transform your look from day to night. If you don't like to wear eyeshadow but want to amp up your makeup for the night, trace over your liner with a glitter liner. 18. Get the perfect smoky eye by drawing a hashtag on the outer corner of your eyelid and smudging it out with the sponge. Keep drawing hashtags and smudging it out to get a darker, smokier look. 19. For a more precise angle of your winged liner, draw the flick toward your eye instead of away from it. Drawing in a backward direction will make it easier to determine where the end of the flick will be. 20. Use mascara as eyeliner with a liner brush. If you don't have any eyeliner, use some of the product on the brush of a mascara wand to line your eye. 21. Use brown instead of black for a more universally flattering look. An ashy brown liner works on all eye colors and shapes, and is less harsh than black. 22. Use clear tape as a no-fail cat-eye guide. Place the edge of the tape in line with your bottom lash line and angle the top toward the end of your eyebrow. Save this article for later by pinning the image below and follow Cosmopolitan.com on Pinterest for more: Follow Brooke on Twitter. Brooke Shunatona is a contributing writer for Cosmopolitan.com. 10 Things Women With Great Eyelashes Do 3 Amazingly Easy Eye Looks That Are Perfect for Spring 4 Mascara Techniques That Might Actually Be Magic Cosmo Quickie: Smoky Eyes as Easy as 1-2-3 7 Lash Products Every Beauty Junkie Needs Everyone Is Obsessed With This Eyeliner Hack for Girls With Monolids The Eyeliner Trick That Instantly Makes Your Eyes Look Wider The Complete Guide to Where to Put Your Eye Makeup FYI, Your Eyes Need A Hydrating Eye Cream (!!) Every $$$ Le Labo Perfume, Ranked Your 101 Guide to Laser Treatments for Acne Scars 19 Genius Serums That'll Smooth and Firm Your Skin A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2014-09-26T01:30:00Z",
    "url": "https://www.cosmopolitan.com/style-beauty/beauty/how-to/a31500/eyeliner-hacks-every-woman-must-know/"
}