{
    "title": "3CE K-Beauty Take a Layer Collection | Hypebae",
    "text": "Cult Korean beauty brand 3CE is well-loved for products like its velvet lip tints and matte lipsticks but of course, its repertoire is filled with way more than just staple lip products. In fact, its new “Take a Layer” collection includes items for eyes, cheeks and nails, too. Much like the name would suggest, every product in this collection is ideal for layering, so you can start with a simple swipe for a subtle tint and build it up to more vibrant hues. The five-shade Tinted Water Tint lip stain ranges in tone from a light “Fig Pink” to a deep “Inside Mauve” and is ideal for all-day coverage and elevating your natural look with a slight pop of color. The versatile Multi Pot can be used on lips, cheeks and eyes, so it’s perfect for days when you can only carry a few products around with you. The seven-shade formula is highly pigmented and also soft and creamy, so it blends onto your skin seamlessly and features ingredients like Arabian cotton and shea butter to keep you moisturized, too. Lastly, there’s the Layering Nail Lacquer which allows you to either give nails a glassy, translucent finish or build up the colors for either a natural gradient look or full-on coverage. Shades range from “Dazzling Peach” to “Pure Red” and the oil and vitamin E-packed formula will prevent both polish damage and the loss of moisture.\nYou can shop the “Take a Layer” collection now at 3CE’s web store and don’t forget to peep its newest Velvet Lip Tints, too.\n\n\n                                                                                                    \n\n                                                            Read Full Article You can shop the “Take a Layer” collection now at 3CE’s web store and don’t forget to peep its newest Velvet Lip Tints, too.\n\n\n                                                                                                    \n\n                                                            Read Full Article    Keep updated on the latest news.  Keep updated on the latest news. We charge advertisers instead of our readers. Support us by whitelisting our site. Whitelist Us Already whitelisted us?\n                        \n                            Refresh page ",
    "datetime": "2018-07-14T12:01:50-04:00",
    "url": "https://hypebae.com/2018/7/3ce-take-a-layer-collection-k-beauty-lip-eyes-cheek-stain-nail-polish"
}