{
    "title": "4Minute to Extend Promotions After First No. 1 on K-Pop Hot 100 – Billboard",
    "text": "4minute is riding high off their comeback with new track \"What's Your Name?\" which rose to No. 1 on the K-Pop Hot 100 in its fourth week on the chart--an unexpected move to everyone from K-pop fans… By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin 4minute is riding high on their comeback with new track “What’s Your Name?” which rose to No. 1 on the K-Pop Hot 100 in its fourth week on the chart — an unexpected move to everyone from K-pop fans to their label.   As anyone who follows the Billboard Korea K-Pop Hot 100 knows, songs typically hit their peak in the first or second week. This is a result of tracks and music videos being simultaneously unveiled as to shoot for the biggest digital sales right away. 4minute’s “What’s Your Name?” was no exception with the audio, visual and the five-song “Name Is 4minute” mini-album EP all revealed April 25. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t05/29/2013\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tExplore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news In a rare move, the song continued to rise on the K-Pop Hot 100 after its debut until hitting No. 1 in its fourth. Other hits released around the same time include Secret’s “Yoo Hoo” (at No. 6 this week), GEEKS and Ailee’s “Wash Away” (No. 23) and Lyn’s “Breakable Heart” (No. 28) all several slots below their peak position. But four weeks later 4minute hopped to the No. 1 slot earning the group its first K-Pop Hot 100 No. 1. With the pleasant surprise, 4minute’s label Cube Entertainment has announced additional promotions for the fivesome’s latest EP to capitalize on the success and as a way to thank fans. The EP has three other full-length tracks. 4minute already has a routine worked out for the sassy stomper “Whatever” seen during special comeback stages on music programs. See “What’s Your Name?” live below:  As previously reported, “What’s Your Name?” saw 4minute reverting to their original electronic hip-hop sounds seen in early singles like “Muzik” and “Hot Issue.” While tracks like “Volume Up” and sub-unit projects like 2YOON’s “24/7” showcased the group’s different sides and evolution, it looks like a return to basics is just what the public wanted. HyunA, Gayoon, Jiyoon, Jihyun and Sohyun now can count themselves among the elite girl groups to nab a K-Pop Hot 100 No. 1 this past year, alongside Girls’ Generation, SISTAR and 2NE1. Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2013-05-29T23:30:00+00:00",
    "url": "https://www.billboard.com/music/music-news/4minute-to-extend-promotions-after-first-no-1-on-k-pop-hot-100-1564965/"
}