{
    "title": "5 Affordable Korean Beauty Products For Healthy Winter Skin | British Vogue",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, select My Account, then View saved stories To revisit this article, visit My Profile, then View saved stories To revisit this article, select My Account, then View saved stories We may earn a commission if you buy something from any affiliate links on our site. By Hannah Coates From glass skin to double cleansing and even sheet masks, many of the most enduring skincare trends in the UK have their origins in Korea. After a year in which we’ve never been more fanatical about what we put on our faces (the skincare sector is now on track to be valued at $169 billion by 2025), we naturally look to our Korean counterparts for winter inspiration. Maree Kinder, founder of online K-beauty emporium Beauty & Seoul, was born in Korea but grew up in the UK, and found a connection to her homeland through Korean skincare. Now Beauty & Seoul is one of the UK’s leading marketplaces for all manner of K-beauty treats, many of which have been handpicked by Kinder herself. Here, she shares her current top five favourite skincare products, to see you through the festive season and into the new year. By Hannah Coates “My current favourite cleanser is the Jumiso All Day Vitamin Clean and Mild Cleanser, which is a brightening, low pH cleanser (pH 5.5-6.5) that’s suitable for all skin types. Formulated with salicylic acid, the gentle formula helps to break down impurities and rid the skin of excess sebum deep inside the pores. A multitude of vitamin complexes such as A, B, C, D and E are also included, to help soothe skin and protect the skin’s barrier, making it perfect for the colder months.” £12, available at Beautyandseoul.co.uk. “Toun28 is a one-of-a-kind brand. As the first beauty start-up to receive funding from Korea’s skincare heavyweights, Amorepacific, it uses simple ingredients and has a huge ethos for sustainability at its core. This gorgeous nourishing toner helps maintain the balance of your skin’s pH, as well as protecting it against external irritations. The key ingredient is organic hibiscus flower extract that is enriched in anthocyanin and vitamin C, to deliver rich nutrients to the skin. It will also help refine skin texture and prep it for subsequent serums and moisturisers.” £16, available at Beautyandseoul.co.uk. “Our newly-launched Isntree Hyaluronic Acid Water Essence contains a whopping eight types of hyaluronic acid, to act on various layers of the skin. This highly moisturising essence helps to strengthen a weakened skin barrier, and offers a massive boost of hydration to the skin. It’s a must-have for me during winter!” £24, available at Beautyandseoul.co.uk. “We can’t talk K-Beauty without discussing sheet masks, and this one is environmentally-friendly. Housed in a paper pouch, the Sioris Make It Bright Sheet Mask is formulated with 73 per cent organic seasonal plum water, which is full of vitamins and minerals sourced from Gwangyang, Korea. This eco-friendly sheet mask (the first of its kind) also contains a wonderful mix of ingredients such as centella asiatica, ginseng, niacinamide and panthenol, to calm, nourish and brighten skin tone. The sheet is made from eucalyptus extract and is highly absorbent. [Celebrity make-up artist and businesswoman] Lisa Eldridge is a fan. £4.50, available at Beautyandseoul.co.uk. By Alice Cary By Hannah Jackson By Hannah Coates This is one of my favourite clay masks, designed to help clear and soothe congested skin. Formulated with Moroccan lava, kaolin and bentonite clays, it purifies and detoxes pores, whilst the inclusion of centella asiatica extract helps to reduce inflammation.” £35, available at Beautyandseoul.co.uk. By Hannah Coates By Hannah Coates By Twiggy Jalloh More from Vogue Condé Nast Britain © 2023 Condé Nast ",
    "datetime": "2020-12-12T07:00:00.000Z",
    "url": "https://www.vogue.co.uk/beauty/gallery/korean-skincare-winter"
}