{
    "title": "5 Best Vegan And Cruelty-Free K-Beauty Products - 2019 | The Strategist",
    "text": "Every product is independently selected by (obsessive) editors. Things you buy through our links may earn us a commission. Finding vegan skin care and makeup is harder than it should be. Shopping for it usually requires meticulously checking ingredient lists for animal byproducts (lanolin and bee propolis are the ones you see most often). This can be even trickier with cosmetics from overseas, like K-beauty products, as their ingredient lists tend not to be translated. Which is why I was truly delighted to discover that my favorite K-beauty site, Soko Glam, launched an entire section dedicated to vegan K-beauty products. I should note that vegan is not necessarily synonymous with cruelty-free — a brand can use vegan ingredients, but still test those products on animals during production. When I find a vegan product I want to buy, I will do a quick search for it on Leaping Bunny, Cruelty Free Kitty, or PETA’s website to see if it’s cruelty-free (if these sites don’t have the information I need, I’ve found reaching out to the brand via email or social media is the best way to get to the bottom of it). Below, my five favorite vegan and cruelty-free products available on Soko Glam. If you’re dry and blemish prone like me, these masks are a great thing to keep in your medicine cabinet for breakouts, or when your skin gets super parched, or both. They’re infused with centella (a plant used as a medicinal herb), and are my new favorite thing for soothing and taming any kind of nasty, mean blemishes. This mask is similar to my beloved Mediheal tea tree mask, but even more hydrating, and even better at taming inflamed pimples (in my opinion). The masks are currently sold out at Soko Glam, but available at the below retailers. My beloved snail mucin is, quite sadly, not vegan. But this, from Cosrx, is the perfect substitution. Unlike snail mucin, which is thick and sticky, this essence is watery and light. It penetrates deep down, using brightening ingredients including galactomyces ferment filtrate and niacinamide to reduce dark spots and create a super-radiant complexion. Every night, I pat it into my skin after exfoliating, and I really think it gives me that extra glow. I love most products that contain Damask rose — the ingredient smells amazing, and usually leaves my skin looking lovely and supple. This moisturizing toner is a light, beautifully gentle boost of hydration that makes skin look ultra-juicy and plump. Put a few drops of the stuff onto a cotton pad, and tap it into your skin after cleansing — it’ll balance things out before you go in with your exfoliant or essences. I like following it with the Cosrx essence above. I’ve been really into foaming cleansers lately — I love how light they are, and that they don’t strip my sensitive, easily irritated skin (I’ve found that they’re generally much gentler than gel cleansers). This one from Klairs is one of my all-time favorites. It’s made with hyaluronic acid and aloe leaf extract, so it’s incredibly gentle and nourishing, and doesn’t leave skin feeling tight. I like to use this cleanser after removing my makeup with micellar water or Then I Met You Cleansing Balm (which, by the way, is also vegan and cruelty-free!) Benton’s Centella Mask is the perfect treatment to use before bed on bad skin days so you wake up with brighter, glowier skin. But this Atrue mask is what you’re going to want to use before putting on any makeup. Infused with camellia leaf extract and and black tea ferment for intense hydration, this mask creates the perfect clean canvas for concealers and foundations to glide easily onto your skin. I used to use my 23 Years Old Silky Willow Cocoon Mask for similar results, but since that isn’t vegan, this is now my go-to for brightening and moisturizing. By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us. The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change. Every product is independently selected by (obsessive) editors. Things you buy through our links may earn us a commission. ",
    "datetime": "2019-05-31T11:43:16.459-04:00",
    "url": "https://nymag.com/strategist/article/best-vegan-cruelty-free-k-beauty-products.html"
}