{
    "title": "5 emerging Korean designer labels driving K-fashion’s international expansion | South China Morning Post",
    "text": "South Korean fashion, or K-fashion, enhances the image of other major exports like K-beauty, K-pop, K-movies and the country’s cultural diplomacy around the world. K-fashion is dynamic. Bold yet balanced, colourful but tasteful, edgy and sophisticated – making it a challenge to define, but attractive and easy to buy. You can find any style you want in Seoul, South Korea’s international fashion capital. Mega outlets with endless streetwear coupled with curated boutiques selling the latest styles by talented, emerging designers. Korean fashion is influential, and a big reason for that energy stems from the home-grown talent trying to express the hallyu narrative through innovation and creativity. Here are five up-and-coming designer labels to look out for: MINJUKIM Designer Minju Kim has gained prominence after winning the first season of Next in Fashion, Netflix’s fashion design competition show. Week after week, Kim wowed judges with designs displaying exceptional craftsmanship and an eye for voluminous silhouettes as exemplified by her showstopping hanbok-like, ethereal wedding dress as part of her finale showcase. Kim has an eye for a pretty, romantic, feminine dress that is approachable and flattering for women of all body types. There is something inclusive about her collections, building volume with Victorian inspirations while keeping her clothes modern, dreamy and comfortable. Think big coats, bustling skirts, peplum dresses and bubbly jackets with dangling ribbons. Kim holds two degrees – one from SADI, the Samsung Art & Design Institute, and another from the Royal Academy of Fine Arts Antwerp where she studied under the great Walter Van Beirendonck. His influence is apparent when it comes to her colour and whimsical prints. Kim also won the H&M Design Award in 2013 and the LVMH Prize for Young Fashion Designers in 2015. She has designed for K-pop artists such as boy band BTS. GODSOMWARE “If you build it, they will come”, is the mantra behind Aggie Nam’s facial accessory brand. Facial accessory, not eyewear, because none of Nam’s designs has any functional purpose. It’s all purely aesthetic-driven. It was a kind of spiritual calling, an “energy” as she describes it, that forced her to create her series of signature “butterfly sunglasses”, which cover the face with carefully positioned acrylic pieces shaped like insect wings. Some of the accessories are like eyewear, others cover the face like a mask, providing a sense of theatre and performance. Other design shapes include fierce electric flames, a giant heart and a black dragon. Janelle Monáe wore Nam’s “Third Eye Protection” to a Met Gala after-party like some ancient mystic. Nam’s designs blend the natural and religious worlds. In an i-D interview, Nam said the name of the brand means “God that exists somewhere, a thing that occurred as God insisted, and I got it from somewhere”. Nam, an atheist, is inspired by otherworldly things, and fans love her for it. The brand has built up a considerable following which loves to wear Nam’s striking accessories on Instagram. CHANCECHANCE The menswear label, launched by Kim Chan in 2013, exemplifies Korean streetwear excellence blended with a sense of dandy and punk. The brand, which draws on many influences, is endorsed by many Korean influencers, including boy band BTS. Chan’s latest collection is a colourful, multitextured one that uses various technical fabrics. There are high-waisted punk trousers, an oversized peach blazer with matching shirt, checkered skinny trousers and vest, a faux fur check jacket, a glossy moss green trench, bubbly bomber jackets, and an American flag quilted cape. Everything in the collection can be incorporated into an everyday wardrobe. Rokh Korean-born designer Rok Hwang has created quite a buzz since winning the LVHM Special Prize in 2018, and debuting at Paris Fashion Week in 2019. Before starting his own label, Rokh, he spent three years at Céline under the tutelage of Phoebe Philo, and spent time freelancing for Chloe and Louis Vuitton. Today he has around 100 stockists and has a loyal customer fan base. In some ways, Hwang is filling the gap that Philo left behind when you notice the cuts of his clothes. His perspective when it comes to deconstruction, colour and adaptable details makes him stand out. His signatures include his trench coats cut, tailored and adapted in as many ways as possible, luxurious leather jackets and accessories, and impeccably tailored trousers and blazers for working women. Hwang works with an all-female staff at his London studio, and designs with sustainability in mind. MÜNN Established in 2013, MÜNN is a unisex label that continues to impress with smart cuts and a balanced blend of streetwear and deconstructed formal wear. Designer Han Hyun-min is known for his wool and selvedge suiting, but in his latest show at London Fashion Week he showed his range and ability to innovate with pieces like his woven cape made out of men’s ties. The autumn/winter 2020 collection was filled with detailed clothes like an oversized, asymmetrical pinstripe blazer/ coat hybrid or a long coat with a flowing scarf tail. Every outfit married numerous textures, fabrics and accessories, yet there is still a sense of clear intent and polish with each look, even with zips placed in all directions on a silver nylon jacket and pants set. Want more stories like this? Sign up  here. Follow STYLE on  Facebook,  Instagram,  YouTube and  Twitter . Help us understand what you are interested in so that we can improve SCMP and provide a better experience for you. We would like to invite you to take this  five-minute survey on how you engage with SCMP and the news. Rokh, MINJUKIM and other designer labels are at the forefront of the influential, home-grown Korean talent developing the hallyu narrative in a similar vein to K-beauty, K-pop and K-movies ",
    "datetime": "2020-05-03T06:00:13+08:00",
    "url": "https://www.scmp.com/magazines/style/celebrity/article/3082580/5-emerging-korean-designer-labels-driving-k-fashions"
}