{
    "title": "5 K-beauty skincare hacks for getting beautiful, flawless, glass skin | South China Morning Post",
    "text": "With K-beauty taking over the world, there has been an increased interest in how Koreans take care of their skin to achieve a flawless and radiant base. From BB cream to sheet masks, a large portion of K-beauty’s success actually comes from skin-related items. Apart from the products, however, what we really want to know are the secret tips and tricks Koreans follow to get that dewy glow. Being a Korean myself and raised by a mum with “glass skin”, I grew up believing that some of these tips I’m about to introduce were actually commonly used by everyone; only after the K-beauty wave began did I realise I was wrong. Scroll down to take a look at some of the most popular Korean skincare regimen to achieve aegi eongdongi (애기 엉덩이, meaning “baby’s butt”, a term used to describe someone with perfectly smooth skin), and make sure to try some out at home as they’re not hard at all to follow. Double cleansing is key Especially in an age where air pollution is a major issue, it’s important to cleanse until you’re sure there is no excessive residue left on your skin. After washing your face, you might believe your skin is completely clean – until you notice more foundation and dust on the toner pad you use to wipe your face afterwards. Always remember thorough cleansing is what will get rid of your blemishes. Hiding them under a layer of concealer and foundation won’t help the healing process. The first step of double cleansing is using a make-up remover to first get rid of all the make-up from eyes to lips. Wash your face again using a foam, soap or balm and massage thoroughly to remove any residue. Some well-known holy grail cleansing products include Banila Co.’s Clean It Zero Cleansing Balm and Laneige’s Perfect Pore Cleansing Oil. Do not waste the water you used to wash your rice As weird as it may sound, rice water, which is basically the water you use to rinse rice before cooking, can be used in a lot of different places. I’ve witnessed my mother and grandparents watering plants with it, using it as a base for making Kimchi stew and washing their faces with it. This method is very easy and accessible as long as you regularly cook rice at home. Simply use the rice water instead of tap water, or soak cotton rounds with it and leave in the refrigerator for an easy cooling mask before going to bed. If rice is not a staple for you, there is a wide selection of beauty products made using rice, such as Tatcha’s Rice Polish Foaming Enzyme Powder or TonyMoly’s I’m Real mask. Rice water is great for anti-ageing, soothing irritated skin and treating eczema and acne – you can also rinse your hair with it for extra moisturisation. Be generous when using toner or essence on cotton rounds One way to apply toner and essence for extra absorption is by using soaked cotton pads. No matter how expensive the products are, be generous with your toner and essence. If you don’t soak the pads enough, they will add friction, scratching and irritating the skin. Make sure the rounds are wet enough so they add gentle moisturisation to your face and neck. If you feel you’re wasting the products, leave the leftovers in the refrigerator to use as partial cooling masks later on. Do not wipe your face using towels In similar context with the previous hack, towels can do great harm to the skin although it may be hard to see with the naked eye. After washing your face, leave it to air-dry instead of rubbing or patting using a towel. Other than the irritation they may cause, there are a surprisingly large amount of bacteria living in your towels, even if you’ve washed them. Be sure to moisturise as the water left on your face becomes almost dry. Keep your hands away from your face This one is easy to understand but hard to execute. With your hands touching objects such as your phone and computer keyboard, they are the perfect place for bacteria to live. Regardless of all the hand soap or sanitiser you use, try to keep your hands from touching your face. Other than hygiene, our fingers are also covered in excess oil which is the last thing we want to add to our skin. The more you touch your face, the more breakouts will be triggered. Want more stories like this? Sign up  here. Follow STYLE on  Facebook,  Instagram,  YouTube and  Twitter . Korean skincare routine is easier than you think, and by following these simple at-home tips, you, too, can get that dewy glow so many Asian women have ",
    "datetime": "2019-10-25T12:00:14+08:00",
    "url": "https://www.scmp.com/magazines/style/well-being/article/3034363/5-k-beauty-skincare-hacks-getting-beautiful-flawless"
}