{
    "title": "5 K-Beauty Products That'll Lead Me To Bankruptcy",
    "text": "My K-beauty obsession began long before I fell for a K-drama’s charming yet elusive second lead. I was treating my spotty, teenage nose with Bioré strips at 13, and picking up Etude House’s Dear Darling tints from the local beauty shops in Imphal. However, the fixation on Korean-origin products only took speed when I dipped into the skincare section. Unique ingredients paired with gentle formulations targeted toward sensitive Korean skin, K-beauty is where my skin started feeling at home, finally! Korean business trends point towards an invested interest of Korean brands in the Indian market. Beauty enthusiasts now feel spoilt with the options. In addition to a dynamic range of products, the price points are inclusive as well. You can find your everyday moisturiser with the economically-priced Tony Moly, or experiment with pearly powder cleansers at the luxurious House of Dohwa. But, as with everything else in life, I landed in the middle of that scale. Still, with my writer’s salary, my current K-beauty indulges are sure to leave me bankrupt in my 20s. Here are the absolute darlings of my skincare routine that will have me making financial institutions very mad.   A post shared by celimax.global (@celimax.global)  Anybody who knows me intimately knows that I have to turn into a dewy baby from head to toe straight out of the shower. But with Bombay’s humidity and a sweaty commute, anything thicker than watery lotions makes me uncomfortable. Enter: Korean essences! I apply these lightweight and ultra-hydrating skincare boosting essences on damp skin to put lost hydration back post-shower. Formulated with botanical sedum extract and low molecular weight hyaluronic acid, Celimax’s clear solution has transformed my skin. Doubling up as a primer for the products that follow, the gentle formulation feels like a loving hug on stressed skin at the end of the day. Plus, it keeps my oily skin in check and makes my perfumes smell better!   A post shared by THANKYOU FARMER 땡큐파머 (@thankyoufarmer)  NGL, the adorable name is what led me to make a purchase from TYF; their focus on hard-working ingredients in their formulations being a delightful revelation later on. The light and refreshing gel-based cream has a soothing effect and hydrates the skin without leaving a greasy residue. Formulated with inositol, trehalose, and collagen, the day cream offers intensive pore care, has been vital in rebuilding my skin barrier post a bad batch of maskne and makes my skin look glazed under the sun.   A post shared by COSRX Official (@cosrx)  Snail mucin to my skin is like ketchup to fries; the ingredient has worked so well for my unique skin concerns. I have been using either/all of the snail products from COSRX for the past two years and the companionship has been beautiful. From treating dry patches on elbows and knees to keeping neck hyper-pigmentation in check , these babies are a mainstay in my routine. FYI, nothing has worked better to fade my post-acne marks than snail mucin, just saying!   A post shared by 네시픽 한국 공식 인스타그램 (@nacific_kr)  I am going to sneak in a controversial pick among skin-soothing picks! After all, when a goddess among women like Jun Ji-Hyun reveals a beauty secret, we should oblige. Popularly known as the ‘Damn Serum’ due to the tingling sensation (!!) it leaves on the skin, this Nacific bestseller only steps out of my skincare fridge once or twice a week. It is formulated with citrus oils like lemongrass, lime peel and apple mint to tighten and improve the appearance of the pores. The firming serum does just that – firms the skin! Somehow, even with the tingling sensation, the serum doesn’t overly-sensitise my reactive skin type. The presence of patented antioxidant component ‘sepicalm’ – a blend of water lily extract, amino acids and aloe leaf water helps minimise the discomfort. Plus, as your skin recovers from damage and oxidisation, the tingling sensation starts to disappear, indicating that the skin is actually getting healthier!   A post shared by Rovectin Global (@rovectin_global)  A simple practice that helped improve my skin’s health was skipping the cleanser in my morning routine and just splashing some cold water on my face. Since my nighttime routine involves double cleansing, most days I don’t need to go in with a heavy-duty face wash in the morning. But on days I feel oilier, or there is leftover makeup from a shoddy nighttime routine job, I go in with the gentlest formulas. Formulated with glycerine and natural coconut oil derivative called sodium cocoamphoacetate, the translucent gel cleanser serves as an alkaline pH buffer agent for your cleansing routine. The cleanser is so gentle that it can be used on babies! It’s going to be my ideal morning cleanser for years to come! Images: Instragram ",
    "datetime": "2022-09-08T17:12:22+05:30",
    "url": "https://elle.in/best-k-beauty-finds-online-india/"
}