{
    "title": "5 Korean skincare facts to know as per the actual Korean skincare gurus",
    "text": "Do Koreans actually engage in an 11-step skincare routine? Popular label, Glow Recipe’s founders Christine Chang and Sarah Lee debunk a few Korean skincare myths for us. They also give us an insight into how to incorporate a Korean skincare routine into your regular regime. “Christine (Chang) and I have been friends for half our lives. We met each other in Korea where we were working with the L’Oréal group,” says Sarah Lee, recalling a time long before the launch of their Korean skincare brand, Glow Recipe. The two remained good friends even years later living in New York, where Sarah worked for L’Oréal Paris and Christine with Kiehl’s. “One day we were hanging out at my apartment, drinking wine and sheet masking. Then we realised we were the only two Koreans at our company, we’re bilingual, we’ve worked in Korea, and we understand the global consumer,” Sarah shares. Glow Recipe was founded then in 2014, first as a brand curating Korean beauty products and now, with its own skincare formulations the girls are excited to share. There are four products they highly recommend, or as they call it, “glow game-changers”: the oil-free, lightweight Watermelon Pink Juice Glow Moisturiser, Watermelon Glow PHA+BHA Pore-Tight Toner, Avocado Melt Retinol Eye Sleeping Mask, and Glow Recipe’s star product, the Watermelon Glow Sleeping Mask. Shop Glow Recipe Watermelon Glow PHA+BHA Pore Tight Toner Over a Zoom media presentation, Sarah and Christine share more about Korean beauty and how time-held traditions have shaped Glow Recipe — quite literally too, as we also learn that the sleeping mask is bottled to resemble an ice cube, a beauty remedy used by Korean women for hundreds of years. Sarah: From a very young age, Christine and I learnt from our mothers and grandmothers that we should respect our skin, and that the process should be enjoyable. When you come back home after a stressful day, you want to give yourself that ‘me time’. Skincare is one of the most powerful tools to help you feel more confident and beautiful, especially when you’re staying at home these days. Christine: There’s a term we coined for that, it’s called ‘skin-tertainment’, a combination of skincare and entertainment. We really believe that skincare should be the best part of your day and it should feel very pampering. Co-Founders of Glow Recipe Sarah Lee and Christine Chang (Photo by Lilly Lawrence/Getty Images) C: The first product we launched was the Watermelon Glow Sleeping Mask. This one is inspired by a childhood memory of our Korean grandmothers, who would rub watermelon rind on their skin in the hot summer months to help soothe irritation and heat rash. We wanted our mask to have that same lightweight feel with a whipped gel texture. When the product launched, other masks in the beauty market only did one thing, like pore-refinement or hydration. There wasn’t a mask out there that combined exfoliation and hydration. Whenever we went to Korea, we’d get the most amazing facials that were both exfoliating and hydrating, yet gentle and effective. After a thousand formula submissions, we were able to capture that in this one pink jar. Shop Glow Recipe Watermelon Sleeping Mask C: Everyone knows the Korean beauty glow. When we went to Korea, we learnt from K-beauty artists to use Vaseline or gloss for that lit-from-within glow. We wanted to recreate that with skin-beneficial ingredients, and we’ve done so with the Watermelon Glow Niacinamide Dew Drops. Shop Glow Recipe Watermelon Glow Niacinamide Dew Drops S: I will say that Korean men are the most skincare-savvy men on the globe — there are stats to support that — and the grooming market is huge and still growing. In fact, one of the reasons Korean skincare has become so popular worldwide is because men in Korea use skincare as well, and lightweight beauty products to achieve a smooth, even complexion. I have a lot of male friends in Korea that use a full skincare routine in the morning and night. My dad uses SPF and a BB cream, plus now he’s using most of our Glow Recipe products! C: A multi 15-20 step routine is often the hallmark of K-beauty, but it’s really not the case. The way Koreans approach skincare is understanding that your skin, just like how your body feels, changes every day. Sometimes your body feels a bit more tired and you might know to get more sleep. Let’s say then that you’ve had sunscreen and makeup on your face all day and your skin feels clogged, in this case, you might want to double cleanse. If your skin is dull, you can combine brightening and hydration by combining our Pineapple-C Bright Serum and Plum Plump Hyaluronic Acid Serum. This type of fluid approach to skincare is really what we believe in. Shop Glow Recipe Pineapple-C Bright Serum Here Shop Glow Recipe Plum Plump Hyaluronic serum All images: courtesy Glow Recipe This article first appeared on Prestige Online Malaysia. Yes, I agree to the Privacy Policy For your daily updates on all things luxury, follow us at @lifestyleasiahk Yes, I agree to the Privacy Policy Subscribe to our newsletter to get the latest updates.  Thank you for your subscription. ",
    "datetime": "2022-10-26T07:00:43+00:00",
    "url": "https://www.lifestyleasia.com/hk/beauty-grooming/skin/5-korean-skincare-facts-to-know-according-to-actual-korean-skincare-gurus/"
}