{
    "title": "5 Korean Beauty Brands At Bergdorf Goodman | Beauty Packaging",
    "text": "The pop-up at Bergdorf Goodman features 5 K-Beauty brands curated by Peach & Lily’s founder Alicia Yoon. A Look at Femmue, Abib, Eco Your Skin, Jungsaemmool and Atoclassic FEMMUE: The line includes masks, in jars, that contain actual flower petals. Flower Infused Fine Mask includes camelia petals and camelia oil from Jeju Island, potent antioxidants to brighten skin. Gypsy Rose Calming Mask has Kaolin clay for pore-clearing and soothing rose extracts. FEMMUE: The brand also has serums and oils. Ideal Oil is a blend of 67% pure camelia oil olive, rosa, grapeseed, and jasmine with vitamin E to help combat aging and firm the skin. Lumiere Vital C, in a glass serum bottle with a black coating for protection, contains a stabilized vitamin C derivative to brighten and even skin tone, plus safflower seed oil, Hyaluronic acid and panthenol. ABIB: This unisex brand is known for its minimal packaging combined with pure and potent formulations. The brand’s Black Brick Facial Soap contains charcoal. The moisturizers, in tubes, are Hydration Creme and Hydration Gel Water Tubes — and they contain 20 natural ingredients and no additives. The ingredient list doubles as a decorative graphic. ECO YOUR SKIN: This brand includes a range of solutions formulated for pro results in a variety of interesting packages, some of which look high-tech. A few of the brand’s Booster Serums are shown, in syringes -- they are Co-Enzyme Q-10, Collagen, and Vitamin B5. ECO YOUR SKIN: The brand’s Layering Essences are “liquid supplements” for the skin formulated to be highly absorbable. Each bag comes with an empty bottle for the ‘essence’ to be poured into. Apply one layer for a light refresh or layer several for a full facial experience. Lifting contains Chamomile flower and leaf extract; Anti-Wrinkle has adenosine and kudzu root extract; Oily has a blend of antioxidants to boost hydration while normalizing the skin’s oil-water balance. JUNGSAEMMOOL: A makeup line created by Jung Saem Mool, a renowned makeup artist in Korea. Shown: Star-Cealer Foundation; Artist Eyeshadow Palette; and Tinted Lip Glow. ATOCLASSIC: This brand's products are based on Korea’s ancient herbal medicinal heritage, “Hanbang” practices -- traditions used for 100 years in Woobo’s Clinic in Korea, which were passed down from a great-grandfather to his descendants. Real Tonic Calming Intensive Cream has mistletoe extract; Smart Lotion includes a variety of herbal and medicinal root extracts; and Moist Mist features Whangryun, or \"golden thread,” an anti-inflammatory known as a fever reducer. Perfect for flushed, irritated or dry skin. Cookies help us to provide you with an excellent service. By using our website, you declare yourself in agreement with our use of cookies. You can obtain detailed information about the use of cookies on our website by clicking on \"More information”. Got It Copyright © 2023 Rodman Media. All rights reserved. Use of this constitutes acceptance of our privacy policy \n                The material on this site may not be reproduced, distributed, transmitted, or otherwise used, except with the prior written permission of Rodman Media. ",
    "datetime": null,
    "url": "https://www.beautypackaging.com/contents/view_slideshows/2017-11-01/5-korean-beauty-brands-at-bergdorf-goodman/"
}