{
    "title": "5 Korean Beauty Brands That'll Make You Feel Like A Teenager And Channel Your Inner K-pop Star",
    "text": "Fashion  I have three words for you that may change your life: Korean beauty products. On balmy weekday evenings during the years I spent in Seoul, South Korea, you could find me in Myeong-dong. Every one of the streets in this downtown neighborhood is lined with style and beauty shops, and the sidewalks are jammed shoulder to shoulder with packs of young, fashion-hungry women. Korean youth trends are fast, cheap, and fantastically out of control, and Myeong-dong is where they happen. I didn't get my clothes there — most of them didn't fit my plus-size body anyway. It's the Korean skincare, beauty, and cosmetics stores that are the real discoveries of this jam-packed, frenzied shopping district. On any given corner in Myeong-dong, there are at least two or three Korean cosmetics stores. Sometimes, two branches of the same chain stand across the street from one another, like H&M or Starbucks in midtown Manhattan. I would usually dip in to each, grab a few products to try out, and eventually I'd show them off to my Korean friends. The first time I showed a coworker my haul, she started laughing at me. It was the kind of laugh that said \"Why is cute foreigner so pleasantly obtuse?\" I asked her why she was chuckling. \"These stores are only for teenagers,\" she said. \"You mean they cater to teenage skin and aesthetic?\" I asked, curious as to why that could possibly be so hilarious. She collected her thoughts and giggles and said, \"No, because only teenagers shop there. You are an adult woman. You should not shop there.\" Then it was my turn to giggle. According to my coworker, most adult Korean women shop for their beauty products at department stores. Department stores carry high-end Korean cosmetics, as well as heavily taxed Western products. Brands like MAC, Estee Lauder, and Bobbi Brown are status symbols in Korea, and many women will buy these imported brands at a huge markup, simply to show off. This came as a shock to me, especially since I considered my favorite stores to be the beauty-lover's ultimate fantasy dreamland. Some chains, such as TONY MOLY and Skin Food, are independent. Many of the others are under the corporate umbrella of makeup giant AmorePacific, which owns stores like Etude House and Nature Republic. Despite the different aesthetics of each, they all sell the same thing in the same way. Their walls are lined with skin and hair care products, and cosmetics are displayed on center islands. The products are cheap, fantastically packaged, and for someone who loves to experiment with beauty, a whole lot of fun. Maybe my coworker was an anomaly. To make sure, I asked 26-year-old English teacher Jihye Park, currently in New York to spend a sabbatical year away from her home on the island of Geoje off Korea's southeastern coast. I thought Park might have a different view. After all, she's closer to my age, and she didn't grow up in the cosmopolitan heart of the country. Apparently, that doesn't matter. \"Only teenagers shop at the stores you shop at,\" she said. \"I like some of those products, but if I bought them, I'd be embarrassed to show my friends.\" So while I am quite proud of the Korean beauty collection I have amassed, I've had to accept the fact that it would only be appreciated appreciated by a cheeky teenager. When Park confirmed this, I began to recall lots of curious stares while I browsed the shelves. It all makes sense now. But I refuse to accept that I shouldn't have shown my face in Myeong-dong's considerably cheaper Korean beauty stores. Over the years, I cultivated a love for certain products, and it's time to share that love with the world. Check out my suggestions below — it will be like we're all 15 again. Nature Republic Venum Mist, $20, Amazon; Nature Republic Aloe Sheet Masks, $7, Amazon; Botanical Eyeliner, $11, Amazon Nature Republic was founded in 2009, and the entire brand is based around the idea that it's \"fresh\" and \"natural.\" The store's taglines — \"from earth\" and \"a sense of the beginning\" — extend this hazy image of unadulterated nature that will leave your skin soft and cool as a fresh green leaf. Mind you, there is zero hard evidence that the stuff is actually pure and natural. That doesn't stop it from being awesome. Korean pop superstar Rain endorsed the company for two years after it opened its doors, planting it firmly in the minds of his many devotees. My skin is nowhere near as fresh and dewy as Rain's, but that didn't stop me from trying. There were three products in particular that I grew fond of: Bee Venom Mist, meant for misting and calming your skin after cleansing; Aloe Vera Sheet Masks, which are made out of a soft paper that is saturated in aloe vera; and Botanical Eyeliner, which went on like a charm and lasted forever. Shiny Skin Soap, $8, Amazon; Peeling Foot Liquid, $9, Amazon TONY MOLY products are known for their twee packaging and displays. In fact, the brand's tagline is \"putting style into packaging.\" When it comes in a container that looks like a bird or a foot, who has time to care about what's inside? I am especially fond of TONY MOLY's preoccupation with things that are shaped like eggs, and that just so happens to include two of my favorite products. The egg-shaped cleansers give your skin a matte, soft finish, and the balm kit (particularly the mask) removes pesky blackheads and reduces the appearance of your pores. The real showstopper here is the Super Shiny Peeling Foot Liquid — it's basically like a pedicure in a bag. You put your feet into little plastic bags, pour in the magic liquid, and wait an hour. After three or four days, all the nasty dry skin on your feet begins to peel off in strips. The soft, smooth results make up for the pretty revolting (and secretly delightful) process. Dear Darling Lip Tint, $7, Amazon; Moistfull Super Collagen Multi Stick, $11, Amazon Originally a Japanese brand, Etude House is known for its bright pink facade and ultra girly aesthetic. The girls who work on the floor all wear ruffled, glittery costumes, and the tagline for the store is, \"Wanna be sweet? Play Etude!\" Needless to say, I would never endure such an intensely pink and girly environment unless I knew that the products were worth it. Etude House is most popular for its cosmetics, particularly its vast array of lip tints and many shades of \"Lovely Cookie\" blush. It also has a line of nail vitamins and tools called \"Help My Finger,\" which definitely gives them the title of Most Adorably Named Products in my book. My favorite thing from Etude House is the Super Collagen stick — if you wipe this stick all over your face after cleansing, your skin feels like a dewy dream. In Korea, this highly-coveted skin type is called mulgwang, which literally translates to \"water skin.\" Lovely Cookie Blush, $6, Amazon; Help My Finger, $4, Amazon Black Sugar Cleansing Oil, $15, Amazon; Black Sugar Serum, $26, Amazon; Black Sugar Mask, $8, Amazon Skin Food is probably the least popular teen beauty brand — in fact, the only reason that its sales are soaring is because of their tremendous popularity with the Chinese market. This was one of my favorite stores to shop in, and not just because its tagline is \"beauty food for the urban sweety.\" The products are cleverly packaged and themed — they have an entire line of grapefruit, carrot, and cucumber skincare systems, to name a few. My favorite is the Black Sugar line, which is comprised of a cleansing oil, a serum (which has the consistency of a velvety toner), and an uh-may-zing brown sugar scrub. I've been out of Seoul for a year, and I still keep a few tubs of this around. Even my father uses it, skin-conscious urban sweety that he is. Time Revolution Essence, $28, Amazon; Night Repair Serum, $26, Amazon If you've successfully made your way through the first four stores, you are now permitted to grow up a little and shop at Missha. \"Missha is a little step above the others,\" said Jihye. \"You can shop there in your twenties,\" she paused. \"And maybe your thirties.\" Did you hear that? That means that this brand can potentially carry me into my third decade without shame — and good thing, too, because these products are absolutely incredible. The Time Revolution Essence (like a toner) and Night Repair Serum reboot your skin overnight. They also come in glass apothecary-type jars that feel super fun and scientific. Think of Missha as your first tentative step into grown womanhood. Maybe by the time you're 35, you'll have it together enough to be allowed into Korean department stores. Images: Getty; Giphy; Courtesy Brands Choose an edition: ",
    "datetime": null,
    "url": "https://www.bustle.com/articles/84855-5-korean-beauty-brands-thatll-make-you-feel-like-a-teenager-and-channel-your-inner-k-pop"
}