{
    "title": "5 Korean beauty haircare tips that will give you healthier, softer and shinier hair | Vogue India",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, visit My Profile, then View saved stories By Hasina Jeelani In the scope of what we know of Korean beauty, haircare is something of the middle child—often eclipsed by illustrious skincare routines. While K-beauty skincare secrets are passed down as gospel, the wisdom of the Koreans in the realm of haircare has just as much to offer. Charlotte Cho, co-founder of Soko Glam, seconds the sentiment. Having coined the term ‘10-step routine’ in 2014, she often brings back K-beauty secrets as souvenirs from her regular excursions to Seoul. Ahead, we got her to divulge more about the K-beauty philosophy of haircare. “Whenever I would get my hair done in Seoul, my hairstylist would be shocked that I hadn’t paid close attention to my scalp. I’d usually receive a stern scolding for not using hair oils more often,” she reminisces. This scalp serves as the focal point of healthy hair in K-beauty, and this served as the motivating factor for her curation of products for Soko Glam. Cho says, “The consensus amongst Koreans is that the health of your scalp is just as important as the skin. A well-cared scalp improves the appearance of your hair, making it look shiny and soft to the touch.” Beauty enthusiasts will have little trouble finding similarities between K-beauty’s haircare philosophy and its fabled approach to skincare. “Some of the core principles of K-beauty like ensuring your skin is moisturised and your skin’s pH is optimal hold true in haircare too. Keeping your hair moisturised and ensuring your scalp does not dry out is key,” she affirms. The good news is that there isn’t an intimidating 10-step approach to get started. “Men and women in South Korea are meticulous when it comes to maintaining healthy hair with a three-step process. After washing the hair with shampoo and conditioner, they often apply a hair essence or hair oil to achieve a shiny head of hair. Hair masks, serums, milks and hair mists are all must-haves,” explains Cho. If you’re looking to reconfigure your approach to haircare from the Korean perspective, Cho shares her best-kept secrets: Hair essence or oil is a common factor in K-beauty to treat dry, brittle hair. The insider’s secret is to use it only on the tips of your hair, and not close to the scalp, as it could lead to build-up and clogged follicles—similar to the pores on your skin. Just like their skin, Koreans believe in caring for their hair on a regular basis and will use a hair mask or scalp scrub once a week. It’s always best to leave the mask on for 10-15 minutes so that it can really get absorbed and properly nourish the hair. Look to deep conditioning leave-in treatments, such as a hydrating hair butter with organic pumpkin seed and argan oil to rejuvenate chemically-treated hair and help damaged hair feel softer and look silkier again Exfoliating isn’t just for the skin—the scalp requires a regular detox as well. Scalp scaling can be done at a salon to exfoliate debris or excessive oils that often serve as the catalyst for breakage, dry, brittle hair and stunted growth. Koreans also swear by the powers of carbonated water to help with gentle exfoliation and to purify the scalp. When used on the scalp, natural sparkling water is believed to slough through dead skin cells for a cleansed scalp. The best way to oil your hair to get the most out of the soothing ritual Does your haircare routine need a toner and a scrub? This is what a dermat says What makes K-beauty a global skincare phenomenon? By Hasina Jeelani By Prabal Sharma By Kejhal Kalra By Shriya Zamindar By Daniel Rodgers By Hasina Jeelani By Mehak Sirohi See more stories Condé Nast India © 2023 Condé Nast. All rights reserved. Use of this website constitutes acceptance of our Terms of Service and Policy and Cookie Statement. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. ",
    "datetime": "2020-11-16T05:30:00.000Z",
    "url": "https://www.vogue.in/beauty/content/5-korean-beauty-haircare-tips-that-will-give-you-healthier-softer-and-shinier-hair"
}