{
    "title": "5 need-to-know Korean makeup hacks, according to a K-beauty expert | Vogue India",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, visit My Profile, then View saved stories By Avanti Dalal From need-now ingredients to must-try trends, the Korean beauty industry is at the forefront of all of it, with new and cool innovations becoming a large part of our beauty vocabulary every day. While Korean skincare is up there and much-discussed (The K-beauty products market is expected to reach $13.9B by 2027), their approach to makeup is worth bringing focus to as well. Korean men and women favour dewy complexions that look lit-from-within, K-makeup formula is often fortified with good-for-you ingredients in light, whipped, comfortable formulas. We spoke to Kim Myung Jun, head makeup artist, Etude House for the K-makeup trends worth copping. This content can also be viewed on the site it originates from. Jun says that exfoliation is key before makeup application. “Use a scrub that suits your skin type,” he suggests. Then, prep the skin by drenching it with hydration—serums, essences and moisturisers leave the skin feeling and looking bouncy and supple. When you're applying a base product like foundation or concealer, Jun says that finding the right colour from the get-go is key. Once you have the shade of choice, apply evenly to the skin using a brush or sponge. “It is better to apply thin layers several times with small doses rather than using a large amount of the product from the beginning,” he says, especially if you're trying to get the product to look like second-skin. This content can also be viewed on the site it originates from. By Hasina Jeelani By Prabal Sharma By Kejhal Kalra Cushion formulas are mousse-y, bouncy and silky smooth, giving you a luminous base. To apply, press the middle of the compact (Jun likes the Etude House Double Lasting Cushion Cover) with the cushion to disperse the formula, and then dab it around your face in a pressing, sweeping motion. It is important to control the amount of the product and how to apply it. Once you've put the content on the puff, do not apply to the face immediately, but adjust the amount on the middle lid of the cushion product and then apply,\" Jun confirms. “Be careful not to push the contents, you want to tap it in,” he says. This content can also be viewed on the site it originates from. Korean women love looking fresh and flushed, and they do this by applying a watery tint on their cheeks—no powders here. “In order to look like you're blushing naturally from within, moist skin has to be the base. Then, tap on a cream blush with a sponge or your fingers and blend upwards and outwards,” he says. Many tints are formulated for the lip and cheeks, and many like to apply the same colour to both. In order to apply a lip stain, it is best to wipe the lips clean with a cleansing tissue, then apply a concealer or cushion compact to make the lip tone even, and then apply the stain on top, he says. This content can also be viewed on the site it originates from. By Hasina Jeelani By Prabal Sharma By Kejhal Kalra Children's brows are usually naturally straight, and Korean women like to keep that shape going even in adulthood to look as young as possible. “Draw a straight line from the start point under the front of the eyebrows to the end of the eyebrows, and then arrange the line clearly accordingly. Then, arrange and draw the eyebrows above so that they have straight line following the guideline,” says Jun. This content can also be viewed on the site it originates from. Just like they want their makeup to look like they've woken up with it, K-makeup obsessives like their lashes to look natural too. For a similar look, Jun suggests using individual lashes and applying them where you need to add volume only. If you have a strip lash on hand, “Depending on the shape of the eye, divide into two or six equal parts, and apply only where needed,” he says. When you're looking for a mascara, look for one that won't clump at all, but has an applicator that'll reach every part of the lash, like the Etude House Lash Perm Curl Fix Mascara, which has a C-curve shape to do exactly that. 7 top Korean beauty skincare trends of 2020 for glowing skin like never before 12 exciting Korean beauty trends you have to try in 2021 South Korea is currently seeing a backlash against K-Beauty. Here’s why it’s important By Namrata Kedar By Hayley Maitland By Kejhal Kalra By Anjan Sachar See more stories Condé Nast India © 2023 Condé Nast. All rights reserved. Use of this website constitutes acceptance of our Terms of Service and Policy and Cookie Statement. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. ",
    "datetime": "2021-03-09T08:35:50.148Z",
    "url": "https://www.vogue.in/beauty/content/best-korean-makeup-hacks-according-to-a-k-beauty-expert"
}