{
    "title": "5 Things Brands Need to Know About Winning in China's Beauty Industry",
    "text": "When I studied at University in Beijing in the 1990s, my Chinese friends would always ask me to buy them “French perfume” when I traveled back to Europe. It was considered one of the best gifts in those days. How things have changed. Today, if you want to make an impression, give a friend some K-Beauty. The beauty boom here is nothing short of revolutionary. On average, working women spend about 30 percent of their disposable income on cosmetics and treatments. The beauty market is growing steadily at 20 percent year on year. But to win in the market, there are five key trends brands, marketers, and retailers need to know: Holistic Beauty From the big-name brands with a clinical approach to beauty, the market has seen a shift to “Holistic” beauty. Organic, eco-friendly brands with Asian roots are having their moment, and investment from big players such as LVMH is pouring in. Think antioxidant, ginseng, ginger, and snail masks. Brands with great stories like Lu Ming Tang, which harnesses the power of Longing tea grown around Hangzhou, is an example. Developed by Marie Amiand, a French beauty specialist, the brand fuses French skincare expertise with Chinese tea wisdom. Niche Brands Overlapping somewhat with holistic beauty are “niche” brands. With the ever-increasing sophistication of consumers here, smaller brands are enjoying success with a very discerning audience. Brands like Sisley, Jurlique, Jo Malone, and Osio are a few examples in this category. Great stories create talk value and put you in the “in-the-know” camp, when it comes to beauty! K-Beauty (aka beauty brands from Korea) This industry is huge with Chinese shoppers. Just step into any duty-free shopping mall in Seoul, and you’ll immediately understand what the buses outside are for. They are delivering thousands of eager Chinese shoppers looking for the elixir to eternally youthful white skin. In terms of atmosphere, these lively malls are comparable to a bustling vegetable market in a Chinese city, but I don’t think that bothers the people making big sales at Sulwhasoo, Laneige, and other top Korean cosmetics labels. An added bonus is the lower price point compared to Western brands, and the perception that Korean beauty brands are better suited to the Chinese epidermis. An ad for a Korean beauty brand. Star Power In the female beauty category, sometimes it’s a man’s world. Yes, many key brands will use male ambassadors to appeal to women in the Chinese market. SK-11 and Biotherm have successfully gone down this route, and brands often choose young “pop idols” as their ambassador of choice. For brands that want to stand out, don’t go in for the obvious female celebrity, but pick a man for your campaign. If you can afford it, make sure he’s Korean to ensure even bigger success! Digital Get yourself connected. We’ve said it before and we’ll say it again–without connectivity it just won’t work in China. Just consider this: more than one-third of the beauty sales in China are now made online. Tmall accounts for 70 percent for those online transactions. Selling and marketing your brand online is key. Find the right KOLs, sort out a Tmall store and your social media platforms, then get creative. Whilst the market is changing rapidly, the opportunity is only getting bigger. Beauty brands that haven’t mapped out a solid China strategy should start today. Chloe Reuter is the founder and CEO of Reuter Communications. Beauty, Market Analysis china, china beauty industry, china luxury, Jo Malone, Jurlique, k-beauty, korean beauty brands, Luxury, Osio © 2023 Herlar, LLC. All rights reserved. Jing Daily® is a registered U.S. trademark of Herlar, LLC. Sign up for our daily newsletter to unpack the business of luxury in China. Gain insights, analysis, and breaking news from our on-the-ground reporters. Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. ",
    "datetime": "2016-09-07T04:00:00+00:00",
    "url": "http://jingdaily.com/op-ed-5-things-brands-need-to-know-about-winning-in-chinas-beauty-industry/"
}