{
    "title": "5 Top Korean Models Share Their Best K-Beauty Secrets",
    "text": "From sunscreen to sheet masks. It’s no secret that Seoul, South Korea, is a skincare-obsessed city. So, for Seoul Fashion Week, we asked four Korean models—Sunghee Kim, HyunJi Shin, HoYeon Jung, Yoon Young Bae and Sora Choi—to share their beauty tips. From their love of sheet masks to their diligent SPF beauty regimens, here is how these models look runway-ready at all times. Sunghee Kim @_sungheekim Product you cannot live without during Fashion Week: Dermartlogy Ageless Cream. I’m using this product every day when cleansing, too. Good skin starts with: Drink water, and I’m using Whal Myung Skin Elixir as mist and skin toner. Your ultimate Korean beauty rule: Most Koreans make sure to apply sheet masks two to three times a week.  P.S.: You can buy mask packs for $1 in Korea. HyunJi Shin @iamhyunjishin Product you cannot live without during Fashion Week: I have dry skin, so it’s super important for me to stay hydrated! La Mer is great. Good skin starts with: My dad has always had great skin, so I think I’ve inherited some of his great genes.  Every day before I go out I put on sunscreen—it’s the basics to great skin. Your ultimate Korean beauty rule: Water, sleep, and always remove your makeup before bed. Sora Choi @sola5532 Product you cannot live without during Fashion Week: Because I put on and erase makeup multiple times throughout the day during Fashion Week, I always prioritize basic skincare. I always put on sheet mask before I go to bed. Recently, I’ve been using ones from Dr. Jart+. Good skin starts with: I always put on sunscreen, no matter where I go or what I do. Even when I’m not planning on stepping out for the day, I put on sunscreen to maintain my skin tone. For daily moisturizing and skincare, my favorite is Dior Hydra Life; it keeps my skin bright and smooth. Your ultimate Korean beauty rule: I don’t know if it’s a “Korean” beauty rule, but I try to have my makeup look as natural as it can be. Think your typical “no makeup” makeup, with slightly dewy skin, rather than looking too matte. HoYeon Jung @hoooooyeony Product you cannot live without during Fashion Week: Sheet masks. During Fashion Week, my skin becomes sensitive, so I always put on a sheet mask before I go to bed. It soothes my skin! Good skin starts with: Drinking two liters of water a day, washing your face only with water when it’s morning, don’t touch your face often with your hands, and make sure to wear sunscreen! I try not to give my skin a strong stimulation and I try to protect the fluids and oils that come from my body as much as possible! Your ultimate Korean beauty rule: I think Korean beauty seems to be more focused on skincare than makeup! Yoon Young Bae @mulan_bae Product you cannot live without during Fashion Week: Kyusoku Bijin Cool Refresh Sheet Foot Patch.  I use it after a day of hard work. If I put this on my foot or my leg, it will feel so refreshing and improve that body part’s condition. Also, after any long-distance flight, that is the BEST thing! Good skin starts with: Oil Cleansing. I always use an oil cleanser, because it both cleanses and makes your skin softer.  I think proper cleansing is the most important thing for good skin. Your ultimate Korean beauty rule: Korean facial masks are the most popular and famous items in K-beauty. Use them well, and your skin will be as healthy as it can be! Sarah Lee, the co-founder of the Glow Recipe, is a devotee of sheet masks for dewy, hydrated skin. Coco Park, the skincare enthusiast behind the blog The Beauty Wolf, always shares her latest skincare finds. Based in Seoul, beauty blogger Sarah Oh is full of tips about makeup and skincare. Soko Glam co-founder Charlotte Cho loves sharing her finds from Seoul. Snow White and The Asian Pear offers guidance on customizing your personal K-Beauty routines with detailed guides. Keep up with the esthetician turned beauty CEO Alicia Yoon’s best beauty tips. Christine Chang, co-founder of Glow Recipe, is all about masking on the go. Beauty blogger Jude Chao uses her blog, Fifty Shades of Snail, to give you the k-beauty skincare basics. Soko Beauty’s Elisa posts video tutorials and products reviews will help you narrow your skincare must haves. ",
    "datetime": null,
    "url": "https://www.wmagazine.com/story/korean-models-skincare"
}