{
    "title": "6 Beauty Tutorials For Korean Drama Fans Who're Also Obsessed With Makeup",
    "text": "Fashion  I've been having the time of my life recreating various Korean drama makeup looks in tutorial form over the past couple months; I especially had fun with Yoo Se Mi's bright orange lips from My Love From Another Star, and IU's cherubic summer glow from Producers. That said, I can't quite hold a candle to some of the more talented video bloggers out there — if you've seen Michelle Phan sculpt herself into Angelina Jolie, you're well enough aware of the sheer makeup wizardry some of YouTube's best are capable of. The many vloggers of YouTube are a great resource, especially when it comes to harder-to-find international looks that you aren't going to find in your standard U.S. fashion magazine, so it's a great place to start if you're interested in Korean makeup and beauty. I did a little poking around on the web, and found some great vloggers. All of their makeup games are Beyonce-level ***flawless, and their tips are devastatingly on point. With that in mind, I created a little list of some of the best Korean drama-inspired makeup tutorials out there — so whether you're interested in trying out Park Shin Hye's laid-back style from Pinocchio, or Cheon Song Yi's day-glo lips from  My Love From Another Star , just keep on reading! Jung Saem Mool has long been one of my favorite tutorialists, and her videos tend to feature simple, yet intricate and delicate looks. Here, she breaks down the generic K-star look: Simple eyeliner, bold brows, and bright pink lipstick. Have you ever watched a tutorial by bubzbeauty? If you haven't yet, you're in for a treat — plus, she breaks down Song Yi's signature look perfectly. Dams Beauty School is another great resource, if you're into Korean beauty. The only catch is, her videos don't have subtitles, but, since makeup is a fairly visual medium, you should be able to make do without! OK, so this isn't technically a K-drama-inspired look — it's actually from one of IU's music videos. That said, it's a pretty close match for the makeup she rocks as pop star Cindy on Producers, and Dayeong's Beauty Drawing has some of the most adorable tutorials around. I'm a huge fan of Shin Hye's pared-down look from Pinocchio, and beauty blogger somevely recreates it to a T. Pony's Beauty Diary is another must when it comes to South Korean makeup gurus — and this tutorial's a double-win, since it features both a casual look and a fancy look! I don't know about you, but I'm definitely stocking up on bright pink lippies this summer. Images: My Love From Another Star/DramaFever Choose an edition: ",
    "datetime": null,
    "url": "https://www.bustle.com/articles/99743-6-beauty-tutorials-for-korean-drama-fans-whore-also-obsessed-with-makeup"
}