{
    "title": "6 K-beauty pros reveal their favourite tricks to getting gorgeous summer skin | Vogue India",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, visit My Profile, then View saved stories By Tish Weinstock Whether you’re about to jet off to a green-list tropical island or settle into a staycation, it’s time to start planning your summer skincare routine. From dehydrating heat and pore-blocking humidity to those extra strong and damaging UV rays, sunny climes can have myriad effects on our skin. So, what can we do to protect it? To find out more, we asked some of the industry’s leading K-beauty and skincare experts for their tried-and-tested tips. 1. Sarah Oh, founder of skincare and K-beauty blog, Oh My Gloss “Heat and humidity make our pores produce more sweat and oil, so skin can feel grimier and dirtier than usual [in the summer]. However, it's important to keep our skincare routine gentle, even when washing our skin. People tend to overwash and use harsher face cleansers around this time — these strip the skin, causing dryness and sometimes cause the skin to produce more oil. “Using a low-pH cleanser is a gentle yet effective way to wash away daily impurities while keeping the skin healthy. In K-beauty, cleansing is the most important step, so doing this properly will set your summer routine for success in motion. Technique tip: working on sections of the face for up to a minute, make small rolling motions with your fingertips. “My husband and I love using the 107 Chaga Jelly Low pH Cleanser. It washes off clean, doesn’t leave behind a film, and the crushed green tea leaf powder and the aged vinegar in the formulation give your skin a mild exfoliation.” 2. Elisa Lee, founder of K-beauty product website, Dot Dot Skin “Sunscreen is a must, every single day, even if you stay indoors or you go out for a few minutes. I like Cosrx Aloe Soothing Sun Cream as it doesn’t leave a ‘white cast, it’s not sticky and it looks great under makeup. Reapplying sunscreen throughout the day is also needed. I recommend putting it on your neck and hands too, and using a lip balm with SPF—these are the areas that people forget, but they’re so important. Also, wear caps or hats to protect your face from the sun. “During the summer, I love using cooling products—I suggest storing sheet masks and eye patches in the fridge for an extra cooling effect. I love using skincare tools and I put those in the fridge as well, such as Fraîcheur Paris Ice Globes. My favourite tool is the icing roller that I massage over my sheet mask. By Hasina Jeelani By Prabal Sharma By Kejhal Kalra “I also recommend applying lightweight products that are hydrating—try the Keep Cool Soothe Bamboo Toner and the Keep Cool Soothe Bamboo Lotion. Or, you can use face mist/face toners, which keep everything light and refreshing, such as the Pyunkang Yul Mist Toner or Cosrx Centella Water Alcohol-Free Toner. I also love the Benton Aloe Propolis Soothing Gel—it’s cooling, soothing and calming. It works amazingly well on sunburn. If you have acne, I recommend the Dear Klairs Midnight Blue Calming Cream as it cools the skin down while treating breakouts.” 3. Coco Park, founder of review blog The Beauty Wolf and co-author of Korean Beauty Secrets (Skyhorse, 2018) “My biggest skincare tip for summer is a three-part mantra, but honestly it's a bit of a no-brainer. Keep it cool, keep it simple and keep it calm! First of all, for me, everything that comes after cleansers lives in the fridge during summer. There's nothing more refreshing than a chilled sheet mask or a gel eye patch. When my skin is hot, it's also red and angry, so cooled-down products help soothe it. I'm obsessed with sprays, but since I have dry skin, I want my mists to be more than just water. The Farm Stay It’s Real Collagen Gel Mist is like a moisturiser in a spray, and I love it. “Warmer months aren't the time to use chemical exfoliants. A good philosophy is that summer is for maintenance, winter is for treatments. Sunscreen is always key, but it's of utmost importance when we're spending more time outdoors.” 4. Katherine Spowart, founder of K-beauty blog Skinfull of Seoul “My skin gets a lot of heat, and that’s one of the areas that the aestheticians at Shangpree Spa in Seoul helped me understand how to treat. Ms Joo-Eun Kim, the spa director, explained that when my skin is hot, I should only use my hands to apply skincare as cotton pads and other tools can cause further heat friction. She also made me aware that red, dry skin makes moisture leave much more quickly, so it’s important to rehydrate with toners and cooling sheet masks.” 5. Sarah Lee, co-CEO and co-founder of beauty brand Glow Recipe By Hasina Jeelani By Prabal Sharma By Kejhal Kalra “Growing up in Korea, we would always observe our mothers and grandmothers perform their beauty rituals. It was a common practice for them to rub cold watermelon rinds on our backs in the hot summer months. It would instantly soothe and heal our heat rash, so this superfruit became the inspiration behind our first product—the Watermelon Glow Sleeping Mask—and has since become a Glow Recipe signature to achieving natural, glowy skin. Watermelon is rich in water content, vitamins, amino acids and anti-inflammatory minerals, which is why it works as a skin hydrator and soother. “This mask is a great calming treatment after a day out in the sun — you can use it as the last step of your bedtime routine as an overnight mask, or as a 10-minute wash-off treatment for instantly soothed and plump skin. As well as watermelon, it has hyaluronic acid and AHAs to gently exfoliate and hydrate the skin, which makes it ideal for all skin types. I love putting it in the fridge at least 30 minutes before application for an extra cooling experience. Our early beauty memories have driven the innovations that we bring to Glow Recipe and they remind us of the efficacy of natural ingredients. “Another tip to beat summer skin buildup is treating yourself to a clay-infused facial treatment. Traditionally, clay masks can be too harsh for all skin types, especially sensitive or dry complexions—which is why we recently launched the Watermelon Glow Hyaluronic Clay Pore-Tight Facial. Our hyaluronic-acid-infused whipped clay frees skin of cell buildup and draws out impurities, while chemical exfoliants, watermelon enzymes, BHA and PHA help clear congested pores. Combined with gentle, exfoliating blueberry-seed powder, this five-minute facial encourages softer, brighter, and clearer-looking skin.” 6. Christine Chang, co-CEO and co-founder of beauty brand Glow Recipe “Watermelon is a soothing and calming ingredient that blends beautifully with a range of active elements. We love formulating products that intend to hydrate, smooth and balance the skin with watermelon extract, leveraging its calming and soothing properties. “Three must-have products for healthy skin throughout the summer are the Watermelon Glow PHA + BHA Pore-Tight Toner, Watermelon Glow Niacinamide Dew Drops, and Watermelon Glow Pink Juice Moisturizer.” Why slugging is the new K-beauty trend everyone is talking about 7 common mistakes to avoid in your K-beauty routine 7 top Korean beauty skincare trends of 2020 for glowing skin like never before By Twiggy Jalloh By Hasina Jeelani By Neeti Mehra By Tatiana Dias See more stories Condé Nast India © 2023 Condé Nast. All rights reserved. Use of this website constitutes acceptance of our Terms of Service and Policy and Cookie Statement. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. ",
    "datetime": "2021-07-15T05:38:23.670Z",
    "url": "https://www.vogue.in/beauty/content/korean-beauty-professionals-tips-tricks-gorgeous-summer-skin"
}