{
    "title": "6 Korean Skincare Tips & Trends Guaranteed To Give You Glowing Skin | British Vogue",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, select My Account, then View saved stories To revisit this article, visit My Profile, then View saved stories To revisit this article, select My Account, then View saved stories We may earn a commission if you buy something from any affiliate links on our site. By Hannah Coates The wonderful world of Korean beauty (or K-beauty as it’s known by beauty aficionados) has inspired countless beauty products in the UK and is responsible for improving how many of us approach our skincare routines. While once upon a time we simply cleansed, toned and moisturised, now we have serums, essences and a duo of cleansers to ensure our skin is spick and span – and that’s thanks to K-beauty. So what are the latest trends, tips and ingredients from our Korean counterparts that we can deploy for better skin? British Vogue spoke to Alicia Yoon, the founder of online K-beauty emporium Peach & Lily, to find out. You may already have heard about glass skin, one of the biggest skincare trends from the past year. The term describes skin that is glossy, glassy, luminous and translucent, explains Yoon, who launched the first-to-market Glass Skin Serum on Peach & Lily. In Korea, glass skin is more about a general attitude to skin: “It’s an awareness that the skin is your largest organ and that you need to care for it from within. Through that you achieve skin that’s so healthy that ultimately it looks like glass skin,” she says. Achieving a glass-skin effect, therefore, is all about working on the health of skin with a clever line-up of products. Peach & Lily offer a Glass Skin Discovery Kit, which comprises a hydrating (sulphate-free) cleanser, essence, serum (with peptides, niacinamide and hyaluronic acid) and a lightweight, antioxidant-rich moisturiser – the building blocks of a healthy skincare routine. You can also try COSRX Low PH Good Morning Gel Cleanser, La Mer The Treatment Lotion, Allies of Skin Peptides & Antioxidants Firming Daily Treatment and Murad Nutrient-Charged Water Gel. “In Korea, people go to a dermatologist or aesthetician for facials once or twice a week – it’s like going to the gym – and now they want that facial experience from home for the days they aren’t in there,” says Yoon. For that, they rely on “home care”, which is created for them by their dermatologist and offers in-clinic results from home: cue post-facial skin literally every day of the week. Referencing the Miwaji Hyalu Serum Veil (contains everything from copper tripeptide to brightening arbutin) as a go-to home care product, Yoon says that super-products like these offer results akin to the facials themselves: “This product in particular imparts a thin, glue-like veil over skin that feels super comfortable. It’s the result of a dermatologist trying to recreate a hydrafacial for home use so it leaves skin plumped with hydration. I love it,” she says. By Hannah Jackson By Alice Cary By Hannah Coates A number of UK and US-based brands also offer skincare that mimics the effects of in-clinic treatments at home. Take Dr Dennis Gross’s Professional Grade IPL Dark Spot Concentrated Serum, which is designed to recreate the effects of IPL treatment on skin, fading dark spots and discolouration. Skincare tools that (effectively) imitate actual skincare treatments, like Sarah Chapman’s Pore Refiner, have also become popular. We’re more than au fait with keeping our immune system in check – thank you, vitamin C – but the Koreans are also concerned with their skin’s immunity: “Our skin plays an immune function role in keeping out bad bacteria,” says Yoon. “There’s an awareness in Korea about what you need to do to keep your skin immunity up and that’s keeping your skin barrier really strong.” Look to ingredients, such as fatty acids and ceramides, to help reinforce your skin barrier, keeping the good stuff in and the bad out. Sunday Riley’s ICE Ceramide Moisturising Cream is an excellent product to consider in your routine and deeply nourishes while keeping the skin barrier healthy and strong. By Hannah Coates Is your skin dry… on the inside? That’s one thing that our Korean counterparts make it their mission to avoid: “We know that when our skin is dehydrated, it’s not caused by our lipid levels on the skin’s surface, but rather the moisture levels inside that are lacking,” says Yoon. It doesn’t matter what your skin type is – oily, dry, or sensitive – but if it’s dry on the inside, it won’t function at its best. Yoon explains: “When you’re dehydrated your melanocytes stay more activated and thus brightening ingredients may not work as well to reduce dark spots; it can also trigger an inflammatory response during which the hormone CRH is released, triggering more sebum production and breakouts; and your fibroblasts that produce collagen and elastin may not work as well. Hydration is the foundational to skin health.” To ensure skin is hydrated from the inside out, incorporate plenty of humectants in your skincare regime as these absorb into skin and help bind moisture in. Yoon recommends her brand’s Wild Dew Treatment Essence, which contains niacinamide, a cocktail of antioxidants, firming adenosine and three different sizes of hyaluronic acid to bind moisture into skin and give you your most hydrated and dewy-looking skin yet. Alternatively, try Tonymoly Ferment Snail Essence. The Korean one-minute rule refers to your skincare regime and the way in which you apply your product. The idea is to take one minute to massage your oil-based cleanser into skin (we love Sisley Triple Oil Balm Make-up Remover & Cleanser), spending time on getting the surface grime and day’s make-up to dissolve, and then to remove it and spend the next minute applying a hydrating formula. “If you don’t apply the subsequent hydrating formula within that minute, your skin becomes bone dry and formulas don’t absorb as much. It’s a great tip,” says Yoon. Troxerutin, the new ingredient to know, might be difficult to pronounce but it has sure made its mark in Korean skincare regimes. A super-antioxidant that is lauded for its ability to soothe irritation, reduce inflammation and hydrate, you can find it in Troxederm’s Repair Essence Mist where it’s blended with cica and niacinamide for an ultra calming effect. Yoon says it has gone totally viral in Korea: “All the celebrities started talking about it and Korea’s George Clooney bought $15,000 worth of this product for his fans – that’s how much he loves it.” By Hannah Jackson By Alice Cary By Hannah Coates More from British Vogue: By Hannah Coates By Hannah Coates By Hannah Coates More from Vogue Condé Nast Britain © 2023 Condé Nast ",
    "datetime": "2020-07-19T06:30:00.000Z",
    "url": "https://www.vogue.co.uk/beauty/article/korean-skincare-tips-trends"
}