{
    "title": "6 tips for a healthier tanning experience",
    "text": " SUMMARY This is AI generated summarization, which may have errors. For context, always refer to the full article. MANILA, Philippines – Summer is the perfect season to get a tan for the fair-skinned or a golden glow for those already blessed with honey-hued skin tones. Still, too much sun also means that you are exposed to UVA and UVB rays that can damage your skin cells. This, later on, can result to your skin’s premature aging and even cancer. So before you hit the beach and start baking, here are a couple of tips to fight premature skin aging and get that beach babe-worthy signature skin color: 1. Know your acronyms Buying sunscreen can be quite a dilemma these days with all the different brands and SPF numbers available. Normally, we’d think the higher the SPF number, the better protected we are from the sun’s UVA (Ultraviolet-A) and UVB (Ultraviolet-B). However, that’s not really the case. Buying sunscreen is actually very personal. Knowing how long your skin can stay under the sun without getting sunburned is pretty crucial. The acronym SPF which you usually see on sunscreen bottles stands for “sun protection factor.” It is calculated by comparing the amount of time needed to burn sunscreen-protected skin versus unprotected skin. Let’s say you burn under the sun after 10 minutes of exposure. If you use sunscreen with SPF 2, you will have around 20 minutes of protection. So the formula is simply multiplying the amount of unprotected time you spend under the sun before burning to the SPF number on your sunscreen, then you’ll have the number of minutes of protection. That isn’t a hard and fast number, though, so use that as an estimate and err on the side of caution. It basically just tells you when to re-apply again, not the amount of protection you will get. 2. Always use sunscreen – no matter what Some girls who are out to get a tan tend to ditch the sunscreen and stick with tanning oil. This leaves your skin defenseless against harmful rays from the sun. Yes, you’ll get a tan faster, but your skin might also become damaged in the long run. Always lather some sunscreen and let it dry for a bit before putting on some tanning oil or other type of tanning accelerator. Sunscreen that comes in a bottle with a spray nozzle are easiest to apply and take a shorter period of time to dry. Rappler caught up with Reena Rodrigo, Trading Director of Watsons beauty and drug store during their Sun Up to Sun Down event and asked her about skin protection. She swears by wearing sunscreen at all times: “Everyday, even when you’re indoors, there are UVA and UVB rays you need to protect yourself from and they can penetrate your windows.” If you’re out for a swim, it’s always best to re-apply sunscreen everytime you get out of the water – even if it says “waterproof,” moving around and being touched by your friends tend to wipe off some of the product you applied. 3. Cleanliness is one way to great skin Before lathering up your skin with protection and tanning aids, it’s best that you are clean. “We are more prone to attracting more dirt in a moist environment. What’s important is that you remove all the dirt and pollution that stick to your skin everyday,” Rodrigo says. Exfoliating your skin using a body scrub at least once a week will also help you get rid of dead skin cells. 4. Precision is key to proper baking Timing is key. If you’re tanning your front for ten minutes make sure you give your back side the same, equal amount of time exposed to the sun. You wouldn’t want an uneven tan, won’t you? Applying equal amounts of tanning accelerators also make for a good, even tan. 5. Moisturize Yes, we know you’re already sweaty because of the unforgiving temperature but it would be foolish to ditch your moisturizers as they are your best anti-aging tool. Before tanning, you should make sure that your skin is healthy and well protected, because even if you use sunscreen, tanning can cause a certain amount of stress and damage on your skin. After you get your tan, it’s best to help your skin recover. Apply some cooling lotion and moisturizer. There are products available in the market that have aloe vera, which can help damaged skin heal faster. Dry, sun-damaged skin can lead to wrinkles even in your 20s. “There’s body oil, and spray moisturizers, but for the summer, it’s recommended to just use light moisturizers because they are less sticky,” Rodriguez adds. Some light moisturizers are also tinted – you can use them as a lighter alternative to foundation. (READ: The beauty alphabet: BB, CC, DD, and EE creams) It’s also best to drink more than 10 glasses of water per day during the summer as you get dehydrated easily by sweating a lot. 6. Take time for your hair We often forget about our tresses. During the summer, it’s not only our skin that gets damaged – our hair tends to dry out and become very brittle due to prolonged exposure to the sun’s rays as well. Never take your hair for granted as damaged hair tends to make us look older as opposed to bouncy and shiny tresses. But you don’t need to be in a salon every week to make sure you have healthy and gorgeous hair through the season. “You don’t need to go to a salon anymore for hair treatment. You can get hair treatments in drugstores and beauty stores these days. However, it’s best to have clean hair so always shampoo and use conditioner everyday to moisturize,” Rodriguez says. It’s best to use a deep conditioning treatment at least once a week or natural oils which you can apply at night, leave on for an hour, and wash off. (READ: Beauty oils 101: Argan, tea tree, marula, jojoba, and more) Remember, a fresh-from-the-beach look is always lovely but do not sacrifice your skin’s health for it. Always make sure you’re protected and that you do everything to prevent premature aging before hitting the beach. Got more tips to add to the list? Let us know in the comments section below. – Rappler.com Image of woman from Shutterstock Error. Please abide by Rappler's commenting guidelines. There are no comments yet. Add your comment to start the conversation. JOIN OUR NEWSLETTER Fearless reporting delivered to you follow us    ",
    "datetime": "2014-04-20T04:00:00+00:00",
    "url": "https://www.rappler.com/life-and-style/health-and-wellness/55764-tips-healthier-tanning-experience/"
}