{
    "title": "7 Asian Skin Care Stores To Shop IRL From New York To Chicago",
    "text": "(Skin) It’s truly a dreamland. Asian skin care has officially taken the world by storm. Just consider the fact that the hashtag #Kbeauty has over 2 billion views on TikTok. Many buzzy skin care trends that pick up traction on the internet have origins in rich Asian medicinal traditions (think: dunking your face in ice water). While beauty retailers like Sephora, Ulta, and more specifically Soko Glam provide an online and IRL shopping introduction to Asian beauty brands, there is so much more to be discovered. Spread throughout the U.S. are brick and mortar hidden gem stores containing some of the best Asian brands from buzzy names like Laneige, Beauty of Joseon, Sulwhasoo, to more lowkey finds like Banila Co. and IOPE. These brands, have cultural ties that focus on ancient traditions and incorporate holistic beauty practices including the use of herbal ingredients within their products. Beauty of Joseon for example, uses ingredients (like mung beans, plums, and ginseng) that date back to the Joseon Dynasty, hence the name. The world of Asian skin care is vast and interesting to say the least so it can be hard to find some of these brands without resorting to online shopping, but TZR searched for local stores in some of the biggest cities that have all of the brands you should know if you’re looking to get into Asian skin care. Ahead, seven brick and mortar shops from NYC to San Francisco to get your Asian skin care fix. Where It’s Located: Various locations across the U.S. Aritaum may be the most widespread brick-and-mortar store in the U.S. that is all about Korean beauty and skin care. With over 50 locations from Honolulu and Los Angeles to Houston and New York City, Aritaum aims to serve the best K Beauty products. They carry over a dozen brands ranging from cult-favorite Laneige to IOPE, a bio science-led brand. Where It’s Located: Locations in NYC, Flushing, NY, and Falls Church, VA Founded in 2016, the name Besfren Beauty stems from the Korean fairytale, Moon Rabbit, hence their logo with two rabbits. With two locations in Queens, NY, one in Manhattan, and one in Virginia, the beauty store has certainly been making its mark within the industry. Besfren aims to be a “best friend” and provide the best service with over 60 Korean beauty brands like Dr. Jart+ and Hera. Where It’s Located: ​​81 Mott Street Frnt 2 New York, NY 10013 Translating to “oh oh thirty five millimeter,” oo35mm’s goal in 2009 was to bring its customers a new experience. The store strives to provide a platform for hard-to-find brands while also introducing customers to indie brands. Some of the best-sellers are COSRX’s calming pads and pimple patches, as well as Beauty of Joseon’s Dynasty Cream and cleansing balm. Where It’s Located: New York locations in NYC, Queens, and Brooklyn as well as New Jersey locations in Ridgefield, Palisades Park, and Edison. The Face Shop has been around globally since 2003 but came to New York in 2005 and now has five locations in the New York and New Jersey areas. The store prides itself on cultivating natural products that lead the industry and holds a number of under-the-radar products that will surely elevate your skin care regimen, like the various toners from Yehwadam and a collection of fun-to—use yet effective sheet masks. Where It’s Located: 1872 N Damen Ave Chicago, IL 60647 Dear72 was founded by Johnny Shin in 2014 as he sought to make Korean skin care more accessible in the United States. Offering hair care along with beauty and skin, Dear72 aims to cultivate a community while educating on Korean culture. The store carries famous K Beauty brands like Laneige and lesser known (in the U.S.) brands like TONYMOLY. Where It’s Located: 3127 N Broadway St. Chicago, IL 60657 Leah Kim founded Choc Choc to provide an in-person shopping experience of Korean cosmetics. Besides carrying popular brands from Korea, Choc Choc carries its own brand of skin care products, including the Rice Power Essence that contains rice bran water, which is great for brightening skin tone and improving texture. Where It’s Located: 3251 20th Ave. Suite 239, San Francisco, CA 94132; 1737 Post St. Suite 385, San Francisco, CA 94115 Candy Doll Boutique started off as a fashion boutique but plunged into skin care after seeing its market growth. The store originated in Korea and Japan, and has become one of the most popular Asian beauty stores within the Bay area of California. Here, you can find the Kose brand (a Japanese multinational personal care company) with products like the Sekkisei Treatment BB Cream. ",
    "datetime": null,
    "url": "https://www.thezoereport.com/beauty/asian-skin-care-stores-to-shop-across-the-us"
}