{
    "title": "7 Best Korean Beauty Products & Trends Of 2015 Because This Was The Year Of K-Beauty — PHOTOS",
    "text": "Fashion Few beauty trends have dominated 2015 quite like the meteoric rise of Korean beauty. In fact, at this point I think it's fair to call it: 2015 was the year of Korean beauty. It seemed like there was a new Korean beauty product or trend popping up on the Internet every week. From sheet masks to cleansing oils, it's never been easier for Western consumers to get their hands on once rare, niche products as the number of online retailers specializing in Korean beauty products has increased. The good news for those who have hopped on the K-beauty bandwagon in 2015 is that this trend doesn't look like it's going to die out in 2016, especially as big retailers like Sephora and Urban Outfitters have gotten into the game, regularly stocking brands like TONYMOLY and Too Cool For School on their shelves. Just to solidify K-beauty's dominance, Macy's also launched its first Korean beauty shop in one of its stores in November, in collaboration with online retailer Peach & Lily. As beauty aficionados get excited for what new, innovative products are going to hit American shores in 2016, let's take a moment to celebrate the year that was and look back at seven of the most memorable Korean beauty products and trends of 2015. Banila Co. Clean It Zero Purity, $20, Amazon It was easy to make fun of the 10-step Korean skincare routine when I first heard about it, but once I tried double-cleansing for the first time, I was immediately converted and discovered the amazing, transformative power of a good cleansing oil. They make even the heaviest makeup melt away without any effort and leave my face feeling cleaner than I thought possible. If you're still somehow not totally convinced about K-beauty, cleansing oils and balms will definitely make you change your tune. TONYMOLY Peach Anti Aging Hand Cream, $6, Amazon One of the hallmarks of Korean beauty products is cute and creative branding, and TONYMOLY totally slayed the game with its collection of fruit-scented moisturizers packaged in precious plastic fruit containers. You can find moisturizers that look like bananas and lip balms in the shape of macarons. This is K-beauty at its cutest, and I'm into it. Iope Air Cushion Sunblock XP, $38, Amazon Cushion compacts, also known as BB cushions, are most Korean beauty vloggers' secret for flawlessly applied foundation. Perhaps the most famous of the bunch is the IOPE Air Cushion, which was featured in a gravity-defying commercial in July. These air cushions have become cult classics and are an example of the ways in which K-beauty companies can put an innovative twist on already great products, like BB cream. Panasonic Heated Eyelash Curling Wand, $20, Amazon One Korean beauty technique that circulated the Internet this year was heating up a Q-tip to curl your lashes. Though my own experience with a Korean heated eyelash curler was less than successful, I know many others who swear by the technique, so it still deserves a place on this look back at 2015's K-beauty. Whamisa Organic Flowers Olive Leaf Mist , $39, Amazon The founders of natural Korean beauty site Glow Recipe, Christine Chang and Sarah Lee, told Refinery29 in April that the next big trend is water-free skincare routines and products. Using these nutrient-rich ampoules, essences, and mists that aren't watered down helps to keep your skin more moisturized without stripping away its natural oils. The one product that really put K-beauty on the map was the humble sheet mask, which seemed to show up everywhere, from the pages of fashion magazines to Instagram, with celebrities from Lady Gaga to Chris Pratt posting their own #sheetmaskselfies. Really, the only K-beauty product that might have upstaged sheet masks this year was patterned sheet masks, which transform you into an animal or a skull, and make for an even more memorable selfie. Sheet masks are relatively cheap, easy to use, often gentle enough for everyday use, and definitely take the title for most valuable K-beauty product this year. Dermal Korea Collagen Sheet Mask, $8, Amazon Lindsay Modeling Rubber Mask in Cool , $14, Amazon Rubber masks, also known as modeling masks, do make you look a little bit crazy, but they feel absolutely amazing and leave you feeling refreshed and tightened. At only $6 each, they are also a fairly affordable K-beauty indulgence. Cheers to a great year of Korean beauty, and here's hoping that 2016 is filled with just as many fun, innovative, and memorable goodies. Want more beauty tips? Check out the video below, and be sure to subscribe to Bustle’s YouTube page for more hacks and tricks! See related: 9 Effective & Affordable Skin Care & Beauty Products That Actually Work Images: tonymolyus/Instagram; Courtesy Brands; Maxine Builder; maxine_builder/Instagram Choose an edition: ",
    "datetime": null,
    "url": "https://www.bustle.com/articles/127383-7-best-korean-beauty-products-trends-of-2015-because-this-was-the-year-of-k-beauty"
}