{
    "title": "7 common mistakes to avoid in your K-beauty routine | Vogue India",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, visit My Profile, then View saved stories By Hasina Jeelani From luminous glass skin to scalpcare, K-beauty is the gift that keeps on giving. Among other exports from Seoul’s finest, 10-step skincare routines have become an ubiquitous presence in our collective skincare lexicon. Touching upon the long-revered pillars of skincare, from cleansing and moisturisation, with a handful of Korean staples included—think essences and ampoules—a multi-step skincare routine has now become the key to the glowing, poreless skin of our dreams. However, with multiple steps come multiple responsibilities, and here are the common minefields that the experts believe you’ll want to avoid. Korean beauty follows a skin-first philosophy which places skin health, treatment and prevention above concealing skin concerns like acne, fine lines and redness. The 10-step Korean beauty routine evolved as a natural response to this concept—each step carefully designed with skin health in mind, believes Charlotte Cho, co-founder of Soko Glam and founder of Then I Met You. “Within the last year, we’ve seen the 10-step skincare routine increase in popularity again, as self-care continues to be top of mind for many. What better way to get away from everything and carve some time out for yourself than to provide your skin with a mini-spa experience?” she observes. Cho believes that it’s normal to be excited about curating multi-step skincare routines, but educating yourself about the steps you’re about to undertake is crucial before starting to apply them. “After all, it’s not the number of steps you have in your routine, but the skin goals you have set for yourself. So start by listening to your skin and determine your lifestyle preferences—do I have the time and budget to have four steps or the steps?—before starting a routine,” she advises. Keeping your skincare kit updated with the newest launches might seem essential, but the experts advise against changing your skincare products too often. “This will prolong how long it will take you to see tangible benefits from the products as certain active ingredients can take anywhere from two weeks to six months to see results,” says Cho. The notion is seconded by Dr Claudia Christin, medical advisor of Korean skincare app, Picky. “It is essential to allow some time for the products to work on our skin, especially for specific concerns such as acne, hyperpigmentation, and ageing. These issues take time to develop and, as a result, also need that extra time to be treated. Enjoy the process of taking care of your skin and be patient with it,” she says. When introducing new ingredients to your routine, it is prudent to allow your skin some time to adjust and listen to what it’s telling you. “When applying actives, such as high concentrations of glycolic and lactic acid, it might seem tempting to apply the formulas very frequently on your skin for overnight results,” observes Cho. However, if your skin appears irritated, flaky or red, this might be a sign from your skin that you’re allergic to something in the formula, she believes. With newer products, textures and formulas hitting the shelves every single day, organising your picks into the correct order can be a tricky task. “The general rule of thumb when applying skincare products is to apply them from the lightest consistency to the thickest consistency, otherwise it may cause a barrier that blocks the thinner or lightweight formulations from being absorbed into the skin,” she cautions. Dr Christin further adds, “Lighter textures are high in water content as they are meant to absorb and hydrate our skin at the beginning of the skincare routine. On the other hand, thicker textures are usually richer with oils and are meant to lock in the moisture on your skin. By not applying it in the right order, you might hinder the absorption of some potent active ingredient in your skincare products.” The key to a successful skincare routine is consistency and patience, believes Cho. “After all, good skin doesn’t happen overnight,” she says, and adds, “Not applying products regularly means you are slowing down your own skincare efforts. The skin needs consistency, as do powerful ingredients like Vitamin C, to work their magic.” As a rule of thumb, Dr Christin advises following through diligently on your chosen skincare routine for at least four weeks for the products to offer tangible results. With a veritable buffet of lotions, potions and miracle workers to be tried, wanting to try the latest It-products is only natural, but your skincare routine could also benefit from some restraint. “By using too many new products at one time, it might be hard to figure out which product is actually benefiting your skin, which ingredients you react well to and which products don’t jive with your skin type. It is always advisable to opt for a patch test before applying anything on your face. From there, add in products one by one so you can truly see how each works for you,” advises Cho. If the geographical extent of your skincare routine doesn’t extend beyond your face, both experts would like you to remedy that. “Our body needs some love too. It’s always advisable to indulge in an exfoliating scrub and apply moisturiser frequently to keep the skin barrier healthy and nourished, so our luminescence doesn’t stop at our faces. I’ve also found hand lotion to be extremely important during this last year of intense hand washing,” she says. After mastering technique and consistency, it is time to turn your attention to education. Dr Christin explains, “Although there are no hard rules on what is right and wrong in skincare, some ingredients are not meant to be layered together in the same routine since it may lead to irritation, especially for beginners in skincare.” The list of no-nos is headlined by AHA and BHA with retinoids, retinoids with Vitamin C and Vitamin C with AHA and BHA. Cho agrees, “Learning about which ingredients can and cannot be used together can save your skin barrier from irritation and damage. For instance, high percentages of acids and retinol shouldn’t be used together, as they can cause irritation. A good rule of thumb is to alternate between the two on different days, and don’t forget to use sunscreen daily.” Everything you should keep in mind when you’re trying a brand-new beauty label 12 exciting Korean beauty trends you have to try in 2021 Why slugging is the new K-beauty trend everyone is talking about By Hasina Jeelani By Prabal Sharma By Kejhal Kalra By Tish Weinstock By Avanti Dalal By Anjan Sachar By Nupur Sarvaiya See more stories Condé Nast India © 2023 Condé Nast. All rights reserved. Use of this website constitutes acceptance of our Terms of Service and Policy and Cookie Statement. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. ",
    "datetime": "2021-05-17T11:17:00.406Z",
    "url": "https://www.vogue.in/beauty/content/7-common-mistakes-to-avoid-in-your-k-beauty-routine"
}