{
    "title": "7 K-beauty Instagram accounts you have to follow now | Vogue India",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, visit My Profile, then View saved stories By Tish Weinstock Want to know your centella asiatica from your sacred lotus? Or how to get really glassy-looking skin? It’s time to brush up on your K-beauty knowledge. After all, the range of skincare products available on the market is constantly evolving (there’s much more to Korean cosmetics than just 10-step routines) and according to Allied Market Research, the industry will be worth an estimated £15bn by 2026. If you’re wondering where to start, follow these K-beauty Instagram accounts for science-backed tips, expert tricks and industry-insider trends. 1. Claudia Christin aka @FunSkincare This content can also be viewed on the site it originates from. Born and raised in Indonesia, Claudia Christin is a medically trained dermatologist and brand consultant. Christin’s interest in K-beauty started when she had a series of bad breakouts at school. “It was the only accessible skincare product for students back then,” she says. However, it wasn’t until she moved to South Korea in 2017 that she felt the need to share her encyclopaedic knowledge with the world, which she continues to do today via Instagram. Head there now for science-backed tips on skincare layering and how to treat hyperpigmentation and acne. 2. Michelle Wong aka @LabMuffinBeautyScience By Hasina Jeelani By Prabal Sharma By Kejhal Kalra This content can also be viewed on the site it originates from. Self-confessed skincare nerd Michelle Wong broadcasts her skin tips from Sydney, Australia. With a PhD in chemistry, Wong’s main focus is demystifying the science behind complex ingredients and product formulas in easy-to-understand ways. “I’ve been using Korean beauty products since my mum took me to a Laneige store in Hong Kong when I was in high school,” she says. “My aunt owned a beauty clinic and recommended their products. K-beauty has a lot of interesting innovations and it's fascinating to dig into how exactly they work.” Currently writing her second book about active ingredients in skincare — you can find her first, The Lab Muffin Guide to Basic Skincare, on her website — follow her now if you want to understand the ins and outs of K-beauty. 3. Renée Chow aka @Gothamista This content can also be viewed on the site it originates from. By Hasina Jeelani By Prabal Sharma By Kejhal Kalra As Renée Chow declares at the top of her page, she tries every product so you don’t have to. After a decade of working in product development for various skin and body care brands and as a beauty buyer, her insight into ingredient technology, formulation, pricing and packaging is invaluable. The New Yorker got into K-beauty eight years ago after a trip to Seoul and has been sharing her knowledge via her YouTube and Instagram accounts ever since. “K-beauty is very innovative and brands continue to create interesting new formulas with luxurious ingredients, integrity and cute packaging, making it very accessible,” she says. “They also bring what I like to call ‘skintertainment’ into our routines and make them feel less of a chore. Whether it’s unique textures, zombie face masks or rubber ones, I often find myself excited to take care of my skin.” Funny, honest and authentic, she knows how to create good content. 4. Jude Chao aka @FiddySnails This content can also be viewed on the site it originates from. “My take on K-beauty is inclusive and flexible,” says American-Taiwanese blogger Jude Chao. “I want my readers to find ways to feel beautiful and good in their skin, no matter their personal definition of beauty.” Chao started sharing her knowledge about K-beauty via her Fifty Shades of Snails blog, where she covers everything from skincare to mental health. Fast-forward to today, and she’s just as active on Instagram where she breaks down the latest trends. She also has a line of face masks and a book about skincare in the works. Follow her for a crash course in K-beauty. By Hasina Jeelani By Prabal Sharma By Kejhal Kalra 5. Coco Park aka @TheBeautyWolf This content can also be viewed on the site it originates from. Former makeup artist and aesthetician, Coco Park was one of the earliest English-language K-beauty bloggers out there. After discovering a bunch of K-beauty products in her mother-in-law’s bathroom, she set up her blog, The Beauty Wolf, to share her discovery with her friends. Instead of focusing on the scientific aspects of products and ingredients like most other bloggers, Park had a different aim: “I wanted to speak to my subscribers the way I would my friends because at the time, my only readers were my friends!” she says. “It was always my goal to be an authentic voice that was simply sharing the discoveries I tried and loved. I never wanted to do negative reviews so I just wouldn't talk about products that didn't wow me.” She co-authored Korean Beauty Secrets (Simon & Schuster, 2015) and today she continues her reviews on Instagram. 6. Elisa Lee aka @Sokobeauty This content can also be viewed on the site it originates from. By Hasina Jeelani By Prabal Sharma By Kejhal Kalra Elisa Lee is the mastermind behind the cruelty-free K-beauty webshop, Dot Dot Skin. But most people know her via her Instagram, which is where she shares her thoughts about the latest products and trends. She got into K-beauty in 2012 when she went to Korea to study and started blogging as a way to share her experiences with family and friends before moving to Instagram to keep up with its burgeoning K-beauty community. “The people who have been following me for a long time know my personality and know that I am honest in my reviews,” she says. “Plus that I don't mind showing my bare skin.” Follow her now for an unfiltered approach to all things skin. 7. Katherine Spowart aka @SkinfullOfSeoul This content can also be viewed on the site it originates from. Katherine Spowart is an expert in all things K-beauty, having immersed herself in the scene when she lived in Seoul from 2014 to 2018. What started as a blog has evolved into a career and a highly educational Instagram to boot. “I have always made space to learn about and respect the cultural concepts that influence Korean beauty,” she says. “I would say a key philosophy of K-beauty is being able to pick the products that suit you and truly caring for your skin on a daily basis.” Follow her for easy how-tos and digestible product reviews. 6 things Korean women know about anti-ageing skincare that we don’t 12 exciting Korean beauty trends you have to try in 2021 By Namrata Kedar By Sadaf Shaikh By Saachi Gupta By Hasina Jeelani See more stories Condé Nast India © 2023 Condé Nast. All rights reserved. Use of this website constitutes acceptance of our Terms of Service and Policy and Cookie Statement. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. ",
    "datetime": "2021-11-10T04:42:40.378Z",
    "url": "https://www.vogue.in/beauty/content/these-are-the-k-beauty-instagram-accounts-we-cant-get-enough-of"
}