{
    "title": "7 top Korean beauty skincare trends of 2020 for glowing skin like never before | Vogue India",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, visit My Profile, then View saved stories By Hasina Jeelani If there’s a new skincare trend brimming on the horizon, you can rest assured that K-beauty has already called first dibs on it. After all, the world of Korean beauty plays secret-keeper for the latest and the greatest in skincare, with innovations that range well beyond the fabled 10-step beauty routine which it is otherwise categorised by. If the sudden abundance of me-time during the lockdown has encouraged you to finally give skincare the attention it deserves, it pays to stay updated on what the world of Korean beauty has to say on the matter. Our pursuit of answers led us to the co-founders of Glow Recipe, and we quizzed them about the glow-enhancing trends that skintellectuals won’t want to sleep on. Here’s what we learned. Korean beauty has led the way for many innovations in skincare, and co-founder Christine Chang admits that she’s excited when her favourite trends start to go global. She says, “Korea is where we first saw the concept of hybrid toners that address multiple benefits in one treatment. This was a marked difference from typical toners that were primarily used to remove residue after cleansing. We will definitely be seeing more of these toners that combine hydration, a crucial cornerstone of K-beauty, with other skincare benefits to target multiple skin concerns.” The all-natural memo is slated to make further inroads into our skincare routines, and Chang recommends keeping an eye on natural enzymes. “We have already seen an increase in products that incorporate natural AHAs over chemical ones, and enzymes will be the next trendy ingredient for gently smoothing the skin over time by targeting only dead skin cells,” she explains. As our schedules get busier and our beauty routines shrink in response, skincare-infused makeup is Korean beauty’s gift to women on-the-go. Chang believes that newer exports from the streets of Seoul will be headlined by hybrid benefits that blur the line between skincare and makeup. “The one category that we see expanding further is products that deliver both, such as serum-primers and highlighters with skincare benefits.” Face slapping videos may make for fun viewing during lunchtime, but there’s a method to the madness. Co-founder Sarah Lee explains, “Patting goes back to the skincare philosophy of Korean women being as gentle as possible. Fast movements cause friction and over time it can cause micro-tears in your skin. Tugging and pulling at the skin can contribute to wrinkles, so we always advocate patting in skincare in all of our content. Patting helps drive the product deeper into the skin’s layers so that it is plumped with hydration from within.” As a fun bonus, you’ll also be able to minimise the downtime between steps to avoid waiting for products to dry. If smooth, plump skin is on your list of skincare goals, the K-beauty experts advise against reaching for a towel after cleansing your face. “Typically after cleansing, you find yourself reaching for a towel automatically, but this can cause rubbing and friction on your skin. It’s also impossibly hard to keep your towel clean in the bathroom, so instead of using a towel or constantly changing it out, just pat the moisture in after cleansing. It serves as an easy way to keep the plumped and slightly damp to adsorb the next steps of your skincare,” recommends Lee. With an extended lockdown on the cards, at-home skincare has witnessed a subsequent surge in popularity. “We love carving out time to do our skincare every day and finding ways to elevate your daily routine into a self-care moment. Since oils are so emollient, doing a gentle facial massage during the cleansing step, or even using a gua sha jade tool is a great way to combine at-home care with a critical step in your skincare routine,” says Chang. DIY facials have also been on the rise, and she recommends soaking cotton rounds with toner and placing them on the cheeks and forehead for up to 15 minutes for a glowing, hydrated finish. Moving beyond just low-maintenance desk accessories, succulents have been assuming their place under the skincare spotlight. “Succulents can serve as a helpful agent for retaining moisture, due to their resilient nature, and we harnessed cactus water in our Glow Recipe toner. Modern toners are seen as the first liquid treatment that really sets the tone for the rest of your routine to follow. It offers an innovative, ‘stretchy’ texture due to the cactus water base which helps retain moisture within the skin barrier,” says Lee. What makes K-beauty a global skincare phenomenon? 5 skincare rules for women who don't have time for an elaborate skincare routine How to transition your skincare routine for summer, according to K-beauty By Hasina Jeelani By Prabal Sharma By Kejhal Kalra By Hasina Jeelani By Hasina Jeelani By Faye Remedios By Hasina Jeelani See more stories Condé Nast India © 2023 Condé Nast. All rights reserved. Use of this website constitutes acceptance of our Terms of Service and Policy and Cookie Statement. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. ",
    "datetime": "2020-08-12T10:51:29.135Z",
    "url": "https://www.vogue.in/beauty/content/7-top-korean-beauty-skincare-trends-of-2020-for-glowing-skin-like-never-before"
}