{
    "title": "8 ancient skincare practices from India and around the world that are still relevant in 2020 | Vogue India",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, visit My Profile, then View saved stories By Anjan Sachar Whether you’re pro Ayurveda or you swear by K-Beauty formulas, it’s likely that your favourite skincare products or ingredients have a certain history associated with them based on where they come from. Every country has its own beauty traditions that can date back to centuries ago with tangible and therapeutic benefits that are relevant even today. We rounded up eight such ingredients and treatments that work just as effectively in your skincare routine even today. Used as part of pre-wedding ceremonies even today, ubtans are face and body cleansers known to lend a fresh glow to the skin. They’re formulated keeping your Ayurvedic dosha in mind to also balance your skin (add moisture or get rid of excess oil) when you use them. Ubtans are most often a blend of chickpea flour or a mildly granular powder to cleanse, sandalwood and turmeric to brighten, rose water or milk to tone and exfoliate, individual herbs based on your skin’s requirements, and even essential oils for their therapeutic benefits. Forest Essentials stocks customised ubtans for every skin type and concern, if you’d prefer buying a packaged one instead of making your own. Greek yoghurt isn’t just good enough to eat—it makes for an effective face mask too. Yoghurt contains natural lactic acid which works to clean out your pores while the olive oil hydrates for clean, fresh skin. Locals even use yoghurt on their skin as post-sun care to soothe burns. Honey is also often combined with either of these two ingredients (or even as a trio) for its anti-bacterial properties. Globally loved Greek beauty brand Korres has an entire line of products that harness the benefits of Greek yoghurt in the form of moisturisers, cleansers, serums and masks. The jade gua sha tools and rollers may be part of ancient Chinese traditions but rose quartz as a precious stone is known to have been first loved by Egyptian royalty. History says that Cleopatra showered with these crystals for their healing powers while Goddess Isis used them to massage her face for their anti-ageing and toning properties. Beauty labels like Miranda Kerr’s Kora Organics and Pixi Beauty use rose quartz as part of their skincare formulas to impart its soothing and healing properties to the blends. A purifier and antioxidant-rich ingredient, neem has been used in ancient Indian traditions and it stands to be a popular skincare ingredient even today. Popular pharmacy brand Himalaya Herbals’ Purifying Neem Face Wash is a crowd-pleaser today thank to its skin-clearing properties. Indian skincare brand Dr Sheth’s recently launched their Neem & BHA Spot Clarifying Serum, which combines the detoxifier with salicylic acid to take care of acne and oiliness. Consuming neem leaves as part of your diet is also known to help purify your blood, giving your skin a natural, glow and keeping it acne-free. This potent oil is sourced from the argan trees in Morocco and can be consumed or used topically. It’s rich in vitamins, minerals, antioxidants and fatty acids that make it beneficial to your internal health and hydrate your skin and hair. You’ve most likely used the oil or heard of its benefits for hair, thanks to the haircare brand Moroccanoil—the oil is rich in Vitamin E which makes it the ideal choice for a leave-in hair serum. In fact, it’s also known to calm skin, making it perfect for those suffering from rosacea or psoriasis. Seen bottles and tubs with iridescent formulas that say they’re pearl-infused? This precious ingredient has been used in China for thousands of years as a skin brightening agent and collagen booster. Pearl powder can be consumed orally or blended into skincare formulas and applied onto your skin. Delhi-based Dr Kiran Sethi has her own custom blend that boosts collagen and improves the quality of your hair, skin and nails. The Cureveda Glow Adaptogenic Beauty Protein combines pearl powder with Vitamin E, vegan protein and other antioxidants like sea buckthorn for a daily dose of skin-loving goodness. If you’d rather apply it, try the Shangpree Gold Black Pearl Eye Mask to give your under-eye area a health boost. If you grew up in India, there’s a good chance you’ve used this all-in-one beauty solution for a head or body massage. Coconut oil is intensely hydrating and can be used in multiple ways to moisturise your skin and hair. Use it as a hair treatment for frizz, as part of your double cleanse to remove your makeup at the end of the day or even for your cuticle health. Dry elbows or chapped lips? It works wonderfully for those as well. Ensure you use a cold-pressed version like the one by Good Earth’s Amritam for the most nutrient-rich formula. Iceland is home to a plethora of hot springs with mineral-rich waters that are known to be beneficial for those dealing with skincare concerns like psoriasis, and eczema. Indulging in the geothermal spas in Iceland relaxes your body on the whole and soothes your skin, along with providing temporary pain relief thanks to the minerals. Brands like Medicine Springs Mineral Therapy even create at-home packs of minerals extracted from the water of the hot springs so you can get the same healing benefits in your own tub at home—no visa necessary. 8 skincare products every woman should use before she turns 30 Is it best to trust Ayurveda and go natural when it comes to beauty? Reiki for glowing skin? Ancient healing rituals are now finding place in modern skincare By Hasina Jeelani By Prabal Sharma By Kejhal Kalra By Isha Sutaria By Andrea Pinto By Hasina Jeelani By Rush Mukherjee See more stories Condé Nast India © 2023 Condé Nast. All rights reserved. Use of this website constitutes acceptance of our Terms of Service and Policy and Cookie Statement. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. ",
    "datetime": "2020-09-07T09:43:03.330Z",
    "url": "https://www.vogue.in/beauty/content/8-ancient-skincare-practices-from-india-and-around-the-world-that-are-still-relevant-in-2020"
}