{
    "title": "8 beauty advent calendars to count down to the festive season",
    "text": "Shop these advent calendars to prep and prime your way to a gorgeous festive season.  Claiming to be the superlative advent calendar for all beauty junkies, Net-a-Porter’s super-luxe cal offers the best in makeup, hair and skincare. There’s spa-worthy goodies from Dr. Barbara Sturm, Costa Brazil, Joanna Varga, 111Skin and Susanne Kaufman; makeup essentials from Charlotte Tilbury and Eyeko; and even hair perfecting goodness from Oribe. Mask, soothe, unwind and relax your way to your gorgeous self in the run-up to party season with this 25-day countdown. HK$2,300 from Net-a-Porter  Enlisting the help of artist Vincent Darré, Maison Christian Dior has launched a truly show-stopping advent calendar inspired by 30 Avenue Montaigne, the birthplace of the brand. The intricate design tells the magic of Dior, unfolding like a dollhouse for each advent date. Countdown with some of the bestselling scents manifested across body balms, candles, bath products, and of course, perfume making up 24 surprises for a warm and cosy Dior Christmas. HK$3,500 from Dior  Twenty-four days worth of Dr. Barbara Sturm goodies are sure to totally refresh and revive your skin ahead of the holiday season. This indulgent advent calendar includes travel-friendly sizes of practically the entire range by the German skincare expert, from its gentle cleanser to a range of toners, serums, face creams, as well as the cult favourite anti-pollution drops, face mask and hyaluronic ampoule. There’s also full size versions of the lip balm and glow drops. HK$4,300 from Lane Crawford  To some, a bubble bath just ain’t a bubble bath without the help of Lush’s colourful tub time paraphernalia. Its beloved 12 Days of Christmas advent calendar box set returns this year with a mixture of bath and must-haves. From the glowy Yog Nog shower gel to the Snow Fairy body conditioner to a clove and cinnamon bath oil tablet to sparkly, whimsical bath bombs — this kit is an eco-conscious and fun addition to any home spa. HK$1,200 from Lush  Deck out your home with this incredible 3D tree-shaped advent calendar from Rituals, packed with 24 goodies from the Amsterdam beauty brand’s core ranges. With home diffusers, lotions, serums, bath and body products, you can indulge in evenings of relaxation as you countdown the four weeks before Christmas. You’re encouraged to light one of four exclusive Advent candles every Sunday, infusing your home with fine exclusive fragrances such as Oriental Vetiver, Sacred Saffron, Savage Garden and Precious Amber. HK$885 from Rituals  Dressed in red and gold, Giorgio Armani’s indulgent beauty advent calendar houses 24 surprise goodies for you to count down to Christmas. Available exclusively at Lane Crawford stores and online, the gifts include some of GA’s most iconic lip products, perfumes and skincare — with the campaign teasing the Sí Passione eau de parfum, Eyes to Kill Mascara, Lip Maestro and Aqua di Gioia eau de parfum. There’s reportedly two full-sized cosmetics and five pocket-sized accessories. HK$2,500 from Lane Crawford  The historic British perfume house launches its very first advent calendar this year, a must-have for any fragrance junkie. Decked out across 24 boxes stacked high like whimsical delivery boxes straight from Santa’s office are a comprehensive mini collection of Penhaligon’s core scents: There’s classics such as Blenheim Bouquet, Endymion, Luna and Juniper Sling, as well as travel rollerball tubes of its popular Portraits series. Lip balms, body lotions, and an exclusive scented candle top off the calendar for one lusciously scented month. HK$3,950 from Penhaligon’s  Count down to Christmas with Swiss anti-ageing expert Valmont and treat yourself to the gem-packed A Magic Christmas by Valmont calendar. It includes 12 days of potent skin treats including the signature Prime Renewing Pack and the l”Elixir Des Glaciers eyecare line, plus a lightweight travel bag protector designed by Hong Kong artist Bertha Sun. It’s a water resistant shield against the elements for your purse, and also doubles as a handy shopping bag. The exclusive travel pouch collection for the holiday season showcases a double helix design, reflecting the way Valmont targets the signs of ageing at the DNA and RNA level. HK$2,280 from Valmont Managing Editor When not trying out the latest beauty and wellness trends, Evelyn is likely enjoying a perfectly balanced negroni or exploring some of Hong Kong's best new places to eat and drink. At Lifestyle Asia she covers everything from the biggest events in town to interviews with Hong Kong specialists, with topics spanning art, food and drink, health, tech, and travel. Yes, I agree to the Privacy Policy For your daily updates on all things luxury, follow us at @lifestyleasiahk Yes, I agree to the Privacy Policy Subscribe to our newsletter to get the latest updates.  Thank you for your subscription. ",
    "datetime": "2019-11-19T10:00:11+00:00",
    "url": "https://www.lifestyleasia.com/hk/beauty-grooming/skin/8-beauty-advent-calendars-to-count-down-to-the-festive-season/"
}