{
    "title": "8 K-beauty products that will brighten and balance an uneven skin tone | Vogue India",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, visit My Profile, then View saved stories By Anjan Sachar The K-beauty industry is a whole other world in itself, with innovative formulas and even application techniques (we’re looking at you, sheet masks) that emerged there and took the world by storm. There’s something for every skin concern and of course, no matter the reason for your uneven skin tone, there’s a product made to help look after it. Whether you’ve got inflamed dark spots that have stuck around post-acne or pigmented patches due to sun exposure and dehydration, this selection of K-beauty formulas will help you achieve glowing, even skin. Read on for eight Korean skincare products made to tackle an uneven skin tone. If you’re dealing with enlarged pores, dark spots left behind by acne, inflammation and pigmentation, this serum will be your holy grail. It is infused with the Vitamin C-rich hallabong fruit from Jeju Island along with Vitamins B3, B5 and hyaluronic acid, all of which come together to work on brightening your skin on the whole, leaving it with an improved texture and more even tone. By Hasina Jeelani By Prabal Sharma By Kejhal Kalra It is of prime importance to start off your skincare routine with the right cleanser, tailored to your skin’s needs, every AM and PM. Designed for dull and dehydrated skin, this Vitamin C- and camellia leaf extract-based cleanser works double duty by clearing your skin of all dirt and impurities while also lending a hand to brighten and hydrate. Use it in tandem with your targeted serums and treatments for the radiant results you’re after. It’s almost a sin to talk about K-beauty without incorporating a sheet mask in the mix. This biodegradable sheet mask is soaked in a potent Vitamin C serum along with niacinamide and adenosine that’s made to work on dark spots and pigmentation—you’ll notice instant results with one use, and lasting ones when you incorporate it into your weekly routine. By Hasina Jeelani By Prabal Sharma By Kejhal Kalra This quick-absorbing sleeping mask comes with the dual benefits of brightening and hydrating your skin. The blend of exfoliating AHAs, soothing watermelon extract and hydrating hero hyaluronic acid works on your skin while you sleep, promoting cell renewal and a healthy, glowing skin tone. Consider this an intensive seven-day treatment to target the pigmentation on your skin that’s making it appear dull and lacking lustre. The formula contains multiple brightening active ingredients such as orange, lemon and camu camu extracts that combine with moisturising hyaluronic acid and healing panthenol to rejuvenate your skin, and treat an uneven skin texture and tone. The individual ampoules ensure that you’re using the freshest possible version of the formula every single day, as these ingredients can be notoriously unstable. By Hasina Jeelani By Prabal Sharma By Kejhal Kalra Toners are very beneficial to tackle pigmentation and dark spots, especially new-age formulas that don’t dry out your skin. This exfoliating toner comes loaded with 10 per cent apple fruit water (AHA) and 10 per cent willow bark water (BHA) in a mineral water base to clear out your pores, keep excess sebum at bay and brighten your skin along the way. A tone-up product is another K-beauty formulation—a category in itself—that’s especially created to target pigmentation and skin discolouration. This moisturiser works to brighten your skin thanks to pearl extracts, glutathione, niacinamide and a vitamin complex, and even helps reduce the appearance of wrinkles and improves skin elasticity by incorporating adenosine. Expect soft, plump skin that’s as radiant as you’d like it to be. This incredibly light, water-like, antioxidant-boosting essence is an easy addition to your skincare routine (after your toner and before your serum) and gives your skin a healthy glow. It contains 92.5 per cent of a superberry extract—made of acerola cherries and acai berries—which claims to have four times more brightening benefits than Vitamin C and sinks into your skin almost immediately with no stickiness. What you need to know about treating hyperpigmentation on Indian skin 8 dark spot treatments that'll promise you bright, even-toned skin The dark spots-busting skincare products, treatments and DIY masks you need to try By Twiggy Jalloh By Hasina Jeelani By Neeti Mehra By Christian Allaire See more stories Condé Nast India © 2023 Condé Nast. All rights reserved. Use of this website constitutes acceptance of our Terms of Service and Policy and Cookie Statement. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. ",
    "datetime": "2021-04-30T09:59:44.570Z",
    "url": "https://www.vogue.in/beauty/content/k-beauty-products-that-will-brighten-and-balance-an-uneven-skin-tone"
}