{
    "title": "9 Best Korean Beauty Brands To Buy In Australia 2022",
    "text": "For every skin concern.By Dani Maher IT’S LIKELY THAT over the past year or so, you’ve come across the term “glass skin” more than a few times. It refers to skin that is made radiant and dewy through the careful application of smoothing, hydrating and nourishing skincare products; and it all stems from the K-beauty trend that has been dominating the beauty arena over the past decade or so. Korean beauty has revolutionised the world of skincare with its holistic approach to skin nourishment and self-care, and if you haven’t yet taken the plunge into its brilliant, gorgeously-packaged world, allow us to introduce you. K-beauty is the abbreviated version of “Korean beauty”, which refers to skincare products that are derived from South Korea. Korean beauty products focus on health, hydration, and brightening; all key to creating that trendy “glass skin” effect. Related: How to create a skincare routine that actually works  Sephora Try: Lip Sleeping Mask, $31 Founded in 1994, Laneige (“snow”, in French) sees water as the key to efficient skincare. Having spent over 25 years studying water science, they’ve made themselves true experts in hydration. One of the most popular K-beauty brands — its latest ambassador is Sydney Sweeney — it’s likely you’ve seen its product splashed across your FYP, particularly the water bank moisturisers and lip sleeping masks, which I can say from experience, are truly amazing. Adore Beauty Try: Green Tea Seed Serum, $39 Harnessing the power of natural ingredients from South Korea’s Jeju Island, innisfree is perfect for the eco-conscious. All products derived from 80 per cent natural ingredients, with native ingredients sustainably hand-picked for their potent skin benefits. There’s the popular green tea seed range  for improving the skin barrier; Jeju cherry blossom for evening tone and texture; bija cica for blemishes; and Jeju orchid for hydration to name just a few — there’s something for everyone. Oz Hair & Beauty Try: Ceramidin Facial Mask, $7.90 Created in 2004, the brand name Dr. Jart+ is an abbreviation of “doctor joins art”, reflecting their aims to offer skincare that fuses “dermatological science and art”. You’d likely be familiar with their affordable, brightly coloured “rubber” face masks, as well as their BB creams that popularised the category in Korea and beyond. Sephora Try: First Care Activating Serum, $119 Sulwhasoo is among the more luxe K-beauty brands, and its wide suite of anti-ageing products make it a great choice for mature skin. Their ethos revolves around the agelessness of beauty; leading them to seek ingredients that deliver glowing, radiant, healthy looking skin for all ages. You’ll treasure any product from their line — they feel luxuriously heavy in your hand, and look beautiful on your shelf. Adore Beauty Try: Rice Toner, $46 Sourcing only the highest quality ingredients from across Korea, I’m From is cruelty-free, vegan, and alcohol-free — perfect for conscious buyers and those with sensitive skin. Among their most popular products are their rice range, which harnesses the unique power of rice to improve skin tone, texture, and prevent moisture loss — a longtime secret of Korean beauty. MECCA Try: Watermelon Glow Pink Juice Moisturiser, $59 With their fruit-forward, clean formulas and aesthetically-pleasing packaging, it’s no wonder than Glow Recipe has attained something of a cult following. They provide full ingredient lists for complete transparency, and are certified cruelty-free. A refreshing break from the perfection that’s sometimes idealised in skincare, Glow Recipe promotes real, untouched skin in all its beauty, promising to never sell an unattainable goal. Adore Beauty Try: Freshly Juiced Vitamin Drop, $39 Klairs products maintain a no-frills brilliance in their simplicity. Affordable, functional, straightforward and sensitive-skin-friendly, they make healthy skin attainable for all. Launched in Seoul in 2010, the brand utilises only the ingredients that are necessary for products that are mild yet powerful. Adore Beauty Try: AHA BHA PHA 30 Days Miracle Serum, $39 An award-winning brand whose products are beloved particularly for their powers to soothe and heal acne-prone skin types, meet Some By Mi. In particular, their AHA, BHA, PHA miracle range is a cult favourite for those with skin congestion concerns — reviewers claim they truly live up to their miraculous claims. Sephora Try: Rub-A-Dub Refining Peel Gel, $48 Harking from the iconic CHAUM wellness centre in Seoul, Saturday Skin promises to be a “carefree weekend in a bottle”. Each product, from cleanser to eye cream to sheet masks, is formulated with their hero complex created from seven peptides — an exclusive formula that supports the skin’s natural regeneration process. According to Adore Beauty, the Korean skincare 10-step routine goes as follows:            Skincare is a personal thing, and not every brand or approach will work for every person — but the ideals of Korean beauty that prioritise hydration and nourishment are widely suitable to a range of skin types. The boom in K-beauty in the past decade is partly due to its generally accessible price point, and the way it aims to empower its customers with knowledge about the ingredients they want you to use on your skin — so you aren’t just buying a stock-standard moisturiser, but one that you know is targeted to your skin concerns. Basically, Korean beauty simply boosted the standards of what Western consumers expected from their skincare brands, and we’re all the better for it.  ©2022 Switzer Media + Publishing. Harper’s BAZAAR participates in various affiliate marketing programs, which means we may get paid commissions on editorially chosen products purchased through our links to retailer sites. We respect and honour Aboriginal and Torres Strait Islander Elders past, present and future. We acknowledge the stories, traditions and living cultures of Aboriginal and Torres Strait Islander peoples on this land and commit to building a brighter future together. ",
    "datetime": "2022-08-18T07:08:38+00:00",
    "url": "https://harpersbazaar.com.au/best-korean-beauty-brands/"
}