{
    "title": "9 Best South Korean Makeup Artists & Beauty Vloggers To Follow On YouTube",
    "text": "Fashion  The number of innovative Korean beauty products in the world is growing fast, but the constant innovation means that keeping track of the newest Korean beauty trends can quickly turn from a fun hobby into something that feels like a full time job. It's hard to figure out what products works best without a bit of guidance, but one of the easiest places to learn about what's new in Korean skincare and makeup is to follow Korean beauty vloggers on YouTube. After all, their full time job is following these trends and testing them out. Delving into this corner of the Internet can be intimidating if you don't speak Korean, and since many of the titles and descriptions of videos are written in hangul, the Korean alphabet, even knowing what to type into the search bar can be a challenge. Once you find a place to start, however, you quickly realize the world of K-beauty vloggers is much more friendly to non-Korean speakers than it might seem from afar. Especially when you realize that a lot of the videos have English subtitles. Besides, some of the transformations are dramatic enough that you don't need to speak any Korean to be totally impressed. So if you're looking for a place to start your K-beauty adventure, here are nine popular Korean makeup artists and beauty vloggers who can point you in the right direction. If you're just dipping your toes into the waters of Korean beauty vloggers, Sydney and her channel Sydney To You are a great place to start testing the waters. In addition to creating easy-to-follow tutorials of everyday makeup looks, Sydney posts lots of favorites and haul videos, which give you a sense of what products are popular in Korea these days. With over 530,000 subscribers, PONY is one of the most popular Korean beauty vloggers, as well as CL's makeup artist. Her looks are usually variations on everyday makeup with a focus on dewy skin and high glam eyes. PONY's videos are in Korean, but most of them also have English subtitles. She's very good about showing the product in the package before using it as well, including all the product names in the description. Following along is a breeze even for non-Korean speakers and makeup tutorial newbies. If you want to learn how to craft some more dramatic looks, or are looking for inspiration for your Halloween costume, SSIN should be your go-to resource. On her channel SSIN's Cosmetic Psychometry, she recreates K-pop idols' makeup, from CL to G-Dragon, as well as cartoon characters like Elsa from  Frozen . Yes, she can also perfect everyday looks, but it's these dramatic transformations that make her so much fun to watch. Kyung Sun mainly posts everyday makeup looks, but I like her because she's not afraid to tell viewers like it is and divulge every secret of her beauty and skincare routines (like with this video of her skincare routine for long-haul flights, taken while on a long-haul flight of course). All of her videos are in Korea, but many Korean beauty vloggers, Sun included, will start the title of videos that feature English subtitles with the tag \"ENG.\" Though Jung Saem Mool is a popular Korean makeup artist, her YouTube channel is slightly different because she's not the only makeup artist in the videos. Regardless of who's doing the lesson, the looks are easy to recreate and the videos are relatively short — a bonus for those who don't have the patience to sit through a 15 minute long tutorial. Plus, this channel will focus on specific questions or makeup tips, like how to draw a textured eyebrow or different ways to use mascara. The only word I can think of to describe Lamuque is adorable. She has a tendency to talk to herself and make jokes during her tutorials, and her personality shines though these relatively simple and totally feminine looks. The videos are flawlessly edited, often including animations to add emphasis or just for fun. Though many are in Korean only, those with subtitles will be marked \"ENG.\" Although she has a whole collection of K-pop beauty and makeup tutorials, the most popular video on So Young's Beauty Room is one in which So Young compares Korean makeup versus American makeup. In addition to these creative videos, like this one drawing inspiration from dried roses, she also regularly posts hauls and favorites videos. Yooncharmi's not afraid to play with bright colors, as this pink mascara tutorial proves, and her personality on Yooncharmi Makeup Channel is just as bright and bubbly as her makeup itself. Be warned, though, as most of her videos do not have English subtitles. You don't really need a translation to understand how excited Yooncharmi gets about a good lipstick, though. She also takes her time during these tutorials, so the language barrier won't mean you don't understand what's happening. Kwak Tori's videos don't have English subtitles either, unless you auto-translate within YouTube. Like Yooncharmi, however, she takes her time and really shows the viewer what she is doing step by step. What I like best about Kwak Tori is that she has fun on her channel, posting videos like this one where she dyes her boyfriend's armpit hair pink and green. (She also posts lots of videos of her cat, if you're into that sort of thing.) When you figure out which of these vloggers you like, subscribe to their channels and check out the other vloggers with whom they've collaborated to find more interesting content. Once you get over your fears of the language barrier, you'll be slapping on sheet masks and applying flawless foundation with an air cushion like the pros. Images: yooncharmi/YouTube Choose an edition: ",
    "datetime": null,
    "url": "https://www.bustle.com/articles/113897-9-best-south-korean-makeup-artists-beauty-vloggers-to-follow-on-youtube"
}