{
    "title": "9 Cult Korean Beauty Products on Amazon | The Strategist",
    "text": "Every product is independently selected by (obsessive) editors. Things you buy through our links may earn us a commission. One of Korea’s biggest exports, apart from K-pop, are its beauty products. Korean consumers reportedly use up to 15 beauty products a day and have ten-step daily routines. But whatever they’re doing, it seems to be working, which is why Googling “cult Korean beauty products” brings such an overwhelming (and often overpriced) mass of options. The goods news is, plenty of these cult donkey-milk masks and snail-mucus creams are readily available on Amazon. Here are some of the best. According to Laneige, one of these sells every 15 seconds. Think of sleeping masks as a booster for your moisturizer — a lightweight, hydration-packed gel that you can apply over your regular moisturizer. It’s a big gun to pull out when you’ve had a particularly sleepless night, or you’re going to be on a long plane ride, or you just want to treat yourself. The next morning, your skin feels noticeably softer and more supple. Amazon says this is one of its best-selling sheet masks. My friend Alicia Yoon, co-founder and CEO of Korean-beauty skin-care site Peach & Lily, explains that donkey milk has become popular in Korean skin care because it’s gentle and soothing for sensitive skin, has four to five times more vitamin C than cow’s milk, and is high in proteins. Fortunately, the masks do not smell like a farm or an ass, but instead have an innocuous scent that I found immemorable. But I do remember that letting this sit on my face before applying my makeup in the morning helped reduce redness and made my face look radiant. By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us. Cushion compacts have been and remain hugely popular in Korea. The sequel to the very popular BB creams, cushion compacts are the current face-coverage option of choice. Each compact contains a flat, cushiony sponge containing tiny, precisely engineered cells of a BB-cream-like fluid. Pressing a finger into it brings forth the fluid. It’s incredibly light and offers SPF 50 protection, and I love the poreless, airbrushed coverage. Think of essence as a warm-up for your skin: It’s a clear, watery formula that preps your face for better skin-care absorption.This essence feels like fancy water, containing 80 percent fermented yeast concentrate and niacinamide. (The same type of fermentation, via sake, is also one of the secrets to SK-II’s much more expensive version of this product.) For what amounts to less than $2 a treatment, you can plop one of these on your face, let it seep in for 15 to 20 minutes, and get instantly refreshed, hydrated, and cool-to-the-touch skin. This brand is allegedly the most popular mask brand in Korea, and this particular formula absorbs really well. My favorite are these two-part masks, which contain an essence that you spread all over your face before applying the mask over it. You can buy them in bulk. Korean model Soo Joo Park told me this gentle cleanser is one of her favorite products, and I now share the sentiment. I love the texture, which is like a melting sherbet that transforms into a balm without feeling sticky. And it’s still strong enough to remove eye makeup, leaving your face clean and not stripped — it’s so delightful that I actually look forward to washing my face. Snail cream sounds strange. But the mucus (yes, mucus) secreted by snails contains protein, elastin, and hyaluronic acid, all of which are great for your skin. While dermatologists may be divided on whether snail mucus contains a high enough concentration of these ingredients to be truly effective, Korean skin-care companies have bet big on the idea. This product by Mizon is one of the most popular, and it doesn’t smell like a mollusk; it does, however, have a slightly gluey texture, but it’s not unpleasant. Friends of mine who have acne-prone skin tell me this does a great job of moisturizing without making your face oily. If you’re a true newbie to Korean skin care, Charlotte Cho, the founder of the Korean beauty site Soko Glam, can save you from having to browse hundreds of blogs by putting all of the information in one quick and fun read. This is one of those K-beauty products that fanatics buy backups of before even running out. It’s so frequently sold out that I haven’t even tried it yet! But my K-beauty friends tell me they love it because it smells like rose petals (you can actually see bits of petal in the formula), has such elegant packaging, and is automatically TSA-approved: The oil-based wash is compressed into a stick that takes up no more room than a Chapstick. The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best hair care essentials, whitening toothpaste, very black mascara, tinted lip balm, acne mask, magnifying mirror, and all-natural deodorant. We update links when possible, but note that deals can expire and all prices are subject to change. If you buy something through our links, New York may earn an affiliate commission. Every product is independently selected by (obsessive) editors. Things you buy through our links may earn us a commission. ",
    "datetime": "2016-10-12T10:29:00.000-04:00",
    "url": "https://nymag.com/strategist/2016/10/9-cult-korean-beauty-products-on-amazon.html"
}