{
    "title": "9 New Korean Beauty Products You Need to Know About This Year | Allure",
    "text": "By Renee Jacques By now, the popularity of Korean beauty brands in America is old news. But unlike other cosmetic and skin-care trends we’ve encountered, this one certainly isn’t fleeting. In the past couple years Sephora has ramped up their K-beauty offerings with brands like Chosungah 22 and Too Cool For School, companies like Tonymoly have opened up their first freestanding stores in the U.S., and Korean model and social media star Irene Kim became the face of Estée Lauder’s Estée Edit line, inspiring the classic French company to sprinkle the new collection with K-beauty-inspired products like a water-gel mask and color-modifying lipsticks. And while staples like cushion compacts and hydrating essences continue to be part of the core of K-beauty offerings, new innovations are literally flying — at lightning speed — here to the States. We asked the co-founder of Soko Glam, Charlotte Cho, as well as Christine Chang, the co-founder of Glow Recipe, and Alicia Yoon, the founder of Peach & Lily, to share their insights on the newest trends and products that we’ll see on drugstore shelves and at department-store counters. Read up as we take you on an advanced Korean-brands beauty class. Morning CleansersYes, you probably wash your face every morning, but have you ever thought about how you're washing away all those pricey night creams and serums you slathered on the night before? Korean skin-care company Lagom did and came up with the concept of a \"morning cleanser,\" a supremely lightweight, oil-based face wash that refreshes your skin after a good night's sleep but doesn't leave it feeling tighter than a pair of Spanx. Yes, there's nothing supremely \"new\" about it  (it's still just an oil-based cleanser), but it will be interesting to see how the lighter formula leaves our skin feeling in the morning. Single Double-CleansersDouble cleansing is kind of like flossing—it's probably good for you, but you always feel too lazy at night to do it. There's nothing that can make flossing any easier (it's never going to, so just do it on behalf of all dentists everywhere), but there is a new way to cut the double cleanse in half. Cho let us in on a little secret: Neogen Milk-to-Foam Coconut Milk Pure Mild Cleanser, a product so new it's not even on Soko Glam (but it will be soon). \"This is putting your double cleanser in one [bottle],\" says Cho. When you pump it into your hands, it feels like you just dumped coconut frosting on your fingers, but when it touches your face and you start adding water, it froths up into a super-cleansing wash. \"It removes sunscreen and makeup like an oil-based cleanser, and then as you rub it into your skin it turns into a foam and removes other impurities that a water-based cleanser would remove,\" says Cho. \"It’s also great as a body wash because of how well it breaks down oil-based products.\" By Aliza Kelly By Gabi Thorne By Gabi Thorne ArtichokesKorean beauty has had an infatuation with broccoli (random), eggs (yummy for breakfast, not on your face), and snail slime (gross). The newest ingredient obsession is also edible but a little less strange: It's artichoke, and it's currently all the rage when it comes to Korean essences. \"DIY treatments made of natural ingredients have long been a popular practice in Korea. I remember my grandmother and mother both being wizards at using yogurt, egg, and green tea to create their own concoctions,\" says Chang. She says it was the fact that natural ingredients work so quickly and effectively that inspired the Yuripibu Artichoke Power Essence. According to Glow Recipe, the product has a high concentration of artichoke extract, helps tighten the appearance of pores, and helps with skin's elasticity. By Aliza Kelly By Gabi Thorne By Gabi Thorne Sheet Masks 2.0The most popular of the Korean product imports have become more advanced and specific. Take for example these Blossom Jeju Petal Masks (shown above), which require two steps: First you take the pouch at the bottom, which is filled with camellia oil from the Jeju islands in Korea, and slather it all over your face. An oil long used in Korean medicine and skin care, \"the camellia blossoms that grow in the mineral-rich volcanic soil of the islands are said to be especially rich in antioxidants.\" By applying the camellia oil on first, it \"softens, plumps, and exfoliates the skin,\" according to Chang, so that it becomes like \"a wet sponge\" to absorb the ingredients in the sheet mask, which nourish, brighten, and firm. Then you have what the pros like to call skin stickers. The Kocostar Rose Petal Mask is as fun as it is effective. Instead of being packaged as one big (and sometimes claustrophobic) sheet mask, there are six mini-masks in the package that are shaped like rose petals (see, fun!). Just peel them off the plastic backing and stick them on the parts of your face that are in need of serious hydration. \"Not everyone wants to hydrate their entire face, so you can put these essence-soaked stickers only on dry spots,\" says Cho. \"They are made out of super thin microfiber, so you don’t need to lie down to keep them from slipping off—you can do whatever you need to do.\" By Aliza Kelly By Gabi Thorne By Gabi Thorne Superior Face MistsThe Korean beauty market is pumping out new face mists, many of which go beyond keeping your skin dewy. The first is the Ariul Berry Vital Recharging Gel Mist. What's unique about this mist is it's not really a \"mist\" in the traditional sense. Inside the tube is a slightly thick gel. \"The idea is that the slightly more viscous texture locks in moisture,\" says Yoon. It also promises to combat the skin-damaging effects of pollution, thanks to strawberry, blueberry, blackberry, and raspberry extract that help fortify the skin. \"Everything this year in Korean beauty is about anti-pollutant and daily defense,\" says Yoon. \"We get a lot of winds that blow in from China, so there are days that you have to walk around wearing a face mask because you don’t want to breathe the polluted air, so there are more and more products launching to combat that.\" There's also now a face mist specifically for oily skin: Neogen Code 9 Sebum Clear Pore Mist. By Aliza Kelly By Gabi Thorne By Gabi Thorne \"In Korea, everyone is obsessed with hydration, but they are also concerned about oily skin, especially in the summer, when you have tons of oily shine,\" says Cho. \"This is a hydrating mist that mattifies you.\" Harder-Working MakeupIt only feels right that when it comes to makeup, Korean women want it to do more than just make them look good. Enter the 24/7 Honey Dual Lip Treatment and Color Tint Balm and the 24/7 Touch-Up Skin-Perfecting Cream. On one end of the lip treatment is natural YooChae honey, which keeps lips soft and hydrated. On the other side is a creamy coral lipstick. It's also important to protect the lips. \"You can have perfect skin, but if you have shriveled lips it's a telltale sign that your collagen is breaking down,\" says Yoon, who's also an aesthetician. The other 24/7 product is probably one of the coolest highlighters we've ever seen. The 24/7 Touch-Up Skin Perfecting Cream is a highlighter that contains adenosine (which smooths and firms the skin), glycerin (which hydrates), and licorice (which provides anti-inflammatory benefits). \"It was hard for us to decide whether this goes under makeup or skin care.... It feels like a cream — it's heavy and it has anti-wrinkle effects. It's hydrating, and it's really good for your skin; however, they added very subtle shimmer to it,\" says Yoon. She adds that she's been putting a thin layer around her eyes and the edge of her outer eyebrows. \"It’s a very subtle shimmer that makes your face look dewy, but the best part is that I have sensitive skin, and I know that it's nice because it's good for your skin.\" By Aliza Kelly By Gabi Thorne By Gabi Thorne Related stories: Watch Charlotte Cho explain Korean beauty: Don't forget to follow Allure on Instagram and Twitter. By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Nicola Dall'Asen By Sarah Han By Dianna Mazzone By Devon Abelman More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2016-08-04T11:00:00.000Z",
    "url": "https://www.allure.com/story/2016-korean-skin-care-beauty-products"
}