{
    "title": "9 Things I Learned About Sheet Masks At Koreatown's The Mask Bar Because Snake Venom Doesn't Have To Be Scary",
    "text": "Fashion In the recent wave of K-beauty that's come to the United States, there's one product that's quickly risen to the top of the pack: Korean sheet masks. There are seemingly countless benefits to using sheet masks, from their ease of application to their ability to soak even the most sensitive skin with nutrients. I'm also totally obsessed with them, so when I passed by The Mask Bar, located in the heart New York City's Koreatown on West 32nd Street near 5th Avenue, I couldn't not stop by. The Mask Bar is filled from floor to ceiling with dozens of different brands and types of face masks, with ingredients ranging from honey to snail serum, and to be honest, the whole experience can be a little overwhelming if you don't know what you're looking for. Luckily, I was guided through the jam-packed aisles by Namee Park, The Mask Bar's owner, who was happy to answer all of my questions. Her goal with The Mask Bar is to bring some of Korea's most popular beauty brands and most beloved products to New Yorkers, all at a very reasonable price. Whether you're looking for something to quickly refresh your skin after a night of heavy drinking or want something to shake up your daily skincare routine, there's probably a sheet mask out there that'll work for you, and having a little bit of knowledge can help. So here are nine things I learned about sheet masks, and sheet mask ingredients, when I visited The Mask Bar in Koreatown: Innisfree Cucumber Mask, $14, Amazon The first sheet masks Park showed me were cucumber and aloe. The cucumber masks, like this one from Innisfree, are Park's personal favorites because they're so refreshing. The aloe in the sheet masks is also great if you've gotten a sunburn. \"It helps to sooth the skin and give more moisture,\" explained Park. She also recommended popping the masks into the fridge before putting them on your face to help contract pores. Snake venom sounds like a terrifying ingredient to put on your face, but Park assured me that it's totally safe. It's actually a peptide that's similar to Botox, so it helps to reduce fine lines and wrinkles, and according to Park, \"It's getting so popular.\" Plant-based Placenta Mask, $10, Amazon I've tried a placenta sheet mask before, and it totally freaked me out, but Park also tried to calm me down about this one. \"It's kind of scary,\" she admitted, \"but it's from botanical placentas.\" In other words, it's plant-based, not animal-based. (Phew.) The goal of the placenta sheet mask is to stimulate cells, which will help rejuvenate the skin. Tomato Sheet Mask, $6, Amazon I've been breaking out recently, especially around my chin, so I asked Park what would be best to help with that issue. She told me that tomato sheet masks would help to fade acne scars. If I wanted a full skin detox, I'd be better off with a green tea sheet mask. The one she showed me also included collagen, which would help with skin's elasticity. (And yes, that is a snail sheet mask next to the green tea.) If you're feeling overwhelmed by the number of options out there, don't worry. Most sheet masks explain their purpose on the packaging, with some sheet masks getting really specific like these two. There was also one in case you wanted to treat yourself \"After Hard Study.\" If you're on your own and don't have access to a place like The Mask Bar with experts to help vet the products, or if you're just looking for sheet masks online, check the ingredients to make sure your mask doesn't have mineral oil in it. Park explained that mineral oil in masks will cause clogged pores, which is the opposite of what you want. To use a sheet mask, Park recommended following the instructions on the back of the packaging: Wash your face, apply the mask, and let sit for 15 to 20 minutes. But she had some extra advice. Park's pro tip was, \"Don't throw them out immediately after you're done. Apply the serum on your neck and let sit for another 15 minutes. Then throw them out.\" A lot of people think of sheet masks as a treat, something to be used only for special occasions or when you're trying to relax. But according to Park, \"These are really mild so you can use them daily as an intense moisturizer.\" This also means even those with super sensitive skin should be able to test new products out, without fear of breaking out or accidentally causing more damage. But if you find a sheet mask that works for you, stock up and use one whenever you want, even if \"whenever\" is every single day. Images: Maxine Builder Choose an edition: ",
    "datetime": null,
    "url": "https://www.bustle.com/articles/97468-9-things-i-learned-about-sheet-masks-at-koreatowns-the-mask-bar-because-snake-venom-doesnt"
}