{
    "title": "A Disney x The Face Shop Makeup Collection Is Here | Allure",
    "text": "By Avery Matera Disney-themed Korean beauty products have landed. That’s right: Two of your favorite things ever have collided in a collaboration of your dreams. The animated characters have partnered with Korean beauty brand the Face Shop to create a line of products that include Disney Princess sheet masks and Mickey Mouse lip tint. Yes, it's everything. Some of the new products have packaging branded with your favorite childhood characters. There's concealer, eye shadow, bronzer, and the like that have images of Monsters Inc., Donald Duck, and Minnie and Mickey. There are sheet masks from characters such as Snow White, Ariel, and Sleeping Beauty that — though an image has yet to be released of the actual mask — we’re hoping makes the user look just like one of the royal crew for at least as long as it is left it on. They couldn't come at a better time, either, as Disney obsession is at a peak level. Not only has the live-action version of Beauty and the Beast with Emma Watson been dominating the box office, but Disney-themed clothes have also showed up at Paris Fashion Week. The Face Shop isn't the first beauty brand to get in on the action, either. It was only this past February that L'Oreal debuted a Beauty and the Beast-inspired, limited-edition capsule that sadly, wasn't easily accessible in the U.S. This content can also be viewed on the site it originates from. What's more, Korean beauty trends have been having a big moment as of late as well, including Instagram-worthy face sheets, innovative moisturizers, and face peels. We only just recently rounded up the 13 best of the bunch that will promise an instant refresh for this coming transitional season. Which is all to say, there's nothing better than two of our favorites coming together in a collection you're going to want to shop every product from. This content can also be viewed on the site it originates from. This content can also be viewed on the site it originates from. By Aliza Kelly By Gabi Thorne By Gabi Thorne So, whether you want to brush on powder with the help of Winnie the Pooh or paint your nails like Belle from Beauty and the Beast, this collaboration is for you. You can shop most of the assortment on Amazon and view all the products to come on the brand’s Instagram. More from Disney: Nicole Byer Reviews Weird Beauty Products: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Sarah Han By Dianna Mazzone By Sarah Han By Sarah Hoffmann More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2017-04-07T21:45:59.483Z",
    "url": "https://www.allure.com/story/disney-themed-korean-beauty-products"
}