{
    "title": "A Former ‘Apprentice’ Finalist Just Launched a Global K-Beauty Platform - Racked",
    "text": "This site uses cookies. Select \"Block all non-essential cookies\" to only allow cookies necessary to display content and enable core site features. Select \"Accept all cookies\" to also personalize your experience on the site with ads and partner content tailored to your interests, and to allow us to measure the effectiveness of our service. To learn more, review our Cookie Policy, Privacy Notice and Terms of Use. Filed under: W2Beauty offers 7,500 Korean beauty products plus a community for fans to talk about them. Racked has affiliate partnerships, which do not influence editorial content, though we may earn commissions for products purchased via affiliate links. We also occasionally accept products for research and reviewing purposes. See our ethics policy here. Racked is no longer publishing. Thank you to everyone who read our work over the years. The archives will remain available here; for new stories, head over to Vox.com, where our staff is covering consumer culture for The Goods by Vox. You can also see what we’re up to by signing up here. Let’s just get this out of the way first: In 2007, James Sun was a contestant on the seventh season of The Apprentice. When he auditioned, he asked the producers why there had never been an Asian male on the show before. He says they essentially told him, “No offense, but Asian males don’t make for good television.” Sun proved them wrong, making it to the finals, where he ultimately was “fired.” He went on to become a serial tech entrepreneur, his most recent company being K-beauty site W2Beauty (more on that shortly). He founded companies like Pirq, an app that functions as a digital loyalty program, which he later sold. He also founded Dramabeans, a popular English-language site that dissects Korean dramas and K-pop with 14 million users. He made headlines during the presidential campaign in 2016 when he went on CNN with a few other former Apprentice contestants to denounce Trump’s message. Trump responded by calling them all “failing wannabes.” Sun says he declined to respond. For the last three years, Sun, who is Korean American, says he has given probably 200 speeches on diversity and globalization. “I’ve realized why people are not receptive of [certain] cultures... It really comes down to exposure and education,” he says on a Skype call from Seoul. “Dramabeans made me proud to see all these non-Koreans appreciate and love Korean culture and food and music. I realized through business there is a way I can help fight prejudice and bias and increase the exposure of diversity in our world.” When asked about his interactions with Trump and whether or not he had any conversations with him about the experience of being Asian in America, Sun says, “I had several conversations with him about it. I would say that Trump overall respects the Asian culture; he understands that there are complexities in it, but he has some stereotypes as well.” Like what? “I remember one episode, there were some problems with the computer system and he’s like, ‘Hey James, uh, aren’t you really good at that kind of stuff?’ And I go, ‘Why would I be good at that kind of stuff?’ You know, moments like that.” Sun has moved on and is now attempting to spread the message of another Korean cultural moment, K-beauty. He says he was interested in buying a site, and purchased W2Beauty, a small blog in Korea that sold a few products. He relaunched it in March with 7,500 products and global shipping capacity. The company, which is registered in the US, has raised seed funding, and Sun hopes to raise “a couple million dollars” more in the next few months in series A funding. The company has offices in Seoul and LA, and has 11 full time employees. Like what you’re reading? W2Beauty has three arms through which it hopes to engage people: sales of products, editorial, and a community platform. It’s hard not to compare it to Memebox, a site that also used to offer thousands of products, but has since pivoted to content and producing private-label products, one of which is doing well at Ulta. Sun says the differentiator is that W2Beauty will ship all its products from Korea (which is how Memebox started), rather than having a warehouse in the US. He claims that even though shipping times to some countries can take up to three weeks, products are “fresher.” He also speculates that one of the reasons Memebox didn’t succeed as a retailer was because the brands it worked with felt threatened because of the competing products Memebox was launching. But Sun is thankful for the pioneering work Memebox did in creating awareness and a market here in the US — he calls it “K-beauty 1.0.” Currently, about 60 percent of W2Beauty’s traffic comes from the US and Canada, and the majority of the rest from Southeast Asia and Mexico/Latin America. Sun says the Middle East may prove to be an exciting market; he claims some customers there have purchased between $2,000 and $3,000 worth of merchandise at one time. You can find all the popular K-beauty brands on the site, like Etude House, Missha, Skinfood, Su:m37, and Banila Co, as well as lesser-known brands like Romand and Pudding Hair. Each product includes a description, full ingredient list, and “insights,” though not every single product is updated yet; Sun says they will be soon. Shipping is free when you spend $60. Editorial is the second arm of W2Beauty’s business. As K-beauty entrepreneurs have discovered, education about products is key since many of them feature formulations and names US shoppers have never seen. Sun estimates that only five to seven out of a hundred American women really know what K-beauty is. He hired Anna Park, the former editor in chief of Audrey magazine, the first Asian-American-focused fashion magazine. (It published from 2003 until 2015, when it shuttered.) She is in charge of editorial content on the site and oversees a stable of 10 writers, many of whom, like Jude Chao and Coco Park, have successful K-beauty blogs. This isn’t a new concept in the K-beauty commerce space. Charlotte Cho, the founder of Soko Glam, launched a freestanding content site called the Klog, where her writers talk about K-beauty, products, Korean culture, and general beauty topics. Whenever a site that sells stuff provides education, there’s always the question of how objective they can really be. Sun says, “My first priority is that we have the best content that’s trusted and authentic. We write about trends and products and ideas,” as opposed to straight-up product reviews, though those are definitely there. This one recommends a Romand cushion, a brand that Sun brought up a few times in the conversation as one he’s excited about. It’s a tricky proposition, though it’s true that potential customers really don’t understand K-beauty fully yet. “I tell my investors, ‘if you’re expecting us to just get sales sales sales, this is the wrong company. If you’re in it for the long term to build the first and best K-beauty community in the world, then you can be an investor.” The bloggers Sun hired have a lot of credibility in the K-beauty community, but it will be interesting to see how they balance their independent blogs with working for a retailer. Community is the last arm. A platform just soft-launched last week and is still in beta, though W2Beauty will officially announce it at KCON on August 19th. Every member has her or his own wall, and there is also a scrolling feed. You can comment on products, editorial posts, and people’s walls. There is no private messaging capability currently. Reddit already has some robust forums for discussing K-beauty, like the Asian Beauty subreddit, but Sun says, “I think Reddit’s great for the hardcore fans of K-beauty who are almost like debating each other. There’s a place for that. The goal of the community is not to replace Reddit but to grow the market.” He hopes that people with similar skin types and concerns will find each other and discuss products that work. He also says that this is where potential negative product reviews will live, written by community members, as opposed to his editors writing them in the editorial section. K-beauty fans will likely be excited to have a new retail option, but it will have to survive some of the forces that felled Memebox and that currently challenge other K-beauty brands and retailers in the US. Sun is optimistic. “Nothing grows unless you do a version 2.0. We are defining ourselves as a K-beauty 2.0, which is not only about the next product we’re trying to sell, but to really be about engaging users to have the conversation so it can grow as a market.” ",
    "datetime": "2017-08-10T09:32:01-04:00",
    "url": "https://www.racked.com/2017/8/10/16094904/w2beauty-james-sun-apprentice-kbeauty"
}