{
    "title": "A Guide To NYC’s K-Town: Best K-Beauty, K-BBQ, And K-Pop Stops",
    "text": "Where to find great K-BBQ, K-Beauty Shops, and K-Pop Stores while in Koreatown in New York City. The Hallyu Wave is cresting strong on America’s shores, and if you’ve become a purveyor of Korean cultural exports, then a visit to New York City’s Koreatown is a must on your travel bucket list. If you’re a beginner in all the K-culture fun, don’t worry too much about Manhattan’s K-town; it is a manageable couple of blocks of food, beauty, and bustling culture. Located between 5th and 6th avenues and 3rd and 33rd streets, NYC’s K-town is adjacent to the Empire State Building and jam-packed with more BBQ and shopping than you can imagine. If you want to spend a day in this little pocket of Korea, then read on to maximize your time. If you’re starting your day in K-town, head to Afternoon K-Town to snag an indulgent morning mochi donut or, if you’re feeling up to a it, a famous Korean corn dog. Mochi donuts are incredibly Instagrammable and feature bright colors and designs while the corn dogs include some fun surprises like cheese or potatoes on them. If those sound a little intimidating at first, try out Korean-French bakery chain Tous Les Jours. The bakery has a choose-your-own, cafeteria-like line of pre-packaged baked goods, including their famous sausage rolls, red bean buns, and yuzu pies. Tous Les Jours also makes creative coffee or tea drinks and often have specials that reflect the season like a pumpkin spice latte in the fall or a lavender latte in the spring/summer. A great to-go option if you’re only stopping by K-town for a quick treat. Even if you don’t do the million-step skincare that K-beauty is famous for, there are so many fun (and effective) skin care products to shop for in K-Town. If self-care, and skin-pampering is what you’re on the market for, The Face Shop should be your primary stop. They sell everything from toners to emulsion packs to creams to mists. Perfect makeup things for your future travel! There are so many choices and brands, all packaged with the most aesthetically pleasing packing you can imagine. It may seem overwhelming, but there are always sales associates in the store to help you. This is also a great stop for any fans of BTS or Kakao characters—the shop holds a great selection of K-Pop merch and plushies. Want something a little less overwhelming? Besfren Beauty has a curated selection of K-Beauty skincare that still gives you plenty of options with very little to no overlap between this shop and the Face Shop. The shop is bright and airy and also has a small selection of makeup as well. They often run deals, like “Buy One, Get Ones” so pay attention to the signs on the shelves! If you’re hoping for a one stop shop, then look no further than the combined stores of Kosette Beauty Market and Koryo Books. Though they are two separate stores, the storefronts are adjoining so you can move through them with ease. Kosette Beauty Market is equal parts skin care, hair care, body care, and make-up, so you can find all sorts of K-Beauty miracles here. They also carry the latest hair accessories from Korea, including pearl-encrusted scrunchies, rhinestone hair clips, and funky barrettes. Koryo Books hold so much more than just books (though if you want some Korean language learning books, this is a great place to try!). This shop is filled to the brim with Korean culture knick-knacks like fans and small desk statues, but most prominently it’s filled with K-Pop swag and cutesy Korean stationary. Any group imaginable is represented in their K-Pop stock, so you can walk away with both the latest ATEEZ album as well as a holographic notebook. Since you’ve worked up an appetite, now it’s time to hunt for the best BBQ. If you’re an adventurous eater, then one of the best K-BBQ places in NYC’s K-Town is Gopchang Story. Gopchang is intestines, which sounds a bit off-putting but in BBQ form is delightfully decadent. The constant waitlist for this restaurant is a testament to the quality of their food so be sure to join the waitlist on their website before you head there to make sure you snag a spot. Related: 10 Best Restaurants in Incheon South Korea If the thought of their signature dish makes you feel a little unprepared, fear not, they have a menu featuring all your favorite Korean BBQ dishes including galbi, bulgogi, and sampyupsal. Oh and of course all the little (complimentary) side dishes that Korea’s known for, the banchan. Even if you're used to making Korean food at home, it just feels different at a BBQ joint like this. Still a little hesitant about gopchang? Just a few doors down, there’s Jongro BBQ, a large and spacious restaurant that has much more on the menu for everyone. The restaurant’s interior is reminiscent of a traditional Korean village and all the tables have grill tops that allow for the food to be cooked in front of you. The drink menu is also extensive but of course, includes world-famous Korean soju and makkeoli (both rice wines but different consistencies and flavors). Like Gopchang Story, check-in online to join the waitlist! Related: 10 Absolutely Delicious Korean Dishes, 10 Not So Delicious Both Seoul and NYC are infamous for never sleeping, so you can find entertainment at all hours of the night. Korean karaoke culture is very present in K-town, with several karaoke bars lining 32nd street. The same goes for Korean-style pubs that serve famous street foods like tteukboki (spicy rice cakes), Korean fried chicken, and pajeon (savory pancakes). If you’re looking for that kind of adventure, then Turntable LP Bar & Karaoke fuses late-night dining with fun music and karaoke. Oh, and if you have stage fright, the restaurant has private karaoke rooms that you can rent with friends, similar to how it would be done in Korea.   By subscribing, you agree to our Privacy Policy and may receive occasional deal communications; you can unsubscribe anytime. By day, Sharon is a museum curator in history, and by night she is a PhD Researcher (of K-Pop!) in Media and Cultural Studies. She is a bi-coastal, Korean-American traveler who splits her time between the UK, the US, and South Korea and has written and presented articles and papers for house museums across New England, popular culture conferences and magazines, and Asian Studies conferences. Sharon is an avid aviation geek, a museum nerd, and a glutton for K-Stuff (K-Dramas, K-Beauty, K-BBQ). Follow her PhDing and travels @thepophistorydoctor on IG! ",
    "datetime": "2022-07-01T21:31:13Z",
    "url": "https://www.thetravel.com/guide-to-koreatown-in-nyc/"
}