{
    "title": "A K-Beauty Brand That Believes Less Is More? Enter Huxley, the Product of Choice for Korean Flight Attendants",
    "text": "Named after the Brave New World author, Huxley is simplifying K-beauty by focusing on one ingredient: prickly pear cactus seed oil. “Less is more,” is not a phrase that is employed often in Seoul, the booming capital of South Korea. Especially not when we’re talking about K-beauty products. It’s been reported that Korean women use an average of thirteen beauty products per day, and on top of that, the country has the highest ratio of plastic surgery procedures per capita. And when you look at the products themselves, there are masks of every shape, size, and theme (red wine masks were a favorite of fashion editors at Seoul Fashion Week this season). And cosmetic stores like Tony Moly look like Noah’s Arc, with monkey-shaped compact cases and panda lipstick tubes on every shelf. But Mr. Hoon Lee decided to do things differently. He realized that despite the rising popularity of K-beauty products, what costumers really needed was the opposite of what was grabbing their attentions. “My philosophy is ‘less is more,'” he said at his office in Seoul during Fashion Week. “I like to go back to the basics. You don’t need too many products. Most brands make new products just to sell you more, and we’re doing the opposite. I’m not trying to chase any trends.” Enter Huxley, his new brand named after the late Brave New World author Aldous Huxley. “Like Huxley predicted, in the future, there is so much information out there that it’s hard to tell what’s true and what’s false,” Lee said. “We’re pursuing true beauty.” How? Huxley does this no bells and whistles, just a focus on one ingredient, prickly pear cactus seed oil, and only a handful of products. However, Lee doesn’t like the the term “natural” beauty, despite his choice of ingredients. Instead, he prefers “contemporary.” But in order to appeal to a contemporary customer, Huxley refers back to ancient techniques perfected by the Berber women of the Sahara desert, who to this day keep their skin moist with the use of cactus oil. It’s a labor of love though, because it takes million seeds to yield just one liter of cactus oil. Up until recently, the beauty industry was pushing argan oil and coconut oil as the à la mode moisturizers, but Huxley is in the first wave of brands promoting cactus-based products as the next best thing. Because of the tediousness of its harvest, however, it’s still relatively rare on the market, and the way that Huxley packages its products emphasizes how precious each drop is. Its oils, toners, and water all come in clear glass bottles, which have minimalist logos and text. Plus, Huxley even offers a travel-sized glass bottle collection to bring on planes, which can oftentimes have the same dehydrating effects on your skin as a desert. In fact, Huxley prides itself in being the brand of choice for Korean flight attendants, who are known for their perfectly radiant complexions. After my own 14-hour flight from Seoul, I brought Huxley’s face cream back home to New York City, where its since become my nightstand staple. I may not be in the Sahara, but an old Brooklyn radiator is pretty harsh. All Huxley products are available at glowrecipe.com. All Aboard! The Holiday Shopping Train Is Leaving the Station ",
    "datetime": null,
    "url": "https://www.wmagazine.com/story/a-k-beauty-brand-that-believes-less-is-more-enter-huxley-the-product-of-choice-for-korean-flight-attendants"
}