{
    "title": "A Korean Makeup Artist’s 7 Favorite K-Beauty Products — 2018 | The Strategist",
    "text": "Every product is independently selected by (obsessive) editors. Things you buy through our links may earn us a commission. Yes, the Olympics are underway in Pyeongchang, and with all the feats of skill and speed and artistry on display in South Korea, now felt like an appropriate time to celebrate all of the delightful things that originated in the country. From miracle-working beauty products and addictive snacks to Ultra HD electronics and the world’s best dishwashing gloves. Welcome to Made in Korea week on the Strategist. In our never-ending hunt for the best K-beauty products, we’ve trawled through Reddit comments and Amazon reviews, talked with K-beauty bloggers, and taken personal recommendations from our favorite skin-care obsessive and K-beauty enthusiast Rio Viera-Newton. But we were curious: What K-beauty products are must-haves for professional makeup artists, people who actually get paid to take skin care and makeup seriously? To find out, I spoke with Seong Hee Park — a New York City–based Korean makeup artist who assisted Pat McGrath for six years and whose artistry has been featured in the pages of dozens of magazines and on several Vogue covers. Below, the K-beauty and Korean skin-care products this professional makeup artist keeps stocked in her kit and uses on editorial and commercial fashion shoots to prep models’ skin for their close-ups. Young models usually have beautiful skin, but sometimes I meet a model who has super-dry and sensitive skin due to heat, AC, and frequent air travel. In that case, I use Too Cool for School Coconut Ceramide Mask for skin preparation because skin texture is very important for a shoot. I like to use unscented skin products, but coconut-scented and aromatic smells are always welcome! I like using the Face Shop Eye masks, as well, for dark circles under eyes. I am a green-beauty fan and don’t like to use heavy formula or strongly scented skin products for work, so my skin-preparation step for a job is very simple. There are many allergies to the ingredients of makeup products nowadays, so I always consider well-balanced ingredients. My daily skin-preparation kit for a shoot is AmorePacific Moisture Bound Skin Energy Hydration Delivery System, a face mist for long-lasting hydration, and Whal Myung Skin Elixir, a watery liquid with aromatic smells that’s free of silicone, phthalates, sulfates, and parabens. For a location shoot, I need a good sun cream to make the skin flawless. IPKN Big Apple Sun Cream doesn’t leave white behind and smooths into skin nicely, so after application, it is simpler to make skin look flawless on set. I like Etude House eyebrow pencils because all the colors are natural-looking and beautiful. To make the skin texture silky and nicely glowing without a glittery look, I apply IPKN Radiant Cream Primer and [a cushion compact] to the face. I like using the IPKN Radiant Cream Primer when I want to make skin glowy but not too greasy. I guess it contains fine pearls, which makes silky skin texture. If I want more shine texture on the face, I add it on the highlight zone with my fingers. By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us. The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best hair care essentials, whitening toothpaste, very black mascara, tinted lip balm, acne mask, magnifying mirror, and all-natural deodorant. We update links when possible, but note that deals can expire and all prices are subject to change. Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission. Every product is independently selected by (obsessive) editors. Things you buy through our links may earn us a commission. ",
    "datetime": "2018-02-16T12:53:48.197-05:00",
    "url": "https://nymag.com/strategist/article/makeup-artist-favorite-kbeauty-products-korean-skincare.html"
}