{
    "title": "A makeup artist shares the secrets behind the flawless faces of Korean drama stars and K-pop idols | Vogue India",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, visit My Profile, then View saved stories By Hasina Jeelani In matters of beauty and skincare, it is safe to admit that the world of K-beauty knows plenty that we don’t. It comes as little surprise that the global industry has spent the past few years mining beauty stores in Seoul for ideas, but if you’re looking to jump to the head of the queue, it pays to go directly to the source. The quest for answers led us to makeup maestro Hong Hyunjeong, known widely for her YouTube channel Hong’s MakeuPlay. Over the course of her career in the industry, her makeup brushes have worked overtime on both sides of the globe—from Korean celebrities like Gong Hyo-jin (from the TV show Sang Doo!) and Lee Hyori (from Hangout with Yoo) to backstage at Fendi, Gucci and New York Fashion Week. Ahead, she shares the makeup rules that Korean celebrities live by, and we should too. Korean makeup is synonymous with even-toned skin, and Hong confirms that Korean women love a bright, clean canvas to work with. “I like to use a tone up cream before starting with the base makeup for brightened, clear skin,” she shares. Tone up creams, usually loaded with skin-loving ingredients like niacinamide, occupy the intersection between makeup and skincare by offering sun protection, moisturisation and blurring out pores and can be worn under makeup or alone as well for brightening the skin. No heavy contours to see here, Korean makeup is known for its lightweight, my-skin-but-better finish. It comes as little surprise then that the usual makeup routine for Korean women doesn’t involve heavy, caked-up layers. Hong affirms, “The base makeup for the skin has to be as thin as possible for the entire face. For correcting any skin imperfections, the right amount of concealers are used just in the areas needed.” Though K-beauty holds credit for some of the most coveted beauty trends of the past few years, Hong remains wary of chasing after every new name making headlines. “Korean women are very sensitive about the ingredients used in cosmetics, and I tend to avoid new names that haven’t offered proven results yet and are just running on the strength of marketing and gimmicks,” she reveals. The diligence is mirrored by her celebrity clientele as well. “Some of them have sensitive skin and are extremely reluctant to use products with a strong fragrance, even if it’s a high-end brand,” she adds. So, what is the focus of Korean makeup in 2021? “There is a big blusher war going on right now in Korea with brands competing for the attention of the younger generation,” says Hong. From powder puffs to liquid cheek stains, the options are many and varied for adding a rosy glow to the face, but she believes that younger women are now looking for names that work as hard as they do. “It’s nice to see women favouring multi-tasking products that can be used on the lips and as a blusher for adding a natural flush to the face.” The craze for dewy skin serves as one of K-beauty’s most successful exports to the world, undoing years' of conditioning that shine was the enemy. A dewy glow that celebrates the skin’s natural sheen is now being welcomed, and Hong likes to rely on one powerful tool to get a dewy finish in two ticks: a serum spray. “After the base makeup is done, I like to finish off with a few spritzes of a serum spray, like the D'Alba First Spray Serum, to quickly and easily get that dewy texture,” she says. Given the humid climate we live in, and its many unpredictable changes, it pays to borrow from the K-beauty rulebook for ensuring that makeup lasts longer through the day. To avoid adding frequent touch-ups to a celebrity’s already-hectic schedule, Hong chooses to cool their skin before applying base makeup. “You’ll generally find me using some mask pads for cooling the skin before applying primer and two-three layers of foundation—extremely thin layers, of course,” she says. Needless to say, the quest for dewdrop-fresh skin doesn’t begin and end with the makeup kit—Korean celebrities are extremely vigilant about following through on their skincare routine with a heightened focus on hydration. “Moisturising creams are a must for Korean celebrities, and you’ll generally find them favouring hydrating formulas from Chanel, Hera Skincare and Lagom,” she shares. The skincare-first approach filters into the base makeup routine that turns the spotlight on prepping the skin before makeup comes into play. “The order I’ve always followed for base makeup is to start with the moisturiser followed by the primer and sunscreen for sun protection through the day, before allowing foundation to touch the skin,” she explains. Among the recurring favourites in her makeup bag are the Avene TriXera Nutrition Nutri-Fluid Face & Body Lotion for giving dry skin a dewy sheen, ILLIYOON Ceramide Ato Concentrate Cream for adequate hydration and Lagom Cellus Deep Moisture Cream. “The past year of wearing masks has also taken its toll on skin that gets dry and sensitive easily, and Centella’s lineup has proved to be essential for calming and hydrating the skin,” she adds. These are the K-beauty Instagram accounts we can’t get enough of 7 common mistakes to avoid in your K-beauty routine Why slugging is the new K-beauty trend everyone is talking about By Hasina Jeelani By Prabal Sharma By Kejhal Kalra By Tish Weinstock By Tish Weinstock By Hasina Jeelani By Avanti Dalal See more stories Condé Nast India © 2023 Condé Nast. All rights reserved. Use of this website constitutes acceptance of our Terms of Service and Policy and Cookie Statement. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. ",
    "datetime": "2021-07-02T10:22:51.897Z",
    "url": "https://www.vogue.in/beauty/content/makeup-artist-shares-korean-drama-stars-k-pop-idols-secret-skincare-makeup-tips"
}