{
    "title": "A New 70-Store Korean Beauty Chain Is Here - Racked",
    "text": "This site uses cookies. Select \"Block all non-essential cookies\" to only allow cookies necessary to display content and enable core site features. Select \"Accept all cookies\" to also personalize your experience on the site with ads and partner content tailored to your interests, and to allow us to measure the effectiveness of our service. To learn more, review our Cookie Policy, Privacy Notice and Terms of Use. Filed under: Aritaum is going to make it a lot easier to get your hands on popular K-beauty products. Racked has affiliate partnerships, which do not influence editorial content, though we may earn commissions for products purchased via affiliate links. We also occasionally accept products for research and reviewing purposes. See our ethics policy here. Over the last two years, arguably the biggest news in the beauty world has been the international surge of interest in the Korean beauty market. It started with BB creams and progressed to a flurry of interest in the so-called ten step skincare regimen. But it's been difficult to fully tap into the market and all it has to offer via brick-and-mortar stores, because they're few and far between. That's about to change. Racked is no longer publishing. Thank you to everyone who read our work over the years. The archives will remain available here; for new stories, head over to Vox.com, where our staff is covering consumer culture for The Goods by Vox. You can also see what we’re up to by signing up here. A chain called Aritaum is opening 70 stores throughout the US and Canada. Aritaum is owned by Amore Pacific, which is basically the Esteé Lauder of Korea. It owns a variety of brands with using different ingredients  and having different aesthetics. Aritaum will carry only its parent company's brands, so imagine a store stocked with Clinique, La Mer, MAC, and Bobbi Brown (all Esteé brands) and you get the idea. Aritaum chains are ubiquitous in South Korea and there are currently now 14 of them in North America, with about 70 anticipated by the time the project is complete in a few years. Many of the Aritaum stores will be converted from pre-existing Amore stores, which are also owned by Amore Pacific and are stocked with Amore brands, though a different assortment than what will end up in the new Aritaum stores.  Heather Choi, the assistant manager of marketing for Amore Pacific, says of the conversion, \"We want a newer base, younger — we want to be fun!\" To that end, the number of available products increased from about 400 or 500 in Amore stores to over 900 in Aritaum. Many of the new products include color cosmetics, which the company hopes will encourage spontaneous drop-ins. \"Sales went up after we converted. [Aritaum is] more inviting and there's more makeup so people come and play,\" Choi, who gave me a tour of a newly converted store in Fort Lee, NJ, explains.  \"With Amore stores you go when you need something. Here it's a spontaneous visit.\" Many of the Aritaum stores are, or soon will be, located in predominantly Korean and Chinese neighborhoods where there is high brand recognition. (Chinese customers are the K-beauty industry's fastest growing base.) Many outposts, like the one in Fort Lee, are located in Asian grocery stores like Hannam stores and H-Mart. Aritaum recognizes that this could limit the amount of potential new customers who don't frequent those stores, and are opening several 500- to 1,000-square-foot freestanding stores in locations including Vancouver, Houston, and Brooklyn in the future. It also opened an Aritaum shop-in-shop at the end of last year at Bloomingdale's in Honolulu to experiment with that format. (Peach & Lily, the K-beauty e-commerce company, recently did something similar, opening a shop in Macy's in Queens.) Aritaum will also launch an American e-commerce site by the end of 2016. Choi says that at first the company was worried that a website would take away from foot traffic in stores, but with the success that American entrepreneur-founded K-beauty sites like Sokoglam, Glow Recipe, and Peach & Lily have had, it's clear a market is definitely there. It would also like to provide an alternative to unauthorized Amazon vendors selling the company's products online.  The existing Amore stores have been overhauled and rebranded to give them more of a Sephora-esque look, a change that was sorely needed. I've been to the old Amore store in NYC's Chinatown neighborhood, and to put it charitably, it's tired and grungy, with low stock levels and very few testers. The new Aritaum stores are bright, clean, and arranged with a very tempting makeup island in the center, surrounded by neatly stocked shelves dedicated to each brand, with plenty of testers available. All of the shelf tags and product labels are in English. When you purchase, the clerks are also generous with samples. Korean makeup has not caught on in the US as much as skincare has, but there are some gems to be found at Aritaum. Cushion compacts, which are essentially foundation or BB cream soaked sponges in a portable compact, are definitely worth checking out (more on this below), as are the various lip tints, whose colors do not budge once on your lips. The mascara is also great, particularly if you like formulas that focus on length and curling. There's also a big selection of tools and various pads and sponges. Here's the lowdown on all the brands that Aritaum carries, as well as some of the most popular products: Iope is known for being science-backed skincare with ingredients that mimic the way the skin functions naturally. The best selling products are the Bio Intensive Essence and the Super Vital Cream. Among K-beauty enthusiasts, though, Iope is best known for their stellar cushion compacts. It was the first company to launch the category, and you cannot find a brand in Korea that doesn't carry a cushion compact now. Several western beauty companies have also launched them in the last year. The cushion compacts come in four formulas: natural coverage, light coverage, intense coverage, and matte. Those last two were recently added for the benefit of western customers who prefer more coverage and a less dewy finish. One of the biggest knocks against Korean cushion compacts, though, is that they are only available in a limited shade range that isn't suitable for darker skin tones. This year, according to Choi, Iope cushions will be available in a wider variety of shades, including deep tones. Hanyul is \"very Korean. It's about Korean wisdom,\" according to Choi. The line uses a lot of Korean-grown traditional ingredients like rice, artemesia, mushrooms, and black beans. It's a nod to tradition with modern skincare formulations. The best selling product is the Rice Essential Skin Softener, which is like a toner.  The Optimizing Serum is also a light, fresh ideal daily option. Laneige's is Amore's \"trendiest brand,\" according to Choi, and a popular K-drama actress Song Hye Kyo is the face of the line. Target started stocking Laneige a few years ago, and it's one of my favorite K-beauty lines, but Aritaum stores will carry a lot more product options than Target does. The most popular product is the Water Sleeping Mask (they're sometimes called \"sleeping packs\" in Korea), a gel based leave-on product that is meant to help seal in whatever products you put on prior to that. I highly recommend it. The Brightening Sparkling line is also fun and features fizzing, foamy delights. Mamonde is geared towards teens and early 20-somethings. It's a flower-themed line, and boasts ingredients derived from all parts of the flower, not just the oil and petals. The rose water line is the best seller, and the toner contains 90% rose water. I love the hand creams, which come in pretty tubes. They are heavily scented, but they don't smell cloying the way, say, Bath and Body Works products can. Sulwhasoo is Amore's most luxurious line (read: expensive) and it's only carried in department stores in Korea. The brand has had a presence in the US for many years, carried at higher end department stores like Nordstrom and Neiman Marcus. Its star ingredient is Korean red ginseng, an ingredient commonly used in traditional herbal medicine. Amore grows its own and claims to process it so it doesn't lose its potency. The best seller is the excellent First Care Activating Serum, which is the opposite of a sleeping mask — you put it on first and it claims to help subsequent potions absorb better. The equivalent of Sephora's house brand line, Aritaum offers inexpensive makeup options, like $6 eyeliner pencils, and an assortment of sheet masks ranging from $1.50 to $4. You can see all the Aritaum locations here, including information about whether the store near you has been converted yet or is still an Amore. ",
    "datetime": "2016-04-25T11:30:02-04:00",
    "url": "https://www.racked.com/2016/4/25/11499180/aritaum-korean-beauty-chain"
}