{
    "title": "A New Dawn for Japanese Beauty Brands | BoF",
    "text": "Agenda-setting intelligence, analysis and advice for the global fashion community. TOKYO, Japan — Japan's beauty industry is enjoying a blush of renewed optimism having lost some of its shine to \"K-Beauty,\" which has gone hand-in-hand with Hallyu, the global rise in the popularity of South Korean culture. According to the Japanese Cosmetic Industry Association, “J-Beauty” exports grew 28.8 percent year-on-year to 267.6 billion yen (about $2.4 billion) in 2016, exceeding beauty imports for the first time, and are expected to surpass Korean beauty exports at 300 billion yen ($2.75 billion) in 2017. The K-Beauty boom was unlike any other. In the past five years alone, Korean beauty exports have grown from $1 billion in 2012 to a staggering $2.64 billion in 2017, according to the Korea Customs Service. But for all the snail secretions and starfish extracts fuelling a surge in South Korean cosmetics sales, change is afoot. And it is coming from Japan. “In recent years, Japanese beauty has been pushed out of the spotlight by the never-ending stream of new textures, formats and packaging concepts that have come from the hyperactive Korean beauty industry,” said Vivienne Rudd, Mintel’s director of global innovation and insight, beauty and personal care. “But we’re now starting to see [from Japan] a confident and expressive form of beauty that blends technical expertise and traditional ingredients.” Japanese consumers have long been obsessed with beauty. According to Euromonitor International, Japan has the highest per capita spending in skincare and cosmetics — and you only have to walk down the streets of Tokyo, Kyoto or Osaka to see how apparent this is. There’s a drugstore every two or three blocks, filled with a dizzying number of beauty bottles, tubs and tonics. But it's not only the spending power of its consumers that Japan’s beauty industry boasts; it also has a rich history of cosmetic innovation, from oil cleansers to cleansing milk. J-Beauty rituals focus on fewer steps with simple — but powerful — ingredients. Unlike K-Beauty, which focuses on novelty ingredients and whose skincare regime contains many steps, J-Beauty rituals focus on fewer steps with simple — but powerful — ingredients. “It’s not as flashy or outlandish as K-Beauty might have been, which is why it’s resonating with Western consumers, who are increasingly seeking efficacy with their products over the hype of marketing,” said Daniela Walker, insight editor at The Future Laboratory, a consultancy firm. Japanese brands are less frenetic in launching products compared to K-beauty, added Mintel’s Rudd. “They’re not under the same pressure to churn out new products at highly competitive price points, so their innovations can be more considered.” J-Beauty also leans more towards local aesthetics and principles, such as “kanso,” “shibui” and “seijaku” (simplicity, understated beauty and energised calm, respectively). “These are classic aesthetic principles that are often applied to design and interiors, such as Japanese zen gardens,” Walker explained, although it also carries on to other parts of Japanese life. Natural hot spring baths, known as onsen, are still numerous and highly popular across Japan. The Japanese diet is full of skin-boosting foods, like oily fish, seaweed and green tea. The principles, unsurprisingly, extend to beauty and skincare, where softness is a recurring theme. “Japanese women are known for their smooth, soft skin — it’s a look known as “mochi-hada,” named after the rice cake dessert, which is plump and soft,” said Walker. “There are lots of brands in Japan that focus on hydration and moisture, but these aren’t the typical moisturisers you normally see.” Kesho-sui, for example, is a popular facial lotion that is “like a toner, but less astringent and drying.” New Players, New Markets The presence of J-Beauty in Western beauty cupboards is not new. In fact, it stretches back almost five decades, when Japanese beauty giants like Shiseido and SK-II first launched in the US and UK. Japanese philosophies and practices are also inspiring cosmetics brands in the West. Tatcha, for example, was co-founded by Victoria Tsai in 2009 after she discovered aburatorigami — a traditional facial oil blotting paper based on the 200-year-old rituals of geishas — on a work trip. Today, Tatcha is stocked by retailers from Net-a-Porter to Sephora. “We’re one of the fastest growing privately owned be beauty companies in America… we had a growth rate of almost 11,000 percent between 2012 and 2014,” Tsai told BoF. But as the 2020 Olympics in Tokyo edge nearer and with increasingly more opportunities overseas, a new wave of Japanese beauty brands are setting their sights on global expansion. BoF spotlights six J-Beauty brands to watch. Shiro 'sake kasu' skin serum | Source: Shiro Shiro 'sake kasu' skin serum | Source: Shiro Shiro 'sake kasu' skin serum | Source: Shiro 1. Shiro Japanese beauty brand Shiro chose the UK as the destination for its first store outside of Japan (where it currently has 22 stores), opening a store on London’s Kings Road in 2016. “We wanted to establish our place within one of the largest cosmetics hubs in the world,” Shiro founder Hiroe Imai told BoF. The Hokkaido-based company now has three stores in London (the other two are at Bond Street and Covent Garden) as well as a UK e-commerce site. Visitors to Shiro’s store will find an extensive range of skincare and fragrances, comprised of natural ingredients that have been sourced and sampled from Japan for their rich cleansing properties. A frequently used ingredient in Shiro’s products is “gagome kombu,” a type of seaweed used as a cooking ingredient in Japan. “When gagome kombu is placed in water, it expands and thickens. Our serum, which uses this ingredient, helps keep skin hydrated for longer throughout the day,” Imai explained. The Kombu skin serum, one of their best-selling products, costs $95, while the Sake Kasu lotion is available for $62 (a slightly higher price point than its Western counterparts). In comparison, popular US skincare brand Kiehl’s daily serum costs about $53 and a hydrating body butter $39. Looking ahead, Imai plans to continue expanding internationally. “We are looking to open a store in Paris later this year,” she said. 2. Fairydrops Fairydrops mascara | Source: Fairydrops Fairydrops mascara | Source: Fairydrops Fairydrops mascara | Source: Fairydrops Created by one of Japan’s leading television personalities, makeup brand Fairydrops is one of the country’s most exciting beauty exports. Its origins trace back to when founder Aya Yasuda was working as an anchorwoman at a local TV station in Los Angeles. She felt that her eyes were not registering well on cameras, compared to her fellow Caucasian co-workers, whose long lashes gave intensity and brightness to their eyes. So Yusada set off and experimented with creating her own product. Today, Fairydrops’ “Scandal Queen” mascara, $24, is one of Japan’s best-selling mascaras. Its patented wand has curved bristles in three bobbles that mirror the shape of the eyelash and promises maximum lash separation, creating a desirable doll-like effect. “We are now selling the mascaras in 19 countries, reaching $10 million in sales this year,” Yasuda told BoF. “The quality and manufacturing of Japanese beauty brands, like Fairydrops, is superb and what makes Japanese products so interesting is their fusion of natural with high tech,” says Millie Kendall MBE, who co-founded BeautyMart with former British Vogue beauty director Anna-Marie Solowij and stocks J-Beauty brands like Fairydrops as well as Yu-Be, DHC and Japanese Exfoliating Towel. Looking ahead, Yasuda plans to expand further across the US as well as the UK, where online beauty retailers Cult Beauty and Beauty Bay currently sell the brand. “We used to be sold in Sephora, so my next step is to return to Sephora in the US and Europe, and also expand in Mexico and Brazil,” she said. 3. Decorté Decorté moisture Liposome serum | Source: Decorté Decorté moisture Liposome serum | Source: Decorté Decorté moisture Liposome serum | Source: Decorté Decorté is a skincare and colour cosmetics brand owned by Tokyo-based giant Kosé, with 2,000 stores across Japan. Designed to suit a more low-key Asian aesthetic, Decorté’s cosmetics come in subtle, neutral tones and range from $40 to $200. The $90 moisture Liposome serum — a lightweight, moisturising product that keeps the skin hydrated after cleansing — is one of the brand’s best-selling products. Decorté entered the US in spring of 2016, launching exclusively with Saks Fifth Avenue, and made its UK debut in October 2017 via department store Selfridges. “What makes Decorté unique is its use of rejuvenating onsen spring water, which is present in its entire skincare range, and has real efficacy and anti-aging properties,” said Melissa McGinnis, buying manager of beauty at Selfridges. “We were especially impressed by their advanced technology and key efficacious ingredient, V Fusion [an elixir developed by the company that aims to strengthen and regenerate skin],” added Kate Oldham, Saks' senior vice president, general merchandise manager of beauty, jewellery and home. According to Masanori Kobayashi, managing director of Decorté, the brand will debut key products at the London department store before its core Asian market — an unusual move for the Japanese brand. “At the moment [our biggest opportunity] is the global buying power of Chinese consumers,” he explained. “London receives huge attention from wealthy Chinese and Middle Eastern travellers. We hope to earn sales [in this market] as well as achieve more global awareness by being based in London.” Sensai 'Glowing Base' primer | Source: Sensai Sensai 'Glowing Base' primer | Source: Sensai Sensai 'Glowing Base' primer | Source: Sensai 4. Sensai Owned by Japanese cosmetics manufacturer Kanebo, Sensai has gained a cult following thanks to their signature ingredient, koishimaru silk, a luxury fibre that used to be reserved exclusively for use by Japan’s imperial family. “It is the most precious silk from Japan [and] offers a hyaluronic acid that is essential for youthful skin,” said Julien Noilou, Sensai’s head of retail for France and UK. The brand’s best-selling \"Glowing Base\" primer, $54, aims to hydrate the skin and keep make-up looking fresh. Some consumers say it also makes foundation much easier to glide on afterwards. Now, Sensai is eyeing the European market, having unveiled a new retail concept in Paris, at Le Bon Marché, in October 2017. Created by Gwenaël Nicolas, the acclaimed interior designer and president of Tokyo-based firm Curiosity, the new space is designed for consumers to learn about the brand and its key ingredients. \"We see the opportunity [at Le Bon Marché] as a chance to refresh the brand's perception in France, as well as internationally,\" said Noilou. 5. Three Three 'whisper gloss for eye' palette | Source: Three Three 'whisper gloss for eye' palette | Source: Three Three 'whisper gloss for eye' palette | Source: Three Japanese cosmetics brand Three was launched in 2009, but for the first few years, founder Yasushi Ishibashi struggled as an economic slowdown in the country at the time was leading to reduced consumer spending, and the 2011 Tōhoku earthquake and tsunami had a negative psychological impact on the market. It wasn’t until 2013 when business started to pick up again. Targeted at beauty-conscious working women in their late 20s and early 30s, Three is said to be flying off the shelves in department stores nationwide — gaining popularity through word-of-mouth, as well as endorsements by several actresses and models on social media including Instagram. One of the brand’s best-selling products is “whisper gloss for eye,” an eye make-up palette available in 16 shades, priced at 3,300 yen (about $30). Only a month after it was released in January 2016, the three-month inventory had fully sold out. The increasing popularity of Three has become a powerful profit booster for its holding company, Pola Orbis, which is a major player in the Japanese beauty and personal care industry. The group reported strong third-quarter results to the end of December 2017, with revenue rising 11.7 percent to 177.8 billion yen and operating profit up 66.8 percent to 30.5 billion yen. Ishibashi said the brand has received calls from department stores in London, Paris and the US, but is still seeking reliable business partners in these markets, before pushing ahead with global expansion. 6. Deica Deica fragrance diffuser | Source: Deica Deica fragrance diffuser | Source: Deica Deica fragrance diffuser | Source: Deica Founded in 2008, Deica is a Japanese beauty brand offering skincare as well as fragrances and candles. For Deica, it’s important that their smells aren’t too overpowering. In Japan, many women don’t wear perfume, as some consider it impolite to have a strong odour, whether it’s a natural scent or heavy perfume. (It’s viewed as an intrusion into other people’s sphere of privacy.) As a result, Japanese women are conscious of how much perfume they apply and on which occasion. “For Japanese brands [like Deica], it is about focusing on science and taking an understated approach to beauty. K-Beauty is fun and great for Instagram, but it is a bit twee,” said The Future Laboratory’s Walker. Indeed, Korea’s beauty industry, in comparison “is not only a generator of trends, it’s a magpie for trends. Japan, on the other hand, is regarded as the source of facial, skincare and hair care innovation,” added Mintel’s Rudd. “Korea’s beauty market moves so quickly, but there is little time for focus groups and internal studies, which slow down some of the larger brands in other countries. As a result, Korean brands get in early, and if their products work, great. If they don't, it’s onto the next launch.” Related Articles: [ Unmasking East Asia’s Beauty Ideals ] [ Japan’s Luxury Market Enters a New Era ] [ The 'Asian-ification' of Beauty ] © 2023 The Business of Fashion. All rights reserved. For more information read our Terms & Conditions As strategics like Unilever and L’Oréal divest from once-core lines, a more selective approach to M&A is underway. Welcome to Haul of Fame, a weekly roundup of the biggest beauty moments of the week, why they matter … and why some of them might not, even though they sure are gorgeous. The platform’s freewheeling approach to e-commerce has opened the floodgates for established labels, grey-market sellers and influencers to entice beauty shoppers to buy. But with little oversight over fake product listings, brands must negotiate how much control they want to give over to the app. Gwyneth Paltrow’s lifestyle label is introducing an accessibly priced beauty line at Target and Amazon. The essential daily round-up of fashion news, analysis, and breaking news alerts. Our newsletters may include 3rd-party advertising, by subscribing you agree to the Terms and Conditions & Privacy Policy.   ",
    "datetime": null,
    "url": "https://www.businessoffashion.com/articles/beauty/a-new-dawn-for-japanese-beauty-brands/"
}