{
    "title": "A Place for Dark Skin in K-Beauty - K-Pop Makeup Expert Miss Darcei",
    "text": "Donate SUPPORT TRUTH AND DEMOCRACY\n\r\nInvest in the next generation of journalists and artists Donate SUPPORT TRUTH AND DEMOCRACY\n\r\nInvest in the next generation of journalists and artists Oakland, CA — I love binge-watching makeup and skincare tutorials and reviews of all kinds. That's how I discovered Miss Darcei’s YouTube channel. Darcei has made a name for herself as a black woman reviewing Korean beauty products. K-Beauty is known for light makeup shades and promoting pale skin, which is why having a black woman critique Korean makeup brands is a pretty big deal. Darcei started her YouTube channel in 2010 by doing simple hair-care routine videos and drugstore makeup hauls. Since then, her channel and style have evolved.  Her unique take on how soft Korean-style makeup works for dark skin has helped build her base of over 127,000 subscribers. I had the chance to chat with Darcei on the importance of representation in makeup, what makes a K-beauty look so special and the lack of respect for content creators. This interview has been edited for clarity and length. EV: What drew you to reviewing Korean beauty? MD: I've been into Korean culture in general since I was a kid. I'm used to being like the only person who looks like me doing this stuff, so it wasn't really that different. It was kind of scary to start changing my videos and have no one really watching, but I liked it, so that's why I kept going. Now, there's a lot of brands from Korea that are starting to extend their shade range, so I'm trying those out. The sun is in my eye bruh ☀️ A post shared by  Darcei Amanda (@missdarcei) on Mar 20, 2019 at 12:51pm PDT EV: How would you explain a K-Beauty makeup look to someone who’s not familiar with it? MD: I'd say K-beauty is more about enhancing your natural beauty. The lipsticks are like 'your lips but better,' so they're nudes, pinks and sometimes reds. It’s a lot less pigmented, like the shadows and blushes, but that's on purpose so that it looks a lot more natural. EV: There are some people who see images of K-pop idols with light faces and tan necks, which leads them to associate K-beauty with whiteness. What would you say to someone who sees it this way? MD: I would say that's not necessarily the case. There are plenty of K-pop stars that do have darker complexions and embrace them, so it's really starting to expand. It's becoming an international thing now. As [K-pop artists] expand more into North America, it's going to be a lot more inclusive. EV:  Do you think that K-beauty pushes any certain beauty standards on anyone? MD: I think in the past they definitely did. But there are a lot of brands now that are acknowledging that there are mixed race people in Korea. There are people that are more tan and they're really expanding more to a different type of beauty. I personally think that we have the ability to change standards. When the consumers want to change the standards, then companies will as well and the standards overall will change. New video on this look is up on my channel I am looking grown as hell who do I think I am looking this fine I need to calm down A post shared by  Darcei Amanda (@missdarcei) on Nov 7, 2018 at 2:35pm PST EV: As a YouTuber, you get to interact with your subscribers, but you also have to deal with the hateful comments. How have you dealt with it? MD: It just comes with the territory. Everyone has to deal with it, so just take it with a grain of salt. Everyone has their own opinion and I have mine and not everyone's going to agree with me, so I have to respect other people's opinions. But sometimes you do get those comments that are just downright mean, and you just gotta ignore them. 🌹🌹🌹 A post shared by  Darcei Amanda (@missdarcei) on Feb 15, 2019 at 8:35am PST EV: James Charles recently spoke out about people not acknowleding the content creator’s worth. Do you agree with what he said? MD: He made a good point with that because I feel like YouTubers are seen as less-than. [Social media] is also seen as less of a business, so if you're trying to do normal business practices, then people get mad about it.  I find that kind of hypocritical, if you're okay with commercials on TV but you're not okay with commercials on YouTube. I feel like we deserve the same amount of respect and that we also work hard and deserve to get paid for what we do. ",
    "datetime": "2019-04-04T18:59:10+00:00",
    "url": "https://yr.media/identity/miss-darcei-k-beauty/"
}