{
    "title": "Acwell's Licorice pH Balancing Cleansing Toner Has a 2,000-Person Wait List  | Allure",
    "text": "By Devon Abelman Last month, popular online K-beauty retailer Soko Glam launched Acwell's Licorice pH Balancing Cleansing Toner, making it the first place available in the U.S. The Korean cleansing toner ended up becoming one of Soko Glam's top-selling products. Since it sold out soon after making its debut on the site, the Acwell Licorice pH Balancing Cleansing Toner has built up a 2,000-waitlist. After almost two months of patiently waiting for the cleansing toner to be re-stocked, it has finally returned to Soko Glam. I asked Charlotte Cho, Soko Glam's co-founder and an aesthetician, what all the hype is about to see if I need to be the 2,001st person on the wait list. Turns out, even she's obsessed with the stuff. She considers the Acwell Licorice pH Balancing Cleansing Toner to be one of her holy grail products and a \"honey skin\" essential. \"This Acwell Licorice Toner really deep cleanses my skin, hydrates, and tones,\" she tells Allure. \"My skin is more prepped than ever to accept hydrating essences and serums.\" Consider my interest piqued. What originally intrigued her about the cleansing toner was the first ingredient listed on its label: licorice water. (Am I the only one who thinks this sounds weirdly delicious?) Like food, skin-care product ingredients are listed in order of their concentrations. In this case, the Acwell Licorice pH Balancing Cleansing Toner contains 10 percent licorice water. \"Licorice is a well-studied ingredient that is natural and helps to brighten your overall complexion,\" Cho explains. And oh yeah, it's not made out of the same ingredient as the love-it-or-hate-it sweet. \"It's not licorice, the candy — but licorice, the root,\" she adds. \"By the way, the brand Acwell focuses on using fermented ingredients and traditional medicinal ingredients (called 'hanbang' in Korea) in their formulas,\" Cho adds. \"Licorice is a popular 'hanbang' ingredient.\" Licorice root often makes appearances in K-beauty products because it not only soothes redness with its anti-inflammatory benefits, it's also a natural brightener that can even out dark spots and acne scars. As David H. McDaniel, director for the Institute of Anti-Aging Research and an assistant professor of clinical dermatology and plastic surgery at Eastern Virginia Medical School, previously told Allure, licorice has long been thout to have a direct effect on the creation of melanin, which helps fade dsicoloration. \"Research shows that when applied to skin with conditions such as psoriasis and dermatitis, the extract may reduce inflammation, too,\" he added. This content can also be viewed on the site it originates from. Licorice aside, the Acwell Licorice pH Balancing Cleansing Toner also gets its name (and fame) from its low pH of 5.5. This makes it suitable for sensitive skin. Cho also says this helps gently prep the skin for the rest of your skin-care routine. You can follow it up with a more acidic toner and it won't strip your skin of oils and hydration. At the same time, it also cleanses skin. That brings us to the last two words: \"cleansing toner.\" If you haven't picked up on this already, it combines the power of both a cleansing water, which is a no-rinse product for washing away makeup, dirt and other grime, and a toner, which gives skin a quick boost of hydration and helps slough away dead cells. Cho recommends using it after washing your face and sweeping it across your skin with a cotton pad. This will help pick up any leftover impurities on your skin. \"No joke, after double cleansing and taking a shower, I still had a fair amount of residue on my cotton pad,\" she admits. By Aliza Kelly By Gabi Thorne By Gabi Thorne Convinced you need to try it ASAP? You can shop the Acwell Licorice pH Balancing Cleansing Toner now for $18 on sokoglam.com. Get ready for supple, hydrated skin like your favorite K-pop star. Related stories: Now, learn about K-beauty products that will transform your skin: Follow Devon Abelman on Twitter and Instagram. By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Nicola Dall'Asen By Sarah Han By Devon Abelman By Kara McGrath More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2017-12-13T21:05:11.067Z",
    "url": "https://www.allure.com/story/acwell-licorice-ph-balancing-cleansing-toner-wait-list"
}