{
    "title": "ADDING MULTIMEDIA Clean Beauty Meets K-Beauty: Feminine Care Brand Rael Expands Into Wellness Skincare Products | Business Wire",
    "text": "Made for Women, by Women, Rael’s New Vegan Beauty Line Balances Changing Skin All Month Long Made With Potent Antioxidants Like Fullerene, Which Is 172 Times Stronger Than Vitamin C! Rael Beauty wellness skincare products  (Photo: Business Wire) Rael Beauty wellness skincare products  (Photo: Business Wire) Rael Beauty Skin Care Collection  (Photo: Business Wire) Rael Beauty Skin Care Collection (Photo: Business Wire)  LOS ANGELES--(BUSINESS WIRE)--Women today are becoming more and more stringent about what products they put in and on their bodies, especially when it comes to feminine care and skincare. They do research, wanting to find the best brand that not only works, but is a company with a mission they can get behind.  Fast-growing, female-founded Rael has been at the forefront of female-focused self-care products since its launch in 2017 with a line of certified-organic feminine care products. Now, in an effort to provide a 360° holistic solution for the modern woman, the company has launched a brand-new line of advanced, vegan skincare products under its Rael Beauty brand. Available now, the Rael Beauty Skin Care Collection includes a cleansing water, cleanser, toner, moisturizer, spot corrector, mist, and previously released serum and hyaluronic acid concentrate. Inspired by K-Beauty and developed with feminine care expertise, the line is formulated to balance skin’s fluctuating needs throughout the month, and is made with potent, naturally derived and clean ingredients. “Wellness is a way of life – not a trend,” said Yanghee Paik, CEO and co-founder of Rael. “This skincare collection is a natural progression in our mission to offer women holistic, innovative, natural and effective solutions for their monthly cycle. In order to create a daily skincare routine that is both simple and effective, my two co-founders and I looked to our Korean roots, leveraging the latest K-Beauty technology, and combining it with clean, vegan ingredients.” The new Rael Beauty Skin Care Collection regimen is as follows: “Reset Button” Calming Cica Cleansing Water: This cleansing water is effective in removing stubborn and long-wear makeup, while also being rich in vitamins to leave skin looking supple and radiant. $24.00 “Daily Detox” Oil to Foam Gentle Cleanser: This gentle cleanser has Olive Oil to purify and hydrate skin, as well as Chinaberry extract for antioxidants, protecting skin from UV-ray damage and premature signs of aging. $28.00 “Daily Zen” Balancing Toner: This daily toner includes antioxidants that help to neutralize free radicals and protect skin from premature signs of aging and UV-ray damage. It also contains Vitamin B5, naturally derived from Panthenol, to hydrate and soothe. $28.00 “Good Chemistry” Advanced Antioxidant Serum: A highly concentrated potent serum with Fullerene, an antioxidant 172 times stronger than Vitamin C, H30 Hyaluronic Acid Complex, and Green Tea Leaf Extract to deeply hydrate and enhance skin’s natural radiance, revealing fresher, healthier-looking skin. $38.00 (Launched November 2019) “Moisture Melt Snowball” Hyaluronic Acid Concentrate: This freeze-dried Hyaluronic Acid concentrate instantly melts when mixed with serum, offering nutrient-rich moisture that lasts up to 24 hours. $24.00 (Launched November 2019) “Daily Restoration” Nourishing Gel Cream: This final step in the skincare regimen uses Fullerene and H30 Hyaluronic Acid Complex, blended with Sunflower Seed Oil as a key ingredient which helps lock in moisture to strengthen the skin’s barrier for a smooth, dewy complexion, without feeling heavy or greasy. $38.00 “Lighten Up” Cica Spot Corrector: This all-natural spot-fading treatment with White Willow Bark helps heal damaged skin and dark spots, while also brightening the skin and fighting premature aging. $20.00 “Calm + Collected” Creamy Moisture Mist: While most mists end up making skin feel more dry after use, Rael’s ultra-creamy moisture mist uses Bamboo Grass Extract to promote brighter and clearer skin, and provides an instant surge of hydration to keep skin looking dewy and feeling silky soft throughout the day. $24.00 Additional products currently available in the Real Beauty line include its best-selling Bamboo Fiber Facial Sheet Masks that are specially formulated for each of the four weeks of a woman’s menstrual cycle, and best-selling Miracle Patch Invisible Spot Dots and Microneedle Technology Acne Healing Patches, all of which launched late last year. “We initially launched the facial masks and patches as simple ‘period skin’ solutions for women,” added Paik. “Once we saw how high the demand was for these kinds of solutions, however, we realized that we needed to create a full skincare line that is more proactive than reactive – balancing the skin’s fluctuating needs all month long.” In addition to its current availability in the U.S., the Rael Beauty collection will soon be launching in South Korea. In an effort to aid in the brand’s global expansion plans, Unilever Group’s venture capital and private equity arm, Unilever Ventures, came on board as an investor in 2019. This investment came on the heels of the brand’s Series A funding round in late 2018, where Rael raised $17.5 million, the largest Series A raise for any feminine care brand. The full Rael Beauty line is available now on GetRael.com. Social Tags:\n#RaelBeauty\n@Get_Rael About Rael Rael is made for women, by women. Founded by Aness An, Binna Won and Yanghee Paik in 2017, Rael empowers women to make healthier choices for their bodies through its safe and high-performance personal care products accessible to women around the world. Thoughtfully designed with natural and sustainable materials, Rael’s products are manufactured with cutting-edge technology to deliver the latest innovations in feminine and beauty care, providing a 360° holistic solution for the modern woman. Rael feminine care products can be found at GetRael.com, as well as Target and Amazon, and the Rael Beauty line is available now on GetRael.com. Rael is backed by Unilever Ventures, BAM Ventures, PGVC, and Softbank Ventures Asia, among others.  Ashley Patterson\nScenario PR\nAshley.Patterson@scenariopr.com \n424-303-3905 Feminine care brand Rael expands into wellness skincare products. Ashley Patterson\nScenario PR\nAshley.Patterson@scenariopr.com \n424-303-3905 ",
    "datetime": null,
    "url": "https://www.businesswire.com/news/home/20200218005295/en/ADDING-MULTIMEDIA-Clean-Beauty-Meets-K-Beauty-Feminine-Care-Brand-Rael-Expands-Into-Wellness-Skincare-Products"
}