{
    "title": "Agafar refines strategic focus to become an all-round global beauty house | South China Morning Post",
    "text": "Country Business Reports interviews and articles by Discovery Reports South Korea has emerged as a global epicentre for niche beauty products, cosmetics and skincare innovations, driven by the passionate enthusiasm surrounding K-beauty. Sheet masks, BB (blemish balm) creams and cushion foundations from the country are among today’s must-have beauty products, with a growing cult fan base across the globe. Making K-beauty more accessible is Seoul-based medical skincare specialist Agafar, which is renowned for its innovative aesthetic products and medical devices that are developed based on skin science. Drawing on more than 20 years of expertise and a team of highly qualified dermatologists and aesthetic experts, Agafar is transforming itself into a preferred global beauty brand. Apart from its venture into cosmeceuticals, Agafar is actively expanding its medical spa and aesthetic franchise business in mainland China, Hong Kong, Thailand, the Philippines, Vietnam, Singapore, Indonesia and Russia. “Agafar is a Spanish word that means to grasp or hold on, and our name stands for our commitment to grasp and hold on to the hearts and minds of consumers by having a hand in all the leading fields in the beauty industry,” says CEO Choi Chun-ki. “Our focus is not on becoming an expert in a single product or service, but we’re working on establishing Agafar as an all-round beauty brand that consumers can trust.” Global skin professionals, including dermatologists and cosmetic surgeons, have come to rely on Agafar’s beauty machines, including the flagship, multifunctional Agafar Transfer device. Agafar Transfer stands out in the current line-up of machines on the market because of its capability to support a variety of skincare programmes. Another innovative offering from Agafar is the Retime LED light therapy device, which has four kinds of wavelengths to promote healthy and smooth skin. This aesthetic device stimulates wound healing, tissue growth and collagen production. It also accelerates the repair and replenishment of damaged skin cells. “In the beauty industry, trends are changing so rapidly, and so, time is of the essence,” Choi says. “Our strategy is to look for the product or technology that we see market potential in, and then find a partner that can best deliver it. This way, we’ll be hurdling time and funding constraints if we were to pursue the project alone. Our focus is on getting new products into the market as fast as we can.” Since diversifying into the medical spa business more than 10 years ago, Agafar’s network of medical spas and clinics has grown to include nine branches in South Korea, each providing all the mainstay skin treatments, but specialising in one beauty procedure. Such a distinct approach has allowed Agafar to attract loyal clients who are key to the company’s word-of-mouth marketing strategy. Agafar also supplies its premium aesthetic devices and solutions to 25 medical spas in China and has similar supply agreements in place with beauty clinics in Russia. The company develops skincare therapy programmes based on its equipment and beauty solutions that its partner clinics can adopt and offer to their clients. Agafar also provides the essential training and equipment support. In line with its growth strategy in Asia, Agafar is slated to open a branch in Indonesia this year. The company is also finalising a number of deals to enter the markets of Thailand, Vietnam, Hong Kong and the Philippines. “We welcome opportunities to team up with more industry specialists to raise our brand value and stay ahead of the ever-changing beauty industry,” Choi says. “We’re looking for partners who share our vision of building an all-round beauty house and would want to grow in the long term together.” ",
    "datetime": "2021-04-30T13:00:14+08:00",
    "url": "https://www.scmp.com/country-reports/country-reports/topics/south-korea-business-report-2021/article/3130573/agafar"
}