{
    "title": "Ailee Nabs First Solo No. 1 on K-Pop Hot 100 – Billboard",
    "text": "The Jersey-bred K-pop singer lands her first solo K-pop No. 1 as INFINITE, Beast, Apink and Crayon Pop make big moves. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin 2013 has been good to female soloist Ailee, who nabs her first solo No. 1 on the K-Pop Hot 100 this week. “U&I,” her new single with serious Christina Aguilera vibes, takes the top spot, rising from No. 3 last week. The jazz-pop track follows her earlier K-Pop No. 1, when her BAE CHI GI collaboration, “Shower of Tears,” ruled in the winter. Furthermore, the New Jersey native performed during Grammy Week in February when she was honored at Mnet America’s inaugural pre-Grammy party. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t07/26/2013\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tExplore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news Meanwhile, the official music video for “U&I” has over half a million views. A good year indeed.   Boy band INFINITE nabs their highest-charting K-Pop Hot 100 entry as “Destiny” rises to No. 3 from No. 43. “Destiny,” produced by duo Rphabet, features a strong electronic beat while pleading with an ex-lover to come back because she is his “destiny.” The album, also titled “Destiny,” includes three other songs currently on the charts with “Inception” (at No. 53), “I’m Going To You” (No. 63) and “Mother” (No. 84). Watch the boys’ elaborate three-song comeback performance with an intro, “Inception” and “Destiny” below:  BEAST makes the chart’s highest debut at No. 5 this week with their hotly anticipated “Shadow” single, lifted off their second LP, “Hard to Love, How to Love.” “Shadow” expresses a man’s grief at disappearing away from his ex-girlfriend like a “shadow.” The album, released on July 19, broke the group’s lengthy hiatus and showcases the many talents of the band as they participated in producing and directing their music videos plus the styling and brainstorming for their latest concept look. The album was entirely composed and written by member Yong Jun Hyung and Kim Tae Joo (who also produced Yang Yoseob’s No. 3-peaking solo single “Caffeine,” and BEAST’s soundtrack for drama “IRIS 2,” titled “Black Paradise.”)  The boys held a guerilla event, named “Come Together Beauty,” to show their appreciation for fans “B2TYs” who have waited such a long time for this release. The first performance of “Shadow,” was presented at a solo concert, “2013 Beautiful Show,” held on July 20-21 in Seoul. The two-day affair drew 24,000 fans. Watch the boys nail their comeback performance of “Shadow” on music program “M COUNTDOWN” along with the new album’s “Intro” track.  In other chart news, Apink’s “NoNoNo” continues to rise on the chart hitting No. 2 in its third week. A No. 1 hit could be in reach for the adorable sextet if 4Minute’s “What’s Your Name?” can be used as an example. The latter song hit the top spot on its fourth week on the chart. Check out a new live performance from “M COUNTDOWN” below:  Also of note, rookie girl group Crayon Pop have landed themselves a sleeper hit with their “Bar Bar Bar” single. The track — which had its music video premiered at the end of June — gives Crayon Pop not only their first K-Pop Hot 100 entry (after three singles failed to make the chart) but their first Top 20 hit. It rockets to No. 19, up from No. 61. Watch the quirky visual featuring the cute quintet jumping around in bicycle helmets and track suits.  Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2013-07-27T00:50:00+00:00",
    "url": "https://www.billboard.com/music/music-news/ailee-nabs-first-solo-no-1-on-k-pop-hot-100-4761631/"
}