{
    "title": "All you need to know about K-Beauty's latest trend - hangbang beauty",
    "text": "When it comes to skincare, most of us have one common goal - to get flawless and radiant skin. And, to achieve this ultimate goal, we try different products and follow different beauty trends. Taking over the beauty industry for the past few years are the Korean beauty trends. Every now and then, we see a new K-beauty trend taking over the industry and most of them become highly popular. Hangbang beauty is the latest K-beauty trend that is going viral on social media. Wondering what is it all about? Sit back and relax as we are here to give you the deets. While some K-beauty trends are very fancy, some are pretty weird but many of these beauty trends also take us back to the roots and promote clean beauty. Hangbang beauty is all about ancient medicinal ingredients in beauty products. In the Korean language, such traditional ingredients are referred to as \"hanbang,\" and there are several skincare products that put them in the spotlight. Black soybean, lotus root, tundra chaga mushroom, ginseng water, muskroot, and aloe are some of the ancient medicinal ingredients used in K-beauty products.  Apart from getting the products that have such ingredients in them, you can also follow the concept of hangbang by using the ingredients present in your kitchen. In the Indian household, there are many ingredients like turmeric, cardamom, rose water, cinnamon, and more that have amazing medicinal values and are also very good for the skin. By introducing the concept of hangbang beauty in your skincare regime, you can get yourself products that have such ingredients in them. If not, you can also take the DIY route and make face masks and scrubs at home by using these ingredients. What do you think about the trend of hangbang beauty? Let us know by tweeting to us @TimesNow. ",
    "datetime": null,
    "url": "https://www.timesnownews.com/life-style/article/all-you-need-to-know-about-k-beautys-latest-trend-hangbang-beauty/848009"
}