{
    "title": "Amanda Seyfried puts on a stylish show in South Korea while Justin Long the supportive boyfriend waits in the wings | Daily Mail Online",
    "text": "By Daily Mail Reporter Published:  19:17 BST, 4 December 2013   |  Updated:  20:18 BST, 4 December 2013 18 View  comments She's known as a screen siren, but Amanda Seyfried can also add 'muse' to her list of titles. On Wednesday, Amanda Seyfried attended the Muse party in Seoul, an event that promoted cosmetic brand Clé de Peau Beaute. As the official muse for the make-up brand, Seyfriend was the guest of honor at the shindig and held a press conference to welcome the media and fans. Make-up muse:  Amanda Seyfried looks elated as she attends the Cle de Peau Beaute party on Dec. 4, 2013 in Seoul, South Korea Be our guest: As the guest of honor,  Amanda Seyfried was given a a South Korean Traditional Hanbok costume during the Cle de peau Beaute Muse party Red hot: Seyfried's promotional tour of the South Korean beauty brand included stops at local stores in this red-hot number   During the conference, the 28-year-old actress offered tips and tricks when it comes to her own make-up secrets.  After the conference, Seyfried was the guest of honor at the official Muse party, a lavish affair featured a multi-course meal and hundred of guests in honor of the beauty brand. The actress stood out at the event as her light pink strapless gown with a sweetheart neckline and side-swept hairstyle made the Mean Girls star look like a classic Hollywood starlet. Giving face: Seyfried has been the official muse of Cle de Peau Beaute products since 2010   The Mamma Mia! star paired a diamond hanging earrings and a matching bracelet with the dress. Her makeup consisted of a bright red lip and dark lashes, with added to the vintage Tinseltown look. Show wore minimal powder and blush, allowing her flawless skin to shine though. During the event, Seyfried was given a Hanbok, a  traditional Korean formal dress. The outfit consisted of a jeogori, a blouse, and chima, the high-waisted wrap-around skirt. Quick change: Seyfried changes into the traditional Korean dress during her promotional tour Seyfried's Hanbok was a shade of bright pink, with the chima adorned in a water-print pattern of purple trees and cranes. The jeogori matched the skirt, but featured a purple hem of satin.  The actress has been the face of Clé de Peau Beaute products since 2010. As part of her duties as product muse, the actress is scheduled to spent three days in South Korea to promote the beauty products and attend events. Beaming: Seyfried was smiling from ear-to-ear during her tour of the cosmetic company  The company she keeps: Boyfriend Justin Long tagged along his leading lady while she was on the promotional tour of South Korea  Following the Muse party, Seyfried and boyfriend Justin Long paid a visit to local Cle de Peau Beaute  cosmetic stores. The actress wore a shimmery black and red dress with a pleated skirt and a tank-style top. The petite actress looked darling in the retro number, which she paired with a bright red lip and black platform shoes. Seyfried recently wrapped on film A Million Ways to Die in the West, a comedy Western starring Charlize Theron, Liam Neeson and Neil Patrick Harris. The Seth MacFarlane-directed feature is set for a May 30, 2014, release. The actress is currently working with Ben Stiller and Noami Watts on the film While We're Young. Production is underway in New York. Taking her duties seriously: Seyfried made the rounds from events to local stores as the official muse of Cle de Peau Beaute products Meet and greet: Seyfriend met her international fanbase while on the promotional tour   Share what you think The comments below have been moderated in advance. The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. We are no longer accepting comments on this article. Published by Associated Newspapers Ltd Part of the Daily Mail, The Mail on Sunday & Metro Media Group ",
    "datetime": "2013-12-04T19:17:09+0000",
    "url": "https://www.dailymail.co.uk/tvshowbiz/article-2518253/Amanda-Seyfried-puts-stylish-South-Korea-Justin-Long-supportive-boyfriend-waits-wings.html"
}