{
    "title": "Amazon launches in-house beauty brand with sustainable packaging - Premium Beauty News",
    "text": "Amazon has officially entered the beauty arena with the launch of its own skincare label. The online retail giant has unveiled the in-house brand ‘Belei’, a 12-piece line of skincare products that are free of parabens, phthalates, sulfates and fragrance. The line, which is now available on the Amazon website, has been designed to tackle a range of skin issues, such as acne, dullness and dehydration. Amazon’s new in-house brand ‘Belei’ features 12-piece skincare products that are free of parabens, phthalates, sulfates and fragrance - Photo : © Belei by Amazon \"Our goal is to help customers spend less time and money searching for the right skincare solutions,\" said Kara Trousdale, Head of Beauty for Private Brands on Amazon.com, in a statement. \"We took a simple, no-nonsense approach when creating Belei, developing products with ingredients that are both proven to deliver results and also offer customers great value for the quality.\" The collection spans everything from oil-free micellar wipes for easy makeup removal to a revitalizing clay charcoal mask to clean the complexion. There is also a blemish control treatment, a tri-peptide blend eye cream and several moisturizers and serums, including a retinol moisturizer, a vitamin C moisturizer and a Hyaluronic Acid serum. Everything in the series comes presented in bottles made of post-consumer recycled resin and 100% recyclable carton packaging, and products are priced from US$9 to US$40. Everything in the series comes presented in bottles made of post-consumer recycled resin and 100% recyclable carton packaging - Photo : © Belei by Amazon Amazon is the latest of several major brands to jump on the skincare bandwagon. K-beauty skincare brand Glow Recipe recently unveiled ‘Sweet Chef,’ a sister skincare line focusing on vitamin-loaded, vegetable-based products that come packaged as serum shots and sheet masks, while the cult makeup label Too Faced unveiled its skincare debut earlier this year, based on its existing ‘Hangover’ cosmetics line. ColourPop also has a new sister skincare brand in the form of ‘Fourth Ray Beauty’ via its parent company Seed Beauty, and the cult label Glossier announced this week that it had successfully raised US$100 million in Series D funding to focus on expansion. The annual premium and luxury packaging trade show broke its attendance record for its 2023 edition, which was held... The expression “Beauty Tech & Skincare” now marks the entry of tech into the beauty sector. Several major brands offer to decode the... The quest for youth has existed for centuries, despite the inevitable effects of time on the body. Research shows that skin aging in... The quest for “in-and-out” beauty is gradually gaining ground in Europe, North America, and Brazil. This form of holistic beauty is meant... © 2023 Premium Beauty Media ",
    "datetime": null,
    "url": "https://www.premiumbeautynews.com/en/amazon-launches-in-house-beauty,14810"
}