{
    "title": "America is undergoing a K-beauty frenzy – The Korea Times",
    "text": "(Screenshot of Sephora.com) By Park Ji-hye The American makeup market is undergoing a K-beauty frenzy. Influenced by increasing word-of-mouth on quality and affordable pricing, as well as by exposure via K-pop and K-drama stars, South Korea has seen about $69 million in exports of Korean beauty products over the last year, according to KOTRA. Major beauty retailers like Sephora are on board the trend: its current campaign is K-beauty-themed, with offerings promising the latest “coveted dewy look” from Korea. After the introduction of the popular Korean makeup brand Dr.Jart+ to the retailer in 2011, others — Amorepacific, Belif, Chosungah22, Touchinsol, Erborian, Tonymoly — followed. Higher-price brands like Amorepacific are now available in department stores; Laneige in Target; and others like Skin Food, The Face Shop and Nature Republic in pockets all around the country. Online retailers, too, are seeing value in K-beauty. Amazon launched a dedicated Korean beauty section earlier this year. Others, like Soko Glam, Peach and Lily and Glow Recipe, are Korean-owned online shops that offer a more intimate, thoroughly reviewed K-beauty experience. Pingback: Master the mantle: Take your fireplace from boring to brilliant | Fashion Buddies Son Heung-min has found the back of the net for... Samsung C&T Corp. on Wednesday reported better-than-expected quarterly earnings behind... U.S. Secretary of State Antony Blinken warned Tuesday that America... South Korean President Yoon Suk Yeol and Qatari Emir Sheikh... A 3.4 magnitude earthquake rumbled through the central city of... K-pop idol G-Dragon was booked for alleged drug use, police... K-pop group The Boyz will return with a new album... U.S. Secretary of State Antony Blinken warned Tuesday that... K-pop boy group Tomorrow X Together made it into... Attrakt, the label behind rising K-pop rookie group Fifty... © 2013-2019 The Korea Times ",
    "datetime": null,
    "url": "http://www.koreatimesus.com/america-is-undergoing-a-k-beauty-frenzy/"
}