{
    "title": "Amipure, the Ultimately Clean K-Beauty Skin Care Brand Launches in the U.S. | Business Wire",
    "text": "Amipure's best products - Like a Nopoo Shampoo, Meringue Bubble Cleanser and Amino Effect Mask (Photo: Business Wire) Amipure's best products - Like a Nopoo Shampoo, Meringue Bubble Cleanser and Amino Effect Mask (Photo: Business Wire)  SEOUL, South Korea--(BUSINESS WIRE)--Amipure, a K-beauty skin care brand known for its “clean” ingredients has officially launched sales in North America by introducing its products on Amazon. The South Korean retailer of beauty products with its unique skin care line composed of skin toner, liquid moisturizer, and various essences created a buzz upon its release especially because of its innovative know-how of mixing amino acids and polysaccharides components.  The South Korean government granted Amipure a special patent, recognizing this technology as Amipure’s core achievement, further pushing Amipure to produce groundbreaking skin care products that had seemed impossible in the past. According to Amipure’s founder Peter Cho, our skin has innate power to improve itself. “Amipure’s philosophy is to reduce the use of harmful ingredients in cosmetics and put only what is absolutely necessary to make skin healthy,” says Cho who now focuses only on Amipure’s product development. As a result, none of Amipure’s products contain oil, artificial preservatives, superficial coloring, alcohol, added fragrances, and petroleum-based surfactants. Every single ingredient used to produce Amipure’s entire line of products has been recognized as “green” by the Environmental Working Group (EWG). A green rating on EWG notes “low hazard” regarding ingredients used to produce various skin care products. Now available in the North American market via Amazon are three of Amipure’s best selling products. The Meringue Bubble Cleanser (16.9 fl oz, retailing at $31.50) is a mild, scent-free daily cleanser which doubles as a makeup remover. Despite being able to remove even the heaviest of makeup, the Meringue Bubble Cleanser is ultimately mild, hypoallergenic and removed of all synthetic chemicals. Next on Amipure’s Amazon lineup is a sulfate-free, deep scalp cleansing “Like a Nopoo” Shampoo minus any chemical foaming agents that strip away natural scalp oil. Lastly, Amipure’s Amino Effect Mask (22ml pack of 10, retailing at $50.30) is made of premium quality cotton which includes amino and hyaluronic acids that deeply hydrate the driest of skin. During Amazon’s Black Friday and Cyber Monday’s sale period which initiates on November 28 and ends on December 2, the Meringue Bubble Cleanser will be sold at 30% off while Amipure’s Shampoo and Mask will be discounted by 40%. Learn more at www.amipure-en.com; follow updates on Instagram: @amipure_en or on Facebook.  Bonnie Leung\nAmipure Co., Ltd.\nbonnie@amipure.com Bonnie Leung\nAmipure Co., Ltd.\nbonnie@amipure.com ",
    "datetime": null,
    "url": "https://www.businesswire.com/news/home/20191125005068/en/Amipure-the-Ultimately-Clean-K-Beauty-Skin-Care-Brand-Launches-in-the-U.S."
}