{
    "title": "Amorepacific partners with Eastman on sustainable packaging solutions for Laneige \r\n",
    "text": "The K-beauty favourite's Water Sleeping Mask will use the US-based company's Cristal Renew packaging, featuring up to 50% recycled content A post shared by LANEIGE U.S. (@laneige_us) K-beauty giant Amorepacific has teamed up with packaging provider Eastman to implement more sustainable packaging solutions and reduce plastic waste across its roster of beauty brands. From this month, skin care brand Laneige will be the first to introduce packaging made from Eastman's Cristal Renew polyester material, which includes up to 50% recycled content, for its Water Sleeping Mask. Boasting a probiotics-derived complex to improve skin clarity and fortify its moisture barrier, the consumer favourite is now housed in a jar made from Eastman's molecular recycling technology, which breaks down hard-to-recycle plastic waste to create new materials, diverting it from landfills while resulting in up to 50% lower greenhouse gas emissions than traditional manufacturing, according to the company. The result is said to be crystal-clear packaging that lives up to the brand's premium beauty aesthetic while also being in line with the beauty owner's sustainability commitments, announced earlier this summer, which aim to see Amorepacific achieve carbon neutrality and send zero waste to landfill across all its facilities globally, as well as using 100% reusable, recyclable or compostable plastic packaging materials by 2030. Jung Changwook, SVP of Amorepacific's development and purchasing division, commented: \"Cristal Renew and Eastman's innovative molecular recycling technologies will play a crucial role in helping us achieve the commitments laid out in our '2030 A MORE Beautiful Promise,' without sacrificing the premier beauty experience customers expect from Amorepacific.” The Laneige Water Sleeping Mask featuring Cristal Renew is available now at Sephora in the US and Canada as well as on the brand's website. Amorepacific also plans to roll out further sustainable packaging solutions from Eastman across its line-up of beauty brands, which includes the likes of Sulwhasoo, Mamonde, Innisfree and Etude. Through digital, live and print products, Cosmetics Business informs and inspires business leaders and decision-makers around the world. With a digital-first strategy, the Group’s Editors write breaking news, product releases, technical papers, innovation features, trend reports and live content agendas covering the entire industry from ingredients and packaging to regulation, retail and marketing. ",
    "datetime": null,
    "url": "https://www.cosmeticsbusiness.com/amorepacific-partners-with-eastman-on-sustainable-packaging-solutions-for-laneige--180953"
}