{
    "title": "AmorePacific carries on investments to develop its own retail network in North America - Premium Beauty News",
    "text": "Leading South Korean cosmetics maker AmorePacific plan to expand its Aritaum retail network in North America. With over 70 locations throughout the United States and Canada, the retail division of the South Korean cosmetics giant already offers a large collection of premium Korean beauty products to North American customers, including skincare products from brands such as IOPE, Laneige, Mamonde, Hanyul and Sulwhasoo and a wide selection of makeup, bath and body and hair care items.  AmorePacific announces more Aritaum opening throughout 2016. There are over 70 ARITAUM locations across the United States and Canada with more opening throughout 2016. Photo credit: © 2016 ARITAUM Aritaum (pronounced \"ar-ree-ta-um\") comes from the words for \"beauty\" and \"place\" in Korean.  “Korean skincare is one of the hottest trends in beauty right now,” highlights AmorePacific. “In recent years the popularity of Korean skincare has increased exponentially in North America.” Exports of South Korean cosmetics have continued to grow rapidly in 2015, reaching US$ 2.75 billion, an increase of 53.6 per cent over the previous year. China remains the first destination country but K-beauty is becoming increasingly popular outside Asia, in particular in the United States. Within this context, AmorePacific’s revenue increased by 21% to US $4.5 billion in 2015 and is projected to exceed that figure in 2016. The annual premium and luxury packaging trade show broke its attendance record for its 2023 edition, which was held... The expression “Beauty Tech & Skincare” now marks the entry of tech into the beauty sector. Several major brands offer to decode the... The quest for youth has existed for centuries, despite the inevitable effects of time on the body. Research shows that skin aging in... The quest for “in-and-out” beauty is gradually gaining ground in Europe, North America, and Brazil. This form of holistic beauty is meant... © 2023 Premium Beauty Media ",
    "datetime": null,
    "url": "https://www.premiumbeautynews.com/en/amorepacific-carries-on,9516"
}