{
    "title": "AmorePacific builds a K-beauty empire fuelled by technology and innovation | Options, The Edge",
    "text": "AmorePacific's cushion compact was an immediate international hit, quickly becoming a staple in women’s beauty bags (Photo: AmorePacific) The art of making lanterns, which are rooted in practicality and ritual, is slowly declining into souvenir-shop banality. But Shanghai-based architecture firm Neri&Hu has incorporated these guiding lights into the design of Sulwhasoo’s flagship store in Seoul’s Gangnam district. A lattice of brass rods, mimicking the bamboo sticks that frame a lantern, extends throughout the interior of the five-storey building. Custom light fixtures play the role of the portable lamp, gently illuminating the path for customers who navigate a series of voids and openings within the space. The building creates an evolving experience across several floors, from a section that displays Sulwhasoo’s signature products to a level dedicated to the brand’s heritage. The colour palette becomes lighter as you ascend from the dark basement floor — where the more luxurious spa treatments based on Korean medicinal herbs take place — to the bright roof terrace that overlooks Dosan Park, named after independence activist and public reformer Ahn Changho. Hoping to vivify my dull skin before I step into the crowd of beauty-obsessed South Koreans, I opt for Sulwhasoo’s concentrated ginseng renewing facial treatment, which promises the double boon of inner and outer glow. What I got was much more — it was a comprehensive body reboot. K-beauty, an umbrella term that describes skincare regimes from South Korea, is a concept that is as futuristic as it is ancient. Prestige brands like Sulwhasoo, one of the 33 owned by cosmetics conglomerate AmorePacific, is an exemplary product of the country’s much-lauded heritage-meets-technology ethos. To project elegance and youthfulness, cosmetics companies court celebrities as brand ambassadors — resources this K-pop nation, which specialises in manufacturing a steady stream of brilliantly engineered idol groups, is never lacking. Having said that, even these walking billboards, with their always-glowing complexions and ever-growing fan bases, are struggling to leverage their star power in a cut-throat business in which a new fashion, a new ingredient, or a new K-drama heartthrob can lure a fickle customer away. In a country where having a facial has become almost as routine as picking up a soy-latte, the competitive business of pampering needs to constantly evolve and offer novel experiences to win customers over. Why else was the snail mucus mask invented? A good advertising campaign can make the cash registers ring but having one’s own stamp on the industry can make a brand sing.  From a tiny kitchen to the world Novelist E M Forster wrote in his novel, Howards End that “if the mothers of various nations could meet, there would be no more wars”. The late Yoon Dokjeong was one such compassionate mother, who supported a family of six by producing hand-pressed camellia oils as hair treatment for stylish Korean women in the 1930s. She would spend hours extracting oil from camellia nut trees in her kitchen and sell it out of Changseong Store, also birthplace of AmorePacific. Her second son Suh Sung-whan mastered the tricks of the trade and took over the business in Gaesong (which is now in North Korea) in 1945, a vulnerable time in Korea’s history at the close of World War II, which ended Japan’s colonial rule. Determined to take the family business beyond the Pacific, the single-minded Suh initially named the company “Taepyeongyang”, which means Pacific Ocean. To globalise Korean cosmetics, he started venturing overseas and moved the company to Yongsan, Seoul, in 1956. Suh built a 10-storey building in 1976, when AmorePacific expanded. In 2018, the AmorePacific Group constructed a new headquarters on the same site to promote its mission as the “Asian Beauty Creator”. Form, as many architects have come to learn, follows function. Famed British architect David Chipperfield and design director Christoph Felger, however, share an attitude to architecture that is much more poetic. Inspired by the Korean white porcelain moon jar, a traditional symbol of beauty, the duo turned the AmorePacific headquarters into an architectural presence that is respectful of the connection between human nature and art — the sentiment that forms the bedrock of this global industry leader. By nature, aluminium does not lend itself to spectacle. But arranged in neat, slim columns, it imparts a sense of refinement. AmorePacific’s concrete frame is perforated by these delicate vertical fins that double as brises-soleils to capture the sun’s rays while allowing those on the inside to see an occasional patch of sky. Three large openings, each containing a hanging garden where employees can relax and mingle, soften the steely façade of this cube-shaped monolith and the rigidity it might imply. The building, through acquaintance with local materials and understanding of the Korean culture, relates harmoniously to its surroundings. A poor office design can cause frustration among staff, but not when the workplace’s open layout bows to the flow of space, light and shape. At AmorePacific, there are no cubicles to blame or poor canteen food to shame. Housing 3,500 employees at any one time, the integrated office offers a high-end cafeteria, gym, lounge, massage room, childcare facilities, auditorium, 30 reception rooms for visitors and a boutique that sells AmorePacific’s signature brands, such as Sulwhasoo, Laniege, Mamonde, Etude House and Innisfree. The AmorePacific Museum of Art in the basement, which started off as a repository for Suh’s craft and ceramics collections, aims to educate the public and contribute to the development of South Korean as well as international art.  Tapping the benefits of green tea and Camellia flowers Like the prescribed movements of a Japanese tea ceremony, the Korean tea ritual, too, is held in high esteem. The late chairman Suh could not allow the centuries-old tradition to be dismissed by those unfamiliar with its nuances. So, in 1979, he staked out land on Jeju Island, converting rocky patches to green farms despite challenges such as drought, frostbite and poor irrigation. Defying all odds, Suh established three green tea plantations a few years later — Gangjin in South Jeolla, and two more in Jeju Island, Seogwang and Hannam — which became major green tea producers along with those in China’s Zhejiang and Japan’s Shizuoka Prefecture. The genteel practice of sipping tea is an intricate choreography, and the uninitiated can experience it firsthand at the Osulloc Tea Museum in Seogwang. Held in a glass-encased pavilion overlooking the serene Gotjawal forest called Tea Stone, the tea ceremony invites a feeling of meditative quietude as one sips from a bowl and contemplates the impermanence of life. For something less formal, follow the gravel path to the Tea House where creamy soft serves and fluffy roll cakes await. AmorePacific may not be the leading authority on green tea but it is the world’s only beauty company that grows it. Its stable of researchers discovered anti-aeging properties in epigallocatechin gallate — an antioxidant found in green tea — that inhibits the degradation of collagen and incorporated it into cosmetic products. Pushing its research lab further, the beauty behemoth launched Innisfree, whose signature products feature Jeju’s green tea as its key ingredient. On the other side of the island, an ancient camellia tree forest, located in Dongbaek village, also caught the attention of AmorePacific. The rose has always been entwined with our notions of beauty and desire, but in this placid village, which was established 300 years ago, the camellia has knocked the queen of flowers off its throne. Grown without pesticides and fertilisers on unspoilt land, the red blossoms contain seeds that yield a nutritious oil known to moisturise the skin and lower blood pressure when consumed. Through the “Beautiful Fair Trade” preservation programme, AmorePacific promises not to harm the habitat of these precious blooms, instead, collecting only when the flowers and seeds have fallen to the ground.  Breakthroughs that changed the face of beauty AmorePacific is constantly inventing and building on research in other fields to prove that it offers more than hope in a jar. Its most prized innovation — the “cushion” technology that changed the makeup habits of South Korean women — came to fruition in March 2008. Coalescing sunscreen, foundation and skin moisturiser into one convenient compact, the winning trifecta combo has become a mainstay of a beauty maven’s handbag. Modern apothecaries are positioning themselves as throwbacks to simpler times, when ingredients were derived from the earth and not cultivated in a lab. The more “natural”, the better. AmorePacific, built on a foundation of traditional Asian medicine such as ginseng or raw materials like soybean, persistently hammers that message home in its marketing. The ABC Ginseng Cream from its pioneering research in 1966 led many to switch up their beauty routines to ones that seem kinder to the skin. AmorePacific is undertaking customer and technology research in its R&I Centre in Singapore as it has a more mature and ethnically diverse market in the Asean region. Furthermore, the company will be investing KRW110 billion (RM400 million) in a production and research base in the Industrial Cluster in Nusajaya, Johor, slated to be completed in 2020. Robin Na, head of AmorePacific’s Asean business, shares the beauty trends set to sweep 2019. “Like all other industries, the makeup business is influenced by the Fourth Industrial Revolution. In this era of digitalisation, AmorePacific is expanding the customer experience through digital, mobile and technology, such as artificial intelligence and 3D printing. For example, Sulwhasoo SPA will expand the brand’s luxury experience; Innisfree will introduce AR devices; and Mamonde will offer digital contents for a more personalised customer experience.” As the world speeds up and puts our well-being on the back burner, it is no wonder we crave a little quick fix. Who would not want a balm or twee packaging to convince us that things are not as bad as they seem? K-beauty has shifted our consciousness on what it means to take care of our skin — we, like our makeup routine, should get better with age. Following this belief, AmorePacific, coupled with its rich brand story and savvy positioning, has made itself the darling of cosmetic stores around the world. So, in a way, Suh’s dream of making his mother’s humble trade international has been realised.  This article first appeared on Jan 21, 2019 in The Edge Malaysia.  Options is the award-winning lifestyle pullout of The Edge Malaysia, the country’s premier business and investment weekly publication. © 2018 The Edge Communications Sdn. Bhd. 199301012242 (266980-X). All rights reserved ",
    "datetime": null,
    "url": "https://www.optionstheedge.com/topic/people/amorepacific-builds-k-beauty-empire-fuelled-technology-and-innovation"
}