{
    "title": "AmorePacific Sales Soar As Tourists Race To JeJu For Cosmetics",
    "text": "This story appears in the November 2, 2014 issue of Forbes Asia. Subscribe to Forbes Asia By Elizabeth Woyke For years, starting back in the 1970s, the typical visitors to Jeju island were Korean newlyweds enjoying their honeymoon. These days, thanks to savvy marketing and a visa-free policy, this island 60 miles off the southern coast of South Korea is pulling in visitors who are more like Liu Chan Juan. She's a 25-year-old woman from Shenzhen, China who has come to shop. Nearly 2.3 million Chinese tourists arrived in Jeju during the first nine months of this year--a 48% year-over-year increase. They appreciate Jeju's fresh air, volcanic peaks and scenic waterfalls, as well as unique dishes such as \"black pork,\" made from a local pig breed, but the duty-free shops are the main lure. Chinese visitors spend roughly $2,000 each on the island, says the Korea Tourism Organization, and shopping makes up the largest chunk of that, more than accommodations, entertainment or food. And the bulk of what they buy--more than special Jeju souvenirs such as tangerine-flavored chocolates--is cosmetics. That's been a huge boon for AmorePacific, South Korea's largest cosmetics maker by revenue. The company's duty-free sales in South Korea to customers from China, Taiwan and Hong Kong surged 184% in the first half of the year versus the first half of 2013, and its Jeju business gets much of the credit for that. AmorePacific's share price has more than doubled this year, and overall revenue and profits have risen dramatically. \"The strength of our duty-free business is definitely one major factor in our recent financial success,\" says Kim Seung-Hwan, senior vice president of AmorePacific's group strategy division. \"And the momentum in the duty-free business comes from the inflow of Chinese travelers to Korea.\" At Shilla Duty Free Jeju, the island's largest duty-free store, this inflow looks more like a flood. Originally boasting two floors of merchandise, the emporium now has three and is adding a fourth. Chinese tourists throng the counters selling AmorePacific products. Some shoppers are as young as Zhao Zimei, a 15-year-old from Beijing who bought a $4 honey-infused lip balm and a $9 olive-oil-based cleanser from Innisfree, an AmorePacific brand that touts natural ingredients sourced from Jeju. Zhao was visiting Jeju as part of a four-day group tour and says she purchased the Innisfree products after watching Korean television shows. \"Korean cosmetics are famous for being good,\" she adds. The global interest in Korean beauty products and techniques--the \"K-Beauty\" phenomenon--has given the company a big boost, says Kim. Along with K-Pop (Korean pop music) and K-Drama (Korean dramatic miniseries), K-Beauty is part of the cultural trend known as Hallyu , or the Korean Wave, that has spread to much of Asia as well as North and South America and elsewhere around the world. AmorePacific leverages the popularity of K-Beauty by featuring Korean actresses and singers in its advertisements. It occasionally also pays for product placement in Korean dramas, such as earlier this year when it had some of its skin care and makeup products featured in the drama My Love From the Star . The show became a blockbuster hit across Asia, and AmorePacific saw sales of those products rocket. During her trip to Jeju, Liu, the 25-year-old from Shenzhen, spent $44 on AmorePacific lipstick seen in the show.  credit:Hal Mayforth for Forbes  It's not only Chinese tourists coming to Jeju. Some 308,000 non-Chinese international visitors arrived on the island in the first nine months of the year, though that's a 19% decrease compared with the same period in 2013 (see table, below) --partly owing to higher taxes and the weaker yen in Japan. Domestic tourism accounts for most of the visitors to Jeju, and the 6.6 million South Koreans who traveled there in the first nine months were 4.6% more than in the same period last year. Many arrive via ferry, and their numbers declined for several months after the Sewol ferry sank en route to Jeju in April, killing 304 people, most of them students on a school trip. The disaster, however, had little effect on Chinese tourists, who visit Jeju either by plane or in large Western cruise ships. And when visitors get to Jeju and start hunting for discount cosmetics, they're often buying the world's first \"cushion compact\"--a mixture of colored foundation, sunscreen and moisturizer that users apply by touching a foam pad to a spongy, liquid-filled cushion. Developed by AmorePacific's research labs in 2008, women around the world have snapped up more than 30 million of them. At Jeju's duty-free stores the compact sells for $32 to $37. A range of other Korean companies are capitalizing on Jeju's China boom. Banks such as Hana and Shinhan have dedicated space in their Jeju branches to serving Chinese customers. One Shinhan branch in Jeju City, the island's capital, has a separate entrance for Chinese visitors. The hallway leads to a room where two Mandarin-speaking staff offer help with currency exchange, accounts and remittances. At the Lotte City Hotel Jeju, a 22-story hotel that the Lotte food-and-retail conglomerate opened in February, the $40 lunch buffet includes dim sum and Chinese-style fried rice. And E-Mart, South Korea's biggest discount retailer, is a magnet for Chinese shoppers and posts Chinese translations throughout its Jeju stores. Customized service also helps AmorePacific goose its duty-free sales. All of the retailer's duty-free salespeople in South Korea can speak, read and write Mandarin. They practice their general conversational abilities by chatting with tutors over the phone, and hone their beauty, sales and product vocabulary by listening to MP3 audio files produced by AmorePacific, which began operating its Chinese-language sales-communication program last year. AmorePacific also runs plenty of duty-free promotions geared toward Chinese tourists. During Lunar New Year the company gave shoppers product samples in red pouches that evoked the Chinese custom of distributing gifts of money in red envelopes during the holiday. Noting the Chinese affinity for the number eight, AmorePacific has also offered presents to shoppers who buy products worth at least $888. And because of the Chinese fondness for gold, the company has handed out miniature gold bars to big spenders in the past. These promotions aren't limited to Chinese shoppers, but AmorePacific says Chinese tourists buy more than other nationalities do because they purchase a lot of gifts. It is not unusual for a single Chinese customer to spend $168 on eight jars of the company's Laneige Water Sleeping Pack, a gel-like, nighttime facial moisturizer, or $127 on two bottles of its Sulwhasoo First Care Activating Serum, a skin-softener infused with Korean medicinal herbs. AmorePacific packages bestsellers such as these into multiple-quantity sets and typically prices them 10% less than the cost of buying the products separately.  Many Chinese shoppers also prefer to purchase cosmetics in sets of complementary products. This is particularly true for tourists who visit Jeju on cruise ships, because they don't have much time to compare or learn about specific products. In 2013 more than 380,000 visitors arrived in Jeju via cruises. This year the island expects more than 500,000 cruise visitors, with more than 90% of them coming from China, typically departing from Shanghai. To cater to this market, AmorePacific distributes product brochures on ships and creates \"travel exclusive\" sets that group several products--such as a skin lotion, an eye cream, a night cream and a serumlike \"essence\"--together in a single box. These sets usually include incentives such as free samples, but since they can be priced as high as $1,000, they tend to increase a shopper's overall expenditure. The company isn't relying on its duty-free success. It is bolstering its sales in China itself by making its products available in not only department stores but also free-standing stores, home shopping networks and e-commerce sites such as Tmall, JD.com and Jumei. It is also tailoring some of its products to Chinese preferences, gleaned through local market research and studies with Chinese academics and dermatologists. Last month it opened a production and research and development center in Shanghai that will increase its production capacity in China tenfold. AmorePacific gets 20% of its revenue from overseas, with roughly 60% of that coming from China. By 2020 it aims to get at least 51% of its sales from abroad, with 30% from China. Jeju authorities are also working hard to keep the Chinese business flowing. Since 1999 the Jeju provincial government has opened tourism-focused offices in six cities in Greater China: Beijing, Chengdu, Guangzhou, Shanghai, Shenyang and Taipei. Jeju has also steadily relaxed visa requirements for Chinese travelers, starting in 1998 and accelerating in 2006. Chinese travelers no longer need visas to visit Jeju, but they do usually need them to travel to mainland South Korea. To promote its visa-free policy in China, the Jeju government has been running ads on TV, in magazines and on travel websites such as CTrip. The Chinese influx hasn't been universally popular in Jeju, which has a permanent population of 605,000 and is 714 square miles. Some residents, particularly old-timers, fret that their island is starting to feel like part of China, especially as Chinese investors and property developers wield more influence over the local economy and environment. Kim Chae-Eun, an assistant manager at the Jeju Tourism Organization, says her organization remains bullish on China. \"Some elderly people are complaining about the Chinese, but we have to show our hospitality and continually attract them to help Jeju's economic growth,\" she says. It's a stance that Korean companies have already embraced. \"The whole world is facing toward Asia--and especially China--at this time,\" says AmorePacific's Kim. \"Our CEO often says this is a once-in-a-lifetime opportunity for us to become a truly globalized company.\" Tourism has long dominated Jeju's economy, but the island keeps trying to fashion itself into a technology hub. In 2005 it broke ground on Jeju Science Park, a 271-acre complex for technology companies and organizations. The Jeju Free International City Development Center, a government-owned company that developed and manages the park, says it wanted to build a business-friendly environment for startups that would have a ripple effect throughout the island's economy. Nearly ten years later the park is no Silicon Valley, but it has attracted 117 information-technology and biotechnology companies and research institutes and is expected to reach full capacity next year.  Brains and beach: Jeju science park. credit:Yonhap News/YNA/Newscom  The most notable tenant is Daum Kakao, which operates South Korea's second-largest Internet portal, behind \nNaver\n. Daum Communications, which merged with Kakao Corp. last month, began considering moving from Seoul to Jeju in 2004. After years of testing the arrangement, the company relocated its headquarters to Science Park in 2012, and this is now the Daum Kakao headquarters. Some 600 of Daum's 1,600 employees work in its Science Park campus, which spans three buildings, including a child care facility. The rest of Daum's staff works in Seoul. The company hasn't decided yet whether any Kakao employees will move to Jeju. Daum's Jeju employees enjoy outdoor basketball and tennis courts; unobstructed views of Mt. Halla, a dormant volcano that is South Korea's highest mountain; and 20- to 30-minute commutes (compared with 2 to 3 hours for many Seoul residents). Daum Kakao spokesman Jason Lee says a better quality of life, along with corporate and property tax breaks, were the main advantages of moving south. A May 2013 company survey found that 91 % of Daum employees were satisfied with their new circumstances. Lee says the biggest drawback for Daum has been the lack of well-trained IT workers in Jeju. In response, Daum has helped establish job training and internship programs at nearby Jeju National University. Other high-profile Seoul transplants to Jeju include NXC Corp., the holding company of Nexon, South Korea's largest online-gaming company; and ESTsoft, a software developer. The Jeju development center is now looking to build a second, R&D-focused complex, with an expected completion date of 2021.-- E.W.  ",
    "datetime": null,
    "url": "https://www.forbes.com/sites/forbesasia/2014/10/27/k-shopping/"
}