{
    "title": "Amorepacific becomes the first Korean beauty company to join RE100",
    "text": "Searching for your content... In-Language News Contact Us 888-776-0942\n\nfrom 8 AM - 10 PM ET Pledges 100% transition to renewable energy for its global sites by 2030 News provided by 10 Mar, 2021, 00:00 ET Share this article SEOUL, South Korea, March 10, 2021 /PRNewswire/ --Amorepacific has become the first Korean beauty company to join the global RE100 initiative with a goal to source 100% renewable energy to power all of its production sites and offices (HQ, R&D, logistics, and production centers) by the year 2030. RE100 is a global collaborative initiative among companies committed to using 100% renewable energy. The program was launched by the international non-profit organization, The Climate Group, in partnership with CDP, in 2014. As of March 2021, over 290 companies, including Google, Microsoft, and Apple, have joined the initiative. Amorepacific is the first from the Korean beauty industry to become a member of the global RE100. RE100 is a global collaborative initiative among companies committed to using 100% renewable energy. The program was launched by the international non-profit organization, The Climate Group, in partnership with CDP, in 2014. As of March 2021, over 290 companies, including Google, Microsoft, and Apple, have joined the initiative. Amorepacific is the first from the Korean beauty industry to become a member of the global RE100. Amorepacific began addressing environmental issues by setting its sustainable management goals in 1993. The company started voluntarily tracking its GHG emissions inventory in 2008 and has made continuous investments to begin its transition to renewable energy sources. To participate in climate action, it has improved energy efficiency for its buildings, reduced per-unit GHG intensity, and created an internal 'Energy Innovation' task force. In 2020, Amorepacific sourced 5% of its electricity from renewable sources, including solar power and geothermal heat. It plans to further add renewable energy generation facilities on the rooftop of its production plants and idle surfaces to increase renewable energy supply. Located in Yongsan, Seoul, South Korea, the Amorepacific global HQ building is rated first-level in G-SEED (Green Standard for Energy and Environmental Design) and energy efficiency. It is also certified as the gold grade in LEED (Leadership in Energy and Environmental Design). It achieves 37.6% less energy consumption than its estimated energy demand using eco-friendly systems. The combined effort of Amorepacific employees also creates a positive impact. Specialists responsible for energy consumption from the company's HQ, R&D, logistics, and production sites formed the 'Energy Innovation' task force in 2019. The team conducted a campaign for energy saving and reducing GHG emissions and efficiently converted all lighting modules in the company's globally operated production centers - including those located in Shanghai, China, and Osan and Daejeon, Korea - to LED lighting. An AI system was also implemented to increase energy efficiency. As a result, Amorepacific's GHG emissions decreased by 7.4% in 2019. To achieve the 100% renewable energy goal, Amorepacific will utilize advanced technologies to manufacture products at lower temperatures, thus reducing the environmental impact in all of the development and production stages. It will also develop more low-carbon footprint products using ingredients and packaging materials with lower GHG emissions based on LCA (Life Cycle Assessment) results. In addition, Amorepacific will utilize 3rd party PPAs and green contracts operated by the Korean government. In February 2021, Amorepacific purchased the Green Premium policy, which will replace 30% of the 2021 estimated power demand for its production center in Osan with renewable energy. Suh Kyung-bae, Chairman and CEO of Amorepacific Group, said, \"Amorepacific agrees that resolving the climate issue is an essential agenda not only for corporate sustainability but for the survival of humanity. By achieving the RE100 goal by 2030, we hope to contribute to international climate action. As a global corporate citizen, we will cooperate to reduce our carbon footprint.\" Aleksandra Klassen, RE100 Senior Impact Manager, The Climate Group, said, \"We are delighted that Amore Pacific has become the first beauty company in South Korea to join RE100, the global initiative led by The Climate Group in partnership with CDP. By committing to 100% renewable electricity by 2030, Amore Pacific is taking an important step toward improving its sustainability, joining a growing number of companies committed to driving market change. This sends a powerful message that renewable electricity makes good business sense, and we encourage others to follow.\" Ousam Jin, President of RE100 Committee of KSNRE, the RE100 Regional Delivery Partner in South Korea, said, \"Amorepacific, one of the most beloved companies in the cosmetic industry, is proudly joining RE100. Its customers will be proud of their participation in the journey to solving climate challenges.\" He added, \"We believe Amorepacific's joining RE100 will surely impact the consumer-facing businesses in Korea, which we hope leads to taking action.\" About Amorepacific Since 1945, Amorepacific has had a single, clear mission: to present its unique perception of beauty– namely what it calls 'Asian Beauty' – to the world. As Korea's leading beauty company, Amorepacific draws from its deep understanding of both nature and human to pursue harmony between inner and outer beauty. With its portfolio of over 20 cosmetics, personal care, and health care brands, Amorepacific is devoted to meeting the various lifestyles and needs of global consumers around the world: Asia, North America, Europe, Oceania and the Middle East. Amorepacific's research hubs located around the world are dedicated to sustainable R&D that combine the best of natural Asian ingredients and advanced bio-technology. With its world-class products, Amorepacific is acclaimed for the innovative ways in which it is transforming global beauty trends. About RE100 RE100 is a global initiative bringing together the world's most influential businesses committed to 100% renewable power. Led by international non-profit the Climate Group in partnership with CDP, the group have a total revenue of over US$6.6 trillion and operate in a diverse range of sectors. Together, they send a powerful signal to policymakers and investors to accelerate the transition to a clean economy. #RE100 About the Climate Group The Climate Group drives climate action. Fast. Our goal is a world of net zero carbon emissions by 2050, with greater prosperity for all. We focus on systems with the highest emissions and where our networks have the greatest opportunity to drive change. We do this by building large and influential networks and holding organisations accountable, turning their commitments into action. We share what we achieve together to show more organisations what they could do. We are an international non-profit organisation, founded in 2004, with offices in London, New Delhi and New York. We are proud to be part of the We Mean Business coalition. Follow us on Twitter @ClimateGroup. About CDP CDP is a global non-profit that drives companies and governments to reduce their greenhouse gas emissions, safeguard water resources and protect forests. Voted number one climate research provider by investors and working with institutional investors with assets of over US$106 trillion, we leverage investor and buyer power to motivate companies to disclose and manage their environmental impacts. Over 9,600 companies with over 50% of global market capitalization disclosed environmental data through CDP in 2020. This is in addition to the hundreds of cities, states and regions who disclosed, making CDP's platform one of the richest sources of information globally on how companies and governments are driving environmental change. CDP is a founding member of the We Mean Business Coalition. Visit https://cdp.net/en or follow us @CDP to find out more. About KSNRE KSNRE is a non-profit corporation, whose purpose is to expand the understanding of renewable energy through industry-academia-research collaborations such as academic and technical research and development, information exchange, events and business support. KSNRE is the campaign partner for RE100 in the Republic of Korea, providing information to companies on the aims and benefits of RE100 and supporting the interests of Korean and international RE100 members locally. SOURCE Amorepacific Amorepacific, Korea's leading beauty company, was announced the winner of the 'Market Trailblazer' accolade at the RE100 Leadership Awards held on... Amorepacific, el conglomerado de belleza más importante de Corea, anuncia con orgullo el lanzamiento de su marca prémium de cuidado de la piel,... Cosmetics and Personal Care Household, Consumer & Cosmetics Green Technology Corporate Social Responsibility Sign up to get PRN’s top stories and curated news delivered to your inbox weekly!  ",
    "datetime": null,
    "url": "https://www.prnewswire.com/news-releases/amorepacific-becomes-the-first-korean-beauty-company-to-join-re100-301243612.html"
}