{
    "title": "Amorepacific Buys American Beauty Brand Tata Harper | BoF",
    "text": "Agenda-setting intelligence, analysis and advice for the global fashion community. The South Korean beauty conglomerate says it has acquired the brand’s parent Tata’s Natural Alchemy as a stepping stone for its plan to accelerate expansion across North America. Founded in 2010 by Tata and Henry Harper, the upmarket American ‘clean beauty’ brand’s products are sold across online channels including Net-A-Porter and Cult Beauty, along with about 800 offline stores, including the Sephora and Neiman Marcus chains. To complete the acquisition, Amorepacific has created a US special acquisition company (Spac) with capital of $125 million.  The deal with Tata Natural will further strengthen Amorepacific’s presence in the North American market, where in the second quarter of this year its sales soared by 66 percent year on year. However, not all brands in the group’s portfolio have been a hit in the US. Last year the K-beauty giant announced that it was shuttering all stores of its Innisfree brand in North America, citing pressures from the pandemic. The South Korean firm’s prioritisation of the US market comes on the back of signs that it is struggling in China, where earlier this year it announced the closure of the last brick-and-mortar outlet of its Hera brand. China accounts for approximately 70 percent of the group’s sales in Asia. Learn more: K-Beauty Giant Amorepacific Group’s First Quarter Profits Slump on Asia Challenges The South Korean beauty conglomerate says its global revenue fell by 9 percent to 1.3 trillion won ($1 billion), with operating profit down 13.4 percent year-on-year to 171.2 billion won. © 2023 The Business of Fashion. All rights reserved. For more information read our Terms & Conditions The Melbourne-based multi-brand retailer has kept both local and international competitors at bay with a regional store footprint four times larger than Sephora’s. This week’s round-up of global markets fashion business news also features Chinese investment in Egypt’s textile industry, plans to save Costa Brazil and fresh calls for Bangladeshi garment factories to pay workers more. This week’s round-up of global markets fashion business news also features the Chinese boycott of Japanese cosmetics, Mexico’s designer showcase and the industry impact of the Middle East crisis. This week’s round-up of global markets fashion business news also features Pacific India’s growing mall network, Dubai Fashion Week and Alibaba’s denial of espionage allegations. The essential daily round-up of fashion news, analysis, and breaking news alerts. Our newsletters may include 3rd-party advertising, by subscribing you agree to the Terms and Conditions & Privacy Policy.   ",
    "datetime": null,
    "url": "https://www.businessoffashion.com/news/global-markets/amorepacific-buys-american-beauty-brand-tata-harper/"
}