{
    "title": "AmorePacific Q3: Sales plummet 15.6 percent as China’s zero Covid policy bites - Global Cosmetics News",
    "text": "TRENDING: Posted by Georgina Caldwell | Nov 8, 2022 | Asia & Australasia, Finance | THE WHAT? AmorePacific has reported its results for the third quarter of the current financial year. The K-beauty behemoth saw sales drop 15.6 percent compared to the prior-year quarter and operating profit dive 62.6 percent, according to a report published by Inside Retail Asia. THE DETAILS Domestic sales declined 18.6 percent while sales in China plummeted 40 percent as the country’s zero Covid policy continues with rolling lockdowns and ongoing restrictions hitting cosmetics consumption. Sales in Europe and North America heled mitigate these losses however, with these international markets gain 60 and 97 percent respectively. THE WHY? Despite its attempts at greater diversification since the pandemic hit, China accounts for some 50 percent of Asian sales – making the market critical to the firm’s success. The K-beauty giant’s drive to reduce its exposure continues apace – most recently with the acquisition of Tata Harper. Share: Rate: LATEST NEWS Unilever settles in trademark dispute ov...   Walgreens to settle Rite Aid suit for US...   L’Occitane Q2 2024: Sales rise 17....   Two Target executives to retire   Gillette signs up for another season as ...   PRESS RELEASE: Society of Cosmetic Chemi...   L’Oreal to dump Decleor in derma shake-u...   Hermes Q3 2023: sales up 16 percent to €...   Amazon to face lawsuit over data trackin...   J-beauty retailer Yoshitsu to open store...  GLOBAL COSMETICS NEWS Contact UsSubscribePrivacy PolicyCookie PolicyTerms & Conditions SOCIAL MEDIA FacebookTwitterInstagramLinkedInSoundCloudRSSYouTube NEWS HomeAll Regions Cosmetics News WirePodcastOpinionFashionProfessional BeautyTravelWellnessTop 100 Brands Copyright © 2023 Global Cosmetics Media Limited ",
    "datetime": "2022-11-08T06:01:00+00:00",
    "url": "https://www.globalcosmeticsnews.com/amorepacific-q3-sales-plummet-15-6-percent-as-chinas-zero-covid-policy-bites/"
}