{
    "title": "Anne Curtis on her obsession with K-Drama and K-beauty",
    "text": "Written by CNN Philippines Life Staff Updated Apr 6, 2018, 1:35:45 AM Manila (CNN Philippines Life) — Being the “National Sweetheart” is a label that Anne Curtis has arguably lived up to — what with her endearing attempts at singing, her contagious laugh regularly heard on a noontime show, and most recently, her obsession with K-Drama. Manila (CNN Philippines Life) — Being the “National Sweetheart” is a label that Anne Curtis has arguably lived up to — what with her endearing attempts at singing, her contagious laugh regularly heard on a noontime show, and most recently, her obsession with K-Drama. “There are only [16] episodes and that's it. There's no season two, so you really get hooked,” she says of the general format of K-Dramas. Indeed, it has inspired her many pastel outfits matched with ankle-length socks. She would even sometimes wear these looks with that vague half-cute, half-worried expression only K-Drama actors can seem to perfect. “There are only [16] episodes and that's it. There's no season two, so you really get hooked,” she says of the general format of K-Dramas. Indeed, it has inspired her many pastel outfits matched with ankle-length socks. She would even sometimes wear these looks with that vague half-cute, half-worried expression only K-Drama actors can seem to perfect. Dressed in a baby blue peter pan-collared skater dress, she continues to gush about K-Drama: the locations, the actors, the actresses, she says, are all stunning. “[K-Drama] teaches us about everything that they do — how their lifestyle is, their seasons, their culture,” she explains, almost trying to contain her excitement. Dressed in a baby blue peter pan-collared skater dress, she continues to gush about K-Drama: the locations, the actors, the actresses, she says, are all stunning. “[K-Drama] teaches us about everything that they do — how their lifestyle is, their seasons, their culture,” she explains, almost trying to contain her excitement. “I mean, my last vacation before I got married was to [South] Korea,” she says, while laughing hysterically at the thought. “I was like, ‘I wanna see everything happen in person.’ And it was the perfect season because I think autumn in South Korea — based of course from their series — is the most beautiful time to go.” “I mean, my last vacation before I got married was to [South] Korea,” she says, while laughing hysterically at the thought. “I was like, ‘I wanna see everything happen in person.’ And it was the perfect season because I think autumn in South Korea — based of course from their series — is the most beautiful time to go.” Now, she takes this obsession even further with a K-beauty line for BLK Cosmetics, where she is creative director. She had told her partners at BLK how they should come up with this collection, as it still falls in line with what the brand is all about, which is “uncomplicated beauty,” the makeup’s tagline. Now, she takes this obsession even further with a K-beauty line for BLK Cosmetics, where she is creative director. She had told her partners at BLK how they should come up with this collection, as it still falls in line with what the brand is all about, which is “uncomplicated beauty,” the makeup’s tagline. “When I see [K-Drama] actresses or actors, they're always so flawless. But when you look at [their makeup], it's all very simple. It's not heavy, it's very light,” she says. It seems Anne can’t escape the value of makeup, especially with her line of work, but she also says that she’s always been just “a cheek tint kind of girl.” “When I see [K-Drama] actresses or actors, they're always so flawless. But when you look at [their makeup], it's all very simple. It's not heavy, it's very light,” she says. It seems Anne can’t escape the value of makeup, especially with her line of work, but she also says that she’s always been just “a cheek tint kind of girl.” The “simple” makeup look may be attributed to people’s affinity to “natural beauty.” But critics of the beauty industry have called the “natural beauty myth” as a “ruthless, anti-egalitarian ideal,” as it condones the notion that beauty can be achieved without effort, when in fact, flawless skin, for instance, could — if we base it on the South Korean trend — take 10 steps (read: 10 not-very-affordable beauty products) to achieve. The “simple” makeup look may be attributed to people’s affinity to “natural beauty.” But critics of the beauty industry have called the “natural beauty myth” as a “ruthless, anti-egalitarian ideal,” as it condones the notion that beauty can be achieved without effort, when in fact, flawless skin, for instance, could — if we base it on the South Korean trend — take 10 steps (read: 10 not-very-affordable beauty products) to achieve. While K-beauty looks effortless, another side of it is also known to be ‘complicated’ as evidenced by the aforementioned 10-step skincare routines, the “glass skin” trend, and even rhinoplasty and double eyelid surgical procedures. Anne is quick to say that K-beauty skincare is a whole different playing field, and what BLK is focusing on is how Filipinos can achieve a simple look through makeup. While K-beauty looks effortless, another side of it is also known to be ‘complicated’ as evidenced by the aforementioned 10-step skincare routines, the “glass skin” trend, and even rhinoplasty and double eyelid surgical procedures. Anne is quick to say that K-beauty skincare is a whole different playing field, and what BLK is focusing on is how Filipinos can achieve a simple look through makeup. Of course, there’s an issue always hovering over the beauty and cosmetics industry in general, which is that it contributes to social pressures placed upon women to subscribe to unrealistic beauty standards. When asked about this, Anne goes back to reiterating the kind of simplicity that they are advocating for at BLK. Of course, there’s an issue always hovering over the beauty and cosmetics industry in general, which is that it contributes to social pressures placed upon women to subscribe to unrealistic beauty standards. When asked about this, Anne goes back to reiterating the kind of simplicity that they are advocating for at BLK. “If you look at even our campaigns. Even before the K-beauty collection, everything was very simple,” she says. “My freckles were shown, I only used what was needed. No fake lashes, very uncomplicated. Because it means you don't really need much or [you can] keep it simple.” “If you look at even our campaigns. Even before the K-beauty collection, everything was very simple,” she says. “My freckles were shown, I only used what was needed. No fake lashes, very uncomplicated. Because it means you don't really need much or [you can] keep it simple.” It can be argued that this would be easy to say for a celebrity whose face has launched a thousand billboards, T.V. commercials, magazine covers, teleseryes, films, posters, and notebooks, among many others. It can be argued that this would be easy to say for a celebrity whose face has launched a thousand billboards, T.V. commercials, magazine covers, teleseryes, films, posters, and notebooks, among many others. But she also cannot be faulted for looking the way she does, for only needing a cheek tint to look ‘presentable.’ But she also cannot be faulted for looking the way she does, for only needing a cheek tint to look ‘presentable.’  800   © 2015 Nine Media Corp. CNN name, logo and all associated elements ™ and © 2015 Cable News Network. Warner Media Company. All rights reserved. CNN and the CNN logo are registered marks of Cable News Network, Inc., displayed with permission. ",
    "datetime": null,
    "url": "https://www.cnnphilippines.com/life/style/2018/04/06/anne-curtis-K-drama-K-beauty.html"
}