{
    "title": "Another K-Beauty Brand Bites the Dust In China | Jing Daily",
    "text": "What Happened: After closing 140 stores in China in 2019 and 2020, Amorepacific’s Innisfree has announced plans to shutter about 170 more stores by the end of 2021. This comes on the heels of sister brand Etude House, which is facing capital impairment, shutting down its remaining physical locations in the mainland earlier this year. The affordable beauty brand will also pull out of the North American market, although products will continue to be sold through Sephora outlets. The Jing Take: While all global companies face tough competition in China, Korean players have especially struggled. Once popularized by K-dramas and K-pop, the K-beauty sector has since lost the affection of local consumers following political tensions sparked by THAAD, a controversial ground-based missile defense system, and the subsequent boycott of Korean cultural products. The pandemic has only hastened this decline, with beauty names seeing reduced foot traffic and fewer color cosmetic purchases. And Innisfree is no exception: In 2020, the brand’s sales plummeted 37 percent year-on-year to $307 million (348.6 billion won) — less than half of its peak sales of 770 billion won in 2016. But arguably, playing a larger role in Innisfree’s downfall is its lack of competitiveness. Innisfree products are best known for using natural ingredients from Jeju Island, such as volcanic ash, camellia, and green tea. Though competitors may not be able to boast ties to the scenic island, they too offer natural products that perform the same functions. And from a price standpoint, Chinese consumers have begun shunning mid-priced products, gravitating instead toward Western luxury names like Estée Lauder, Dior, and Lancôme or cost-effective local brands. Recommended ReadingIs K-Beauty’s Reign Coming To A Close?By Julienna Law That said, Amorepacific isn’t going down without a fight. By scaling back its brick-and-mortar operations and shifting its focus to digital, the beauty conglomerate has already managed to increase its net profit almost 90 percent year-on-year to $159.2 million in Q1 2021 — a promising pivot from the $52.8 million net loss in Q4. Moreover, the 30 percent jump in China sales the first three months of the year, plus its recent pop-up store in Hainan and collaboration with Off-White, signal that the group hasn’t given up on the mainland market at all. Rather, it has now freed up the resources to win consumers over once again. The Jing Take reports on a piece of the leading news and presents our editorial team’s analysis of the key implications for the luxury industry. In the recurring column, we analyze everything from product drops and mergers to heated debate sprouting on Chinese social media. Beauty, News amorepacific, c-beauty, Covid-19, estee lauder, innisfree, k-beauty, krane-amrpf, thaad, The Jing Take © 2023 Herlar, LLC. All rights reserved. Jing Daily® is a registered U.S. trademark of Herlar, LLC. Sign up for our daily newsletter to unpack the business of luxury in China. Gain insights, analysis, and breaking news from our on-the-ground reporters. Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. ",
    "datetime": "2021-05-17T19:04:09+00:00",
    "url": "http://jingdaily.com/amorepacific-innisfree-close-stores-china/"
}