{
    "title": "Are Japan's anime cosmetic creations hot on the heels of K-beauty success?",
    "text": "Or wait... Headlines Brand Innovation Formulation & Science Packaging & Design Business & Financial Market Trends Regulation & Safety Promotional Features Site Archive Multimedia Regions All Asia-Pacific South East Asia South Asia East Asia Oceania Site Archive Multimedia Hot topics Clean & Ethical Beauty Sustainability COVID-19 Market Entry Anti-Aging / Skin Whitening Beauty From Within Nanotechnology Green Cosmetics Site Archive Multimedia Resources Type of resources Events All Events Shows & Conferences Online Events Editorial Webinars Events China 中国 Podcast  04-Jul-2016\n                            - Last updated on\n                                04-Jul-2016 at 13:37 GMT Traditionally an online anime vendor, Bandai recently ramped up its presence in Tokyo to capture tourist attention in the same way Korean beauty brands have been gauging Western interest before investing in international markets. Moving into the make-up arena with its first ‘character beauty shop’ in Tokyo Station this summer - an area that houses Pokémon games - Bandai is introducing tourists to child-focused low and high-end cosmetics ranges. The store, ‘Otona Joshi Biyori’ (which translates as ‘A fine day for adult girls’), houses international popular characters like Hello Kitty, The Rose of Versailles, Rascal the Raccoon, Bonobono, and Sailor Moon. The ranges are comprised of lip balms and skin brightening ‘magical ball’ face powders wrapped in vibrant and playful packaging. Sailor Moon related beauty is particularly tipped to see success as the remake of the TV series in recent years has been dubbed into dozens of languages. In Asia, TV series and dramas have a major influence in make-up trends and purchasing behaviour. Kawaii trend​ Kawaii – also known as the ‘adorableness’ trend - is catching on internationally. One brand fronting the movement, Asia Kawaii Way, launched 'Face Toyko' cosmetics boxes to share popular make-up products and techniques from Tokyo with the rest of the world in 2015. The ‘adorableness’ boxes were inspired by the 2,000 attendees at Tokyo Girls Collection and are comprised of four different looks; the fresh 'Raw Face', the 'Adorable Doll Face', the 'Heritage Bitter Face' and the trend-driven 'Colour Face'. The range has since been picked up by Japanese retailers, including Matsumoto Kiyoshi, Tsuruha Drug and Don Quijote. Copyright - Unless otherwise stated all contents of this web site are © 2023 - William Reed Ltd - All Rights Reserved - Full details for the use of materials on this site can be found in the Terms & Conditions Related topics\nMarket Trends\nAsia in Focus\nColor Cosmetics Show more More promotional features ",
    "datetime": null,
    "url": "https://www.cosmeticsdesign-asia.com/Article/2016/07/05/Are-Japan-s-anime-cosmetic-creations-hot-on-the-heels-of-K-beauty-success"
}