{
    "title": "Are You Choosing the Right Exfoliation Method for your Client? | Skin Inc.",
    "text": "Exfoliating treatments and products are used for various skin conditions, including discoloration, uneven skin tone, acne, fine lines, wrinkles and even skin-tightening. With all of the exfoliation methods available, how do you choose the right one for your client? The truth is that several methods of exfoliation can be indicated for one particular concern or condition, so the best decisions are often made following a few basic steps. 1. Complete a thorough consultation. This is your make-it-or-break-it moment. Relating to your clients and providing a treatment that will make them feel better is extremely important to building and maintaining strong client relationships. 2. Provide a detailed skin analysis. Always take Fitzpatrick skin type, skin characteristics and skin conditions into consideration. 3. Confirm safety. It is crucial that the method you choose is safe for each individual client. Learning about the differences between the types of exfoliation is necessary before offering these services. They include surface exfoliants, superficial mechanical exfoliation, superficial chemical exfoliation, and a variety of superficial- to medium-depth exfoliation techniques. Surface exfoliants are often purchased by the consumer because they can be used in conjunction with other methods or as a part of an at-home maintenance program. Ingredients that are frequently included in beaded surface exfoliation products are polyethylene beads, crushed herbs, nuts, crystals or other materials that gently polish the surface of the skin. Caution should be taken by skin care professionals and clients, because some of these products can actually cause minor wounds in the skin. Some clients prefer the feel of these mechanical products because the exfoliation is more tactile; this does not mean it is the best method, especially in the cases of those with sensitized skin and acne vulgaris. There are other surface exfoliants available that contain enzymes and mild concentrations  of hydroxy acids—up to 5%. Enzymes. Enzymes are typically derived from fruit acids, most commonly pineapple (bromelain) and papaya (papain). Depending on the strength, enzymes can either be used as a home treatment or an in-spa exfoliation. They are known to break up dead skin cells on the surface of the skin. Not all enzyme products are mild; there are products available that combine enzymes and hydroxy acids. It is important to become thoroughly educated and trained on any treatment or product being offered in your facility. Superficial mechanical exfoliation treatments consist of microdermabrasion and dermaplaning. Microdermabrasion. A rough-surfaced instrument is used to polish the skin during the performance of microdermabrasion. Although microdermabrasion is one of the most common procedures performed by skin care professionals, it is not the best option for many skin conditions. It creates suction through a loophole that gathers up dead skin and used particles. This suction can cause more harm than good on sensitive and inflamed skin. A chemical exfoliant would be better suited for sensitive skin types. Dermaplaning. During dermaplaning, a skin care professional removes dead skin and vellus hair with a scalpel. Although the procedure may seem straightforward, it does not mean it is an all-around simple procedure to perform; in-depth training by a reputable company or educator is a must before providing this treatment. The legalities of esthetician usage regarding this treatment are somewhat controversial. Even though dermaplaning only removes dead skin on the superficial layer of the epidermis, the use of a medical instrument raises a question. Check with your licensing state to see if it is legal for you to perform dermaplaning. (Editor’s note: For a complete list of contact information for each state, log on to www.SkinInc.com/education/statelicensing.) Legality aside, it is advisable to only offer this procedure if you are working under the direction of a physician. The most common superficial chemical exfoliation methods include alpha hydroxy acids (AHAs) and beta hydroxy acids (BHAs). AHAs include glycolic, lactic, malic, tartaric, mandelic and citric acids, and many AHAs, specifically glycolic and lactic, are widely used in chemical peeling agents. These can be used on their own or combined with other acids. AHAs work by dissolving the intercellular lipids and proteins that hold dead skin cells to each other. The percentage for use by skin care professionals is as high as 30% and as low as a pH 3.0 in most states. The common BHA in superficial peeling agents is salicylic acid. Salicylic is known for its lipid-soluble properties, making it a great option for oily and acne-prone skin. Estheticians should not go higher than a 20% acid when applying only one layer. Salicylic has a keratolytic effect; it assists in the break down of comedones by reducing the dead skin accumulation in sebaceous follicles. Superficial to medium-depth peeling treatments often include Jessner’s and trichloroacetic (TCA) acid. These two peels have been used by physicians for many years. Modified and blended versions of these peels are now available for skin care professionals; however, it is still recommended to check with your individual state guidelines. Estheticians must use caution as excessive amounts of these peels can cause side effects and even permanent damage. Always follow the manufacturer’s instructions on application techniques. As a general rule of thumb, if someone is concerned with photodamage and doesn’t mind the possibility of visible peeling, then these peels are more commonly used. It is vital to remember that no other treatment should be performed with these peels. This includes omitting pre-treatment exfoliation, such as microdermabrasion, dermaplaning or post-treatment facials, extraction and massage. Managing client expectations is a difficult, but important task. Before proceeding with any treatment, you must become very familiar with your clients’ goals. Regardless of how effective the treatment is, clients will not be satisfied if their hopes for the treatment are not met. This is all part of the consultation process. Following are answers to questions that commonly come up during consultations with clients who are interested in receiving an exfoliating treatment. These will help in not only gauging your clients’ needs, but also in distinguishing if the treatment recommended will ultimately meet their goals. Does the client want to see visible peeling to validate results? Skin care professionals know that exfoliation occurs at a cellular level and there is no need to see visible peeling, but your client may feel differently. Educate her on the exfoliation process and, if the client is a candidate for a stronger exfoliation, this will likely make her happier in the end. On the other hand, if the client wants a full facial including extractions and massage, you can always boost the facial by adding a superficial exfoliation including AHAs or BHAs, or even a light pass of microdermabrasion or dermaplaning. Is the client nervous when you say the words “acid” or “peel?” These terms can be scary for some. Clients may relate it to a TV episode—such as the infamous Sex and the City episode where Samantha gets a chemical peel resulting in a deep burn—or physician-level peels, from which there is a significant recovery period. In the case of a nervous client who may be uncomfortable receiving a treatment, avoid pushing them into receiving it. Be certain the client knows all possible side effects and precautions before any treatment takes place. You can always graduate a client into stronger services down the road once trust has been developed. Is the client sensitive to touch or certain products? If a client is sensitive to touch, physical exfoliation methods, including microdermabrasion and dermaplaning, should be avoided. These clients will likely respond better to a chemical exfoliation method. Conversely, if sensitivities to products are a concern, a physical exfoliant would likely be a safer choice. Dermaplaning is an option as long as the blade does not contain nickel, which can cause irritation on overly reactive skin. Microdermabrasion, with a diamond tip or aluminum oxide crystals, can also be used. Neither of these methods are likely to cause a chemical reaction on the skin. Has the client received any exfoliation treatments in the past? Maybe she has experienced great results with BHAs in the past and you know it would be a good choice for her skin. Alternatively, if a client has experienced a negative reaction to a past treatment, it should be excluded from your choices. Does the client need to physically feel exfoliation to be sure the treatment is effective? Although estheticians know that a chemical exfoliant can provide a better result than a mechanical one, in many cases clients want to experience a method in which they physically feel the dead skin being removed. If the treatment is appropriate, you can provide it for them, but it may be valuable to educate them on why an alternate treatment would be better in the long run. Another option is to add a mild chemical exfoliant to introduce the client to this type of treatment and to boost its effects. The same idea goes for those who need to feel a product tingle to believe it is working. Does the client have outdoor events or vacations coming up? If the client will be exposed to the sun or warm weather, only a surface exfoliant should be carried out in order to cut the risk of side effects or complications. The same rule applies if the client has an important event in the upcoming 10 days. Although most clients tend to visibly peel within three to five days following an exfoliation treatment, that is not the case for everyone. Educate clients thoroughly about the risks involved, and explain that you are recommending the best option for their skin at that time. There are many important details that accompany choosing the correct treatment to ensure client satisfaction. Remember: Client safety should always come first. If there is any sign of hesitation from the client or yourself, it is best to postpone an exfoliation treatment until you are both comfortable. A thorough understanding of treatment options and administering an effective consultation is crucial to making clients happy and loyal.  Terri Wojak has been an esthetician for more than 16 years. As the esthetics director, business manager and lead educator of True U Esthetics, she lectures at multiple esthetic conferences each year and is frequently published in industry magazines. She has trained more than 1,000 estheticians and medical professionals in the art of advanced skin care with a specialization in techniques used in a cosmetic medical setting.   For further education on this topic, check out Terri Wojak's video, Exploring Mechanical Exfoliation Techniques, a part of the Skin Inc.'s Video Education library.  Fitzpatrick Skin Type Classification Scale     Skin Type Skin Color Characteristics White; very fair; red or blond hair; blue eyes; freckles Always burns, never tans White; fair; red or blond hair; blue, hazel or green eyes Usually burns, tans with difficulty Cream white; fair with any eye or hair color; very common Sometimes mild burn, gradually tans Brown; typical Mediterranean Caucasian skin Rarely burns, tans with ease Dark brown; Middle Eastern skin types Very rarely burns, tans very easily Never burns, tans very easily  ",
    "datetime": "May 28th, 2013",
    "url": "https://www.skininc.com/treatment/medspa/article/21881650/are-you-choosing-the-right-exfoliation-method-for-your-client"
}