{
    "title": "Artist K-Tee tries to create beauty from ‘objects of evil’ | London Evening Standard | Evening Standard",
    "text": "News | London An artist has created sculptures inspired by deadly weapons in a bid to make them “beautiful”. The fibreglass objects — which are 2ft tall — were modelled on US hand grenades used during the Second World War. K-Tee, an artist from Hemel Hempstead, was commissioned to make them by celebrity art dealer and presenter Jeff Salmon. The most expensive of the works, which cost between £3,500 and £8,000, features 11,000 Swarovski crystals in a camouflage pattern. Salmon, who presents Channel 4’s auction programme Four Rooms, said: “Last year I was watching a CNN bulletin about the troubles in Syria. I wanted to see if hand grenades could ‘de-evilised’ and I got K-Tee to see if she could come up with one of her wonderful concepts.” He said since going on display at Decoratum, his gallery in Marylebone, they have caused a “massive stir”. K-Tee, 36, who also works as a prop maker for Hollywood films, helped to make the guns used by Tom Cruise and Emily Blunt in their movie Edge of Tomorrow. “It was all about taking what is an object of evil and flipping it on its head and turning it into something completely different,” she said. “Clearly hand grenades really should not exist at all, like anything which kills other human beings. My aim was to make use of these objects and turn them into something beautiful.” Clingy fans should let Doja Cat wear what she wants Future of Hipgnosis founder Mercuriadis in doubt as board launches strategic review Mat Collishaw: Petrichor at Kew: old and new warped to unsettling effect Will England have enough to get past the Springboks? MORE ABOUT Have your say... 1 boxing 30,760 Tyson Fury vs Francis Ngannou: Fight time, undercard, latest odds, prediction, purse and ring walks 2 football 23,471 Gary Neville convinced there is a 'problem brewing' behind the scenes at Arsenal 3 black friday 14,584 Best Currys Black Friday deals to expect 2023: Offers on smartwatches, washing machines and more 4 crime 7,241 Lewis Edwards: Paedophile police officer who incited girls to send degrading pictures is jailed for life 5 london 6,199 Clapham resident's makeshift Shetland pony enclosure sparks complaints from neighbours ",
    "datetime": "2014-08-14T16:51:42.000Z",
    "url": "https://www.standard.co.uk/news/london/artist-ktee-tries-to-create-beauty-from-objects-of-evil-9669869.html"
}