{
    "title": "As K-beauty brands saturate Asia, Japanese prestige brands gain ground",
    "text": "It may seem like Korean beauty brands are taking over the world, but beauty brands from Japan are giving them a run for their (hard-earned) money. As unbelievable as it may seem, given the ubiquity of K-beauty (or even K-beauty-inspired) products these days, J-beauty brands have been around longer—and Chinese consumers, after a momentary fascination with trendy K-beauty brands, are turning back to their J-beauty staples. As reported by Jing Daily, Korean beauty conglomerate AmorePacific, which owns 33 brands and is the 14th largest cosmetics company in the world, suffered a 76% drop in net profit in the final quarter of 2017. According to the company, the decline resulted directly from a significant drop in the Chinese market. A recent report from L2 on beauty in China also found that the digital visibility and sales of J-beauty brands were growing at a faster rate than K-beauty brands in 2017. Though South Korean culture has dominated the zeitgeist of Asia in recent years, from K-pop stars to Korean dramas to K-beauty, there is a backlash to the saturation: “K-beauty brands like to use celebrities who have done a lot of cosmetic surgery that indicates a value proposition about women that I cannot agree with any longer as I am getting older,” 29-year-old Rita Chen, a Chinese woman living in London, told Jing Daily. Here’s a short history of K-beauty: French brands have long dominated the international beauty landscape, and back in the 1990s, some of them manufactured their products in South Korea. But eventually, they found cheaper options elsewhere, leaving South Korea with empty, ready-to-go beauty laboratories and manufacturing facilities. And so now we have K-beauty: technologically and scientifically innovated, packaged attractively for your Instagram, and cheaper than the European predecessors. “[W]hen I was growing up, Korean skin creams were all the same shade of toilet-paper pink, and they smelled like Glade PlugIns,” Euny Hong, the author of The Birth of Korean Cool: How One Nation Is Conquering the World Through Pop Culture and a former contributor to Quartz, wrote in the New York Times. “Any Korean with means used French and American cosmetics (and the Japanese brand Shiseido).” Contrary to popular belief, Korean beauty brands didn’t invent the sheet mask—they only popularized it and made it more accessible. Long before you could buy sheet masks at Sephora, the Japanese SK-II Facial Treatment Mask was a red carpet prep favorite of A-list Hollywood celebrities. At $95 for a pack of 6 individual, one-time-use masks, though, the SK-II sheet mask was (and is) too expensive for most people to be anything but a special occasion indulgence. And yet, despite the plethora of sheet masks available these days, no other brand has been able to boot the SK-II sheet mask from its throne. As noted by CB Insights, Japan has “strong beauty traditions that emphasize rituals, simple regimens with multi-purpose products, and skin-supporting foods.” And while Korean beauty brands tend to use teenybopper Korean celebrities in their marketing campaigns, Japanese prestige brands like Shiseido and SK-II have been reaching out to older women and launching empowerment campaigns. (Cate Blanchett is a spokesmodel for SK-II, which launched a campaign in China examining the stigma against single women in their late 20s, while Shiseido last year became the first Japanese company to work with UN Women to promote gender equality in Japan.) The L2 report, as Jing Daily notes, also mentions Dr. Ci:Labo, Fancl, DHC, and Pola as other popular Japanese beauty brands in China. The return of Japanese beauty products in China isn’t just due to the saturation of K-beauty products; it’s also a result of diplomatic developments. China made up 38% of the K-beauty market in 2016, but that number is decreasing as China-South Korea relations continue to sour. Chinese women are looking for brands that resonate with both their national and individual identities, and Japanese brands like SK-II and Shiseido are speaking to their desires. Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  ",
    "datetime": "2018-03-13T08:01:43.082Z",
    "url": "https://qz.com/quartzy/1226815/despite-the-boom-in-k-beauty-brands-japan-is-still-asias-true-beauty-leader"
}