{
    "title": "Asian Beauty Finds - Asian Supermarket Beauty Products",
    "text": "Every item on this page was chosen by an ELLE editor. We may earn commission on some of the items you choose to buy. Photos: Robin Black, BeautyIsBoring.com Something those Discover L.A. commercials don't tell you: Besides spotting celebs at Starbucks (enjoy your latte, Selena!), you can also source major beauty finds in L.A.'s many  Asian supermarkets. Or Asian supermarkets anywhere, of course. \"They're one of the best places to stock up,\" says celebrity makeup artist Robin Black, who helms the gorgeous blog Beauty is Boring when she's not dabbing lipstick on Lorde, Gisele, and Cindy Crawford.  \"My mother is from Japan, and as a kid, her family would bring this stuff over when they came to visit. When I started working as a makeup artist, and I realized you can buy some Asian 'beauty secrets' in downtown L.A., I was so excited.\" We were, too—especially when Black offered to take us through L.A.'s compact Little Tokyo district in search of her ultimate beauty picks. Here's what we scored at Make Asobi, Marukai Market, and Little Tokyo Cosmetics, all on 2nd Street in downtown L.A.  (Confession: I also bought some My Melody stickers. And by \"some,\" I mean 40. Please don't judge.) Photo: Dolly Wink Side Lashes by Dolly Wink \"Japan has the market cornered for amazing faux lashes.  They come in every size, shape, color, and style you can think of.  Plus the higher end Japanese brands tend to hold their shape for longer than their Western counterparts. I particularly like the Dolly Wink, outer-corner-only lashes, because they look much more natural than a front-facing fake lash.\" Get Them Here: About $16 on Amazon.com Related: 10 Editor-Approved Foreign Beauty Products to Try Now Photo: Robin Black, BeautyIsBoring.com Silk Worm Cocoons \"If you have sensitive skin and want an all-natural gentle exfoliator, try them!  These are very popular in Korea, and are touted for their anti-aging properties.  They are sold in sterile packs, and no harm comes to the worm. Soak the cocoon in warm water for anywhere from 3-15 minutes (depends on the brand), then pop it over your finger and gently rub it over your clean face.\" Get Them Here: $4.99 on Amazon.com Photo: Peripera Peripera Peri's Tint Jelly Stick      \"These lip stains come from Korea, and you can find them in most Asian stores, plus now at Urban Outfitters. They look neon green, turquoise, and yellow in the tube, but they change color on the lip to create pink, fuchsia, and coral shades.  They have great staying power, and they feel like ChapStick when you apply them. Another great Korean lip stain is Etude House Color Lips Fit, it has an unusual matte finish and stays put for hours.\" Get Them Here: $12 at Urban Outfitters Photo: Etude Etude Strawberry Sponge Hair Rollers \"Speaking of Etude, they're known for their crazy cute packaging. At the very top of the cuteness scale are their Etude House Strawberry Sponge Hair Rollers. Worth a Google, for sure.\" Get Them Here: $4 at Kollection K Photo: Clio 24-Hour \"Tattoo\" Eyeliners from K. Palette, Dolly Wink, and Clio \"There's a whole category of 'tattoo' eyeliners.  I've tested them, and it's true—once they dry, they stay put. I'd advise practicing a few times just in case it goes badly awry and then stays like that for the full 24 hours! (Though I have gotten them off—eventually—with very good makeup remover.)   The Clio Waterproof Pen Liner in Kill Black is the ultimate find for cat-eye fans. It's extra-extra black, and known for it's ability to hold a perfect line even on oily lids.  It's often sold out at shops, so I order it online.\" Photo: Dear-Laura.com Pa Nail Polish \"The tiny bottles come in a huge variety of shades that reflect the current trends in Japan.  Get ready for polish types like 'milky glitter,' an overwhelming array of colors, and just about any finish you can imagine.  My friend Madeline Poole, the nail artist, turned me onto these!\" Get Them Here: Dear-Laura.com Photo: Tatcha Charcoal Blotting Papers \"True, you can get blotting papers at any Sephora or beauty supply store, but there really is a difference between those and the ones from Asian supermarkets. Japanese women have been using blotting papers for hundreds of years, and they have the art of the perfect blotting paper down.  My personal favorite is the Tatcha, but many brands make charcoal blotting papers. They're great if you live in a humid climate or are acne-prone.\" Get Them Here: $15 at Skinstore.com Photo: PurCotton Japanese Cotton Swabs \"Think all cotton swabs are created equal? No. Once you've tried the Japanese version, you'll be a convert.  They're denser than ours, and they come in different shapes for different uses.  My favorites are the ones that are individually wrapped with a pointed tip on one end (perfect for cleaning up a cat eye) and a flattened oval on the other (ideal for smudging pencil liner or blotting lipstick).  Because they're wrapped, you can stash them in your clutch for emergency touch-ups.\" Get Them Here: $10.50 on eBay, or at many Japanese supermarkets Compressed Face Towels \"So these look like a poker chip or a large mint. But spray them with rose water, or dip them under a running faucet, and they transform into cotton face towels.  I like to keep a few tucked in my bag for travel or on-set face washing.\" Get Them Here: $16.50 at Ali Express Eyebrow Razors \"Here's an instant eyebrow fix without the redness or pain of tweezing. These are a must for backstage runway, pre-red carpet, at photo shoots, and in your bag just in case you catch sight of a random hair in the rearview mirror on your way to a date.\" Get Them Here: $5.99 at SleekHair.com Related: 44 International ELLE Editors Pick the Best Beauty Products      Faran Krentcil is a fashion journalist and critic based in New York City. She is the founding editor of Fashionista and a graduate of Duke University. Her work has been published in the Wall Street Journal, Vogue, Harper’s Bazaar, and more. Simple Nail Designs for Your Manicure Mood Board 14 Vanilla Perfumes That Smell Absolutely Amazing 13 Best Japanese Skin Care Products to Shop For Breast Cancer, 40 Is the New 50 Meet YSL Beauty’s Most Unconventional Scent Yet Amazon Is Having a Major Beauty Sale Right Now Why Matrix Could Be the Next Best Skin Treatment The Best Neutral Nail Colors for Every Skin Tone Claudia Sulewski Launches CYKLAR Beyoncé Is Finally Releasing a Perfume A No-Damage Routine for Colored Hair First Class Beauty 2023 A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2014-11-06T11:00:00Z",
    "url": "https://www.elle.com/beauty/news/a15185/asian-supermarket-beauty-finds/"
}