{
    "title": "Avon targets Russian market first with new K-beauty collection - Global Cosmetics News",
    "text": "TRENDING: Posted by Louise Prance-Miles | Dec 14, 2018 | Asia & Australasia, North America, Products | Avon has announced the launch of its first K-beauty collection, with the products being launched into Russia first before rolling out across Europe in early 2019. The move is part of the company’s ongoing transformation strategy, with the range of masks and hand creams being made within Korea. Developed in partnership with Korean innovation experts, Avon has teamed up with Bonne, a ‘leading developer and manufacturer of luxury beauty.’ Louise Scott, Avon’s Chief Scientific Officer, said of the new collection, “Korean beauty is expected to hit $13.1 billion by 2020* – it’s the fourth largest skincare market in the world. “Avon has a rich history in world-class innovation and when combined with something as on-trend as K-beauty and the digitisation of our business it’s exciting for our customers and Representatives. The K-beauty collection brings innovative formulas and authentic ingredients that we do not have anywhere else in our portfolio. It’s a thrilling evolution in our mission of making top quality products available to everyone.” The products include ingredients such as cica, chaga mushrooms and Hydrogel, with the products being free from mesh or nets. Share: Rate: LATEST NEWS Unilever settles in trademark dispute ov...   Walgreens to settle Rite Aid suit for US...   L’Occitane Q2 2024: Sales rise 17....   Two Target executives to retire   Gillette signs up for another season as ...   PRESS RELEASE: Society of Cosmetic Chemi...   L’Oreal to dump Decleor in derma shake-u...   Hermes Q3 2023: sales up 16 percent to €...   Amazon to face lawsuit over data trackin...   J-beauty retailer Yoshitsu to open store...  GLOBAL COSMETICS NEWS Contact UsSubscribePrivacy PolicyCookie PolicyTerms & Conditions SOCIAL MEDIA FacebookTwitterInstagramLinkedInSoundCloudRSSYouTube NEWS HomeAll Regions Cosmetics News WirePodcastOpinionFashionProfessional BeautyTravelWellnessTop 100 Brands Copyright © 2023 Global Cosmetics Media Limited ",
    "datetime": "2018-12-14T06:14:06+00:00",
    "url": "https://www.globalcosmeticsnews.com/avon-targets-russian-market-first-with-new-k-beauty-collection/"
}