{
    "title": "Backstage Beauty Report: Punk-Rock Owls at Alexander McQueen Fall 2014 | Allure",
    "text": "By Sophia Panych When it comes to beauty, a hairstylist told me this week that there are two very distinct types of fashion shows these days: the shows where models look real and natural, and the shows where they look totally out-there. Alexander McQueen is a show of the latter variety. You'll never wear the hair and makeup you see on the runway—and that's exactly the point. Instead, the beauty look adds to the story of the collection, creates a character, and really wows the audience. The feathered lashes designed by makeup artist Pat McGrath didn't just wow, they rendered every beauty editor backstage speechless. \"There were references of nature, so we were playing around with the shape of an owl eye,\" McGrath said of her inspiration. \"Then when I saw the clothes and realized there was a punk, Victorian London feel to them, we decided to do the whole owl thing in a punk makeup way.\" McGrath and her team painstakingly applied thin black feathers one by one along the lash line and along the brow bone. One model told me she was in the chair for almost three hours. But not everyone got that look; most of the models actually went lash-free, their faces sculpted and highlighted in shades of silver, gold, bronze, and brick red. Call it futuristic contouring. The hair also had a futuristic vibe, cornrowed around the curve of the head with two very long strands hanging down from the ears on either side. So I was surprised to hear from Guido, the hairstylist, that his inspiration was the Elizabethan era and the DNA of the McQueen brand. \"This is something Alexander actually really liked, to have something very short and very long in the same hairstyle,\" said Guido. \"He always liked the extremes.\" RELATED LINKS: • Look We Love: Warrior Chic at McQueen • McQueen Exhibit Moves on—Leaves Us Remembering • Designer Faces: Christian Dior Fall 2014 By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Gabi Thorne By Chelsea Avila By Gabi Thorne By Gabi Thorne More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2014-03-05T09:00:00.000Z",
    "url": "https://www.allure.com/story/backstage-beauty-alexander-mcqueen-fall-2014"
}