{
    "title": "Banila Co. Brings New Twist to K-beauty – WWD",
    "text": "Banila Co. is one of the top-selling brands in South Korea. The company is zeroing in on the U.S. market for growth of skin care with plans to add cosmetics. subscriber The influx of brands from South Korea keeps building in the U.S. The latest, Banila Co., which just launched an e-shop on Amazon, offers a new twist — simplicity. “We are different. Our products are hybrid — simply four steps, 0,1,2,3, versus the K-beauty 10-step regimen,” said Banila Co. USA general manager Juhan Kim. The shortened process could hit the mark with America’s Millennial and Generation Z consumers who lead busy lifestyles and haven’t been brought up with the Korean skin-care traditions, said Nadia Kanwal, the U.S. marketing representative for Banila Co., a subsidiary of Seoul-based fashion company F&F. “We make it easy and practical, especially for Millennials who don’t have time for the complicated rituals of Korea,” she said.  Even with its simplified approach, Banila is one of the top-three cosmetics brands in South Korea, according to Kanwal. The line has been available in America through Peach & Lily and Soko Glam but is now rolling out a selection of 24 items on Amazon. Related Articles\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tFashion Scoops\n\t\n\n\n\n\t\n\t\t\tGwyneth Paltrow to Pick Up Honor for Goop at CFDA Fashion Awards\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tLegal\n\t\n\n\n\n\t\n\t\t\tPrada, Amazon Team to Combat Counterfeits “We have a strategy to penetrate the U.S. market under the Banila Co. brand,” Kanwal said. “The U.S. is the most diverse market in the world and very important for us to understand. We’re blending in with the U.S. behavior,” Kanwal said. She hopes to duplicate the success in South Korea where one Clean It Zero item is sold every three seconds globally. Additionally, while K-beauty is certainly a trend right now, Kanwal believes Banila is “here for the long run.” This summer, Banila will bring its makeup line B. by Banila to the U.S. as well. Founded almost 13 years ago, Banila Co. operates 80 flagship Banila Co. stores and 100 doors throughout Asia. While e-commerce is the priority for Banila, the company doesn’t rule out physical stores down the road. The hero of the lineup offered on Amazon is Clean It Zero Original, an all-in-one makeup removing cleansing balm that sells for $21. K-beauty is associated with unique delivery systems and Clean It Zero is an example. The hypoallergenic sherbet cleansing balm dissolves into a smooth oil when massaged into the skin to remove all residue and impurities without stripping the skin of essential oils. Acerola and herbal extracts stimulate blood circulation while nourishing the skin to maintain optimum levels of moisture balance. The formula was created for all skin types. Banila Co. prices range on Amazon.com/banilaco from $6 for a sheet mask and up to $30 for their Dear Hydration Boosting Cream. The lineup does not contain parabens, sulfates, phthalates or alcohol.   Sign up for beauty news straight to your inbox every day Top News Stories Alerts Straight to your Inbox. Send us a tip using our anonymous form. WWD and Women's Wear Daily are part of Penske Media Corporation. © 2023 Fairchild Publishing, LLC. All Rights Reserved. ",
    "datetime": "2018-06-11T17:41:42+00:00",
    "url": "https://wwd.com/feature/korean-beauty-powerhouse-banila-co-brings-simplified-approach-to-u-s-1202702604/"
}