{
    "title": "Beauty queen raises $20K for homeless man who helped her get home",
    "text": "Thanks for contacting us. We've received your submission. A homeless man has embodied the spirit of Christmas by offering a student his last $5 so she could get a taxi to get home safely after a night out. Dominique Harrison-Bentzen, 22, was so touched by the man’s gesture of kindness, she is now spending 24 hours on the street to raise money for him to rent his own apartment. Her campaign has been retweeted by former Stone Roses frontman Ian Brown. The British beauty queen has already raised a staggering $20,000 for the good Samaritan, who is known only as Robbie. Harrison-Bentzen told The Mirror the homeless man stepped in to help her after she lost her ATM card during a night out in Preston, in Lancashire, England. The University of Central Lancashire student said, “I suddenly realized that I had no money and a homeless man approached me with his only change of £3 ($5). “He insisted I took it to pay for a taxi to make sure I got home safe.” RT @CurlyClaire13 Please donate £3 to help Robbie #Prestonshomelesshero get a deposit for a flat http://t.co/WblgiEjrUL — Official Ian Brown (@ianbrowncouk) December 10, 2014  Harrison-Bentzen, a finalist in the Miss Preston beauty contest, was so touched by his act of kindness that she ended up posting a status on Facebook in a bid to track him down to thank him. “He has been homeless for seven months through no fault of his own and he can’t get work due to having no address,” Harrison-Bentzen told The Mirror. “And I simply can’t just give him the money, I have to go through the right channels. So I will be spending 24 hours through the day and night as a homeless person to understand the difficulties they face each day.” It turns out that Robbie’s good turn was not just a random act of generosity — the homeless man has come to the aid of many people in Preston, returning missing wallets to pedestrians and offering his scarf to keep freezing locals warm, The Mirror reports. Harrison-Bentzen said she didn’t end up accepting Robbie’s offer — but wanted to pay him back for his generosity, to her and others who have since shared their stories. ",
    "datetime": "2014-12-17T15:34:32+00:00",
    "url": "https://nypost.com/2014/12/17/beauty-queen-raises-20k-for-homeless-man-who-helped-her-get-home/"
}