{
    "title": "Beauty&You: Shilla reaches for new heights with beauty and accessories concept at Hong Kong International Airport : The Moodie Davitt Report -The Moodie Davitt Report          ",
    "text": "HONG KONG. Shilla Travel Retail (Hong Kong) today hosted the Grand Opening of its Beauty & You concept stores at Hong Kong International Airport, with a strong emphasis on experience, service, digitalisation, new in-store concepts aimed at attracting a diverse audience and featuring many powerful brand executions. Crucially, the stores combine fragrances, skincare and make-up with fashion & accessories, featuring many brand and category adjacencies. This, said the company, aims to redefine the notion of beauty and its treatment in travel retail. Shilla’s licence consolidates the space for beauty and accessories into six stores, from 11 previously, across 35,349sq ft. The largest are in the T1 East Hall South (around 14,000sq ft) and East Hall North (around 12,000sq ft), with the others located in the West Hall, Midfield Concourse, North Satellite and in arrivals. As reported, Shilla won a highly competitive tender for the business in April 2017. Milestone moment for Shilla: The official inauguration of Shilla Travel Retail (HK)’s stores at Hong Kong International today. In attendance were (l-r, in addition to members of K-Pop band Highlight) Hotel Shilla Vice President, International Division Jinhyuk Kim, Hotel Shilla President of Travel Retail Division Ingyu Han, Hotel Shilla President & CEO Lee Boo-Jin, Airport Authority Hong Kong CEO Fred Lam, Airport Authority Hong Kong Executive Director, Commercial Cissy Chan and Shilla Travel Retail Hong Kong Managing Director Alice Woo The striking new store concept and design follows a six-month renovation and is being marked on Thursday by an official inauguration featuring senior Shilla management, Airport Authority Hong Kong, together with brands and media partners – The Moodie Davitt Report is reporting live from the East Hall today via our rolling news service (see our home page). A highlight of the event is a K-pop concert landside featuring popular group Highlight from the Korean music scene. At today’s Grand Opening, Airport Authority Hong Kong CEO Fred Lam said: “I would like to congratulate Shilla once again on winning the P&C concession at our airport. After many months of hard work the refurbishment is now complete. It is even more delightful that with the completion of the renovation we have seen impressive growth in the business. At 14,000sq ft this store in the South pier is the single biggest store at our airport. The reason we devoted so much space is that P&C commands the highest passenger spend at our airport. That means we have high hopes for what Shilla can continue to do in the future. “Apart from the hardware we have made much effort in areas such as online shopping and free home delivery and we appreciate Shilla’s efforts on these initiatives. We look forward, along with Shilla, to offering an unparalleled shopping experience and we wish Shilla and Beauty & You great business in the future.” Hotel Shilla Vice President, International Division Jinhyuk Kim said: “Beauty&You is another great milestone in Shilla’s history of global expansion. Since 2011, the company has been endeavouring to reinforce our presence in the global travel retail industry. By securing the Hong Kong International Airport beauty and fashion accessories concession, Shilla is fortunate to have established a unique and strong position in three leading airports of Asia Pacific.” Korean pride: A today’s Grand Opening were (l-r) Hotel Shilla President of Travel Retail Division Ingyu Han, Shilla Travel Retail Hong Kong Managing Director Alice Woo and Hotel Shilla President & CEO Lee Boo-Jin The stores were designed around the requirements of traveller demographics at HKIA, and offer a number of points of difference from other airports and even other Shilla locations. A highly engaging Curated Zone in the heart of the environment features selected themes and emerging trends and offers a showcase for both beauty and fashion accessories. The New Generation zone houses (among others) popular Korean and Japanese cosmetics lines. Elements for Men is an area dedicated to male products, from grooming and beauty to accessories. ﻿ The store features around 60 brands that are new to the airport. In Elements these include craft brands such as Bresciani, Maglia Francesco and Victrix. In the New Generation zone new brands for the airport include Innisfree, Etude House, Three and Kate, while in fragrances and make-up among the new brands for this location are Eight & Bob, Nars, La Duree and Urban Decay. Shilla Travel Retail HK Ltd Managing Director Alice Woo said: “Beauty&You symbolises our commitment to deliver a comprehensive beauty retail experience and perceived ‘value’ to our travellers and customers. Value is defined as all the elements within our store which are there for everyone to enjoy, including store design, the atmosphere, the comfort, the accessibility, in trend brand offers, digital engagements and pampering customer service.” *NOTE: The Moodie Davitt Report provided instantaneous coverage of the Beauty&You Grand Opening via Instagram Stories – check out the ‘Beauty&You’ Story Highlight on our Instagram page. (Add link to Instagram: https://www.instagram.com/themoodiedavittreport/) Views from the store front: Beauty&You from the many entry points, each offering a different sightline inside     On the tailoring of the stores for HKIA, she added: “Each airport has its specificities and we took them into great consideration during our store concept development and design planning. HKIA welcomes travellers from around the world, and at Beauty&You, our customers represent global travellers and we customise our beauty experience to every individual. With the blend of perfumes & cosmetics with fashion accessories and different engagement zones, our store appeals to not only the millennial travellers with increasing purchase power, but also customers who are passionate about beauty and fashion, and appreciate personalised attention.” Shilla highlighted Airport Authority Hong Kong’s “innovative proposal” to feature beauty and fashion under one shopping “umbrella” and noted that it planned the category adjacencies to maximise cross-selling opportunities.  Icon brands lead the way both left and right at the South store entrance Ms Woo stressed the service element of the store, saying: “To further deliver a holistic retail experience, we have in-store stylists to offer beauty and styling advice that take care of our individual customer needs.” Digital assets also play a big part in bringing the stores to life. These include engaging LED screens at the store fronts that feature both interactive brand messages and corporate signage to lift awareness of the Shilla retail brand at HKIA. Within the stores Shilla aims to engage customers with the use of digital technology; installations include a VR Experience, Make-up Selfie, impactful video screens and digital columns. With a new ‘Get the Look’ digital column, brand partners can personalise and feature their latest and best interactive elements. In the East Hall South store, a ‘Magic Mirror’ feature carries branded messages as customers walk nearby. Curating an experience: The Curated Zone is at the heart of the store and offers branding opportunities to selected partners   Ms Woo said: “With our focus on customer engagement zones and digital assets, we aim to deliver a unique customer journey in the travel retail industry at HKIA.” To date, said Shilla, trading is “above expectations” even with the recent construction period. Despite former incumbent DFS’ challenges at the location, Shilla management was upbeat about its prospects of making money at HKIA. Jinhyuk Kim said: “The year has begun on a positive look with performance over our business plan and we stay optimistic about the profitability for the year. With the strong planning and preparation effort we put in the first year, from our knowledgeable and enthusiastic local and head office teams, and a very strong partnership with brands and Airport Authority Hong Kong as commercial partners, we believe we can have sustainable profitability in the future.” A striking LED screen draws the eye to the back of the store, and neatly separates luxury watches from colour cosmetics in this multi-category concept Talking to a New Generation: Korean and Japanese brands lead Shilla’s approach to younger consumers in beauty        A walk through Beauty&You Guided on a store tour this week by Shilla Travel Retail (HK), the blending of beauty and fashion accessories creates a look and feel that is very different from traditional P&C stores at major airports, writes Dermot Davitt. The key difference stems from Airport Authority Hong Kong’s decision to combine P&C and fashion accessories, prompting the move to blend the categories in its six stores. How this plays out, especially for accessories brands, remains to be seen; with P&C dominating the space it could be a challenge, but Shilla for one is upbeat about the prospects for cross-category merchandising. There are ‘stop’ points right across the store that aim to engage the consumer, newness in both categories through first-time-to-market or first-to-HKIA brands and soon the addition of stylists in each category to offer fashion or make-up tips and grooming advice.   Elements for Men: A fresh approach to male grooming with many new brands from House 99 to Loake shoe accessories and others exclusive to Shilla at HKIA        Consolidating the stores (from 11 to six) offers advantages to Shilla and crucially to the consumer. The retailer can manage stock better with a higher concentration of business in fewer stores, duplication of staff is reduced and the shopper finds multiple categories (from beauty to fashion watches to jewellery to sunglasses) under one roof. As noted above, it remains to be seen how P&C and accessories will affect each other. The promotional plan aims to connect the two in consumers’ minds at HKIA. Certain adjacencies make sense, with luxury watches in their own area close to niche, upscale P&C but separated from fashion watches so their treatment can be more individual, for example. Fashion watches: Consumers want to touch and try, making this a key category near the store front    ‘Hero’ brands and the ‘halo’ effect The main stores (East Hall South and North) open on either side with some of the international ‘hero’ brands from Chanel and Lancôme to Dior and Estée Lauder. These give way to other lifestyle beauty brands on the back walls that Shilla says are positioned “for specific products that have a high level of loyalty” from Shiseido and Clarins to Jo Malone, Kiehl’s, Guerlain, La Mer, La Prairie and others. The back walls of the store guide the consumer through into luxury watches – separated from fashion watches and given their own space close to premium skincare and make-up, offering a quieter zone that at the front where high-end customer can enjoy more private service. In the South store luxury watches are adjacent to a giant LED screen that separate watches and the next category, colour cosmetics, which in turn leads across the floor into the New Generation zone. This dedicated approach with its own ceiling and floor design is mirrored in the other half of the store by Elements for Men. The deep South store pulls the traveller right to the back with the attraction of popular brands among younger travellers such as Whoo, MAC and Urban Decay (though some brands note their distance from the entrance as a challenge in this vast space). A dash of digital imagination: Brands are already responding to the unusual shape of some of Shilla’s digital screens and pillars with their marketing materials The New Generation area also acts as a drawcard for younger consumers but what is also important here is that the focus on Korean brands in particular (a natural focus for Shilla) is not over-done. The company said it was “watchful” about over-promoting the K-Beauty category, noting that “Korean brands are here to stay but the consumer is more selective than ever”. It also notes the emergence of J-Beauty, about which it has learned much from its experience in the ANA-Shilla-Takashimaya joint venture in Tokyo. Shiseido leads the way here but Kosé, Decorté, Three and other brands are performing above expectations, says the retailer, confirming the category’s emergence as a staple of Asian travel retail.  Foero and Dr. Jart+: Among the fast-growing Korean brands that Shilla has made a focus in its New Generation zone  Shiseido, Decorte and Three are among the Japanese brands heading the J-Beauty wave overseas  What is also different is the view from the entrance to the store, where boutique fragrance competes for attention with fashion watches on one side and sunglasses on the other. There is a strong statement from perfume names such as Diptyque, Atelier de Cologne, Bvlgari and Hermès – the aim here is to elevate and personalise the experience and to create a point of difference from the hero brands on either wall. An anchor point close by is the special constructed Curated Zone which acts as a visual anchor for the entire environment – and offers branding opportunities in space that can be personalised and changed using video and sound. Boutique approach: Some iconic fragrance references act as a front of house drawcard for luxury  Although beauty is clearly the dominant category by space, some of the fashion elements are heavily prominent. Sunglasses and fashion watches are high touch categories and act as a draw in the early part of the store. There could be stronger visual cues for fashion accessories and fashion jewellery, but we understand further signage will be added to help reinforce their positions in the store.  Shilla has given many leading brands the freedom to express themselves well in the environment And there are true highlights early on too. In a first for the brand, Cartier has combined the best of fragrances and eyewear from its La Panthère in a single collection and display in the South store. This is a major statement from the brand, and underlines how Shilla has encouraged partners to be creative and different in these stores. Carrying off a stylish look: Furla occupies generous space in the store’s centre and added some colourful new designs  Blending fine execution and digitalisation at NARS (East Hall North)  Sustainability and design There are some nice design touches too. The petal motif on the ceilings offers a guide and even a natural feel to certain areas, with the Curated Zone acting as the centrepiece and the ‘leaves’ flowing out from there. This splits the store into recognisable zones – important in a location where ceiling heights only touch 2.4m. There is smart use of what was not all easy space to work with. One pillar in the centre of the store that could have acted as an obstacle has been turned into a display for virtual make-up, housing MAC Lips and proving a big attraction. A new way of presenting fashion accessories: Appealing to the Mainland Chinese consumer with carefully selected brands, from mainstays such as Swarovski and Montblanc to new brands in this environment from Didier Dubot to Fibreno; note the lovely petal effect on the ceilings, which was acclaimed by many visitors to the stores today        Sustainability is key, and each element of the stores was considered with this in mind. That meant local supply of materials where possible and certainly from within Asia; minimum use of heavy materials and state of the art digital ventilation to reduce energy use. The retailer also invested (with AAHK) in a new sustainable cooling system for these stores, meaning it’s the first time in 20 years (according to Shilla) that there are no complaints about the high temperatures. Luxury watches: Situated in the heart of the skincare and make-up area but mirroring these categories’ luxury focus Travel retailers often struggle to attract consumers to the back of the store, but the brands deep in Shilla’s South store offer a strong showcase and will hopefully attract shoppers into this area (above and below)    The price proposition in these categories is broad, with many entry level items to complement the luxury offer. This, said Shilla, comes from addressing certain needs (men, millennials) when planning the store. It should (hopes the retailer) also mean that basket sizes will increase as shoppers add to their planned purchases with impulse buys, notably in accessories.   A visit to the East Hall North store confirms a similar approach to the store layout but with some key differences to the slightly larger South store. The funnel effect of the store design means that visibility from the front is difficult in some places. Shilla has responded by hanging signage so that brands stand out farther back, with Jo Malone’s sign and chandelier an excellent example. Hanging signage acts as a guide within the larger South and North stores, framing the classy executions of skincare brands (above and below)    The store strategy is broadly the same here with early emphasis on boutique perfumes, eyewear and fashion watches, though it is adapted for the consumer in this environment. In the South store, Cathay Pacific’s diverse customer base demands a broad-based offer; in the North store there is a firm emphasis on the Mainland PRC traveller. Brand such as NARS and Swarovski are located only in the North store, placed for their popularity among this vital travelling nationality. Tom Ford: A consistently strong performer, with a big presence in colour here Daring and colour from Shu Uemura and Benefit  The wonderful Atelier Cologne brands is a highlight of this Curated Zone, with accessories acting as an impulse category close to P&C throughout. Pilot project: Melody Ng tests out one of the virtual make-up screens that add a sense of play in the store  Beyond this store, arrivals is not only about the best sellers but also carries a strong emphasis on new brands too, notably in cosmetics and sunglasses. Sunglasses offer an anchor towards the front of the stores     There is much to consider in this new type of store environment, a first of its kind for Shilla and for Hong Kong International. How will fashion accessories perform as the more subdued category in space dominated by P&C? How will each impact on the other? How will New Generation and Elements for Men zones work? Certainly we could see consumers staying in the environment longer, attracted by the multiple categories but also by the many digital assets they can play with. New brands too will play their part alongside the traditional mainstays of the business, and there is a welcome emphasis (though not over-emphasis) on Korean and Japanese brands. Visibility is good in the South store in particular, though in such deep stores will consumers find their way all the way to the back? Some brands have expressed concerns over this but Shilla remains confident that it can allay them with promotions, stop points and blending strong established brands with emerging names throughout. Ultimately of course, the consumer will decide. A selection of key brands’ executions, underlining the primacy of beauty, but complemented by accessories dotted throughout       Multiple Highlights: Members of K-pop band Highlight, Shilla’s latest ambassadors, tour the store before playing a short concert for a legion of fans in the landside area during the afternoon  *More content to come soon; also, watch out for a special edition of The Moodie Davitt e-Zine in July to mark the inauguration of Shilla’s stores at Hong Kong International Airport. To advertise, contact Sarah@MoodieDavittReport.com Follow The Moodie Davitt Report on Linkedin:  Share this article: ",
    "datetime": "2018-06-28T06:39:00+00:00",
    "url": "https://www.moodiedavittreport.com/beautyyou-shilla-reaches-for-new-heights-with-beauty-and-accessories-concept-at-hong-kong-international-airport/"
}