{
    "title": "Beauty Hack: How to DIY a Chic Hanging Organizer for Your Hair Supplies | Glamour",
    "text": "By Beth Shapouri What better way to tell your mom \"you raised a smartie\" on Mother's Day than with the gift of DIY organization? It's the gift that keeps on giving, really. So if your mama has a stash of loot that needs wrangling, you might want to make her this cute little hanging basket idea to tuck all her beauty supplies into. Here's how: Step 1: Gather your supplies: Four hanging cutlery caddies (here we used Ikea Fintorp Cutlery Caddies), 8 feet of all-purpose clothesline (or another kind of rope), and scissors. Stept 2: Find the center of the piece of rope. Leaving about an 8\" drop, tie each side of the bucket in a single knot around the loop of the metal ring that holds the bucket in place. Step 3: Leaving an 8\" drop on both sides, continue to tie the rest of the buckets onto the rope using the same single knot. Make sure they hang evenly (if not, just adjust the placement of the knots before moving on to the next). Step 4: On the last bucket, tie a double knot to keep the planter firmly secured and cut off the excess rope. Fill up with your hair accessories and hang in the bathroom, ideally against a wall or door to keep it steady. Now that you know how to make a planter organizer, find out how to make a chic bag for your hair-dryer. No more ugly cords just hanging out on your counter! By Elle Turner By Ariana Yaptangco By Elle Turner By Elle Turner More from Glamour See More Stories © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Glamour may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "datetime": "2014-05-06T16:02:00.000Z",
    "url": "https://www.glamour.com/story/beauty-hack-how-to-make-a-cute"
}