{
    "title": "Beauty and vitamin chocolate: Carmit Candy",
    "text": "Or wait... News Manufacturers Markets Ingredients Processing & Packaging R&D Regulation & Safety Commodities Retail & Shopper Insights Editor's Blog Industry Voices Promotional Features Site Archive Multimedia Sectors Chocolate Candy Gum Biscuits Cocoa & Sugar Site Archive Multimedia Trends COVID-19 E-commerce 3D Printing Cocoa Flavanol Science Health & Functionality Sustainable Sourcing Seasonal Emerging Markets Premium Natural Colors & Flavors Smart Technology Site Archive Multimedia Big Brands Mars Lindt Perfetti Van Melle Nestle Mondelez International Hershey Ferrero Yildiz Holding Lotte Site Archive Multimedia Resources Type of resources Events All Events Shows & Conferences Online Events Editorial Webinars Events Processing & Packaging Podcast  27-May-2013\n                            - Last updated on\n                                30-May-2013 at 10:53 GMT Related tags\nMilk chocolate\nNutrition\nChocolate The company’s ‘Grow Strong’ milk chocolate coins contain calcium and Vitamins D3 and K. Speaking to ConfectioneryNews at Vitafoods in Geneva, Adrian Sagman, vice president of international sales and marketing at Carmit said:​ “It’s a milk chocolate for children on a daily basis to get some calcium in their body.​ “This one also has a tooth-friendly sugar ingredient so the parents don’t have to worry about their kids taking too much sugar.” ​The product is sweetened with evaporated cane juice, palatinose. Asked why the company chose coins, he said it already had the technology to produce this format. “This way it is portion controlled, it’s foiled and keeps for a fresh format.” ​He added the chocolate could also be made in bar or slab form. Calcium and vitamin content​ Each 6 g milk chocolate coin contains 150 mg of calcium. According to the Food and Nutrition Board, the recommended dietary allowance​ (RDA) for children aged 4-8 is 1,000 mg or 1,300 mg for those aged 9-18. Calcium has a string of European Food Safety Authority (EFSA) authorized health claims including ‘energy-yielding metabolism’ and ‘muscle function’ when a product is a ‘source of calcium.’ To be a  ‘source of calcium’​ a product must contain 15% of an 800 mg recommended daily allowance per 100g – which is 120 mg. Carmit’s coin also contains Vitamin D3 which aids calcium absorption. There is 5 mcg of vitamin D3 and 15 mcg of vitamin K in each coin. The EU has set the RDA for vitamin D at 5 mcg. The Food and Nutrition Board has set the recommended dietary allowance for Vitamin K at 55 mcg for 4-8 year olds, 60 mcg for 9-13 year olds and 75 for 14 to 18 year olds. Beauty chocolate: Antioxidant coins​ Carmit Candy’s  ‘Antioxidant-Rich Dark Chocolate Coins’ use the ’beauty’ ingredient Astapure from Algatechnologies. AstaPure is a form of astaxanthin, which Algatechnologies derives from red algae grown in Israel. “On its own it tastes like seaweed – but we mask it and dark chocolate is a very good way to mask it.”​ A series of attempts have been made to win an authorized health claim for astaxanthin including for beneficial effect on the immune system, blood cholesterol and joint maintenance, but all have been rejected. Each coin contains 1 mg of the ingredient. Sagman said that two coins were needed to get the desired effect. He said the product was for adults so the firm decided to sweeten the product with sugar, but added that a sugar-free version was possible. Copyright - Unless otherwise stated all contents of this web site are © 2023 - William Reed Ltd - All Rights Reserved - Full details for the use of materials on this site can be found in the Terms & Conditions Related topics\nIngredients\nChocolate\nHealth & Functionality\nOutsourcing Show more Posted by M.Zohurul Alam,\n                03 July 2013 - 06:29 GMT Report abuse On-demand webinars ",
    "datetime": null,
    "url": "https://www.confectionerynews.com/Article/2013/05/28/Beauty-and-vitamin-chocolate-Carmit-Candy"
}