{
    "title": "Beauty Brand Memebox Just Raised $66 Million To Boost Rapid Expansion In China, U.S.",
    "text": "South Korea’s online beauty retailer Memebox today announced it has raised a substantial $66 million in funding, led by previous investors, Formation 8, Goodwater Capital and Pejman Mar Ventures. Founded in Seoul and now headquartered in San Francisco, Memebox is one of the world’s fastest-growing online beauty startups, stretching from its home base in South Korea to the far larger China and U.S. markets. Founded four-and-a-half years ago, the company now sells more than 1,200 Korean brands on its site, and in the last year launched four in-house product lines, sold at prices that target shoppers in their late teens and early 20s. Sales in China and the U.S. have grown quickly, and Memebox President Arnold Hur says those two countries now account for more than half of the company’s revenue. Just last March 80% of its revenue was generated in South Korea, though the country still remains its biggest single market. Memebox got its big break in 2013, when it became the first Korean company selected by Y Combinator for its sought-after program for startups. The U.S.-based incubator provides guidance and seed funding, and connects founders with its network of venture capitalists. Cofounders Dino Ha and Doin Kim moved from South Korea and lived in a hostel in San Francisco’s Japantown to be closer to Silicon Valley; the pair raised a modest $500,000 by the end of that year. In March of last year the company raised $29 million from investors at what was reported to be a $100 million valuation. Last year’s investors included \n  \nYahoo\n cofounder Jerry Yang, Y Combinator, FundersClub, Cowboy Ventures, Altos Ventures and Winklevoss Capital, in addition to the firms involved in the latest, Series C round. Memebox would not disclose the valuation at which the funding was raised, only to say it was at an up round. It also didn’t go into the ownership details of its founders or its president, who also has a stake. Hur, who met Ha through mutual friends and kept in touch for 7 months before joining the company in 2014, says the fresh capital will be used to open more brick and mortar stores and expand into other markets. He says, however, that it’s especially focused on monetizing data and identifying key trends. “We’re getting a ton of engagement from tens of millions of 18-to-24-year-olds [who are] clicking and sharing all over our platforms, and what’s great about this is we can use these data points to understand what the emerging trends are before they actually take hold in the market.” The company is not yet profitable but says it aims to be by next year. As of early 2015, Memebox employed a staff of 250, the latest count the company gave. It now has a manufacturing hub in Pangyo, located on the outskirts of Seoul; but it started as a subscription-based delivery service, similar to U.S.-based Birchbox, partnering with cosmetic companies to provide samples to customers in return for consumer feedback (perhaps an easy pitch for Korean manufacturers, who are known to be generous with cosmetic samples). In January 2015, Memebox pivoted from the subscription model and began operating as a traditional e-commerce platform and now sells both its in-house brands as well those from other manufacturers, including brands from South Korea’s No. 1 cosmetics company, AmorePacific. “We want to make an open platform, we [sell] great products, wherever they come from,” says Hur. “We want our products to compete based on merit and based on what consumers want rather than just pushing and forcing [our own] products. We want to work with third party brands as well as our own brands.” Today, with nearly all of its sales generated from the new model, it shows no signs of slowing down. Memebox says based on the sales of the second quarter, its generating revenue at a rate of $150 million a year, a 280% jump over the same period a year earlier. Since securing the $29 million funding last March, the beauty brand has launched 540 different items under four product lines and has two more lines on the way. These in-house products now bring in more sales than its third-party brands. It opened an R&D center in the Pangyo Techno Valley and two stores in Seoul (one just opened Saturday), with a third slated to open in September. For now these outlets stock only in-house brands. The focus, however, is largely on mobile which accounts for 83% of its revenue. Since its launch, the Memebox app has been downloaded more than 4 million times. More than half its traffic comes from 18-to-24-year-olds. They’re enticed, for example, by short tutorial videos that are posted on the Memebox Facebook page, often made by members of YouTube’s beauty community. These videos have garnered 70 million views so far this year, according to Memebox. Hur says, “That’s more than L’Oreal, Benefit Cosmetics and H&M have combined in Asia and the U.S.\" It’s also struck partnerships with China’s largest video-streaming platform Youku and Chinese e-commerce giant JD.com which has bolstered its presence (and its sales) in that particular market. “[In the U.S.] K-beauty is still small [compared] with the larger beauty industry, but we see that as a potential [for growth] and I think all the signs are there… it’s not just Asian [consumers],” says Hur. “We have more Spanish-speaking customers than Korean, Japanese and Chinese combined here.” Memebox’s soft-spoken founder, Ha, says, “Our customers have not changed. From day one they were looking for products that could empower them more. So we’re all about discovery, whether [it comes] from offline [or online], our brands or third-party brands, it really doesn’t matter. The purpose for why they come to [us] is always the same.” But if Memebox is taking on China and the U.S., there appears to be an emerging player poised to tackle Southeast Asia. South Korea-based Althea is capitalizing on the country’s pop culture phenomenon, Hallyu (Korean Wave), which continues to sweep the tropical region and for years has been aligned with the marketing trends of South Korea’s beauty industry. In May Althea closed a $3.5 million Series A round of funding, which will go toward expansion. Launched in July 2015 by its CFO Jae Yoon Kim, along with Frank Kang and Christopher Cynn, former employees of South Korean e-commerce site Ticket Monster, (Ha has also worked there), the company sells Korean cosmetics at discounted prices and is reported to be active in Indonesia, Malaysia, Singapore and the Philippines. It plans to enter Thailand and Vietnam by the end of the year. Kang says the company is also looking to launch its own product line by early next year. Southeast Asia’s Internet economy is projected to grow six-fold, to $200 billion annually, in nine years, according to a May report published by Google and Singapore’s state-owned investment firm, Temasek. Correction: An earlier version of this story indicated that Memebox had a staff of 250 at the time of this post. The company later said the count was as of early 2015.  ",
    "datetime": null,
    "url": "https://www.forbes.com/sites/gracechung/2016/08/09/beauty-brand-memebox-just-raised-66-million-to-boost-rapid-expansion-in-china-u-s/"
}