{
    "title": "\n\tBeauty in all its glory - The Hindu\n",
    "text": "To enjoy additional benefits CONNECT WITH US October 26, 2014 07:37 pm | Updated May 23, 2016 07:31 pm IST COMMents SHARE READ LATER Women of the Halakki Vokkaliga community Their wrinkly tanned skin forms a contrast to the smooth layers of beads they wear, much like Africa’s Masais. Their saris, casually tied like sarongs, their white hair fluttering in the wind, their lips sometimes paan-stained, some toothless, walking into the waves at sea, standing in their paddy fields, or sitting around in a circle in a community meeting, these grandmotherly women are a picture of intrigue. There’s a woman in a purple sari, tied like a towel across her chest. She’s wearing about six layers of black bead chains over another six layers of yellow bead chains. She’s sitting in front of her traditional pillared red-oxide floored house. Broken tiles, dirty walls, an umbrella hung up here, a towel hung up to dry, a shirt hung up there, a sewing machine peeping out from behind a pillar, children peeping out of a door. Bangalore-based photographer K. Venkatesh tries to capture the older and more traditional women of the Halakki Vokkaliga community of Karnataka in all their raw and unabashed beauty. “Fringes of Civilization” talks about the tribe found in parts of Karnataka, who live around forest areas of the Uttara Kannada, Shimoga and Dakshina Kannada districts of the state. Over a period of three days, using a community member as an intermediary, Venkatesh shot the women in villages surrounding Honnavara, Ankola, and Gokarna. “They otherwise don’t agree to be photographed,” he says. He wanted to photograph them to portray his idea of beauty, and who a “sundari” is — it’s a theme that has run through Venkatesh’s works starting from the time he photographed a transgender beauty contest. The Halakki Vokkaligas are among the prominent tribes of the state and are even sometimes considered aboriginals of the state. The women of this tribe wear bright-coloured buds and flowers in their hair. Their jewellery includes beads, necklaces, nose rings, and decks of glass and metal bangles; the jewellery was mostly made of stones and natural fibre. They wear short saris, bareback, without a blouse. Their clothes are designed to help them adapt to the climate and work with ease. And this may be the last generation of women to wear them, as the young ones have moved on to salwar-kameez and tights. There are about 50 photographs on display at the exhibition, of which half are in black-and-white and the rest in colour. The exhibition is on at the Karnataka Chitrakala Parishath, Kumara Krupa Road, from October 27 to 30, 10 a.m. to 7 p.m. For details on the photographer check\n>www.beyondfocus.in COMMents SHARE photography\n\n/\n\nFriday Review\n\n/\n\nThe Hindu MetroPlus BACK TO TOP Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. ",
    "datetime": "2014-10-26T14:07:36.000Z",
    "url": "https://www.thehindu.com/features/metroplus/events/photographer-k-venkatesh-documents-the-halakki-vokkaliga-womens-traditional-dress-and-jewellery/article6533134.ece"
}