{
    "title": "Beauty and the Beast – review | Theatre | The Guardian",
    "text": "Mat Fraser is discussing his disability. Assured it was safe, his mother took the drug thalidomide to counter morning sickness in early pregnancy. Fraser was born with phocomelia. He has foreshortened arms and no thumbs; later in the show, Fraser will point out that it is the human thumb, some say, that separates us from the beast. For the time being, Fraser continues to explain himself: \"I'm small and perfectly deformed.\" Then Fraser's wife, the burlesque and performance artist Julie Atlas Muz, explains herself: \"I'm American,\" she deadpans. Playfully mixing their own real-life love story with fairytale (\"Any story told three times becomes a fiction,\" opines Muz), the pair explore the dark heart of the famous Beauty and the Beast story. Along the way, they prick our uncomfortableness around disability, gradually unrobe to reveal all, plunge into the dark thickets of the unconscious and suggest that some beasts are never going to turn into princes however hard you kiss them. But hey, that doesn't mean you can't have true love and great sex. As if to underline the latter point, the final sequence is like an X-rated saucy seaside postcard brought to life, all bouncing boobs, waggling bottoms and phallic fruit. Maybe best to leave the kids at home. There are nods to Jean Cocteau and Disney in Phelim McDermott's production, which cleverly entwines appealing, homemade animation and puppetry (fine work from Jess Mabel Jones and Jonny Dixon) to create a show that both celebrates great gothic romance and also strips away all the artifice to reveal the workings underneath. The show lures you in with dreaminess and then gets all beady-eyed and goaty. The moment of transformation here is not when the Beast is suddenly revealed as a prince, but on a New York street in broad daylight when Fraser and Muz realise they simply can't wait to get into bed with each other. Even so, it's not plain sailing for the former Beauty Queen (Miss Coney Island) and the man who realises the career-advancing possibilities of prosthetic arms: Fraser uses them to perform an erotic strip. Muz's mother enquires of her daughter: \"Are you sure you want to marry a cripple?\" The answer is a resounding yes in a show that takes disability out of the theatrical ghetto and presents it full frontal. Did you catch this show – or any other recently? Tell us about it using #gdnreview ",
    "datetime": "2013-12-10T13:50:00.000Z",
    "url": "https://www.theguardian.com/stage/2013/dec/10/beauty-and-the-beast-young-vic-review"
}