{
    "title": "Beauty Beat: Lamise Beauty founder talks K-Beauty | Lifestyle – Gulf News",
    "text": "Kate Wooyeon Park tells tabloid! about her Dubai beauty store You’d never think you’d find a store stocking the finest Korean beauty products amidst packets of ramen, fresh beef, mounds of fruit and frozen kimchi dumplings. Lamise Beauty, the brainchild of Kate Wooyeon Park, is admittedly a little different in that sense. Located within 1004 Gourmet, a Korean grocery store founded by Park’s husband Chang Sup Shin, Lamise Beauty is a little haven where Park curates a collection of lotions and potions right from her home country of South Korea. It’s small but full of heart, and like the grocery store itself, comes from a place of passion and dedication to only the good stuff. In a sit-down interview with Park, Gulf News tabloid! finds out more about the brand and what Korean skincare is all about. How did the idea for Lamise Beauty come about? I moved to Dubai in 2013 after marriage and I had a lot of skin problems — I think it’s because of the water and hot weather. So whenever I go to Korea I bring some products for myself first. Then my friends asked me, ‘what kind of products are you using’? So I just recommended some products — ‘this is good’, ‘this is a bestselling product in Korea — and [they were] like, ‘can you get one of each?’ So it started like that. And more friends asked me ‘can you bring more?’ So I was thinking I could help their skin concerns by making one brand. I realised that people like many brands, but each brand has a bestselling product. So I think it’s better to bring a bestselling product from each brand. Have you always been interested in skincare? When I was young I was really allergic to cold water. My whole skin is very sensitive. So my mother always took care of my skin and if she sees dryness she can’t handle it. So I was very sensitive with taking care of the skin. How do you think Korean beauty and Western beauty are different? Personally, I think Korean products have more variety, so for each skin type [there is something]. Korean beauty has more variety in terms of category and texture, [there are] BB Creams and sheet masks. They research a lot and put a lot of money to make new products. I think this whole beauty culture makes companies want to make new and good products. One thing I’ve noticed is that Asian beauty products aren’t as expensive as Western products. Yeah, I really think so. The core of K-Beauty is affordable price, high quality and variety. Are you planning to get into the make-up side of things, or are you sticking to skincare? My motto is skincare first. If you have good skin then your make-up will be glowing also. I want to focus on skincare first and I’m meeting with a lot of make-up companies. In the future I’m going to bring more make-up products. What has the reaction been to Lamise Beauty? Do you think people in the Middle East are receptive to K-Beauty? I realised that there are a lot of people who are interested in Korean beauty products but they don’t know where to buy it and where they can experience it. What I want to do is more like... I want them to come here, see, smell and feel the texture [of the products]. A lot of people buy it online and don’t get a chance to see it or try it beforehand. And these days there are a lot of fake products. So if they just order online you can’t check if it’s fake. What are the most important skincare steps? I think cleansing is the most important thing, and then hydration. So you can use a serum or a cream for hydration. And protecting [the skin] from the sun. Go get yours Lamise Beauty and 1004 Gourmet are located in Onyx Tower in The Greens. Get Breaking News Alerts From Gulf News We’ll send you latest news updates through the day. You can manage them any time by clicking on the notification icon. Dear Reader, This section is about Living in UAE and essential information you cannot live without. Register to read and get full access to gulfnews.com By clicking below to sign up, you're agreeing to our\nTerms of Use\nand\nPrivacy Policy Forgot password or ",
    "datetime": null,
    "url": "https://gulfnews.com/lifestyle/beauty-beat-lamise-beauty-founder-talks-k-beauty-1.64463417"
}