{
    "title": "\r\nBehind the success story of K-beauty brand Barenbliss in Southeast Asia",
    "text": "Most Popular G-Dragon booked for drug use South Korea, Qatar agree to elevate ties, forge $4.6b industry partnership Former Olympic hero battles rumors surrounding her groom-to-be S. Korea goes all out to contain lumpy skin disease Yoon pitches S. Korea's investment appeal to Middle East Yoon meets Park, honors father in gesture of conservative unity 4-meter deep sinkhole injures 1 in central Seoul Olympic medalist ‘tricked’ by fiance-turned-stalker [News Focus] A year after Halloween crowd crush, legislation remains stalled Braving wind and high water to celebrate Dokdo Day Start your day with a roundup of key stories from The Korea Herald with news and comment on all that’s happening in Korea. Published : June 9, 2022 - 15:25 Link copied Budding cosmetics brand Barenbliss is garnering success in the Southeast Asian market, seeing rapid growth in online sales and receiving rave reviews from local media less than a year into its debut. In an interview with The Korea Herald, Barenbliss co-founder Jina Kim attributed her brand’s success to its “unique philosophy and insightful observations.” “Every product was produced on the basis of Bare Essential Plus, No Harm Plus, and Bliss Moment, the philosophies of our brand,” said Kim, who is also a makeup artist and beauty influencer. The brand’s business philosophy stresses the use of safe and natural ingredients while pursuing constant innovation, she added. Barenbliss’ lip tint product was named “the most popular makeup item” in Indonesia by local online beauty magazine Beautynesia, and was recommended by beauty editors in large magazines such as Allure and Vogue Korea. Two of its lip products topped the best seller list on Southeast Asian online commerce platform Shopee for customers in Malaysia and Indonesia. Shopee also named Barenbliss as the second most popular makeup brand in Indonesia for 2021. “Inspiration comes from everywhere,” she said when asked about the source of the ideas behind Barenbliss’ successful products. “Flowers, plants, nature, past experiences” are all part of what gives Kim her inspiration. “People, not just women, should be confident in who they are, be optimistic about their future and find a unique style to bloom in their own way,” she said as a message to her customers. “We want to tell people, ‘you can be perfect in your imperfections.’” The makeup artist also talked about Barenbliss’ future plans, revealing that research work was underway to create new and more advanced products. Kim has been a makeup artist for 18 years and has worked with international brands such as Vogue, Marie Claire and Anna Sui. She has also worked with Korean celebrities, including Sistar, T-ara and Red Velvet.By Lee Seung-ku (seungku99@heraldcorp.com) The Korea Herald by Herald CorporationCopyright Herald Corporation. All Rights Reserved.  ",
    "datetime": "2022-06-09T15:18:01+09:00",
    "url": "https://www.koreaherald.com/view.php?ud=20220609000698"
}