{
    "title": "Bella Hadid Taught Huda Kattan This K-Beauty Hack That You Need To Try — VIDEO",
    "text": "Style  When it comes to Korean beauty hacks, you never know what will be trending next. Combining science and all the latest trends, K-beauty comes up with all the best skincare tips and tricks for everyday life. From sheet masks to aqua peeling, some of the biggest U.S. trends comes from abroad, but this might be the most interesting one yet. According to founder of Huda Beauty's YouTube video, Bella Hadid taught Hudda Kattan the K-beauty hack jamsu. This is one makeup hack that you have to see to believe. When one of the world's best-known makeup artists and a major supermodel recommend a makeup hack, you run with it, no matter how strange it may seem. What exactly is jamsu, you ask? Well, as Bustle previously reported, the word \"jamsu\" literally translates to \"diving\" or \"submerging.\" The technique did not originate with Hadid — it's a popular Korean beauty technique for mattifying skin. According to Kattan, the trick is to dunk your face into a bowl of cold water after applying your foundation, concealer, and powder to give your face an airbrushed look. You then pat your face dry and apply the rest of your makeup as you typically would. While Kattan didn't like the trick at first, she did say that it grew on her. Of course, I can't blame her. Dunking your face into water first thing in the morning doesn't actually sound that great. But, according to the video, once she saw how it helped her complexion and set her makeup, she was hooked. There are a few setbacks, though. As Kattan says in her video, jamsu essentially seals the makeup into your pores, which is what gives the airbrushed finish. That means that you should be cleansing your face even better than you normally do and never sleeping in your makeup, according to Kattan's advice. I have to admit, it does seem counter-intuitive to dunk your face in makeup after applying it. But you really can't argue with the results. According to Kattan's video, jamsu made her face look smoother than normal, helping with her texture and pore size. She didn't report on how her makeup lasted throughout the day, but according to Marie Claire, jamsu makes for long-lasting makeup as well. I can't say that I'll be making this tip a part of my morning routine, but, just like the makeup artist, I am eager to try it out for myself. After all, when Kattan and Hadid are saying it works, I guess it's worth a try. Don't just take my word for it though. Watch the video and see for yourself! Choose an edition: ",
    "datetime": null,
    "url": "https://www.bustle.com/p/bella-hadid-taught-huda-kattan-this-k-beauty-hack-that-you-need-to-try-video-61038"
}