{
    "title": "Best Cleansing Tips From Korean Celebrities | Teen Vogue",
    "text": "By Glow Recipe Fall is in full swing, which means that your skincare routine needs a seasonal upgrade. This is the perfect time to trade your summer complexion woes in for a fresh fall glow. Cleansing is considered the foundation of a strong K-beauty routine for luminous, healthy skin. And this step is an art form for Korean actresses and the experts that create their looks, as it’s imperative they keep the skin clear and deeply cleansed especially after hours of wearing makeup. Here are some cleansing tips from Korean celebrities that will totally transform the way you approach this ritual. Cleansing secret from Korea’s top actress Ji-won Ha, one of Korea’s top actresses, has been a recent obsession of ours at Glow Recipe. We love that she breaks the mold by playing roles ranging from a stuntwoman, to an empress, to a lovable character in a romantic flick. While being as versatile as she can be in her acting, her skin has always been flawless. Which is why when we found out that she launched her own skincare line, J-One, we immediately contacted her and the team to bring it stateside on our site and share her skin secrets here. The 3-Second Rule The number one priority for Ji-won is never leaving skin dry even for a few seconds. And this includes taking care of the skin after cleansing so that skin is never left bare and vulnerable to any level of dehydration. Her top secret? Applying J-One’s Jelly Pack immediately after cleansing, for maximum hydration and lifting at the same time. According to Ji-won, misting is another great way to conveniently hydrate the skin, but the rule is to apply a hydrating skincare product within 3 seconds! She also suggests keeping a hydrating mist in the bathroom. Look for a mist that has hydrating ingredients and antioxidants to kickstart a healthy skincare routine, such as this petal-infused mist. Any alerts on your phone will have to wait until you are done with your skincare routine! ‘Tok Tok’ Application Another tip from Ji-won is ‘tok tok’ application. ‘Tok tok’ is a Korean phonetic word for gently patting on the skin. She applies this rule to her entire skincare routine. She rarely uses a towel after cleansing to avoid rubbing on the skin that may be abrasive. Instead, she gently pats the water in, and once again pats her Jelly Pack on her skin for an effective absorption. Cleanse against the grain Hyun-jung Ko is the OG skin ideal of Korean actresses. A prolific actress since the '80s, Hyun-jung is now in her mid 40s and completely owning it, plus has pearly, flawless skin that always makes it look like she just stepped out of a spa. She’s well known for several skin rules, including never turning on the heater even in the dead of winter (it dries out the skin), and cleansing the oilier forehead and nose area first, so that your drier cheek areas aren’t exposed to cleansing agents for prolonged periods of time. Most recently, her tips for cleansing against the grain took Korea by storm. Instead of cleansing from the center of the face in an outwards motion, she uses a foaming cleanser to gently massage the skin in an inwards motion, which she believes helps to deep cleanse her pores more effectively. Don’t Cut Corners Jung Saem Mool is makeup artist to some of Korea’s top stars, including Hyori Lee, BoA, and gold medalist ice skater Yuna Kim. In a recent interview she mentioned that as a makeup artist, she often sees makeup residue left on her clients’ skin from a previous makeup application, even with cleansing. Her advice is to ‘pay attention to the corners’, meaning to take extra few seconds to massage away the makeup and grime that gets caught between the nose and cheeks, under and behind the ear lobes, under the lower lip and chin and the outer corners of the eyes that crinkle when one smiles. An easy way to do this is to use a cleansing oil, since the emollient texture makes it easy to massage the skin without pulling or tugging. Start with your hands Boy bands aren’t shy about their extensive beauty routines in Korea either. Daesung, from the popular group Big Bang, has said that he always starts his cleansing routine by scrubbing his hands for at least a few minutes before even venturing near his face. While you don’t have to go overboard, washing the hands and nails thoroughly before cleansing the face is a great way to ensure you aren’t transferring unnecessary bacteria or grime to the skin. By Lexi McMenamin By Sara Delgado By Anjana Pawa Written by Sarah Lee and Christine Chang, founders of the natural Korean beauty website GlowRecipe.com Related: 3 Acne Treatments You've Never Heard Of By Teen Vogue Style Team By Kara Nesvig By Kara Nesvig By Shauna Beni-Haynes More from Teen Vogue Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Teen Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "datetime": "2016-09-28T16:57:31.449Z",
    "url": "https://www.teenvogue.com/story/best-cleansing-tips-korean-celebrities-beauty-secrets"
}