{
    "title": "Best Natural & Organic K-Beauty Brands -",
    "text": "Publisher - Award-Winning Impact Media - Alt Protein & Sustainability Breaking News Korea is arguably the beauty capital of Asia. For years now, K-Beauty brands have been pumping out innovative, fun and affordable products. They are famous for setting global beauty trends: the sleeping mask, the compact cushion and the sheet mask all originated in Korea. Their speed of new product output has not been matched anywhere and as a results Korea is a mecca for beauty addicts worldwide. As the industry matures, K-Beauty is moving away from the complex 10 step routines and skip-care is the new buzz word. K-beauty has always been ultra-innovative and now part of that is increased efficiency. Skip-care refers to a shortened skincare routine using products that multi-task. Skip-care proponents still maintain that you are still giving your skin with the best possible ingredients what it needs but by using hybrid products. Skip-care sounds good to me as I just don’t have the patience for so many steps anymore. #MomLife Actually, Korea has a thriving natural beauty scene – more and more brands are changing their formulations or producing new products that have natural ingredients. This doesn’t mean they are all clean as many still include questionable chemicals. Having said that there is a fair few that are. The US NGO Environmental Working Group, which rates products and ingredients based on their safety, is surprisingly well known in Korea so there are many brands who promote themselves as only using ingredients that are green (the safest level of rating). Here is a selection of clean K-Beauty products- note that the selection is for specific products or ranges rather than entire brands, as most of the K-Beauty brands have some non-clean product ranges. While some are not available directly in Hong Kong, most will happily ship here. Retro, playful and innovative skincare A well-established Korean brand with bold packaging, Too Cool For School is retro-modern bordering on kitsch with playful products. The heart of their formulations are natural ingredients like rice water and pumpkin seed extract. Their Caviar Lime range is certified vegan and is also their strictest range in terms of ingredient selection- they only use ingredients rated green (the lowest level) on the EWG safety scale. GET IT: Available at various locations including Sasa, Bonjour and Look Fantastic HK. Affordable, fresh and healthy skincare Benton is a natural K-beauty brand that has been around for quite some time now (since 2010, practically ancient in K Beauty terms). Their products are free from PEGs, silicone oils, artificial colours and synthetic fragrances and they use Ecocert-certified natural preservatives. They are also a PETA recognised cruelty-free brand. Benton sits at a very affordable price point and has a wide range of products. In true K-Beauty style they are pushing boundaries of innovation. Not all their products are vegan (skip the snail products) but they do have a decent animal-free assortment. Their new eye cream has been getting rave reviews in Korea.  It uses fermented ingredients which are well-known in Korean skin care as they help to repair damaged skin; it also has strong hydrating ingredients like ceramides, hyaluronic acid and aloe, which is what you want from a good eye cream. GET IT: Unfortunately no retailers in Hong Kong stock it yet but you can get it on Look Fantastic HK, iHerb and Soko Glam. Serious organic skincare using Korean traditional herbs WHAMISA is a natural and organic Korean beauty brand that is EWG verified as well as certified by German natural cosmetics body BDIH. They focus on skincare fermentation technology, natural preservation techniques and botanical formulations with a very high content of organic ingredients. The organic flower toners are their most famous products. They also have a number of sun care products using zinc oxide as their active SPF ingredient. Their range for babies and kids includes a handy sun compact that is oh-so easy to apply on wriggly toddlers. To get it in Hong Kong, try ALAND in Causeway Bay Jeju Island-inspired independent skincare brand The Pure Lotus is a small, relatively new independent brand. It is rare in Korea to find independent brands because most brands, even the newer ones, are backed by a big conglomerate or manufacturer. Whilst this makes for good products, it does mean there is often a lack of the inspiring founder story that you get with so many Western clean beauty brands today. This brand is inspired and based on the Korea’s pristine Jeju Island, and the line’s star ingredient is White Lotus Leaf extract. Pure Lotus offers skincare and herbal teas in keeping with their wellbeing mantra. It is a lovely brand with real attention to detail, of note are the artistic collaborations on their packaging. One problem: not all the brand’s products are that clean – some products include Propylene Glycol, which I would always avoid. A star product which is clean is the Essence with lotus leaf. GET IT: It is not currently available locally in Hong Kong but will ship from the US There is so much choice out there when it comes to K-Beauty products but while there is definitely a move towards cleaner ingredients and more natural formulations, few brands are rigorous about it which means the onus is on the consumer (ie; you) to check individual product labelling. Further, sustainability is not yet high on the agenda of many of these brands, even the clean ones. I am sure this will change soon but for now there is a lot of plastic and serious over-packaging (think several unnecessary layers of wrapping) to ensure products are not damaged, but the result is unfortunately pretty damaging for our environment. Lead image courtesy of The Pure Lotus. British Australian beauty-addict Allie Rooke has spent most of her career in Asia working for the likes of Chanel, L’Oreal and Burberry, building up her extensive industry experience. A clean beauty convert, Allie founded a business strategy consultancy to help her favourite brands enter and expand across the Asian region. Prev Post Salesforce CEO Marc Benioff: “We Need A New Capitalism To Fight Climate Change” Next Post Oxford Study: Healthy Food And Sustainable Food Are One And The Same UK Food Tech Firm Raises £2.3M to Bring Fermentation-Based Palm Oil Alternative to Market This Soap Bar Is Made From Deforestation-Free Palmless Oil And Smells Like The Rainforest Burning 5 DIY Zero-Waste Bathroom Essentials From Toothpaste To Face Masks An In-Depth Look At Soy Sauce, Asia’s Favourite Condiment Latest News Bad Bovina: Food Sector Responsible for 74% of Brazil’s GHG Emissions – With Beef the Major Contributor APAC AgriFood Report: Funding Hits A Low, But Farm Tech & Novel Foods Are On the Rise South Korea Unveils National Plan to Promote Plant-Based Food Industry Green Queen in Conversation: Cultivated Meat Pioneers – Josh Tetrick of GOOD Meat The EU Caged Farming Ban is Now on Hold – Thanks to Aggressive Pressure from the Meat Lobby: Report Future Food Quick Bites: Sizzling Steaks, Parliamentary Protein & Vegan Hot Dogs Featured Content China’s Hang Lung & France’s LVMH Announce Groundbreaking Sustainability Partnership To Accelerate Joint ESG Goal Looking To Start a Future Food Startup? Singapore’s Protein Innovation Centre Is The Launchpad You Need From Plastic Waste to “Green Concrete”: Sino Group  Partners with EcoBricks to Inaugurate Sustainable Solutions for the Built Environment ‘Beef But Better’: Kerry Identifies What Australia Consumers Are Looking From Plant-Based Beef Burgers Kerry Is Helping F&B Capture Asia’s Growing Plant-Based Meat Demand We INFORM. We INSPIRE. We EMPOWER. Founded by serial entrepreneur Sonalie Figueiras in 2011, Green Queen is an award-winning sustainability & impact media platform advocating for social & environmental change in Asia. Our mission is to shift consumer behaviour through our authentic, original and ground-breaking content. Green Queen is an editorially-driven media publication. Over 98% of our content is editorial and independent. Paid posts are clearly marked as such: look for 'This is a Green Queen Partner Post' at the bottom of the page. ",
    "datetime": "2019-10-29T05:15:14+00:00",
    "url": "https://www.greenqueen.com.hk/clean-beauty-monthly-where-to-find-the-best-natural-k-beauty-brands/"
}