{
    "title": "Best Foundation for Flawless Skin - Blurring Korean Makeup Trend | Marie Claire",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. It's like putting a filter on your face. As anyone who's done a little bit of selfie-enhancing knows (which, let's be honest, is all of us), the power of the \"blur\" tool cannot be underestimated. Blemish? Blur it. Fine line? Blend it out. Uneven skin tone? Buff that sh*t into submission. So wouldn't it be better, one could muse, if it were possible to just blur your skin in real life? Enter Korea's latest beauty-trend export, aptly called \"blurring.\" It started with the lips, actually—instead of doing a perfectly-painted, lined pout, the trick was to just use a dab of lip color and blend out. (It's more natural-looking—almost like you just ate a lollipop.) But why not blur the whole face? \"Korean women are finding that in the age of HDTV and up close and personal high-res selfies, your flaws can be clearly seen,\" explains Charlotte Cho, Korean beauty expert and co-founder of Soko Glam. \"So, it's better to 'blur' out your look a bit—using makeup and foundation to blur your blemishes, pores—but at the same time, keep it natural.\" It may sound like a hard concept to execute, but when you break it down, it's actually quite simple. \"It's kind of like making your face look a little cloudy,\" says Cho. \"You're using formulas that disguise fine lines, uneven skin tone, patchy skin, and dark spots, but not so much coverage that you look heavily made up. It's not going to completely cover up that pimple, but it will hide it a bit, making you look bright and natural looking, but not flawless.\" That sounds like almost-Beyoncé to us...and we're more than happy to settle. As far as what you should buy, the market has been infiltrated with blur-stamped options. On the Korean beauty front, Cho recommends Etude House Beauty Shot Blur ($15). \"It does what a primer is supposed to do,\" she says. \"It creates a smooth canvas, but it adds a bit of luminosity to the formula, so there is slight coverage.\" And if you think the blurring technique limits you to products with \"blur\" on the label, it doesn't. Korean favorites like IOPE Air Cushion XP ($33) and the Banila CO CC Melting Foundation ($25.99) are essentially the same concept, offering very sheer, light, and natural coverage that still blurs your face of imperfections, says Cho. Here, see the trend in action: [youtube align='center']https://www.youtube.com/watch?v=8qSCTr9ybkw[/youtube] You should also check out: The Beauty Secrets of K-Pop Stars 30 Cult-Favorite Asian Beauty Products You Need in Your Life How to Give Yourself a Korean Beauty Facial Massage in GIFS Celebrity news, beauty, fashion advice, and fascinating features, delivered straight to your inbox! Lauren is the former beauty editor at Marie Claire. She love to while away the hours at coffee shops, hunt for vintage clothes, and bask in the rough-and-tumble beauty of NYC. She firmly believes that solitude can be a luxury if you’ve got the right soundtrack—that being the Rolling Stones, of course. The actress worked alongside Gabriela Hearst. By Jewel Elizabeth In a world of excess options, Diana LoMonaco invested her life savings into a fashion venture that focuses on just six elevated staples. By Tanya Benedicto Klich “Britney’s book coming out with all the revelations coming from it has not been the best for his anniversary celebrations.” By Rachel Burchfield Healthy strands, here we come! By Gabrielle Ulubay Keep it fresh, my friends. By Gabrielle Ulubay Go ahead and kiss your messy lash glue goodbye. By Hana Hong Rapunzel hair, coming right up. By Gabrielle Ulubay The gift that keeps on giving—literally. By Julia Marzovilla Remember: Your curls are your crown. By Gabrielle Ulubay This is how we roll. By Samantha Holender The best part? They’re so easy to apply. By Samantha Holender Marie Claire is part of Future plc, an international media group and leading digital publisher.  Visit our corporate site.\n©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. ",
    "datetime": "2015-05-07T11:50:08Z",
    "url": "https://www.marieclaire.com/beauty/news/a14363/blurring-beauty-trend/"
}