{
    "title": "Best in Beauty: Top 5 products this month, from Penhaligon's and more",
    "text": "From the overfilled shelves of our bathrooms and the full-length mirrors we sit across blearily every morning picking potions and lotions from overstuffed makeup bags, to you and wherever your stash of serums and creams inhabit, Best in Beauty rounds up the very best products we’ve smeared across our faces and spritzed upon our pulse points this month. I’m a creature of habit, so it only makes sense that I’ve been using the same cleanser since high school. This month, though, things got super busy and repurchasing my holy grail cleanser just slipped my mind. Faced with an empty bottle, I grabbed whatever sample I had in my drawer. That sample turned out to be QV’s Gentle Wash. Tbh, I’d been meaning to give the QV brand a try for a while now, ever since similar drugstore brands like CeraVe and Cetaphil picked up steam on TikTok. Inexpensive and easily available at basically any major retailer in Hong Kong, including Watsons, Mannings and HKTVMall, I knew it would be a godsend if I ended up liking the cleanser. And like the cleanser I did. First, QV’s Gentle Wash is made specifically for dry and sensitive skin, aka made specifically for me. Next, it helps maintain hydration, which is something my skin needs, even in Hong Kong’s ridiculously humid weather (my chin keeps peeling and it’s not a pretty sight). It’s also non-comedogenic so it won’t block pores, which makes it suitable for the unfortunate few with acne-prone skin (me, again). With my previous holy grail cleanser, my face always felt squeaky clean but “tight” after use. With QV’s Gentle Wash, though, my skin simply feels soothed and comfortable after a quick rinse with water. I mean, this has got to be an improvement, right? Anyway, after some research, I deducted it’s because the cleanser contains 15% glycerin, a humectant that allows the skin to retain moisture easily. If you’re looking for a mild, effective and affordable daily cleanser for your face and even body, I can’t recommend QV’s Gentle Wash enough. — Charmaine Ng, Editor Falling under the same category as bug spray and sunscreen, a bite-relief cream is the kind of functional beauty product that’ll work double-time to make routines — no, sorry life — so much better. It’s exactly the purpose of PARA’KITO’s Bite Relief Roll-On Gel, a compact, pocket-size cylindrical bottle of what is about to become the lifeline you need to surviving a humid Hong Kong summer. The clear gel formula — labelled in this edition as “Soothing” — leaves behind a cool, refreshing chill immediately after applying, with a mild mintiness in scent. Designed as a remedy to reduce the itch after nasty mosquito bites, PARA’KITO’s products are made only with plant extracts and can be used on all skin types, including the most sensitive. However unbearable the bite may be, or whatever the pest it was from, this little roll-on will offer all the solace you need. — Lorria Sahmet, Editor Penhaligon’s The World According to Arthur ignites the mental picture of rising incense in a sophisticated wood interior, which is a welcome departure from the olfactory families populating my bedside shelf. Labelled with keywords such as “the East” and “wisdom”, this crimson elixir comes in a gold-tone dragon bottle cap, unsheathing sweet, ambery notes upon your skin while the zenness of incense overtakes the air. I’ve been stealing sniffs at this perfume far too often; here’s my plead for it to be made a home fragrance. — Michelle Chan, Editor Under Hong Kong‘s humid weather, it’s been a challenge for me to keep my skin hydrated without it getting sticky or oily, so I was on a quest to find a product to remedy that. I first tried Rare Skin Fuel’s Activating Mist when I was walking through Causeway Bay. My makeup was starting to melt under the heat so my friend pulled out the mist and asked me to try it on. Like magic, my foundation and eyeliner stayed on for the rest of the day. Made with organic aloe vera juice and anti-aging ingredients, the mist helps calm the skin. It can be used as a toner before face cream, settling spray before or after makeup or a pick-me-up if you’re outdoors and need some hydration. As someone who is too lazy to own too many products, this multi-use spray is perfect for my summer days. — Leanne Lam, Social Media Manager Here's where you can read the latest news and stories from Lifestyle Asia and our sister titles PrestigeOnline and Augustman, curated from all of our editions in Hong Kong, Singapore, Kuala Lumpur, Bangkok and India. Yes, I agree to the Privacy Policy For your daily updates on all things luxury, follow us at @lifestyleasiahk Yes, I agree to the Privacy Policy Subscribe to our newsletter to get the latest updates.  Thank you for your subscription. ",
    "datetime": "2022-06-30T09:12:19+00:00",
    "url": "https://www.lifestyleasia.com/hk/beauty-grooming/skin/best-beauty-products-we-loved-hong-kong-june/"
}