{
    "title": "Best New Skin-Care Products Launching in October 2022 — Shop Now | Allure",
    "text": "By Devon Abelman All products featured on Allure are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission. K-beauty dominates October's new skin-care product offerings. Saturday Skin has a new acai bowl-adjacent cleanser to start your day with; Cosrx has a fresh retinol option for your p.m. complexion ritual, and Medicube finally brought one of its popular at-home skin care devices inspired by a popular Korean injectable to America. Plus, Saro de Rúe just dropped a ginseng-packed elixir in collaboration with a beauty creator Allure staffers love. And that's just about a third of the Korean skin-care products on the list below. Beyond the numerous Seoul imports you can shop this month, October brings tons of exfoliants to the forefront for fall. You can keep flakiness in check with Bloomeffects' new multitasking scrub, smooth things out with a berry-filled delight from Renée Rouleau, or look to Dr. Loretta for a glow-inducing mask. All can be followed up with the array of hydrating formulas debuting this month from the likes of Olay, Stratia, and Rituel de Fille. Need to know about everything stat? Well, October's best new skin-care launches can be perused and purchased below. As for this month's makeup and haircare releases, we've got you on those too. The Olay Hyaluronic + Peptide 24 Hydrating Gel hit shelves this month with a special seal in tow. This fragrance-free formula earned itself a 2022 Best of Beauty award in the Light Facial Moisturizer category for its potent skin-plumping powers. Hyaluronic acid and firming peptides combine forces to deeply hydrate skin while giving it more bounciness and resilience. Ashley Graham loves Fig.1 so much that she invests in the skin-care brand. Its latest launch that she has become a big fan of is the Vitamin C Eye Cream. The caffeine-spiked formula wakes up eyes like an extra-strong espresso shot by depuffing, smoothing, and brightening — impressively all at the same time. If you don't know who Gothamista, a.k.a. Renée Chow, is, allow us to introduce you to her. Chow has long been an expert source of Asian beauty product knowledge on social media, and now, she has her very own collab to show for it. K-beauty brand Saro de Rúe teamed up with Gothamista to create a multitasking essence comprised of exactly 62 percent ginseng extract. Pat on the energizing, antioxidant-rich fluid as your toner and serum steps to help balance, heal, hydrate, and brighten your complexion. In skin-care form, kombucha helps skin fight off dullness, breakouts, and roughness, and you can try it out in all its complexion-enhancing glory with the new Eminence Organic Skin Care Kombucha Microbiome Foaming Cleanser. The gentle, non-stripping formula is the perfect cleanser for getting your skin ready for your a.m. skin-care routine. Cosrx has officially launched its first-ever retinol offerings with two different textures: a cream and this silky, transparent oil. It's infused with 0.5 percent pure retinol alongside moisture-locking squalane and healing vitamin E to get skin glowing. Incorporate it into your skin cycling regimen instead of using it every night to avoid any annoying irritation and flaking. This one's for your delicates — on your face that is. The skin around your eyes and mouth is ultra-thin and sensitive, so they deserve some extra love. A medley of vitamin C, antioxidant-rich avocado polyphenols, and exfoliating fruit extracts help iron out fine lines in those fragile, wrinkle-prone areas while leaving everything deeply hydrated. Medicube's mission to bring popular Korean in-office skin-care treatments to the comfort of your home, no matter where you may be, expands with Age-R Booster-H. We hinted at it back in August, but now the device is finally here to help push your favorite skin-care products deep into your pores like a needleless version of skin booster shots. This pretty pink face wash takes cues from your morning acai bowl to saturate your skin in antioxidants and gentle exfoliators as you cleanse. Once you rinse the Saturday Skin Acai Berry + Oats Antioxidant Gel Cleanser away, your complexion is sure to be glassier, fresher, and smoother. Another exfoliating option to try this month is the new Dr. Loretta Resurfacing Enzyme Polish. It's part physical scrub, part mask for helping your skin slough away everything keeping it from being as radiant as possible. Mara is no stranger to the magic of algae. Allure editors swear by the brand's vitamin C serum that taps algae's skin-soothing benefits. The Mara Flower Acid Algae Serum once again brings calm to complexions while retexturizing with three gentle-yet-effective types of acids: lactic acid (an AHA), polyhydroxy acid (PHA), and bioactive acids derived from flowers, like daisy and hibiscus. Believe it or not, Aquaphor has never been seen like this before. Finally, it's here in stick form, so you can throw it into your purse or luggage without worrying about the greasy ointment getting on everything but your dry skin. Simply uncap it and swipe it onto wherever you need it — new tattoos and eczema flareups included. October's spookiest skin-care launch may just be the most perfect birthday present for the Scorpios in your life. The Rituel de Fille Thorn Milk Hydrating Skin Mist features bubbles of naturally blood-red oils floating in a clear, rose-water-and-aloe-juice base. You can spritz it on as your toner step, as a refreshing spray, or as a dewy setting spray. You'll want to keep the Bloomeffects Royal Tulip Petal Polish in your shower because it can be rubbed onto your face and body. In the jar, the product may appear gritty — thanks to its plentiful helping of sea salt crystals — but as soon as you emulsify it with water, the polish morphs into a creamy foam to help gently smooth and soften skin from head to toe After two years of careful formulation, the Soft Services Theraplush Overnight Repair Treatment is finally here to give your hands… a hand. The rich cream brings colloidal oatmeal, lactic acid, and .05 percent pure retinol to the cracks and crevices of your palms and fingers while you sleep to help make your hands feel like you just got a luxe manicure by morning. When your skin needs an additional layer of nourishment after a long day, the Chogongjin Geumsul Emulsion will swoop in with redness-reducing ginseng, collagen-boosting royal jelly, and strengthening niacinamide to give your complexion a surge of moisture, bounciness, and radiance. Layer it on before a thick moisturizer to make the most of this step. Over the years, aesthetician Renée Rouleau has built a celebrity fan club for her Triple Berry Smoothing Peel, which looks like a jar of jam. Well, the popular mask has a just as delicious-looking new sister that brings the same discoloration-diminishing and illuminating properties to skin in gentle scrub form. Try it out before applying foundation for a smoother, fresher canvas. Your pores are about to be clearer than ever courtesy of L'Oréal Paris' new serum. A trio of brightening vitamin C, hydrating vitamin E, and clarifying salicylic acid kick into action to banish breakouts and hyperpigmentation. On the hunt for a new water-based moisturizer? Perhaps the Kate Somerville Recharging Water Cream will fit the bill. The lightweight formula drenches skin with hydration with the help of hyaluronic acid and vitamin E while spirulina maxima extract brings balance to complexions, especially if it's on the oilier or drier side This new-school twist on old-school cold creams brings wildcrafted ingredients to the rich face wash. Massage it onto dry skin to melt makeup and grime away from skin before wiping it away with a damp washcloth for post-facial-like results. On a mission to cut down on product waste in the industry, Krave Beauty turned a failed batch of its beloved Matcha Hemp Hydrating Cleanser into a limited-edition concoction. The Matcha Hemp Body Wash is housed in a refillable pouch. It has the same enjoyable jelly texture and fun green tint from antioxidant-rich matcha as the face wash that came before it. If you want to even out your skin tone and give your complexion a new gleam with something other than vitamin C, AHAs, or retinol, the Allies of Skin Advanced Brightening Serum offers up an amazing alternative. It relies on a hydrating, soothing blend of mushrooms alongside hefty doses of tranexamic acid and niacinamide to amp up radiance and decrease (and prevent) discoloration. Peptides are the star of Stratia's latest product drop. Five variations come together in this firming, barrier-strengthening moisturizer to keep your skin happy and healthy as temperatures start dropping. It quickly sinks into skin without pilling, so you can layer it on before makeup in the morning or a sleeping mask before bed. Read more about fall beauty: Now, see Quinta Brunson's beauty routine in action: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Sarah Han By Nicola Dall'Asen By Sarah Han By Devon Abelman More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2022-10-17T12:30:00.000Z",
    "url": "https://www.allure.com/story/new-skin-care-products-october-2022"
}