{
    "title": "Beyonce Drops $311K on a Pair of Shoes",
    "text": "SPARKLY! Beyoncé, wearer of blingy naked dresses and itty bodysuits, now owns a pair of heels worth as much as a house. The Birmingham Mail reports Bey bought House of Borgezie's Princess Constellation stilettos for £200,000 (about $311,869). Only one other pair of the 1,290 precious stone-adorned heels has been purchased ever. House of Borgezie owner Chris Shellis was told Bey will be wearing the shoes in a new music video (!!!) out this fall. \"It's the ultimate,\" he said. \"If you want someone to model your creations, you can't get any better than Beyoncé.\" True. The heels, according to Shellis, \"are the crown jewels of stilettos. They're a bit like the 1960s E Type Jag—it doesn't matter what you do, you're not going to improve on them.\" Along with the heels, Bey reportedly bought a £55,000 ($85,716) gem-studded gold basque belt from Jewellery Quarter for the video. Prepare yourselves: Something epic—and sparkly—is coming. Alyssa Bailey is the senior news and strategy editor at ELLE.com, where she oversees coverage of celebrities and royals (particularly Meghan Markle and Kate Middleton). She previously held positions at InStyle and Cosmopolitan. When she's not working, she loves running around Central Park, making people take #ootd pics of her, and exploring New York City. Who Is Cole Tucker, Vanessa Hudgens’ Fiancé? All About Usher’s Girlfriend Jenn Goicoechea All About Lili Reinhart's Boyfriend Jack Martin All About Patrick Mahomes’ Wife, Brittany Mahomes All About Taylor Swift's Dating History All About Selena Gomez's Dating History Simone Ashley’s Boyfriend Constantin ‘Tino’ Klein All About Karol G's Boyfriend Feid Kylie Jenner on Co-Parenting With Travis Scott Kylie Jenner and Timothée Chalamet’s Timeline A Timeline of Kylie Jenner and Travis Scott Justin Is Considering Contacting Britney A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2015-08-03T14:12:00Z",
    "url": "https://www.elle.com/culture/celebrities/news/a29623/beyonce-crazy-expensive-heels/"
}