{
    "title": "Blackpink’s Ice Cream: 3 beauty lessons we learned from the K-pop queens’ colour-bomb music video | South China Morning Post",
    "text": "We’re still recovering from Blackpink’s new music video, Ice Cream. It’s so jam-packed with adorable outfits, feel-good summer vibes and candy-coloured goodness – not to mention 50s Americana – that we needed to watch it a few times to take notes. So strap in and come on a journey with us through all of the looks served up by Jennie, Jisoo, Rosé, Lisa – and of course Selena – as we ask what lessons can be learned, and most importantly, which looks can be stolen. Lesson 1: How to use Asian vs Western beauty trends to your advantage The presence of Blackpink’s new partner in crime Selena Gomez offers a great opportunity for comparing the differences in make-up trends between East Asia and the West. Because while each member of the South Korean girl group has their own distinct style, the pastel-coloured, sweet-as-sorbet vibe is consistent throughout, making it easier to see the difference in interpretations between the Korean and American glam squads. Exhibit A: Their lashes. Natural, thin and feathered lashes as shown on Rosé are the norm for the Blackpink girls, whereas bold, luscious, long flutterers have always been preferred by Gomez. Next, notice the difference in brow game? Consistent with Insta-trends, Selena’s brows are super-defined with a long arch. It works of course, having a lifting effect on her eyes and helping to frame her petite face beautifully. Jisoo, on the other hand (along with her Korean bandmates) sports a softer, lighter brow, and keeps them naturally straighter. This type of brow works to soften the features for a more delicate, feminine look. That’s not where it ends with the eyes, either. There’s a huge difference in eyeliner looks between the band and Selena. The Blackpink ladies are more partial to a thin flick of liner, the perfect look for smaller lids because it opens and accentuates the eye. ﻿ Meanwhile Selena has gone for ultra-bold feline flicks, easy for her to get away with given her features. Finally, let’s take a moment to appreciate how these ladies all killed it with blush and contour. As you’d expect, Lisa and the girls tend to err on the fresh-faced side. Their contour is largely limited to blush, and there is no obvious “chiselling”. This creates a fuller, more youthful look overall. You can see it clearly in Lisa’s look below. On the contrary, Gomez’s blush and contour is very much at the forefront of her look, with a flush of pink on the apples of her cheeks, but applied naturally enough so we’d be mistaken for thinking she’d just finished a workout. When it comes to Western beauty, it’s all about high cheekbones and a flush of colour to warm the face. So whether interpreted by West or East, Ice Cream’s tasty interpretations of the “Hot Girl Summer” theme are gorgeous, and we’re dying to recreate them. Lesson 2: How to apply colour theory In the context of make-up, colour theory revolves around the colour wheel. Understanding the basic concepts of which colours work with which – as well as which cancel each other out – has been put to good use on the girls in Ice Cream. Certain pairs of colours may seem counter-intuitive (we know what you’re thinking: “Blue and orange? Purple and yellow? Green and red? Really?”), but don’t be too quick to write them off. You’d be surprised how well they harmonise when done right. Coincidentally, Blackpink has a lot to teach us about doing colour the right way. Behold, Jennie’s kingfisher-bright eyes here: The juxtaposition of her blue wing with three simple, yellow stars is officially one of our favourite looks from the music video. The look is nevertheless perfectly understated: simple enough to pair with a natural pink lippie and soft brows, yet striking enough to capture our attention. Another of Jennie’s fun looks from the video is this juicy ice-cream colour palette. Think pistachio and strawberry. It features a delectable gradient from pink, to purple to green – the pink-to-purple blend is easy on the eyes, and works well with her skin tone, but the pistachio-green adds a pleasing twist. Colours like these don’t need to be limited to your make-up either. In this look, Jennie goes pink from head-to-toe for maximum fun and, let’s be honest, maximum cute factor. The baby-blue nail art is an inspired choice for accenting the look. Katy Perry would be proud. Lisa’s play on colour theory is a little more spunky. On the red-green/purple-yellow spectrum, she pairs her pink and purple accented hairdo with a yellow-green shadow. Later in the video she’s rocking this absolute show-stopper of a green bob, matching the look with a dreamy monochrome wash of pink over both lids and lips. Even Gomez muscles in on the contrast trend, albeit not with her make-up. No, rather, she pairs her bold fuchsia lippie with a bright green visor for her trip to the ice cream parlour. On that note, if there’s anyone that can pull off a visor like this without emanating major Asian Aunty vibes, it’s Selena Gomez. Lesson 3: How to modernise retro beauty trends effortlessly Let‘s be real – all the looks in this video were a love letter to the 50s. We’re talking victory rolls, pin curls and big hair galore. The best part? Ice Cream shows us how to work a version of the look that doesn’t take hours of styling to achieve. Selena‘s faux victory rolls are a case in point: less sculpted but still able to give off the same look, they’re a much easier way to achieve the pin-up staple. All you need is a middle parting and some volume. Super-long tousled tresses add more movement into the body of the hair and it’s a great way to modernise the look for the 21st century. Jennie retrofies her long, black ringlets with the help of a bandana headband. Jisoo goes down a different route with the bandana, styling it as a bow. Finally, we get to see the whole band in a truly Insta-worthy shot reminiscent of Sandra Dee’s sleepover in Grease. Jennie is working a bouffant that no doubt required some hefty teasing and plenty of hairspray, while Jisoo lets her hair loose and long but throws a bubblegum-pink headband into the mix. Lisa has her hair cropped and curled under, with a big pink clip to keep it neatly behind her ears – all of which can be achieved in next to no time Want more stories like this? Sign up  here. Follow STYLE on  Facebook,  Instagram,  YouTube and  Twitter . Blackpink’s smash music video Ice Cream – starring none other than Selena Gomez – has given us lashings of inspiration for our late ‘Hot Girl Summer’ make-up looks; here’s how you can interpret the look for yourself ",
    "datetime": "2020-09-05T10:00:08+08:00",
    "url": "https://www.scmp.com/magazines/style/news-trends/article/3100279/blackpinks-ice-cream-3-beauty-lessons-we-learned-k-pop"
}