{
    "title": "BLACKPINK's ROSÉ Is the Latest Global Ambassador for a Major K-Beauty Brand | See Photos | Allure",
    "text": "By Sarah Han All products featured on Allure are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission. There's a reason why you rarely hear or witness K-pop idols revealing their beauty routines — their lucrative star power is typically reserved for brand endorsements. ROSÉ (real name: Roseanne Chae-young Park) is many things: a singer, songwriter, dancer, K-pop idol, BLACKPINK member, and YSL darling — but now, she can add one more item to her ever-growing list of accolades: Sulwhasoo global ambassador. In case you weren't privy, Sulwhasoo is one of the most luxurious Korean skin-care brands on the market and is renowned for its scientific research, especially when it comes to the study of ginseng (which Sulwhasoo has dubbed Ginsenomics™). Because this superfood — which has long and widely been used in Asian traditional medicine — is so high in antioxidants, it has a boatful of benefits for the skin. This includes but is not limited to preventing and repairing cellular damage, like brown spots caused by environmental pollutants and sun damage, minimizing redness and puffiness, and balancing oil production, as board-certified dermatologists like Shari Marchbein, MD, and Arash Akhavan, MD, have previously explained to Allure. While I've only been using Sulwhasoo for the past couple of years, there's a certain type of elevated elegance I associate with this brand — and as someone who is a fan of ROSÉ and her lovely, soulful voice, this partnership seems like a match made in heaven. \"It is an honor for me to be with Sulwhasoo as its brand global ambassador of the products, which not only my mom but also myself have been using for a long time,\" the \"Hard to Love\" singer shares in a press release. \"It is such a great delight and pleasant opportunity, and this shooting experience was super fun and inspirational; I am also curious about how today's campaign story would unfold in the future.\" The product at the center of the campaign is the First Care Activating Serum, a product that takes ROSÉ back to her childhood and brings fond memories to mind. In the campaign videos for #SulwhasooRebloom, she shares that the treatment was a skin-care staple of her mom's and later became a mainstay within her own routine. \"I remember Sulwhasoo always had this distinct scent to it and I always felt like it was more than just a beauty product,\" she reflects. To Korean skin-care lovers like myself, First Care Activating Serum is vernacular. It's far from an indie product; for context, we previously reported that one bottle is sold every 10 seconds in Korea, and more than 35 million bottles have been sold worldwide since its launch in 1997. While it doesn't appear to be your average toner — it feels more like a jelly-like serum, texture-wise — it is meant to be applied after cleansing and prior to any other products to rehydrate your complexion and boost radiance. Whether you're a BLINK or simply looking to invest in a new skin-care treatment that'll get you through the colder months, you can shop Sulwhasoo's First Care Activating Serum for $89 at sephora.com, amazon.com, saksfifthavenue.com, and more. Keep reading about Korean skin-care goodness: Now, watch Meghan Trainor break down her most iconic music videos: Follow Sarah Han on Instagram and Twitter, or subscribe to Allure's newsletter for daily beauty stories delivered right to your inbox. By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Nicola Dall'Asen By Sarah Han By Sarah Han By Kara McGrath More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2022-10-18T20:11:21.060Z",
    "url": "https://www.allure.com/story/blackpink-rose-sulwhasoo-ambassador-korean-skin-care"
}