{
    "title": "Blue Ivy: $26K Dress to ‘Beauty and the Beast’ – StyleCaster",
    "text": "By providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. There we were, minding our own business on a sunny Monday in New York City, when we came across some pics of Beyoncé and Blue Ivy heading off to the Beauty and the Beast premiere at the El Capitan Theatre in Hollywood. OK, no problem so far. The mom-and-daughter duo looked adorable, and Bey is definitely rocking a pregnancy glow (serious question: does having twins double the glow?), and … Blue Ivy was wearing a $26,000 dress. Wait, wait, wait. Pause. What?! As E! News pointed out, Blue Ivy’s Gucci dress appears to be a modified version of a seriously pricy number available on Net-a-Porter right now, and though it’s highly likely that Blue got to twirl around in the dress for free (as a loan or a gift), if anyone wants to emulate the five-year-old’s look, they’re going to have to fork over some serious cash.  Of course, this is not the first time Blue has stepped out wearing designer, and it certainly won’t be her last. And, hey, if you’re a celeb and you can wear an exorbitantly priced item to an event without having to pay for it, we get it—sounds fun. Then again, call us crazy, but we’d be down to see little Blue wearing something more tailored to, say, the average five-year-old. Blue Ivy was wearing a pair of white converse, though! And Jay Z went Gucci too, wearing a version of a $5,000 jacket for the night out. So, the moral of this story—the family that wears Gucci together stays together, maybe? By providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. By providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. ",
    "datetime": "2017-03-06T22:00:22+00:00",
    "url": "https://stylecaster.com/entertainment/celebrity-news/665742/blue-ivy-gucci-dress/"
}