{
    "title": "Brazilian Makeup Tips - Fabiana Gomes Senior Makeup Artist M·A·C Brazil Interview",
    "text": "During my stay in Brazil, not only did I get to experience local beauty rituals from messy manicures to sculpting massages and hair burning, but I also got to meet a few local beauties. Namely Fabiana Gomes, the senior makeup artist of M·A·C Brazil and a style icon in her own right, known for her signature red (M·A·C Ruby Woo) lip. Gomes is about all things beauty, and all things Brazil, so naturally we had to have a chat. Related: Brazilian Beauty Secrets, Day 3: The Massage That Makes You Feel Instantly Skinnier What are the makeup trends happening in Brazil right now? Nowadays, vibrant, colorful, bold lips are a must in Brazil. We switched from nude shades to a bubble gum pink shade and now our red retro matte textured Ruby Woo lipstick is the absolute king. What does every Brazilian woman have in her makeup bag? Brazilian's survival makeup kit involves powder for touch-ups, a black eyeliner pencil, mascara, blush, and always lipstick. What is the first makeup women here start wearing as young girls? It's been changing over the years. I would say that my mom and my grandma couldn't go out without lipstick. Now the younger girls go more for stronger eye makeup, such as a smoky eye and eyeliner. Maybe the biggest difference is that more mature women in Brazil used to go to the salon to have their makeup done, while young girls are starting to do their own and they have much more information. Related: Brazilian Beauty Secrets, Day 2: The Messiest Way to Get a Perfect Manicure Are there any beauty tips or tricks that are unique to Brazil? Talking about secrets, the world has discovered most of them by now. But I think our biggest ritual is going to the dermatologist regularly, rain or shine. We also drink fresh juice and eat fruits and vegetables every day, in fact some of them you can find them only in the Amazon and they're high in vitamins, which is great for the skin. There are also a couple of homemade beauty recipes we regularly do, like avocados for a hair mask and exfoliating the skin with honey and oatmeal. What are a few beauty rituals Brazilian women swear by? Of course Brazilian wax and manicure are not considered rituals anymore; it's part of everyday life for us. Related: Brazilian Beauty Secrets, Day 1: Why Brazilian Women Burn Their Hair What are your personal beauty tips and tricks? I use about seven different products for my skin and SPF 50 sunscreen. Sunscreen does miracles for you. Is the look more about emphasizing the eyes or lips right now? Brazilian women definitely could never live without lipstick. They prefer to emphasize lips during daytime and eyes to go out at night. What makes Brazilian women unique when it comes to beauty? They're truly fast learners and they're always interested in getting the latest information and news when it comes to beauty and makeup. They travel more, read more, and have more access than ever before. Brazilians love to look natural overall and love their skin to be healthy. Less than 20 years ago, most women used just soap to wash their faces; now they really take skincare to another level with very consistent routines. They're very confident. 13 Best Japanese Skin Care Products to Shop Amazon Is Having a Major Beauty Sale Right Now Why Matrix Could Be the Next Best Skin Treatment Claudia Sulewski Launches CYKLAR First Class Beauty 2023 The 14 Best Expert-Approved Setting Sprays Austin Butler Doesn’t Think He’s a Beauty Icon Jelly Nails Are Back and Better Than Ever The Best Spring 2024 Beauty Trends to Try Now Add These K-Beauty Prime Day Deals to Your Cart The 20 Best Pore Minimizers for Baby-Smooth Skin Laneige’s Lip Sleeping Mask is on Sale Again A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2014-06-19T17:15:00Z",
    "url": "https://www.elle.com/beauty/makeup-skin-care/news/a19325/brazilian-beauty-secrets-makeup-artist-interview/"
}