{
    "title": "BTS K-Beauty Secrets Revealed: Experts Weigh in on Best Products | Billboard – Billboard",
    "text": "The experts weigh in on how to get that K-Beauty look BTS is known for. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tYasmine Gray There are very few things not to love about Korean cosmetic products: they’re affordable, effective, and now, thanks in part to Sephora stocking brands like Dr. Jart+, Glow Recipe and Tony Moly, accessible in the U.S. “Korean brands work hard to create excitement and entertainment value around their products—there are products out there for just about every possible aesthetic and budget,” Jude Chao, K-beauty expert and editor-at-large of W2Beauty, the world’s first K-Beauty social network, told Billboard of K-Beauty’s growing international popularity. “Since Korean beauty is very skin-focused, the skincare can be really special. The huge variety of brands means there are solid products out there in every category, for every skin type and concern.” Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tTravis Barker & Inkbox Team Up on a Temporary Tattoo Collection\t\t\n\t\n\n\n\n\t09/27/2017\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tExplore\t\t\n\t\n\nSee latest videos, charts and news\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tBTS\t\t\n\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tLifestyle\t\t\n\t\t\t\t\t\n\n\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news BTS Score Top 10 Debut on Billboard 200 With ‘Love Yourself: Her’ Album After news that pop-sensation BTS was launching their own line of skincare, starting with sunscreen —an ultra-important step in K-beauty skincare routines — fans went wild, but many were saddened after learning the harsh reality of limited availability and distribution in the U.S. Luckily, though, Chao says that K-beauty’s effectiveness is much more about the system than the individual products, meaning you still have a chance to achieve the band’s coveted baby-smooth skin. W2Beauty, which has been referred to as the “Facebook of Korean beauty,” came into inception after a group of Asian-American media leaders — Jude Chao, Anna Park, and James Sun — noticed the surge and popularity among K-beauty influencers and supporters in the U.S. and beyond. “K-beauty is not only for Asians or Koreans,” Sun, the first Asian-American finalist on Donald Trump’s The Apprentice, noted. “In fact, the right K-beauty products can be perfect for skin types all around the world. Our team of writers and influencers are Asian, Latina, African American, and we have customers from the Middle East to Latin America to Australia.” So we caught up with co-founder Jude Chao to learn about all things K-Beauty, including which products and regimes she suggests for getting that highly coveted BTS look.  What is the most important step of a K-beauty skincare regimen? Sunscreen! Sun protection is key to maintaining a youthful complexion, but it’s hard to find a sunscreen at the drugstore that doesn’t feel gross on the face. There are so many Korean sunscreens that deliver cosmetic elegance without sacrificing protection, which makes it way easier to actually wear sunscreen every day in the proper amounts. I can’t do that with any typical [American] sunscreen, for example. What are the most popular K-beauty products? Sheet masks are always a huge draw and the most typical K-beauty “gateway drug.” They provide instant results, they’re fun to use, and just like K-beauty as a whole, there’s a sheet mask for just about every taste and every budget. I use a sheet mask almost every night! What is your personal K-beauty skincare routine? The products I use change pretty frequently as I test different items for my job and my personal blog/Instagram, but my overall routine stays the same. It’s more about the system than the individual products. In the morning, I use a foaming cleanser, hydrating toner to plump up my skin, sometimes a lightweight moisturizer, and always a sunscreen. In the evenings, I double cleanse by doing a cleansing oil and then my foaming cleanser, then do a first essence (either Sulwhasoo First Care Activating Serum EX or COSRX Galactomyces 95 Whitening Power Essence), a serum or two, my COSRX Advanced Snail 96 Mucin Power Essence, usually a sheet mask, and then my nighttime moisturizer or sleeping pack. #BTS #????? #LOVE_YOURSELF ? ‘Her’ Concept Photo O version A post shared by BTS official (@bts.bighitofficial) on Sep 6, 2017 at 8:00am PDT From the looks of it, you can never have too much skin indulgence! Below, six of Chao’s most-recommended K-beauty products that you’ll need to get skin like BTS (and every other fresh-faced K-pop star).  Cleanser: I’m into gentle, low-pH cleansers that clean without drying skin out or damaging the delicate moisture barrier. If you’re drawn to luxe, check out Su:m37 Miracle Rose Cleansing Stick. It’s a stick cleanser in a twist-up tube and comes with real rose petals embedded throughout the product! If you want something more budget-friendly, COSRX Low pH Good Morning Gel Cleanser is consistently popular. Toner: Son & Park Beauty Water is beloved among K-beauty fans. This multipurpose toner softens, hydrates, and very gently exfoliates for a super-smooth finish. It can also double as a cleansing water for morning skincare or after workouts. Serum: I don’t think I’ll ever find a serum I love as much as Sulwhasoo Capsulized Ginseng Fortifying Serum, which gives my skin an incredible resilience. I’m also a lifetime fan of COSRX Advanced Snail 96 Mucin Power Essence. For me, it’s THE snail product. It smooths, soothes, and lightly moisturizes my skin while accelerating the healing process when I’m having skin troubles. Facial mask: Skinfood makes some stellar facial scrubs. The Rice Mask Wash Off is a soft and gentle exfoliator that also brightens and moisturizes, while the Black Sugar Strawberry Mask is a sugar scrub that smells like delicious strawberry jelly and gets skin baby soft. Plus they’re dead cheap! Moisturizer: I switch out my moisturizers very frequently, and not all of them make an impression on me. Two that did are Swanicoco Ultra Elastic Vital Cream, which makes my face so incredibly soft that I can’t stop touching it, and Amorepacific The Essential Crème Fluid, which I adore for day due to the way it absorbs fast, like a serum, while giving my dry-ish skin enough moisture to stay comfortable until the evening. Sulwhasoo Overnight Vitalizing Mask EX is my go-to sleeping pack. Never fails to give me bright, glowy, supple skin in the morning! Sunscreen:  Definitely A’Pieu Pure Block Natural Sun Cream or A’Pieu Pure Block Aqua Sun Gel. These very budget-friendly Korean sunscreens are ultra-light, non-greasy, dry down fast, and provide great UV protection for everyday use. Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2017-09-27T17:35:53+00:00",
    "url": "https://www.billboard.com/culture/lifestyle/bts-skin-k-beauty-products-you-need-7980758/"
}