{
    "title": "BTS Is Collaborating With K-Beauty Brand Mediheal on Skin-Care Products | Allure",
    "text": "By Devon Abelman While at a K-beauty store recently, I noticed a sheet mask with Big Bang on the packaging and started wondering why BTS didn't have its own. Well, my (and their fans') prayers have finally been answered. Mediheal, a South Korean skin-care brand, just announced a major collab with the chart-topping K-pop group. That right — we soon may be able to buy sheet masks with the faces of BTS on it (or at least, they will grace the packaging). Oh yeah, and we'll get a little bit closer to having clear, glowing skin like RM, V, Jungkook, Suga, Jin, Jimin, and J-Hope do. (I'm pretty sure it will take more than a sheet mask for my troubled skin, but a girl can dream.) I had a feeling a Mediheal x BTS collab could be on the horizon when RM mentioned the skin-care brand in a previous Allure interview. After asking him if he finds his skin-care routine to be a form of self-care, he said, \"My favorite brand is Mediheal, and it has a variety of sheet masks you can choose from after a long day of work.\" K-pop stars rarely talked about specific beauty brands or products as their go-to. Instead, they stick to calling out product types in hopes of not missing out on endorsement deals. With that in mind, I knew something was up. On top of that, Suga and J-Hope raved about some of Mediheal's masks while doing a livestream back in June, too. The Mediheal x BTS counts as the seven-member group's second beauty collaboration. In October, BTS teamed up with VT Cosmetics on a toothbrush and a Collagen Pact. (Pst, you can shop the latter now on Amazon.) Now, I just need BTS (or just Jimin) to launch a smoky eye shadow palette. Based on Mediheal's Twitter announcement, more info should be coming out on December 19, so stay tuned. This content can also be viewed on the site it originates from. Related stories: Now, check out more K-beauty products that are sure to transform your skin: Follow Devon Abelman on Twitter and Instagram. By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Sarah Han By Gabi Thorne By Sarah Han By Sarah Hoffmann More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2017-12-07T14:47:43.345Z",
    "url": "https://www.allure.com/story/bts-mediheal-collaboration"
}