{
    "title": "Bud Light Donates $500K to Descend on Town, Council Approves - ABC News",
    "text": "Company doubled its original offer to get permit approved. &#151; -- One small mountain town in Colorado is apparently \"up for whatever.\" The town council in Crested Butte, Colorado, approved a special permit allowing Bud Light to take over the town for a three-day event \"of unexpected fun,\" ABC affiliate KMGH-TV in Denver reported today. Bud Light, one of Anheuser-Busch's beer brands, doubled its original donation for the town to $500,000. The event will turn the town into a fictitious one: Whatever, USA. \"Ever since we were first approached by Bud Light earlier this summer, we've been impressed with the creativity and level of detail they've put into the planning process for Whatever, USA,” Crested Butte Mayor Aaron Huckstep said in a statement released by the beer brand. \"This is going to be an incredible event for our community that will help bring the beauty of Crested Butte to 1,000 new visitors.\" Crested Butte was selected because of \"its breathtaking natural beauty and colorful cast of characters,\" according to a statement from Bud Light. The plan had its critics. One resident, former Colorado Sen. Tim Wirth, called the originally proposed $250,000 donation a \"paltry and insulting sum.\" \"My own view is that this is truly an inappropriate function for a town that has built its reputation so carefully,\" Wirth told ABC News. \"It should cost them a pretty penny and they won’t even notice it.\" Bud Light's \"UpForWhatever\" ad campaign began during the Super Bowl, in which random people on the street, seemingly between the ages of 21 and 35, are whisked off to celebrity-laden adventures. In Bud Light commercials for the town of Whatever, USA, there's a fake, bearded mayor. For this specific campaign in Colorado, the company will select 1,000 Bud Light fans across the United States who auditioned with a 10-second video explaining why they should be flown into Whatever, USA. Winners will be notified 48 hours before the trip. The audition deadline is next Thursday and more than 150,000 people have applied so far. The proposed plans include street performers, a parade, music, dancing, closing off the local Big Mine Ice Arena and, of course, lots of Bud Light. \"There are a lot of different opinions in the town,\" town manager Ted Crossett said. \"There are a lot of people who support it and a lot of people who do not for a variety of reasons.\" Crossett's staff report about the weekend describes some of the activities, including \"stumble upon events, which are low impact activities such as games, low-key races and curiosities. Most would be open to the public.\" \"Some would be closed to contestants. Activities would take place on both the street and in private businesses,\" the Aug. 23 report states. Burger King's Crowning Glory Achieved by Owner After Owner Bourbon Industry in Largest Expansion Since End of Prohibition When Sears Was a Retail Star, Not Losing $1B in Six Months Prior to the approval, Wirth said the town council has \"allowed themselves to be put into this dreadful corner\" that has divided the town. He proposed Bud Light pay $10 million to host the event. David Ochs, executive director at the Crested Butte/Mt. Crested Butte Chamber of Commerce, argued that the event will bring an unknown amount of extra cash to local businesses and the town coffers, as the high tourist summer season comes to an end. \"Keep locals working, keep paychecks coming and keep everything rolling,\" he said. \"Bud Light has been very good in incorporating retail businesses into the event, but the real benefit might be in the long term: the exposure and marketing of it is what they will see and want to come back to Crested Butte, and that's our bread and butter.\" Kevin McGruther, a town resident of 18 years, attended the most recent hearing about the proposed event Monday. He said he wasn't arguing for or against the event, but pointed to the local government's failure to adhere to its typical town-event application process. \"The issue is the transparency, the preemption of the process and disenfranchisement of the community,\" he told ABC News. 24/7 coverage of breaking news and live events ",
    "datetime": null,
    "url": "https://abcnews.go.com/Business/bud-light-doubles-offer-turn-colorado-town-usa/story?id=25136291"
}