{
    "title": "Busker Busker Sweeps K-Pop Hot 100 With Eight Top 10 Entries – Billboard",
    "text": "More than a year after the release of Busker Busker's smash-hit \"Cherry Blossom Ending,\" which achieved an unmatched feat by hitting No. 1  K-Pop Hot 100 in both April 2012 and 2013 (an unmatched… By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin More than a year after the release of Busker Busker’s smash-hit “Cherry Blossom Ending,” which achieved an unmatched feat by hitting No. 1  K-Pop Hot 100 in both April 2012 and 2013 (an unmatched feat), three-piece ensemble Busker Busker’s highly-anticipated sophomore album was released on Sept. 25. It has dominated the chart with every track on the album zooming and battling their ways to the top slots. Eight out of the nine tracks entered the Top 10 with the lead single “Love, At First” debuting in at No. 1. Busker Busker’s chart dominance is as follows: Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t10/05/2013\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tExplore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news No. 1 “Love, At First”No. 2 “Too Much Regret”No. 3 “Love Is Timing”No. 4 “Your Lips”No. 6 “Night”No. 7 “Cool Girl”No. 8 “Beautiful Age”No. 9 “Autumn Night”No. 11 “Juliette” Busker Busker’s third No. 1 on K-Pop Hot 100, “Love, At First,” is an emotional guitar-driven rock ballad that moves the band away from their previous musical endeavors of catchy sing-alongs. The lead vocalist Jang Beom Joon transitions seamlessly from chest voice to spiraling falsetto as he expresses letdown of an abandoned relationship while members Brad Moore and Kim Hyung Tae showcase their musical dexterity on drums and bass, respectively. Busker Busker’s compelling blend of impressive musicality, easy-to-follow melodies along with simple lyrics and their signature, low-key charm has placed the group as one of the most leading and successful band in the current Korean music scene.  Despite American-bred Moore receiving some public backlash after a revealing interview with NOISEY where he spoke on the dark side of Mnet’s “Superstar K” (a competition show where the band was the runner-up contestant), the band is still riding high as they launched their nationwide tour, “2013 Busker Busker Concert,” on Oct. 3 in Busan, Korea. The tour will move through several cities in Korea until Nov. 2. Busker Busker move several top K-pop stars, including SISTAR’s Soyou, G-Dragon, EXO and more, outside the Top 10. It will be interesting to see if the singles can regain their place in the Top 10 if Busker Busker’s sales slow down.  Additionally, after a lengthy three-year hiatus, singer/actor Lim Chang Jung logs in at No.5 with “A Guy Like Me.” The track is a soft ballad in a minor key, composed by Baik Min Hyuk with Lim writing and helping compose too. The song is about a man’s struggle of not being able to forget about his old flame.  Elsewhere on the chart, we see new entries from boy band INFINITE, who are in the midst of their world that stops in the United States next month. The group’s new song “Request,” created inconjunction for a deal with Samsung, begins at No. 50 on the chart. While the synthy, ’80s-inspired dance track is not an official INFINITE single, it does see the group reunite with their longtime producers Sweetune, who crafted some of INFINITE’s signature including “The Chaser.”  Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2013-10-05T14:00:00+00:00",
    "url": "https://www.billboard.com/music/music-news/busker-busker-sweeps-k-pop-hot-100-with-eight-top-10-entries-5748071/"
}