{
    "title": "Can These \"Nail Masks\" Save Your Nails After a Gel Manicure? | Allure",
    "text": "By Renee Jacques Gel manicures are a great way to keep go chip-free for a few weeks, but they're not always great for your nails—especially if you habitually peel the gel off at home, rather than getting it removed properly in the salon. But new \"nail masks,\" such as the ones sold by Korean beauty site Soko Glam, contain goat's-milk extract that supposedly strengthens brittle nails, as well as fruit extracts to soften cuticles. A writer for the site tried out a product called Sally's Box Friendly Milk Nail Masks, and she claimed it saved her nails after they were damaged from gel polish. According to the writer, after keeping them on for 15 minutes, the nail masks helped make her \"parched, patchy, and stripped\" nails much brighter and left the skin surrounding her nails softer. We asked Randy Schueller, a cosmetic chemist from The Beauty Brains, to review the ingredient list in the nail masks and he said they appear to moisturize nails due to their \"relatively high\" glycerin content. \"Glycerin is known to be a good moisturizer because it can bind water molecules,\" says Schueller. \"When the nail is moisturized, it's more flexible, so it can stand up to more wear and tear.\" Would you give these nail masks a try? For more information on nails, watch: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Dianna Mazzone By Sarah Han By Nicola Dall'Asen By Devon Abelman More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2015-05-28T09:00:00.000Z",
    "url": "https://www.allure.com/story/nail-masks"
}