{
    "title": "Can This Viral K-Beauty Product Really Erase Wrinkles? - Racked",
    "text": "This site uses cookies. Select \"Block all non-essential cookies\" to only allow cookies necessary to display content and enable core site features. Select \"Accept all cookies\" to also personalize your experience on the site with ads and partner content tailored to your interests, and to allow us to measure the effectiveness of our service. To learn more, review our Cookie Policy, Privacy Notice and Terms of Use. Filed under: A video of the Max Clinic Cirmage Lifting Stick from Korea has garnered 9 million views on Facebook and appears to promise \"second skin\" results right now — but is it legit? The demo clip showed an older woman with deep wrinkles and sagging skin around her eyes. With just a few swipes of the Max Clinic Cirmage Lifting Stick, she was smoothed back three decades — the lines disappeared. The video was posted to a Korean cosmetics group I'm in. Then it was posted two more times. The comments exploded as even the most cynical asked where to buy it. The video has gone on to earn 9 million views on Facebook so far. Racked is no longer publishing. Thank you to everyone who read our work over the years. The archives will remain available here; for new stories, head over to Vox.com, where our staff is covering consumer culture for The Goods by Vox. You can also see what we’re up to by signing up here. I thought it would be interesting only to the skincare obsessed, kind of like the expensive machines nobody ever actually buys that can turn fresh fruit, a tablet, and water into a fairly shitty-looking hydrogel mask. It was only when kpop-obsessed teenage fangirls I follow began retweeting the video into their thigh GIF and thirsty acrostic poems-laden feeds that I realized the Max Clinic Cirmage Lifting Stick was going where snail mucin could only hope to ooze.  By that point, my own Max Clinic Cirmage Lifting Stick had already shipped from Tester Korea, a well-established e-tailer based in Korea that has wildly unpredictable handling times (I've waited more than a month for my order to ship on multiple occasions) and sometimes non-existent customer service. I happened to buy it before it sold out because friends kept asking if I planned to review it. By the third Facebook ding I crumbled like bad highlighter and even slapped down a few dollars extra for slightly faster shipping. My order shipped almost immediately, which was a relief because the Cirmage stick sold out worldwide fast, and sticks were soon offered for pre-order from sites that appear to have self-spawned in multiple languages overnight, bearing Max Clinic urls and sloppily coded product pages, reusing images and videos from Max Clinic's own site. If you must buy your own stick, I'd recommend Global Interpark — also based in Korea and very reputable — which just added the stick to their addictive free international shipping page (it takes about one month for orders to reach the US, in my experience). The video responsible for the trend is suspect as hell. Viewed at 720p resolution on a full screen, it doesn't overtly look like a CGIed mess, but there are signs. Grandma's age spots and stray brow hairs appear more blurred by the middle and end of the clip than at the start of the video; sometimes telltale spots are missing but reappear as more of the stick is applied. This called to mind my favorite comedy genre: the low-budget Korean skincare brand before and after. An image of a model Photoshopped to look like she'd spent a lifetime truck driving without sunscreen or experienced a run-in with a splintered board runs side-by-side with a photo of the same woman plus a scary dose of Facetune. Somehow, these are used to sell products. Photo: Memebox, September 2014 Curious about whether ad models in Korea normally acquire strategic digital blurs mid-video, I asked Janice Kang, Director of Marketing at Club Clio USA, if Korean consumers expect before and after photos and videos to be digitally retouched. Kang said in an email that \"most brands like to use ‘emphasis' to get their points across\" in before and after photos, but that cynical Korean customers would get word out about products that exaggerate their claims. Even surface digging using my three weeks of Korean 101 revealed that word about the stick's actual performance appears to be getting out in Korea. The Max Clinic Cirmage Lifting Stick was released in mid-March, and so far it has an average rating of 1.0 (the lowest rating possible) out of four after three reviews on the Hwahae Korean cosmetics ingredient and review app. That means it's striking out worse than Missha sheet masks, which allegedly burn on contact, according to Reddit reviews. So far, the only positive reviews of the stick I've seen have come from people selling it. When I finally received the Max Clinic stick, I was surprised by how small it is: it's about ⅔ as tall as an iPhone 5. Max Clinic appears to have blown it all on the interestingly shaped container, which has grooves and edges intended to help one perform Gua Sha scraping to stimulate blood flow and lymphatic drainage massage to reduce puffiness. The results are then theoretically locked in using ingredients such as spider web extract and r-Spider Polypeptide-1 (see the box below for the full ingredient list). In the competitive Korean skincare market, products can't just be effective — they need to deliver a \"skincaretainment\" experience that entertains, whether through cute or elegant packaging, or ingredients that range from luxurious such as ginseng oil to the intentionally shocking like spider web extract or Château d'Yquem in $800 face cream.  The stick feels mostly solid both in the tube and on contact with my skin. It has enough drag to pull at my skin rather than gliding over it — think of it as a skincare deodorant stick. The Lifting Stick deposits a tacky, semi-matte coating that eventually loses the matteness and sinks in. Areas with one pass from the stick feel comfortable after about 10 minutes while my forehead, which receives six vertical and two horizontal passes, never loses the tacky sensation and feels like it's wearing a lot of pancake makeup. While at the height of my testing my husband recoiled and told me that I smelled like cheap Soviet laundry detergent. I expected the Cirmage stick to turn my skin into a tight, crunchy mess and pill up on contact with makeup, but that's not the case at all. My skin feels embalmed, which cosmetic chemist Stephen Alain Ko attributes to the many waxes and oils in the product. After about ten minutes, my normal-to-oily skin melts the residue and turns it into an oily mess, negating even the pore-filling and priming properties. What I'm not seeing is any sort of dramatic lifting or even minor smoothing of my fine lines — a few dabs of my favorite eye cream (which happens to be under $10 for a giant tube) do a better job of plumping. My test results were validated by the skin experts I contacted. Dr. David Lortscher, dermatologist (my dermatologist, in fact) and founder of teledermatology firm Curology, said in an email that he has seen \"no commercially available topical product that could produce results similar to the video.\" Instead, Dr. Lortscher recommended that one do extremely sane things not involving spider web extract such as staying out of the sun and using research-backed ingredients like retinol or prescription retinoid, vitamin c, and niacinamide to slow and potentially reverse signs of aging. Ko said he has \"never been able to achieve as dramatic of an effect\" from products like the Max Clinic stick. MIT, Living Proof, and Olivo Labs recently announced a new \"second skin\" silicone-based polymer that's lasting, stretchable, and resistant to water, said Ko — but this isn't that. For all the talk of Korea being many years ahead in terms of skincare technology, Max Clinic hasn't been able to snatch Living Proof's luxuriant wig. Helianthus Annuus (Sunflower) Seed Oil, Ozokerite, Beeswax, Butylene Glycol Dicaprylate/Dicaprate, Polymethyl Methacrylate, Jojoba Esters, Hydrogenated Vegetable Oil, Water, Euphorbia Cerifera (Candelilla) Wax, Octyldodecanol, Nylon-12, Glycerin, Butylene Glycol, Caprylyl Glycol, Hydrogenated Polyisobutene, Diisotearyl Malate, Copper Tripeptide-1, Tripeptide-29, Tripeptide-1, Hexapeptide-12, Nicotinoyl Tripeptide-35, Palmitoyl Tripeptide-1, Palmitoyl Pentapeptide-4, Nonapeptide-7, Palmitoyl Tripeptide-29, Palmitoyl Tetrapeptide-7, Hexapeptide-9, Tripeptide-10 Citrulline, sh-Polypeptide-15, Palmitoyl Tripeptide-5, Diaminopropionoyl Tripeptide-33, r-Spider Polypeptide-1, Acetyl Hexapeptide-8, Dipeptide Diaminobutyroyl Benzylamide Diacetate, Morinda Citrifolia Leaf Cell Culture Extract, Echinacea Purpurea Leaf/Stem Meristem Cell Culture Extract, Narcissus Tazetta Bulb Extract, Lecithin, Polyester-4, VP/Hexadecene Copolymer, Hydrogenated Polydecene, Polyethylene, Sodium Lactate Methylsilanol, Glycine Soja (Soybean) Sterols, Diphenysiloxy Phenyl Trimethicone, Cholesterol, Collagen, Honey Extract, Serum Protein, Gellan Gum, Xanthan Gum, Anemarrhena Asphodeloides Root Extract, Spider Web Extract, Hydrolyzed Collagen, Soluble Collagen, Ampelopsis Japonica Root Extract, Angelica Dahurica Root Extract, Atractyloides Japonica Rhizome Extract, Ipomoea Hederacea Seed Extract, Morus Alba Root Extract, Paeonia Lactiflora Bark/Sap Extract, Silkworm Extract, Simmondsia Chinensis (Jojoba) Seed Oil, Ceteth-4, PEG-5 Rapeseed Sterol, Disteardimonium Hectorite, Alanine, Proline, Pseudoalteromonas Ferment Extract, Serine, Ceresin, Propylene Carbonate, Potassium Cetyl Phosphate, Plankton Extract, 1,2-Hexanediol, Hippophae Rhamnoides Oil, Hydrolyzed Collagen Extract, Magnesium Ascorbyl Phosphate, Panthenol, Tocopheryl Acetate, Xylitylglucoside, Anhydroxylitol, Xylitol, Linoleic Acid, Silkworm Cocoon Extract, Argenine Ferulate, Linolenic Acid, Oil Soluble Licorice (Glycyrrhiza) Extract, Adenosine, Phenoxyethanol, Sodium Hydroxide, Sodium Phosphate, Ethylhexylglycerin, Pullulan, Fragrance. ",
    "datetime": "2016-06-15T10:32:02-04:00",
    "url": "https://www.racked.com/2016/6/15/11937644/max-clinic-cirmage-lifting-stick-review-k-beauty"
}