{
    "title": "Can T-Beauty Become a Dominant Force in Global Cosmetics? | Jing Daily",
    "text": "In recent years, K-beauty and J-beauty have dominated the global market. But today, new entrants like China’s C-beauty and, more recently, Taiwan’s T-beauty have taken the internet by storm. Whereas Korea’s 10-step skincare routine can seem exhausting and time-consuming, Taiwan’s 4-step routine is more in line with the demands of modern professional women. Unsurprisingly, the West has also warmed to T-beauty brands, although common misconceptions regarding them remain widely unchallenged. Firstly, T-beauty is not the same as C-beauty. While both use natural ingredients and herbs found in traditional Chinese medicine, Taiwanese beauty brands also employ local manufacturing processes and ingredients sourced from the island’s suppliers. Meanwhile, the narrow variety of T-beauty product assortments in the West is not because retailers have eliminated Taiwanese cosmetics for being poor performers. The reason is that they cannot access the products, as the online discovery site Beautytap highlights, stating, “T-beauty doesn’t have the massive and government-sponsored PR muscle of K-beauty.” Recommended ReadingIs K-Beauty’s Reign Coming To A Close?By Julienna Law In China, however, some brands like the Taiwanese beauty company Chlitina are already making waves. The skincare company has a growing network of over 5,000 beauty shops in markets such as Taiwan, Mainland China, and Vietnam, according to Cosmetics Design Asia. Second, Taiwan is by no means new to the beauty industry. In fact, the island has a long history of beauty enhancement treatments. More recently, Taiwan manufactured Japanese beauty brands like Shiseido and Kao, according to NBC News. And in 2004, it launched the global skincare phenomenon, My Beauty Diary.   A post shared by 我的美麗日記 (@mybeautydiarytw) Yet, pandemic-related supply chain issues have only worsened the product shortage problem. Some Western beauty e-tailers like Sephora already carried Taiwanese cosmetics brands, but the brand has much room for additional global growth. While Sephora has a strong footprint in Taiwan, its familiarity with local brands means it could easily promote them globally. Likewise, other retailers could do similar. For example, if Ulta Beauty, a chain of US beauty stores, featured emerging Taiwanese brands on its website’s SPARKED section, it could help T-beauty become more desirable. It is well known that independent labels appeal to younger audiences, and e-tailers could potentially unlock a multi-million dollar opportunity with Taiwanese brands. In 2017, Taiwanese cosmetics exports amounted to $730 million, according to data from Taiwan’s Ministry of Economic Affairs — and the growth rate of these exports continues to climb. Western e-tailers who are seeking emerging Asian brands should take note. Aside from cosmetics, Taiwan is also a powerhouse in beauty tech and AI & AR-powered solutions in the cosmetics industry. For instance, Perfect Corp is a leader in beauty AI & AR that offers unique shopping experiences, such as AI-powered virtual makeup, AI virtual hair color, AI skin analyses, AI foundation shade finders and matches, and AI product recommendations. Additionally, Perfect Corp has ventured into the metaverse by launching a metaverse booth at the 2022 Consumer Electronics Show (CES) in Las Vegas. Through Perfect Corp, beauty brands can create virtual SKUs and then activate the AR “try & shop” experience on all their channels. Photo: Perfect Corp Taiwanese beauty has a lot of potential in both the West and Mainland China, especially when the beauty and wellness industry is booming. But, T-brands need to determine the right path between communicating their own brand identity and respecting the cultural sensibilities and demands of the Chinese and Western markets. Additionally, T-beauty brands seeking entry into new markets should more aggressively pursue their investments. Successful global marketing campaigns are expensive, so T-brands could mitigate the risks that come with global expansion campaigns by partnering with the right investors. Considering how venture capitalists have gladly invested in skincare and beauty startups over recent years, T-brands could look towards VC investments to expand. According to Pitchbook, “227 beauty startups received backing in 2021, and the median deal size was $2.75 million.” Considering how venture capitalists have gladly invested in skincare and beauty startups over recent years, T-brands could look to VC investments for expansion. With the right push, Taiwanese beauty brands could redefine the beauty industry in the West, yet they would achieve success faster through some timely investments. Beauty Chlitina, k-beauty, My Beauty Diary, perfect corp, T-beauty, taiwan © 2023 Herlar, LLC. All rights reserved. Jing Daily® is a registered U.S. trademark of Herlar, LLC. Sign up for our daily newsletter to unpack the business of luxury in China. Gain insights, analysis, and breaking news from our on-the-ground reporters. Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. ",
    "datetime": "2022-02-22T10:00:29+00:00",
    "url": "https://jingdaily.com/t-beauty-taiwan-perfect-corp-my-beauty-diary/"
}