{
    "title": "Can a Sticker Cure Your Acne? | Allure",
    "text": "By Chloe Metzger I see dozens of new products every day, and I like to think I have a pretty good grasp of all things beauty-related. So when, during one of my many late-night Insta binges, I saw a bunch of my favorite beauty bloggers covered in odd, flesh-colored stickers with a zillion #acnecure tags on each picture, I quickly investigated. Turns out these little stickers are Cover-Dot Acne Care patches, adhesive dots that claim to absorb bacteria and pus and reduce pimple size through \"microthin hydrocolloid technology.\" Awesome. But what does that mean? I went to the pros to find out. \"These patches are definitely more than just a sticker,\" says Joshua Zeichner, an assistant professor of dermatology at Mount Sinai Hospital in New York City. \"They're advanced wound dressings that are commonly used for both chronic wounds of the legs and pressure ulcers.\" The dots, which are flexible and nearly clear, go on like a waterproof Band-Aid. The difference? Their hydrocolloid composition. \"Hydrocolloids are special types of bandages that absorb excess fluid, like oil and pus, which can speed healing time for popped pimples,\" says Zeichner. And in very small sample study of 20 people, hydrocolloids were shown to mildly improve the severity of acne, though a larger clinical trial is needed to really prove this, cautions Zeichner. But let's be clear: Cover-Dots won't miraculously get rid of that giant cystic zit on your chin, nor will they prevent future pimples from popping up. And though they claim to \"absorb bacteria,\" hydrocolloids don't necessarily draw out bacteria from wounds. \"The bacteria involved in the development of acne, known as p. acnes, lives deep within the follicle, and it's uncertain whether or not the dressing can really affect it,\" says Zeichner. But if you find yourself standing shamefully in front of the mirror after picking at your face (why didn't you listen to us?!), try sticking on a dot to protect and possibly reduce the blemish it as it heals. Or better yet, place one over an emerging pimple to help kill your urge to squeeze it. Out of sight, out of mind, right? For $12.50 and very little risk (i.e., none), I say these dots are definitely worth a shot. For more zit-zapping tips, check out: • Beauty 101: Don't Buy in to These 4 Acne Myths • The 10 Commandments of Clear Skin • Can You Zap Away Pimples at Home? By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Annie Blay By Fani Mari By Kara McGrath By Nicola Dall'Asen More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2015-04-03T09:00:00.000Z",
    "url": "https://www.allure.com/story/cure-dot-acne-care-patches"
}