{
    "title": "Capote’s Breakfast at Tiffany’s manuscript sells for $306K at auction to Russian billionaire",
    "text": "  Manuscript had Capote’s hand written corrections on it Manuscript had Capote’s hand written corrections on it This article is over a year old, and the information within may be out of date. In this 1961 file photo actress Audrey Hepburn, with her hair up in a beehive, poses as Holly Golightly in the 1961 movie Breakfast at Tiffany's. Truman Capote's original script for the movie, with last miinute changes made in his handwriting, sold for $306,000 to a Russian billionaire. AMHERST, N.H.—Truman Capote’s 1958 typed manuscript of Breakfast at Tiffany’s with the author’s handwritten edits has sold for about $306,000 at auction to a Russian billionaire. The manuscript, which was expected to net at least $250,000, was offered for sale online by the Amherst-based auction house RR Auction.  RR Auction says the winning bidder is Russian retail billionaire Igor Sosin, who plans to display it in Moscow and Monaco. Capote’s handwritten notations include changing the femme fatale’s name from Connie Gustafson to the now-iconic Holly Golightly. Its plot — built around a woman who supports herself through trysts with wealthy lovers — was scandalous. Harper’s Bazaar bought serialization rights, then balked at its explicit content. Esquire magazine purchased it from Harper’s and launched it to its 1961 silver screen adaptation starring Audrey Hepburn. Associated Press Anyone can read Conversations, but to contribute, you should be a registered Torstar account holder. If you do not yet have a Torstar account, you can create one now (it is free). To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation Save $85 with our best offer. Cancel Anytime. It means the world to us that you choose to read our brand of trusted news. And as long as you continue to do so, we’ll continue to show you we appreciate it. Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:       Sign up with  Thank you . Your account has been registered, and you are now logged in. Check your email for details. Invalid password or account does not exist Sign in with Submitting this form below will send a message to your email with a link to change your password. An email message containing instructions on how to reset your password has been sent to the email address listed on your account. No promotional rates found.    Secure & Encrypted Secure transaction.\nSecure transaction. Cancel anytime.  Thank you. Your gift purchase was successful!\nYour purchase was successful, and you are now logged in. You will also start receiving the Star’s free morning newsletter, First Up, soon. A receipt was sent to your email. ",
    "datetime": null,
    "url": "https://www.thestar.com/entertainment/books/capote-s-breakfast-at-tiffany-s-manuscript-sells-for-306k-at-auction-to-russian-billionaire/article_9681a117-99c9-55b2-bac3-dbdb1fc5a1c1.html"
}