{
    "title": "Chart: Where K-Beauty Is the Preferred Choice | Statista",
    "text": "Welcome, City University of Hong Kong! Industry Overview Digital & Trend reports Overview and forecasts on trending topics Industry & Market reports Industry and market insights and forecasts Companies & Products reports Key figures and rankings about companies and products Consumer & Brand reports Consumer and brand insights and preferences in various industries Politics & Society reports Detailed information about political and social topics Country & Region reports All key figures about countries and regions Market forecast and expert KPIs for 1000+ markets in 190+ countries & territories Insights on consumer attitudes and behavior worldwide Business information on 70m+ public and private companies Explore Company Insights Detailed information for 39,000+ online stores and marketplaces Directly accessible data for 170 industries from 150+ countries\n                    and over 1 Mio. facts. Customized Research & Analysis projects: Get quick analyses with our professional research service The best of the best: the portal for top lists & rankings: Transforming data into design: Statista Content & Design Strategy and business building for the data-driven economy: Move over, K-Pop, the new export hit from Korean is called K-Beauty. Korean beauty and skincare products have a large following in Asia and beyond. The nation using the most Korean skincare is – of course – South Korea itself, but the Philippines and Singapore are not far behind, as market research from Rakuten shows.Korean skincare has become associated with so-called skincare routines, which created a loyal following of beauty enthusiasts for Korean beauty brands. Korean products are more frequently used than Japanese ones in most Asian markets, despite Japan being home to global household names like Shiseido. In China, Taiwan and Hong Kong, Japanese brands are still more popular, and the K-Beauty industry also had to grapple with some home-grown competition catering specifically to local tastes.In the age of the beauty blogger, influencer marketing has been an important force for K-Beauty. According to Rakuten, beauty influencers are among the most common sources for info on Korean beauty trends and products. This was most pronounced among women in the Philippines (54 percent get their info about K-Beauty from influencers) and Thailand (52 percent). In Vietnam, Singapore and Malaysia – as well as in South Korea itself – K-Beauty was most often recommended through friends and family while Indian female consumers relied on info on e-commerce platforms most. Move over, K-Pop, the new export hit from Korean is called K-Beauty. Korean beauty and skincare products have a large following in Asia and beyond. The nation using the most Korean skincare is – of course – South Korea itself, but the Philippines and Singapore are not far behind, as market research from Rakuten shows. Korean skincare has become associated with so-called skincare routines, which created a loyal following of beauty enthusiasts for Korean beauty brands. Korean products are more frequently used than Japanese ones in most Asian markets, despite Japan being home to global household names like Shiseido. In China, Taiwan and Hong Kong, Japanese brands are still more popular, and the K-Beauty industry also had to grapple with some home-grown competition catering specifically to local tastes. In the age of the beauty blogger, influencer marketing has been an important force for K-Beauty. According to Rakuten, beauty influencers are among the most common sources for info on Korean beauty trends and products. This was most pronounced among women in the Philippines (54 percent get their info about K-Beauty from influencers) and Thailand (52 percent). In Vietnam, Singapore and Malaysia – as well as in South Korea itself – K-Beauty was most often recommended through friends and family while Indian female consumers relied on info on e-commerce platforms most.  Description This chart shows the share of respondents in selected Asian countries who said they used Korean skincare products (as of July 2019). Report Can I integrate infographics into my blog or website? Yes, Statista allows the easy integration of many infographics on other websites. Simply copy the HTML code that is shown for the relevant statistic in order to integrate it. Our standard is 660 pixels, but you can customize how the statistic is displayed to suit your site by setting the width and the display size. Please note that the code must be integrated into the HTML code (not only the text) for WordPress pages and other CMS sites. Buchholz, K. (June 30, 2020). Where K-Beauty Is the Preferred Choice [Digital image]. Retrieved October 26, 2023, from https://www.statista.com/chart/22148/k-beauty-preference-asian-markets/ Buchholz, Katharina. \"Where K-Beauty Is the Preferred Choice.\" Digital image. June 30, 2020. Accessed October 26, 2023. https://www.statista.com/chart/22148/k-beauty-preference-asian-markets/ Buchholz, K. (2020). Where K-Beauty Is the Preferred Choice. Statista. Statista Inc.. Accessed: October 26, 2023. https://www.statista.com/chart/22148/k-beauty-preference-asian-markets/ Buchholz, Katharina. \"Where K-beauty Is The Preferred Choice.\" Statista, Statista Inc., 30 Jun 2020, https://www.statista.com/chart/22148/k-beauty-preference-asian-markets/ Katharina Buchholz, Where K-Beauty Is the Preferred Choice (Statista Inc.) (2020), https://www.statista.com/chart/22148/k-beauty-preference-asian-markets/ (last visited October 26, 2023) Where K-Beauty Is the Preferred Choice [Digital image], Buchholz, K, June 30, 2020. [Online]. Available: https://www.statista.com/chart/22148/k-beauty-preference-asian-markets/ Statista offers daily infographics about trending topics, covering:Economy & Finance, Politics & Society, Tech & Media, Health & Environment, Consumer, Sports and many more. Feel free to contact us anytime using our contact form or visit our FAQ page.  Need infographics, animated videos, presentations, data research or social media charts? More Information ",
    "datetime": null,
    "url": "https://www.statista.com/chart/22148/k-beauty-preference-asian-markets/"
}