{
    "title": "China's Looks-Conscious Men Drive Asia Beauty Boom | Jing Daily",
    "text": " China’s beauty industry is expanding rapidly—but if you think it’s just women driving growth, you’d be wrong, according to a new report. Consumer insight firm Kantar Worldpanel’s recent survey of male consumers from China and several other East Asian countries finds that men are a major driving force in Asia’s market for personal grooming products. China’s male grooming segment is rising faster than that of total personal care for both men and women, reaching 7 percent growth in 2013 compared to 5 percent overall. According to the report, this is due to the fact that male grooming brands have emerged rapidly only in recent years, and are catching up to China’s booming beauty business for women. The study also found that male demand for grooming products is high in China: four in five Chinese men said they are “very conscious” about their appearance, and they’re paying attention to their looks both for themselves and for the ladies. While the number one reason for men giving consideration to their appearance is to “simply feel better and more comfortable,” which 85 percent agreed with, success with women came in second at 73 percent. Equally important to impressing women was career success, which is unsurprising for China, where companies often require photos with job applications and even sometimes have height requirements for corporate office jobs. A Chinese L’Oreal Men Expert ad featuring both romance and career success, two of the main reasons men are buying beauty products in China. (L’Oreal) It’s also not just Chinese women who are devoted to a rigorous beauty regime, the study found. Chinese men use 2.5 skincare products on average per day, and 7.4 different product categories every two months. One area open for growth in China is the use of facial toner, which is used by 29 percent of Chinese men, but has caught on with 63 percent of Korean men. Male-specific products have proven successful in China, with two thirds of Chinese men who use facial cleanser opting for a men-only one. L’Oreal Men Expert dominates the category, but its market penetration rate of 5 percent demonstrates how much growth is possible. For beauty brands trying to reach a male Chinese audience, digital is the way to go, according to the report. Digital marketing may be more important than TV ads—54 percent of Chinese men surveyed said they are likely to surf the internet for three or more hours, while only 13 percent said they would watch TV for that long. In addition, online marketing serves education purposes: half of Chinese men used the internet last year to gather information about fashion and beauty trends, and 55 percent are looking for beauty trends through social media. The main point to take away from the survey, says Kantar, is that “historical assumptions about men’s apathy about their appearance are no longer relevant.” In fact, the morning “face regime” of China’s first-tier males “is already the most advanced in Asia.” However, there are still more areas that can be developed, such as certain products like skin toner, as well as hair and shower products—and the companies with the best digital marketing strategy are likely to pull ahead of the competition.  Beauty, Market Analysis beauty, china, china beauty, china luxury, Luxury, l’oreal men expert, male beauty products, male skincare china, men’s beauty industry china © 2023 Herlar, LLC. All rights reserved. Jing Daily® is a registered U.S. trademark of Herlar, LLC. Sign up for our daily newsletter to unpack the business of luxury in China. Gain insights, analysis, and breaking news from our on-the-ground reporters. Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. ",
    "datetime": "2014-02-19T22:40:33+00:00",
    "url": "https://jingdaily.com/chinas-looks-conscious-men-drive-asia-beauty-boom/"
}