{
    "title": "China Beauty Expo:  Focus on latest beauty trends of the Chinese market - Premium Beauty News",
    "text": "China Beauty Expo offers a unique gathering of suppliers and brands. With three fairs under the same roof (Cosmetics, Professional Beauty and Cosmetech), China Beauty Expo brought together more than 800 suppliers and over 1,200 international and domestic brands in 15 halls of the Shanghai New International Exhibition Center. The beauty supply chain (the Cosmetech part of the show) featured over 800 exhibitors - including Intercos, Cosmax, Kolmar, HCT Group, Greentech, Yonwoo, Kyodo Printing, Haasbel, WestRock, Weckerlecosmetics, Symrise, Fiabila, Keystone - attracted by the 3,300 local cosmetics makers (including more than 50 companies whose production is valued at over 100 million Yuan).  “Cosmetech at China Beauty Expo is the biggest gathering point for beauty packaging and suppliers in the world,” claim the show organizers. As far as finished products are concerned, the organisers have increased the international scope of the show with 20 collective pavilions (Australia, France, Germany, Hong Kong, India, Italy, Israel, Japan, Korea, Lithuania, Netherlands, Poland, Singapore, Taiwan, Thailand, UK, USA, etc.) and a focus on Korean brands and the K-Beauty wave which is taking the Chinese market by storm.  Besides local brands, this unique gathering is a great opportunity for identifying the main trends of the Chinese beauty market. Beyond the traditional skin-lightening and anti-spot products that are traditionally associated to the Chinese market but were not taking centre stage this year, cosmetic brands have multiplied face and body care solutions: anti-wrinkles masks, strengthening, hydrating and lifting products, or gadgets that stretch the face to hide wrinkles, scars and dark circles… Acne - the teenager’s enemy, but also the one of rebel skin adults - was one of the brains’ main are of focus.  Some brands now offer sessions of injections and pulsation in salon to eradicate acne. Others remain in the daily creams and scrubs masks, which components are so-called \"green\" or \"natural\". Besides the usual moisturizing body milks and creams, brands offer new solutions in order to hydrate the skin, including electric portable foggers and formulas with actives encapsulated in nutritious balls and some time with gold particles. Taking care of one’s hair with repair masks or treating shampoos remains a big trend of the Chinese market.  New products to boost the hair growth are also increasingly popular, as well as laser hair removal to get rid of unwanted hair. For even whiter teeth, brands even offer you toothpaste with \"natural\" whitening active ingredients, or whitening services \"respecting the enamel\". This year again, many new brands have chosen to surf the natural wave. Without really guaranteeing truly natural products, a large number of brands communicate on the natural qualities of their products and do not hesitate to use green-washing or green-painting techniques. Brands also launching care products for pregnant women and babies (creams for sensitive skin and children’s skin, products with active ingredient to \"naturally and safely\" protect babies’ skin, ...). In the wake of firming-leggings and similar types of clothes, some Japanese brands have chosen to innovate in slimming-lingerie lines to reshape the body without the constraints of the old corsets. For more fantasy: temporary tattoos, jewelry and 3D gel nails, metal capsule nails, makeup from common to unusual pigments, implantation one by one of false eyelashes for more real volume ... WeChat Commitment! A big trend of this show is the will of all brands to engage passersby in their WeChat account with contests, free samples, promotions if they scan the QR Code ... WeChat and other social networks have become essential for the success of a brand in beauty products in China. And it is the major communication channel for Chinese brands in 2016! The annual premium and luxury packaging trade show broke its attendance record for its 2023 edition, which was held... The expression “Beauty Tech & Skincare” now marks the entry of tech into the beauty sector. Several major brands offer to decode the... The quest for youth has existed for centuries, despite the inevitable effects of time on the body. Research shows that skin aging in... The quest for “in-and-out” beauty is gradually gaining ground in Europe, North America, and Brazil. This form of holistic beauty is meant... © 2023 Premium Beauty Media ",
    "datetime": null,
    "url": "https://www.premiumbeautynews.com/en/china-beauty-expo-focus-on-latest,9777"
}