{
    "title": "China's Plastic Surgery Industry Booms Thanks to K-Pop Obsession | Jing Daily",
    "text": "K-pop groups like Girls’ Generation (above) have spurred demand for plastic surgery in both South Korea and China. (Shutterstock) While South Korea may be the world’s leader for plastic surgery procedures per capita, Chinese consumers’ demand to go under the knife for cosmetic purposes is quickly skyrocketing. A recent research note by HSBC predicts that China’s cosmetic surgery industry will have doubled in size between 2014 and 2019, making it the third-largest in the world after the United States and Brazil. At the end of this five-year period, it is expected to reach a size of 800 billion RMB ($122 billion), up from a value of 400 billion RMB in 2014 after 7 million people received procedures that year. A big reason for this growth is the outsize cultural influence of South Korea, where plastic surgery is so common that nose jobs and blepharoplasty, or “double-eyelid” procedures, are frequently given as high-school graduation presents. The most recent data shows that the number of procedures per capita is 13.2 per 1,000 people in South Korea, a number ahead of the third-place United States at 10 per 1,000 and Brazil at 7.3 per 1,000. While China’s current per capita rate is only 0.8 per 1,000, the Chinese obsession with Korean pop culture, or hallyu, is helping demand shoot up quickly. As a result, an estimated 60,000 Chinese citizens travel to South Korea every year for cosmetic surgery treatments, and increasing demand is contributing to the rise of medical tourism companies that plan shopping-and-plastic-surgery tours for Chinese clients. Many Chinese plastic surgery tourists are not only heading to South Korea in search of the K-pop look, but also due to a lack of trust in the safety of local clinics. HSBC notes that in China, consumers generally opt for non-invasive procedures with a lower risk of complications, or “lunch-break cosmetics” that can be done in an hour. This includes procedures like hyaluronic acid dermal filler injections to hide wrinkles. In addition, a growing number of clinics are arranging for South Korean plastic surgeons to travel to China to do procedures. But both local and foreign procedures have their risks. According to HSBC, only 20 percent of of China’s hyaluronic acid injections have been approved by regulators, while 60 percent are made up of either fake or smuggled ingredients. It is estimated that anywhere between 50,000 to 100,000 unqualified beauty salons are performing cosmetic surgeries in China. South Korea may be losing its trustworthiness as well, as unlicensed clinics targeting Chinese tourists have left many disfigured. In addition to China’s strong “selfie” culture that has given rise to a boom in face-altering photo apps, demand for plastic surgery is about pragmatism as much as vanity for many. That’s because jobs often require a photo to be submitted along with job applications and openly discriminate on looks as part of the hiring process, making many young people feel they need procedures to get their foot in the door on the job market. That may be part of the reason why Chinese consumers seeking cosmetic enhancement are significantly younger on average than their American counterparts—HSBC notes that 80 percent of non-surgical procedures in the United States are done by those over the age of 35, but those younger than 35 make up the biggest portion in China. For now, this market is dominated by young women in China, but HSBC says the rate of men receiving cosmetic surgery is rapidly rising. While men only made up 11 percent of China’s plastic surgery market in 2014, that portion almost doubled to 20 percent in 2015 as both genders feel a growing desire—or pressure—to alter the looks they were born with.  Beauty, Market Analysis china, china cosmetic surgery, china luxury, china plastic surgery, cosmetic surgery, hallyu, HSBC, k-pop, Luxury, plastic surgery, south korea © 2023 Herlar, LLC. All rights reserved. Jing Daily® is a registered U.S. trademark of Herlar, LLC. Sign up for our daily newsletter to unpack the business of luxury in China. Gain insights, analysis, and breaking news from our on-the-ground reporters. Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. ",
    "datetime": "2016-02-29T08:28:25+00:00",
    "url": "http://jingdaily.com/66675-2/"
}