{
    "title": "Chloe Kim, Pro Snowboarding Champion, Signs On as",
    "text": "December 01, 2016 15:44 ET\n\n\r\n            | Source:\r\n            \nLANEIGE\n\n\n\n\n\nLANEIGE\n\r\n                  New York, New York, UNITED STATES New York, New York, UNITED STATES NEW YORK, Dec.  01, 2016  (GLOBE NEWSWIRE) -- Korean-American snowboarding champion Chloe Kim continues to make history beyond being the first female to score a perfect 100 at the 2016 U.S. Grand Prix. Today LANEIGE, one of the world’s K-Beauty leaders, is proud to announce Chloe Kim as its first-ever North American brand ambassador as she exemplifies the spirit and power of K-Beauty and feeling confident in your own skin. Together, LANEIGE and Chloe announce Your Personal 100, a social media campaign designed to inspire everyone to look, feel and do their personal best. A video accompanying this announcement is available at http://www.globenewswire.com/NewsRoom/AttachmentNg/34c06ca9-d990-4ec5-a8f9-5e2de325027b Photos accompanying this announcement are available at http://www.globenewswire.com/NewsRoom/AttachmentNg/3293f773-f8b9-4a7c-b7b1-0e1c08d3b9da and http://www.globenewswire.com/NewsRoom/AttachmentNg/dd69ef30-3fe4-406e-886f-32943ea5704d. “LANEIGE is honored to name Chloe Kim as our first-ever North American brand ambassador because she embodies the spirit and power of K-Beauty and the beauty of feeling confident in your own skin,” said Bradley Horowitz, CEO, AmorePacific North America. “Chloe has the perfect formula for inspiring women around the world. We admire her determination to keep striving to reach new heights and we are thrilled that our brand will accompany her on her journey.” Your Personal 100 campaign will follow Chloe Kim on her journey to the 2018 Olympic Games in Pyeongchang, South Korea. As part of the campaign, Chloe will inspire and engage fans through social media posts by sharing her Personal 100 stories and LANEIGE K-Beauty secrets using #YourPersonal100. Chloe has changed the face of snowboarding and always puts her best face forward thanks to her family, friends and a skincare routine that is based on tradition and nourished by K-Beauty products. For Chloe and her mom, Boran, using LANEIGE is a tradition that is passed on with pride and love from one generation to the next. Chloe knows the importance of staying hydrated and protected from the sun and other elements when she is on the slopes and learned from her mom that LANEIGE can help keep her skin healthy and glowing so she can concentrate on bringing home the gold. “My skin has seen some extreme weather and I’m so glad I have LANEIGE to keep it looking and feeling awesome,” said Kim. “First thing in the morning I use my LANEIGE cleanser, toner, emulsion, Water Bank Serum and Gel Cream, and before bed I relax and recharge with my LANEIGE Water Sleeping Mask. It’s like my treat to me!” About Chloe Chloe was most recently named by TIME magazine as one of The 30 Most Influential Teens of 2016 and is a favorite to compete in Korea at the 2018 Olympic Games. Her first X Games medal came at the young age of 13 (silver) and she is now the only athlete in X Games history to earn three medals before the age of 16; back-to-back X Games gold in 2016 and 2015 and silver as a rookie in the X Games Aspen 2014 SuperPipe. The partnership was negotiated by Chloe’s agents at CAA Sports, led by Lowell Taub. About LANEIGE LANEIGE is committed to helping you achieve younger, more radiant skin through the power of water. After 20 years of research, only LANEIGE Laboratories have unleashed scientifically engineered, skin-perfecting mineral water clinically proven to hydrate, protect and revitalize individual skin types. The result is 24-hour hydration and protection against sun, pollution and stress. Through its mastery of the science of water, LANEIGE brings skincare to a new level of excellence. For more information about the “Your Personal 100” campaign or for interview requests, please contact: Dawn Maniglia(917) 862-5444d.maniglia@vegarun.com You can download video in HD from the following location: http://www.dssimon.com/MM/Laneige/ ",
    "datetime": null,
    "url": "https://www.globenewswire.com/en/news-release/2016/12/01/894482/0/en/Chloe-Kim-Pro-Snowboarding-Champion-Signs-On-as-First-Ever-North-American-Brand-Ambassador-for-K-Beauty-Leader-LANEIGE-and-Your-Personal-100-Campaign.html"
}