{
    "title": "Chosungah 22 Best Products Review | Allure",
    "text": "By Shyema Azam If you've somehow missed all the hype surrounding Korean beauty brand Chosungah 22, well, you might want to log on to the Internet every now and then (beauty-writer shade). The brand's line of game-changing makeup has a major cult following in its home country and is quickly working up a similar reputation Stateside. Here, some of the standout products that have me completely obsessing. Flavorful Lipstick. Resist the urge to take bite out of this one—it may look reminiscent of a gummy bear or Jell-O, but be assured, the transparent bullet is, indeed, lip balm. The argan-infused formula offers a subtle tint of self-adjusting color with a yummy peach taste (not that we condone tasting your lip product, but you get the idea). Fullmoon Party Lipstick. Each of the three buttery lip crayons in this collection feels creamy going on but dries to a slightly powdery finish. And it's not overly matte to the point of feeling dry (that would be because it's spiked with jojoba). I'm wearing it in My Burgundy below on the left, and in Hot & Spicy on the right. Ink Jet Lip Tatt Stain. You have to really commit to whichever shade you choose of this intensely pigmented stain because they don't put \"tatt\" in the title for nothing. It has serious staying power and can last for hours—it might even be there when you wake up the next day (this may or may not have happened to me while testing). But considering how pretty the shades are (I'm partial to the bright red and bubblegum pink), you might not mind. Real Cheek Smoothers. Have you ever put a baby chick up to your cheeks? I haven't, either, but I imagine it might feel somewhat similar to the puff applicator at the end of this creamy gel blush. The shades are so bright, they're almost electric—but once you blend them into your skin, it makes for a totally natural-looking flush. I'm wearing it in the shade Berry-Ade in the middle picture above. 24H Raybeam Highlighter. This ultra-creamy formula feels as moisturizing as a face cream and creates a soft, candlelight type of glow-y highlight, not a sparkly one. Another Allure editor has used the word \"addicted\" to describe her relationship with it on multiple occasions. By Aliza Kelly By Gabi Thorne By Gabi Thorne Dong Gong Minn Brow Maker. These mascara-like brow brushes have a flat tip so you can fill in sparse areas and then brush through the hairs with the bristles. My only gripe is that they're not superprecise, so you might need to practice a few times to get the technique just right. Dong Gong Minn Jello Color Kit Eye Shadow palettes. The bouncy textures of these eye shadows are fun, and the colors range from matte rose to shimmery bronze. You can just use your finger to swipe them on—no shadow brushes required. (That might be my favorite part.) As you can probably tell, it's fair to say I'm very into Chosungah 22's pretty colors for lips, cheeks, and eyes. But the line isn't without its faults. Though the foundation feels silky and has a beautiful, non-cakey finish, when it comes to shades, the selection is pretty limited—like only four shade options limited. I barely make the cut for its darkest shade, which is a light tan. So here's hoping the company factors in a little more diversity to its bases soon, but in the meantime, I'll be hoarding delectable-looking lip products. How to find the perfect bright lipstick for your skin tone: [#cneembed: script/video/52e98628c2b4c00c20f8836d.js? autoplay=1&muted=1]|||||| By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Gabi Thorne By Jesa Marie Calaor By Kara Nesvig By Nicola Dall'Asen More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2016-05-03T10:00:00.000Z",
    "url": "https://www.allure.com/story/chosungah-22-best-products-review"
}