{
    "title": "Chungcheongbuk-do to Host ‘The Cosmetics & Beauty Expo Osong Korea 2021’ Online and Onsite Simultaneously | Business Wire",
    "text": "- The Expo to provide a variety of programs under the theme of ‘K-beauty, from Osong in Chungcheongbuk-do to the World’ 'The Cosmetics & Beauty Expo Osong Korea 2021,' hosted by Chungcheongbuk-do and Cheongju and organized by the Osong Bio Promotion Foundation, will take place from October 19th to 23rd on its official website and around the Osong station in Chungcheongbuk-do, South Korea. Under the theme of ‘K-beauty, from Osong in Chungcheongbuk-do to the World,’ the Business and Product Promotion Pavilions for Business to Business (B2B) will be open as ‘Online Exhibition,’ with ‘Offline Market Hall’ for Business to Consumer (B2C). Especially for B2C, online sales via NAVER Smartstore exhibitions and live commerce will also be conducted. Other various programs, such as ‘video export counseling services,’ ‘e-Conferences,’ and ‘online and offline events and experience’ will be provided. (Graphic: Business Wire) 'The Cosmetics & Beauty Expo Osong Korea 2021,' hosted by Chungcheongbuk-do and Cheongju and organized by the Osong Bio Promotion Foundation, will take place from October 19th to 23rd on its official website and around the Osong station in Chungcheongbuk-do, South Korea. Under the theme of ‘K-beauty, from Osong in Chungcheongbuk-do to the World,’ the Business and Product Promotion Pavilions for Business to Business (B2B) will be open as ‘Online Exhibition,’ with ‘Offline Market Hall’ for Business to Consumer (B2C). Especially for B2C, online sales via NAVER Smartstore exhibitions and live commerce will also be conducted. Other various programs, such as ‘video export counseling services,’ ‘e-Conferences,’ and ‘online and offline events and experience’ will be provided. (Graphic: Business Wire)  CHEONGJU, South Korea--(BUSINESS WIRE)--‘The Cosmetics & Beauty Expo Osong Korea 2021,’ hosted by Chungcheongbuk-do and Cheongju and organized by the Osong Bio Promotion Foundation, will take place for five days from October 19th to 23rd on the official website (http://www.osongbeautyexpo.kr) and around the Osong station in Chungcheongbuk-do, South Korea.  The Expo has been held since 2013 to foster the cosmetics and beauty industry, a strategic industry of the Chungcheongbuk-do Province, and to help small and medium-sized businesses make inroads into overseas markets. This year, under the theme of ‘K-beauty, from Osong in Chungcheongbuk-do to the World,’ the Business and Product Promotion Pavilions for Business to Business (B2B) will be open as ‘Online Exhibition,’ with ‘Offline Market Hall’ for Business to Consumer (B2C). The Expo features various events especially for B2C, such as online sales via NAVER Smartstore exhibitions and live commerce. The ‘Online Exhibition,’ a promotion pavilion for enterprises and products focused on B2B, provides detailed information on participants and displayed products divided into each cosmetics category, running a product review team to offer user reviews. The B2C-focused ‘Offline Market Hall,’ which is set up at the Osong station, will sell displayed items at affordable prices, and a wide range of products will also be exhibited online through NAVER’s online marketplace Smartstore and live commerce. In addition, the Expo provides a variety of programs, such as ‘video export counseling services,’ ‘e-Conferences,’ and ‘online and offline events and experience.’ The ‘video export counseling services,’ only available during the event last year, will be provided online for four weeks from September 27th this year. Through ‘e-Conferences’, domestic and foreign cosmetics experts will give video lectures on the latest beauty information: ‘2021 production trend of cosmetics,’ ‘policy changes to cosmetics in China,’ and ‘beauty trend of global consumers.’ “This year, we have prepared various programs such as events and experiences that can be participated online and offline,” said an official from the province, adding, “We expect visitors to buy high-quality goods at reasonable prices, and overseas buyers to obtain information on local cosmetics companies through the Expo.”  The Cosmetics & Beauty Expo Osong Korea 2021\nKO JEONG SUK\n+82-43-220-4552\nwjdtnr31@korea.kr ‘The Cosmetics & Beauty Expo Osong Korea 2021’ will be held online and onsite simultaneously from October 19th to 23rd. The Cosmetics & Beauty Expo Osong Korea 2021\nKO JEONG SUK\n+82-43-220-4552\nwjdtnr31@korea.kr ",
    "datetime": null,
    "url": "https://www.businesswire.com/news/home/20211007005051/en/Chungcheongbuk-do-to-Host-%E2%80%98The-Cosmetics-Beauty-Expo-Osong-Korea-2021%E2%80%99-Online-and-Onsite-Simultaneously"
}