{
    "title": "Cosrx UK: Snail Mucin, Rice Bran and Pimple Patches explained",
    "text": "We earn a commission for products purchased through some links in this article. She’s not the only celebrity to have recommended it South Korea has long been associated with stellar skincare, with the best K-Beauty brands delivering effective, innovative (and perhaps a little quirky) formulas that don’t cost the earth. In fact, some of these sweet and cheerful brands have proven so impressive that even the A-list have been drawn away from more luxurious alternatives. One such brand is CosRX: a leading K-Beauty skincare brand that offers thoughtful, no-filler formulas that really deliver on their promises. Not convinced? Just ask Alexa Chung, who has spoken about the brand’s Ultimate Nourishing Rice Overnight Spa Mask on her YouTube channel. The gentle, creamy formula contains a high dose of rice extract (at 65 per cent) that hydrates and calms skin without feeling heavy or suffocating. Niacinamide brightens and clarifies, while sunflower seed oil (which is entirely non pore-clogging) soothes and hydrates easily upset skin, including acne-prone types. It might be dubbed an ‘overnight mask’, but there are actually three ways to use this impressive product. Apply it as a regular mask, washing it off after 10 minutes, leave it to work overnight, or simply apply it as you would a moisturiser in the morning. And Chung isn’t the only celebrity to have raved about this surprisingly low-cost line. Earlier this year, Emily Ratajkowski recommended the brand’s cult Advanced Snail 96 Mucin Power Essence to her followers on Instagram. Speaking on Stories, she credited the product (layered beneath a retinol) with restoring her stressed skin during lockdown. The snail secretion inside is less scary than it may sound: in fact, this ingredient is incredibly popular in South Korean skincare lines thanks to its healing properties. It's ideal for use on breakouts, irritation and dry patches. In need of some at-home inspiration? Sign up to our free weekly newsletter for skincare and self-care, the latest cultural hits to read and download, and the little luxuries that make staying in so much more satisfying. SIGN UP Plus, sign up here to get Harper’s Bazaar magazine delivered straight to your door. SIGN UP Is microcurrent the ultimate facelift alternative? The eyelash growth serums that truly work The neck creams to know about now Radiofrequency facials, explained The very best luxury facials to book now How to menopause-proof your skin Why facelifts are making a return The world of retinoids made simple The best at-home laser hair-removal devices Everything you should know about face oils Why it's time to try a face massage tool #SkinSchool: Mushrooms in skincare, an explainer HARPER'S BAZAAR, PART OF THE HEARST UK FASHION & BEAUTY NETWORK We earn a commission for products purchased through some links in this article. ©2023 Hearst UK is the trading name of the National Magazine Company Ltd, 30 Panton Street, Leicester Square, London, SW1Y 4AJ. Registered in England. All Rights Reserved. ",
    "datetime": "2020-09-29T09:05:00Z",
    "url": "https://www.harpersbazaar.com/uk/beauty/skincare/a34201292/cosrx-uk/"
}