{
    "title": "Costco Is Secretly Filled With Discounted K-Beauty Products  | Allure",
    "text": "By Devon Abelman Walking the jumbo-pack-filled aisles of Costco might be a good way to get in your daily step intake, but, unsurprisingly, its website is another great source of deals. In particular, it's secretly a place to shop Korean beauty products for a fraction of the price. The only catch? You have to be a Costco member. Costco appeared on my radar as a K-beauty destination back in August when the retailer giant started selling Mizon's All-in-One Snail Repair Cream in a two-pack for $29.99. Separately, the cream goes for $19. Since then, the wholesale store has expanded its K-beauty selection. Oh, and it's constantly changing, too. If you don't see any of your favorite skin-care products from your 10-step routine, check back in a week or so. The K-beauty section on Costco's website might look completely different by then. The highlight of Costco's K-beauty selection at the moment is the Missha Time Revolution The First Treatment Essence, which our digital beauty editor Sable Yong considers to be one of the most effective Korean skin-care products. It usually rings up for $49, but at Costco, it's $29.99. Just having a membership will save you almost $20. I was also excited to see the Whamisa Organic Flowers Deep Rich Toner is available right now, too. So many people I know — K-beauty experts and otherwise — swear by the hydrating stuff. People love it so much that they slather their faces with seven layers of it using the \"7 Skin\" method. The toner is typically $40. Costco is selling it for $28.99. In true Costco fashion, the retailer even offers multipacks of some of its products. The Botanic Farm Grain Ferment Cleansing Sherbet is currently available in a set of two full-size tubs, as well as a mini travel-size one. It's a great double-cleansing staple because it melts away long-lasting makeup and sunscreen in seconds. The tiny jar is handy to throw in your purse, too. Costco is selling the three-piece set for $29.99. If you were to buy everything separately, you'd have to shell out at least $60. By Aliza Kelly By Gabi Thorne By Gabi Thorne Sam's Club member? Unfortunately, that wholesale store doesn't offer K-beauty products online just yet. Hopefully, Costco's competitor will stock K-beauty in the near future. When I was in elementary school, kids used to brag about which store their parents belonged to. I've never been prouder to say mine are Costco people. Related links: Now, find out about more K-beauty products that will transform your skin: Follow Devon Abelman on Twitter and Instagram. By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Sarah Han By Nicola Dall'Asen By Dianna Mazzone By Angela Trakoshis More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2017-11-02T13:00:00.000Z",
    "url": "https://www.allure.com/story/costco-discounted-k-beauty-products"
}