{
    "title": "Costco Launches The Case Full of Seoul, a 10-Step K-Beauty Routine in a Box | Allure",
    "text": "By Devon Abelman Over the past six months, Costco has been bulking up its K-beauty selection. (Pun intended.) In case you were unaware, its website is an unexpected destination for discounts on the latest and greatest in Korean skin care. With its newest launch, the Case Full of Seoul, Costco is about to make putting together a full 10-step K-beauty routine as easy as it could possibly get. The Case Full of Seoul dropped on Costco's website, and just as its name implies, it's a box complete with 10 full-size skin-care products straight from Seoul for every step of the extensive routine that thousands of Koreans swear by. Over the past couple of years, cheat sheets and quizzes have been created to help Americans ace the wonders of the 10-step routine, which starts with a cleanser and ends with a moisturizer. However, finding the right products that work together effectively and efficiently can be about as hard as finding \"the one.\" Umma, a Seoul-based company, did all the work for you with this incredibly convenient case. Based on the Korean word for mom, Umma considers itself a K-beauty incubator that tests products from mainstream and emerging beauty brands alike. It worked for the past year to create a full regimen that works in harmony for all skin types. So, what does the kit include? Step one is a cleanser officially available in the U.S. for the first time, the 9 Wishes Rice Foaming Cleanser. It's flecked with fine grains of rice to help sweep away not only makeup and grime on your face but also dead skin cells. The second step is the popular Maycoop Raw Sauce, which is a toner infused with maple tree sap that helps skin better absorb the eight other steps. You can follow with the all-natural Urang True Rose Repair Essence. You're about to see a lot more of this K-beauty brand, which was started by an aromatherapist. Mark my words. Immediately after the essence comes a spritz of step four: the One O Seven Core Flex Essential Liquid, a serum spray. (I have a feeling serum sprays are going to be the next sheet mask.) By the way, that K-beauty innovation is also included in the box. Umma had the most difficult time picking just one sheet mask from one brand, but it selected the brightening All-in-One Concentrate Treatment Mask from I Woke Up Like This. Known simply as IWLT, too, the K-beauty brand was founded by Korean influencer Han Yeona, who has the glass skin of Instagram dreams. Plus, Umma is such a fan of the brand that it also included IWLT's Protective Base Suncream. This is a lot to remember, so Umma included a handy booklet in the Case Full of Seoul and each product in the box is labeled. The box also calls out specific routines for when you don't have the energy to go through all 10 steps. You can shop the box now on costco.com for $150. Not a member? No worries, the Case Full of Seoul is available to everyone, no membership required. By Aliza Kelly By Gabi Thorne By Gabi Thorne More on K-beauty products Allure editors love: Now, see Jihae's all-natural beauty routine in action: Follow Devon Abelman on Twitter and Instagram. By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Sarah Han By Sarah Han By Sarah Han By Sarah Han More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2018-04-05T20:16:57.658Z",
    "url": "https://www.allure.com/story/the-case-full-of-seoul-costco-korean-beauty-routine"
}