{
    "title": "Coty’s Kim K collab could bring the star power high street beauty needs | Comment and Opinion | The Grocer",
    "text": "Source: Twitter (@kkwbeauty) By Daniel Selwood2020-06-30T14:08:00+01:00 Many things about Kim Kardashian West are big. Foremost is her star power. Remember how she ‘broke the internet’ by stripping off in 2014 for Paper magazine? The breadth of her career is also huge: socialite, reality TV star, actor, author, entrepreneur and musician. Just as massive are her Instagram following (177 million at time of writing) and her husband’s ego. Of course, it’d be remiss not to mention curvy Kim’s most prominently large feature, which, of course, is… her personal wealth. It’s now an estimated $900m (£734m) following her business deal this week with US cosmetics giant Coty. The company has bought a 20% stake in Kardashian West’s KKW Beauty company for $200m (£163m). It’s a deal that could prove a boon for both parties. Kim can now afford all the gaudy leather outfits she and Kanye need. Coty, meanwhile, has the opportunity to benefit from her gigantic influence – and it’s much needed. As data and analytics provider GlobalData says, the company “is depending on the strong personality and social media-driven KKW after its other brands are struggling”. That’s certainly the case in the UK. Like many of its big-name rivals, Coty is suffering on the high street. The cosmetics category lost an unsightly £51.5m in value last year as price-savvy shoppers turned to online and/or cheaper make-up, such as Superdrug’s Revolution offer [Nielsen 52 w/e 7 September 2019]. Coty’s biggest UK make-up brands, Rimmel and Max Factor, dived by 6.1% and 11.9% respectively. Could the aforementioned star power of contouring superfan Kardashian West turn things around? Celeb-backed make-up brands can prove hugely lucrative, as Fenty Beauty has proven. The brand created by pop megastar Rihanna – in partnership with Louis Vuitton owner LVMH – is valued at $3bn after less than three years on the market (having been Harvey Nichols’ biggest-ever beauty launch). So, the combo of Kardashian West’s rep and Coty’s reach could prove a lucrative proposition for the cosmetics market. The two parties intend to focus on entering new beauty categories and global expansion beyond her existing product lines. Though probably not immediately. The so-called new normal doesn’t seem to include a strong desire for cosmetics. At least not in the UK, where hopes that Covid-19 would have a lipstick effect on the category have been well and truly dashed. Shoppers have shied away from buying mascara, concealer and the like – causing overall value to plunge £48.1m between March and April [Kantar]. However, the future of beauty looks brighter. “The sector is expected to bounce back in 2021, and reach a forecasted full recovery by 2023,” GlobalData notes. And with Kim Kardashian West by its side, Coty could soon be enjoying some serious booty.    Sign in to comment on this article Not logged in before? Register for FREE guest access today. You will be able to: Register Now  Site powered by Webvision Cloud ",
    "datetime": null,
    "url": "https://www.thegrocer.co.uk/the-grocer-blog-daily-bread/cotys-kim-k-collab-could-bring-the-star-power-high-street-beauty-needs/645936.article"
}