{
    "title": "Could K-Beauty Phenomenons 'Glass' and 'Dolphin' Skin Be Harmful? Derms Weigh In - NewBeauty",
    "text": "If you’re anything like me, then having a clear, glowing complexion is at the top of your priority list. But achieving the status of having “glass skin,” which refers to a complexion that is as reflective as glass, or “dolphin skin”—skin that looks wet and shiny—might be more complex than it sounds. What does it takes to achieve the reflective face of our dreams? And is it actually harming the skin? Two top dermatologists weigh in. The LowdownOriginating in Korea in 2017, “glass skin” took social media by storm and has been trending ever since. It signifies the just-got-a-facial type of shine that just hits right, and if something is trending for three years, it’s not just a fad. “Dolphin skin,” on the other hand, is new to the game, and also praises the exfoliated and natural skin glow, but with a little help from the magical powers of makeup. “’Glass skin’ refers to skin that is glossy, pore-less and smooth,” says New York dermatologist Julie Russak, MD. “It usually refers to very well hydrated and healthy skin that naturally reflects light.” Dr. Russak also explains that the younger and healthier you are, the more cytoplasm—it protects the skin cells from damage and consists of 90-percent water—you have, making it easier for your skin to reflect light. “’Dolphin skin’ is achieved by layering silky primers and light-reflecting highlighters in multiple ways to enhance the high points of the face,” notes Dr. Russak. While “dolphin skin” is more achievable due to the concealing effects of makeup, she thinks that rocking the glass skin look is always more beautiful, “but most importantly, having healthy skin benefits you in the long run,” she adds. Steps to PerfectionAccording to Newport Beach, CA dermatologist Zenovia H. Gabriel, MD, you need to hydrate and protect your skin as much as possible to achieve the coveted “glass” look. “Flawless skin begins with a foundational routine suited to your specific skin type and skin issues,” she says, adding that your daily lineup should consist of a cleanser, treatment, moisturizer and sunscreen. Her go-to products? “I love a gentle cleanser like the CeraVe Hydrating Facial Cleanser ($15) and a moisturizer that includes ceramides or hyaluronic acid to lock in moisture.” Dr. Gabriel adds that corrective procedures like lasers, chemical peels or injectables are another way to achieve tighter skin. For “dolphin skin,” it’s all about the makeup. A product we’ve been loving under makeup for bouncy skin is the Peach & Lily Skin Shield Blurring Primer ($34). Formulated with a plant-based silicone alternative and combined with potent vitamins, it serves as your skin’s bodyguard and adds an extra layer of protection. Hydration StationThey look stunning, but could these trends be too hydrating or even damaging to the skin? The doctors say no. “Dehydrated skin is more of a concern than over-hydrated skin,” notes Dr. Russak. “Dry skin means there is a decrease in oil production; dehydrated means the skin is lacking a protective barrier, and therefore cannot maintain internal moisture.” Dr. Gabriel also notes that over-hydrated skin is not a very common complaint she sees from patients. “The skin should be moisturized twice a day to protect and plump—moisturizers that include ceramides are the best for retaining optimal moisture,” she explains. If you’re concerned about excess oil, try a light cream like the Biossance Squalane and Probiotic Gel Moisturizer ($52). Bye-Bye Pores“Pores are an essential compound of skin health; they allow our natural oils to reach the skin’s surface to provide a protective and lubricated layer,” says Dr. Gabriel. But if they’re really large, they can make your skin texture look much less smooth, which makes makeup application much harder. “If you want to shrink pores in a healthy way, take a deeper look at your skin: Do you have rosacea? Is acne an issue? Are they hereditary? This will help you pinpoint what your skin needs.” Dr. Russak explains that using a retinol can help to decrease sebum production in the skin, which will shrink the pores. “Microneedling is a great way to achieve that glossiness, too,” she adds. At NewBeauty, we get the most trusted information from the beauty authority delivered right to your inbox Find a NewBeauty \"Top Beauty Doctor\" Near you Get trusted information from the beauty authority delivered right to your inbox ",
    "datetime": "2020-08-14T14:53:00+00:00",
    "url": "https://www.newbeauty.com/glass-dolphin-skin-benefits/"
}