{
    "title": "CVS Said to Have More Stores With K-beauty Than Any Other – WWD",
    "text": "The chain will install K-Beauty HQ in 2,100 stores. subscriber CVS Pharmacy wants to be more than just an echo in the K-beauty boom. Next month, the nation’s mega drugstore chain will outfit 2,100 of its doors with an assortment handpicked by Alicia Yoon, a trailblazer in the K-beauty explosion. The founder of Peach & Lily, Yoon partnered with CVS to identify 100-plus trendsetting and cult favorites for in-store boutiques, called K-Beauty HQ. Kline estimates beauty items from South Korea produce sales of $225 million in the U.S., up 30 percent since 2015. There’s tremendous potential with many U.S. women still not exposed to South Korean innovation. With its commitment to K-beauty, industry sources believe CVS alone can add another $100 million to that total if the assortment clicks. CVS would not comment on projections.  “CVS will be the first retailer of its kind with such reach and visibility,” Yoon said. “Going into so many doors, this is going to be a really big contributing factor, propelling [South] Korean beauty forward in terms of awareness.” To her knowledge, Yoon said CVS will have K-beauty in more stores than any other retailer in the world. Related Articles\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tWellness\n\t\n\n\n\n\t\n\t\t\tMeet Claudia Sulewski's Brainchild: Cyklar\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tBeauty Features\n\t\n\n\n\n\t\n\t\t\tKao's Newest Brand, Re/cover, Offers the Pimple Patch of Eczema Care -- Without Adhesives Widely credited with being the architect of the K-beauty movement in America, Yoon has the pedigree to make that claim. In addition to her Peach & Lily web site, she has curated assortments for Macy’s, created her own sheet masks, set up a mask bar in Barney’s and collaborated with Target to put 13 popular South Korean beauty items onto its shelves. “We wanted to do this in a big way — not just a few items, not just a few stores,” said Alex Perez-Tenessa, CVS’ vice president, merchandising manager of beauty. He explained K-beauty, puts a heavy emphasis on skin care, which fits snugly with the chain’s dedication to wellness and beauty. “K-beauty is much more than just trend. We think it is a global beauty movement and something our customers are ready for and demanding.” To get the right mix, Perez-Tenessa said it was critical to link with Yoon in order to decide what is relevant to CVS shoppers — especially with the breadth of choices coming from South Korea. The chain pledges to be “nimble,” to add innovation as it debuts. Yoon’s omnichannel approach targets each retailer with a different strategy. With more than 10,000 brands in South Korea, she has the luxury to match the lines with the retail outlet. “We wanted to make [South] Korean beauty accessible to all,” Yoon told WWD. “CVS is ubiquitous. Now [South] Korean beauty can be only a five minute walk away.” They can experiment without breaking the bank with price points, ranging from $2.99 for masks to $30 for facial moisturizers, Yoon maintains.  In the case of CVS, Yoon saw fertile territory for an offshoot of Peach & Lily called Peach Slices, which encompasses products and a retail concept. “CVS is the right retail partner to take on Peach Slices,” she explained, describing the collection as the whimsical, innovative and fun-loving sister of Peach & Lily.  The drugstore environment, she noted, requires products that stop shoppers in their paths, but are also effective, which brings them back for more. Carrie Mellage, vice president of consumer products for Kline, thinks the move is smart for both parties, especially since Yoon can edit the assortment so it doesn’t duplicate what other channels offer. “[South] Korean beauty remains one of the hottest trends in the market. It started in luxury channels and has already migrated to the mass market,” she said. “The market is absolutely ready for the trend to go even further mainstream, and this new assortment will offer CVS shoppers greater assortment and newness that beauty shoppers crave.” CVS’ Perez-Tenessa said the chain put K-beauty on its radar a few years ago with the emergence of BB creams. “The explosion of sheet masks was the final indicator that American was ready for K-beauty,” he said. The K-Beauty HQ collection will be highlighted in stores by special signage featuring educational materials. The location will be either on a New Trend wall concept where hot products are displayed or on shelves, near facial skin care. This is the latest example of CVS adding on trend products — more than 2,800 new beauty items were added last year alone. CVS beauty consultants will be trained on the assortment. Yoon said she selected items that will stand out in mass stores where shoppers might not expect these items. “Packaging needs to be compelling because a customer might be going to the pharmacy or front of store for other needs. As they are walking down the aisle, they see this entire world of packaging that stops them in their tracks,” she said. “But packaging alone isn’t enough; the products have to delight so they come back for more. And it is easy because there is a store on every corner.” Many of the items curated for CVS include those that are new to the U.S. and several are exclusive to CVS. That includes her homegrown Peach Slices, a preventative skin collection. Within that lineup, Yoon singles out Citrus-Honey Aqua Glow, a hydrating moisture gel.  Other brands found only at CVS in the U.S. include Frudia, a waterless fruit-based collection, Elisha Coy with snail mucin, the pore-focused JJYoung by Caolion and the unique Ariul EGG Collection, which introduces egg oil to America. Rounding out the four- to eight-foot sections — depending on store size — are other items that haven’t been easy to purchase in the mass market. These include: the Saem natural products, Holika Holika items such as the whimsically named Pig-Nose Clear Black Head Kit and masks from Ariul. Since many of the lines are new to the U.S. and CVS consumers, both parties will ramp up social media support and provide educational materials on web sites. Sign up for beauty news straight to your inbox every day Top News Stories Alerts Straight to your Inbox. Send us a tip using our anonymous form. WWD and Women's Wear Daily are part of Penske Media Corporation. © 2023 Fairchild Publishing, LLC. All Rights Reserved. ",
    "datetime": "2017-03-29T04:01:13+00:00",
    "url": "https://wwd.com/feature/cvs-goes-big-k-beauty-10853686/"
}