{
    "title": "CVS is launching the K-beauty line Joah with Kiss Products",
    "text": "K-beauty, aka “Korean beauty” made a grand entrance onto the Western beauty scene back in 2015, and took it by storm with its cutesy and colorful skincare and cosmetic products. Now it’s about to become ubiquitous. The pharmacy chain CVS, which is in almost every downtown in the US, is partnering with the Korean-American cosmetics brand Kiss Products to launch an exclusive line of K-beauty products on cvs.com this month. Joah, which will be available in 4,000 brick-and-mortar stores next month, is thought to be the first K-beauty line developed for the US mass market, according to WWD. The line will contain 158 items, including eyeshadows, brow products, lipsticks, and face products like powders and contour palettes, plus tools, with prices capping at around $16.00. Korea is one of the world’s top ten beauty markets, and raked in over $13.1 billion in sales in 2018, according to global market intelligence agency Mintel. Initially K-beauty was dubbed a “fad” in the West—and lampooned for its many-stepped skincare routines—but it has made inroads in the US market, getting its own island in Sephora stores before moving into the mass-market at Costco and Target. It’s even a staple in upscale retailers like Barneys and Nordstrom, where European and Japanese cosmetics have historically dominated. CVS got into the K-beauty game back in April 2017 and has been doubling down on it ever since. The pharmacy chain, which has a dedicated section for its K-Beauty products dubbed “K Beauty HQ,” is considered to have the largest array of K-beauty products in the US (paywall), WWD reports. As a retailer, CVS has been steadily expanding its beauty aisle for several years, and launched its ”Beauty in Real Life” ad campaign back in April showcasing women that haven’t been retouched by Photoshop. Now, with its latest K-Beauty move, the company is establishing itself as an even trendier destination for cosmetics shoppers. With its affordably priced K-beauty selections, CVS may be able to attract the ever-elusive millennial shopper, something that sagging department stores have failed to do, and even specialized cosmetics brands like Shiseido are desperate to crack. Our free, fast, and fun briefing on the global economy, delivered every weekday morning.  ",
    "datetime": "2018-08-01T14:52:51.601Z",
    "url": "https://qz.com/quartzy/1344955/cvs-is-launching-the-k-beauty-line-joah-with-kiss-products"
}