{
    "title": "Danielle ‘Bhad Bhabie’ Bregoli Lands $900K Copy Cat Beauty Deal",
    "text": " By clicking Sign Up, you agree to our Terms and Conditions and that you have read our Privacy Policy. Sign In with your social account We won't post to any of your accounts without asking first Your password must include: Sign In with your social account We won't post to any of your accounts without asking first Your password must include: It’s been quite a while since Danielle Bregoli burst onto the scene. (Just in case you might’ve forgotten, she was the girl on Dr. Phil who coined the phrase “cash me outside, how ‘bout dat?”) Now the viral sensation, who’s also known as rapper Bhad Bhabie, is making a mark in beauty. Copy Cat Beauty announced January 16 that the 15-year-old star signed a $900k deal with the budget-friendly cosmetic site. “I’m excited to work with CopyCatBeauty.com,” she told Us in a statement. “When I was sent the product to try, I started using it all the time, so working with them just makes sense.”  And it could makes sense for your wallet, too — the brand aims to offer affordable alternatives to pricey products with similar formulations. That means you might spot a $10 dupe for the $50 palette you’ve been eyeing on the site. Getting into makeup isn’t the only thing she’s been up to since her rise to fame in late 2016. In fact, Bhad Bhabie has built up an impressive resume with a reality TV deal, new singles — her “Hi Bich” rap went gold in March! — and international tours. Most recently, she’s also become the new face of Snapchat where she’s currently filming a 12-episode original docu-series called Bringing Up Bhabie, coming out later this year. By the way things are going, it looks like she’ll be making cash — no matter if she’s indoors or out! In order to view the video, please allow Manage Cookies You have successfully subscribed. By signing up, I agree to the Terms and Privacy Policy and to receive emails from USWeekly You have successfully subscribed. By signing up, I agree to the Terms and Privacy Policy and to receive emails from USWeekly Us Weekly has affiliate partnerships so we may receive compensation for some links to products and services. Part of the a360media Entertainment Group.Powered by WordPress VIP ",
    "datetime": "2019-01-16T23:09:01+00:00",
    "url": "https://www.usmagazine.com/stylish/news/danielle-bhad-bhabie-bregoli-lands-900k-copy-cat-beauty-deal/"
}