{
    "title": "Davichi Holds Off 2NE1 for No. 1 on K-Pop Hot 100 – Billboard",
    "text": "Davichi stays strong for a second week at No. 1, thwarting 2NE1, Ailee and Jay Park's quests to snag the top spot. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin Davichi stays strong at No. 1 for a second consecutive week, thwarting 2NE1’s quest to snag the coveted spot. The duo, under Core Contents Media, has been killing the charts with various tracks this year, including “Turtle,” “Let’s Have A Drink” and “Be Warmed,” showing no signs of slowing down with the girls recently speaking about already planning their next album. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news   The ladies of 2NE1 settle for the runner-up slot as reggae-tinged “Falling in Love” comes in at No. 2 this week. The track had a big debut last week, shooting up to No. 11 without a full week of sales, and missing No. 1 could be attributed to timing. 2NE1 has announced plans to release one single every month until October, making future chart toppers likely. The foursome can take solace in the fact they have earned over 6 million more music video views as “Falling in Love” approaches the 7 million mark. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t07/18/2013 The girls’ previous single, last summer’s “I Love You,” debuted at No. 1. Watch a special recent performance when 2NE1 performed “Falling in Love” as well as leader CL performing her solo track “The Baddest Female” at Korea’s 20’s Choice Awards.  Female soloist Ailee makes a big return on the charts with her comeback single, “U&I.” Vocally, the track plays off the same approach as Christina Aguilera and Beyonce with an old jazz throwback sound. The video showcases Ailee’s fiercest look yet with high-fashion outfits showing off her legs, colorful eyeliner and a striking new red ‘do. While solo singles “Heaven” and “I’ll Show You” peaked at Nos. 3 and 2 respectively, Ailee did earn her first K-Pop Hot 100 with her feature on BAE CHI GI’s “Shower of Tears.” Her singles have had proven longevity too. Don’t count the Jersey native out for the top spot just yet.   Male soloist Jay Park storms the chart with his recently released single, “I Like 2 Party,” at No. 13 this week. The track was first previewed in Korea after being selected as the ending theme song for the premiere of Will Smith’s new movie, “After Earth.” The song was produced by Jay Park and longtime friend Cha Cha Malone. The song has a powerful beat with heavy electro sounds topped off with an infectious hook, a perfect fit for the summer. In the music video, Jay Park flaunts his sculpture-like body and nimble dance moves, crooning and partying, with women in fun costumes and colorful wigs. The clip has scored nearly 700,000 clicks since its release on July 9 and also features a cameo from famous celebrity jeweler Ben Baller. Jay Park also represents K-pop as his EP “I Like 2 Party” debuting at No. 1 on the Billboard World Album charts. He even beats our popular Japanese pop artist KyaryPamyuPamyu’s album “Nanda Collection.”  Other chart highlights include Brown Eyed Girls’ “Recipe” zooming up to No. 7 from No. 31. Plus at No. 7 last week, Apink’s “NoNoNo” gave the quickly rising girl group their first Top 10 single. At No. 4 this week, “NoNoNo” gives them their first Top 5 single. Watch Apink perform “NoNoNo” on music program “M COUNTDOWN” and hear a remarkably enthusiastic audience chant along:  Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2013-07-18T23:36:36+00:00",
    "url": "https://www.billboard.com/music/music-news/davichi-holds-off-2ne1-for-no-1-on-k-pop-hot-100-3038755/"
}