{
    "title": "Davichi Lands Third K-Pop Hot 100 No. 1 With ‘The Letter’ – Billboard",
    "text": "Check out K-Pop Hot 100 chart highlights from Davichi miss A, Park Hyo Shin, BIGBANG members and more. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin Female vocal duo Davichi notch their third K-Pop Hot 100 No. 1 hit this week with “The Letter. As K-Town highlighted last week, the new single reunites the act with songwriter Jeon Hae Sung who composed the girls’ biggest K-Pop hit to date: Three-week chart-topper “Don’t Say Goodbye.” Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tSung Si-Kyung\t\t\n\t\t\t\t\t\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news Davichi originally released a “drama” version for the music video for their latest ballad (watch here). The ladies also dropped a “lip” version, focused on glamorous close-ups and their emotional singing style. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t11/22/2013   The Davichi girls at No. 1 slot means Sung Si-Kyung’s “To You,” a remake of the mega-hit by classic K-pop act Seo Taiji and Boys, has had the top slot stolen away yet again. After a No. 3 debut two weeks ago, the soundtrack single for popular Korean TV drama “Reply 1994,” stays at No. 2 for a second week. Just below Sung, at No. 3, is another soundtrack single. Park Hyo Shin’s “It’s You” for the drama “The Future Choice” makes this week’s Hot Shot Debut. In the string-centric ballad, Park showcases the strength in both his falsetto and chest voice quickly jumping from soft crooning to powerful belts.  After debuting at No. 4 last week, popular girl group miss A and their sexy single “Hush” stay strong at No. 4. The girls have been gaining attention for their live performance of the dance track incorporating tight outfits and a seductive routine with curtains and hanging themselves off bars. Watch a recent live performance below:  At No. 9, BIGBANG rapper T.O.P. makes his solo debut on the K-Pop Hot 100 with “Doom Dada.” The aggressive, thumping hip-hop track is the handsome MC’s first solo music endeavor since his 2011 collaboration LP with BIGBANG leader G-Dragon, “GD & TOP.”  Watch the eccentric music video below where the musician/actor dresses up as a Neanderthal, rides a zebra, rides a motorcycle with an oversized, crying baby and more for what might K-pop’s quirkiest video of 2013.  Notably, T.O.P. replaces his fellow BIGBANG member Taeyang, who sat at the No. 9 position with his solo single “Ringa Linga” last week. T.O.P.’s latest release means almost every BIGBANG member has charted in the Top 10 of the K-Pop Hot 100 this year with a solo single. BIGBANG vocalist Seungri landed “Gotta Talk to U” (which peaked at No. 10) in September, while G-Dragon sent “Crooked” (which peaked at No. 2) and “Who You” (No. 4) into the Top 10 less than a month later. Main vocalist Daesung has not released any Korean material this year.   Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2013-11-23T00:00:07+00:00",
    "url": "https://www.billboard.com/music/music-news/davichi-lands-third-k-pop-hot-100-no-1-with-the-letter-5800505/"
}