{
    "title": "Davichi Earns Second K-Pop No. 1 Amid Label Shakeups – Billboard",
    "text": "Davichi -- aka Lee Haeri and Kim Minkyung -- claim the No. 1 throne this week with latest single, \"Missing You Today.\" It's their second K-pop Hot 100 No. 1 single. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin Davichi — aka Lee Haeri and Kim Minkyung — claim the No. 1 throne on the K-Pop Hot 100 this week with latest single, “Missing You Today.” It’s their second No. 1 single since Billboard Korea launched its chart in August of 2011. (2011 single, “Don’t Say Goodbye” reigned for three consecutive weeks from Sept. 7 to Sept. 21.) Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news “Missing You Today” is a med-tempo, guitar-driven, acoustic number that touchingly talks about the contradicting emotions one feels — disappointment, loneliness and numbness — in the late period of a breakup while showcasing the duo’s powerful vocals. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t07/14/2013  While Davichi remain strong and at the top of their game, things with their labelmates are a-changin’. Core Contents Media (CCM) has announced lineup changes to three acts. Most notably, member Areum will leave controversial girl group T-ara. The once-major powerhouses (with two K-Pop No. 1s) were rocked by a bullying scandal last summer when rapper Hwayoung was unexpectedly kicked out of the group. The group has still not recovered from the scandal fully, focusing on overseas markets and sub-units recently. 19-year-old Areum will promote as a solo artist under the label. Her spot in T-ara N4 will be filled by English-speaking CCM trainee Dani. Luckily for the girls, CCM has handled the transition better than Hwayoung’s situation. Additionally, CCM’s boy band SPEED will add two members for what is described as a special project. Though, it’s not clear if the two male members will stay in SPEED when it ends. Lastly, 5dolls — who will now be known as F-ve Dolls — will now consist of six girls with original members (Eunkyo, Hyoyoung and Hyewon) and three new members, including one from another girl group The SeeYa, Yeonkyung. She will promote in both groups.  Hip-hop heavyweights Dynamic Duo make a super-strong comeback this week, placing 11 tracks from their seventh LP, “LUCKYNUMBERS” on the chart this week.  Two made it to the Top 10: lead single, “BAAAM” rises to No. 3 while “Hot Wings” featuring SISTAR’s Hyorin lands at No. 10. “BAAAM” (translated to “Snake” in Korean) sees both members express the frustration of being swindled by a woman, but admiring her at the same time, over heavy beats. Dynamic Duo has consistently charmed hip-hop aficionados for 14 years and their huge, die-hard fanbase follows their every move, which might explain the tremendous success of “LUCKYNUMBERS.” The rest of the tracks off “LUCKYNUMBERS” stack up thusly:  “Three Dopeboyz” (No. 12), “Life Is Good” (No. 19), “Return Of The Kings” (No. 32), “Grand Slam” (No. 37), “Airplane Mode” (No. 54), “Good Morning Love” (No. 55), “Let’s Meet Often” (No. 56), “Crime Scene” (No. 67), and “Tragedy Part.2” (No. 76).  Rising K-pop girl group Apink (who recently lost member Yu Kyung) earn their highest-charting single on the K-Pop Hot 100 this week with “NoNoNo.” The single combines the sextet’s adorable charms and still-maturing voices with bubblegum pop and unexpected, but much welcomed, funky dance sections. The video complements the song showing a colorful set with the girls throwing a birthday party accompanied by cupcakes, balloons and flowers. But there’s a sexy undertone to contrast the sugary-sweet scenery showing the girls shaking their backsides to the camera during the chorus.  With Davichi and Apink as shining examples, girl groups continue to rule the K-Pop Hot 100. This week also sees entries from SISTAR (“Give It to Me” falls from No. 1 to No. 4), 4minute (“Is It Poppin’?” holds at No. 6), Girl’s Day (“Female President” falls two spots to No. 9) and Dynamic Duo’s aforementioned “Hot Wings” featuring Hyorin of SISTAR. Next week expect even more girl group to make big moves as next week’s chart will reflect a full week of sales from 2NE1 (“Falling in Love” starts at No. 11 this week) and Brown Eyed Girls (“Recipe” at No. 31). Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2013-07-14T21:45:03+00:00",
    "url": "https://www.billboard.com/music/music-news/davichi-earns-second-k-pop-no-1-amid-label-shakeups-1569807/"
}