{
    "title": "\r\n\tDentsu K scoops Line Cookie Run mobile game’s creative account | News | Campaign Asia\r\n",
    "text": "TAIPEI – Dentsu K (電通國華, formerly Dentsu Kuohua) has won Line's creative pitch for Taiwan promotion of a mobile game called 'Cookie Run', Campaign Asia-Pacific confirmed. The creative pitch took place on 16 May, and the agency pitched against Dentsu Taiwan, JWT, and McCann Worldgroup, according to sources. Those agencies did not respond to a request for confirmation in time for publication. The messaging-app company announced the pitch result on 19 May. Line Cookie Run launched globally earlier this year. The game resembles Mario Brothers, with a gingerbread cookie trying to avoid obstacles while on the run. Line previously ran a global TVC for the game in Taiwan. Dentsu K is understood to be discussing its creative plan with the client. This is first mobile account for the Dentsu K team. Its clients include Uniqlo; GU (a sub-brand of Uniqlo); 7-Eleven, Visit Japan Campaign; Panasonic's Viera TV, beauty electronics, and Lumix cameras; and Honda Automobile. The agency rebranded in August 2013.  Top news, insights and analysis every weekday Sign up for Campaign Bulletins Who doesn't love enjoying a nice sweet treat. But would you use one to brush your teeth with before bed? From next year, Mickey Mouse the legendary rodent, will no longer be owned by Disney. With the chains of IP law beginning to unshackle, what does this mean for the future of the brand's beloved character? This tarot-reading Havas creative pines to visit the ancient pyramids of Egypt, get off Instagram so she can embrace a digital detox, and is busy trusting the process. A Mindshare China loyalist of over 24-years, Low is instrumental for commercial gains as well as client and staff retention. Terms & Conditions / Contact Us © Haymarket Media Ltd. ",
    "datetime": null,
    "url": "https://www.campaignasia.com/article/dentsu-k-scoops-line-cookie-run-mobile-games-creative-account/386685"
}