{
    "title": "Diamond Nail Art Is the Latest K-Beauty Trend  | Teen Vogue",
    "text": "By Sarah Wu Just when you thought manis couldn’t get shinier than they already are, K-beauty is here to prove us wrong once again. We thought we had reached peak sparkle when we saw Gigi Hadid’s shining, Swarovski nail art, but the latest trend to land on our radar makes crystals look dull in comparison, thanks to diamonds. Before you balk, know that we’re not talking about real gemstones here — that’s hardly an accessible way to accessorize your nails. Instead, diamond nails are an amazing update on the shattered glass nails trend we fell in love with last year. In case you’re not familiar, the technique involves sticking prismatic pieces of cellophane on your nail beds, creating the look of glass shards. Some of our favorite examples came from South Korean manicurist and founder of Unistella salon, Eun Kyung Park. Naturally, she’s also the genius behind this glittery upgrade. “NEW #3D #leddiamondnail,” she captioned the mesmerizing video, which we still can’t stop watching. While she has yet to reveal the technique, we suspect she used the same, cut-and-paste method that gives the glass nail effect — but with holographic foils instead of cellophane. And, for an even easier take on the trend, you can always pair a holographic lacquer with a flake-finish topcoat. Shine bright! This content can also be viewed on the site it originates from. This content can also be viewed on the site it originates from. Related: We’ve All Been Applying Glitter Nail Polish COMPLETELY Wrong By Kathleen Walsh By Juan Velasquez By Anoushka Lal By Sara Delgado More from Teen Vogue Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Teen Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "datetime": "2016-12-19T17:01:10.230Z",
    "url": "https://www.teenvogue.com/story/diamond-nail-art-k-beauty-trend"
}