{
    "title": "Did James Packer gift Miranda Kerr $100K diamond earrings? | Daily Mail Online",
    "text": "By Erin Van Der Meer for Daily Mail Australia Published:  01:16 BST, 22 December 2014   |  Updated:  09:33 BST, 22 December 2014  64 View  comments  There's been little news of a romance between Miranda Kerr and James Packer since the pair were spotted holidaying on the billionaire's yacht off the coast of Spain in August. But a new report claims the love is very much alive between the famous Australians, with the casino mogul said to have gifted the former Victoria's Secret model with a pair of diamond earrings worth $100,000.  'He bought them for her about four weeks ago,' a source told Woman's Day. Scroll down for video All she wants for Christmas? Miranda Kerr received a pair of diamond earrings worth $100K from billionaire James Packer, Woman's Day magazine reports The magazine claims the expensive bling could be a Christmas gift for the 31-year-old mother of Flynn, three. Daily Mail Australia has reached out to a representative for Miranda for a comment. The reports of an extravagant gift come as the Australian beauty told InStyle magazine she is 'very single'. 'Very single': Miranda recently told InStyle magazine she is 'really happy to be single' and enjoys spending time with friends and family Big spender: Woman's Day revealed the report this week  '[I'm] single...and really happy to be single,' she told the magazine. 'I'm just happy right now to have my focus,' she added. 'I need to spend more time with my friends.' Rumours first began that Miranda and James were more than friends a year ago. The high-profile pair have been linked since December last year, when Woman's Day reported that Packer had told friends 'I'm seeing Miranda Kerr'. Both stars had recently announced divorces from their partners, Packer splitting from wife Erica in September and Kerr from actor Orlando Bloom in October. Earlier this year Miranda said as long as the important people in her life know the truth about her relationship status, she is not fussed by other reports. In an interview with The Sunday Times in the UK, she denied claims she was at the centre of the very public bust-up between Packer and his longtime friend, Channel Nine boss David Gyngell that took place in June.         Share what you think The comments below have not been moderated. The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. We are no longer accepting comments on this article. Published by Associated Newspapers Ltd Part of the Daily Mail, The Mail on Sunday & Metro Media Group ",
    "datetime": "2014-12-22T01:16:29+0000",
    "url": "https://www.dailymail.co.uk/tvshowbiz/article-2883055/Did-James-Packer-gift-Miranda-Kerr-100K-diamond-earrings-Billionaire-bought-Aussie-beauty-bling-Christmas.html"
}