{
    "title": "Digital Storytelling, Education Help Korean Brands Expand in U.S. – WWD",
    "text": "Glow Recipe and AmorePacific are both using digital media to take Korean skin-care brands to new markets. Beauty Editor, Finance For brands looking to capitalize on the popularity of Korean skin care, digital storytelling and tech-enabled education are keys to success. “The explosion of the K beauty market is really possible because of the exchange of information,” says Dan Jee, director of digital marketing and e-commerce at AmorePacific.“Information-sharing is so rapid.” Take, for example, Glow Recipe, a business founded by former L’Oréal marketer Sarah Lee and cofounder Christine Chang in 2014 when they saw an opportunity to take brands beloved by Koreans and translate them for the U.S. market. The strategy includes education, sometimes renaming or re-branding products and a constant dialogue with customers through social media channels like Snapchat and Instagram, or e-mail.  On one of Lee’s frequent trips for Korea, she encountered aqua peeling, a gentle exfoliating process that can be handled during a lunch break. To amp up awareness of the new process, Lee had the Glow Recipe team write a “deep-dive” blog post to show why aqua peeling is relevant to American consumers. “Aqua peeling popped up in five major digital media outlets,” Lee said. “Within two weeks the whole inventory was sold out.” Other products, especially ones with unfamiliar product names or descriptions, require a different approach. Glow Recipe renamed “modeling packs,” calling them rubber masks, and changed “patting water packs” to splash masks. Plus, they modified the splash mask formulation — which originates from a basin filled with rice steep water that Korean women pat onto their faces — so it could be used in the shower. “I think Americans are less inclined to fill up the basin, so we came up with the splash mask term,” Lee said. Related Articles\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tFinancial\n\t\n\n\n\n\t\n\t\t\tSMCP Sales Down in Third Quarter Following Company Warnings\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tFinancial\n\t\n\n\n\n\t\n\t\t\tUnilever Q3 Growth Declines Due to Currency, Sells Dollar Shave Club Teaching an unfamiliar consumer while not alienating your existing one is a key for Korean beauty business AmorePacific, which has been around for about 70 years. “I want to make sure I’m catering to the audience that already knows about the product…at the same time, I’m trying to…address these people who are hearing about the product for the first time…and make sure they are getting the proper education,” Jee said. Part of that process stems from product ingredients. “When you think about ginseng in America, you don’t think about it as skin care,” Jee says. “How do we tell people it goes from the ginseng root to really help your skin and health? We want to make sure we use this digital channel as an enabler — it’s really enabling to really talk about the quality of the products and the quality of the brand story that we want to tell.” Sign up for beauty news straight to your inbox every day Top News Stories Alerts Straight to your Inbox. Send us a tip using our anonymous form. WWD and Women's Wear Daily are part of Penske Media Corporation. © 2023 Fairchild Publishing, LLC. All Rights Reserved. ",
    "datetime": "2016-02-24T03:00:44+00:00",
    "url": "https://wwd.com/beauty-industry-news/beauty-features/digital-storytelling-korean-brands-expand-in-u-s-10365085/"
}