{
    "title": "Diving Is the K-Beauty Trick for Melt-Proof Makeup  | Vogue",
    "text": "To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. By Monica Kim “It’s the hot tip in K-beauty right now.” This, I’m told constantly, and always take with a fat grain of salt. But at dinner in Seoul last week with a particularly plugged-in friend, I heard that a rather unorthodox trick called jamsu makeup (roughly translated to “diving” or “submerging”) had swept the city this summer, producing a perfectly matte, melt-proof face with little more than a bottle of baby powder and a basin of water. Given the thick humidity enveloping both the U.S. and Korea of late, I was at least intrigued by the wholly whimsical proposition. It was purportedly a Japanese beauty blogger who sparked the trend on YouTube, though it quickly became a Korean sensation. The novel technique bears some similarity to “baking”—setting your makeup with powder and body heat—but feels rather next-level. First, cleanse and moisturize, then swipe on primer, foundation, and concealer, per usual. Then, shake heavy handfuls of Johnson’s Baby Powder onto your palms (though any loose powder will do) and pat it on freely, releasing clouds of it into the air until a pale kabuki-style base appears. Filling a sink with cool water, plunge your powdered complexion into the bath and hold it there for no more than 30 seconds. Finally, pat your face dry, and finish the rest of your look with a lasting, pitch-perfect canvas. “If you have dry skin, don’t push your face in the water too long,” my friend says, adding that one might take a facial mist and spray liberally, instead. A bit reluctantly, I dunk my Ringu-esque head in the sink for some 15 seconds, feeling (frankly) ridiculous. But, I quickly find, the results are beyond. Yes, my skin is intensely matte, but also incredibly smooth and even-toned. Better yet, when shading in my arches and applying liner, there is no oil-induced glide, allowing me to craft fine, pencil-thin strokes that are the best brow-work I’ve done in ages—all thanks to a $4 tin of drugstore powder. It lasts remarkably well with no under-eye smudging and, I’m frequently told, my face looks softer and even younger—appropriately enough, like the skin on a baby’s bottom. By signing up you agree to our User Agreement and Privacy Policy & Cookie Statement. By Kiana Murden By Calin Van Paris By Calin Van Paris By Georgia Day By Kiana Murden By Hannah Jackson More from Vogue See More Stories © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices CN Fashion & Beauty ",
    "datetime": "2016-08-24T15:37:52.000Z",
    "url": "https://www.vogue.com/article/korean-baby-powder-makeup-trick"
}