{
    "title": "Does the hanacure face mask really work?",
    "text": "Shop it for under $50. Yahoo Lifestyle Canada is committed to finding you the best products at the best prices. We may receive a share from purchases made via links on this page. Pricing and availability are subject to change. Oh, the Hancure mask. First introduced to me by the influence of the Kardashians, this creepy-looking but revitalizing facial mask has been my go-to solution for an instant lift and brightening. But did you know that it was Drew Barrymore that first put beauty lovers and celebrities alike on this strange yet effective beauty trend? ALSO SEE: #TrendOnTrial: I tried this strange mask the Kardashians swear by — here's what happened In 2017, Barrymore shocked fans by posting a strange #hanacureeffect selfie on Instagram. “You paint it on with a brush. It starts to dry. It pulls. It gets so tight that it literally pulls your face. See above,” Barrymore wrote. “But, It makes you look so fresh when you wash it off. And it's so effective. How fun is that in a package.” View this post on Instagram #beautyjunkieweek this is a @hanacureeffect mask @thehanacure nuts when you take it off you are 10 years younger. You paint it on with a brush. It starts to dry. It pulls. It gets so tight that it literally pulls your face. See above. But, It makes you look so fresh when you wash it off. And it's so effective. How fun is that in a package. #notttooenvasivebeauty #kbeauty thank you @crystalmeers for the info that's changed my life A post shared by  Drew Barrymore (@drewbarrymore) on Feb 17, 2017 at 3:39pm PST In case you haven’t heard of this K-beauty-inspired mask, Barrymore has hopped back on Instagram to show fans how it works and why it been her anti-aging secret for years. In a short clip posted on Monday, a nearly unrecognizable Barrymore sports the mask and gets straight to the point, by crediting the brand and saying, \"Hanacure.\" “#BEAUTYJUNKIEWEEK IS HERE! It just felt right. Let’s get her started with @hanacure because it gets the job done! Intsa facial! I swear by it! Slather one on, get tiiiiiiigggghhht, and voila! A professional level treatment at home. Trust,” she captioned the video. View this post on Instagram #BEAUTYJUNKIEWEEK IS HERE! it just felt right. Let’s get her started with @hanacure because it gets the job done! Intsa facial!!!!!! I swear by it! Slather one on, get tiiiiiiigggghhht, and voila! A professional level treatment at home. Trust! A post shared by  Drew Barrymore (@drewbarrymore) on Aug 10, 2020 at 8:43am PDT The popular dermatologist-tested mask, powered by a CO2 Octolift compound and essential botanicals, intensely tightens the skin upon drying and leaves a strange discolouration on the face that leaves people unrecognizable. The mask has been made famous by the thousands of impressive before and after photos shared to social media under the hashtag #hanacureeffect. It’s known to increase collagen and reveal a smoother and brighter complexion — after you rinse, that is. Also formulated with Acetyl Hexapeptide-8, a non-invasive alternative to Botox, it magically reduces the appearance of wrinkles after just one use. SHOP IT: Hanacure, approx. $39 (US$29) “It was incredibly tight as it dried. I looked in the mirror and saw a monster staring back at me! Lol. My face felt amazing afterwards,” says one reviewer, who gave it a five-star rating. “Incredible product. Used just once and INSTANT difference. Bought a whole set right after. Can’t wait to do it again! Never been so obsessed with a product in my life,” adds another shopper.Designed for one application, each order includes a lifting serum, a gelling pack and a brush for $29. But as pricey as this multi-action treatment mask can be, 93 per cent of users say they would recommend it to friends and family, while another 90 per cent of users agree that it improves the skin’s overall appearance. There’s also the option to purchase a set of four treatment masks. SHOP IT: Hanacure, approx $145 (US$110) Let us know what you think by commenting below and tweeting @YahooStyleCA! Follow us on Twitter and Instagram. \"Can’t read and won’t follow the rules.\" A team of scientists say they have discovered what caused the sudden deaths of hundreds of elephants in Africa in 2020.  More than 300 elephants died in Botswana's Okavango delta in the May and June of 2020, with another 35 dying in Zimbabwe two months later.  The deaths triggered an international mystery, with only poaching and anthrax poisoning initially ruled out. The Princess of Wales attended Lady Rose Windsor and George Gilman's wedding in 2008 without boyfriend Prince William in a mini wedding guest dress – throwback photos. NEW YORK (AP) — Donald Trump was called to the witness stand and then fined $10,000 on Wednesday after a judge concluded that the former president had violated a limited gag order in his civil fraud trial. It was the second time in less than a week that Trump was penalized for his out-of-court comments. Before imposing the latest fine, Judge Arthur Engoron summoned Trump from the defense table to testify about his comment to reporters hours earlier about “a person who’s very partisan sitting alo \"He was such a great husband and such a great dad, and I think that I fell into a situation where I thought that the grass was greener somewhere else,\" Kris Jenner admitted of ex Robert Kardashian Sr. MPs overwhelmingly voted to kill a bill Wednesday pushed by Conservative Leader Pierre Poilievre that would have banned Ottawa from again imposing COVID-19 vaccine mandates on federal workers and the travelling public.By a vote of 114-205, MPs agreed to drop the private member's bill, C-278, that Poilievre first introduced last year when he was running for the party's leadership.The bill was subsequently picked up by Conservative MP Dean Allison, a noted anti-mandate critic who, like his leader, Sidney Powell has continued to push conspiracy theories claiming the 2020 US election was rigged after she pleaded guilty to election interference. \"Fried Rice Syndrome is a form of food poisoning caused by the Bacillus cereus bacterium. This bacteria is commonly found in foods that have been sitting at room temperature for extended periods,\" explained board-certified emergency medicine physician Dr. Joe. The Duke of Sussex lives near his wife Meghan Markle's mother Doria Ragland in California. See inside Harry's bond with his mother-in-law away from the cameras… Elton John had a special reason to celebrate on Wednesday as his husband, David Furnish, marked his 61st birthday and the iconic singer shared the sweetest photo of their two children \"He was even wearing his Ryan Reynolds costume,\" Ryan Reynolds wrote on Instagram about his accidental meet-up with older brother Terry The star said she welcomed alone time to process her thoughts and feelings in the wake of her split from her husband of 14 years, Cory Hardrict What would you do if your child turned into a bridezilla? The CNN anchor didn’t hide his exasperation at cutting away to the latest development on the “utter clown car” of the House Republican speaker’s race. Donald Trump’s wealth, power and fame acted like a magnet for new associates keen to enter his orbit. But now, key figures who sought a share of his reflected glory are turning against him to save themselves. Britney Spears says her team forced her to perform at the 2007 VMAs and that she ran into ex Justin Timberlake on \"one of the worst days\" of her life. \"The judge should end this trial immediately,\" the former president told reporters upon exiting. The former House speaker is urging Republicans to take control of their party from Trump's \"fringe element.\" Events in Avdiivka show Russia still struggles with the style of war needed to capture territory in Ukraine, a prominent analyst told Insider. The former White House chief of staff \"could speak to Trump’s mindset in a very specific way,\" the New York Times reporter said. ",
    "datetime": null,
    "url": "https://ca.style.yahoo.com/drew-barrymore-looks-unrecognizable-with-this-39-kbeauty-face-mask-202636285.html"
}