{
    "title": "\r\nDon Lee returns with film on how K-beauty business began",
    "text": "Most Popular G-Dragon booked for drug use South Korea, Qatar agree to elevate ties, forge $4.6b industry partnership Former Olympic hero battles rumors surrounding her groom-to-be S. Korea goes all out to contain lumpy skin disease Yoon pitches S. Korea's investment appeal to Middle East Yoon meets Park, honors father in gesture of conservative unity 4-meter deep sinkhole injures 1 in central Seoul Olympic medalist ‘tricked’ by fiance-turned-stalker [News Focus] A year after Halloween crowd crush, legislation remains stalled Braving wind and high water to celebrate Dokdo Day Start your day with a roundup of key stories from The Korea Herald with news and comment on all that’s happening in Korea. Published : Nov. 20, 2022 - 15:27 Link copied  After proving his competence as both producer and lead actor in the hit movie “The Roundup,” Korean American actor Don Lee -- better known as Ma Dong-seok here -- is returning with “Men of Plastic.” Lee took part in the upcoming comedy movie about how the K-beauty business began in Apgujeong in Seoul, both actor and producer again. Apgujeong, a ward in Gangnam District, is one of South Korea's most affluent districts and home to numerous plastic surgery hospitals and skin care clinics. “I came up with the idea for this movie around eight years ago. I wanted to create a movie that is set in Apgujeong, which is the mecca for the K-beauty business,” Lee said during a press conference held Thursday at CGV Yongsan. From that seed idea, he took inspiration from a real person to develop his story. “I usually start creating the story from a real-life story. My character in the ‘Men of Plastic’ was also created based on a man that I know. I watched him closely and found out about the business that he tried to expand and became very interested,” Lee added. In \"Men of Plastic\" directed by Lim Jin-soon, Dae-kook (Lee) was born and raised in Apgujeong in Seoul. Dae-kook meets Ji-woo (Jung Kyoung-ho), the most talented plastic surgeon in the area who unfortunately lost his license. Dae-kook convinces Ji-woo to jointly start a business with him, saying they can lead the global expansion of Apgujeong's plastic surgery business.    Lee compared the new movie with his previous work that came out in May 2022 and sold about 12.7 million tickets. “‘The Roundup’ is an action film with some comedy elements, but it also deals with some deep material. The new film is rated PG12 because for this time I wanted to create a family movie that the entire family can enjoy,” Lee said. Also, Lee who is used to performing action scenes with short lines in his previous projects said it was difficult to play a character that talks a lot. “My character tries to resolve all the problems by convincing others, so he had lots of lines. It was more difficult than I thought. Filming action scenes is also difficult but I am used to it. But since I am not a talkative person in real life, it was difficult to play a character that talks a lot,” Lee said. According to director Lim, shooting a film set in Apgujeong with Lee has a special meaning to him. “Before creating my first film around 20 years ago, I used to hang out at a bar in Apgujeong with Don Lee. We used to talk about doing a project together. So actually making a film with him that is also set in Apgujeong is special,” the director said. “I always enjoy exploring different genres of films so I loved creating this fun, entertaining comedy movie with Don Lee this time. It was a meaningful project for me,” added Lim, who previously created the crime-action film “Ordinary People” (2018) -- also starring Lee. \"Men of Plastic\" will hit local theaters on Nov. 30.   Articles by Song Seung-hyun The Korea Herald by Herald CorporationCopyright Herald Corporation. All Rights Reserved.  ",
    "datetime": "2022-11-20T14:05:37+09:00",
    "url": "https://www.koreaherald.com/view.php?ud=20221120000115"
}