{
    "title": "Dr Jart+ Is A Cult Skincare Brand In The Making – Here’s Why | British Vogue",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, select My Account, then View saved stories To revisit this article, visit My Profile, then View saved stories To revisit this article, select My Account, then View saved stories We may earn a commission if you buy something from any affiliate links on our site. By Hannah Coates If you haven’t yet heard of Dr Jart+, it’s only a matter of time until you do. One of the best known Korean skincare brands – that has been instrumental in bringing some of the most enduring K-beauty trends over to the UK – it has recently re-launched here at Boots, to great relief from those who already swear by its products. The renaissance of the brand (which was founded in 2005 by ex-architect Chin Wook Lee and was later bought by Estée Lauder in 2019) is accompanied by a seal of approval that all excellent formulas (think CeraVe and The Ordinary) enjoy: viral TikTok status. The brand’s Cicapair Tiger Grass Colour Correcting Treatment has become a skincare sensation on the social media platform, which has a knack for propelling previously under-the-radar products to cult status. Combining soothing anti-inflammatory ingredients, like raspberry leaf extract and cica (otherwise known as centella asiatica or tiger grass), in a colour-changing cream, it neutralises redness and acts as a second-skin base. It is but one example of the brand’s problem-solving, hybrid skincare products and, contrary to the traditional 12-step K-beauty skincare regime, makes stripping back the number of products one uses (also known as skinimalism) a breeze. This content can also be viewed on the site it originates from. By Alice Cary By Hannah Jackson By Hannah Coates The brand’s product line-up comprises a few different “albums”, as they call it; to you and I, that’s different ranges. The Tiger Grass Colour Correcting Treatment is a part of the bestselling Cicapair range, which harnesses the power of cica to relieve and repair sensitive skin caused by environmental factors such as pollution – the line includes everything from a serum to a calming gel cream. Then there is Ceramidin, which spotlights another ingredient du jour – ceramides – to help strengthen the skin barrier; the cream is a good first port of call. And finally, there is Vital Hydra, which is one for those with dehydrated skin thanks to five different types of hyaluronic acid in its formula. It is also formulated to look after our skin microbiome, more on which later. As a result of the Korean consumer’s skincare know-how (they are fluent in “home care” which is the concept of taking your aesthetician’s teachings and product recommendations home to carry on the treatment day to day) the products are all designed to tackle the problems that prevent one from having healthy, glowing skin. It is this that’s behind its cult following: “The fundamental root of our business is about creating an exceptional and differentiated skincare solution,” Lee tells Vogue. “Our commitment to being skincare innovators drives us towards new cosmetic breakthroughs without the need to conform to traditional [brand] rules – which, in turn, allows us to create the most effective products for healthy skin, through using the most trusted and safest ingredients, coupled with our scientifically-backed delivery methods.” It’s no wonder that the brand saw double digital growth in 2020. By Hannah Coates Korean cosmetics brands are, he says, making rapid advances in technology, which allows for them to launch these hybrid products that help slash the amount of time spent doing one’s beauty routine. And lest we forget, it’s brands like Dr Jart+ that brought the concept of now staple products, like BB creams, to the West in the first place: “In 2004, I found a blemish balm that was used at the clinic for treatment purposes and I was amazed at this hybrid that combined two steps of a beauty routine – skincare and make-up,” he says. “I reinterpreted this blemish balm as BB cream and went full speed ahead in launching my brand – it is a bestseller to this day.” So what can we expect to become the next big staple in our beauty regimes? Well, given the K-beauty market globally is expected to reach a huge $21.8 billion by 2026, when it comes to the science incorporated into each product to foster good skin health, it’s only up from here. Lee, for one, has his game plan in check: “The microbiome is one of the areas Bill Gates chose as a key topic in global healthcare research and development,” he says. “In the Korean market, it’s a hot topic in various fields like cosmetics, household goods and food. Via our brand characteristics of pursuing dermatology-led skincare solutions, we’re aiming to identify more technologies and ingredients that provide fundamental solutions to keep our skin healthy, and apply them effectively to products.” The message? Prepare to learn even more about your skin microbiome. By Alice Cary By Hannah Jackson By Hannah Coates £13, available at Boots.com. £28, available at Cultbeauty.co.uk. £7, available at Cultbeauty.co.uk. £30, available at Boots.com. £38, available at Cultbeauty.co.uk. £10, available at ASOS.com. More from British Vogue: By Tish Weinstock By Hannah Coates By Tish Weinstock By Tish Weinstock More from Vogue Condé Nast Britain © 2023 Condé Nast ",
    "datetime": "2021-02-16T16:46:30.256Z",
    "url": "https://www.vogue.co.uk/beauty/article/dr-jart-skincare"
}