{
    "title": "Dr. Jart Launches Shake and Shot Rubber Masks - K-Beauty Trend | Allure",
    "text": "By Sara Spruch-Feiner Rubber-masking, the Korean beauty ritual once available only in Seoul spas, is getting more accessible — and fun. Case in point: K-beauty mainstay Dr. Jart+ just launched its Shake & Shot masks, a collection of four \"DIY\" rubber masks sold in movie theater soda-inspired cups with slightly terrifying (or hilarious, depending on how you look it at) baby faces on their lids. The rubber masks work much like the at-home versions we've seen before, but Dr. Jart+ has made the treatments more user-friendly and less messy, thanks to the cup containers. The cup's \"straw,\" is in fact, not a straw at all, but rather a handy spatula used to mix part one, the mask's base, with part two, the targeted ampoule. Unlike other rubber masks, which require you to stir your concoction like a chemist (inevitably splashing formula on yourself in the process), to activate Dr. Jart+'s new masks, you place a finger over the cup's straw hole and shake — like you're mixing a cocktail. The formula quickly congeals into the rubbery texture you apply to your face. Just remember the masks aren't drip-proof, at least if you're an amateur when it comes to application (like me), but it's worth the dripping for the enjoyable cooling sensation on your face. Once it dries, you peel it off (experts will do so in one full, and extremely satisfying piece) to reveal glowing skin. Choose between hydrating, firming, brightening, or soothing options — or you know, pick up one of each. Each one-time-use treatment is $12. Below, a bit on each mask, so you can make an informed purchase. The Shake & Shot Brightening Mask utilizes vitamin C (ascorbic acid) and sea buckthorn fruit extract, which is chock full of antioxidants and helps even skin tone, brighten darkness, and revitalize the complexion. The Hydro edition gives skin a shot of emollient, moisturizing vitamin B5 and a Dr. Jart+ special, called \"expert moist complex,\" which is rich in amino acids and said to strengthen the skin barrier. The Firming mask packs a punch with a vitamin A derivative (retinol) and \"Oxyforce Cellular Active,\" Dr. Jart+'s proprietary complex to boost collagen synthesis and skin's elasticity. By Aliza Kelly By Gabi Thorne By Gabi Thorne Finally, the Soothing mask contains vitamin K, which a must when it comes to alleviating redness and a calming botanical complex. Shop all four of the Dr. Jart+ Shake & Shot Rubber Masks for $12 each at sephora.com now. Read more stories about K-beauty skin care: Now, learn this year's Best of Beauty winners in the breakthroughs category: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Nicola Dall'Asen By Devon Abelman By Dianna Mazzone By Kara McGrath More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2018-02-02T22:52:48.287Z",
    "url": "https://www.allure.com/story/dr-jart-shake-and-shot-rubber-masks"
}