{
    "title": "Eggs In Skincare Products - Korean Beauty Egg Skincare  | Teen Vogue",
    "text": "By Sarah Wu It’s no secret that we harbor a deep love for innovative K-beauty products, particularly those that get creative with their ingredients (snail slime creams, anyone?). That said, the latest skincare goods to catch our attention feature something you’re definitely used to seeing (and eating). In other words, it’s time to put a certain, protein-packed breakfast ingredient to work. “Eggs are a great source of protein and fat-soluble vitamins,” says dermatologist and founder of DDF Skincare Dr. Howard Sobel. “Egg whites alone can be used to help minimize and tighten pores, as well as lift and decrease puffiness around the eyes. Additionally, egg yolks are a source of fat-soluble vitamins and essential fatty acids, all known to be nourishing to sensitive skin.” To break it down further, you can expect to see benefits from copper, manganese, choline, and vitamins B6, A, and E. These are the building blocks needed to produce collagen and elastin, which keep your skin looking healthy and firm. So if the humble egg is such a miracle worker, why is it rare to see it included in our favorite moisturizers and serums? According to vice president of Too Cool for School Hye-shin Cho, it comes down to a complicated production process. “Typically, eggs are only used at salons or skincare massaging shops for special treatments,” she notes. “We wanted to develop a product line just like the homemade egg masks, containing essential ingredients from egg extracts that are convenient to use.” The line happens to be conveniently available at Sephora, and includes products for both body and face. Try the Sheet Mask or Mousse Pack for a quick facial that harnesses both the oil-controlling and nourishing properties of the ingredient. Our favorites of the range, though, have to be the Mousse Soap Facial Cleanser and Mousse Body Oil. “Egg white has excellent cleansing properties, so it clears clogged pores and effectively removes sebum and oil while also gently lifting away flaky dead skin cells,” explains Cho. As for the latter, it’s a fluffy foam that magically transforms into a featherweight body oil upon application. The effect is created by stabilizing the oil in high density (translation: tons of tiny bubble particles). The oil-mousse hybrid then melts into a traditional oil when you rub it into your skin. The genius delivery system ensures that the product absorbs super quickly; oil bubbles adhere easily to the skin, so they’re able to effectively deliver their active ingredients. While we definitely recommend that you check out this line immediately, it also makes us wonder about those leftover eggs in our fridge. And yes: you can totally use them to DIY your own facial. “I like making a pore-tightening mask by combining egg whites with steel-cut oatmeal,” says Dr. Sobel. “This will help reduce inflammation and oil without irritating the skin.” Cho takes it one step further with her wash-off recipe, which includes a whole egg, grain powders, honey, milk, and olive oil. Yes, the results will be messy, but you’ll reap the reward of smooth, radiant skin. As a bonus, you can apply any leftovers to your hair as a pre-shower mask, then rinse off for the shiniest strands. Now go, break an egg! Related: 4 Reasons Why Your Pimples Keep Showing Up in the Same Place By Teen Vogue Style Team By Kara Nesvig By Shama Nasinde By Rebekka Ayres More from Teen Vogue Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Teen Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "datetime": "2016-03-10T17:57:29.650Z",
    "url": "https://www.teenvogue.com/story/eggs-korean-skincare-secret"
}