{
    "title": "Elise Hu: The Beauty Ideal : NPR",
    "text": "MANOUSH ZOMORODI, HOST:  It's the TED Radio Hour from NPR. I'm Manoush Zomorodi. And on the show today, ideas about beauty.ELISE HU, BYLINE: I have been thinking about beauty culture and appearance standards a lot these days - how much beauty means to us, not just as women or men, but as society.ZOMORODI: If this voice sounds familiar, it's because you've heard her all over NPR. It's our very own Elise Hu. And in 2015, Elise moved to Korea to open up NPR's bureau in Seoul, a city which, in the past few years, has emerged as a cosmetics and skin care superpower.HU: When I first got to Seoul, the sort of pervasiveness and dominance of a really specific beauty standard and beauty norms was everywhere. The night I got to Seoul, I was staying in Myeong-dong, which happens to be the makeup district, where every store is lit up, up and down the street, by images of skin care products and women with these sort of alabaster skin faces. And every single store is the name of some sort of makeup brand. And so you can have kind of the face shop across from another face shop across from another face shop. And so it's like trick-or-treat, but for skin care products. So it was made very obvious to me as soon as I landed in Korea, the dominance of the skin care industry, but also appearance standards and the importance of looking a certain way.ZOMORODI: Elise wanted to see what it was like to follow all these Korean beauty trends. And so she did in a series called \"Elise Tries.\"(SOUNDBITE OF ARCHIVED RECORDING)HU: Skin care in South Korea is serious business, with South Korean women spending twice as much of their income on beauty products as American women.Really go in for the excavation. Oh, yeah. I think she's getting my nose pores. Mmm hmm. Oh, geez, you can hear it. Oh, dear. Oh, geez. I can actually feel stuff being sucked up.I want this off my face so bad because I feel like I'm, like - I'm feeling a little claustrophobic. Oh, my gosh.ZOMORODI: Today, Elise is writing a book about beauty - particularly K-beauty, as it's called.HU: I'm really fascinated by it. And I'm fascinated by the power of beauty ideals, politically, economically, but most important, culturally.ZOMORODI: Which is why we've invited her to be our guide on this episode. Because not only is she on NPR and researching this topic, Elise also hosts the \"TED Talks Daily\" podcast. So she watches a lot of TED talks.Elise, you are going to take us through a selection of TED talks about beauty norms or questioning the beauty ideal, not just in Korea, but all over the world. And there are so many layers to this topic, right?HU: Yes. Yes. So I went to Korea. I learned all of this stuff. But I didn't want to simply eviscerate Korean beauty because I take the industry and its growth and the influence of beauty really seriously. And I think that the pursuit of beauty is kind of a tentpole of the modern female experience, right? And my hope is just to kind of really take it seriously and make room in our conversations and in our minds for thinking through it and how the so-called beauty industrial complex plays a role in our experiences and our identities, right?We see so many digital images all the time flashing before us. And that kind of helps solidify norms of how we should appear in our sort of consciousness, right? And what I really wanted to dig into is the work that it takes to appear, quote, unquote, \"beautiful.\" It requires a lot of maintenance. It requires a lot of work. And it requires a lot of spending money on products or makeup or procedures. And that's just to kind of keep up with the Joneses - right? - of appearance standards. Because if you don't sort of meet those aesthetic norms, that'll cost you.(SOUNDBITE OF MUSIC)ZOMORODI: So we want to kick off our conversation with a talk about the influence that social media has had on how people think of beauty and also the sort of mental health for mostly young women. So the first talk is by two twins who live in Canada - Teagan and Keisha Simpson. They gave a talk in 2019 called \"Can Our Body Image Handle Social Media?\"(SOUNDBITE OF TEDx TALK)KEISHA SIMPSON: Different ages use and interact with Instagram differently. For example, if we were all to pull out our phones right now, what you would see on your account would be very different from what I would see because it all depends on who you follow. I'm going to take the guess the majority of you don't follow hundreds of young women.TEAGAN SIMPSON: But I do. When I go on Instagram, I'm overwhelmed by photos of girls my age, many of which are posed and perfected versions of my friends and mere acquaintances. What a teenage girl sees on Instagram is drastically different from what the average adult sees. And over time, scrolling through these photos can really take a toll on your self-esteem. With a quick Google search, we found numerous studies that link social media to increasing levels of anxiety, depression, loneliness and body image issues in young women. But could our friends really be feeling this way, too?K SIMPSON: No. No way. There's no way. Because when we go on Instagram, what we see are happy, beautiful and confident people. There's no way that these girls are going through the same thing that we are. Yet the more we researched and Googled, the more concern we felt.ZOMORODI: Elise, just listening to these young women is stressing me out because there are many worrying studies that link social media to depression, even suicidal thoughts, especially for teenage girls. But there might be some people who are thinking, well, then just don't go on social media. How would you explain it to people who maybe just don't understand what young women are dealing with these days?HU: Well, this visual culture doesn't just get propagated on Instagram or on TikTok or places where teenagers spend time, right? How we look and how we're supposed to look is communicated in so many different channels and across so many different ways that we receive images and are bombarded with images. So all of us are part of it universally because all of us are connected to the web, you know, in the developed world. And all of us are kind of being fed images constantly. So even if you think that you are not part of this sort of cycle of imagery and the norm-setting, you are.(SOUNDBITE OF MUSIC)ZOMORODI: OK. So another thing that Teagan and Keisha bring up is just how common it is today to edit and filter yourself - your photos - on social media.(SOUNDBITE OF TEDx TALK)K SIMPSON: The biggest surprise for Teagan and I was how many young women admitted to using Photoshop regularly. I could go on right now, and in a few moments, I could have a photo of myself with longer legs, a thinner waist. I could remove acne, remove a fat roll. Or I could even give myself that perfectly round butt that everyone is talking about.T SIMPSON: Now, these issues aren't new. We've been comparing ourselves to photoshopped images forever. I'm sure many of us have been in a grocery store where we opened up a magazine, scanning through pages of perfectly photoshopped, beautiful people. But what if you opened up these magazines and the photos were of your friends?ZOMORODI: Elise, from what I understand, one of the most popular photo editing apps, Facetune, reportedly had 20% more usage, as they say, at the start of the pandemic, and then - I'll make a little confession here that I was spending so much time on Zoom and was so tired during the pandemic that I did use the Zoom filter to make my skin look a little better.HU: And why not?ZOMORODI: Well, I don't know. It's not - you know, in the name of truth, like, where do we start to draw the line? What have you been hearing about this? Like, and to what extremes will people go to try to make what is fake - let's just call it that - a reality?HU: Yeah. So one of the questions that I'm asking is, A, where do we draw the line when it comes to self-improvement? That's a key question. But B, because the norms that we're seeing on Zoom or on Instagram or on TikTok are so enhanced, then what we start believing is normal becomes more and more narrow, right? Because everybody's skin is enhanced. You know, everybody's chin is a little bit thinner.And researchers say that there's kind of a global mean. There are four aspects of beauty that, irrespective of where you are in the world, people aspire to. And it's smoothness, firmness, thinness and youth. And the thinness can be relative to your population. So thin in Asia is thinner than, say, thin in Northern Europe. And what results is that all women, and increasingly numbers of men, need surgical and non-surgical technical fixes if we are to be perfect like those filters, right? Even just good enough is getting harder to achieve as these norms become more and more dominant because it makes it harder for us to resist.ZOMORODI: You know, it makes me think, like, as with many things with technology, at least here in the U.S., there is very little oversight. And I read with total fascination that Norway recently passed a law that says influencers and brands must identify photos on social media that have been retouched. And, you know, just to go back to Keisha and Teagan Simpson, they kind of had a similar idea. More of a grassroots way of going about it, but they challenged people to post untouched photos of themselves and to see what that feels like.(SOUNDBITE OF TEDx TALK)K SIMPSON: What if we could improve the Instagram experience? Could we balance the perfected photos with unfiltered ones? Last year, we ran a campaign to do just this. It was called the As She Is challenge, where young women are encouraged to post an unfiltered photo to our hashtag, #AsSheIs.T SIMPSON: This is a typical post from one participant's Instagram account. Clearly, she's beautiful. But on the day of the challenge, this is the photo she chose to post. Vulnerable and courageous, she talks about her facial acne and her use of filters to cover it up. This young woman's willingness to be unfiltered made a real impact on her followers, and admittedly, also herself. From our experience, when young women are willing to be vulnerable, they express a sense of relief, freedom from accepting and admitting that they have insecurities.(SOUNDBITE OF MUSIC)HU: I applaud these women, and I support that they are trying to keep the window of what's normal inclusive of how we really look. Because one of my concerns as somebody who's now researching beauty is that our appearance norms, especially because of filters, become so far removed from actually what we normally look like. And so I love that they are maintaining a space and, in fact, encouraging all of us to show up as we really are.(SOUNDBITE OF MUSIC)ZOMORODI: When we come back, more from Elise Hu on interrogating the beauty ideal. I'm Manoush Zomorodi, and you are listening to the TED Radio Hour from NPR.It's the TED Radio Hour. I'm Manoush Zomorodi, and I am so pleased to be spending the hour with longtime journalist Elise Hu. She is the host of TED Talks Daily, and she is working on a book about beauty norms, beauty standards and why we think someone is beautiful but not someone else and all the work we have to do to be, quote-unquote, \"beautiful,\" right, Elise?HU: That's right. You packed a lot into that, and thank you.ZOMORODI: OK. So the next TED Talk that you have brought us, it's a fascinating one. It is from a woman named Sasha Sarago. She is an Aboriginal writer and model in Australia, and she gave this talk in 2020. And so just let's get right into it. Sasha starts off telling a story from a few decades earlier when she was a preteen at a friend's birthday party, and a friend's sister asked her the question, so what's your background?(SOUNDBITE OF TED TALK)SASHA SARAGO: And, like any proud Aboriginal child would declare, I'm Aboriginal. Given the reaction of the room, being Aboriginal was clearly a dirty word. And at the tender age of 11, I was told by my best friend's adult sister that I was too pretty to be Aboriginal. By this time, my mouth is dry. My blood is boiling. And I'm trying so hard to fight back what feels like an ocean of tears. I calmly join my circle of friends and begin to (laughter) fake laugh at whatever is funny to mask my embarrassment as I clutch on to my newfound complex.And this is why we need to change our perceptions of beauty. And how we do this is by learning from Aboriginal women, their stories and perspectives, because right now pretty hurts. Pretty hurts because you're trying to erase my Aboriginality to applaud my proximity to whiteness. Pretty hurts because, aimed at an Aboriginal woman, it is a weapon loaded in racism, sexual exploitation and cultural genocide. You see; what this woman didn't realize when she declared that I was too pretty to be Aboriginal is that she took something precious from me - pride in my identity. You see; I belong to the oldest living culture in the world, but that day, that legacy, it was replaced with shame. And it's been this filthy stain I've been trying to get rid of for 20 years.(SOUNDBITE OF MUSIC)HU: That really resonates with me so much and is arguably responsible for why I still wrestle with these questions of beauty because when I was a teenager, I remember - I'm an Asian American and so not part of the dominant group, especially not in suburban Texas, where I grew up. And I remember when I was in 9th or 10th grade, a boy said to me, you're pretty hot for an Oriental. So that kind of just backhanded compliment-slash-out-grouping at the same time, you know, it does make you feel and internalize a sense of shame. And that's such a shame, right?ZOMORODI: Yeah. And, actually, Sasha goes right on to say that the way that Aboriginal women define beauty is completely different. She actually goes on to tell a traditional story about a fisherwoman named Barangaroo, a famously defiant female ancestor who lived in the 18th century.(SOUNDBITE OF TED TALK)SARAGO: Barangaroo, like the other Eora women, took pride in their status as being main food providers for their tribe. A skillful and patient fisherwoman, Barangaroo would access Sydney Harbor and its surrounding waters for its abundant food supply, only taking what was needed. So you can just imagine how furious Barangaroo was when she saw British colonists trawl 4,000 salmon off the north shore in just one day, then gifting some of this catch to her husband and some of the other men from her tribe. Barangaroo knew such a wasteful act would threaten the Eora women's cultural authority within the tribe, furthermore destroying their traditional way of life.So Barangaroo rejected British laws and customs, their food, drink and social etiquette, even when her husband decided to conform. When Barangaroo and her husband Bennelong was invited to dine with Governor Philip and the British party, Barangaroo stayed true to who she was. Instead of wearing colonial attire - a tight corset and a gown layered in silk - she came sporting her traditional wears - white ochre and a bone through her nose. What Barangaroo illustrated was Indigenous beauty is authentic.(SOUNDBITE OF MUSIC)ZOMORODI: What a beautiful story.HU: Yeah.ZOMORODI: And I love that it's passed on through the generations as something to sort of hold onto, that beautiful can be defined in different ways by different cultures. Do you know of any other cultures in which, I guess, very specific beauty ideals have held strong in the face of more - sort of the more homogenous, Eurocentric, Western look?HU: Yeah. And, just to be fair, we are seeing a more homogenous look, but it's not necessarily Eurocentric, right? There is a more homogeneous look that - in Asia, that is a competing standard against kind of a real Eurocentric look. So we should note that. But it is harder to find examples of regional or local norms that really hold strong because we are all so connected on this global internet. Local norms still do exist in pockets of the world. I just think what's considered sort of globally beautiful is now something that we see and is becoming more and more flattened.ZOMORODI: Yeah, because, as you say, we're all looking at the same web...HU: Exactly.ZOMORODI: ...Which, actually, I think, is one of the reasons why Sasha, by the way, started what she says is Australia's first Indigenous and ethnic women's lifestyle blog and magazine.HU: Cool.ZOMORODI: But she does say in her talk that it really took her a while to figure out how to appreciate her and her people's roots and their conception of beauty.(SOUNDBITE OF TED TALK)SARAGO: Over the years, my obsession for beauty, it's led me to this truth. You cannot appreciate beauty if you cannot recognize it in yourself. So how do we change our perceptions of beauty? We have to get real with ourselves and start by asking, who am I? Where do I come from? The world that I live in, how did it come to be? And, more importantly, where to from here? You may not like what you discover, but sit with it. Feel the discomfort. Colonization has stolen from us one of the greatest treasures we can obtain - each other.ZOMORODI: That is a big topic. There's lots to unpack here.HU: Yeah. I am actually deep in the research on how colonization really has affected beauty norms. Double eyelid surgery, for example, which is the most popular procedure in South Korea, was brought to South Korea and, arguably, invented by a plastic surgeon named David Millard, who was a U.S. Army physician...ZOMORODI: Oh, wow.HU: ...And plastic surgeon who was stationed on Yongsan, which is the U.S. military base in South Korea following the Korean War. And he originally did this surgery - this is to create a crease in your eyelid if you weren't born with one. And David Millard said it was so that his patients could look more white.ZOMORODI: I mean, that is deeply, deeply troubling in many ways. But what about people, Elise, who are saying, you know what - I'm done with this? Is there a backlash to all of this?HU: In South Korea, there's a movement called Escape the Corset, where women are collectively crushing their makeup compacts on Instagram and on TikTok and shaving their heads or cutting their hair really short. It is their form of resistance and since it has cost them. It's been so costly to try and keep up with appearance standards, not just financially but also emotionally, mentally, intellectually. But the beauty industry seems to be bouncing right back, and so it's really hard to see whether resistance is having an impact.ZOMORODI: You know, I think that's interesting because, in a way, it segues nicely to the next talk that you brought us...HU: Yeah.ZOMORODI: ...Which is about the opposite end of the spectrum.HU: Yes. So one community or a few communities that really celebrate sort of the traditional femme idea of beauty is the transgender community, as well as the drag community, where you can really sort of go after these adornments and wear these adornments and makeup and glitter and what's considered traditionally feminine displays. That's a really powerful way of either coming out or feeling like you can wear on the outside what you feel on the inside.(SOUNDBITE OF MUSIC)ZOMORODI: So the next talk is by the model Hari Nef, and she gave a talk in 2016 called \"The Aesthetics Of Survival.\"(SOUNDBITE OF TEDx TALK)HARI NEF: Remember when Caitlyn Jenner revealed herself on the cover of Vanity Fair?ZOMORODI: She starts her talk by projecting a picture of Caitlyn Jenner on the cover of Vanity Fair. And I don't know if you remember, Elise, but Caitlyn Jenner is looking extremely glamorous - lots of makeup, big hair...HU: Oh, the corset.ZOMORODI: The corset, exactly.(SOUNDBITE OF TEDx TALK)NEF: I've got a lot to say about her conservative politics and her bumpy advocacy, but this was cool.ZOMORODI: But it also started a conversation and a lot of pushback because there were some people who felt that this was the ultimate anti-feminist thing to do, to pose like that, because by posing like that, Caitlyn Jenner was just fulfilling stereotypical male fantasies. But Hari disagrees.(SOUNDBITE OF TEDx TALK)NEF: If you ask me, hair, makeup and nails don't make trans women like me - or any woman, for that matter - bad feminists. And, sure, what if Caitlyn had appeared on the cover of Vanity Fair in a pantsuit with no makeup, her hair pulled back, arms crossed? Yes, I think she would have looked really cool. But would we all have accepted her so readily as a woman? Would she have appeared on the cover of Vanity Fair to begin with? It's time for the aesthetics of upwardly mobile feminist respectability to make room for the aesthetics of survival, particularly trans survival. It's time to revise what a feminist looks like, especially if hair, makeup and nails allow her to get jobs, make friends or ride the subway home safely at night. It's time to free the femme because some of us need it or just like it, and that's OK.(SOUNDBITE OF MUSIC)ZOMORODI: OK. So I think it's important that we bring up here why there was such a backlash. And it's - really comes down to the reaction from some second-wave feminists saying, you know, that women don't have to be super glam. They don't have to be super feminine, that this was, you know, taking us backwards by having Caitlyn Jenner look like that.HU: Yeah, so during the sort of consciousness-raising era of the '70s when second-wave feminism was in vogue, the idea was that to look very feminine was also to adhere to traditional gender roles of having to be at home and not having as many paths to economic independence. But yeah, we talk so much - we have had so much of this conversation dominated by sort of critiquing narrow beauty standards. And this is another way to critique narrow beauty standards from Hari here. It's to say that beauty standards should not just be a rejection of what's traditionally femme, but should also include an acceptance of femme if that's what it takes for survival.(SOUNDBITE OF TEDx TALK)NEF: Under patriarchy, money and country inscribe themselves on women's bodies. We look in the mirror, and we ask ourselves, huh, do I look like a rich woman today? We look in the mirror and say, huh, do I look like an American woman today? We look in the mirror and say, huh, do I look like a beautiful woman today? And if I don't look rich, beautiful and American, am I still a woman?Here's a picture of me before I started transitioning - or I had started transitioning, but I hadn't started medical transition yet. At this point in my life, I wore a full face of makeup every day. I shaved my whole body every week, which covered me in these angry red spots. I stopped cutting my hair. I wore dresses to morning classes. I started hormones - pills twice a day and a needle in my leg every week. I started going in for monthly laser hair removal appointments - procedures that were so painful that I had to chug a flask of vodka before every session just so I'd feel it less. I starved myself and abused laxatives so I could fit the clothes I wanted to wear.I did all this 'cause I wanted a body that allowed me to do the things I wanted to do in the way I wanted to do them, things men in this country aren't really allowed to do. I tried to do them in the body I was born with, but people told me, no, you can't. You got to soften up your face, get rid of all your body hair, get breasts, shrink your waist, get a vagina. Of course, I looked them right in the eye, said [expletive] you, turned around and did pretty much all of what they told me to do.(LAUGHTER)NEF: It hurt, and it worked. And if my story or journey sounds difficult or tough, I can guarantee you it's even more difficult and more tough for the vast majority of trans women.ZOMORODI: Oh, that is so hard to hear, especially the part when Hari admits she feels that she needed to suffer all that pain to achieve what she wanted. And then, she alludes to the violence that many trans women also suffer.HU: Yes, yes. According to one study, trans people are four times as likely to have violent crimes perpetrated against them compared to cisgendered people. One in two transgender individuals are sexually abused or assaulted at some point in their lives. Some reports even estimate that transgender survivors may experience rates of sexual assault up to 66%, and that's often coupled with physical assaults or abuse.ZOMORODI: So upsetting. And Hari points out that this idealized version of femininity is essentially meeting a patriarchal standard, standards set by men. But she also says that while meeting those standards, well, that can mean survival for some trans women. For others, it is a goal in and of itself. But the process, whoa - it can be long and extremely tough.(SOUNDBITE OF TEDx TALK)NEF: It is so hard to gain access to hormones, to jump through all the medical hoops. It is so expensive to buy cosmetics, new clothes, healthy food, any number of means towards body feminization. And yeah, even if a trans woman does manage to look or seem femme, her race, her class or her citizenship can place further targets on her back. So when it comes to trans women with limited resources, their femme can be the difference between life and death.So I got to ask, why are we being shamed for our femme? Let femmes be femmes if they want to be femme because some of us need it or just want it, and that's OK. When the aesthetics of feminist respectability exclude and erase the women who need - not just want, need - to give them up, then the aesthetics of feminist respectability need to change. Femme aesthetics aren't bad or good. They just work. They just are. They work for some of us. So chill out.(LAUGHTER)NEF: Let us live. Free the femme. Thank you.(APPLAUSE)ZOMORODI: That was model Hari Nef. You can see her full talk at ted.com. In just a minute, we'll continue our conversation with Elise Hu. On the show today, reflecting on and challenging our beauty norms. I'm Manoush Zomorodi, and you're listening to the TED Radio Hour from NPR.(SOUNDBITE OF MUSIC)ZOMORODI: It's the TED Radio Hour from NPR. I'm a Manoush Zomorodi. And on today's show, the beauty ideal - the beauty ideal. So far, we've heard a TED Talk about Instagram.(SOUNDBITE OF TEDx TALK)K SIMPSON: There's new apps that allow us to digitally alter the way we look.ZOMORODI: How teens feel tremendous pressure to Photoshop themselves to look flawless.(SOUNDBITE OF TEDx TALK)K SIMPSON: And in a few moments, I could have a photo of myself with longer legs, a thinner waist. I could remove acne, remove a fat roll.(SOUNDBITE OF TED TALK)SARAGO: You see, I belong to the oldest living culture in the world.ZOMORODI: We heard from a woman finding strength through her Aboriginal beauty culture.(SOUNDBITE OF TED TALK)SARAGO: When we decolonize beauty, we are reintroduced to our authentic selves.(SOUNDBITE OF TEDx TALK)NEF: It's time to revise what a feminist looks like.ZOMORODI: And we learned that traditional femme standards criticized by some can be a real lifesaver for some trans women.(SOUNDBITE OF TEDx TALK)NEF: Especially if hair, makeup and nails allow her to get jobs, make friends or ride the subway home safely at night.ZOMORODI: Riding shotgun with me is Elise Hu, host of the \"TED Talks Daily\" podcast. She is also writing a book about this subject. Hello, Elise.HU: Hello, Manoush.ZOMORODI: And Elise, a constant theme running throughout our episode so far has been body modification - right? - the good and the bad.HU: One of the biggest questions that I wrestle with as I research and write this book is how do we square the beauty ideal in a virtual world and a real world when the lines between the worlds are getting so blurred? And there's not only the technology of sort of self-surveillance, the idea of sort of cameras in our pockets and us being able to see one another all the time and then surveilling ourselves because we're aware that we're seen all the time. So that's one kind of technology.The other is the technology of self-improvement because there are so many beauty filters that normalize or teach us the ideals. Then, we sort of fall into that, and we start to chase that in a way that appears not only in our images but maybe on the living canvas, maybe on our actual bodies because that's becoming more and more accessible in lots of places in the developed world.ZOMORODI: And I think that also brings us to our final talk...HU: Yeah.ZOMORODI: ...About potentially the future of beauty. And that's gene editing, right? The last Talk that you've brought us from biologist Paul Knoepfler - his talk is called \"The Ethical Dilemma Of Designer Babies.\" And he starts by taking us to the not-so-distant future.(SOUNDBITE OF TEDx TALK)PAUL KNOEPFLER: Let's pretend it's the year 2030, and you're a parent. You have your daughter, Marianne (ph), next to you. And in 2030, she is what we call a natural because she has no genetic modifications. And because you and your partner consciously made that decision, many in your social circle - they kind of look down on you. They think you're, like, a Luddite or a technophobe.Marianne's best friend Jenna (ph), who lives right next door, is a very different story. She was born a genetically modified designer baby with numerous upgrades. And it's become very clear to you that Jenna is extraordinary. She's incredibly intelligent. If you're honest with yourself, she's smarter than you, and she's 5 years old. She's beautiful, tall, athletic, and the list goes on and on.And in fact, there's a whole new generation of these GM kids like Jenna. And so far, it looks like they're healthier than their parents' generation, than your generation. And they have lower health care costs. They're immune to a host of health conditions, including HIV/AIDS and genetic diseases. It all sounds so great.ZOMORODI: It does all sound so great. On the one hand, I'm like, awesome, a healthy child who doesn't have to deal with disastrous illnesses in their lifetime ever. But on the other hand, this idea of, like, an upgraded kid - it is creepy. Elise, like, how far-fetched is this scenario?HU: Yeah, scientists range in their opinions on how far-fetched this is. But Paul is a stem cell researcher, and he spends a lot of time thinking about how we can use gene therapy in a helpful way - right? - gene engineering to really be therapeutic. But he's also worried that this technology, like CRISPR, could be used by families of rich people with deep pockets to alter their future children and give them this advantage that would really create an unfair playing field. This is one of the big ethical questions that comes up when we talk about CRISPR. And we've seen how it could play out in books and movies...ZOMORODI: Yes.HU: ...About the future.(SOUNDBITE OF FILM, \"GATTACA\")UNIDENTIFIED NARRATOR: In the not-too-distant future...ZOMORODI: \"Gattaca,\" I'm thinking of.(SOUNDBITE OF FILM, \"GATTACA\")UNIDENTIFIED NARRATOR: ...Our DNA will determine everything about us.HU: Such a great film. But what I thought was really powerful about it, for those of y'all who haven't seen it, is that we engineer that which we find perfect or ideal at a given time. And when we look back on that film, we have the opportunity to really rethink what they thought was perfect at that time, right? And that ideal is fluid, and it's expansive. So it's worrying to lock ourselves into one ideal of perfection when you have the power to genetically modify babies.ZOMORODI: Yeah. When he was like, she's perfect, she's tall, I was like, hang on a minute. As a short person, who do you get to - I don't - I wouldn't want to have, like, weird extremely tall children. Then they...(LAUGHTER)ZOMORODI: ...As a short person. But OK, so where does the law stand on this? If someone wanted to have a designer baby - I mean, you can certainly pick the sex of your child, and you can screen for certain illnesses. But can you make them tall or beautiful or have a higher IQ?HU: Not right now. Not right now. The U.S. and dozens of other countries around the world have specifically made the implantation of genetically modified human embryos illegal.ZOMORODI: OK.HU: Now, that's different than what's called preimplantation genetic diagnosis. So in the U.S., couples using in vitro fertilization can utilize tests to find out the sex of their fertilized embryos. And you can test for Down syndrome or dwarfism, for example. I should say, though, that Paul and many other researchers are super excited for the use of CRISPR to heal people from debilitating disorders and to really help people - to help make people healthier. This work to splice genes is really amazing and amazingly inexpensive.But as I learned when I covered the future beat for NPR after I got back from Korea, what happens is, there is kind of an arc to these human enhancement technologies or biotech. They go from assistive and therapeutic or medical, as CRISPR is now. But then they move into augmentive (ph) - right? - to bettering ourselves, making us faster, stronger, smarter, and then could reach a place of adaptive, which is actually changing our very selves. And those in that sort of realm we don't consider enough or we don't consider deeply as a population, I think.ZOMORODI: Yeah. I always think, you know, vanity can also (laughter) be a very slippery slope. Because you think, well...HU: (Laughter).ZOMORODI: ...I'll just tweak that one thing, or I'll just...HU: Good point. Good point.ZOMORODI: ...Dye my hair the one time. And then you're dying it for the rest of your life.HU: Back to the question.ZOMORODI: Exactly.HU: Yeah.ZOMORODI: The maintenance thing.HU: Back to the question; where do we draw the line?(SOUNDBITE OF TED TALK)KNOEPFLER: Maybe even if we just look in the mirror, there might be ways we think, you know, we could be better. You know, I might wish honestly that I had more hair here, you know, instead of baldness. Some people might wish they were taller, have a different weight, you know, a different face. If we could do those things, we could make those things happen or we could make them happen in our children, it would be very seductive. And yet, coming with it would be these risks. This technology is so new and so powerful that by accident, we could make them sicker. You know, that easily could happen.And there's another risk. And that is that all of the legitimate, important genetic modification research going on just in the lab - again, no interest in designer babies - a few people going the designer baby route. Things go badly. That entire field could be damaged.HU: Yeah. So Manoush, you know, you're a longtime tech reporter.ZOMORODI: Yes.HU: I'm sure you remember that in 2019 there was that Chinese scientist who announced he created the first genetically modified baby.ZOMORODI: Oh, yes. Yes.HU: This was big news. I got a bunch of news alerts about it. And his work was really widely panned. Most of his fellow researchers were appalled about this. They said this kind of experimentation was totally unethical and far too irresponsible.ZOMORODI: You know, as is often the case with technology, it's really hard to do studies because it's - you know, it's unethical to...HU: Right.ZOMORODI: ...Test things out on humans.HU: Do it on people.ZOMORODI: You can't have the control group and all of those things. But I can see also, you know, for geneticists and other scientists, you know, you want to be the first. You want to be the one who cracks the code. And then, you know, think of how fearful we were when IVF became a thing, the first IVF baby when I was a kid. And at first, that really freaked people out. And now, millions of babies are born via IVF, and nobody really thinks it's that big a deal.(SOUNDBITE OF TED TALK)KNOEPFLER: Five million IVF babies have been born, bringing immeasurable happiness. A lot of parents now can love those kids. But if you think about it, in four decades, 5 million babies being born from a new technology is pretty remarkable. And the same kind of thing could happen with human genetic modification and designer babies. So depending on the decisions we make in the next few months, the next year or so, if Designer Baby No. 1 is born, within a few decades, there could well be millions of genetically modified humans. And there's a difference there, too. Because if we - you know, you in the audience or I, if we decide to have a designer baby, then their children will also be genetically modified and so on. Because it's heritable. So that's a big difference.ZOMORODI: There's one last thing that Paul says, which I think - as both of us have covered technology, there is that - it brings you back to - the question is, what really makes a human a human? Like, we have to consider that before we start optimizing people to any extent, really.(SOUNDBITE OF TED TALK)KNOEPFLER: Let's pretend we're back in that reality. We're at a park, and our kid is swinging on the swing. Is that kid a regular old kid? Or did we decide to have a designer baby? And let's say we went the sort of traditional route. And there's our kids swinging on the swing. And frankly, you know, they're kind of a mess. You know, their hair's all over the place, like mine. They have a stuffy nose. They're not the best student in the world. They're adorable. You love them.But there on the swing next to them, their best friend is a GM kid. And the two of them are kind of swinging like this, and you can't help but compare them, right? And the GM kid is swinging higher. They look better. They're a better student. They don't have that stuffy nose you need to wipe. You know, how is that going to make you feel? And what decision might you make next time?ZOMORODI: I have to admit, no boogers is pretty appealing. But it...(LAUGHTER)ZOMORODI: It does seem like in all the conversations we've had and in all the talks that we've heard, it comes down to people constantly comparing themselves to other people. It's just - I mean, it's exhausting.HU: Absolutely. And it certainly comes into play when it comes to our looks, for sure. But this reminds me - this part of his talk really reminds me of one of the lessons of \"Gattaca,\" the science fiction film that portrays this very idea, which is, you know, that there was - there were two brothers, right? And one was the genetically engineered one and the other one was not. He was the normal human and considered really low-class because he wasn't engineered, but then was able to - I don't know if you remember this, but the big line from \"Gattaca\" was, like, that the brother who wasn't able to swim back from the ocean - he didn't save enough for the swim back. And it was the brother who wasn't engineered who had a humanity about him, who had that sort of fire in his belly that you could not engineer for. And so there is something really valuable about that which makes us deeply human.And there are qualities, no matter what specs that we have on the outside or specs that we think are in vogue in the moment, like height, for example - maybe that's not advantageous. Maybe that's not necessarily optimizing. We don't know really because there is kind of magic to ourselves that's irrespective of how we look or how we perform in various fields.ZOMORODI: Well, you're making me feel better about what I say to my daughter, which is that perfection is so incredibly dull and uninteresting, and it's the weirdness and the flaws and the imperfections that make people strange and interesting and worth getting to know. And so far, she seems to be buying it, Elise (laughter). lease and we're to be fair and I love that.HU: Yeah, and we're - to be fair - and I love that. I think that's beautiful. But to be fair, we are not going to give up the quest for self-improvement. There is something that's deeply human about that...ZOMORODI: Sure, yeah.HU: ...Right? - of potential and wanting to be better. And if how we look is so much a part of our identities and ourselves, then of course we're going to want how we look to appear better. And so what I'm circling around as an argument in my book is that we can strive for something that is more deserving of the men and women who do turn to beauty rituals, whether they're trans or cis, and that we can connect to our identities in these sort of self-care or beauty practices without being, like, too baked into one particular ideal - right? - and without spending that much money.What I want to see is a consumer beauty culture that says that you can look like this or this or this or this or that, right? A wider spectrum can really widen our gaze and our sense of normalcy. And it's going to take, you know, changing the people in charge of these companies. It's going to take really changing the way that we are represented in advertisements and in film and in television and in commercials, right? It's going to take norm-setting of that which is more acceptable and widening our lens in the way that we talked about earlier in the show. So I think it's possible. It's just, we're not quite there yet.(SOUNDBITE OF MUSIC)ZOMORODI: I mean, how much does it come down to, as long as all those different ways of being \"beautiful\" - quote, unquote, \"beautiful\" - are accepted, that it's possible as long as the companies showing the pictures and making the products can continue to make money? Because what we're talking about is also a consumer habit, right?HU: Right. Right. So South Korea for a long time did not offer foundation or any sort of cover up that was dark, right? So I couldn't even get the makeup compact that I liked under a certain brand because I was too tan for it. My skin was too dark for it. And now they are really expanding that because of consumer demand. So we can insist - right? - on some reform. We can insist on more diversity, more variety, more color - more literal color - and more acceptable norms. It's going to take pushing for it and more of the people who are bucking trends, like the Escape the Corset movement. And it's going to take more conversation like the ones we're having.(SOUNDBITE OF MUSIC)ZOMORODI: Elise Hu is host of the \"TED Talks Daily\" podcast. She makes all kinds of cool stuff for NPR. You can see all the talks that we discussed on this episode at ted.com. Elise, thank you so much again.HU: Thank you for having me. You know I love talking to you, so this was fantastic.ZOMORODI: This episode was produced by Sylvie Douglis, James Delahoussaye and Rachel Faulkner. It was also edited by Rachel Faulkner. Our Ted Radio production staff also includes Jeff Rogers, Sanaz Meshkinpour, Diba Mohtasham, Katie Monteleone and Matthew Cloutier. Our audio engineer is Daniel Shukin. Our intern is Harrison Vijay Tsui. Our theme music was written by Ramtin Arablouei. Our partners at TED are Chris Anderson, Colin Helms, Anna Phelan, Michelle Quint and Micah Eames. I'm Manoush Zomorodi, and you've been listening to the TED Radio Hour from NPR.(SOUNDBITE OF MUSIC) MANOUSH ZOMORODI, HOST: It's the TED Radio Hour from NPR. I'm Manoush Zomorodi. And on the show today, ideas about beauty. ELISE HU, BYLINE: I have been thinking about beauty culture and appearance standards a lot these days - how much beauty means to us, not just as women or men, but as society. ZOMORODI: If this voice sounds familiar, it's because you've heard her all over NPR. It's our very own Elise Hu. And in 2015, Elise moved to Korea to open up NPR's bureau in Seoul, a city which, in the past few years, has emerged as a cosmetics and skin care superpower. HU: When I first got to Seoul, the sort of pervasiveness and dominance of a really specific beauty standard and beauty norms was everywhere. The night I got to Seoul, I was staying in Myeong-dong, which happens to be the makeup district, where every store is lit up, up and down the street, by images of skin care products and women with these sort of alabaster skin faces. And every single store is the name of some sort of makeup brand. And so you can have kind of the face shop across from another face shop across from another face shop. And so it's like trick-or-treat, but for skin care products. So it was made very obvious to me as soon as I landed in Korea, the dominance of the skin care industry, but also appearance standards and the importance of looking a certain way. ZOMORODI: Elise wanted to see what it was like to follow all these Korean beauty trends. And so she did in a series called \"Elise Tries.\" (SOUNDBITE OF ARCHIVED RECORDING) HU: Skin care in South Korea is serious business, with South Korean women spending twice as much of their income on beauty products as American women. Really go in for the excavation. Oh, yeah. I think she's getting my nose pores. Mmm hmm. Oh, geez, you can hear it. Oh, dear. Oh, geez. I can actually feel stuff being sucked up. I want this off my face so bad because I feel like I'm, like - I'm feeling a little claustrophobic. Oh, my gosh. ZOMORODI: Today, Elise is writing a book about beauty - particularly K-beauty, as it's called. HU: I'm really fascinated by it. And I'm fascinated by the power of beauty ideals, politically, economically, but most important, culturally. ZOMORODI: Which is why we've invited her to be our guide on this episode. Because not only is she on NPR and researching this topic, Elise also hosts the \"TED Talks Daily\" podcast. So she watches a lot of TED talks. Elise, you are going to take us through a selection of TED talks about beauty norms or questioning the beauty ideal, not just in Korea, but all over the world. And there are so many layers to this topic, right? HU: Yes. Yes. So I went to Korea. I learned all of this stuff. But I didn't want to simply eviscerate Korean beauty because I take the industry and its growth and the influence of beauty really seriously. And I think that the pursuit of beauty is kind of a tentpole of the modern female experience, right? And my hope is just to kind of really take it seriously and make room in our conversations and in our minds for thinking through it and how the so-called beauty industrial complex plays a role in our experiences and our identities, right? We see so many digital images all the time flashing before us. And that kind of helps solidify norms of how we should appear in our sort of consciousness, right? And what I really wanted to dig into is the work that it takes to appear, quote, unquote, \"beautiful.\" It requires a lot of maintenance. It requires a lot of work. And it requires a lot of spending money on products or makeup or procedures. And that's just to kind of keep up with the Joneses - right? - of appearance standards. Because if you don't sort of meet those aesthetic norms, that'll cost you. (SOUNDBITE OF MUSIC) ZOMORODI: So we want to kick off our conversation with a talk about the influence that social media has had on how people think of beauty and also the sort of mental health for mostly young women. So the first talk is by two twins who live in Canada - Teagan and Keisha Simpson. They gave a talk in 2019 called \"Can Our Body Image Handle Social Media?\" (SOUNDBITE OF TEDx TALK) KEISHA SIMPSON: Different ages use and interact with Instagram differently. For example, if we were all to pull out our phones right now, what you would see on your account would be very different from what I would see because it all depends on who you follow. I'm going to take the guess the majority of you don't follow hundreds of young women. TEAGAN SIMPSON: But I do. When I go on Instagram, I'm overwhelmed by photos of girls my age, many of which are posed and perfected versions of my friends and mere acquaintances. What a teenage girl sees on Instagram is drastically different from what the average adult sees. And over time, scrolling through these photos can really take a toll on your self-esteem. With a quick Google search, we found numerous studies that link social media to increasing levels of anxiety, depression, loneliness and body image issues in young women. But could our friends really be feeling this way, too? K SIMPSON: No. No way. There's no way. Because when we go on Instagram, what we see are happy, beautiful and confident people. There's no way that these girls are going through the same thing that we are. Yet the more we researched and Googled, the more concern we felt. ZOMORODI: Elise, just listening to these young women is stressing me out because there are many worrying studies that link social media to depression, even suicidal thoughts, especially for teenage girls. But there might be some people who are thinking, well, then just don't go on social media. How would you explain it to people who maybe just don't understand what young women are dealing with these days? HU: Well, this visual culture doesn't just get propagated on Instagram or on TikTok or places where teenagers spend time, right? How we look and how we're supposed to look is communicated in so many different channels and across so many different ways that we receive images and are bombarded with images. So all of us are part of it universally because all of us are connected to the web, you know, in the developed world. And all of us are kind of being fed images constantly. So even if you think that you are not part of this sort of cycle of imagery and the norm-setting, you are. (SOUNDBITE OF MUSIC) ZOMORODI: OK. So another thing that Teagan and Keisha bring up is just how common it is today to edit and filter yourself - your photos - on social media. (SOUNDBITE OF TEDx TALK) K SIMPSON: The biggest surprise for Teagan and I was how many young women admitted to using Photoshop regularly. I could go on right now, and in a few moments, I could have a photo of myself with longer legs, a thinner waist. I could remove acne, remove a fat roll. Or I could even give myself that perfectly round butt that everyone is talking about. T SIMPSON: Now, these issues aren't new. We've been comparing ourselves to photoshopped images forever. I'm sure many of us have been in a grocery store where we opened up a magazine, scanning through pages of perfectly photoshopped, beautiful people. But what if you opened up these magazines and the photos were of your friends? ZOMORODI: Elise, from what I understand, one of the most popular photo editing apps, Facetune, reportedly had 20% more usage, as they say, at the start of the pandemic, and then - I'll make a little confession here that I was spending so much time on Zoom and was so tired during the pandemic that I did use the Zoom filter to make my skin look a little better. HU: And why not? ZOMORODI: Well, I don't know. It's not - you know, in the name of truth, like, where do we start to draw the line? What have you been hearing about this? Like, and to what extremes will people go to try to make what is fake - let's just call it that - a reality? HU: Yeah. So one of the questions that I'm asking is, A, where do we draw the line when it comes to self-improvement? That's a key question. But B, because the norms that we're seeing on Zoom or on Instagram or on TikTok are so enhanced, then what we start believing is normal becomes more and more narrow, right? Because everybody's skin is enhanced. You know, everybody's chin is a little bit thinner. And researchers say that there's kind of a global mean. There are four aspects of beauty that, irrespective of where you are in the world, people aspire to. And it's smoothness, firmness, thinness and youth. And the thinness can be relative to your population. So thin in Asia is thinner than, say, thin in Northern Europe. And what results is that all women, and increasingly numbers of men, need surgical and non-surgical technical fixes if we are to be perfect like those filters, right? Even just good enough is getting harder to achieve as these norms become more and more dominant because it makes it harder for us to resist. ZOMORODI: You know, it makes me think, like, as with many things with technology, at least here in the U.S., there is very little oversight. And I read with total fascination that Norway recently passed a law that says influencers and brands must identify photos on social media that have been retouched. And, you know, just to go back to Keisha and Teagan Simpson, they kind of had a similar idea. More of a grassroots way of going about it, but they challenged people to post untouched photos of themselves and to see what that feels like. (SOUNDBITE OF TEDx TALK) K SIMPSON: What if we could improve the Instagram experience? Could we balance the perfected photos with unfiltered ones? Last year, we ran a campaign to do just this. It was called the As She Is challenge, where young women are encouraged to post an unfiltered photo to our hashtag, #AsSheIs. T SIMPSON: This is a typical post from one participant's Instagram account. Clearly, she's beautiful. But on the day of the challenge, this is the photo she chose to post. Vulnerable and courageous, she talks about her facial acne and her use of filters to cover it up. This young woman's willingness to be unfiltered made a real impact on her followers, and admittedly, also herself. From our experience, when young women are willing to be vulnerable, they express a sense of relief, freedom from accepting and admitting that they have insecurities. (SOUNDBITE OF MUSIC) HU: I applaud these women, and I support that they are trying to keep the window of what's normal inclusive of how we really look. Because one of my concerns as somebody who's now researching beauty is that our appearance norms, especially because of filters, become so far removed from actually what we normally look like. And so I love that they are maintaining a space and, in fact, encouraging all of us to show up as we really are. (SOUNDBITE OF MUSIC) ZOMORODI: When we come back, more from Elise Hu on interrogating the beauty ideal. I'm Manoush Zomorodi, and you are listening to the TED Radio Hour from NPR. It's the TED Radio Hour. I'm Manoush Zomorodi, and I am so pleased to be spending the hour with longtime journalist Elise Hu. She is the host of TED Talks Daily, and she is working on a book about beauty norms, beauty standards and why we think someone is beautiful but not someone else and all the work we have to do to be, quote-unquote, \"beautiful,\" right, Elise? HU: That's right. You packed a lot into that, and thank you. ZOMORODI: OK. So the next TED Talk that you have brought us, it's a fascinating one. It is from a woman named Sasha Sarago. She is an Aboriginal writer and model in Australia, and she gave this talk in 2020. And so just let's get right into it. Sasha starts off telling a story from a few decades earlier when she was a preteen at a friend's birthday party, and a friend's sister asked her the question, so what's your background? (SOUNDBITE OF TED TALK) SASHA SARAGO: And, like any proud Aboriginal child would declare, I'm Aboriginal. Given the reaction of the room, being Aboriginal was clearly a dirty word. And at the tender age of 11, I was told by my best friend's adult sister that I was too pretty to be Aboriginal. By this time, my mouth is dry. My blood is boiling. And I'm trying so hard to fight back what feels like an ocean of tears. I calmly join my circle of friends and begin to (laughter) fake laugh at whatever is funny to mask my embarrassment as I clutch on to my newfound complex. And this is why we need to change our perceptions of beauty. And how we do this is by learning from Aboriginal women, their stories and perspectives, because right now pretty hurts. Pretty hurts because you're trying to erase my Aboriginality to applaud my proximity to whiteness. Pretty hurts because, aimed at an Aboriginal woman, it is a weapon loaded in racism, sexual exploitation and cultural genocide. You see; what this woman didn't realize when she declared that I was too pretty to be Aboriginal is that she took something precious from me - pride in my identity. You see; I belong to the oldest living culture in the world, but that day, that legacy, it was replaced with shame. And it's been this filthy stain I've been trying to get rid of for 20 years. (SOUNDBITE OF MUSIC) HU: That really resonates with me so much and is arguably responsible for why I still wrestle with these questions of beauty because when I was a teenager, I remember - I'm an Asian American and so not part of the dominant group, especially not in suburban Texas, where I grew up. And I remember when I was in 9th or 10th grade, a boy said to me, you're pretty hot for an Oriental. So that kind of just backhanded compliment-slash-out-grouping at the same time, you know, it does make you feel and internalize a sense of shame. And that's such a shame, right? ZOMORODI: Yeah. And, actually, Sasha goes right on to say that the way that Aboriginal women define beauty is completely different. She actually goes on to tell a traditional story about a fisherwoman named Barangaroo, a famously defiant female ancestor who lived in the 18th century. (SOUNDBITE OF TED TALK) SARAGO: Barangaroo, like the other Eora women, took pride in their status as being main food providers for their tribe. A skillful and patient fisherwoman, Barangaroo would access Sydney Harbor and its surrounding waters for its abundant food supply, only taking what was needed. So you can just imagine how furious Barangaroo was when she saw British colonists trawl 4,000 salmon off the north shore in just one day, then gifting some of this catch to her husband and some of the other men from her tribe. Barangaroo knew such a wasteful act would threaten the Eora women's cultural authority within the tribe, furthermore destroying their traditional way of life. So Barangaroo rejected British laws and customs, their food, drink and social etiquette, even when her husband decided to conform. When Barangaroo and her husband Bennelong was invited to dine with Governor Philip and the British party, Barangaroo stayed true to who she was. Instead of wearing colonial attire - a tight corset and a gown layered in silk - she came sporting her traditional wears - white ochre and a bone through her nose. What Barangaroo illustrated was Indigenous beauty is authentic. (SOUNDBITE OF MUSIC) ZOMORODI: What a beautiful story. HU: Yeah. ZOMORODI: And I love that it's passed on through the generations as something to sort of hold onto, that beautiful can be defined in different ways by different cultures. Do you know of any other cultures in which, I guess, very specific beauty ideals have held strong in the face of more - sort of the more homogenous, Eurocentric, Western look? HU: Yeah. And, just to be fair, we are seeing a more homogenous look, but it's not necessarily Eurocentric, right? There is a more homogeneous look that - in Asia, that is a competing standard against kind of a real Eurocentric look. So we should note that. But it is harder to find examples of regional or local norms that really hold strong because we are all so connected on this global internet. Local norms still do exist in pockets of the world. I just think what's considered sort of globally beautiful is now something that we see and is becoming more and more flattened. ZOMORODI: Yeah, because, as you say, we're all looking at the same web... HU: Exactly. ZOMORODI: ...Which, actually, I think, is one of the reasons why Sasha, by the way, started what she says is Australia's first Indigenous and ethnic women's lifestyle blog and magazine. HU: Cool. ZOMORODI: But she does say in her talk that it really took her a while to figure out how to appreciate her and her people's roots and their conception of beauty. (SOUNDBITE OF TED TALK) SARAGO: Over the years, my obsession for beauty, it's led me to this truth. You cannot appreciate beauty if you cannot recognize it in yourself. So how do we change our perceptions of beauty? We have to get real with ourselves and start by asking, who am I? Where do I come from? The world that I live in, how did it come to be? And, more importantly, where to from here? You may not like what you discover, but sit with it. Feel the discomfort. Colonization has stolen from us one of the greatest treasures we can obtain - each other. ZOMORODI: That is a big topic. There's lots to unpack here. HU: Yeah. I am actually deep in the research on how colonization really has affected beauty norms. Double eyelid surgery, for example, which is the most popular procedure in South Korea, was brought to South Korea and, arguably, invented by a plastic surgeon named David Millard, who was a U.S. Army physician... ZOMORODI: Oh, wow. HU: ...And plastic surgeon who was stationed on Yongsan, which is the U.S. military base in South Korea following the Korean War. And he originally did this surgery - this is to create a crease in your eyelid if you weren't born with one. And David Millard said it was so that his patients could look more white. ZOMORODI: I mean, that is deeply, deeply troubling in many ways. But what about people, Elise, who are saying, you know what - I'm done with this? Is there a backlash to all of this? HU: In South Korea, there's a movement called Escape the Corset, where women are collectively crushing their makeup compacts on Instagram and on TikTok and shaving their heads or cutting their hair really short. It is their form of resistance and since it has cost them. It's been so costly to try and keep up with appearance standards, not just financially but also emotionally, mentally, intellectually. But the beauty industry seems to be bouncing right back, and so it's really hard to see whether resistance is having an impact. ZOMORODI: You know, I think that's interesting because, in a way, it segues nicely to the next talk that you brought us... HU: Yeah. ZOMORODI: ...Which is about the opposite end of the spectrum. HU: Yes. So one community or a few communities that really celebrate sort of the traditional femme idea of beauty is the transgender community, as well as the drag community, where you can really sort of go after these adornments and wear these adornments and makeup and glitter and what's considered traditionally feminine displays. That's a really powerful way of either coming out or feeling like you can wear on the outside what you feel on the inside. (SOUNDBITE OF MUSIC) ZOMORODI: So the next talk is by the model Hari Nef, and she gave a talk in 2016 called \"The Aesthetics Of Survival.\" (SOUNDBITE OF TEDx TALK) HARI NEF: Remember when Caitlyn Jenner revealed herself on the cover of Vanity Fair? ZOMORODI: She starts her talk by projecting a picture of Caitlyn Jenner on the cover of Vanity Fair. And I don't know if you remember, Elise, but Caitlyn Jenner is looking extremely glamorous - lots of makeup, big hair... HU: Oh, the corset. ZOMORODI: The corset, exactly. (SOUNDBITE OF TEDx TALK) NEF: I've got a lot to say about her conservative politics and her bumpy advocacy, but this was cool. ZOMORODI: But it also started a conversation and a lot of pushback because there were some people who felt that this was the ultimate anti-feminist thing to do, to pose like that, because by posing like that, Caitlyn Jenner was just fulfilling stereotypical male fantasies. But Hari disagrees. (SOUNDBITE OF TEDx TALK) NEF: If you ask me, hair, makeup and nails don't make trans women like me - or any woman, for that matter - bad feminists. And, sure, what if Caitlyn had appeared on the cover of Vanity Fair in a pantsuit with no makeup, her hair pulled back, arms crossed? Yes, I think she would have looked really cool. But would we all have accepted her so readily as a woman? Would she have appeared on the cover of Vanity Fair to begin with? It's time for the aesthetics of upwardly mobile feminist respectability to make room for the aesthetics of survival, particularly trans survival. It's time to revise what a feminist looks like, especially if hair, makeup and nails allow her to get jobs, make friends or ride the subway home safely at night. It's time to free the femme because some of us need it or just like it, and that's OK. (SOUNDBITE OF MUSIC) ZOMORODI: OK. So I think it's important that we bring up here why there was such a backlash. And it's - really comes down to the reaction from some second-wave feminists saying, you know, that women don't have to be super glam. They don't have to be super feminine, that this was, you know, taking us backwards by having Caitlyn Jenner look like that. HU: Yeah, so during the sort of consciousness-raising era of the '70s when second-wave feminism was in vogue, the idea was that to look very feminine was also to adhere to traditional gender roles of having to be at home and not having as many paths to economic independence. But yeah, we talk so much - we have had so much of this conversation dominated by sort of critiquing narrow beauty standards. And this is another way to critique narrow beauty standards from Hari here. It's to say that beauty standards should not just be a rejection of what's traditionally femme, but should also include an acceptance of femme if that's what it takes for survival. (SOUNDBITE OF TEDx TALK) NEF: Under patriarchy, money and country inscribe themselves on women's bodies. We look in the mirror, and we ask ourselves, huh, do I look like a rich woman today? We look in the mirror and say, huh, do I look like an American woman today? We look in the mirror and say, huh, do I look like a beautiful woman today? And if I don't look rich, beautiful and American, am I still a woman? Here's a picture of me before I started transitioning - or I had started transitioning, but I hadn't started medical transition yet. At this point in my life, I wore a full face of makeup every day. I shaved my whole body every week, which covered me in these angry red spots. I stopped cutting my hair. I wore dresses to morning classes. I started hormones - pills twice a day and a needle in my leg every week. I started going in for monthly laser hair removal appointments - procedures that were so painful that I had to chug a flask of vodka before every session just so I'd feel it less. I starved myself and abused laxatives so I could fit the clothes I wanted to wear. I did all this 'cause I wanted a body that allowed me to do the things I wanted to do in the way I wanted to do them, things men in this country aren't really allowed to do. I tried to do them in the body I was born with, but people told me, no, you can't. You got to soften up your face, get rid of all your body hair, get breasts, shrink your waist, get a vagina. Of course, I looked them right in the eye, said [expletive] you, turned around and did pretty much all of what they told me to do. (LAUGHTER) NEF: It hurt, and it worked. And if my story or journey sounds difficult or tough, I can guarantee you it's even more difficult and more tough for the vast majority of trans women. ZOMORODI: Oh, that is so hard to hear, especially the part when Hari admits she feels that she needed to suffer all that pain to achieve what she wanted. And then, she alludes to the violence that many trans women also suffer. HU: Yes, yes. According to one study, trans people are four times as likely to have violent crimes perpetrated against them compared to cisgendered people. One in two transgender individuals are sexually abused or assaulted at some point in their lives. Some reports even estimate that transgender survivors may experience rates of sexual assault up to 66%, and that's often coupled with physical assaults or abuse. ZOMORODI: So upsetting. And Hari points out that this idealized version of femininity is essentially meeting a patriarchal standard, standards set by men. But she also says that while meeting those standards, well, that can mean survival for some trans women. For others, it is a goal in and of itself. But the process, whoa - it can be long and extremely tough. (SOUNDBITE OF TEDx TALK) NEF: It is so hard to gain access to hormones, to jump through all the medical hoops. It is so expensive to buy cosmetics, new clothes, healthy food, any number of means towards body feminization. And yeah, even if a trans woman does manage to look or seem femme, her race, her class or her citizenship can place further targets on her back. So when it comes to trans women with limited resources, their femme can be the difference between life and death. So I got to ask, why are we being shamed for our femme? Let femmes be femmes if they want to be femme because some of us need it or just want it, and that's OK. When the aesthetics of feminist respectability exclude and erase the women who need - not just want, need - to give them up, then the aesthetics of feminist respectability need to change. Femme aesthetics aren't bad or good. They just work. They just are. They work for some of us. So chill out. (LAUGHTER) NEF: Let us live. Free the femme. Thank you. (APPLAUSE) ZOMORODI: That was model Hari Nef. You can see her full talk at ted.com. In just a minute, we'll continue our conversation with Elise Hu. On the show today, reflecting on and challenging our beauty norms. I'm Manoush Zomorodi, and you're listening to the TED Radio Hour from NPR. (SOUNDBITE OF MUSIC) ZOMORODI: It's the TED Radio Hour from NPR. I'm a Manoush Zomorodi. And on today's show, the beauty ideal - the beauty ideal. So far, we've heard a TED Talk about Instagram. (SOUNDBITE OF TEDx TALK) K SIMPSON: There's new apps that allow us to digitally alter the way we look. ZOMORODI: How teens feel tremendous pressure to Photoshop themselves to look flawless. (SOUNDBITE OF TEDx TALK) K SIMPSON: And in a few moments, I could have a photo of myself with longer legs, a thinner waist. I could remove acne, remove a fat roll. (SOUNDBITE OF TED TALK) SARAGO: You see, I belong to the oldest living culture in the world. ZOMORODI: We heard from a woman finding strength through her Aboriginal beauty culture. (SOUNDBITE OF TED TALK) SARAGO: When we decolonize beauty, we are reintroduced to our authentic selves. (SOUNDBITE OF TEDx TALK) NEF: It's time to revise what a feminist looks like. ZOMORODI: And we learned that traditional femme standards criticized by some can be a real lifesaver for some trans women. (SOUNDBITE OF TEDx TALK) NEF: Especially if hair, makeup and nails allow her to get jobs, make friends or ride the subway home safely at night. ZOMORODI: Riding shotgun with me is Elise Hu, host of the \"TED Talks Daily\" podcast. She is also writing a book about this subject. Hello, Elise. HU: Hello, Manoush. ZOMORODI: And Elise, a constant theme running throughout our episode so far has been body modification - right? - the good and the bad. HU: One of the biggest questions that I wrestle with as I research and write this book is how do we square the beauty ideal in a virtual world and a real world when the lines between the worlds are getting so blurred? And there's not only the technology of sort of self-surveillance, the idea of sort of cameras in our pockets and us being able to see one another all the time and then surveilling ourselves because we're aware that we're seen all the time. So that's one kind of technology. The other is the technology of self-improvement because there are so many beauty filters that normalize or teach us the ideals. Then, we sort of fall into that, and we start to chase that in a way that appears not only in our images but maybe on the living canvas, maybe on our actual bodies because that's becoming more and more accessible in lots of places in the developed world. ZOMORODI: And I think that also brings us to our final talk... HU: Yeah. ZOMORODI: ...About potentially the future of beauty. And that's gene editing, right? The last Talk that you've brought us from biologist Paul Knoepfler - his talk is called \"The Ethical Dilemma Of Designer Babies.\" And he starts by taking us to the not-so-distant future. (SOUNDBITE OF TEDx TALK) PAUL KNOEPFLER: Let's pretend it's the year 2030, and you're a parent. You have your daughter, Marianne (ph), next to you. And in 2030, she is what we call a natural because she has no genetic modifications. And because you and your partner consciously made that decision, many in your social circle - they kind of look down on you. They think you're, like, a Luddite or a technophobe. Marianne's best friend Jenna (ph), who lives right next door, is a very different story. She was born a genetically modified designer baby with numerous upgrades. And it's become very clear to you that Jenna is extraordinary. She's incredibly intelligent. If you're honest with yourself, she's smarter than you, and she's 5 years old. She's beautiful, tall, athletic, and the list goes on and on. And in fact, there's a whole new generation of these GM kids like Jenna. And so far, it looks like they're healthier than their parents' generation, than your generation. And they have lower health care costs. They're immune to a host of health conditions, including HIV/AIDS and genetic diseases. It all sounds so great. ZOMORODI: It does all sound so great. On the one hand, I'm like, awesome, a healthy child who doesn't have to deal with disastrous illnesses in their lifetime ever. But on the other hand, this idea of, like, an upgraded kid - it is creepy. Elise, like, how far-fetched is this scenario? HU: Yeah, scientists range in their opinions on how far-fetched this is. But Paul is a stem cell researcher, and he spends a lot of time thinking about how we can use gene therapy in a helpful way - right? - gene engineering to really be therapeutic. But he's also worried that this technology, like CRISPR, could be used by families of rich people with deep pockets to alter their future children and give them this advantage that would really create an unfair playing field. This is one of the big ethical questions that comes up when we talk about CRISPR. And we've seen how it could play out in books and movies... ZOMORODI: Yes. HU: ...About the future. (SOUNDBITE OF FILM, \"GATTACA\") UNIDENTIFIED NARRATOR: In the not-too-distant future... ZOMORODI: \"Gattaca,\" I'm thinking of. (SOUNDBITE OF FILM, \"GATTACA\") UNIDENTIFIED NARRATOR: ...Our DNA will determine everything about us. HU: Such a great film. But what I thought was really powerful about it, for those of y'all who haven't seen it, is that we engineer that which we find perfect or ideal at a given time. And when we look back on that film, we have the opportunity to really rethink what they thought was perfect at that time, right? And that ideal is fluid, and it's expansive. So it's worrying to lock ourselves into one ideal of perfection when you have the power to genetically modify babies. ZOMORODI: Yeah. When he was like, she's perfect, she's tall, I was like, hang on a minute. As a short person, who do you get to - I don't - I wouldn't want to have, like, weird extremely tall children. Then they... (LAUGHTER) ZOMORODI: ...As a short person. But OK, so where does the law stand on this? If someone wanted to have a designer baby - I mean, you can certainly pick the sex of your child, and you can screen for certain illnesses. But can you make them tall or beautiful or have a higher IQ? HU: Not right now. Not right now. The U.S. and dozens of other countries around the world have specifically made the implantation of genetically modified human embryos illegal. ZOMORODI: OK. HU: Now, that's different than what's called preimplantation genetic diagnosis. So in the U.S., couples using in vitro fertilization can utilize tests to find out the sex of their fertilized embryos. And you can test for Down syndrome or dwarfism, for example. I should say, though, that Paul and many other researchers are super excited for the use of CRISPR to heal people from debilitating disorders and to really help people - to help make people healthier. This work to splice genes is really amazing and amazingly inexpensive. But as I learned when I covered the future beat for NPR after I got back from Korea, what happens is, there is kind of an arc to these human enhancement technologies or biotech. They go from assistive and therapeutic or medical, as CRISPR is now. But then they move into augmentive (ph) - right? - to bettering ourselves, making us faster, stronger, smarter, and then could reach a place of adaptive, which is actually changing our very selves. And those in that sort of realm we don't consider enough or we don't consider deeply as a population, I think. ZOMORODI: Yeah. I always think, you know, vanity can also (laughter) be a very slippery slope. Because you think, well... HU: (Laughter). ZOMORODI: ...I'll just tweak that one thing, or I'll just... HU: Good point. Good point. ZOMORODI: ...Dye my hair the one time. And then you're dying it for the rest of your life. HU: Back to the question. ZOMORODI: Exactly. HU: Yeah. ZOMORODI: The maintenance thing. HU: Back to the question; where do we draw the line? (SOUNDBITE OF TED TALK) KNOEPFLER: Maybe even if we just look in the mirror, there might be ways we think, you know, we could be better. You know, I might wish honestly that I had more hair here, you know, instead of baldness. Some people might wish they were taller, have a different weight, you know, a different face. If we could do those things, we could make those things happen or we could make them happen in our children, it would be very seductive. And yet, coming with it would be these risks. This technology is so new and so powerful that by accident, we could make them sicker. You know, that easily could happen. And there's another risk. And that is that all of the legitimate, important genetic modification research going on just in the lab - again, no interest in designer babies - a few people going the designer baby route. Things go badly. That entire field could be damaged. HU: Yeah. So Manoush, you know, you're a longtime tech reporter. ZOMORODI: Yes. HU: I'm sure you remember that in 2019 there was that Chinese scientist who announced he created the first genetically modified baby. ZOMORODI: Oh, yes. Yes. HU: This was big news. I got a bunch of news alerts about it. And his work was really widely panned. Most of his fellow researchers were appalled about this. They said this kind of experimentation was totally unethical and far too irresponsible. ZOMORODI: You know, as is often the case with technology, it's really hard to do studies because it's - you know, it's unethical to... HU: Right. ZOMORODI: ...Test things out on humans. HU: Do it on people. ZOMORODI: You can't have the control group and all of those things. But I can see also, you know, for geneticists and other scientists, you know, you want to be the first. You want to be the one who cracks the code. And then, you know, think of how fearful we were when IVF became a thing, the first IVF baby when I was a kid. And at first, that really freaked people out. And now, millions of babies are born via IVF, and nobody really thinks it's that big a deal. (SOUNDBITE OF TED TALK) KNOEPFLER: Five million IVF babies have been born, bringing immeasurable happiness. A lot of parents now can love those kids. But if you think about it, in four decades, 5 million babies being born from a new technology is pretty remarkable. And the same kind of thing could happen with human genetic modification and designer babies. So depending on the decisions we make in the next few months, the next year or so, if Designer Baby No. 1 is born, within a few decades, there could well be millions of genetically modified humans. And there's a difference there, too. Because if we - you know, you in the audience or I, if we decide to have a designer baby, then their children will also be genetically modified and so on. Because it's heritable. So that's a big difference. ZOMORODI: There's one last thing that Paul says, which I think - as both of us have covered technology, there is that - it brings you back to - the question is, what really makes a human a human? Like, we have to consider that before we start optimizing people to any extent, really. (SOUNDBITE OF TED TALK) KNOEPFLER: Let's pretend we're back in that reality. We're at a park, and our kid is swinging on the swing. Is that kid a regular old kid? Or did we decide to have a designer baby? And let's say we went the sort of traditional route. And there's our kids swinging on the swing. And frankly, you know, they're kind of a mess. You know, their hair's all over the place, like mine. They have a stuffy nose. They're not the best student in the world. They're adorable. You love them. But there on the swing next to them, their best friend is a GM kid. And the two of them are kind of swinging like this, and you can't help but compare them, right? And the GM kid is swinging higher. They look better. They're a better student. They don't have that stuffy nose you need to wipe. You know, how is that going to make you feel? And what decision might you make next time? ZOMORODI: I have to admit, no boogers is pretty appealing. But it... (LAUGHTER) ZOMORODI: It does seem like in all the conversations we've had and in all the talks that we've heard, it comes down to people constantly comparing themselves to other people. It's just - I mean, it's exhausting. HU: Absolutely. And it certainly comes into play when it comes to our looks, for sure. But this reminds me - this part of his talk really reminds me of one of the lessons of \"Gattaca,\" the science fiction film that portrays this very idea, which is, you know, that there was - there were two brothers, right? And one was the genetically engineered one and the other one was not. He was the normal human and considered really low-class because he wasn't engineered, but then was able to - I don't know if you remember this, but the big line from \"Gattaca\" was, like, that the brother who wasn't able to swim back from the ocean - he didn't save enough for the swim back. And it was the brother who wasn't engineered who had a humanity about him, who had that sort of fire in his belly that you could not engineer for. And so there is something really valuable about that which makes us deeply human. And there are qualities, no matter what specs that we have on the outside or specs that we think are in vogue in the moment, like height, for example - maybe that's not advantageous. Maybe that's not necessarily optimizing. We don't know really because there is kind of magic to ourselves that's irrespective of how we look or how we perform in various fields. ZOMORODI: Well, you're making me feel better about what I say to my daughter, which is that perfection is so incredibly dull and uninteresting, and it's the weirdness and the flaws and the imperfections that make people strange and interesting and worth getting to know. And so far, she seems to be buying it, Elise (laughter). lease and we're to be fair and I love that. HU: Yeah, and we're - to be fair - and I love that. I think that's beautiful. But to be fair, we are not going to give up the quest for self-improvement. There is something that's deeply human about that... ZOMORODI: Sure, yeah. HU: ...Right? - of potential and wanting to be better. And if how we look is so much a part of our identities and ourselves, then of course we're going to want how we look to appear better. And so what I'm circling around as an argument in my book is that we can strive for something that is more deserving of the men and women who do turn to beauty rituals, whether they're trans or cis, and that we can connect to our identities in these sort of self-care or beauty practices without being, like, too baked into one particular ideal - right? - and without spending that much money. What I want to see is a consumer beauty culture that says that you can look like this or this or this or this or that, right? A wider spectrum can really widen our gaze and our sense of normalcy. And it's going to take, you know, changing the people in charge of these companies. It's going to take really changing the way that we are represented in advertisements and in film and in television and in commercials, right? It's going to take norm-setting of that which is more acceptable and widening our lens in the way that we talked about earlier in the show. So I think it's possible. It's just, we're not quite there yet. (SOUNDBITE OF MUSIC) ZOMORODI: I mean, how much does it come down to, as long as all those different ways of being \"beautiful\" - quote, unquote, \"beautiful\" - are accepted, that it's possible as long as the companies showing the pictures and making the products can continue to make money? Because what we're talking about is also a consumer habit, right? HU: Right. Right. So South Korea for a long time did not offer foundation or any sort of cover up that was dark, right? So I couldn't even get the makeup compact that I liked under a certain brand because I was too tan for it. My skin was too dark for it. And now they are really expanding that because of consumer demand. So we can insist - right? - on some reform. We can insist on more diversity, more variety, more color - more literal color - and more acceptable norms. It's going to take pushing for it and more of the people who are bucking trends, like the Escape the Corset movement. And it's going to take more conversation like the ones we're having. (SOUNDBITE OF MUSIC) ZOMORODI: Elise Hu is host of the \"TED Talks Daily\" podcast. She makes all kinds of cool stuff for NPR. You can see all the talks that we discussed on this episode at ted.com. Elise, thank you so much again. HU: Thank you for having me. You know I love talking to you, so this was fantastic. ZOMORODI: This episode was produced by Sylvie Douglis, James Delahoussaye and Rachel Faulkner. It was also edited by Rachel Faulkner. Our Ted Radio production staff also includes Jeff Rogers, Sanaz Meshkinpour, Diba Mohtasham, Katie Monteleone and Matthew Cloutier. Our audio engineer is Daniel Shukin. Our intern is Harrison Vijay Tsui. Our theme music was written by Ramtin Arablouei. Our partners at TED are Chris Anderson, Colin Helms, Anna Phelan, Michelle Quint and Micah Eames. I'm Manoush Zomorodi, and you've been listening to the TED Radio Hour from NPR. (SOUNDBITE OF MUSIC) Copyright © 2021 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information. NPR transcripts are created on a rush deadline by an NPR contractor. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record. Sponsor Message Become an NPR sponsor ",
    "datetime": null,
    "url": "https://www.npr.org/transcripts/1029378628"
}