{
    "title": "Elle Editor Takes on Kim K's Beauty Routine: ''Yeezus!''",
    "text": "Remember the Elle senior editor who dressed like Kim Kardashian for a week and documented her experience for the publication? Well, the hilarious Sally Holmes is back with the second part of her feature, titled \"I Lived Like Kim Kardashian for a Week: Part 2, Beauty\"—and once again, the journalist does not disappoint as she takes on the E! star's beauty regime in an adorably self-deprecating demeanor while also noting, thanks to her newfound Kardashian confidence, that \"being proud of how you look is always something to celebrate.\" \"Here is what I learned about Kim Kardashian after trying her beauty routine for a week: Kim Kardashian doesn't sweat. She also doesn't bend down, wear clothes that require being pulled over her head, or type. Anything. I learned this the hard way,\" Holmes begins in her article. READ: See what dressing like Kim Kardashian for a week was like! \"For my Kim Debut, wearing the fantastic ALC crop top and high slit dream skirt, I decided to do it right, and had hair and makeup come to my apartment. (Fance!)...\" she writes. \"The hairstylist tackled my wet hair, blowing it straight, adding product to give it hold and to create that slicked down look, and pinning it all in place so it could set. She then doused me in hairspray, so, like Kim, I could be Madame Tussauds-level perfect in every picture.\" The reaction was well worth her time in the glam chair. \"When I got to the office, my coworkers were shocked. 'Your hair,' was the most common reaction, since my go-to styling trick is flipping my head upside down to blow dry it, then—just kidding, that's all I do. 'Sally, you look very fierce today,' one colleague said. 'Your hair is usually, you know, just doing its thing. This is great,'\" the now Kim Kardashian-connoisseur recalls. LOOK: These two girls re-create Kim and Kanye's outfits and it's amazing For day two, Holmes opted to try Kim's signature slicked-back style, \"Using an Oribe styling gel and a lot of Frederic Fekkai hairspray, I went full Elvis on my head. Or Zac Efron. In either case, I looked like I belonged in Taylor Swift's \"Bad Blood\" video, and sweet mother of Yeezus, I looked good,\" she shares (albeit, the look was a little difficult to maintain). On day three (remember, Kim only washes her hair every fifth day), Holmes went on a run (another activity Kim does regularly) and felt compelled to take a slight detour from the mother of one's beauty regime. \"When I came back from my run with hair that was not simply shining with a little oil, but damp with salty, sweaty grease, I had to wash it...So… I showered. And made an emergency trip to Bumble and bumble,\" she admits. VIDEO: Kim K talks 2nd pregnancy—is she having twins? And they say I didn't have a talent...try balancing a champagne glass on your ass LOL #BreaktheInternet #KimKardashian A photo posted by Sally Holmes (@sallyholmes) on May 30, 2015 at 2:57pm PDT Following her blowout at Bumble and Bumble, Holmes called upon one of her pals and got her hands on a prototype shower cap that it is said to preserve your blowout. \"Perfect. Exclusive. She sent it. I wore it. My perfect Bumble blowout lived on for two more glorious good hair days,\" Holmes writes. When it comes to makeup, Holmes attempted to master the \"gorgeous nude look Kim wore to the Met Gala, using the exact Marc Jacobs Beauty products he [makeup artist Mario Dedivanovic] worked with.\" The end result took a whopping 55 minutes, but as Holmes notes, her friends were \"impressed.\" \"The other Kim face I was determined to try was her signature contour look,\" she writes, noting that she was later \"pretty pleased\" with her \"razor sharp cheekbones and adding that foundation is \"stupendous.\" As for nails? Holmes opted for one of Kim's razor-sharp manicures, but quickly found that her talons but a damper on her daily activities. READ: Pregnant Kim Kardashian first met Caitlyn Jenner at Vanity Fair photo shoot—plus, has she revealed a pregnancy craving? \"After the suitable period of immobile admiration ended, I realized: I couldn't really type at a normal pace. Let's forget the click, click, click every time my finger nail hit a key, I simply couldn't hit the buttons as fast, since I was used to hitting each letter with the flesh of my fingers, which my nails now impeded. And forget about texting. I sat, palming my phone for an awkwardly long time, cursing autocorrect.\" With regards to her overall takeaway, Holmes says \"Kim is patient—and dedicated to looking her best\" although she's also learned to appreciate those who put in the extra effort. \"It's not so bad to look like you put some effort into your beauty routine,\" she concludes. \"While my hair normally just does 'its thing' and my makeup is usually minimal, looking like I tried—and with it, getting an extra boost of confidence...—is a positive thing. It's not everything...but being proud of how you look is always something to celebrate.\" She adds: \"So I'm going to start wearing foundation. And I'm going to look damn good doing it.\" Get it, girl. PHOTOS: See Kim's chic mommy style Your source for entertainment news, celebrities, celeb news, and ​celebrity gossip. Check out the hottest fashion, photos, movies and TV shows! © 2023 E! Entertainment Television, LLC A Division of NBCUniversal. All rights reserved. ",
    "datetime": "2015-06-03T22:19:12.000Z",
    "url": "https://www.eonline.com/news/662964/elle-editor-now-takes-on-kim-kardashian-s-beauty-routine-sweet-mother-of-yeezus-i-looked-good"
}