{
    "title": "Emily Ratajkowski Swears By This Niche K-Beauty Ingredient For Stressed Skin | British Vogue",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, select My Account, then View saved stories To revisit this article, visit My Profile, then View saved stories To revisit this article, select My Account, then View saved stories We may earn a commission if you buy something from any affiliate links on our site. By Hannah Coates There are beauty trends and then there are beauty trends. One example in the latter category is the K-Beauty convert’s inclusion of snail mucin in their no-stone-left-unturned, 12-step skincare routine. It’s a trend that hasn’t gone unnoticed by Emily Ratajkowski, who shared her own favourite snail product on her Instagram Stories on Sunday. “So my skin freaked out at the beginning of quarantine but now I’m using Dr Loretta cleanser, this amazing snail [product] – yes snail – then I put a retinol on,” she said when asked by a follower for details of her skincare routine. Retinol is one way to address skin that has “freaked out”, but snail slime is quite another. Read more: Gigi Hadid & Zayn Malik Are Having A Baby The snail product she showed off was by Cosrx, a Korean beauty brand that has a string of formulas featuring snail slime. The product in question appears to be the Advanced Snail 96 Mucin Power Essence, which is designed to be used after cleansing to replenish moisture and soothe angry skin. Cosrx also offers a snail slime-infused moisturiser (the Advanced Snail 92 All In One Cream), and SPF (Shield Fit Snail Essence Sun SPF 50). Full of hydrating hyaluronic acid, copper peptides and with antimicrobial properties, snail mucin is a brilliant ingredient for all kinds of skin that’s in need of calming, whether it’s acne or rosacea-prone, or just really dry. It does a brilliant job at accelerating wound healing, while protecting skin from the environment and soothing areas in need of TLC. By Hannah Jackson By Hannah Coates By Alice Cary Read more: Emily Ratajkowski’s Minimal Skincare Routine Is All You Need For Luminous Skin Widely used in Korean skincare, snail mucin doesn’t make formulas smell or feel slimy, but actually helps to make them supremely effective on the skin. Concerned about the welfare of snails? Importantly, no harm befalls them during the harvesting process (which sees them slither their way over a mucin-catching net for half an hour in the dark). Plus, if those shimmering trails are anything to go by, Ratajkowski’s skin is glowing for a reason. More from British Vogue: By Alice Cary By Daniela Morosini By Rose Gallagher By Lisa Niven-Phillips More from Vogue Condé Nast Britain © 2023 Condé Nast ",
    "datetime": "2020-04-27T12:30:18.322Z",
    "url": "https://www.vogue.co.uk/beauty/article/emily-ratajkowski-snail-mucin-skincare"
}