{
    "title": "Emma Roberts Talks Christmas Presents and Favorite Make Up Products",
    "text": "We recently caught up with Neutrogena brand ambassador Emma Roberts (and yes, her skin truly glows!) at the chic downtown N.Y.C. nail salon Paint Box, where she gave us all the details on her favorite holiday beauty looks, the first beauty product she ever used, and the secret to her signature bold lip. \"I’m having such a fun night,\" she told us. \"I love it! I feel so good when I get a manicure. It’s sad to admit what a pep in my step a manicure gives me.\" Ready to join in on the fun? Keep reading. What is your favorite of all these Neutrogena products?For me, this is the one I’ve loved since I was like, 13 years old: the Healthy Volume Mascara ($8; neutrogena.com). Just because I feel like mascara was the first beauty product I was allowed to use as a kid, so I have an affinity for all mascaras, but this one, to me, is the best because it has a great thick brush and it doesn’t dry out. I hate when you look at your mascara and it looks dry. This one you can layer on all day and night and it doesn’t dry out, so if I could only have one thing on a dessert island, it would be this. The Moisture Smooth Color Sticks ($9; neutrogena.com) are also my favorite because they’re really sheer and moisturizing. Because I fly so much my lips are always dry. I want anything with moisture that gives you a nice pout. PHOTOS: Find the Best Red Lipstick for Your Skin Tone One of our favorites is the makeup removing wipes. I’ve bought them too! I love those because you can really get them in your eye and it doesn’t burn. So many makeup remover wipes I’m like, “These are not for your eyes,” and these I can rub everywhere and they get everything off. I just love them. They smell good, they’re clean—they’re really nice. What are your favorite holiday beauty looks?I’m all about just doing mascara and a great lip color and keeping everything else simple. I feel like a lot of holiday parties I’m going from work to the party and it’s so hard to do the full face of makeup, so I love great mascara and then doing a red lip. I’m really into hot pink lips right now (and a) burnt orange lip. PHOTOS: Holiday Beauty Hacks You always have the best bold lips. Aw, thanks. I’m kind of just into that. And then if you don’t want to deal with lips—because I know eating at parities sometimes you don’t want to have to fix it—so then just do a great smoky eye and call it a day. I like the Nourishing Eye Liners ($8; neutrogena.com) and I’ve seen a lot of people doing blue recently, which I’ve never tried, so I think I’m going to try it for the first time. Neutrogena does a Twilight Blue that’s really pretty, and I think I’m just going to try to do clean skin with Twilight Blue and then black mascara and maybe try to match my bag or my shoe to it. Is there anything on your wish list for the holidays?I couldn’t really think of anything that I wanted other than to be home at my parents’ and just bake and cuddle. I just want to be cozy. I love Missoni blankets, and I love throws and blankets—all over my house there’s blankets, so I’m lusting after a new Missoni blanket. PHOTOS: See Emma Roberts' Bests Look Ever ",
    "datetime": null,
    "url": "https://www.instyle.com/news/emma-roberts-what-she-wants-christmas-and-one-thing-always-puts-pep-her-step"
}