{
    "title": "Essence Skin Care: What Do Facial Essences Do for Your Skin?  | Glamour",
    "text": "By Deanna Pai The flood of Asian skin care imports has changed the beauty game for the better, thanks in no small part to their new, novel technologies. The thing is, though, that while some products are super-straightforward (hello, sheet masks), others can be pretty tricky to figure out—like essences. Are they like toners? (Nope.) Do you really need one? (Probably.) How do you use them? (Keep reading!) Here's everything you need to know about this game-changer. Essence skin care products are watery formulas that bump up hydration, but they operate differently than your everyday moisturizer. \"Think of skin as a sponge,\" says Alicia Yoon, founder of K-beauty e-commerce site Peach & Lily. \"When dry, a sponge is brittle and doesn't absorb liquids well. In the same way, when skin isn't sufficiently hydrated, it's more difficult to absorb moisturizer, serums, and other treatments.\" The light, thin texture of essences allows them to penetrate quickly and effectively (a benefit impossible to mimic with even a lightweight moisturizer). Not only does this give you an extra layer of hydration—a bonus, especially in sight of dry winter weather—but by \"priming\" skin, essences help it better absorb all your heavier, more potent products. In a nutshell, it boosts the efficacy of your entire skincare squad. Because both essences and toners are liquid-y and used between cleansing and everything else, the two are often confused for one another. But you can't use them interchangeably. \"Toners are primarily meant to balance pH levels, while essences hydrate skin,\" explains Yoon. Since they serve two separate purposes, you'd ideally use both. After cleansing, use a toner and then follow it with an essence skin care product. The best way to apply it: Instead of wasting it on cotton pads—which absorb just as much liquid as they deposit onto skin—Yoon suggests patting it on with your hands. (If you're doing it directly after washing your face, assume your hands are clean and germ-free.) If you just can't deal with any more steps into your skincare routine, try a hybrid. \"Some essences can have a toning function,\" says Yoon. \"Look for essence tonics, toning essences, or essence toners.\" She's a fan of Cremorlab Essence Tonic, $40, peachandlily.com. All of that makes pretty clear sense now, right? Well, here comes the even trickier part: Essences aren't one size fits all. While they lack the potent treatment properties of a targeted serum, moisturizer, or face oil, they might contain ingredients that are better suited for certain skin types. Which is why we broke down which option will work best for you. Best for All Skin Types: May Coop Raw Sauce, $43, peachandlily.com The base isn't water—it's maple sap, which, on a molecular level, is much closer to the size of our bodily fluids than H2O. Meaning skin drinks it up ASAP for instant hydration. Best for Dry Skin: Burt's Bees Intense Hydration Nourishing Facial Water, $13, burtsbees.com By Andrea Navarro By Emily Tannenbaum By Elizabeth Logan Most of the heavy lifting in this super-moisturizing essence is done by clary sage, a plant extract that acts like a moisture magnet for skin. Best for Oily Skin: Belif Hydra Sebum Control Essence, $42, sephora.com You'd never guess it, but this actually contains clay to zap oil as it nourishes skin. It's even proven to reduce pore-clogging sebum by 20 percent. Best for Sensitive Skin: Cremorlab Mineral Treatment Essence, $42, peachandlily.com By Andrea Navarro By Emily Tannenbaum By Elizabeth Logan The paraben-, fragrance-, and alcohol-free status of this soothing option makes it a go-to for those prone to irritation. Best for Mature Skin: Jurlique Nutri-Define Essential Conditioning Lotion, $65, jurlique.com Who can say no to a little anti-aging boost? The proprietary botanical complex in this formula increases elasticity and smooths out wrinkles. By Danielle Sinay By Kara Nesvig By Hasina Jeelani By Danielle Sinay More from Glamour See More Stories © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Glamour may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "datetime": "2015-12-04T09:05:00.000Z",
    "url": "https://www.glamour.com/story/essences-korean-skincare-trends"
}