{
    "title": "Estée Lauder jumps into k-beauty: to acquire cosmetics company Dr. Jart+ owner | MDS",
    "text": "We inform you that on this website we use our own and third-party cookies to collect information about its use, improve our services and, where appropriate, display advertising by analyzing your browsing habits. You can expressly accept its use by pressing the \"ACCEPT\" button or configure and select the cookies you want to accept or reject in the settings. You can also get more information about our cookie policy here. The global fashion business journal Oct 26, 202311:54am In 2015, the American cosmetic group acquired a minority stake in Have&Be Co. and now takes control by acquiring the remaining shares of the company.    Estée Lauder continues its commitment to Korean beauty by making the first purchase of a k-beauty brand: Have&Be, owner of the Do the Right Thing and Dr. Jart + brands, a company valued at approximately 1.7 billion dollars. The company expects to fund this transaction with debt.  The Estée Lauder group, one of the world’s largest cosmetic groups with a revenue of 3.9 billion dollars in the first quarter of 2019, aims with Dr. Jart + to expand the company’s consumer reach in Asia/Pacific, North America, the United Kingdom and travel retail and projections of 500 million dollars in sales by the end of this year.  “Since the beginning of our partnership four years ago, the company has shared our mission to provide the very best skin care and beauty products to consumers around the world. We are excited for the opportunity to continue this partnership as we continue to innovate and grow our brands globally.” said William P. Lauder, executive chairman of Estée Lauder. info@themds.com  Validation policy for comments: MDS does not perform prior verification for the publication of comments. However, to prevent anonymous comments from affecting the rights of third parties without the ability to reply, all comments require a valid email address, which won’t be visible or shared. Enter your name and email address to be able to comment on this news: once you click on the link you will find within your verification email, your comment will be published. Sections Publications Services Follow us MDS Legal notice The global fashion business journal Please fill the registration form to subscribe to the MDS Newsletter and receive all fashion industry-related news, analysis and opinion articles on the fashion business in Spain and the rest of the world. ",
    "datetime": null,
    "url": "https://www.themds.com/companies/estee-lauder-jumps-into-k-beauty-to-acquire-cosmetics-company-dr-jart-owner.html"
}