{
    "title": "Estée Lauder acknowledges beauty blogger power with Korean ambassador",
    "text": "Or wait... Headlines Brand Innovation Formulation & Science Packaging & Design Business & Financial Market Trends Regulation & Safety Promotional Features Site Archive Multimedia Regions All Asia-Pacific South East Asia South Asia East Asia Oceania Site Archive Multimedia Hot topics Clean & Ethical Beauty Sustainability COVID-19 Market Entry Anti-Aging / Skin Whitening Beauty From Within Nanotechnology Green Cosmetics Site Archive Multimedia Resources Type of resources Events All Events Shows & Conferences Online Events Editorial Webinars Events China 中国 Podcast  20-Jul-2015\n                            - Last updated on\n                                20-Jul-2015 at 14:34 GMT Related tags\nEstée lauder Kim hosts popular South Korean fashion and beauty TV shows in both English and Korean and has also collaborated with K-Pop stars - highly regarded by the younger generation. 'K-pop' or Korean pop culture is the metro-sexual appeal of South Korean boy bands like 2PM, Big Bang and Super Junior that utilize their celebrity status to access, tap or break into foreign markets or indeed endorse cosmetic products in Asia. As part of this deal, Irene Kim will work with Estée Lauder on 'how-to' videos, predicting the next big trend in Korean beauty and potentially consulting on product development. “Fusing the best of eastern and western beauty tips and techniques, Irene has quickly become an influential beauty voice to an Asian and international audience across her social media platforms,​” say Estée Lauder reps. “She will further communicate her passion for beauty by creating engaging beauty content for the brand’s online and social media platforms,” ​they say. #beautybloggerpower​ In Asia, more and more consumers have turned to social media for guidance on trends and style. In fact, 40 per cent of China's online shoppers read and post reviews about products – more than double the number in the US. According to our Asia cosmetics expert, Florence Bernardin, the following bloggers have also had significant influence on cosmetics buying behaviors in China, Japan and Korea in 2015. 1. China – 久久妹妹 Jiujiu Meimei   ​ This Chinese beauty blogger is also a fashion editor working with brands and beauty magazines as well as participating in a renowned TV program ‘Pretty Women’. -  Weibo address: http://weibo.com/793099​ -  Fan numbers: 445198 -  Promotional activities, the latest brand information -  Make-up tutorials, product promotion, product review, test results, recommendations -  Brand collaboration: La Prairie, Chanel, Esteelauder, LaMer, Fresh, Clinique, Naruko, Giorgio Armani, Bobbibrown, Mac, Jurique 2. Japan - Megumi Kanzaki​ This beauty stylist only tends to give coverage to the good experiences she's had with tried and tested products. Her philosophy is supported by women of all ages. -  She has written several books, and also has a column in BITEKI, one of Asia's famous beauty magazines -  Megumi's style is mixed; Kawaii, feminine, sexy -  Blog (http://ameblo.jp/kanzakimegumi/​ : 20569 followers since 2009 -  Twitter (https://twitter.com/megumi_kanzaki​): 20200 followers 3. Korea – Pony​ This renowned make-up artist & beauty blogger recreates various celebrities looks and logs videos on Youtube in the form of 'Pony’s Beauty Diary' – Total visitors: 4 045 094 (http://blog.naver.com/highkick_​) – Provides beauty tips, cosmetics reviews – Published many beauty looks in Korea, China, Taiwan… – Launched 'Pony Memebox' by collaborating with sample box beauty service company, Memebox.   Copyright - Unless otherwise stated all contents of this web site are © 2023 - William Reed Ltd - All Rights Reserved - Full details for the use of materials on this site can be found in the Terms & Conditions Related topics\nBusiness & Financial\nEast Asia\nSkin Care\nColor Cosmetics Show more  Content provided by Provital | 13-Jun-2023\n                     | Product Brochure Circanblue™ is a vegan postbiotic ingredient obtained from Lactococcus lactis that induces a resynchronisation of the skin’s circadian cycle after this... More promotional features ",
    "datetime": null,
    "url": "https://www.cosmeticsdesign-asia.com/Article/2015/07/21/Estee-Lauder-acknowledges-beauty-blogger-power-with-Korean-ambassador"
}