{
    "title": "Estée Lauder Companies Buys K-Beauty Brand Dr. Jart+ | Glamour UK",
    "text": " All products are independently selected by our editors. If you buy something, we may earn an affiliate commission. By Marci Robin When you think of K-beauty, I would all but guarantee that the first name that comes to mind is not Estée Lauder. Aside from the corporation's iconic namesake brand, it owns a wide range of other familiar beauty brands such as La Mer, MAC, Aveda, and Too Faced, none of which originated in South Korea. But now, The Estée Lauder Companies Inc. is officially staking a claim in a brand born in what is arguably the fastest-growing region of the beauty world by buying beloved Korean brand Dr. Jart+. Announced earlier this week, Estée Lauder is expected to acquire Have & Be Co. Ltd., the Seoul-based skin-care company behind Dr. Jart+, next month. (Have & Be's portfolio also includes grooming brand Do The Right Thing.) The Estée Lauder Companies had already made a minority investment in Have & Be back in 2015, but this anticipated acquisition will include the purchasing of the remaining two-thirds of the company's shares. \"As consumers increasingly focus on skin care and the category continues its rapid global growth, the influence of cutting-edge, scientifically-driven brands like Dr. Jart+ is undeniable,” William P. Lauder, executive chairman of The Estée Lauder Companies Inc., said in a press release. By Kiran Meeda Founded in 2005, Dr. Jart+ has become one of the most globally recognizable Korean brands, helping usher in the thriving K-beauty trend in the U.S. In addition to producing some of Allure editors' and even K-pop stars' favourite skin-care products, the brand has won several Allure Best of Beauty Awards. In 2017, the Dr. Jart+ Rubber Mask Bright Lover earned the coveted red seal for being the best face mask for dull skin, and in 2018, the Dr. Jart+ Cicapair Tiger Grass Re.Pair Serum was named best calming facial serum. With K-beauty's popularity and Dr. Jart+'s growing fanbase, leaders at The Estée Lauder Companies are understandably excited about the acquisition. In the announcement, Fabrizio Freda, president and CEO of The Estée Lauder Companies Inc., said, \"As the Company’s first acquisition of an Asia-based beauty brand, Dr. Jart+'s focus on creating high-quality skin-care products that fuse dermatological science, incredible innovation capabilities, and artistic expression make it a terrific, strategic addition to our diverse portfolio of prestige beauty brands.\" By Sarah Jacoby By Charley Ross By Anna Bader By Annabelle Spranklen By Denise Primbet By Annie Blay By Denise Primbet By Fiona Embleton SEE MORE STORIES More from GLAMOUR UK © Condé Nast Britain 2023. ",
    "datetime": "2019-11-24T06:00:00.000Z",
    "url": "https://www.glamourmagazine.co.uk/article/the-estee-lauder-companies-dr-jart-acquisition"
}