{
    "title": "Ethics and safety: The two top trends shaping the K-beauty sector brands",
    "text": "Or wait... Headlines Brand Innovation Formulation & Science Packaging & Design Business & Financial Market Trends Regulation & Safety Promotional Features Site Archive Multimedia Regions All Asia-Pacific South East Asia South Asia East Asia Oceania Site Archive Multimedia Hot topics Clean & Ethical Beauty Sustainability COVID-19 Market Entry Anti-Aging / Skin Whitening Beauty From Within Nanotechnology Green Cosmetics Site Archive Multimedia Resources Type of resources Events All Events Shows & Conferences Online Events Editorial Webinars Events China 中国 Podcast  in-cosmetics Korea 2019 15-Jul-2019\n                            - Last updated on\n                                15-Jul-2019 at 01:43 GMT According to Seoul-based Mintel senior beauty and personal care analyst, Hwa Jun Lee, the global growth of K-beauty was driving the changes in the nation’s personal care market. “If you look at the export of K-beauty products, the industry has grown over 10 times in the last 10 years, causing it to become more globalised on the whole.”​ Ethical warriors​ One of the biggest trends Lee is seeing in the market is the rise of eco-ethical beauty. According to Mintel data, 55% of South Korean Gen-Z consumers worry about climate change, making it their third biggest worry behind economy and terrorism. Fuelled by issues like the plastic crisis, Lee believes South Korean personal care players will follow the lead of western brands like Ren, Seed Phytonutrients and UpCircle which champion eco-ethical ideals. The demand for green, however, may lead to confusion in the market, said Lee. “Consumers’ perspective on green beauty is that it can be organic, natural or even non-toxic. They can’t really distinguish, they just know it all [relates] to green beauty.”​ He continued: “We see that there’s a need for a simple explanation of what green beauty is. In the future, green beauty will become a holistic message of sustainability. Beauty brands will be required to show how, where and by whom the products are being created.”​ Lee highlighted beauty brand Kahina Giving beauty as an example. The company uses Moroccan argan oil as its key ingredient and gives back to the local community by hiring women to give them financial and social independence. Another major beauty trend that is gaining momentum is the free-from trend. Lee believes the trend is closely tied to rising skin sensitivity concerns in South Korea “According surveys, majority of South Korean people say they have sensitive skin, which is why they have a lot of concern over the safety of beauty products,” ​said Lee. He added that this was leading to ‘chemical phobia’. “Consumers are running away from chemicals because they fear it will harm their skin. You can say it’s more of a mental thing.”​ Like the previous trend, chemical-phobia is being spurred on by highly-publicised issues, such as Hawaii’s decision to ban the sale of sunscreens that contain oxybenzone and octinoxate beginning 2021. “This year, the state of Florida announced that it will be introducing the same ban. We see such bans to continue expanding,” ​said Lee. The men's grooming market is the new growth engine for the beauty industry and it’s the same in South Korea. “This is largely affected by South Korean television, film and K-pop. [Celebrity] style has greatly influenced the men’s make-up trend. This kind of look is not just aimed at younger consumers, but the general male population.”​ When it comes to hair care, hair loss and scalp care will continue to trend in the South Korean market. “We found that consumers are really concerned about it. Any product that is tailored to hair loss or micro-dust is driving interest in the South Korean market,”​ said Lee. He added that products with scalp claims, in particular, were growing in popularity. In 2018, 41% of hair care launches made scalp claims. “This claim is most popular in shampoos and treatments. Additionally, scalp care beauty devices are an area we must closely watch in the future.”​ Lee believes colour cosmetics with long-lasting claims will continue to be in great demand. These have outpaced the global average in the last four years and the gap is increasing. In 2018, a notable 61.5% of lip products in launched in Korea made this claim. “With more busy lifestyles, less time for make-up and the rise of outdoor activities, we expect this trend to continue growing at a very fast pace in the future. A play in this segment is very essential,” ​he concluded. Hectic urban lifestyles is also seeing the emergence of beauty products that centre on getting a good night’s sleep, said Lee. “Sleep will become a key word for the future of K-beauty. We’ve already seen Etude House launch a whole series of products to help consumers get quality sleep.”​ While Lee believes there are plenty of opportunities in the South Korean beauty market, he admits that K-beauty is facing strong competition from neighbouring Japan. “Japanese beauty companies are growing very well, much stronger than before. When you think about the global perspective, J-beauty has more qualities that resonate with today's consumer,” ​said Lee. He concluded: “Obviously, K-beauty has its own strengthen in term of innovation and marketing, but in terms of Asian beauty perspective I think South Korean companies have to consider the growth of J-beauty in the future.”​ Copyright - Unless otherwise stated all contents of this web site are © 2023 - William Reed Ltd - All Rights Reserved - Full details for the use of materials on this site can be found in the Terms & Conditions Related topics\nMarket Trends\nEast Asia\nVoice of the Industry\nAsia in Focus\nSkin Care\nHair Care\nColor Cosmetics\nFragrance Show more  Content provided by Naolys | 07-Jul-2023\n                     | White Paper Naolys presents HairRevive [MM+Zn], a pioneering plant-based ingredient revitalizing hair.  Content provided by Provital | 13-Jun-2023\n                     | Product Brochure Circanblue™ is a vegan postbiotic ingredient obtained from Lactococcus lactis that induces a resynchronisation of the skin’s circadian cycle after this... More promotional features ",
    "datetime": null,
    "url": "https://www.cosmeticsdesign-asia.com/Article/2019/07/15/Ethics-and-safety-The-two-top-trends-shaping-the-K-beauty-sector-brands"
}