{
    "title": "Every Korean Beauty and Skin Care Term You Should Know",
    "text": " Things you buy through our links may earn Vox Media a commission K-Beautiful: Helping you navigate Korean beauty in 2019. K-Beautiful: Helping you navigate Korean beauty in 2019. What is a serum, exactly? What’s an ampoule, again? It’s been a few years since the South Korean beauty industry exploded overseas, making Korean beauty (often casually shortened to K-beauty) an area of study in every skin-care fanatic’s syllabus. But the terms of the art are still confusing, especially if you’re just getting started — or if you feel like it’s too late to ask. Below, the Cut has put together a helpful glossary of often-used terms in K-beauty. It sounds like something you’d obtain in a vision quest, but it’s just a serum in the form of a concentrated shot (see below if you’re not sure what a serum is). It often comes in tiny little vials, which you break to apply directly to the skin. Confusingly, these are also called ampoules — the term refers to both the packaging and the stuff inside of it. Use an ampoule if your skin needs a little extra love, like after partaking in a night of the other kind of shots. Something I was convinced was a scam for years — but it’s not. When you double-cleanse, you wash your face twice: first to remove makeup, and second to remove all the dirt/grime/subway sweat that was hanging out under your makeup. In other words, you’re using two very gentle cleanses to thoroughly and deeply clean the skin without stripping it. Traditionally, it’s often an oil cleanser followed by a milk or gel cleanser. A lighter form of a moisturizer that’s often more watery in texture and less creamy. If moisturizer is ice cream (rich and satisfying), then emulsion is like fro-yo (not quite as intense, but still satisfying). You can use an emulsion instead of a moisturizer, or use it in addition to a moisturizer for a double shot of hydration. Traditionally, in K-beauty, you use a toner to balance your skin followed by an essence to hydrate it. What’s the difference? They’re both liquids, but an essence generally has a more viscous texture. One of South Korea’s biggest exports, “K-beauty” refers to Korean beauty products. It includes makeup but is used primarily to refer to skin care. Experts often say that France used to be the global leader for beauty, but Korea has taken over. There are a few things rumored to make Korean beauty and skin care excellent. First, the Korean beauty market is extraordinarily competitive due to demand (you may have heard of the supposed ten-step K-beauty routine), so brands are forced to innovate to stand out. They often use active, unique botanical ingredients in their products, like snail mucin or bee propolis. And because of the competition, prices are often fairly reasonable, so you can buy lots of snail mucin at once. Despite the name, moisturizers don’t actually add moisture. Per dermatologist Dr. Patricia Wexler, moisturizers lock “existing moisture” in. Generally, this is the last step in your skin-care routine. You’ll often see this used in place of the word “mask” on Korean packaging. A “sleeping pack” isn’t actually a knapsack for sleeping, but a mask you sleep in (more on that below). With holes cut out for mouth and eyes, this is essentially a Halloween mask you might wear to dress as a ghost, except that it’s wet, you leave it on for 15 to 20 minutes, and then take it off to find supersoft, glowy skin. It often doubles as a self-care bragging ritual. A very, very rich moisturizer that you put on right before bed (or other low-key activities), designed to give your skin everything you would want from beauty rest. It usually goes over your moisturizer and is great to use in super-dry environments like planes. Out of everything in skin care, people say serums are the real game-changers. They have the most active ingredients — that is, the ones that actually create changes in your skin’s tone, texture, and appearance, like Vitamin C. Granted, there are active ingredients in basically every product described in this glossary. But your serum should have the most. It usually goes under your moisturizer. If it feels sort of like a fancy water on your skin, it’s a toner. Why not use regular water and save yourself some money? Because leaving water on the skin is actually dehydrating. Generally, the party line is that toner helps to balance your skin’s pH. This was more essential back in the day, when soaps were harsher on the skin; these days it’s turned into one of those things that everyone does without really knowing why, like drinking fizzy water. The important thing is that it feels nice to give you skin a little half-step extra hydration before you cover it with a serum or moisturizer. Note that sometimes brands also sell a product called an “exfoliating toner” (like P-50), which is not hydrating at all. Admittedly, this is confusing. It should be called something else. By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us. Things you buy through our links may earn Vox Media a commission                 ",
    "datetime": "2019-08-12T14:44:16.540-04:00",
    "url": "https://www.thecut.com/article/korean-beauty-skin-care-terms.html"
}