{
    "title": "Exclusive! Kim K's Makeup Artist Dishes on Her Bridal Beauty Look",
    "text": "Kim Kardashian trusts her glam squad so completely that the star didn't even feel the need to do a makeup test before her wedding to Kanye West on May 24. \"We didn't have a trial,\" the E! star's makeup artist Mario Dedivanovic tells E! News exclusively. Oh, and—this might be even more surprising—there we're no inspiration pictures either. \"No photos. Kim just let me do my thing. So, I kind of created it on the spot,\" Mario explains. \"I saw the dress, we spoke about it, and she let me do my thing.\" The results were quite stunning. \"I didn't want to make too much of a statement with her makeup. We decided to go with something natural and timeless,\" He shares. \"I wanted to go with something clean and classic—and I wanted her to look almost angelic.\" VIDEO: Kimye's official wedding photos—watch now! First step? A heavenly glow. \"I went for radiant, dewy skin.\" Next, Dedivanovic \"used very warm tones on the eyes, and a liquid eyeliner on top of the lids.\" He adds: \" I enhanced her lashes—that was a big part of her look.\" Then came time for Kim's lips, which had to be (picture) perfect for her first kiss with West as husband and wife. \"For the ceremony it was more of a creamy peachy pink lip,\" says Mario. \"For the reception, I went with more of a classic nude lip.\" And although Mario says \"Kim was very happy with her makeup\" that doesn't mean he thinks all brides should try their impromptu method. \"I think it's important to do a trial. I didn't do a trial with Kim because we have worked together so long.\" To see the road to Kim and Kanye's wedding—from Los Angeles to Paris to Italy—tune in to the new season of Keeping Up With the Kardashians, premiering Sunday June 8 on E!. PHOTOS: Kimye's Wedding Day Instagrams Your source for entertainment news, celebrities, celeb news, and ​celebrity gossip. Check out the hottest fashion, photos, movies and TV shows! © 2023 E! Entertainment Television, LLC A Division of NBCUniversal. All rights reserved. ",
    "datetime": "2014-05-28T17:49:00.000Z",
    "url": "https://www.eonline.com/news/546075/kim-kardashian-s-makeup-artist-dishes-on-her-bridal-beauty-look-we-didn-t-have-a-trial"
}