{
    "title": "EXCLUSIVE: Sephora and Memebox Collab for K-beauty Line, Kaja – WWD",
    "text": "The 47-unit line aims to meet diverse consumer needs, something specific to the American market. Beauty Editor, Finance Kaja, a new K-beauty makeup line, is launching at Sephora. The 47 stockkeeping-unit lineup is the result of a year’s worth of collaboration between San Francisco-based K-beauty company Memebox and Sephora, which made a deal last September to work together on the products. “Sephora had this white space, which was K-beauty makeup,” said Dino Ha, chief executive officer and cofounder. So, Memebox — specifically Yoon Sung Choi, vice president of brand development — spent months researching in South Korea and five months on product development to bring South Korean makeup techniques into products that were specifically tailored to U.S. shoppers. “K-beauty is known for skin care, but I don’t think we had great credibility when it comes to color,” she said. “But when you come to Korea, it’s a really exciting place for color makeup, but no one knows how to translate K-beauty color to the U.S. market, because the U.S. consumer is looking for diversity and inclusivity.” Related Articles\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tBeauty Features\n\t\n\n\n\n\t\n\t\t\tBobbi Brown on Three Years of Jones Road\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tBeauty Features\n\t\n\n\n\n\t\n\t\t\tBuilding a Lifestyle Powerhouse With David Neville and Gucci Westman Geared toward Millennials and Gen Z, Kaja focuses on bringing the interesting textures K-beauty is known for into makeup. The lineup includes multiple shades of blushes, highlighters, concealers, eye shadows, brow gels and three different lip products, priced between $14 and $24. Kaja launches online at sephora.com Sept. 18. The full line will launch in 58 Sephora doors Sept. 28, and certain products will be in 400 Sephora doors Oct. 5. The Memebox team declined to talk numbers, but industry sources estimated the line could do between $3 million and $5 million in sales during its first year. The product lineup includes: the Cheeky Stamp, a cushion-compact style blush with heart-shaped cushion stamper; Mochi Glow, a blendable, buildable cream-to-powder highlighter; Mochi Pop, a buildable cream-to-powder blush; Don’t Settle, a light, buildable concealer; Blur Drop, a moisturizing and blurring primer with a satin finish; Cat Nap, an under-eye brightener; Beauty Bento, stacked shimmer eye shadows with a gel formula; Brow Blowout, a fiber-brow gel with vitamin E; Cushy Vibe, a lip stain with water-capture technology meant to retain lip moisture; Mood Balm, a moisturizing, pH-adjusting balm, and 2’s Company, a set of nude lipstick and liner duos meant to contour lips. Some of the products were inspired by Mochi ice cream in South Korea, Choi said. “When you touch it, it melts like cream and moves around like ice cream, and when you apply it again, it’s like powder,” she said. In addition to new textures, Kaja is focused on bringing products to market quickly, something Choi says is part of the “cultural background.” Going forward, the Kaja team does not have a full lineup planned, but expects new products will come out “very often,” as requested by Sephora, Ha said. “If Sephora sees a white space they see as an opportunity, they’ll inform us and we’ll try to meet that,” Ha said.  The launch comes at a time when some eyes have turned to J-beauty, which has recently picked up as a trend in the U.S. market. But Ha says that despite J-Beauty’s entrance, K-beauty isn’t slowing down. “K-beauty will stay as a global phenomenon because of the principles of K-beauty — customer centric, having great innovation and processes to build fast beauty, as well as having different perspectives around the experience,” Ha said. “There is still huge demand from K-beauty….J-beauty is not able to fill those diversity or inclusivity [needs] when it comes to color,” Choi added. Kaja is not the first brand Memebox, which has raised more than $156 million in venture capital funding, has brought into the U.S. market. The business is also behind I Dew Care and Nooni, which are both sold at Ulta Beauty as well as on the Memebox site, but Kaja is Memebox first true collaboration with a retail partner in terms of brand development. It’s also the business’ first big move since it relaunched e-commerce on its own web site, which is allowing it to gather a significant amount of data. Sign up for beauty news straight to your inbox every day Top News Stories Alerts Straight to your Inbox. Send us a tip using our anonymous form. WWD and Women's Wear Daily are part of Penske Media Corporation. © 2023 Fairchild Publishing, LLC. All Rights Reserved. ",
    "datetime": "2018-09-13T04:01:33+00:00",
    "url": "https://wwd.com/beauty-industry-news/beauty-features/exclusive-sephora-and-memebox-collab-for-k-beauty-line-kaja-1202801145/"
}