{
    "title": "EXO \"Electric Kiss\" Music Video K-Beauty Hair and Makeup Looks | Allure",
    "text": "By Devon Abelman I have a confession to make that I'm probably only 1 percent ashamed to admit. I teared up a little bit when SM released Suho's teaser for EXO's \"Electric Kiss\" music video two weeks ago. The leader of the super famous K-pop group isn't even my bias (read: fave member), but his glittery floral makeup made me emotional. (Only my close friends are privy to who my EXO bias is.) Needless to say, when the short version of the music video unexpectedly showed up on YouTube yesterday, I was inconsolable. After I'd taken an adequate amount of time to calm down, contribute almost a hundred views to the music video's nearly 3 million, and assess the art EXO has blessed us with this week, I decided to do what I do best in these situations: identify the best beauty moments. I have no idea what exactly is happening in the \"Electric Kiss\" music video (maybe the dancing pink gorilla women will be explained in the full version), but I'm fully aware that Suho and Chen have never looked better. (No, my bias isn't Chen either.) Also, I'm convinced EXO's makeup artist is very into Instagram beauty trends. Allow these beauty moments to prove it. Obviously, my list is starting here. It should probably end here, too, but I have to spread the love. Can we dissect the details of this flowery fantasy real quick? I think EXO's makeup artist must have seen my article earlier this year about Instagram MUAs covering their faces with dried flowers. Suho's colorful take on the trend is the first time I've seen it on a guy. The flowers were even applied to his neck. Combined with the glossy gold eye shadow, I hope you can now understand why I cried all over again seeing the look return for the actual \"Electric Kiss\" music video. (I was scared for a second that the teasers were going to be a Pathcode situation.) By Aliza Kelly By Gabi Thorne By Gabi Thorne Remember when Chen's hair briefly looked orange? It must have faded to this glorious shade of rose gold that's been taking over Instagram feeds. You can color your hair a similar shade without bleach using Overtone's Rose Gold Deep Treatment or Clairol Color Crave Hair Makeup. My fingers were crossed for another \"Ko Ko Bop\"–era nail art moment from EXO's youngest member. Alas, I will settle for this lived-in liner look that may or may not have hints of pink shadow. By Aliza Kelly By Gabi Thorne By Gabi Thorne Because of the colorful flashing lights throughout Xiumin's scenes, I was convinced he was wearing holographic highlighter for a second. I think his dewy skin was just reflecting all the colors, though. I hope my skin looks as good as his when I turn 27. (I have one more year to go. C'mon, skin, you can do it.) Chanyeol finally made his solo appearance halfway through the video with my favorite hair color on him yet. The dark roots make the pastel shade look more goth than unicorn-inspired. By Aliza Kelly By Gabi Thorne By Gabi Thorne Apparently even K-pop stars are hopping onto the mermaid lash train. The singer's colored lashes go under the radar in the short \"Electric Kiss\" music video, but they were on full display in the teaser. As much as I love his rose-gold hair, he would have looked awesome with matching purple hair. The short version of \"Electric Kiss\" didn't include a closeup of Baekhyun, but I can still spiritually sense his red-and-black eye makeup. He once again cemented himself as someone I would want to switch makeup bags with. I need to know which red eye shadow he uses as much as the meaning of life. (I'm still not over his \"Ko Ko Bop\" makeup.) By Aliza Kelly By Gabi Thorne By Gabi Thorne If you're in need of short-hair inspo, let Kai guide you. His makeup for \"Electric Kiss\" was kept to dewy skin and subtle tinted lips, but I was more focused on how great his buzzed hair looked. I need D.O. to post his glass-skin skin-care routine on Twitter like everyone else has been lately as soon as he possibly can. I know he's filming a movie, but D.O., if you're reading this, I need to know every single product you use to make your skin look so clear that you can be the only member in the \"Electric Kiss\" music video not wearing makeup. You can watch \"Electric Kiss\" for yourself below to pick your own favorite beauty moments. By Aliza Kelly By Gabi Thorne By Gabi Thorne Related stories: Now watch Beyonce's makeup artist explain the story behind some of her most iconic music video looks: Follow Devon Abelman on Twitter and Instagram. By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Devon Abelman By Nicola Dall'Asen By Sarah Han By Kara Nesvig More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2017-12-06T19:18:33.880Z",
    "url": "https://www.allure.com/story/exo-electric-kiss-k-pop-beauty-looks"
}