{
    "title": "EXO-K’s ‘Overdose’ EP Enters Billboard 200 | Billboard – Billboard",
    "text": "EXO-K's 'Overdose' EP marks the the highest-charting album for male K-pop acts on the Billboard 200, surpassing BIGBANG. EXO-K is the third K-pop act to chart on the Billboard 200. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin American fans were ready to “Overdose” on the two new EPs from K-pop boy band EXO. “The 2nd Mini Album ‘Overdose'” was released in both a Korean and Chinese version by EXO subgroups EXO-K and EXO-M, respectively, and both proved addictive to U.S. audiences. EXO-K’s version of the five-track EP flies into the Billboard 200 at No. 129. The South Korea-focused outfit sold 3,000 copies of their all-Korean set, according to Nielsen SoundScan. The EP also debuts at No. 1 on Billboard’s Heatseekers Albums chart and No. 2 on the World Albums. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t05/15/2014  The China-focused subgroup EXO-M misses the Billboard 200, but the sextet’s all-Mandarin rendition of the “Overdose” EP hits No. 8 on Billboard’s Heatseekers Album chart and lands at No. 5 on the World Albums chart. EXO-K’s first-week sales surpass the chart position of fellow boy band BIGBANG, who hit No. 150 on the Billboard 200 with “Alive” in 2012. BIGBANG had sold 4,000 copies with that release. And while EXO-K can claim the highest-charting set for male Korean acts, the guys still fall behind two of K-pop’s superwomen groups. Both 2NE1 and Girls’ Generation boast higher chart positions and bigger first-week sales with their “Crush” album and “Mr.Mr.” EP, respectively. “Crush” hit No. 60 while “Mr.Mr.” came in at No. 110 on the Billboard 200 this past March. As the third K-pop act to hit the Billboard 200 album chart this year, 2014 looks similar to 2012 when BIGBANG, BIGBANG’s leader G-Dragon and the Girls’ Generation splinter group Girls’ Generation – TTS all made bows on the Billboard 200. Meanwhile, EXO-K also boasts their best showing on the K-Pop Hot 100 with “Overdose” debuting at No. 2 this week. All songs from EXO-K’s “Overdose” EP chart inside the Top 25. As well, EXO-K’s “Overdose” is No. 2 on Billboard’s World Digital Songs making it the biggest-selling K-pop song in America for the week.  Daily newsletters straight to your inbox Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2014-05-15T22:45:11+00:00",
    "url": "https://www.billboard.com/pro/exo-k-overdose-ep-enters-billboard-200/"
}