{
    "title": "Exploring the K-Beauty trend with Nuca | Wallpaper",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works.  Sovo, a handmade shoe firm hailing from Korea has joined forces with brand consulting company Eggplant Factory, in a perhaps unexpected union, pooling together their efforts to create Nuca, a new cosmetics brand.\n\nThe name 'nuca' was taken from the Spanish word for nape, on which the brand plays metaphorically to signify a woman’s sensuality. With hydrating masks and makeup, we’re particularly taking note of the two bestsellers: the Gentle Moisturising Pink Cushion, a dewy CC cream that is infused with anti-ageing hyaluronic acid and cherry blossom extract, while in its Hydro Mega Waterfall Cream (below), beautifying pearl powder extract provides 24-hour hydration.  Hydro Mega Waterfall Cream Contained in contemporary pastel-hued pots, the cosmetics have been wrapped in pretty matte packaging, evoking a futuristic feel. Combined with its modern attitude and drive to encourage women to express their own beauty without feeling the pressure to conform to social norms, Nuca is quickly becoming the latest rage amongst K-beauty fans.  Hyper Stella Lotus Eyecream  All Strike Total Solution  Hydro Superjelly Mask INFORMATION Fore more information, visit the Nuca website Receive our daily digest of inspiration, escapism and design stories from around the world direct to your inbox In New South Wales, Rama Architects have created a modern family home that opens up to spectacular bay views, with meticulously crafted interiors and a design that’s immersed in the surrounding vegetation By Jonathan Bell\n\nPublished 23 October 23 We’ve sifted through the most recent releases from across the world of tech to select ten items that’ll enhance the remote working experience By Jonathan Bell\n\nPublished 23 October 23 Georg Baselitz: Sculptures 2011–2015 is the artist’s first solo show at London’s Serpentine By Daven Wu\n\nPublished 23 October 23 Wallpaper* is part of Future plc, an international media group and leading digital publisher.  Visit our corporate site.\n©\nFuture Publishing Limited Quay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. ",
    "datetime": "2017-01-23T11:26:42Z",
    "url": "https://www.wallpaper.com/lifestyle/sovo-korean-shoemaker-launches-nuca-beauty-brand"
}