{
    "title": "Fantastic Beasts 2 Star Claudia Kim Has a Serious Knack for K-Beauty | Vogue",
    "text": "To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. By Kate Branch At least 14 times a day, the Korean actress Claudia Kim applies toner to her face. One round of seven strokes in the morning; another before bed; and pretty much whenever she can steal a few minutes to swipe, pat, repeat. That’s why Kim carries a travel-size container of the soothing, oil-controlling formula from the K-beauty brand Dermatory in a black duffel bag with her wherever she goes, she explains on a rainy fall day in Manhattan’s Koreatown. The remaining contents include specialty cotton pads from Japan, sunblock from Korea, and at least two masks (a shea butter infusion for her face and a cooling, herbal iteration for her feet). A mini blue lighter rounds out the self-proclaimed K-beauty junkie’s “essentials,” but more on this in a minute. A former model, Kim returns to the big screen in Fantastic Beasts: The Crimes of Grindelwald, J.K. Row­ling’s Harry Potter follow-up. For those unfamiliar with Rowling’s world of witchcraft and wizardry, Kim plays Nagini, a doomed, circus-performing snake-woman who carries a blood curse that will eventually turn her into a beast permanently. “I’m Nagini!” she proclaims with delight as we stroll the aisles of Besfren Beauty, a small, brightly lit K-beauty boutique, where Kim has agreed to be my guide for the day. It’s only the second time she has spoken about the role in public, although her fame with Hogwarts-heads precedes her. (Beside a wall of brightly colored sheet masks, a clerk recognizes the striking, porcelain-skinned 33-year-old and bows his head in appreciation of her next role.) Known for their colorful—and cute!—packaging and science-backed formulas, K- and J-beauty products have become a phenomenon in the West over the past few years. But for Kim, who grew up with her mother’s “beauty fridge” stocked with exfoliating acid peels, hydrating essences, and vitamin C facial masks (“It’s like a wine fridge but for beauty products; all Korean women have them”), good skin is more of a birthright than a trend. “My mother made me take 20 private classes with an expert before I was allowed to wear any makeup on my face,” she reveals. This early education has paid dividends now that her job demands a camera-ready complexion, no matter the early-morning call times or the shoot locations. (Kim uses only bottled water on her face, she says. “You don’t want to break out in a different country where you don’t know what the pH levels are.”) At L’ovue, a big, airy space just a block away, Kim hurries over to a row of waterproof mascaras and selects her favorite by the Japanese label Kiss Me. “Korean and Japanese actors swear by it,” she says of the thickening-and-lengthening formula that she gifted Scarlett Johansson on the set of 2015’s Avengers: Age of Ultron, her Hollywood debut. K-beauty gifting is kind of Kim’s thing. “It’s my love language,” she quips, which should benefit her Beasts costars, including Zoë Kravitz, Ezra Miller, and Eddie Redmayne. She twists open the fuchsia tube of mascara and comes close enough to my face that I can smell her fruit-flavored lip gloss. Now, back to that lighter. “Try to stay still,” Kim tells me as she chars the end of a wooden cotton swab and, with surgeon-like precision, drags the burnt-black tip of the tool along the outer lashes of my left eye, causing the roots to curl upwards. “I’m no pro,” she says, turning my face toward the mirrored wall after a finishing coat of black mascara, “but that’s magic.” By Kiana Murden By Kiana Murden By Lauren Mechling By Violeta Valdés By Kiana Murden By Lauren Valenti More from Vogue See More Stories © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices CN Fashion & Beauty ",
    "datetime": "2018-11-17T12:00:00.000Z",
    "url": "https://www.vogue.com/article/fantastic-beasts-2-claudia-kim-k-j-beauty-face-masks-skin-koreatown-manhattan"
}