{
    "title": "Fashion News: Filippa K launches garment care products — NORDIC STYLE MAG",
    "text": " Filippa K - A/W 2014 The Swedish master of simplicity, Filippa K, is launching their newest product line focusing on garment care. Their collections commonly include fine textiles, like wool and silk, that require special attention when practicing laundry.  As most of us know, this can be a burden. I personally admire Filippa K's action to step up, especially taking into account that the engagement between the customers and the fashion brands more or less stops after purchasing. But this thought of continuing to pay attention to the garments and its wearer is a nice touch. Filippa K's garment care products are categorised into two parts: fine wash and fine care. The ingredients include aloe vera and lecithin from soy beans. The Filippa K Fine Wash has been developed with a strong focus on your skin. The products were tested for allergies and are gentle on your skin. According to the Swedish brand, since the fine textiles require hand washing, the same special attention should be placed on the formula used with it as well. Unlike the traditional fabric softener, the Filippa K Fabric Care, washes out dirt, lime scale and detergent residues from the textile. The only thing left, is the truly soft and clean garment. All garment care products are ecological and will be available in the selected stores throughout Europe from next week.   Image Courtesy of Filippa K about us & contact - instagram facebook twitter - listen to ‘the nordic podcast’ - © nordic style magazine 2022 designed by taka með stúdíó about us & contact   |   instagram facebook twitter   |   listen to ‘the nordic podcast’ © nordic style magazine 2022   |   designed by taka með stúdíó ",
    "datetime": null,
    "url": "https://www.nordicstylemag.com/blog/2014/04/fashion-news-filippa-k-launches-garment-care-products"
}