{
    "title": "Fenty Beauty Launches Dirty Thirty Trophy Wife - Rihanna's 30th Birthday",
    "text": "Every item on this page was chosen by an ELLE editor. We may earn commission on some of the items you choose to buy. In honor of Rihanna's 30th birthday on February 20, Fenty Beauty released a new limited edition design for one of its most popular launches: Trophy Wife highlighter. The super pigmented, metallic gold cream-to-powder was an instant hit when the brand debuted back in September 2017. Now, its packaging has a celebratory new look. The Fenty Beauty Killawatt: Dirty Thirty highlighter ($34) now comes in a gold box that reads \"Dirty Thirty\" and the product pan is engraved with \"XXX.\" Currently, it's only available on Fenty Beauty's website. Rihanna even got gifted her version of the Dirty Thirty highlighter, but hers was naturally covered in Swarovski crystals. If you haven't tried out Trophy Wife yet (where have you been?), now's your chance. Allow the queen herself to show you just how unreal the golden glow looks like: The Rihanna navy doesn't play, so jump on this collectible before it sells out. Fenty Beauty Killawatt: Dirty Thirty Limited Edition Freestyle Highlighter, $34; fentybeauty.com SHOP Kristina Rodulfo is the Beauty Director of Women's Health—she oversees beauty coverage across print and digital and is an expert in product testing, identifying trends, and exploring the intersections of beauty, wellness, and culture. Prior to Women's Health, the Filipino-American, NYC native and NYU alumna was at ELLE.com for four years. As Senior Beauty Editor, she reported and co-produced the Webby Award-nominated documentary Beat: How Drag Queens Shaped the Beauty Industry and hosted the millions-viewed video series \"Beauty Haul.\" She can never decide whether or not to get bangs, feels naked without winged eyeliner, and will never shut up about running the NYC Marathon. Simple Nail Designs for Your Manicure Mood Board 14 Vanilla Perfumes That Smell Absolutely Amazing 13 Best Japanese Skin Care Products to Shop For Breast Cancer, 40 Is the New 50 Meet YSL Beauty’s Most Unconventional Scent Yet Amazon Is Having a Major Beauty Sale Right Now Why Matrix Could Be the Next Best Skin Treatment The Best Neutral Nail Colors for Every Skin Tone Claudia Sulewski Launches CYKLAR Beyoncé Is Finally Releasing a Perfume A No-Damage Routine for Colored Hair First Class Beauty 2023 A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2018-02-21T13:48:00Z",
    "url": "https://www.elle.com/beauty/a18541950/fenty-beauty-trophy-wife-dirty-thirty-rihanna-birthday/"
}