{
    "title": "Fenty Skin Is Finally Here—Here’s Everything You Need to Know, According to Rihanna Herself | Vogue",
    "text": "To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. By Lauren Valenti All products featured on Vogue are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission. Rihanna's complexion shines brighter than most. It's just a fact! So it's only natural that fans would anticipate the launch of the Barbadian singer's new skin-care brand, Fenty Skin, with the same fervor as her long-awaited ninth album. (We are ready for that drop when you are, RiRi!) Just as she did with her disruptive makeup range, Rihanna is meeting the skin-care needs of individuals of all skin tones, types, and concerns, encompassing pillars of inclusivity and accessibility for all. \"Skin is skin,\" says Rihanna of making the line gender neutral, having tapped a wide range of stars for the campaign including A$AP Rocky, Halima Aden, and Paloma Elsesser. \"Everybody has skin, and everybody should take care of it, so I never approached skincare or making this line from a gender standpoint. I didn't want anyone to feel excluded or be excluded.\" With ease and practicality top of mind, Rihanna chose to launch Fenty Skin with a trio of multi-tasking 2-in-1 basics: A makeup-removing cleanser, toning serum, and a moisturizer-sunscreen. \"Skin-care is self-care,\" she explains. \"I am trying to get people into a ritual. Something that's really simple—three steps. We start there because skin care can get really complicated. It can get confusing, so I wanted to start with something that would be easy to understand so that people can get right to it.\" While Fenty Skin focuses on streamlining skin-care in sleek, refillable pink packaging, as well as incorporating robust ingredients such as vitamin C-rich Barbados cherry, hyaluronic acid, and niacinamide into each of the products, another priority was making it a sensorial experience. Infusing fragrance into skincare can be a polarizing choice, but it was important to Rihanna that her products tap into her tropical olfactory memories with warm, clean scents nodding to the line's cherry, coconut, and desert melon ingredients (synthetic scents making up no more than 1% of the formulas). \"It's a huge part of the experience,\" she says. Here, a breakdown of Fenty Skin's debut trio, with musings from beauty's resident Bad Gal herself. The Total Cleans’r Remove-It-All Cleanser  Fenty Skin Total Cleans’r Remove-It-All Cleanser Shop Now Imparting a lush lather with the cleansing powers of a micellar water, Fenty Skin's creamy makeup remover, made with Barbados cherry, green tea, fig, and quince, melts off every last bit of dirt, oil, and makeup without stripping skin dry. \"As an Island girl, I've had had a lot of access to key ingredients that work really well for your skin,\" explains Rihanna. \"I might've just thought [of it as] a fruit I was eating, but these things that we have access to everyday implement great results on your skin. A lot of them are personal to me, but I know that these ingredients work, and so I try to pack as many of those into these products as much as possible.\" The Fat Water Pore-Refining Toner Serum  Fenty Skin Fat Water Pore-Refining Toner Serum Shop Now A juicy toner-serum, Fat Water helps diminish dark spots and minimize the appearance of pores while supplying an extra layer of hydration for optimal dew and bounce. \"When I started to find out the benefits as I got older, I would go back home and I would literally just have a cold and the first thing that you'll drink when you have a cold is a Barbados cherry juice, because it has so much Vitamin C in it, more than even an orange,\" explains Rihanna of her connection to the healing and brightening hero ingredient. \"I wanted to implement that into skincare because I know that Vitamin C is a key part of good skin.\" The Hydra Vizor Invisible Moisturizer-Sunscreen  Fenty Skin Hydra Vizor Invisible Moisturizer Broad Spectrum SPF 30 Sunscreen Shop Now With Hydra Vizor, RiRi not only sought to make skin bright and hydrated, but keep it protected from the sun's harmful UV rays. \"The biggest misconception with SPF is that Black people don't need it,\" she explains. \"As a woman of color, I'm here to say that's a lie. We need it, and we need it every day. I hope to educate the melanin community, as much as everybody else, that SPF is for everyone.\" The lightweight, pale pink-hued elixir won’t come off as ashy on darker skin tones, melts right into skin, and is made with coral-reef friendly ingredients. By signing up you agree to our User Agreement and Privacy Policy & Cookie Statement. By José Criales-Unzueta By Hannah Jackson By Daniel Rodgers By Alice Cary By Hannah Jackson By Tish Weinstock More from Vogue See More Stories © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices CN Fashion & Beauty ",
    "datetime": "2020-07-30T22:58:43.817Z",
    "url": "https://www.vogue.com/article/fenty-skin-rihanna-interview"
}