{
    "title": "Filippa K: \"Fashion where sustainability is the guide to growth\" — NORDIC STYLE MAG",
    "text": "This week we were reached by great news. Filippa K launched three new sustainability concepts this Thursday to contribute to a fashion consumption that takes the nature into consideration. The new concepts live up to the vision of the brand – fashion where sustainability is the guide to growth.One of the concepts is named “Collect” and is a way for Filippa K to reuse their old garments. You can now return your old clothing from Filippa K to your local store in Denmark and Sweden, not only will you help the nature but you’ll get 15% off your next purchase. The garments collected will be sold in Filippa K’s second hand store or given to collaborating charity organizations. In Denmark the donations will go to the Red Cross and in Sweden they’ll go to Stadsmissionen.\"Filippa K stands for long lasting simplicity. This means that we believe that our garments are long lasting in both design and quality. \"The second sustainability concept is called \"Lease\" and aims to contribute to a more sustainable fashion consumption by letting customers rent pieces for special occasions. Filippa K will choose new favorites for the leasing wardrobe every season and the pieces are offered for 20% of retail price for a four day lease. The concept has been launched for both men and women in three stores, two in Stockholm and one in Uppsala.\"This is an alternative way of looking great while creating a minimal footprint.\"The third concept is the \"Front Runners\" collection with three pieces made of 100% renewable and natural Tencel. Every part of the process from design choices and production to the end of the garments' life has been carefully thought through. Filippa K has also come up with twelve criteria that must be fulfilled by every future garment of the Front Runners collections. Read more about the criteria and see the collection here.\"We are devoted to four R:s – Reducing, Repairing, Reusing and Recycling.\"Picture courtesy of Filippa K about us & contact - instagram facebook twitter - listen to ‘the nordic podcast’ - © nordic style magazine 2022 designed by taka með stúdíó about us & contact   |   instagram facebook twitter   |   listen to ‘the nordic podcast’ © nordic style magazine 2022   |   designed by taka með stúdíó ",
    "datetime": null,
    "url": "https://www.nordicstylemag.com/blog/2015/02/filippa-k-fashion-sustainability-guide-growth"
}