{
    "title": "Find Out Who Won Miss Teen USA! ",
    "text": "There is a new Miss Teen USA in town! Miss South Carolina K. Lee Graham wowed the judges with her beauty, charisma and intelligence at Saturday night's annual beauty pageant. \"I can't even talk right now. This is literally a dream come true,\" Graham said seconds after earning the coveted sash. \"Thank you for supporting me. We did it!\" For almost two hours, Graham and her fellow contestants were put through a tricky Q&A session, the famous bikini catwalk and a competition that can only be described as cutthroat. At the beginning of the pageant, held at the Atlantis Resort in the Bahamas, only 15 of the 51 contestants were asked to move forward into the semi-finals. PHOTOS: See the Miss Teen USA semi-finalists in bikinis Those lucky enough to move forward competed in the bikini portion where another 10(!) were later cut! Miss California, South Carolina, New Jersey, Pennsylvania and Mississippi were the final five ladies who moved on to the always entertaining Q&A portion. Although nobody stumbled and made us cringe, some ladies definitely had some memorable answers. When asked where she would want to go if she was ever invisible, Miss California promptly answered the White House. Her reason? She is a huge Scandal fan, obviously. Miss Pennsylvania was strictly against parents serving high school kids alcohol at home after prom. \"You should follow the law,\" she declared. \"I don't think that's okay.\" Finally, Miss New Jersey thought beauty pageants were so wonderful that every girl should be a part of one. \"I think every woman should do one pageant because it's an amazing experience,\" she told the audience. In the end, the judges couldn't resist the charm of Miss South Carolina. But don't feel bad, Miss Mississippi. As the runner-up, you will be next in line take over if for any reason Graham is unable to fulfill the responsibilities that come with the title. As we know from previous pageants, anything is possible. PHOTOS: All the contestants who competed in 2014 Miss Teen USA Your source for entertainment news, celebrities, celeb news, and ​celebrity gossip. Check out the hottest fashion, photos, movies and TV shows! © 2023 E! Entertainment Television, LLC A Division of NBCUniversal. All rights reserved. ",
    "datetime": "2014-08-03T02:24:00.000Z",
    "url": "https://www.eonline.com/news/565642/miss-south-carolina-k-lee-graham-crowned-miss-teen-usa-2014"
}