{
    "title": "First korean beauty manufacturer sales agency and importer set to serve booming demand in the UAE",
    "text": "Mamoso K-beauty is the first Korean beauty manufacturer sales agency and importer of popular Korean cosmetics brands based in the UAE Dubai, United Arab Emirates - Mamoso K-beauty, the first Korean manufacturer sales agency and importer of popular Korean cosmetic brands based in the UAE, is poised to give the thriving Korean Beauty (KBeauty) segment a boost. The beauty market in the Middle East was valued at $10.2B in 2019 and is projected to reach $13.9B by 2027, growing at a CAGR of 9.0% from 2021 to 2027, according to Allied Market Research. (1) Partnering with some of the most loved and trusted Korean beauty manufacturers including CKD and Vivozon, Korea’s largest healthcare companies, with brands such as O!GETi and Tinazana among others, the company aims to bridge the gap between manufacturers, wholesalers, and distributors in the region. The development is expected to reduce costs for wholesalers and distributors, as well as provide instant access to valuable Kbeauty industry knowledge and expertise. With all supplies coming directly from South Korea to ensure authenticity, companies can now benefit from selling some of the most coveted and viral KBeauty products. \"As the first Korean manufacturer sales agency and importer of KBeauty products in the UAE, we are filling the gap in the market for trustworthy sources of authentic KBeauty products produced and shipped directly from South Korea. Also, due to the high margins and rising demand, the KBeauty market is becoming more and more attractive for wholesalers and distributors. Hence, to meet this, we plan to expand our operations; and explore opportunities for business cooperation. This includes retail spaces in shopping malls and franchises.\" said serial entrepreneur EJ Pang, Founder of Mamoso K-beauty. EJ Pang has almost two decades of experience in the retail industry in the UAE and GCC markets. Mamoso KBeauty, whose clientele includes JD.com, China’s largest retailer and leading e-commerce platform, is prepared to be a prime partner for businesses in the Middle East's flourishing market. Korean Institute of Halal Industry (KIHI) figures indicate exports to Organisation of Islamic Cooperation (OIC) countries grew by 14% in 2020 to $308M and 28% in 2021 to $395M, cumulatively reflecting a sizable increase of 42% in two years. In 2020 imports of Korean cosmetics to UAE and Saudi Arabia grew to 62.7% and 90.1%, respectively from 2019. In 2021, the UAE imported $43M, Saudi Arabia $19M, and Kuwait $13M. Non-Arab Middle Eastern countries Iran and Turkey account for 7% of exports, with Turkey importing $27M last year. Dubai, a leading driver of Kbeauty's growth in the Middle East, operates as a significant hub for sales and re-exports of the products. (2) With Middle East consumers having one of the largest per capita expenditures on beauty worldwide and the growing preference for organic, clean, or green beauty, Kbeauty is poised to thrive well into the future with its high-quality, all-natural ingredients, innovative formulations, and emphasis on wellness and health. Products are also halal with ingredients that come from plants, aquatic organisms, minerals, and compounds. Kbeauty is further bolstered by the unabated rise of “Hallyu,” or the \"Korean Wave'' used to refer to the spectacular rise of Korean culture promoted via KPop, Kdramas, and celebrities. EJ Pang adds, \"With honest ingredients and honest prices, the products we offer are based on the Korean beauty concept of maintaining the skin's health, hydration, and radiance using natural ingredients instead of chemical-based products. We offer carefully chosen products that meet the needs of individuals in the UAE and the Middle East.\" Recently, Mamoso KBeauty has also been appointed by Dobu Mask and All International as the official distributor of BTS masks and other merchandise in the region. With the iconic Korean group being one of the world's most popular bands and top-selling artists in recent years, with a dedicated massive fanbase around the world, the demand for the group's merchandise is expected to grow tremendously. -Ends- About Mamoso K-Beauty Mamoso K-beauty is the first Korean manufacturer sales agency, and importer of popular Korean cosmetics brands based in the UAE. The company represents authentic KBeauty products manufactured with 100% all-natural ingredients using innovative formulations. Mamoso KBeauty is also the official representative for BTS masks and other merchandise in the region. For more information, please visit: https://kbeauty.ae/ © Press Release 2023 Disclaimer: The contents of this press release was provided from an external third party provider. This website is not responsible for, and does not control, such external content. This content is provided on an “as is” and “as available” basis and has not been edited in any way. Neither this website nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this press release. The press release is provided for informational purposes only. The content does not provide tax, legal or investment advice or opinion regarding the suitability, value or profitability of any particular security, portfolio or investment strategy. Neither this website nor our affiliates shall be liable for any errors or inaccuracies in the content, or for any actions taken by you in reliance thereon. You expressly agree that your use of the information within this article is at your sole risk. To the fullest extent permitted by applicable law, this website, its parent company, its subsidiaries, its affiliates and the respective shareholders, directors, officers, employees, agents, advertisers, content providers and licensors will not be liable (jointly or severally) to you for any direct, indirect, consequential, special, incidental, punitive or exemplary damages, including without limitation, lost profits, lost savings and lost revenues, whether in negligence, tort, contract or any other theory of liability, even if the parties have been advised of the possibility or could have foreseen any such damages. ",
    "datetime": null,
    "url": "https://www.zawya.com/en/press-release/companies-news/first-korean-beauty-manufacturer-sales-agency-and-importer-set-to-serve-booming-demand-in-the-uae-yvgympi2"
}