{
    "title": "First there was K-pop, K-beauty and K-drama, now it’s canine as Lotte Duty Free provides for pet pamperers : The Moodie Davitt Report -The Moodie Davitt Report          ",
    "text": "SOUTH KOREA. Lotte Duty Free has tapped into a rocketing consumer trend towards owning pets and treating them as family by partnering with premium dog hotel Bowraum to help canine-loving customers travel stress-free and shop duty free. Bowraum is a dog-only hotel that provides total care services such as education, play and beauty pampering to dogs while their owners are away. The ‘Pet+Family’ phenomenon now embraces more than 15 million people, Lotte Duty Free said. A quarter of South Korean people have pets, it noted. Any Lotte Internet Duty Free member can get a -20% discount coupon on Bowraum rates after logging in. The affiliate event will run for one year from today (27 September) and discount coupons can be redeemed within a year from the date of issue.  In addition, Bowraum VIP customers can receive up to US$140 in affiliate money depending on the purchase amount when using Lotte Internet Duty Free. Lotte Duty Free is introducing clothing, bath products, food and nutrition through pet brands such as Seaspan, Monshu and Genie Pet, reflecting the needs of pet-loving customers. The travel retailer plans to expand its partnership with further pet brands. Head of Lotte Duty Free Channel Operations Team Kang Byung-kook said, “We hope this promotion will help Lotte Duty Free customers to leave their pets with peace of mind and enjoy their travels.” Worried about your dog pining for you while you are travelling? Have no fear, Lotte Duty Free and Bowraum are here. {Photo: Leading COL – canine on leash – Mickali Whispering Wind} Follow The Moodie Davitt Report on Linkedin:  Share this article: Lotte Duty Free responds in creative fashion to a slower than anticipated recovery of inbound tourism in the wake of a widespread economic downturn and rising prices. Read More LDF House is a space designed to provide customers with a differentiated experience and present what Lotte Duty Free called “a new paradigm” in duty free shopping. Read More Lotte Duty Free said that this certification is testament to their comprehensive process in identifying and preventing compliance risks in advance. Read More The beauty brand’s fragrance and cosmetic lines feature natural ingredients and are developed in collaboration with dermatologists and paediatricians. Read More ",
    "datetime": "2021-09-27T03:33:33+00:00",
    "url": "https://www.moodiedavittreport.com/first-there-was-k-pop-k-beauty-and-k-drama-now-its-canine-as-lotte-duty-free-provides-for-pet-pamperers/"
}