{
    "title": "Five of the most shocking K-beauty ingredients | Dazed",
    "text": "Ever since K-beauty started to penetrate the Western market, “weird” ingredients in Korean skincare products have been making the headlines. Naturally, snail slime, bee venom or donkey milk are not necessarily something that non-Koreans feel like putting on their faces and ingredients such as pig collagen or placenta have caused some controversy, but some of these K-beauty gems and their impressive benefits will make you get over your skincare xenophobia. Korean skincare brands like Cosrx or Benton have become well known for using snail mucin (or snail secretion filtrate) in their products. Cosrx’s Advanced Snail 96 Mucin Power Essence and Benton’s Snail Bee High Content Essence are packed with a highly concentrated snail secretion filtrate, which as well as moisturising your skin also has a skin repairing effect, which makes it the perfect weapon to fight against acne scars and sun damage. Snail slime has become one of the staple Korean skincare ingredients and there is even a K-beauty blog named after it. Ordinarily, bee venom wouldn’t conjure very pleasant associations in our minds. In Korean skincare, however, it is one of the go-to ingredients because it encourages cell regeneration and boosts the formation of collagen in your skin by basically fooling your skin into thinking it has been stung by a bee. In other words, bee venom can be called a natural alternative to botox. One of the most popular bee venom products is Mizon’s Bee Venom Calming Fresh Cream or Benton’s skincare line combining bee venom and snail slime. Donkey milk is an ingredient that replenishes your skin with protein and fatty acids, the loss of which is one of the biggest causes of skin ageing. It contains five times more vitamin C than cow’s milk but has fewer allergy triggers, which makes it suitable even for sensitive skin. It’s so good that apparently, Cleopatra used to take baths in the stuff to keep her skin supple. Some contemporary alternatives include Freeset’s Donkey Milk Skin Gel Mask Pack or Heimish’s All Cleansing Balm, which doubles as a powerful make-up remover. We’ve all been there - waking up after a night out drinking with your skin simply hating you. But one of the most popular K-beauty brands TONYMOLY has found a way to make alcohol your skin’s friend again - by turning makgeolli, traditional Korean rice wine, into a sheet mask that moisturises as well as brightens your skin. Other benefits of soaking your face in makgeolli include skin regeneration and recovering skin elasticity. There have even been DIY tutorials popping up on the internet, the moral of the story being that alcohol damage can be fought by - more alcohol. By having a similar composition to the collagen human skin naturally produces, pig collagen is an ingredient that promises to help boost skin elasticity and smooth fine lines. While some praise the elasticity and moisture boost pig collagen gives to your skin, scientists have argued that applying collagen topically only provides temporary results because collagen cells are too big to actually penetrate the skin and have longterm results. You can try for yourself with Holika Holika’s Pig-Collagen Jelly Pack or TONYMOLY’s Pig Collagen Hydrogel Mask if you’re on a tight budget. Pioneered by Korean cosmetic company, Mizon, thanks to their now famous Placenta-45 Serum (the 45 stands for the 45% placenta concentration), placenta is probably the most shocking ingredient to take the K-beauty scene by storm. It has been said that mammal placenta can provide substantial nutrition to your skin - which makes sense because that’s its original purpose. However, there has not been enough scientific enquiry into its long-term effects, including potential side effects of the hormones it contains. Some people remain sceptical both about how effective it actually is and whether it is safe to add it to your daily skincare routine. Korean beauty companies are at the forefront of cutting edge of skincare, continuously bringing unconventional ingredients to the Western market and fearing no controversy - perhaps even lavishing it. That being said, one of the biggest lessons Korean women can teach us about how to take care of our skin is to do your research before you jump on the next “weird” hot thing. Depending on your skin type and concerns, some skincare ingredients can actually do more harm than good. As a self-professed K-beauty nerd, researching whether a certain product should go on my skin or not and getting to know my skin better is part of the fun… and I’ve definitely started loving the feeling of patting slimy snail mucin onto my face after seeing the results. ",
    "datetime": "2018-12-06T10:23:00+00:00",
    "url": "https://www.dazeddigital.com/beauty/article/42449/1/five-shocking-k-beauty-ingredients"
}