{
    "title": "France: Asian-made beauty products boost prestige skincare sales - Premium Beauty News",
    "text": "Face care masks - one of the Asia’s latest innovations - continue to rise in the skincare segment with sales growing by 8% between May 2017 and April 2018. Photo : © Dean Drobot / shutterstock.com Cushions, BB creams, fabric or rubber masks: for some years now, the K-beauty has invaded the daily beauty rituals of French women, attracting more and more followers every year. Actually, the success of Asian-made beauty products is having a positive impact on the market as sales of prestige face care beauty products have increased by 1% year-on-year on over the period between May 2017 and April 2018, announced The NPD Group on July 4th. According to the market research company, this growth can be partly attributed to the popularity of Korean-inspired beauty products (K-beauty) on the French market. Unsurprisingly, face care masks - one of the Asia’s latest innovations - continue to rise in the skincare segment with sales growing by 8% between May 2017 and April 2018 compared to the same period last year. Beyond the traditional cream masks, new product proposals inspired from Asia are driving growth: fabric and paper masks and skincare patches are the best performers with a 78% increase in sales, while sales of clay or mud masks increased by 43%. As far as gel masks are concerned, sales grew by 14%, over the same périod. At the same time, sales of BB cream have decreased by 10% while those of CC creams remained flat. According to The NPD Group, these textures that sparkled the popularity of K-beauty in France, have been losing their popularity over the years. However, other innovations have taken over, including \"cushion\" foundations, with sales increasing by 13% during the period. Sales of lotions and tonics, which are key elements of the Korean beauty routine, jumped by 12% in value. \"Consumers have quickly adopted the new gestures inspired from Asia beauty routines and this is good news! The rise of K-beauty in recent years has broadened skin care routines in France and popularized new textures by diversifying product lines through masks, serums and cushions. Social networks, prestige brands and brands have also supported this trend. Beauty retailers such as Sephora and FeelUnique have recently launched a section dedicated to Korean products,\" explains Mathilde Lion, Beauty Expert Europe at The NPD Group. Major Japanese brands have seized the opportunity of the Asian wave sparkled by the K-beauty to give a new impetus to their products in Europe. While Shiseido, Shu Uemura, SK-II, Sensai or Kanebo have been established in the French beauty market for a long time, brands with a wider audience - such as Uniqlo and Muji - have helped to increase the visibility of the Japanese culture. More recently, Japanese-influenced beauty trends have been buzzing on social media, particularly on Instagram, YouTube and among beauty bloggers and influencers. \"The J-beauty trend perfectly fits with new consumer expectations such as simplicity, naturalness and holistic beauty. With a focus on ingredients and long-term care rather than on more ephemeral products, the J-Beauty offers a successful mix of tradition and innovation. In the coming years, we anticipate the entry of more niche Japanese brands into the French beauty market,\" concludes Mathilde Lion. According to The NPD Group, the interest of French women in Asian beauty routines is here to stay! The annual premium and luxury packaging trade show broke its attendance record for its 2023 edition, which was held... The expression “Beauty Tech & Skincare” now marks the entry of tech into the beauty sector. Several major brands offer to decode the... The quest for youth has existed for centuries, despite the inevitable effects of time on the body. Research shows that skin aging in... The quest for “in-and-out” beauty is gradually gaining ground in Europe, North America, and Brazil. This form of holistic beauty is meant... © 2023 Premium Beauty Media ",
    "datetime": null,
    "url": "https://www.premiumbeautynews.com/en/france-asian-made-beauty-products,13663"
}