{
    "title": "French Manicure Could Be American - American Make-up Artist Says He Created The French Manicure",
    "text": "Everything we thought we knew about nails is a lie. Brace yourselves: The French manicure may not be so French after-all. Or at least, that's what one Hollywood make-up artist named Jeff Pink is claiming. According to WWD, the American stylist is asserting he's the one who came up with the white tip-nude base combo in the seventies. Pink then says he single-handedly brought the mani to Paree, where the tres chic models walking the catwalks quickly flipped for it. He even trademarked the term The Original French manicure after creating his own nail polish lined called Orly International in 1975. But there are other nail-polish-know-it-alls who argue that the French was actually around about 40 years before Pink claimed to have come up with it. For instance, the BBC suggests that the early French manicure was, in fact, invented in France by beauty legend Max Factor, for the fashionable ladies of Paris in the 1930s. Apparently, they wanted a clean look because their hands were over-moisturized (or something?). Ironically enough, women who are preferential to the sophisticated-sounding mani these days are no longer French fashionistas; instead, it's more common to find French manis on the hard acrylics of little ladies heading to the prom. C'est la vie. Want more stories from Carson? Follow her on Twitter. Photo Credit: Getty Images FYI, Your Eyes Need A Hydrating Eye Cream (!!) Every $$$ Le Labo Perfume, Ranked Your 101 Guide to Laser Treatments for Acne Scars 19 Genius Serums That'll Smooth and Firm Your Skin FYI: Amazon Is Having a Major Beauty Sale RN Black Friday Dyson Airwrap Deals? Yes, Pls! You Can’t Miss These Black Friday Beauty Sales Simply the Best Shampoos for Thinning Hair, Period I Tested All the Viral Sol De Janeiro Perfumes These Bath Gift Sets = Immediate R&R Alert: I Found Drunk Elephant Bronzing Drop Dupes 25 Face Serums For Supremely Glowy Skin A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2013-04-16T20:25:00Z",
    "url": "https://www.cosmopolitan.com/style-beauty/beauty/news/a12468/french-manicure-actually-american/"
}