{
    "title": "French consumers top European poll of demand for Korean beauty",
    "text": "Or wait... Headlines Brand Innovation Formulation & Science Packaging & Design Business & Financial Market Trends Regulation & Safety Promotional Features Site Archive Multimedia Hot Topics Clean & Ethical Beauty Brexit COVID-19 Protection and Microbiome Active beauty and nutricosmetics Animal Testing Sustainability and circular beauty Beauty tech and digital Financial focus Naturals and organics Site Archive Multimedia Resources Type of resources Events All Events Shows & Conferences Online Events Editorial Webinars Events  16-Jun-2016\n                            - Last updated on\n                                17-Jun-2016 at 11:30 GMT Related tags\nEurope Korean cosmetics imports in France in 2015 amounted to €17.41 million – making up 35 per cent of all K-beauty imports across the European Union. BB creams, sheet masks and cushion compacts featuring cutting-edge ingredients in quirky packages have been gaining favour in France in recent years even though Paris is the home of advanced beauty development. Cosmetics store chain giants like Sephora have been snapping up Korean beauty ranges with the likes of Tony Moly opening outlets in 825 of its stores in 14 European countries in May alone. Taking over​ In fact, business is so good in France that these Asia Pacific headquartered players are setting up shop in the capital and teaming up with the likes of Dior. The leading Korean cosmetics maker, AmorePacific and the French fashion house expanded their partnership last year in a move that will allow Dior to develop its own branded cushion products. “This agreement holds great significance in that our ‘cushion’ technology is appreciated by one of the world’s most respected luxury brand companies and a powerhouse in the global beauty industry,”​ Shim Sang-bae, president of AmorePacific told the press at the time. Two-way enthusiasm​ While French consumers evidently have a strong appetite for K-beauty, the feeling appears to be mutual. The continued success of AmorePacific’s popular brands Laneige (French for ‘the snow’) and Etude (‘study’), indicates Korean consumers have an enduring passion for all things French, and Eisenberg Paris, Decleor, L’Occitane and L’Oreal have all successfully expanded their businesses in South Korea. Copyright - Unless otherwise stated all contents of this web site are © 2023 - William Reed Ltd - All Rights Reserved - Full details for the use of materials on this site can be found in the Terms & Conditions Related topics\nMarket Trends\nSkin Care\nHair Care\nColour Cosmetics Show more  Content provided by Robertet Health & Beauty | 27-Jun-2023\n                     | Product Brochure Sunbathing at the beach is the first UV-related skin damage that comes to mind. Whereas, enjoying a coffee on a terrace under the sun can be as harmful.  Content provided by Provital | 24-Apr-2023\n                     | Product Brochure Altheostem™ is Provital’s first dermohacking and lab-grown active with proven senolytic activity. A vegan and COSMOS-approved biotech ingredient that thoroughly...  Content provided by Tagra Biotechnologies | 05-Apr-2023\n                     | Product Presentation Biotin (vitamin B7) helps improve hair health, skin’s pigmentation, and nail’s appearance. Biotin occurs as a crystalline powder with very little solubility...  Content provided by Horphag Research | 20-Mar-2023\n                     | White Paper Pycnogenol® has 25+ clinical studies demonstrating its active properties for oral and topical skincare formulations. Results show the antioxidant stimulates... Show\n                        more More promotional features ",
    "datetime": null,
    "url": "https://www.cosmeticsdesign-europe.com/Article/2016/06/17/French-consumers-top-European-poll-of-demand-for-Korean-beauty"
}