{
    "title": "From K-beauty to clean skincare, 7 cool websites where you can buy beauty products in India | Vogue India",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, visit My Profile, then View saved stories By Sneha Mankani We're buying everything online now—from handmade soaps to K-beauty must-haves and customised haircare. We’re also paying attention to what's on—and in—the bottles, tubes and pots we buy. Especially now, when shopping in stores can be stressful and testing products are impossible, having a place to comfortable, safely and efficiently shop online is more important than ever. There's now a website that caters to everyone—the K-beauty obsessed, the clean beauty crusaders and the ones who'd travel the world to get their beauty haul. Here are some of the coolest. The curators at Sublime Life will ensure the products you buy from them are safe and effective, ethical and sustainable, and cruelty-free. The website was launched to help you make clean beauty choices, and by that measure, they only pick brands that are non-toxic and safe for the planet too, by ensuring they comply by Sublime Life’s no-toxin list that includes chemicals like parabens, sulphates, phthalates, mineral oil, aluminium etc. The online store also does plastic-free shipping and encourages their customers to become ‘recycling warriors’ by asking them to send their old empties back to recycle or upcycle. You'll find an interesting range of over 60 homegrown and international labels to pick from. Shop here Your travels may have halted, but you can still get your international favourites besides your usual local suspects delivered to your doorstep—from that Omorovicza face mask you’ve been waiting to restock to your go to serum from The Ordinary—via Lookfantastic. There’s also a range of tools and men’s grooming products that will have the entire family adding to the cart. And if the variety gets your confused, sign up for their beauty box to introduce yourself to new brands every month. Shop here There are cool new Korean beauty products that flood the shelves every month, so the options can be overwhelming. Maccaron curates authentic and effective brands with an internal vetting process that ensures that the brands they pick have R&D facilities grounded in science. You also have the  option to discover new K-beauty brands through their My Maccaron Box (because let’s be real, there’s never too many Korean brands waiting to be discovered). By Hasina Jeelani By Prabal Sharma By Kejhal Kalra Shop here For those who love all things Korean, trust Korikart to keep you updated on the latest from South Korea to achieve your glass skin goals or satiate your spicy noodle craving. To the uninitiated, or if you simply can’t fathom their ever-growing industry and innovation, the website provides visual demonstrations of products through video tutorials and guidance on the usage and application. There’s also verticals that offer food, fashion and lifestyle products, so you can let your skin enjoy your charcoal bubble mask while you slurp on your kimchi noodle soup. Shop here Baro Market is dedicated to homegrown artisans who lovingly create products that are clean and therapeutic. Here you’ll find oils that treat joint pain to stretch marks, creams for acne to dullness, handmade soaps with ingredients from the valley of Kashmir, candles and natural perfumes—sourced from homegrown labels. Come to support local, stay to care for self. Shop here It’s like you’ve entered a mini K-beauty wonderland when you visit Beauty Barn. From classics like COSRX and Heimish to the cool kids like TonyMoly and Etude House, pick your Korean favourite easily. Ginseng and green tea won’t just be breakfast table frequenters. Shop here It’s so easy to shop at Care & Class—the website lets you pick a curation based on your skin concern or skin type besides the usual categories and brands list. Each product comes with detailed descriptions, benefits, how-tos and ingredients list to help you make the right choice for yourself. Shop here How to buy makeup online: Your complete guide to a good shopping experience 5 tips that will save you trouble (and money) while shopping online for skincare Will ‘buy local’ be our Swadeshi movement 2.0? By Violeta Valdés By Hasina Jeelani By Barry Rodgers By Isha Sutaria See more stories Condé Nast India © 2023 Condé Nast. All rights reserved. Use of this website constitutes acceptance of our Terms of Service and Policy and Cookie Statement. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. ",
    "datetime": "2020-10-26T09:23:46.107Z",
    "url": "https://www.vogue.in/beauty/content/niche-indian-websites-to-buy-k-beauty-clean-skincare-beauty-products-online"
}