{
    "title": "From fried chicken to K-beauty, he's bringing Korean culture to Singapore - CNA",
    "text": "People People Luke Yi became an entrepreneur when he founded Korean fried chicken chain Chicken Up. Now the owner of two K-beauty salons, one of which houses a cafe, Yi finds joy in bringing unique lifestyle experiences to Singapore. Korean F&B and beauty entrepreneur, Luke Yi. (Photo: Alvin Teo) As a former consultant in the IT industry, Luke Yi enjoyed much success in the corporate world, having worked for big names such as Hewlett-Packard and Cisco Systems. But after 16 years in the industry, Yi found himself listless and bored. “The work was very routine,” he lamented. “I was also travelling a lot. More than half of my time was spent on the plane.” Born in South Korea, Yi migrated to New Zealand at the age of 18. After working in Australia for 10 years, he moved to Singapore. “When I was back in town, my time with family was very precious,” shared the 45-year-old father of two. “When you’re busy, every hour is important. So when you go to a restaurant and find that the place serves good food, but the service level isn’t fantastic, you tend to be disappointed.” Yi’s dismay at the service standards in Singapore’s F&B scene, coupled with his eagerness to do “something more fun”, sparked the birth of Chicken Up in 2012. When Chicken Up first opened, it was one of Singapore’s first Korean fried chicken chains, sparking a craze. “Back then, many of my friends in Singapore thought that Korean food is all about barbecue. But growing up in Korea, I know that there’s a lot more variety. It’s just easier to set up a Korean barbecue restaurant here,” he shared. “I chose to do fried chicken because in Singapore, there’s a mix of different races. Some don’t eat beef and some don’t eat pork, so chicken is more commonly accepted.” Nine years later, Yi’s entrepreneurship journey has seen him expand into the beauty industry with the opening of Korean beauty salon, Leekaja. Marrying both the F&B and beauty worlds, he opened Walking On Sunshine, a hair salon-cum-cafe, in 2018. While Yi believes there’s a strong appetite for Korean-related experiences in Singapore, “there’s still a lot more to explore,” he said. “I’m here to bring in more Korean experiences, and not just the shell of it, but the entire culture as well.” “I’m here to bring in more Korean experiences, and not just the shell of it, but the entire culture as well.” – Luke Yi COOKING UP A STORM Underpinning Yi’s entire entrepreneurial journey is a desire to bring innovation to traditional industries, he shared. When Chicken Up first opened in Singapore, Yi was eager to create an F&B establishment where diners did more than just eat and exit. “I was inspired to incorporate the distinctly fun style of Korean service to the Singapore restaurant scene. This way, I was able to acquaint Singaporeans with the idea of Korean culture through the food that we serve, and the Korean hospitality that comes with it,” Yi shared. “We created a fun drinking culture at Chicken Up with our flavoured soju drinks such as watermelon, apple and pineapple, which were quite big hits at the time. We also trained our staff according to airline service standards so they would be more welcoming and attentive. We even had an incentive for them to remember the names of our regulars.” After the success of Chicken Up, Yi opened Korean-Mexican bistro Don’t Tell Mama. While Korean and Mexican food seemed like an odd pairing at the time, it was a popular concept back in Korea. The fusion bistro bar has since become a hit in the Tanjong Pagar area. Yi’s F&B portfolio also includes the now-defunct Korean street food outlet Baro Baro. Having achieved success in the F&B world, Yi was soon in search for a new industry to take on. “The thing with the F&B industry is that customer loyalty is very shallow. If diners like the food, they may come back. But people like to try new restaurants,” he said. “I wanted to also to prove to myself that the success of Chicken Up wasn’t just pure luck.\" SHAKING UP THE BEAUTY INDUSTRY Beauty, he believes, is an industry with higher customer retention. At the time, he felt that the beauty industry in Singapore was in need of a shakeup. “When I first came to Singapore, not many people wore make-up. But in Korea, people wear make-up even to go to the grocery store,” he said. “But I knew there was a growing interest in the importance of looking good, so I waited for the right opportunity to go into the beauty industry to make it a little bit more exciting.” That opportunity came in late 2016 when Yi partnered with Korean beauty entrepreneur Madam Leekaja to open the first Leekaja Beauty Salon in Singapore. Leekaja is an established Korean beauty salon chain back in its home country, the first to be franchised worldwide. It now boasts over 200 stores around the world. “A long time ago, people were obsessed with Hong Kong culture, and then it was Japanese culture. Now it is Korean culture.\" – Luke Yi The Leekaja Singapore website touts a “full Korean beauty experience without having to travel to Seoul”. Located at Mandarin Gallery, it offers not only hairstyling services, but make-up, eyebrow, eyelash and nail services as well. “Korea is widely known as one of the leaders in the beauty industry. Singaporeans have also been riding the Korean wave and many are obsessed with K-dramas. Right away, we received a lot of demand and requests for our stylists to recreate hairstyles referenced from K-dramas,” Yi said. Beyond hiring Korean hairstylists, the salon prides itself for its customer service standards. “We have three to four customer service officers, and what they do is ensure that customers are happy and satisfied. It’s a heavy investment actually, but at a lot of other places, there’s not enough receptionists, which results in a lot of waiting around.” At Leekaja, customers are seated at their very own spacious stations. It can sometimes take hours to get their hair done, so guests are given a robe and a pillow for comfort. While many beauty salons in Singapore tie customers down by pushing the sale of packages, Leekaja prefers to let its experience do the selling. “We don’t sell packages, we never sell packages. We let our customers enjoy the experience and if they value that, they will come back.” Yi’s latest venture, however, is an innovative hair salon-cum-cafe, aptly named Walking On Sunshine. Located at Orchard Central, the secret garden-themed cafe is shrouded in lush foliage, surrounded with over a thousand potted plants. By the side of the cafe sits an expansive hair salon which offers just about anything from a haircut to a dye job. Since its opening in 2018, Walking On Sunshine has attracted a strong following, particularly those eager to snap a photo at one of its Instagram-worthy spots. “I was in the F&B industry and then in beauty, and I always wanted to combine the two together to create a place where people can do many things at once. So take a family spending time together on a weekend. Father and daughter can enjoy a meal while mum gets her hair and nails done. Then they can take turns,” Yi explained. “Anyone can say that they’re the top hair salon or cafe in the country, but we actually let our customers experience it. If I tell them a bunch of facts, they will probably not remember it the next few days. But the feeling they felt while being here is something that will last longer.” ON TO THE NEXT BIG THING With his corporate life a distant memory now, Yi has no regrets about striking out on his own. A self-professed workaholic, Yi believes that the best part of becoming an entrepreneur in the beauty and F&B space is the ability to meet new people every day. “When I was in IT, the only people that I hung out with was IT guys,” he laughed. “But now, I get to socialise with different kinds of people, and that was what really pulled me into the service industry.” Bigger plans are already in the works. He’s currently aiming towards opening four or five “mega-salons” in the next eighteen months, which will be bigger than what he has already started. While Walking On Sunshine combines a hair salon with a cafe, one of the upcoming mega-salons will feature a beauty salon, cafe and a pilates studio. “After pilates, visitors can take a shower, then get their hair and makeup done. After that, they can enjoy healthy vegan food at the cafe with their friends. We want to create a space where people can spend hours and hours, without having to travel back and forth.” While Yi believes the Korean wave is here to stay for now, he’s aware that things may not be the same in the future. “A long time ago, people were obsessed with Hong Kong culture, and then it was Japanese culture. Now it is Korean culture, but that might change in a few years,” he acknowledged. “But because people can’t travel for now, I think they will look for unique, different experiences. That’s where I hope to spice things up.” “Because people can’t travel for now, I think they will look for unique, different experiences. That’s where I hope to spice things up.” – Luke Yi Be among the first to know the Breaking news This service is not intended for persons residing in the E.U. By clicking subscribe, I agree to receive news updates and promotional material from Mediacorp and Mediacorp's partners. Copyright© Mediacorp 2023. Mediacorp Pte Ltd. All rights reserved. We know it's a hassle to switch browsers but we want your experience with CNA to be fast, secure and the best it can possibly be. To continue, upgrade to a supported browser or, for the finest experience, download the mobile app. Upgraded but still having issues? Contact us ",
    "datetime": null,
    "url": "https://www.channelnewsasia.com/people/luke-yi-chicken-up-leekaja-walking-on-sunshine-1923676"
}