{
    "title": "From Rihanna to Kim K - Must See Makeup Transformations! | BellaNaija",
    "text": "Style Style Style Beauty\nStyle Beauty\nBN TV\nLiving\nMusic\nStyle Style Beauty\nBN TV\nLiving\nStyle Style Beauty\nBN TV\nEvents\nStyle Beauty\nStyle Published on By Kim Kardashian As a lot of us know by now the power of makeup seems to have no limit. From creating cleavage and making our noses slimmer to changing whole face shapes, makeup his the new plastic surgery. For Filipino TV host Paolo Ballesteros, makeup is more than concealing a few dark spots and looking good – it’s changing his face to look like some our favourite celebrities. From Kim Kardashian, Nicki Minaj and Ariana Grande to Megan Fox, Katy Perry & Miley Cyrus, Paolo has re-created famous faces almost to perfection. He uses just makeup, coloured contacts, wigs and we have to admit some of them made us gasp and giggle and he definitely won’t have a problem going for Halloween. You can see more of his work on his Instagram page: @pochoy_29, but first check out some of our favourite transformations. Rihanna Katy Perry Jennifer Lawrence Megan Fox Miley Cyrus  Tyra Banks Bang Bang! Nicki Minaj Jessie J Ariana Grande Iggy Azalea Talk about talent?! Which one’s your favourite transformation? Photo Credit: @pochoy_20 Beauty brand Guerlain Paris launches New “L’homme Ideal” Fragrance in Nigeria with Fashion Shows & Fab Guests Omoyemi Akerele Named One of Six Global Gatekeepers of Fashion and Style Jennifer is the Beauty Editor & Style Representative of BellaNaija.com.\nGet in touch - Send an email to: beauty(at)bellanaija.com or style(at)bellanaija.com | Follow us on Instagram: @bellanaijabeauty OR @bellanaijastyle | Follow us on Twitter: @bellanaijastyle An Answered Prayer! Enjoy Beauty & Victory’s Pre-wedding Shoot Beyoncé, Jay-Z, Rihanna, A$AP Rocky Made a Fashionable Statement at Pharrell Williams’ First Louis Vuitton Show Tiwa Savage Delivers Stunning Performance of “Keys To The Kingdom” at the Coronation Concert | Watch © 2022 BellaNaija. All rights reserved ",
    "datetime": "2014-10-15T13:02:46+01:00",
    "url": "https://www.bellanaija.com/2014/10/major-transformation-filipino-tv-host-paolo-ballesteros-transforms-into-nicki-minaj-kim-k-rihanna-more-using-makeup/"
}