{
    "title": "G-Dragon & SHINee First K-Pop Acts to Rank on Year-End World Albums Artists Chart – Billboard",
    "text": "K-pop star G-Dragon and boy band SHINee both landed on Billboard's year-end World Albums Artists ranking -- a first for Korean acts. Since the chart began in 1995, no Korean act had landed on the… By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin K-pop star G-Dragon and boy band SHINee both landed on Billboard’s year-end World Albums Artists ranking — a first for Korean acts. Since the chart began in 1995, no South Korean artist had landed on the year-end chart that ranks the most album units sold by artists Billboard has classified in the “world” genre. G-Dragon and SHINee securing the No. 9 and 10 slots, respectively, come after a slew of major releases from both acts in 2013. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news 2013 Year-End Charts: World Album Artists | K-Pop Hot 100 Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t12/18/2013 In September, G-Dragon released both his “Coup D’Etat, Pt. 1” and “Coup D’Etat, Pt. 2” EPs — his first Korean release since 2012’s “One of a Kind” EP.  The first landed on Billboard 200, making a rare apperance for K-pop acts on the Billboard 200 at No. 182. “Pt. 1” also hit No. 1 on the World Albums Chart on the Sept. 21 chart. The “One of a Kind” EP went to No. 161 on the Billboard 200 in 2012. G-Dragon is the leader of K-pop boy band BIGBANG, which sent its “Alive” EP to No. 150 in 2012.  Boy band SHINee had a very busy 2013: two albums, one EP and a compilation album. The compilation album, “The Misconception of Us,” was a combination of the albums “Dream Girl: The Misconceptions of You” and “Why So Serious?: The Misconceptions Of Me” with two new tracks. A new EP, “Everybody,” also dropped in October. The Top 10 Biggest-Selling K-Pop Songs in America While SHINee did not crack the Billboard 200, “Why So Serious?” did hit No. 1 on the World Albums Chart on the May 11 chart.  Look out for weekly K-pop chart updates from Billboard’s World Albums, K-Pop Hot 100 and beyond on K-Town‘s weekly chart update articles. Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2013-12-19T00:00:58+00:00",
    "url": "https://www.billboard.com/music/music-news/g-dragon-shinee-first-k-pop-acts-to-rank-on-year-end-world-albums-5839843/"
}