{
    "title": "Ga In Mixes K-Pop & ‘Blurred Lines’ for New Single ‘Truth or Dare’ – Billboard",
    "text": "PSY's \"Gentleman\" video co-star Ga In, the \"most rumored about\" Korean singer, gets the last laugh in her \"Truth or Dare.\" The track is recommended for fans of Robin Thicke's \"Blurred Lines\" or Brown… By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin After kicking off her comeback with the brazen buzz track “Fxxk U,” Ga In returns with her new single “Truth or Dare,” sure to delight anyone who got down to Robin Thicke’s “Blurred Lines” — and who hadn’t? Like the 2013 Song of the Summer, “Truth or Dare” incorporates the familiar disco groove beat, peppy percussion and cowbell dings — though the “Gentleman” co-star jazzes up the chorus with additional saxophone embellishments throughout. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t02/10/2014\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tExplore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tRobin Thicke\t\t\n\t\t\t\t\t\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news While Thicke’s 12-week No. 1 raised eyebrows for its alleged “rapey” lyrics, the Brown Eyed Girl member will likely do the same, but for her headstrong response to any public backlash she might receive from her bold music and look. She sings in her signature baby-like delivery, “Want to know the truth? / All the truth? / The important thing is that you talk about me / The more, it’s nice, very nice / It’s better to have more rumors” — essentially beating haters to the punch.   The “Truth or Dare” visual (below) directly coincides with the lyrics as half music video, half “fake documentary,” as label LOEN Music describes it. Ga In dances in tight shirts and dresses in between a series of “candid” interviews about the K-pop star. An extension of what we saw in the teaser for her “Truth or Dare” album, a host of artists and Ga In collaborators speak about the singer, covering everything from her drinking habits to her breasts to the fact that she’s the “most rumored” about K-pop star. Ga In Sends Buzz Single ‘Fxxk U’ to No. 2 on K-Pop Hot 100 Is it all true? Probably not, as the lyrics are about the difference between believing what you hear or believing what you see with your own eyes. But in a meta moment near the video’s conclusion, Ga In is shown stripped of her sexy outfits and styled hair, telling the camera, “I think that when I leave my house, I starting acting. Just, living. Isn’t it all acting?” making the viewer wonder whether she’s acting while speaking about acting or if she’s finally telling us her truth in this “fake documentary.” Whatever’s real, the nearly-eight-minute music video solidifies Ga In as a K-pop star with one of the juiciest personalities out there.  Bonus: For fans of “Truth or Dare” and/or “Blurred Lines,” don’t miss Brown Eyed Girls’ 2013 album track “Boy,” off their incredible “Black Box” album.  Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2014-02-11T02:36:52+00:00",
    "url": "https://www.billboard.com/music/music-news/ga-in-mixes-k-pop-blurred-lines-for-new-single-truth-or-dare-5901184/"
}