{
    "title": "Geltor Partners with K-Beauty Guru On New Vegan Collagen Products",
    "text": "Publisher - Award-Winning Impact Media - Alt Protein & Sustainability Breaking News Geltor has announced the upcoming release of a product range developed in collaboration with collagen aficionado and K-Beauty influencer Sally Olivia Kim. Kim was appointed Geltor’s Entrepreneur-in-Residence in October. As yet, little is known about the product range. While California-based Geltor has not explicitly revealed what it has been working on with Kim, ingestible plant-based collagen seems likely, given that the beauty founder already has a line of such products, Crushed Tonic, which features marine-based collagen and is sold in Sephora and through Anthropologie. Seoul-born Kim is a respected beauty guru thanks to her range of ingestible skincare products. Discovering the benefits of collagen after suffering a severe burn, she developed a range of drinks infused with her favourite ‘wonder’ ingredient. The success of the Crushed Tonic range led to a book release as well, firmly establishing Kim as an expert in the field of collagen benefits, something she wanted to share with the vegan community. “I had been searching high and low for a truly vegan collagen option – there are so many products out there that claim to be vegan, but animal protein inherently cannot be vegan, of course,” she said in a statement. “So when I discovered Geltor’s technology in fermenting proteins to create this beautifully effective and sustainable real animal-free collagen, I knew that there was something incredibly special here.” Geltor has been making progress in the field of precision fermented plant-based collagen since 2020. Having secured $91.3 million in a Series B funding round, it has developed “designer proteins” that can act as ingredients in a range of consumer goods. Crucially, they could be used in beauty. Earlier this year, Geltor unveiled PrimaColl, claiming it to be the world’s first vegan collagen that can be used in food products and cosmetics. It is an exact replica of Type 21 collagen that is derived from animals, but has been proven to offer health benefits, especially within an anti-aging framework. In addition to PrimaColl, Geltor has also released HumaColl21 and Collume. Now, the same youth-enhancing technology appears to have been used to produce a specific line with Kim. “There is no one better than Sally, who comes well-versed in the value that proteins like collagen are already bringing to industries like beauty and personal care and food and nutrition, to help tell Geltor’s story of how biodesign is changing the game,” said Geltor’s CEO and co-founder, Alex Lorestani. He continued: “The collaboration is a natural fit and we can’t wait to unveil this first product we’re launching together.” Vegan collagen is a niche market but one that has a number of startups revealing progress. North Carolina-based Jellatech announced a $2 million pre-seed round earlier this year for the continued development of animal-free collagen and gelatin. Aimed squarely at supplying the F&B, medical and beauty industries, the products are cell-cultured. Similarly, Hong Kong’s Avant Meats launched Zellulin alongside its cell-cultured seafood ranges. The product is designed to usurp collagen use across cosmeceutical applications. Lead image courtesy of Geltor. A long-term committed ethical vegan and formerly Green Queen's resident plant-based reporter, Amy juggles raising a family and maintaining her editorial career, while also campaigning for increased mental health awareness in the professional world. Known for her love of searing honesty, in addition to recipe developing, animal welfare and (often lacklustre) attempts at handicrafts, she’s hands-on and guided by her veganism in all aspects of life. She’s also extremely proud to be raising a next-generation vegan baby. Prev Post Consumer Behaviour Deep Dive: Who Is Buying Plant-Based Meat & Why? Next Post Pangaia Elevates Its Environmental Credentials With Colorifix Bacteria-Based Dyes Collection Future Food Quick Bites: Sizzling Steaks, Parliamentary Protein & Vegan Hot Dogs Sweetgreen Will Now Only Use Extra Virgin Olive Oil to Cook Veggies, Grains & Proteins Zayt Bioscience: Turning Fruit Waste into Precision Fermentation Butter Pork Soybean Startup Raises $30M to Produce More Animal Proteins via Plants Latest News South Korea Unveils National Plan to Promote Plant-Based Food Industry Green Queen in Conversation: Cultivated Meat Pioneers – Josh Tetrick of GOOD Meat The EU Caged Farming Ban is Now on Hold – Thanks to Aggressive Pressure from the Meat Lobby: Report Future Food Quick Bites: Sizzling Steaks, Parliamentary Protein & Vegan Hot Dogs First Bite: APAC Startups Developing Plant Fats, Whole Cuts & Cultured Pet Food Backed by Climate-Centric VC Fund 50/50 Foods Founder on Flex Meat: ‘We’re the Google to Beyond and Impossible’s Yahoo’ Featured Content China’s Hang Lung & France’s LVMH Announce Groundbreaking Sustainability Partnership To Accelerate Joint ESG Goal Looking To Start a Future Food Startup? Singapore’s Protein Innovation Centre Is The Launchpad You Need From Plastic Waste to “Green Concrete”: Sino Group  Partners with EcoBricks to Inaugurate Sustainable Solutions for the Built Environment ‘Beef But Better’: Kerry Identifies What Australia Consumers Are Looking From Plant-Based Beef Burgers Kerry Is Helping F&B Capture Asia’s Growing Plant-Based Meat Demand We INFORM. We INSPIRE. We EMPOWER. Founded by serial entrepreneur Sonalie Figueiras in 2011, Green Queen is an award-winning sustainability & impact media platform advocating for social & environmental change in Asia. Our mission is to shift consumer behaviour through our authentic, original and ground-breaking content. Green Queen is an editorially-driven media publication. Over 98% of our content is editorial and independent. Paid posts are clearly marked as such: look for 'This is a Green Queen Partner Post' at the bottom of the page. ",
    "datetime": "2021-12-04T00:00:00+00:00",
    "url": "https://www.greenqueen.com.hk/geltor-sally-olivia-kim-vegan-collagen/"
}