{
    "title": "Get your Korean beauty fix without leaving NYC",
    "text": "Thanks for contacting us. We've received your submission. Korean beauty products have been much buzzed-about in recent months, but there’s substance behind the hype. Korean women are among the world’s most sophisticated and demanding skin-care customers, constantly adjusting their treatment regimens in a quest for radiant, poreless complexions. “From the day they’re born, Korean women are told that taking care of your skin is one of the most important things,” says Sarah Lee, co-founder and co-chief executive officer at glowrecipe.com, an online K-beauty boutique. “Korean women will do almost anything to make sure their skin looks flawless.” The multi-step Korean skin-care routine was born out of that devotion. The program usually starts with a two-part cleansing process: an oil to remove makeup, then a foaming or gel formula. This is followed by toner, gentle exfoliation and essences (similar to serums but usually lighter), depending on the need. Serums, eye cream, lightweight moisturizer and cream moisturizer typically round out the ritual. Sunscreen is nonnegotiable during the day, spritzes of soothing mist are common, and most women use masks too. Alicia Yoon, co-founder and chief executive officer of online Asian beauty retailer peachandlily.com, says Korean beauty companies churn out advanced products at lightning speed to meet the desires of their discerning customers. “In America, a lot of our consumers ask general questions, like ‘How do I prevent aging?’ ” she says. “But in Korea, people are very targeted about what their issues are and what the solutions could be.” Yoon believes that Korean skin care is a decade or more ahead of the West because companies innovate constantly to keep up with the competition and can turn on a dime. Take BB creams, the foundation-plus-treatment-with-SPF hybrids. When BBs hit the States in 2011, they were already six years old in Korea. Recently, Western companies have entered the fray with their versions of K-beauty essentials. After a wave of alphabet products (like BB creams), the tide is turning to cushion compacts, which house a sponge soaked in lightweight treatment foundation. Lancôme unveiled its $47 Miracle Cushion Liquid Cushion Compact last month. Essences are another area of activity: Tata Harper has Hydrating Floral Essence ($65) and Clinique debuted Even Better Essence Lotion ($32) last year. Today, K-beauty’s hottest categories include cushion cheek and lip color and sheet masks, which are individually packaged cotton or fiber cloths that deliver active ingredients to the skin. Others are made of gel-like bio-cellulose that conforms to the face. But at the rate Korean skin care advances, those will soon be replaced by new breakthroughs. 136-80 Roosevelt Ave., 718-888-9097 Michael SofronskiA lush faux-plant wall says “Hey, we’re natural” — and products touting everything from Hawaiian hibiscus to Gangwon deep seawater seem to back that up. The Aloe Vera 92% Soothing Gel for the face ($6.50) has a big following. The clean, well-organized store also has the obligatory mollusk items, said to have regenerative properties and replenish the skin’s moisture: try Snail Solution 70 Cream ($59.90). 136-20 Roosevelt Ave., 718-353-8808 Flushing’s answer to a beauty-supply store, this emporium is jam-packed with products. There’s the obligatory wall of sheet masks, priced for risk-free experimentation at $1 to $6 a pop, a huge selection of BB creams, an array of eyeliners and much more. 136-89 Roosevelt Ave., 718-353-0031 Zandy MangoldTake the name literally: The products are formulated with food ingredients. The $15 Black Sugar Mask Wash Off, for instance, is a runaway best seller. Salespeople are friendly at this grocery-themed shop, and are quick to pass out dollar-off coupons for the already super-affordable in-store nail bar. A manicure at the wooden table will set you back just $8. 136-86 Roosevelt Ave., 516-714-3953 Zandy MangoldMakeup in every iteration — from edgy to girly to natural — is this store’s specialty. It stocks four house brands: Clio Professional (which includes the ominous-sounding but popular Kill Cover foundations), Peripera makeup, Goodal (natural ingredient skincare) and Soo Ae (masks). The store recently started carrying a collection of sheet masks to satisfy increasing demand. 136-62 39th Ave., 718-939-2089 Just around the corner from the main Roosevelt Avenue drag, the Yeon carries natural products in festive packaging. Lotus, tangerine, honey and the ubiquitous snail extract are key ingredients in its skincare collections. Customer fave: the Jeju Hallabong Live Pack, $25.60, a moisturizing gel housed in a lifelike “tangerine” jar. 136-20 Roosevelt Ave., 917-913-2581 Zandy MangoldThere’s a TonyMoly in Manhattan’s Koreatown (316 Fifth Ave.), but this one has a bigger selection of their skin care, hair care, body and makeup in irresistibly cute packaging. The brand’s snail-mucin line is a top seller for serious skin care, but novelty items catch the eye. How about Egg Pore Blackhead Out Oil Gel in a plastic egg? Or Panda Dream So Cool Eye Stick in — you guessed it — a panda tube? 136-53 Roosevelt Ave., 718-888-0546 Zandy MangoldThis Korean giant focused on skin care, body and color cosmetics — and sheet masks galore— moved last year to a bigger space. Look for the Character Mask collection, hyaluronic acidcollagen treatments that come in kooky panda, tiger, sheep and dragon designs for $4 each. There’s also a branch near Herald Square at 42 W. 32nd St. ",
    "datetime": "2015-05-05T22:20:09+00:00",
    "url": "https://nypost.com/2015/05/05/get-your-korean-beauty-fix-without-leaving-nyc/"
}