{
    "title": "Get glowing - Exclusive Christmas offers at Lane Crawford to get you that natural Korean beauty glow | South China Morning Post",
    "text": "[Sponsored Article] With endless products catering to every skin type and issue in the skincare market, time is now ripe for some genuine curation to help consumers make informed decisions. This is especially helpful if you are ingredient-conscious, and want to stay up-to-date with the latest trends without having to do too much research yourself. An exclusive edit by Glow Recipe “Everyone is obsessed with ‘gwang’,” says Glow Recipe’s co-founder Sarah Lee. “It means glow in Korean, but it’s the type of glow you see from beneath your skin, it’s not something you can add with iridescent makeup. You see it because your skin is translucent. Glass-like, almost.” Both Lee and another co-founder Christine Chang’s dewy, sheen-like skin is evidence of their diligent approach to skincare. Like so many Korean woman, skincare is a major part of their lives. “Korean beauty for me has always been about that mother daughter bond. It’s one of the first things you learn from your mum growing up. You watch her vanity, patting her skin, caring for it, always hiding from the skin with her umbrella and her hat–skincare is a way of life for her. She instills those values in you very early on, and it’s something you carry with you throughout your life,” explains Chang. Glow Recipe has been able to unearth some of Korea’s best kept beauty secrets and present them to the world. This Christmas, the beauty duo has come up with an exclusive edit for Lane Crawford: four K-Beauty sets that target skin issues including enlarged pores, ageing and dryness using the power of superfood ingredients such as parsley, artichoke, centella and cacti to restore your natural “gwang”. It is also perfect for the holiday season when you have to attend a lot of events and parties, and want to look your best.  The Best of Luxury Beauty from Korea In addition, Lane Crawford is also offering a luxurious treat from Amorepacific and Sulwhasoo, the two giants of Korean beauty. The exclusive ‘The Best of Luxury Beauty From’ gift set is the perfect way to spoil your loved ones and yourself. This curated edit is comprised with star products from the two brands: 16 products to nourish and indulge from a Treatment Cleansing Foam and Anti-ageing Colour Control Cushion from Amorepacific, to a First Care Activating Serum and Overnight Vitalizing Mask from Sulwhasoo. The colourful packaging and boxes are so pretty that you probably don’t want to throw them away. Use them as building blocks to create fun shapes and structures as Christmas decoration to keep your family and guests entertained. ",
    "datetime": "2016-11-25T09:15:00+08:00",
    "url": "https://www.scmp.com/presented/lifestyle/topics/get-xmas-glow/article/2047937/get-glowing-exclusive-christmas-offers-lane"
}