{
    "title": "Get Excited: Korean Beauty Brand Missha Is Now at Target | Allure",
    "text": "By Sarah Kinonen Within the last  couple of years, Target has blown up the beauty space. One could even say that the mass retailer's makeup, skin-care, and hair-care offerings are beginning to rival collections found at big-name beauty stores like, Sephora and Ulta. Perhaps it all started with Target's collaboration with green beauty brand Beautycounter, which hit shelves last fall. Or the growth could due to the more recent drop of Lucy Hale's hairstylist Kristin Ess's super-luxe new hair-care line. Either way, Target knows what it's doing. And now, just days after announcing a special collection of Korean beauty products curated by Peach & Lily's founder, Alicia Yoon, Target is continuing its K-beauty roll by bringing even more Seoul favorites to its mainstream shelves. And this time, it's with Korean beauty brand Missha, which, if you're at all familiar with, is best known for its snail gel-based products. (Sounds gross, but don't knock it 'till you try it.) Call it an under-the-radar drop, but Target recently welcomed Missha onto its virtual shelves, and the selection of products are, as to be expected, good. With 22 skin-care products—a curated collection of moisturizers, serums, and essences—there's a lot to choose from. But the common thread? The brand's hero ingredient, snail gel, which is spiked in a handful of its offerings, including the Allure editor favorite, Missha Super Aqua Cell Renew Snail Sleeping Mask, which targets fine lines as you snooze. But if you're not into snail gel, we're also partial to the Missha M Perfect Cover BB Cream SPF42 PA+++, a lightweight BB cream that covers redness and protects with a hefty dose of UV protection, thanks to broad spectrum SPF 42. Bottom line: There's probably something in the Missha collection for every skin need. More K-beauty launches: Unlike the Alicia Yoon collection for Target, which hits stores January 22, Korean beauty brand Missha's line is already available (as in right now). Ready to shop? The line, which starts at $6 (for individual sheet masks) and is capped at $49 (for its essences), can be found at target.com. Now, find out how to make the world's simplest face mask: Vote for your favorite makeup, skin, hair, and body products by February 20, and you'll be entered for chances to win one of four awesome beauty prizes! By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Sarah Han By Sarah Han By Sarah Han By Jennifer Hussein More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2017-01-16T22:00:00.000Z",
    "url": "https://www.allure.com/story/korean-beauty-brand-missha-target"
}