{
    "title": "Get Korean Makeup Inspiration From Your Favorite K-Drama Stars' Beauty Endorsements",
    "text": "Fashion  I know it's just the mindless consumer in me, but I am a total sucker for celebrity-endorsed beauty products. Lately, I've been looking for Korean makeup inspiration, and finding that my favorite K-drama stars have landed some campaigns that make for an awesome place to start. This wouldn't be the first time I got inspired by ads: Drew Barrymore convinced me to buy pale blue eyeshadow (which by the way, is terrible on my complexion), and I've purchased just about every single lip product that Emma Stone has modeled for Revlon (hey, in my defense, their whole balm stain line is ridiculously awesome) — oh, and don't even get me started on Natalie Portman and Dior (yeah, thanks to them, I'm out $35 for a tinted lip balm). All of the above celebs have their beauty endorsement game on lock, but do you know who does it even better? All of your favorite Korean drama stars! Yep, you can count on the top cosmetics companies to snatch up the top actors and musicians. HERA has Jun Ji Hyun ( My Love from Another Star ), Mamonde has Park Shin Hye ( Pinocchio ), Innisfree has Lee Min Ho ( The Heirs ), Etude House has Krystal (also The Heirs), and Laneige has Song Hye Kyo ( That Winter, The Wind Blows ). See? All hugely popular brands matched up with hugely popular stars from hugely popular dramas — so of course it follows that the resulting advertisements are nothing short of ***flawless (no really: Beyoncé herself would likely feel a twinge of jealousy upon viewing some of these ads). Let's take a look! See? ***Flawless, right? An adorable look, complete with on fleek eyebrows and some lipgloss that I might need to head out to the store and buy right now. Apparently, Lee Min Ho starred in a Innisfree-sponsored webseries called  Summer Love , along with Girls' Generation frontwoman Im Yoona. I'm not entirely sure what's going on in the trailer (besides adorable ear-whispering), but apparently it has to do with cushion BB creams, which I am 100 percent in support of. Major lash dramarama and pink eyeshadow? YES. A pretty darn breathtaking take on the whole two-toned lips trend (I don't know about you, but I'm dying to give it a try). Images: Getty Images; Twitter; Instagram Choose an edition: ",
    "datetime": null,
    "url": "https://www.bustle.com/articles/90033-get-korean-makeup-inspiration-from-your-favorite-k-drama-stars-beauty-endorsements"
}