{
    "title": "Gilt Trip",
    "text": "A fantastical fashion-filled pilgrimage to the golden land of Burma. Kyaiktiyo Pagoda also known as the Golden Rock. Givenchy by Riccardo Tisci dress, top, earrings, and sandals; Pebble London necklace; Orlebar Brown rope belt; Tabio socks; stylist’s own whistle necklace (throughout); all umbrellas from Bogyoke Aung San Market, Yangon, Burma. Fendi dress; Edun trousers; Chanel backpack; draped fabric from Bogyoke Aung San Market. Suno top; Edun trousers; Pebble London necklace; draped fabric from Bogyoke Aung San Market. Beauty note: Release your inner golden child with MAC Playland Pigment in Ever So Yellow. Bottega Veneta shirt and miniskirt; Céline necklace; Hervé Van Der Straeten cuffs; longyi (worn as maxiskirt) from Bogyoke Aung San Market. Nuns in Burma. Madame Thair’s rambling antiques shop in Yangon is replete with porcelain pots, colonial furniture, and century-old silk sarongs. But her most prized possessions are the photographs of herself as a young woman. Missoni top, shirt, and dress; Peter Som long-sleeve top; Givenchy by Riccardo Tisci earrings; longyi (around waist) from Bogyoke Aung San Market. Beauty note: Feel fabulously flush with Maybelline Master Hi-Light Blush in Pink Rose. Emilio Pucci jumpsuit; Final Home jacket (on arms); Pebble London necklace; stylist’s own compass, and bag (worn at waist). Beauty note:Give dry skin a hand with Molton Brown Replenishing Hand Cream. Rag & Bone top (underneath); Marni skirt and sandals; Alexis Bittar cuffs; Pebble London bracelets (on ankles); shirt, longyi (worn as maxiskirt), and belts from Bogyoke Aung San Market; stylist’s own rings (on toes). Thomas Tait shirt; Narciso Rodriguez miniskirt; Céline necklace and sandals; Vicki Sarge cuffs; hat and longyi (worn as maxiskirt) from Bogyoke Aung San Market. Dior top and skirt; (from top) Delfina Delettrez chokers; Céline necklace; jacket from Bogyoke Aung San Market. Children outside of a temple. The Row tops, skirt, and bag; Angels the Costumiers robe; Pebble London necklace; Tabio socks; Givenchy by Riccardo Tisci sandals. Beauty note: For protection as strong as a parasol, try Neutrogena Beach Defense Sunscreen Broad Spectrum SPF 50+. This ovaid temple in Salay pays homage to the Buddhist symbol of perseverance: If an egg turns over, it will right itself back up again. Derek Lam cropped top and pleated skirt; Yohji Yamamoto tank top and pants; Vicki Sarge neck piece, Delfina Delettrez chokers; (right and left wrists, from top) Céline bracelets, Mikuti bangles, Pebble London bangles; Vicki Sarge ankle cuff; Prada shoes; stylist’s own rings. Not to be eclipsed by such man-made wonders, the local Kayan tribeswomen sport brass coils from the clavicle up starting at the age of 5. Céline top and skirt; Givenchy by Riccardo Tisci earrings; (from top) Vicki Sarge neck piece, Céline necklace; (right hand, from top) Delfina Delettrez bracelet, Mikuti bangle, Vicki Sarge cuff, Mikuti bangle; (left hand, from top) Mikuti bangle, Vicki Sarge cuff, Mikuti bangle, Delfina Delettrez bracelet; Vicki Sarge knee and ankle bracelets; Prada socks and shoes. Woman with orchids. Balenciaga top; Céline skirt; Givenchy by Riccardo Tisci earrings; (from top) Balenciaga necklace, Delfina Delettrez choker, Céline necklace; Vicki Sarge knee and ankle bracelets; longyi (around waist) and belt from Bogyoke Aung San Market. Beauty note: Treat exposed limbs like porcelain with Uka Pepper Hand & Body Lotion. Gucci jumpsuit and bra; Givenchy by Riccardo Tisci earrings; Prada socks; Céline sandals. Beauty note: Crimson lids? Done, with Make Up For Ever Blush Powder Scarlet No. 99. Dolce & Gabbana dress; Alexander McQueen hat and choker; (right arm, from top) Alexander McQueen cuffs, Hervé Van Der Straeten cuff, Alexander McQueen cuffs; (left arm) Alexander McQueen cuffs; Bijules nail rings; Jennifer Fisher rings. Hair by Christiaan; makeup by Sam Bryant at D+V Management. Model: Edie Campbell at DNA Model Management. Extras in neck pieces: Daw Mu Aung, Daw Mu Ju. Produced by Karina Moreton at Panoramic Journeys. Local fixer: Moe Aung. Photography assistant: Emma Dalzell. Fashion assistant: Clémence Lobert. Printed by Graeme Bulcraig at Touch. Special thanks to the Sandoway Resort, Ngapali, and Qatar Airways. ",
    "datetime": null,
    "url": "https://www.wmagazine.com/gallery/tim-walker-burma-golden-land"
}