{
    "title": "Givaudan Active Beauty exploresnew avenues with vegetal by launching K-phytoTM [SC] Camellia and K-phytoTM [PP] GHK",
    "text": "Crafted by Green biotechnology, these two new active ingredients are dedicated to hair and skin care, respectively After one year of partnering with the South Korean beauty innovation company, BIO-FD&C Co., Ltd., the leading company in plant cell culture, Givaudan Active Beauty unveils two new active ingredients crafted by Green Biotechnology. Inspired by the latest K-Beauty trends, K-phytoTM [SC] Camellia is an extract of plant stem cells designed to address dry scalps and dandruff, while K-phytoTM [PP] GHK is a phytopeptide aimed to reduce skin sebum production. Mathias Fleury, Global Category Manager for Biotechnology Actives said: “The exclusive partnership with Bio FD&C leverages the untapped power of plants through stem cell cultures and unique phytopeptides. \"It allows our experts to offer innovative natural and reliable solutions for hair and skin care issues such as dry scalp and oily skin, while protecting our planet.” A dry and itchy scalp is a global hair condition to solve. If 26%1 of US adults have hair concerns related to dryness, 41% of Brazilians show an interest in trying scalp care treatment products. In APAC, botanical claims drive haircare new product launch by 70%1 with popular ingredients such as Camellia (also known as Tsubaki). K-phytoTM [SC] Camellia is a powerful active obtained from Camellia phytoplacenta cells culture. By using plant cells culture, our scientists have been able to isolate and replicate these cells from a Camellia flower (traditionally used in Asia for its scalp care and hair conditioning properties), originating from the famous Korean Jeju Island, without endangering Nature’s resources. This unique active will increase the scalp moisture content, up to +13.8%, reinforce the epidermal cohesion of the scalp keratinocytes, resulting in\r\na reduced number of dry flakes and dandruffs down to -33.6%, and significantly soothe the scalp, with a reduction of its erythema down to -6.6%. If K-phytoTM [SC] Camellia offers major benefits in one week, it also delivers great results after just one single shampoo application, restoring hydration, improving soothing and reducing flakes better than the placebo conditions, for a perfect instant gratification effect. Oily skin is a frustrating condition that can affect consumers’ self-confidence, especially in today’s focus on maintaining a “picture-perfect image”. Both female and male consumers are seeking solutions for this common skin complaint leading to acne. 50%1 of 20-24 year old Chinese have experienced acne in the last six months and 43%1 of 18-24 year olds Americans use acne products at home. K-phytoTM [PP] GHK is an innovative molecule that combines the best of botanicals and peptides to act on sebum production’s mechanisms. Thanks to the phytopeptide technology (combining a peptide with a natural phytochemical molecule), it offers a full set of actions, starting with preserved antioxidant and anti-ageing activities compared to the initial molecules (caffeic acid and matrikine GHK). Clinical studies have shown significant benefits (versus placebo) on reduction of the facial sebum production in just 2 weeks (-35.5%), with an even more impressive efficacy after one month of use (67.5%), up to five times better than placebo. 1. Mintel Through digital, live and print products, Cosmetics Business informs and inspires business leaders and decision-makers around the world. With a digital-first strategy, the Group’s Editors write breaking news, product releases, technical papers, innovation features, trend reports and live content agendas covering the entire industry from ingredients and packaging to regulation, retail and marketing. ",
    "datetime": null,
    "url": "https://cosmeticsbusiness.com/news/article_page/Givaudan_Active_Beauty_exploresnew_avenues_with_vegetal_by_launching_K-phytoTM_SC_Camellia_and_K-phytoTM_PP_GHK/163917"
}