{
    "title": "Glass skin: Everything you need to know about the Korean beauty trend everyone is talking about | Fashion Trends - Hindustan Times",
    "text": "Subscribe Now! Get features like Glass skin is the latest Korean beauty goal, according to Refinery29, and it centres on the kind of radiant complexion that cannot be faked. “Glass skin is this idea of transparent and translucent skin” Alicia Yoon, founder of K-beauty store Peach & Lily, told the publication. “It’s a sign of youthfulness and it’s one of the most strived-for qualities in Korea.” #MakeupByAnnaRangelova 💄💋 Photography: @alvcreations 📸 MUA: @annarangy 💄💋 Model : @adelyamuhamedova 👠. #makeupfruit #myartistcommunity #maccosmetics #myartistcommunitybalkans #Makeup #macbulgaria #MakeupByAnnaRangelova #maclipstick #maclips #summermakeup #glossylips #macwetlook #wetmakeup #wetglossyeyes #glossyskin #glassskin #myartistcommunityworldwide #myartistchallenge @maccosmetics @macscsprostore A post shared by Anna Rangelova (@annarangy) on Jun 11, 2017 at 9:47pm PDT Achieving the look requires exfoliation to get rid of dead skin cells and smoothen out the skin, before moisturising with an intense serum, face mask or cream moisturiser. According to Glow Recipe founders Sarah Lee and Christine Chang, who spoke to Allure about the trend, layering different moisturising products onto the skin will result in the deep sheen synonymous with ‘glass skin.’ For inspiration as to how to rock the glowing look this season, head to Instagram, where K-beauty fans have been showing off their naturally dewy complexions in droves. #Sheetmasking at 6:30am before a busy day ahead, because what else would you do? 😊😂 This clear jelly-like Whamisa hydrogel looks like and helps your skin become glass skin, just what I needed after my intense travel schedule! #butskinfirst #glowinhongkong A post shared by Sarah Lee (@sarah_glow) on Nov 7, 2016 at 2:48pm PST K-beauty is known for the emphasis it places on skincare thanks to its 10-step routine, and is widely credited with kickstarting the sheet mask craze in Europe and the US that took off last year. Follow @htlifeandstyle for more   ",
    "datetime": "2017-09-24T14:19:09+05:30",
    "url": "https://www.hindustantimes.com/fashion-and-trends/glass-skin-everything-you-need-to-know-about-the-korean-beauty-trend-everyone-is-talking-about/story-vgelMSwphU2Kyth3PL82wN.html"
}