{
    "title": "Globalising K-beauty: Multi-brand retailer Olive Young launches global e-commerce site",
    "text": "Or wait... Headlines Brand Innovation Formulation & Science Packaging & Design Business & Financial Market Trends Regulation & Safety Promotional Features Site Archive Multimedia Regions All Asia-Pacific South East Asia South Asia East Asia Oceania Site Archive Multimedia Hot topics Clean & Ethical Beauty Sustainability COVID-19 Market Entry Anti-Aging / Skin Whitening Beauty From Within Nanotechnology Green Cosmetics Site Archive Multimedia Resources Type of resources Events All Events Shows & Conferences Online Events Editorial Webinars Events China 中国 Podcast  02-Jul-2019\n                            - Last updated on\n                                02-Jul-2019 at 02:03 GMT With the new global site, the CJ Group-owned retailer will be able to reach beauty consumers from 150 countries. The new website offers around 1,000 products from 130 brands including skin care, hair care and body care products, as well as beauty tools. The company claimed that its global online mall was the first e-commerce platform for overseas consumers by a South Korean cosmetics retailer. According to its statement, Olive Young plans to target the US market first, where it sees the most potential. “Beauty and cosmetics shops in the US have designated K-beauty sections amid increasing demand from millennial consumers. Good product quality, reasonable prices and unique concepts make Korean cosmetics stand out.”​ Currently, the online site is available in English but the company is already planning to add more languages to the platform, such as Chinese, Japanese and Spanish. The global mall is also another way to showcase K-beauty products to the world, said the company. \"The global online mall is a platform for Olive Young to expand into foreign markets. We will take the lead in globalizing Korean beauty products.”​ Health and beauty retailers like Olive Young rose in popularity in recent years as South Korea’s ‘one-brand’ high street shops began facing a reckoning. The local beauty scene saw domestic brands facing intense competition and external complications such as the Middle East Respiratory Syndrome (MERS) epidemic in 2016 and the Terminal High Altitude Area Defence (THAAD) crisis in 2017. Along with poor relations between Seoul and Beijing, Korea saw the end of the ‘golden age’ of inbound Chinese tourists. With sales decreasing, veteran K-beauty brands began to close down branches and move its business online. Last October, cosmetics brand Skinfood filed for court receivership after encountering difficulty securing liquidity due to excessive debts. By then, the brand was plagued with rumours, including that it stopped supplying its outlets for more than half a year. Other brands that were sent into the red included Tonymoly, Amorepacific’s Etude House and Able C&C, which owned Missha. Local consumers did not fill the retail void left by Chinese tourists. Instead, they were flocking to multi-brand stores like Olive Young. LVMH-owned Sephora recently announced that it will be tapping into the opportunities in South Korea. The company confirmed it was opening its first store in October this year in Samseong-dong, Seoul. The retailer said it planned to open five brick-and-mortar stores and an e-commerce platform by 2020. By 2022, it plans to add another additional 13 stores. Most recently, Able C&C rebranded its existing Missha stores into NUNC outlets, a new multi-brand store, to bolster its sales and revitalise the flailing business. Copyright - Unless otherwise stated all contents of this web site are © 2023 - William Reed Ltd - All Rights Reserved - Full details for the use of materials on this site can be found in the Terms & Conditions Related topics\nBusiness & Financial\nMarket Trends\nEast Asia\nMarket Entry\nAsia in Focus\nSkin Care\nHair Care\nColor Cosmetics\nFragrance Show more  Content provided by Naolys | 07-Jul-2023\n                     | White Paper Naolys presents HairRevive [MM+Zn], a pioneering plant-based ingredient revitalizing hair.  Content provided by Provital | 13-Jun-2023\n                     | Product Brochure Circanblue™ is a vegan postbiotic ingredient obtained from Lactococcus lactis that induces a resynchronisation of the skin’s circadian cycle after this... More promotional features ",
    "datetime": null,
    "url": "https://www.cosmeticsdesign-asia.com/Article/2019/07/02/Globalising-K-beauty-Multi-brand-retailer-Olive-Young-launches-global-e-commerce-site"
}