{
    "title": "Glow Recipe's Sarah Lee and Christine Chang: 'We've expanded past being defined as a K-beauty brand' - Glossy",
    "text": " Subscribe: iTunes | Stitcher | Google Play | Spotify When Sarah Lee and Christine Chang joined forces to start Glow Recipe in 2014, they wanted to find their own way to introduce the U.S. consumer to Korean beauty. Now, fast-forward five years, Glow Recipe sells 30 different brands and private-label products, and it’s preparing for international expansion. “I think a lot of brands are discovering Glow Recipe’s skin care, and they don’t realize that we’re K-beauty-inspired or a K-beauty brand,” said Chang. “They just discover us as a fun skin-care brand that they see on social, or they hear about us through Sephora. Because of that approach, I think we’ve grown to a place where we’re reaching a very diverse customer base. K-beauty, for us, is always something that will be a part of our approach — in that it’s a holistic, enjoyable approach to skin care — but we’ve expanded past being defined as a K-beauty brand.” On this week’s episode of The Glossy Beauty Podcast, beauty editor Priya Rao sits down with Sarah Lee and Christine Chang, the co-founders and co-CEOs of Glow Recipe, to discuss how they’re creating their own products, planning for expansion into Germany and beyond, and getting creative in the name of standout influencer activations. Edited highlights below. Creating products that multitask to appeal to the U.S. customer\nChang: “We were seeing so much innovation and technology when we went back to Korea, which was about seven times a year. Every time, we were so blown away by the newness coming into the market: these really beautiful, natural formulations with really unique packaging, textures or sensoriality. We felt there was [an opportunity] to bring these innovations over and translate them for the U.S. woman. K-beauty as a whole has been perceived to be really overwhelming. When we go to Sephora stores, the cast members there were telling us, ‘K-beauty is amazing and I love the whole experience, but I can’t tell my clients to use these 15 or 20 steps when I’m not doing it myself.’ In a way, that’s a myth that’s perpetuated by marketing claims. Women in Korea are not counting the amount of steps they’re using; it’s more about a dialogue with the skin. We knew there were a lot of hard-hitting, hybrid, multitasking formulas that delivered more, with just one product, and we felt that that could really speak to a U.S. woman. They want products that are results-driven and practical, but still sensorial and enjoyable.” Approaching new markets in Europe and beyond\nLee: “I would say that the German customer is similar to the U.S. customer. We’re hearing that indie brands are on fire all throughout Europe and that there is a huge, growing interest in skin care as a category. So the trends are a couple of years behind. Maybe it’s like the U.S., where makeup was really, really hot and now skin care is replacing that. We’re seeing the same in Europe. I don’t think there’s a huge difference in terms of how we would market the launch or the products that we’re marketing. It’s more about customizing it to the clients and really speaking to that market specifically. The product, the sensoriality, the visual aspect — all of that will be reused. Whatever we’re doing on Instagram, the world is watching, so we’re not going to change the wheel. It’s going to be the same type of communication and partnering really closely with the retailer in that specific market, and honing in with their marketing tools.” Creating standout influencer activation experiences\nChang: “Our Avocado Melt Sleeping Mask comes from this formula we created because our customers were asking us for a more nourishing, comforting formula for very dehydrated skin. The texture of the product is comforting — we call it an ‘avocuddle’ for the face. We wanted to bring these attributes to our influencer activation, and our PR director, Steven Chong, came up with this idea that we’d take over a mattress store in LA. So we created this green mattress store experience with lighting, sheets and avocado cushions, and everyone came in pajamas, lounged around, tried the mask and literally avocuddled with us. I really don’t think there’s a recipe to what’s right or what’s not for an influencer activation. I think the major advantage of being a nimble, startup environment is that we’re able to test things very quickly, and if it’s not the right fit, then we pivot and find something else.” Get news and analysis about fashion, beauty and culture delivered to your inbox every morning. ",
    "datetime": "2019-02-21T05:00:12+00:00",
    "url": "https://www.glossy.co/podcasts/glow-recipes-sarah-lee-and-christine-chang-weve-expanded-past-being-defined-as-a-k-beauty-brand/"
}