{
    "title": "Go Makeup Shopping in Myeong-Dong with South Korean Model Cherry - Best South Korean Beauty Brands",
    "text": "Every product on this page was chosen by a Harper's BAZAAR editor. We may earn commission on some of the items you choose to buy. A look at K-Beauty from the ultimate insider. Imagine New York's Times Square—but instead of the M&M store and Hard Rock Cafe, every single shop was a K-beauty store. That's the Myeong-dong district in Seoul, South Korea. Just a single street is home to a dizzying number of makeup, skincare, and colored-contact shops in Myeong-dong—all promising products to help you nail that elusive K-beauty look. To help us navigate, we tapped Korean fashion model Cherry to show us exactly where to shop. Cherry's first stop is Etude House, which she calls \"makeup for princesses.\" While Etude House is known for its cutesy and sweet packaging, the products inside are crazy-effective, pigmented, and long-wearing. \"The cases are super cute, and the names are unique,\" adds Cherry. Feeling FOMO already? You can shop the best of Etude House—and all of Myeong-dong onSoko Glam's website here in the U.S. Cherry then hit up 1989 Chosungah Beauty where she swatched a few lipsticks in orange and pink shades. \"A lot of colors suit my light-colored hair, but still I mostly use orange shades,\" she says. Cherry has since dyed her hair an electric shade of tangerine (she really, really loves orange). \"When I do live videos, I get asked a lot about my contacts,\" the model says. \"I get mine from O Lens. The ones I have on now are from O Lens, and they're pink.\" Just like makeup, Cherry notes, contacts in different colors and finishes can totally transform your look. She matches her makeup to her contacts that she gets at the store—yet we can't even get our eye doctor to call back for a refill. Watch the video above to learn all about Cherry's favorite products, stores, and makeup tips. Below, see what real Korean women think about plastic surgery. The Very Best Beauty Gifts to Surprise and Delight These 33 Coveted Makeup Sets Make Perfect Gifts Shop Merit and Proenza Schouler’s Runway Collab 15 Lip Stains You'll Wear All Season Long The 13 Best Makeup Advent Calendars in 2023 Pamela Anderson Goes Makeup-Free to Fashion Week The Best Drugstore Concealers That Actually Work How Amanda Seyfried Does French Beauty Getting Ready With Kate Moss and Charlotte Tilbury Witchy Lips Will Be Everywhere This Spring We Consider These Scents the Best Perfumes, Ever Julia Garner on Fragrance, Fashion, and Self-Care A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2018-05-23T19:53:00Z",
    "url": "https://www.harpersbazaar.com/beauty/makeup/a20888148/k-beauty-makeup-shopping-in-myeong-dong-south-korea/"
}