{
    "title": "Gulugod Baboy’s all-weather beauty",
    "text": " SUMMARY This is AI generated summarization, which may have errors. For context, always refer to the full article.  MANILA, Philippines – Lush green peaks and valleys all throughout the year. Unobstructed views of the sea and neighboring islands. From the peak, a 360-degree view of all these sights. These are what await those who climb Gulugod Baboy [which literally means Pig’s Spine, and which was named because of its shape] in Anilao, Mabini, Batangas. Here is a video showing the 360-degree view from Gulugod Baboy’s peak:  For the newbie mountaineer Gulugod Baboy’s gentle slopes are perfect for beginners. The view from the top is rewarding for both newbies and advanced mountaineers. The most difficult part is actually the start of the trail, which is a steep cemented road. This is the starting point from the usual jump-off point, Philpan Resort. Even then, climbers can take their sweet time going up and enjoying the scenery. What is beautiful about scaling Gulugod Baboy is that there are arresting views almost all throughout the trail. After trekking for around 10 to 15 minutes, my friends and I rested and took in the sparkling sea and the outline of the island. From time to time, I actually stopped just to bask in the scenery.  At a leisurely pace, Gulugod Baboy takes less than 3 hours to climb, making it ideal for a day hike, though camping is recommended to maximize the experience, especially the sunrise and sunset. For our group, that already included refreshment breaks and lots of picture taking! I suspect we could have taken two hours or less. My friends and I also discovered another factor that makes Gulugod Baboy beginner-friendly: with several locals selling water, ice candy and halo-halo on the trail, it is almost impossible for any climber to die of thirst.  Landscapes and seascapes While trekking, we came across some interesting sights. There were marang trees, pale green moss covering tree trunks and other unique vegetation. Soon, the number of trees dwindled and we reached the bottom of rolling green hills of grass. With no shade, we covered our heads with hats and bandannas to shield them from the burning sun. Feasting my eyes on the scenery while trekking, I thought the views could not get any better, but it did when we reached the top. Green peaks with grasses bending to the cool wind surrounded us. Batangas islands big and small popped out from the blue bay and sea.  In the distance was the outline of Mindoro. We watched the sun dip to the sea and turn the greens into golds. In the evening, on our campsite at the bottom of the peak, we saw the town’s homes and establishments light up one by one. We woke up to a foggy, wet morning with a light rainshower the next day. [Yes, it can get cold, so better pack a sweater and socks!]  While the far-off hills and islands were concealed by the fog, the greenery in our immediate surroundings stood out vividly. The bright colors in our sweaters and backpacks, too, looked sharper. Even in the rain, Gulugod Baboy is bright green and beautiful. Trekking on a muddy trail can be a challenge, though, but still manageable. Wearing non-slip footwear is best. With Gulugod Baboy’s gentle slopes and only a light rain that moistened but did not loosen the earth, our descent was relatively easy, and we had time to take a side trip to a nearby white beach on Sombrero Island.  The cool waters relieved our tired muscles. Many of us just lay down and relaxed after taking a dip. It was the perfect ending to our adventure, and I highly recommend it for anyone camping overnight at Gulugod Baboy. – Rappler.com  You can also read:   Claire Madarang is a writer, traveler and seeker. Her wanderlust takes her on adventures like backpacking for 7 weeks straight. Her seeking leads her to different wellness practices like meditation and healthy (mostly vegetarian) eating. Follow her adventures, tips and epiphanies at her blog, Traveling Light.  Error. Please abide by Rappler's commenting guidelines. There are no comments yet. Add your comment to start the conversation. JOIN OUR NEWSLETTER Fearless reporting delivered to you follow us    ",
    "datetime": "2013-09-05T08:00:00+00:00",
    "url": "https://www.rappler.com/life-and-style/travel/38163-gulugod-baboy-all-weather-beauty/"
}