{
    "title": "Has K-beauty fallen from favor? Hera latest K-beauty brand to pull out of China - Global Cosmetics News",
    "text": "TRENDING: Posted by Georgina Caldwell | Mar 8, 2022 | Asia & Australasia, Finance, Retail | THE WHAT? AmorePacific-owned Hera has announced that it is pulling out of the Chinese market, according to a report published by the Global Times. THE DETAILS The K-beauty brand will close all physical stores and suspended online sales via its official Wechat store last week. Its Tmall flagship will continue to trade. THE WHY? AmorePacific has scaled back operations in China for a number of its brand, notably Innisfree also closed some 80 percent of stores on the mainland at the start of the year, per Global Times. The closures have been attributed to both the pandemic and the Chinese consumer’s changing buying habits. Zhang Yi, CEO of iiMedia Research Institute told Global Times, “While the consumption habits and concepts of Chinese are changing, these South Korean cosmetics have not changed. Their designs and marketing strategies have not changed, failing to adapt to the sales and marketing landscape in the Chinese market.” Share: Rate: LATEST NEWS Unilever settles in trademark dispute ov...   Walgreens to settle Rite Aid suit for US...   L’Occitane Q2 2024: Sales rise 17....   Two Target executives to retire   Gillette signs up for another season as ...   PRESS RELEASE: Society of Cosmetic Chemi...   L’Oreal to dump Decleor in derma shake-u...   Hermes Q3 2023: sales up 16 percent to €...   Amazon to face lawsuit over data trackin...   J-beauty retailer Yoshitsu to open store...  GLOBAL COSMETICS NEWS Contact UsSubscribePrivacy PolicyCookie PolicyTerms & Conditions SOCIAL MEDIA FacebookTwitterInstagramLinkedInSoundCloudRSSYouTube NEWS HomeAll Regions Cosmetics News WirePodcastOpinionFashionProfessional BeautyTravelWellnessTop 100 Brands Copyright © 2023 Global Cosmetics Media Limited ",
    "datetime": "2022-03-08T06:02:00+00:00",
    "url": "https://www.globalcosmeticsnews.com/has-k-beauty-fallen-from-favor-hera-latest-k-beauty-brand-to-pull-out-of-china/"
}