{
    "title": "Head-to-toe K-beauty",
    "text": "Amorepacific's advanced R&D points to a rosy-cheeked future PUBLISHED : 14 Jan 2020 at 04:01 NEWSPAPER SECTION:  Life WRITER: \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tStory: Kanokporn Chanasongkram Amorepacific hit the right note since launching its first branded product, Melody Cream, in 1948. The company became a pioneer in disseminating K-beauty as it was South Korea's first cosmetics exporter back in 1964. Today, beauty brands under its umbrella include Laneige, Sulwhasoo, Mamonde, Innisfree and Etude House, whose presence in Thailand and other Asean countries has contributed to the company's continuous growth. Its global marketing has further introduced K-beauty to women around the world while transforming their beauty routine with innovative products, such as boosting essences, cushion compacts and sleeping masks. Kate Kwon, director of Amorepacific Brand Science Lab. Science Lab director Kate Kwon looked back on the cosmetic innovations and touched on future technologies for the 2020s, in her presentation during the \"Exciting Amorepacific, Exciting Asean\" event, held at Pullman Jakarta Central Park. \"Our R&D explores new materials and effective formulations as well as consumer science and customising beauty solutions to address their needs,\" said Kwon. \"In the future, bespoke cosmetics will be provided through skin gene analysis and an in-depth diagnosis programme.\" Launched in 2008, cushion compacts revolutionised the make-up routine. Photos: Amorepacific The last decade saw Amorepacific beefing up the R&D, starting with the opening of its second research centre named Mizium in 2010. The R&D investment and game-changing products earned its ranking in Forbes' World's Most Innovative Companies 2015. Innovations are catalysed at the state-of-the art Mizium, located in Yongin, Gyeonggi-do. \"Mi\" means beauty and \"zi\" means wisdom, and Mizium refers to a \"space of wisdom in pursuit of beauty\". Mamonde Red Energy Recovery Serum. The in-house R&D actually began in 1954, when founder Suh Sungwhan built South Korea's first cosmetics lab, which was only about 7m² in size. The R&D now also takes place in overseas research centres, to develop products based on research into local climates and skin conditions, to meet needs of global customers. \"Over the 74 years, Amorepacific has gained a competitive edge, both scientifically and technologically, through our R&D. Though, the essence still lies in finding special things in familiar flowers and plants,\" said Kwon. Sulwhasoo Concentrated Ginseng Renewing Serum and Cream EX. Synonymous with Korea, ginseng has long been a health tonic to promote overall well-being and longevity. Research on transferring its healing properties to enhancing skin vitality began in the 1960s, and the ABC Ginseng Cream was launched in 1966. Laneige Water Bank Hydro Essence and Cream EX. Laneige Today, the ginseng skincare collection is marketed by Sulwhasoo, a holistic beauty brand whose products are formulated based on medicinal plants. \"Our ongoing Ginsenomics research looks into the whole plant, from the root and stem to leaf and flower; as well as cultivation and processing methods,\" she said. \"The cultivation in an optimal and clean environment ensures that energy is distributed throughout the plant, not concentrated in the root.\" Laneige Water Bank Hydro Cream. Research efforts culminated in the early 2000s with Bio-Conversion Technology, which converts ginseng compounds into active skincare ingredients Ginseng leaves, stems and roots provide anti-ageing ingredients for Concentrated Ginseng Renewing Serum, which also features Ginsenisphere microcapsules that deliver ginseng seed oil to the skin. The efficacy of fourth-generation Concentrated Ginseng Renewing Cream EX is powered by Compound K and Ginsenoside Re from its roots and flowers. Nutrition and energy are concentrated at the flowers when they come into full bloom. Since 1991, Mamonde has harnessed this plant vitality, through eco-friendly cultivation and extraction methods, for its floral skincare formulas. Sulwhasoo Concentrated Ginseng Renewing Serum. \"The R&D involved comparative studies of hundreds of flower varieties, to isolate those for making Mamonde skincare products,\" she said. \"We also studied ecological mechanism in which flowers protect themselves from the external environment and elevate their nutritional status for the blossoming stage.\" Red Energy Recovery Serum is formulated with Blossoming Energy, developed based on the research of nutrients that enable flowers to bloom. Instead of flowers, Amorepacific researchers picked vegetables to upgrade Laneige's Water Science technology. Crushed kale, garden cress and beetroot are immersed in low-temperature (15C) seawater for five hours, resulting in Green Mineral Water, featured in Water Bank Hydro formulas for combination-oily skin type. Another recipe, brussels sprout, artichoke and lima bean, undergo the same \"Ocean Brew\" extraction method to obtain another Green Mineral Water for formulating Water Bank Moisture for dry skin. Since 1994, Laneige has been studying skin hydration, of which minerals are essential components of Natural Moisturising Factors (NMFs). Replenishment through the Green Mineral Waters is locked in by the Water Zipper technology On the other hand, Innisfree's hydrators feature ingredients from green tea grown on Jeju, a volcanic island located southwest of the Korean Peninsula. Amorepacific has been cultivating green tea there since 1979, and later established the Green Beauty Lab located within the plantation, to study the plant and its effects on the skin as well as on the body when taken as food and drink. Innisfree was launched in 2000 as a clean beauty brand, which sources natural ingredients, such as the green tea, orchid, tangerine, volcanic cluster and lava seawater, from Jeju. \"The island's fertile soil, mineral-rich water and ideal precipitation levels along with subtropical climate lend a clean and ideal environment for plants to thrive and provide superior ingredients for Innisfree's formulations,\" noted Kwon. Innisfree Jeju Cherry Blossom Tone-up Cream. Natural ingredients have long been a part of Amorepacific's DNA since the company was founded in 1945. Jeju cherry blossom has been added to the portfolio, following research findings that its leaf extract is rich in brightening and moisturising compounds. Kwon highlighted only the R&D associated with Sulwhasoo, Mamonde, Laneige and Innisfree. Its extensive R&D actually delivers a package of health and beauty solutions through 30 brands. Amorepacific (Thailand) recently launched cosmetic brand Espoir and plans to introduce haircare and styling brand Mise-en-scène in 2020, to offer head-to-toe K-beauty products. By subscribing, you accept the terms and conditions in our privacy policy. ",
    "datetime": null,
    "url": "https://www.bangkokpost.com/life/social-and-lifestyle/1835224/head-to-toe-k-beauty"
}