{
    "title": "Henry Lau goes from Willowdale to K-Pop superstar",
    "text": "  The South Korean sensation is a member of boy band Super Junior-M and has a new solo album The South Korean sensation is a member of boy band Super Junior-M and has a new solo album This article is over a year old, and the information within may be out of date. Henry Lau of K-Pop boy band Super Junior-M performs in Seoul, South Korea. Clinton Lau still has difficulty wrapping his mind around the fact that his younger brother, a former Torontonian, is a celebrity overseas. “He has fans following him 24 hours a day, they take shifts and follow him in taxis,” he says, disbelief in his voice.  Twenty-four-year-old Henry Lau was plucked from his Willowdale home a few years back and has since been made into one of Asia’s biggest K-Pop sensations, playing the violin in Super Junior-M, a Korean boy band signed with Korean label S.M. Entertainment. K-Pop, a genre of dance music that fuses sugar pop, EDM, and American hip hop and R&B, is South Korea’s hottest cultural export. The country’s top three labels earned a record $160 million in 2011 by reaching beyond their own borders. Before Lau auditioned for S.M. Entertainment, an Asian music agency that scouts talent and trains artists intensively for years to become Asia’s hottest music stars, he was just a Grade 12 kid, wowing his family and friends at talent shows. “He just had a really amazing sense of showmanship that set him apart,” Clinton Lau says. Jonathan Medina, the president of a Korean music fan group in Toronto, says it’s unusual that Henry, who he says is equivalent in popularity to a Spice Girl in the ’90s, has made it so big in the Asian music pop music scene. “There are a few other Canadians that have been scouted, because the music labels out there come to places like Toronto to find talent, but there aren’t many others who have made it as big as him,” he says. He mentions another Canadian, originally from Edmonton, who goes by the stage name G.NA Choi, who was scouted and is now a successful solo artist in Korea under an Asian label. “But it’s still really rare that someone from Toronto is living a star life like that,” Medina says. In the Lau household, Henry, Clinton and their little sister were playing the violin and piano at a young age. “My dad worked in real estate and my mom stayed at home so she was the one who was really enforcing us playing music,” Clinton says, adding that all the kids in the family were taking the Royal Conservatory program for both piano and violin. Henry had always done well in Toronto, often winning competitions, but it wasn’t until he abandoned the classical music route and got inspired by a talent show performance of Michael Jackson at another Toronto high school that he really shone, his brother says. “A friend taught him how to sing and dance, and he learned how to play the violin as well,” Clinton says. In the spring of his Grade 12 year at A.Y. Jackson Secondary School, Henry went with a few friends to an audition for S.M. Entertainment in Toronto, singing, dancing and playing the violin. “They called him back the next day and my mom thought it was a big scam,” Clinton says, laughing. Executives from S.M. Entertainment had to fly Mrs. Lau and Henry to their headquarters in Korea to meet with the CEO in order for her to believe their claims of wanting to train her son to become a star. “After she came back, she was OK with it and he flew out soon after, turning down a spot in the U of T music program,” Clinton says. Shortly after the trip, Henry boarded a plane to superstardom, missing his high school prom. Henry trained for only a few short months before he debuted in 2007 in Super Junior-M, a rare occurrence, his brother says. “Sometimes the music label will train people for 10 years before they debut,” Clinton says. Henry was well received and so was the group’s first EP, Super Girl, which was released in 2009. He took a break to study production elements of music at the prestigious Berklee College of Music in Boston and returned to Asia in January 2013, just in time for Super Junior-M’s release of its second studio album, Break Down. Clinton says it was Henry’s music production experience that helped him become S.M. Entertainment’s first solo male artist in over a decade when he released his own album in Asia this past month. It is still unclear when the album will be available in Canada. “Henry always joked around, saying he would be a pop star in high school, but we never knew anything like this was possible, not coming from Willowdale,” Clinton says. “I still think it’s kind of unbelievable.” With files from Ryan Porter Anyone can read Conversations, but to contribute, you should be a registered Torstar account holder. If you do not yet have a Torstar account, you can create one now (it is free). To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation Save $85 with our best offer. Cancel Anytime. It means the world to us that you choose to read our brand of trusted news. And as long as you continue to do so, we’ll continue to show you we appreciate it. Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:       Sign up with  Thank you . Your account has been registered, and you are now logged in. Check your email for details. Invalid password or account does not exist Sign in with Submitting this form below will send a message to your email with a link to change your password. An email message containing instructions on how to reset your password has been sent to the email address listed on your account. No promotional rates found.    Secure & Encrypted Secure transaction.\nSecure transaction. Cancel anytime.  Thank you. Your gift purchase was successful!\nYour purchase was successful, and you are now logged in. You will also start receiving the Star’s free morning newsletter, First Up, soon. A receipt was sent to your email. ",
    "datetime": null,
    "url": "https://www.thestar.com/entertainment/music/henry-lau-goes-from-willowdale-to-k-pop-superstar/article_d78c781a-7898-5942-8763-e393f490c49d.html"
}