{
    "title": "Here's What Derms Think of Hanacure, the K-Beauty Mask All Over Instagram | SELF",
    "text": "By Korin Miller If you’re a fan of Drew Barrymore or a follower of beauty trends on Instagram, you’ve probably seen the Hanacure mask—it’s the one that makes users look zombie-like (if you move as it dries, it forms visible cracks). Back in February, Barrymore shared a picture wearing the mask and said it “changed her life.” Experts say the Korean beauty product’s ingredients may help you moisturize, but the wrinkly part may just remove some dead skin. On its Web site, Hanacure claims the masks reduce pores, hyperpigmentation (a common condition where patches of skin become darker than a person’s normal tone), and wrinkles in a month or less. According to the company, the mask includes botanicals such as lotus leaf extract, oriental raisin tree extract, green tea extract, honeysuckle flower extract, rosa canina fruit oil, peony root extract, sophora root extract; and peptides like nicotinoyl dipeptide-23, nicotinoyl dipeptide-22, acetyl hexapeptide-8, and copper tripeptide-1.  Using the mask requires mixing a serum and solution together, painting it on with a brush, trying not to move for 30 minutes, then washing it off. In addition to the celebrity endorsement from Barrymore, Hanacure also offers up before-and-after photos from customers on its Hanacure Effect Instagram page that look pretty impressive, and users swear by it on social media. “#Hanacure face mask is totally creepy when it dries but when you take it off you feel like you have new skin,” one woman wrote. “Hanacure…the mask that makes you ugly before beautiful,” another said. It looks and sounds remarkable, but is this for real? Joshua Zeichner, M.D., a New York City–based board-certified dermatologist, tells SELF that the ingredients are promising. “The mask contains a variety of calming botanicals alongside several peptides that brighten, tighten, and minimize the appearance of pores,” he says. For example, lotus leaf extract can minimize oil production and refine pores, he says, while copper peptides stimulate collagen to help reduce the appearance of wrinkles. The mask is also moisturizing, which can also help give skin a healthy look, Gary Goldenberg, M.D., medical director of the Dermatology Faculty Practice at the Icahn School of Medicine at Mount Sinai, tells SELF. As for claims that the mask can reduce hyperpigmentation, Goldenberg says it’s possible. “The mask likely improves pigmentation by improving moisturization of skin,” he says, adding that the mask contains nicotinyl dipeptide, which has also been shown to improve pigmentation. While the mask’s copper peptides can help combat wrinkles, moisturizing treatments in general help because they “plump up” the skin around the wrinkles, Goldenberg says. “This decreases the appearance of the wrinkle, but doesn't actually remove it.” (Instead, dermatologists typically recommend laser resurfacing, which directs short, concentrated pulsating beams of light at skin to combat wrinkles.) Masks can give you highly concentrated treatments and instant benefits, but they’re made to be used here and there, Zeichner says. Meaning, you can’t rely on a mask for all of your skincare needs. On a daily basis, he recommends protecting your skin in the morning with a combination of antioxidants (via a serum or cream) and sunscreen. In the evening, focus on repairing it to stimulate collagen with ingredients like retinol, he says. If you’re willing to shell out the $29 to try it, go for it. Experts say the Hanacure masks are beneficial and can be incorporated into your overall long-term anti-aging routine. If you aren't sure what's best for your skin, visit your dermatologist for a skincare consult. Remember, treating your skin well isn’t as simple as using a one-off mask—take good care of it all the time and your selfie will thank you later. Check out Barrymore's Hanacure pic... This content can also be viewed on the site it originates from. By Ashia Aubourg By Julia Ries By Sarah Madaus …And these real-life Hanacure mask selfies: This content can also be viewed on the site it originates from. This content can also be viewed on the site it originates from. Related: SELF does not provide medical advice, diagnosis, or treatment. Any information published on this website or by this brand is not intended as a substitute for medical advice, and you should not take any action before consulting with a healthcare professional. More from Self Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. SELF may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "datetime": "2017-04-14T19:20:51.298Z",
    "url": "https://www.self.com/story/hanacure-face-mask"
}