{
    "title": "Hidden Champion, BIOPOLYTECH to Export K-beauty to Overseas Markets with Its Cosmetic Brands SKINUA | Business Wire",
    "text": "- BIOPOLYTECH is selected as export success package project by \n      Ministry of SMEs and Startups of Korea CHEONGJU, South Korea--(BUSINESS WIRE)--BIOPOLYTECH \n      Co., Ltd., a company specializing in natural materials, is going to \n      enter Southeast Asian markets on a full-scale.  BIOPOLYTECH Co., Ltd. announced that they plan to target South East \n      Asian markets based on Vietnam and Indonesia with major Cosmetic brands \n      such as ‘SKINUA’ and ‘ANGEL BEBE’ after being selected for a successful \n      export package project by the Ministry of SMEs and Startups of Korea. BIOPOLYTECH Co., Ltd., which has already been recognized for its \n      commerciality at major online and offline stores such as Shinsegae Mall \n      and Lotte Department Store, is famous for producing products that \n      provide high customer satisfaction in baby skin care categories and mask \n      packs. Brand SKINUA's \n      signature products include Bio-Cellulose Mask, Ultra W Modeling Mask, \n      Natural Mask, and Pure O2 Mask. In particular, Bio-Cellulose Mask is a premium mask pack made by mixing \n      high-concentration serum with 3-generation coconut jelly sheet mask. This product is characterized in that evaporation of the active \n      ingredient of the serum is suppressed by using a sheet having high skin \n      adhesion feeling. Compared to mask packs for normal cotton sheets, water and nutrients can \n      be transferred to skin and moisturized skin for a long time. Ultra W modeling mask contains gold and collagen active ingredients to \n      make skin texture smoother. Natural mask contains natural moisturizing \n      ingredients such as pearl, collagen, aloe and snail. O2 Bubble Mask Pack, which is specially designed to remove wastes from \n      the skin with fine bubbles, is also the representative mask product of \n      SKINUA. Jeong-Hun Lee, CEO of BIOPOLYTECH Co., Ltd. said, \"With this export \n      project, SKINUA will become a mask brand representing K Beauty and plans \n      to advance into the global market based on Vietnam and Indonesia.\" The export success package business sponsored by the Ministry of SMEs \n      and Startups is a program to support the marketing required for overseas \n      market development activities for domestic and export companies wishing \n      to enter the global market. BIOPOLYTECH \n      Co., Ltd. has passed a global competency evaluation and receives \n      support on-off line marketing activities for entering overseas market \n      such as trade education, field research, and design development.  BIOPOLYTECH Co., Ltd.Jeong-Hun Lee, +82-43-212-9144qqlijh1234@hanmail.net  BIOPOLYTECH plans to export its cosmetic brand SKINUA's signature products: Bio-Cellulose Mask, Ultra W Modeling Mask, Natural Mask, Pure O2 Mask. BIOPOLYTECH Co., Ltd.Jeong-Hun Lee, +82-43-212-9144qqlijh1234@hanmail.net  ",
    "datetime": null,
    "url": "https://www.businesswire.com/news/home/20180830005333/en/Hidden-Champion-BIOPOLYTECH-to-Export-K-beauty-to-Overseas-Markets-with-Its-Cosmetic-Brands-SKINUA"
}