{
    "title": "High heels: is beauty really worth the pain? - The Collegian",
    "text": "Wearing high heels is classy way to dress up any outfit, but walking around in teetering heels can do more than add extra inches in height. Wearing high heels can cause both short-term pain and long-term physical consequences. “The pain is terrible in the arches of my feet and my ankles when I wear heels,” said Jessica Burns, freshman in engineering. “I actually end up taking my shoes off or changing into flip flops before I even get home.” Wearing any type of shoe puts the foot, and ultimately the rest of the body, in an unnatural position, said Kyle Miles, graduate student in kinesiology. Miles has conducted research on the effects of footwear on physical movement, including running in shoes versus running barefoot. “If it were possible, it would be best if we all walked barefoot all the time,” Miles said. Since walking around barefoot can present some physical and social barriers, there are some footwear options that are less damaging than high heels, and more practical for all-day or active wear. Miles stressed that heel elevation should definitely be limited and recommended that women wear flat shoes whenever possible. “If it is not possible to avoid heels, women should try and spend at least one-third of their day wearing flat shoes,” Miles said. “They should save the heels for special occasions.” He explained that elevated footwear causes the vertical plane of the body to become unbalanced. It can also effect the spine when weight gets transferred to the balls of the feet. Consequently, this unbalance can harm the knees, ankles, calves and back, Miles said. Elevated or tight footwear that cram your feet can also weaken tendons and ligaments. Joe Meador, Topeka-based technical designer for Payless ShoeSource, agreed, saying that high heels put the foot in an unnatural position and result in damage. “High heels are a challenge,” Meador said. In addition to stress from wear alone, Meador added that the platform from high heels gives women an extra inch to go down if they fall. Shoe inserts are an option to give the foot more padding and support  in order to reduce pain. They can improve overall comfort if used correctly. However, Meador said that some shoes are not designed to have inserts, and they can cause more harm than good. “The interior of a shoe is designed to fit a foot, so putting something else in the shoe provides less room,” Meador said. He suggested that women should carry flat shoes along to change into after wearing high heels whenever possible. Although flat shoes are recommended, Burns finds flats a challenge at times. “Sperrys and close-toed shoes hurt my feet if I wear them for a long time,” Burns said. Burns wears fashion riding boots for all-day, active wear around campus, a solution she finds relatively comfortable. “They were uncomfortable at first. They were stiff and hurt my heels until I broke them in,” Burns said. When she does wear heels, Burns has found ways to avoid some of the discomfort. “Wedges are more comfortable opposed to stilettos or pumps and give my feet more support when I do wear heels on special occasions,” Burns said. Unfortunately for Burns, the highest fashion heels can bring not only physical discomfort, but also financial pain. “I end up spending $90 on shoes that are miserable to wear,” Burns said. Although high heels continue to be a mainstream trend, they can take a physical toll when worn regularly. Like many other things in life, high heels, it seems, are best used in moderation. ",
    "datetime": "2013-02-14T03:32:57+00:00",
    "url": "https://www.kstatecollegian.com/2013/02/13/high-heels-is-beauty-really-worth-the-pain/"
}