{
    "title": "How K-beauty brands Kaja and I Dew Care became TikTok favorites - Glossy",
    "text": "This year has proved to be a boon for beauty brands on TikTok, with many like NYX and E.l.f Cosmetics breaking TikTok records through paid campaigns. But now the focus is on more unpaid efforts to achieve brand awareness, with brands honing in on specific strategies. Among them are MBX-owned brands Kaja and I Dew Care. Kaja joined TikTok in Nov. 2019 and now has 1.4 million followers, while I Dew Care started its channel in Dec. 2019 and has around 410,000 followers. Neither account was a primary focus for the brands until March, when TikTok began seeing larger audiences due to quarantine and both brands realized it was a bedrock for community engagement, said Dino Ha, MBX CEO. Ha said he attributes I Dew Care’s and Kaja’s success on TikTok due to their key K-beauty positioning, which focuses on packaging, texture and color instead of mimicking popular dances. “When we first created our TikTok accounts, we didn’t have people dancing on the account, because we thought there were enough people providing that experience,” said Ha. “We focused on how to tell the story of products in a different way, through music and through showing more of the texture and color of our formulas. And that was a home run for us.” Though brands like Huda Beauty (2.6 million followers), Kylie Cosmetics (1.5 million followers) and Milk Makeup (423,000 followers) rank above Kaja and I Dew Care, the two indie K-beauty brands are still some of the most-followed brands, ranking above Anastasia Beverly Hills (19,600 followers) and MAC (51,500 followers). Specifically, both Kaja and I Dew Care often post videos featuring popular audio and song tracks while a person’s hand opens and closes the brand’s stacked eyeshadow, unboxes products or swatches colors. Kaja and I Dew Care also use TikTok to tease new products, starting about three weeks before the launch date. Trina Albus, founder of social media and influencer marketing company Magenta Agency, noted that Kaja has two posts that have seen more than 10 million and 16 million views, respectively. They feature what she calls the “TikTok triple threat” of product texture, close-ups and ASMR. For I Dew Care, all six posts that have more than 1 million views (except for one) combine close-up video and texture. Ash Stahl, managing director of TikTok creative studio Flighthouse, said that despite the oft-repeated songs and similar video styles, TikTok is less demanding of entirely fresh and new content. “A lot of beauty brands try to show the quality of the product, but what Kaja and I Dew Care are doing is showing the shapes, the packaging and the colors, which are [in-line] with the TikTok beauty aesthetic,” she said. TikTok is now the No. 1 place for community engagement for both brands, Ha said, and it will become a cornerstone of MBX’s omnichannel strategy. Kaja’s TikTok account sees 24% engagement, as measured by comments, likes, shares and reactions, versus views. And about 10% of the brands’ TikTok followers gravitate to following the two brands on Instagram. In addition to TikTok follower growth, I Dew Care entered into Costco.com and Target.com in October, while Kaja expanded beyond Sephora by joining Amazon. The retailers and their hashtags are often featured in TikTok videos for both brands. I Dew Care sales increased 36% year-over-year between the first and third quarters 0f 2020, but Ha declined to share Kaja sales figures. MBX, which also owns K-beauty brands Pony Effect, I’m Meme and Nooni, expects to grow its sales in 2020 after initially anticipating a decline of 10-20% due to Covid-19. “What we’re focused on today with TikTok is really growing that community as fast as we can engage with them, and as often as we can,” said Ha. “We are seeing a correlation [between TikTok] and the increase in our dot-com traffic and the time spent on our e-commerce sites, but not a direct correlation in terms of sales. We do believe that we will narrow that gap between TikTok engagement and sales in the next few years.” Get news and analysis about fashion, beauty and culture delivered to your inbox every morning. ",
    "datetime": "2020-11-04T05:00:13+00:00",
    "url": "https://www.glossy.co/beauty/how-k-beauty-brands-kaja-and-i-dew-care-became-tiktok-favorites/"
}