{
    "title": "How to Fight Fine Lines and Wrinkles, the K-beauty Way | Expert Insight, Product Recommendations | Allure",
    "text": "By Devon Abelman All products featured on Allure are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission. South Korea didn't become the home of glass skin simply because of good PR and amazing genetics. The epitome of K-beauty in America — smooth, clear, seemingly poreless complexions — is actually an act of lifelong dedication to glowing, healthy skin. It's not the result of one miracle product that we often vie for here in the U.S. Just as Koreans approach acne completely differently from Americans, fine lines and wrinkles have their own course of action that is uniquely Korean. In fact, Seoul is a growing hub of innovative medical technology to combat fine lines and wrinkles with injectables and laser treatments, says Daniella Jung, the founder and CEO of Seoul-based K-beauty incubator agency Most Inc. \"Ulthera, Thermage, and InMode have a huge market size in Korea,\" she adds. \"We are super obsessed with having 'perfect' skin.\" I asked Korean beauty experts, as well as board-certified dermatologists based in Seoul and New York City, to share with Allure what exactly separates Korea's ways of fighting fine lines and wrinkles from America's. If you ask Sophia Hong, an aesthetician licensed in Korea and founder of sheet-mask subscription service Mask Moments, Koreans start treating fine lines and wrinkles the second they are born. Y. Claire Chang, a Korean-born, New York City-based, board-certified dermatologist, will tell you the same thing. \"Most Koreans take a preventative and multifactorial approach\" to aging and often start preventative skin-care routines early in their lives, Dr. Chang adds. Children are taught the importance of cleansing, exfoliating, and moisturizing their skin alongside other typical hygiene practices, like brushing their teeth, Hong says. Let's be real, most kids in America aren't truly taught to care for their skin until puberty wrecks havoc on it. Speaking from personal experience growing up in Florida, I didn't own a face wash until I was about 13. But I often watch The Return of Superman, a Korean reality show about celebrity dads taking care of their children solo while their mothers are out and about, and those adorable babies are constantly shown washing their faces of their own volition, which amazes me each time. It's as if, along with the alphabet, they are taught facial cleansing is the most important part of a skin-care routine, as I've learned from Ban Jae Yong, a board-certified dermatologist in Seoul and director of Banobagi Dermatology Clinic. The Western approach to skin concerns, in general, veers more toward treating them after they strike rather than preventing them from happening. For Koreans, on the other hand, skin care is \"about creating a healthy environment for your skin before it shows signs of aging,\" Hong explains. \"When your skin is in this optimal state of hydration and balanced, your skin is in an environment to heal itself, and thereby, signs of aging can be delayed.\" Board-certified Korean dermatologist Choi Bo Youn supports Hong's statements, noting, that if you continually allow your skin to get dry, wrinkles are sure to appear. With that in mind, Koreans, again, constantly keep their skin hydrated and nourished in any way they can. Dr. Choi says she continuously slathers on moisturizer from the second she gets home from work to when she falls asleep at night. A K-beauty product is rarely marketed as an anti-wrinkle solution — let alone specifically for mature skin. In fact, harsh active ingredients Americans have long sought out to combat signs of aging, particularly retinol, are much less popular in Korea because Koreans prefer to avoid their drying and irritating side effects, Dr. Chang says. Retinol has only been added to over-the-counter Korean skin-care products within the past couple of years as K-beauty has gained worldwide appeal. The C-K-D Retino Collagen Small Molecule 300 Cream is becoming a best seller at Olive Young, Korea's version of Sephora-meets-Ulta Beauty, due to this recent formulation trend, according to Euniunni, a K-beauty expert and content creator. Even bakuchiol, which has been a trendy retinol alternative in America since about 2018, is just now having its moment in the Korean skin-care industry, Jung says. If you need a recommendation, check out the Neogen Real Firming Bakuchiol Serum. Skin-care offerings for firming, plumping, and brightening are, instead, commonly formulated with peptides, niacinamide, red ginseng, hyaluronic acid, and licorice root extract, Dr. Chang notes. (Allure's Ingredient Index can share more on the intricacies of each one.) The Elishacoy Youth Water Face & Eye Cream and Donginbi's Red Ginseng Power Repair Anti-Aging Ampoule Concentrate are Allure Korea's favorites, featuring these additions. Personally, I'm a fan of the Rovectin Lotus Water Cream and Cosrx Advanced Snail Peptide Eye Cream. The best-selling products in Korea also tend to target inflammation, Hong points out. The wide variety of cica-spiked products is exhibit A. \"This makes sense because our skin is prone to inflammation as we get older, which causes visible signs of aging,\" she says. Some notable ones include the Round Lab 1025 Dokdo Toner and Mediheal N.M.F Intensive Hydrating Mask. By Aliza Kelly By Gabi Thorne By Gabi Thorne K-beauty products also focus a lot more on strengthening the moisture barrier and microbiome for the ultimate skin-care way of wrinkle prevention. (Western skin care is slowly but surely catching up.) After all, a damaged barrier can make skin look and feel rough, dull, flaky, and red, as New York City-based, board-certified dermatologist Kenneth Mark previously shared with Allure. Some standouts in this category are the Real Barrier line and Etude Soong Jung 2x Barrier Intensive Cream. A dermatologist in Seoul once told me off the record that they don't have any wrinkle-targeting products in their skin-care routine because they don't believe in them. Instead, they trust in the power of SPF and in-office treatments to keep skin bright and smooth. Dr. Ban echoed that dermatologist's sentiments, adding that sun protection is the number-one way to shield skin from fine lines and wrinkles. As we learned on the wrinkle-themed episode of Allure's Science of Beauty podcast, unprotected skin exposed to UV light has an increased susceptibility to collagen and connective tissue damage below the surface. The importance and accessibility of sunscreen are also much more commonplace in Korea. SPF from K-beauty brands come in silkier, sheerer, lighter-weight textures and easier delivery systems, like cushions and non-skip sticks that are simple to reapply. Playing golf is extremely popular in Korea, which has led to the rise of special SPF patches, as Odile Monod, a K-beauty industry expert based in Seoul, has recently brought to my attention. They adhere like oversize pimple patches to provide your face with the utmost protection from the sun. (Sadly, the patches aren't available in America just yet.) Speaking of in-office treatments, Korean dermatologists' and plastic surgeons' offices line the streets of Seoul's Gangnam neighborhood and offer the latest and greatest ways to prevent and treat fine lines and wrinkles. Due to high demand and a wider variety of options, \"The cost can often be cheaper than what you find in the states,\" Hong says. And Koreans often start receiving in-office treatments when they are in their early 20s, Dr. Chang says. They'll visit their dermatologist on a weekly or biweekly basis for hydrating facials and laser treatments to help brighten and rejuvenate their skin. \"There is also a trend over the past several years to start preventative Botox and fillers early,\" she adds. Of course, botulinum neurotoxins, such as Botox, Xeomin, and Medytox, are the most obvious option to help smooth and prevent fine lines and wrinkles. After all, the results after just two weeks are far and away better than what any skin-care product can do, as one Korean dermatologist also unofficially told me. Clinics offer neurotoxin injectables made in Korea that are much cheaper than America's options, so getting Botox is less of an investment and more of a routine maintenance procedure. By Aliza Kelly By Gabi Thorne By Gabi Thorne Korean dermatologists inject neurotoxins in a variety of different ways beyond what we are accustomed to in America. As Allure has often reported, Skin Botox is an extremely in-demand procedure in Seoul. Shallow pricks of botulism neurotoxins are inserted all over the face just below the surface for more of a smoothing effect than a muscle-freezing one. (You can check out our in-depth guide to Skin Botox.) Baby Botox is also a popular preventative option among younger patients, Dr. Chang says. Botox is often used to lift jawlines and the corners of the mouth, says Cho Yun Joo, a board-certified dermatologist based in Seoul. The latter is done because the mouth is prone to drooping as we age. And Sang Wook Lee, a board-certified dermatologist at Seoul's Yezel Clinic, tells Allure that he also uses Botox to lift droopy undereye areas and give patients incredibly subtle facelifts. \"I put it near the scalp to lift the face,\" he adds. Skin Botox is often combined with platelet-rich plasma (PRP) therapy, a.k.a. a vampire facial, at Dr. Lee's clinic. Many of the Korean dermatologists I've interviewed over the years have lauded PRP's uncanny ability to improve fine lines and wrinkles and have called it the future of skin care. You can dive into the blood-based process here. In December 2021, the U.S. Food and Drug Administration (FDA) approved an updated label use of Sculptra, a poly-L-lactic acid-based biostimulator that triggers the natural process of collagen production, to iron out lines and wrinkles. Prior to 2009, the FDA allowed it to be used only as a treatment for HIV patients experiencing lipoatrophy, or severe fat loss, in the face, Michael Somenek, MD, a Washington, DC-based, board-certified facial plastic surgeon and participant in the recent FDA study trials, told Allure. However, in Korea, it's long been another beloved injectable option alongside its Korean equivalents. Sculptra is often administered into nasolabial folds (or smile lines) and other areas of concern to boost collagen cell regrowth, Dr. Lee says. \"The good thing about this is that it has long-term effects lasting up to two years,\" he adds. People in Korea are less into facial fillers and favor injectables that replenish and boost collagen production on a cellular level, like Sculptra, Dr. Lee says. Consequently, hyaluronic acid-filled syringes, like Restylane and Juvéderm, are more likely used to help moisturize the skin on a cellular level. (This procedure is nicknamed the \"water glow injection.\") In America, we are more accustomed to using them to augment and plump faces. Koreans are also all about what's often called \"skin booster shots,\" which do just that. I like to think of them as superpowered versions of my favorite skin-care products mainlined directly into my skin cells. I received the most popular skin booster — the Chanel injection — the last time I traveled to Seoul. Professionally known as Filoga 135, this shot is infused with amino acids, hyaluronic acid, and vitamins A, B, C, and E and injected all over the face for brighter, plumper skin in two weeks. It also helps stimulate collagen production for about three to four months. By Aliza Kelly By Gabi Thorne By Gabi Thorne Another amazing injectable innovation that's highly sought after in Korea is called Rejuran, which features the magical healing powers of salmon DNA. Also known as PDRN, short for polydeoxyribonucleotide, this salmon extract is a 95 percent match to the human DNA that has anti-inflammatory and tissue-repairing properties. Dr. Choi says it also boosts general skin health, making it thicker and tighter. Although it's injected all over the face, Dr. Lee might add it to his patients' undereye area if it's sunken in or droopy. Dozens of high-powered skin-care devices are at Korean dermatologists' disposal at their clinics, but two non-invasive lasers stand out the most: Ulthera and Thermage. Starting in their 30s, patients will begin getting one treatment — or both — during their weekly appointments to help \"stimulate collagen deep in the skin to help prevent skin laxity, crepiness, and jowling in the future,\" Dr. Chang says. Just like with skin-care routines, consistency with lasers is key to effective, noticeable results. Dr. Ban, who is in his 50s, admits that Thermage is the biggest reason he looks so young. (I can attest to how youthful and stunningly dewy his complexion is.) For those unfamiliar, Thermage tightens and firms skin by stimulating collagen production via zapping the inner layers of skin with radio frequencies. Ulthera, on the other hand, lifts and tightens with ultrasound energy that heats skin tissue and also stimulates new collagen. Thread lifts have migrated to America in recent years, so they probably need no introduction. \"To treat existing mild to moderate skin laxity, thread lifts are more commonly performed in Korea than in the U.S.,\" Dr. Chang notes. But that's just the beginning of how threads are wielded by Korean dermatologists and plastic surgeons. Several new shapes and densities are entering the market to advance their use in cosmetic procedures. The next wave of the thread trend focuses on adding volume instead of lifting, says Dr. Lee. He refers to this procedure as \"mood threads.\" Typical threads are barbed, but mood (or mono) threads are smooth. They are placed below the surface of skin vertically without any upward tugging to boost collagen and encourage skin to iron out fine lines and wrinkles on its own, he adds. No matter where you live, \"perfect\" skin is and always will be a societal construct, as well as the idea of finding one product that will be your own personal fountain of youth. No one truly needs to achieve either ideal skin or avoid signs of aging. Fine lines and wrinkles are marks of our journeys through life. They are reminders of how far we've come. By Aliza Kelly By Gabi Thorne By Gabi Thorne However, you're allowed to put as much effort into your complexion as your heart desires. I know how important spending time on an extensive skin-care routine can be to my mental health and have met dozens of people who share this mindset. Caring about your skin is often the first step toward placing more importance on the rest of your physical health. Read more about Korean beauty methods: Now, watch beloved Korean makeup artist Pony Park create a quick liner look: Follow Devon Abelman on Twitter and Instagram. You can also follow Allure on Instagram and Twitter, or subscribe to our newsletter to stay up to date on all things beauty. By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Nicola Dall'Asen By Fani Mari By Devon Abelman By Dianna Mazzone More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2022-04-12T15:00:00.000Z",
    "url": "https://www.allure.com/story/how-to-treat-fine-lines-wrinkles-in-korea"
}