{
    "title": "How To Create Glass Nails | Allure",
    "text": "By Renee Jacques It's safe to say that glass nails are the ultimate nail-art trend of the year. But it's also safe to say that the idea of attempting to create them on your own, with your own hands, in the comfort of your own home is pretty intimidating. Well, it just got a lot easier. Soko Glam (one of our favorite sources for all things pertaining to Korean beauty) just released a tutorial that breaks the entire manicure down into a manageable step-by-step process. Sable Yong, the senior digital content manager at Soko Glam, got a chance to hang out with Park Eun Kyung, the original creator of the glass nail-art concept. The iridescent nails became such a hit that Park collaborated with K-beauty brand AmorePacific to create a set of nail stickers (which you can get at Soko Glam) that make it easy to DIY the trend. To DIY the look, in addition to the stickers, you'll also need any nail polish in a solid shade (this will serve as your base layer and the background of the nails), a clear gel polish for a topcoat, and a pair of tweezers. After you've painted your nails with the base color and let them dry fully, use the tweezers to cut out each little \"glass shard\": Then use the tweezers to place each shard in whatever configuration you like on your nail. \"I find that using the film sticker sheet #1 [the pink sheet] is a bit easier in terms of placement, since the Emerald sheet #2, has geometric or jewel-like designs that demand proper placement to maintain the shape,\" explains Yong. By Aliza Kelly By Gabi Thorne By Gabi Thorne Repeat this process until your nails start to look something like this (keep in mind, it took Yong an hour to complete this process, so don't feel bad if it takes you a while): Once all the stickers are on, apply two to three layers of the gel topcoat, allowing time to dry between each one. \"What you want is for the topcoat layer to completely cover all the edges of the sticker, so you don't feel their raised texture—this is to prevent them from peeling off,\" writes Yong. Here's what her finished results look like: By Aliza Kelly By Gabi Thorne By Gabi Thorne For additional advice about applying the stickers and making sure the glass nails you worked so hard on actually stay on for a decent amount of time, check out Yong's tutorial on Soko Glam. Nail art for short nails: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Chelsea Avila By Chelsea Avila By Gabi Thorne By Gabi Thorne More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2015-12-03T16:30:00.000Z",
    "url": "https://www.allure.com/story/glass-nail-design-tutorial"
}