{
    "title": "How JCPenney is filling the Sephora gap",
    "text": "As JCPenney winds down its partnership with Sephora, the retailer is launching its new beauty section this fall with partners and a wide range of indie and inclusive brands. On Thursday, the retailer will announce that over 170 brands will be included in JCPenney Beauty, its new in-store and online beauty shopping section that officially launches in October in 10 select stores and online. To curate a portion of its brand selection, JCPenney relied on B2B beauty marketplace Landing International and inclusive beauty e-tailer Thirteen Lune. JCPenney Beauty is expected to be rolled out into all 600 stores by 2023, after its Sephora partnership ends in 2022. Michelle Wlazlo, the evp and chief merchandising officer at JCPenney, described the new offering as “hyper-inclusive.” It will include mass, masstige and prestige brands. According to a JCPenney spokesperson, “nearly half” of the brands stocked will be in the masstige category. “Our customer told us they wanted a broader assortment of brands at different price points, and to better meet those needs, we created JCPenney Beauty,” said the spokesperson. As Sephora locations are phased out, the retailer is remodeling its beauty spaces with an open floor plan and natural wood. Thirteen Lune will have a branded shop-in-shop section. The 10 store locations that will be open in October are based in Davenport, FL; Dearborn, MI; Greenville, NC; McAllen, TX; Mesquite, TX; Niles, OH; Springfield, MO; Saint Cloud, MN; Trumbull, CT and Whittier, CA. The retailer worked with Landing International to curate a group of 17 minority-owned indie brands from the platform to be sold as part of the lineup. The group includes brands from Landing International’s roster of BIPOC-owned brands including Kmoni Cosmetics and Everyday Humans. The platform’s selection includes several K-beauty brands such as Cosrx and Hanskin. “We reviewed probably over 100 brands with them, and we really chose ones that were unique and different,” said Sarah Chung, CEO of Landing International. Thirteen Lune, meanwhile, curated a grouping of 39 brands for JCPenney that are also available on its own site. They include Wander Beauty, which is also stocked at Sephora, as well as other indie brands such as Shaz & Kiks, Joanna Vargas, Anové and Pholk. Pholk, a skin-care brand focused on consumers with melanin-rich skin or those who are vegan/plant-based, is targeting millennials with this launch. “Growing up in Kentucky, I would always go shopping at JCPenney with my mom and my friends. The company offered the beauty and wellness experience I wished every store offered back in the day,” said Niambi Cacchioli, the founder of Pholk. “As a small, Black-owned business, the fact that we have the opportunity to launch with JCPenney and Thirteen Lune is thrilling because the focus is on inclusivity is directly tied to our brand values,” said Evonna Kuehner, the founder of skin-care brand Anové. JCPenney’s in-house team curated the remainder of the brand list, which includes JCPenney-exclusive brands Mirabella and Makeup Geek, as well as I’m Meme, Nooni, Kleem Organics and Better Natured Haircare. The expansion into these retailers brings the “possibility for scale, growth and profitability, while also bringing so much recognition [to] and amplifying these brands we’re in partnership with,” said  Nyakio Grieco, founder and CEO of Thirteen Lune. For Thirteen Lune, the partnership is “a game-changer, when you think about going from being a platform that’s operating and performing above our expectations to now having this omnichannel experience where we’re going to have a 600-door footprint,” said Grieco. JCPenney settled a legal dispute with Sephora in May 2020 after the department store accused Sephora of attempting to back out of its long-term contract early. After the two parties renegotiated, Sephora announced its new partnership with Kohl’s in December 2020. “Sephora inside JCPenney will continue to operate both in-store and online through the transition to our new Beauty experience. We are committed to the current partnership, which will expire late 2022,” said a spokesperson for JCPenney. The JCPenney offering provides a new department store opportunity for indie brands exiting Kohl’s due to its Sephora partnership. Kmoni Cosmetics, for example, was previously stocked at Kohl’s via Landing International before Sephora took over the retailer’s beauty section. “When you work with indie brands, you get to bring in different types of things,” said Chung. “There is more innovation when you bring in indie brands, [and] you get products that are targeted more to people of color.” Below is the full list of Thirteen Lune brands entering JCPenney Beauty: Afropick\nAnové\nBossy Cosmetics\nCanviiy\nCashmere Moon\nCeylon\nCTZN Cosmetics\nExa\nGloryscent\nGlosshood\nGolde\nJoanna Vargas\nKadalys\nKaike\nLiha Beauty\nMischo Beauty\nMora Cosmetics\nPholk\nPrados Beauty\nPrim\nSara Happ\nShaz & Kiks\nSkot Beaute\nSundree\nTail-Lite\nUnsun\nVaycay\nWander Beauty\nBeija Flor Naturals\nBomba Curls\nButtah\nKarite\nMary Louise Cosmetics\nNaturally Drenched\nPSA\nSpraise\nSwitch2Pure\nVernon François\nVisha Skincare The brands curated via Landing International are: Cosrx\nPure Lotus\nNeogen\nUnplugged Essentials\nThe Renatural\nSt. Moriz\nClean Circle\nEveryday Humans\nKmoni Cosmetics\nWhen Beauty\nCommon Ground\nBy Wishtrend\nHanskin\nIsntree\nLeaders\nO.R.G Skincare\nKeep Cool Get news and analysis about fashion, beauty and culture delivered to your inbox every morning. ",
    "datetime": "2021-09-30T09:45:15+00:00",
    "url": "https://www.glossy.co/beauty/how-jcpenney-is-filling-the-sephora-gap/"
}