{
    "title": "How to achieve the ultimate K-beauty look in 7 simple steps - ABC News",
    "text": "When people think of K-beauty, many often think of using Korean beauty products When people think of K-beauty, many often think of using Korean beauty products like face masks and serums. But makeup guru Edward Avila says it’s so much more than that. \"It's about a certain look,\" said Avila, who is one of YouTube's most popular K-pop makeup artists. \"It's about pretty, natural and soft makeup that enhances your natural features.\"  Avila, who is based in Seoul, South Korea, spoke to \"Good Morning America\" at this year's KCON in Los Angeles, a convention drawing thousands to celebrate the best of Korean food, fashion, beauty, music and culture. Korean culture has made a significant impact in pop culture with the chart-topping success of K-pop music groups like BTS and BlackPink.  \"Despite the language barrier, K-pop is so appealing because whatever music it is, people like the melody and the sound,\" Avila said. \"So language doesn't matter.\" With the popularity of K-pop music, fans have even become drawn to the K-pop style. \"K-beauty and K-pop go hand in hand,\" said Avila. \"It's universal for both men and women.\" Avila educates his 1 million YouTube subscribers on different K-beauty products and how to create looks like their favorite K-pop stars. Avila showed \"GMA\" how to achieve the perfect everyday K-beauty look in seven simple steps. 1. Base Layer Start with a peach or salmon-tinted color corrector to place on any imperfections like redness or hyperpigmentation on the face. Be careful not to put too much on because concealer and foundation will also go on top of the color corrector. 2. Foundation and concealer For many, foundation and concealer are some of the main products used in everyday makeup routines. In K-beauty, foundation and concealer are critical in achieving that flawless K-beauty look. Apply the foundation as thin as possible and then apply concealer to red areas. For larger red areas, use a liquid concealer. Use a cream concealer on dark circles for lasting coverage. 3. Brows Avila says that the K-beauty brow is a straight brow with a slight arch at the end. Keep the eyebrow shape soft by using an eyebrow pencil. If pencils are too difficult to use, he recommends a powder-based product.  4. Eyes Since the K-beauty look is very natural, Avila doesn't go crazy on the eyes with vibrant colors. Instead, he focuses on defining the eye with just a base color, a color to deepen the base color and maybe a pop of shimmer. Using a base color similar to your skin tone, apply the shade all over the lids. Then, use a deeper shade on the outer corner of the lids to elongate the eyes. A hint of shimmer on the top of the lid will make the eyes pop. Avila says he likes to use an eyeliner pencil to line the water and lash line of the eyes. Finish the eye look with your favorite mascara. 5. Contour and highlight With the K-beauty look very soft and natural, Avila said to use minimal contouring and highlighting product on the face and keep the focus on the center of the face by contouring the jawline. Avila uses a fluffy brush to contour the jaw area and a small, thin brush to apply highlighter to the bridge of the nose and cheekbones. 6. Powder Mattify the entire look by powdering shiny facial areas. Avila uses powder with a fluffy brush on the forehead and around the nose. 7. Lips Finish everything off with a pop of color on the lips. Avila said that in K-beauty, creating a fuller lip -- an \"overlip\" -- is the latest trend. To achieve a fuller lip, Avila uses a concealer all over the lip as a base, then he mattifies the lip with a powder. The final step is to top everything off with a pop of color.  24/7 coverage of breaking news and live events ",
    "datetime": null,
    "url": "https://abcnews.go.com/GMA/Style/achieve-ultimate-beauty-simple-steps/story?id=65624214"
}