{
    "title": "How a K-beauty start-up grew its business by 80% with the help of video commerce",
    "text": "Or wait... Headlines Brand Innovation Formulation & Science Packaging & Design Business & Financial Market Trends Regulation & Safety Promotional Features Site Archive Multimedia Regions All Asia-Pacific South East Asia South Asia East Asia Oceania Site Archive Multimedia Hot topics Clean & Ethical Beauty Sustainability COVID-19 Market Entry Anti-Aging / Skin Whitening Beauty From Within Nanotechnology Green Cosmetics Site Archive Multimedia Resources Type of resources Events All Events Shows & Conferences Online Events Editorial Webinars Events China 中国 Podcast  13-May-2019\n                            - Last updated on\n                                13-May-2019 at 23:49 GMT With its marketing savvy, the brand managed to grow by 80% from 2017 to 2018. “We didn’t become a well-known brand in a day. It took more than seven or eight years since we started the brand,”​ said Jeff Yoon, the brand’s senior marketing director. Yoon said the firm was very aware that they had to focus on building up brand awareness from the start. “The conventional way of doing business is to go through a franchise or a wholesaler, but we has a different approach of going online first. But we did not focus on just selling products. We wanted to build the brand name in Korea.”​ He added that the company built up its name by using social media marketing to target younger consumers. “We noticed that the younger generation of consumers were beginning to pay more attention to their looks and we used social media marketing methods to reach out to them.”​ Yoon expressed that the advantage of social media marketing was its ability to transcend the limitations of time. “There’s no day and night on social media, so we were able to work all day and all night as well.”​ The hard work of building up brand awareness paid off for the company. “After we became well-known online, we entered franchises like Olive Young and Watsons… and they came to us,” ​said Yoon. However, Yoon said Grafen exploded when the company began filming short videos about its products for its social network channels. “We started the video commerce method just two years ago and it was a real turning point for us.”​ Yoon elaborated that the company recognised there were limitations to showcasing its products in more conventional ways. “We couldn’t expect consumers to come to our website to read about our products anymore. It’s not enough, not today. People don’t pay much attention and they don’t want to waste their time reading articles on all our products.”​ To capture consumers’ short attention spans, the firm decided to tell its story through videos. “Even a 10 or 20 second video is enough to help our consumers understand the function and efficacy of our products. We usually try to put in all the messages we want to deliver to our consumers.”​ This marketing method has proven so successful for the brand, the company has hired an in-house team to churn out content. This year, the company will be focused on expanding its presence into South East Asia. Mainly, the company is focused on Singapore but it is also looking into Malaysia, Indonesia, Vietnam and Thailand, said Yoon. Yoon expressed confidence in the male grooming market in SEA, stating that it was currently in a similar position as South Korea was before. “In South Korea, the younger consumers started to pay more attention to their looks, so the market grew very fast. We believe the same thing will happen in SEA countries.”​ However, Yoon stressed the company does not plan to focus on men’s grooming. He revealed the company planned to launch two new brands targeted at women: JULYME and BEQUE. JULYME will include skin, hair and body care products, while BEQUE will focus on colour cosmetics. Yoon said the company would continue to use its video commerce marketing method to launch the two brands in Korea and in SEA. “We have a proven track record. We know how to introduce products into market. The idea is to take our successful video commerce model and bring it to SEA.”  ​ Copyright - Unless otherwise stated all contents of this web site are © 2023 - William Reed Ltd - All Rights Reserved - Full details for the use of materials on this site can be found in the Terms & Conditions Related topics\nBrand Innovation\nBusiness & Financial\nMarket Trends\nEast Asia\nSouth East Asia\nAsia in Focus\nSkin Care\nHair Care\nColor Cosmetics Show more  Content provided by Naolys | 07-Jul-2023\n                     | White Paper Naolys presents HairRevive [MM+Zn], a pioneering plant-based ingredient revitalizing hair.  Content provided by Provital | 13-Jun-2023\n                     | Product Brochure Circanblue™ is a vegan postbiotic ingredient obtained from Lactococcus lactis that induces a resynchronisation of the skin’s circadian cycle after this... More promotional features ",
    "datetime": null,
    "url": "https://www.cosmeticsdesign-asia.com/Article/2019/05/14/How-a-K-beauty-start-up-grew-its-business-by-80-with-the-help-of-video-commerce"
}