{
    "title": "How Yami is becoming the Amazon of K-beauty and J-beauty",
    "text": "With its new $50 million Series B funding round, Asian online marketplace Yami is doubling down on beauty. Last month, the 9-year-old e-commerce marketplace announced the funding round led by investment companies Altos Ventures and Balsam Bay Partners, which brings its total funding to $60 million. Existing investors J.P Morgan and GGV Capital also participated in the new round. Originally started as an e-commerce outlet for Asian packaged food in the United States, Yami has invested heavily in building up its beauty business. As the retailer has invested more in beauty marketing and ridden the wave of the K-beauty boom in the U.S., beauty now accounts for 35% of its total sales, up from 10% in 2014. “The beauty category is definitely going to get bigger and represent a higher percentage of the business in the future,” said Alex Zhou, founder and CEO of Yami. “More non-Asian customers have started to recognize Asian beauty brands.” The e-tailer sells over 30,000 Japanese, Korean and Chinese beauty products via a direct sales and marketplace model, with warehouses in both the United States and Asia. According to Zhou, K-beauty and J-beauty are the top categories, with K-beauty sheet masks from brands including Dr. Jart and Mediheal among the best-selling products. Prestige beauty is also popular, with SK-II sheet masks and Shiseido skin care also top sellers. K-beauty makeup from brands like 3CE is also popular. Zhou launched Yami in 2013 after spending four years as an international student from China studying in Kansas, where he was unable to find any Asian food at local grocery stores. He introduced the beauty division six months after launching food. “Snacks and beauty are fast-paced Korean categories. That’s why investors like to invest in this space because demand is growing,” Zhou said. The platform launched beauty right ahead of the K-beauty wave in the U.S. According to Euromonitor, South Korea’s beauty exports to the U.S. grew by 59% in 2015, for a total of $207 million. With the recent, massive popularity of K-beauty and Korean pop culture such as K-pop brands like Blackpink in the U.S., K-beauty brands have increasingly made their way into major beauty retailers like Ulta Beauty and Sephora. Yami differentiates itself by its “deep knowledge of the Asian supply chain” and international freight, Zhou said. He added, “better relationships with Asian brands” means it “can offer more Asian beauty product selection at a cheaper price, compared to others in the U.S.” The most recent funding round will be used to invest in talent, a mature supply chain, expanded beauty product selection and technology for customer research, said Zhou. It recently opened a Japan office, and it’s in the process of opening a South Korea office and fulfillment center to “establish a direct relationship with all these Asian beauty brands,” according to Zhou. Currently, he estimates 50-60% of the e-tailer’s marketing budget goes toward beauty, working with influencers across platforms including YouTube, Instagram and TikTok. While marketing efforts targeting U.S.-based Asian consumers are focused on promoting brands they are familiar with, Yami is targeting the entire beauty customer base in the U.S. via these social platforms. It is also investing in exclusive collaborations, recently launching a Yami x Ishizawa co-branded beauty box with the affordable Japanese skin-care label Ishizawa. “For non-Asian customers, we use different strategies [for marketing],” he said. Those strategies focus on content, influencers and affiliate channels to educate them about new brands and products. This is especially useful for K-beauty, which has a rapid innovation pipeline, Zhou said. “For K-beauty, there’s literally a new brand coming up every month,” said Zhou. “But for J-beauty, [the industry] tries to be very stable.” Get news and analysis about fashion, beauty and culture delivered to your inbox every morning. ",
    "datetime": "2022-04-22T04:10:40+00:00",
    "url": "https://www.glossy.co/beauty/yami-amazon-of-k-beauty-j-beauty/"
}