{
    "title": "How to Find the Best K-Beauty Products in Dallas",
    "text": "   Advertisement From\n\nD Magazine\nAugust\n2017 This spring, more than 100 korean beauty products debuted at CVS pharmacies around the country, further strengthening the grip K-beauty has had on our collective consciousness since the craze hit America in 2015. It’s easy to understand the appeal. K-beauty packaging is poppy and whimsical, featuring everything from smiling eggs to panda-shaped containers. There are countless steps, serums, and essences, with extracts ranging from starfish to cactuses, promising a dewy complexion at an affordable price. It’s a lot to take in. Thankfully, Dallas’ Nicole Kwon, who travels to Seoul once a year to visit family and pick up her favorite skin care lines, agreed to spend her morning with us at Carrollton’s Super H Mart, which specializes in Asian foods and beauty products. As we navigated the market’s seemingly endless aisles of dried noodles, “Extra Fancy” brown rice, and snail masks, Kwon pulled her top Korean-made picks for hydrating your skin, boosting digestion, alleviating allergies, and even combating a hangover. Though there are plenty of standout K-beauty brands on local shelves already, Kwon plans to bring her favorite products, including fermented rice cleanser and aloe gel moisturizer (“That just completely changed my skin,” she says), to her eponymous West Village store by this fall. “The Korean skin care I love is all-natural and mostly handmade, but it isn’t exported anywhere,” Kwon says. “I’m excited to introduce Dallas shoppers to simple, effective beauty products that can’t be found in the U.S. market.” —Caitlin Clark K-beauty products are not new. Asian skin care has been around for centuries, of course, but suddenly everyone in the United States is treating K-beauty like it’s some big discovery. And listen, I get it. Korean skin care has great marketing, and panda bear packaging is super cute. But just as Forever 21 chases trends in lieu of quality (the fast-fashion chain was founded by a Korean-American couple), so do most imported K-beauty products. One month it’s all about black tea extract; the next, sweet potato extract. If you’re looking to try a bunch of different products, low-cost Korean options shaped like tomatoes are a great way to figure out what works for you. But if you’re looking for serious, specific skin care, stick to high-end brands like SK-II or AmorePacific (available at Neiman Marcus and Sephora). The packaging may be simple, but so is the list of ingredients. Just keep in mind­ that no matter what your beauty routine entails, always finish it with sunscreen. —Jessica Chen Attractions Bars and Clubs Shops Restaurants 750 North St.Paul St.\nSuite 2100\nDallas, Texas 75201 Tel: 214.939.3636\n \nFax: 214.748.4579 ",
    "datetime": null,
    "url": "https://www.dmagazine.com/publications/d-magazine/2017/august/k-beauty-dallas-h-mart-carrollton/"
}