{
    "title": "How to use a sheet mask the right way | Well+Good",
    "text": "  It's almost guaranteed that at some point, while scrolling through your social media feeds, you've seen photos of your friends—or celebrities—smiling while doing their best impression of Jason from Friday the 13th. Okay, not exactly. But proudly looking like a horror movie villain is just one of ways that Korean sheet masks—the buzzy beauty routine that has taken selfie-loving Americans by storm—have left their (not always visible) mark. Why is just about everyone obsessed with them? \"Sheet masks have been around for over a decade in Korea,\" says Charlotte Cho, co-founder of Korean beauty site Soko Glam and author of The Little Book of Skin Care: Korean Beauty Secrets for Healthy, Glowing Skin. Their popularity can be explained not just because they're highly photogenic, but also because, as she notes, \"people are seeing results and they're relatively affordable.\" \"The sheet mask forms a sort of barrier that really locks the ingredients in and prevents that evaporation\" Indeed, a sheet mask serves a purpose beyond garnering \"likes\" on social media. According to the beauty guru, a lot of skin-care products actually evaporate when you put them on your face (yes, even the pricey ones). \"It takes time for those ingredients to mingle with your skin,\" she says. \"The sheet mask forms a sort of barrier that really locks the ingredients in and prevents that evaporation,\" which explains why your face might feel plumper and looks brighter after using one. There's also the fact that, as Cho points out, the sheet versions don't get dry and hard like some other masks out there (think mud-based products that go on thick). \"Clay really draws out excess oil, but sheet masks are providing moisture and hydrating the skin. And oily skin often needs moisture, even though many people don't realize it,\" she adds. It makes for a very user-friendly experience—yes, sometimes to the extreme. \"People get addicted,\" admits Cho. \"Some people in Korea use one daily—there's a hashtag called 'one mask a day.'\" The typical $2 price per sheet helps fuel the habit, too. {{post.sponsorText}} Which isn't to say that sheet masks are perfect: Turns out many of them are full of alcohol, PEGs, fragrance, and preservatives like phenoxyethanol and ethylhexylglycerin. So despite the trend factor, sheet masks may not be the cleanest beauty category. The good news? We did the legwork and found three that are as natural as they get.  Photo: Instagram/@katyperry  Photo: Joanna Vargas Joanna Vargas Eden Mask, $75 (for pack of 5)  Photo: 100% Pure 100% Pure Ginseng Collagen Boost, $9  Photo: Yes To Yes To Tomatoes Acne-Fighting Paper Mask, $3 Now that your skin is taken care of, what to do with your hair? Here are 11 seriously cool ways to rock the high ponytail—which all look cute with these wellness-obsessed statement tanks. Loading More Posts... The Beach Is My Happy Place—and Here Are 3 Science-Backed Reasons It Should Be Yours, Too Your official excuse to add \"OOD\" (ahem, out of doors) to your cal. 4 Mistakes That Are Causing You to Waste Money on Skin-Care Serums, According to an Esthetician These Are the Best Anti-Chafing Denim Shorts—According to Some Very Happy Reviewers Your Healthiest Relationship  Well+Good Topics For You © 2023 Well+Good LLC. All rights reserved. Read our Privacy Notice, Cookie Notice and Terms and Conditions.           {{ successMessage }} Please wait a moment... ",
    "datetime": "2016-08-11T22:17:33+00:00",
    "url": "https://www.wellandgood.com/how-to-use-natural-koran-sheet-masks/"
}