{
    "title": "How to get glass skin: Best products to achieve the K-beauty skincare trend | The Independent",
    "text": "Please refresh the page or navigate to another page on the site to be automatically logged inPlease refresh your browser to be logged in The Independent's journalism is supported by our readers. When you purchase through links on our site, we may earn commission. Why trust us? A perfectly dewy visage might be just a few beauty buys away Find your bookmarks in your Independent Premium section, under my profile We all dream of skin that looks like Jennifer Lawrence’s in that perfume advert. You know the one, she jumps out of the pool and looks perfect, rather than a drowned rat. Most importantly, we notice she has a perfect and somehow not tired complexion. But this kind of skin doesn’t come from a lack of effort. For anyone who might be running late to the party, the glass skin trend originates from the skincare aficionados of South Korea. It’s all about achieving an almost impossibly clean, even and reflective skin texture, just like glass. Your skin should look naturally dewy without chucking on so much highlighter you look like the tin man. As with other K-beauty trends, the glass skin regimen is pretty long winded. Achieving it might seem impossible when you realise there are about a thousand steps to get to the end result. But while we can’t promise investing in everything on this list is going to make you look like a celeb straight outta water, we can confidently say these gems nudged us further towards the glassy skin dream. Some of our choices will give you instant results whereas others are long-term wonders. So whether you want to cheat your way to the top of the glass game or really do want that clean skin glow, here is your definitive guide. You can trust our independent reviews. We may earn commission from some of the retailers, but we never allow this to influence selections, which are formed from real-world testing and expert advice. This revenue helps to fund journalism across The Independent. It would be positively criminal to not mention this product from Rose Marie Swift’s brand. The trailblazing make-up artist’s beauty line houses a slew of products with ingredients as clean as can be. The living luminizer has been perking up cheekbones since its debut in 2009. It’s an innovative concoction of coconut oil and beeswax, which means smooth and silky skin rather than patchy and potentially flaky. It’s a really sensational product; subtle enough to make your skin look super hydrated but buildable enough to give you the most natural radiance. It’s a translucent finish rather than oily or glittery and there’s a handy video online by Rose Marie herself to teach you how to get the most out of it. The newer magic luminizer is definitely worth a whirl if you prefer a bit more colour as it has a champagne finish which is perfect for darker skin tones. We think it’s worth stating that what separates this from most highlighters is how natural it looks, which is a big part of the glass skin ethos. It also has no fragrance and is organic with clean ingredients so perfect for sensitive Sallies. Buy now The first thing before even attempting this feat is to give yourself a fighting chance in the first place. That means prepping the skin as best you can so you’ve got the finest of foundations for all the magic to sit on. One way of doing this would be to flirt with some AHAs to really dig out the pores and refine the skin's surface. What’s unique about this one from Algenist is that it’s half glycolic acid and half nourishing oils. When shaken it creates a cloudy emulsion that should be left on clean skin for ten minutes; applied with a cotton round and washed off. The hybrid approach to the formula not only gives you a super clean surface, but the added oils nourish and moisturise which definitely comes in handy as you really want to keep the skin sufficiently hydrated to achieve that glossy finish. With extended use our skin had much more clarity and radiance without any drying whatsoever. Even if you’re not on this mission with us, this is a wonderful choice if you’ve tried chemical exfoliants in the past and not had the best of success as it’s the personification of tough and love. Buy now From our Korean founders comes this simply divine offering. The micro firming essence is made up of 93 per cent naturally fermented ingredients that deliver a potent blend of probiotics to the face. These work in a reparative fashion which is great news for your glass voyage. Organic birch juice is one of the key ingredients here and is full of skin loving nutrients. Bifida ferment lysate has been added to soothe UV skin damage while rice grain extract works on resurfacing and illuminating. While the formula is very light, this feels impressively rich going on. Just a few drops is all you need for a gorgeous gloss that many would envy. Once more you can really layer this on for glass skin lovers seeking the supremest of sheens. Buy now Yes, we go on about it all the time but hyaluronic acid should be in everyone’s skincare arsenal. The moisture magnet when formulated with care is the finest asset money can buy when it comes to your face game. Medik8’s offering is a multi chain molecule formula with added benefits from urea and various proteins. Four drops of the glistening pink serum pressed into the skin gives an immediate lift. There’s a joyously silky feeling to this one in particular, as opposed to some that can leave your skin tacky to the touch. This essentially moisturises from the inside out, giving you more oomph than basic moisturisers. It’s the perfect aid towards a more glossy visage. Snap this up and for an integral and intelligent boost. Buy now Sunday Riley’s juno oil is one of the brands first ventures and easily our favourite pick from the line. It’s jam packed with essential fatty acids and antioxidants. Blackberry, blueberry and wild carrot oil are one of the many included in this luxury line up. These work as a triple threat, hydrating and protecting while also brightening over time with the natural inclusion of vitamin C. This feels incredibly luxurious on the face. Just 3-5 drops instantly rejuvenates, leaving the skin supple, glossy and otherworldly looking. The glow this face oil gives is unparalleled. A real hero product that gives you the instant oomph we all crave. Buy now Okay, so £45 for a concealer is certainly for the dedicated but we cannot tell you how much we love this formula. From the mind of Terry de Gunzburg; the brains behind YSL’s timeless touche éclat (we were sold by reading that), this medium coverage, no crease formula has an almost stretchy consistency. It blends like a dream and isn’t heavy to wear at all. The precision wand is also a bonus to define certain areas of the face. It doesn’t set in creases or feel cakey in any way and when applied in all the right places (under the eyes, around the nose, on the chin and on the middle of the forehead) it’ll give you a dreamy base to make your other products really pop. Buy now If you don’t dare to go bare, this new foundation from Surratt is a prolific find. Made in Japan, it’s small and unassuming at first with a unique button press dispenser on the bottom of the chic, gun metal casing. One push dispenses the right amount for perfect coverage. Speaking of, the coverage is light to medium with 20 shades in the range. The initial dry down is pretty matte but this soon passes. As it wears throughout the day, it develops into something sumptuously seamless with a gorgeous dewy finish. We found this best applied first with a dense brush – say your favourite kabuki – and then blended out with a sponge afterwards. It gives the illusion of super hydrated natural skin rather than great make-up. It’s expensive we know, but we’ve not had anything like it before. A true step up in the no make-up make-up arena. Buy now The now iconic rose gold compacts from Charlotte Tilbury house a multitude of tricks but this pressed powder is one of our absolute favourites. You might be thinking if you’re trudging towards the goal of dewy glass skin, coming at it with powder might be counterintuitive. Reassured however this step might just be the key to pulling it altogether. Tapping your precision brush into this and carefully treating your T-zone, under-eyes and chin will accentuate the rest of your artwork. So if you’re snatched in all the right places, applying this will make natural light will hit all the sweet spots. As it’s a pressed powder, there’s less fall out so you can be much more accurate when waving your wand. Pores look blurred to the max and skin looks more even than we’ve seen in a long time. There provides sheer coverage with three shades offered covering a wide variety of skin tones. It’s so finely milled, it’s almost imperceptible. You definitely won’t regret it. Buy now Kevyn Aucoin’s mark on the make-up industry is legendary. His work cascaded upon every supermodel’s face in the Nineties and his imagination was unsurpassed. We’re sure that if he was still with us, this newer addition to his posthumous line would be fully approved. The gel comes in three different shades: one icy affair, another rose tinted treat and the final bronzed beauty. There’s plenty of shimmer in here but not to the point where it looks ridiculous. When applied carefully, this gave some people the impression that we had just naturally holographic skin. The texture is more viscous than you’d anticipate making it wonderfully easy to blend. Apply to the high points of your face for a subtle sheen or add a tiny amount into your moisturiser for an all over sparkling sass. Buy now Off the back of the iconic primer comes this universal highlighter from the coconut water loving Marc Jacobs. It’s blended with five coconut actives and provitamin B5 for an extra creamy gel formula that hydrates and refreshes. The golden peach colour pretty much works on any skin colour, which is pretty hard to crack so it gets props straight away. This gives a warmer radiance so is a terrific option if you like a bit more colour instead of the ice white we’ve come to expect from other highlighters. We also tried a little mixed with our primers and foundations for an all over glow. Buy now Hourglass products are so good at creating that seductively drenched look and we’re in good hands with this pick. The lip oil comes in a variety of shades from crystal clear to deep plum. Not only is it packed with nutrient rich vitamins to keep that pucker pukka but the aesthetic achieved is pretty impressive. It's much less sticky than other lip glosses, the result is a sumptuous and pristine pout with no glitter or overpowering shimmer. A refreshing change and the buildable aspect of it is also a winner. Dab a tiny bit on for a subtle flourish or slap it on for full blown lip glass glory. Buy now The clue is in the title with this one. The statement gold glitter bottle is rather deceiving as there’s no shimmer in this deliciously dewy setting mist. Spritz pre make-up application to prep skin or post make-up to set it. This also looks great on bare skin for a healthy glow boost. It’s a gorgeously scented coconut and vanilla cocktail. A little goes quite a long way but we got a bit carried away due to the scent alone. The mist is fine enough to not make it feel like you’re hosing yourself down and the glycerin in here also helps keep your skin hydrated throughout the day. We found this specifically good for drier skin types but literally anyone can benefit as reassured there’s no oily finish here. A lovely bunch of coconuts indeed. Buy now RMS hasn’t lost its top spot even a decade on. It’s plainly having a second and very successful wind. Surratt gets a silver medal for a genuinely innovative foundation formula. Kevyn Aucoin is a glitzy showstopper if you’re so inclined.              Want to bookmark your favourite articles and stories to read or reference later? Start your Independent Premium subscription today. Please refresh the page or navigate to another page on the site to be automatically logged inPlease refresh your browser to be logged in Log in New to The Independent? Or if you would prefer: Want an ad-free experience?  ",
    "datetime": "2019-10-15T15:38:44.000Z",
    "url": "https://www.independent.co.uk/extras/indybest/fashion-beauty/skincare/best-glass-skin-makeup-routine-products-serum-highlighter-foundation-korea-skincare-a9156956.html"
}