{
    "title": "How Glow Recipe’s co-CEOs turned $50,000 into a $100-million brand",
    "text": " Related Stories Even if you don't know what K-beauty — short for Korean beauty — is, chances are, you've seen the jade rollers, sheet masks and snail mucin creams promising radiant, mirror-like skin on your Instagram feed or the shelves of your local drugstore. Since its introduction to U.S. markets in 2011, K-beauty has become a mainstay of the global beauty industry, and it appears that people's obsession with it won't fade anytime soon: By 2029, the global K-beauty products market is projected to reach about $31.6 billion in sales, according to Prophecy Market Insights, a market research firm. One of the brands leading the Korean skin-care movement is Glow Recipe. Its founders and co-CEOs, Christine Chang and Sarah Lee first created Glow Recipe in 2014 as a curation of other K-beauty products imported from Seoul to help smaller brands launch in the U.S., then started their own in-house skin-care line three years later. Now, Glow Recipe is one of the buzziest brands in skin care, closing out 2021 with an estimated $100 million in sales. CNBC Make It spoke with Chang and Lee about quitting their jobs to chase their dreams and how their Korean heritage inspires everything they do at Glow Recipe, from ingredient lists to advocacy. Chang and Lee's relationship started as many great ones do: bonding over food. The pair first met as new employees at L'Oréal Korea in 2005. \"I remember going out to eat with our co-workers to a Korean barbeque restaurant one night and noticing that Christine was really enjoying her meal,\" Lee recalls. \"We immediately connected over our passion for Korean barbeque, but that sparked additional conversations about our love of K-beauty and our families.\" Just a few years later, both Chang and Lee were transferred to L'Oréal's New York office. They could often be found after work sprawled on the floor of Lee's apartment, decompressing with sheet masks and glasses of wine. It was during one of these late-night conversations that Chang and Lee, who both identify as Korean Americans, realized they were the only bicultural, bilingual executives on their teams at L'Oréal. As global marketers, Chang and Lee were fascinated by Korean skin-care innovation and predicted it would become \"the next big thing\" in the U.S., Lee recalls. \"We felt like it was our mission to bring these amazing K-beauty technologies stateside,\" she adds. The pair quit their jobs in 2014 and pooled $50,000 in savings to launch Glow Recipe, a name inspired by the menu of services they'd see at Korean spas or dermatologist offices that would offer different \"glows\" for clients' skin such as \"water glow\" or \"honey glow.\" Although Glow Recipe now has 40 employees, Chang and Lee look back fondly on the days when the brand was a two-woman operation. \"When it comes to entrepreneurship, you really do have to be your own legal support, accounting and designer team, all of these skills that we didn't have exposure to when we were at L'Oréal,\" Chang says. \"We like to joke that Google was always on speed dial.\" Chang and Lee quickly realized the value in asking for help. \"Even if you're being scrappy and bootstrapped, it's smart to outsource a lawyer or an accountant to help you grow your business,\" she adds. \"Each entrepreneur has to figure out what they're best at and what their time should be spent on, and for us, that was product development.\" A core childhood memory Chang and Lee share is spending the hot summer months in South Korea playing outside, and their grandmothers rubbing fresh watermelon rinds on their sunburnt skin. Watermelon is one of Korea's most popular fruits and is a traditional cure-all for soothing dry, irritated skin. It's also the key ingredient in Glow Recipe's first product, the Watermelon Glow Sleeping Mask, which, according to the founders, took over a thousand formulations to perfect and has sold out seven consecutive times. While watermelon was the star fruit of Glow Recipe's initial launch, its skin-care collection now includes strawberry and plum-based serums, avocado eye creams and more. All fruit concentrates are combined with active ingredients like vitamin c, hyaluronic acid and niacinamide to help clear and brighten skin. Growing up in South Korea, Chang and Lee always considered skin care to be a luxurious treat, watching their mothers and grandmothers pamper themselves before bed. In the U.S., however, skin care has often been seen as a \"chore,\" Chang says, \"something you have to slog through to get to makeup, which was the fun part.\" With Glow Recipe, Chang and Lee set out to elevate skin care from a chore to a pampering ritual, using bright packaging and sensorial, bouncy textures. \"We're incredibly blessed to have our work tie closely to our [Korean] heritage,\" Chang says. \"To see K-beauty trickle down into every single medicine cabinet and beauty bag has been amazing, and where we always thought it should go.\" Glow Recipe's Instagram isn't just a colorful grid of product tutorials and sunlit selfies — it's also a place where its one million followers can find information on other AAPI-owned brands and organizations responding to the recent surge of hate crimes targeting the AAPI community. Chang and Lee have personally experienced racism throughout the Covid-19 pandemic. \"At one point, a person in the middle of the street screamed, 'Go back to China! Chinese virus!' to my husband, my daughter and me,\" Chang wrote in a February 2021 blog post. \"Ever since then, and seeing that people were avoiding her, my daughter refused to leave the house without her umbrella, which gave her a sense of security.\" Lee shared a similar incident, noting that a few months after her naturalization ceremony in 2020, a couple walking by her in the street yelled \"Corona\" to her face, \"and walked away laughing loudly.\" \"I had a hard time understanding what happened in the moment,\" she wrote in the same blog post. \"Had I done something wrong? Was I that different from them? Why were they attacking me, specifically?\" Chang and Lee view advocacy as a critical aspect of Glow Recipe's mission, aligned with their values of diversity, inclusion and empowerment. \"We're fortunate to have a platform that's large enough where we can help raise awareness for these important issues,\" Chang says. \"I think our community appreciates that when hate crimes are on the rise for example, we're not just going to talk about beauty products — these issues are top of mind for us, too.\" Check out: How this millennial turned $700 into a multimillion-dollar fishery start-up At 25, SuChin Pak became MTV's first Asian American news correspondent—here's her best career advice The founders of NYC's first woman-owned brewery on the biggest career lessons they've learned Sign up now: Get smarter about your money and career with our weekly newsletter Get Make It newsletters delivered to your inbox Learn more about the world of CNBC Make It © 2023 CNBC LLC. All Rights Reserved. A Division of NBC Universal ",
    "datetime": "2022-05-27T15:28:14+0000",
    "url": "https://www.cnbc.com/2022/05/27/how-glow-recipes-co-ceos-turned-50000-into-a-100-million-brand.html"
}