{
    "title": "How to Do an Easy Korean Skincare Routine – K-Beauty Skincare Products",
    "text": "We may earn commission from links on this page, but we only recommend products we love. Promise. Unless you don’t want insanely smooth, bright, glowing skin? I am by no means lazy when it comes to my beauty routine (like, I even floss every day), but I never could wrap my head around doing a full 10-step skincare regimen every morning and night. Sorry, but a sheet mask twice a day was just never gonna happen for me. But when I spoke to Charlotte Cho, cofounder of the insanely popular K-Beauty site Soko Glam—and owner of the dewy skin of my dreams—I realized that I’ve had it wrong this whole time. “It’s not about having a certain number of steps in your routine at all,” says Cho. “It’s about being educated about what you could include in your routine to get great skin and having the right products that do the right things in the right order.” (What’s that thing about knowledge is power...? Oh, right.) “We’ve been saying it from the beginning that you don’t have to take K-Beauty literally and do all 10 steps, because it’s not a one-size-fits-all model,” she says. “It’s here to show you the options and categories you might not have known were available, so you can choose what’s best for you and your skin type.” Basically, skincare is your own journey and it’s not meant to be a manual, so instead of introducing the below 10 steps as a strict guide, I’ll present them as a skincare ~menu~ of sorts. Familiarize yourself with all the categories, then pick and choose what makes sense for your skin goals. With a custom routine like this, nice skin is basically a guarantee. Step one is actually the first part of a two-step process called double-cleansing, and it starts with a cleansing oil (a makeup-removing formula that gently breaks down and dissolves makeup, grime, and oil, then washes them away cleanly). Whether your cleansing oil comes in the form of an oil with a pump or a balm that melts into the skin, the application is the same: Massage a quarter-size dollop into dry skin (yes, it needs to be dry) for 20 seconds, then rinse it off. Don’t worry—cleansing oils are water-soluble, meaning they won’t leave behind an oily, pore-clogging residue. Cho says the most skin-changing discovery she’s made from the K-Beauty life has been the double-cleanse, and for good reason: It gets your face really, really clean without stripping it or irritating it since you’re using only gentle formulas. So after rinsing away your oil, cleanse a second time with your favorite water-based face wash, which could come in the form of a cream (for dry skin), foam (for oily skin), or gel (for combination skin). When it comes to exfoliators, you have two options: physical and chemical. A physical exfoliator is gritty, rough, or nubby (think scrubs, washcloths, and facial brushes) that works to physically slough away dead skin cells for a smoother surface. The only (major) downside? Physical exfoliators are often way too harsh for most people, especially those with sensitive skin, since they can create micro-tears in your skin’s surface. Fun! Instead, Charlotte recommends using a microfiber cloth or a gentle mask with natural sugars if you insist on exfoliating physically. Or, you know, you could just use a chemical exfoliator. They sound intense, but chemical formulas rely on skin-loving acids to gently dissolve dead skin cells, smooth bumps, clear pores, and fade discoloration. The benefits are major and usually way less irritating that a physical scrub. To be extra safe, stick with BHA acids (beta hydroxy acids, like salicylic acid) for oily, acne-prone skin and AHA acids (alpha hydroxy acid, like lactic or glycolic acid) for sensitive or dry skin, and use one of these formulas just once a day, ideally at night. Washing your face, while important for removing dirt, makeup, and oil, can often leave your skin stripped of its natural oils. To bring your skin back into balance, Charlotte recommends following your cleanse with a hydrating toner. “Many toners tend to be alcohol-based and drying, but in Korea, toners are about hydrating,” she says. “The whole philosophy of the Korean skincare routine is about adding more hydration and nourishment to the skin versus stripping and drying it out.” Toners are typically very watery and absorb easily into your skin, so they should be applied to clean, dry skin as one of the first steps in your routine. You can either use a cotton pad to swipe it across your skin or pour some into the palms of  your hands and press them into your skin. Now that your skin is cleansed and prepped, you can move forward with all the fun treatment options. What you decide to use in these next four steps is totally up to you (this is where the customization really comes into play), but Charlotte adds that for a Korean skincare routine, essence is an absolute staple. Korean essences are typically watery, like toners, and can be applied with the palms of your hands or in a spray mist form. “BUT WAIT!” you cry. “Aren’t toners and essences the same thing?!” Yes and no. They’re very similar in a lot of ways (consistency and packaging), but basically what you don’t get from a toner, you would then supplement with an essence. “Toner is going to bring hydration back to your skin,” says Cho, “but essences usually contain some concentrated active ingredient that goes above and beyond what toner can provide,” like brighteners, softeners, and plumpers. Apply them over your toner, in lieu of your toner, or skip them altogether! Remember: This is a menu, not a recipe. Ah, sheet masks. Another K-Beauty favorite. If it’s the weekend and you’ve got an afternoon to kill, treat yourself to a mask, but don’t stress over it otherwise. Sheet masks come in many different formats and styles, but the main goal here, again, is hydration. “Most of your skincare will evaporate as it dries, so the idea of K-Beauty is that the more you hydrate and layer, the more you lock in those ingredients and the more positive effects you’ll see,” Charlotte says. You’re probably familiar with the concept of a serum, but an ampoule? Maybe not so much. So fast facts: A serum has concentrated active ingredients that address a specific concern, like dullness, dark spots, fine lines, etc., and an ampoule (sometimes referred to as a booster) is similar but has a higher concentration and is usually only used when you really need it—like after a night out or a bad night’s sleep. Serums/ampoules are a bit thicker than essences but thinner than moisturizer, so make sure to apply them early in your routine, before any creams, lotions, or oils. An eye cream might be too thick to layer under makeup during the day, but at night, it’s an insanely good source of hydration for your itty-bitty fine lines. Apply it all around your eyes (including over your lids and under your eyes), making sure to use your weakest finger—your ring finger, to be exact—to gently pat it into your skin.    Listen, moisturizer is one of the nonnegotiable steps in any skincare routine, because your face needs this final layer of hydration to function properly—kind of like how your body needs water to survive. Not only does it act as a barrier to lock in all the hydrating products you’ve been adding up to this point, but it also helps restore your skin’s health. The moisturizer you choose depends on your skin type, so if you have dry skin, try a richer cream formula, and if you have oily or acne-prone skin, go for a gel formula. Or if you’re a little bit of everything, try an emulsion—a K-Beauty cross between a gel and a cream. Emulsions are silky and lightweight but creamy enough to deeply hydrate skin. Apply them morning and night, especially during colder months. And here’s the other nonnegotiable step of your skincare routine, because skin cancer is scary, and dark spots, hyperpigmentation, and premature aging aren’t that fun either. But even if you hate the feeling of sunscreen or you’re afraid it’ll break you out, that’s not an excuse, because there are so many different options that are guaranteed to work with your skin type. And in K-Beauty, it doesn’t matter which sunscreen you choose, as long as you’re wearing it every day. Because if you’re not protecting your face from sun damage, you’re pretty much undoing all of the skincare steps you just took. Sheet masks are expensive. Serums are expensive. Wear sunscreen, and don’t waste them. Now that you’ve reached the end, you may go forth and pick and choose which steps are best for you—whether that’s all 10 or just a few. Brooke Shunatona is a contributing writer for Cosmopolitan.com. FYI, Your Eyes Need A Hydrating Eye Cream (!!) Every $$$ Le Labo Perfume, Ranked Your 101 Guide to Laser Treatments for Acne Scars 19 Genius Serums That'll Smooth and Firm Your Skin FYI: Amazon Is Having a Major Beauty Sale RN Black Friday Dyson Airwrap Deals? Yes, Pls! You Can’t Miss These Black Friday Beauty Sales Simply the Best Shampoos for Thinning Hair, Period I Tested All the Viral Sol De Janeiro Perfumes These Bath Gift Sets = Immediate R&R Alert: I Found Drunk Elephant Bronzing Drop Dupes 25 Face Serums For Supremely Glowy Skin A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2019-04-05T18:59:00Z",
    "url": "https://www.cosmopolitan.com/style-beauty/beauty/a27011964/korean-skin-care-routine-steps/"
}