{
    "title": "How Long It Took Kim Kardashian to Go Platinum Blonde",
    "text": "Victoria Moorhouse is a writer, editor, and consultant based in Brooklyn, New York who focuses on beauty, fitness, and health. Victoria was previously the Senior Beauty Editor at InStyle.com and a Senior Editor at POPSUGAR. Her work can also be found in notable publications such as Shape.com, The Zoe Report, Forbes.com, and Well+Good. She graduated from The College of New Jersey with a Bachelor's Degree in Journalism and Professional Writing. Going platinum blonde is a commitment. And if you have naturally dark hair, actually getting it to an icy blonde shade is also a commitment to basically a full day sitting in a salon chair. Just ask Kim Kardashian West. After revealing her new Mother of Dragons-like hair color, she took to her app to share her inspiration behind the change and exactly how long it took her to get there. Spoiler: It was almost a full 24-hours. \"I've been talking about going blond again for a long time, and I'm so happy I did!” she wrote. \"I know a lot of people initially thought I was wearing a wig, but it's my real hair. My amazing stylist, Chris Appleton, dyed my hair and got it to the most perfect platinum, silvery-white color.” VIDEO: Kim Kardashian West Looks Like Barbie in Skin-Tight Latex Dress at Tom Ford Chris Appleton is the same celebrity stylist who recently took Katy Perry platinum and is now even wearing a silvery color himself—one that Kardashian has called “the modern version of platinum blond.\" To eliminate as much damage as possible, the first round of Kardashian’s hair coloring took a whopping 12 hours. But that wasn’t the end of it. \"The last time I went platinum, a few years back, I dyed it in one sitting and never gave it the proper time, so this time I sat there 12 hours straight. Then, we did another 5-hour session. In the end, SO worth it.” On top of that 17 hours, Kardashian said she had to spend a week wearing yellow hair while adding Olaplex to it and conditioning it. Then, they toned the hair and lifted it to her current color. “I’m so happy with it and want to keep it a while!” Knowing the Kar-Jenners, a “while” is one time stamp that is not so easily defined. ",
    "datetime": null,
    "url": "https://www.instyle.com/hair/hair-color/kim-kardashian-platinum-blonde-process"
}