{
    "title": "How to transition your skincare routine for summer, according to K-beauty | Vogue India",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, visit My Profile, then View saved stories By Hasina Jeelani As the temperature rises, you’ll find that your skin has started protesting against heavy textures that clog pores. Adapting your skincare routine for the summer is necessary to protect your skin from congestion, and it is a step that that Christine Chang and Sarah Lee swear by. As the co-founders of skincare brand Glow Recipe, the duo has been bottling the secrets of K-beauty for the better part of the past decade. Their top advice? Allowing your skincare routine to evolve as per the season, environment and your hormones. With the sudden upsurge in temperature triggering an additional outburst of sebum and oil in the skin, here’s how you can adapt your routine to ward off any untimely breakouts and related skincare concerns. Chang recommends addressing your skin’s needs in a fluid way, as opposed to sticking to a rigid regimen all year round. “As we transition to warmer climates, the biggest change to your skincare routine would be adjusting the types of textures and formulations you use based on your needs. Independently of the weather as well, it’s important to really listen to your skin—does it feel dehydrated or more oily or sensitive than usual? People feel like their skin can get a little oilier in the warmer summer weather, so we recommend using more lightweight textures when it comes to moisturisers or serums, as well as transitioning to some oil-free formulas,” she advises. As the mercury inches up, Lee believes in bringing about certain essential swaps in your everyday skincare routine. “When the climate gets a bit warmer, our skin can be more prone to producing sebum. Look to a cooling, lightweight gel moisturiser that provides an instant soothing effect for skin upon application,” she recommends. Another handy way to counteract the additional production of oil in the skin is to stay hydrated. “The skin can lose up to a cup of moisture throughout the day, so ensure that you replenish your hydration levels with an on-the-go facial mist. A gel-based sleeping mask is also another product you’ll want to add to your summer skin roundup. After keeping it in the fridge, the gel texture can provide a soothing and cooling effect on the skin. Opt for a lightweight formula that will get absorbed by the skin easily,” she adds. “If you want to avoid clogging pores, reach for a combination of thorough cleansing and chemical exfoliants to slough away the dead skin cell build-up. When cleansing, be sure to massage the cleanser into your skin for a full minute to thoroughly melt away makeup, sunscreen and grime,” says Chang. Sunscreen is a necessity no matter what, especially when you're at home in front of the computer. “The best SPF, whether mineral or chemical, is a texture that you personally enjoy using daily and reapplying throughout the day to keep the skin consistently protected,” says Chang. With warmer weather upon us, it is time to transition your skincare regimen accordingly. We got Lee to recommend the step-by-step order you’ll want to follow for the summer: Start with a gentle foaming cleanser for a full minute. It also helps to spritz a facial mist between each step to make sure your skin is plump and ready for the next step. After the mist, a toner is your first liquid treatment to set the tone for the rest of the routine. Try a layer of the toner, and then use the ‘7 skin method’ with spritzes of the mist to keep the skin plump without tacking on thick textures. This is best recommended for oily and combination skin types. Use an ophthalmologist-tested eye cream to protect, de-puff and hydrate the under-eye area. The next step would be a facial serum which helps you achieve that instant ‘glass skin’ glow for the summer, without weighing down the skin. Follow your serum with a moisturiser of your choice, preferably oil-free and lightweight in texture. For some extra TLC, follow up with an overnight mask if you're doing this at the end of the day, to refine your pores in addition to the extra nourishment. These usually have light exfoliants to slough all dead skin cells through the night. Step aside glass skin, this is the newest K-beauty trend you need to know about Want to make your skincare uncomplicated? Ignore these 5 products What makes K-beauty a global skincare phenomenon? By Hasina Jeelani By Prabal Sharma By Kejhal Kalra By Hasina Jeelani By Namrata Kedar By Namrata Kedar By Twiggy Jalloh See more stories Condé Nast India © 2023 Condé Nast. All rights reserved. Use of this website constitutes acceptance of our Terms of Service and Policy and Cookie Statement. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. ",
    "datetime": "2020-04-23T09:13:27.443Z",
    "url": "https://www.vogue.in/beauty/content/best-skin-care-tips-for-summer-k-beauty-korean-skincare-experts"
}