{
    "title": "How and why J-Beauty could be giving K-Beauty a run for its money",
    "text": "We know you’re obsessed with K-Beauty, but have you heard about and tried J-Beauty yet? After the advent of K-Beauty, which has stormed its way to a highly influential position in the global cosmetics industry over the last decade, it’s time to make way for J-Beauty, which keeps gaining ground and inspiring beauty routines of men and women around the world. Minimalist and technologically advanced, but also influenced by ancient traditions, J-Beauty, which is ultra-popular in the Land of the Rising Sun, has the key elements to address the new skin concerns of Western consumers. The covid-19 pandemic may have spelled the end of K-Beauty (short for Korean Beauty), a vision of beauty straight from that country, which, until recently had appeared unstoppable in winning over followers — and, perhaps even more significantly, has had a wide-ranging influence on the international cosmetics industry. But now the K-Beauty approach, based on layering, and in particular on a ten-step beauty routine, seems to be losing ground to a more minimalist, authentic and natural routine, which has been growing in visibility and popularity during the health crisis. And even if K-Beauty later came up with the idea of “skip-care” which, tried to gain acolytes by reducing the full routine to just a few multifunctional products, it is, in fact, J-Beauty (Japanese Beauty) which could correspond best to top concerns of consumers at the moment. And since “we’re always our own best advocates,” J-beauty is first and foremost gaining in popularity in its homeland, the Land of the Rising Sun. The J-beauty based cosmetics market is expected to grow from 521.9 billion yen in 2020 to 554.6 billion yen in 2025, with a compound annual growth rate of 1.2% over the period, GlobalData experts report. “Japanese consumers are extremely health-conscious, which also reflects in their beauty purchases. Consumers are drawn towards products which have a positive impact on health and well-being,” says Sukanyashri Kabali, consumer analyst at GlobalData. It’s a trend that is also gaining ground in the West, especially in Europe and the United States, with a clear revival of interest in natural ingredients, especially those from Japan such as rice or rice water, which is as popular in cosmetics as it is on social networks, shell ginger or getto, or ashitaba, among others, which are in line with this desire to combine nutrition, health, and the beauty of the skin. All alongside a key — if not the predominant — philosphy underpinning J-Beauty: the idea of prevention. And this is evident through trends that are cropping up all over the world, including the boom of prebiotics in cosmetics. Men and women are no longer looking to systematically repair the damage suffered by the skin, but to prevent it through various actions and a routine that will help it defend itself against potential aggressions. While J-Beauty relies greatly on science, and more particularly on a combination of science and nature, as well as on technological advances, it is also about ancientl traditions. In this respect, we are seeing the arrival of rituals straight from Japan that focus on prevention, particularly in the fight against the signs of aging. This is the case of Kobido, a “natural face-lift” technique that relies on a set of very precise movements, and that is now offered by many experts and facialists, but also many institutes such as the Cinq Mondes spas, in France as in the rest of the world. In other words, J-Beauty still has many days ahead of it, and it could very quickly outpace its cousin, K-Beauty. This article is published via AFP Relaxnews. Here's where you can read the latest news and stories from Lifestyle Asia and our sister titles PrestigeOnline and Augustman, curated from all of our editions in Hong Kong, Singapore, Kuala Lumpur, Bangkok and India. Yes, I agree to the Privacy Policy Follow our daily snapshots at @lifestyleasiath Yes, I agree to the Privacy Policy Subscribe to our newsletter to get the latest updates.  Thank you for your subscription. ",
    "datetime": "2021-09-24T02:24:07+00:00",
    "url": "https://www.lifestyleasia.com/bk/beauty-grooming/skin/why-j-beauty-giving-k-beauty-trend-a-run-for-its-money/"
}