{
    "title": "How K-Beauty Took Over The World ",
    "text": "ELLE presents a four-part series on how Korean beauty changed the industry forever. South Korea has quietly become Hollywood’s biggest competitor, churning out wildly popular music, TV dramas, and beauty and fashion trends with global appeal. This week, ELLE celebrates the K-World we’re all living in. Beauty trends and products originating from South Korea, known as K-Beauty, are now worldwide. Over the past 10+ years, no country has had a greater impact—not just on the products and brands we’re slathering on our faces—but on the way we think about beauty as a practice that puts skincare first. While the business outside the country was once limited to cult products stowed away in checked luggage or discovered at small shops in Koreatown, it is now a global business estimated to be worth $10.2 billion in 2019, according to Allied Market Research. K-Beauty is the focus of a new four-part documentary series at ELLE titled How K-Beauty Took Over the World. The new series will dive into all aspects of K-Beauty: the skincare, the ingredients, how we got here, what the true origins of the practice are—typically rituals passed down like kimchi recipes from the original beauty experts, grandmothers—and how K-pop stars and TV dramas are forever changing the facial structures of our face. The rise of K-Beauty reflects a complete shift in skincare. Because of trends originating from Korea, many skin enthusiasts worldwide now double cleanse, wear sheet masks, and spread snail mucin on their faces all in the name of healthier pores. But K-Beauty is more than skin deep—its prevalence has created deeply felt cultural shifts from its advocates. “My way of making friends and getting people to accept more of my culture was honestly through skincare,” explains Ave Lee, a New York-based skincare content creator and expert, in the series. They were enthralled with the skincare she brought from home to her dorm room, and she started bringing gifts back from trips home to give all her friends a taste of Korea.” That same process is now playing out on the shelves of Sephora and Urban Outfitters across the world. The next trend to go global from Korea could have an even greater effect on the way we think about beauty. Beyond skincare, South Korea is also the plastic surgery capital of the world, and Dr. Donald Yoo, a Beverly Hills-based celebrity plastic surgeon who specializes in facial reconstruction procedures, is already starting to do much of the same work here in the U.S. Is it possible the global phenomenon of K beauty won’t just redefine skincare but the way our faces look, too? Sit back, put on a sheet mask, and tune in to How K Beauty Took Over The World when the first episode launches on YouTube at the end of August. Chloe Hall oversees all beauty coverage at ELLE.com. She knew she wanted to get into beauty the moment Donna Summer came on her screen and she's been chasing the perfect disco shadows ever since. Her sweet spot is the intersections of beauty with current culture, whether it's music, movies, or social media. You can find her in Brooklyn with her pug or in Rihanna's comment section. 13 Korean Sunscreens You Need ASAP The K-Drama Renaissance Laura Kim's Guide to Seoul K-Pop Conquered the World. Now What? Simple Nail Designs for Your Manicure Mood Board 14 Vanilla Perfumes That Smell Absolutely Amazing 13 Best Japanese Skin Care Products to Shop For Breast Cancer, 40 Is the New 50 Meet YSL Beauty’s Most Unconventional Scent Yet Amazon Is Having a Major Beauty Sale Right Now Why Matrix Could Be the Next Best Skin Treatment The Best Neutral Nail Colors for Every Skin Tone A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2021-08-17T19:01:00Z",
    "url": "https://www.elle.com/beauty/a37318406/k-beauty-skincare-beauty-surgery-doc/"
}