{
    "title": "How overnight masks can magically transform your skin while you sleep | Life",
    "text": "Thursday, 26 October 30 Oct 2020 Ever since I first discovered it a few years back, K-Beauty has been a feature in my skincare routine. After a visit to Seoul – and seeing firsthand just how flawless the locals' skin really is – I fell even more in love with Asian skincare, which brought us everything from the popular sheet mask to flashback-free sunscreen. READ MORE: Eye(s) cream, youth cream, we all scream for sunscreen! 10 best UV protection creams for daily use This 'movement' also has devotees adhering to a whopping 10-step routine twice a day, so it's safe to say that they take their skincare seriously! And while I keep my personal regimen to a five-step maximum, it's one of the last steps in the nighttime routine that has made the most difference in my skin. Say \"hello\" to your next skin hero - overnight masks. Overnight masks have been a fixture in the 10-step Korean skincare routine for a long time. It is only in recent years that Asian beauty products have become more mainstream, and other brands have started jumping on the bandwagon and producing their own. But what exactly are they? Also known as sleeping masks, these products come in a variety of textures with a multitude of different ingredients that address specific skin woes. In other words, a lot like the other products you put on your face every day. What makes them great, however, is that they are able to treat, hydrate and protect your skin all at the same time. ??‍?? Ingredient Roll Call ??‍??  What you use on your skin makes all the difference in your ?? glow ?? Our Deep Sleep Overnight Mask is created to leave your skin strong and well rested. Here’s how we do it:  Deep Sea Water &  Aloe Vera: restore and calm skin Cica: hydrates and improves skin's tone and texture Niacinamide: brightens skin and reduces hyperpigmentation  Leave a ?? below if you need this! A post shared by  SKINESQUE (@skinesque) on Oct 27, 2020 at 8:51am PDT  While all overnight masks are different, with each one created with a specific skin concern in mind, they can be used on all different skin types, and to treat a host of issues - from dryness to dullness. But there is one thing that they all have in common, and that is that they give your epidermis an additional dose of moisture, which is the key to keeping your skin youthful and plump for the long haul. On a daily basis, though, you can expect to wake up to juicy, radiant skin that is ready to face the day (and rake in all the compliments). Another reason to slather on a sleeping mask? They act as a barrier and a sealant. This means that it locks your other products in while, at the same time, preventing dirt and debris from reaching your pores. Think of them as a shield in a jar. READ MORE: Do we still hate the word 'moist'? The meteoric rise of dewy-dumpling skin says 'no' In my case, I skip the night cream altogether and go straight in with my overnight mask after serum and before I hit the hay. But the old adage \"do as I say, not as I do\" definitely applies here because they are designed to be used over your nighttime moisturiser for optimal performance. This way it helps to seal in the goodness from your other skincare products so that they can all join forces and work their magic while you sleep. Apply your mask, preferably with a mask-application brush so as to avoid contamination from your fingers, a few minutes before you go to sleep to allow time for it to absorb into your skin. So even if you don’t have the time in your busy schedule for a 10-step regimen, the overnight mask is one element you should invest in if you are committed to achieving a gorgeous glow. Your skin will thank you for it. Klairs Freshly Juiced Vitamin E Mask, R495 on Glow Theory Nivea Q10 Sleeping Melt-in Mask, R189.95 at Dis-Chem  SKOON. Ruby Marine Overnight Hydrating Mask, R499.95 on skoonskin.co.za  The Body Shop Hemp Overnight Nourishing Rescue Mask, R380 at The Body Shop  Huxley Good Night Sleep Mask, R520 at Dermastore   Follow us on social media: Facebook, Twitter, InstagramSign up to W24’s newsletters so you don't miss out on any of our stories and giveaways. 31 Jan 2014 Sommelier - Bi-weekly A new bi-weekly newsletter by wine editor Daléne Fourie. The newsletter will serve as a guide for those who make wine, those who want to learn more about wine, and those who simply just love wine. Can you ace them all? Today’s crossword, wordflower, sudoku and weekly news quiz Contact the public editor with feedback for our journalists, complaints, queries or suggestions about articles on News24. 24 Oct 24 Oct 24 Oct 20 Oct 2h ago 25 Oct 20 Oct 18 Oct ",
    "datetime": null,
    "url": "https://www.news24.com/life/archive/how-overnight-masks-can-magically-transform-your-skin-while-you-sleep-20201030"
}