{
    "title": "How Alexandria Ocasio-Cortez brought K-beauty to Congress | Life and style | The Guardian",
    "text": "The hugely popular Democrat has revealed her skincare routine and it’s heavily influenced by Korean beauty regimens Another busy week for Alexandria Ocasio-Cortez: she won a seat on the powerful House oversight committee and a documentary about her election premiered at the Sundance film festival. But she still made time to keep up her skincare routine. “How does she do it?” wondered many. On Sunday evening, apparently after receiving many requests that she reveal her beauty secrets, she posted her daily habits on Instagram. Ocasio-Cortez said skincare is a “straight-up hobby of mine” and admitted she is “a science nerd” who had always enjoyed “the science of it, reading about compounds and studies”. She went on to provide her step-by-step guide for her skin – but did not reveal specific products to avoid being “too product-placementy”. Her routine starts out with double cleansing to remove makeup and impurities, followed by the simplified track of toner, then serums with active ingredients. She finishes with moisturizer and sunscreen. Ocasio-Cortez claims her regimen is just a short three steps, but a closer glance reveals a more involved process, with some measures mimicking the 10-step Korean skincare routine that has become popular on beauty blogs. K-beauty has been making its way into the American consciousness since about 2015. It involves exotic ingredients such as snail mucus and an emphasis on knowledge of active ingredients. The approach has infiltrated the mass market, giving rise to sheet masks, serums, essences and other Korean-inspired skincare products. The style is popular with stars such as Chrissy Teigen, Emma Stone and Lady Gaga. This article includes content provided by Instagram. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. To view this content, click 'Allow and continue'. Ocasio-Cortez’s routine overlaps with staples associated with Korean skincare such as double cleansing and using serums with active ingredients, as well as the emphasis on hydration and sunscreen. Ocasio-Cortez described her approach as “a blend between K-beauty & scientific consensus”. There’s no word yet if Mitch McConnell might follow suit. But Ocasio-Cortez appears to be the first congressional member ever to put a cult beauty trend up for discussion. ",
    "datetime": "2019-01-29T14:07:07.000Z",
    "url": "https://www.theguardian.com/us-news/2019/jan/29/alexandria-ocasio-cortez-skincare-routine-k-beauty-instagram"
}