{
    "title": "How South Korea's AmorePacific Became One Of The World's Most Innovative Companies",
    "text": " AmorePacific's green tea garden in Jeju Island. Photo courtesy of AmorePacific.  It all started from a kitchen eight decades ago. Yun Dok-Jeong, an ambitious mother of six, began producing camellia oils as a hair treatment for stylish Korean women. Sourcing the best camellias from peddlers who would travel the Korean peninsula delivering goods, Yun would spend hours extracting the flowers’ oil and set up her first shop in the village of Gaesong, a city that is now part of North Korea. At a young age her second son Suh Sung-Whan learned the tricks of the trade, biking a round trip of 88 miles to collect bottles and labels and later concocting face creams beside his mother. Suh would then go on to take over the business in 1945, a vulnerable time in Korea’s turbulent history: World War II had just ended and with the subsequent demise of Japan’s colonial rule, the Korean War would soon rear its ugly head. Keeping his eye on the possibilities, Suh initially named the company “Taepyeongyang,” which in English translates to the Pacific Ocean, a name that came from Suh’s early ambitions to take the company beyond the Pacific and create a strong foothold overseas. Those are the modest beginnings of South Korea’s beauty behemoth AmorePacific, which debuted at No. 28 this year on FORBES’ annual list of the World’s Most Innovative Companies and is now headed by Suh’s second son, Suh Kyung-Bae (his five other siblings showed little interest in inheriting the business). Under the younger Suh’s leadership, which began in 1997, the outfit has become the world’s 14th largest cosmetics company, boasting 30 brands in its portfolio. Its luxury line is now housed in 66 upmarket U.S. department stores, including Bergdorf Goodman, Neiman Marcus, Bloomingdales and \nNordstrom\n, while its premium brand Laneige is stocked in \nTarget\n, the country’s second-largest discount retailer. With a market capitalization of nearly $25 billion, shares of AmorePacific have surged more than 250% since the beginning of 2014. Last year's revenue  jumped 20% from the previous year to $4 billion. These figures have made Chairman Suh South Korea’s second-richest citizen and his company a favorite among investors, who cite AmorePacific’s innovations and booming Chinese business as some of the key drivers behind its success. One of its latest and most prized innovations commenced in January 2007, when AmorePacific began R&D for its cushion technology and aimed to tie skincare, sunscreen and liquid foundation into one formula, a Korean trifecta reminiscent of the hugely popular BB cream. After conducting more than 3,600 tests with 200 different sponges, in March 2008, the company introduced the cushion formula in the form of a compact. It soon changed the makeup habits of South Korean women, thanks to its portability, ease of application and quicker routine time. But it didn’t stop there. The cushion garnered global appeal, giving birth to 19 compacts across more than a dozen AmorePacific brands. Combined sales at home and abroad last year increased 105%, accounting for 26 million units--one sold every 1.2 seconds. A staggering 1,000% leap was reported for sales overseas. Cumulative sales reached 50 million units at the start of the year. Formidable competitors want in. In January the world’s largest manufacturer of beauty products, L’oreal, released its own version of the technology through its subsidiary \nLancome\n: the “Miracle Cushion.” Five months later, AmorePacific signed a memorandum of understanding with Parfum \nChristian Dior\n, giving the European luxury brand access to its cushion technology. But AmorePacific’s No. 1 market outside its home turf is none other than South Korea’s favored trading partner, China; though the country accounted for just under 10% of the company’s sales last year, its annual growth rate stood at nearly 40%. This year AmorePacific reported a 72% hike in net profit for the first quarter due largely in part to the demand of Chinese consumers. And while from May through June shares plunged by up to 10% due to the MERS outbreak that gripped the country and kept lucrative Chinese tourists away, the second quarter showed a 24% increase in sales and a 43% jump in net profit from the same time a year ago. What’s fueling the demand? Along with the rising purchasing power of its consumers, China, in recent years has developed a hearty appetite for the Hallyu Wave, a phenomenon of South Korean pop culture that has swept Asia since the early 2000s. Climbing exports of K-pop (popular music) and K-dramas have given way to new marketing strategies for companies seeking to capitalize on the craze. South Korea’s beauty industry in particular has been at the forefront of the trend, employing Hallyu celebrity endorsements and product placements in the country’s drama series. The marketing push pays off. When AmorePacific became the official sponsor of last year’s No. 1 K-drama “My Love from the Star,” for instance, it incorporated its skincare and cosmetic products throughout the 10-week series and almost immediately saw sales skyrocket. Skincare products used by the leading actress surged 75% while lipstick sales were up by a staggering 400%, again, thanks largely to China. But promotions only go so far. Aside from its advertising efforts, AmorePacific reinvests 3% of its revenue in R&D, where 500 researchers and chemists from around the globe try and test new ideas. A pioneer in its industry, in 1954, the company was the first beauty brand to establish a research lab, not long after the end of the Korean War, when the newly divided South Korea endured considerable economic suffering. Ten years later AmorePacific honed in on a sales technique and adopted a door-to-door sales system, employing women, many of whom lost their husbands in the war, to go from home to home, selling directly to consumers. Many of these “Amore Girls,” as they were called, would put their children through school and make ends meet with the commissions they made. Throughout the years the cosmetics outfit has stayed true to its roots with an ongoing focus on natural ingredients. In 1966, it became the first company to use ginseng--normally used in Asian traditional medicine--as a base for cosmetic products, and in 1979, the first in its industry to cultivate a tea garden, an initiative that would later help produce the world’s first skincare line based entirely on green tea. These early foundations have manifested into some of AmorePacific’s most popular brands, each distinct from the other: Sulwhasoo, its luxury line based on Asian medicinal herbs; Mamonde, a brand that explores the use of camellia, lotus and jasmine flowers; and Innisfree, the eco-friendly sister that derives most of its ingredients from the country’s beloved Jeju Island. It’s been 83 years since Suh’s grandmother toiled in her kitchen crushing camellia seeds, but her legacy lives on and Asian botanicals remain at the heart of AmorePacific’s innovation. Correction: An earlier version of this story misspelled the name of Chairman Suh's grandmother. Her name was Yun Dok-Jeong not Yun Sok-Jeong.  The previous version also stated that the creams were used as a hair treatment; they were not.     ",
    "datetime": null,
    "url": "https://www.forbes.com/sites/gracechung/2015/08/19/how-south-koreas-amorepacific-became-one-of-the-worlds-most-innovative-companies/"
}