{
    "title": "How the Kahi Multi Balm Created Korea's Biggest Beauty Trend of 2022| Expert Insight | Allure",
    "text": "By Devon Abelman All products featured on Allure are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission. When the pandemic first struck, South Korea quickly adapted to the necessary social distancing with what's called \"untact\" initiatives. The Korean-English portmanteau of \"un\" and \"contact\" basically applies to anything that usually involved physical closeness to another person being replaced with a contactless digital alternative, like remote doctor appointments and food-ordering apps. K-pop stars also stopped having in-person concerts and meet-and-greets in favor of untact events. Fans now can watch their favorite idols perform songs on digitally augmented stages or chat with them over video calls. This concept trickled down to beauty products, too with the rise of multi balms. For those unfamiliar, they are basically oversized lip balms for your whole face. You can glide them onto your face, neck, cuticles, or whatever feels dry for hydration and glow without using your germy fingers. They even have benefits beyond that, which I'll get into soon enough. Multi-use sticks have become so popular in Korea that Glowpick, a Korean beauty product review app, dubbed \"untact beauty (언택트뷰티)\" as one of the biggest trends of 2021. The nucleus of it was — and continues to be — the Kahi Wrinkle Bounce Multi Balm. Charlotte Cho, the cofounder of Soko Glam, agrees, noting the stick truly ignited the trend, and the sales numbers and SEO stats can verify this. 911STUDIO In 2021, searches for the Wrinkle Bounce Multi Balm went from about 100,000 to 12 million in just a year, and more than 10 million sticks have been sold as of February 2022, Jake Yi, the brand's marketing director, shares with Allure. As of press time, Kahi remains the top-searched skin-care brand on Naver, Korea's preeminent search engine. Other Korean beauty brands, like AHC, Acwell, Banila Co., Mediheal, and Centellian 24 — to name a few — \"wanted to jump on the trend and provide their own offering,\" Cho says. Now, dozens of multi balms are available in Korea, proving sticks are no longer just house makeup and sunscreen as we have long seen this delivery system in America. K-beauty has shown they can now be serums, essences, and moisturizers combined into one hygienic tube. Cho owes the overall success of multi balms to today's beauty consumers looking for convenience and simplicity in their routine, especially since many people are wearing less makeup lately due to masks. They can reapply without much (or really any) mess. Because Seoul is so densely populated and has lightning-fast internet, Koreans are incredibly information savvy about everything, especially skin care, says Sophia Hong, a licensed Korean aesthetician and the founder of maskmoments.com, a biodegradable sheet mask subscription service. In turn, they always want the latest and greatest products. \"This environment forces the Korean beauty industry to be more competitive and, in many ways, forces innovation,\" she adds. For this reason, the popularity of cushion compacts soared in Seoul over the past decade, as Hong points out. Multi-use sticks are, more or less, the next iteration of the portable product. \"The Korean beauty industry appreciates this kind of application,\" she adds. \"If you think about it, what's in these new skin-care sticks is not too new, but the application is different and that stands out.\" However, if you ask Yi, the ingredients in Kahi's Wrinkle Bounce Multi Balm are new, and the stick wouldn't be as popular as it is if it wasn't packed with them. \"For the past 10 years, the Korean beauty market has been very ingredient-centered with a heavy emphasis on natural, high-functional, and vegan,\" he tells Allure. With this in mind, Kahi strives to discover unique, unexpected ingredients for effective hydration and wrinkle improvement — and its consumers now look to Kahi to learn about them before anyone else. Allure's Ingredient Index is basically installed in my brain, but some of these newfangled additions to the multi balm's ingredient list eluded me. I found myself reading up about lithospermum erythrorhizon root extract, which studies have found to help skin retain moisture, and fermented garcinia cambogia, which is made out of a Southeast Asian fruit that is hardly ever used in skin care. By Aliza Kelly By Gabi Thorne By Gabi Thorne The amino acid-rich ingredient is known to have antifungal, antimicrobial, and anti-inflammatory properties when added to food and Indian medicine, though. Plus, fermentation helps it penetrate skin better, cosmetic chemist Ginger King previously told Allure. The stick also features a topical version of the central ingredient in Seoul's highly sought-after \"skin booster\" shot Rejuran: DNA extracted from fish sperm. (You can dive deeper into this skin rejuvenator in our guide to Korean's popular injectables.) The Kahi's Wrinkle Bounce Multi Balm truly is a testament to K-beauty's forward-thinking. I have a feeling we're going to see a lot more skin-care sticks and products spiked with these ingredients in America soon enough. Product placement in Korean media also helped the multi-balm trend blossom, both Hong and Cho note. I can personally vouch for that too. Back in April 2020, I first spotted the Kahi Wrinkle Bounce Multi Balm's petal-pink tube while watching the Korean drama \"The King: Eternal Monarch.\" The main character, played by actor Kim Go Eun, slicked the Kahi Multi Balm onto her ever-so-glossy skin during several scenes. She popped up on my screen with it again when she starred in \"Yumi's Cells\" in September 2021. Viewers eventually started seeking out the stick in droves and calling it the \"Kim Go Eun Balm.\" According to Yi, Kim was able to swipe on the multi balm so naturally on screen for \"The King: Eternal Monarch\" because she actually reaches for it in real life. She loves it so much that she's since become a global ambassador for the brand. Surprisingly, Kahi is relatively new to the Korean beauty industry, though. The brand launched around the same time as it appeared in \"The King: Eternal Monarch\" as well as when COVID-19 numbers started escalating. \"But product development had already been completed, and the brand was set to sell before the pandemic happened,\" Yi tells Allure. In fact, its touchless application wasn't originally factored into its projected success. While creating the multi balm, Kahi's goal for it was, instead, to provide consumers with an easy way to be able to frequently apply the aforementioned high-quality ingredients for healthy skin, Yi says. After all, consistency is the key to skin-care success. \"We aimed to create a new skin-care routine with a balm stick formula that could be easily used by [people] who lead busy lives and do not have time to properly take care of their skin,\" he adds. By Aliza Kelly By Gabi Thorne By Gabi Thorne I recently got to try the Kahi Multi Balm — finally — and immediately understood the hype. (I'm also newly a fan of the brand's UV Aqua Balm, which is spiked with SPF 50.) Sometimes, I have patches of skin on my face or hands that feel itchy and dry, and the balm is a quick way to remedy it. I also keep one by my bed for some last touches of hydration before I go to bed. It has an occlusive consistency to it that acts like targeted slugging for problem areas. Alternately, you can use the Kahi Multi Balm as a primer to create a barrier between your eye shadow, blush, or lipstick and your skin. I particularly enjoy putting it on my cheeks as a shimmer-free dewy highlighter. You can also smooth it onto areas where your base makeup is creasing to refresh it. If you're into facial massagers, like ice globes or jade rollers, like I am, the multi balm is an amazing, spa-like base for running them over your face with ease too. Supposedly, it also helps smooth split ends, but I haven't tried out that usage just yet. If you want to explore the world of multi balms beyond Kahi and Cocokind, the Centellian 24 Mela Capture Stick is also incredibly popular in Korea right now because it's an easy way to have a consistent brightening, hyperpigmentation-reducing treatment in your skin-care routine. You can try out the Acwell Real Aqua Balancing Stick Cream, which provides non-greasy hydration no matter where you are. It can also act as a soothing barrier between your skin and protective face coverings. \"Cica, a soothing and calming ingredient is in the formula, which comes in handy to apply over the areas where my face touches a mask,\" Cho says. Some standout stateside offerings include Cocokind's Mymatcha All-Over Moisture Stick and Tumeric Spot Treatment. The Asian American-founded skin-care brand actually started offering these two portable multi-use stick options long before the pandemic started. They officially launched in 2017 as mess-free, multi-functional ways to treat dry and acne-prone skin, Priscilla Tsai, the founder of Cocokind, tells Allure. Plus, she admits she's a lip balm devotee and wanted a way to treat dry spots on her face the same way she puts balm on her parched lips. By Aliza Kelly By Gabi Thorne By Gabi Thorne Now, five years later, the Mymatcha Stick has become increasingly in demand due to the untact beauty trend and viral TikTok videos. Fans of the stick love sharing on the social media platform all the unexpected ways they use it, like slicking down flyaways and subbing it in for brow gel. I also recommend checking out the Em Cosmetics Face Cuddle, Hero Cosmetics Force Shield Superfuel Serum Stick, and Tatcha's The Serum Stick. Lovers of these have praised how they help their skin adjust to tretinoin use and calm flaky, inflamed areas of their face, which is another major benefit of multi balms that K-beauty has overlooked. Courtesy of brand Now, go ahead and add one to every purse and pocket. Your friends are sure to be intrigued by your new K-beauty discovery. Read more about popular K-beauty products: Now, watch beloved Korean makeup artist Pony Park create a quick liner look: Follow Devon Abelman on Twitter and Instagram. You can also follow Allure on Instagram and Twitter, or subscribe to our newsletter to stay up to date on all things beauty. By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Nicola Dall'Asen By Sarah Han By Sarah Han By Sarah Han More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2022-04-26T14:00:00.000Z",
    "url": "https://www.allure.com/story/multi-balms-korean-beauty-trend"
}