{
    "title": "How BTS and other K-pop idols are putting their faces to good use – getting mask sales to soar | South China Morning Post",
    "text": "A decade ago, sheet masks weren’t a necessary step in the daily skincare routine. They were nothing more than an additional option once in a while when you wanted extra hydration. Other than that, little attention was given to sheets that were handed out free on the streets of Seoul. While the beauty brands still offer them as free samples these days, they are now an essential beauty item in every home. A new “1-sheet-mask-a-day” skincare regimen among Korean women has emerged. The sheet masks have also become the most popular K-beauty product across the world in little more than a decade. What prompted such global growth? Korean beauty experts attribute the overwhelming success of the sheet mask to its functionality, approachability and the influence of Hallyu (Korean Wave). “As we entered the new millennium, Hallyu fervour started to spread in the Chinese-speaking regions due to the influence of Korean entertainment and culture,” said Kim Ji-eun, team manager of M Project team at Amorepacific, the Korean beauty conglomerate which owns Sulwhasoo, Laneige, Mamonde, Innisfree, Etude House, Hera and Iope. The M Project team leads the research and development of beauty masks within the company. “Among the things that grabbed their attention was Korean women’s skincare rituals which involved several steps, including the 1-sheet-a-day routine. This started to be viewed as the beauty secret to Koreans’ flawless skin.” The popularity of sheet masks has since spread to Europe and North America. Sheet masks weren’t big until the early 2000s. However, market growth in the mid to later stages of the decade, propelled by the advent of MediHeal, a local sheet mask manufacturer which was launched in 2009, helped to popularise the masks. MediHeal has sold 1.6 billion sheet masks to date. The brand which started exporting to China, Hong Kong and Singapore, now exports sheet masks to over 26 countries. “In the 90s, the quality of sheet masks was poor and they were only seen as products used by actresses, but since the 2000s, the market began to grow. MediHeal is one of the brands that benefited from the market, conquering the Chinese-speaking region,” said Lee Ho-jin, manager at public relations agency Medicom. While she manages LED mask brand L.linic, she remains an avid sheet mask fan. “The growth of the sheet mask market can be attributed to several factors – the rise in interest and knowledge of consumers, the rise of online shopping, and the emergence of chemists. In the past, purchases of beauty products were only possible through department stores or door-to-door sales, but with the advent of chemists and online malls, access to products became much easier and diverse.” Not only was it easy to get your hands on the products through different channels, it was also cheap. “It’s a low-hurdle item. Because it’s cheap, it’s easy to give it a try as the first Korean skincare item for foreigners who are interested in K-beauty products,” said Cassie Jeong Ja-young, PR manager at WishCompany, which owns the Korean vegan cosmetic brand Klairs that is more popular abroad than at home. “Korean celebrities, headed by K-pop idols, seem to have had the biggest influence in funnelling K-entertainment fans’ interest into K-beauty products. Korean beauty brands have hired K-pop stars such as Super Junior for Tony Moly and BTS for MediHeal, to be their brand models,” said Jeong. “For foreign fans, sheet masks are the easiest and the most approachable item to dip their feet in. Foreign buyers say they like to display sheet masks prominently at their local store counters because they are eye-catching and attract customers.” Unlike more costly skincare products, sheet masks cost from a dollar upwards, which is “part of the fun”, says Lee, who uses them at least once every two days. She uses one a day in summer and takes them on holiday. Her favourites are from MediHeal and Yakson House – for their hydration, calming and blemish control. Functional effectiveness has also contributed to their growth. The quality of sheet masks has improved as beauty brands have experimented. “In the 90s, sheet masks were made of non-woven fabric glazed in serum which were used as promotional items. The material used for sheet masks has evolved over the years into cotton, hydro-gel and bio-cellulose. Sheet masks were no longer cheap, one-dollar promotional items. They carried their own competitive advantage and became a necessary part of a skincare routine,” said Kim from Amorepacific. “The immediate before and after effects felt by sheet masks give customers satisfaction. Coupled with cheap price and easy usage, this has made it a convenient home care item.” Whether the sheet masks show visible improvements, there is some kind of psychological satisfaction that comes with purchasing them, says Jeong from WishCompany. “That image of placing sheet masks on your face makes you feel like you are investing in yourself,” she said. “You also feel like it will somehow reduce the blemishes and improve your skin. It’s a quick and easy way for ordinary people, who are not beauty experts, to satisfy their needs.” Want more stories like this? Sign up  here. Follow STYLE on  Facebook,  Instagram and  Twitter Korean beauty experts attribute the sheet mask’s overwhelming popularity to its functionality, approachability and the influence of Hallyu ",
    "datetime": "2019-06-12T10:00:17+08:00",
    "url": "https://www.scmp.com/magazines/style/fashion-beauty/article/3014026/how-bts-and-other-k-pop-idols-are-putting-their"
}