{
    "title": "How A-Beauty Is Taking Over The K-Beauty Skincare Hype",
    "text": "That's Australian beauty FYI. When you think of the stereotypical Australian beauty routine, coconut oil, basking in the sun and dry, salty hair are probably the first things that come to mind. And, to be fair, some of that is probably spot on. But, recently there's been a wave of emerging under-the-radar Australian beauty brands changing the game. We're calling it, A-beauty is officially the new K-beauty. In many ways the pioneers of the natural movement, Australians have long utilised their environmental resources to cultivate their ‘glow'. As clean beauty gains even more traction, (that's non-toxic formulas to you and me), the new guard of Australian brands are gaining much deserved recognition for their pure, unique ingredients and enviably simplistic approach. 'Australia has always been known for its natural, high quality products, so now that non-toxic skincare has become so important and on-trend, it's only natural that Australia has been having a major moment,' says Dr Roebuck's CEO Kim Devin. 'The purity of our environment results in high quality beauty products when made in Australia. For example, we have some of the purest waters in the world, and skincare products are formulated with water.' 'Australia has such a unique fauna and flora which modern science is now helping us discover previously unknown benefits of,' agrees Sand & Sky founder Sarah Hamilton. 'The indigenous plants withstand some of the harshest climates, so it makes sense that they're full of potent ingredients.' 'It's also about attitude,' continues Kim. 'Simplicity, convenience and a bit of quirkiness are what the Aussie girls are all about!' That simplicity also spills into their make-up routines, which tend to be minimal and easy, favouring bare skin over anything else. 'Life for Aussies starts at the beach; enjoying the outdoors is our best secret. We don't like to be stuck in the bathroom for hours. It’s all about enjoying life!' Founder Carla Oates is an encyclopaedia of gut health, so there's no one we would trust more to re-balance a dodgy internal micro biome with powders, liquids and even a skincare range. BUY Cleanse Inner Beauty Powder - £38 If you’ve ever been to Bali, you'll know one of the many perks is inevitably coming home with an otherworldly glow. With Bali Body, the mission is to keep up that bronzed-babe-at-the-beach vibe with their selection of bronzing oils and SPF. BUY Coconut Lip Balm - £15.95 Farmed in South Australia, Jurlique are sustainable through and through, continually setting the standard for natural and clean beauty brands even now. BUY Rosewater Balancing Mist Intense Deluxe Edition - £45 Developed by Dr. Roebuck (clue is in the name) the brand has recently been re-packaged beautifully to illustrate the high-active, natural ingredients. Our favourite Australian brand, hands down - there isn't a product in the range we wouldn't recommend. BUY Bondi Hydrating Mist - £22 Grown alchemist is all organic, has the coolest packaging around and covers everything from skin, body & hair. BUY Intensive Body Cream: Rose, Acai & Pomegranate - £21 Twin sisters with a mission to share the benefits of Australian pink clay with the world, Sand & Sky products include a really gorgeous amount of natural ingredients such as Kakadu Plum (which contains 55 times more vitamin C than an orange) and Mangosteen. BUY Brilliant Skin Purifying Pink Clay Mask - £39.90 Formulated with lanolin which mimics human skin lipids and holds up to 400% its weight in moisture, Lanolips is 100% natural, cruelty-free (NB: it does come from the wool of sheep) and the perfect multi-purpose balm. BUY Tinted Lip Balm Trio - £23 LBTY, Liberty's New Fragrance Line, Is Here ELLE Edit: 14 Of The Best Face Massage Tools ELLE Edit: The 20 Best Night Creams ELLE Edit: Best Face Masks For Acne-Prone Skin Hailey Bieber Is A Fan Of These Skincare Stickers 3 Ways To Wear Glossier's Futuredew 4 ways to supercharge your serum The Clarifying Toner Every Beauty Editor Uses ELLE Edit: The Best SPFs For Acne-Prone Skin ELLE Edit: 15 Of The Best Hyaluronic Acid Serums ELLE Edit: 15 Of The Best Clarifying Cleansers The Real Reason Pamela Has Stopped Wearing Make-Up ELLE, PART OF THE HEARST UK FASHION & BEAUTY NETWORK We earn a commission for products purchased through some links in this article. ©2023 Hearst UK is the trading name of the National Magazine Company Ltd, 30 Panton Street, Leicester Square, London, SW1Y 4AJ. Registered in England. All Rights Reserved. ",
    "datetime": "2018-08-15T15:08:00Z",
    "url": "https://www.elle.com/uk/beauty/skin/g22735735/australian-beauty-brands-trend/"
}