{
    "title": "Huda Wishful Skincare Review: Our Honest Take on the Very First Product – StyleCaster",
    "text": "By providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. In early January, Huda Beauty founder Huda Kattan launched a new Instagram account for her upcoming skincare line. Thanks to early teases, I knew it was coming but it was still exciting to see her makeup and filter-free face talking all about skin. Now, my totally honest Wishful skincare review is here. Yup, the name of the brand is called Wishful, not Huda Beauty Skin, as the name of the Instagram handle suggests. And it’s available to purchase today. While makeup is easy to give a quick snap-judgment, skincare can often take a little while to tell if it’s working. I’ve been using Wishful’s first product, the Yo Glow Enzyme Scrub, for two weeks now. Made in South Korea, the K-beauty exfoliator promises to be gentle enough to use twice a week. It’s formulated with pineapple and papaya enzymes, BHAs and AHAs (alpha hydroxy acids and beta hydroxy acids) to remove dead skin, reduce dark spots and brighten your overall complexion. Kattan wrote on her Instagram that it “completely re-texturized my skin, helped with acne scars, reduced my pores and made my skin sooo smooth and soft.” Related Stories How to Watch The Real Housewives of Beverly Hills Live to See Kyle & Mo’s Split Does Hair Training Work? We Asked the Experts First, let me start with what I like about it. The texture of the scrub will be familiar to you if you use a lot of Korean beauty products. It’s a gentle peeling exfoliator that balls up into your hand as you begin to rub it on your face. Some think this is dead skin and while there are for sure some cells, it’s really the product combined with the skin’s oils that pills up. Still, it feels nice and satisfying and not harsh like some physical exfoliants. I have dry, sensitive skin with some hormonal breakouts. I chose to use Yo Glow twice a week at night in the shower. Right away, my skin felt smoother but not dry and tight. That’s a good sign. After about a week and a half, I noticed my makeup applying better. I often have dry spots around my nose and some texture issues on my forehead but my lightweight foundation looked cleaner and more natural—much fewer flakes. I’m impressed. I don’t have any major dark spots or acne marks (except freckles and those are here to stay) so I can’t speak specifically to those things changing.  Now, for what I didn’t like: the smell. I’m pretty sensitive to fragrances and Yo Glow’s smell is strong. It’s not a bad scent but it is perfume-y. It took me a week to figure out what it reminds me of and I finally have it: Glow by J.Lo perfume from the early 2000s. (I’m not sure what the connection is but I swear it’s a similar smell.) I have a feeling many will like the scent but if you’re sensitive to fragrances, just know that this does have them. A post shared by wishfulskin (@wishfulskin) Overall, it’s a good first product from Kattan and it makes me think she’s taking this skincare thing seriously. It also makes me excited to see what she’ll do next. Might I suggest a sheer sunscreen and a hydrating-but-oil-free moisturizer? A girl can dream. Yo Glow is available now on Huda’s website for pre-sale but when it sells out, it’ll be restocked on the website February 16. It will also be in-store at Sephora on February 28. Our mission at STYLECASTER is to bring style to the people, and we only feature products we think you’ll love as much as we do. Please note that if you purchase something by clicking on a link within this story, we may receive a small commission of the sale. By providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. By providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. ",
    "datetime": "2020-02-04T13:30:31+00:00",
    "url": "https://stylecaster.com/beauty/skin-care/1082587/huda-wishful-skincare-review/"
}