{
    "title": "Hyorin Earns Third K-Pop No. 1, GOT7 Tops World Albums – Billboard",
    "text": "Chart highlights from the K-Pop Hot 100 and beyond featuring SISTAR, Hyorin, GOT7, 4Minute, Rain, FTIsland, B1A4, Girl's Day, Brave Brothers and more. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin Another week, another SISTAR member topping the K-Pop chart. The girl group’s leader earns her third solo No. 1 with “Goodbye,” a single off the soundtrack to popular Korean drama “My Love From the Star.” The ballad showcases Hyorin’s signature airy vocals as well as her belting powers toward the end.  Remarkably, “Goodbye” becomes Hyorin’s third solo No. 1. While only six other acts can boast having three or more K-Pop No. 1s, the feat becomes even more impressive when one remembers the 23-year-old already has four chart toppers with her girl group SISTAR. (No. 1s are only officially considered for each act) Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t01/31/2014 Busker Busker, IU, K.Will and SISTAR all have four K-Pop Hot 100 No. 1s as Hyorin joins Lee Hi and Davichi in the three club. Further proving the popularity of “You Who Came From the Stars” is another song from the soundtrack, Lyn’s “My Destiny,” at its former peak of No. 2. Lyn’s ballad has fluctuated inside the top of the K-Pop rankings for five weeks now. “Goodbye” at No. 1 means that Lyn’s attempts to earn her second No. 1 have again been blocked, but with four weeks at No. 1 in 2012, her ballad “To Turn Back the Hands of Time” is still one of the longest-running K-Pop hits to date. Watch the official music video for “My Destiny,” featuring scenes from “My Love From the Star” and see if you get addicted too.  Further down the chart we see K-pop icon Rain and one of two of his new singles, “La Song,” at No. 6. Since the K-Pop Hot 100’s mid-2011 creation, Rain had not released music until breaking his hiatus in January 2014 with his “Rain Effect” album. With its new peak, “La Song” becomes his highest-charting entry yet. It was just two weeks ago that the song had jumped to No. 9, following with a drop down to No. 13 last week and now sits comfortably at No. 6 in its fourth week. The song’s surge in popularity likely comes after Rain performed with a South Korean music legend Tae Jin-A, a veteran trot singer. The duo has combined its powers on recent performances of “La Song,” helping it rocket back up the chart. Watch a performance below from K-pop music chart program “Music Core” that already boasts more than half a million views on YouTube.  After earning one of the K-Pop Hot 100’s biggest singles of 2013 with “What’s Your Name?,” girl group 4Minute and super-producer Brave Brothers continue making chart magic with their latest collaboration, “Getting Fatter,” at No. 10. The catchy new single is the latest track released celebrating Brave Brothers’ 10th anniversary in the industry. More surprise artists will be revealed as the year rolls on.  On Billboard’s World Albums chart, rookie boy band GOT7 has snagged the No. 1 slot with debut EP “Got It?” GOT7 is certainly not the first K-pop act to top the chart — fellow boy bands SHINee, B.A.P, EXO and Super Junior-M all did in 2013 — but the group does benefit from timing: It’s the fastest act to hit No. 1 on World Albums chart after its debut. A mere 16 days after debut single “Girls Girls Girls” was released, “Got It?” was revealed as No. 1 on the World Albums chart. K-Town recently named GOT7 one of the five K-pop acts to watch in 2014. Watch its debut music video for “Girls Girls Girls,” which rises to No. 36 on the K-Pop Hot 100, from No. 52, in its second week.  K-Pop on Other Billboard Charts:—Japan Hot 100: FTIsland’s “Beautiful” (watch below) debuts at No. 23.—World Digital Songs (Highlights – Full Chart Available to Billboard Subscribers): PSY’s “Gangnam Style” is the biggest-selling K-pop song this week at No. 2. GOT7’s “Girls Girls Girls” debuts at No. 8. Meanwhile, B1A4’s “Lonely” slips to No. 20, from No. 10, in its second week and Girl’s Day’s “Something” slips to No. 24, from No. 15, after four weeks on the chart.  Daily newsletters straight to your inbox Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2014-02-01T00:50:14+00:00",
    "url": "https://www.billboard.com/pro/hyorin-earns-third-k-pop-no-1-got7-tops-world-albums/"
}