{
    "title": "HyunA Talks U.S. Debut, Filming With PSY & Being Labeled Overrated – Billboard",
    "text": "\"Gangnam Style\" co-star, HyunA, takes time to talk to Billboard in one of her rare interviews. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin As a girl group member, solo singer, and a special co-starring role in “Gangnam Style” (the most watched YouTube video ever,) HyunA has become one of the most visible and in-demand stars of K-pop. But before “Gangnam Style” was even released, HyunA was making waves racking up millions of views on YouTube for her enchanting music videos that display her unique balance of sexy and cute charms. The viral nature of singles like “Bubble Pop!” (with 47 million views), “Ice Cream” (35 million), plus 4minute’s “Volume Up” (14 million), prove an interest further than just K-pop fans. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tPSY\t\t\n\t\t\t\t\t\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news   EXCLUSIVE PHOTOS:HyunA! Hooray! Yet all things seemed to move into hyperspeed with her appearance in PSY’s “Gangnam Style” video as the rapper’s gorgeous dance partner. With over one billion views, HyunA inadvertently was lodged into the international consciousness. HyunA and PSY released a collaboration version of the mega-popular track with almost 250 million views; the second most-viewed K-pop video of all-time. HyunA has blossomed into a true superstar in the past years and the good company she keeps laid the ground for a successful pathway. it may surprise many to know she originally debuted as part of the ultra-successful Wonder Girls group in 2007 (she raps the bridge in single “Irony”). She left the group due to health reasons that year, but ultimately landed with Cube Entertainment where she debuted with 4minute. Later she found the opportunity to promote as a solo artist and even with exciting unit projects like the Trouble Maker sub-unit, with labelmate Hyunseung of boy band Beast, and Dazzling Red with other K-pop all-stars. HyunA took time to talk to Billboard in a rare interview. Watch the video to get a behind-the-scenes look at her photoshoot, plus read on to learn about collaborating with PSY for her music video and whether she plans on debuting in America. Plus, be sure to read our bonus questions below including plans on 4minute’s comeback this year.  You had an exciting 2012. What was last year like for you?I have so much to be thankful for in 2012. When I look back at last year, I was such a lucky person. I was extremely happy as I was able to perform on all kinds of stages and meet/work with new people. It was interesting to work with a lot of international directors and producers.  “Gangnam Style” surpassed a billion views! You had a large popularity in K-pop before the music video, but did it help you gain more recognition in foreign countries?First and foremost, I just want to thank PSY. I received more than I can ever ask from him that it actually worries me. I am worried that I might inconvenience or have inconvenienced him because I received so much love and attention because of him. But as long as I work hard and get good results, I think everything will connect. Do you have plans to debut in the States?I can’t specifically talk about my plans, but it is true that positive ideas are being discussed. It is all because of PSY and I have been very lucky. I think people are taking more interest in me because I’ve been getting a lot of exposure lately. In order for me to jump on the opportunity [should it arrive], I need to be prepared. I am putting in a lot of hours studying English. I think I’d fit in quickly. I mean, my vision of the U.S. is limited because I can only see or learn things from here, but I want to go experience it all. Every time you release a video on YouTube, it goes viral! What do you think it’s about you that fans worldwide love?I think PSY opened a lot of doors for K-pop artists. During our performances, I can tell that our audiences have tripled lately. I think there’s going to be a lot of artists that are going to start breaking down barriers and paving ways for K-pop artists to crossover. I don’t really get intimidated about trying out new things on stage. I can go from doing an electronic track to hip-hop to even folk songs. I think people like that variety in me. Honestly, I don’t think I’m exceptionally pretty or talented. But the advantage I have is that the performances I do can only be done by me. When most people see me in person think I’m either really small or skinny. I think people are more attracted towards my personality, smile and energy [once they get to know me]. People tell me they like my personality more than my face [Laughs].  PSY appeared in your “Ice Cream” video. What was that like? Honestly, I felt really bad asking him for a favor! Especially because he was so busy with promotional activities overseas. I did not want to burden him by asking whether or not he would want to make a cameo appearance in my video. But he thought nothing of it! He was back in Korea for a commercial shoot, while I was shooting for my music video so the timing worked out perfectly! You can see from the video, but we ad-libbed the entire opening scene. It wasn’t hard acting like I was mad at him for eating my ice cream, because he really enjoyed it! You worked with producer Shinsadong Tiger for your singles “Change,” “Bubble Pop,” and “Trouble Maker.” But for your latest track, “Ice Cream,” you worked with producer Brave Brothers. How was it working with a new producer? I wanted to embark on new endeavors. It’s easier to work with people that are familiar with me and my musical style, but I wanted to really challenge myself and do new things. I focused on areas that I never tried out before. I participated in composing and writing for one of the tracks in my latest album, which was fun. NEXT PAGE: ‘Every time I hear that I crave for attention, it hurts a little. I cry a lot alone out of frustration’   Do you have a favorite solo song? I don’t have a favorite between “Change,” “Bubble Pop” and “Ice Cream.” I was able to show different charms through all my solo tracks. People were able to see a new side of me in the “Ice Cream” music video. All my songs are dear and meaningful to me!  So far, fans have seen your hip-hop side as well as your writing and composing talents. Is there a specific genre that you would like to try out next? I don’t stick to one genre or color when I work. I listen to everything and keep up with new releases, and during the process, I pinpoint out what I don’t like and what I like, which allows me figure out my own musical style. I want to focus on what I’m good at to show my best qualities. It was a crucial step for me to include a ballad track in my album. “Very Hot” is another meaningful track, because I participated in writing and composing. Do you play any instruments? I am interested in piano. Luckily, I know how to play a little because my mom sent me to piano lessons since I was a child–although, I quit in the middle. I don’t think I would even try to learn now if I didn’t have any basic fundamentals. What is the difference between 4Minute’s HyunA and solo artist HyunA?4minute’s HyunA is still me. I’m able to do solo activities because there is 4minute. [My bandmembers] are the ones that complete me as an artist; they are like my family. We spend more time with each other than we do with our own immediate family members. Of course, we weren’t that close in the beginning. All of us aren’t very sociable nor talkative; we are all somewhat introverted. I don’t have that many friends, so I like to keep the ones that I really care for close to me. When we are promoting as a group, we focus on our teamwork and the harmony of our each individual characteristics. I can’t tell you exactly when, but 4minute’s album will come out sometime this year. Describe 22-year-old HyunA.I am a very confident and honest woman. I don’t usually dress up for my daily activities or when I meet my friends. I don’t wear a lot of makeup. There is a huge discrepancy between my onstage and offstage persona. I like to be provocative and enthralling when I’m on stage. But because that “sexy HyunA” image is so embedded that most people think that I would be like that offstage, which isn’t true.  What are some common misconceptions of HyunA?Every time I hear that I crave for attention, it hurts a little. I cry a lot alone out of frustration. But then again, I know it is something only I can have. So I’m just going to use that to my benefit and try out different makeup, hair and stage costumes. Honestly, I am more known to the masses for my performances, not for the amount records I sold. I consider myself a visual performer. It would be nice if I can do both, but that is why I have my members to cover my flaws. Our synergy effect when we are together is really good. People get nervous when they have too much. I don’t have enough to be nervous. I just have really good people around me. I think people with a lot of good friends are emotionally rich. I like working with good staff members and performing on good stage. If I cared about every criticism towards me, it would be exhausting. I just know I have to try really hard in everything that I do. How do you respond to those who say you’re overrated?I get a lot of support and help from all the amazing people around me. It’d be amazing if everyone loved me, but I guess I will get that as long as I work hard. These days I’ve been thinking that I should always remain the same. For example, just because I’m crossing over to the States, I don’t want to start all over and try to be someone else. I just want to be me and show what I have been doing for all these years. I just want to be relaxed and have the opportunity to meet a lot of different kinds of people. What kind of platforms would you like to perform on in the near future?The year-end award shows in the States are really over-the-top and grand. I want to be part of all kinds of award shows in Korea, but it would be awesome if I can participate in award shows in foreign countries. Where is your go-to place in the States? What do you like to eat?I prefer to eat pizza over Korean food so American food fits my palette pretty well. I go to In-and-Out [Burger], because the franchise is not in Korea. When we [4minute] go to the States, In-and-Out is the first thing we eat when we get off the plane. Is there a fan you remember the most?I can’t really pick one specific fan. We went to Brazil and London for our “Cube United” concert and that was just beyond awesome. Especially in London, it felt like I was part of the movie “Love Actually.” I love the ambiance of London. In Brazil, one of the fans fainted and was carried out. Because we never saw her again, she lingers in my mind. We were so worried. It took us about 30 hours to get to Brazil, but it was all worth it because the amount of love they showed us. They were really passionate.  What are you interested in these days other than music?I am very into fashion. The sneakers that I wore during “Ice Cream” promotions, I picked and re-designed myself. I am interested in stage costume as well. I think it’s because I’m just curious about so many things. I love learning new things. During photo shoots, staff members that know me well always hands me the camera. The TV series that aired last year on OTV called “4Minute’s Troublemaker” was mostly shot by me. One of the episodes aired 20 minutes of footage that I filmed! I also like collecting scented candles. I light them up according to my mood. I prefer aroma, jasmine and bergamot. I like displaying my collection and just looking at them! What are your goals for 2013?I would like to continue the way I am, but I would also like to take up new ventures and improve myself. I get praised and reprimanded all the time. I hope to better myself this year. I think my heart grows bigger each year. When I go to bed, I always recollect my thoughts and look back at what I did for the day. In 2012, I met a lot of good people. I think I learned a lot in 2012 working hard with my staff members. Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2013-01-31T23:15:18+00:00",
    "url": "https://www.billboard.com/music/music-news/hyuna-talks-us-debut-filming-with-psy-being-labeled-overrated-1536202/"
}