{
    "title": "I Had Korean Double Eyelid Surgery at 18. I Look Back Now with Regret.",
    "text": "Years after going under the knife, writer Iris Kim examines her complicated relationship with Korean plastic surgery and impossible standards of beauty. Most summers growing up, my parents shipped me off to my grandparents in Seoul. During the afternoons, I would sprawl out on a bamboo mat in the sweltering heat as my grandmother tuned in to a Korean drama or K-pop concert playing on the government-sponsored channels. I sat enraptured by the stick-thin and pale-complexioned Korean stars onscreen with their tragic melodramatic storylines, bubblegum pop tunes, and scandalous dance moves. They looked nothing like me, from their narrow jawlines to their enormous anime-like eyes and milky-white skin. “Why don’t my eyes look like that?” I asked my family gathered round the TV. “That’s because they’ve all had double eyelid surgery,” my aunt explained. “Every single actress you see has gotten some type of surgery done. You can get the surgery, too, when you’re older.” As I would walk home after my hakwon lessons with my grandfather’s hand in mine, I would glance at the women passing us in the Bangbae-dong streets. Their eyes looked like the ones I saw onscreen: round and framed by a crease above the eyelid. At summer’s end, back at home in America, I would pinch my eyes while inspecting myself in the bathroom mirror to craft folds of various shapes and sizes. I cut out thin crescent-moon pieces of clear tape that conformed to my eyelid shape, then pasted them above my lash lines. The tape folded my skin over to create a crease following the curve of my eye. Satisfied, I smiled at myself in the mirror at my newly defined set of eyes. A minority of all Koreans are born with the fold, but most of my family members had naturally endowed double eyelids. It seemed like a cruel twist of fate to me at the time. “We can pay for the surgery later,” my parents reassured me. “You’d look prettier with double eyelids. It would brighten up your face more.” Throughout American history, the Asian eye shape has been ridiculed, appropriated, and exoticized with methods like yellowface practices, barbed caricatures, and racist gestures. My first encounter with the slant eye was on the elementary school playground. Tilt the eyes upward for Japanese. Stretch them to the side for Chinese. Slant them downward for Korean. We stretched our fingers from the outer corners of the eyelids to our temples. Mine angled downward. ​​The passing remarks from family members, the ethereal beauty of Korean stars, and the sandbox jokes built on one another over the years. A Korean American unni returned from Seoul the summer before she left for college; her previously hooded eyes tripled in size. Hers was a complete surgery success story, her entire face seemingly having changed from the procedure. It was the confirmation I needed; I was doubly convinced of the life-changing power of the double eyelid surgery. I explained to my mostly non-Asian friends in high school what the surgery would modify. I was met with confused stares. “What do you mean, you’re creating a fold in the eye?” they asked, puzzled. “See how your eyes have a wrinkle, a crease, above the lash line? And mine don’t?” I took my forefingers and pinched the loose skin on my eyelid. I opened my eyes extra wide to fold the top layer over, creating a crease that stayed in place for a few seconds before I blinked. “So this is what the surgery would do,” I said, demonstrating. I returned my eyes to normal. “And this is without. Look at what a difference it makes.” My friends shook their heads and chuckled. “Whoa. We didn’t even know that an eyelid crease was a thing,” they said. Back then, it didn’t strike me that I was getting cosmetic surgery to construct a physical trait that almost none of my friends could even discern. Shortly before my freshman year of college, my mother scheduled a consultation with a well-known plastic surgeon. She and I traveled there together on an early July morning. The doctor was a placid, well-groomed man. He explained that there were two different types of double eyelid surgery, called blepharoplasty in medical terms. I could opt for the non-incision sutures or a much more invasive incision technique. He diagnosed my eyelids with ptosis—weaker, sagging muscles common in those with monolids—and recommended the incision and an added ptosis surgery to tighten the area. It was, no doubt, the pricier option of the two. He flipped through a few blepharoplasty before-and-after pictures on his desktop screen. Monolid, click. Double eyelid. Monolid, click. Double eyelid. My heart leaped. A whole new pair of beautiful eyes. The “after” screen opened up a world of possibilities. I’d been ready since the day I laid eyes on my first K-pop star. It wasn’t until college that I read that Asian blepharoplasty was popularized in 1950s Korea by David Ralph Millard, an American military plastic surgeon. He operated on Korean interpreters working for the U.S. military during the war, sex workers, and brides of American GIs. With this initial catalyst, the surgery took off in a postwar Korea that desperately aspired to the Western physical ideals of their occupiers. Clinics offering blepharoplasty and other procedures proliferated in Korea in the ’60s, and by the ’90s, South Korea had become the plastic surgery capital of the world. Modern-day Korea has, by some estimates, the highest per capita plastic surgery rates of any nation. One in three women have undergone some kind of plastic surgery operation. The Korean government advertises the country as a plastic surgery tourist destination to neighboring Asian countries that consume Korean media and content. As So-Rim Lee wrote in The Drama Review, the “global expansion of the two state sponsored export industries of K-pop … and medical tourism” in the 2010s led to the explosive “synergistic popularity of these two industries,” forming the idea of the body as a piece of capital that could be surgically reinvented. Blepharoplasty is by far the most common surgery and is now considered a relatively minor procedure. Patients can resume their daily lives almost immediately afterward, as the swelling typically goes down after only two weeks. All patients need to do is wear sunglasses out in public for a week or so. It’s a ritual—a rite of passage for many teenagers. Parents, to reward their children for persevering through the grueling studies of Korea’s famously rigorous education system, foot the plastic surgery bill as a graduation gift. Korea has an extremely sexist and competitive job market, and photo submissions were only recently rendered unnecessary on résumés. In Korea’s highly gendered society, men do not have to meet nearly the same rigid expectations for eye or facial shapes in the workplace, but female job applicants are still blatantly judged on the basis of their attractiveness. Large, surgically altered eyes can boost women’s chances of career success. In the face of such rampant sexism, it’s hard to fault young women for enhancing their eye sizes, or parents for supporting their efforts. After his return to the States, Millard wrote in medical papers that the Asian monolid “gives the effect of an expressionless eye sneaking a peep through a slit, a characteristic which through fact and fiction has become associated with mystery and intrigue.” He added, “The absence of the palpebral fold produces a passive expression which seems to epitomize the stoical and unemotional manner of the Oriental.” He then declared his saviorist intent: “The plastic surgeon may be called upon to help [Asians living abroad] blend with their surroundings.” To Millard, the “Oriental” body was a soulless, unemotional machine, an empty vessel to be crafted and molded to the Western imagination’s liking. He viewed the Asian face as a mass of unshaped clay, which could be cut into and slit open. It could be fashioned from the Orient to an upgraded, less-homogenized version of itself, to enter a postcolonial Western world. It could be opened up through the orifice of the eyes. What I remember about the surgery is this: The doctor laid down a light blue-colored sheet with eye cutouts over my body. I breathed in and out of my nostrils slowly, taking care not to displace the sterile drape. The anesthetic shots were, as my Korean American friends who had undergone the surgery warned, immensely painful. There was a total of four administered on each eyelid corner. Each felt like an excruciating hornet sting, and I shrieked internally every time I felt an injection. I clamped my mouth shut, knowing that another would quickly follow. The rest is a hazy memory. I drifted off into a fugue state, half delirious with pain and half strangely at peace during this predestined, inevitable moment. After the surgery, my eyelids numbed by the long-lasting anesthesia, I stumbled out of the office. My eyes were swollen into bloody wet slits. I put on my large sunglasses, took my mother’s hand, and traveled back home. I reclined the seat as far back as it could go. The whole trip, I pressed Ziploc ice packs wrapped in paper towels to my eyes to lessen the swelling and soak up the shallow bleeding, while my mother hummed along to classical music. I spent a week bedridden post-surgery. Lying flat on my back to prevent the blood from leaking from the corners of my eyes onto my pillowcase, I binge-watched Korean dramas on my overheating laptop, playing the never-ending guessing game—Did This Actress Get Double Eyelid Surgery? What About That One? When the swelling had gone down enough for me to venture outside, my mother and I drove back to get my stitches removed. During the first few months after the surgery, I hated the way my eyes looked. The doctor wasn’t the infallible plastic surgery wizard he claimed to be. My newly incisioned eyelid folds ended up mismatched, the left one slightly more defined than the right. I resented the extra half-millimeter gap on my left eye, which to me looked like a gaping gorge I suspected to be evident to even the furthest passersby. I was shipped across the Pacific Ocean by my parents every summer with the intention of making me more Koreanized, and instead, I internalized the need to physically enhance my features by undergoing an operation that a Western doctor had imported to the Korean people. Ironically, Western beauty standards can be made even more twisted and ugly in non-Western nations by amplifying existing foundations of caste and class hierarchies. The wholehearted embrace of capitalism by previously poor “Third World” nations like Korea spits out a culmination of plastic surgery efficiency and expertise unparalleled in the Western world. Colorism and skin-whitening creams abound in the previously colonized nation in ways that they could not in proudly “color-blind” Western ones. And in Western nations, beauty standards otherize ethnic features when they are on ethnic bodies, but are glamorized and commodified when combined with Eurocentric features. We glorify the half-Asian Henry Golding as the “Instagram face,” his slightly Asiatic tones mixed with European ones, as the perfect balance of East and West, as if too much of East is not as beautiful. The slant-eye gesture from childhood becomes a popular TikTok trend, and influencers like Kendall Jenner and Emma Chamberlain pose in pictures tugging their temples upward to create a “sultry,” “fox-eye” look. Caucasian Westerners tan their skin to look like they’re “glowing,” “sun-kissed,” “olive,” but the actual bodies with the skin tones they aspire to are deemed much less desirable on the Eurocentric spectrum of beauty and attraction. We have two Korean-language cable channels in our American home: KBS World and MBC America, subsidiaries of the same government-sponsored channels I watched during my Seoul summers. In between Korean variety shows and dramas, the channels play grainy advertisements from the local Korean supermarket, traditional acupuncturists, and renowned plastic surgeons. Some of the K-drama actresses have uncannily enlarged eyes. “Tuduh gochutsuh!” my mother exclaims in Korean. She tore up her face. I join her in her moral finger-pointing, half of me wishing my eyes looked like theirs, the other half disgusted by their blatantly unnatural features. But from childhood to now, I can’t tear my eyes away from the screen. Their faces hold the promise of what mine could be, or could have been. K-Beauty has now become a prized cultural export. Beauty stores from Sephora to Ulta devote entire retail store sections to the wonders of miraculous K-Beauty products from across the seas. K-Beauty’s market size was valued at $9.3 billion in 2018 and is projected to reach $21.8 billion by 2026. Korean beauty standards have evolved to a face that, according to Ji Yeo, a photographer who documents the healing process of plastic surgery patients, is a “baby-looking face” with large eyes and a pointed chin. Roman Mars, who hosts the podcast 99% Invisible, adds, “The overall effect they go for isn’t necessarily Caucasian, it’s almost pixie-ish.” The recognizable Korean actresses of my childhood, with their unblinking double-eyelid smiles, gaze back at me from the displays of Jeju snail water-infused essence face masks stacked in the display. Perusing the aisles of a Sephora store, I marvel at their impressive popularity. Korean marketing has succeeded in promoting the age-resistant, baby-faced skin of Korean stars to Western societies that worship at the altar of tautness and youth. A part of me feels triumphant—if only Millard could see how Korea had risen from the ashes of a war-ravaged Third World nation that he once visited to become a hegemonic global beauty empire. My Korean American friends and I recently discussed our younger selves who underwent double eyelid surgery as teenagers. Did we regret it, knowing what we do now, or did we ultimately feel content with our choices? The answer is more complex than I’d like to admit. Right after the surgery, during college, I felt more confident with my more “American” new eyes. This translated to the way I held myself in relation to the predominantly white school I attended, where the closer you fell to Eurocentric features and skin tones, the more desirable you were. Seven years post-surgery, my lopsided right fold has almost completely loosened, the previously deep indent now a faint impression. I still rarely show even my closest friends what I look like without eye makeup on. Since then, my family members have offered multiple times to look into redoing the surgery. “Let’s fix the mismatch,” they say. “You’re older, so it won’t loosen the second time. We can make your eyes bigger, even.” Because seven years have passed, I seem to have forgotten the physical sensation of the searing pain. Only the fading memory of it remains. And my eyelids are noticeably messed up—they must be—to everyone I meet. I will always be unhappy with how they turned out. As I’ve pieced together the larger forces that have converged to birth the Korean beauty and plastic surgery industries of today, my understanding of their implications oscillate between the personal and the political. Is the knife a colonial weapon that haunts us, inflicting an age-old wound, or a 21st-century tool that can help us feel more empowered, despite the costs? Can we acknowledge the critiques of plastic surgery and its capitalistic beauty constructs while refraining from condemning those who opt into it? On the spectrum of body alteration—from widely applied Korean anti-aging lotions to blepharoplasty surgery—where do we draw the line between the natural and the uncanny? Do any of us have a right to draw a line at all? Only one feeling remains constant. Every time I return to Korea, I see the same women on the street, the perfectly lidded ones from my childhood memories. I wonder what it would be like to look like them. I try to suppress those musings as much as I can. You Can Now Preorder Beyoncé’s Cé Noir Perfume Gift Peace of Mind With These Top Wellness Picks The Best Perfume Advent Calendars for Scent Lovers 45 Luxe Scented Candles to Gift This Year Bazaar Hosts a Panel With Max Mara and Biân 21 Essential Perfume Gift Sets Everyone Wants 25 Prime Big Deal Days Fitness Buys to Shop Now We're Keeping Tabs on This Rare Body Care Deal How Kosas' Sheena Zadeh-Daly Takes the Edge Off The 11 Byredo Scents Bazaar Editors Love Tenoverten’s New Bath Soak Is Ballerina-Approved Shop These 11 Best Teeth Whitening Strips A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2022-12-05T15:00:00Z",
    "url": "https://www.harpersbazaar.com/beauty/health/a41914030/korean-double-eyelid-surgery-essay/"
}