{
    "title": "I Recreated 7 Vintage K-Beauty Looks From A '90s Korean Beauty Mag — PHOTOS",
    "text": "Fashion  The other night, I decided to go full Marie Kondo on my childhood bedroom when I came across a vintage Korean beauty magazine that definitely sparked some joy. Full of vintage K-beauty tips and pictures of some very bad perms, this old school Korean magazine is seemingly from the early '90s, and it's a kooky little gem: A quick snapshot into the history of K-beauty. Living in the United States, it can be easy to believe that K-beauty was only created in the last couple of years, and for good reason. For a long time, importation of Korean beauty was a really niche industry. When going through this magazine, it's all but impossible not to compare the skincare tips from yesteryear to the K-beauty we know today — which, on the surface, is much sleeker than what's pictured in these pages — simply because they look so different. There's no high-tech LED devices or sheet masks or even BB creams to be found. But in going through this magazine, I realized that a lot of the fundamentals are the same, and some of the K-beauty trends that Americans have deemed \"wacky\" have a longer history, at least as old as this glossy. Now, in the interest of full disclosure, I should say that I can't really read Korean. Most of what I'm going off of here is based on the pictures, and I'm sure there are plenty of tips that I missed or misread along the way. But it's always fun to look back and see what's changed and what's still true. So here's my sorry attempt at recreating seven old school Korean beauty tips and trends, based exclusively on what's within the pages of this magazine and what I could run through Google Translate. Concepts like the 10-step skincare routine or products like ampoules and essences were basically foreign to American consumers as recently as a year ago, but this spread shows that these have been kicking around in Korean beauty routines for decades. And this is the one \"vintage\" Korean beauty tip that I use regularly, as part of my nightly skincare routine. Just like in this old school magazine, which mixes Chanel with some likely now obsolete Korean brands, my own skincare routine is a mix of Korean and Western products, from Aromatica's awesome Rose Absolute First Serum and Vital Fluid to Glossier's Milky Jelly Cleanser and Kiehl's Ultra Facial Cream. If I really need to get a good double cleanse going, I use VDL Naked Cleansing Oil Cream, which is the most heavy-duty cleansing balm I've ever used. Speaking of skincare routines, it's certainly important to use high-quality, efficacious products, but the way in which you apply your essence or moisturizer can also make a huge difference, and that's part of what this spread is highlighting. These are instructions for face massages, which will, theoretically, increase blood flow to your face and help make your skin appear fuller. At least, that's the gist of what I could kind of understand. The face massage didn't not feel good, but I'm not sure if I'm ever going to be good enough at the techniques pictured to give myself a facial in the comfort of my own home. To be honest, that might also be because I'm going off of pictures rather than the written instructions since I can't really read Korean. Hanboks, the traditional Korean dress, are making a comeback these days. Hanboks are a \"street style staple,\" according to Vogue, and Karl Lagerfeld even redesigned the traditional frock at the Chanel 2015/16 Cruise Collection in Seoul. But apparently, they were just as cool back in the day as they are now. If only someone had told elementary school-aged me that this picture would, one day, be hip. Props to young me for recreating trends before they were all that trendy. I don't really have any insights into this particular spread, but I wanted to share it because, come on. It's hilariously retro. Cocktails are also making a comeback on the New York City bar scene, so maybe there's a lesson to be learned there. In any case, here's a picture of my mom, my ultimate K-beauty inspiration, and me, swagging out with matching gin and tonics at my cousin's wedding. We basically look like we belong in a magazine, right? Though fuller brows have become trendy over the past couple of years here in the United States, they've been the norm in Korean beauty for a while, at least according to this magazine. The main difference is the shape, which tends toward a straight-across brow rather than something with an arch. I tried to recreate the look using just a spoolie and some brow powder, as recommended in this mag. It was a delightfully straightforward process (pun intended), but what's really interesting is to see how little the shape of the ideal eyebrow in Korean beauty has changed over the years. A lot has been made about the difference between Korean and American makeup. While Americans have been obsessed with chiseled contouring and matte brown lips, à la Kim and Kylie, Koreans have been perfecting the dewy, natural look. It's much more delicate, and really, this vintage \"pink\" look, as it's referred to in the magazine, is pretty on-trend for modern-day Korean makeup. What I do think is interesting, and speaks to how the K-beauty industry has grown, is that this tutorial features mainly Western makeup, specifically Chanel, rather than Korean brands. I, unfortunately, didn't have easy access to the Chanel makeup counter, so I made do with what I had. After filling in my eyebrows with powder, as pictured above, I used the blushy, glimmering pink shades from the L'Oréal La Palette in Nude 1 on my eyes. I followed up with a couple of swipes of Dior Addict It-Lash Mascara. On my lips is Dior Addict Sparkling Ultragloss in Princess. I highlighted to the heavens with Too Cool For School's Dinoplatz Pearl Bay Invasion Highlighter in Mother of Pearl, and finished off the look with a swipe of NYX Baked Blush in Foreplay. It's not a perfect recreation, but it's not too shabby if I do say so myself, and really, I was just pleased I didn't look like I came straight from the early '90s. In fact, the look was pretty K-poppy and definitely pretty in pink. This look, however, is straight from the early '90s. The bold red lip, the aggressive blush and contour combo, plus the wispy bangs all make for a definitively retro look. Starting again with the L'Oréal La Palette in Nude 1, I slapped on a bronzy, smoky eye using the dark browns, taupes, and golds, then I made my lashes as big as possible with Covergirl Plumpify BlastPRO Mascara. I contoured using NYX Matte Bronzer in Medium, and even used some loose powder to bake in order to make my cheeks look as chiseled as possible. I finished the look off by lining my lips with NARS Velvet Matte Lip Pencil in Dragon Girl, filling in with NYX Matte Lipstick in Pure Red, and glossed up with Smith's Menthol and Eucalyptus Balm. While all of the products are fabulous on their own, I've never been less pleased with a makeup experiment. This is one retro K-beauty look that does not translate well into the modern day, I can tell you that. But somewhat surprisingly, despite the desperately outdated images, most of the other tips and tricks from this old school Korean beauty magazine held up. A lot of the principles that ground K-beauty today — from the importance of sticking to a multi-step skincare routine to the ability to keep makeup light and dewy — stand true in this magazine, and, if anything, are made easier with the constant stream of innovative products coming straight from South Korea. Beauty geeks get bound to get excited about the next great K-beauty invention, but this magazine is a great reminder that the fundamentals of this industry probably won't ever change. And really, that's not necessarily a bad thing. Images: Maxine Builder Choose an edition: ",
    "datetime": null,
    "url": "https://www.bustle.com/articles/147921-i-recreated-7-vintage-k-beauty-looks-from-a-90s-korean-beauty-mag-photos"
}