{
    "title": "I Tried a Korean Rubber Mask, and My Skin Has Never Felt Softer | Allure",
    "text": "By Renee Jacques Allow me introduce you to the next generation of sheet masks: rubber masks. These genius formulas (which are also sometimes called modeling packs) are basically sheet masks that you build yourself. They start out in powder form, but with the addition of water, they transform into a thick goo that you smear over your face and allow to dry, then peel off in one giant, rubbery sheet. And yes, they're just as satisfyingly fun to use as they sound. Rubber face masks have been a staple in Korea for years and are often used in professional facial treatments for their calming properties. But because they're usually messy and hard to apply, they haven't been exactly DIY-able. Until now. \"Since the powders usually come in big tubs, they never really translated into an at-home experience,\" says Christine Chang, the cofounder of Korean e-commerce website Glow Recipe. But Korean company Lindsay has begun packaging them in convenient cup form, and that's changed everything. So, without further ado, please allow me to walk you through my rubber-mask experience: My mask of choice was the Lindsay Collagen Modeling Mask. It looked reminiscent of Cup Noodles, but instead of housing a college dorm-room processed-food staple, it was filled halfway with a fine white powder that smelled like chemicals (though not in a terrible way). It also came with a cute little spatula to help mix and apply the mask. The white powder contains alginate, a derivative of kelp that congeals when mixed with water to form a goopy paste. Other interesting ingredients in the powder include a clay-like substance called diatomaceous earth and calcium sulfate, which is also used in tofu as a coagulant. And, of course, because I was using the collagen mask, the formula also included a dose of hydrolyzed collagen. Here's how it works: \"The 'rubber' is formed when water activates a reaction between the alginate ingredients with the calcium sulfate and pyrophosphate,\" explains cosmetic chemist Ni'Kita Wilson. \"As the formula 'rubberizes,' the skin is tightened, which provides a temporary firming effect.\" Here's what the texture of the mask looks like once the powder is combined with water: Applying the mask was easy—I liked that I could control the ultimate thickness of the mask, which meant I could keep it light and avoid the suffocating feeling of a superheavy mask (very important if you're claustrophobic, like I am). It felt cool on my skin and began to tighten immediately, taking on a rubbery texture. Here's a tip: Don't dilly-dally when it comes to applying it. It congealed so quickly that by the time I'd smoothed it over half of my face, it was almost too solid to apply to the other half. You also want to make sure you apply it more heavily toward the outer edges of your face, which will make it easier to peel off once it's dry. By Aliza Kelly By Gabi Thorne By Gabi Thorne After about ten minutes, the mask was fully dry. Then came the fun part: peeling it off. While it didn't all peel off in one giant sheet like I'd hoped, it was nonetheless childishly entertaining and satisfying, like peeling apart a Fruit Roll Up to play with it before you eat it. And unlike the feeling of rinsing away a clay-based mask (my dry skin gets dry and tight), it seemed especially gentle. There was no tugging or difficulty, so my skin didn't feel the least bit irritated after I removed it. \"Rubber masks are great for sensitive skin because they're not hard to get off and they don't pull at the skin,\" says Chang. After I removed the mask, there wasn't one blackhead in sight, a rare feat for my complexion. My skin also felt crazy smooth—dare I say, smoother than it's ever felt before? Not only are these masks inexpensive (you can get a two-pack for $11), but they also make for one hell of a Snapchat story. By Aliza Kelly By Gabi Thorne By Gabi Thorne The top ten Asian beauty products: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Sarah Han By Fani Mari By Sarah Han By Sarah Han More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2015-08-20T10:00:00.000Z",
    "url": "https://www.allure.com/story/korean-rubber-mask"
}