{
    "title": "I Traded My Lazy-Girl Beauty Routine for an 11-Step Korean Skincare Regimen | Teen Vogue",
    "text": "By Tina Ferraro “You’re pretty high-maintenance, aren’t you, T?” my pediatrician asked me once, all too knowingly. High-maintenance I may be (I got it from my mama!), but the skincare routine that I’ve so carefully edited over the past few years is anything but. I’ve subbed in frothy white cleansers and swapped out heavy moisturizers that left my skin severely congested, somehow managing to knock my pre-bedtime beauty routine down to a simple four steps. Cue the head shakes and call me basic — after all, isn’t it my job to take home products, test them out, and fall in love? Of course; but if I don’t wake up to ridiculously glow-y skin after a few uses of a new elixir, I don’t see an issue with sticking to the bare minimum. Which is why, after dumping a box filled with more than 15 different Korean potions all promising poreless skin onto my living room floor, I was as baffled by the sheer volume of products as I was concerned. Would I have to wake up a whole hour earlier each day to slough all this stuff on my face? Could I? Unsure of exactly where to get started, I grabbed a Sharpie and scribbled fat black numbers on every bottle and jar: steps 1-11 replete with a couple extra boosters in case I felt particularly inspired to attain absolute complexion perfection. “It’s not about the total number of steps. The Korean mentality is to maintain balance,” says Alicia Yoon, skin whisperer and the founder of the wildly popular K-beauty site Peach and Lily, who curated my new regimen based on my skin type and texture. “If you take care of your complexion now, you’ll look the same in 20 years.” A quick rundown of my skin: I very rarely break out, save for the occasional painful mounds that crop up around my hairline when I stretch dry-shampoo days to the max, or the milia (tiny clogs that never come to a head) that form if I’m using heavy moisturizers or overloading on cream blush. And though my skin isn’t exactly starving for hydration, foundation starts to crust from dryness around 4 p.m. each day, if not earlier. (You may also want to note that I don’t eat nearly as many leafy greens as I probably should, but I do drink a good amount of water.) Alicia’s prescription? A hefty dose of antioxidants and moisture-infusing products, so I could finally master the dewy look without drying out midday. My first task, however, was to ditch the retinol prescribed by a derm to keep milia at bay. “Dermatologists are often prescription-happy,” she laments when I tell her that I use a few drops before bed on the daily. “Retinol contains alcohol, which weakens the skin barrier and ultimately thins skin, potentially leading to broken capillaries in the long run.” In Korea, retinol is sort of thought of as a “last-resort” ingredient — and so I tossed it immediately. After peering at my six-page instruction manual, it appeared my second task was to get on board with double-cleansing. Double-masking? I’m down. Double-cleansing, on the other hand? Before embarking on this challenge, I would have questioned the point of cleansing twice in a row since my face is relatively dry and I hate to strip it unnecessarily. Regardless, I massaged Cremorlab Cleansing Gel Oil into my skin, trying desperately to ignore my teenage fear of oils, and watched as it melted right in. It broke down my makeup, though I later discovered that it failed to completely remove the most stubborn waterproof formula I own. Step 1, done. I followed up with Dr. Dream Rose Mild Natured Powder Cleanser, turning a dime-sized amount of powder into a creamy foam by just adding water. Packed with rose stem cells and rose water, this cleanser seriously revitalized my skin. Plus, I felt soft, not stripped, after drying my face on a towel. I nearly considered skipping the next four steps on my checklist — a toner, followed by an essence, then a serum, and finally an ampoule — but reading Alicia’s careful documentation of their hydration-boosting abilities quickly changed my mind. I soaked a cotton pad in Aromatica Orange Blossom Toner, a clear liquid infused with aloe vera, lavender, and chamomile extracts designed to soothe and prep skin for the next steps, and swiped it across my face. After I was sure it soaked in — this is a major key in Korea — I followed with The Lotus Essence with Lotus Leaf. Made with 89% lotus leaf extract instead of water, this silky essence is packed with antibiotics and flavonoids, which counteract the free-radical damage I suffer from living in New York City. Not to mention, it adds an extra layer of hydration before you apply any type of serum. Instead of twiddling my fingers as I waited for it to soak in, I decided this was the perfect time to insert brushing my teeth into my regimen. Fresh-breathed, I coated my face with Ariul Vital Daily Defense Serum to help further build my skin’s natural defense against the environment and get my antioxidant fill. An added bonus: it smells deliciously fruity. By Lexi McMenamin By Sara Delgado By Anjana Pawa Since practically every model I’ve ever spoken to backstage at fashion week has sworn by propolis’s healing powers, I was thrilled to finally have the chance to give it a try. I squeezed three small drops of Tosowoong Propolis Sparkle Ampoule into the palm of my hand with an eyedropper and slathered it across my face, feeling like a scientist in a lab — and looking dewier by the minute. After a few dabs of eye cream to de-puff, I topped it all off with Aromatica 95% Natural Aloe Aqua Gel Cream, squeezing a pea-sized dollop onto my finger (though I doubted such a small amount would properly hydrate, or even cover, all of my face). You guessed it: I was wrong. The results were practically instantaneous, a rare joy. My skin looked wet and I loved it. Foundation was infinitely easier to blend in — and even in frigid, 30-degree temperatures, I looked model-status dewy. After just a few days, my face stopped cracking midday, and I started soaking up the good-skin compliments like a sponge. Admittedly, I cheated some, skipping a few steps if I hit snooze one too many times, or altogether if I got home at an absurd hour and was too exhausted to spend half an hour catering to my skin. But I’m officially a Korean 11-step skincare routine convert. If an extra 20 minutes a day means glowing skin, I figure I can definitely afford to sacrifice a few zzz’s. Related: 4 Skincare Mistakes You’re Definitely Making At Night By Kara Nesvig By Anoushka Lal By Sara Delgado By Gabi Thorne More from Teen Vogue Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Teen Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "datetime": "2016-02-15T13:00:00.000Z",
    "url": "https://www.teenvogue.com/story/korean-skincare-beauty-regimen"
}