{
    "title": "Imports of S. Korean cosmetic products doubled in 2015\n - Business - Chinadaily.com.cn",
    "text": "Models present a South Korean brand of cosmetics at a promo event in Hangzhou, Zhejiang province. [File Photo / IC]\n\n\n\n\n\nExports of South Korean cosmetics and beauty products to China doubled in 2015 to a record high of $1.088 billion, according to the latest figures from the Korea International Trade Association. Models present a South Korean brand of cosmetics at a promo event in Hangzhou, Zhejiang province. [File Photo / IC]  The results show the country's total cosmetics exports were worth $2.75 billion, a 53.6 percent rise, meaning 39.5 percent of those went to China. South Korea's annual exports of this type of brand have enjoyed double-digit growth since 2010. In 2014, they increased 95 percent year-on-year, and 100.6 percent in 2015. One of the current export leaders is Innisfree, a beauty brand produced by South Korean cosmetics group AmorePacific. It has now expanded its number of stores in China to 100, since opening for the first time in 2012. AmorePacific officials say they aim to become Asia's top cosmetics producer with global sales of 70 billion yuan ($11.4 billion) by 2020. China is already its largest market and the nation is forecast to contribute 28 percent of the company's global sales by then. Laurie Du, a beauty and personal care research analyst at Mintel Group Ltd, said the popularity of South Korean brands is most visible among younger Chinese shoppers, who focus especially on medium- to low- end products. South Korean cosmetic brands often have a stronger desire to export than their peers in Japan, Du said, and they have adopted innovative marketing vehicles such as micro-movies and application interactions with their consumers to attract those younger shoppers. Increased use of cross-border e-commerce sites have allowed more access to such international brands. Du said Mintel's upcoming Overseas Online Shopping report, to be released next month, is expected to show that nearly half (47 percent) the beauty and personal care products sold in China in June to November 2015 were from South Korea, making it the most popular source country, followed by 29 percent from Japan and 27 percent from France. China's free trade agreement with South Korea, which took effect in December, however, had little effect on the beauty-products sector with only shampoo and some skincare products seeing significant reductions in import tariffs, of between 20 percent and 35 percent. The Mintel study is based on sales data collected from 38 cities by China Market Monitor Co. Its findings are also expected to show that international beauty and personal care product Olay, which is owned by consumer products giant Procter & Gamble Co, saw an 18.5 percent fall in sales, which was blamed on the products largely being targeted at skin cleansing, rather than the increasingly popular anti-aging market. Du said South Korean brands often offer wider ranges of newer, more topical products. For example, Innisfree has over 2,000 available in-store. European and US brands remain the most popular in skin care, however, with 21 percent of shoppers claiming their favorite brands were French labels (which are mostly manufactured locally), followed by those from the US (13 percent) and South Korea (2.3 percent).     World Robot Conference 2015 Made in China - fight against counterfeit goods 2015 Beijing Forum for Emerging Markets Copyright 1995 - \n\n . All rights reserved. The content (including but not limited to text, photo, multimedia information, etc) published in this site belongs to China Daily Information Co (CDIC). Without written authorization from CDIC, such content shall not be republished or used in any form. Note: Browsers with 1024*768 or higher resolution are suggested for this site. License for publishing multimedia online 0108263             Registration Number: 130349 ",
    "datetime": null,
    "url": "https://www.chinadaily.com.cn/business/2016-01/26/content_23244140.htm"
}