{
    "title": "In a New Art Show, Sephora Meets Imperialism’s Evils - GARAGE",
    "text": " Walking into Tiffany Jaeyeon Shin’s  Universal Skin Salvation installation at the sprawling Knockdown Center in Maspeth, Queens is like entering a science lab crossed with a Sephora. Tubes, spritzer bottles, and more, all containing a pearly white substance, sit on pedestals. As with samples in beauty stores, anyone’s welcome to try the products, which are flanked by what look like delicate, surreal beauty advertisements and textbook pages that note that Korean skin becomes “like porcelain” after K-beauty products, with an “impermeable glossiness” that’s more glass than flesh. Rather than fully visible faces or bodies on display, we get only detached hints: a fingertip applying serum here, a foam-clad cheek there, giving the substances more priority than the humans they’re applied to. Nearby, large vats of lactic acid, the chemical foundation for these elixirs, lie on a makeshift table. Some have tubes in them, others funnels. In the center of the room, there’s a large cube that appears to be made entirely of clouds. Enter it and you’ll find yourself in a lactic acid sauna, with vapor so thick it’s easy to lose yourself. Beauty, as they say, may be skin deep, but in Shin’s show, the obsession with Korean beauty products—skin lighteners, snail slime sheet masks, vitamin C serum, and the vague category of “essences,”—is a cross-cultural phenomenon heavy with sociopolitical implications. As Shin told me when I first interviewed her for an exhibition on similar themes last April, Western interest in K-beauty appears to her as “people literally trying to achieve Korean flesh without wanting the subject of the Korean person and their stories.” K-beauty is more popular than ever: sales have reportedly grown 300% in Asia and the US since 2015. “It's like, if you use these ten steps, Korean skin is available through cultural possession and ornamentation. I think it’s clever what they did, because it’s pretty successful,” she adds. Shin traces American desire for the Korean woman back to the 1950s and the Korean War, when members of the US military sought the services of South Korean “comfort women,” a euphemism for women who were tricked or forced into sex work, often facing further oppression like detainment and involuntary, painful STI treatments. (In fact, the history of “comfort women” goes back even further, originating in World War II.) This American introduction to the Korean woman, and her flesh, through physical objectification supports Shin’s argument that literal objects such as beauty products are now a way to locate Korean identity and agency, once again bypassing personhood in favor of the physical. It may seem strange to claim K-beauty’s popularity reflects that “yellowness” is more desirable in the West, when many of these products make skin that isn’t already pale appear lighter. But these two things don’t exist at opposite ends of a binary. The desire for “porcelain” skin has been ingrained in Korean culture for some time now, but Shin argues that this is a result of the aforementioned wartime and American colonization: it became safer, and more appealing, for South Korean women to assimilate and stay in close proximity to whiteness, both culturally and physically. America’s love for K-beauty is doubly complicated, then—wanting another culture’s magical beauty regimen reflects an exoticization and fetishization of Korean skin, but that regimen is derived from “a preferred lack of pigment” that itself comes from the history of Western colonialism as well as classism, as darker, tanned skin historically denoted a life of outdoor labor while fair skin was associated with wealthier people who didn’t need to toil. Shin is also interested in how K-beauty’s lengthy ten-step routine (oil cleanser, water-based cleanser, exfoliator, toner, essence, treatments, sheet mask, eye cream, moisturizer, sun protectant) intersects with Korean culture and history. She sees a desire for Korean “rehabilitation” after the war and Japanese imperialism, and identifies a labor-intensive focus on achieving perfect skin as a part of that process. Shin believes that Americans’ skin and humanity are also “traumatized,” and that we’re seeking to improve with K-beauty, too. The exhibition’s lactic acid sauna (sizable enough to fit two people) digs deeper than skincare—where it’s used to boost skin turnover, exfoliate, and make the skin appear brighter, and in some cases, lighter—and connects the themes of her show to the material’s use in products both applied to the body and literally consumed. Lactic acid is present in fermented items like kimchi, where it can help fortify the gut and even allegedly soothe PTSD symptoms, and it’s also naturally produced by human muscles. To Shin, there’s a “paradox” in lactic acid’s ability to benefit the body and contribute to the pursuit of whiteness. It “encompasses the compromising position that yellow female bodies are in, where the lactic acid enlivens her or animates her hardened or plasticized body,” she says, “but also entrenches her into a system of ‘lactification,’” a term referring to the whitening of skin. This skincare boom has helped boost Korea’s visibility, economy, and skin quality, but has done so while simultaneously supporting Western, white beauty ideals. Shin cautions against characterizing the show as solely focusing on a desire for whiteness. “I think it’s a really complex topic, and I think it being reduced and essentialized in that way is at risk of not recognizing other sides of yellowness,” she says. “I’m specifically talking about yellowness because I think ‘Asia’ is such a huge continent [and] term…I think yellowness has been described in America to talk about adjacency towards whiteness, and the desire for it to become white. I’m more interested in complicating those notions.” K-beauty products, she explains, are “like the skin of the Korean woman,” but these objects are prioritized more than Korean personhood. And the ideal “glass skin” K-beauty claims to produce is something so perfect it practically stops being skin altogether. “K-beauty wearers are promised with possibilities of endless modification and transformation,” one of Shin’s posters says. If one product doesn’t deliver on its promises of perfection, you can always try another brand, another formula. Despite all this critique, Shin doesn’t want the exhibition’s takeaway to be that K-beauty is evil, or to condemn Korean women, and cites her “frustration in seeing my body becoming a fetish commodity.” Shin explains, “Of course I'm being critical of K-beauty, but if it [wasn’t] K-beauty, it would have always been something else.” She still uses these products on occasion, but they’ve become more “art objects” to her now. They’re something to look at, to think about, and use to find new ways of seeing the world. Tiffany Jaeyeon Shin’s Universal Skin Salvation is on view at Knockdown Center through December 16, with a discussion on November 29 and a performance lecture on December 13. Subscribe to GARAGE. Watch more from GARAGE ",
    "datetime": "2018-11-27T18:56:00Z",
    "url": "https://garage.vice.com/en_us/article/pa5k7n/k-beauty-art"
}