{
    "title": "In-cosmetics Korea preview: K-beauty focuses on formulations",
    "text": "Or wait... Headlines Brand Innovation Formulation & Science Packaging & Design Business & Financial Market Trends Regulation & Safety Promotional Features Site Archive Multimedia Regions All Asia-Pacific South East Asia South Asia East Asia Oceania Site Archive Multimedia Hot topics Clean & Ethical Beauty Sustainability COVID-19 Market Entry Anti-Aging / Skin Whitening Beauty From Within Nanotechnology Green Cosmetics Site Archive Multimedia Resources Type of resources Events All Events Shows & Conferences Online Events Editorial Webinars Events China 中国 Podcast  28-Feb-2018\n                            - Last updated on\n                                27-Feb-2018 at 22:22 GMT This year’s in-cosmetics Korea will kickstart with a focus on formulations. The three-day showcase will centre on an exclusive programme on its opening day to help bolster R&D teams’ innovation. Along with featured formulation activities, there will be intensive training sessions and seminars that look at the entire creation process, from linking formulations to finished products. Stand-out presence​ “K-beauty stands apart for its high quality, undying commitment to innovation, rigorous safety standards, exotic ingredients and unique textures”​, in-cosmetics Korea enthused in a statement anticipating this year’s event. Focusing on Korea’s influence in the cosmetics industry, it went on to say how: “the region epitomises creativity and across the world consumers are increasingly turning to skincare rituals and products that originated in Korea.”​ With fast-paced product development and a broad selection of cutting-edge ingredient and methods at their fingertips, “K-beauty businesses move closer to achieving ‘same day’ formulations”. Production highlights​ Cosmetic chemists and formulators will also have the opportunity to watch up-to-date sensory-based formulation processes in a live formulation open demonstration segment. On-trend make-up and early anti-ageing formulations, along with key market insights beyond 2018 will be highlighted throughout the day to support formulators in devising products that are ahead of the curve. Advice and training​ The formulation day will feature formulation technique coaching by industrial experts in the formulation lab, live demonstrations in the sensory formulation demonstration area and insightful presentations in the marketing trends theatre. Belinda Carli, Director of the Institute of Personal Care Science and an experienced formulator from Ashland will be on hand to deliver exclusive sessions that discuss the latest innovations set to make a bold impact on the R&D beauty and personal care sphere. A purpose built laboratory will be home to R&D professionals from Korea, China and Japan who will provide practical guidance on how to overcome obstacles and develop personalised formulations to meet the needs of growing consumer demands. Attendee awards​ The day will close with a formulation award ceremony, where formulation handbooks will be given out to the 200 ingredients, fragrances, lab equipment, testing and regulatory solutions exhibitors, as well as over 3,000 cosmetic manufacturers from Korea and abroad. The new in-cosmetics Korea Awards and prestigious Formulation Award will be given to the R&D team that has most successfully shown cutting-edge formulation developments. “A large number of visitors to in-cosmetics Korea in 2017 were directly involved in the development and formulation of products,” r​evealed Sarah Gibson, Exhibition Director of in-cosmetics Korea. “The region leads the world in innovation and our new Formulation Day will provide the education and practical advice that will unlock even more potential,”​ Gibson commented. For more information, visit http://korea.in-cosmetics.com/about-the-show/show-features/Formulation-Day/​ Copyright - Unless otherwise stated all contents of this web site are © 2023 - William Reed Ltd - All Rights Reserved - Full details for the use of materials on this site can be found in the Terms & Conditions Related topics\nMarket Trends\nEast Asia\nVoice of the Industry ",
    "datetime": null,
    "url": "https://www.cosmeticsdesign-asia.com/Article/2018/02/28/In-cosmetics-Korea-preview-K-beauty-focuses-on-formulations"
}