{
    "title": "\n\tIndia’s newfound love for K-beauty’s glass-skin and glass-makeup trend - The Hindu\n",
    "text": "To enjoy additional benefits CONNECT WITH US March 28, 2018 12:06 pm | Updated 12:06 pm IST - Hyderabad COMMents SHARE READ LATER Korean beauty is synonymous with a flawless complexion, completely free of blemishes and texture. Despite flawed skin becoming universally accepted, the aspiration to be as pretty as a glazed doughnut still thrives. Last year Los Angeles-based Korean make-up artist Ellie Choi made the trend first go viral. Now with spring and summer underway, the trend’s making an even bigger comeback and is catching onto a number of skin tones. The key is skincare; careful exfoliation to stave off dead skin cells and healthy amounts of hydration, through serums, moisturisers and SPFs to plump up that fresh layer of skin. Ellie, like any K-beauty fanatic, shared sheet masks, both tissue and collagen-based, are a must, followed by a Vitamin C serum. Now, with the bright sun we’re facing in India, vitamin C serums aren’t recommended so give a simple hydrating one a go. Water-based moisturisers paired with a sunblock are the finishers in this seemingly tedious routine.  But what about makeup? The golden rule is to perfect the base and a thoughtful amount of blush. Priyanka Chopra, who sports a duskier skin tone, has long been on the glassy bandwagon. While her makeup on\nQuantico is more matte, her day-to-day glow up is worth taking note, often bathing with Greek yoghurt to keep that hydration game on the incline. Rakul Preet Singh’s skin game is also adapting to the trend, often being very selective about where she places her highlighter, which is typical with K-beauty. The glass-skin trend is summer-ideal as it’s far less exhausting to maintain the sultry heat and makes you look like the very definition of ‘I woke up like this.’ COMMents SHARE The Hindu MetroPlus\n\n/\n\nlifestyle and leisure\n\n/\n\nfashion\n\n/\n\nbeauty treatments and parlours\n\n/\n\nbeauty\n\n/\n\nhealth and beauty product BACK TO TOP Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. ",
    "datetime": "2018-03-28T06:36:25.000Z",
    "url": "https://www.thehindu.com/life-and-style/fashion/india-glass-skin-makeup-korean-beauty-skincare/article23370903.ece"
}