{
    "title": " Influence Of K-Beauty Standards On North East Indian Girls ",
    "text": "0 By clicking the button, I accept the Terms of Use of the service and its Privacy Policy, as well as consent to the processing of personal data Powered by : Powered by Follow Us K-Wave, also known as Korean Wave, is a wave that is hitting and taking over countries globally, India included. From the Korean language itself to their fashion, their skincare and trends, North East states have been highly influenced by the Korean culture for decades. While other parts of the country have only recently been introduced to Korea and its culture, with the worldwide famous pop sensations and dramas, the North East states of India have been aware of their culture for a long time. Before streaming platforms like Netflix or sites like KissAsian, DramaCool and others started providing access to Korean Dramas, consumption of Korean media and music had already been very high in these states. North-East states like Mizoram have already aired dubbed versions of K-Dramas on their local television channels for about a decade or more and are watched by all age groups. Looking at history, having a darker skin tone was a sign of being lower in the class hierarchy. As rich men and women could relax in their big mansions having tea parties while others were out working under the sun, skin colour was one way to determine who was rich and who was not. But with the Industrial Revolution and the rise in machinery and factories, people from the lower class started to work inside factories and not under the sun, which in turn limited their exposure to the sun. This made the workers have paler complexions unlike before. Rich people, on the other hand, were travelling to different parts of the world and enjoying their vacations. They returned home with tanned complexions due to them being exposed to the sun. Perceptions of milky white and pale skin being ideal have slowly been changed in Western countries since then. Contrasting from the Western world’s obsession with tanned skin since then, Asian countries are pretty much still obsessed with the idea of the fair being lovely. The perception that whiter skin will make a person look better is still deeply rooted in many minds. It’s still automatically generalised that someone who is fair is beautiful while someone who is darker is located lower on the beauty hierarchy. K-Beauty is an umbrella term for the skincare and makeup products and procedures that originated from Korea and are practiced by Koreans. It has gained a lot of recognition from other Asian countries as well as western countries. Many of K-Beauty’s focus is on the idea of brightening the skin and improving the complexion. K-Beauty is also largely popularised and promoted by the Korean entertainment industry and the media including their K-dramas, K-pop idols and Korean YouTubers. With the availability of many K-beauty inspired skincare videos and tutorials on the internet, lots of young adults in the North East are aware of the importance of taking care of one’s own skin for health and hygienic purposes. On the other hand, many are also influenced and indulged in the toxic idea of beauty. The craze for pale and porcelain skin in the North East is evident, especially among women. Local businesses that sell imported cosmetics and skincare products that promote fairness and whitening of skin are booming in these states. The idea is to look more like the actors and idols they see on-screen-- looks wise and fashion-wise. Although North Eastern girls tend to be more light-skinned than people from the mainland, this is not enough for many of them. Many women from the North East states invest in whitening creams and other imported cosmetic products without actually caring for their skin. The demand for a product that will give them the skin colour they desire the quickest is high because they want white and pale skin like the ones they see on screen. But many times, these products are harsh on their skin, are often dupes and do not work the way they claim to. Injections that imitate the popular Glutathione injections used by Koreans to enhance their pale skin to give a whiter complexion have also seen a rise in some North-East states. Although the ones that they get are much cheaper and more inferior in quality, the offers to make the skin whiter alone is a huge attraction for women who want to attain the glass skin inspired by K-beauty. Glass skin is a term given to the kind of skin that is ideal from the Koreans’ society point of view. Glass skin means skin that is clear, dewy, poreless, shining, and youthful, much like a piece of glass. The glass skin of South Korean actors and idols that is portrayed on screen is the main goal for them although it is highly unattainable without actually caring for your skin through skincare steps and routines. Products that claim to whiten the skin in a short amount of time that many North East women invest in won’t be the answer to this. The obsession and craze for white and pale skin run deep in North East states but at the same time, the backlash against it has also begun. Young educated adults have spoken up about embracing their own natural skin colour without feeling the need to change it. While the billion-dollar skin whitening market depends on these women, unrealistic beauty ideals and the stereotype that surrounds them, many have realised the need for actual skincare without the aim of becoming whiter. Although much of the marketed K-beauty standards have glorified pale and flawless skin, all skin tones are beautiful and we should embrace it and take care of it. It is time that the beauty industry stops feeding off of the insecurities of women because a darker skin tone does not mean that the skin is inferior. Be it the hangover that lasted from the colonial times or a new K-Wave influence, it is high time that Indian women embrace their own skin colour, and stop glorifying paler and whiter skin at the cost of their security in their own skin. Share this article If you liked this article share it with your friends.they will thank you later ",
    "datetime": null,
    "url": "https://www.shethepeople.tv/top-stories/opinion/how-k-beauty-standards-impact-girls-from-indias-north-east/"
}