{
    "title": "INFOGRAPHIC: 10 things about K to 12",
    "text": " SUMMARY This is AI generated summarization, which may have errors. For context, always refer to the full article.  MANILA, Philippines – Last May 15, President Benigno Aquino III signed the Enhanced Basic Education Act of 2013 into law. As classes start on June 3 for public schools and June 10 for private, here are 10 things you need to know about the K to 12 program.  The Philippines is the last country in Asia, and one of only 3 countries (Angola and Djibouti) worldwide, with a 10-year pre-university cycle.  The implementation of the Universal Kindergarten began in SY 2011–2012. The enhanced curriculum for Grade 1 and Grade 7 (1st Year Junior High School) was rolled out in SY 2012–2013, and will be progressively introduced in the other grade levels in succeeding school years. Grade 11 will be introduced in SY 2016–2017 and Grade 12 in SY 2017–2018. The ﬁrst batch of high school students to go through K to 12 will graduate in March 2018.  Kindergarten to Grade 12 is offered for free in public schools. There are additional indirect costs, but government agencies are collaborating to provide programs that will enable everyone access to quality education, especially those with lesser means. DepEd is also developing other cost-sharing arrangements (ex. Expansion of Education Service Contracting).  K to 12 graduates will be ready to be employed in various industries. Education Secretary Armin Luistro earlier said that “the K to 12 program would like to ensure that even if they don’t choose to go to college, they finish studying what is basic.”  As per Republic Act no. 10157 or the Kindergarten Education Act, Kindergarten has become part of the education system and a pre-requisite for admission to Grade 1. Public schools will continue to admit children who have not taken Kindergarten into Grade 1 until SY 2013-2014.  Senior high school students can choose from 3 tracks: Academic, Sports and Arts, and Technical-Vocational-Livelihood. After Grade 10, a student can obtain Certiﬁcates of Competency (COC) or a National Certiﬁcate Level I (NC I). After finishing a Technical Vocational-Livelihood in Grade 12, a student may obtain a National Certiﬁcate Level II (NC II), provided he/she passes the competency-based assessment of the Technical Education and Skills Development Authority (TESDA). NC I and NC II improves employability of graduates in ﬁelds like Agriculture, Electronics, and Trade.  In Kinder, mother tongue, or the common language in the area or lingua franca, shall be used as the medium of instruction. In Grades 1-3, the mother tongue will be used in teaching all subjects, except in teaching Filipino and English subjects. Starting Grade 4, Filipino and English will become the languages for instruction.  Starting SY 2016-2017, DepEd shall engage in partnerships with colleges, universities, and Technical-Vocational Institutions (TVI) to use their existing facilities and teaching staff to ensure that reduction in enrollment in these colleges and universities will be offset during the transition period.  Private schools are to adhere to the minimum standards of the K to 12 curriculum. They should also follow the K to 12 progression, even if they choose not to offer grades 11-12 (e.g. private junior high schools can remain as such but their students will have to transfer for senior high school).  A Joint Oversight Committee from the Senate and the House of Representatives shall be formed to oversee, monitor, and evaluate implementation. Download the full infographic here. DepEd also launched this documentary last January to promote GO! Education and the K to 12 program:  To learn more about K to 12, here is the full K to 12 Information Sheet from gov.ph: K to 12 Information Sheet by Jee Y. Geronimo  – Research by Jee Geronimo; Infographic by Jessica Lazaro/Rappler.com Error. Please abide by Rappler's commenting guidelines. There are no comments yet. Add your comment to start the conversation. JOIN OUR NEWSLETTER Fearless reporting delivered to you follow us    ",
    "datetime": "2013-06-04T03:52:03+00:00",
    "url": "https://www.rappler.com/nation/30207-infographic-ten-things-k12/"
}