{
    "title": "Innisfree Launches Birthstone-Inspired Matte Setting Powders | Allure",
    "text": "By Rosemary Donahue K-beauty is majorly popular as of late, and so is a personalized beauty routine. That's why beloved K-beauty brand Innisfree has decided to consult the calendar for its latest launch, a gorgeous line of matte setting powders inspired by the birthstones of each month. The brand has decided to take its super popular Matte Mineral Setting Powder (a huge staple for Innisfree fans) and repackage it in a line of gorgeous new compacts, one for each month's birthstone. The Birthstone Matte Mineral Setting Powders are stunning, portable, and will help you stay shine-free through all your summer fun. The Birthstone Matte Mineral Setting Powder is said by the brand to be an oil-controlling translucent powder that creates a soft-looking matte finish. The formula is made with naturally-derived Jeju Minerals and mint. (For those who aren't aware, Jeju is an island just south of Seoul where Innisfree harvests many of its all-natural ingredients.) Each portable container comes with a powder puff, making it easy to do touch-ups on the go. This content can also be viewed on the site it originates from. These powders are available on Innisfree's website right now for $8 in all the birthstones, but you might not want to wait until your birth month comes up if this is the kind of thing you're into — they're limited-edition, and they likely won't last long. In case you want a few other recommendations to snag that coveted free shipping, check out Allure's guide to the best Innisfree products out there. You won't be disappointed. Read more about K-beauty: Now, watch Chris Appleton break down Kim Kardashian's best hair looks: Follow Rosemary on Instagram and Twitter. By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Nicola Dall'Asen By Sarah Han By Devon Abelman More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2018-05-02T15:46:09.222Z",
    "url": "https://www.allure.com/story/innisfree-birthstone-setting-powder"
}