{
    "title": "Innisfree Launches Snoopy-Inspired K-Beauty Makeup Collection | Allure",
    "text": "By Rosemary Donahue It doesn't look like all the love we've been seeing for Korean beauty products is going to be slowing down anytime soon. In fact, it may have only just begun. K-Beauty brands like Innisfree saw wild popularity in the United States over the past year for the high-quality ingredients, great results, and cute packaging, and as major retailers like Target catch on and begin stocking them in the aisles, the products only become more accessible. While our love for K-Beauty isn't slowing down, the brands aren't slowing down, either, and Innisfree has just created what may be its cutest launch to date. The Innisfree x Snoopy makeup collection is seriously adorable, and you're going to want every single product. This content can also be viewed on the site it originates from. The collection includes something for everyone, at super reasonable price points. It's perfect for the Peanuts-lover in us all, as all of the packaging has images of a smiling Snoopy front and center. There are four different products to choose from: Real Vivid Nail Color (a limited-edition taupe colored polish with a tangerine fragrance), Vivid Creamy Tint (a liquid lip tint that dries semi-matte and comes in three different colors), a Snoopy Compact Case (which also comes in two different case styles), and a Mirrored Palette Case (which comes in small and medium). This content can also be viewed on the site it originates from. The whole collection is available on Innisfree's website and it's for sale between $4 and $12, so you really can't go wrong. While you're there, check out our picks for the nine best Innisfree makeup and skin-care products. If you're going to do an online shopping trip, you might as well do it big. Related: Now, watch a Target skin care beauty haul: Follow Rosemary on Instagram and Twitter. By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Sarah Han By Dianna Mazzone By Nicola Dall'Asen By Angela Trakoshis More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2018-01-21T21:48:36.392Z",
    "url": "https://www.allure.com/story/innisfree-snoopy-makeup-collection"
}