{
    "title": "Innisfree is coming to Canada in Summer 2019",
    "text": "Korean beauty brand Innisfree is expanding into Canada, opening its first location in Toronto’s Yorkdale Shopping Centre this summer. According to a spokesperson for the mall, the Innisfree store will be located in Yorkdale’s Nordstrom-anchored expansion wing that opened in 2016, across from the Uniqlo and Muji stores. The store will span nearly 2,500 square feet, according to lease plans, and open at some point this summer. View this post on Instagram A post shared by Innisfree USA (@innisfreeusa) on Apr 22, 2018 at 12:20pm PDT Innisfree is the “No. 1 beauty brand in South Korea,” according to its website, with 1,560 stores located in 11 different countries. The brand focuses on responsibly sourced, naturally-derived ingredients and say it aims “to provide healthy beauty through high-quality natural ingredients, trustworthy research and sustainable green life.” The company says ingredients used in its products are “responsibly sourced” from Korea’s Jeju Island. The beauty brand opened its first North American store in 2017 in New York City’s Union Square and has since launched six additional locations in the United States. Innisfree is a subsidiary brand of Korea’s AmorePacific Corp., the world’s 14th largest cosmetics company, according to Forbes. Over the past several years, Korean beauty products – known as K-Beauty – have exploded in popularity across North America. An NDP Group report from 2017 said that skincare products were the biggest focus for both consumers and retailers, with “the Korean beauty trend (continuing) to influence the Canadian market as hydration products aimed at creating a dewy, luminous skin look continue to grow in popularity.” Download the Yahoo Finance app, available for Apple and Android. ",
    "datetime": null,
    "url": "https://finance.yahoo.com/news/korean-beauty-brand-innisfree-is-coming-to-canada-175408429.html"
}