{
    "title": "Inside K-Beauty's Complicated Sexual Wellness Awakening | Allure",
    "text": "By Devon Abelman While in Seoul recently, I stopped into Olive Young, South Korea's most popular beauty store, to stock up on pimple patches. I snaked through aisles filled with robust selections of sheet masks, cleansing oils, and face mists until I reached my destination. Beside the boxes of Nexcare's beloved acne stickers were small silver tins wrapped in a pale pink label emblazoned with SAIB in bold silver letters. Looking at the rest of the items on the shelf, I quickly realized the cute little containers weren't a handy way to carry around pimple patches. Instead, they were filled with condoms. Intimate cosmetic brand SAIB, which is \"bias\" spelled backward, launched in 2018 with Korea's first-ever condoms marketed toward women. At the time, the brand's founder, Jiwon Park, never considered they would share aisle space with K-beauty's most popular offerings. Olive Young hardly carried sexual wellness products when SAIB hit shelves, Park tells Allure, and the condoms, personal lubricants, and massage gels the store did decide to sell were regulated to small, essentially hidden sections of the chain's 1,200-plus locations.  At that time, Park hoped that eventually, SAIB's condoms would be as easy for women to buy as pimple patches — especially in a country with an extremely low rate of condom use. Her own experience buying protection for the first time was one of the major inspirations for starting the brand. \"The entire experience was horrible,\" Park says. \"Every single product was super masculine with hypersexualized images, and their messages were all toward male satisfaction. It didn't feel like those products belonged to me.\" Four years later, Park's dream of women being able to hand condoms to the cashier without embarrassment is much closer to realization.  Not only that, South Korea's sexual wellness products are easier to find than ever before and are taking up more space on shelves — all the while making women their target demographic. The signature BIAS three-piece Premium Condom Of course, as K-beauty shifts its attention toward this product category, the same innovation, meticulousness, and efficacy we've come to know and love from the country's skin-care exports are being applied to sexual wellness products. Lubes are spiked with cica; a brand-new at-home LED device can be strapped down there, and legacy skin-care brands are launching feminine washes. Still, K-beauty's sexual wellness wave isn't exactly a sign of rising sex positivity in South Korea. After chatting with the founders of three brands leading the charge in the country's sexual wellness space —  SAIB, Rael, and Riley House — it seems that this new K-beauty frontier promotes sex neutrality at best. Although South Korea may seem lightyears ahead of America in many ways, it is still an extremely conservative, patriarchal society at its core. Comprehensive sex education is basically nonexistent, both in school and at home. In 2019  the United Nations even called for the South Korean government to provide proper education to students on preventing teen pregnancy and sexually transmitted infections (STIs), as well as unbiased information on sexual orientation and gender identity. As recently as 2021, a study found that a mere 10.4 percent of the Korean adults surveyed had received sex education about STIs. By Aliza Kelly By Gabi Thorne By Gabi Thorne \"I was kind of indoctrinated into staying naive about anything related to sex,\" Park shares. \"I thought to be a 'good girl,' I should be like that.\" In her late twenties, she finally came to terms with the toll that ideology was taking on her. She'd been teaching in the U.S. at the University of Texas at Austin and noticed that her students seemed to have a more mature view of intimacy than she did. \"I realized a grown woman shouldn't be proud of not learning about sex and her body,\" Park recalls. SAIB's Jiwon Park Kids under the age of 19 can't simply use Naver, Korea's go-to search engine, to learn about sex for themselves either. While in Seoul, I spent an afternoon with the founders of self-care brand Riley House, Grace Son and Mina Jang. Over coffee, Son mentions you can't search any terms related to sex without verifying your age. With these barriers, \"People don't know how to use lube. They don't how to put on a condom,\" Jang adds. By Aliza Kelly By Gabi Thorne By Gabi Thorne In fact, Son mentions, the Korean language doesn't even have a word for intimacy. So when Riley House launched its Ready For Intimacy Moisturizer, a cactus water-based lubricant, in 2021, Son and Jang's friends and family were completely confused about what it was. \"I remember Mina's mom saying, 'Can I use this on my face?'\" Son recalls. Jang took the time to explain its intended use, and her mom was shocked that her daughter had created a sexual wellness product. For the first time in her 30 years, Jang found herself talking about sex — and its place in her life — with her mom. The women of Riley House soon learned that if they could talk about intimacy with Jang's mom, then they could talk about it with just about anyone — comfortably and more fully informed. Mentions of Riley House and sex started trickling into talks with friends, and all eventually told Son and Jang the same thing: \"We needed this.\" If sex positivity didn't spur K-beauty's sexual wellness market, what did? Park credits market saturation. With competition in the Korean beauty industry getting higher each day over the past five years, she says, companies started to seek out gaps. Products for face, body, and hair are all successfully accounted for, so the only area left for K-beauty brands to explore was, well, between our legs. Suddenly, K-beauty's feminine wash selection went from sparse to abundant in the past couple of years. By Aliza Kelly By Gabi Thorne By Gabi Thorne Popular K-beauty brands, like Dr. G, Primera, and Illiyoon, have even jumped in on the trend by releasing feminine washes. \"Although K-beauty brands, in general, are not yet daring enough to move into the sexual wellness alley yet, they can easily add feminine care,\" she explains. (The brands often call it \"Y-zone care\" to skirt the issue.) Plus, \"the feminine washes are simply based on the technology for their facial cleansers,\" points out Yanghee Paik, cofounder of Rael, a period care company that was started in America in 2017 by three women originally from South Korea. Its organic cotton pads have become highly sought after in Korea, and the brand now has a product development team based in Seoul. The founders of Rael On the surface, this growth of feminine care products among K-beauty brands might seem like an indicator of blossoming sex positivity and celebration of women's bodies. However, Park suspects there's something more sinister behind big brands entering this market. The fact that feminine washes exist so prevalently is a sign of the K-beauty industry employing \"shame marketing,\" she says. By Aliza Kelly By Gabi Thorne By Gabi Thorne Melissa Mauskar, MD, an associate professor of dermatology, as well as obstetrics and gynecology, at UT Southwestern Medical Center, couldn't agree more. \"We are taught that vulvas and vaginas are 'dirty,'\" she tells Allure. “And if we 'clean it,' then, we can make the itch and pain go away.\" Vaginas don't need to be cleaned, though. The doctors I interviewed even bring up a statement you may have heard before: The vagina is a self-cleaning oven. When it's healthy, it is naturally acidic and has a low pH, which protects it from bacterial and yeast overgrowth, says Jill Krapf, MD, a board-certified OB/GYN who specializes in vulvar pain conditions at The Center for Vulvovaginal Disorders in Washington, D.C. Needless to say, washing your vaginal area yourself with cleansers and other products can throw off that natural pH and lead to everything you're trying to avoid by using them: vaginitis, vaginal infections, discharge, and skin irritation. They can even worsen underlying skin conditions and strip away the vagina's natural moisturizers. Instead of reaching for feminine washes, \"People need to talk to their dermatologist or gynecologist if they are having problems,\" Dr. Mauskar adds. Park learned that some K-beauty brands planned to break through the market's saturation with shame marketing at a dinner party in South Korea in 2017. When she asked what the tactic entailed, a man in attendance explained that it \"targets women's insecurities to create an entirely new territory of the market,\" recounts Park. The man proceeded to list off a product that dyes vulvas pink to make them seem younger and more desirable to men as an example. \"I thought that was super violent,\" Park tells me, \"but that still exists anyway.\" Feminine washes were just the beginning. Right now, the market is starting to flood with \"inner perfumes,\" which are fragrances meant to be added to your underwear to supposedly help your vagina smell better and decrease any itching or discomfort.  Ads for them are all over social media, Park says. When I tell Dr. Mauskar about these perfumes, she immediately says, \"Yikes,\" before clarifying that fragrances are some of the most common causes of allergic reactions on the vulva. Like feminine washes, inner perfumes can also exacerbate exasperate underlying skin conditions, such as psoriasis, lichen sclerosus, and atopic dermatitis, and make them harder to diagnose. And if you're truly concerned about vaginal odors, \"It is best to check with a gynecologist to rule out bacterial vaginosis or other vaginal infections that may require treatment,\" instead of trying to cancel it out with harmful, irritating scents, Dr. Krapf adds. Paik also attributes the rise of K-beauty's sexual wellness sector to Koreans' obsession with health and wellness. She believes women, in particular, will take any measure that they believe will protect their reproductive functions — whether that means maintaining their pH balance with the feminine washes, lubes, and condoms, or in Rael's case, using organic period products, to \"have a healthy womb and vagina,\" she explains. By Aliza Kelly By Gabi Thorne By Gabi Thorne The founders of Riley House, on the other hand, are using that wellness spin on intimate care as the crux of their all-natural product lineup and brand philosophy. Son and Jang want to show the world that K-beauty goes far beyond the saturated skin-care market. \"There is so much more to our culture than viral K-beauty trends, like glass skin,\" Son says. For them, K-beauty is about caring about your body from head to toe and taking the time to do so. With Riley House, they're sharing the importance Koreans place on wellness in ways that have been ingrained in their culture for centuries. The founders of Riley House Jang grew up going to a jjimjilbang (public bathhouse) with her family to indulge in some ancient wellness practices. She'd soak in baths infused with mugwort, a healing herb that dates back to the creation of the first Korean dynasty known for its antibacterial, anti-fungal, and skin-protective properties. Then, her mother would help her scrub her body, and she'd do the same for her. \"This was a weekly ritual for my family,\" Jang says. By Aliza Kelly By Gabi Thorne By Gabi Thorne Son, who moved to Mokpo, South Korea, a small city in southwestern South Korea in middle school, didn't experience this ritual until just last year. Jang walked Son through the routine that she was raised on. As she got undressed, Son says she felt a new sort of bond with Jang,  who she's known since 2017. Jang, who's known Son since 2017, walked her through the routine that she was raised on. They went through ritual by ritual, and Son says that when she went to the jjimjilbang that she felt a new sort of bond with her heritage. By the end of the experience, Son started redefining her own understanding of K-beauty as a mode of connection and implementing self-care rituals for yourself beyond skin care. To honor this time together and mugwort's place in Korean culture, Riley House also launched the Female Wellness Mugwort Bath Soak in 2021, which comes with five reusable sachets filled with dried mugwort that you can throw into your bathtub after an exhausting day or while you're on your period. When I'm feeling crampy, I run it under hot water before using it as a heating pad on my abdomen. The part of the K-beauty sexual wellness wave that fascinates me most, particularly in regards to these brands, is the keen attention to ingredients that is so uniquely K-beauty-minded. The Riley House Ready for Intimacy Moisturizer's ingredient list, for instance, is not much different from your favorite K-beauty face cream. It features several nourishing anti-inflammatories such as prickly pear cactus, sea kelp, green tea, and licorice root extracts. Son and Jang picked these because most of them are native to Korea and prove that kimchi isn't the only Korean superfood. By Aliza Kelly By Gabi Thorne By Gabi Thorne Rael is no different. It launched a vulva care line in 2021 following the success of its period products and menstrual cycle-inspired skin-care line. Paik calls the Soothing Gel to Foam Feminine Wash, Soothing Vulva Relief Gel, and Soothing Feminine Mist that round out its vulva care line a \"skin-care routine for your vulva,\" and are even packed with ingredients you'd find in your favorite facial serums, like cica, allantoin, and hyaluronic acid. \"We don't have any shame talking about vulvas,\" she adds. \"It's an organ just like skin, and it needs special care just like it in order to stay hydrated and also to soothe and calm.\" As much as I love and want to believe Paik's sentiments, Dr. Mauskar says your vulva really only needs to be rinsed with water. Dr. Krapf, however, says that Rael's vulva care line is unlikely to be harmful, as it contains hyaluronic acid and aloe vera and avoids synthetic chemical fragrances and parabens. She points out that the skin of the vulva, like other parts of the body, can become dry, and it is incredibly sensitive. \"Vulvar moisturizer can keep the skin of the vulva healthy and prevent certain conditions related to dryness and eczema, which can develop in this area,\" she says. Plus, they provide a non-hormonal option to help with menopause-related dryness, which occurs due to a lack of estrogen, she adds. But before using vulvar moisturizer for whatever reason, Dr. Krapf recommends having your symptoms evaluated by a gynecologist first. (While Rael did design its products to be consistent with the natural, acidic pH of the vagina, studies haven't definitively shown yet that this is helpful for the health of the vulva or the vagina, according to Dr. Krapf.) Rael's personal care line. By Aliza Kelly By Gabi Thorne By Gabi Thorne Although your vulva truly doesn't need products slathered onto it, Rael's feminine products do draw customers away from shame marketing — and the false, even harmful sense that your vagina needs to smell like a bouquet of flowers — and toward a self-care moment rooted in sex and body positivity. A set routine, no matter what it may be for, is incredibly grounding, and allowing yourself to have time to care for your vulva and vagina helps you become more aware of their condition and how you can better care for them — whether it be making a doctor's appointment or buying condoms made with ingredients that agree with them. In fact, \"Korean women are very picky, so they don't want to sacrifice performance and comfort while accessing better ingredients,\" Paik notes. For that very reason, Park ended up starting SAIB to not only help make condoms more accessible to women but also to make one healthier for vaginas by creating a condom from scratch. Park considers herself to be one of those discerning women. She looks at every ingredient in her food and everything she puts on her body, and condoms are no exception. “Those actually go inside the body, so it's even more critical to consider than anything you put on your body or face,” she says. Gynecologists echo Park's driving concern for SAIB's condoms, too. \"It is important to be careful with what enters the vagina, especially for those prone to vaginal infections and sensitivities,\" Dr. Krapf says. \"Certain chemicals, like spermicides, and even sperm itself can change the pH of the vagina.\" It goes without saying that when meeting with manufacturers, Park clearly was incredibly specific about every single ingredient that needed to be added and taken out of their typical condom production. She made sure SAIB's condoms were free of fragrances, spermicides, glycerin, unnecessary additives, and potentially carcinogenic ingredients that are found in typical condoms, like nonoxynol, parabens, and nitrosamine. \"The manufacturers were super annoyed and said, 'Oh, we've been doing it like this for over five decades. We don't have any problems with selling these products with these ingredients. Why are you creating such noise to disrupt the market?'\" But that's just what the market needed: SAIB is now successful and growing, and it is likely even inspiring new sexual wellness brands that cater to women to follow suit. \"They're obviously competitors, but we don't see them as [such] because if you look at the big market, it's still male-dominated,\" Park says. If anything, SAIB and its competitors are proof of concept — women buy condoms. They want better access to products for their sexual health, and they need more brands to help them feel comfortable about talking about intimacy. By Aliza Kelly By Gabi Thorne By Gabi Thorne After all, sexual wellness is taking care of your body and doing anything you can to be healthy and confident. It's not about who you are sleeping with, how often you do, or even how you seek pleasure in general. Sexual wellness is about having resources available to you and knowing how your body works and what makes it feel good. The same can be said about any other part of your body, but as we all know, when you have a vagina, all of that access can start to become limited, no matter what country you live in. Bringing products like lube, condoms, and feminine wash into the K-beauty conversation — one that people have become more and more interested in and invested in over the past five years — helps normalize sexual wellness while adding a layer of innovation and care that this category deserves. Read more about K-beauty: Now, watch beloved Korean makeup artist Pony Park walk us through her 10-minute beauty routine: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Nicola Dall'Asen By Devon Abelman By Sarah Han By Sarah Han More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2022-08-02T14:00:00.000Z",
    "url": "https://www.allure.com/story/k-beauty-sexual-wellness-products"
}