{
    "title": "Inside The K-Beauty Skin Care Phenomenon: Hydrated, Glowing Skin In A Bottle | VOGUE India | Vogue India",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, visit My Profile, then View saved stories By Avanti Dalal There's a reason why jelly masks, glass skin, snail cream and 10-step routines all hail from Korea. Thanks to cutting-edge scientific advancements and generations of skincare connoisseurs with perfected routines, K-beauty has grown from a niche trend to now becoming a mammoth skincare industry to be reckoned with. Korean consumers have a voracious appetite for skincare, which gives Seoul-based beauty companies the impetus to perform extensive R&D. Korean beauty heritage is steeped in natural ingredients passed down from generation to generation, where they forgo harsh chemicals for formulas that are based on plants and animal by-products like honey and snail mucin, while using the best of Western beauty knowledge in equal measure. Women in Korea have a specific skincare goal in mind, and tend to focus on skin health and superior hydration—which is why they regularly slap on layers on layers of humectants, occlusives and emollients, along with copious amounts of SPF. A key aspect to the routine is layering on hydrating products to help them better penetrate the skin. The results of these products are almost immediate—plumper, younger-looking skin with a natural glow. It would be remiss to speak of K-beauty without mentioning the 10-step skincare routine, where all steps work on revving skin up to become the brightest and most hydrated version of itself. This is the first step in the traditional ‘double cleanse', which is the heart and soul of Korean skincare. Since the main goal is to be hydrated and thoroughly cleansed, the oil-based cleanser first removes excess sebum, grime and leftover makeup without removing the natural oils from the face. Then, a traditional foaming product or a bar soap is used to remove all impurities left behind after that first cleanse. These products have active ingredients to target specific skin concerns like dryness or acne. Want to know more about double cleansing? We've already deep dived into the topic here. This is when active ingredients like acids come in to the fold. If you choose to go down the physical exfoliator route, you can use a scrub to slough off dead skin. For chemical exfoliators, a peel or peel pad removes build-up and speeds cellular regeneration, which primes the face and leaves skin feeling refreshed and looking brighter. Find a detailed guide to exfoliation here. All this cleansing and exfoliating can throw the natural pH of the skin out of whack. Using a toner will help to bring moisture back to the skin, and also balance it out to its normal, slightly acidic state. Post toner, pat in an essence—an ultra-light hybrid between toner and serum that feels almost like water. The small, hardworking molecules can penetrate the skin deeper than larger molecules, thus sinking quickly into the skin to up hydration levels while encouraging cell turnover. Then, it's time for serums, ampoules or boosters. These are targeted to specific skin concerns like ageing or pigmentation, and contain the most concentrated blend of tailored active ingredients like peptides or Vitamin C. Upping the skin's moisture level is the holy grail of K-beauty, and sheet masks are the most famous export from Seoul. They gained momentum because they ensure beneficial formulas are delivered directly into the skin, with nutrients and active ingredients effectively being trapped behind the sheet. You will never miss an eye cream with this step, as these masks fight fine lines, dryness and ageing at the dry, sensitive skin around the eye too. It is the promise of a full night's sleep in a jar, tube or pot. Moisturiser is the last step, acting like a cocoon on the face and preventing everything else from evaporating off. If this is done in the morning, slathering on sunscreen every single day is the K-beauty commitment you can't skimp on. We put together a few of the most fun, interesting and strange products to come out of Seoul for your reading, viewing and using pleasure. Add these to your simple cleanse-tone-moisturise routine and lead your way to dewy, translucent skin. The Banila Co Clean It Zero Original Cleansing Balm is a cult-favourite cleansing oil in solid form. Even the most waterproof, long-lasting mascaras and liners are no match to it. The CosRx Triple C Lightning Liquid is consistently sold out everywhere it is available because it attacks pigmentation and immediately lightens brown spots and acne scars. It contains pure Vitamin C (ascorbic acid) and black chokeberry to stabilise the high concentration of Vitamin C.  If you're in warmer weathers, reach for the Laneige Water Sleeping Mask that leaves skin plump, bouncy and refreshed. Plop this one in your skincare fridge (or the normal fridge in the kitchen!) and take it out just before use. The cold goop will feel super refreshing before you sleep. If you're up to the serum step but too lazy to press it on, the Neogen O2 Energy Power Serum Spray has it bottled into a handy mist. It has 80 per cent oxygenated water to bring glow back to tired, stressed skin, while niacinamide brightens dull spots and seaweed extract hydrates it. If you're okay with testing out strange masks, look no further than the Shangpree Sparkling Mask, which bubbles up on application. These micro-bubbles improve circulation and whisk away blackhead-producing grime and debris. The Dr. Jart+ Shake & Shot Rubber Brightening Mask is fun to mix, and renders skin tightened and more elastic. By Hasina Jeelani By Prabal Sharma By Kejhal Kalra Famed for their efficient delivery methods, Dr Oracle A-Thera Tea Tree Peeling Sticks are shaped like cotton swabs and drenched with lactic acid, and tea tree, lemon and bamboo extracts to cleanse dead skin cells. They also contain glycolic acid, which works to exfoliate and resurface the skin. Slap on a hydrocolloid acne-patch pads like the ones by Peach Slices to actively absorb a developing blemish or an already-present pimple. They are transparent and inconspicuous, so you won't even remember that you have one on. The skincare, hair care and makeup products you need for post-gym plans The skincare oil that is actually amazing for greasy and acne-prone skin Have you tried Alia Bhatt and Katrina Kaif's favourite skincare hack? Half bath: The new Korean beauty trend that you need to try out By Hasina Jeelani By Hasina Jeelani By Shriya Zamindar By Vogue.in See more stories Condé Nast India © 2023 Condé Nast. All rights reserved. Use of this website constitutes acceptance of our Terms of Service and Policy and Cookie Statement. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. ",
    "datetime": "2019-02-07T16:53:43.000Z",
    "url": "https://www.vogue.in/content/korean-skin-care-k-beauty-global-skin-care-phenomenon"
}