{
    "title": "Inside the playbook of Sephora's top-selling K-beauty brand - Glossy",
    "text": "This article is part of Glossy’s Beauty and Wellness Briefing, which features exclusive news, interviews with industry change makers and behind-the-scenes looks at what actually matters. To receive the Beauty and Wellness Briefing and read for free, please subscribe. In the race to win the K-beauty market in the U.S., several names come to mind. There’s Dr. Jart that was purchased outright by Estée Lauder Companies last winter, plus a bevy of U.S.-born players like MBX [previously known as Memebox], Glow Recipe and Peach & Lily, which all started as third-party sites before launching proprietary product. Amorepacific’s Laneige has gotten less play, until recently. Launched in 1994, the South Korean brand had a bit of an uneven start in the U.S. when it debuted in 2014. For two years, Laneige, which sits in Amorepacific’s Premium Division, sold exclusively at Target, but it was one of the most expensive beauty products in that environment. “Because [Target] was self-serve, customers didn’t understand why our products were priced the way they were or what they offered,” said Jessica Hanson, president and general manager of Amorepacific U.S. “Our entry price point was over $20, and when you are looking at cleansers right next to ours for $7, that’s a pretty high barrier of entry.” At just under $10 million in sales at Target in 2016, Amorepacific pulled Laneige out of the retailer with a plan to rethink its U.S. strategy. By September 2017, the company decided it was ready to bet on Sephora. Though Laneige started in 147 Sephora stores in 2017 with its full assortment and only reached full distribution in September 2019, it is now the fastest-growing Amorepacific brand at Sephora and currently the No. 1 top-selling K-beauty brand at the retailer, according to the brand. Amorepacific also owns its namesake brand, Sulwhasoo and Innisfree, which sell in the U.S. Hanson expects Laneige to reach $100 million in sales in North America by 2021. Ahead, the playbook Laneige used to conquer the U.S. market: Owning the sleep category\nK-beauty products certainly existed in Sephora’s assortment before Laneige arrived in 2017. Hanson knew it was a crowded space but saw an opportunity to differentiate with the brand’s sleeping category. “No one had actually said, ‘Well, what do you do with your beauty routine to enhance its benefits while sleeping?’ So we not only told customers what we could with our Water Sleeping Mask for the face, but we also created and emphasized our Lip Sleeping Mask, which was just for lips,” said Hanson. “We couldn’t and didn’t stop telling that story of sleep.” Today, Laneige sells six products at Sephora labeled with the word “sleeping.” One of its Lip Sleeping Masks is sold every minute in the U.S., according to Hanson. She credits a focus on education plus sampling for the brand’s quick success: It samples via Sephora’s Beauty Insider program, which counts 25 million customers as members. Laneige will also be featured in Sephora’s revamped version of Play!, its monthly subscription box, this spring. Amorepacific knows Laneige’s success in North America is unprecedented, especially since sales for its Premium Brands division, which includes the brands Mamonde and Iope, have been down in duty-free and tourism commercial zones, per its latest annual results. For its part, Glow Recipe has its own set of sleeping products, which it too launched in 2017, but the brand has been keen to tie launches (sleep or otherwise) with fruit and vegetable themes, versus purely benefits. Glow Recipe hit $30 million in retail sales in 2018. Diversifying within Sephora\nFollowing Laneige’s launch at Sephora, it made its move into Sephora in JCPenney a year later. Unlike Sephora proper’s staggered approach, Laneige moved its full assortment into all doors at once. Today, it is in 658 JCPenney Sephoras. There are nuances to the Sephora and Sephora in JCPenney customer: Notably, the JCPenney shopper is slightly older, reaching into the upper-40s and lower-50s age bracket, and more ethnically diverse, said Hanson. She is also likely to be shopping with her family. Laneige’s moisturizer is a top-seller at JCPenney and is thought to be a “basic” skin-care step for customers. In Sephora’s standalone stores, however, the company faces steeper competition in that category, and it is ranked lower in its top five. Meanwhile, its Lip Glowy Balm has been a top-seller in JCPenney because it has moisturizing properties and appeals to teens shopping with their mothers. The product resembles a lip gloss. “Our trial kit is often used as a travel purchase at Sephora, but we are seeing it as a conversion tool in JCPenney, with [customers moving on to purchase] single products,” said Hanson. Providing training exercises to JCPenney’s 90 sales trainers (employees that lead sales associates) has been particularly helpful to introduce Laneige to customers. Instead of the large-scale sampling efforts the brand is doing in Sephora’s standalone locations, it conducts training sessions three times a year for JCPenney. Beginning in March, Laneige will amplify its training support program via branded displays (that detail deep product information) in JCPenney Sephoras. “It’s all about edu-tainment — providing trainers with exploratorium information around our ingredients and trademarks to then be able to sell to customers,” said Hanson. Stretching Sephora into marketing\nLeveraging Sephora beyond in-store placement of products has been key, according to Hanson. She acknowledged that, in its past life, Laneige relied on “predictable” marketing channels and used agencies versus in-house team members to support its business. However, now it is focused on storytelling opportunities like Popsugar Playground. A more recent example is its partnership with Netflix and its upcoming film “To All the Boys: P.S. I Still Love You.” With Sephora and Netflix, Laneige, along with MBX’s Kaja, Glow Recipe, Amika and Milk Makeup, created limited-edition sets to be sold timed with Valentine’s Day. The sets are available in select Sephora stores and are branded with the movie’s title. Laneige has been keen to spotlight its Korean-born roots in social media to align with the Korean and Korean-American characters in “To All the Boys.” “It’s only been less than a week, but we’re the No. 1 selling SKU of the five [products] that are in the collaboration,” said Hanson. “We are ready to think more and more out of the box.” Get news and analysis about fashion, beauty and culture delivered to your inbox every morning. ",
    "datetime": "2020-02-12T14:00:24+00:00",
    "url": "https://www.glossy.co/beauty/inside-the-playbook-of-sephoras-top-selling-k-beauty-brand/"
}