{
    "title": "Inside Korean beauty brand VDL's US expansion - Glossy",
    "text": "Korean color cosmetics brand VDL, best known for its Lumilayer Primer series and Expert Color Lip Cube collections, is pushing hard into the U.S. After launching its U.S. direct-to-consumer website in August 2018, VDL, which is owned by LG Household & Health Care and came to market in Korea in 2012, is expanding its third-party partnerships with an e-commerce focus. In mid-May, VDL debuted on Ulta.com, with a planned fleet expansion slated for later this year. In July, the beauty brand will expand to Revolve. “Our ultimate goal is for the U.S. to be our top market and for our global team to sit in the U.S. We want to become a force in America in the next three years,” said Michelle Pham, VDL’s North American marketing director. Currently, Korea is VDL’s top market, followed by Hong Kong. According to data and insights company Kantar, VDL was ranked as the No. 1 brand in South Korea in unit sales in 2018, thanks to its hero primer products. Pham said VDL has seen month-over-month growth in the U.S. of on average 639% since its late-summer debut. VDL’s rapid U.S. roll-out follows its parent company’s larger plans. In April, LG Household & Health Care acquired New Avon, the U.S. arm of the direct-selling company, for $125 million in cash to establish a deeper stateside presence. In May, LG reported that first-quarter company sales and operating profit increased by 13% and 13.5%, respectively. Operating profit was buoyed by its prestige beauty business, and exceeded $2.7 billion. While K-beauty is largely known for skin-care products in the U.S., VDL hopes to own the Korean color conversation. Memebox Korean color brand Kaja Beauty, which launched in collaboration with Sephora in September 2018, has been a success story for both parties. The brand has seen more than triple the sales in Sephora compared to other companies selling color cosmetics through the retailer in 2019. To prepare for its large wholesale roll-out in the U.S., Pham said VDL has taken a decidedly different approach to marketing to customers here versus Asia, focusing more on sampling and influencers. VDL partnered with product discovery and reviews platform Influenster to deliver 1,500 Voxboxes (free product boxes to select beauty enthusiasts) to increase its ratings and reviews online. It also provided 20,700 samples to Ulta to offer to customers. Pham said 70% of VDL’s U.S. marketing budget is going toward ratings, reviews and sampling. “In Korea, our marketing is very traditional, and we use one big celebrity ambassador and then go into large retail channels. In the U.S., we knew we can’t compete with an Estée Lauder as we find our footing, nor do we want to. We are focused on creating awareness with beauty fans who are graduating from mass to prestige. We want create an organic conversation with our millennial and Gen-Z customers who are at Ulta and on places like Revolve,” said Pham. “When a beauty brand is launching in the U.S., they want to get the word out. VDL came to us seeking an efficient but effective way to support two products from their Lumilayer Primer line. In a cluttered market, smart sampling is a proven way to stand out and drive valuable consumer action that moves the needle, from advocacy to repurchase,” said Elizabeth Scherle, President and co-founder of Influenster. “Because our members are not paid social influencers, but everyday consumers passionate about sharing their feedback with brands, our clients know they’re getting authentic and credible results.” Additionally, VDL is partnering this summer with a mix of up to 20 paid and unpaid U.S. ambassadors, like makeup artist Nam Vo (206,000 Instagram followers) and male beauty influencer Ivan Lam (256,000 Instagram followers), to support its retail debuts. The purpose is to create online word-of-mouth recommendations from sources its 18- to 30-year-old customer listens to. Since its U.S. DTC debut, VDL has seen social engagement on its channels increase by 5%. “VDL has developed a targeted influencer program, initially tapping influencers that had a strong interest and expertise in K-Beauty. We worked with a range of influencers to create videos on buzz-worthy K-Beauty or seasonal trends like Glass skin, flushed skin or a pumpkin spice latté makeup tutorial. By associating VDL primer products with specific micro trends, we are able to establish credibility and brand awareness within the crowded makeup marketplace,” said Madelin Newman, director at VDL’s social agency, Artisan Council. At Ulta, VDL’s approach seems to be working. In its first week at Ulta, sales volume has surpassed  expectations. VDL’s primers beat sales expectations by 40%, while its foundations and Marble Lip Cube products performed 30% and 19% better, respectively, than initial estimates. While standalone U.S. stores are the ultimate goal for VDL — the company recently opened its first location in Toronto in March — Pham said that online wholesale partners are the strategy for now. “We have a long way to go to establish who we are in the U.S. We are focused on online, as customers are increasingly learning about brands and products on social and through reviews,” she said. “We want customers to hear the name VDL and immediately know who we are and what we stand for.” Get news and analysis about fashion, beauty and culture delivered to your inbox every morning. ",
    "datetime": "2019-05-31T04:00:28+00:00",
    "url": "https://www.glossy.co/beauty/inside-korean-beauty-brand-vdls-us-expansion/"
}