{
    "title": "International Beauty: A look at how Umma is bringing K Beauty startups to the US",
    "text": "Or wait... Headlines Brand Innovation Formulation & Science Packaging & Design Business & Financial Market Trends Regulation & Safety Promotional Features Site Archive Multimedia Hot Topics Companies looking to the future Consumer insights Formulation research Retail and DTC Sustainability Technology and Platforms Trends and Emerging Markets Expert Viewpoints Site Archive Multimedia Resources Type of resources Events All Events Shows & Conferences Online Events Editorial Webinars Events  15-Aug-2018\n                            - Last updated on\n                                15-Aug-2018 at 15:19 GMT At Cosmoprof North America, Daniella Jung, chief curator at Umma, sat down with Cosmetics Design to discuss how the new distribution platform is discovering, curating, accelerating, and (of course) distributing distinctive K Beauty startups, helping Korean brands gain entry into the US beauty market. Building a global business​ Umma got its start in 2014 as b2link, a sort of tech-forward distribution platform that helped K Beauty brands find a home in the Chinese marketplace, Jung tells Cosmetics Design. Since then, with the Western interest in K beauty rising, the company has become a venture that identifies compelling and/or innovative emerging Korean skin care and beauty startups, partners with those brands, and accelerates their international expansion. The brands that Umma works with are “undiscovered” ​and often have “no resources to globalize,” ​explains Jung. Nurturing a local brand​ As Jung explains it, Umma (pronounced ah·mah) is a word used for mother in Korean. And the company specializes in nurturing undiscovered brands. “We want to be their mom,” ​she tells Cosmetics Design. The company is working with more than 150 brand now, according to Jung, but will be bringing only 10 to the US for Umma's formal debut in the States. The company did a soft launch just over one year ago, according to Jung, but will arrive here in earnest before the end of the year. Jung tells Cosmetics Design that the pace of beauty innovation in South Korea is swift. There are, she says, more than 5,000 beauty brands in the country and a new K Beauty brand can come to life in as few as 3 months. Developing regional partnerships​ At Cosmoprof North America, Umma had a stylish booth tucked in the corner of the Discover Beauty section—a place where new and unique beauty brands were exhibiting their product portfolios and engaging with buyers, press, and other attendees seeking out trends and innovation. Jung used the event as an opportunity to connect with buyers and channel partners—department store buyers, big box retailers, etc. Her colleagues at Umma headquarters in Korea have got new brand discovery covered, she explains, saying that their job is to “catch the latest trends and newest brands.”​ Sometimes Umma takes exclusive distribution of a brand (an on occasion invests in K Beauty startups), when it seems like a particularly good fit for the US market, Jung tells this publication. But the company’s main revenue comes from channel partners; and that’s what incentivizes her work. “We want our channel parteners to have a great experience working with us,”​ Jung says, adding that any “sales person can get the first sale, but that a second and third order comes from consumers.”​ Which is where Umma’s brand nurturing comes in. The company helps K Beauty startups with market-ready branding, regulatory issues, and marketing;“especially social media marketing like YouTube and Instagram, and [establishing] partnerships with influencers,” ​​Jung tells Cosmetics Design. ​Accordingly, in the run up to Umma’s official debut in the States later this year, the company is hiring business development managers and PR talent with regional expertise. --- Deanna Utroske, CosmeticsDesign.com Editor, covers beauty business news in the Americas region and publishes the weekly Indie Beauty Profile column, showcasing the inspiring work of entrepreneurs and innovative brands. Copyright - Unless otherwise stated all contents of this web site are © 2023 - William Reed Ltd - All Rights Reserved - Full details for the use of materials on this site can be found in the Terms & Conditions Related topics\nBusiness & Financial\nRetail and DTC\nSkin Care\nHair Care\nColor Cosmetics\nFragrance\nNutricosmetics\nPackaging Show more  Content provided by Acme-Hardesty Company | 11-Oct-2023\n                     | White Paper Sharomix™ EG10, a versatile broad-spectrum antimicrobial liquid blend for preserving personal care products, ensures safety at usage levels ranging from...  Content provided by Acme-Hardesty Company | 07-Jul-2023\n                     | Product Brochure Acme-Hardesty’s latest expansion into Canada includes Resplanta®, Botaneco®, and BYK from our partners Sharon Personal Care and Eckart Effect Pigments...  Content provided by Covation Bio™ PDO | 22-Jun-2023\n                     | White Paper Zemea® propanediol is a 100% plant-based humectant and solvent that’s easy on skin and the planet. This single, natural ingredient boosts moisturization...  Content provided by Naolys | 26-May-2023\n                     | Product Brochure HairRevive [MM+Zn] is an innovative plant-based active ingredient comprising musk\r\nmallow (Malva moschata) cells and zinc. Show\n                        more On-demand webinars More promotional features ",
    "datetime": null,
    "url": "https://www.cosmeticsdesign.com/Article/2018/08/15/International-Beauty-A-look-at-how-Umma-is-bringing-K-Beauty-startups-to-the-US"
}