{
    "title": "Interview: Fast-growing TONYMOLY is bringing its K-beauty spirit to the global stage : The Moodie Davitt Report -The Moodie Davitt Report          ",
    "text": "TONYMOLY is a Silver Partner of The Moodie Davitt Virtual Travel Retail Expo (#Virtual Stand BT-S13) According to TONYMOLY Head of Global Business Division Clara Bae, the crisis has given her time to “pause for thought and to explore how we can do things differently.” The South Korean beauty brand is currently present in 50 countries worldwide and has 600 stores in South Korea. In travel retail, the brand is represented by TR Partners. TONYMOLY — one of the pioneers of the South Korean beauty trend — is now intent on becoming a major player in travel retail too. Bae also previews what industry partners can expect at its #Virtual Stand BT-S13 at the upcoming Moodie Davitt Virtual Travel Retail Expo. “Partnership is the key word,” she says as TONYMOLY navigates a highly competitive category currently facing one of the hardest trading periods in recent memory. “Landlords, retailers and brands need to work together to ensure that there is indeed a new era in travel retail.” It is this optimism and collaborative spirit that has secured TONYMOLY some high-profile listings with Lagardère Travel Retail, Gebr. Heinemann and The Shilla Duty Free. It is the same outlook — which has spurred the brand’s success in North America and Asia — that will help TONYMOLY successfully take the K-Beauty wave to the global travel retail stage as well. TONYMOLY is looking to showcase its extensive portfolio of “accessible, fun, stylish and easy to carry” products at the Virtual Travel Retail Expo TONYMOLY is taking the K-Beauty wave to the global stage What is the major focus for TONYMOLY  at the Virtual Travel Retail Expo? TONYMOLY’s focus at the Virtual Travel Retail Expo, is to showcase our fantastic products as well as developing our footprint in global travel retail. We have already formed some great partnerships with retailers including Lagardère Travel Retail, Gebr. Heinemann and The Shilla Duty Free. We are looking to add to this growing list as well as developing new relationships. Given our strong portfolio of products, we see huge opportunity in travel retail, specifically through online, airports, airlines, cruises and ferries. We have had a lot of interest from retailers and are very excited to showcase TONYMOLY. What lines, launches or campaigns will you emphasise and showcase? We are lucky to have an extensive portfolio that includes skincare, make up, body and hand care, as well as gifting. There is something for everyone, which rings true for our inclusive narrative. Thanks to our packaging capabilities, we are fortunate to have the ability to scale down to travel-friendly sizes and launch new product exclusives which is very important for the travel retail consumer. Internationally-renowned beauty blogger Huda Kattan recently commented on our Intense CARE Snail Hydrogel Mask which she uses every time she flies. This mask will be definitely a focus that we will be showcasing for our guests at the Virtual Travel Retail Expo. TONYMOLY offers a wide range of inclusive beauty products for both men and women From 10-step skincare routines to natural cosmetics and perfume, TONYMOLY offers a wide range of functional beauty products imbued with its signature wit and flair In your opinion, what sets TONYMOLY apart from other South Korean brands in the K-Beauty wave? As a brand, we’ve always been very agile and have always put the customer first. Our manufacturing, research and development, as well as our route to market capabilities have always been very well-defined. We launch trend initiatives faster than our competitors, which gives us a considerable market advantage. As such, we have the luxury of focusing all our attention on giving our customers what they want. What are your major targets by geography, channel or retailer type as you seek to tap into a recovering market? Travel retail is an emerging market for us with huge growth potential across all of its various channels. Our products are perfect for travel retail because they are accessible, fun, stylish, offer great quality and are easy to carry. TONYMOLY is extremely well-established in Asia; and we are also thriving in the US market. We recently launched in Europe and have had some high profile domestic listings including, Harrods. We started off very well in Europe and together with our partners we will continue to look for new growth opportunities. TR Partners has been appointed by South Korean beauty brand TONYMOLY to help develop its global footprint in both travel retail and selected local markets TONYMOLY is present in over 50 countries around the world and has approximately 600 stores in its home market of South Korea How do you view the continuing impact of COVID-19 on the wider industry? COVID-19 has given us all the time to pause for thought and to explore howe can do things differently. Given the current restrictions on movement caused by the pandemic crisis, customers have become extremely knowledgeable about what they are buying. This is because they are now spending a lot of time researching products online and through social media channels. COVID-19 era customers have already made purchase decisions before they even enter a store or visit its ecommerce platform. We believe that this can only benefit the industry, because brands will be more focused on creating products that customers really want.  How do you think the channel can and should engage with travelling consumers to ensure a sustained recovery? Customer engagement is becoming extremely important in such a competitive and contactless environment. Travel retail needs to engage with customers prior to their journey, whether that be through online, digital or social media. By doing so retailers and brands can give customers more reasons to shop, particularly during these uncertain times. Customers will return to stores once they can be assured that the retail environment is safe. How would you like to see industry partnerships evolve as we enter a new era for travel and travel retail? Partnership is the key word, landlords, retailers and brands need to work together to ensure that there is indeed a new era in travel retail. Working in isolation benefits no one, sharing data and getting closer to the customer is key for innovation and in boost sustained growth. It is very important to look towards the future in these challenging times, set a better way of working and to collaborate essentially.  TONYMOLY is a Silver Partner at the inaugural Moodie Davitt Virtual Travel Retail Expo. The unique 5-day ‘live’ event, followed by a 30-day showcase, begins on 12 October, just after the conclusion of the Chinese Golden Week holidays. It features a star-studded series of events across the five days, including a Symposium, category workshops and a new consumer research initiative. Registration is free for buyers, exhibitors and preferred media partners. (Click here to register)   Follow The Moodie Davitt Report on Linkedin:  Share this article: NCLA Beauty is known for its trendsetting designs and commitment to cruelty-free, clean, vegan formulations. Its expansion into travel retail marks a milestone for the brand. Read More All the innovative lifestyle brand’s products, including its quick-dry travel towels, are made from 100% recycled materials. Read More “When they find their home, rescue dogs become Velcro dogs that never want to be parted from you.” Our regular column in association with Tito’s introduces two loving English Bull Terriers, one a football player, the other an ornithologist. Read More With a big focus on wellness and the environment, TR Partners is set to spotlight its diverse portfolio at this year’s TFWA World Exhibition & Conference. Read More ",
    "datetime": "2020-09-18T14:52:51+00:00",
    "url": "https://www.moodiedavittreport.com/interview-fast-growing-tonymoly-is-bringing-its-k-beauty-spirit-to-the-global-stage/"
}