{
    "title": "Irene Kim YouTube Beauty Guru - Teen Vogue November 2015 | Teen Vogue",
    "text": "By Elaine Welteroth Irene Kim — model, edgy street-style star, and Estée Lauder’s global beauty contributor — is demo-ing the art of the DIY rice wrap live on my Snapchat from a Vietnamese restaurant in Seoul’s posh Cheongdam-dong district. “You just fold it up like a little baby in a blanket,” she says, smiling encouragingly. Her BFF and colorist, Sunwoo Kim, leans in to tag team, shoveling a kaleidoscope of veggies into my steamy rice paper. Clearly I’m in good hands with this dynamic duo, who, aside from helping clumsy tourists, are beauty gurus in their own right, having famously refreshed the Technicolor ombré trend. What began as a haphazard quick fix for a case of “black-hair boredom” has since blown up—and taken Irene’s modeling career with it. “Changing my hair color really did change my life. I think it gave me that trademark,” she says. However, Irene admits her agency wasn’t very fond of the idea at first. “They feared I wouldn’t get any work. But now people are like, ‘Oh, my God, you are the girl with the rainbow hair!’” she exclaims. The front-row fixture and unofficial K-beauty ambassador, who grew up in both Seattle and Seoul, is making a name for herself in the West by helping to usher in the most relevant trends from the East. Reflecting on the perks of her international upbringing and its influence on her sartorial risk taking, Irene delivers an insightful outlook: “It’s more courageous to change than to stay the same.” Photographed by Clara Balzary, Fashion Stylist: Marissa Peden, Hair: Caile Noble using R+Co\nMakeup: Sandra Ganzer using CHANEL Hydra Beauty Micro Serum, Nails: Whitney Gibson for The System by Formula X in White Matter, Grey Matter Related: Watch Charli XCX Give Us Her 3 Ultimate Beauty Tips By Kara Nesvig By Ashleigh Carter By Kara Nesvig By Kara Nesvig More from Teen Vogue Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Teen Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "datetime": "2015-10-19T19:00:00.000Z",
    "url": "https://www.teenvogue.com/story/irene-kim-beauty-guru-exclusive-interview"
}