{
    "title": "\r\n\tIs K-beauty’s reign coming to a close? | Marketing | Campaign Asia\r\n",
    "text": "Amorepacific's affordable beauty brand Etude House is closing shop in China, showing retailers just how competitive the country’s beauty market can be. With its affordable prices and princess aesthetic, Etude House has long served as a haven for young girls. Its store design is a cross between a fairytale castle and a dollhouse, boasting a dreamy, pink interior, checkered floors, chandeliers, and even a Cinderella-like carriage. Dedicated to fostering a “culture of Makeup Play” and helping beginners “discover [their] true beauty,” the Korean label has conquered hearts around the world. But now, it joins a list of brands that have bitten the cosmetic-grade glitter dust: after seven years of operating in the mainland, Amorepacific-owned Etude House is shutting its doors. In early March, local media reported that the cult-favorite beauty line had closed all of its physical locations in China, with multi-brand retailer The Colorist now it’s only offline channel. At its peak, Etude House had 85 shops across 25 cities in China, with hundreds more in Korea and abroad. Though products are still available online (through the brand’s flagship stores on Tmall, WeChat, and Little Red Book), how did it go from queen of the castle to locking its gates? Below, Jing Daily analyzes the obstacles Etude House faced in the market, what other retailers can learn, and whether this signals a closing chapter for K-beauty in China. Political tension taints brand perception Driven by relatively open international exchange and a rising middle class, Korean cultural products became enormously popular in China at the beginning of the century, from musical acts like H.O.T. and Shinhwa to film and TV shows. It was on the back of this “Korean Wave” that K-beauty rose to popularity, with beauty conglomerates employing K-pop figures and product placements to boost sales. And it worked, for a while. “My Love from the Star,” for example, was so well-received that the YSL lipstick used by the female lead sold out worldwide after the K-drama aired in 2014. As one of the official sponsors of the show, Amorepacific reaped major benefits, seeing sales of its skincare products and lipsticks jump 75 percent and 400 percent, respectively — largely thanks to China. That same year, Korean cosmetic exports to China increased 89 percent year-on-year to reach $600 million. Since then, the tide on Korean products has turned. Part of this is rooted in politics: South Korea’s decision to cooperate with the US to build the THAAD missile defense system in 2017 resulted in China banning Korean imports for two years. Naturally, this had an immediate impact on the beauty industry, from local e-commerce sites discontinuing sales to fewer Chinese tourists in Korea. But it’s arguably the lingering effects, namely the anti-Korean sentiment and surging nationalism, that are proving more troubling. From 2013 to 2017, the growth rate of Korean cosmetics exports to China stood at 66 percent, but then tumbled to 20 percent in 2018. Etude House’s earnings mirrored this drop, with sales peaking in 2014, then plunging from $266 million to $177 million in 2017, down to $88 million in 2019. With this in mind, brands should be wary of how international relations can sway consumer behavior, particularly now as China-US and China-EU ties rapidly deteriorate. COVID-19 disrupts beauty consumption K-beauty brands took a bigger hit once the pandemic struck. Not only were online sales not enough to offset falling foot traffic, but shifting consumer habits — such as reduced spending on color cosmetics — put Etude House at a disadvantage. According to Amorepacific’s 2020 results, the company as a whole suffered. Revenue for the fiscal year was down 20 percent to $3.9 billion, with cosmetics, which makes up almost half of its revenue, tanking 26 percent year-over-year. And Etude House fared the worst, being the sole brand among the group’s 37 subsidiaries to face capital impairment. Due to cumulative net losses and the costs of restructuring shops, Etude House’s total equity now stands at minus 6.6 billion won (minus $5.8 million), Amorepacific recently disclosed to The Korea Times. Fortunately, the beauty industry in China remains resilient, albeit changed. For one, above-the-mask makeup is on the rise, with Tmall data showing a 150 percent increase in sales of eye makeup products in February 2020. Skincare brands like SkinCeuticals and Avène have also fared well in the country by promoting their products as part of quarantine skincare routines and solutions for mask irritation. Beauty brands that want to stay relevant can lean into these COVID-related trends, framing their products as stay-at-home or mask wearing “must-haves.” Weak brand positioning erodes market share Of course, not all of the Etude House’s woes can be blamed on external factors. Playing a larger role in the brand’s downfall, arguably, is its lack of differentiation. Many K-beauty brands that fall in the low- to mid-end price range have become popular for fast beauty, shaving the R&D cycle from a year down to just four months. While this allows for more frequent drops (and for brands to join the latest fads), it doesn’t necessarily mean these products are more localized or innovative. “[Innisfree, The Face Shop] and Skin Food all have the same characteristics: natural, healthy and affordable products. Regardless of the blessings of the Korean Wave, these brands are too homogeneous,” said Kathy Liang, a former buyer at a Korean cross-border e-commerce platform, to Vogue Business. Although Etude House distinguishes itself with its girly aesthetic, it too offers many products like sheet masks and cleansing oils that blur together with competitors’. At the same time, the brand has struggled to grow beyond its starter pack positioning and keep up with consumers. “The consumers from its early days have gradually lost their student status and upgraded their consumption,” retail industry analyst Yun Yangzi explained to local media. “However, Etude House maintains its affordable makeup positioning, ignoring the needs of old consumer groups while failing to attract new customers like affordable local brands Perfect Diary or Florasis.” C-beauty rivals ride the “Guochao” wave Etude House initially won big with its cost-effective products, creative packaging, and quick turnaround, but these traits no longer distinguish it in today’s competitive market. Not only do C-beauty brands also offer quality products at reasonable prices, but they have an even stronger grasp of which marketing tactics will appeal specifically to Chinese consumers. As Allison Malmsten, market analyst at Daxue Consulting, told Jing Daily, “Domestic brands have the advantages of pulling in Chinese artistic elements (Florasis, for example), curating their marketing tactics to WeChat or other platforms which are native to China (Perfect Diary), and understanding local skincare needs such as sensitive skin (Winona).” As such, Chinese consumers are showing greater preference for homegrown brands, a trend known as Guochao. Global players, therefore, should look to C-beauty for strategies to win the market, such as diversifying co-branding, cooperating with different levels of influencers, incorporating Chinese design elements and colors, as well as tailoring content to each unique digital platform. A new chapter for Etude House? But the rise of C-beauty doesn’t have to mean the end of K-beauty, Malmsten said. “Tier-1 cities are the least influenced by the [Guochao] trend and are more likely to continue buying foreign beauty products,” she explained. “Tmall’s data shows only around 10 percent of domestic beauty brand consumption is in tier-1 cities in 2020.” And this is where Etude House’s partnership with The Colorist comes into play. Through the Chinese cosmetics retailer, the brand is still able to maintain a physical presence in the country and even penetrate new cities as the chain expands. The Colorists’s popularity among young consumers — sparked by its social media-worthy decor and immersive experiences — can also help Etude House reach new audiences and elevate its perception as trendy and cool by association. Additionally, divesting from brick-and-mortar will help free up resources to ramp up e-commerce. So far, the brand is already taking a page out of their C-beauty’s book by collaborating with Hershey Kisses, which it is promoting heavily to its 1.5 million followers on Weibo. So while K-beauty has a lot of catching up to do, Etude’s story isn’t over yet. Perhaps these changes are exactly what it needs to get its fairytale ending. Top news, insights and analysis every weekday Sign up for Campaign Bulletins Who doesn't love enjoying a nice sweet treat. But would you use one to brush your teeth with before bed? From next year, Mickey Mouse the legendary rodent, will no longer be owned by Disney. With the chains of IP law beginning to unshackle, what does this mean for the future of the brand's beloved character? This tarot-reading Havas creative pines to visit the ancient pyramids of Egypt, get off Instagram so she can embrace a digital detox, and is busy trusting the process. A Mindshare China loyalist of over 24-years, Low is instrumental for commercial gains as well as client and staff retention. Terms & Conditions / Contact Us © Haymarket Media Ltd. ",
    "datetime": null,
    "url": "https://www.campaignasia.com/article/is-k-beautys-reign-coming-to-a-close/468784"
}