{
    "title": "IU Lands 12 New Songs, Third No. 1 on K-Pop Hot 100 – Billboard",
    "text": "IU soloist extends her reign for most weeks at No. 1 on the K-Pop Hot 100. Plus, chart highlights from Seo In Young, T-ara and more. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin K-pop’s young diva IU and her coming-of-age album “Modern Times” has garnered discernible public approval with a whopping 12 album tracks shaking up the K-Pop Hot 100 this week, including single “The Red Shoes” snagging the No. 1 spot. The big band throwback track leads the pack of the “Modern Times” tracks dominating the K-Pop Hot 100 this week, including five Top 10 entries. Check out IU’s full chart dominance below: Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news No. 1 “The Red Shoes”No. 3 “Everybody Has Secrets” feat. Ga In of Brown Eyed GirlsNo. 5 “50cm”No. 7 “Love of B” with Park Joo WonNo. 10 “Modern Times”No. 14 “Bad Day”No. 15 “Daydream” feat. Yang Hee EunNo. 23 “Obliviate”No. 26 “Walk With Me, Girl” feat. Choi Baek HoNo. 28 “Voice Mail” (Korean Ver.)No. 29 “Havana”No. 41 “Wait” Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t10/18/2013 With “Red Shoes” on top extends IU’s chart record for the act with most weeks at No. 1 on the K-Pop Hot 100. Since the chart’s August 2011 creation, IU has spent a remarkable 10 weeks in the top position. She first hit No. 1 in December 2011 with “You and I” which locked itself on top for five weeks, a record at the time. The Seoul native came close to tying the feat when “Every End of the Day” reigned for four weeks in spring 2012. “The Red Shoes” gives her a tenth week at No. 1, extending her lead over SISTAR, who have garnered eight weeks atop from four No. 1s. Watch IU perform the hit single live wearing, of course, red heels below:  Despite T-ara still being plagued by last summer’s highly-controversial incident (where they were criticized for allegedly bullying and forcing member Hwayoung out), the group, now boasting six members after Areum left to pursue a solo career, have made a strong comeback. New single “No.9” snags the Hot Shot Debut on the K-Pop Hot 100 this week at No. 6. The girl group’s latest EP “Again,” released on Oct. 10, consists of five new tracks and enlists an extensive roster of Korea’s hottest producers, including Shinsadong Tiger, Duble Sidekick, Choi Kyu Sung, Park Duk Sang and Park Hyun Joong.  The electro-pop single, “No.9,” is an addictive, pumping techno-dance track with sad lyrics that aim to showcase the group’s collective musical maturity. Its original music video, where the girls dance and sing in racy outfits, has racked up 1.8 million views since its Oct. 9 reveal (below). To capitalize on the interest, Core Contents Media released the second version on Oct. 16.  T-ara also released a second single to promote the “Again” EP with “Because I Know.” The simple track features the girls offering hushed singing and rapping over the acoustic-leaning mid-tempo production. It’s an extreme opposite from the bumping “No.9” and lacks the same energy. It debuts 12 spots behind the dance track at No. 21.  After bursting into the Top 10 last week, Seo In Young — the solo vocalist and former member of veteran K-pop girl group Jewelry — slips to No. 19 with “Love Me,” featuring Dynamic Duo’s Gaeko. The K-diva’s latest single is produced and composed by hitmaker extraordinaire KUSH (BIGBANG, 2NE1). In the post-disco-influenced track, Seo In Young asks for her ex-love to “love her again” with her signature, crystal-clear vocals. Dynamic Duo’s Gaeko evens out the song with his rhythmic rapping. In the music video, Seo In Young (in her new platinum blonde hairdo) is seen wondering around the streets, playing with Legos and spray painting in various rock-chic ensembles. The video has amassed a cool 200,000 views since its release on Oct. 3.  Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2013-10-19T00:59:42+00:00",
    "url": "https://www.billboard.com/music/music-news/iu-lands-12-new-songs-third-no-1-on-k-pop-hot-100-5762993/"
}