{
    "title": "J-beauty or K-beauty: Which one works for you? | Mint Lounge",
    "text": "You have successfully subscribed to Mint Lounge newsletter. The Indian consumer is spoilt for choice when it comes to skincare products. In the past few years, especially since 2020, there's been a steady rise in the number of homegrown and international brands offering products to meet the growing needs of the beauty customer. Among these brands are those that belong to Japan and Korea. They have garnered a cult following in the country thanks to the growing interest in K-dramas, Japanese shows and the increasing desire to have a clear, pump skin. Also read: Why so many women are hooked to Asian skincare Some of the Japanese beauty brands available in India are DHC, Biore, Shiseido and SK-II, and Japanese, belif, Innisfree, The Face Shop, Tony Moly, Laneige and COSRX, among others. With this plethora of options comes confusion. Which beauty range works for you: J or K? To make an informed choice, you first need to understand the difference between the two. Key philosophy is where J-beauty and K-beauty differ. Japanese beauty tends to put an emphasis on minimalism and functionality, while K-beauty is all about nourishing the skin with an intricate, delicately balanced, multi-step routine to achieve desired results. While J-beauty is based on traditional practices, it incorporates modern products that have state-of-the-art formulations. K-beauty, on the other hand, focuses on pushing the boundary by creating out-of-the-box skincare offerings with previously unheard of formulations. Rubber masks, cushion compacts and activating serum are just some of the cool products offered by K-beauty brands. As mentioned above, J-beauty has a strong focus on a “less is more” approach, with consistency being key to seeing results in the long run. A typical J-beauty routine will include 4 steps: Steps 1 & 2: Double cleanse, which involves first using an oil-based cleanser, followed by foaming cleanser. Steps 3 & 4: Double moisture, where a light essence or lotion that increases skin hydration is applied first, followed by a moisturiser and sunscreen. K-Beauty followers have a carefully crafted 10-step process that can even go up to 17 steps. The key point to remember is that K-beauty is all about layering on products in the correct order, from the lightest to most occlusive, to ensure proper absorption. Here are the steps you would have to follow: double cleanse, exfoliation, toner, essence, treatment serum, sheet mask, eye cream, moisturizer and SPF. Skin hydration and exfoliation are two of the key focuses of Korean skincare, whereas Japanese skincare stresses on cleansing. That’s why a double cleansing regimen is key to acing a J-beauty routine. “Glass skin” that appears healthy and poreless yet luminous is the goal of K-Beauty. J-beauty prizes “mochi skin” that’s super-soft and plump; you’ll also see the influence of wabi-sari, a philosophy that finds beauty in imperfection and prioritizes a consciously edited, simple routine. There are a few key ingredients you’ll see in both K-beauty and J-beauty products, like rice and green tea. Stand-out ingredients like snail mucin, red ginseng, propolis and centella Asiatica extract make K-beauty products unique. Sake, camellia oil, yuzu and cherry blossom extract are unique to J-beauty. You’ll see a lot of influence of Geisha history, manga and kawaii culture in J-beauty. On the other hand, K-pop, dramas and celebrity culture influence K-beauty. When it comes to packaging, K-beauty products generally have more a innovative design that’s colourful and cute. In a J-beauty product, you’ll get a more minimalistic design that focuses on perfection. Many K-beauty brands in India boasts of affordable price points, with sheet masks starting at Rs. 100, but the price quickly adds up considering the number of steps in a K-beauty routine. J-beauty products may come, with more of a premium price tag on average, but since it’s only four steps it could work to be a lot more affordable. Fumi Manabe is senior manager (overseas retail), DHC.Also read: Why we need different skincare routines for summer and winter ",
    "datetime": null,
    "url": "https://lifestyle.livemint.com/fashion/beauty/jbeauty-or-k-beauty-which-one-works-for-you-111641149206903.html"
}