{
    "title": " J-Beauty Surpasses K-Beauty in Share of Voice in Southeast Asia Says New Study | Branding in Asia",
    "text": "Move over, K-Beauty, J-Beauty is now “all the rage in Southeast Asia,” says a new report from Meltwater that shows Japanese beauty products have taken the lead in share of voice among consumers in the region. The report also takes a deep dive into the trend of influencers in a beauty industry once ruled by celebrities, as consumers increasingly turn to influencers across social media to access beauty trends, looks, content, and experiences, as the beauty industry fully embraces the power of influencer marketing. The findings are part of Meltwater’s ‘Beyond Skin Deep: Understanding the Shopping Journey of the Southeast Asian Beauty Buyer’ report, which explores how the industry is leveraging the power of influencer marketing, and why these “relatable and authentic” personalities are the top choice for beauty brand endorsements and commercial collaborations. The report tracked and analyzed social media mentions of the top beauty and cosmetics companies across millions of posts from Twitter, Facebook, Instagram, YouTube, blogs, review sites and online forums. Meltwater’s Social Influencer Discovery tool was also used to identify the top influencers and content in each country – with lips receiving the most buzz of all product categories. According to the report, Japanese beauty products took the lead in terms of share-of-voice, as compared to Korean and Chinese beauty brands. This is a significant departure from the last decade when K-beauty successfully cracked the global beauty market. The Meltwater report found that J-beauty (Japanese beauty) has effectively caught up – with a 58.7% share compared to a distant second K Beauty at 21.9% followed by China at 19.4%. According to the report, this growth can be attributed to the rise in foreign tourists to Japan and consequent exposure of popular products through social media.  Regional residents, especially Indonesians and Filipinos, are traveling to Japan in greater numbers on the back of positive macro-economic trends that are propelling more people into the middle-class bracket. Japanese beauty companies are making the most of this trend; Shiseido launched a new skin care brand Waso spotlighting local ingredients such as soybean and white jelly mushroom, which are considered exotic in the West. The company also worked with model Poppy Delevingne to modernise its image in EMEA through online beauty tutorials. Similarly, SK-II hired model Behati Prinsloo Levine to raise its image in the West. Of the markets studied, Indonesia topped beauty chatter, representing 38% of social chatter, followed by Malaysia and the Philippines at 29% and 27%. “Consumers today know when they are being sold to and would much rather hear from real people,” said Mimrah Mahmood, Regional Director, Media Solutions, Meltwater Asia Pacific. “As such, brands need to be more strategic in their talent collaborations, looking not only at vanity metrics like follower numbers, but also incorporating deeper insights such as average engagement per post, true reach, and demographic data to determine whether an influencer appeals to the right audience.”  The report also examines the importance of strategic brand partnerships with credible social media personalities, whose content is relevant to the target audience. Meltwater additionally identified key strategies that beauty brands in the region should consider adopting to fully leverage how customers are consuming beauty-related content. “An integrated influencer marketing strategy is non-negotiable when it comes to garnering consumers’ attention in a cluttered and noisy digital space,” said Bea Asavajaru, Global Senior Manager (Social Media and Influencer Marketing), Clé de Peau Beauté, a Shiseido brand. “By carefully selecting and collaborating with influencers, in addition to continuing our traditional marketing efforts, our brand can be culturally relevant to consumers.” On social media in Southeast Asia, lips received the most buzz of all product categories. “Establishing authentic connections with our audience is of great importance. Since we have curated and worked with influencers who command considerable influence over a sizeable population, we have seen a direct increase in brand awareness and share-of-voice among our competitors.” Download the full report here.     we never share your info, we only share ours about Us  |  Terms & Conditions ©2023  Branding in Asia™​ We never share your info, we only share ours ",
    "datetime": "2019-08-01T07:11:46+00:00",
    "url": "https://www.brandinginasia.com/influencers-displacing-celebrities-for-beauty-brand-marketing-in-southeast-asia/"
}