{
    "title": "Jackie Chan’s K-Pop Group JJCC Releases Debut Single ‘At First’: Watch – Billboard",
    "text": "Jackie Chan's K-pop group JJCC has released its R&B-pop debut single 'At First.' Watch the special effects-heavy music video now. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin As previously reported, Jackie Chan is trading in action-film stunts for artist management, beginning with K-pop boy band JJCC. The quintet officially released its debut single “At First” today after making its first live appearance on South Korea TV last weekend. The impressive results indicate that the martial arts star may have a place in the global music market. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tJackie Chan\t\t\n\t\t\t\t\t\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news As many K-pop tracks do, “At First” bends genres, combining a melancholy hip-hop beat with boy-band harmonies for a somber-but-sophisticated of slice of R&B-pop. On the verses, the quintet serves smooth raps topped off by sensual ad-libs. It leads to a laidback chorus that is relaxing but still features a melody catchy enough to get stuck in your head. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t03/24/2014 Top 5 K-Pop Acts to Watch in 2014 Curiously, the accompanying music video only features four JJCC members — reports indicate member Prince Mak was sick and/or suffering from an accident. Still, the handsome 20-somethings make an impression visually with their sharp style. The video also comes loaded full with special effects — sure to make their mentor smile — as the boys hold fireballs in their hands and make cracks in a stone building with just a touch.  On March 20, JJCC made its live debut as a full quintet on K-pop music chart program “M COUNTDOWN.” Watch the simple-yet-slick choreographed performance below boasting impressive belting from member Eddy. Check back on Thursday morning when the Billboard charts are refreshed to see if Chan’s K-pop group can make a dent on South Korea’s singles chart, the Billboard Korea K-Pop Hot 100.  Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2014-03-25T01:45:48+00:00",
    "url": "https://www.billboard.com/music/music-news/jackie-chans-k-pop-group-jjcc-releases-debut-single-at-first-watch-5944799/"
}