{
    "title": "Jaime King's Beauty Secrets from Her Mother",
    "text": "Every item on this page was chosen by an ELLE editor. We may earn commission on some of the items you choose to buy. As fashion changes from season to season, one thing remains consistent: Jaime King. Discovered as a teenager, the 34-year-old has walked the runways for Chanel and Dior, secured contracts for brands such as Rocawear and Revlon, and appeared in countless TV and film projects. This month marks the sixth and final season of the Emmy-winning animated series Star Wars: The Clone Wars (King lends her voice to five different Jedi priestesses) as well as her return to CW's Hart of Dixie, a role from which she took a hiatus to welcome son, James, in October. But her favorite role of all time? Being a daughter to mom Nancy King, a former beauty queen, from whom the actress inherited a strict beauty routine, a striking resemblance, and a refreshing take on the power of fashion. \"I'm avid about face serums, face moisturizers, and face washing. That's definitely something I learned from my mother. I use Elemental Herbology face wash. It's the only thing that will literally take everything off of my skin without having to scrub, scrub, scrub. After I wash my face, I put on some kind of serum—either La Prairie, they have great hydrating serums, or I'll use Kate Somerville Restor8, which is a replenishing serum. It kind of depends on how my skin is feeling that day. They also have a great Total Vitamin Serum that I really love a lot. Related: The Coveteur: Jaime King My mom, I remember, always used Oil of Olay and Clinique. She would give us the Clinique face wash and the yellow moisturizer. She would get us little samples of the toner at the mall. She really set the tone for us about how to take care of ourselves and making sure that we really honored and took care of our skin. She was adamant about sunscreen before sunscreen was even heard of. I'm not kidding you. Before any research came out, before anybody was like, 'Oh yeah, people should wear sunscreen.' Now everybody knows about it, but when we were kids in the early '80s, people were putting oil all over their bodies. My mom never let us do that. I remember one time my sister got grounded for weeks because my mother found out that she was tanning. I went through a stint when I was 19, 20, 21, when I would go to [tanning salon] Portofino in New York because some of my girlfriends were tanning. I was like, 'I want to look blonde and beautiful.' And then I realized this is really awful for me. I may look beautiful, but this is really bad. Related: Lauren Paul Inherited Mom Debra's 'Magic Beauty Juju' I am where I am in life because my mother is so supportive. She is someone that grew up in a very conservative family. She didn't have a lot of money growing up. She had to make her own clothes and work really hard. She didn't have the luxuries that other people were provided. Because of that, she really wanted us to have a different kind of life; and she really did a beautiful job as a young mother instilling in us that no matter what we wanted to try or do that she would support us. I mean, I always dress like a little wackadoo. My siblings would make fun of me, but I would go to the Goodwill to buy my clothes. I would like, put the weirdest combinations of things together, and she never said, 'Oh my god. You look crazy.' She supported me no matter what I wanted to try or do or look like. I think that that support went a long way because I never felt judged by my mom as a woman. It wasn't until we got into high school, or actually junior high, when I started realizing that other women judge you for the way that you looked. I don't know if she intentionally did it, but I know that it made a huge impact on the way that I perceive myself, and also the way that I want to raise my kids. Related: Jaime King's Guide to L.A. I feel like fashion is just another way to communicate. Fashion and beauty are the ultimate way to communicate who we are as human beings. A lot of other art forms have to be spoken. They have to be talked about. They have to be presented in a certain way that can't change on a day-to-day basis. But with fashion or clothing, the minute you walk into a room, you are telling people who you are. To me, that's a really beautiful art form. It doesn't have to be a thing where we use it against each other. I've been asked several times to be on these Fashion Police shows or go on these big networks and talk about Oscar dresses. I always refuse because I'm not here to judge what other people are wearing. I don't think that people step out of the house trying to look bad. I'm someone who was born and bred in the fashion industry—I started when I was 13 years old. I was raised by people like John Galliano, Karl Lagerfeld, and Alexander McQueen, and they taught me so much. Even my mom, who was a seamstress, taught me about the power of fashion. And so, to me, it's like: How do we use our industry to uplift people rather than to make them feel that they have to uphold a certain level of beauty that they'll never be able to maintain? I think that we can show them the opposite of that.\" Photos: SPOT/AKM-GSI; Instagram; Courtesy of the Brands; Getty Images Justine Harman is a Webby-winning podcaster, a 2022 National Magazine Award finalist, and the former features director at Glamour. Listen to new episodes of KILLED HERE. Simple Nail Designs for Your Manicure Mood Board 14 Vanilla Perfumes That Smell Absolutely Amazing 13 Best Japanese Skin Care Products to Shop For Breast Cancer, 40 Is the New 50 Meet YSL Beauty’s Most Unconventional Scent Yet Amazon Is Having a Major Beauty Sale Right Now Why Matrix Could Be the Next Best Skin Treatment The Best Neutral Nail Colors for Every Skin Tone Claudia Sulewski Launches CYKLAR Beyoncé Is Finally Releasing a Perfume A No-Damage Routine for Colored Hair First Class Beauty 2023 A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2014-03-24T13:00:00Z",
    "url": "https://www.elle.com/beauty/news/a19060/jaime-kings-best-advice-from-her-mom/"
}