{
    "title": "Japan or Korea? How J-beauty and K-beauty cosmetics and skincare compare | South China Morning Post",
    "text": "If you have ever seen a young woman return from a holiday to Japan or South Korea with a loot bag full of cosmetics, you will know that there is much to demystify when it comes to the allure of Japanese (J-beauty) and Korean (K-beauty) beauty products. Even though Western companies have followed these brands into the game, they don’t seem as authentic. First, why are Japanese and Korean beauty brands considered a world apart from other brands? Because, like food, they are deeply rooted in their own traditions and cultures. Rituals and Cultures The long-established reputation of J-beauty has attracted legions of consumers to brands like DHC, SK-II and Sekkisei seeking the enviable skin quality of Japanese women. Traditional Japanese women’s skincare rituals required the use of at least 10 products simultaneously, as they were believed to be essential to maintaining effervescent skin. The emphasis remains on effervescence, because the goal is to achieve a bright skin tone – known as “bihaku” in Japanese. This requires starting your beauty routine with double cleansing, and is often followed by an essence, lotion, sera and moisturiser. Frequent facial masks and regular facials are also part of the routine. But while Japanese beauty products abide by traditional rituals, a lot of their product innovations come from scientifically researched formulations. On an SK-II press trip I once went on, I was given a walk-through to view the research they had conducted on the skin of various test subjects over 10 years, just so that they could see the efficacy of the products. Because layering is at the core of J-beauty, most of the products often have a really light texture resulting in super hydrated skin. Sekkisei and SK-II are famous for their lotions, which SK-II calls “miracle water”. SK-II’s Facial Treatment Essence and Mask remains a worldwide sensation after more than 10 years on the bestsellers’ list, thanks to its Pitera formulation and star power. Backed by P&G, this monster beauty brand has an impressive line-up of ambassadors. Its latest cast includes James Corden, Naomi Watanabe, Tang Wei and John Legend. J-beauty kicked off the Asian beauty craze, but K-beauty caught up quickly, gaining momentum alongside the rise of K-pop and K-drama worldwide. The Wheel of Colours So, why do we care about K-beauty, and why is it different? K-beauty is similar to J-beauty in many ways – great innovative products, a skincare ritual that is also old. What sets it apart is how exciting and out-of-the-box it is. Products like cushion foundations, rubber masks, horse oil masks and activating serum (which you use even before your toner!), are among many quirky creations. Along with that comes cool packaging, cute collector’s items and K-pop star wattage to back them up. Lee Hwa-jun, a senior beauty and personal care analyst at Mintel, predicts more changes, including a response to a rise in demand for vegan beauty products. Customers queue for a specific lipstick colour – one of which was sparked by the hype caused by South Korean actress Jun Ji-hyun’s lip colours in My Love from The Star. The products were from K-beauty brand IOPE, which is part of the Amore Pacific company’s impressive roster of brands. The cosmetic products featured flew off the shelves and had waiting lists. The actress has gone on to front numerous beauty campaigns, one of which is HERA, also an Amore Pacific brand. Apart from star backing, cosmetic brands from South Korea create new trends. Observe the fade out lips, peach-hued lids and lips, among many examples. A glance at the models Japanese and Korean beauty brands use will give you a good idea that, even though both beauty rituals have long been lauded as the gold standard in beauty, they are quite different. However, there are murmurs that J-beauty is fighting back. Shiseido has upped its game through revamped packaging, and the perceived improvement in J-beauty brands’ sales was largely caused by China’s consumer leanings towards Japanese beauty brands when political relations between China and South Korea soured over the THAAD missile defence system. Both are grounded in tradition and focus primarily on anti-ageing. Their differences boil down to consumer preferences over how loud they want their products to be. Here are some of our top picks. J BEAUTY If you prefer minimalism and timeless designs. 1. Ipsa 2. Sekkisei 3. SK-II 4. Shiseido 5. Tatcha K BEAUTY If you prefer funky packaging, the latest make-up trends, and products that come with celebrity cred. 1. Sulwhasoo 2. Amore Pacific 3. Laneige 4. 3CE Want more stories like this? Sign up  here. Follow STYLE on  Facebook,  Instagram,  YouTube and  Twitter Japanese and Korean beauty products are deeply rooted in their own traditions and cultures. Here are our top picks from both camps ",
    "datetime": "2019-07-17T13:00:12+08:00",
    "url": "https://www.scmp.com/magazines/style/fashion-beauty/article/3018766/japan-or-korea-how-j-beauty-and-k-beauty-cosmetics"
}