{
    "title": "Japanese architect Toyo Ito wins $100K Pritzker Prize | CBC News",
    "text": "Japanese architect Toyo Ito has won this year's Pritzker Architecture Prize, the world’s most prestigious award for architecture. Ito's buildings, many in his home country, have won praise for their fluid, airy beauty and balance with nature. His well-known works include London's Serpentine Gallery Pavilion, the spiral White O residence in Marbella, Chile, and the arch-laced, curving Tama Art University in suburban Tokyo. The Taichung Metropolitan Opera House in Taiwan is currently under construction. Ito, 71, says he seeks to deviate from the grid-like shapes that make modern cities so homogenous and develop something more in concert with the surrounding environment. \"His buildings are complex, yet his high degree of synthesis means that his works attain a level of calmness, which ultimately allows the inhabitants to freely develop their life and activities in them,'' said Chilean architect and jury member Alejandro Aravena. His Sendai Mediatheque,  a library notable for its transparent open construction, was lauded for withstanding the massive earthquake that struck offshore from the city in northeastern Japan in March 2011. In the wake of that earthquake and tsunami, Ito brought his design skills to bear on the relief centres where survivors of the quake had to live. Ito and a group of other Japanese architects partnered to develop the concept of \"Home-for-All\" communal space for survivors. \"The relief centres offer no privacy and scarcely enough room to stretch out and sleep, while the hastily tacked up temporary housing units are little more than rows of empty shells: grim living conditions either way,\" he wrote of this project. \"Yet even under such conditions, people try to smile and make do…. They gather to share and communicate in extreme circumstances – a moving vision of community at its most basic. Likewise, what we see here are very origins of architecture, the minimal shaping of communal spaces.\" He said thinking about housing Japan’s earthquake survivors returned him to the \"primal theme\" of architecture – why a building is made and for whom. \"An architect is someone who can make such spaces for meagre meals show a little more humanity, make them a little more beautiful, a little more comfortable,\" he said. Ito began his career at Kiyonori Kikutake & Associates after he graduated from Tokyo University in 1965. He founded his own firm in 1971. His works have been exhibited in museums in the United States, England, Denmark, Italy, Chile and numerous cities in Japan. He will receive a $100,000 US grant and a bronze medallion at the formal Pritzker ceremony May 29 at the John F. Kennedy Presidential Library and Museum in Boston. Sponsored by the Hyatt Foundation, the Pritzker Prize was established in 1979 by the late entrepreneur Jay A. Pritzker and his wife, Cindy, to honor \"a living architect whose built work demonstrates a combination of those qualities of talent, vision and commitment, which has produced consistent and significant contributions to humanity and the built environment through the art of architecture.\" Past winners include Frank Gehry, IM Pei, Tadao Ando, Renzo Piano and last year, Wang Shu, the first Chinese citizen to win. With files from the Associated Press Audience Relations, CBC P.O. Box 500 Station A Toronto, ON  Canada, M5W 1E6 Toll-free (Canada only):  1-866-306-4636 It is a priority for CBC to create products that are accessible to all in Canada including people with visual, hearing, motor and cognitive challenges. Closed Captioning and Described Video is available for many CBC shows offered on CBC Gem.  ",
    "datetime": null,
    "url": "https://www.cbc.ca/news/entertainment/japanese-architect-toyo-ito-wins-100k-pritzker-prize-1.1334396"
}