{
    "title": "Jelly skin: Australian retailer Style Story rolls out sleeping mask to tap K-beauty trend",
    "text": "Or wait... Headlines Brand Innovation Formulation & Science Packaging & Design Business & Financial Market Trends Regulation & Safety Promotional Features Site Archive Multimedia Regions All Asia-Pacific South East Asia South Asia East Asia Oceania Site Archive Multimedia Hot topics Clean & Ethical Beauty Sustainability COVID-19 Market Entry Anti-Aging / Skin Whitening Beauty From Within Nanotechnology Green Cosmetics Site Archive Multimedia Resources Type of resources Events All Events Shows & Conferences Online Events Editorial Webinars Events China 中国 Podcast  23-Dec-2020\n                            - Last updated on\n                                23-Dec-2020 at 01:32 GMT Related tags\nAustralia\nSouth korea\nk beauty\nMask This comes after the recent launch of Jelly Ko’s Bubble Tea Steam Cream, a moisturising cream​ inspired by the popular drink. Style Story distributes over 40 Korean brands including Laneige, Innisfree, and Etude House. According to Style Story’s founder Lauren Lee, the inspiration for the sleeping mask came from cherry blossoms, which bloom only two weeks every year. “They remind us how fleeting life and happiness can be and that we should savour and enjoy every moment​.” The situation is fitting as the COVID-19 pandemic continues to spread worldwide. In addition, “Sleeping masks are a great ritual to indulge in several nights a week because you can take a moment out of your day to focus on self care​.” The sleeping mask contains real cherry blossom extract which is rich in essential fatty acids to promote smooth and supple skin, as well as an antioxidant for soothing properties. The mask is in a jelly format, different from sleeping masks in the market which are usually cream-based. Lee said cream-based formulas were not suitable for all skin types, “We wanted to perfect a light jelly texture that would work in a wider variety of climates and for more skin types. Our (jelly) texture is ideal for hotter climates like Australia and South East Asia and for people with oilier and combination skin as well​.” “This unique jelly formula goes to work overnight as you sleep to create bouncy, jelly skin the next morning. We've also created a jelly-like silicone face mask brush to use with it, which contributes to the feeling of doing a day-spa ritual at home​,” she added. According to Lee, jelly skin is touted as the biggest K-beauty trend in 2021. She explained: “Jelly skin is skin that is bouncy, soft, transparent and looks positively squishable, just like jelly. To create jelly skin, it's important that the skin is smooth and clear, so focus on products that are very hydrating and care for concerns like dark spots, dull skin, fine lines and wrinkles.​” Lee said this trend was driven by “People increasingly wearing less makeup as they are working from home, which means the focus is more on skin care. If you have a Zoom call, you want to look fresh and healthy even if you aren't wearing makeup​.” “Unlike other skin care products, sleeping masks really need to make a visible difference to the skin when you wake up the next day, so they need to go the distance while you're asleep​.” Past K-beauty trends according to Lee were Glass Skin (skin that is as smooth as a pane of glass) and Puppy Dog Eyes (an eye makeup trend involving bottom-heavy liner to make the eyes appear larger and rounder in contrast to the traditional cat eye). Lee told us the R&D for the sleeping mask took more than a year, “we wanted to strike the right balance between a formula that felt lightweight but also very hydrating at the same time.​” Other ingredients in the sleeping mask include niacinamide for improving uneven skin tone, vitamin B5 (panthenol) to protect the skin barrier from environmental stress, sodium hyaluronate, allantoin, betaine, and adenosine for their hydrating and soothing properties The sleeping mask is free from alcohol, silicone, essential oils, mineral oil, sulfate detergents, parabens, urea, DEA, PEGs, TEA or phthalates. Jelly Ko’s sleeping mask is ideal for use two to three times a week on the face and neck, at the last step of the night skin care routine. The sleeping mask is formulated, manufactured, designed and packaged in South Korea. It is currently available on Style Story’s online store. The retailer is searching for international stockists. Style Story is planning to launch two more products under the Jelly Ko brand early 2021. Copyright - Unless otherwise stated all contents of this web site are © 2023 - William Reed Ltd - All Rights Reserved - Full details for the use of materials on this site can be found in the Terms & Conditions Related topics\nBrand Innovation\nMarket Trends\nAll Asia-Pacific\nOceania\nMarket Entry\nAsia in Focus\nSkin Care Show more  Content provided by Provital | 13-Jun-2023\n                     | Product Brochure Circanblue™ is a vegan postbiotic ingredient obtained from Lactococcus lactis that induces a resynchronisation of the skin’s circadian cycle after this... More promotional features ",
    "datetime": null,
    "url": "https://www.cosmeticsdesign-asia.com/Article/2020/12/23/Jelly-skin-Australian-retailer-Style-Story-rolls-out-sleeping-mask-to-tap-K-beauty-trend"
}