{
    "title": "\"Jello Skin\": Korea’s beauty routine that promotes firm and plump skin - Premium Beauty News",
    "text": "K-beauty - or Korean beauty - remains one of the major drivers of the beauty trends that land thick and fast on TikTok. The latest in line is a new viral skincare trend called \"Jello Skin.\" \"Jello Skin\" evidently refers to Jell-O, the brightly coloured gelatine dessert well known in the US and Canada. The account of TikTok influencer @glowwithava, who regularly shares tips and tricks with her 1.4 million followers, has become somewhat emblematic of this viral skincare trend - so much so that she even labels her various accounts with the #jelloskin hashtag - a hashtag that counts no less than 14.2 million views on TikTok. However, before being a beauty routine, \"Jello Skin\" is a way to describe firm, plump skin - bouncy like gelatin - and the many tips and tricks straight from Korea to achieve it. And, according to @glowwithava, it’s all about one thing: collagen. In other words, if you want to have \"Jello Skin,\" you need to boost your production of collagen, a protein that slows down the effects of skin aging, but which gradually diminishes after the age of 30. According to the TikToker, diet, exercise, massage and skincare need to be mixed to get this firm and plump, almost bouncy-looking skin. A trends that eventually refers to the underlaying holistic beauty movement, which can be defined as taking an all-encompassing approach to beauty, from the inside out. Some of the things that @glowwithava advocates are adding collagen powder to one’s yogurt at breakfast, applying sunscreen daily, exercising, or even applying masks with specific ingredients. But that’s not all. To boost collagen production, again according to the influencer, it is also necessary to eat foods rich in vitamin C (red fruits, citrus fruits, certain green vegetables, or even certain cereals), to perform facial massages — with or without specific tools — and, of course, to use cosmetics enriched with anti-aging ingredients. A trend that seems to be gaining more and more followers around the world. Portfolio The annual premium and luxury packaging trade show broke its attendance record for its 2023 edition, which was held... The expression “Beauty Tech & Skincare” now marks the entry of tech into the beauty sector. Several major brands offer to decode the... The quest for youth has existed for centuries, despite the inevitable effects of time on the body. Research shows that skin aging in... The quest for “in-and-out” beauty is gradually gaining ground in Europe, North America, and Brazil. This form of holistic beauty is meant... © 2023 Premium Beauty Media ",
    "datetime": null,
    "url": "https://www.premiumbeautynews.com/en/jello-skin-korea-s-beauty-routine,20312"
}