{
    "title": "Jessica Jung Korean Beauty Skincare Routine | Teen Vogue",
    "text": "By Sarah Wu As beauty trends go, K-beauty isn’t particularly known for lending itself to a pared-down routine. Cool and innovative? Definitely. Time-saving? Usually, not so much. After all, it’s the movement that brought us the 11-step skincare routine, which isn’t exactly conducive to sleeping in. We will say, though, that K-beauty never fails to deliver amazing results, which is why we’re always looking to the pros for the latest products and hacks we have to know. So when Jessica Jung took to Vogue’s YouTube to share her (16-step!) routine, we were instantly mesmerized. Who better to break it down than a K-pop star and beauty guru, right? Here’s what we learned after watching her go through her morning routine: it’s heavy on skincare from a brand called Blanc & Eclare, which stocks K-beauty standbys like sheet masks and ampoules. We also now know that it’s totally encouraged – especially for those who long to live like K-pop royalty – to start your day by spraying your favorite skin mist liberally, and not just on your face! “On flights or where it’s really dry, I spray it all over the place,” she explains. Her makeup leans toward subtle, neutral shades that are easy to apply and basically impossible to mess up. A few of her favorites include the budge-proof L’Oréal Paris Colour Riche Eyeliner in Black, NARS Blush in Miss Liberty, and Giorgio Armani Rouge Ecstasy Express Moisture Rich Lipcolor in Flesh. In other words, there’s a nice balance of drugstore and high-end, so you don’t have to worry about splurging too much if you see something you like. Check out the video for the rest of her beauty hacks! We might not be incorporating all 16 into our daily rotations, but thanks to the rising temps, we’ll definitely be trying that skin mist tip ASAP. Related: I Traded My Lazy-Girl Beauty Routine for an 11-Step Korean Skincare Regimen By Kara Nesvig By Teen Vogue Style Team By Shauna Beni-Haynes By Sara Delgado More from Teen Vogue Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Teen Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "datetime": "2016-08-01T20:37:20.920Z",
    "url": "https://www.teenvogue.com/story/jessica-jung-korean-beauty-routine"
}