{
    "title": "JOAH – a color cosmetics brand inspired by K beauty – launches at CVS",
    "text": "Or wait... Headlines Brand Innovation Formulation & Science Packaging & Design Business & Financial Market Trends Regulation & Safety Promotional Features Site Archive Multimedia Hot Topics Companies looking to the future Consumer insights Formulation research Retail and DTC Sustainability Technology and Platforms Trends and Emerging Markets Expert Viewpoints Site Archive Multimedia Resources Type of resources Events All Events Shows & Conferences Online Events Editorial Webinars Events  06-Aug-2018\n                            - Last updated on\n                                06-Aug-2018 at 15:21 GMT Explaining how the brand is translating Korean skin care into a color cosmetics collection, Annette DeVita-Goldstein, senior vice president of global marketing at KISS Products, tells the press, “For JOAH, the K-beauty philosophy is our inspiration.”​ “We wanted to bring the caliber of innovation and state-of-the-art formulations that Korean beauty skincare is known for to the world of color cosmetics,” ​​says DeVita-Goldstein in a media release about the newly launched makeup line. The collection ​​ The JOAH product line is made up of 158 SKUs across eyes, lips, brows, complexion, and brushes; and is priced between $2.99 and $15.99. According to the media release, the collection includes 4 liquid eyeliners, 6 gel eyeliners, and an auto eyeliner. There are 4 different mascaras and 2 eyeshadow palettes. Brow products come in 5 different pencil formats and several colors. Complexion products in the JOAH line include 2 primers, 11 concealers, 8 liquid foundations, 3 cushion foundations, 4 BB creams, 3 setting powders, and 2 makeup setting sprays. There’s a highlighter, a bronzer, and a couple of contouring palettes. And there is a bit of skin care in the JOAH collection too: 3 masks, makeup wipes, and wipes to remove eye and lip makeup. “These phenomenal products are fun and easy to use, while delivering great color payoff, sophisticated finishes and effects,” ​DeVita-Goldstein tells the press. “We are thrilled to partner with CVS, the ideal K-beauty destination, to introduce JOAH to our consumers.”​ The location ​ Last year CVS teamed up with Alicia Yoon, founder of Peach & Lily to bring K beauty in to the store, as Cosmetics Design reported​. And this latest product launch seems to be an extension of that initiative: “​We're excited to exclusively launch JOAH, a brand that mirrors CVS Pharmacy's belief in having fun with beauty,”​ Andrea Harrison, senior director and divisional merchandising manager of beauty at CVS Pharmacy, says in the media release. “We continue to find new ways to expand upon our current beauty offerings, particularly when it comes to K-beauty inspired brands like JOAH that encourage playful exploration through cosmetics.”​ ---​ Deanna Utroske, CosmeticsDesign.com Editor, covers beauty business news in the Americas region and publishes the weekly Indie Beauty Profile column, showcasing the inspiring work of entrepreneurs and innovative brands. ​ Copyright - Unless otherwise stated all contents of this web site are © 2023 - William Reed Ltd - All Rights Reserved - Full details for the use of materials on this site can be found in the Terms & Conditions Related topics\nMarket Trends\nSkin Care\nColor Cosmetics Show more  Content provided by Acme-Hardesty Company | 11-Oct-2023\n                     | White Paper Sharomix™ EG10, a versatile broad-spectrum antimicrobial liquid blend for preserving personal care products, ensures safety at usage levels ranging from...  Content provided by Acme-Hardesty Company | 07-Jul-2023\n                     | Product Brochure Acme-Hardesty’s latest expansion into Canada includes Resplanta®, Botaneco®, and BYK from our partners Sharon Personal Care and Eckart Effect Pigments...  Content provided by Covation Bio™ PDO | 22-Jun-2023\n                     | White Paper Zemea® propanediol is a 100% plant-based humectant and solvent that’s easy on skin and the planet. This single, natural ingredient boosts moisturization...  Content provided by Horphag Research | 10-Apr-2023\n                     | White Paper Pycnogenol® has 25+ clinical studies demonstrating its active properties for oral and topical skincare formulations. Results show the antioxidant stimulates... On-demand webinars More promotional features ",
    "datetime": null,
    "url": "https://www.cosmeticsdesign.com/Article/2018/08/06/JOAH-a-color-cosmetics-brand-inspired-by-K-beauty-launches-at-CVS"
}