{
    "title": "Johnny K was larger than life",
    "text": "  His widow, Laura Prentice, recalls Toronto restaurateur John Katsuras, who died Sept. 28 at age 60. His widow, Laura Prentice, recalls Toronto restaurateur John Katsuras, who died Sept. 28 at age 60. This article is over a year old, and the information within may be out of date. John Katsuras with daughter Kevi and wife Laura Prentice. When he wasn’t smiling, John Katsuras was laughing. It was strange, really. If you visited one of the restaurants he ran with wife and chef Laura Prentice over the past 30 years, his grin was a fixture, as steadfast as her exquisite cooking, the flawless service and the moody atmosphere.  I can still see Johnny K, as friends called him, beaming in a white jacket at the entrance to Gus, a sprawling bistro that would morph into a nightclub as the skies darkened over Bay St. I can still see him perched at the bar, sipping a beer from the bottle at The Playpen, the last joint he opened in 2011. “He was never afraid to try anything,” says Laura as we meet for lunch at Globe Bistro, a few days after the funeral. “The only thing he was afraid of was leaving me and my daughter.” Her voice trails off. We blink back tears. They met in 1977. Disco had infiltrated the city and Johnny, then 23, had just returned from a trip to the French Riviera. He wanted to animate Toronto with the same nocturnal glitz of Saint Tropez. He wanted his city to be fabulous. One night, inside a midtown club called Hippopotamus, their eyes met and Johnny’s smile was practically a high beam, outshining the strobe lights. As if in a trance, Laura stepped toward it. She would never step back. They swayed to Donna Summer’s “Last Dance.” They became best friends and, soon, a romance bloomed. For the next 37 years, they were inseparable, one of this city’s great love stories. From the start, Johnny followed his own instincts, even when they ran counter to prevailing wisdom. When he opened Pan on the Danforth in 1994, he wanted to nudge the area’s Greek cuisine in a new direction. So he banned souvlaki from the menu, a decision that baffled some and intrigued others, including Mick Jagger, who quietly returned more than once for the sea bass. The following year, they opened Lolita’s Lust across the street. “Lolita” was Laura’s nickname. So she objected to this venue moniker on the reasonable grounds that it was embarrassing. Johnny laughed. He said it was the perfect name. Besides, he added, there wouldn’t be a sign out front. Instead, he just painted the entire building green. This was the pioneering vision that powered so many of their places, a list that included Queen Street Eatery, Tazmanian Ballroom, Krush, Tomi-Kro, Johnny K and The Liberty, which opened in 1989 as Johnny was recovering from a serious car accident, one that no doubt conjured a haunting childhood memory. It was Christmas Eve, 1970. Johnny was 15, at home with his mother Voula and two younger brothers. There was a knock on the door. When Johnny answered, a policeman relayed unthinkable news. His father had been killed in a car accident. Johnny never talked about this heartbreak. But losing his father as a boy clearly left a sense of transience in the man. Johnny was obsessed with reinvention. He was terrified of getting stale. His feet, sometimes clad in gold Hugo Boss runway shoes that only he could pull off, were always moving. But even as he marched ahead, into the unknown, he was mindful of the past. His restaurants were filled with vintage artifacts from thrift shops. The Art Deco light fixtures inside The Playpen came from the Imperial Oil building on St. Clair. “A place needs to have soul,” he would say. “Otherwise, what’s the point?” As new restaurants opened with seven-figure renovations, Johnny hunted for this elusive soul. As the industry became more corporate, with faceless investors and backers, the couple financed their own ventures. This could be stressful. But in those moments, Johnny never lost his focus or his passion for the theatrics of running a restaurant: the energy, the excitement, the interesting people. “Before we opened the doors each night,” recalls Laura. “He would smile and say, ‘It’s show time.’” When he wasn’t at work, Johnny listened to music. His tastes were eclectic, including Roy Orbison, Kid Rock, Lou Reed, Grace Jones, Bruno Mars and P. Diddy. He devoured certain movies multiple times, including The Godfather, Saturday Night Fever and The Bourne Supremacy series. One of his great joys was watching goofy films, like Dumb and Dumber, with beloved daughter Kevi. He could play backgammon for hours on a beach. He loved the ocean, especially sailing the Caribbean with friends and Laura by his side. Until cancer claimed his life on Sept. 28, at the age of 60, few in the city lived with the same intensity. “I don’t think it’s really hit us yet,” says Laura, who went through her own struggle with cancer in 2002. “He was larger than life. He touched so many people. Where I go without him, I don’t know. I have no idea.” Before a celebration of his life last week, Laura wrote Johnny a final letter. It ended with the following: “I will miss you so much. Nothing will taste the same without you. I’ll see you on a beautiful beach one day with a Miller High Life and we’ll dance.” vmenon@thestar.ca Vinay Menon\nis the Star’s pop culture columnist based in Toronto. Follow him on\nTwitter: @vinaymenon. Anyone can read Conversations, but to contribute, you should be a registered Torstar account holder. If you do not yet have a Torstar account, you can create one now (it is free). To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation Save $85 with our best offer. Cancel Anytime. It means the world to us that you choose to read our brand of trusted news. And as long as you continue to do so, we’ll continue to show you we appreciate it. Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:       Sign up with  Thank you . Your account has been registered, and you are now logged in. Check your email for details. Invalid password or account does not exist Sign in with Submitting this form below will send a message to your email with a link to change your password. An email message containing instructions on how to reset your password has been sent to the email address listed on your account. No promotional rates found.    Secure & Encrypted Secure transaction.\nSecure transaction. Cancel anytime.  Thank you. Your gift purchase was successful!\nYour purchase was successful, and you are now logged in. You will also start receiving the Star’s free morning newsletter, First Up, soon. A receipt was sent to your email. ",
    "datetime": null,
    "url": "https://www.thestar.com/entertainment/johnny-k-was-larger-than-life/article_65c77a67-f5f3-5a47-86dc-b5a34332e8cc.html"
}