{
    "title": "Johnny Weir's Favorite K-Beauty Products Picked Up at the 2018 Olympics",
    "text": "Every item on this page was chosen by an ELLE editor. We may earn commission on some of the items you choose to buy. While in South Korea as a primetime NBC figure skating analyst for the 2018 Winter Games, Olympian Johnny Weir has posted tons of face-mask selfies and beauty snaps to his fleeting Instagram story. Every night, it seems, he's experimenting with new SoKo products that leave his skin looking fresh after a long day in the broadcast booth alongside BFF and fellow commentator Tara Lipinski. With the women's individual skating events in full swing, Weir's hours can get long and tiring (plus, he gets hair and make-up done everyday!), so a solid beauty routine is vital. ELLE.com caught up with the two-time Olympian in PyeongChang to get the inside scoop on maintaining moisturized, glowing skin in the Korean winter with his favorite local beauty products. \"This incredible cleanser helps get all sixteen inches of broadcast makeup off in one go and protect[s] my skin for the next day,\" Weir  said of this product made with egg yolk extract. It's Skin Eggshell Cleanser, $3; koreadepart.com SHOP \"These eye masks are special because they brighten my tired eyes after an all-nighter of studying skater biographies,\" he explained. Laneige Intensive Eye Mask, $11.90; laneige.com SHOP \"I ran out of my usual body cream while [in South Korea] and have fallen in love with this body cream,\" Weir said of the snail mucin-infused product that lightens dark spots on the surface of skin, \"The snail essence somehow keeps my skin hydrated even in the harsh cold of South Korean winter.\" It's Skin Créme Ginseng D'Escargot, $40; amazon.com SHOP This spot treatment with torreya seed oil (known to help troubled skin) calms breakouts in-the-moment—a necessity for Weir's NBC primetime appearances. \"If something unfortunate pops up and you’re performing for millions of people every night on NBC, this corrector helps shrink and heal the problem,\" Weir enthused. Innisfree Bija Trouble Spot Treatment, $17; innisfreeworld.com SHOP \"I’m not entirely sure why snail is so effective but this mask gives me the plumpness we all deserve!\" Weird said. The Saem Snail Mask, $1; masksheets.com SHOP These serum-soaked cotton gloves hydrate and nourish dry skin in cold weather—perfect for PyeongChang, where temperatures can drop to the low-teens. \"Every morning during hair and makeup I use these masks on my paws so when I’m high-fiving people over a perfect Olympic performance, they come away with a soft first impression!\" Weir shared. The Face Shop Rich Hand Special Care Hand Mask $3; thefaceshop.ca SHOP Rose is a Senior Editor at ELLE overseeing features and projects about women's issues. She is an accomplished and compassionate storyteller and editor who excels in obtaining exclusive interviews and unearthing compelling features. 13 Best Japanese Skin Care Products to Shop Amazon Is Having a Major Beauty Sale Right Now Why Matrix Could Be the Next Best Skin Treatment Claudia Sulewski Launches CYKLAR First Class Beauty 2023 The 14 Best Expert-Approved Setting Sprays Austin Butler Doesn’t Think He’s a Beauty Icon Jelly Nails Are Back and Better Than Ever The Best Spring 2024 Beauty Trends to Try Now Add These K-Beauty Prime Day Deals to Your Cart The 20 Best Pore Minimizers for Baby-Smooth Skin Laneige’s Lip Sleeping Mask is on Sale Again A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2018-02-21T17:41:00Z",
    "url": "https://www.elle.com/beauty/makeup-skin-care/g18242562/johnny-weir-favorite-korean-beauty-products/"
}