{
    "title": "Jude Chao’s K-Beauty Skin Care Routine",
    "text": " Things you buy through our links may earn Vox Media a commission K-Beautiful: Helping you navigate Korean beauty in 2019. K-Beautiful: Helping you navigate Korean beauty in 2019. Want more skin care? Join our Facebook Group, the Beauty of It All. A few years ago, Jude Chao wrote an essay for Fashionista about how Korean skin care helps her cope with her depression. Today, she still relies on her beauty routine to help her feel grounded, although she knows it’s complicated: “There’s a lot that’s problematic about beauty capitalism and beauty standards, but I find a ton of value for myself in the act of caring for my appearance and feeling good about the way I look,” she says. Chao is the digital marketing director of Holy Snails, a small-batch skin-care company known for its popular Shark Sauce serum. She first found K-beauty through skin-care forums like Reddit’s r/skincareaddiction. “K-beauty, and Asian beauty in general, offer so many more targeted options for taking care of skin, and the competitiveness of the markets means it’s much easier and more budget-friendly to build a really customized and complete skin-care routine than it is using only Western products,” she explains. At the beginning of her own skin-care addiction, Chao had “a couple of decades” of damage to undo. “I tanned a lot in my twenties, especially during one lost year when I worked at a tanning salon and used the UVA tanning beds all the time.” Plus, she smoked, regularly used harsh exfoliators and cleansers, and the only sunscreen her skin saw was a pea-size dab of SPF 15. All of those habits are gone now, and she’s focused on holding onto her skin’s elasticity and adding in plenty of hydration and moisture for a surface glow. Chao’s skin-care rules are simple: Cleansers should be low pH, essences and serums should be easy to layer, and sunscreens should be lightweight and nongreasy enough to use in generous amounts without a white cast. Read on for her favorite cleansing water, the moisture cream she relies on with real donkey milk, and her “Holy Grail” snail cream. A post shared by The Cut (@thecut) “I normally wear a non-waterproof sunscreen and very minimal makeup, so I don’t usually feel the need for a cleansing oil anymore. Instead, I remove makeup and loosen up sunscreen at night with a cleansing water like this one, which takes off my everyday products quickly and gently. (A cleansing water and a micellar water are the same thing really, just different marketing terms.)” “I’ve fallen hard and fast for this cleanser. It was sent to me by the brand owner, who’s a good friend. Little flakes of green tea leaves provide some very gentle exfoliation, while the bouncy gel cleanser glides easily over skin and rinses off easily too. This cleanser leaves my face soft and clean, never tight or irritated after washing. I use this morning and night.” “After cleansing, I like to soften and prepare my skin for subsequent layers with a watery first-step product like a fermentation essence or light serum. Meant to be applied immediately after cleansing, this one has been a favorite of mine for a couple of years. It’s inspired by traditional Korean herbal medicine, and the formula contains extracts from a variety of herbs that work to stimulate circulation and protect skin from damage. Long-term use of this gives my cheeks a rosy glow, like I habitually get enough sleep and exercise, even though I totally don’t. It’s one of the few luxury products I consider truly worth it.” “I’m a huge fan of Asian toners. Thicker than water with a pleasant slip, these products come packed with humectants to bind water to skin, creating a plumping and glow-boosting effect that helps keep skin at its best. The Haruharu WONDER Black Rice Toner is the perfect weight for layering: hearty enough to really hydrate skin, but light enough to feel like nothing under more layers of skin care. And the soft lavender scent is wonderfully calming.” “I never, ever go without my COSRX snail. Made with 96 percent purified snail mucin sourced from humanely treated snails, this emollient and amino acid-rich product smoothes the surface of my skin, soothes irritation, speeds up healing time of any blemishes I get, and may help repair UV damage as well. This must be my twelfth bottle of this stuff, if not more! I use four pumps every night and take it all the way down to my chest with the rest of my skin care.” “This serum has been a revelation to me from the first week I used it. I’m used to relying on strong actives like tretinoin for anti-aging, but in summer I prefer to step back from photosensitizing actives like retinoids and AHAs, which make skin more prone to UV damage if not protected adequately. I started by using this on my neck, where I’d started to notice a little crepiness. It tightened up that problem area in a flash. I’m in love. The fact that it’s thin and fast-absorbing is an additional bonus.” “As you can see, layers of hydration are key to my evening skincare routine, so I always want at least one watery serum in the mix, to continue the work of filling out the upper layers of my skin with humectants for a really plumped and bouncy look. I like to layer up on serums so that my skin can gain the benefits of a wider variety of ingredients and double up on hydration. This serum contains black-rice extracts and liposomal ginseng for additional antioxidant and brightening benefits, and the watery gel consistency feels perfect in hot weather.” “I use a sheet mask almost every night. I’ve found that regular use really maxes out my skin’s hydration levels; my skin looks duller and less elastic when I skip them for too long. These masks by Taiwanese brand Annie’s Way are pretty much my ideal of masks. The ultra-thin and soft silk material clings perfectly to skin, creating optimal conditions for absorption of the calming, hydrating mask serum. These leave my complexion bouncy and bright every time.” “I accidentally discovered how great the cream version of COSRX’s snail essence is as eye cream early this year, and I haven’t wanted any other eye cream ever since. This cream has smoothed away the fine lines I used to have under my eyes and tightened up a bit of crepiness I’d started to notice on my upper eyelids. It’s light enough that it doesn’t mess up my lash extensions or cause eye makeup to slide around, and it’s dead cheap. Holy Grail material for sure.” “This is simply one of the most perfect moisturizing creams I’ve ever used. The vitamin and lipid content in the real donkey milk in this cream help enhance this barrier-strengthening moisturizer, which keeps my skin feeling soft and healthy. When my skin is overexfoliated or sensitive, it restores my barrier within days. I can tell because itching, tightness, and sensitivity go away and my skin holds onto moisture better. Over time, it delivers a beautiful brightening and skin tone-evening effect. It’s rich enough for my drier days but never greasy or heavy feeling. And it’s been discontinued. The brand has agreed to bring it back if it gets enough presales, so that’s where the link to this one leads.” By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us. Things you buy through our links may earn Vox Media a commission                 ",
    "datetime": "2019-08-13T12:11:25.183-04:00",
    "url": "https://www.thecut.com/article/jude-chao-k-beauty-skin-care-routine.html"
}