{
    "title": "Julep’s Original K-Beauty Guru: Jane Park | Vanity Fair",
    "text": "To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. By SunHee Grinnell A Yale Law School graduate and former Starbucks executive, Jane Park found herself ready for a change in 2007, but what she wound up with was an entire beauty empire. Park created Julep for all the women who wanted to give their shy sides a chance to break out of their shells. After years of tenacity and hard work, Park turned Julep into one of the best selling brands at Ulta and QVC, raised over $30 million in funding, and in 2016 the company was acquired by Glansaol, however, she still runs the brand tirelessly. We sat down with persevering Park and went down memory lane to find out how it all began and who she has become today. Left: Julep Depuffing Gel Eye Cream and Pressed Serum Daily Moisturizer, launching this spring. Right: Julep Cushion Complexion. Photos courtesy of Julep. Where did you grow up? I was born in Seoul, South Korea, but I grew up in Toronto, Canada where my parents and I immigrated when I was four. My dad was a Korean War refugee who lost his parents when he was ten. The border between North and South Korea went up permanently one day when he was walking home from school. His house was on the other side, so he never saw his parents again. My dad says that he had to be an entrepreneur from that moment on. It’s what gave him the courage to reinvent his life—as an immigrant moving to a new land, and in business. My parents had a corner convenience store when I was growing up. Then my dad went to work for a framing business for free to learn the ropes. Eventually, my parents opened up three framing and art stores, and they finally had Sundays off! Where do you live and work? Julep is based in Seattle, the perfect mix of consumer-loving retail (Starbucks, Nordstrom, Costco) and technology (Microsoft, Amazon). I love living just up the street from our offices. If it wasn’t for the very steep hill in between, I could walk to work! The name of your brand, Julep, does it have a meaning? Julep is about celebrating girlfriends and coming together, and there's nothing that brings women together quite like a great cocktail! Tell you us briefly how you went from law school to business school to becoming a beauty entrepreneur? The common thread that weaves throughout everything I do professionally and personally is my focus on empowering women. The politics of gender was a primary focus for me in undergrad and law school, and it’s this lens that I bring to beauty. How should women define beauty differently so that there is more space in the world for us?  In our most recent campaign, a woman is literally fist-fighting her way through daily challenges— and overcoming it all with grace. That’s what real beauty is all about. Before Julep the skincare and makeup brand, is it true that you started with a nail and facial salon in 2007? Yes!  We started with skincare and nails, and added makeup afterwards. I started off this way because how we operate as a business is as important to me as what we create. When I started Julep Parlors in 2007, I created nail polish without carcinogens like formaldehyde and focused on the workplace for women, providing health care benefits and making sure they didn't have to breathe in toxic fumes and dust that gets lodged in their lungs permanently. By Charlotte Klein By Eve Batey By Bess Levin And it’s been so rewarding to introduce K-beauty to our customers through our Julep facials. I've been Korean my whole life, but this is the first time my background is trending in the beauty landscape! It’s a really exciting time. Julep Lip Family. Photo courtesy of Julep. You launched Julep, the brand, in 2008 via e-commerce. What was your drive to do this? What was the opportunity that you saw at the time that felt timely? At our core, Julep has always been about innovation—about doing things differently.  Back in 2008, we were constantly creating new products for our parlor guests, then we started winning awards and getting national press. And then women from around the country started calling us. Our first e-commerce store was a Yahoo e-commerce solution that I put up myself overnight for $20 a month. Based on the enormous growth and repeat purchases we were able to demonstrate by starting off that way, I was able to raise venture capital funds to build a more robust and engaging online experience. Can you share with us how the last ten years have changed you? By Charlotte Klein By Eve Batey By Bess Levin I've learned to lean into connection even more than ever before.  When you're an entrepreneur, trying new things all the time, you are going to come across some dead ends, make some mistakes, learn that you need to pivot. In those moments when I'm feeling \"not good enough\", I've learned that I've got to pick up the phone and call a trusted friend who can help me find my way back to myself. I fully believe in what Brene Brown says, that shame can't survive empathy. Who is Jane Park now? I’m still learning that and figuring it out! I still don't know what I want to be when I grow up. As long as I'm learning and engaged, that is enough. Who is the Julep girl or woman and what is the brand's philosophy? The Julep woman enjoys the challenge of figuring out the puzzle that is life. She seizes the opportunity to overcome whatever is thrown her way, and celebrates other women doing the same. At Julep, we want to inspire and encourage women to stay engaged and to always try something new. I believe that life begins at the end of our comfort zones. Since I'm not a professional makeup artist, I design all of our products to be effective yet effortless to use, giving women freedom to explore. I want women to enjoy that sense of play and discovery with every Julep product. Julep Sheet Mask, launching this spring and Julep Restorative Facial Milk. Photos courtesy of Julep. By Charlotte Klein By Eve Batey By Bess Levin What are the pros and cons, if any, of being acquired by Glanasol? Is it a big relief of help to cast a bigger, a faster and a wider net? As with parenting, every stage of growing a company has its unique joys and challenges.  What's been incredible about Glansaol is getting to know the founders of Laura Geller and Clark's Botanicals. Laura and Francesco [Clark] are such inspirations to me. What other big plans do you have for Julep? Are you able to share? And can you tell us about your solid serum sticks due out this spring? So genius! You will continue to see lots of product innovation from Julep that brings women on-trend beauty in an effortless way. I'm a huge fan of stick formulas—in cheeks, eyes, and more recently in skincare. They’re so convenient and perfect for on the go! That’s why I’m so excited to launch our pressed serum sticks this spring. There are two ultra-concentrated formulas—one for daytime and one for night. These innovative sticks streamline your serum and moisturizer steps into one. They provide essential daily hydration with Sodium Hyaluronate, which holds up to 1,000 times its weight in water, and helps defend skin’s natural barrier with Ceramides. As with all our products, these pressed serums require minimal effort while giving you maximum skin benefits. What would you give to a young beauty entrepreneur? The advice I would give any entrepreneur is to figure out WHY you are doing what you are doing and come back to that constantly—especially in the hard moments. The only person who has to believe you is yourself.  You can't let negativity get in the way of your goals. No one knows what is in your heart but you, so you have to be enough. You can't believe your own hype or your worst detractors. Neither capture the totality of your experience. Your ability to see yourself fully is the best gift you can give you. That alone can power you through any challenge. By signing up you agree to our User Agreement and Privacy Policy & Cookie Statement. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. By Delia Cai By Rebecca Ford More from Vanity Fair Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Vanity Fair may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices CN Entertainment ",
    "datetime": "2017-12-20T18:39:24.246Z",
    "url": "https://www.vanityfair.com/style/2017/12/juleps-original-k-beauty-guru-jane-park"
}