{
    "title": "Justified's Erica Tazel on Her Beauty Routine and What's Up Next | Allure",
    "text": "By Stephanie Saltzman Justified, which ended its six-season run this week, was a show populated by indelible types: swaggering lawmen and silver-tongued bad guys operating by their own moral code and a fleet of memorable female crime bosses—and crime bosses in training—redefining the cliché of the Southern belle. And then there was Rachel Brooks, played by actress Erica Tazel as a steady, clear-eyed U.S. Marshal. Rachel may not have had quite as many memorable lines as Raylon Givens or Boyd Crowder, but she was in many ways the moral center of show, never bending the rules to suit her own agenda. I got a chance to ask Tazel some questions about being part of an iconic cast, plus all the secrets behind her luminous skin. What's up next for you now that Justified has ended? \"I'm in Alabama at the moment shooting a film. It's a beautiful story about love, loss, healing, and redemption. Then I will be heading back to L.A. to shoot an independent movie in which human trafficking is front and center. I'm also in the midst of working on my first live-action video game. I am always thrilled to delve into something new and different. But I loved working in television, so I'm also looking for the perfect follow-up to Justified.\" What was your favorite thing about playing Rachel on Justified? \"I always called Rachel my first adult role. She was strong and opinionated and had a very specific point of view on life and her work. She also possessed a different type of vulnerability than many of my previous roles. She was never afraid to speak her mind, and I really loved that.\" Any funny behind-the-scenes stories or memories from the show? \"There are too many funny stories to count! It never got old having the Marshals play Elmore's language as different people. One that comes to mind: We were in the conference room in the Marshals' office. I played the conversation as an African princess from the Congo; Nick [Searcy], who plays Art, was Stallone; Jacob [Pitts], who plays Gutterson, was Owen Wilson; and Tim [Olyphant], who plays Raylan, was a surfer dude.\" What's the best beauty tip you learned while on set? \"Moisturizing and sunscreen are essential. So much is shot in HD now, and it's not very forgiving. It shows everything! Even if you have flawless skin, it will find something.\" What's your skin-care routine like? \"I get a facial pretty religiously every four weeks. I go to Kate Somerville Skin Health Experts in Los Angeles. Every morning begins with deep cleansing and moisturizing. Depending on the day, the evening ends with a slightly modified version of the morning routine. I love the Aveeno Daily Cleansing Pads and Neutrogena Acne Stress Control Power Cream Wash.\" What about your hair routine? \"For my hair, I love pretty much everything in the KeraCare line. I also love the Moroccanoil Intense Hydrating Mask and Glimmer Shine Spray. It's not too oily.\" Makeup? \"I don't wear a lot of makeup outside of work. Mary Kay Medium Coverage Foundation in Bronze is one of the few foundations that doesn't feel heavy on my skin and that I don't have to mix with a million other things to find a match. I also love their shadows. Maybelline does it for me for mascara—particularly Great Lash. I recently discovered the Voluminous [Manga Mascara] Black Angel, and I'm loving that. I am also a fan of__ Ladybug Jane lip balms__ and the very reliable Vaseline Lip Therapy.\" Do you have any beauty regrets? \"I had a great colorist when I lived in New York City. But there was a time when I needed my hair done pretty urgently, and she was going to be out for a while. I let her boss do it, and I had very orange hair until I decided to shave it all off and start over. I regret not waiting until [my regular colorist] got back to the salon.\" What's the best beauty advice you've ever gotten? \"It's pretty basic: Drink lots of water, and get as much rest as possible.\" What beauty icon or icons inspire you most? \"The natural beauty of Pam Grier and Lola Falana stand out for me. The classic stylings of Cate Blanchett and Jessica Chastain inspire me, as do the bold stylings of Lupita Nyong'o and Kerry Washington.\" For more on celebrities, check out: • Justin Bieber Has a Man Bun Now • Rihanna Wore Purple Lipstick and Instagram Exploded • Janelle Monáe's Response to This Sexist Tweet Is Perfect By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Kara Nesvig By Kara Nesvig By Gabi Thorne By Gabi Thorne More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2015-04-16T14:00:00.000Z",
    "url": "https://www.allure.com/story/erica-tazel-justified"
}