{
    "title": "K Beauty gets a boost; Seoul looks to make its mark on the global beauty and fashion market with new US$168 million project - Global Cosmetics News",
    "text": "TRENDING: Posted by Louise Prance-Miles | Apr 14, 2022 | Asia & Australasia, Manufacturing, Marketing, Products | THE WHAT? Seoul is looking to make its mark on the global beauty and fashion market with a new five-year project worth US$168 million, according to a report by Aju Business Daily. THE DETAILS As part of the plan, more beauty and fashion-related jobs will be created as well as new businesses which will benefit from tax benefits, loans and incentives. From 2023 Seoul will invest funds worth more than 100 billion won in small-and-medium-sized enterprises and startups in the fashion and beauty sector. Via government agencies, the city will also nurture 50 influencers and 200 experts, including brand managers, annually to promote K-beauty products. With Seoul setting up a special development zone for the beauty and fashion project in Dongdaemun, the project will also ease construction regulations for fashion brand operators in historic sites and old buildings. THE WHY? The popularity of K Beauty continues to boom worldwide, with exports of South Korean cosmetics products hitting a US $9.2 billion in 2021, a YOY increase of 21.5 percent from a year ago. Seoul Mayor Oh Se-hoon said, “We will improve Seoul’s beauty and fashion ecosystem and establish a virtuous cycle system with other fields by converting into tourism resources.” Share: Rate: LATEST NEWS Unilever settles in trademark dispute ov...   Walgreens to settle Rite Aid suit for US...   L’Occitane Q2 2024: Sales rise 17....   Two Target executives to retire   Gillette signs up for another season as ...   PRESS RELEASE: Society of Cosmetic Chemi...   L’Oreal to dump Decleor in derma shake-u...   Hermes Q3 2023: sales up 16 percent to €...   Amazon to face lawsuit over data trackin...   J-beauty retailer Yoshitsu to open store...  GLOBAL COSMETICS NEWS Contact UsSubscribePrivacy PolicyCookie PolicyTerms & Conditions SOCIAL MEDIA FacebookTwitterInstagramLinkedInSoundCloudRSSYouTube NEWS HomeAll Regions Cosmetics News WirePodcastOpinionFashionProfessional BeautyTravelWellnessTop 100 Brands Copyright © 2023 Global Cosmetics Media Limited ",
    "datetime": "2022-04-14T05:00:00+00:00",
    "url": "https://www.globalcosmeticsnews.com/k-beauty-gets-a-boost-seoul-looks-to-make-its-mark-on-the-global-beauty-and-fashion-market-with-new-us168-million-project/"
}