{
    "title": "K Road beauty has colourful past - NZ Herald",
    "text": "Share this article 115 year old former Family & Naval Hotel at 243 Karangahape Rd, which is now occupied by the Calendar Girls nightclub. A Karangahape Rd landmark building, the 115-year-old former Naval & Family tavern on the corner with Pitt St, is up for sale with a long-term lease in place to its current occupant, the Calendar Girls nightclub. The historic building is part of a portfolio of six Auckland properties owned by Davies Properties which are featured in Bayleys' latest Greater Auckland portfolio. The 726sq m three-level building on a 266sq m site at 243 Karangahape Rd is up for sale by deadline private treaty, closing March 12, through Nigel McNeill and Leah La Hood of Bayleys Auckland. The building has been owned by Andy Davies since 2003 and was extensively refurbished for occupation by Calendar Girls in 2011 including major interior alterations and additions plus an exterior repaint. The lease, running until October 2021, with three further 10-year rights of renewal, is producing net annual rental income of $230,000. \"Both the interior and the exterior of the building are in excellent condition but, longer term, the building will require seismic upgrading and is therefore expected to sell at a high yield,\" McNeill says. \"Andy Davies is also happy to consider trades or leave in some second-mortgage funding, if required, to help facilitate the sale. It represents a great opportunity for someone who is passionate about grand old character buildings, particularly as it comes with a very long lease in place - which is unusual for this type of property. \"The location of the property on a prominent corner site near the centre of bustling Karangahape Rd is also likely to be a major drawcard for investors with an eye to the future,\" says McNeill. \"This could well become a significant growth area given the proposed inner-city rail link's Karangahape Rd station, planned for Beresford Square adjacent to the Calendar Girls' building.\" The four-level structure comprises a 127sq m basement that is primarily used for storage and three levels above with various facilities including a gaming area with 18 poker machines, an open bar area with a stage and a number of private rooms. The property has a Historic Place Category 2 classification and an Auckland Council Heritage Category A-rating, meaning it cannot be demolished. According to the Historic Places Trust, the building was completed in 1896, replacing the original Naval Hotel timber building which burned down in 1894. The ornate rendered brick building was designed by prolific Auckland architect Arthur P. Wilson in a highly decorative Italianate-style characteristic of the late-Victorian era. Historic Places Trust records state that its visually impressive appearance reflects \"the prevailing desire of hotel owners to display their premises as useful additions to the streetscape at a time when supporters of alcohol prohibition held strong public backing\". Wilson designed many commercial buildings in central Auckland in the three decades from the late 1880s but 243 Karangahape Rd, the Strand Arcade and the Northern Steamship Company Building are among the few that remain. The building design featured a complex, multi-gabled roof line with three main gable ends and adjoining pilasters topped by decorative orbs, and imposing facades to both street frontages. There was a prominently located corner entrance to the public bar, a guest entrance on Karangahape Rd and a formal entrance on Pitt St. Apart from the public bar, the ground floor is likely to have accommodated a dining room, lounges and a more intimate parlour bar with guest accommodation on the upper floors. The building was constructed by Yorkshire-born builder Thomas Julian, who arrived in Auckland in 1883 and developed a sizeable construction firm. He was also actively involved in local-body politics as a councillor and later as chair of the Auckland Harbour Board. The property was owned by former Coromandel hotelkeeper Patrick Brodie and marked the start of an eight-decade association between the establishment and the well-known Auckland family. The Naval and Family Hotel was initially leased to Ehrenfried Brothers, which merged with John Logan Campbell's enterprise to form the colony's largest brewery business. \"At this time brewers were increasingly buying hotels and taking over the leases of others to secure outlets in a competitive market,\" says the Historic Places Trust. \"The Naval and Family underwent alterations less than three years after its completion with the installation of a large circular bar to better accommodate customers and enhance the appearance of rooms connected with it.\" Brodie's son, also named Patrick, who was also a prominent figure in the liquor trade, later leased the establishment. Brodie Properties subsequently acquired the property and in 1936 the hotel was leased to New Zealand Breweries which eventually bought the property off the Brodies in 1962. The 1960s brought far-reaching changes to a hotel industry facing increasing competition from chartered clubs and restaurants. In the early 1970s the hotel became the Naval and Family Tavern when the Licensing Control Commission relented on a previous requirement that city hotels provide a prescribed minimum of 10 rooms for guest accommodation. In 1995 the Naval and Family, one of a dwindling number of Victorian era corner hotels in Auckland's CBD, was purchased from Lion Nathan (the successor to New Zealand Breweries) by private individuals. Alterations in 2006 prior to renaming the establishment as The Crest Hotel included a re-facing of main facades at ground-floor level and reintroduction of sash windows. A small deck was developed on the first floor to accommodate alfresco drinking and an outdoor area for smoking. Prior to its occupation by Calendar Girls, the hotel was renamed the Naval and Family in 2008 by its then proprietor, nightlife entrepreneur Wayne Clark. \"The property has had a colourful past,\" says La Hood. \"Its heritage protection means it should remain an important part of Auckland's history and a key component of K Road's streetscape for many years to come.\" www.bayleys.co.nz/4108796 Share this article “At the moment, it’s kind of like you’ve got to be in to win.” ",
    "datetime": null,
    "url": "https://www.nzherald.co.nz/property/k-road-beauty-has-colourful-past/E4RQ7X2ML47BF7NAF5AZVR2HTM/"
}