{
    "title": "K-beauty Business Peach & Lily Receives Minority Investment – WWD",
    "text": "\"We want to create more experiential offerings for our community.\" Beauty Editor, Finance Peach & Lily has its first big investor — Sandbridge Capital, which also backs Derek Lam and Youth to the People. Peach & Lily was founded in 2012 by Alicia Yoon as a means to bring Korean-beauty trends into the U.S. market. The business also has two owned brands — Peach & Lily, a prestige brand that makes products like Glass Skin Refining Serum for $39, and Peach Slices, a mass brand sold at CVS. It also acts as a third-party distributor to certain brands. Sandbridge has taken a minority stake in the business. Yoon said the influx of capital should allow Peach & Lily to start expanding internationally, particularly in Europe. “We didn’t really raise the capital because we needed the capital. This is year eight of the business and this is our first institutional partner,” she said. “We wanted a strategic growth investment. Related Articles\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tBeauty Features\n\t\n\n\n\n\t\n\t\t\tBobbi Brown on Three Years of Jones Road\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tBeauty\n\t\n\n\n\n\t\n\t\t\tThe Best Dyson Airwrap Dupes, Tested and Reviewed “We are looking to expand internationally, and we’re definitely focusing on Europe,” Yoon said. “The other part is that our community is very loyal, over 65 percent of our sales last year came from repeat purchases and we want to create more experiential offerings for our community.” Peach & Lily plans to develop new initiatives that include in-real-life experiences, Yoon said. Peach & Lily’s brands are growing — Yoon said sales more than doubled year-over-year — as is its web site. Industry sources said Peach & Lily’s sales are expected to reach more than $100 million in the next few years. Terms of the investment were not disclosed. Sandbridge has also backed Thom Browne, The RealReal, Youth to the People, Ilia, Rossignol, Farfetch and other brands. “Alicia is already well on her way to building an incredibly authentic premium brand, artfully blending natural ingredients and efficacy with a refreshingly innovative and modern approach to K-beauty. We see an ideal opportunity with the Peach & Lily brand to strategically leverage Sandbridge’s global brand-building capabilities in support of the company’s trusted beauty platform and exceptional pipeline of new product innovation,” the company said. For more from WWD.com, see: Sign up for beauty news straight to your inbox every day Top News Stories Alerts Straight to your Inbox. Send us a tip using our anonymous form. WWD and Women's Wear Daily are part of Penske Media Corporation. © 2023 Fairchild Publishing, LLC. All Rights Reserved. ",
    "datetime": "2020-02-07T13:29:54+00:00",
    "url": "https://wwd.com/feature/peach-lily-receives-minority-investment-from-sandbridge-capital-1203462036/"
}