{
    "title": "K-Beauty Brand The Face Shop Is Now Sold on Jet.com | Allure",
    "text": "By Tanisha Pina There's a reason Korean beauty has been the topic of conversation in over 100 Allure articles, and why its trends tend to take off faster than you can double cleanse. And whether heightened interest stems from the quirky packaging, unique ingredients that most of us have never heard of (snail secretion essence, anyone?), or the fact that K-beauty science feels lightyears ahead of everyone else, there's no denying that people are buying in. So much so, that more and more brands are finding ways to make their products as accessible as possible to U.S. consumers. The most recent example? You can now finally get your hands on the internationally beloved K-beauty skin-care line, The Face Shop, through an exclusive partnership with Jet. As of last month, The Face Shop joins Jet's already existing K-beauty selection — from popular brands like Dr. Jart and Laneige — but this is first time you'll be able to get some of these Face Shop products if you're located in the U.S. The first one I checked out for myself was Dr.Belmeur, partially because it was highlighted on the homepage, but mostly because of its expansive range. The line consists of two different categories, one for dry and delicate skin and a second for oily and blemished skin, both promising to be made with low-irritant ingredients. My skin falls in the former category, so I was excited to try a couple of the buzzier products for myself. I started with the Daily Repair Toner. It's a really mild and easy option for easily irritated skin that will still keep you hydrated, thanks to the special polymeric water gel texture that holds all of the ingredients together. According to Melanie Palm, a board-certified dermatologist, cosmetic surgeon, and assistant clinical professor at University of California San Diego, water gels work by incorporating hydrogels. \"These contain large sugar chains (polysaccharides) that attract many times their weight in water.  I would surmise that this works in a similar fashion.\" Courtesy of brand I followed up by using the Dr.Belmeur Ato Salt Cream, which according to reviewers is a hit regardless of your skin type. The heavy moisturizer is formulated with eight percent Dead Sea salt. \"The salts produced from this body of water have been studied in skin conditions like psoriasis and regular use can repair the skin,\" says Palm. \"Balneotherapy (water therapy) using these salts can help decrease inflammation, not only because of its anti-inflammatory properties, but balneotherapy may also help with restoring the natural microbial biome of the skin.\" The cream is also formulated with phytosphingosine, which helps strengthen the structure of the skin, along with peony extract and ceramide. \"Ceramides are really important cholesterol-derived fats that help provide the glue that keeps healthy skin cells cemented next to one another,\" says Palm. \"They are depleted in times of skin dryness or in conditions such as eczema.\" As for the peony extract, they do their part by preventing the oxidation of fats, which in turn may help in preventing skin damage. Outside of Dr. Belmeur, I was surprisingly really happy with the Bio-Cell Firming Face Mask. It's a traditional sheet that left my face feeling baby-soft and glowy thanks to it being packed with collagen and serum. \"This mask is incredibly lightweight, and clings to your skin while being super concentrated with essence,\" shared one Jet reviewer. Courtesy of brand By Aliza Kelly By Gabi Thorne By Gabi Thorne The Rice Water Bright foaming cleanser is another customer-favorite on Jet. The idea is simple: a rich, dense foam that promises to gently moisturize your skin, remove makeup, and even brighten you complexion. According to reviews, the cleanser does just that. Customers share that it left their skin feeling \"smooth without being too tight,\" while another confirmed that it \"truly brightened [their] skin.\" The landing page for The Face Shop on Jet is helpful should you still need some help pinpointing exactly what it is you're looking for. The site allows you to browse by product type or by specific benefits like sensitive skin care, hydrating, or pore minimizing. There are over 90 products from the brand on Jet right now, ranging in price from just over $1 to right under $50. The best part about K-beauty might very well be that there's always something new to discover, so what are you waiting for? For other amazing products to add to your cart today: Get a history lesson on the past 100 years of skin care: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Nicola Dall'Asen By Sarah Han By Sarah Han By Kara McGrath More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2018-03-20T21:33:22.194Z",
    "url": "https://www.allure.com/story/buy-the-face-shop-beauty-products-on-jet"
}