{
    "title": "K-Beauty Brand Huxley’s Secret Ingredient Inspired By Moroccan Royals | Observer",
    "text": "If your 2018 resolution is to get into Korean beauty products but you’re not sure where to start, consider Huxley’s hydrating, simple products with a royal twist. While most K-beauty brands have unexpected components, from snail mucin to bee secretion, Huxley’s main ingredient is prickly pear seed extract. And unlike other K- beauty brands that are known for their kitschy packaging, Huxley’s bottles and formulations are decidedly all-natural. In fact, the toner is composed of 97 percent organic ingredients, including cactus, much like Sephora’s bestselling Glow Recipe. Founder Byung Hoon Lee started his career at Samsung Electronics, where he worked in product planning for a decade and learned about the value of a brand, which helped him to create one of his own. “There are so many outstanding products on the market, yet consumers are captivated by only a few, and there are not a lot of brands that are really worth keeping,” Lee told Observer. “A hit product can be sold to a consumer in a short period of time.” His focus on branding transferred to his work in the cosmetic industry, despite not having any prior experience in the field. “Not having much experience in the beauty market, rather, allowed me to look at cosmetics very objectively,” he explained. The brand’s name was inspired by Aldous Huxley’s book Brave New World and more specifically the quote “Life is short and information is endless. The truth would be drowned in a sea of irrelevance in the future.” Lee wants to make it easier to choose simple, branded beauty products. The ingredients in Huxley were inspired by an unexpected place: Morocco. “One day, a friend of mine that teaches international trade at the national University of Morocco called me and told me that while he was working as a private instructor at the Moroccan palace, he witnessed women in royal families wash their faces with some kind of yellow water. That yellow water turned out to be cactus seed oil, and my friend recommended me to use this oil to make cosmetics,” Lee explained. Now, that oil is, quite literally, the essence of Huxley products. After the fateful phone call, Lee immediately visited Morocco to watch cacti grow and discover the cactus oil being made. There, he saw how it protected women’s skin from drying in the Sahara Desert. Indeed, they used the cactus seed oil to wash their face and the cactus leaves to soothe their skin, especially after being in the sun all day. After researching the prickly pear seed oil, which comes from the prickly pear cactus, he found it contains 400 times more Vitamin E than olive oil, one of the highest sources of Vitamin E, known for its anti aging properties. The Vitamin E makes it ideal for drying weather of all sorts, whether it’s the Sahara or a New York winter. The simple ingredient makes it the perfect gateway to Huxley products, whether you’re interested in K-beauty or the Moroccan royal family. We get it: you like to have control of your own internet experience. But advertising revenue helps support our journalism. To read our full stories, please turn off your ad blocker.We'd really appreciate it. Below are steps you can take in order to whitelist Observer.com on your browser: Click the AdBlock button on your browser and select Don't run on pages on this domain. Click the AdBlock Plus button on your browser and select Enabled on this site. Click the AdBlock Plus button on your browser and select Disable on Observer.com. ",
    "datetime": "2018-02-16T13:15:47+00:00",
    "url": "https://observer.com/2018/02/korean-beauty-brand-huxley-inspired-by-moroccan-royal-family/"
}