{
    "title": "K-beauty Brand Mamonde to Launch at Ulta – WWD",
    "text": "The floral-inspired line is the fourth of Amorepacific's \"global champion brands\" to enter the U.S. Beauty Editor, Mass Market Amorepacific Group is broadening its portfolio in the U.S. with the launch of a key brand into the market. Mamonde — a midpriced skin-care and makeup brand inspired by flowers — is set to launch exclusively with Ulta Beauty. An assortment of 27 stockkeeping units — all of them skin care, with the exception of a cushion compact foundation containing skin-care benefits — will go up on ulta.com on Feb. 7, and roll out to 207 of the retailer’s doors on March 5. The line is one of five that Amorepacific Group considers its “global champion brands” — or brands that have significant reach outside the corporation’s native South Korea, in regions across Southeast Asia, North America and Europe. Those last two regions comprised only 2 percent of Amorepacific Group’s total sales from 2015 to 2016, but sales in the U.S. are growing at a double-digit rate. Related Articles\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tWellness\n\t\n\n\n\n\t\n\t\t\tEXCLUSIVE: Lauryn Bosstick's The Skinny Confidential Launches at Nordstrom\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tWellness\n\t\n\n\n\n\t\n\t\t\tReset by Therabody Heads to Manhattan West Amorepacific Group — number seven on WWD Beauty Inc’s list of top 100 global beauty brands — grew sales 27 percent from 2015 to 2016 in the U.S. Industry sources estimate the brand grew another 30 percent from 2016 to 2017, and will track the same growth through 2018. Three other global champion brands — Sulwhasoo, Laneige and Innisfree, which launched with a flagship in Manhattan in September — are established in the U.S. The Amorepacific brand itself is not considered a global champion brand because it was created specifically for the U.S. market. The Mamonde launch at Ulta Beauty is one of the first initiatives president and general manager Jessica Hanson will oversee. Hanson, formerly the chief marketing and sales officer at Perricone MD, began her post with Amorepacific in September. Brad Horowitz, now chief executive officer of Malin + Goetz, previously oversaw the U.S. market for Amorepacific. Amorepacific Group introduced Mamonde in 1991, and the U.S. market is the brand’s first international venture outside of Asia. “The inspiration and naturality and effectiveness that comes from flowers have been part of our company since before we began in 1945,” said Hanson in an interview at the company’s U.S. headquarters near Times Square in Manhattan. Company lore says Amorepacific Group founder’s Suh Sungwhan’s mother created a hair pomade made of camellia oil and sold it at local markets in Korea. This is the sort of anecdote Hanson is hoping U.S. consumers will make an emotional connection with. The launch coincides with Amorepacific Group’s efforts to drive consumer awareness towards the company as a whole with a diverse portfolio of brands available in the U.S., separate from the luxury Amorepacific skin-care brand, which is the line most known to consumers and is sold at retailers like Sephora and Bloomingdale’s.  “Every brand is created internally — we’re not about acquiring brands, we’re about being Asian beauty creators. There’s a real care that’s taken and I don’t think that story is known in the U.S.,” said Hanson. “And then it’s about taking them and [asking], ‘Where do we distribute? At what price point?’ There’s a time and place and every brand has a story to tell — that’s why we’ve waited with Mamonde to bring it to the right place.” Hanson sees Mamonde’s affordable pricing, results-oriented products and feminine design as the right fit for Ulta, and said the target consumer will range from Millennials to women in their sixties. This is the first time an Amorepacific brand has been distributed in Ulta. Innisfree is growing in the U.S. with a stand-alone store model — there are three more locations set for 2018, with the potential for eight total stores by year’s end. Laneige was launched in 2014 at Target Corp., but is sold at Sephora and on its own e-commerce site. Sulwhasoo, launched here in 2010, is a high-end department store play, with accounts at Nordstrom, Neiman Marcus and Bergdorf Goodman. “Ulta has only played with some K-beauty brands that are more mass, and it’s been a small footprint,” said Hanson, noting that Mamonde will be merchandised in the prestige skin-care section, rather than a specific K-beauty area. “They really feel like K-beauty is a segment they want to play in, but they want to play differently. They shared with us that they saw Mamonde as a prestige brand, and from working with them at Perricone [I know] there is a range of consumers [at Ulta] and they very much want to see the reward of the product before they determine how much they’re willing to invest. Being accessible but still feeling special is why [Ulta] liked us.” Going into Ulta is an assortment of products priced at $7 retail for a sheet mask and $38 for a serum. Hero items include the Petal Purifying Bubble Mask — for $25, a wash-off mask containing crushed rose petals — the $23 Hydrating Beauty Water made of 100 percent organic Damask roses and the Floral Hydro Intense Cream, a $32 gel cream said to sustain and seal in moisture all day long. Hanson sees the brand’s “no nasties” and naturally derived ingredient story as another point of differentiation for Mamonde within Ulta’s skin-care business.  Under Hanson, Amorepacific is also aiming to drive the K-beauty momentum away from novelty products and a staggering 12-step routine and ingrain it as a sustainable segment in the U.S. beauty market. A key focus for the year, said Hanson, is building out each brand’s web site with educational content and partnering with media outlets to market a pared-down K-beauty regimen for the U.S. consumer. “We’re working on demystifying the K-beauty ritual — it’s really confusing right now,” said Hanson, who explained that Amorepacific brands break skin-care regimens down into four simple steps — cleanse, balance and soften, treatment and hydrate — with the bonus steps of masks and exfoliation. Multipurpose products like Mamonde’s Hydrating Beauty Water accomplish this simplification by offering multiple benefits, like cleansing, balancing, exfoliation and hydration, in one item. Hanson sees K-beauty as an enduring trend in the U.S. market that is shifting into a true segment. “It started with intrigue on weird stuff — whether it was a new texture or ingredient or way of using product, it started off as very trend-driven but it’s transitioned to a little bit of an obsession. Now it’s a segment and we’re at a point where it’s going in two directions. One is like fast fashion with product-specific trends that might last six to 12 months and then there might be something new. Then there are the hero brands that offer the full experience and educate and continue to innovate, but are much more about the ritual of how Koreans consider beauty as steps in their lives.” Amorepacific Group is focused on building hero brands, said Hanson. And while so far the K-beauty craze in the U.S. has primarily consisted of skin care, Hanson said makeup could very well be the next wave. Color cosmetics brand Etude House is Amorepacific’s fifth global champion brand, and the only brand that does not have a significant retail partnership in the U.S. Some products are available via online K-beauty purveyor Soko Glam and in Amorepacific’s Aritaum stores, which are located in areas with a substantial Korean consumer base.  “Not quite yet,” was Hanson’s response when asked if Etude House would launch in the U.S. in a bigger way. But she does think consumers have an appetite for K-beauty makeup lines, citing a Tribe Dynamics report from last year that listed Etude House as a top earner in earned media value, because of the partnership with Soko Glam. Launching Etude house will boil down to finding the right retail partner, said Hanson, who noted that so far, the strategy of keeping distribution tight and differentiated between brands has been working. “If you ask our [retail partners], they want to make sure we aren’t taking each brand to so many points of distribution that it becomes just another brand,” said Hanson. “There is a feeling right now, especially in skin care, that going too big too fast can dilute a brand. Each decision is [careful] and makes sense for our white space and the consumer opportunity that we have.” Sign up for beauty news straight to your inbox every day Top News Stories Alerts Straight to your Inbox. Send us a tip using our anonymous form. WWD and Women's Wear Daily are part of Penske Media Corporation. © 2023 Fairchild Publishing, LLC. All Rights Reserved. ",
    "datetime": "2018-01-24T05:01:12+00:00",
    "url": "https://wwd.com/feature/amorepacific-group-mamonde-launch-ulta-beauty-11123392/"
}