{
    "title": "K-Beauty Youtube Star Dawn Lee Dies at 30 | BoF",
    "text": "Agenda-setting intelligence, analysis and advice for the global fashion community. Lee Jung-joo, a beloved beauty Youtuber also known by the names Dawn and Saebyeok, passed away on Sunday after a two-year-long battle with cancer. Kim Eun-ha, the chief executive of Lee’s agency Ice Creative, announced the news in an Instagram post over the weekend. Since Lee was diagnosed with lymphoma in 2019, she has shared her cancer journey with followers alongside videos centered around lifestyle and beauty. Fellow beauty creators and influencers from Krave Beauty founder Liah Yoo to actress Choi Yu-hwa joined fans in paying tribute to Lee on social media. “You will become the most splendid and sparkling star, Dawn,” wrote Yoo on Lee’s latest Instagram post. “Thank you so much for giving our subscribers a lot of laughter and energy. Have a good rest there.” Lee’s funeral service will be held at Samsung Medical Center in Seoul’s Gangnam District, The Korea Times reports. © 2023 The Business of Fashion. All rights reserved. For more information read our Terms & Conditions As strategics like Unilever and L’Oréal divest from once-core lines, a more selective approach to M&A is underway. Welcome to Haul of Fame, a weekly roundup of the biggest beauty moments of the week, why they matter … and why some of them might not, even though they sure are gorgeous. The platform’s freewheeling approach to e-commerce has opened the floodgates for established labels, grey-market sellers and influencers to entice beauty shoppers to buy. But with little oversight over fake product listings, brands must negotiate how much control they want to give over to the app. Gwyneth Paltrow’s lifestyle label is introducing an accessibly priced beauty line at Target and Amazon. The essential daily round-up of fashion news, analysis, and breaking news alerts. Our newsletters may include 3rd-party advertising, by subscribing you agree to the Terms and Conditions & Privacy Policy.   ",
    "datetime": null,
    "url": "https://www.businessoffashion.com/news/beauty/k-beauty-youtube-star-dawn-lee-dies-at-30/"
}