{
    "title": "K-Beauty: Skincare trends to look out for this year | Life-style News - The Indian Express",
    "text": "As a new year begins, it is time for a host of new beauty resolutions to keep in mind. While Korean skincare and beauty trends revolutionised self-care over the past year, concerns like ‘maskne’ and protection of the skin’s natural barrier still found the most common prevalence in conversations. The world of Korean skincare or K-beauty can seem to be a tad confusing for a newbie skincare enthusiast. As such, we have curated a list of trends that we think will be doing the rounds in 2022. Slugging Korean beauty uses a ‘skin-first’ approach towards skincare; as in, letting the skin’s natural radiance shine through as opposed to covering it with layers of make-up. ‘Slugging’ is one such trend that has found prominence this year as it promises healthy and moisturised skin that resembles glass. In this method, you seal in your night-time regime with a thin layer of occlusive product such as Vaseline,  to prevent transepidermal moisture loss while you are asleep. It has taken the beauty world by storm as the hack is easy and cost-effective, and provides the skin with much needed moisture during winters. Minimal skincare routines While K-beauty regimes are infamous for being complicated and super long, minimal skincare routines are now finding their way into lifestyles. Amid busy work schedules and personal commitments, it is difficult to keep up with a nine or 10-step beauty regimen, especially if you travel frequently. Skin minimalism will ensure that you use only a few specific products targeted towards the skincare you require and get optimum results. Multi-use products Multi-use products such as moisturising serums, emulsions, sleeping masks and toners are versatile products in K-Beauty that will allow you to switch up your skincare routine in a fun way! While dry skinned beauties may be looking for ways to enrich their skin with as much moisture as possible, layering ingredients such as a moisturising toner, vitamin c serum, a hyaluronic acid serum or moisturizer, topped with a sunscreen, will ensure that you don’t experience any flakiness. For the busy urbanite, hydrating sleeping masks are a great addition to their skincare routine. Sustainability While curling up with a sheet mask, a steaming mug of tea and a book sounds like the perfect relaxing weekend, sheet masks (made especially popular by K-beauty trends) are not exactly planet-friendly. Similar to single-use, glass or plastic serums, tiny bottles of ampoule or overall use of plastic has long been a critique of the industry. In 2022, with the popularity of skin-minimalism and focus on less-is-more, sustainability will be one of the major arenas to focus on. Mask-friendly beauty As the pandemic shows no sign of slowing down, masks will continue to be a part of our everyday lives. As such, skin concerns related to the continuous usage of masks will remain in conversation, such as hyperpigmentation, acne caused in the chin area, etc. While K-beauty is all about glowing and hydrated skin, protecting the skin’s barrier and overall soothing and calming products are a must for this skincare trend. 📣 For more lifestyle news, follow us on Instagram | Twitter | Facebook and don’t miss out on the latest updates!  ",
    "datetime": "2022-01-16T15:15:30+05:30",
    "url": "https://indianexpress.com/article/lifestyle/life-style/k-beauty-2022-skincare-trends-slugging-mask-beauty-7725980/"
}