{
    "title": "K-Beauty’s Golden Age Is Ending. What Comes Next? | BoF",
    "text": "Agenda-setting intelligence, analysis and advice for the global fashion community. Before Alicia Yoon launched Peach and Lily, the e-tailer known for bringing South Korean beauty to the American masses by curating products for the likes of CVS, Walmart and Ulta, she hosted a focus group to gauge what people knew about K-beauty. The year was 2012 and the result, she learned, was not much at all. “It was a big question mark,” said Yoon, who saw an opportunity in the extremely limited K-beauty selection in New York’s Chinatown and Koreatown, not to mention major department stores and beauty retailers. Enthusiasts seeking out hyaluronic acid ampoules and snail serums resorted to second-hand marketplaces like eBay, where quality and authenticity weren’t guaranteed. Following a period of rapid growth at home and abroad in the 2010s, Korean brands like Sulwasoo, Laneige, Innisfree and Tonymoly can now be found on physical and digital shelves at Sephora, Bergdorf Goodman in the US, Selfridges and Boots in the UK, to name a few — the byproduct of a westward pivot of South Korea’s export strategy to mitigate against an overreliance on the China market. The second half of the last decade saw South Korea become the world’s fourth-largest exporter of beauty products, according to Bloomberg. European and American beauty conglomerates soon wanted in on the action, with L’Oréal acquiring local brand Stylenanda’s beauty arm 3CE in 2018, a year before Estée Lauder Companies’ $1.1 billion acquisition of Dr Jart owner Have & Be Co. Allure K-beauty edit Allure's K-beauty edit. Allure. (Courtesy) Estimated by Allied Market Research in 2019 to be worth $21.8 billion in five years time, K-beauty’s future still looked relatively bright before the pandemic hit. The category’s global rise hasn’t been blemish-free though. “That golden boom period is fading away, but it’s not completely over yet,” said Maggie Kim, co-founder and former brand director of up-and-coming Korean indie brand Hince. Cracks started to appear in 2017 when Korean American journalist Euny Hong wrote in an op-ed for The New York Times, titled “I Grew Up Around Korean Beauty Products. Americans, You’ve Been Had,” which contended that “ginseng and Jeju volcano water are not the whole story behind that flawless skin” belonging to Korean women. Instead, she pointed to the country’s status as a world plastic surgery capital. Once Covid-19 took its toll on the industry, it was revealed that Suh Kyung-bae, chief executive of K-beauty behemoth Amorepacific, which owns brands like Sulwhasoo, Etude House and Laneige, saw his fortune drop from $8 billion in 2017 to $3.6 billion in 2020. While it’s true that K-beauty’s top exports continue to inspire global brands’ offerings — from sheet masks and foundation cushions, to double cleansing products — the maturation of the category, having penetrated markets like the US and Europe, means big and small players face fierce competition both at home and abroad. The struggle for differentiation has only intensified in the wake of the pandemic as businesses doubled down on ultra-experiential retail and content-centric direct-to-consumer channels to give them the edge. The Pandemic Effect K-beauty brands were well positioned to respond to customers’ needs during the pandemic — Koreans wore face masks pre-Covid to combat dust pollution and are accustomed to addressing skin concerns like “maskne” and damaged skin barriers, noted Peach and Lily’s Yoon. Other curation businesses, like New York-based Soko Glam, have also found success and continued to see growth throughout the pandemic. “When Covid-19 hit, there was a big emphasis on self-care and K-beauty’s story fit in perfectly to that trend,” said Liah Yoo, founder of Seoul-headquartered Krave Beauty. “Suddenly, doing a 10-step skin care routine didn’t seem superfluous but rather necessary to help you rebalance yourself and do something with all that extra time.” Suddenly, doing a 10-step skin care routine didn’t seem superfluous but rather necessary to help you rebalance yourself. The category’s focus on skin care also insulated it from the decline in sales of colour cosmetics — a 55 percent year-on-year drop for prestige brands, according to a McKinsey report published in May. Even so, K-beauty hasn’t been immune to the fallout. Yoon observed that some brand partners saw packaging suppliers pivot to PPE, leaving them in the lurch. Like fashion, beauty supply chains were hit by delays and cancellations. The situation has improved a year on, she added, but brands aren’t out of the woods yet; the lack of tourists and a reliance on exports are still denting sales. Some trends that gained ground during the pandemic are here to stay. Yoon believes that current beauty concerns — like fighting environmental stressors and repairing the skin barrier — will be relevant in the long-term. Meanwhile, like their global peers, K-beauty players are intensifying their focus on sustainable, cruelty free products. Where brands had previously been put off by the heavy R&D investments and risks of betting on unfamiliar concepts, clean beauty has “become the main leading trend,” said Kim. K-Beauty’s New Wave There has yet to be an independent beauty player capable of toppling hegemons like Amorepacific, Able C&C and LG. But Korea’s younger upstarts are, as a whole, a force to be reckoned with. “When you look at it from like the big conglomerates’ perspective, collectively, the indie brands are taking market share,” said Yoon. “But when you then look at it from an individual indie brands perspective, it’s really hard.” Part of the challenge is competing with conglomerates in a category renown for sophisticated, expensive R&D to produce “unique textures, delivery systems, ingredients and packaging, all at competitive price points,” says Charlotte Cho, co-founder of Soko Glam. Competition isn’t limited to local players, where even global brands have been compelled to seek out manufacturing partners in Korea to get their hands on the same technology. Moreover, market dynamics have changed. Growth, which at a time swept across the category, is now concentrated among a select number of individual brands; more than 30,000 beauty businesses are licensed in Korea, according to Kim; and consumers are savvier and more demanding than ever. Up-and-coming brands can no longer follow their predecessors’ playbooks. This is why Krave Beauty’s Yoo doesn’t market her brand, which has grown over 250 percent year-on-year since it launched in 2017, with a K-beauty label. “I think it’s a double-edged sword when a brand identifies strongly in a specific category,” she said. “It’s much easier and faster to grow the brand reputation by riding trends, but it can hinder the growth of the brand in a long run.” Post-pandemic, the 10-step routines K-beauty pioneered are due for an overhaul. “We need to figure out a way to excite people and tell our story without feeding into product overconsumption or neglecting our environmental footprint,” said Yoo. It’s no longer enough for new entrants to market themselves as K-beauty brands. “A retailer might say, we’re already carrying seven [of them,]” said Yoon. “What’s your distinct point of view?” Nonfiction A Nonfiction campaign. Nonfiction. Indeed, K-beauty businesses are realising that carving out a brand identity and building loyalty are worthier investments than churning out trending products. “Fads came and went around particular ingredients or conceptual items and all brands would jump on the bandwagon,” said Cha Hae-young, founder of up-and-coming fragrance and body care brand Nonfiction. From sunscreen sticks to centella asiatica, players focused on releasing hit products at the same time, rather than developing their brand identity. This is changing. Smaller players like Nonfiction are proof that doing things differently pays off. “Our goal is to make sure our customers say in confidence, ‘I’m a Nonfiction user,’” said Cha, who is already in talks to take the brand to other Asian markets. “That’s our starting point.” Rewiring Retail Touch Points As is the case across the globe, the pandemic boosted e-commerce growth in Korea’s already sophisticated market to 22.3 percent annually in 2020, according to GlobalData. Behemoths Amorepacific and LG Household & Healthcare are among the major firms amping up investment in online channels to keep up with smaller, more agile upstarts. Amorepacific is “reaping significant results in online channels,” Julien Bouzitat, chief marketing and digital officer at Amorepacific US, told BoF. Alongside a goal to hit 5.6 trillion won (just over $5 billion) in sales and 380 billion won ($343 million) in profit this year, the group aims to grow e-commerce sales by 30 percent. But it has some catching up to do. Jamie Ko, Seoul-based country and research manager at Euromonitor, attributed Amorepacific’s shaky performance in 2020 to its being late to the digital game: the group saw revenues and operating profit drop 23 percent and 63 percent year-on-year, respectively. Alongside its moves online, Amorepacific is working towards profitability by reshuffling offline channels and supplying products to multi-brand stores. The group’s priority has been — and continues to be — amping up brand awareness. Though it was founded in 1945 and is a household name in Korea, it has yet to build such a legacy abroad, said said Bouzitat. Giants cannot be dependent on their conventional, market-dominant distributors anymore. “[Giants] cannot be dependent on their conventional, market-dominant distributors anymore,” said Hince’s Kim; rather, Korea’s discerning beauty shoppers need to be swayed by creative and convincing digital marketing. Like Chinese firms, diligent Korean players are accustomed to tailoring their marketing content and strategy to individual formats and platforms in their local market like live-streaming, which is growing rapidly. “Each sales channel now comes with like a very distinctive way that you need to market,” said Yoon. This has implications outside of South Korea: the market, like others in Asia, is where new digital strategies are taking shape before trickling westward. If K-beauty innovators take their strategies abroad, brands in the US and Europe will follow their lead. For Nonfiction’s Cha, sales in owned channels are consistently outpacing those at multi-brand retailers and concept stores. But she isn’t any less discerning when it comes to wholesale. “It’s not just about how much [a wholesale partner] can sell — it’s more about how they have established their brand image and trust with consumers,” said Cha, whose products are currently stocked at Korea’s Sephora, 10 Corso Como, and The Conran Shop in addition to Nonfiction’s direct-to-consumer channels. Physical Retail Innovation Outbreaks and closed borders have deserted Seoul’s major shopping districts like Myeong-dong and Itaewon. But where K-beauty brands had already invested in making their native stores destinations in their own right before the pandemic hit, they are already better positioned to welcome shoppers back to stores once infection cases drop, said Yoon. Before the pandemic, South Korea’s government aimed to draw 20 million overseas visitors to its shores in 2020, having welcomed 17.5 million in 2019. Seoul in particular has become a global beauty hot spot for tourists and industry insiders like Yoon, who like many in the industry would make the rounds in Gangnam and Myeong-dong to discover up-and-coming trends and technologies. SKOREA-CHINA-HEALTH-VIRUS Pedestrians wearing face masks walk through Seoul's Myeongdong shopping district. Getty Images. (ED JONES/AFP via Getty Images) Unlike in larger markets like the US, where beauty brands must establish themselves in crucial cities and districts to make an impact, K-beauty players can reach most of their local target audience through setting up shop in Seoul alone, Yoon added. This allows brands to experiment with and truly invest in their offline locations. Amorepacific-owned Aritaum’s Gangnam flagship features a music lounge and photo booth to mimic a K-pop theme, with overhead lighting rigs and a product “stage” to match. Multi-brand retailer Oliveyoung’s Myeong-dong flagship includes cubicles where visitors can try on scents without being overwhelmed by products in their vicinity. At Eco Your Skin’s Chungdamdong spa, Skin Lab L, products are arranged by ingredients, customers undergo a skin consultation to figure out their “skin age” and are recommended personalised treatments, like oxygen blast facials, accordingly; records are kept to map out long-term progress and boost brand loyalty. Though experiential retail and “retailtainment” have been buzzwords for years, Yoon has yet to see brands in the US catch up. “Korea is still much further along in delivering what experiential retail really looks like,” she said, hoping that Korean brands will take their learnings from home to locations abroad. THIS WEEK IN BEAUTY © 2023 The Business of Fashion. All rights reserved. For more information read our Terms & Conditions While the K-beauty craze of the 2010s has waned in recent years, brands and retailers are seeing renewed interest in the category thanks to TikTok. The finalists will be invited to pitch their business plans on November 2 to an esteemed jury including Bollywood actor and beauty entrepreneur Katrina Kaif and fashion designer Gaurav Gupta. From Glossier-themed Bat Mitzvahs to the return of tramp stamps, the week in beauty news. As strategics like Unilever and L’Oréal divest from once-core lines, a more selective approach to M&A is underway. The essential daily round-up of fashion news, analysis, and breaking news alerts. Our newsletters may include 3rd-party advertising, by subscribing you agree to the Terms and Conditions & Privacy Policy.   ",
    "datetime": null,
    "url": "https://www.businessoffashion.com/articles/beauty/k-beautys-golden-age-is-ending-what-comes-next/"
}