{
    "title": "K-Beauty through the Ages | GW Today | The George Washington University",
    "text": "Home\nK-Beauty through the Ages Authored by: Joseon wedding robes on display in \"From Royal Court to Runway\" feature ornate embroidery and patchwork techniques. (William Atkins/GW Today) If you want to know what your chicest friends will soon be wearing, look to the cool kids in Seoul and Busan. South Korea is a culture on the cutting edge of fashion, especially in streetwear, which shares trends with the West through K-pop stars and Instagram influencers. That wasn’t always the case. In the 19th century, most Westerners considered Korea a closed book. After centuries of isolationist policies designed to protect itself from larger Asian powers, however, the country opened its borders to diplomacy and trade in 1876 during the late Joseon dynasty. Americans finally experienced Korean fashion and textiles on a large scale at the 1893 World’s Fair in Chicago. “Koreans today can upload their pictures online and immediately people around the world see them and emulate them,” said Lee Talbot, curator at the George Washington University Museum and The Textile Museum. “But 130 years ago, it was a very different situation.” Some of those same World’s Fair pieces are now on display in the museum’s latest exhibition, “Korean Fashion: From Royal Court to Runway,” alongside other rare Joseon-era pieces, fashions from the latter half of the 20th century as Korean designers began to appear on the runway in Paris and Milan, and streetwear from 2022. The exhibition traces that fashion evolution with a focus on hanbok, a collective term for Korean clothing that now, for women, generally refers to a traditional Joseon silhouette of bell-shaped skirt and long-sleeved jacket which is still worn on special occasions. Through the centuries, clothing has reflected changes in Korean culture. As Korea’s borders became more fluid in the late 19th and early 20th centuries, for instance, hanbok came to incorporate European silhouettes like tailored waistcoats and metal or horn buttons. Still, traditional craftsmanship shone through. One 19th-century hat on display in “Korean Fashion” looks from a distance like a typical gentleman’s bowler, but up close reveals itself to be finely woven from horsehair with minutely figured cranes in the grain of the weave—a tricky traditional technique. The first half of the exhibition on the museum’s second floor offers a glimpse into life in the late 19th-century Korean court and the context in which it operated. Confucian influence within the culture emphasized simplicity of form, so while fabrics were rich and garments might employ time-consuming luxury techniques like quilting, few were embellished except where those embellishments served a practical or ceremonial function. Embroidered rank badges, for instance, used the number and type of animals depicted to indicate where civil and military officials stood in their hierarchy. Confucianism’s emphasis on frugality and modesty also determined Joseon fashions. Hanbok was worn with paper at the collars and wrists to prevent dirt and discoloration. Patchworking was popular in both everyday and ceremonial wear, with old robes sometimes recycled into sleeve stripes that came to symbolize luck and protection. Even a 19th-century bridal robe worn by a princess features these patchwork techniques: Its wearer might have been among the country’s richest citizens and this might be the most elaborate garment she would ever wear, but she (or her servants) still was expected to make do with what was available. On the museum’s third floor are fashions from the 20th and 21st centuries, celebrating designers who thrived in the interplay between new and traditional fashion. Pieces on display come from Nora Noh, who helped bring the Mod aesthetic to Korea in the 1960s, as well as Lee Young Hee and Icinoo, who in the 1990s were the first Korean designers to present their collections on Paris runways. The exhibition also celebrates costuming for stage and television. In 2022, however, fashion evolves so quickly that exhibition curators eventually decided they could only accurately depict the current state of Korean fashion with a revolving, continually updated digital display. “By the time you get a street look that’s hot in time for our conservators to get it ready, it’s not hot anymore,” Talbot said. In collaboration with submission-based street style aggregator HIPHOPER, a screen on the third floor shows Korean influencers in their hottest outfits—from knee socks and slouchy sweater vests to Y2K-style rave-influenced neon ensembles—each tagged with their city and even district of origin. Hanbok silhouettes still appear, sleek and sometimes appearing almost futuristic. “Hanbok doesn’t stay the same, it incorporates lots of different influences and it changes over time, but it remains uniquely Korean,” Talbot said. Related Content Reshaping U.S.-South Korea Relations under the Biden Administration Weaving a Millennium of Textile History GW TODAY Office of Communications and Marketing\n2000 Pennsylvania Avenue NW\nWashington, DC 20006 Subscribe Contact Us About GW Events Calendar Follow Us  ",
    "datetime": null,
    "url": "https://gwtoday.gwu.edu/k-beauty-through-ages"
}