{
    "title": "K-beauty cosmetics to shift to C-beauty and J-beauty interest predicts Euromonitor International",
    "text": "Or wait... Headlines Brand Innovation Formulation & Science Packaging & Design Business & Financial Market Trends Regulation & Safety Promotional Features Site Archive Multimedia Hot Topics Clean & Ethical Beauty Brexit COVID-19 Protection and Microbiome Active beauty and nutricosmetics Animal Testing Sustainability and circular beauty Beauty tech and digital Financial focus Naturals and organics Site Archive Multimedia Resources Type of resources Events All Events Shows & Conferences Online Events Editorial Webinars Events  In-cosmetics global trends to watch 25-Feb-2020\n                            - Last updated on\n                                25-Feb-2020 at 10:32 GMT Related tags\nin-cosmetics Global\nK-Beauty\nc-beauty\nj-beauty\nEuromonitor international\ntrends Next month’s in-cosmetics Global will host a series of educational sessions across several dedicated spaces, including a sustainability corner, innovation zone and marketing trends theatre – digging into important trends and issues for the global cosmetics and personal care category. Of particular interest will be a spotlight on the insatiable rise of country-led beauty trends. Think K-beauty is still the big one to watch? Think again… Gabriella Beckwith, senior analyst for beauty and fashion at Euromonitor International – set to present a snapshot tour of the world’s top beauty hotspots said interest in country-branded beauty had snowballed in recent years, propelled a peaked interest in foreign travel and culture. Speaking to CosmeticsDesign-Europe ahead of the show, Beckwith said: “In the last few years, hotspot brands have become increasingly powerful as consumers cultivate stronger regional identifies, care more about authenticity, and supporting their own local economy and communities.​ “Hotspot brands allow consumers to place cultural attachment to their products, providing something more meaningful than just a simple beauty purchase.” ​ Beckwith said out of all the country-led movements, Korean beauty had been the most talked in the last decade. “K-beauty emerged as a beauty powerhouse following the so-called Korean Wave in the early 2000s, whereby South Korean popular culture such as K-drama and K-pop began to circulate internationally, and the country saw a rise in inbound tourists. The South Korean beauty industry has since prospered, both locally and internationally, and today is best known for its 10-step skin care routines, unique product innovations, and eccentric packaging.”​ However, she said K-beauty had “matured in recent years”, ​with market growth of beauty and personal care products in South Korea up just 0.9% in 2018, compared to 6.5% in 2016. K-beauty giants like AmorePacific and LG Household & Health Care had also reported weaker performances recently, she said. “It appears consumers may be turning to new hotspots such as Japanese, Chinese, Australian and Scandinavian beauty.”​ Asked which of these were the ‘ones to watch’ in 2020, Beckwith said: “Japan and China are the two biggest hotspots to watch.”​ Japan, she said, had a “rich heritage as a leader in beauty manufacturing” ​and was also a “breeding ground for science and technology”.​ Beauty products from Japan, therefore, tended to be associated with “efficacy, high-quality and benefit-led features”, ​she said. “For this very reason, Japanese beauty (J-Beauty) is experiencing somewhat of a resurgence, as consumers globally prioritise quality over quantity, particularly within skin care. Rather than a heavy focus on local ingredients, the essence of J-Beauty is about science, whereby success is driven by intense R&D, innovation and formula breakthroughs.”​ For China, Beckwith said interest surrounded its “historical roots”​ and the fact the country was home to “ancient beauty rituals and skin treatments”​, including jade-rollers and traditional Chinese medicine (TCM). “Chinese brands are now reviving and cashing in on local beauty traditions such as TCM, which appeals to Chinese consumers of all ages, being widely familiar with the ingredients. Chinese TCM brands such as Pechoin, Herborist and Inoherb are striving to rebuild consumer confidence in local brands.​ “C-beauty is also benefitting from the rise in micro-influencers exhibiting pride in Chinese-made brands and promoting this to young Chinese consumers through digital platforms such as WeChat, Weibo and Little Red Book,” ​she said. German and Brazilian beauty brands were also worth watching closely in the near future, Beckwith said. Many brands in Germany, for example, were being founded by doctors, dermatologists or scientists and had a “strong association with engineering, functionality, and targeting specific skin conditions, with product claims that tend to be scientifically backed,”​ she said. And in Brazil, there was a clear rise in beauty brands capitalising on the “abundance of exotic ingredients”​ found in the country’s native eco-system, she said. Beckwith said understandably there was debate as to whether country-branded beauty trends would quickly rise and fall like a fad in the “ever-changing beauty industry”, ​these hotspots tended to bring much more than a bit of marketing to the global beauty world. “Take Japanese beauty, for example, which is built almost entirely around creating efficacious and science-backed formulations. Efficacy remains one of the biggest priorities for consumers, and brands globally continue to take inspiration from Japan’s forward thinking and tech-led beauty market,”​ she said. Similarly, K-beauty had succeeded for so long because beyond the “fun and kitsch packaging”, ​the trend brought great innovation and new product ideas, she said. “Sheet masks, for instance, have become a staple in the beauty regimes of many consumers globally, as well as a core part of the portfolio of major beauty players.”​ So, whilst interest in particular countries may shift, the fascination with global beauty hotspots will continue to be an important trend to watch this year. Copyright - Unless otherwise stated all contents of this web site are © 2023 - William Reed Ltd - All Rights Reserved - Full details for the use of materials on this site can be found in the Terms & Conditions Related topics\nMarket Trends\nSkin Care\nHair Care\nColour Cosmetics Show more  Content provided by Robertet Health & Beauty | 27-Jun-2023\n                     | Product Brochure Sunbathing at the beach is the first UV-related skin damage that comes to mind. Whereas, enjoying a coffee on a terrace under the sun can be as harmful.  Content provided by Provital | 24-Apr-2023\n                     | Product Brochure Altheostem™ is Provital’s first dermohacking and lab-grown active with proven senolytic activity. A vegan and COSMOS-approved biotech ingredient that thoroughly...  Content provided by Tagra Biotechnologies | 05-Apr-2023\n                     | Product Presentation Biotin (vitamin B7) helps improve hair health, skin’s pigmentation, and nail’s appearance. Biotin occurs as a crystalline powder with very little solubility...  Content provided by Horphag Research | 20-Mar-2023\n                     | White Paper Pycnogenol® has 25+ clinical studies demonstrating its active properties for oral and topical skincare formulations. Results show the antioxidant stimulates... Show\n                        more More promotional features ",
    "datetime": null,
    "url": "https://www.cosmeticsdesign-europe.com/Article/2020/02/25/K-beauty-cosmetics-to-shift-to-C-beauty-and-J-beauty-interest-predicts-Euromonitor-International"
}