{
    "title": "K-Beauty: Indians plump for the serum-soaked goodness of sheet masks",
    "text": "My Account Follow us on: Powered By Find & Invest in bonds issued by top corporates, PSU Banks, NBFCs, and much more. Invest as low as 10,000 and earn better returns than FD Invest Now Powered By Unlock Your Trading Potential: Trade like Experts with SEBI registered creators, Learn from Courses & Webinars by India's Finest Finance Experts. Invest Now  AMBAREESH BALIGA Fundamental, Stock Ideas, Multibaggers & Insights Subscribe CK NARAYAN Stock & Index F&O Trading Calls & Market Analysis Subscribe SUDARSHAN SUKHANI Technical Call, Trading Calls & Insights Subscribe T GNANASEKAR Commodity Trading Calls & Market Analysis Subscribe MECKLAI FINANCIALS Currency Derivatives Trading Calls & Insights Subscribe SHUBHAM AGARWAL Options Trading Advice and Market Analysis Subscribe MARKET SMITH INDIA Model portfolios, Investment Ideas, Guru Screens and Much More Subscribe TraderSmith Proprietary system driven Rule Based Trading calls Subscribe   Curated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas Subscribe Curated markets data, exclusive trading recommendations, Independent equity analysis & actionable investment ideas Explore STOCK REPORTS BY THOMSON REUTERS Details stock report and investment recommendation Subscribe POWER YOUR TRADE Technical and Commodity Calls Subscribe INVESTMENT WATCH Set price, volume and news alerts Subscribe STOCKAXIS EMERGING MARKET LEADERS 15-20 High Growth Stocks primed for price jumps Subscribe Indians have been bombarded with promises of ‘flawless’ and ‘brighter’ skin for decades now. You’d think another one would be met with cynicism. But no, there is a new fad in town–sheet masks–and everyone is soaking it up. A serum-soaked cloth sheet, which claims to offer hydration and nourishment to the skin, sheet masks are a staple product in the South Korean skincare routine. With the growing popularity of South Korean shows and music (known as K-Drama and K-Pop) in India and greater exposure thanks to social media, these masks have become a go-to product in the country. “The product category is heavily influenced by the K-Pop culture,” said Purnendu Kumar, practice leader, consumer and retail, Praxis Global Alliance, a management consulting and advisory firm. “Also, a large share of young population, actively influenced by social media exposure, is inclined toward buying the latest and newer beauty product options,” he added.On Purplle, the orders for sheet masks have jumped 70 percent from what they were last year. According to Nippun Aneja, CBO at online beauty marketplace Purplle, the company has witnessed a steep demand for sheet masks since January 2021 and the orders for the product have jumped 70 percent from what they were last year. The demand is coming not just from metros but even from tier III towns. “About 54 percent of our total sheet mask net merchandise value comes from tier III cities, and 30 percent from metros,” added Aneja. Mask on Starting out as a small segment, with a handful of Korean brands about eight years ago, today sheet masks are sold by most of the major personal care brands in India. Brands such as Lakme, Pond’s, Garnier and Mamaearth have launched their own ranges, across various price brands, over the last two years. South Korean beauty major Amorepacific, which had launched its first sheet-mask in 2013 under the Innisfree brand, today sells the masks under various brands such as Laneige, Sulwhasoo and Etude in India. “We wanted to launch the product in the Indian market since it was an all-new category under the beauty and skincare category, and we found that women in India were looking for something like this,” said Doyoul Lee, managing director, Innisfree India and general manager, Amorepacific India. “Innisfree was the first mover in India in this category and competition followed us,” he adds. Mamaearth’s co-founder and chief innovation officer, Ghazal Alagh said that they launched the range because their customers began asking for it. “Being hassle-free and time-efficient, sheet masks have stormed the market over the last couple of years,” said Alagh. Even brands in the men’s grooming space such as Beardo, The Man Company have forayed into the category. Their ranges are priced between Rs 75 and Rs 150 per mask. Not just a fad Despite the excitement around this category, it remains small. Kumar of Praxis Global Alliance pegs the market to be valued at less than Rs 100 crore, which is but a drop in the Rs 48,000-crore skincare market in India. The sheet-mask category’s growth prospects are bright, at 20 percent CAGR over the next five years. “It was long overdue in India and has immense growth potential in the country,” said Rajat Wahi, partner, Deloitte India.The sheet-mask category’s growth prospects are bright, at 20 percent CAGR over the next five years. “This category is very popular in South East Asia and any A.S. Watson store in South East Asia, has an entire wall dedicated to sheet masks. There is a sheet mask for every need -- for pre-makeup to de-stress after a stressful day,” said Wahi. Outside of India, the craze seems to be waning. A recent report by market research firm Mintel, on APAC beauty and personal care market, revealed  that only 3 percent of new product launches were sheet masks in 2020, which is a significant fall from 8 percent of the new launches in 2018. But the masks haven’t lost their charm in Indian and few other markets. “Sheet mask still sees upticks in other markets like India as the K-beauty trend has recently been picked up, pushing 39 percent of Indian consumers to add new step into their facial skincare routine,” said the report. To gain a wider appeal, market experts said, the prices of sheet masks need to come down further. “A broad range of price points will help brands increase their affordability among middle-income group consumers,” said Kumar. Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated! Copyright © e-Eighteen.com Ltd. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form \r\n        or medium without express writtern permission of moneycontrol.com is prohibited. You are already a Moneycontrol Pro user. Access your Detailed Credit Report - absolutely free ",
    "datetime": null,
    "url": "https://www.moneycontrol.com/news/business/companies/k-beauty-indians-plump-for-the-serum-soaked-goodness-of-sheet-masks-7859781.html"
}