{
    "title": "K-beauty for men: Hwang In Youp shares secret to his ‘True Beauty’ | Philstar.com",
    "text": "MANILA, Philippines — Despite life’s challenges, including the ongoing pandemic, men, like women, should not forget to take care of themselves and their skin. This is among the key messages of “Uncover Beauty,” the new campaign headlined by “True Beauty” star Hwang In Youp. “Many times, makeup is seen as a tool for hiding flaws — but that shouldn’t always be the case. Makeup is not a means to cover imperfections but a way to express what is truly inside. In the same vein, our skincare routine plays an important part in self-care in order for us to maintain a healthy relationship with ourselves,” makeup brand BYS Philippines explained the campaign in a statement. “This story is something that strikes a chord with our 2021 campaign, 'Uncover Beauty',” iFace General Manager, Angie Goyena, revealed. “And signing on Hwang In Youp as our endorser is a statement about our stubborn assumptions concerning gender and beauty. This is an opportunity for us to smash stereotypes and shift away from standards, as well as be that voice to help shape the way we see beauty.” With his striking looks and edgy personality, Hwang In Youp initially pursued modeling before making his acting debut with the lead role in the webdrama, “W.H.Y.” After which, he has appeared in a number of television dramas including “Freshman” (2019), “The Tale of Nokdu” (2019) and “18 Again” (2020). He gained further recognition in “True Beauty” (2020), which is based on the Line Webtoon of the same title. The show features a young girl who uses makeup to express herself. Hwang In Youp plays one of her who sees and falls for the lead character despite the latter being ridiculed by their peers because of her use of makeup. With the launch of Hwang In Youp also comes the introduction of Skin by BYS Minis. Exclusively available in Watsons, The SM Store, and online on Amorfia, Watsons and ShopSM, Skin by BYS Minis contains Botaniceutical Plus-10 at a more affordable and handy packaging. The set includes The Extra Gentle Milk Jelly Cleanser; a non-irritating formula suitable for all skin types and when used daily, yields a smoother and brighter complexion; Extra Hydrating Balancing Toner, a hydrating toner formulated with hyaluronic acid that helps restore skin elasticity and reduce fine lines while keeping moisture locked in. It also includes Extra Glow Brightening Serum, a lightweight serum rich in vitamin C and natural skin boosters including Papaya and Lime Fruit Extract for a more youthful, healthy glow; The Extra Glow Face Cream, a total brightening cream; Extra Brightening Eye Cream that visibly brightens the skin around the eyes and helps diminish puffiness, thanks to its anti-inflammatory properties and other natural skin boosters; and the Extra Effortless Pore Perfecting Sunblock, a weightless sunscreen with broad-spectrum SPF 50 PA+++, as well as pore-blurring and sebum-controlling properties. It has Green Tea Leaf Extract, which effectively protects the skin against UV damage, consequently preventing photoaging and weakening of collagen and elastin fibers. The serum, the face cream, and the eye cream have been reformulated to add BuleResisterWE, a polyphenol component of wine that aids in protection against exposure to the high-energy blue light emitted from screens, which cause premature aging. Along with the six products, the set also comes with two limited-edition Hwang In Youp photocards. “I apply sunscreen every day,” Hwang In Youp shared in a video sent to Philstar.com the one skincare product every guy like him should have. “I think that applying sunscreen to block UV rays is the most basic and healthy formula for the skin. I think sunscreen is what I need the most.” RELATED: WATCH: ‘True Beauty’ star Hwang In Youp misses lechon, Davao Philstar.com is one of the most vibrant, opinionated, discerning communities of readers on cyberspace. With your meaningful insights, help shape the stories that can shape the country. Sign up now! ",
    "datetime": null,
    "url": "https://www.philstar.com/lifestyle/fashion-and-beauty/2021/09/30/2130833/k-beauty-men-hwang-youp-shares-secret-his-true-beauty"
}