{
    "title": "K-Beauty Set to Gain From China’s Latest Cosmetics Tax Cuts",
    "text": "Diplomatic relations remain strained between South Korea and China, but Chinese consumers are still obsessed with Korean beauty products as China’s new imported cosmetics tax cut boosts the spirits of investors in Korean brands. Starting on October 1 in time for the Golden Week travel period, the Chinese government cut the consumption tax on imported “premium” cosmetics in half (from 30 percent to 15 percent) and completely removed it for “mass-market” cosmetics from abroad. This marks a significant price cut, as the tax rate used to be a staggering 84 percent with the combination of import tariff, value-added tax (VAT), and consumption tax. Now, “luxury” beauty products see a total tax rate of 51 percent, and regular items will be taxed 29 percent. These tax cuts come at a time when Chinese consumers have been flocking to nearby South Korea and Japan to stock up on these countries’ beauty products for significantly lower prices than what they can get them for on the mainland. Chinese demand for Korean beauty products, or “K-beauty,” has been especially massive along with the popularity of K-pop, and reports have found that exports to China remain strong even in the wake of China’s anger over South Korea’s decision to deploy the Terminal High Altitude Area Defense (THAAD) system (which resulted in China’s crackdown on K-pop). South Korea recently became China’s second-largest foreign source of cosmetics imports after France, and after the tax cuts went into effect, South Korea’s two largest cosmetics conglomerates Amorepacific and LG Household & Health Care saw a boost in share prices. Until now, a good chunk of Chinese spending on Korean beauty brands has been in South Korea itself or duty-free shops, however—72 percent of Amorepacific’s revenue is made in the country. But amidst slowing economic growth and more Chinese shoppers heading abroad, the Chinese government is hoping to “repatriate” a growing amount of its consumer spending on foreign goods. In early September, Bloomberg reported that the government has been looking to overhaul its tax policies with cosmetics tax cuts and several other policies, including changing the “luxury” categorization of some goods with high taxes as they become more widely used. China has been slashing taxes on imported goods as part of a bid to increase domestic consumption at a time when Chinese consumers have increasingly been opting to seek out cheaper prices while traveling abroad or through the gray market. It enacted two rounds of cuts in 2015, but has been employing both a carrot and stick to shrink the gray market by cracking down on daigou agents smuggling goods into the country at the same time. Experts are saying that in the luxury segment, the significant price difference that remains will likely still deter many shoppers from buying cosmetics domestically. But for mass-market Korean brands, the price is more within reach. The change also comes at a time when controversy is taking place on South Korea’s Chinese traveler hotspot Jeju Island after 100 Chinese tourists were blocked from entering the island and forced to wait at the airport over not having the right paperwork over the Golden Week holiday. But there’s still strong incentive to buy beauty products abroad, especially when it comes to skin cream. The Chinese government’s definition of “cosmetics” for the tax cuts excluded skincare products, which are a big focus of Korean brands (and massively popular with Chinese consumers). Skincare actually saw an increase of 15 percent tax for the premium category, meaning that China’s shoppers aren’t likely to stop heading to Seoul to stock up at Lotte and Shinsegae in the near future. Beauty, Market Analysis, Policy china, china luxury, k-beauty, korean, Luxury, tariffs, taxes © 2023 Herlar, LLC. All rights reserved. Jing Daily® is a registered U.S. trademark of Herlar, LLC. Sign up for our daily newsletter to unpack the business of luxury in China. Gain insights, analysis, and breaking news from our on-the-ground reporters. Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. ",
    "datetime": "2016-10-11T22:53:49+00:00",
    "url": "http://jingdaily.com/k-beauty-set-to-gain-from-chinas-latest-cosmetics-tax-cuts/"
}