{
    "title": "K-Beauty YouTuber Dawn Lee Dies After Cancer Battle | Hypebae",
    "text": "Dawn Lee, a content creator who led HYPEBAE’s list of K-beauty YouTubers to follow in 2021, has died after a two-year fight against cancer. Also known by the name Saebyeok, Lee was diagnosed with lymphoma in 2019. Instead of taking a break from work, the beauty guru openly shared her cancer and chemotherapy journey with the world to deliver messages of hope for all. The YouTuber, whose story was covered on major platforms like ABC News and BBC, was loved for her uplifting and positive energy, as well as her down-to-earth personality. “My precious friend and labelmate Dawn (Lee Jung Joo) has passed away this morning. I do not know how I can express my sadness for her passing… Her bright smile and voice will continue to shine,” Kim Eunha, the CEO of Lee’s label Ice Creative, shared in a statement. “I will never forget her courage and mindset for never losing hope despite the long battle.”\nFans of the late content creator have been commemorating her life by commenting messages of love on her final Instagram and YouTube posts. Back in April, Lee updated her followers with a video shot in Busan, where she shares that she is in the process of getting better.\nOur deepest condolences are with everyone affected by the death.\n\n\n\n                                                            Read Full Article Fans of the late content creator have been commemorating her life by commenting messages of love on her final Instagram and YouTube posts. Back in April, Lee updated her followers with a video shot in Busan, where she shares that she is in the process of getting better.\nOur deepest condolences are with everyone affected by the death.\n\n\n\n                                                            Read Full Article Our deepest condolences are with everyone affected by the death.\n\n\n\n                                                            Read Full Article    Keep updated on the latest news.  Keep updated on the latest news. We charge advertisers instead of our readers. Support us by whitelisting our site. Whitelist Us Already whitelisted us?\n                        \n                            Refresh page ",
    "datetime": "2021-05-31T02:26:33-04:00",
    "url": "https://hypebae.com/2021/5/k-beauty-youtuber-dawn-lee-saebyeok-korea-dead-cancer-battle-lymphoma"
}