{
    "title": "K-Beauty 2022: What’s Next In Beauty From Korea | BEAUTY/crew",
    "text": "Experts reveal the latest findings from Seoul BEAUTYcrew Beauty Editor / October 28 2021 We think we can all agree that K-Beauty is a global phenomenon at this point. Whether Korean’s are teaching us how to have skin so clear it resembles literal glass or dishing out factoids about unusual yet effective ingredients, (who knew snail mucin had so many skin care benefits?) Korea is just a cut above the rest when it comes to revolutionary beauty finds. And if you thought the K-Beauty train was losing steam, you’d be wrong. The mecca for all things beauty never sleeps when it comes to furthering innovations in the beauty space and we’re forever grateful to our Korean friends for their dedication to their craft.In fact, Seoul-based Lauren Lee, a K-Beauty expert and the founder of Australia’s first online K-Beauty destination Style Story, and Meaghan Payne, the Marketing Manager for the luxury K-Beauty brand Sulwhasoo, both have plenty to share about the country's latest beauty trends and innovations. According to Lee, Korean skin care has been influenced by a global skin concern: maskne. “Masks have been mandatory in Korea since March 2020, and are resulting in symptoms like dryness, redness, irritation and ‘maskne’,” Lee explains. So just how are our Korean friends dealing with all that maskne, you may ask? Well, it turns out they’re turning to ‘low-irritation’ cosmetics, “designed to soothe angry pores and skin troubles”. Think: Pimple patches and centella-infused skin care, AKA some of our favourite K-Beauty exports. “Hydrocolloid pimple patches, as well as those featuring ingredients like ceramides, Centella asiatica (AKA cica/Tiger’s Grass) and mugwort are all popular at the moment, thanks to their skin soothing and anti-inflammatory properties,” says the Style Story founder. We recommend:COSRX Acne Pimple Master Patch; AHC Aqualuronic Serum; and KLAIRS Midnight Blue Calming Sheet Mask. COSRX Acne Pimple Master Patch AHC Aqualuronic Serum KLAIRS Midnight Blue Calming Sheet Mask Along the same sensitive skin-friendly vein, is a shift towards the streamlining of steps.“[It’s about] using fewer products to get the same results,” explains Lee. “A lot of the newer formulations are combining the benefits of several products into one.” Some of her favourite multipurpose finds? “Laneige’s Cream Skin Refiner combines the benefits of a cream in a toner,” she recommends. “[And] Subi’s Brightening Powder Cleanser functions as both an exfoliator and a foam cleanser depending on how much water you use with it.”Lee’s own skin care range Jelly Ko also boasts a “Bubble Tea Steam Cream [that] has a 3-in-1 formula that replaces oil, serum and moisturiser in your routine.” Laneige’s Cream Skin Refiner Subi’s Brightening Powder Cleanser Jelly Ko Bubble Tea Steam Cream “Not only does this cut down on the steps in your routine, it also contributes to less waste and fewer carbon emissions in transporting products across the globe,” she says. “This is a key growth area in the industry.” It’s a point that Payne reiterates, telling us that Amore Pacific (Sulwhasoo’s mother company) has committed themselves to providing eco-friendly options for customers that doesn’t just stop with eco-conscious packaging. “Eco practices have always been of the utmost importance to Amorepacific and its brands and we are seeing a big focus on this,” she says. “Amorepacific Group has opened the very first Refill Station in the Korean beauty industry… [it] offers an eco-friendly refill bottle that uses 30 per cent less plastic and invites customers to fill up the bottle with 15 kinds of products including shampoo and body wash, as much as they need.” When it comes to trend-setting albeit unique skin care ingredients, the beauty hub simply can’t be beat. “K-Beauty brands place a lot of emphasis on new ingredients because Korea is a very trend-based market,” explains Lee. Up first for the newcomers to know about is ‘Yuzu’, otherwise referred to as Yuja in Korea. “[It’s] a type of citrus fruit that’s naturally full of vitamin C,” says Lee “It’s great for brightening so you’ll see it in a lot of serums targeting dull skin, dark spots and pigmentation.” Korea’s love for centella is still going strong too, says Lee, and is “more popular than ever because it is perfect for soothing weary, irritated, damaged, red and acne-prone skin.” “You’ll find it in everything from face masks, to cleansers, toners, serums, moisturisers and even sleeping masks.” Mugwort, an ingredient typically used in traditional Korean medicine for its “soothing and anti-inflammatory properties,” is also a big winner because “it’s ideal for dry, irritated skin.” As too are probiotics, “which are useful to support a healthy microbiome and reduce symptoms of dryness, redness, irritation and inflammation,” says Lee. “Look out for products featuring Lactobacillus ferment lysate, Bifida ferment lysate, Galactomyces ferment filtrate and Saccharomyces ferment filtrate,” to try them for yourself. As for Sulwhasoo, Payne says the brand has turned to ancient Korean medical methodologies, utilising “cutting edge skin science” to study the “efficacy of 3,912 complex herbs, with in-depth research on women’s skins of all ages,” namely the brand’s hero ingredient – Korean Ginseng – “and its preservation for anti-ageing efficacy.” “Hanbang ingredients are traditional herbal ingredients used in Korean medicines and they’ve long been a staple in Korean life,” she explains. But just what should you be looking for in terms of ingredients? According to Payne herbs such as “ginseng root, sacred lotus, and rehmannia [all] boast anti-ageing, anti-inflammation, and regenerative properties.” We recommend: SULWHASOO First Care Activating Serum; DEAR DAHLIA Skin Paradise Tone-Up Sun Cushion; and SULWHASOO Bloomstay Vitalizing Water Lotion. SULWHASOO First Care Activating Serum DEAR DAHLIA Skin Paradise Tone-Up Sun Cushion SULWHASOO Bloomstay Vitalizing Water Lotion Makeup is the last thing on anyone’s minds during a global pandemic, but Korean’s are still finding ways to look polished without a full beat, focusing on the nails and eyes instead. “Koreans are turning to procedures like eyelash extensions, lash tints and lifts to accentuate their eyes, as they are one of the few features you can see from behind a mask,” Lee explains. There’s also “a lot more modern art-inspired abstract nails that are relatively simple in design,” says Lee. “3D nail techniques are also very popular, using different textures to create shapes on the nails.” Image credit: @nail_unistella BRB while we Google how to DIY 3D nails... Meanwhile, over at AmorePacific, the company has been focusing its energy on AI technologies that don’t require face-to-face human interaction, explains Payne. “We are seeing a shift towards customisation, especially in the AI space, delivering a series of bespoke solutions to optimise the customer experience.” This includes things like personalised lip makeup products, foundations and serums, in an effort to “provide the best products and services for individual customers.” After the past year and half we’ve had, the entire globe is ready for some escapism. And according to Payne, we’ll likely be seeing a roll-out of “beauty and skin care products that offer more meditative, soothing, and spa-like moments.” “K-beauty and skin care have to be functional [and] effective, [but also] able to mentally transport you to another headspace,” she explains. “Korea has always been innovative in the beauty space, providing a cure for skin problems by nurturing our customers from inside to outside, and taking care of them as a person through the skin – a genuine approach that roots from the hanbang spirit.” And perhaps that’s the very reason why we can’t (and won’t ever) get enough of K-Beauty. Effective products with a slice of otherworldly heaven? Take us to Seoul. Loved this? Read more from our digital issue. Main image credit: Getty  Briar is the Beauty Editor at BEAUTYcrew. Her 'down for anything' attitude has resulted in more than a handful of hair transformations, and she doesn't mind being used as a guinea pig for the industry's most unusual products and treatments. Her work has also appeared on Refinery29, Girlfriend and beautyheaven. Korean beauty / Korean beauty products / Korean skin care / K-beauty / Sulwhasoo / Style Story / Lauren Lee / Meaghan Payne / Cosrx / AHC / klairs / Laneige / Subi / Jelly Ko / dear dahlia / k-beauty trends / Article Article Article Article Article Article Article Article Gallery Article Article Gallery Gallery Gallery Article Article Gallery Article How-To How-To Gallery © Copyright  2023 Are Media PTY LTD All products are independently selected, tested or recommended by our team of experts. If you buy something, we may earn an affiliate commission.\r\n                                            Are Media and its brands may have generated text partially using generative AI. Upon generating draft language, our editors review, edit, and revise it to their own liking. \r\n                                            We take ultimate responsibility for the content of our publications. © Copyright  2023 Are Media PTY LTD All products are independently selected, tested or recommended by our team of experts. If you buy something, we may earn an affiliate commission.\r\n                                Are Media and its brands may have generated text partially using generative AI. Upon generating draft language, our editors review, edit, and revise it to their own liking.\r\n                                We take ultimate responsibility for the content of our publications. © Copyright  2023 Are Media PTY LTD All products are independently selected, tested or recommended by our team of experts. If you buy something, we may earn an affiliate commission.\r\n                            Are Media and its brands may have generated text partially using generative AI. Upon generating draft language, our editors review, edit, and revise it to their own liking.\r\n                            We take ultimate responsibility for the content of our publications. ",
    "datetime": "2021-07-14 00:00:00",
    "url": "https://www.beautycrew.com.au/korean-beauty-trends"
}