{
    "title": "K-Beauty Sales Surge in the Middle East | BoF",
    "text": "Agenda-setting intelligence, analysis and advice for the global fashion community. Data from Turkish e-commerce player Trendyol reveals that sales of South Korean cosmetics on its platform are up fivefold from last year, Nikkei Asia reports. The news points to the K-beauty industry’s thriving export market. According to Alibaba-backed Trendyol, which began selling K-beauty in 2018, 2020 was a “milestone year” for the category: the company sold over 665,000 K-beauty products, up from 135,000 in 2019, and beat last year’s sales volume this April. K-pop, combined with a proliferation of e-commerce and influencer recommendations are said to be behind the boom. Korea’s cosmetics exports to the Middle East hit $7.8 million in June, up from $7 million in June 2020 and $4.3 million in June 2019, according to Korean trade authorities. The region is still a small market compared to China, the US and Japan, but demand is growing fast. Learn more: K-Beauty’s Golden Age Is Ending. What Comes Next? Their 10-step routines, snail serums and sheet masks took the world by storm 10 years ago. Now, Korean beauty brands are facing a fiercely competitive market and need to think outside the box. © 2023 The Business of Fashion. All rights reserved. For more information read our Terms & Conditions The Melbourne-based multi-brand retailer has kept both local and international competitors at bay with a regional store footprint four times larger than Sephora’s. This week’s round-up of global markets fashion business news also features Chinese investment in Egypt’s textile industry, plans to save Costa Brazil and fresh calls for Bangladeshi garment factories to pay workers more. This week’s round-up of global markets fashion business news also features the Chinese boycott of Japanese cosmetics, Mexico’s designer showcase and the industry impact of the Middle East crisis. This week’s round-up of global markets fashion business news also features Pacific India’s growing mall network, Dubai Fashion Week and Alibaba’s denial of espionage allegations. The essential daily round-up of fashion news, analysis, and breaking news alerts. Our newsletters may include 3rd-party advertising, by subscribing you agree to the Terms and Conditions & Privacy Policy.   ",
    "datetime": null,
    "url": "https://www.businessoffashion.com/news/global-markets/k-beauty-sales-surge-in-the-middle-east/"
}