{
    "title": "K-Beauty Brand Apologises for Eco-Friendly ‘Paper Bottle’ That’s Actually Plastic | BoF",
    "text": "Agenda-setting intelligence, analysis and advice for the global fashion community. South Korean makeup and skincare brand Innisfree’s sustainability credentials are under fire after a customer found that eco-friendly packaging it marketed as a “paper bottle” was actually a plastic bottle concealed in paper wrapping, The Korea Herald reports. The discovery was made by a customer who posted images of the bottle in a Facebook group dedicated to plastic-free shopping. In a statement published by The Korea Herald, Innisfree said it “overlooked the possibility that the naming could mislead people to think the whole packaging is made of paper” and apologised for the confusion caused. The brand added that the plastic bottle, which is recyclable and came with recycling instructions, uses less plastic than typical beauty packaging, but that statement failed to quell concerns over alleged greenwashing. The anonymous netizen who made the post deemed the apology “insufficient”. © 2023 The Business of Fashion. All rights reserved. For more information read our Terms & Conditions The Melbourne-based multi-brand retailer has kept both local and international competitors at bay with a regional store footprint four times larger than Sephora’s. This week’s round-up of global markets fashion business news also features Chinese investment in Egypt’s textile industry, plans to save Costa Brazil and fresh calls for Bangladeshi garment factories to pay workers more. This week’s round-up of global markets fashion business news also features the Chinese boycott of Japanese cosmetics, Mexico’s designer showcase and the industry impact of the Middle East crisis. This week’s round-up of global markets fashion business news also features Pacific India’s growing mall network, Dubai Fashion Week and Alibaba’s denial of espionage allegations. The essential daily round-up of fashion news, analysis, and breaking news alerts. Our newsletters may include 3rd-party advertising, by subscribing you agree to the Terms and Conditions & Privacy Policy.   ",
    "datetime": null,
    "url": "https://www.businessoffashion.com/news/global-markets/k-beauty-brand-apologises-for-eco-friendly-paper-bottle-thats-actually-plastic/"
}