{
    "title": "K-Beauty Brand Dear Dahlia New Makeup Collection | Hypebae",
    "text": "A K-beauty brand known for its aesthetic packaging and vegan formulas, Dear Dahlia has now released a collection of new makeup products ranging from eyeliners to lipsticks. With a diverse selection of finishes including shimmery and matte, you can add these new goods to your summer routine. Kicking off the latest collection are four Mesmerizing Moment eyeshadow palettes featuring eight shades each. “Golden Goddess” boasts an array of warm fall-ready colors like beige and brown, while “Moonlight Silhouette” includes pearl finishes. To complete a statement look, you can add the Mystic Daze Hypnotic Shine Eye Sequins for a multi-dimensional sparkle. Eye makeup looks can be further defined with the Paradise Dream Precision Pro Liquid Eyeliner, a water-resistant and smudge-proof formula perfect for summer days, as well as the Paradise Dream Volume & Long Lash Mascara that provides lightweight volume to the lashes. Adding to the range are lipstick options, including the Lush Sensuous Matte Lip Suit, an air-fit formula arriving in eight colors.\nPeep Dear Dahlia’s new collection above. You can head over to the label’s website to shop the latest arrivals, priced from $31 USD to $58 USD.\n\n\n1 of 12\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear Dahlia\n\n\n2 of 12\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear Dahlia\n\n\n3 of 12\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear Dahlia\n\n\n4 of 12\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear Dahlia\n\n\n5 of 12\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear Dahlia\n\n\n6 of 12\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear Dahlia\n\n\n7 of 12\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear Dahlia\n\n\n8 of 12\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear Dahlia\n\n\n9 of 12\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear Dahlia\n\n\n10 of 12\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear Dahlia\n\n\n11 of 12\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear Dahlia\n\n\n12 of 12\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear Dahlia\n\n\n\n\n\n\n                                                            Read Full Article Peep Dear Dahlia’s new collection above. You can head over to the label’s website to shop the latest arrivals, priced from $31 USD to $58 USD.\n\n\n1 of 12\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear Dahlia\n\n\n2 of 12\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear Dahlia\n\n\n3 of 12\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear Dahlia\n\n\n4 of 12\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear Dahlia\n\n\n5 of 12\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear Dahlia\n\n\n6 of 12\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear Dahlia\n\n\n7 of 12\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear Dahlia\n\n\n8 of 12\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear Dahlia\n\n\n9 of 12\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear Dahlia\n\n\n10 of 12\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear Dahlia\n\n\n11 of 12\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear Dahlia\n\n\n12 of 12\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear Dahlia\n\n\n\n\n\n\n                                                            Read Full Article Dear Dahlia Dear Dahlia Dear Dahlia Dear Dahlia Dear Dahlia Dear Dahlia Dear Dahlia Dear Dahlia Dear Dahlia Dear Dahlia Dear Dahlia Dear Dahlia    Keep updated on the latest news.  Keep updated on the latest news. We charge advertisers instead of our readers. Support us by whitelisting our site. Whitelist Us Already whitelisted us?\n                        \n                            Refresh page ",
    "datetime": "2020-08-09T22:34:46-04:00",
    "url": "https://hypebae.com/2020/8/dear-dahlia-korean-k-beauty-eyeshadow-palettes-lipsticks-suits-eyeliners-mascara-makeup"
}