{
    "title": "K-Beauty Skincare Gifts for Everyone on Your List this Holiday",
    "text": "View Our Print IssuesBack to Main Site  See Our Newsletters Share November has arrived, and we’re *officially* gearing up for the holiday season. With so many loved ones on our list, it can be overwhelming to find a gift that’s just right. May we suggest: the gift of healthy, radiant and clear skin? While you’re probably already familiar with the delights of K-Beauty (sheet masks and essences and sleeping packs, oh my!) there’s a good chance that your inner circle hasn’t quite discovered Korean skincare beauty rituals yet. So treat them to the best of Korean skincare from cult-fave brand belif—trust us, making your list and checking it twice has never been easier. If your bestie knows the joys of jet-setting around the world, she also knows about the parched skin that accompanies long flights, layovers, and jet lag. Treat her to belif‘s Moisture Miracle Set, a trifecta of *megadose* moisture containing The True Cream – Moisturizing Bomb, Moisturizing Eye Bomb, and Aqua Bomb Jelly Cleanser. Together they provide intense hydration for a healthy glow that’ll take her from arrivals to departures and everywhere in between.  After long hours of squinting at the computer screen, your work wife knows the value of a good eye cream (if she doesn’t, she’s about to!) Gift her belif’s Aqua Surf’s Up Moisturizing Eye Bomb Set, which features a full-size Moisturizing Eye bomb and two deluxe minis of belif’s best-selling moisturizers, formulated with hydrating comfrey leaf and elasticity-boosting pennywort. She’ll feel pampered and extra bright-eyed at your next quarterly meeting, and have you to thank.   So your sis already knows the delights of K-Beauty? Then she’ll really appreciate a super-hydrating boost to her winter skincare regimen (it’s just what everyone needs during cold winter months). Your average beauty rookie may not appreciate the significance of a splash of a hydrating toner, but the truly skincare-obsessed will be over the moon with belif’s Aqua Bomb Hydrating Toner, a Sephora-exclusive specifically designed for Aqua Bomb lovers, formulated with moisture-locking baobab and smoothing honeysuckle.  What to get the woman who gave you life? While it’s hard to find a gift that compares to everything she’s given you, belif’s Youth Creator-Age Knockdown Bomb comes pretty close. This anti-aging serum comes in the form of a uniquely textured bouncy gel that fills in fine lines and pores flawlessly, and boosts elasticity for smoother, firmer skin. It’s packed with ingredients like winter aster to support a healthy complexion and water pennywort to soothe skin. So you *might* just be Mom’s favourite this year.  Ask any new mom about her sleep schedule, and there’s a good chance she’ll respond “what sleep schedule?” To make her precious hours of shut-eye count more, gift her belif’s Aqua Bomb Sleeping Mask, an innovative jelly-pudding sleeping mask that replenishes fatigued, dull skin with a burst of hydration, giving her that “I-just-slept-10-hours-straight” look she craves. It has the power to rejuvenate and wake up skin overnight. The pillow-proof formula is lightweight and fuss-free, meaning mama can slather it on before bed and wake up feeling refreshed (even if it’s at 3 a.m. to a baby monitor). Bonus: It’s also great for warding off the “hungover” skin after a night of cocktail-filled holiday festivities.  Whether you’re close friends or friendly colleagues, your secret santa is sure to love the limited edition Ho-Ho Holiday Kit because it’s perfect for every single skin type. The cult lineup features belif’s must-have skincare minis curated to keep skin extra hydrated and glossy, so they’ll be glowing all the way through winter and into the New Year. Share As someone who experienced adolescence in the early aughts, I'll be the first to admit that I love a celebrity-owned beauty line. In 2002, JLo launched Glow—a skin-like fragrance housed in curvy frosted glass—and I practically begged my mother to buy me a bottle. She eventually caved, and I was thrilled to own such a grown-up scent. Two years later, Britney Spears dropped Curious and you couldn't walk past a group of teenage girls without… “It’s a bit of a dumpster fire” is a sentiment echoed by thousands. How we got here, and what can help They were snapped on sunny Canouan, St. Vincent. Let's all go? From Lauren Chan's scarlet ensemble to Sarain Fox's repurposed parka She and Jeanne Beker talk fashion's glory days, their breast cancer journeys and anti-aging's downside    SIGN UP FOR OUR NEWSLETTERSGet the latest beauty and fashion news, trends, contests and more - straight to your inbox  Thank you for signing up!  Δ © The Kit 2022, The Kit, a division of Toronto Star Newspapers Limited 8 Spadina Ave, 10th floor The Well, Bldg G, Toronto, ON, M5V 0S8, 416-945-8700 ",
    "datetime": "2019-11-01T12:00:01+00:00",
    "url": "https://thekit.ca/beauty/belif-christmas-gifts/"
}