{
    "title": "\n\t\tK-Beauty’s popularity in the country | \t\tKuensel Online\t",
    "text": "Main story: If you have never heard, let alone used, a Korean cosmetic product made from snail’s slime or bee-venom or bird droppings and mud, then you may be seriously missing out on the latest beauty trend that’s sweeping the globe. You may also be left behind if you don’t spend an hour or two every week wearing a Korean facemask made from green tea, rose to black berry. These products are at the forefront of the latest trend to hit the global skin care and cosmetics industry. Bhutan too is hit by the K-Beauty, also known as Korean Beauty after the K-Pop wave. A shop, Korean Cosmetics Love, has been opened in Thimphu. The shop was opened after the online selling of Korean cosmetics became a hit in Thimphu. Located next to a high-end hotel, the small and well-decorated shop sells most of the Korean cosmetics that are topping the sales chart. One can find the snail cream, which is supposed to stimulate the formation of collagen and elastin in skin. The cream promises everything from skin lightening, wrinkle prevention and moisturising. There are facemasks made from mud, which are effective dirt and grimes remover from skin, followed by make up products that promises perfect and flawless skin. Owner of the shop, Sonam, said she became a Korean skincare routine and cosmetics enthusiastic after she tried some herself for a few months. “I noticed a considerable change on my skin. It became better in many ways. This boosted my confidence and I started researching on Korean beauty, which led to so many videos and blogs all pointing towards the positive benefits of these products,” Sonam said. “Since my skin became better. I wanted others to have the same experience and I decided to sell these products.” Sonam started selling a few products online, which garnered a lot of attention from women throughout the country. After a year of online business, Sonam opened a shop, which attracts a lot of customers. “I am surprised to see how young children are into skin care these days,” Sonam said, adding that it shows that people, especially women, are realising the importance of taking care of their skin. Buying these products can be expensive, especially if one follows the Korean beauty’s 10 to 12 steps. Thus, customers are advised to buy one product at a time. Just a bit shocked, because doctor at www.papsociety.org/accutane-isotretinoin/ told me to take Accutane and it really helped things get better. He has never said anything about sunscreen when I had Accutane therapy. I mean that, but if that is enough for my skin tone I think it’s a bit questionable. “Korean beauty has taken the world by storm. It shows that young people are exposed to different cultures and way of living through the Internet and movies,” said Sonam Tandin, 26, a corporate employee, said that Korean beauty fascinated her after she watched several Korean dramas where the actors always have flawless skin. “I thought it was the diet and climate that made a difference but I realised that it was the products that made the entire difference to one’s skin,” Tandin said. “I don’t mind investing in these products as long as my skin feels good. I recommend people to try a few products before they indulge in the famous 10-step Korean beauty regime.” For Tandin, using the various Korean beauty products is going to be a lifelong indulgence. For thousands of years, Korean women have favoured the standard of female beauty as having a fair skin, peachy cheeks and cherry-red lips, and they have maintained this standard with remarkable consistency. This standard of beauty doesn’t come easy. Korean women are said to follow these steps to achieve this look. The 10 steps skin care routine Makeup remover and oil cleanser With a cotton pad or a cleansing wipe, use a makeup remover to get rid of all the makeup, dirt and environmental impurities. Also try using an oil-based cleanser. Massage it over your dry face and neck to break up the makeup, add a splash of lukewarm water to emulsify, and massage again, rinsing everything away. Water-based cleanser Korean women never fail to do the double-cleanse. Use a water-based cleanser to wash your face or whisk away any residue from your oil cleanse and the remaining impurities with it. Exfoliation Exfoliating is crucial for a polished complexion. Do it twice a week depending on one’s type of skin. Gently massage and exfoliate the skin for a smoothest and softest-feeling skin. Toner Time to prep your skin with toner. You can sprinkle into your hands and tap directly onto your skin or dispense onto a cotton round and gently swipe all around your face working outwards. Toner helps balance your skin’s pH levels and prepares your skin with a bit of hydration to better absorb your following skin care treatments. Essence You can consider essence the heart of a Korean skin care routine. A bit dual purpose, essence is a kind of toner and serum hybrid made for hydrating and aiding skin repair and cell turnover. Apply it directly to freshly toned skin with your hands and pat it in. Serums, boosters and ampoules Time for treatment products—consider boosters, serums and ampoules the concentrated essence. You can apply these in the same manner. These products can address any issues including skin brightening, pore refining, pigmentation, wrinkles, acne—this is your skin-perfecting step. Sheet masks If essence is the heart of a Korean skin care routine, the sheet mask is its soul. It’s a quiet meditative, skin-nourishing ritual that imparts maximum treatment into your skin while you relax for the next 20 minutes, looking a bit like a damp ghost. Can be used for once or twice a week, depending on your preference. Eye cream The skin around your eyes is the most delicate skin on your face and should be treated like the fragile flower that it is, with extra helpings of hydration and protection. Use your ring finger to very gently tap—never rub—eye cream around the entire orbital bone, avoiding the water line. Moisturiser Hydration is your express lane to dewy glowing skin. Finding a moisturiser that works for your skin type is a crucial step to protecting your skin. They come in many different forms so it shouldn’t be too hard—like an emulsion, a lotion, gel or cream. Morning and evening, pat a moisturiser all over face and neck to keep skin protected and hydrated, sealing in all the work from your other steps. Sun protection Even if you’re stepping outside for a few minutes, sunscreen is the best thing you can do to prevent premature aging. Apply every morning and reapply throughout the day as needed. It’s important as the last step so it can shield your skin from the harmful effects of UV rays without being diluted by all your prior skin care products. Info courtesy: www.sokoglam.com Thinley Zangmo October 26th, 2023 In his young days, Ap Kinlay was known for... October 24th, 2023 “Did you resort to corruption?” An election official asked... October 23rd, 2023 The well-being of our youth remains a paramount concern.... October 21st, 2023 Right to a reasonable price and the right to... October 21st, 2023 In the tranquil valleys and towering mountains of Bhutan,... October 14th, 2023 Bhutan has emerged as one of the few countries... October 26th, 2023 With the elimination of para-archer Pema Rigsel on October... October 24th, 2023 Of the four para-athletes representing Bhutan at the fourth... October 24th, 2023 Team Bjibjokha-Lobesa United beat team PSG-PHPA I 4-3 in... September 14th, 2023 Bhutan, a forest-abundant country, aims to earn a revenue... June 10th, 2023 A decade ago, the prospect of poultry farming drew... June 10th, 2023 Demand for eggs has spiked in the capital as... Copyright © 2021 kuenselonline. All rights reserved ",
    "datetime": null,
    "url": "https://kuenselonline.com/k-beautys-popularity-in-the-country/"
}