{
    "title": "K-Beauty Brand NONFICTION Launches at Sephora | Hypebae",
    "text": "Based in South Korea, NONFICTION is a rising lifestyle and beauty brand that formulates perfumes, scented hand and body wash, creams and more. One of the country’s go-tos for fragrances, the label is finally branching out to the global market, kicking off with Hong Kong via Sephora. NONFICTION’s products are largely divided into its five signature scents, which are all available in perfume, hand and body wash and hand cream form. “Santal Cream” boasts notes of sandalwood, vetiver, fig and ginger, while “Gentle Night” is a sweet suede scent with hints of cedarwood and moss. “Gaiac Flower” is a floral aroma with a touch of vanilla, and “Forget Me Not” is comprised of basil, pepper, gardenia and amber. Rounding out the lineup is “In The Shower,” which comes with bitter orange, Campari and patchouli. In addition to the scented goods, NONFICTION is also loved for its vegan lip balm, a moisturizing formula packed with macadamia seed oil and jojoba oil. Peep some of NONFICTION’s bestsellers above. The brand’s products will launch at Sephora Hong Kong on August 5.\n\n\n \n\n\n\n\n\n\n\n\n\n\nView this post on Instagram\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nA post shared by NONFICTION 논픽션 (@official.nonfiction)\n\n\n\n\n\n                                                            Read Full Article View this post on Instagram\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nA post shared by NONFICTION 논픽션 (@official.nonfiction) A post shared by NONFICTION 논픽션 (@official.nonfiction) A post shared by NONFICTION 논픽션 (@official.nonfiction) Read Full Article    Keep updated on the latest news.  Keep updated on the latest news. We charge advertisers instead of our readers. Support us by whitelisting our site. Whitelist Us Already whitelisted us?\n                        \n                            Refresh page ",
    "datetime": "2021-08-04T02:22:56-04:00",
    "url": "https://hypebae.com/2021/8/nonfiction-korean-beauty-lifestyle-brand-sephora-hong-kong-launch-perfumes-body-hand-wash-info"
}