{
    "title": "K-Beauty products are now available at Woolworths.",
    "text": "A moment for some VERY good news. Because you can now buy a cult K-Beauty lip mask with your spaghetti sauce! WHAT A TIME. The Fresh Food People recently announced that K-Beauty products are now officially available for purchase online at Woolworths, via their ‘Everyday Market’. Watch: The Korean face mask trend taking over the world #skintertainment. Post continues below. The supermarket giant teamed up with Aussie K-Beauty platform STYLE STORY to offer cute little beauty aficionados (like me and you!) a diverse collection of affordable\nK-Beauty products. Meaning? Those notoriously hard-to-get products are now super accessible. I’m talking about products like Laniege’s beloved sleeping mask, CosRX’s game-changing snail mucin and Dr Jart’s Cicapair range. How good! *Squeals*. Wondering what K-Beauty gems you can pop in your online grocery cart? Here are some of my faves:    That famous snail jizz product everyone always talks about is now available at Woolies! It may seem 11/10 gross, but snail slime (it’s not *really* jizz) is actually a super common ingredient in most Korean skincare products. Why? Because it works wonders\nwhen it comes to calming stressed skin, while also keeping it hydrated and happy for longer. Image: Supplied. This is one of Dr Jart’s best-selling products, and it’s the absolute jam for sensitive and irritated skin. It’s also a real winner if you’ve gone too hard on the acid front and messed up your skin barrier, because it contains a heap of skin-loving ingredients\nto calm and soothe.    I’m not a big eye cream kinda gal (too lazy), but I’ve tried this little number from Innisfree before - and it’s bloody lovely. Keeps everything hydrated, happy and nourished. Never talks smack about you behind your back. Image: Supplied. I love this lip product. So, so much. I slap a thick layer on at night (my lips get DRY) and the next morning they’re smooth and moisturised. Which is the dream. There’s a whole heap of different flavours, but Berry is the OG and one of the best in\nmy opinion. (Closely followed by Gummy Bear). Image: STYLE STORY This jelly-textured pink sleeping mask is the easiest way to nab plump, juicy skin. Even if you’ve been doom scrolling into the wee hours of the morning. Even if you’ve been out on the fun juice. It’s cooling, doesn’t feel sticky\nand doesn’t mess around with sensitive skin. Image: Subi If there’s one thing I love, it’s taking off all the face junk from the day - SPF, makeup, the whole shebang. And a good cleansing balm is where it’s at. This one from Subi combines antioxidant-rich Australian lemon myrtle with sea buckthorn oil to melt\naway your day's face while nourishing the skin with fatty acids and vitamin E. Have you tried any of the above products before? What are your thoughts? Share with us in the comment section below. Feature image: Mamamia; Woolworths. TAKE SURVEY ➤ ",
    "datetime": "2022-04-05T06:00:59+00:00",
    "url": "https://www.mamamia.com.au/k-beauty-products-woolworths/"
}