{
    "title": "K-Beauty: How did Korea make its mark in the world of cosmetics? - Premium Beauty News",
    "text": "With a double-digit growth of its cosmetic exports in 2020 compared to the previous year (+15% according to data from the Korean Customs Service and the Korean Cosmetics Association [1]), South Korea is now one of the world’s leading exporters of cosmetics. In absolute value, Korean exports amounted, according to the same sources, to US$6.12 billion in 2020, while imports dropped by 0.7% to US$1.07 billion. With a different basis of calculation, the Ministry of Food and Drug Safety estimates the increase in exported beauty products at +16.1% in 2020 vs. 2019, or US$7.57 billion in value. These figures have enabled the Korean authorities to claim 3rd place among the world’s cosmetics exporting countries in 2020, after France and the United States, two countries which over the same period have seen their exports impaired by the Covid-19 pandemic. If Korean exports were able to maintain their dynamics in 2020, it is because they are still mostly intended for the Chinese market (50.3% of total exports), despite the country’s efforts to diversify its markets. However, the country has not been completely spared by the crisis, since according to the Ministry of Food and Drug Safety, the production of cosmetics decreased by 6.8% in 2020 to about US$13.4 billion. After China, the United States is the biggest importer of South Korean cosmetics. In Europe, \"France is the first importer of Korean cosmetics with 35%, followed by the UK (16%) and Germany (9%),\" explains Zoé Maillet, Marketing Specialist at KOTRA (Korea Trade-Investment Promotion Agency). The craze for K-Beauty actually took shape in the wake of what the Chinese media called, in the 1990s, the Hallyu, literally the \"Korean wave\": i.e., the growing popularity of the South Korean entertainment industry (mainly TV series and Korean Pop, but also movies and literature). Korean beauty first came to the fore through the worldwide success of some of its emblematic products, in particular, BB creams and cushion compacts, which were also adopted by European and US brands, eager to win over Asian consumers. At the same time, major Korean brands have capitalized on the success of these products to make a name for themselves, while skilfully relying on the development of travel retail to gain notoriety with the foreign public. But above all, Korean brands draw their strength from a particularly dynamic local market, where fierce competition calls for a capacity for innovation and a speed to market to which Western brands are not used. In this country, where skincare is a real concern for both women and men, large conglomerates such as AmorePacific or LG rub shoulders with ultra-dynamic indie brands such as Look at Me, When, Let Me Skin. Brands that have also built a reputation for naturalness, in line with consumer demand, particularly thanks to botanical ingredients such as green tea, ginseng or Centella Asiatica. On the industrial side, a rich network of suppliers and subcontractors first made its mark in serving Japanese brands, before becoming a world reference for its outstanding manufacturing methods and speed of production: significant assets in cosmetics where products and trends change rapidly. The Korean beauty routine is particularly attractive to Asian consumers because of its coherence. On the other hand, it is often considered too complicated in Europe and North America. \"It’s all about the layering method, which starts with a double skin cleansing with oil, then foam, an exfoliant, an essence, a serum, a mask, an eye cream, a face cream and then a sun cream,\" details Zoé Maillet. Will this very extensive beauty routine suffer from the desire of consumers to reduce their consumption and streamline their routines? Nothing is less certain! In Asia, consumers are much less concerned by the search for a minimalist routine and by the naked beauty trend. Moreover, the search for more natural products and healthy skin should be favourable to face cleansers, a strong asset of Korean brands. According to Zoé Maillet, \"the demand for cleansing products, such as facial oils, cleansing balms or cleansing foam, will soar in the coming years.\" The recent success of Cyca, a plant-based ingredient found in many Korean skincare products, including those of Dr Jart+, demonstrates the ability of brands from the land of the morning calm to constantly innovate and gain global recognition, probably for many years to come! Footnotes [1] Korea Customs Service (KCS) and Korea Cosmetic Association (KCA) The annual premium and luxury packaging trade show broke its attendance record for its 2023 edition, which was held... The expression “Beauty Tech & Skincare” now marks the entry of tech into the beauty sector. Several major brands offer to decode the... The quest for youth has existed for centuries, despite the inevitable effects of time on the body. Research shows that skin aging in... The quest for “in-and-out” beauty is gradually gaining ground in Europe, North America, and Brazil. This form of holistic beauty is meant... © 2023 Premium Beauty Media ",
    "datetime": null,
    "url": "https://www.premiumbeautynews.com/en/k-beauty-how-did-korea-make-its,19204"
}