{
    "title": "K-beauty dominates EWG’s latest “Best Bets” list ",
    "text": "Or wait... Headlines Brand Innovation Formulation & Science Packaging & Design Business & Financial Market Trends Regulation & Safety Promotional Features Site Archive Multimedia Regions All Asia-Pacific South East Asia South Asia East Asia Oceania Site Archive Multimedia Hot topics Clean & Ethical Beauty Sustainability COVID-19 Market Entry Anti-Aging / Skin Whitening Beauty From Within Nanotechnology Green Cosmetics Site Archive Multimedia Resources Type of resources Events All Events Shows & Conferences Online Events Editorial Webinars Events China 中国 Podcast  01-Jan-2019\n                            - Last updated on\n                                16-Dec-2018 at 07:44 GMT The ranking was determined after the EWG accessed more than 350 serums and essences from various companies across the world, cross-referencing its Skin Deep database. Affordable K-beauty serums and essences on the lists included Innisfree, Missha, COSRX, Purito and Olivarrier. The product category was made popular globally by the K-beauty wave. According to EWG, US sales of K-beauty products increased by almost 300% in the past two years alone. The new report showed that price is not always an indicator of quality. EWG highlighted that some of the most expensive products they analysed, scored poorly on its scale. “We analysed the ingredients used to make the serums and essences based on their hazard scores in Skin Deep,”​ said Kali Rauhe, an associate database analyst at EWG. “Sixty-six of the products met the strictest criteria for health and transparency, to earn the EWG VERIFIED mark. Five of these EWG VERIFIED products made our Best Bets list, meaning they are less hazardous for you and your wallet.”​ Among the five EWG VERIFIED products, three of were K-beauty products: one by Olivarrier and two by Purito. EWG noted that the rankings show that it is possible to create a trendy and desirable product that meets the standards for health and transparency that the EWG VERIFIED program dictates. “We wanted to highlight that product marketing, packaging and cost often have very little to do with the safety of the ingredients used in the product,”​ said Nneka Leiba, director of EWG’s healthy living science program. “Consumers are drawn to the design and price point without realizing that the information on the front of the package is not vetted by the Food and Drug Administration, the agency governing personal care products. So a company can claim almost anything and use almost any ingredients without penalty because they’re so poorly regulated.”​ The EWG said that the umbrella term “fragrance” was found in the ingredient lists of nearly half the products evaluated. According to the group, ingredients classified as fragrances term can be made up of a mixture of more than 3000 chemicals. Leiba stressed that such issues is why reforming cosmetics regulations is “urgently needed”. “Companies can use almost any ingredient to make their products… All of the ingredients used in consumer products should come with a cache of safety studies so we know how they’ll affect our health,” ​she said. Leiba added that in the meantime, consumers can take steps to ensure their safety by using tools like the EWG’s Healthy Living app or purchasing products with its EWG VERIFIED logo. In order to qualify for the EWG VERIFIED programme, companies have to follow several guidelines, such as disclosing all ingredients including ingredients used in fragrances, following standard ingredient naming guidelines, and following European Union's requirements for labelling fragrance allergens. Copyright - Unless otherwise stated all contents of this web site are © 2023 - William Reed Ltd - All Rights Reserved - Full details for the use of materials on this site can be found in the Terms & Conditions Related topics\nRegulation & Safety\nEast Asia\nGreen Cosmetics\nAsia in Focus\nSkin Care Show more  Content provided by Provital | 13-Jun-2023\n                     | Product Brochure Circanblue™ is a vegan postbiotic ingredient obtained from Lactococcus lactis that induces a resynchronisation of the skin’s circadian cycle after this... More promotional features ",
    "datetime": null,
    "url": "https://www.cosmeticsdesign-asia.com/Article/2019/01/01/K-beauty-dominates-EWG-s-latest-Best-Bets-list"
}