{
    "title": "K-Beauty YouTuber Posts Last Video About Cancer Journey Before Passing Away at 30",
    "text": "Korean beauty YouTuber Dawn Lee passed away at the age of 30 on May 30 after empowering many through her personal journey with cancer.  What happened: Lee passed away after two years of fighting lymphoma, according to a statement shared on Instagram from her agency, Ice Creative. Lee was diagnosed in 2019 and has been \"sharing her cancer and chemotherapy journey with the world to deliver messages of hope for all,\" reported Hypebae. Ice Creative's CEO Kim Eun-ha wrote that Lee was a \"bright light in this world\" and that she will always remember Lee's \"courage and bravery,\" according to Korea Times. In Lee's last video on April 15, she shares that she received the bad news from the hospital and was having \"serious mental breakdowns.\" The video has reached over three million views and fans have expressed their condolences and support. Fan reactions: Lee's last vlog is her highest viewed video and several fans commemorated her as an \"inspiration.\" \"You are such an inspiration, a true soul fighter...may your blessed soul rest in peace. Your legacy will live on,\" commented one of Lee's fans. Many commenters remembered her for her \"bright,\" \"cheery\" and \"positive\" energy throughout her battle. About Lee: Lee was a famous K-beauty YouTuber who was known for sharing vlogs featuring her daily life as well as fashion and beauty tips. She had 659,000 subscribers on Youtube and has 257,000 followers on Instagram. Many fans praised her for her authenticity and openness throughout her cancer and chemotherapy journey. In a BBC feature, she shared that she was telling her story because it's a \"big comfort\" to see someone in the same situation as you. Featured Image via @dawniscoming Enjoy this content? Read more from NextShark! Chinese Woman Assaulted and Robbed in SF Chinatown Comes Forward China's Game-Changing National Security Law Passes in Hong Kong Over 300 Rally Against Anti-Asian Hate With Asian American Federation in NYC Vietnamese Man Needs Staples in Head After Gunmen Beat Him, Steal Truck in New Orleans ",
    "datetime": null,
    "url": "https://news.yahoo.com/k-beauty-youtuber-posts-last-224130710.html"
}