{
    "title": "K-Beauty Brand Etude House Facing Capital Impairment as Losses Widen | BoF",
    "text": "Agenda-setting intelligence, analysis and advice for the global fashion community. The Amorepacific-owned Korean beauty brand, once on track to become a global business, is now worth less than the par value of its issued stock, Korea Times reports. Etude House’s total equity reached minus 6.6 billion won ($5.8 million), a result of 56.6 billion won in total liabilities exceeding its 49.9 billion won in total assets, Amorepacific said Tuesday. The brand has suffered cumulative net losses over the last four years, including asset impairment losses in 2019 and 2020. An Amorepacific spokesperson told Korea Times that the brand was checked for capital impairment after its operating loses widened last year, owing in part to its business in Hong Kong. Etude House was launched by Amorepacific in 1997 and rode the K-beauty wave through the 2010s; by 2016 it had opened 525 and 232 stores in Korea and abroad, respectively. But the brand’s earnings peaked in 2014, after which it began shuttering stores. Sales declined from around 300 billion won to 200 billion won in 2017 and further to around 100 billion won two years later. Among Amorepacific’s 37 subsidiaries, Etude House is the only brand facing capital impairment. The group told Korea Times it has not discussed closing down the brand. © 2023 The Business of Fashion. All rights reserved. For more information read our Terms & Conditions The Melbourne-based multi-brand retailer has kept both local and international competitors at bay with a regional store footprint four times larger than Sephora’s. This week’s round-up of global markets fashion business news also features Chinese investment in Egypt’s textile industry, plans to save Costa Brazil and fresh calls for Bangladeshi garment factories to pay workers more. This week’s round-up of global markets fashion business news also features the Chinese boycott of Japanese cosmetics, Mexico’s designer showcase and the industry impact of the Middle East crisis. This week’s round-up of global markets fashion business news also features Pacific India’s growing mall network, Dubai Fashion Week and Alibaba’s denial of espionage allegations. The essential daily round-up of fashion news, analysis, and breaking news alerts. Our newsletters may include 3rd-party advertising, by subscribing you agree to the Terms and Conditions & Privacy Policy.   ",
    "datetime": null,
    "url": "https://www.businessoffashion.com/news/global-markets/k-beauty-brand-etude-house-facing-capital-impairment-as-losses-widen/"
}