{
    "title": "K-BEAUTY REVIEW: Wakemake – Jelly Tok Tint (#01 Red Jelly, #04 Rose Jelly, #05 Cherry Jelly) – Pearl and Bubbles",
    "text": "Now originally I bought the Wakemake Jelly Tok Tint in #04 Rose Jelly and I enjoyed the texture of the tint so much that I decided to pick up #01 Red Jelly and #05 Cherry Jelly before I left Korea! These are advertised as having a jelly-like formula that is glossy and moisturizing (yay! moisture!). Now I’ve had enough time to fully experiment with using these tints, it’s time for a review :3 Keep reading to hear my thoughts on these tints… The Product: Type: Lip tint Volume: 4g Shades: 01 Red Jelly; 04 Rose Jelly; 05 Cherry Jelly Key Features: Glossy Lustre A jelly-like, glossy tint that provides smooth and glossy volume to the lips Intense Moisturization Glossy oil moisture layer that keeps the lips hydrated for hours Vivid Colour Highly saturated yet translucent with a single application Full Ingredient List: [01 Red Jelly]: Diisostearyl Malate, Purified Water, Diphenyl Dimethicone, Bis-Diglyceryl Polyacyladipate-2, Octyldodecanol, Hydrogenated Polyisobutene, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Butylene Glycol, Cetyl PEG/PPG-10/1 Dimethicone, Glycerin, Polysorbate 60, PEG-10 Dimethicone, Sorbitan Isostearate, Pentylene Glycol, Ethylcellulose, Glyceryl Stearate, PEG-100 Stearate, Phenoxyethanol, Sucrose Cocoate, Sodium Lauroyl Glutamate, Fast Acid Magenta, Sunset Yellow FCF, Fragrance, Caprylyl Glycol, 1,2-Hexanediol, Tartrazine, Ethylhexylglycerin, Tromethamine, Stevioside, Propanediol, Illicium Verum (Anise) Fruit Extract, Camellia Oil, Citrus Paradisi (Grapefruit) Fruit Extract, Honey Extract, Benzyl Benzoate, Cinnamyl Alcohol, Limonene Product Shade Range: The Packaging: The tints come in a black plastic cuboid packaging and the lid indicates the shade of the tint inside. I’m a big fan of this style of packaging since it’s simple, chic and modern looking ^.^ After unscrewing the lid, there is a doe foot applicator which is angled to fit the curve of the lips better. The Consistency: [ Top to bottom: 05 Cherry Jelly; 01 Red Jelly; 04 Rose Jelly] This tint has a thin, glossy texture when applied on the back of my hand. All shades appear very vibrant and pigmented on my skin. It also has a light cooling effect. In the 2nd picture above, you can see the glossy oil moisture layer which it claims. After leaving the tints for about a minute, I wiped some off to see how they stain. Each shade has it’s own unique stain which matches the original colour 🙂 As for the scent, it’s quite strong! – a sweet smell, reminds me of Haribos lol The Performance: 01 Red Jelly: This shade is a cool tone chilli red which matches the shade online. I’m not a big fan of this shade on me actually, though I wanted to try a red lip once >.< 04 Rose Jelly: This shade is more of an orange coral, compared to the online swatch which is a rose pink  I think it works well as an everyday colour and it’s my favourite shade out of the three! 05 Cherry Jelly: Hmmm “cherry” they are calling it.. It is not actually a cherry pink, it is a cool tone fuchsia pink both on the back of my hand and on my lips ._.  The online swatches don’t seem to be too accurate  However I do like the colour 🙂 On application, the tints have a moisturizing, glossy finish which is sticky if you press your lips together. The tint transfers easily while the glossy layer is still there. If there is dry skin on your lips, the tints will cling on but I found the darker shades (Red Jelly and Cherry Jelly) looked more obvious – the dry skin holds the tint more so the deeper the colour, the more uneven it looks The tints all faded after eating and drinking, leaving behind different stains which matched each of their original shades. Reapplication was easy since the tints are so light and moisturizing.  The colour of the tint can be built up, the more layers of product you apply which gives you some flexibility with how you use it 🙂 In terms of longevity, the tints lasted a few hours before fading and becoming less glossy. They kept my lips feeling comfortable and are non-drying~ Pros: Simple, chic packaging Easy application Vibrant colours Matching stains left behind Keeps lips comfortable and moisturized Can build the colour up as desired Cons: Sweet “Haribo” smell lol Deeper shades can look uneven if you have dry skin on lips Online shades are not accurate Overall Rating: My rating for the Wakemake Jelly Tok Tint is mixed, since I was not a fan of 01 Red Jelly shade (3/5) on me though I like the shades 04 Rose Jelly and 05 Cherry Jelly (4/5). The colours do not all match the online shades and the deeper colours look more uneven on lips with dry skin. On the good side, the colours can be worn as a light tint or built up to stronger colours which gives you flexibility, depending on how you want to wear the tint. Overall they are comfortable and moisturising with a glossy finish which keeps my dry lips happy ^.^ I would recommend these tints to those looking for moisture and comfort, as well as a bright pop of colour. Since some of the shades did not match the online pictures, I suggest researching the shades on blogs (like this one) or YouTube videos before purchasing 🙂 Enjoyed this post? Come and follow me on Instagram @pearl_and_bubbles to keep up to date with my blog! If you’ve tried this product, what’s your opinion? Feel free to leave a comment on this review ^.^ Thanks for reading and hope you have a nice day!~ Linn xo Big K-beauty enthusiast ~ Posting reviews and opinions if you're interested ;)  Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Enter your email address to subscribe to this blog and receive notifications of new posts by email. Email Address: Subscribe ©\n\t\t\t\t\t\t\t2023\t\t\t\t\t\t\tPearl and Bubbles Start a Blog at WordPress.com. ",
    "datetime": "2020-05-14T11:30:00+00:00",
    "url": "https://pearlandbubbles.wordpress.com/2020/05/14/k-beauty-review-wakemake-jelly-tok-tint-010405/"
}