{
    "title": "K-Beauty All-Stars from the Avon 2019 Collab with The Face Shop",
    "text": "View Our Print IssuesBack to Main Site  See Our Newsletters Share K-Beauty has made a major impact globally, and for good reason: Its cutting-edge technology makes for best-in-class products that are worth the hype. And now, Avon’s new collaboration with Korean brand The Face Shop makes it easier to shop these skincare and makeup must-haves than ever. We asked influencers Chloe Zhang and Vivienne Gliesche to put the products to the test, with seriously glowy results.  “The cushion products. I just love how they feel on the skin—they’re lightweight and moisturizing.” “It takes me around 15 minutes to get ready every morning.” “I’m a little bit of both. Sometimes I like the matte or satin lipstick look, but sometimes I like to add a little gloss so my lips look extra full and moisturized.” “The Foundation Cushion. It’s extremely hydrating and the perfect shade for my skin tone, which is a lifesaver because I always find it hard to find a cushion that matches me. It’s easy to apply and means I don’t have to buy beauty blenders. I also find it’s more of a natural look on skin compared to a lot of liquid foundations, which can be more heavy. And it gives your skin the perfect glowy, dewy look!”  “I love K-beauty products, especially skincare. Hydrated and glowing skin is the best base for any makeup. I always make sure my skin is nourished, which means that I can apply less foundation.” “Try a rich moisturizer, see how you like it and go from there. Too many different products all at once might be overwhelming and confuse your skin.” “Oh, yes! Some might say it is the thing I am most passionate about. I love glowing, healthy-looking skin and will never go without highlighter when I do my makeup. I love placing it on my cheeks, browbone, inner corner of my eyes, and a tiny bit on the nose and forehead.” “It’s hard to choose, but the Oil Blending Cream for skincare and the Ink Serum Lip Tint for makeup. Both products are so hydrating and will make you glow!” Share As someone who experienced adolescence in the early aughts, I'll be the first to admit that I love a celebrity-owned beauty line. In 2002, JLo launched Glow—a skin-like fragrance housed in curvy frosted glass—and I practically begged my mother to buy me a bottle. She eventually caved, and I was thrilled to own such a grown-up scent. Two years later, Britney Spears dropped Curious and you couldn't walk past a group of teenage girls without… “It’s a bit of a dumpster fire” is a sentiment echoed by thousands. How we got here, and what can help They were snapped on sunny Canouan, St. Vincent. Let's all go? From Lauren Chan's scarlet ensemble to Sarain Fox's repurposed parka She and Jeanne Beker talk fashion's glory days, their breast cancer journeys and anti-aging's downside    SIGN UP FOR OUR NEWSLETTERSGet the latest beauty and fashion news, trends, contests and more - straight to your inbox  Thank you for signing up!  Δ © The Kit 2022, The Kit, a division of Toronto Star Newspapers Limited 8 Spadina Ave, 10th floor The Well, Bldg G, Toronto, ON, M5V 0S8, 416-945-8700 ",
    "datetime": "2019-11-14T14:46:43+00:00",
    "url": "https://thekit.ca/beauty/k-beauty-avon-collab-2019/"
}