{
    "title": "K-Beauty Brand Tonymoly Announced a Line of Ramen-Inspired Beauty Products | Teen Vogue",
    "text": "By Zoë Weiner What do you get when you combine two of the most amazing things on the planet (that also fill our hearts with joy)? A ramen-inspired makeup line. Yup, you read that right. Earlier this month, Korean Beauty brand TonyMoly announced they would be launching a collaboration with Samyang's Buldak Spicy Chicken Ramen, Allure reports. “Through this unusual collaboration with Spicy Buldak Chicken Ramen, we are excited to launch special and entertaining products,” a Tonymoly official told The Korean Herald, and thus TonyMoly x Samyang — aka the collab we never knew we needed — was born. The collection includes pretty much everything you need to create a full ramen-inspired beauty look, which is much prettier than it might sound. The line features a Hot Coverdak Cushion, which comes with a refill that looks like a sauce packet; A Noodle Blusher that comes in a bright red blush and a pale pink highlight; A lip balm, and a Lip Sauce Tint that comes in Spicy Red and Cheese Red. In true K-Beauty fashion, the packaging is absolutely adorable (hello, Instagram grid-worthy shelfies). It features the Samyang fire-breathing chicken, and according to one Reddit user it comes with actual noodles, which hereby qualifies this as the best beauty collaboration ever. While the product was initially created in Korea, detectives in the AsianBeauty Subreddit recently discovered that hungry American beauty lovers could also get their hands on it care of beauty retailer Beauty Box Korea, which appears to be shipping the collection to the US, according to Allure. While some Reddit users seem a little bit concerned about the products burning their lips or skin (those noodles really are spicy, and honestly we're not totally sure what the verdict is on that), one user echoed our sentiments exactly: \"Omg omg omg that sounds amazing! Literally going to buy this today when I go out later.\" This content can also be viewed on the site it originates from. This content can also be viewed on the site it originates from. This content can also be viewed on the site it originates from. By Lexi McMenamin By Sara Delgado By Anjana Pawa Let us slide into your DMs. Sign up for the Teen Vogue daily email.Want more from Teen Vogue? Check this out:Why This Popular Peel-Off Lipstick Can Actually Hurt Your Lips By Aiyana Ishmael By Donya Momenian By Tabitha Yuen By Kara Nesvig More from Teen Vogue Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Teen Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "datetime": "2018-09-18T18:44:48.050Z",
    "url": "https://www.teenvogue.com/story/k-beauty-brand-tonymoly-announced-a-line-of-ramen-inspired-beauty-products"
}