{
    "title": "K-Beauty Brand Peach & Lily Launches Femmue, a Natural Skin-Care Collection | Allure",
    "text": "By Macaela Mackenzie Korean beauty retailer Peach & Lily has helped bring K-beauty to the level of cult obsession it’s currently enjoying. (See: Peach & Lily’s exclusive and affordable collection for CVS — and then go shop it all.) The retailer’s latest launch is one that will have natural beauty fans rejoicing. This week, Peach & Lily founder Alicia Yoon launched her latest discovery on the website — meet Femmue, a line of botanical beauty products that deliver “high-powered flower therapy.” According to a report by WWD, the natural South Korean collection of facial oils, masks, a cleansing balm and a peel (which is being sold exclusively with Peach & Lily), is inspired by the energy of flowers. “It hits all the right notes: natural formulas, surprising and delightful textures that give the brand a certain whimsy and playfulness, a totally indulgent experience, beautiful packaging and gorgeous colors and textures, and importantly, visible results,” Yoon told WWD. For the K-beauty expert, three things really set Femmue apart. First of all, the science behind the au naturale skin care is legit. Femmue, reports WWD, partners with a research lab in South Korea that produces data on the powers of floral extracts. “The formulas are not just marketing floral concepts, but grounded in decades of scientific research to ensure the products are high-performing while still being almost 100 percent natural,” Yoon said. Secondly, the formulas stay true to Mother Nature’s inspiration, with no artificial fragrances. There’s the Flower Infused Fine Mask ($40) a “juicy” mask packed with antioxidants and camellia petals; the Gypsy Rose Calming Mask ($38), a gentle pink clay mask formulated with green tea oils and rose extracts; Ideal Oil ($58), a pure blend of camelia, olive, rose, grapeseed and jasmine oils; the Extraordinary Beauty Cleansing Balm ($42), boosted with citrus and bergamot, and Lumière Vital C ($88), packed with Vitamin C and hyalauronic acid to brighten and smooth skin. Finally, the formulas have sumptuous textures — some of which are even shape shifting, like the cleansing balm that starts as a jelly and melts into a silky oil on your skin. Into it? You’re in luck. Not only can you shop Femmue now, Yoon told WWD that more products from the flower power brand are already in the works. For more K-beauty: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Nicola Dall'Asen By Devon Abelman By Dianna Mazzone By Sarah Han More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2017-09-20T18:24:16.473Z",
    "url": "https://www.allure.com/story/k-beauty-natural-skin-care-peach-and-lily-femmue"
}