{
    "title": "K-Beauty Is Launching at CVS Pharmacy and We're Not Okay | Allure",
    "text": "By Elizabeth Denton Most people know the magic of Korean beauty by now. There are dozens and dozens of amazing skin-care and makeup brands hawking affordable and innovative products. But the problem is, they're not that easily accessible in brick-and-mortar stores — until now. More than 100 products are making their grand debut in CVS Pharmacy stores starting in April, and rolling out over the next year. Yes, you read that right: CVS. And if you think the company just threw any products together, you would be mistaken. It took a full year for the project to come together, and it enlisted the big guns: Peach & Lily founder Alicia Yoon, whose all-new sister brand, Peach Slices, is being included in the CVS assortment. Yoon helped the company source seven innovative brands in addition to her own, including Frudia (waterless skin care), Elisha Coy (skin care with snail mucin), JJYoung by Caolion Lab (pore products), and Ariul EGG Collection (face oil), which are all U.S. exclusive to CVS. Three other brands are hopping on board: Ariul (masks), The Saem (natural skin care), Holika (peeling gels and cleansers.) As is the norm with Korean products, each item is as cute and chic as it is useful. Come on, just look at these products! And the best part is, they're super affordable. Check out some of our favorites below. More K-Beauty: Look out for an entire K-beauty section in CVS stores and on cvs.com. Treat Your Dry Winter Skin With a Tea Tree Oil Mask: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Sarah Han By Sarah Han By Sarah Han By Sarah Han More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2017-03-30T22:24:00.000Z",
    "url": "https://www.allure.com/story/k-beauty-cvs-pharmacy"
}