{
    "title": "K-beauty brand Innisfree rebrands to focus on science and tech - Glossy",
    "text": "Innisfree, the affordable and natural K-beauty brand owned by Amorepacific, is undergoing a global rebrand. It’s an effort to differentiate itself in the crowded clean beauty market as it undergoes ambitious expansion in the United States. The rebrand consists of a new logo design, refreshed packaging, new formulations and new retail store concepts, all of which will slowly roll out, starting with the brand’s hero green-tea skin-care line on April 1. Following the green-tea range, the rebrand will trickle across the portfolio, starting with all nine of its skin-care lines by the end of August, followed by makeup, body- and hair-care products by the end of 2019. All updates are intended to highlight the brand’s focus on science and technology. Innisfree first launched in South Korea in 2002 and currently has more than 1,500 stores across 11 Asian markets, including China and Japan. Although the 17-year-old brand has an established presence in Asia (where it’s the No.1 best-selling K-beauty brand on Alibaba’s Tmall platform), Innisfree is looking to grow in the U.S. at a time when the market has already become saturated with clean or natural beauty and wellness brands. The brand launched within the U.S. in September 2017 and currently has three store locations, including two in New York City and one in New Jersey. It plans to open an additional eight stores by the end of 2019. The next location opening is in Santa Monica, California, in May, and an e-commerce website re-launch is slated for July. “Nature and wellness are becoming more than a trend, and we felt there is a need to further differentiate ourselves in a cluttered landscape,” said Julien Bouzitat, gm and vp of Innisfree in the U.S. “We’re still going with natural ingredients, but there is more science and technology going into it. With the new visual identify, we are going further with the science and tech credibility.” The packaging and logo changes are subtle. For example, with the update of the Intensive Hydrating Cream with Green Tea Seed, the Innisfree logo was removed from the product’s cap, the shade of the product became a deeper green and the brand’s logo — an outline of a green-tea leaf — was downsized in the packaging. Bouzitat describes the aesthetic as “more unified and grown up” than before. The new science and tech elements will mostly be present in the brand’s stores, which currently feature entire walls of living plants, as well as explanations of the benefits of each ingredient (like ginger honey and orchid) posted above each skin-care line. The new store concepts, which will be integrated into the new stores, will feature greenery, too, but they will have more brutalist-style concrete interiors. What’s more, LED screens will replace the installations to offer digital displays and videos meant to bring the “ingredient journey” of South Korea’s Jeju Island (where Innisfree is based) to life, said Bouzitat. “[The market has] witnessed a shift in consumer demand from clean, natural products to clean, scientifically progressive products,” said Brady Donnelly, executive director of consumer experience at the creative agency Fig. “Rebranding amidst this shift with a focus on natural alone would have limited a brand’s commercial agility; its identity would run counter to the products the market demanded.” Innisfree plans to promote its new formulas in stores and online, but it is not planning wider rebranding announcements around its packaging or in-store concepts. With the green-tea relaunch, the brand is rolling out a new events series called Green Mezzanine, which it tested throughout 2018 — it offers free monthly classes on topics like makeup and skin care. Moving forward, it will also include individual skin-hydration testing and formal one-on-one consultations. Sign up for our new Glossy Beauty and Wellness Briefing, a weekly newsletter coming in April that will provide deep-dive analyses, emerging trends and insider insights in the growing beauty and wellness industries. Get news and analysis about fashion, beauty and culture delivered to your inbox every morning. ",
    "datetime": "2019-04-03T04:00:15+00:00",
    "url": "https://www.glossy.co/beauty/k-beauty-brand-innisfree-rebrands-to-focus-on-science-and-tech/"
}