{
    "title": "K-Beauty Brand Memebox Is Coming to Sephora | Hypebae",
    "text": "In case you’re not already riding the Hallyu wave, then you’re at least familiar with how K-Beauty is slowly but surely taking over the beauty and skincare scene. From beauty-cum-style gurus such as Irene Kim, to emerging skincare lines such as Panacea, it would be an understatement to say that women everywhere are pining for flawless complexions and no-makeup makeup looks. As one of the leading names in the game, Korea-based beauty brand Memebox has announced that it will be partnering with Sephora on an exclusive color makeup brand. Set to debut in Fall 2018, the new line will be available on both sephora.com and in select stores. Although details are still sparse regarding what exactly the collaborative launch will comprise of, it’s safe to say that the products will undoubtedly make a splash. In fact, it seems as if Memebox is placing customer satisfaction at the top of its priority list this year. Along with its forthcoming partnership, the brand’s website will also be undergoing a major revamp. Completely relaunching its web experience, consumers will now be able to shop their favorite K-beauty products directly from Memembox.com. This update has definitely been a longtime coming, thanks to high demand from fans of the brand. On top of that, its best-selling Pony Effect products – produced in tandem with celebrated Korean makeup artist, PONY, of course – will soon be available to the US market, starting July 2018. Taking to mind all of the comments and feedback given to the brand, Memebox will also be re-introducing its beloved in-house lines: I Dew Care and Nooni. Striving to become a full-service, community-oriented destination for beauty lovers, the label hopes that the new website will foster a new collective mentality to discover and share products.\nTo explore its new website, head over now to Memebox.com and don’t forget to look out for all of the brand’s upcoming releases.\nFor more beauty news, don’t miss the “5 Summer Makeup Hacks All Cozy Girls Need to Know.”\n\n\n                                                            Read Full Article To explore its new website, head over now to Memebox.com and don’t forget to look out for all of the brand’s upcoming releases.\nFor more beauty news, don’t miss the “5 Summer Makeup Hacks All Cozy Girls Need to Know.”\n\n\n                                                            Read Full Article For more beauty news, don’t miss the “5 Summer Makeup Hacks All Cozy Girls Need to Know.”\n\n\n                                                            Read Full Article    Keep updated on the latest news.  Keep updated on the latest news. We charge advertisers instead of our readers. Support us by whitelisting our site. Whitelist Us Already whitelisted us?\n                        \n                            Refresh page ",
    "datetime": "2018-06-20T04:21:55-04:00",
    "url": "https://hypebae.com/2018/6/k-beauty-memebox-sephora-pony-effect-makeup"
}