{
    "title": "K-beauty ‘magic’ pimple patches review: ‘On the go’ cruelty free skincare | body+soul",
    "text": "You won't believe the results... You won't believe the results... Now that the ravages of winter weather are fading and summer's heat hasn't fully kicked in, it's the perfect time to kick your skin into shape. During Skin Gym Week on bodyandsoul.com.au, we're sharing the tips and tools improve your skin health- from face-friendly meal plans to the most effective professional treatments, to the best and buzziest products, it's everything you need to get the best skin of your life - from the inside-out. Selecting the correct skincare products is definitely one of the struggles of nailing #adulthood. On one hand you want the latest and greatest tech that’s effective, but then you also only want to be applying clean and natural ingredients on your skin – all at an affordable price, too. Which is why newly released Korean skincare brand Subi, entered the market with a difference: fusing the best of A-beauty (think clean, natural and minimalist skincare ingredients) with K-beauty (cutting edge technology). Just take their first product release, Perfect Pimple Patch, as an example. Available from global Korean beauty platform STYLE STORY, ($12), the vegan and cruelty-free “completely invisible” patches have been designed to treat pimples “on-the-go” without the ordinary nasties found in common anti-acne products. So instead of finding benzoyl peroxide, calamine lotion and salicylic acid on the ingredient list, you’ll instead find the following: cellulose gum, styrene isoprene, styrene block copolymer, polyisobutylene, petroleum resin, polyurethane film liquid, paraffin and tetrakis methane. Although pimple patches have recently become mainstream, Subi notes their patches are the thinnest, most invisible and are designed to treat whiteheads. Moreover, they’re silicone and paraben free, making it perfect for those with sensitive skin, and pregnant and breastfeeding mothers. We knew we had to find out if these patches lived up to its expectations (seriously, they’ve been deemed “magic” for ridding pimples!). Here’s what the team thought… Like what you see? Sign up to our bodyandsoul.com.au newsletter for more stories like this. And no, we promise we won't spam you. Experience using it: I won't lie, I was dubious that sticking what looked like the clear, adhesive part of a Band-Aid on my throbbing, volcano of a pimple could do any good. But, I was wrong. Dead wrong. I applied the pea-sized patch said whopper-in-the-making before going to bed, and when in the morning I had to do a double take. It was dramatically reduced; not gone completely, but the pain was gone, and what was a sizeable lump was now a minor blip. The next night I repeated and, bammo! It was completely gone when I woke up. No pussy mess. No scarring. Positives: These things really, actually, do the job. They're easy to apply, painless to remove, and having the patch on my face meant I wasn't tempted to pick or prod the pimple either (great if self control is a problem when you've got a zit). Negatives: The patches are about 70 per cent transparent - so they are still pretty visible when you wear them. For that reason I wouldn't wear them outside the house - but if you had understanding colleagues you might be able to get away with them at work. Overall opinion: I would highly recommend these. Whilst not a 100 per cent cure-all, they do take the 'heat' out of an incoming blemish, reduce the lumpiness and they definitely remove the temptation to pick your face - meaning faster healing time and zero scaring. I'm buying in bulk. Experience using it: The term 'pimple patch' makes me think of the chemical-laden little Band-Aids from high school that would leave my spots dry and flaky and end up scarring. So it's safe to say I was sceptical about trying this. After a good dose of research and playing with the patches on my hand I figured out it's actually just a mix of professional and breathable dressing with no nasty or drying ingredients. Positives: I don't often get big breakouts but I do get little spots that last a few days, so these are ideal for hiding redness and texture changes so you can easily apply makeup - they kind of work better than just plain old concealer. Add these to your camouflage arsenal, or if you can't stop picking - out of sight, out of mind, right? Negatives: They're a bit finicky to get out of the packaging, which can make applying them and the way they sit on skin a bit tricky. Overall opinion: Depending on how often (and how severe) your breakouts out, you could probably get away with not wearing these. They're more about masking the problem than curing it. Experience using it: I grew up with pretty terrible acne. In fact, it got to the point where I had to take prescription medication just to ensure it didn't worsen. So it’s safe to say I’ve tried every pimple product to date. When I came across these circular Band-Aids, I heavily questioned as to how a simple and tiny sticker could rid a raging pimple. Like, where’s the benzoyl peroxide and other chemicals that soak straight to the root of a pimple? However, I was wrong. Very wrong. I applied the miniscule transparent patch to a volcano that appeared smack bang in the middle of my forehead before heading to bed, and went to sleep with my fingers crossed. The next morning I peeled the patch off and was shocked – the size of the pimple was dramatically reduced. It wasn’t gone completely, but it was obvious the patch did work some magic. I then applied another patch the next night only to wake up with the pimple completely gone. G-O-N-E. Another pimple popped up on my chin the week after so I tested the patch out again – first night the pain and size subsided, and by the second night it had vanished. If this isn't what you call magic, I don't know what is. Positives: They’re easy to use, they stop you from squeezing and picking at your pimples (which also means no scarring), they don’t dry your skin out like majority of other pimple products on the shelves, and they genuinely do the job. What’s more is that they’re completely cruelty-free and vegan! Negatives: They’re a little tricky to get out of the packaging because they’re so small. However, you do get better with practice. Also, they’re not “completely invisible” (as the label states) so unless you’re not afraid to walk around with a slightly visible patch on your skin in public, I would save these for bedtime. Overall opinion: I’m sold. Actually, I’m getting a lifetime supply of these patches. Please note body+soul writers may be gifted products, but reviews are always the unbiased opinion of the author, and free from commercial influence. To join the conversation, please\n log in. Don't have an account?\n Register Join the conversation, you are commenting as  Logout Listen to our Podcasts ",
    "datetime": "2019-09-25T03:45:00.000Z",
    "url": "https://www.bodyandsoul.com.au/beauty/we-tried-the-latest-kbeauty-magic-pimple-patches-heres-our-honest-opinion/news-story/f6d52a926cbf9b5466aae01bdec55040"
}