{
    "title": "K-beauty companies shifting focus toward the US for growth",
    "text": "Or wait... Headlines Brand Innovation Formulation & Science Packaging & Design Business & Financial Market Trends Regulation & Safety Promotional Features Site Archive Multimedia Regions All Asia-Pacific South East Asia South Asia East Asia Oceania Site Archive Multimedia Hot topics Clean & Ethical Beauty Sustainability COVID-19 Market Entry Anti-Aging / Skin Whitening Beauty From Within Nanotechnology Green Cosmetics Site Archive Multimedia Resources Type of resources Events All Events Shows & Conferences Online Events Editorial Webinars Events China 中国 Podcast  04-Oct-2022\n                            - Last updated on\n                                04-Oct-2022 at 01:24 GMT Related tags\nK-Beauty\nKorea\nAmorepacific\nLG Household & Healthcare\nUs It is no secret that China’s zero-COVID policies have placed a damper on many businesses worldwide. The severe restrictions imposed by authorities have had a ripple effect on the cosmetic industry. While companies are expecting performance to improve with the easing of restrictions – and some have already seen recovery – there are still some lingering concerns. Japanese beauty giant Shiseido has highlighted​ that the lengthy lockdowns and economic worries have left a grey cloud of uncertainty hanging over Chinese consumers. Similarly, health and beauty retailer A.S. Watson expressed​ concerns regarding dampened consumer sentiment in China. Against this environment, those who have relied heavily on the Chinese market in the past are looking to diversify their focus to other markets, including South Korean cosmetic titans Amorepacific and LG H&H. Both companies have made efforts to refocus on North America where there is a fresh Hallyu​ of excitement thanks to pop-culture phenomena like K-pop groups BTS and Blackpink, as well as Netflix drama series Squid Game. In the first and second quarters of this year, Amorepacific reported that sales in North America grew by 63% and 66% respectively as the firm pushed to diversify its channels. The interest in global brands such as Sulwhasoo, Laneige, and Innisfree, were also instrumental to its rising momentum. In a move that signalled the company’s intention to place more strategic emphasis on North America, it announced on September 1 that it would acquire US luxury beauty brand Tata Harper to tap into the growing North American market. The announcement said this acquisition would aid Amorepacific’s plans to “expand its business to the Americas and Europe while realigning strategies to further broaden its presence in Asian markets”.​ Amorepacific Group chief strategy officer, Lee Jinpyo said: “Tata Harper is a clean beauty brand instilled with the core values of healthy beauty – values that society and consumers are looking for today. Fuelled by Amorepacific’s top-notch R&D and P&L infrastructure, we expect Tata Harper will be able to significantly expand its footprint in the Western and Asian markets.”​ At the start of this year, LG H&H CEO Cha Suk Yong, highlighted​ the importance of strengthening its position in North America. “To leap forward as a truly global luxury beauty company, we must continue to expand our business in the North American market, which is the world's largest market, and creates trends,” ​he said. The fast-moving consumer goods (FMCG) firm has been steadily making significant inroads into North America in the past few years. In April, it announced the majority stake acquisition of Los Angeles-based beauty brand The Crème Shop for a reported USD120m. Last year, it acquired a 56% stake in Boinca, which manufactures the vegan hair care brand Arctic Fox for US$100m. Before that, the firm acquired Avon North America in 2019 for USD125m. In January, the company announced that it was entering the beauty tech space with a mini temporary tattoo printer. The firm said the device which would launch exclusively in North America sometime in the fourth quarter of this year under the Arctic Fox banner. Copyright - Unless otherwise stated all contents of this web site are © 2023 - William Reed Ltd - All Rights Reserved - Full details for the use of materials on this site can be found in the Terms & Conditions Related topics\nBusiness & Financial\nMarket Trends\nEast Asia\nAsia in Focus\nSkin Care\nHair Care\nColor Cosmetics Show more  Content provided by Naolys | 07-Jul-2023\n                     | White Paper Naolys presents HairRevive [MM+Zn], a pioneering plant-based ingredient revitalizing hair.  Content provided by Provital | 13-Jun-2023\n                     | Product Brochure Circanblue™ is a vegan postbiotic ingredient obtained from Lactococcus lactis that induces a resynchronisation of the skin’s circadian cycle after this... More promotional features ",
    "datetime": null,
    "url": "https://www.cosmeticsdesign-asia.com/Article/2022/10/04/k-beauty-companies-shifting-focus-toward-the-us-for-growth"
}