{
    "title": "K-Beauty Brand Then I Met You Is Discounted For the First Time Ever: Sale Details | Allure",
    "text": "By Sarah Han All products featured on Allure are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission. It seems like there's a new beauty sale every day, so when we're really excited to share news about a sale, it's a real treat. Founded by Charlotte Cho, cofounder of Soko Glam and all-around K-beauty expert, Then I Met You has stolen the hearts of many Allure editors. Well, due to overwhelming demand over the past four years, the Korean-beauty-inspired brand is discounting its lineup for the first time ever. Say hello to Then I Met You's first-ever Friends & Family Sale. Starting at noon ET on October 28, lucky skin-care lovers can take 20 percent off all Then I Met You products at both sokoglam.com and thenimetyou.com. This is the best time to indulge your skin in nourishing, super-gentle cleansing balms, toners, essences, moisturizers, and so much more — or, if you're in the gifting spirit, go ahead and buy a few gifts for your loved ones. (You can't go wrong here.) To get in the nitty-gritty, the only exceptions are special sets, swag (for instance, sweaters and books), gift cards, and new launches (a.k.a. Living Sea Cleansing Tonic). The sale only lasts through the weekend — October 30 at 11:59 p.m. PT, to be exact — so we recommend you check out as soon as you can. (You wouldn't want anything to sell out either, now would you?) That being said, there are slightly different perks on both sites. Most notably, on thenimetyou.com, you'll see your savings reflected immediately on the product page and receive a mini Then I Met You Living Cleansing Balm with any order placed within the aforementioned time frame. Over at sokoglam.com, you'll score a free deluxe sample (not from Then I Met You) with any order of $90 or more, plus, the savings will be reflected once you view your cart. Stuck on what to buy? We've compiled a bunch of recommendations below: The Living Cleansing Balm is a Best of Beauty winner we'll treasure for years to come. Few cleansing balms come close to the powerful makeup-removing abilities of this elixir, which is spiked with antioxidant-rich seaberry oil, barrier-strengthing vitamin E, and nourishing olive and grapeseed oils. Gently rub and massage the brightly-colored formula onto dry skin and watch your sunscreen, makeup, and grime melt away before your very eyes. Continue your double-cleansing routine with the Soothing Tea Cleansing Gel, which restores skin with ingredients like fermented rice water (the first ingredient, in fact), brightening licorice root extract, calming green tea, and lightly-exfoliating gluconolactone (a type of PHA). Your skin will be ready to take on anything after this proper cleanse. In case you're worried about remaining residue, the Birch Milk Refining Toner has you covered — and so much more. Spiked with a hydrating blend of 70 percent birch juice (in place of water), squalane, glycerin, and sodium hyaluronate, this toner will relieve any feelings of dryness or tightness post-cleanse. As a bonus, a blend of AHAs (glycolic and lactic acid) and PHA soothe skin and prep it for subsequent skin-care products. The Giving Essence is no ordinary product. Applied post-toner and pre-serum or pre-moisturizer, this isn't a step to overlook. Formulated with five percent niacinamide and over 80 percent of naturally-fermented ingredients like galactomyces ferment filtrate and saccharomyces ferment filtrate (popular K-beauty ingredients, no less), it'll deeply hydrate skin and keep large pores, blackheads, and serum at bay. The Renewing Rich Beauty Cream is so incredibly silky and hydrating that any skin type will appreciate it. Chock-full of baobab, squalane, niacinamide, and various types of ginseng, this lightweight formula will definitely restore your complexion's radiance and plumpness. While the Rosé Resurfacing Facial Mask looks gorgeous from the outside, what's inside is even better. This pink-hued jelly-like formula has real Damask Rose petals suspended within it and works on all skin types, but as with all chemical exfoliants, patch-test before diving in. Experiencing a slight tingle is totally normal when you're exposing your complexion with six percent glycolic and lactic acid to overhaul any skin texture, as well as 0.5 percent salicylic acid to clear congested pores. Leave it on for 10 to 15 minutes before washing it off and you'll be greeted with radiant, smooth skin. Treat your lips to the Honey Dew Lip Mask, which is infused with a manageable concentration of lactic acid (a type of alpha hydroxy acid or AHA) as well as hydrating, antioxidant-rich honeydew, squalane, and honey for an overnight reset. Shop your faves between October 28 and October 30 at sokoglam.com and thenimetyou.com before the discounts run drier than your skin in the middle of the winter. By Aliza Kelly By Gabi Thorne By Gabi Thorne Read more about awesome beauty products we're shopping right now: Now, watch K-pop superstars Stray Kids break down their most iconic music videos: Follow Sarah Han on Instagram and Twitter, or subscribe to Allure's newsletter for daily beauty stories delivered right to your inbox. By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Nicola Dall'Asen By Sarah Han By Jesa Marie Calaor More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2022-10-28T13:56:40.519Z",
    "url": "https://www.allure.com/story/then-i-met-you-skin-care-friends-and-family-sale"
}