{
    "title": "K-Beauty Brand Venn Skincare Arrives at Forty Five Ten - D Magazine",
    "text": "Is it just me, or has skincare gotten a little bit nuts lately? I asked myself this question as I stood over my bathroom sink applying snail mucin essence–literal snail juice–to my face, and zapping my blemishes with a high-frequency wand. My medicine cabinet overrunneth with sheet masks, serums, sprays, toners, spot treatments, and mystery samples. I don’t know what most of these things do; I simply hope they do something. I have problem skin, and I’m a sucker for solutions. I’m not the only one who’s fallen for the gimmick of the 20-step skincare routine. Consumers are using more and more products, an approach that can actually cancel out the effectiveness of each product, not to mention the environmental repercussions of beauty overindulgence. While K-beauty brands are typically known for their extensive, wide-ranging product lines, there’s one South Korean skincare brand that’s trying to minimize your daily routine. Dallas’ Forty Five Ten just started carrying Venn Skincare, a scientist-backed brand with a less-is-more mentality. The company currently has a total of five products that are supposed to deliver all the benefits of a complicated skincare regimen in only a couple steps. Founded by a corporate attorney and a chemist, the South Korean brand offers a cleanser, two moisturizer-like concentrates, a serum, and a lifting mask. The products are made for all skin types, so they’re okay for sensitive skin despite being potent. I haven’t started my minimalist Venn routine yet, so I can’t vouch for their products, but I’m already impressed by the two concentrates. If you want a moisturizer that also works to improve your complexion and reduce wrinkles, the Age-Reversing All-In-One Concentrate is worth trying (see the rave reviews).  You can check out the products in person at Forty Five Ten in downtown. Attractions Bars and Clubs Shops Restaurants 750 North St.Paul St.\nSuite 2100\nDallas, Texas 75201 Tel: 214.939.3636\n \nFax: 214.748.4579 ",
    "datetime": "2020-01-27T16:21:09+00:00",
    "url": "https://www.dmagazine.com/style-beauty-wellness/2020/01/k-beauty-brand-venn-skincare-arrives-at-forty-five-ten/"
}