{
    "title": "\n\t\tK-Beauty craze among Bhutanese | \t\tKuensel Online\t",
    "text": "Yangyel Lhaden K-Pop was the first invasion. That was in early 2000s. Then came the K-Beauty, not much later. Bhutanese girls and women took to it like fish to the water. And, by the look of it, K-Beauty and skincare craze is likely going to be the biggest preoccupation and business in the country. That perhaps explains how suddenly beauty and skincare stores mushroomed in the last few years, particularly in the capital. The trend, though, has many implications on the individuals. For one, not all products work as they are supposed to. Often the damage suffered is bad skin, loss of money besides. For example, just one toner could cost more that Nu 1,000. Oil-based cleanser, water-based cleanser, exfoliator, essence, serum or ampoule, sheet mask, eye-cream, moisturizer, and sunscreen…the list goes on. Sonam Pelden, the owner of the K-Beauty store in Thimphu, said that this cultural shift really picked up after 2015. The K-Beauty, she said, was spreading to the far-flung dzongkhags, even. Klairs, Etude house, Missha, Innisfree, and The Face Shop are the best-selling beauty bands among the Bhutanese women. When she restocked skincare products after lockdown due to Covid-19, there were long queue of customers waiting outside the shop. Some women were buying skincare set for their boyfriend. Jamyang, a skincare freak, said that she started using K-Beauty because she was so much into Korean drama and wanted to achieve flawless skin like that of K-Pop stars. Kelden, another K-Beauty user, said that she had to try the products because K-Beauty was spreading like a wildfire. “Within no time I had been overtaken by the obsession.” Kelden said that the long list of ingredients was scary and made her skin sensitive overtime. However, some products such as Soonjung skin care set suited her skin. Sonam Pelden said that the Bhutanese wanted quick results and purchased the products without even knowing their skin type which is why most products failed to work on their skin. “Skincare is all about devotion and consistency,” she said. Yangzo, another devotee of K-Beauty, said that her skin was not sensitive and the 10-step skin care routine worked perfectly for her. “I have been using them for the past two years.” Sonam Choden, a customer, said that she cut down the 10-step routine to four which was more effective. Her current routine includes all clean balm by hemish as make up remover, cleanser-cosrx salicylic acid daily gentle cleanser, cica care balm, and cosrx- aloe soothing sun cream. Tenzin Selden, a beauty product blogger, said that she started an Instagram page called “Unemployed Beauty” to share her reviews about Korean beauty products. Most of her time is spent talking to people with troubled skin who seek beauty advice. “I have a rare combination, sensitive acne-prone skin in summer and dehydrated to sensitive skin in winter. I use products that contain niacinamide which is known to reduce inflammation and minimise the appearance of pores, rice for brightening and aloe for its hydrating and soothing properties,” she said. October 26th, 2023 In his young days, Ap Kinlay was known for... October 24th, 2023 “Did you resort to corruption?” An election official asked... October 23rd, 2023 The well-being of our youth remains a paramount concern.... October 21st, 2023 Right to a reasonable price and the right to... October 21st, 2023 In the tranquil valleys and towering mountains of Bhutan,... October 14th, 2023 Bhutan has emerged as one of the few countries... October 26th, 2023 With the elimination of para-archer Pema Rigsel on October... October 24th, 2023 Of the four para-athletes representing Bhutan at the fourth... October 24th, 2023 Team Bjibjokha-Lobesa United beat team PSG-PHPA I 4-3 in... September 14th, 2023 Bhutan, a forest-abundant country, aims to earn a revenue... June 10th, 2023 A decade ago, the prospect of poultry farming drew... June 10th, 2023 Demand for eggs has spiked in the capital as... Copyright © 2021 kuenselonline. All rights reserved ",
    "datetime": null,
    "url": "https://kuenselonline.com/k-beauty-craze-among-bhutanese/"
}