{
    "title": "K-Beauty brand PURITO launches vegan derma cosmetics range",
    "text": "Or wait... Headlines Brand Innovation Formulation & Science Packaging & Design Business & Financial Market Trends Regulation & Safety Promotional Features Site Archive Multimedia Regions All Asia-Pacific South East Asia South Asia East Asia Oceania Site Archive Multimedia Hot topics Clean & Ethical Beauty Sustainability COVID-19 Market Entry Anti-Aging / Skin Whitening Beauty From Within Nanotechnology Green Cosmetics Site Archive Multimedia Resources Type of resources Events All Events Shows & Conferences Online Events Editorial Webinars Events China 中国 Podcast  11-Feb-2019\n                            - Last updated on\n                                11-Feb-2019 at 01:24 GMT The new range is aimed at consumers with sensitive skin and addresses the consumer demand for ethical and environmentally-friendly cosmetics products. The range initially launched in December last year with three products but has since expanded the line to include a toner, sunscreen and eye cream. The Centella Green range is water-based and features Centella Asiatica as its hero ingredient. The natural ingredient is rich in amino acids and renowned for its powerful anti-aging properties. “Boasting a 49% Centella Asiatica content, the serum helps to stimulate collagen synthesis, calms inflamed skin and reduces pigmentation,”​ said the brand. The brand also highlighted the Centella Green Level Calming Toner and the Centella Green Level Recovery Cream. The toner, contains Asiatic pennywort extract in a highly-enriched powder form, improving the appearance and texture of sensitive skin. Designed for use on face and neck, the cream contains a high concentration of Centella Asiatica to smooth and calm troubled skin. The texture of the cream was formulated to be light and fast-absorbing for consumers with sensitive skin who are looking for a “kinder” moisturiser, explained the brand. In addition to the natural ingredients, all products are packaged using recycled wrapping paper, highlighting the company’s strong ethical responsibility and commitment to the environment, said Kim. \"We take our responsibility to the consumer and the environment extremely seriously, and our PURITO Centella Green range is one example of that.\"​ According to the brand, the range adheres to the Environmental Working Group (EWG) safety grade framework. \"We believe only natural and necessary ingredients should be added to derma cosmetic products, avoiding the use of alcohol and other potentially harmful ingredients such as PEGs, Phenoxyethanol and artificial flavouring agents,\"​ said Sunny Kim, director of PURITO. Its Centella Green Level Buffet Serum is certified by EWG and consists of ingredients ranked first or second in terms of safety by the EWG. It is the only product in the range with the certification. Last year, EWG ranked the serum along with PURITO’s Fermented Complex 94 Boosting Essence in its “Best Bets” list. Currently, only these two products have the EWG mark, but the company stated it is preparing to get more of its products certified. Additionally, PURITO has registered some of its products, including three from the Centella Green range, with the Cosmetics Products Notification Portal (CPNP). This allows the brand to distribute the products to 27 member countries in the European Union and European Free Trade Association for 10 years. Copyright - Unless otherwise stated all contents of this web site are © 2023 - William Reed Ltd - All Rights Reserved - Full details for the use of materials on this site can be found in the Terms & Conditions Related topics\nBrand Innovation\nEast Asia\nMarket Entry\nGreen Cosmetics\nSkin Care  Content provided by Provital | 13-Jun-2023\n                     | Product Brochure Circanblue™ is a vegan postbiotic ingredient obtained from Lactococcus lactis that induces a resynchronisation of the skin’s circadian cycle after this... More promotional features ",
    "datetime": null,
    "url": "https://www.cosmeticsdesign-asia.com/Article/2019/02/11/K-Beauty-brand-PURITO-launches-vegan-derma-cosmetics-range"
}