{
    "title": "K-beauty industry most significantly impacted sector by post-pandemic demand for greener products",
    "text": "Or wait... Headlines Brand Innovation Formulation & Science Packaging & Design Business & Financial Market Trends Regulation & Safety Promotional Features Site Archive Multimedia Hot Topics Companies looking to the future Consumer insights Formulation research Retail and DTC Sustainability Technology and Platforms Trends and Emerging Markets Expert Viewpoints Site Archive Multimedia Resources Type of resources Events All Events Shows & Conferences Online Events Editorial Webinars Events  14-Jun-2022\n                            - Last updated on\n                                14-Jun-2022 at 01:42 GMT Related tags\nK-Beauty\nSustainability\nsustainable beauty\nSustainable packaging\ngreen beauty\nEnvironment\ncircular beauty\nSouth korea A total of 409 consumer goods companies were surveyed, of which 19% were cosmetic companies. More than half (51.3%) of these companies reported that the increasing consumer demand for eco-friendly products has had a large impact on their exports and sales. In particular, 62.8% of the cosmetics companies surveyed reported that it had significantly influenced their exports and sales. This was just behind fashion (68.4%) and ahead of industries including household goods (53.7%) and food and beverages (53.3%). More than half (52.1%) of the companies said the changes in demand for eco-friendly products increased after the COVID-19 pandemic broke out. A majority of cosmetic companies (70.5%) felt that this post-pandemic trend had a significant impact on business, making it the most affected by the post-COVID eco-friendly product surge compared to fashion (57.9%), household goods (51.9%) and food (50%). The survey revealed that 72% of companies observed that the export performance of eco-friendly products increased by 5% or more after the pandemic. According to the report, one in three companies had received enquiries about eco-friendly products or requests for greener alternatives from consumers. Only 26.2% of respondents said they were exporting eco-friendly products. By industry, cosmetics (33.3%) had the highest percentage compared to household goods (31.5%) and fashion (29%). It said 65.4% of cosmetics companies were responding to the demand for eco-friendly products and that they were doing so by improving on packaging (37.9%), raw materials (24.8%) and production processes (11.8%). However, 78.4% reported that they were not responding well enough to the eco demands. This appeared to be the case for other industries including fashion (81.6%), household goods (82.4%) and food (80%). The biggest hurdles facing companies in terms of eco-conscious product development were the high prices associated with increased costs in areas such as research and development (31.2%). Companies also cited financial support (25.7%) as well as difficulties in obtaining relevant certifications (19.3%) as some of the difficulties. In light of this, companies requested support from the authorities in the form of financial support (25.7%), support for acquiring eco-friendly certifications (25.2%), marketing support (22.9%), as well as R&D support (15.9%). Copyright - Unless otherwise stated all contents of this web site are © 2023 - William Reed Ltd - All Rights Reserved - Full details for the use of materials on this site can be found in the Terms & Conditions Related topics\nMarket Trends\nSustainability\nExpert Viewpoints\nSkin Care\nHair Care\nColor Cosmetics\nFragrance  Content provided by Acme-Hardesty Company | 11-Oct-2023\n                     | White Paper Sharomix™ EG10, a versatile broad-spectrum antimicrobial liquid blend for preserving personal care products, ensures safety at usage levels ranging from...  Content provided by Acme-Hardesty Company | 07-Jul-2023\n                     | Product Brochure Acme-Hardesty’s latest expansion into Canada includes Resplanta®, Botaneco®, and BYK from our partners Sharon Personal Care and Eckart Effect Pigments...  Content provided by Covation Bio™ PDO | 22-Jun-2023\n                     | White Paper Zemea® propanediol is a 100% plant-based humectant and solvent that’s easy on skin and the planet. This single, natural ingredient boosts moisturization...  Content provided by Naolys | 26-May-2023\n                     | Product Brochure HairRevive [MM+Zn] is an innovative plant-based active ingredient comprising musk\r\nmallow (Malva moschata) cells and zinc. Show\n                        more On-demand webinars More promotional features ",
    "datetime": null,
    "url": "https://www.cosmeticsdesign.com/Article/2022/06/14/k-beauty-industry-most-significantly-impacted-sector-by-post-pandemic-demand-for-greener-products"
}