{
    "title": "K-Beauty Brand Amarte Claims Rival Jacked its \"Extremely Valuable” Product Name and the Goodwill Tied to it - The Fashion Law",
    "text": "“South Korea has very few natural resources,” Kayleen Schaefer wrote for The Cut back in 2015. “The country isn’t stocked with oil, much natural gas, or even many minerals.” And so, the nation’s government has invested in culture to boost its GDP – from its increasingly world-recognized K-pop boy bands to thriving cosmetics market, which as of 2018 was worth an estimated $13.1 billion, more than $1 billion of which was tied to beauty-specific exports from the thousands of K-beauty brands located in South Korea. The result of South Korea’s burgeoning beauty landscape can be seen in a large-scale rise in K-beauty brands and demand for the sheet masks, hydrating gels, cloudless creams, brightening serums, and nutrient-rich face masks – which are at the core of the segment’s offerings – not only in the country, itself, but in the west, particularly since the mid-2000s with national retailers like Sephora, Ulta, Target, Nordstrom, CVS, and Amazon all placing significantly emphasis on their K-beauty offerings. One such brand that has thrived in the K-beauty space is Amarte. What first started as a skin care initiative in a dermatology clinic in Korea in 1994, Amarte formally got its consumer-facing start in 2011. Within a few years, the company had morphed into an established private label supplier, and landed on the radar of Dr. Craig Kraffert, the board certified dermatologist, who started and was, at the time, still running Dermstore.com, the skin care and beauty e-commerce site that was acquired by Target in 2013 for $150 million. In furtherance of what Kraffert calls “a global partnership to further improve the formulations and customize them for the American luxury skin care market,” Amarte made its western debut. The brand is Kraffert’s response to what was missing from the market at the time. “The products have high-tech formulations and focus on multitasking, simultaneously refining, rejuvenating, and reducing the signs of aging in skin,” the Observer reported several years ago. “They also give an exceptional user experience.” At the center of those offerings is one particular product: the brand’s retinol-infused HydroLift Cream. With a proprietary blend of retinol, caviar extract, and acacia collagen, Amarte’s HydroLift Cream aims to nourishes skin while reducing fine lines. Potentially just as valuable as the formula, itself, is the name and branding associated with the brand’s staple HydroLift Cream, which Amarte claims in a new lawsuit that it “has extensively and continuously used and promoted in connection with its goods … for over a decade,” thereby resulting in “great success.” According to the trademark infringement complaint that it filed this week in a California federal court, Amarte alleges that unrelated skincare brand Lavié Labs has taken to using “an identical HYDROLIFT trademark” in connection with the sale of its own products. Not only is this problematic because Lavié Labs is “a direct competitor of Amarte,” and thus, is offering products using the allegedly infringing mark to “the same consumers and in overlapping channels of trade in the U.S,” and has been since 2018, “well after Amarte’s [first] use,” Lavié Labs use of the HydroLift mark is likely to confuse consumers, Amarte argues. Lavié Labs is “likely to cause confusion before, during, and after the time of purchase because consumers, prospective consumers, and others viewing [its] infringing goods at the point of sale or in use—due to [its] identical use of the HYDROLIFT trademark in connection with nearly identical skin care products.” More than that, Amarte claims that confusion is likely given that it “the purchasing public has come to associate the HYDROLIFT trademark with Amarte … and its skin care and cosmetic products” as a result of more than a decade of use and promotion of the trademark. With that in mind, Amarte claims that Lavié Labs is engaging in “a blatant attempt to trade on the goodwill and commercial success Amarte has built up in the HYDROLIFT Trademark and to free ride on Amarte’s success as a preeminent and well-known manufacturer and developer of skin care and cosmetic products.” Setting forth claims of federal and California state law trademark infringement and unfair competition, Amarte is seeking preliminary and permanent injunctive relief to bar Lavié Labs infringement of “any of Amarte’s intellectual property rights in the HYDROLIFT mark,” and monetary damages. (Note: Given that the key ingredients in and the marketing surrounding both Amarte and Lavié Labs’ “HydroLift” products do not make any mention of the significance of water in their formulas or in connection with the results, it does not appear as though descriptiveness of the mark will be an issue in connection with the validity of Amarte’s mark (and its skin-firming and potentially ‘lifting’ product) or a defense to infringement for Lavie Labs). The lawsuit – which focuses exclusively on Lavié Labs’ alleged infringement of the HydroLift trademark and does not accuse it of copying the composition of the Amarte cream, itself – comes are many niche brands and buzzy startups face an influx of competition by way of copycats. That can, at times, see competitors ripping off others’ trademark-protected names and elements of their branding and/or product packaging (both of which are also protected by trademark and trade dress law). However, in most cases, the copying goes without legal action because it involves co-opting the type of product (and not all of the ingredients), thereby, enabling the copycat product to remain above-board from a legal perspective. In other words, for popular, often millennial-focused brands, including K-beauty ones, copycat products have saturated the market. Far from a novel phenomenon, beauty products meant to look and work like other established products, albeit at a less expensive price point – i.e., dupes – have long co-existed with high-end brands’ offerings. While dupes have long-existed in the market, they have become a particularly-popular mainstay of the $89.5 billion beauty and cosmetics industry in the United States, with the likes of K-beauty products and those coming from Kylie Cosmetics, Glossier, Drunk Elephant and other burgeoning up-starts, proving to be particularly attractive targets, as the market for dupes as a whole “becomes increasingly more popular,” according to the Independent, driven, in large part by “overzealous millennial beauty players who care more about getting hold of a similar product than waiting for” – or shelling out on – “the original.” With dupes showing no signs of subsiding and instead, only likely to garner more steam in an uncertain financial environment, brands are routinely being advised by their legal teams that when developing new products, they “should consider adopting intellectual property strategies that will improve their ability to establish exclusive rights, which will allow them to enforce their rights against the imitators,” according to Knobbe Martens’ Lesley Kim and Robert Roby. And this is precisely what is at the heart of Amarte’s suit: its “extremely valuable” product name and the goodwill associated with it, which enables the brand to take legal action even when its product has not been copied. *The case is Amarte USA Holdings, Inc., v. G.L.E.D Cosmetics US Ltd. d/b/a/ Lavié Labs, 3:20-cv-00768 (S.D. Cal.). Burberry and Barbie-maker Mattel appear to have settled a headline-making trademark clash that pitted them against each other o ...\t\t\t\t\t\t\t\t\nOctober 25, 2023 - By TFL An amended complaint filed in a stock-drop lawsuit being waged against adidas AG, its CFO Harm Ohlmeyer, and former CEO Kasper ...\t\t\t\t\t\t\t\t\nOctober 24, 2023 - By TFL Any trademark that is not “in use” is vulnerable to cancellation actions on the grounds of non-use. Not only must a mark b ...\t\t\t\t\t\t\t\t\nOctober 24, 2023 - By Marianne Tissot The European Commission has “unconditionally” cleared the path for Farfetch’s acquisition of a 47.5 percent stake ...\t\t\t\t\t\t\t\t\nOctober 23, 2023 - By TFL Join our mailing list Stay up to date with The Fashion Law ",
    "datetime": "2020-05-01T13:03:56+00:00",
    "url": "https://www.thefashionlaw.com/k-beauty-brand-amarte-claims-rival-jacked-its-extremely-valuable-product-name-and-the-goodwill-tied-to-it/"
}