{
    "title": "K-Beauty Brand Mamonde Is Leaving Singapore - TODAY",
    "text": "8days You have till March to grab your skincare favourites from the Korean beauty label. You have till March to grab your skincare favourites from the Korean beauty label. Popular K-beauty brand Mamonde is shutting down operations in Singapore, just three years after its launch here in 2017. Known for its skincare which is inspired by flowers and plants, 8days.sg received an email from the brand's parent company, Amore Pacific, announcing that Mamonde was bidding farewell to Singapore,  due to the rebranding and repositioning of the brand.  It also says:  In order for a small seed to grow and blossom into a beautiful flower, powerful and explosive life energy is needed. Likewise, to serve and speak to local customers better, the brand will be returning to the Mamonde Garden to re-explore new strategies. Poetic. No word on whether the brand will return at some point in the future or come back as a fully online entity like Crabtree & Evelyn, or why it's closing down in Singapore. Perhaps competition for beauty products here is just too stiff? Or maybe there's a bigger masterplan for the brand.If you're a fan of Mamonde products, you have till 27 February to grab your faves from their last brick-and-mortar store in Bugis+, and till the end of March before the brand exits the pages of online retailers Lazada and Shopee.Like when Crabtree & Evelyn shuttered its shops, Mamonde is offering discounts on their remaining merch, with signs displaying that products will be 15 per cent off with minimum spend of $60, 20 per cent off with minimum spend of $90 and 30 per cent off with minimum spend of $120.Here are some bestsellers to look out for. Guess you can still get your Mamonde fix when you travel to Korea? One of the brand's most popular products is the Rose Water Toner. This was launched last April. Go grab your masks at discounted prices. The last Mamonde store is at Level 2 at Bugis+. Read more of the latest in Subscribe to get daily news updates, insights and must reads delivered straight to your inbox. By clicking subscribe, I agree for my personal data to be used to send me TODAY newsletters, promotional offers and for research and analysis. Copyright 2023 © Mediacorp Pte Ltd. All rights reserved. We know it's a hassle to switch browsers but we want your experience with TODAY to be fast, secure and the best it can possibly be. To continue, upgrade to a supported browser or, for the finest experience, download the mobile app. Upgraded but still having issues? Contact us ",
    "datetime": null,
    "url": "https://www.todayonline.com/8days/liveandlearn/vanityandhealth/k-beauty-brand-mamonde-leaving-singapore"
}