{
    "title": "K-Beauty Giant Amorepacific Sees Profit Jump 727% in 2021 | BoF",
    "text": "Agenda-setting intelligence, analysis and advice for the global fashion community. The South Korean company, a subsidiary of Amorepacific Group, reported a net profit of 180.9 billion won ($151.2 million) in 2021, a year-on-year rise of 727.7 percent. Revenue grew 9.7 percent year-on-year to 4.86 trillion won, according to a regulatory filing. Amorepacific credited a 40 percent surge in online sales as a major driver for growth in 2021. The company, which owns K-Beauty brands such as Amorepacific, Sulwhasoo, Leneige, Mamonde, Innisfree and Etude, narrowed losses in its fourth quarter to 54.4 billion won, compared to 58.9 billion won in the same quarter of 2020. China, which accounts for 70 percent of Amorepacific’s Asian sales outside Korea, saw revenue drop 10 percent, which the company attributed to the closure of many of its Innisfree brand stores in the country. Learn more: K-Beauty Giant Amorepacific Looks to Shift Gears In China Amorepacific president Kim Seung-hwan reportedly dropped hints about a strategic shift for its approach to the China market during a meeting with local analysts. © 2023 The Business of Fashion. All rights reserved. For more information read our Terms & Conditions The Melbourne-based multi-brand retailer has kept both local and international competitors at bay with a regional store footprint four times larger than Sephora’s. This week’s round-up of global markets fashion business news also features Chinese investment in Egypt’s textile industry, plans to save Costa Brazil and fresh calls for Bangladeshi garment factories to pay workers more. This week’s round-up of global markets fashion business news also features the Chinese boycott of Japanese cosmetics, Mexico’s designer showcase and the industry impact of the Middle East crisis. This week’s round-up of global markets fashion business news also features Pacific India’s growing mall network, Dubai Fashion Week and Alibaba’s denial of espionage allegations. The essential daily round-up of fashion news, analysis, and breaking news alerts. Our newsletters may include 3rd-party advertising, by subscribing you agree to the Terms and Conditions & Privacy Policy.   ",
    "datetime": null,
    "url": "https://www.businessoffashion.com/news/global-markets/k-beauty-giant-amorepacific-sees-profit-jump-727-in-2021/"
}