{
    "title": "K-beauty Leader Memebox Launches “Insider Access” Ambassador Program for Beauty Influencers and Announces Partnership With Sephora | Business Wire",
    "text": "The data-driven beauty company will re-introduce its ecommerce engine \n      for shopping the best K-Beauty has to offer SAN FRANCISCO--(BUSINESS WIRE)--Memebox, \n      the fastest-growing global networks where beauty enthusiasts discover \n      the latest and hottest beauty products, today is announcing the launch \n      of the “Insider \n      Access” ambassador program and re-introducing its much-requested \n      ecommerce platform. This new platform gives beauty lovers a new way to \n      purchase Memebox’s cult K-beauty hits like Disco \n      Kitten Face Mask, Marshmallow \n      Whip Maker, and more. Also announced today, Memebox and Sephora will \n      partner on a new exclusive K-beauty color makeup brand set to debut on \n      Sephora.com and in select stores in Fall 2018.  Memebox is merging data and beauty: drawing insights from its more than \n      5 million engaged monthly beauty enthusiasts and influencers who share \n      their routines, inspirational photos and recommendations. This vibrant \n      community allows the company to forecast trends and develop the next \n      best-selling K-beauty products that Millennials and GenZ are seeking. Memebox is listening to customer feedback and by popular demand, \n      bringing back the easiest way to shop for their favorite products from \n      Memebox in-house lines: I Dew Care and Nooni. Starting today, fans of \n      these K-beauty lines will be able to purchase products directly on the \n      site - establishing the company as a full-service community for \n      discovering and purchasing products. Beginning in July 2018, Memebox \n      will sell Pony Effect products, giving shoppers a way to purchase top \n      K-Beauty products that were not previously available to the U.S. market. Moreover, Memebox is continuing its investment in its beauty community \n      with the launch of “Insider Access” - a new program that gives \n      specially-selected influencers the chance to build their portfolio on \n      the Memebox platform and drive personal revenue. For the first time, \n      ambassadors can customize their own Memebox webpage to shop with their \n      fans, share curated lists of recommended products, and get access to an \n      unprecedented level of data showcasing how posts are performing, what \n      fans want to see, and more. For purchases made through an individual’s \n      “Insider Access” ambassador page, the individual will receive a \n      percentage of the revenue. “The traditional approach to beauty today is outdated and often dictated \n      to us by a small group of people in a corporate office. We believe the \n      best in beauty is created when we listen to what the community wants and \n      empower them to share their opinion and become the trendsetters,” said \n      Dino Ha, co-founder and CEO of Memebox. “That’s why we’re excited to be \n      launching our ambassador program with our new commerce engine. It is one \n      step in our mission to giving the beauty community the power to create \n      their next cult product.” Also announced today, the company revealed a new partnership with \n      leading global prestige beauty retailer, Sephora. The partnership will \n      merge Sephora’s established role in experiential beauty and omni-retail \n      with Memebox’s digital capabilities, consumer data and ability to create \n      fast beauty, resulting in a revolutionary new K-beauty color makeup \n      brand set to debut in Fall 2018. About Memebox Memebox is the beauty company forecasting trends and creating products \n      through active social listening and data, powered by a community of 5 \n      million monthly beauty enthusiasts. Based in San Francisco with five \n      outposts across the world, including South Korea, China, Taiwan and Hong \n      Kong, Memebox is bringing the agility of the K-beauty craze to a global \n      audience through smart product development leveraging insights from its \n      community, where users share beauty tips, tricks and product \n      recommendations. Since 2014, Memebox has introduced in-house product \n      lines currently available in Asia, the United States and online: I Dew \n      Care, Nooni, Pony Effect, I’m Meme and Shine Easy Glam. Memebox was \n      founded in 2012 by Hyungseok Dino Ha.  for MemeboxLaura Pezzinimemebox@thehatchagency.com for MemeboxLaura Pezzinimemebox@thehatchagency.com ",
    "datetime": null,
    "url": "https://www.businesswire.com/news/home/20180619005929/en/K-beauty-Leader-Memebox-Launches-%E2%80%9CInsider-Access%E2%80%9D-Ambassador-Program-for-Beauty-Influencers-and-Announces-Partnership-With-Sephora"
}