{
    "title": "K-beauty Platform Glow Recipe Launches Namesake Skin-Care Range – WWD",
    "text": "The multitasking skin-care duo launches at Sephora today. Beauty Editor, Prestige NEW YORK — South Korean beauty incubator and e-commerce site Glow Recipe is introducing a namesake line of product. Until now, the business has been split between discovering South Korean beauty lines and then adapting them for the U.S. market and maintaining e-commerce site Glowrecipe.com to sell these products. But now, Sarah Lee and Christine Chang, cofounders and co-chief executive officers of Glow Recipe, are parlaying their expertise in K-beauty into a new multitasking skin-care range, that to start, has two products. A Watermelon Glow Sleeping Mask, $45, gel hydrator and exfoliator, and a Blueberry Bounce Gentle Cleanser, $34, a deep cleanser, will be launched today at Glowrecipe.com, sephora.com and will enter all Sephora stores in the U.S. June 2. (A prelaunch last week on Glowrecipe.com sold out in five hours, and there’s now a 5,000 person waitlist for the mask.) Both products do double duty or even triple duty in the case of the cleanser, which according to Chang cleanses, moisturizes and even takes on the role of a toner. Related Articles\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tBeauty Features\n\t\n\n\n\n\t\n\t\t\tSephora's Paris Flagship Gets a Makeover\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tBeauty Features\n\t\n\n\n\n\t\n\t\t\tGlossier Talks Sales, Sephora and Beyond Single products that take on multiple characteristics are central to the line, said Chang, who is open about her mission to debunk stereotypes associated with K-beauty — the most common being it takes at least 10 steps to embrace the skin-care trend. The sleeping mask, for instance, exfoliates and hydrates simultaneously — and effectively without irritation. It’s also made with watermelon, a “time tested DIY ingredient” in South Korea that’s used for things from heat rash to hydrating face mists. “We’re seeing great technology there [in South Korea] that we wanted to, essentially, distill it for the U.S. customer. While K-beauty has been amazing, there is still a lot of education that needs to happen. People are still very overwhelmed and still ask, ‘Is it really 15 steps?’” Chang said, calling her and Lee’s collection “the best in South Korean technology an innovation” but delivered in a “compact and thoughtful way.” And with Glow Recipe’s personal spin. Chang maintained that product development took 18 months and testing more than 1,000 formula submissions. Along with Lee, the two poured over technology, textures and ingredients and vetted product with a multiethnic testing panel over the course of many rounds. Since inception, the company’s business has been split between retail platform and incubator, but the addition of Glow Recipe’s own brand creates a third revenue stream. It won’t cannibalize the existing e-commerce business, which carries around 30 South Korea-based brands, Chang said. “When we product develop we don’t ever look at what’s doing well among the brands we partner with and create a lower cost version of them. That’s not how we approached this,” Chang said. “It’s important to be at forefront of trend and ingredient stories, and having a private brand gives us the flexibility and the quickness that will allow [us to] be at the forefront these trends.” Since founding Glow Recipe almost three years ago, Chang and Lee have not raised any outside capital and maintain the operation has been cash flow positive since the beginning. The $3,000 the two generated in revenue during their first two months in business quickly grew to $1 million a year later, Lee said, adding that company saw triple digit growth in 2016 and is on track to do the same the year. In March, they opened their first U.S. pop-up in SoHo, and in early May, a second temporary space bowed in Saks Fifth Avenue’s The Wellery.  “Our Instagram following grew by 2,000 people in one day,” Lee said of announcing a prelaunch of Glow Recipe’s new products last week. “The interest is there, and it will help to put out the Glow Recipe name….As a whole it’s a good thing for everyone on the platform.” Sign up for beauty news straight to your inbox every day Top News Stories Alerts Straight to your Inbox. Send us a tip using our anonymous form. WWD and Women's Wear Daily are part of Penske Media Corporation. © 2023 Fairchild Publishing, LLC. All Rights Reserved. ",
    "datetime": "2017-05-23T04:01:59+00:00",
    "url": "https://wwd.com/feature/k-beauty-platform-glow-recipe-launches-namesake-beauty-range-10891984/"
}