{
    "title": "K-Bella Salon and Spa offering residents head-to-toe makeovers | Community Focus | ahwatukee.com",
    "text": "Except for a few afternoon clouds, mainly sunny. High 84F. Winds light and variable.. Clear skies. Low 59F. Winds light and variable. Updated: October 26, 2023 @ 2:34 am      Most women can probably agree there’s nothing like a day of pampering. Georgiann Serpe, owner of K-Bella Salon and Spa in Ahwatukee, feels the same way and is offering free makeovers for deserving Ahwatukee residents. The salon is accepting written essays for those wanting to be selected for the makeover that includes nail services, haircut and/or color, a facial, and any other salon service. A new winner will be selected once a month. On choosing winners, Serpe said the essays should reflect “something that might have happened in their life that are deserving of a change, and could use a little TLC.” For Mackenzie Kolb, a student at Arizona State University and an Ahwatukee native, the makeover was just what she needed after a college program at Disney World. “I didn’t have a lot of time for myself out there,” said Kolb, who was the salon’s first makeover winner. “It was a really nice experience.” Over two days, Kolb got a manicure, pedicure, facial, haircut, highlights, and then a makeup application and hair styling for her “before and after” photos. Admitting she is one who doesn’t stray from her normal, low-key makeup and hair routine, Kolb said she was nervous about coloring her hair for the first time and trying out new makeup. “(The makeover) didn’t let me down, it was fun,” she added. Serpe said the makeovers at the salon originally began in 2004, when her former business partner came up with the idea. In an effort to bring the service back to life, Serpe hopes that the community would participate. “I feel like it’s time to pay it forward,” she said. Serpe explained the beauty behind being pampered as a time to relax and regain an overall feeling of well being. “We’re all about making people’s lives a little happier, giving a fresh start, and doing good things for good people,” Serpe said. K-Bella Salon and Spa is located at 1339 E. Chandler Blvd. To be eligible for a makeover, send an essay of no more than 500 words to info@kbellasalonandspa.com explaining your need for change through a makeover. • Contact writer: (480) 898-4903 or dmartinez@ahwatukee.com. Follow on Twitter: @_dianamartinez. Wade Lee Richards, a master stylist and makeup artist at The\nHouse of Wade Lee, also acts as the official hair stylist for the\nArizona Broadway Theatre. Wade Lee Richards, a master stylist and makeup artist at The\nHouse of Wade Lee, also acts as the official hair stylist for the\nArizona Broadway Theatre. Lose fat, increase muscle and flatten your abs with nutritionist\nand fitness expert, Paula O… If tea is so beneficial to drink, why can’t we eat it, too? Sheraton Wild Horse Pass Resort and Spa announced the launch of “Sheraton Social Hour,” a wine program to be offered in the resort’s lobby lou… Ahwatukee second-grader Dustin Henry loves random acts of kindness.       I have my own salon, which offers similar services, but still I envy this girl. About 10 years ago, when I finished college, I also went for a similar procedure and thanks to thisI realized that I also wanted to open a salon in order to bring women the same joy. Now I am very busy and have not gone to any procedures for a long time, especially now we are testing new software from beautyprosoftware.com. But as soon as the testing is over, I will definitely take a few hours to relax and pamper myself. Log In Keep it Clean. Please avoid obscene, vulgar, lewd,\nracist or sexually-oriented language.\nPLEASE TURN OFF YOUR CAPS LOCK.\nDon't Threaten. Threats of harming another\nperson will not be tolerated.\nBe Truthful. Don't knowingly lie about anyone\nor anything.\nBe Nice. No racism, sexism or any sort of -ism\nthat is degrading to another person.\nBe Proactive. Use the 'Report' link on\neach comment to let us know of abusive posts.\nShare with Us. We'd love to hear eyewitness\naccounts, the history behind an article. Never miss an issue. Sign up for free today. Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers: ",
    "datetime": null,
    "url": "https://www.ahwatukee.com/community_focus/article_1482fe82-6a5d-11e2-9228-001a4bcf887a.html"
}