{
    "title": "K-beauty, hallyu and mukbang: dozens of Korean words added to Oxford English Dictionary | South Korea | The Guardian",
    "text": "New additions highlight Korean culture wave as interest in the country’s food, fashion and entertainment spreads The Korean culture wave has swept through the editorial offices of the Oxford English Dictionary (OED), which has added more than 20 new words of Korean origin to its latest edition. The “definitive record of the English language” included words alluding to the global popularity of the country’s music and cuisine, plus one or two whose roots in the Korean language may be less obvious. The K- prefix is prominently featured, as you might expect given that so many people outside of South Korea now listen to K-pop – which was added to the OED in 2016 – watch K-dramas or use K-beauty products. The new words include hallyu - the Korean original for the wave of pop culture that has made BTS one of the world’s most popular bands and Squid Game the Netflix sensation of 2021. “The increase in international interest in South Korea and its popular culture, esp. as represented by the global success of South Korean music, film, television, fashion, and food,” the dictionary says in its definition. “Also: South Korean popular culture and entertainment itself. Frequently as a modifier, as in hallyu craze, hallyu fan, hallyu star.” But as the dictionary’s new additions make clear, there is much more to Korean cuisine than its spicy staple kimchi, which appeared in the OED as long ago as 1976. New food-related entries include bulgogi – thin slices of beef or pork – and chimaek – Korean-style fried chicken and beer. Traditional culture is represented by hanbok – formal attire worn by both men and women – and Hangul, the Korean alphabet devised by King Sejong in 1443. Aegyo, a certain kind of cuteness or charm considered characteristically Korean, and similar to the Japanese word kawaii, has been included as both a noun and adjective. There is room, too, for mukbang, or livestreams of people eating extraordinary amounts of food while talking to the online audience. The inclusion of “skinship” is more surprising. Commonly used in South Korea, where it is rendered as seukinsip, and Japan (sukinshippu) it captures the emotional bond that comes from close physical contact between a parent and child, lovers and friends, the dictionary said. The OED said the inclusion of so many Korean words was recognition of a shift in language usage beyond the English-speaking world. “The adoption and development of these Korean words in English also demonstrate how lexical innovation is no longer confined to the traditional centres of English in the United Kingdom and the United States,” it said. “They show how Asians in different parts of the continent invent and exchange words within their own local contexts, then introduce these words to the rest of the English-speaking world, thus allowing the Korean wave to continue to ripple on the sea of English words.” ",
    "datetime": "2021-10-05T04:18:27.000Z",
    "url": "https://www.theguardian.com/world/2021/oct/05/k-beauty-hallyu-and-mukbang-ozens-of-korean-words-added-to-oxford-english-dictionary"
}