{
    "title": "K-Discovery: Korean Beauty & Skincare Trends | British Vogue | British Vogue",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, select My Account, then View saved stories To revisit this article, visit My Profile, then View saved stories To revisit this article, select My Account, then View saved stories By Scarlett Conlon Masks are huge news. In Seoul, there is shop after shop selling  nothing but face masks with all manner of claims and for all concerns. Korean women use masks every single day, as opposed to in the West where they are used more for a special occasion or a  pick-me-up, according to international beauty director for Condé Nast Asia, Kathy Phillips. Plastic surgery is nothing to hide; instead it is something to be proud about. \"Plastic surgery is part of everyday life. In Korea, plastic surgery is so common that people walk around with bandaged faces like it is nothing. In America or Europe people  might think they were hurt - not in Korea,\" according to Sangjoon Park, president of Seoul's ID Hospital. Packaging is as important as product. It's all about storytelling, with lots of princesses, princes, castles and crowns and diamante. Christine Chang, co-founder of Glow Recipe, thinks K-beauty is having such a boom because of the cute, social-media  friendly packaging of Korean products and the power of electronic peer-group influence. Read more: 10 Best BB Creams By Alice Cary By Hannah Jackson By Hannah Coates Nose jobs, facial reconstruction and surgeries are seen as ways to help young millennials get jobs, as employers are concerned with  having a good-looking workforce. \"Parents pay for surgeries here as they think it is their responsibility to help their children go into the job market,\" according to Park. Young women are frequently being gifted plastic surgery for a 16th or 18th birthday present, or an end-of-exams present and are very proud about it. The already extensive Korean beauty regime is only getting more so. Women see their daily beauty regime as pampering experience and one that should be slowly enjoyed - not rushed through to get out of the house. Whereas in the West, consumers are targeted with  time-saving solutions, in Korea the seven-step regime is creeping up to 11 stages, says Phillips, and is an experience to be savoured. Plastic surgery is starting to seriously rival the hard luxury industry, with many choosing to spend $5,000 on a new nose, rather than a new handbag or piece of jewellery, as they see it as a better investment. Plastic surgery in Korea is also tax-exempt for  the next five years. Read more: Eight Beauty Innovations We Have Korea To Thank For By Emily Chan By Alex Kessler By Emma Specter By Daniel Rodgers More from Vogue Condé Nast Britain © 2023 Condé Nast ",
    "datetime": "2016-04-28T11:31:38.000Z",
    "url": "https://www.vogue.co.uk/article/k-discovery-korean-beauty-trends"
}