{
    "title": "K-Pop Stars Crayon Pop, Hyolyn, and 2NE1's CL Team Up Stevie Wonder and Other Musical Acts at Mnet Asian Music Awards in Hong Kong - WSJ",
    "text": "K-Pop Stars Invade Hong Kong for Mnet Awards K-Pop Stars Invade Hong Kong for Mnet Awards This copy is for your personal, non-commercial use only. Distribution and use of this material are governed by\nour Subscriber Agreement and by copyright law. For non-personal use or to order multiple copies, please contact\nDow Jones Reprints at 1-800-843-0008 or visit www.djreprints.com. http://blogs.wsj.com/scene/2013/11/23/k-pop-stars-invade-hong-kong-for-mnet-awards/ By Isabella Steger Updated Nov. 22, 2013 10:46 pm ET Stevie Wonder and Aaron Kwok were among the stars who graced the annual Mnet Asian Music Awards on Friday in Hong Kong, the second consecutive year the K-Pop extravaganza was held in the city. While Psy stole the show in 2012 with \"Gangnam Style,\" this year's event will be remembered for its collaborations between K-Pop stars and other musical acts. Cantopop king Aaron Kwok and girl group Sistar's Hyolyn joined Stevie Wonder at the end of the awards show for a rendition of \"I Just Called to Say I Love You,\" and Swedish girl duo Icona Pop teamed up with 2NE1's CL. Meanwhile, two of the year's biggest novelty acts -- Norway's Ylvis and Crayon Pop -- entertained the audience with a performance of the girl group's \"Bar Bar Bar,\" with the brothers also donning Crayon Pop's trademark motorcycle helmets. Copyright ©2023 Dow Jones & Company, Inc. All Rights Reserved. 87990cbe856818d5eddac44c7b1cdeb8 Continue reading your article witha WSJ subscription Already a subscriber? Sign In WSJ Membership Customer Service Tools & Features Ads More Dow Jones Products WSJ Membership Customer Service Tools & Features Ads More Copyright ©2023 Dow Jones & Company, Inc. All Rights Reserved This copy is for your personal, non-commercial use only. Distribution and use of this material are governed by\nour Subscriber Agreement and by copyright law. For non-personal use or to order multiple copies, please contact\nDow Jones Reprints at 1-800-843-0008 or visit www.djreprints.com. ",
    "datetime": null,
    "url": "http://blogs.wsj.com/scene/2013/11/23/k-pop-stars-invade-hong-kong-for-mnet-awards/"
}