{
    "title": "K-Pop Group BTS Reveals Its Biggest Beauty Secrets for Glowing Skin | Allure",
    "text": "By Devon Abelman Last month, BTS, a K-Pop group from Seoul, cemented itself in American pop culture by winning the Top Social Artist Award at the Billboard Music Awards. The second the boy band hit the magenta red carpet, thousands were exposed to the wonders of K-Pop. Since then, people have been quick to call BTS, which is short for Bangtan Sonyeondan (or Bulletproof Boy Scouts in English), the One Direction of South Korea. However, that's just an easy way to give them some context. In reality, BTS is actually completely different. Why? The seven-piece group's performances are complete with flawless choreography, expert rapping, high-fashion looks, and insanely catchy vocals. Oh yeah, and they look damn good while doing so. No matter where BTS is, their skin is forever smooth and has an enviable glow to it. Their eyes are typically adorned with a subtle smoky eye look, which both Jin and Jimin told me is their favorite part of wearing makeup. Their lips always have that popsicle-stained look that everyone's been craving lately. Their hair colors are constantly changing, too. In 2017 alone, Jimin's hair has been bubblegum pink, platinum blonde, sandy blonde, and caramel brown. If they had to choose just one shade, though, RM tells Allure that he prefers \"ash gray and ash blue because these complement my skin tone well.\" Agreed. Also, Suga added that his favorite hair color is blonde because \"I just need to de-color and that’s it.\" The beauty aspect of BTS's fame alone separates them from the likes of One Direction, the Jonas Brothers, and the Backstreet Boys. And their legions of fans, lovingly called A.R.M.Y., live for it. YouTube is filled with makeup tutorials inspired by looks from BTS's music videos. A whole Tumblr account called Dewy Bangtan is even devoted to tracking down the beauty products BTS uses based on screenshots from behind-the-scenes videos. If the names I mentioned above didn't ring any bells, let me give you a quick summary of each of the seven members of BTS. At 25, Jin is the oldest member of BTS, but he doesn't act like it. He has a very specific skin care-related reason for that. In a recent video, he said, \"I have a motto of my life, 'If you behave young, your face becomes young, too.'\" Noted. His good looks went viral after the Billboard Awards. On Twitter, he was called the \"third one from the left\", accompanied by dozens of heart-eye emojis. His response? He's \"worldwide handsome.\" Many will identify with Suga, one of the group's rappers, on a spiritual level, as I do. When he isn't working his ass off producing, writing, and composing songs, he just likes to lay. Same. Just as his hair color preference suggests, he's the most low-maintenance of the Bangtan Boys as far as beauty routines goes. He's basically a granddad trapped in a 25-year-old's body. By Aliza Kelly By Gabi Thorne By Gabi Thorne V's interests lie in the finer things in life like Gucci, Van Gogh, and photography. The 22-year-old also makes some of the most hilarious facial expressions and has the most velvety voice in BTS. Some consider him to be the most handsome in the group, but I'll let you decide. Jimin is the king of selfies. BTS's Twitter is filled with evidence of this statement. In their music videos, you can pick him out by his sharp dance moves. In group photos, you can pick him out by his seriously adorable baby face. Don't let it fool you — he's not the youngest. He's 22. And if anyone was wondering, he's what K-Pop fans call my \"bias,\" aka my favorite. His pink hair sealed the deal for me. By Aliza Kelly By Gabi Thorne By Gabi Thorne Ok, now it's time to talk about the youngest member of BTS. Jungkook, 20, is a classic, hard-working millennial. He can do everything, including sing (in English), dance, and rap, and do it all incredibly well. When not suited-up in a dress shirt or velvet bomber jacket on stage, you can catch him wearing a white T-shirt and Timberlands. Meet the leader of the group. BTS was literally built around the 23-year-old. As you probably could have guessed, RM, well, raps. He's also BTS's mouthpiece. Fluent in English, he usually takes the lead in stateside interviews. (Watching Friends helped him learn the language.)  He has a habit of winking in photo shoots and making people across the world melt. Cringe-worthy hairstyles from BTS's debut in 2013 aside, RM has some of the best looks of BTS. By Aliza Kelly By Gabi Thorne By Gabi Thorne I'm convinced J-Hope's ever-positive personality is the true secret behind his glowing skin. (More on his actual secrets later.) The 24-year-old is like BTS's portable charger, giving them (and fans) energy and encouragement. Watching him dance will give you strength, too. Trust. He's s-o g-o-o-d. By Aliza Kelly By Gabi Thorne By Gabi Thorne Now that we're all on the same page, here's the best part: BTS took a break from their massive world tour, which has made stops in the US, Australia, and Brazil, to chat with me about their skin-care routines. Yup, you're about to find out some of their secrets. Why is it important to you to take good care of your skin? Jin: \"Skin is what completes my appearance. I value my looks very much, so it’s equally important to take good care of my skin — that’s a pivotal part of my face.\" J-Hope: \"Taking good care of your skin is the No.1 rule for all celebs. I get to meet a lot of fans face-to-face at fan meetings and similar events, and I’d like to look my best for them.\" What’s your biggest skin concern? RM: \"My skin is dry most of the time, and my biggest concern is keeping it [moisturized]. I get zits from time to time and that concerns me as well.\" Jungkook: \"I get pimples sometimes, and it’s very stressful.\" By Aliza Kelly By Gabi Thorne By Gabi Thorne You guys travel a lot. Do you do any skin-care treatments while you’re on the plane to keep your skin from freaking out? V: \"On the plane, I dampen cotton pads with toner and put on lotion twice as much.\" Jimin: \"I don’t really do anything extra special for my skin on the plane, but I try to drink as much water as possible.\" What are some of your favorite beauty products? V: \"I’ve been looking for my absolute favorite beauty product for a long time because my skin becomes dry and oily relatively fast. I haven’t found the right one, but I’m not giving up! Any recommendations?\" What is your skin routine like? J-Hope: \"[In the morning, I use] toner and face cream. [At night, the steps are] toner, essence, acne care, lotion, cream.\" Jungkook: \"Toner and cream for night and morning routine.\" A lot of people find skin care routines to be a form of self-care. Do you agree? RM: \"I totally agree. My favorite brand is Mediheal, and it has a variety of sheet masks you can choose from after a long day of work.\" Jimin: \"I do agree because I try to clear my mind by cleansing my face after performances.\" By Aliza Kelly By Gabi Thorne By Gabi Thorne Do you have any bad skin care habits? Suga: \"My bad habit is that I don’t take care of my skin.\" V: \"I don’t particularly have a bad habit, but I’m worried about my skin having lack of elasticity. How can I prevent this?\" Are there any Korean beauty trends that you particularly love? Jin: \"I love sheet masks. I try to put them on whenever I feel my skin is dry and exposed too much to the sun. They help me make up for lost moisture and brighten my skin.\" Do you have any go-to skin care tips for clear, glowing skin? J-Hope: \"I try to go to the dermatologist when I have some free time after work.\" Jungkook: \"I wish I had one! Let me know, and I’ll try.\" Excuse me while I send Jungkook my list. If I learned anything from the Bangtan Boys, it's staying diligent with toner, using it day and night (and on the plane). If you need a recc or two, Allure editors are loving the Kopari Coconut Rose Toner and Acwell's Licorice pH Balancing Cleansing Toner right now. By Aliza Kelly By Gabi Thorne By Gabi Thorne Follow Devon Abelman on Twitter and Instagram. Read more about BTS: Now, check out Korean actress and pop star Jihae’s all-natural beauty routine: Follow Devon Abelman on Twitter and Instagram. By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Devon Abelman By Nicola Dall'Asen By Sarah Han By Kara Nesvig More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2017-06-21T20:36:58.760Z",
    "url": "https://www.allure.com/story/k-pop-group-bts-beauty-secrets-interview"
}