{
    "title": "K-Pop Hot 100: Park Hyo Shin Edges Out Apink – Billboard",
    "text": "Billboard chart highlights from the K-Pop Hot 100 and beyond featuring Park Hyo Shin, Apink, Girls' Generation, Mad Clown, Super Junior-M, B.A.P, Crayon Pop, 2NE1, PSY, MBLAQ and more. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin Male solo singer Park Hyo Shin clinches the No. 1 spot on the K-Pop Hot 100 this week with his new ballad “Wild Flower,” dethroning last week’s chart topper by K-pop legend Lee Sun Hee. Considered by many as one of Korea’s top male vocalists, Park Hyo Shin was out of the spotlight for four years due to South Korea’s two-year mandatory military service as well as a nasty contract dispute with his former agency.  After a few delays, the singer has released his highly anticipated comeback single on March 28, under Jellyfish Entertainment — home to Sung Shi Kyung and VIXX — and proved the promise of his killer pipes as he conquered various K-pop music chart TV programs without any major promotions. The ballad is about overcoming turmoil and difficulties, using wild flowers as a metaphor. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t04/15/2014 The accompanying music video uses a one-take method and showcases Park belting out the emotional lyrics anchored only by a piano. The K-pop veteran later revealed that he stripped out the 50-piece orchestra from the original track to fully deliver the sincerity of the lyrics. “Wild Flower” at No. 1 means girl group Apink settles for the No. 2 slot with their new single “Mr. Chu.” Should the new single not rise higher than the runner-up slot, it would be the adorable sextet’s second No. 2-peaking single in a year’s time, following “NoNoNo” released in July.  Continuing Apink’s slew of bubblegum-pop singles, “Mr. Chu” doesn’t necessarily push Apink into new or unexplored territory. Rather, “Mr. Chu” seems to be a way to try to futher solidify themselves as K-pop’s ultimate sweethearts. As Girls’ Generation continue to evolve and show a more mature side of themselves, Apink seem ready to be the spritely, smiley girl group who wouldn’t dare to touch a sexy concept like so many other female acts today. Following Apink is two former No. 1s: Last week’s chart topper, Lee Sun Hee’s “During That Meet Your” (below), slips to the No. 3 position in its second week on the chart; Plus “Some,” the collaboration between SISTAR’s Soyou, Junggigo and Lil Boi of Geeks that ruled the chart for a record-tying seven weeks.  Following the success of last year’s collaboration track “Stupid in Love” with SISTAR’s Soyou — which hit No. 1 in September — rapper Mad Clown released his 2nd EP “Ferocity” on April 4. The lead single “Without You” (below) features SISTAR’s lead vocalist Hyorin and is the Hot Shot Debut this week at No. 5. The hip-hop ballad about the hardships of a breakup is heightened by Mad Clown’s signature fiery spitting skills and Hyorin’s smoky vocals. In the music video, model Cho Min Ho is portrayed as completely distraught man reminiscing about his past relationship. Will another pairing between Mad Clown and a SISTAR member snag a No. 1?  The chart’s second highest debut belongs to Crayon Pop, who return to the Top 10 of the K-Pop Hot 100 with “Uh-ee.” The energetic new single is the quintet’s best showing since their viral hit “Bar Bar Bar” reigned atop the K-Pop chart for a week in 2013. Despite the non-stop choreography, the girls haven’t missed a beat in their slew of comeback performances on K-pop music chart programs. Watch “Uh-ee” live below:  K-Pop on Other Billboard Charts:—World Albums: Super Junior-M’s “The 3rd Mini Album” EP debuts at No. 5.—Japan Hot 100: B.A.P’s “No Mercy” debuts at No. 2 on the chart. Interstingly, the Korean version of the hit single peaked at No. 30 on the K-Pop Hot 100. FTIsland’s “Mitaiken Future” debuts at No. 17.—World Digital Songs (Highlights – Full Chart Available to Subscribers): Super Junior-M’s “Swing” (below) is the chart’s highest new entry at No. 5 while it starts at No. 85 on the K-Pop Hot 100. Crayon Pop’s “Uh-ee” is the second-higest debut at No. 15. PSY’s “Gentleman” falls two spots at No. 7. Meanwhile, MBLAQ’s “Be a Man” falls from No. 9 to No. 23 in its second week on the chart. As well, 2NE1’s “Come Back Home” falls from No. 7 to No. 14 and Girls’ Generation’s “Mr.Mr.” falls one spot to No. 17, both in their sixth week on the chart.  Daily newsletters straight to your inbox Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2014-04-15T13:20:00+00:00",
    "url": "https://www.billboard.com/pro/k-pop-hot-100-park-hyo-shin-edges-out-apink/"
}