{
    "title": "K-Pop Group KARD Shares How to Get Flawless Skin Like a K-Pop Star  | Allure",
    "text": "By Devon Abelman Rarely would I consider taking the opportunity to switch places with people who tell me they wish they had my job for a day. Well, that is until up-and-coming K-pop group KARD stopped by the Allure office during the New York City stop of their WILD KARD Tour across America. After spending time in our beauty closet and seeing my desk — which looks like someone dropped a Sephora on it — members Jiwoo and Somin told me the fated sentence that I usually hear from friends and family: \"I wish I had your job.\" I can't sing, dance, or rap if my life depended on it, but same. In a genre dominated by single-gender groups, KARD stands out as one of the few co-ed K-pop groups of the moment. They only officially debuted in July, but Jiwoo, Somin, B.M., and J.Seph have already brought their intoxicating tunes to Los Angeles, Milan, London, and Rotterdam. (Seriously, I dare you to listen to any of their songs and not get it stuck in your head. My personal fave is \"Oh NaNa\".) They've proved that co-ed K-pop groups can, in fact, work — especially in America. Because they aren’t specifically tied to expectations of all-male or -female groups, they have a fluidity (or \"freedom,\" as Jiwoo says) that is more relatable to U.S. listeners. And KARD is about as relatable as it gets. Despite the colorful and occasionally bedazzled outfits they wear on stage, most of them consider their personal styles to be low-key and minimalist. You can most likely catch them in sweats when they're not performing. \"Whatever I wear, it needs to be comfortable,\" B.M. says. Even when I asked them if they would rather dye their hair rainbow or gray, they unanimously voted for gray. \"Simple is best,\" J.Seph, one of the rappers of the group, adds. Jiwoo is the style outlier, though. The 21-year-old, who sings and raps, has a hard time pinpointing one word to describe her style and settles on \"variety\". With that in mind, I wasn’t surprised to find out that she gets beauty inspiration from Rihanna. \"Starting from her nails, everything she does fits her and looks good on her,” Jiwoo explains. And if you were wondering, J.Seph’s is Cristiano Ronaldo. “I really love his hairstyle,” he says before describing it in thorough detail and cracking everyone up. He adds that he wouldn't be able to replicate it on his hair because it’s too curly. I ask how curly it is, and he says it’s curlier than mine, which has loose ringlets. As for their off-duty makeup, they prefer to keep it low-key, too. When they don’t have to wear makeup for work, they try not to wear makeup at all because they believe that’s what’s best for their skin. Even Somin says, “I like when someone else does it because I don’t know how to do makeup, so I always go with no makeup.” Well, except for a bit of strobe cream. “I love the glowing look,” she says. Incredibly same, Somin. If anything, they’ll fill in their brows before leaving the house. All of KARD’s members are serious about their brow game — even B.M., I learn — and consider a brow pencil as one of their must-have beauty products. J.Seph also points out that the way they do their brows is much different from women in the U.S., especially in terms of length. Generally speaking, in Korea, the preferred brow shape is shorter and straighter. Obviously, in America, we are more about extending the tails of our brows into the perfect arch. By Aliza Kelly By Gabi Thorne By Gabi Thorne Some aspects that KARD does have in common with the buzziest single-gender K-pop groups of the moment, like BTS and EXO, is constantly changing hair colors, enviable flawless skin, and makeup that makes you want to search for tutorials for on YouTube. OK, maybe just for the girls, Jiwoo and Somin, though. J.Seph tells me that the guys in KARD have a lot lighter makeup than the all-male groups. “That’s what I like,” he adds. “When they do [the bolder makeup], it’s cool, but I wouldn’t be able to pull it off.” Although I assure him that he definitely could, one thing was for sure while I hung out with KARD: skin care knows no language. (Only Los Angeles-born B.M., another rapper in the group, speaks fluent English.) And damn, Jiwoo and Somin know a lot about skin care. They’d definitely be able to pass as digital beauty reporters for a day. (I, on the other hand, would embarrass everyone I know if I went on stage to perform \"Hola Hola\".) As Somin puts it, “In order for our makeup to look good, taking care of the foundation of your skin is very important. When you put on makeup, it’s two times better than if you have bad skin. It’s twice as more effective.” And the 21-year-old singer's clear, radiant skin proves it. (It's seriously what glass skin dreams are made of.) She and Jiwoo share so many skin care tips with me that B.M. says he's learning. I ask him and J.Seph what else they’ve picked up from Jiwoo and Somin, and right away, B.M. says, “Use masks at least twice a week. Use lotion. The lotion [J.Seph and I] use is actually the lotion Somin uses.” Later in the interview, he mentions that he wasn’t really aware of skin care until he moved to Korea and has picked up on K-beauty, in general, from the girls and seeing how they take care of their skin. J.Seph follows this up with, “I learned that makeup isn’t the important part. It’s all about washing it off.” By Aliza Kelly By Gabi Thorne By Gabi Thorne Lotion, masks, and makeup removal came up a lot while chatting with KARD about beauty. And yes, I mean lotion, not moisturizer. That’s a whole separate part of Jiwoo’s six-step skin-care routine. She constantly stresses the importance of hydration to me. She likes to layer up on hydrating toner, lotion (which is lighter than your typical moisturizer), moisturizer, and something she refers to as “pomade.” (I’m still unclear on what this is, though.) Jiwoo also shared her go-to hydration hack. \"Because it’s so dry in Korea in the winter, I like to make a quick pact,” she says. “You wet cotton pads with toner and place them all over your face. Instead of opening a new sheet mask, it’s a way to get quick hydration.” (Excuse me while I go try this out.) Need a toner recc? Try one of Savor Beauty's Toning Mists, which are targeted for specific skin types. As for makeup removal, Somin counts that as one of the biggest changes to her beauty routine since joining KARD. She’s learned that as soon as she’s done with her scheduled performances or appearances, wiping off all her makeup immediately is a must. “Typically when we put on makeup, we have to keep it on for about 10 hours,” she says, “so we need to give our skin time to breathe.” Jiwoo agrees and adds, “When we’re really busy, there’s more time that we’re wearing makeup than not wearing makeup. So cleansing and taking off our makeup is super important to us.” Because of this, B.M. keeps face wipes in his bag, too. By Aliza Kelly By Gabi Thorne By Gabi Thorne Somin and Jiwoo spend a little bit more time taking off their makeup than rubbing a wipe all over their faces, though. Somin starts off with a cleansing water to remove her eye and lip makeup. (Son & Park's Beauty Water is always a good option.) Next, she washes up with an oil cleanser, then a foam cleanser. “I like it when the cleanser has foam because I don’t feel like my face is clean without it,” she adds. (Somin didn't reveal which one she uses, but Allure editors love Neogen's Cereal Real Fresh Foam Cleanser.) Jiwoo prefers a cleansing balm for taking off her eye and lip makeup, though. (She doesn't cite her go-to, but Banila Co's Clean It Zero Purity is a cult-favorite.) “Then, I use a ton of cleansing water,” she says. Another essential part of their skin-care routines: exfoliation. All agree that they would rather never use mask again than never exfoliate. Although B.M. says his is only two steps — cleanser and lotion — he swears by scrubbing his face with an exfoliating face wash before traveling. “I break out really, really badly if I don’t do that before a plane ride, especially long plane rides from like Korea to the U.S.” Somin, on the other hand, has a more extensive routine. She mentions that hers is five to six steps, but I suspect it’s even more than that. Exfoliation is a major one for her, too. “Before I sleep, I like to use a grainy exfoliator,” she says. “But if I need to do something quickly and have to put on makeup right after, I like to use a peel.” OK, now that I know all the secrets to KARD’s luminous, flaw-free skin, I’m going to completely overhaul my skin-care routine. I’ll start with adding more lotions and creams to my product lineup. To find out about B.M.’s dream hairstyle and who takes the longest to get ready, you can watch the Twitter Live I did with KARD below. This content can also be viewed on the site it originates from. By Aliza Kelly By Gabi Thorne By Gabi Thorne Related stories: Now, get a peek into Jihae's natural beauty routine: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Devon Abelman By Nicola Dall'Asen By Sarah Han By Kara Nesvig More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2017-09-25T17:07:26.023Z",
    "url": "https://www.allure.com/story/k-pop-kard-skin-care-interview"
}