{
    "title": "K-Pop Star Hyorin Nails Cover of Beyonce’s ‘End of Time’: Watch – Billboard",
    "text": "SISTAR's Hyorin -- sometimes referred to as \"The Beyonce of Korea\" -- performs a fitting homage to Beyonce with a cover of \"End of Time.\" By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin After making her official solo debut with the double singles “One Way Love” and “Lonely,” K-pop diva Hyorin delivered fans yet another treat with a cover of Beyonce’s “End of Time,” a fan-favorite off Bey’s 2011 LP “4,” during a live TV special. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news The leader of K-pop girl group SISTAR — at times referred to as the “Korean Beyonce” — kicked off her performance with an instrumental mashing the beats of “End of Time” and “Run the World (Girls)” before moving into her cover. Impressively, the South Korea native performed every word of the English track, even hitting the quick, staccato notes after the second chorus. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t12/02/2013  In addition to nailing a few of Beyonce’s powerful belts, the 22-year-old gave a nod to the “Single Ladies” singer’s dance style. The K-diva incorporated Beyonce’s signature hair flips and hip thrusts while adding in Hyorin’s new “crab legs” move, seen in the music video for “One Way Love” (below). Hyorin’s pronunciation isn’t perfect, but for a non-native English speaker the cover is impressive. It will not only further fuel the Beyonce comparisons, but could also see a few Bey Hive members getting into Hyorin if they love hair flips, hip thrusts and diva belting.  Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2013-12-03T00:18:46+00:00",
    "url": "https://www.billboard.com/music/music-news/k-pop-star-hyorin-nails-cover-of-beyonces-end-of-time-watch-5812289/"
}