{
    "title": "K-Pop Frenzy Fuels Makeup Market for Men",
    "text": " Profile Sections tv Featured More From NBC Follow NBC News A man arrested in the killing of a Baltimore tech entrepreneur was suspected of raping a woman days before and was already under surveillance, police say September 28, 2023, 12:24 PM Michael Gambon, the actor best known for playing Dumbledore in the 'Harry Potter' films, dies at 82 September 28, 2023, 8:02 AM Morning Rundown: Biden impeachment inquiry's first hearing, Powerball jackpot nears $1 billion, and Kansas City's love story with Taylor Swift September 28, 2023, 7:36 AM U.S. soldier Travis King arrives back on American soil after being expelled from North Korea September 28, 2023, 4:04 AM Remains found in Colorado are identified as Suzanne Morphew, a mom who disappeared in 2020 September 27, 2023, 5:54 PM The mother of a man suspected of killing a Baltimore tech CEO urged him to surrender, fearing police would try to kill him September 27, 2023, 2:37 PM SEOUL, South Korea — Rapper Kwon Ji Yong, who goes by the stage name “G-Dragon,” is among South Korea’s most prominent male sex symbols, winning over fans with his suave, boyish looks and chic dance moves. Often surrounded by a bevy of female dancers, G-Dragon greets screaming teenage audiences in token rapper style, showing off arm tattoos, garish earrings, and hair colors that vary from beach blond to bright pink. But it’s G-Dragon’s other trademark that has the cosmetic industry taking notice: He’s an ostentatious applier of makeup. And forget about the fringe gender-bending realm of 1980s pop stars like Boy George and David Bowie. The massive popularity of K-pop is fueling mainstream emulation. The result: South Korea is home to a booming market for male beauty products. Of course, male makeup sales pale next to the market for women, and only a minority of Korean men apply a raft of products such as “BB Cream” on a daily basis. Last year, South Korean men spent $635 million on whiteners, lotions and skin creams — second only to China, according to research firm Euromonitor, in a region that makes up about two-thirds of global spending in this $3.3 billion market. “The market for male cosmetics has definitely been expanded in the last couple of years,” said Kim Tae-young, a make-up artist at an Olive Young branch in Hongdae, an indie nightlife district in Seoul. “Things are very different from the past, when cosmetics were associated exclusively with women,” she said. “I get the feeling that there is a lot less self-consciousness about those gender divisions among our customers these days.” Even then, wouldn’t the average dude shun this trend for being “feminine?” Not exactly, according to enthusiastic cosmetic artists and their male customers interviewed by GlobalPost. Legions of K-pop fans adore G-Dragon and his peers. So much that swarms of men want to be them, they say. That’s because, staying true to the masculine roots of gangster rap, G-Dragon has managed to inject what fans call an iconic flair into his thick eyeliner and lipstick, wowing the throngs of starry-eyed young females who swear allegiance to K-pop. At beauty school and through YouTube tutorials, male fashionistas inquisitively study and apply these K-pop influenced beauty masks and gels. Many take cue from G-Dragon’s advertisements for deep red lipstick — and a host of other endorsements for gels and lotions by the well-paid men of K-pop. Trickling down to the mass market, most makeup-wearing men aren’t so flamboyant, simply choosing to brush up every morning with hints of whitener and eyeliner. “My supervisor encourages it, to appear nice for our customers,” explains Park Jae-hyeon, 28, a banker wearing subtle eyeliner. “This is the 21st century. Men need to look good too.” It’s the younger guys, who don’t have to worry about their professional appearance, who have the luxury of sticking out with more extreme looks. That’s why students and recent graduates are “following what they see on TV,” said Kim Tae-young of the Olive Young store, looking up to their favorite idols and celebrities. This story first appeared on GlobalPost. More from GlobalPost: South Korean ferry captain jailed for 36 years, acquitted of murder The destructive side of Gangnam style Meet South Korea's red-busting Buddhist monk © 2023 NBC UNIVERSAL ",
    "datetime": null,
    "url": "https://www.nbcnews.com/news/asian-america/k-pop-frenzy-fuels-makeup-market-men-n247746"
}