{
    "title": "K-Pop Music Show ‘M COUNTDOWN’ to Be Filmed at KCON 2013 – Billboard",
    "text": "KCON 2013 will host the first ever K-pop music program filmed in America on August 24 and 25 at the L.A. Memorial Sports Arena. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin KCON, the U.S.-based convention devoted to K-pop music, will be held over two days (Aug. 24-25) at the Los Angeles Memorial Sports Arena and will host a popular Korean music program. A product of youth Asian entertainment brand Mnet, KCON has promised an expanded event with artist meet-and-greets, photo ops, celebrity panels, contests and fan workshops. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news KCON 2012: 15 Things Seen & Overheard Perhaps the most impressive part of the convention will be KCON 2013 hosting an episode of the music chart show, “M COUNTDOWN.” Every weekend, K-pop stars perform their current singles on these various music programs. An act is announced as a winner at the end of every “M COUNTDOWN” episode based on the current single’s digital sales, album sales, global fan votes and more. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t06/23/2013 “M COUNTDOWN” has filmed special episodes in other countries like Indonesia and Taiwan, but no program has ventured to the States. KCON 2012 featured popular acts like 4minute, B.A.P, G.NA, EXO-M, NU’EST and more. If the forthcoming L.A. episode follows suit as other special shows, it should bring some of K-pop’s top performers. Lineup details will be released throughout the summer. Billboard’s own K-Town columnist @Jeff__Benjamin will speak on KCON panel “Spreading the Goodness of K-Pop!” on Sunday, August 25, from 11:00 a.m. to 12:00 p.m. in Panel Tent #1. More info here. Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2013-06-23T13:22:26+00:00",
    "url": "https://www.billboard.com/music/music-news/k-pop-music-show-m-countdown-to-be-filmed-at-kcon-2013-1568022/"
}