{
    "title": "K-Pop Band BTS Announces First Sunscreen Launch in Their Beauty Line | Teen Vogue",
    "text": "By Sarah Wu We've long admired K-pop boy band BTS, not only for their catchy songs, but also for their unwavering dedication to beauty. All seven members have wowed us in the past with Instagrammable looks from popsicle pouts to rainbow hair colors to subtle smoky eyes. Plus, they clearly know which products will stay put through an on-stage performance and keep their skin clear on-tour, too. Previously, BTS members Suga and J-Hope showed fans exactly how it's done when they live-streamed their skincare routines. The must-watch video included sheet masks, essence, and occasional spritzes of toner (and yes, we immediately took notes on the exact products used). Apparently, BTS is well aware that fans (us included) would happily shop a line of BTS beauty merch — because they're about to give us exactly that this fall. According to Digital Music News, the band previously partnered with K-beauty line VT Cosmetics to launch makeup and skincare products, with each of the seven members getting his own dedicated lineup. And now, we finally have the details on what's coming first: BTS x VT Essence Sun Pact. Refinery29 reports that the drop will include seven sunscreen cushion compacts, one devoted to each member. Surprisingly, it's not the first time BTS has tried its hand at beauty; the brand previously created a one-off hand lotion line. But now, it looks like we can expect way more products in the future, which is rumored to officially launch this fall. BTS fans, get ready to copy their routines way beyond sheet masks. Related: 7 Times K-Pop Band BTS Served the BEST Beauty Inspiration By Sara Delgado By Kara Nesvig By Anjana Pawa By Kaitlyn McNab More from Teen Vogue Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Teen Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "datetime": "2017-09-05T13:16:57.577Z",
    "url": "https://www.teenvogue.com/story/k-pop-band-bts-launches-k-beauty-products"
}