{
    "title": "K-Pop Star Jessica Jung Shares Her 16-Step Beauty Routine | Allure",
    "text": "By Lauren Hubbard Do you ever wonder if French girls feel left out? Not because we stopped loving them (we will never stop loving you, French girls) but because for the last few centuries they were the cream of the aspirational beauty crop, only to be unceremoniously dethroned by the latest, greatest, most obsessive-compulsive beauty craze: Korean beauty. Probably not. French girls are much too cool to be upset by that sort of thing. Still, Korean beauty trends have managed to capture the hearts and minds (and wallets) of beauty fans all around the globe while K-beauty queens, like K-pop star Jessica Jung, have become the new end-all, be-all of our beauty aspirations. Like any true K-beauty devotee, Jung has an elaborate multistep (16 to be exact) process to perfecting her dewy, natural look, and she shared every bit of it with Vogue so we can steal all of her secrets. As you might expect, half of the routine is about skincare, and we're loving it. Jung kickstarts her routine with an unexpected step, soaking cotton pads (like these By Stephanie Saltzman ) with toner, applying one to the apple of each cheek and another to her forehead, leaving them to soak in for a minute. She follows that up with a dose of essence, moisturizer, and eye cream (all from her Blanc & Eclare fashion and cosmetics line). \"I like to use the heat of my hands because it helps the skin absorb the products,\" Jung explained to Vogue. She tops that off with a spritz of hydrating facial mist. \"On flights where it's really dry, I spray it all over the place,\" says Jung, spraying a halo of mist all around her head.\nAfter applying lip balm, she puts on sunscreen (an essential step for all of us) and then tops that off with foundation. Her makeup routine is fairly simple, and intentionally so. \"A lot of my friends say, 'Did you even put on makeup?' and that's exactly what I want,\" Jung said. She applies a faint dusting of peachy blush on her cheeks, a few sweeps of a taupe shadow, and a black eyeliner. How does Jung achieve her doll-like lashes? She warms up her lash curler with a hair-dryer (\"Check it on the palm of your hand,\" she suggested, to ensure the curler's not too hot) and applies a coat of mascara. \"I don't like my lipstick to be too perfect,\" said Jung, \"so what I do is put color in the middle and then dab it with my fingertip.\" The effect is soft and slightly washed out, a little more color than her natural lips but not an in-your-face bold lip. To enhance that, she tops it with another layer of lip balm (chapped lips are nobody's idea of sexy) and then locks the whole look down with a generous waft of setting spray. Check out the video for the full beauty walk-through: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Devon Abelman By Nicola Dall'Asen By Sarah Han More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2016-08-04T21:00:49.348Z",
    "url": "https://www.allure.com/story/kpop-jessica-jung-beauty-routine"
}