{
    "title": "K-Pop Makeup & K-Beauty: 2NE1, SPICA & More Share Favorite Products & Tips | Billboard – Billboard",
    "text": "As the popularity of Korean music acts soars, its effect on the beauty industry kicks into full gear. Get K-pop beauty tips from 2NE1's CL, SPICA's Jiwon and more. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tCarson Griffith It’s undeniable that K-pop is taking over the world. YouTube reports viewership of K-pop videos has grown from around 700 million views in 2010 to more than 5.5 billion in 2013. No surprise, then, that the K-pop beauty look, or K-beauty, also is having a moment. For proof, one need only look at the country’s cosmetics exports, which, according to Statistics Korea, topped $1 billion in 2013 – a record high and a sixfold increase from $173 million more than a decade ago. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t08/20/2014\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tExplore\t\t\n\t\n\nSee latest videos, charts and news\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\t2ne1\t\t\n\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\t2NE1 (CL Solo)\t\t\n\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tCL\t\t\n\t\t\t\t\t\n\n\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news Most Viewed K-Pop Videos in America & Around the World: July 2014 And it’s not just Korean brands that are benefiting: Dior, Chanel and Benefit are a few of the international names with K-pop followings. “The power of K-pop stars is amazing,” says Charlotte Cho of SokoGlam.com, a site devoted to bringing K-beauty to the masses. “They wear something once and it can sell out.”  Before that happens, check out these favorites from 2NE1‘s CL, SPICA‘s Jiwon and YouTube vlogger/K-pop makeup tutorial expert Jeniffer Kim. 1. CL, Leader/Vocalist/Rapper for 2NE1  Your top beauty tip? “[I like] a strong eyeliner and I love playing with lip color” Favorite makeup lines and products? “Maybelline eyeliner and mascara” (full disclosure: she’s a spokewoman for the company). Do you do your own makeup or do you use a makeup artist? “When I perform or have work, I get my makeup done by an artist” What do you think the next hottest Korean product will be? “Korean lip tints, maybe” 2. Jiwon, Singer for SPICA  Your top beauty tip? “I prefer to use tint rather than lipstick these days, Korean gals don’t call it makeup when they put BB [blemish balm] cream and just tint only.” Favorite makeup lines and products? “I love the brand Yves Saint Laurent and The Benefit. I usually put only tint from The Benefit when I’m not wearing makeup.” Do you do your own makeup or do you use a makeup artist? “Normally, I do it by myself. Makeup artists help me when I need to perform on stage or be shown on TV.”  What is your makeup style? “I don’t usually put on smokey makeup. For me, basic makeup is preferred. I’d draw some shade on eyes, lines at the edge as my eyelids are thin and apply mascara all over.” What do you think the next hottest Korean product will be? “A nice cover and light-texture products are hot whether it’s BB or CC creams. I like the all-in-one set pouch which is a pack of a foundation, a concealer and a set of power brushes. So, it helps me to finish it up at once.” 3. Jeniffer Kim, YouTube Vlogger (meejmuse) and Korean TV Style Reporter  Your Top Beauty Tip? “My holy grail Korean makeup items include Laneige Water Drop Lip Tints, Skinfood Tomato Cool Jelly Lip Tints, Holika Holika Aqua Petit Jelly BB Cream, Hera Sunmate Daily (Sunscreen), Clio Professional Kill Black Brush Eyeliner, Innisfree Waterproof Gel Pencil Liners, Banila Co CC Cream and the Laneige Pore Control BB Cushion.” Favorite makeup lines and products? “Korean makeup is amazing in that it is always innovative, new, creative, have unique colour ranges and also don’t break your wallets. In other words, true value for money! My favourite Korean brands are Laneige, Hera, Skinfood, Innisfree and Clio Professional.”  What do you think the next hottest Korean product will be? “Definitely the BB cushions and pacts…The concept of ‘cushion foundation’ was born out of Korean makeup developers trying to make a BB cream that is quick and easy to apply and touch-up, and the idea was inspired from stamps. You basically ‘stamp’ the specially designed sponge into the cushion and dab it onto your face. It’s so light that it only takes seconds, and there’s no need for your hands to get dirty. You get moisturising coverage, SPF, BB properties all in one little mirrored pouch that you can also easily use to quickly and discreetly touch-up anywhere you are. The case is airtight for hygiene, refills and sponges are repurchasable, and there are so many on the market that there is definitely one for every skin type and preference. The most popular ones right now are from Laneige, Iope, Hera, Sulwhasoo and Innisfree. They say that once you try it, there’s no going back to any other type of foundation. I warned you!” Do you think there is any relation to the popularity of K-beaty to K-pop as well? “It is undeniable — the K-pop industry is an elephant in the room on the global scale. If a famous singer or celebrity is known to use a certain product, the beauty community braces itself for that product to be sold out for the next few weeks or so. With such loyal fans everywhere, the popularity of K-pop certainly is a huge driving force behind the beauty and cosmetics industry.” A version of this article first appeared in the August 9th issue of Billboard Magazine Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2014-08-21T00:52:44+00:00",
    "url": "https://www.billboard.com/music/music-news/k-pop-makeup-k-beauty-2ne1-spica-favorite-products-tips-6221997/"
}