{
    "title": "K-Pop Hot 100: Roy Kim Stays No. 1, 4minute & Lee Hyori Close Behind – Billboard",
    "text": "The weekly round-up of the Billboard Korea K-Pop Hot 100 chart with extra K-pop news bits. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin In line with finale of a major U.S. singing competition this week, Roy Kim (the winner of a similar show in South Korea, “Superstar K”) spends his third week atop the K-Pop Hot 100 chart. The country-inspired single’s music video broke two million views this week. Singing competition champions do not usually find huge YouTube numbers so quickly, but Roy Kim seems to be in a league with other reality stars who opted out of a major agency signing like Busker Busker (whose “Cherry Blossom Ending” has 4 million views). Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t05/20/2013\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tExplore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news  There was major chart battle going on between some of K-pop’s biggest girl groups as 4minute, Secret, T-ara N4 and Hello Venus all returned with singles around the same time. But it looks like 4minute’s “What’s Your Name?” can be officially named the champion of May girl groups as the song rises to a new peak this week (No. 2) as the others fall—Secret’s “YooHoo” is down two spots to No. 6, T-ara N4’s “Countryside Life” is down five to No. 15 and Hello Venus’ “Would You Like Tea?” falls 12 to No. 48.  The track is a return to the original form for 4minute going back to their mashed electronic hip-hop sounds and the public is still loving it as other girls fall. As reported last week, member HyunA had fallen ill and needed to be hospitalized, but is back in action. Just in time too as 4minute snatched yet another No. 1 spot for a music program, this week on Mnet’s M! Countdown.  Check out a quick clip of them celebrating and performing below.  Lee Hyori continues a major comeback without any promotions (yet) as her pre-release single “Miss Korea” soars eight spots to No. 3. She’s already finding a warm return before promoting paving the way for a successful album after three years absent from the K-pop scene. Find the video and more Lee Hyori news here. In other interesting chart moves, some rising K-pop groups made major moves this week. K-Town reported on boy band B1A4’s “What’s Going On?” and how it had the potential to give the boys their biggest hit yet. The theory proved true as the One Direction-esque track rockets 18 spots to No. 13 giving them their highest chart position to date. Watch a super-fun performance from Mnet’s M Countdown this weekend:   The mature nine-member female group Nine Muses also made a big splash on the K-Pop Hot 100 with new single “Wild.” The girls had struggled to land a hit before with a retro-inspired sound, but it seems they finally found hit their stride with this EDM-inspired track. The steamy music video with quite-suggestive imagery probably didn’t hurt anything either. Take a gander at the video for the No. 18–their highest charting single–below:  Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2013-05-20T23:30:48+00:00",
    "url": "https://www.billboard.com/music/music-news/k-pop-hot-100-roy-kim-stays-no-1-4minute-lee-hyori-close-behind-1563035/"
}