{
    "title": "K-Pop Star G-Dragon Enters Billboard 200 – Billboard",
    "text": "G-Dragon, Leader of BIGBANG makes his mark with new EP \"Coup D'etat, Pt. 1.\" By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin America’s definitive albums chart gets a little Korean pop added to it this week. G-Dragon, leader of popular K-pop boy band BIGBANG, sees his new EP, “Coup D’etat, Pt. 1,” enter the Billboard 200 at No. 182 with more than 2,000 copies sold, according to Nielsen SoundScan. It also debuts at No. 1 on the World Albums chart. Released digitally on Sept. 2, the five-track EP precedes G-Dragon’s full-length sophomore album “COUP D’ETAT” that drops Friday, Sept. 13. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t09/12/2013 A second seven-track EP, “Coup D’etat, Pt. 2 (EP),” hit retail on Sept. 5. It sold just under 2,000 copies and starts at No. 2 on the World Albums chart. G-Dragon’s ‘COUP D’ETAT’: First Listen “Pt. 1” featured high-profile collaborations with Missy Elliott, Sky Ferreira and was led by the title track, produced by Diplo and Baauer. The accompanying music video has earned more than 3.7 million views since its Sept. 1 premiere.  G-Dragon’s Billboard 200 appearance marks K-pop’s latest mark on the chart, but not the highest. That honor still goes to a splinter group of nine-member girl group Girls’ Generation. The “Twinkle” EP by Girls’ Generation – TTS hit No. 126 in May 2012. Before the girls, G-Dragon’s own group BIGBANG had netted the highest K-pop slot when their “Alive” EP hit No. 150 in March 2012.  Daily newsletters straight to your inbox Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2013-09-12T16:00:00+00:00",
    "url": "https://www.billboard.com/pro/k-pop-star-g-dragon-enters-billboard-200/"
}