{
    "title": "K-wave takeover in Switzerland creating new opportunities for Korean beauty companies",
    "text": "Or wait... Headlines Brand Innovation Formulation & Science Packaging & Design Business & Financial Market Trends Regulation & Safety Promotional Features Site Archive Multimedia Regions All Asia-Pacific South East Asia South Asia East Asia Oceania Site Archive Multimedia Hot topics Clean & Ethical Beauty Sustainability COVID-19 Market Entry Anti-Aging / Skin Whitening Beauty From Within Nanotechnology Green Cosmetics Site Archive Multimedia Resources Type of resources Events All Events Shows & Conferences Online Events Editorial Webinars Events China 中国 Podcast  09-May-2019\n                            - Last updated on\n                                09-May-2019 at 01:34 GMT “In the conservative Swiss market, K-Beauty has emerged as the centre of the local beauty industry trend,” ​a report from KOTRA stated. President of KOTRA Kwon Jeong-Oh recently announced that Swiss department store chain Manor had established a Korean Cosmetics Pavillion in its new branch in the Swiss capital of Bern. “Thanks to the proliferation of Hallyu (Korean Wave) in Europe, our small and medium-sized cosmetic companies were introduced to Manor, Switzerland's largest department store.”​ According to KOTRA, Manor is the largest department store franchise in Switzerland, with annual turnover of $2.4bn. \"Successful entry into the largest department store in the country is a signal that K-Beauty is upgrading from niche products known only to those who know it to mainstream products,”​ said Lee Du-young, chief trade officer of KOTRA Zurich. KOTRA said it has been promoting South Korean cosmetics in Switzerland since 2017. It said its strategy focused on linking local brands with department stores and cosmetics vendors with large distribution networks. “Swiss consumers are more likely to favour brands in department stores and high-end drugstore outlets, as such, department stores and large retailers are essential to enter the local market.”​ The KOTRA report highlighted that Switzerland could be a stepping stone for South Korean beauty brands with sights set on a European expansion. “Switzerland is bordered by major European markets such as Germany, France and Italy. It is easy to advance into neighbouring European countries based on success in Switzerland.”​ The report also said the typical South Korean make-up looks and approach to skin care would resonate well with Swiss consumers. KOTRA highlighted that Switzerland does not follow the strict regulations of the European Union (UN). “Since Switzerland is not an EU member country, it is possible to export cosmetics without certification such as European Cosmetics Certification (CPNP).”​ KOTRA further advised local cosmetic companies preparing to enter Europe to “watch the reaction of the Swiss market” ​while registering for CPNP, which is typically time-consuming and costly. However, it warned: “Switzerland does not need certification to import cosmetics but the importer takes responsibility when a problem arises.”​ Switzerland is one of the world's richest countries with a population of 8.4m and a per capita income of $80,000, said the KOTRA report. It estimated that the Swiss cosmetics market was worth $2bn. Copyright - Unless otherwise stated all contents of this web site are © 2023 - William Reed Ltd - All Rights Reserved - Full details for the use of materials on this site can be found in the Terms & Conditions Related topics\nBusiness & Financial\nEast Asia\nAsia in Focus\nSkin Care\nHair Care\nColor Cosmetics\nFragrance Show more  Content provided by Naolys | 07-Jul-2023\n                     | White Paper Naolys presents HairRevive [MM+Zn], a pioneering plant-based ingredient revitalizing hair.  Content provided by Provital | 13-Jun-2023\n                     | Product Brochure Circanblue™ is a vegan postbiotic ingredient obtained from Lactococcus lactis that induces a resynchronisation of the skin’s circadian cycle after this... More promotional features ",
    "datetime": null,
    "url": "https://www.cosmeticsdesign-asia.com/Article/2019/05/09/K-wave-takeover-in-Switzerland-creating-new-opportunities-for-Korean-beauty-companies"
}