{
    "title": "K.Will Unveils ‘You Don’t Know Love’ Video Starring EXO’s Chanyeol: Watch – Billboard",
    "text": "EXO's Chanyeol and South Korean model Lee Ho Jung shows off their acting chops in the music video for K.Will's \"You Don't Know Love.\" By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin K-pop vocalist K.Will dropped the music video to his new single “You Don’t Know Love,” two days after dropping his fourth EP “Will in Fall.” The visual for the bouncy R&B track stars EXO member Chanyeol and South Korean model Lee Ho Jung. Chanyeol’s starring role is sure to delight fans of the boy band who have only seen the 20-year-old’s acting skills via an occasional cameo in Korean drama TV shows (like one this year in “Royal Villa” with bandmate Sehun). The video details the breakup between Lee and the EXO rapper its inevitably frustrating, conflicting emotions. Watch below. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t10/21/2013\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tExplore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\t\n\t\t\t\t\tK.Will\t\t\n\t\t\t\t\t\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news   Chanyeol convincingly plays the role of the too-quick-to-get-upset boyfriend who then misses his partner just as quickly. Watch as the pair try to keep their minds busy, doing odd jobs around the house while their minds keep returning to the happier times of the relationship — complete with the 20-year-old singer flashing a cute smile at each recollection. The video concludes with the duo returning to the spot they broke up and reunite to eliciting one more adorable grin from Chanyeol. As fun as it is to see the pairing of the model and the EXO MC, “You Don’t Know Love” is yet another music video in which K.Will does not appear. The K-pop crooner is a handsome dude, a 31-year-old who looks as fresh as any other idol singer. Perhaps by letting other celebrities take the stage in his music videos, it allows for his voice to be the aspect people focus on, instead of anything superficial. K.Will crooner certainly delivers the full package (look-, vocal- and stage presence-wise) when performing live. Watch a recent performance of “You Don’t Know Love” below.  K.Will has racked up two No. 1s on the K-Pop Hot 100 (“Please Don’t” and “Love Blossom” in November 2012 and April 2013, respectively). Look out for “You Don’t Know Love” and the “Will in Fall” EP tracks to shake up the chart when it’s refreshed Thursday morning. Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2013-10-21T23:20:48+00:00",
    "url": "https://www.billboard.com/music/music-news/kwill-unveils-you-dont-know-love-video-starring-exos-chanyeol-watch-5763177/"
}