{
    "title": "Kakao Ventures invests KRW1 billion in Indian K-beauty platform Limese - Global Cosmetics News",
    "text": "TRENDING: Posted by Georgina Caldwell | Nov 7, 2018 | Asia & Australasia, Finance, Marketing, Technology | Kakao Ventures has piled KRW1 billion into Limese, an e-commerce site dedicated to selling K-beauty in India, according to a report published by The Investor. The venture capital arm of the popular messaging app’s contribution closed the platform’s seed round. “Limese precisely understands the niche market of India’s cosmetics industry and its Korean and Indian team members’ expertise can create synergies,” Shina Chung, CEO and Partner of Kakao Ventures told The Investor. “We expect Limese growth will promote K-beauty in India and take the upper hand in the market.” Limese is aimed at 20-to 30-year-old shoppers in India and also suppliers spas, salons and wellness stores with K-beauty products. Brands sold via the site include Makeprem, Velyvely and Abybom but the owners have plans to up their selection over the next year, with a target of 50 brands set. Share: Rate: LATEST NEWS Unilever settles in trademark dispute ov...   Walgreens to settle Rite Aid suit for US...   L’Occitane Q2 2024: Sales rise 17....   Two Target executives to retire   Gillette signs up for another season as ...   PRESS RELEASE: Society of Cosmetic Chemi...   L’Oreal to dump Decleor in derma shake-u...   Hermes Q3 2023: sales up 16 percent to €...   Amazon to face lawsuit over data trackin...   J-beauty retailer Yoshitsu to open store...  GLOBAL COSMETICS NEWS Contact UsSubscribePrivacy PolicyCookie PolicyTerms & Conditions SOCIAL MEDIA FacebookTwitterInstagramLinkedInSoundCloudRSSYouTube NEWS HomeAll Regions Cosmetics News WirePodcastOpinionFashionProfessional BeautyTravelWellnessTop 100 Brands Copyright © 2023 Global Cosmetics Media Limited ",
    "datetime": "2018-11-07T07:38:37+00:00",
    "url": "https://www.globalcosmeticsnews.com/kakao-ventures-invests-krw1-billion-in-indian-k-beauty-platform-limese/"
}