{
    "title": "Kaohsiung hosts Beyond Beauty premiere - Taipei Times",
    "text": "The premiere of the documentary Beyond Beauty: Taiwan From Above (看見台灣) at the Kaohsiung Arena (K-Arena) on Wednesday, which attracted nearly 10,000 viewers, is proof that Greater Kaohsiung has become a film-friendly city, local officials said. The Greater Kaohsiung Government’s Bureau of Cultural Affairs Director Shih Che (史哲) said that over the years, the city has endeavored to create a friendly environment for film production through efforts such as establishing the Film Development and Production Center and the Filmmaking Assistance Center, which have attracted hundreds of movie and television producers to shoot in the city. “The city has also taken concrete measures to drum up support for the premieres of Taiwanese movies... The K-Arena is an ideal place for movie premieres and we plan to continue this promotional pattern to assist in the development of the nation’s film industry,” he said. Photo: Chang Chung-yi, Taipei Times Shih was referring to the assistance, including financial, that the bureau extended to prepare for the premiere of Beyond Beauty, a 90-minute film by Taiwanese director Chi Po-lin (齊柏林) that gives audiences a bird’s-eye view of the country’s beauty. All revenue from the premiere are to be given to the movie production company. Beyond Beauty is the second Taiwanese film to be screened at the K-Arena, following a special screening of the four-and-a-half-hour Warriors of the Rainbow: Seediq Bale in September 2011. Tickets for both film screening events sold out shortly after going on sale. According to a source familiar with the matter who requested anonymity, Chi originally planned to premiere his film at an outdoor venue, but decided to go with the K-Arena, an indoor one, after taking into account Shih’s suggestions. “It turned out that Chi had made the right choice, as the K-Arena’s 23m-by-10m giant LED screen made the beauty of Taiwan look even more breathtaking than it already is,” the source said. Greater Kaohsiung Mayor Chen Chu (陳菊) announced on Wednesday that the government had purchased the rights to the documentary for use as an educational tool in 500 elementary and junior-high schools in the city. That makes Kaohsiung the first city in the nation to include a movie in the school curriculum. UNIMPEDED:\n                                        The head of Taiwan’s civil engineering organization was finally able to attend a UN-related convention without having to use ‘Province of China’                                        Civil engineering industry leader Shih Yi-fang (施義芳) said he held firm in upholding the nation’s dignity on the international stage by successfully rectifying his credentials as representing Taiwan, not “a province of China,” at a UN-related professional engineers’ conference in Prague.\r\nShih had registered to attend this year’s World Engineers Convention (WEC), from Monday last week to Sunday, organized by the World Federation of Engineering Organizations (WFEO).\r\nThe WFEO is a UNESCO group that is the leading organization for the worldwide engineering profession, with more than 30 million members from more than 100 countries, its Web site says.\r\nTaiwan’s professional engineering association on ‘PEACE THROUGH STRENGTH’:\n                                        The former US leader’s policies are still a key foundation for the development of relations between Washington and Taipei, she said                                        President Tsai Ing-wen (蔡英文) yesterday praised the “six assurances” then-US president Ronald Reagan made to Taiwan in 1982, saying that the framework has become a “key foundation” for the development of Taiwan-US ties.\r\nTsai told a visiting delegation from the Washington-based Ronald Reagan Presidential Foundation and Institute that she has visited the Ronald Reagan Presidential Library twice since taking office in May 2016.\r\nIn April, Tsai met with then-US House of Representatives speaker Kevin McCarthy at the library in Simi Valley, California, during a transit stop after a state visit to Belize and Guatemala. She also visited the library in 2018 during A magnitude 6.2 earthquake struck far off the east coast at 7:05am on Tuesday, and was felt across the country, the Central Weather Administration (CWA) said.\r\nThere were no immediate reports of damage or injuries.\r\nThe epicenter of the temblor was located at sea, about 120.2km east of Hualien County Hall, at a depth of 5.7km, the agency said.\r\nThe earthquake's intensity, which gauges its actual effect, was highest in Yilan, Hualien, Hsinchu, Chiayi, Yunlin and Changhua counties and New Taipei City, where it measured 3 on Taiwan's 7-tier intensity scale, it said.\r\nThe quake also measured an intensity of 2 in Taichung, Taipei, The Ministry of National Defense (MND) said on Friday night that an investigation was being carried out into a reported incident of a whale-watching boat being hit by what was presumed to be a mortar hours earlier, off Taiwan’s east coast, near an area where a military drill was being conducted.\r\nNo casualties were reported on the Taiwanese-owned vessel, which was carrying 29 passengers and five crew members at the time, the tour operator surnamed Chien (簡) said.\r\nDuring the whale-watching tour, a “black object” fell from the sky and hit the cockpit’s windshield, cracking it, and crashing into the stainless steel ",
    "datetime": "2013-10-26T00:00:00+08:00",
    "url": "https://www.taipeitimes.com/News/taiwan/archives/2013/10/26/2003575428"
}