{
    "title": "Kendall Jenner Estee Lauder-Kendall Jenner-Estee Lauder-Contract",
    "text": "Every item on this page was chosen by an ELLE editor. We may earn commission on some of the items you choose to buy. \"Behind the scenes on an Estée Lauder ad shoot with Kendall Jenner. Photo courtesy of Estée Lauder. Some seriously exciting news out of the Kardashian-Jenner household this morning (we reiterate: that's news, not nudes)—Kendall Jenner has just been named the newest face of Estée Lauder. Kim's little sister announced her new gig Saturday via her Instagram. (A press release soon followed.) The 19-year-old model has been gracing the pages of glossies and rocking the fashion month runways for several seasons now—but this is undoubtedly her highest-profile job to date. She's expected to shoot her first campaign for the brand alongside current spokesmodels Carolyn Murphy and Joan Smalls—though Estee Lauder has already posted a bunch of behind-the-scenes photos on its new page dedicated to all things KJ. Hey, who needs Angel wings when you've got one of the biggest beauty contracts in the biz? Check out Estée Lauder's behind-the-scenes clip of Jenner on set, including a highly adorable baby video (with a voice cameo from mama Kris).  Simple Nail Designs for Your Manicure Mood Board 14 Vanilla Perfumes That Smell Absolutely Amazing 13 Best Japanese Skin Care Products to Shop For Breast Cancer, 40 Is the New 50 Meet YSL Beauty’s Most Unconventional Scent Yet Amazon Is Having a Major Beauty Sale Right Now Why Matrix Could Be the Next Best Skin Treatment The Best Neutral Nail Colors for Every Skin Tone Claudia Sulewski Launches CYKLAR Beyoncé Is Finally Releasing a Perfume A No-Damage Routine for Colored Hair First Class Beauty 2023 A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2014-11-15T09:46:00Z",
    "url": "https://www.elle.com/beauty/news/a19943/kendall-jenner-estee-lauder/"
}