{
    "title": "KGLO Is A Super Affordable New Korean Beauty Brand Launched At Boots | Glamour UK",
    "text": " By Oriana Findlay It's no secret that Korean beauty is a phenomenon that has taken the global beauty industry by a storm. Whilst Scandi beauty and Indi Beauty have given it a good shot, K-Beauty is renowned for being the best in the world, creating pioneering and innovative products and 10-step skincare regimes that are years ahead of the rest of the world. In fact, experts claim the K-Beauty industry is around 10-12 years ahead of the rest of us. Can't afford a flight to Seoul? Same. Thankfully, your skincare regime doesn't have to be a whole decade behind as one of Korea's most popular brands is coming to your local high street. By Glamour KGLO is the new affordable beauty brand bringing the leading Korean beauty trends to Boots with nothing costing more than £5. Their most sought-after products are undoubtedly their sheet masks which come in at a mere £4.99 a pop... hallelujah! The masks are formulated with 100% coconut water and are infused with effective skincare ingredients to moisturise, nourish and revitalise with different masks created for different skincare needs. The balancing mask, for example, is designed for people that are prone to breakouts, while the brightening mask is designed to replenish dull skin and lighten the appearance of dark spots. Finally, a brand that understands that skin is not a one-size-fits-all approach. The brand is also famed for its unique two-layer sock and glove masks. Enriched with nutritive oils and ingredients, the masks wrap snugly around your hands and feet to create a warming effect, enhancing serum penetration for baby soft skin. By Kate Leaver If that wasn't enough, KGLO are vegan and cruelty-free, as well as free of all the nasties like parabens and sulfates. Race you to Boots. By Charley Ross By Anna Bader By Annabelle Spranklen By Samantha McMeekin By Charley Ross By Anna Bader By Annabelle Spranklen By Kara Nesvig SEE MORE STORIES More from GLAMOUR UK © Condé Nast Britain 2023. ",
    "datetime": "2019-06-19T12:43:48.000Z",
    "url": "https://www.glamourmagazine.co.uk/article/kglo-uk-launch"
}