{
    "title": "Kim K Flaunts Cleavage While Going Makeup-Free",
    "text": "Here's further proof that Kim Kardashian always looks flawless—with or without makeup. The 33-year-old beauty stepped out sporting a fresh face on Wednesday in Los Angeles, where she was snapped heading to an afternoon workout at Barry's Boot Camp, a popular group fitness facility which the celeb often frequents. Kardashian appeared ready to work up a sweat as she approached the gym, sporting an all-black outfit which consisted of skintight capris, a hoodie sweatshirt and simple tennis shoes. She wore her hair down in a relaxed style and arrived sans a stich of makeup on her mug, showing off her natural beauty. Despite her casual ensemble, North West's mama still managed to flaunt her killer cleavage in a scoop-neck tank, carrying her water bottle and keys to her Mercedes in her left hand while typing away on her cell phone with her right. VIDEO: Kim Kardashian fires back after Adienne Bailon diss While Kanye West's missus is known for keeping up with her workouts, we presume the E! star was blowing off some extra steam on Wednesday following Adrienne Bailon's comments to Latina magazine, in which she dredges up her past romance with Rob Kardashian and bashes her ex-boyfriend's famous family. After calling her ex-beau \"disloyal\" and resurfacing the cheating claims from the duo's 2009 romance, the former Cheetah Girls star said she regrets having the Keeping Up With the Kardashian cameras capture their relationship. \"To be stuck with that Kardashian label, that was so hurtful to me and to my career,\" the \"Big Spender\" singer claimed, without explaining how. \"I probably realized that too late—not that it would've affected my decisions in terms of who I dated, but it would've affected my decision to appear on the show.\" PHOTOS: Kim Kardashian and Kanye West's wedding album \"At the time, I didn't think anyone would even care,\" Adrienne continued. \"To this day, people will still say, 'You ruined Rob's life!' And I'll think, 'Damn, I was still playing with Barbie dolls when I met him.'\" Needless to say, Kim didn't care for Adrienne's comments and opted to fight back on Twitter. \"Funny how she says being with a Kardashian hurt her career yet the only reason she has this article is bc she is talking about a Kardashian,\" she wrote, adding, \"#LetItGoooooLetItGoooooo (FROZEN VOICE).\" The mother of one concluded by saying, \"So sad when people try to kick my brother when he is down #FamilyForever.\" PHOTOS: Kardashians without makeup Your source for entertainment news, celebrities, celeb news, and ​celebrity gossip. Check out the hottest fashion, photos, movies and TV shows! © 2023 E! Entertainment Television, LLC A Division of NBCUniversal. All rights reserved. ",
    "datetime": "2014-07-31T18:20:00.000Z",
    "url": "https://www.eonline.com/news/565021/kim-kardashian-flaunts-cleavage-while-going-makeup-free-see-the-pic"
}