{
    "title": "Kim K's Makeup Artist Under Fire for Posting a Photo of a Little Girl Wearing Makeup ",
    "text": "At what point does a little girl wearing makeup go from being completely innocent to really inappropriate? Mario Dedivanovic, the makeup artist responsible for Kim Kardashian's wedding look (and basically all of her best makeup moments), posted an image to his Instagram of an adorable young girl wearing winged eyeliner and bold red lip — a look that some argue is more suitable for 25-year-old Taylor Swift rather than a little kid. Wrote Instagram user @sherrypkolic in the comments: \"Way to [sic] much makeup for a little child, I have [a] 15 and 13 year old and they won't even put on mascara let alone a full pound of makeup, not good at all!\" Others defended the photo with comments like this one from @krissssyjayy: \"So pretty!!!! And for the ignorant people.. Makeup will not steal her innocence. It's only natural for a little girl to want to play with makeup, my daughter watches me put on mine and asks me to put it on her sometimes. It's called being a girl.\" Although Mario is on the receiving end of all the attacks, his caption specifies he was not the makeup artist responsible for doing the child's makeup, and Refinery29 reports that the photo originally ran in Saplings, a children's magazine. Get non-boring fashion and beauty news directly in your feed. Follow Facebook.com/CosmoBeauty. Follow Brooke on Twitter. Brooke Shunatona is a contributing writer for Cosmopolitan.com. FYI, Your Eyes Need A Hydrating Eye Cream (!!) Every $$$ Le Labo Perfume, Ranked Your 101 Guide to Laser Treatments for Acne Scars 19 Genius Serums That'll Smooth and Firm Your Skin FYI: Amazon Is Having a Major Beauty Sale RN Black Friday Dyson Airwrap Deals? Yes, Pls! You Can’t Miss These Black Friday Beauty Sales Simply the Best Shampoos for Thinning Hair, Period I Tested All the Viral Sol De Janeiro Perfumes These Bath Gift Sets = Immediate R&R Alert: I Found Drunk Elephant Bronzing Drop Dupes 25 Face Serums For Supremely Glowy Skin A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2015-06-24T17:04:00Z",
    "url": "https://www.cosmopolitan.com/style-beauty/beauty/news/a42454/mario-dedivanovic-little-girl-wearing-makeup/"
}