{
    "title": "Kim Kardashian Is Being Called Out by Twitter for Alleged Blackface in KKW Beauty Promo Picture | Teen Vogue",
    "text": "By Zoë Weiner Kim Kardashian West is being slammed on Twitter by fans claiming that she is guilty of blackface in an ad for her upcoming KKW beauty line. Kim announced her new beauty venture on Tuesday, and the initial reactions were mostly positive. But on Wednesday, when she showed off her first product in a Twitter post, things took a turn. The social media pro and business mogul tweeted a photo of herself wearing a heavy coat of contour and highlighter, along with the caption announcing that a KKW Beauty Creme Contour & Highlight Kit was the first product to hit the website. While some fans were excited about the prospect of a Kim-approved contour kit, others were quick to notice that the combination of makeup and lighting in the photo seemed to darken her skin. “Black women get told to lighten. Meanwhile, Kim spends her entire career in perpetual blackface and is lauded for her beauty,” tweeted one user. “I love Kim, but that’s def blackface in the form of makeup she is nowhere near that dark,” wrote another. Then another user took the opportunity to share side-by-side images of Kim with and without the contouring to show just how darkened her skin appears to be in the photo. This isn’t the first time a makeup campaign has been called out for darkening a model’s skin tone in a conspicuous way. When the allegations of blackface came up after Jeffree Star revealed a controversial photo of model Nikita Dragun for his makeup line, one Twitter user summed the problem up succinctly: “There’s a difference between being naturally tan and making your skin darker for a photoshoot.” (Both Jeffree and Nikita denied the allegations.) Yara Shahidi has also spoken out against blackface. “I hope that people understand that the issue is much bigger than painting one’s face black, but what it represents,” she wrote on Twitter after seeing a number of racist Halloween costumes that reduced black people to caricature and costumes. “We are not costumes. We are people.” This content can also be viewed on the site it originates from. This content can also be viewed on the site it originates from. This content can also be viewed on the site it originates from. By Lexi McMenamin By Sara Delgado By Anjana Pawa This content can also be viewed on the site it originates from. The controversy comes on the heels of Kylie Jenner being accused of cultural appropriation, too. Last week, Kim’s little sister was slammed for wearing a camouflage bikini that Twitter users thought looked suspiciously similar to the ones Destiny’s Child wore in their “Survivor” video in 2002. And these are just two of the latest instances of the Kardashians/Jenners’ claiming ownership for elements of black culture, a number of which have to do with their hair and makeup choices. Kim has not yet taken down the image or commented on the controversy, and the photo in question currently serves as the main image on her Twitter profile. Related: Kim Kardashian Says She and Taylor Swift Haven’t Spoken Since THAT Snapchat Incident By Kara Nesvig By Kara Nesvig By Kara Nesvig By Shauna Beni-Haynes More from Teen Vogue Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Teen Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "datetime": "2017-06-15T03:17:11.208Z",
    "url": "https://www.teenvogue.com/story/kim-kardashian-called-out-by-twitter-kkw-beauty-promo-picture"
}