{
    "title": "Kim Kardashian Went to Makeup School (When She Was 14) | Allure",
    "text": "By Caitlin Heikkila An inside look at Kim K.'s makeup school, Taylor Swift's connection to a weight-loss success story, a celebrity who is totally pulling off green hair, and more, in today's Alluring Links. Here's something we bet you didn't know about Kim Kardashian: She went to makeup school when she was 14 years old. Marie Claire checked it out. [Marie Claire] Hold up. Bloggers get paid how much for their Instagram posts?! [Who What Wear] Would you give up your foundation? These four women did. [Refinery 29] Watch Disney star Laura Marano attempt to apply liquid eyeliner with her eyes closed. [StyleCaster] Yep, flared jeans are back. [Who What Wear] A man who lost more than 400 pounds credits his progress to Taylor Swift. [People] Put away your blow-dryer, curling iron, and flatiron. Here's how to master air-drying. [Teen Vogue] Glasses wearers, rejoice. Here are 13 tips for doing your makeup while flattering your frames. [Australian Cosmopolitan] Jay Manuel's Instagram photo of Coco Rocha makes us want to wear blue mascara 24/7. [Instagram] This is what Blake Lively's face would look like if it was entirely made of food, just in case you were wondering. [Instagram] Jared Leto has bright-green hair (and of course pulls it off). [The Cut] By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Kara Nesvig By Gabi Thorne By Gabi Thorne By Jesa Marie Calaor More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2015-05-21T12:00:00.000Z",
    "url": "https://www.allure.com/story/kim-kardashian-makeup-school"
}