{
    "title": "Kitchen Beauty Remedies: 4 Unexpected Uses for Yogurt | Allure",
    "text": "By PopSugar Get more beauty tips from PopSugar! All we have to do is look around the office first thing in the morning to realize how obsessed we all are with yogurt, and why not? Besides being good for our diets and calcium intake, it actually has beauty benefits, too. It's rich in protein, which can improve bones and also hair and nails over time. But, if you're not into eating it, there are plenty of other ways to benefit. __Hands:__Create a sweet soak by adding one tablespoon honey to a cup of plain yogurt. Honey's a natural humectant, which will help to retain water to keep the skin soft and smooth. __Face:__Spread plain yogurt on your face to tighten pores and cleanse your skin before rinsing with lukewarm water after 10 minutes. After all, this treat includes lactic acid, an alpha hydroxy acid (AHA) that is milder than other exfoliators but still rejuvenates your skin. __Scalp:__Did you know yogurt can be used as a conditioner? Simply bring a container of plain yogurt into the shower, rub the yogurt into your wet hair, and let it sit for 10 to 15 minutes before rinsing. The active cultures can relieve an itchy scalp and help combat dandruff in the process. __Feet:__If you even have any yogurt left after all the other ideas, you can mix in a half cup of finely ground walnuts and use this as a scrub to improve the texture of your skin, relieving dry patches and calluses. The yogurt adds moisture once again, and the nuts help exfoliate rough spots. P.S. While you're rubbing it on your feet, you're treating your hands, too—bonus! This post is part of a content-sharing partnership with PopSugar. RELATED LINKS: • Kiss and Tell: Wild History of Lipstick • Six Standout Spring Nail Polish Shades • Do Your Eyes Match Your Zodiac Sign? By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Sarah Han By Sarah Han By Angela Trakoshis By Nicola Dall'Asen More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2014-05-06T13:03:00.000Z",
    "url": "https://www.allure.com/story/diy-beauty-yogurt"
}