{
    "title": "Kiwis flock to K-beauty tours: Look five years younger in two hours?  | Stuff.co.nz",
    "text": "I can't be late. I'm making my way through the underground maze that is Seoul's subway system, and the clock is ticking. I've signed up to meet a TV presenter, who is the equivalent of a zen-master in Korean beauty – or as it's universally known: K-beauty. She's promised that at the end of our appointment together, I'll look at least five years younger. The beauty industry here in Korea – and the hype that surrounds it – is nothing short of mind-blowing, and it's hugely popular with Kiwis. READ MORE: * Harry Says: Why Korean women are smashing their skincare and makeup * Korean beauty and skin care retailer Hikoco gaining popularity * Korean pop dance classes in Auckland grow in popularity Accommodation juggernaut Airbnb has branched out into tours, known as Airbnb Experiences, and has dozens of locals signed up sharing their K-beauty secrets. These tours are so popular with New Zealand and Australian travellers, it's Airbnb's number one market. Before I find out if I can wipe five years off, let's put on a mental face mask and delve deep into Korea's beauty-obsessed world. We'll cover everything from snail secretion facials, to having 120 needles poked in my face. I'll even be told I need to do something about my \"old man's nose.\" THE CRAZE OF K-BEAUTY The figures are staggering: the Korean beauty industry is worth more than twenty billion dollars and growing. And the craze is catching on with millennials in Western countries, driven by the popularity of K-pop, or Korean pop stars. The essence of the trend is looking after your skin, with an elaborate 10-step regime. The goal is to create perfect \"glass skin\" – with a smooth, even and light complexion. But that is only the start. PLASTIC SURGERY We've all heard of the song Gangnam Style, but really, South Korea's upscale Gangnam district is the world headquarters of plastic surgery. With an estimated 400 clinics, it's almost as universal as the corner store back home in New Zealand. More than one million procedures are done each year, the highest rate in the world per capita. The most common procedure is double eyelid surgery – so standard, some compare it to getting a haircut. It's essentially putting an additional fold in the upper eyelid to make the eyes appear larger – and is often gifted as a graduation present. Other popular procedures include jaw reduction, to give a more v-shaped face, nose reconstruction and breast implants. To get my head around this, I visited the View Plastic surgery clinic, regarded as one of the best in the city. It's a state-of-the-art hospital that even has a rotating display of breast implants next to the reception. I signed up for a free consultation, as many tourists do. It's a slick operation: an English interpreter greets you at reception and whisks you to a plush waiting area. You're then taken to a photography room, where all angles of your face are captured. After that, you'll sit down with an appearance surgeon to go over the results – in my case Dr Yun Chang Woon. He started with the bad news: sun damage, lower eye wrinkles and a nose that resembles \"an aged man\". But Woon was also very kind, saying that my facial balance was good, and his biggest recommendation was simply to wear more sunblock. Then we got down to the nitty-gritty of how I could look younger: I'd need a fat transfer to help with sagging skin under the eyes, threading to lift the neck and a nose job to be a little less \"aged man\". Oh, and botox to help with a few lines here and there. It's important to remember, I went to the clinic and asked them what they'd recommend. These weren't criticisms; I was there asking them to make me look younger. And, to be frank, I was tempted. It all seemed so easy, almost like going to pick a pair of shoes. But I wanted to see what else the city had to offer. THE NATURAL ALTERNATIVE About two hours after emerging from the plastic surgery clinic, I found myself with 120 needles poking out of my face. I'm in Kwangdong Hospital of Korean medicine; a place where ancient traditions meet modern technology. And their treatments are unmissable. The clinic is known for facial acupuncture, which is getting a reputation as a natural alternative to botox. The clinic offers an intense session, where 300 needles are placed in the face then reinserted up to 10,000 times. It promises noticeable results, including \"wrinkle resolution\" and \"improved elasticity\". Due to time constraints, I opted for the miniature version (Petite Facial Acupuncture), where around 120 needles were inserted for just 30 minutes. I was treated by a doctor who lovingly held my hand as I explained I had a bit of a fear of needles. I don't like having one injection, let alone having 120 in my face at one time. But I needn't have worried; she had studied natural medicine for eight years and knew exactly what she was doing. The process was quick and relatively painless. The hardest part was staying still, as I lay on the bed like a human hedgehog for half an hour. The results were mild but immediate; glowing skin and a feeling of rejuvenation. It's something I'd happily do again. THE GOLDEN TREATMENT The next stop was at one of Korea's top spas; this is where the big K-pop stars go for their famed gold facials. And Western stars are also frequent visitors, including Naomi Campbell. I quickly discovered why Shangpree Spa is so popular. Therapists train for three years before they can give treatments. They are even taught to read facial muscles to tell if a person likes to talk, so they know how much they should interact during the treatment. I had capsules of Marine Jewel (a mixture of salmon DNA and Royal Jelly) applied to my face, while my legs were wrapped in vibrating moon boot to massage my legs. It was utter bliss. After a gentle face massage and more serums, it was time for a gold rubber mask. This is a blend of gold leaf and active collagen powder, mixed into a gel, which was then left to dry on my face as the essential ingredients penetrate the skin. If relaxation could take years off your appearance, I'd have baby skin after all that. And it did seem to work; I had noticeably glowing skin as I walked out of the building. FIVE YEARS YOUNGER IN TWO HOURS And so we return to my trip through Seoul's subway – and my appointment to wipe five years off my face. I met TV host Cyoung Park in Gangnam, where she took me up to her makeup studio. She wasted no time discussing her many tips and tricks to take years off. It started with a rigorous cleansing, before toner, serum, moisturiser and foundation was layered onto my face. I then had subtle glitter placed around my eyes to \"make them innocent, like [Shrek's] Puss in Boots'\". The reason behind this, Park explained, is that Korean women generally want to avoid a \"sexy\" appearance, and instead aim for \"innocent\". For that same reason, lipstick was applied sparingly, and only to the inner part of the lips. Although I'm not entirely sure five years was wiped off my appearance, the visit was hugely helpful navigating the complex world of K-beauty. Park toured me around some of her favourite beauty department stores in Gangnam, home to a dizzying selection of products. We're talking everything from snail serum face masks to salmon sperm DNA capsules. One small shop had more than a hundred sheet masks to pick from. Park pointed out her recommended products – and with very little English on them – it would be almost impossible to know what you're getting otherwise. K-ONFUSED It's all a lot to take in. The beauty industry here pulls you in all directions, from plastic to natural, and everywhere in between. Some would argue K-beauty over-promotes the importance of appearance – but there is a shift happening. An \"Escape the Corset\" movement is gaining traction on social media, urging women to embrace their natural selves. On the ground, however, there is little evidence it's yet to make much impact. K-beauty isn't a wave, it's a tsunami. And no visit to Korea is complete without dipping your toes in its fascinating waters. K-Beauty make-over session with a TV host from $76 per person. See: airbnb.com/experiences View Plastic Surgery offers free consultations. See more: viewplasticsurgery.com Kwangdong Hospital offers both traditional and modern treatments. The Petit facial acupuncture includes up to 150 needles and costs $212. See: ekwangdong.com Getting there Air New Zealand has a new direct service to Seoul starting November 23. See: airnz.co.nz The author's trip was supported by Air New Zealand and Airbnb. A return trip for one passenger in economy class flying from Auckland to Seoul would generate 1.5 tonnes CO2. To offset your carbon emissions head to airnewzealand.co.nz/sustainability-customer-carbon-offset.  © 2023 Stuff Limited ",
    "datetime": "2019-10-22T16:00:00.000Z",
    "url": "https://www.stuff.co.nz/life-style/beauty/116741788/kbeauty-how-to-look-five-years-younger-in-two-hours"
}