{
    "title": "KKW Beauty Closing: Kim Kardashian Explains The Surprise Move",
    "text": "Your GRAZIA newsletter is on its way. Join our VIP Club for exclusive giveaways and members only events. (DW, it's free!) News feed Fashion Shoots Entertainment Fashion Beauty Culture Your GRAZIA newsletter is on its way. Join our VIP Club for exclusive giveaways and members only events. (DW, it's free!)  A post shared by KKW BEAUTY (@kkwbeauty)  It seems 2021 is a new season for Kim Kardashian in many ways. First, she initiated divorce proceedings with her husband of seven years, Kanye West, back in February. Then she closed the book on the show that started it all, Keeping Up With The Kardashians, last month. Now it seems she’s ready to bring that fresh energy to her business affairs, namely her successful beauty line KKW Beauty. Taking to Instagram earlier today, Kardashian announced that KKW Beauty is officially closing – for now, any way. The entrepreneur shared that the brand’s website would be “shutting down” to make way for a new direction. “To our loyal customers, it all started with a contour kit and expanded to eyes, lips, body and many incredible collections over the past four years,” she wrote. Kardashian revealed that the KKW Beauty website would cease operations from midnight August 1 “so that we can come back to you under a completely new brand.”  A post shared by KKW BEAUTY (@kkwbeauty)  KKW Beauty was first launched in 2017, well before the wave of celebrities launching direct to consumer beauty lines became a thing. The brand went on to do well with a number of memorable collaborations and campaigns and a retail launch into Ulta Beauty. Then in 2020, Kardashian sold a 20 percent stake in the brand to cosmetics giant Coty for a cool US$200 million, signalling that big things were on the horizon. Coty – which also acquired a majority stake in sister Kylie Jenner‘s Kylie Cosmetics in 2019 – seemed poised to take the KKW Beauty brand global, but now it seems a relaunch will arrive first. Kardashian indicated her excitement at creating “new formulas that are more modern, innovative and packaged in an elevated and sustainable new look.”  A post shared by KKW BEAUTY (@kkwbeauty)  While Kylie Cosmetics is undergoing its own rebrand, it makes sense for KKW Beauty to follow suit. Kardashian alluded to the notion that the relaunch could see her many beauty businesses – she also owns KKW Fragrance and recently filed a trademark against SKKN BY KIM– housed “in all categories from one single website.” It’s also assumed that she’ll drop the ‘W’ from the name, given her recent split from West. The KKW Beauty website is running significant sales in the lead up to the site closure, so if you’re wanting to snag a piece of cosmetics history, now’s your chance. In the meantime, Kardashian promised fans the brand’s hiatus won’t be permanent. “Thank you so much for being on this incredible journey with me, and I promise we won’t be gone for too long.” topics:\nmakeup, Kim Kardashian, Kanye West, KKW beauty Grace Publishing Pty Ltd. © All rights reserved.  ",
    "datetime": null,
    "url": "https://graziamagazine.com/articles/kkw-beauty-closing/"
}