{
    "title": "KL-based beauty advisory platform Favful raises US$500K in seed round led by Gobi Partners",
    "text": "Pictured on stage: Favful’s founder Sasha Tan Kuala Lumpur-based beauty advisory platform Favful has raised a US$500,000 funding in a seed round led by Gobi Partners. It aims to use the newly-raised capital to boost its marketing efforts and expand into new countries beyond Singapore and Malaysia. Favful was launched in 2016 by Sasha Tan, the former Vice President of Product at online grocery retailer HappyFresh, The platform was born out of Tan’s personal frustrations with using beauty products that resulted in her in developing problematic skin as a teenager. Also Read: 5 reasons why HappyFresh stands out among other grocery delivery startups To tackle this problem of potentially-harmful trial-and-error exercises, Favful rates beauty products based on their suitability for a wide range of metrics, such as skin type, skin colour and age group. This allows users to find products that are suited to their specific needs. There are also price comparisons, tips and user reviews (which go through an approval process). Once the user decides to purchase a product, they can click on a button that directs them to the relevant e-commerce site. “Purchasing behaviour in Asia is affected by asymmetrical information – where consumers often buy products without sufficient background knowledge. As local consumers are more influenced by word of mouth from peers over advertising, Favful is able to empower female consumers to make smarter purchasing decisions for health- and beauty-related products,” said Victor Chua, Investment Director at Gobi Partners, in a press release. Previously, Favful raised pre-seed investments from 500 Startups and Segnel Ventures. —- Image Credit: Favful The post KL-based beauty advisory platform Favful raises US$500K in seed round led by Gobi Partners appeared first on e27. The Princess of Wales attended Lady Rose Windsor and George Gilman's wedding in 2008 without boyfriend Prince William in a mini wedding guest dress – throwback photos. In \"The Woman in Me,\" Britney Spears says she heard a different message when Justin Timberlake talked about their sex life back in 2002. 有安信，一定快！「CASH快線」小額貸款，一Click即批即過數！送高達$12000現金獎！ Israel demanded the resignation of the UN secretary-general on Tuesday over “shocking” comments in which he suggested that the Oct 7 attack was provoked by the “suffocating occupation” of the Palestinian territories. The Premier League has recommended that Everton face a 12-point deduction in its case against them for breaching profit and sustainability rules, the Telegraph has learnt. Chong Un Kim, 26, immigrated to the US in 1981 and her remains were found in a dumpster on Valentine’s Day 1988 保證內部回報率3.02-3.3% A woman whose confrontation with the police at a hospital went viral on TikTok has been sentenced to five weeks and five days in jail, coupled with a $600 fine. The 32-year-old is living in Florida, where he moved earlier this year after he was successfully sued for defamation in Israel The company — and other retailers — made a commitment in 2018, but backtracked soon after. 開戶並存入首HK$100萬新資金享高達HK$6,000現金獎賞，全新客戶更享高達5.2%美元定存年利率! Jesus Ayala, 18, and Jzamir Keys, 16, have been charged with murder over hit-and-run incident that killed Andreas Probst A Lebanese front is unlikely: it wouldn’t be in Iran’s interests, as it would probably spark US intervention, says Lina Khatib, director of the Soas Middle East Institute American intelligence officials have explained to their European counterparts why they failed to anticipate Hamas’s assault on Israeli villages, which was reportedly planned on telephone lines in hidden tunnels. 齊齊玩網上小遊戲，加深認識《憲法》及《基本法》，更有機會換領餅店、咖啡店、超市禮券或書券等，立即行動！ \"It's hard to fathom that there are people in the world who would target such innocence,\" Hilton wrote on Instagram. Energy company Lukoil last year took a public stand over Moscow’s invasion of Ukraine China has replaced Defense Minister Gen. Li Shangfu, who has been out of public view for almost two months, state media reported Tuesday.  Li is the second senior Chinese official to disappear this year, following former Foreign Minister Qin Gang, who was removed from office in July with no explanation offered.  Li, who became defense minister during a Cabinet reshuffle in March, hasn’t been seen since giving a speech on Aug. 29. This Is Me...Now: Limited edition created by Jennifer Lopez Liverpool boss waxes lyrical about striker ahead of Toulouse encounter \"Can’t read and won’t follow the rules.\" Hamas is believed to have weaponised thousands of commercial drones with the help of Iran Discover the ins and outs of the HKU part-time MBA through our info session. Engage with our alumni and learn from their personal journeys. What would you do if your child turned into a bridezilla? Russian generals are throwing their troops forward in their assault on the eastern town of Avdiivka despite suffering heavy losses, Ukraine has claimed. In 2020, 350 elephants mysteriously died in Botswana, with a further 35 dying in similar circumstances in Zimbabwe. Now scientists think they may have found the reason why ",
    "datetime": null,
    "url": "https://sg.news.yahoo.com/kl-based-beauty-advisory-platform-favful-raises-us-020020126.html"
}