{
    "title": "Korean beauty chains aim to win over Toronto shoppers",
    "text": "Korean beauty chains aim to win over Toronto shoppers  Korean beauty shops in Toronto have been expanding, finally giving the downtown core a sample of one of the world's biggest cosmetics powerhouses. South Korea is home to one of the fastest-growing cosmetics industries in the world, featuring thousands of products meant to cater to every age, every need and every skin problem. You're likely familiar with its most notable player, the BB cream, which exploded in popularity as a catch-all moisturizer, firming serum, sunblock, primer, foundation and tone corrector (or whitener) before being adopted by Western beauty brands in 2012. Real-deal Korean products have been available in Toronto for some time, but until recently, retailers in the GTA were relegated to indoor strip malls or grocery store complexes. As a novice shopper, hoping to find the perfect heavy-coverage product to match my yellow-toned skin (a feat in the North American market), these gleaming stores could be intimidating. Usually, they were filled with pristine white products on pristine white shelves, where women in pristine white lab coats watched your every move as you tried to read the labels (and failed to master Korean in five minutes). Pacific Mall was about the only refuge, offering more approachable shops like Holika Holika and TheFaceShop, which carried a little bit of everything, from BBs and skin treatments to the kind of kitschy, cutesy packaging and vibrant makeup that North American consumers often associate with Korean and Japanese cosmetics. Now, downtown shoppers don't have to trek to Markham to visit these two staple makeup shops. A major retailer in Korea, TheFaceShop has opened in the Eaton Centre (and Fairview Mall), and Holika Holika, a slightly smaller chain, recently opened its second location at Queen and John. Both shops stock makeup and skincare products from their own in-house brands. Both brands, too, are bound by some of the existing limitations of the Korean cosmetics industry: Those with lighter or darker skin tones won't find anything suitable, and controversial (and sometimes even debatably toxic) whitening and anti-aging properties are ubiquitous, even in North American stores. I went to check out the new downtown digs for both chains, and compare the shopping experience. HOLIKA HOLIKA The stockThe store's front half is filled with makeup, including BB creams, lipsticks, eyeshadows, liners and balms. The back is lined with skincare products, grouped by key ingredient and very clearly labelled. Every \"strange\" ingredient was explained, and most prices were clear, but the product themselves were mostly labelled only in Korean. There's a section of higher-end items meant to address aging skin, but most of the products skew younger - think blackhead removers and trendy hairdyes. DemographicTeens-early 20s; people who own and actually wear red heart-shaped sunglasses. It's fantastical, tooth-achingly cute atmosphere would have fit with the Queen West of yore, when Fashion Crimes and Peach Berserk reigned supreme. Intimidation factorAlmost none. The store is welcoming and seemed well populated, even on an overcast weekday afternoon. The sales associates - friendlier than those at Pacific Mall - are knowledgeable, but thankfully leave you alone to browse. They were also willing to make take-home samples, provided that you brought your own container (hey, it's better than nothing). The sightsBright, open and cheerful, the purple and white-themed store is well lit and easy to navigate. Shelves aren't overwhelmed with stock and everything is clearly labelled, so you can easily identify the product's purpose and key ingredients (particularly helpful, because not every package comes with an English translation). Product testers are plentiful and sampling is encouraged - there's a huge vanity table at the back of the store labelled \"Fun Testing\" where you can try on the store's wares to your heart's content. The soundsThe soundtrack to the late 2000s girl power road trip movie of your dreams and/or nightmares - Miley Cyrus, Beyonce, and Kelly Clarkson. Most useful productsMost of these products require some long-term use to show results, but based on a first visit, the egg-shaped coal soaps - packaged in their own egg carton - are designed to deep clean pores and give Lush's Coalface some impressive competition. Pig Nose blackhead remover products are also effective, if a bit harsh. Oddest ingredientSnail slime (also known as \"mucin\"), which is meant to smooth and moisten skin. Delish. Black sea cucumber - labelled as \"the ginseng of the sea,\" - is a close second, if only for how bizarre and sometimes riotously phallic the actual creature can be. Oddest productGold caviar capsules, an anti-aging serum product that looks like a jar of caviar. The little faux-caviar eggs inside are filled with real Beluga caviar extract and need to be popped before being applied. Cutest productCouples' lip sets - a package of two individual flavoured balms that create a new flavour after being mashed together post-makeout. Most disappointing productsHeart-shaped lipsticks are darling but difficult to apply (unless the Miranda Sings look is your thing) and fade almost instantly - stick to buying these only as kitschy gifts. The water-based moisturizer, in a cute teardrop-shaped container, also underperforms. It's meant to cool and hydrate skin. It feels and smells like runny hair gel and is about as effective. Best packagingBoth stores have multiple shelves dedicated to peel-off face masks - think giant pore strips or, um, Ed Gein. The best are Holika Holika's Before and After series, a line of situation-specific masks for important life events like, \"Before Interview,\" \"After a Trip,\" and the hands-down favourite, \"After Drinking.\" Their pastel packages with pencil sketches of delighted or sometimes frustrated women are straight out of a tampon commercial or 80s sleepover board game, and are elevated to a state of perfection by the disembodied heads of mask-wearing male admirers in the background. How's the BB?Though Holika Holika had both powder compacts and liquid BB products, the shade selection was limited and very light. Most did not have any whitening or anti-aging ingredients. Coverage was disappointingly light - TheFaceShop has better alternatives for those of us with something to hide. Price rangeCosmetics ranged from $5-$15, and skincare rarely exceeded $40 per product. Some of the flashier ingredients and more concentrated products (mostly of the anti-aging type) neared $70. THEFACESHOP The stockMore skincare heavy than Holika Holika, but surprisingly lacking in overlap. The shelves are packed tight with products for all ages and all skin concerns, derived from natural products like honey, kelp and chia seeds. Everything is grouped by key ingredients, in packaging with a more mature aesthetic. Makeup at TheFaceShop is very much in line with the natural look popular in the Korean market, but there are still some wilder shades to be found. DemographicThere are a few fun products, but TheFaceShop is mostly about serious skincare for the 25+ crowd. That said, the crowd on a weekday after 5pm was mostly teens buying BBs and lipglosses. Intimidation factorSlightly higher than Holika Holika. The products here feel significantly more sophisticated and aren't as easy to sample, so it's more difficult to figure out what's available and what you want without asking for help. Staff are approachable and knowledgeable, if harder to come by, and while many of the ingredient lists are only in Korean, the store's signage is adequate if not as thorough. The sights There is a distinctly Body Shop or Yves Rocher vibe - a bit spa-like, with tranquil but vibrant greens and whites. The store itself is far smaller than Holika Holika and feels more substantially stocked. Trying to examine every product on the almost-cramped shelves is a challenge, particularly when the store gets busy. The temperature and bright lights border on incubator. The soundsThe din of passing consumerism. Oddest ingredientTheFaceShop generally sticks to more familiar, mostly plant-derived ingredients, but the most striking exception is also probably the most gratuitous - a mask of royal jelly and 24 karat gold. Oddest productEyelid fold stickers. Meant to add a fold to eyelids by, essentially, fusing the upper and middle lid together. It's as controversial as skin whitening, and difficult to imagine the sticker being anything other than useless or painful. Cutest ProductA tie between solid perfume in tiny matryoshka dolls, and hand cream containers shaped like house pets stuck in flower pots. Most useful productsMagic Cover BB Cream, though only available in two beige-y shades, is a thick, easy-wearing foundation product that gives the most substantial coverage of any product sold at either store. Some of the masks, specifically the hydrating Green Tea type, clearly liven up skin after just one use. Most disappointing productsA lip tint similar in colour and texture to Benefit's Benetint. On first application, it's already sliding to the outline of your lips for that coveted \"sucked on a vacuum hose\" look, and tastes like a generic cherry lollipop soaked in gasoline. Also, skip the hair waxes - too heavy and smells like the cast of Jersey Shore looks. Best packagingClear plastic eyeshadow cases with graphics of curly 1920s barkeep mustaches captioned with \"Today is All Night Party\" and bowler hats that say \"Ready To Be Gentle.\" How's the BB?Colour selection skews deeper and more beige-toned than Holika Holika's, but is still very limited. Their powder products were lacking in coverage, but their high coverage BBs were pigmented enough to disguise redness and moderate hyperpigmentation - Misscha and Skin 79 are still better for medium skin tones, but TheFaceShop's more pigmented BBs are a good buy. PricesMakeup products are about a dollar cheaper than Holika Holika across the board, for comparable quality. Skincare ranges from approximately $40-$80. Writing by Ashley Petkovski.   Join the conversation\n\nLoad \n\n comments Stunning Toronto Art Deco theatre facade reborn with new tenant after years on market Aritzia Archive sale in Canada goes off the rails after website goes down Sephora is opening a location inside Toronto's most buzzed about new building There's a thriving vintage scene in an area of Toronto you'd least expect U.S.-based fashion brand opening first Toronto location this month Canadians are sharing what's actually worth buying at Dollarama Toronto getting huge new furniture store that's a stylish alternative to IKEA Toronto store that championed mental wellness closing and asking for help ",
    "datetime": null,
    "url": "https://www.blogto.com/fashion_style/2014/05/korean_beauty_chains_aim_to_win_over_toronto_shoppers/"
}