{
    "title": "Korea, the new cosmetics giant? - Premium Beauty News",
    "text": "AmorePacific offers a total of 19 cushion products from its 13 brands in more than 10 countries in Asia and North America The South Korean trade balance for beauty products was in surplus for the first time last year.  According to South Korea’s customs office, cosmetics exports reached 1.92 billion dollars in 2014, that is, an increase of 50.4% over the previous year. This is a spectacular reversal, considering that from 2001 to 2012, the annual deficit exceeded 400 million US dollars and only started to decrease in 2013. With imports totalling 600 million US dollars, mainland China is the top destination of “Made in Korea” cosmetic products.  Other key importers are Hong Kong (USD 410 million), the United States (USD 160 million), Japan (USD 150 million), and Taiwan (USD 120 million), followed by Singapore and Thailand. Actually, the popularity of K-Beauty remains primarily an Asian phenomenon.  However, the number of destination countries of Korean cosmetics is increasing regularly. After BB creams, cushion products are the new Korean trend to draw worldwide attention in the beauty sector. The term “cushion” refers to a makeup compact built with a specially designed urethane foam that contains and preserves a makeup liquid (usually a foundation, blended with sunscreens and skincare actives) applied with a dedicated sponge.  Main advantages: it is easy to use and easily transportable. A pioneer in this product category, the Amore Pacific group started working on cushions in 2007.  The group has 13 registered patents for cushions in Korea, China, Japan, the United States and Europe.  In 2014, AmorePacific succeeded in automating the entire cushion production procedure. In 2014, AmorePacific sold 26 million cushions through its several brands (Laneige, Etude House, Innisfree, Sulwhasoo, etc.).  According to a recent TNS Korea survey, 75% of Korean women have used or are currently using cushion products.  However, these products also appeal to consumers from other countries.  In 2014, AmorePacific’s cushions increased by 140%.  Once again, China is the main destination country: approximately 1.17 million units of Laneige BB Cushion were sold in China in 2014. Korean cosmetics manufacturers have patiently built their reputation by relying upon a highly competitive but quickly growing domestic market.  “Many Korean manufacturers have managed to seize this opportunity to create absolute jewels in terms of R&D and manufacturing capabilities,” said JKH Wang, president of FS Korea, a supplier of packaging and makeup applicators. When asked by the organizers of MakeUp in Seoul, which will open its doors on 15-16 April 2015, JHK Wang added that Korean manufacturers now offer products whose quality and sophistication can not only appeal to Chinese consumers, but also US or European ones. “The Korean beauty industry is very responsive, competent and passionate. To become leaders on the global market, we create and constantly look for new ideas and new products to create. We want to mark our time with our footprint in terms of creativity. To achieve this we need to strengthen partnerships between us and the various international market players,” adds John Kwon, consultant for Cosmecca, a Korean contract manufacturer of colour cosmetics. The annual premium and luxury packaging trade show broke its attendance record for its 2023 edition, which was held... The expression “Beauty Tech & Skincare” now marks the entry of tech into the beauty sector. Several major brands offer to decode the... The quest for youth has existed for centuries, despite the inevitable effects of time on the body. Research shows that skin aging in... The quest for “in-and-out” beauty is gradually gaining ground in Europe, North America, and Brazil. This form of holistic beauty is meant... © 2023 Premium Beauty Media ",
    "datetime": null,
    "url": "https://www.premiumbeautynews.com/en/korea-the-new-cosmetics-giant,7840"
}