{
    "title": "Korean Beauty Glow Recipe Skincare Is Coming Soon (Update) | Allure",
    "text": "By Sarah Kinonen UPDATE (May 18, 2017 9:00 a.m. EST): Remember when we told you all about Glow Recipe Skincare, the brand-new skin care line from Korean beauty retailer Glow Recipe? Well, we have some good news and some bad news. After pushing the launch date of its highly anticipated sleeping mask and cleanser, they finally launched yesterday. That's where the good news comes in. Now, we have to break your heart a little bit. The hype was so real that every single one of the multitasking products sold out yesterday, too. Glow Recipe shared the news on Instagram yesterday, and we can't help but be impressed. So if you weren't one of the lucky people to add the ultra-moisturizing Blueberry Bounce Cleanser and the perfect-for-summer Watermelon Glow Sleeping Mask, you'll have to wait a little longer. Glow Recipe will be announcing the restock date for these versatile wonders, which you can read more about below, soon on its Instagram page. This content can also be viewed on the site it originates from. This post originally appeared on March 31, 2017. Sheet masks. Sleeping packs. Silky essences. Over the last couple of years, Seoul has brought so many deliciously innovative skin-care trends stateside — with the help of curated collections from Korean beauty retailers, including Glow Recipe, Peach & Lily, and Soko Glam. And now, those retailers are slowly starting to create a name for themselves in the K-beauty space. Peach & Lily launched its own sheet mask collection last fall, and recently, Glow Recipe announced it's jumping into the product development game with its own eponymous line, Glow Recipe Skincare. Officially dropping May 1, Glow Recipe Skincare, created by the retailer's co-founders Christine Chang and Sarah Lee, will launch with just two products: a creamy Blueberry Bounce Cleanser and an ultra-hydrating Watermelon Glow Sleeping Mask. But what sets these two launches apart from traditional cleansers and sleeping masks, is that these guys were literally formulated to be multitaskers. The cleanser, just as its name suggests, is formulated with antioxidant blueberry to decrease oil production, while it deep-cleans and hydrates. But if your skin is super-parched, here's where the multitasking comes in: The cleanser, which actually smells like sweet berries, doubles as a face mask, and can be worn (on dry, clean skin) for five to eight minutes for a little extra hydration. Personally, I prefer it best in the shower, but that's just me. And then there's the sweet like candy, gel-based Watermelon Glow Sleeping Mask, which claims to exfoliate as it hydrates — all while you're catching your Zzzs. Why watermelon, though? According to Glow Recipe, in Korea, the water-based fruit, which is rich in potassium, vitamins C, A, and B6, is traditionally used to soothe inflamed skin (a.k.a. sunburns) in the summer. So, the idea of Glow Recipe Skincare's overnight mask is that after slathering on the treatment before bed, by the time you wake up (and rinse off any leftover residue), your skin will feel hydrated and any underlying redness will be soothe (albeit temporarily). And like the cleanser, this overnight mask can also be used as a quickie treatment and rinsed off (with warm water) after ten minutes of wear, which is how I like to use it — before I layer on my toner. More on Korean beauty: Excited about what Glow Recipe Skincare is cooking up? Us, too. Unfortunately, you'll have to wait May 1 to add the Blueberry Bounce Cleanser and Watermelon Glow Sleeping Mask to your skin-care stash when the line becomes available at glowrecipe.com for $34 and $45, respectively. Now, watch Korean actress and pop star Jihae’s all-natural beauty routine: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Sarah Han By Sarah Han By Sarah Han By AnaMaria Glavan More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2017-03-31T17:02:42.109Z",
    "url": "https://www.allure.com/story/glow-recipe-skincare"
}