{
    "title": "Korean cosmetics brand LG H&H partners Shopee to grow SEA presence | Marketing-Interactive",
    "text": "published author share on South Korean cosmetics and personal care brand LG H&H has signed a Memorandum of Understanding (MoU) with Shopee to accelerate its growth in the premium beauty and personal care categories in five key markets comprising Singapore, Malaysia, Vietnam, Thailand, and Taiwan. This comes as LG H&H aims to scale up its eCommerce business and capture new online buyers. The partnership will be led by Sean Lee, head of overseas business division at LG H&H and Chris Feng, Group President at Sea. Both companies will also work together and bring more brands under LG H&H onto Shopee, and identify new collaboration opportunities in areas such as marketing and exclusive product launches. LG H&H also aims to be top ten brand principal in the health and beauty category on Shopee. In fact, the brand had already launched some of its brands on Shopee such as The Face Shop, belif and su:m37 previously. Last month, it also launched its luxury brand The History of Whoo on Shopee Mall and Shopee Premium through a regional campaign in Southeast Asia. Shopee Premium was launched in 2020, and has scaled efforts to grow the premium segment by onboarding popular international and local premium and luxury brands, as well as elevating the customer experience with new features, Shopee said. LG H&H's Lee said that with Shopee as its key priority eCommerce partner in the Southeast Asia, the eCommerce platform will be able to provide deep insights on the local market landscape, and LG H&H can leverage its expertise of using data-driven approaches to understand consumer behaviours on eCommerce. Meanwhile, Terence Pang, chief operating officer of Shopee, added: “As the demand for premium health, beauty and personal care products continues to grow on Shopee, we are delighted to deepen our partnership with LG H&H to bring greater variety and value to our shoppers.” Pang explained that Shopee aims to support LG H&H in expanding its omnichannel presence in Southeast Asia, and reach the emerging generation of digital luxury shoppers through Shopee Premium. To capture consumers in Southeast Asia, brands – now living in the “age of the consumer” – need to put consumers at the centre of everything they do. Shopee has successfully driven a hyper-relevant consumer strategy in Southeast Asia, by ensuring that its users in all its markets constantly enjoy relevant and personalised shopping experiences. Other brands have also tied up with Shopee to expand their presence in Southeast Asia and leverage on its consumer strategy. Last December, Shopee and Colgate-Palmolive had tied up to jointly drive eCommerce penetration of oral care, home care and personal care products and category on Shopee, across seven markets in Southeast Asia, reflecting Colgate’s commitment to the markets. Last February, Korean beauty brand Sulwhasoo's parent company, Amorepacific, had inked a deal with Shopee to accelerate the growth of Korean beauty in the online beauty category in Southeast Asia. The partnership saw Amorepacific driving data-driven strategies, joint marketing efforts and co-branded collaborations. The beauty brand aimed to expand the coverage of its current portfolio of brands on Shopee to more markets to meet \"untapped demand\" and provide more assortment to consumers. Related articles:Staying hyper-relevant to the Southeast Asian consumer: Hear from Axiata and ShopeeColgate-Palmolive partners Shopee to boost eCommerce biz by 20 times Sulwhasoo's parent firm and Shopee tie up to push growth of K-beauty in SEA share on We break down the big and messy topics of the day so you're updated on the most important developments in Asia's marketing development – for free. MARKETING-INTERACTIVE is an online publication of Lighthouse Independent Media. ©  Lighthouse Independent Media. All rights reserved. Marketing Interactive is not responsible for the content of external sites. ",
    "datetime": null,
    "url": "https://www.marketing-interactive.com/korean-cosmetics-brand-lg-h-h-partners-shopee-to-grow-sea-presence"
}