{
    "title": "Korean beauty products: Glamor, Gangnam style | Fortune",
    "text": "While the French have long been the global style leader in the sartorial stakes, for decades beauty innovation was being led by Japanese cosmetics companies such as SK-II and Shiseido. But in the last few years, South Korean beauty brands have been claiming a bigger stake of the American beauty market, which is estimated to be $44 billion dollars, according to the NPD Group. “There has been a cumulative interest in Korean beauty and it all started with the BB cream,” says Megan McIntyre, the beauty director at the lifestyle site Refinery29. A BB, or beauty balm, is in an all-in-one skincare and makeup hybrid that moisturizers, covers blemishes, and contains sunscreen. The products hit U.S. shelves in 2011 and now nearly every major cosmetics brand carries one. “Once American women caught on to BB creams, they started becoming curious about other Korean beauty products,” says McIntyre. Last year, McIntyre hired a South Korea-based correspondent to report on the latest trends from the ground. “If Korea has had BB creams for about 20 years, what else are we missing?” she says. The two major Korean beauty powerhouses are AMOREPACIFIC (think of it as the Estée Lauder of Korea) and its brands include LANEIGE, Iope and Sulwhasoo, while LG has SUM 37 and the soon-to-be-launched belif. Other major brands include Dr. Jart, Tony Moly and Amarte. While many of these brands are sold at Bergdorf Goodman, Neiman Marcus as well as Sephora, there’s also a host of websites selling curated Korean beauty products, such as Glowrecipe, Peach and Lily, and SokoGlam. MemeBox is a Korean beauty subscription service, similar to Birchbox. But beyond the BB cream, and the often cute packaging- Tony Moly’s lip balms are packaged in cherry and lip shaped compacts- what’s the appeal of Korean beauty, and how is different than its American counterpart? It all comes down to innovation and an obsession with beautiful skin, says Christine Chang, the co-founder, along with Sarah Lee, of Glowrecipe.com. “Korean companies are churning out innovative products at an unprecedented rate, and it’s powered by consumers willing to do anything for good skin,” says Chang. “Korean women have a totally different approach to beauty. They don’t rely on one product for their skin and they don’t use makeup to mask their imperfections.” A typical Korean skincare regime involves multiple products and multiple steps—usually somewhere between 10 and 17, says McIntyre. “It’s not a chore for Korean women though. They view it as a ritual or pampering experience.” The hallmarks of Korean beauty include ingredients such as ginseng and even snail mucin; facial-sheet masks which can be made from cotton fiber or natural material such as kelp; and products containing fermented ingredients. K beauty (as its called) also has its own lingo. An “essence” is similar to a super-charged serum and K beauty experts talk about “skin expression,” which is how consumers work a product into their skin. Here’s a look at some of the biggest Korean brands available in the U.S. Although it launched in Korea in 1967, Sulwhasoo didn’t make its stateside debut until 2010, when it went on sale at Bergdorf Goodman. This luxury brand is inspired by ancient Korean herbal medicine, and a few of its key ingredients include Korean ginseng, solomon’s seal to treat dryness and Chinese peony which has anti-inflammatory properties. Sulwhasoo’s top selling product is Concentrated Ginseng Renewing Cream, followed by First Care Activating Serum—the company says the serum has generated $1 billion in sales worldwide and one is sold every 9 minutes throughout the world. Sulwhasoo’s Timetreasure Renovating Cream ($400) is the line’s priciest product and contains Korean red pine, which is grown on an unpolluted island near the west coast of Korea. A top brand in Korea since 2001, Amarte launched in the U.S. in 2013, under the helm of San Francisco-based, board certified dermatologist Dr. Craig Kraffert, who is also the company’s president. Amarte follows the multistep Korean approach to beauty, so the products are meant to cleanse, hydrate, rejuvenate and protect. “The multistep Korean regimen has been born out of an obsession with the Korean concept of skin care as a privileged activity of indulgence, enjoyment, and self respect,” explains Kraffert. Amarte’s product line includes a BB cream, an overnight sleep mask and a “Wonder Cream” that contains pearl powder and caviar extract, that is meant to lighten sunspots and nourish skin. Amarte also offers five collection kits designed to tackle brightness, anti-aging or dryness. An LG-owned brand, belif will make its stateside debut this month, when it goes on sale in Sephora. Belif bills itself as a “truthful” brand and the simple packaging clearly states  each product’s ingredients. The brand partnered with a centuries old apothecary in Scotland, and uses traditional medicinal herbs in its products—which are also free from synthetic dyes, synthetic preservatives and mineral oils. Belif will launch with 21 products, including Hungarian water essence, a serum made with 10 herbs; the True cream moisturizing bomb which contains comfrey leaf, and the True cream aqua bomb, which has a gel-like consistency and contains Lady’s Mantle and nettle leaf. This powerhouse brand is the largest cosmetics company in Korea and says its yearly revenue is nearly two billion dollars. Available at Sephora and Nordstrom, AMOREPACIFIC uses highly concentrated botanicals, such as pine mushroom, bamboo sap, and AMOREPACIFIC globally patented Korean red ginseng in its products, and the company owns its green tea gardens. Its product line includes facial sheet masks and eye masks, and cushion compacts that contain bamboo sap rather than water for extra hydration. The Green Tea Seed Treatment Oil is meant to brighten and revive dull skin. LANEIGE, a Korean best-seller, launched in Target in 2014 (yes, Tar-jhay also sells premium cosmetics) and is also available online. The company says its BB Cushion is sold every 10 seconds—the product is essentially a BB cream in a compact, and is applied with an antimicrobial, spongey applicator. The line’s newest products, available in March, will include a Cushion Concealer, Brightening Sparkling Water Foam Cleanser, Firming Sleeping Mask and Water Bank Eye gel. © 2023 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices \nFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice.\nS&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions. ",
    "datetime": null,
    "url": "https://fortune.com/2015/03/02/korean-beauty-products/"
}