{
    "title": "Korean Fire Eyelash Curling Technique | Allure",
    "text": "By Renee Jacques Sheet masks, cushion compacts, ten-step skin-care routines: We've seen a ton of awesome beauty innovations come straight from Korea over the past decade. But the trend we just heard about—using fire to curl your lashes—might be where we draw the line. Here's how you do it: Break a wooden stick and run it thorough an open flame (!) to heat it up. Then, brush the still-warm stick along the base of the lashes to curl. According to a bunch of YouTube videos, this actually works to turn stubborn, stick-straight lashes into curled ones full of volume. Mic reports that the trend for extra-voluminous lashes is one that's been growing for quite some time in Korea—so much so that even after a bunch of heated eyelash curlers have come out (with questionable results), women still resort to this old-school method. Lots of beauty writers have tried it out and reported successful results, too. One editor says the technique made her lashes look \"upright, curled, and perky—like an invisible force was keeping them shapely.\" But, um, FIRE. Would you risk singeing off your lashes—or worse— to get 'em to hold a curl?Head on over to Mic for more anxiety-inducing gifs. How to nail striped nail art: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Jennifer Hussein By Sarah Han By AnaMaria Glavan By Chelsea Avila More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2015-12-14T14:00:00.000Z",
    "url": "https://www.allure.com/story/korean-fire-eyelash-curling-technique"
}