{
    "title": "Korean Beauties Look Too Similar – Asian Fortune",
    "text": "Asian Fortune \nMay 22, 2013\nNews + Opinion\nLeave a comment There may just be too many women in Korea. Or at least, too many girls who fit the traditional ideal of beauty. A beauty pageant held in Daegu, South Korea has 21 contestants competing for the title of most beautiful. But many worried that the contestants looked too similar for there to be a fair competition. Daegu is home to many of the top plastic surgeons in Korea and some have speculated that plastic surgery has molded too many girls into the same beauty ideal. A blog post about the Daegu beauties was first published in Dramafever.com and has since been picked up by other media outlets around the net. A commentor on the Audrey Magazine website (a magazine for Asian American women) noted, “While I definitely think plastic surgery is a huge problem in many well-developed Asian cities, with a singular, slightly euro-influenced version of beauty, it’s not like this problem of conformist ideals doesn’t plague other ethnicities as well. Just look at Playboy bunnies.” Do you think the Korean beauty pagaent contenders look too similar? Do you think this is an Asian problem? Tell us on Facebook or on Twitter @AsianFortune_DC! Asian Fortune is an English language newspaper for Asian American professionals in the Washington, DC metropolitan area. Visit fb.com/asianfortune to stay up to date with our news and what’s going on in the Asian American community. Asian Fortune is an English language newspaper for Asian American professionals in the Washington, DC metropolitan area. Visit fb.com/asianfortune to stay up to date with our news and what’s going on in the Asian American community. Tags beauty pageant Daegu Dramafever.com Korea Korean Beauties Korean beauty pagaent south korea July 10, 2013 December 17, 2012 December 17, 2012 Your email address will not be published. Comment Name Email Website Save my name, email, and website in this browser for the next time I comment.    Δ Subscribe to our email newsletter. ",
    "datetime": "2013-05-22T14:14:42+00:00",
    "url": "https://www.asianfortunenews.com/2013/05/korean-beauties-look-too-similar/"
}