{
    "title": "Korean Skin Care Routine: All the Steps From A to Z",
    "text": "If you’re interested in beauty trends and hacks, you’ve likely heard all about Korean beauty (sometimes referred to as K-beauty). At its core, Korean beauty products originate from, and are manufactured in, Korea. They are generally created with the Korean beauty philosophy in mind. Korean beauty products and regimens are built for the long haul. Consistency and dedication are what yield their much-desired results. Think of it as the difference between going on a crash diet and adopting a clean eating lifestyle. Fundamentally, the routine is about respecting your skin. Instead of using products full of harsh ingredients that strip the skin’s natural barrier, Korean skin care philosophy is about working with your skin’s natural ecosystem by cleansing, hydrating, nourishing, and protecting it — allowing your skin to thrive. Whether it’s a tried-and-true skin care regimen, how often you wash your hair, or the cosmetics you’re curious about, beauty is personal. That’s why we rely on a diverse group of writers, educators, and other experts to share their tips on everything from the way product application varies to the best sheet mask for your individual needs. We only recommend something we genuinely love, so if you see a shop link to a specific product or brand, know that it’s been thoroughly researched by our team. Korean skin care focuses on prevention and protection rather than the use of products to undo damage. If Korean skin care is any proof, taking care of your skin before it needs it will pay off in the long run. Prevention is always better, because, once the damage is done, it can be hard to recover skin to its original state. The Korean skin care routine wasn’t any one person or brand’s discovery. It was more of a gradual evolution that originated from the skin regimen that many Koreans follow. What came after has changed the skin care industry worldwide and captured the attention of people who follow beauty and skin care trends. Not only does this type of routine often produce effective and consistent results, but it also contributes to people respecting their skin and taking a little extra “me time.” According to the International Textile and Apparel Association, the Korean beauty industry has grown in exports to the global market. In 2016, the total exports of cosmetics was approximately $4.2 billion, a 61.6 percent increase from the previous year. The term “glass skin” is commonly used in the Korean beauty world to refer to a smooth, clear, and intensely hydrated complexion that appears transparent. Even though 10 is the most common number of steps in Korean skin care routines, it’s a rough estimate. In general, Korean beauty routines include multiple steps. But, overall, they focus on improving skin gently while achieving lasting results. All Korean skin care routines begin with the traditional double cleanse, which is at the core of Korean skin care. Ultimately, it’s not about following a certain number of steps, but tailoring a skin care routine to your skin’s needs. While many people begin with a 10-step routine, you can adjust up or down, depending on your needs or preference. The traditional 10-step routine is the most widely used method of performing a Korean skin care routine. It usually goes as follows: Oil and water repel each other, which means that a water-based cleanser won’t effectively remove all the oil-based impurities on your skin. SPF, makeup, and your body’s natural sebum are most effectively removed with an oil-based cleanser. This doesn’t strip the natural healthy oils from your face. This is the type of cleanser most people likely think of when they hear the word “cleanser.” This is usually a foaming liquid (or bar) that removes the remaining impurities left behind by the oil cleanser, such as sweat and dirt. Exfoliants are things like scrubs, peels, and pads. These products help remove dead skin cells and buildup. Start slow and do it sparingly (once or twice per week max). Once you get to this step, your skin’s pH might be out of whack and need to be returned to its acidic state. Toners help restore the balance and bring moisture back to the skin. Unique to Korean skin care regimens, essences are formulated with fermented ingredients and are meant to hydrate and protect skin. Think of an essence as somewhere between a toner and a serum. In Korean skin care, a treatment is anything that’s focused on aiding a specific problem — usually referred to as a serum. They contain highly concentrated ingredients meant to target specific issues, such as wrinkles or acne. Sheet masks are sheets of serum-soaked paper that you lay on your face for about 20 minutes. Like exfoliants, sheet masks aren’t something that needs to be or should be done every day. Eye gels, creams, or oils are made to target the thin, sensitive skin around the eyes while helping with darkness, puffiness, and fine lines. Moisturizer acts as a sealant to ensure everything soaks into your skin. Lately, people seem to be acknowledging the effects of sun damage more and more. More products, like foundation and moisturizer, are being sold with built-in SPF. Even if you will wear another product with SPF, it’s still very important to include this step. This lighter version cuts the popular 10-step routine in half. Perfect for those on a budget or short on time, these five steps are the most important and basic to do every morning. Compared to the 10-step routine, this one lacks an exfoliant, sheet masks, and an SPF. A 7-step routine is best for the majority of evenings, given the lack of SPF and since you don’t need to exfoliate or use a mask every day. Yes, there are still more steps. If you make it to 10 steps and feel like continuing, another common one is a 12-step routine. Follow the 10-step routine first, and include these two additional steps: If you’ve grown to love the dewiness that comes with that “glass skin” you’ve worked so hard for, misting periodically will help maintain and reactivate the products you use. A weekly facial, complete with massage, is not uncommon for Koreans and those who faithfully follow a Korean skin care routine. Morning and night routines don’t need to be the same. Morning routines may be much more streamlined, focusing on moisturizing and protecting from the sun. Longer routines can be reserved for the evenings, including exfoliants, eye creams, masks, and more. Different skin types may need to keep a few things in mind when determining the best products and steps for their Korean skin care routine. Despite what you might think, it is not counterintuitive to use an oil-based cleanser on oily skin. If you have oily skin, don’t be afraid to embrace double cleansing. For toner, oily skin types will want a lightweight and less emollient formula. For those with extra dry skin, you may want to only use an oil-based cleanser. Pay attention to how your skin feels and make the decision that makes the most sense. For toner, dry skin benefits from humectants, like hyaluronic acid. If you have combination skin, you’ll want to choose products that help balance out your skin. If you have an active acne breakout, you may want to skip exfoliating until your skin clears up. The number of steps in a Korean skin care routine may seem overwhelming, but they don’t have to be. Taking care of your skin is a form of self-care and, thus, self-love. Once you get the hang of it, these steps won’t take much time at all. The main thing to figure out about a Korean skin care routine is your targeted skin care needs. Then, you can gently address them with the correct products. Additionally, the proper application is just as important – both in the way and order they’re applied. Liquids or lighter products (like cleansers and toners) go on first, and then steps continue getting heavier and thicker (like moisturizers and SPF). Ashley Hubbard is a freelance writer based in Nashville, Tennessee, focusing on sustainability, travel, veganism, mental health, social justice, and more. Passionate about animal rights, sustainable travel, and social impact, she seeks out ethical experiences whether at home or on the road. Visit her website wild-hearted.com. Last medically reviewed on  March 31, 2021 Our experts continually monitor the health and wellness space, and we update our articles when new information becomes available. Current Version Mar 31, 2021 Edited By Jody Amable Medically Reviewed By Reema Patel, MPA, PA-C Copy Edited By Jen Anderson Share this article Curd is a cooking staple that some are using as part of their regular cleansing, toning, and moisturizing skin care routine. Here’s how it works. Applying toner is a good way to clean off the skin and address some mild skin concerns. We’ll discuss how to make it at home. Essence is a water-based skin care product that contains a high content of active ingredients to hydrate, protect, and boost the overall health of the… There’s no magic fountain of youth or a perfect solution for breakouts and less-than-pristine skin. But there are skin care blogs that can answer your… Cica cream is the latest skin care craze, promising hydration for even the most sensitive skin. Here’s how to use it, its history, and products to try. Common symptoms of a skin allergy include itching, redness, and swelling. While prescribed and over-the-counter medications can work to relieve these… The shower is the perfect place to give your skin the TLC it deserves, from head to toe. Hopping in the shower isn't just about getting clean, it's also an opportune time to focus on overall skin health with a few skin-friendly habits. Your skin is the largest organ that you have, so you want to take care of it. Get glowing skin from home with these 10 tips and tricks. Everything… OUR BRANDS ",
    "datetime": null,
    "url": "https://www.healthline.com/health/beauty-skin-care/korean-skincare-routine"
}