{
    "title": "Korean Skin Care Habits - Beauty Tips",
    "text": "These tricks will keep your skin glowing and hydrated all winter long—no 10-step process required When it comes to Korean skin care, more is more. (Heard of the exhaustive ten-step routine that Korean women follow daily?) If you don't quite have the time (or money) for this kind of multi-step process, you're in luck. We've got some beauty tips straight from Angela Kim, founder of Insider Beauty, an e-commerce site that makes bestselling cult skin care and makeup products from Korea available here in the U.S. Read on for some foreign-sounding habits for gorgeous skin. No, we don't mean when you drop food on the ground. We're talking about how quickly you apply your products-a rule talked about over and over again in Korean beauty magazines. \"After you take a hot shower, you're supposed to apply your toner within 10 seconds,\" says Kim. The longer you wait, the more dehydrated your skin becomes. So the faster you can lock in that moisture and keep your skin protected, the better. (Ideally, you'd keep it in the shower with you, she says.) If you're at the gym and don't have a toner with you, the same goes for your moisturizer-apply that bad boy as fast as possible, then follow up with the rest of your routine, says Kim. Cotton sheet masks are the biggest Korean beauty craze of the moment here in the U.S. And for good reason: There are endless variations that hydrate, exfoliate, and brighten to solve pretty much every skin problem you can think of. But there's one hack you likely haven't adopted when it comes to your sheet mask. To get optimal results, everyone in Korea brings their sheet mask with them to the steam room at their gym or spa, and pops it on once their pores have had a chance to open up, says Kim. \"It's just like when the esthetician steams your skin before she does anything else so that your skin can absorb all of the ingredients,\" she says. Haven't jumped on the sheet mask bandwagon yet? Kim recommends the Leaders coconut gel moisturizing recovery mask to keep your super hydrated throughout the winter months. (Psst: Here are some derm-approved tips to protect your skin post-gym the is winter.) \"I don't know why massage creams haven't blown up in the U.S., but they are huge in Korea. It's a daily staple,\" says Kim. There are a bunch of different massage techniques you can use (Kim has a whole blog post on it), but here's the gist: By using your knuckles or fingertips to massage the muscles and tissue under your skin, you'll increase blood circulation and get the oxygen flowing through your face, which in turn will keep your skin glowing and radiant. Massaging daily also helps to firm and tone your facial muscles to help fight wrinkles and prevent the skin from aging over time. \"It's a must-do. It's not even considered anything special in Korea,\" says Kim. \"You're an anomaly if you're not doing this.\" \"Double-cleansing,\" the first step is the notorious 10-step process (hint: it involves exactly what it sounds like) isn't even a term in Korea because it's that obvious of a practice, says Kim. \"Everyone double cleanses. It's considered so necessary that no one washes their face just once.\" And out of all the somewhat bizarre-sounding Korean beauty habits, this one perhaps makes the most sense: Of course, you should remove your makeup first (Kim recommends an oil-based cleanser), and then wash it again with a second product to really get a deep clean. (Or you know, at least, use a makeup-removing wipe first!) Yep, we know this sounds like something straight out of SNL, but this really is a super popular technique in Korea. Following the same logic as facial massage, women in Korea will slap their faces about 50 times after finishing their daily skincare regimen to get blood circulation going and firm up the face muscles, she explains. \"I grew up with my mom doing this. She slapped so hard you could hear it in the kitchen from her bedroom,\" says Kim. It might sound crazy, but when it comes to slapping, \"the more the merrier\" and \"the harder the better!\" Women in Korea have a long history of making their own rice water to wash their face because of the long-established skin benefits. \"It's a natural moisturizer that helps slow aging, reduce dark circles, fade age spots, and brighten skin,\" says Kim. If you have rice in your kitchen, simply let it soak for about 10-15 minutes, swirl it around, and then use that milky water as a pseudo-toner. If you'd rather go with a ready-made rice product, try Primera's black rice emulsion or Inisfree's rice sleeping mask pod to get the same brightening and moisturizing effects. Winter months in Korea are notoriously cold, so humidifiers are commonly used to keep the skin hydrated when the air gets dry. There's also a super-easy old-school hack if you're traveling and don't have a humidifier on hand: \"A lot of women like to drench towels in water and then hang them around their bed while they sleep at night,\" says Kim. \"I've tried it and it really, really helps.\" \"Korean women take a preventative approach to aging at a very young age, whereas women in the U.S. tend to wait until they see that first line or wrinkle,\" says Kim. Not only is using SPF ingrained, but they also tend to take protective measures from the sun year round. \"It's not uncommon to see women in Korea wear white gloves that go up to their elbows while they're driving, or visors that literally cover their entire face,\" she says. (Because yes, ultraviolet rays can still harm your skin even indoors and can pass through the clouds and reflect off snow and ice in the wintertime.) \"Ginseng is one ingredient that's been the hallmark of Korean beauty for a really long time, and really kicked off the Korean skin care market,\" says Kim. Not only is it applied topically (many Korean brands like Sulwhasoo are geared primarily around ginseng) for its anti-aging properties, but ginseng tea and ginseng-based foods are also a staple in Korean cuisine. \"It's really good for helping to detox your skin and get rid of any pollutants, and there are a lot of antioxidants,\" she says. ",
    "datetime": null,
    "url": "https://www.shape.com/lifestyle/beauty-style/skin-care/korean-skin-care-habits"
}