{
    "title": "Korean Beauty Rituals | Allure",
    "text": "By Renee Jacques Ever wonder what the inspiration was behind sheet masks? Or exactly why Koreans are obsessed with fermented ingredients in skin-care products? It's time to take a history lesson. (Trust us, this won't be boring.) Alicia Yoon, the founder of Peach and Lily, one of the best Korean beauty sites in the world, recently took a trip to Korea to explore the country's history of beauty rituals. \"While Korean beauty innovations and the latest K-beauty trends have been the buzz, I love the timeless Korean beauty ingredients and rituals that have been passed down through the generations,\" says Yoon. \"A lot of this informs what we see in the marketplace today, since that beauty tradition is so deeply ingrained in the Korean beauty consumer's mind.\" Here, she breaks down five ancient Korean beauty rules that have influenced what we see in today's most popular products. Circulation is everything. \"To keep skin healthy and energized, good blood and energy flow was seen as crucial to beautiful skin. The next time you take a bath, try taking a half bath, or a ban-shin-yok, where you immerse yourself in hot water only to your belly button. Everything else, including your arms and hands, stays above the water. Relax and enjoy for a half hour. You'll find yourself working up a sweat as your body gets a kickstart in circulation. This is also why a lot of Korean products advise slapping it on your face. The next time you apply your serums, gently slap your face to get your skin energized.\" Superclean skin is the best kind of skin. \"Confucian values shaped Korean beauty ideals, and inner beauty and modesty became a virtue in comparison to showier makeup. To achieve the most beautiful, unadorned look, healthy skin became a priority. Ground mung beans were often turned into a powder and blended with water and gently massaged into the face to thoroughly cleanse. That's what influenced this Tosowoong Enzyme Powder Wash, which gives you a gentle but thorough cleanse.\" Masks are and always will be one of the most important skin-care steps. \"Leaving ingredients on the face for some time was intuitively a part of beauty rituals generations ago. Baekgangjam, an ingredient made from silkworm cocoons, was a well-loved mask that helps to brighten skin. This age-old ingredient has made a comeback and can be found in cult-favorite skin-care products. The Caolin Bab Pool Cool Water Cream Stick includes silkworm cocoon extract to help revitalize skin. And of course, the modern-day version of masks that produce instant results or results overnight are the popular sheet masks, rubber masks, and sleeping masks.\" Oils are some of the best moisturizers. \"Centuries ago, these beauty rituals included a lot of oils, herbs, and plant extracts. In particular, camellia oil and safflower oil were quite popular. Camelia oil was used all over—the hair, the body, the face. The Dr. Dream Rose Bubble Clay Pack is the best of modern Korea and traditional Korea to me because it uses oxidation technology to bubble over to deep-cleanse pores. It also uses ingredients like safflower oil to keep skin hydrated.\" What you eat is equally as important as what you put on your skin. \"It was common knowledge that eating healthy translated into healthy skin. Fermented foods were often thought to promote healthier guts, which could then help promote healthier skin. For example, eczema is often tied to issues that start from the gut, which is why managing eczema means using the right products but also eating the right things. Kimchi has been a fermented dish that Koreans enjoyed for centuries. What's fascinating is that the probiotic from this has been extracted and turned into a powder 'skin probiotic' that's all the rage in Korea now. I have a whole box of this. and I take two packets a day.\" This content can also be viewed on the site it originates from. By Aliza Kelly By Gabi Thorne By Gabi Thorne \"And of course, fermented ingredients in skin-care products is a trend because this fermented concept and it being linked to overall wellness and healthy skin is a big part of the Korean beauty tradition. The Shangpree Bitgoa Hue Essence Toner contains seven fermented extracts from lotus, soybean, pomegranate, rice, pumpkin, milk, and rye, and ginseng root.\" These People Tried Korean Face Masks and It Was Creepy AF: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Sarah Han By Sarah Han By Nicola Dall'Asen By Sarah Han More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2016-03-10T17:30:00.000Z",
    "url": "https://www.allure.com/story/korean-beauty-rituals"
}