{
    "title": "Korean Beauty Products 101: Two Experts Share All - Racked SF",
    "text": "Filed under: Racked is no longer publishing. Thank you to everyone who read our work over the years. The archives will remain available here; for new stories, head over to Vox.com, where our staff is covering consumer culture for The Goods by Vox. You can also see what we’re up to by signing up here. Everyone's obsessed with Korean beauty products these days. (Yes, we're guilty.) So when we heard that the founders of Glow Recipe, the New York-based, online K-beauty store were in town, we jumped at the chance to pick their brains. Sarah Lee and Christine Chang visit Korea every three months to investigate fresh brands and hot trends—and guess what? Something new is always going on. Lucky for us, the skincare mavens are talking. Here's everything you need to know. What makes Korean brands stand out? The local beauty market in Korea is extremely competitive and is in constant hyper drive. The beauty ideal for Korean women is healthy, glowing skin, and customers are willing to try anything and everything—\u0080\u0094at least once—to achieve this goal. This fuels non-stop innovation in new product categories, ingredients and technologies. What's trending on the Korean market now? Skin-plumping gel creams, pulp essences, all-natural kelp sheet masks and cold-pressed liquid treatments that you can splash on in the shower. Skintertainment is a buzzword that reflects the fun, holistic approach to skincare found in the local market.  Tell us about some of the most popular skincare ingredients. Historically, natural ingredients have been a big part of Korea's beauty heritage. You can see women using all kinds of rice-steeped waters and lotus extracts even in palace literature, going back centuries. This natural influence is still very much present today with beauty ingredients such as camellia oil from the pristine Jeju island and propolis extract, which is also used medicinally. Please demystify the whole \"15 steps Korean beauty routine\" thing. Korean women may use a few more steps, but their daily routines are fluid and adapted to their skin concerns at the time. We recommend starting with the two essentials—\u0080\u0094hydration and SPF, using a moisturizer with moisture-binding ingredients such as hyaluronic acid, or natural alternatives such as tremella or bamboo sap. Deeply hydrated, plump skin is less vulnerable to pollution and environmental aggressors since the moisture barrier will be intact. Not a step, but a word of advice: applying your products in a gentle, upwards patting motion will help with absorption without pulling or tugging on delicate skin.  How do you find the right brands to feature on your website? We always meet with the founders of brands. We love brands that are best in class in a particular category. Lindsay for example pioneered the at-home masking movement, Whamisa was one of the first cosmetic brands to use fermentation in skincare and Blithe is the originator of the splash-mask category in Korea. Partnering with brands that are sustainable and cruelty-free is also very important for us. What products go especially well with the San Francisco climate—\u0080\u0094sunny yet windy, cold and dry? We think an essence, which we like to call the modern version of a serum, would be great to keep skin hydrated, nourished and comfortable in this climate. Essences are usually a watery, lightweight texture that's great for layering. Use it on cleansed and toned skin, and follow with a moisturizer. An example of an antioxidant rich, nourishing essence is the Blossom Jeju Pink Camellia Soombi Essence Serum. A once-a-week sheet mask is also a great way to replenish dry, dull, depleted skin. We love this real sea kelp sheet mask by Whamisa for an ocean-to-face facial experience.  What are some of your other essential products? One of our main must-haves is Blithe Tundra Chaga Pressed Serum. It's a hybrid product that combines the concentration of a serum and the comforting hydration of a moisturizer, and packed with Chaga mushroom extract—a great hydrating and anti-aging ingredient. Another one is Yoon Dermaline's Marine AquaPeeler. It gently peels and infuses the skin. We just launched this a month ago, but we've been racing to keep it in stock. What are some of the coolest spots you discovered on your SF trip? We are in love with the cuisine at Lolinda and went there twice...this trip! We also loved getting caught in the sweet-treat triangle of the Mission, going between Bi-Rite Creamery, Craftsmen and Wolves and Tartine. And we stocked up on homewares at Heath Ceramics Until Glow Recipe decides to set up brick-and-mortar in SF, shop online. ",
    "datetime": "2016-02-03T09:17:42-08:00",
    "url": "https://sf.racked.com/2016/2/3/10901122/korean-beauty-products-glow-recipe"
}