{
    "title": "Korean Egg Skin Care Products | Allure",
    "text": "By Renee Jacques Eggs: delicious in an omelet, excellent for fighting blackheads? I've been using egg whites on my skin for the past few months, and let me just say I am officially hooked. If you're unfamiliar with Korean beauty products, you may be confused, but let me just say that if you ask me—and many K-beauty experts—eggs are the key to good pores. Over the past year, multiple Korean beauty brands have introduced products touting the pore-clearing benefits of the brunch-menu staple. TonyMoly came out with a set of egg-infused soaps that are shaped like tiny eggs and come in an egg carton. Too Cool for School's Egg Cream Mask has both the whites and the yolks of eggs in it. Some non-Korean brands are also jumping on the egg train. The Perricone MD OVM Serum uses the eggshell membrane (a.k.a. that soft layer between the shell and the egg white) for its supposed anti-aging benefits. So, why so many eggs in skin-care products? \"Yolk extract and albumen [that's the fancy name for the egg white] extract remove sebum and dead skin cells, which leaves the skin clean, smooth, and firm,\" says Charlotte Cho, the founder of Korean beauty site Soko Glam and the author of The Little Book of Skincare: Korean Beauty Secrets for Healthy, Glowing Skin. \"The albumen extract moisturizes while also working to tighten the pores as it firms the appearance of fine lines.\" But cosmetic chemist Randy Schueller isn't so sure of the ingredient's pore-refining benefits. \"I'm not aware of any mechanism by which egg materials could remove sebum or dead skin cells,\" he says. But he is on board with one other benefit of eggs in skin care: \"Eggs do contain albumin protein, which is a good film former,\" says Schueller. \"This makes your skin feel tighter.\" The product I've been using is the Skinfood Egg White Pore Foam Cleanser, and I love it for two reasons: First, when you squeeze the cleanser out, it looks like frothy, whipped egg whites; it's fluffy and white and inviting. Second, a little bit goes a long way. I normally squeeze a dab that's no bigger than a dime onto my hands, and it froths up so much that it's enough to use on my entire face. I wash my face using the Korean double-cleanse method. The idea is that you wash your face with an oil-based cleanser first to get rid of surface debris, like makeup and sunscreen. Then, you use a foam-based cleanser to get in there and really deep-clean your pores. I've found that the Skinfood cleanser works really well for the second, degunking cleanse. After drying off my face, when I look at my skin in the mirror, it looks like I've spent a good 20 minutes squeezing all my blackheads, without, you know, actually having to do that (or risk the redness or bacteria-spreading that can result from such behavior). I also like how it makes my skin feel taut, but not uncomfortably tight, after I use it. Just squeaky-clean in a good way. The best skin-care products: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Dianna Mazzone By Sarah Han By Fani Mari By Devon Abelman More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2016-02-23T10:00:00.000Z",
    "url": "https://www.allure.com/story/korean-egg-skin-care-products"
}