{
    "title": "Korea focus: Our most-read stories on the K-beauty industry",
    "text": "Or wait... Headlines Brand Innovation Formulation & Science Packaging & Design Business & Financial Market Trends Regulation & Safety Promotional Features Site Archive Multimedia Regions All Asia-Pacific South East Asia South Asia East Asia Oceania Site Archive Multimedia Hot topics Clean & Ethical Beauty Sustainability COVID-19 Market Entry Anti-Aging / Skin Whitening Beauty From Within Nanotechnology Green Cosmetics Site Archive Multimedia Resources Type of resources Events All Events Shows & Conferences Online Events Editorial Webinars Events China 中国 Podcast  26-Jun-2019\n                            - Last updated on\n                                26-Jun-2019 at 23:15 GMT The rising popularity of K-beauty in Switzerland​ is creating opportunities for South Korean cosmetic companies in the country, with the Korea Trade-Investment Promotion Agency (KOTRA) believing now is the optimal time for brands to enter the market. “In the conservative Swiss market, K-Beauty has emerged as the centre of the local beauty industry trend,” ​a report from KOTRA stated. President of KOTRA Kwon Jeong-Oh recently announced that Swiss department store chain Manor had established a Korean Cosmetics Pavillion in its new branch in the Swiss capital of Bern. “Thanks to the proliferation of Hallyu (Korean Wave) in Europe, our small and medium-sized cosmetic companies were introduced to Manor, Switzerland's largest department store.”​ South Korean male beauty brand, Grafen, is expanding its presence in SEA after successfully growing its presences in Korea with the help of video commerce.​ With its marketing savvy, the brand managed to grow by 80% from 2017 to 2018. “We didn’t become a well-known brand in a day. It took more than seven or eight years since we started the brand,”​ said Jeff Yoon, the brand’s senior marketing director. Yoon said the firm was very aware that they had to focus on building up brand awareness from the start. “The conventional way of doing business is to go through a franchise or a wholesaler, but we have a different approach of going online first. But we did not focus on just selling products. We wanted to build the brand name in Korea.”​ Beauty retailer Sephora has announced its ambitions to expand further into the Asia Pacific market by entering Korea,​ New Zealand and making a comeback in Hong Kong. The LVMH-owned firm plans to unveil its news stores in all three markets by the end of 2019. Sephora Asia has over 3,000 stores globally and currently operates in twelve countries including Australia, Singapore, Malaysia, China and Thailand. The company said adding Hong Kong, Korea and New Zealand to its business is “a testament to its appetite for international beauty in the region”​ The rise of minimalism is creating opportunities for beauty companies to create simple products to cater to South Korean consumers that are looking for more straightforward beauty routines​. The minimalist trend is driven by young urbanites who are beginning to embrace a simpler lifestyle to combat everyday stress. “A growing number of younger consumers have started to embrace a minimalist lifestyle to give themselves space to breathe as well as take a rest from anything that may be pressurising, even if just slightly,” ​said Hwa Jun Lee, senior beauty and personal care analyst at Mintel. These consumers, he continues, are happier when buying ‘just the essentials’. South Korean beauty conglomerate LG Household & Healthcare has collaborated with top Korean dance studio 1Million to launch an online exclusive beauty brand​ for the millennial generation. The new brand, Million Beauty, was launched on May 9 with a star-studded bash including entertainers such as actors Yim Eun Kyung and Yeo Hyeon Hyun. Million Beauty is an online exclusive brand with a line-up that consists of five products including a face cream, face mist and cushion foundation. The company said the brand will showcase “cosmetics with proven functions and effects”​ “Million Beauty is a sensational beauty brand for millions who want to deny uniformity of 'beauty', enjoy their own life and express their beauty,” ​said the company in a statement. Copyright - Unless otherwise stated all contents of this web site are © 2023 - William Reed Ltd - All Rights Reserved - Full details for the use of materials on this site can be found in the Terms & Conditions Related topics\nMarket Trends\nEast Asia\nAsia in Focus\nSkin Care\nHair Care\nColor Cosmetics\nFragrance  Content provided by Naolys | 07-Jul-2023\n                     | White Paper Naolys presents HairRevive [MM+Zn], a pioneering plant-based ingredient revitalizing hair.  Content provided by Provital | 13-Jun-2023\n                     | Product Brochure Circanblue™ is a vegan postbiotic ingredient obtained from Lactococcus lactis that induces a resynchronisation of the skin’s circadian cycle after this... More promotional features ",
    "datetime": null,
    "url": "https://www.cosmeticsdesign-asia.com/Article/2019/06/26/Korea-focus-Our-most-read-stories-on-the-K-beauty-industry"
}