{
    "title": "Korean Beauty Products, Once Niche, Are Entering the U.S. Mainstream",
    "text": " Profile Sections tv Featured More From NBC Follow NBC News A man arrested in the killing of a Baltimore tech entrepreneur was suspected of raping a woman days before and was already under surveillance, police say September 28, 2023, 12:24 PM Michael Gambon, the actor best known for playing Dumbledore in the 'Harry Potter' films, dies at 82 September 28, 2023, 8:02 AM Morning Rundown: Biden impeachment inquiry's first hearing, Powerball jackpot nears $1 billion, and Kansas City's love story with Taylor Swift September 28, 2023, 7:36 AM U.S. soldier Travis King arrives back on American soil after being expelled from North Korea September 28, 2023, 4:04 AM Remains found in Colorado are identified as Suzanne Morphew, a mom who disappeared in 2020 September 27, 2023, 5:54 PM The mother of a man suspected of killing a Baltimore tech CEO urged him to surrender, fearing police would try to kill him September 27, 2023, 2:37 PM When it comes to her beauty regimen, JuE Wong jokes that she puts Korean women to shame. Never mind that she is constantly experimenting with the latest array of creams or serums as president of the Elizabeth Arden brand, even Wong’s daily routine trumps this group of women known for their devotion to multi-step skin care rituals where it’s not unusual to rely on up to a dozen different products. \"It really is the performance and efficacy of the products that really catapulted Korean beauty to become mainstream here.” To accomplish a flawless complexion, Wong describes an extensive routine: In the morning she cleanses her skin, applies toner, dabs on an essence, layers five different serums, lathers on three moisturizers, and safeguards her skin with SPF. She not only repeats the cleansing process before going to bed, but she also covers herself with three moisturizers. Over the past year, Korean beauty products — from toners to sheet masks — have grown in prominence at U.S. stores. While beauty bloggers have raved about the skin care options from Korea for some time, more mainstream companies like Sephora and L’Oreal have now taken notice. “When we looked at the beauty space, we knew it was missing a category,” Wong told NBC News. She added that Elizabeth Arden looked at global beauty trends when it launched its SUPERSTART Skin Renewal Booster. “This fills a gap in the beauty regimen,\" she said. https://www.instagram.com/p/BAH6VJcqAxB Brands looking to Korea see it as potential boon for their business. South Korea exported $1.8 billion in cosmetics in 2014 compared to the $1.04 billion it imported, according to the Korean Pharmaceutical Traders Association. In 2015, Sephora launched a campaign around its K-beauty products while Estée Lauder’s Clinique brand introduced a lotion with rice bran extract and pomegranate to the North American market that it said was inspired by the trend. Even Urban Outfitters carries a range of fun, whimsically-designed Korean beauty offerings in its stores. The BB cream craze — creams that claim to moisturize and even out skin tone, replacing a multitude of other products — hit the U.S. in 2011 when Sephora started carrying Dr. Jart+, a Korean brand. April Walloga, a beauty editor and the co-founder of Revelist, a millennial women’s website slated to launch in early 2016, credits beauty bloggers and vloggers like Michelle Phan and Charlotte Cho for bringing more awareness to these products. She adds that millennial women pour through blogs, online forums, and social media for recommendations. https://www.instagram.com/p/853wVKuGUb “Everyone was taking ‘sheet mask selfies’ and posting them on social media when they first got popular. They made you look like Jason from ‘Friday the 13th,’” Walloga told NBC News. “It’s good to have fun with beauty.” The products aren’t just about packaging, though. Dr. Dendy Engelman, director of dermatologic surgery at Metropolitan Hospital in Manhattan, told NBC News she's found many of the products to be on the cutting edge. “They are not about one size fits all. The products target one specific issue, and I think we’re seeing a change about each step for each end goal,” Engelman said. “Now we need something for acne, eyes, the neck, etc. This all involves more steps.” https://www.instagram.com/p/BAIgAoMLsfR Angela Kim, the founder and CEO of Insider Beauty, a Korean-focused online cosmetics retailer, says Americans are more curious about K-beauty than ever. “The packaging, branding, and fresh concepts are what really captured a lot of attention here,” Kim, who also helps curate and test the items sold on Insider Beauty, told NBC News. “But it really is the performance and efficacy of the products that really catapulted Korean beauty to become mainstream here.” Engelman believes that the popularity of Korean beauty product is beneficial to consumers. “We have more beautiful products than before. I think because that’s thanks to the Asian market and how obsessed they are with skincare,” she said. Yun Yu, a young publicist living in New York City, says she can relate to this obsession. Upon arriving to Korea on a visit, one of the first things she told NBC News she did was drag a friend to take her shopping to explore the many products not seen in the U.S. “The greatest contribution about this Korean fad, it has allowed for people to be more educated about skin care,” Yu, who’s devoted to a skin care routine that involves everything from cleansing oils to enzyme peels, said. “I see a lot of my non-Asian friends starting to adapt the attitude of prevention versus damage control.” But staying on trend when it comes to skincare also comes with a hefty price tag: Sephora's bestselling K-beauty products can cost up to $150 each. One Dr. Jart+ sheet mask is priced at $7.50 at Sephora, putting a twice-a-day routine at more than $100 a week for the masks alone. Wong, who says early prevention is a mantra at Elizabeth Arden, says American women looking to simplify their beauty routine could change their minds once they see the results that K-beauty products have on their skin. “If they see a benefit in an eight-step process, I truly believe they will step up to it,” Wong said. “A little bit can go a long way.” Follow NBC Asian America on Facebook, Twitter, and Tumblr. © 2023 NBC UNIVERSAL ",
    "datetime": null,
    "url": "https://www.nbcnews.com/news/asian-america/korean-beauty-products-once-niche-are-entering-u-s-mainstream-n489841"
}