{
    "title": "Korean Skin Care for Acne Is Completely Different Than America's Approach | Expert Insight | Allure",
    "text": "By Devon Abelman All products featured on Allure are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission. Picture this: Your skin is breaking out. It's angry and inflamed, so you douse the fire with salicylic acid, benzoyl peroxide, and whatever astringent, harsh ingredients you can get your hands on to dry out the spots. Flakiness and redness replace the spots, but all is fair in acne and war, right? Let's be real: In America, we want — and believe we deserve — a quick fix for our acne … and just about everything. \"We want a pill, an antibiotic, or a spot treatment as a reaction to ailments,\" says Zion Ko Lamm, M.D., a board-certified doctor of internal medicine. Imagine if we took a more holistic approach, though. Preventing breakouts would be our primary focus. We would go to our dermatologist before we lose sleep and tears over pimples, and our skin-care routines would consistently focus on hydration, supporting our skin's moisture barrier, and thorough cleansing. Well, that's how acne is addressed in South Korea. \"When [it] inevitably arises, instead of blasting the damaged area with a harsh acid, the focus remains on prevention,\" Dr. Ko Lamm shares. Although Dr. Ko Lamm's practice is based in Charlotte, North Carolina, she was born in Korea, and her take on Korean skin care is correct. Over the years, I've interviewed countless dermatologists based in Seoul. Back in 2019, I sat down with board-certified dermatologist Lim Ee Seok in his office at the Thema Dermatologic Clinic in Seoul's dermatologist-dominated neighborhood Gangnam. Here, he even stressed the importance of dermatology in Korea is not about fixing problems but preventing any from occurring. And how exactly breakouts are banished in Korea? Well, allow board-certified Korean dermatologists based in Seoul and New York City to explain. Just perusing K-beauty products available in America, you'll notice acne-focused formulas are incredibly gentle compared to those from Western beauty brands. They tend to feature hydrating, calming ingredients, like niacinamide, green tea, hyaluronic acid, and Centella asiatica (aka cica), says Dr. Y. Claire Chang, a board-certified dermatologist at New York City's Union Square Dermatology, tells Allure. (She also spends several months a year in Seoul.) You'll seldom see retinol-based products on shelves at beauty stores in Korea. Bakuchiol, a low-key vitamin A alternative, is starting to have its K-beauty moment, though. Courtesy of brand Courtesy of brand These soothing, healing ingredients are preferred over tretinoin and high concentrations of acids because those with acne tend to have incredibly sensitive and inflamed skin. Over-exfoliating and drying out the skin would just exacerbate the irritation, Dr. Chang notes. \"Koreans value glowy, hydrated skin and would be unhappy if their skin started peeling or becoming dry,\" she adds. With those emollient ingredients in mind, \"moisture, lots of moisture\" is unsurprisingly Seoul-based board-certified dermatologist Dr. Cho Yun Joo's top advice for people dealing with acne. She, herself, has acne-prone skin and tells me she goes through two jars of moisturizer a month to keep her skin balanced and clear. Reason being: \"If you have dry skin, your skin will produce more oil to protect it,\" she explains. And more oil equals more opportunities for breaking out. She's also a toner devotee and pours it into a spray bottle for easy application. Hydration, in general, is also the key to clearing out toxins, \"No matter the location in the body, whether it's pancreatitis, colitis, or dermatitis,\" Dr. Ko Lamm mentions. Dry skin, in particular, is a prime breeding ground for bacteria and clogged pores, she adds. So when you pair topical hydration with drinking a good ole glass or seven of water, you're basically treating acne in the most holistic way for total body wellness. Acne patients in Korea also take their relationship with their dermatologists seriously. Many even have weekly or twice-weekly appointments, Dr. Chang and Dr. Hwang Jong Ik, a board-certified dermatologist at Seoul's ID Hospital, point out. I've also heard this firsthand from Korean rapper pH-1 who also makes going to the dermatologist once a week a mission despite constantly making music and coming out with collabs with the best artists in Korean music. However, he isn't simply getting a skin check and leaving with a prescription for something or a list of product recommendations. Instead, people stop by the dermatologist's office for medical-grade facials, not only when their skin is going through it but also when its doing well. They frequently involve everything your skin could possibly need to thrive: deep cleansing, gentle exfoliating peels (often called \"scaling,\" says Dr. Hwang), calming masks, moisturizing ampoules, and minimally invasive extractions. I got one at ID Hospital the last time I was in Seoul, and it was absolutely divine despite not being in a spa-like environment. I loved how intensive and clinical each step was. By Aliza Kelly By Gabi Thorne By Gabi Thorne [Ed note: For those unaware, Korea has a universal, single-payer healthcare system, and in-office treatments are far more affordable than they are in America.] About five years ago, skin-care technology started to advance, and acne patients started adding laser treatments and radiofrequency-charged microneedling to their weekly visits, Dr. Ban says. Gold photothermal therapy (or Gold PTT) is a favorite of Dr. Sang Wook Lee, a board-certified dermatologist at Seoul's Yezel Clinic, for treating patients with severe acne. My friend even undergoes this treatment with Dr. Sang and swears by its visible and non-invasive results. Basically, a special serum spiked with gold nanoparticles is layered onto skin. Next, an ultrasound wave device is used to encourage pores to absorb it. Then, a long-pulsed diode laser, often Vbeam, heats up the gold molecules and, more or less, shrink pores and stop oil production by damaging sebaceous glands — in a good way — while killing acne-causing bacteria. Major studies are just starting to be done on Gold PTT over the past three years, so it isn't available in the U.S. just yet. However, VBeam is widely offered at dermatology offices across the U.S. Dr. Cho, on the other hand, has personal experience with a more heavy-duty laser for managing her acne: Fraxel, which comes with major downtime. But, \"It slows down breakouts for those who constantly get them,\" Dr. Ban adds. Injectables are also an option. Of course, cortisone injections are often done at dermatologist offices to help quickly nip cystic pimples in the bud — just as they are done in America. But Korea takes injections several steps further with what is called skin booster shots. (I've explored them in-depth when sharing what the future of K-beauty looks like and when I tried out a few myself.) The most popular one for acne is called Rejuran Healer, according to Dr. Choi Bo Youn, a board-certified dermatologist in Seoul. With the assistance of DNA from salmon, shallow injections of the elixir help balance out oil production and moisture levels. \"It also helps with redness and rejuvenating,\" she adds. Prescription topical creams are also offered. They are considered the fastest route to clearing up acne, Dr. Choi says. Antibiotic-based ones and Epiduo are the most popularly prescribed in Korea, adds Dr. Ban. The latter is often prescribed in America, too, particularly for cystic acne. And, of course, Korea is the home of pimple patches. The small, round hydrocolloid stickers help heal acne without drying it out while protecting skin from further environmental aggravation, Dr. Ko Lamm says. The stickers also keep you from picking at or popping your pimples, Dr. Chang adds. When I'm out to dinner with friends in Seoul or even backstage at a K-pop show, I always see at least one pimple patch on someone's face. They are also easily accessible with numerous racks of them at any store that sells beauty products. Luckily, you can find them just as well in the U.S. lately, thanks to Hero Cosmetics and Soko Glam. Courtesy of brand Although most acne stickers aren't medicated, some are infused with gentle-yet-effective anti-inflammatory ingredients, Dr. Ko Lamm mentions. The Cosrx Master Patch - Intensive, which is an essential in my skin-care routine, covers zits with a tea tree oil-boosted blanket, while the Acrosspass Trouble Cure is barbed with painless, dissolvable darts of hyaluronic acid, niacinamide, and peptides. As mentioned above, as patients, we love a quick fix for our medical issues. Physicians and patients in America, on the other hand, value evidence-based medicine, according to Dr. Chang. They often rely on large clinical studies when recommending acne products. The ingredients that are often put into action in these successful studies are typically benzoyl peroxide, salicylic acid, and retinoids, despite their drying and irritating side effects, she says. By Aliza Kelly By Gabi Thorne By Gabi Thorne Our acne conversations in America are truly dominated by this trio. (Lest we forget that drying lotions were prized spot treatments for several decades.) Hydrating ingredients, like niacinamide and hyaluronic acid mentioned above, come up more in regards to dry, mature skin. Also, Dr. Chang personally can attest to the fact that many people in America simply don't have a regular skin-care routine. \"They often treat [breakouts] as they come,\" she adds. However, Dr. Chang does note many of her patients are slowly but surely becoming increasingly interested in preventative care. Consistency is crucial to the most effective K-beauty acne skin-care routine, Dr. Chang says. Once you find products that work for your complexion, stick with them daily. I asked the dermatologists what their favorite ones were — just in case you need some suggestions. For cleansers, Dr. Chang recommends the Neogen Real Cica Micellar Cleansing Foam. Alongside the skin-loving ingredients cica and hyaluronic acid, the gentle face wash also helps rinse away impurities without leaving it tight and dry with the help of ceramides. Dr. Ko Lamm, on the other hand, suggests the Medicube Zero Foam Cleanser. The frothy formula, which is also a must-have among Allure Korea editors, pairs emollient-rich fatty acids with calming plant extracts to sweep away dust and bacteria sitting on skin and polluting pores. Be sure to only wash your face one to two times a day. \"Twice is enough — in the morning and at night,\" Dr. Lee advises. \"I see people cleanse more than they need to when their skin starts to break out.\" In fact, K-pop stars, like Jamie and TWICE's Jihyo, have told me they don't wash their faces with anything but 10 splashes of water in the morning. Dr. Ranella Hirsch, a board-certified dermatologist in Boston, even echoed these sentiments in a past Allure interview. \"There's really no reason to wash your face in the morning, especially if you thoroughly cleansed the night before.\" Next, you may want to incorporate a toner into your skin-care routine. In that case, the Cosrx AHA/BHA Clarifying Treatment Toner is a \"gentle exfoliating toner that can be used daily to remove dead skin cells and de-clog the pores,\" Dr. Chang says. It also features a combo of ani-inflammatory ingredients, particularly allantoin, and gentle acids, like willow bark water, betaine salicylate (both are derivatives of salicylic acid), and apple fruit water (a form of malic acid). By Aliza Kelly By Gabi Thorne By Gabi Thorne Alternately, you could try the popular Some by Mi AHA-BHA-PHA 30 Days Miracle Toner, which acts as a secondary cleansing step to rid pores of nastiness and leave it soothes and refreshed, or Krave Beauty's Kale-Lalu-yAHA, a gentle exfoliator featuring glycolic acids and leafy green extracts to lift away pore-clogging dead skin cells and grime from skin. I personally recommend a trick I learned from K-pop stars: Soak cotton pads with any of the toners listed and place them on your breakouts before letting them sit for a bit as a quick spot treatment. Courtesy of brand In the world of serums, the Goodal Green Tangerine Vita C Dark Spot Serum, as suggested by Dr. Ko Lamm, is a great daytime option to help even out the texture and tone of your complexion with citrusy vitamin C derivatives. And I'll let you in on some local tea: My friends in Seoul are obsessed with the isoi Bulgarian Rose Blemish Care Serum, which is even a top-selling product at Olive Young — Korea's beauty superstore/my heaven and first stop I make when I get to Seoul. Its variety of botanical ingredients includes allantoin, willow bark extract, and several extracts of different parts of a rose to get troubled skin glowing. The Dr.G Red Blemish Clear Soothing Cream is Dr. Chang's go-to moisturizer pick as the lightweight gel formula calms inflammation with niacinamide, panthenol, and several forms of cica. The Dr. Jart+ Teatreement Moisturizer is another stellar weightless option. The green gel is packed with green tea extract and tea tree leaf oil, as well a tolerable amount of salicylic acid and ceramides, to combat acne while nourishing skin, Dr. Chang says.  By the way, rose is a soothing skin-care addition as it contains \"anti-inflammatory and antiseptic healing properties,\" according to Ava Shamban, a Beverly Hills-based dermatologist. And for days when you want to indulge in a face mask after washing your face, the Mediheal Tea Tree Essential Blemish Control Mask is a top seller in Korea and a favorite among Korean dermatologists. It zaps away sits with willow bark extract and tea tree leaf extract while calming skin with cica, allantoin, and chamomile. Implement this in place of your serum step, and follow up with moisturizer. Courtesy of brand And there you have it: All the tools to clear skin success, courtesy of the K-beauty side of skin care. By Aliza Kelly By Gabi Thorne By Gabi Thorne Read more about K-beauty: Now, watch K-pop group Monsta X try nine things they've never done before: Follow Devon Abelman on Twitter and Instagram. You can also follow Allure on Instagram and Twitter, or subscribe to our newsletter to stay up to date on all things beauty. By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Nicola Dall'Asen By Fani Mari By Devon Abelman By Dianna Mazzone More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2022-02-16T14:00:00.000Z",
    "url": "https://www.allure.com/story/how-to-treat-acne-in-korea"
}