{
    "title": "Korean beauty brands: 15 to have on your radar",
    "text": "    Advertisement WORDS Madeline Kenzie    PUBLISHED Tue, 10 May 2022 - 9:00 am We have Korea to thank for many things; K-pop and our undeniable thirst for all four members of BLACKPINK to name a couple. But great fashion, food and lifestyle aside, if there is one area we are truly excited about here its Korean beauty. Over the past few years, K-beauty has become a mainstay in our bathroom shelves. Cult brands like Laneige are constantly recommended by your favourite beauty influencers. In fact, as soon as its life-changing lip sleeping mask range went viral on TikTok, we knew the label wasn't going anywhere soon. As many of the industry founders will tell you, Korean beauty has always been about quality first, and making their ingredients more accessible worldwide. Very much a skin-first ethos, the now billion-dollar industry is all about about utilising skin-loving, inflammation-reducing ingredients like niacinamide, yuzu, birch, and much more. Natural extracts from plants and animals, like snail mucin, continue to dominate the Korean beauty market space and have done for many years. One thing is for sure, treating irritated skin, improving blood circulation to removing dead cells, using K-products in a daily skincare routine will undeniably help yield the best results. So with all that said, we've compiled a list of all the best of the Korean beauty favourites to consider adding to your cart.    A post shared by 설화수 Sulwhasoo Official (@sulwhasoo.official)  Pronounced “Suhl-ha-soo,\" this skincare brand was founded on the philosophy of balance. Utilising Korea's finest natural ingredients, Sulwhasoo is one of the best selling Korean brands on the market. In keeping with the brands holistic approach, you won't find any nasties or overpowering scents.    A post shared by 라네즈 Laneige Korea (@laneige_kr)  Not for nothing, this cult favourite brand has most of beauty TikTok in a chokehold. The aforementioned lip mask is one of the highest selling on the market for a reason. But it doesn't stop there, its serums laden with goodies like niacinamide are genuine skin savers.    A post shared by Peach & Lily (@peachandlily)  Founded by Alicia Yoon, the brand has been going from strength to strength since its launch in 2021. The brightening vitamin C is a stand out, helping aid persistent dark spots and sun damage.   A post shared by AMOREPACIFIC Official | 아모레퍼시픽 (@amorepacific.official)  Known as a key luxury Korean skincare brand, Amorepacific is the corporation, which operates well known Korean beauty brands Laneige, Sulwhasoo, Innisfree, and more. With a focus on ingredients packed with green tea, Amore Pacific's aim is to penetrate the skin with natural and moisture-enhancing formulas.    A post shared by Glow Recipe (@glowrecipe)  After working together for L’Oreal, Christine Chang and Sarah Lee founded the fruit-infused brand in 2017. What started as a Korean skincare market place has evolved into what is now referred to as Glow Recipe. Highlighting a singular fruit as the star of each product, the Watermelon Glow mask has become a cult favourite.    A post shared by innisfree | 이니스프리 (@innisfreeofficial)  What can we say? Any brand inspired by a Yeats poem can only be poetry in motion for us. Innisfree is a holistic skincare brand, using the natural ingredients found on Jeju island to enhance skin in the cleanest way possible. With an array of moisturisers, clay masks and serums, they truly have everything covered.    A post shared by SOME BY MI (@somebymi)  There are not enough hours in the day to praise this brand. Using a truly innovative array of natural ingredients, the AHA serum is certifiably insane how rebalancing it is. Evening out the skin and giving it an extra boost of hydration. Worth it to the last drop, the Matcha pore tightening toner also ranks very high on our list!    A post shared by Dr.Jart+ North America Market (@drjart)  Since it was founded in 2004, Dr. Jart+ has fostered a prolific presence in the land of beauty. The name is an abbreviation of \"doctor joins art,\" which captures the way the brand aims to marry dermatological science and art. If you're looking to ease your way into its product range, we suggest starting with one of its popular Rubber masks, before proceeding onto its Cicapair line infused with soothing tiger grass or its BB creams injected with niacinamide and SPF, of course.    A post shared by Saturday Skin (@saturday_skin)  As its name suggests, Saturday Skin's philosophy is all about the relaxed, stress-free pace of the weekend. Its products work hard, so you can take the day off. Hailing from the CHAUM wellness centre in Seoul and formulated with seven potent peptides, we're big fans of the Waterfall Glacier Water Cream and its affordable price point.    A post shared by Then I Met You (@thenimetyou)  The brainchild of Soko Glam co-founder, Charlotte Cho, Then I Met You was born in 2018 and is loosely based around the Korean concept of jeong, which put simply is the rapport, affection and attachment born between two people or a community. The beauty range is small and carefully curated with hero ingredients like persimmon, ginseng, and fermented rice.    A post shared by Hanbang Skincare : BOJ (@beautyofjoseon_official)  As is a common theme in K-beauty, Beauty of Joseon operates on the belief that skin-healing is achieved through application of traditional herbal ingredients and plants. The serums are a crowd favourite and the Dynasty Cream is a holy grail product for a close friend, who has replenished her stock four times.    A post shared by Abib Cosmetics (@abib.global)  Abib stands for \"the first month\", a sentiment that strives towards pure cosmetics from the very foundation of your skincare regimen. With external pollutants and general wear and tear, Abib aims to return the skin cycle back to its prime, natural complexion. It's minimalist, thoughtfully-designed packaging is a drawcard, and the high-efficacy products are enough to keep you refilling, time after time. Shout out to its viral sunscreen stick.    A post shared by Isntree (@isntree)  The brainchild of skin-blogger turned entrepreneur, Jinwoo Kim, Isntree looks to science to formulate products that centre pure and clean ingredients. With eco-friendly packaging and a focus on green ingredients, Isntree products are designed for all skin types, especially the more sensitive among us.    A post shared by Dear, Klairs (@klairs.global)  An affordable brand with high-quality formulations, Klairs is loved by dermatologists and refuses to test on animals. Founded in 2010, Klairs originally set out to create thoughtful products for people with sensitive skin. All these years later its skin-soothing qualities have hit cult status.    A post shared by belif USA (@belifusa)  Favouring anti-inflammatory naturally-derived ingredients, Belif finds its way on the yearly lists of beauty favourites for good reason. Image: roses_are_rosie, pinterest, pinterest Enter your details below to receive 30% off Amber Sceats jewellery.  Whatever the look, Law seems to effortlessly carry it.  October is the calendar year equivalent of the 3 p.m. slump. We’re somewhat exhausted, but there’s still a decent way to go before it’s time to log off. But beauty affords the perfect pick-me-up, just think of it as your vending machine Diet Coke. Whether it’s a skincare superlative or a smoky scent imagined by […]  From drugstore classics to Australian-born gems.    +61 2 9293 0999 30-38 Victoria StreetPaddington, NSW 2021 ABN: 84 108 828 119ACN: 108 828 119 © RUSSH Magazine 2023. All right reserved. RUSSH.com is published by RUSSH Media Pty Ltd. About | Stockists | Privacy | Complaints | Editorial Policy ",
    "datetime": "2022-05-09T23:00:37+00:00",
    "url": "https://www.russh.com/korean-beauty-brands/"
}