{
    "title": "Korean Skin Care Secret: Face Mists Are More Important Than You Think | Glamour",
    "text": "By Deanna Pai Most of us have been taught to moisturize our skin twice—once in the A.M. and again before bed—and call it a day. But what if our skin needs more than that? That's the school of thought in Korea, where practicing good skin care is practically a national sport. Instead of relegating moisturizer to morning and night, Korean women are all about 24/7 hydration. Sounds intense, right? This is where face mists come in. Why They're a Big Deal Go for a stroll in Seoul and chances are, you'll catch someone spritzing her face with face mist. \"We definitely see women spritzing them all the time—in public transportation, at cafes, on streets,\" says Sarah Lee, cofounder of the Korean beauty e-tailer Glow Recipe. Many stash travel-size versions in their purses so they'll never be caught without them. Much like essences, face mists have carved out an entirely new category. Lee, who recently visited Korea, noticed that the shelves at Olive Young (the country's equivalent of Sephora) were crammed with mists—proof that it's become less a second-thought and more of a nonnegotiable. A photo posted by Sarah Lee (@sarah_glow) on Jan 5, 2016 at 11:30pm PST What They Do We hear you: Face mists? How are they even groundbreaking? What sets these next-gen versions apart is their formulations, which have been designed with the crazy-high standards of Korean consumers in mind. Instead of just feeling nice on skin (and fun to spritz), they actually get work done. While pretty much all of them hydrate skin, \"there are mists that tone skin, set makeup, act as a serum to nourish skin throughout the day, or even cool skin down,\" says Alicia Yoon, founder of K-beauty e-commerce site Peach & Lily. A common belief in Korea (backed up by research) is that production of sebum—the gunk that clogs pores to form pimples—increases with a rise in skin temperature. So if your face feels hot, explains Yoon, consequences can appear in the form of oiliness and breakouts. This is where mists are especially helpful, since they cool skin on contact. But regardless of the bonus benefits, hydration is still the star of this show. \"When your skin is dehydrated, its protective barrier gets weaker, which means collagen and elastin can break down faster,\" explains Yoon. By keeping it well moisturized, you're setting yourself up for smoother, glowier skin in the long run. How to Use Them Good news! You don't have to cram yet another step into your usual skincare routine. (Phew.) Face mists are best as on-the-go hydrators, spritzed on whenever your skin feels uncomfortable or tight during the day—or you just feel like you need a pick-me-up. It also minimizes the drying effects of indoor heating, so keep it close by if you're trapped inside this winter. As for spraying face mist over makeup, it's totally fine. In fact, they often help makeup last even longer and give skin a fresh, dewy sheen. Read on to figure out which option is right for you. Best All-Around Mist Thanks to the combo of acai berry (there's a whopping 20 percent in here), blueberry, and raspberry extracts, the antioxidant level in this is off the charts—which gives you protection against daily skin aggressors (think UV and pollution). Ariul Berry Vital Recharging Gel Mist ($18, peachandlily.com) Best for Skin That Looks Greasy by 3 P.M. By Andrea Navarro By Emily Tannenbaum By Elizabeth Logan Try trading in your blotting papers for a few spritzes of this. The tea tree oil tightens pores and zaps any bacteria attempting to cause a breakout. Tea Tree 70 Mist Toner ($33, glowrecipe.com) Best for Skin Drier Than the Sahara There's no water (a common filler in products) in this, which means you get more of the good stuff, like soothing aloe vera and floral extracts. Consider it green juice for your skin. Whamisa Organic Flowers Damask Rose Petal Mist ($38, glowrecipe.com) Best If Your Purse Already Weighs 10 Pounds By Andrea Navarro By Emily Tannenbaum By Elizabeth Logan These travel-friendly twins are all about antioxidant-rich lotus leaf extract, which is paired with camellia for a calming effect and lemon extract for brightening. The Lotus Leaf & Camellia Mist and The Lotus Leaf & Lemon Mist ($33 each, peachandlily.com) Best After You Hit the Gym The blend of ginseng extract (which boosts production of moisture-magnet hyaluronic acid) and calming honey take down any redness that lingers post-spin class. Soyedodam Organic Ginseng Mist ($25, glowrecipe.com) By Shanna Shipin By Fiona Embleton By Danielle Sinay More from Glamour See More Stories © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Glamour may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "datetime": "2016-01-28T13:00:00.000Z",
    "url": "https://www.glamour.com/story/why-you-need-face-mists"
}