{
    "title": "Korean skincare Australia: 10 K-beauty dupes for cult skincare products.",
    "text": " If there’s one thing you really ought to know about skincare, let it be this: More expensive does not always equal better quality. Sure, some products are expensive for a reason. Many brands have spent millions of dollars innovating and perfecting their formulas and sometimes, that comes with a higher price tag. But a lot of the time, what you’re really paying for when buying exxy skincare products is the brand name. And the packaging. WATCH: We tried the Glam Glow Glitter Mask to see if it’s worth the hype (hint: things got intense!). Post continues after video. But did you know there are a bunch of really great K-beauty (Korean beauty) brands out there that have been making and selling excellent products for years that do wonderful things for your face at an affordable price? To find out which K-beauty cleansers, serums, masks and moisturisers are worth your money, I turned to Lauren Lee, founder of K-beauty online retailer STYLE STORY. Lauren started her K-beauty online store while working as a corporate lawyer, back when you couldn’t get Korean beauty products in Australia. Now, she’s based in Seoul, South Korea, where she lives and breathes K-beauty skincare products (she puts them on her face, too). Keep scrolling for Lauren’s 10 cheap and cheerful K-beauty dupes, including more affordable alternatives for cult products from brands like Eve Lom, Drunk Elephant, SK-II and Estee Lauder. Price: $12 for 18 patches. Dupe for: ZITSTICKA KILLA Clarifying Microdart Patch Kit, $40 for 8 patches. Why they're just as good: \"Zitsticka uses microneedles and chemicals to treat early-stage zits and stop pimples from getting too large. For a 100 per cent drug-free alternative that’s suitable for all skin types, try Subi Perfect Pimple Patch, a K-Beauty option that uses medical grade hydrocolloid to reduce inflammation and quicken the healing process. This patch is also visibly thinner and stickier than Zitsticka, making it perfect for daytime use because you can barely be seen on the skin. You can also wear them under makeup. They're perfect for whiteheads (learn about types of pimples here), pimples that have been picked at and spots that refuse to heal over.\" Price: $29.95 for 80ml. Dupe for: Eve Lom Cleanser, $114 for 100ml. Why it's just as good: \"The Eve Lom Cleanser is a rich and oily cleanser containing chamomile oil and eucalyptus oil that works to break down makeup and remove stubborn eyeliner and mascara. Swap it over for Beauty of Joseon’s Radiance Cleansing Balm, which works just the same, but at a third of the price. This K-Beauty option is a safer choice for acne-prone and sensitive skin types, containing no silicon, parabens, sulfates or alcohol. The cleansing balm melts when it touches the skin to eliminate thick makeup, dirt and dead skin cells. It also uses a time-honoured Korean formulation based on rice water and grain ferment ingredients.\" Price: $54.95 for 150ml. Dupe for: SK-II Treatment Essence, $110 for 75ml. Why it's just as good: \"SK II’s essence contains “Pitera”, a yeast derived from the sake making process. K-Beauty brand Missha’s beloved essence is packed with 90 per cent fermented yeast concentrate. Considering it is less than half the price of SKII and contains twice the amount of product, this is a steal! Now in its fourth generation, Missha’s iconic essence has been a staple in many Korean skincare collections for years. It provides eight benefits (as certified by the Korean FDA): soothing, smoothing, balancing sebum levels, moisturising, improving skin tone, firming, wrinkle repair and boosting radiance.\" Price: $17.95 for 100g. Dupe for: Fresh Sugar Face Polish, $90 for 125g. Why it's just as good: \"Fresh’s Sugar Face Polish is an exfoliating scrub with a brown sugar base that contains strawberry seeds to exfoliate, as well as calendilia wax and fruit seed oils. Skinfood Black Sugar Wash Off Mask contains many of the same ingredients, but is available for a seventh of the price. Made from grainy sugar granules, Skinfood Black Sugar Wash Off Mask sloughs away excess oil and grime, with a self-heating formula that opens up your pores so your skin can fully absorb the minerals and vitamins.\" Price: $32.95 for 200g. Dupe for: Alya Skin Pink Clay Mask, $49.99 for 120g. Why it's just as good: \"Alya Skin Pink Clay Mask is made on a base of kaolin clay, promising to work as a solution for pores, blemishes, oiliness and blackheads to clear the complexion. At almost twice the size and $7 cheaper, K-Beauty brand Cosmetea’s divine Black Tea Pink Clay Mask is also made with kaolin as its star ingredient, as well as bentonite, black tea and camellia oil. This unique pink clay combines black tea leaves and other natural extracts with clay. It is a natural, vegan formulation that gently exfoliates while hydrating skin from deep within.\" Price: $25.95 for 100ml. Dupe for: Biologique Recerche P50 Lotion, $91 for 150ml. Why it's just as good: \"Biologique’s Lotion P50 is a cult, all-in-one toner, balancer and exfoliating lotion that helps speed up the epidermis’ natural exfoliating process. COSRX BHA Blackhead Power Liquid is a cult Korean Beauty product in its own right, thanks to its ability to prevent the formation of blemishes before they even occur. This oil-soluble chemical exfoliant clears dead skin cells to minimise pores and prevent breakouts, and unlike western BHA (beta-hydroxy acid) products, COSRX BHA Blackhead Power Liquid is formulated using betaine salicylate rather than the more common salicylic acid.\" Price: $54.95 for 50ml. Dupe for: Estee Lauder Advanced Night Repair, $152 for 50ml. Why it's just as good: \"Estee Lauder’s ANR serum contains the active ingredient Bifida Ferment Lysate and other ingredients that claim to heal, repair, hydrate and aid cell turnover. Missha’s Time Revolution Probio Ampoule also contains Bifida Ferment Lysate, along with a whopping nine other fermented ingredients, multiple peptides, plant extracts and niacinamide. Considering Missha’s Ampoule is a worldwide bestseller in its own right, it’s a bargain at a third of the price! Containing 10 types of lactobacillus that enhance moisture levels and elasticity, this ampoule works to improve skin’s basic strength, density, moisture, balance, skin tone and elasticity.\" Price: $60.95 for 50ml. Dupe for: Drunk Elephant Protini Polypeptide Cream, $105 for 50ml. Why it's just as good: \"Drunk Elephant’s Protini Polypeptide Cream includes a combination of peptides, growth factors, and amino acids in a thick cream that claims to reduce lines, wrinkles, and sun damage. The amino acids act as support by strengthening and fortifying the skin’s barrier. Luxury K-Beauty brand d’Alba Piedmont’s Peptide No Sebum Repair Cream comes with the same base of low molecular peptides and 20 essential amino acids and minerals, which work to help firm and improve skin elasticity, wrinkles, and fine lines. It’s formulated in a lighter consistency with calamine powder and BHAs to help fight acne, gently remove old skin cells, target sebum, and soothe sensitive skin.\" Price: $36.60 for 30ml. Dupe for: SK-II RNA Power Anti Aging Eye Cream, $149 for 15g. Why it's just as good: \"SKII’s RNA Power Anti Aging Eye Cream is a luxurious eye cream made on a base of galactomyces ferment filtrate. It is packed with skin conditioning ingredients but at nearly $150, it doesn’t come cheap. Cult K-Beauty favourite Benton Fermentation Eye Cream is made with the same star ingredient as SKII’s version, and it also works to hydrate, repair, and protect the skin from damage. At only $36.60, it’s basically free. Packed full of skin-friendly fermented ingredients and ceramides, Benton Fermentation Eye Cream gently cares for the delicate under-eye skin while also realising anti-aging benefits.\" Price: $20.95 for 70g. Dupe for: Dermalogica Daily Microfoliant, $89 for 75g. Why it's just as good: \"In Korea, Tosowoong’s powder wash reached cult status years ago, but when compared to Dermalogica’s popular Daily Microfoliant, there’s no denying both products have similar star ingredients and a similar texture. Both contain papain, licorice extracts and starches. However, Tosowoong’s Powder Wash works for sensitive, hypo-allergenic and acne-prone skin, as it preserves the skin’s delicate acid mantle, meaning its gentle formula is better suited for daily cleansing. Did I mention it’s only a quarter of the cost? With an ideal pH of 5.5, this enzyme wash cleanses skin thoroughly, leaving no residue behind, so that faces look and feel perfectly fresh and clean.\" Feature Image: Supplied/STYLE STORY. Do you know of a great beauty dupe? Tell us about it in the comments below! ",
    "datetime": "2020-03-22T10:45:24+00:00",
    "url": "https://www.mamamia.com.au/korean-skincare-australia/"
}