{
    "title": "Korean Personal Care Giant Acquires The Crème Shop in $120 Million Deal | BoF",
    "text": "Agenda-setting intelligence, analysis and advice for the global fashion community. LG Household and Health Care will take a controlling stake of 65 percent in the beauty company for about 148.5 billion won ($120 million) with an option to purchase the remaining share in five years. US-based K-Beauty player The Crème Shop will join LG Household’s portfolio of more than 20 beauty brands, including The History of Whoo, Nature Collection and The Face Shop. The deal marks part of what the South Korean company says is its strategy to expand its presence in North America where interest in K-pop and K-content is burgeoning. The deal follows LG Household’s acquisition of The Avon Company in 2019. Founded by two Korean Americans, Theresa and Lawrence Kim, The Crème Shop opened in Los Angeles in 1988, catering to young Americans interested in K-Beauty culture. According to Pulse News, The Crème Shop has experienced average sales growth in the US of 30 percent year-on-year over the past three years. Learn more: K-Beauty’s Golden Age Is Ending. What Comes Next? Their 10-step routines, snail serums and sheet masks took the world by storm 10 years ago. Now, Korean beauty brands are facing a fiercely competitive market and need to think outside the box.  © 2023 The Business of Fashion. All rights reserved. For more information read our Terms & Conditions As strategics like Unilever and L’Oréal divest from once-core lines, a more selective approach to M&A is underway. Welcome to Haul of Fame, a weekly roundup of the biggest beauty moments of the week, why they matter … and why some of them might not, even though they sure are gorgeous. The platform’s freewheeling approach to e-commerce has opened the floodgates for established labels, grey-market sellers and influencers to entice beauty shoppers to buy. But with little oversight over fake product listings, brands must negotiate how much control they want to give over to the app. Gwyneth Paltrow’s lifestyle label is introducing an accessibly priced beauty line at Target and Amazon. The essential daily round-up of fashion news, analysis, and breaking news alerts. Our newsletters may include 3rd-party advertising, by subscribing you agree to the Terms and Conditions & Privacy Policy.   ",
    "datetime": null,
    "url": "https://www.businessoffashion.com/news/beauty/south-korean-personal-care-giant-acquires-the-creme-shop-in-120-million-deal/"
}