{
    "title": "Korean success story in UAE: From a grocery, this couple now run café, and K-beauty store in Dubai | Yourmoney-community-tips – Gulf News",
    "text": "How a second generation Korean expat and his wife built their family business in the UAE Since catering to not more than 1,000 Koreans in the early 1990s, an expat couple originally from the East Asian nation has been expanding their Dubai-based family business from selling staples to now burgers and beauty products, helping them build their reach in a growing Asian community in the UAE. Currently run by second generation Korean expatriate Chang Sup Shin and his wife Kate Park, they have branched out from managing a supermarket to now running a café and a K-beauty [Korean beauty] store, while also launching a burger brand during the pandemic. This is because the couple entrepreneurs have learnt along the way that in order to grow their family business, “the need to pivot and reinvest” in products, processes and people, is integral. In 1992, Shin was seven when his family moved to the UAE. His father helped a large Korean conglomerate set up their office in Dubai and handled their textile division. After a while when the company asked his father to move back to Korea, he took a decision that would change the future of his family. He quit the company and stayed on in the UAE setting up his own textile company in Murshid Bazaar in 1995 – becoming the first Korean to do so. “I grew up around the Al Ghurair Centre area, which was the heart of Dubai in the 1990s. It was quiet and the Korean community wasn’t as large as it is today,” Shin recollected. In the early 2000s a large section of Korean expatriates moved to areas such as Greens and Dubai Marina. With only one Korean supermarket in Bur Dubai [at that time] Shin’s father thought it was an opportune time to set up a Korean supermarket in Al Barsha to cater for customers in and around new Dubai. In 2008, he set up a 2,700 square feet Korean supermarket called ‘1004 Mart’. After completing his higher studies in the US and travelling across Japan and a few other Southeast Asians countries Shin joined the family business around 2010. “I started expanding our product range including food products from the Far East and Southeast Asia alongside Korean foodstuff. That was our first pivot and since then we’ve been growing organically,” he shared. “Initially we started by selling Korean food products to Koreans but gradually expanded the range and our customer base. As we started noticing an increased appetite for not only food but Korean pop music and drama among non-Koreans, coupled with a growing interest in Japanese and Thai food we spent time, effort and money to build a strong non-Korean customer base. We also expanded our sales channels by supplying Asian food products to restaurants besides operating our offline and online stores. Overall, we’ve fared well by growing organically in a phased manner.” Creating a point of difference in a competitive market and a crowded category like foodstuff is crucial. A combination of factors including diverse product selection, delightful customer experience, pleasant aesthetics and a convenient location worked in favour of Shin’s business. But doing all this requires constant investment. According to Shin, owning retail space, importing and storing over 2,500 items as stock or inventory is expensive and challenging. Besides the fact that their operating cost is significant, just setting up and fit-out of their current retail space cost roughly Dh5 million. Add to that rent (store and warehouse), inventory, payroll, delivery, logistics, car loans and it’s a whopping Dh20 million-plus to begin with. “Thereafter every year we invest significantly to grow the business. To do business worth Dh4.5 million per month, we must ensure having stock for three months in advance. That requires a minimum investment of Dh10 million. Especially since the lead time on imports has increased from two to three months due to post-pandemic container issues,” Shin stated. “If a bootstrapped small and medium-sized enterprise (SME) is considering getting into the food import business instead of investing capital in a warehouse, consider working with a third-party logistics [3PL] company that can hold a couple of containers. Consider using cost-effective online tools for accounting, inventory management etc. “Moreover, since any food business [like ours] is investment intensive and requires being cash flow positive to operate successfully, it’s crucial to build trustworthy relationship with banks to create the right financing channels. On the other hand, any retailer that transacts a lot using a card machine like us is stable income for the bank. In return banks offer us favourable interest rates on loans and lower commission rate on card transactions. Healthy cash flow, consistently high number of transactions and a credible record are some crucial aspects to build trustworthy relationship with banks.” There are several moving parts of running a business making it a constant learning curve. From understanding cash flow, coping with supply chain disruption and making clear forecasting a business must consider several things. “Forecasting is crucial to avoid over-investing in products. It’s important to clearly forecast how much of a certain product can be sold in a month. Doing that requires in-depth market research to understand what will drive demand. Making it important to interact with customers to gauge interest towards product categories and consumption patterns to do accurate forecasting therein optimising cash flow,” Shin elaborated. “Over the past three decades our family business has gone through several phases of transformation. If anything, each such phase taught us that pivoting not only helps businesses to face and understand challenges but also create a better customer experience.” For instance, noticing a growing interest for K-beauty in the UAE, the couple relocated from Al Barsha to The Greens in 2018 and rebranded the supermarket to ‘1004 Gourmet’ as the store also housed their café ‘Kaffe Bloom’. They also launched their K-beauty brand called ‘Lamise Beauty’ in the available space. “We leveraged our existing logistics, sales channels and marketing knowledge to build the beauty business. During the pandemic we started a burger brand called Ugly Burger with an investment of Dh50,000 to buy equipment and hire staff while leveraging a friend’s existing kitchen space. Now we are growing the brand, coupled with a pop-up dumpling and noodle concept called Ugly Noodles. Pivoting has helped us to diversify our business.” Another pivotal area for a business is customer acquisition and retention, which requires allocation of marketing budget. “While that budget is different for every business, we live in a digital-first world that necessitates understanding of how social media algorithm and online advertising works. There are several good and inexpensive online resources that start-ups can invest in to get a better understanding of how digital marketing works,” Shin added. Get Breaking News Alerts From Gulf News We’ll send you latest news updates through the day. You can manage them any time by clicking on the notification icon. Dear Reader, This section is about Living in UAE and essential information you cannot live without. Register to read and get full access to gulfnews.com By clicking below to sign up, you're agreeing to our\nTerms of Use\nand\nPrivacy Policy Forgot password or ",
    "datetime": null,
    "url": "https://gulfnews.com/your-money/community-tips/korean-success-story-in-uae-from-a-grocery-this-couple-now-run-caf-and-k-beauty-store-in-dubai-1.1662132728158"
}