{
    "title": "Korean beauty explained - why it's taken the world by storm | CNN",
    "text": "The Korean beauty market is among the top 10 global beauty markets. Korea is one of the few countries with \"functional cosmetics.\" There’s face powder in panda palettes, hand gel in gummy bears and bubble tea sleeping packs. Often packaged in bright colors and decked out with cartoon characters, Korean beauty products are too cute to ignore, but they also provide some health benefits. It’s “skin-tertainment,” said Christine Chang, who co-created the Glow Recipe brand to bring Korean beauty products to the American market. She and partner Sarah Lee travel to South Korea multiple times a year to find new products and are repeatedly “blown away by the new innovation in the market.” Complete Korean cosmetics shopping guide The Korean beauty market is among the top 10 around the world, with an estimated worth of over $13.1 billion in sales in 2018, according to Mintel, a global market intelligence agency. Facial skin care products alone make up half of the total market share and are projected to reach $7.2 billion by 2020. And one in five facial skin care launches in South Korea, the agency reports, is actually a mask. “For a long time, France and Japan were considered a symbol of cosmetics business around the globe,” said Ryan Park, who founded the Korean beauty brand Whamisa in 1999. “Korea was able to catch up with them within a very short time thanks to the balance of its accumulated fundamental industry, chemistry, bioscience and Korean Wave culture.” K-pop group's record breaking album conquers three continents The Korean wave, called “hallyu,” is about the spread of South Korean pop culture and how all things Korean – food, dramas, makeup, movies and music – have propagated throughout the world through social media and online platforms. A lot of this wave radiates off of the music, K-pop, with artists like PSY, Wonder Girls and BTS whose edgy look, style and sound attract global fans. Simply put, consumers want the skin of Korean celebrities, who supposedly use it too, said Dr. Soyun Cho, a dermatology professor at Seoul National University. E-Commerce Guide by CNN Underscored: Your guide to using Korean skin care products Korea is also one of few countries with “functional cosmetics,” Cho said, a label allowed by the Korea Food and Drug Administration for anti-wrinkle, elasticity-boosting, pigment-fading and sunscreen properties. This has fueled more research for better products, she said. “Korea has become the test bed of many world-famous cosmetic companies,” said Cho, who has studied the behavior behind cosmetic use in Koreans. “Korean consumers are very knowledgeable about different cosmetic types and ingredients, and they are picky. They are early adapters of new products, and cosmetic trend comes and goes at a very fast rate in Korea, partly due to the ubiquitous high-speed internet and heavy use of social media. “Young Korean women are very keen to try the new trend, and they don’t want to be left out of the loop when all their friends are using a new product.” To showcase new Korean beauty products, Chang co-founded Glow Recipe in 2014 after working at Kiehl’s in global skincare marketing and at L’Oreal in Korea and the US. “A key strength of K-beauty products is the experience,” she said. “Formulas often have enjoyable, unique textures or flexible usage methods.” Chang cites the use of aloe instead of water for intense nourishment, applying “rubber masks”  – instead of paper sheet face masks  – for better nutrient absorption and fermented botanicals for more efficient absorption into the skin. Fermented botanicals contain micro-organisms that release enzymes that ferment and break down molecules into the raw material, resulting in the creation of new substances that benefit the skin, explains dermatology professor Cho. Fermentation helps the skin absorb the product better due to the smaller molecular sizes, and it also reduces skin irritation, because the fermentation process neutralizes potentially toxic substances like pesticides. Another example of innovation is the combination of beauty balm cream, BB cream, with an air cushion compact, Cho said. Although these creams were created in Germany, Korean companies popularized the merging of foundation, moisturizer, anti-aging cream, whitening agent and sunscreen in one product. The air cushion compact “wicks the formula off a sponge and effortlessly applies evenly onto the face for that dewy, no-makeup makeup look,” Chang said. Many of these products follow that “baby-like” look with “cosmeceuticals,” Cho said, combining cosmetics and therapeutics with such natural ingredients as traditional Korean herbs and plant extracts. Snail slime has also been a popular component in many Korean beauty products, because it reportedly improves skin imperfections like scars, wrinkles and acne. Glow Recipe worked with Whamisa on a green tea line with antioxidants and botanical extracts that melts makeup and removes pore-clogging impurities. Its star product, the Watermelon Glow Sleeping Mask, sold out eight times with the French cosmetics giant Sephora last year and had a wait list of over 20,000 on the Glow Recipe website. The Soko Glam e-commerce site helps people find Korean skin care and opened a pop-up shop in Bloomingdales in New York last year. Co-founders and spouses Charlotte and David Cho also recommend products with botanicals like E Nature Birch Juice Hydro Cream Sheet Mask. “Our Birch Juice Hydro line formulas completely replace water, commonly used as the main ingredient for other skin care products, with birch sap, which is the liquid that is tapped straight from Japanese birch trees,” E Nature’s Anna Kim said. “Birch sap has been deemed the next ‘coconut water’ because it is full of electrolytes and antioxidants, thus providing the skin with intense hydration and soothing abilities when it is applied.” The brand SkinFood takes this even further with “food cosmetics,” applying the belief that “you are what you eat,” with products that contain natural food extracts rather than artificial preservatives. Their research finds ingredients by “eating, applying and studying foods,” said Jae-mo Park from SkinFood. He recommends their products with black sugar, like Black Sugar Mask Wash Off, which softens the skin. Seoul National University’s Cho says many of these Korean makeup products are beneficial because they contain sunscreen filters with high SPF, which help protect the skin from the sun’s harmful rays. But as for the effectiveness of their botanical ingredients, they are “basically all antioxidants, which have anti-inflammatory and anti-aging functions, albeit weak.” Some ingredients may be beneficial, she said. Black sugar can leave the skin surface more hydrated, and birch sap can reduce inflammation and retain moisture. However, while rubber masks help with absorption, she doesn’t believe a facial mask is any more beneficial than a good moisturizing cream but can be “a fun way to pamper yourself for 15 minutes.” Your guide to better skin using Korean skin care products Besides health benefits, Korean beauty products also tout eco-consciousness. E Nature uses packaging that is recyclable, and Innisfree incorporates eco-friendly ingredients, such as organic green tea and camellia flower petals, grown in Jeju Island in Korea. As for the future of Korean beauty products, they’re only going to get better, Cho said. E-Commerce Guide by CNN Underscored: Subscribe to Beauteque Monthly for the best in Asian beauty and skin care “As all Asians age with wrinkles and age spots, multifunctional cosmeceutical products with whitening and anti-aging properties all in one will continue to be in high demand,” she said. “With continued advancement of cosmetics science and technology, new products with more innovative and functional properties will keep coming out.” © 2023 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network. ",
    "datetime": "2018-04-12T00:28:14Z",
    "url": "https://www.cnn.com/2018/04/11/health/korean-makeup-beauty-health-benefits/index.html"
}