{
    "title": "Korean Beauty Lash Trick - Q-Tip Eyelash Curler | Marie Claire",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. Get ready to play with fire. Who among us, really, isn't constantly striving for Kardashian-level lashes? And to get there, we all have torture chambers' worth of eyelash-curling devices in our beauty bags. But none are as interesting as what Korean women—AKA our makeup messiahs—have dreamed up as a hack. In an interview with Byrdie, Insider Beauty founder Angela Kim revealed that the latest K-beauty trick entails cutting off the two ends of a wood Q-tip, heating up the remaining stick with the flame from a lighter, and then using it to \"lift\" the lashes from below. Note: A regular Q-tip with a cardboard or plastic stick will be, um, a bit of a fire hazard, so make sure you use the wood kind. When Byrdie's editor put it to the test, she found that when used in tandem with a traditional, stainless steel curler, as well as mascara, it was like a push-up bra for her lashes that lasted all day. Enticing, no? It was like a push-up bra for her lashes that lasted all day. And confession: Eyelash curlers, particularly electric ones, kind of freak me out. They make me feel like I'm one spastic movement away from losing every last lash. (Not unlike Miley's recent misfortune—yikes.) So even though this involves heat, its non-clampy nature is totally appealing. Not to mention, I can get even more mileage out of my Glossier lighter 😇. To familiarize yourself with how it works, skip to the 5:10 mark of this K-beauty blogger's test drive: Follow Marie Claire on Instagram for the latest celeb news, pretty pics, funny stuff, and an insider POV. Celebrity news, beauty, fashion advice, and fascinating features, delivered straight to your inbox! Lauren is the former beauty editor at Marie Claire. She love to while away the hours at coffee shops, hunt for vintage clothes, and bask in the rough-and-tumble beauty of NYC. She firmly believes that solitude can be a luxury if you’ve got the right soundtrack—that being the Rolling Stones, of course. The streaming service bought the rights to \"Glossy,\" by Marisa Meltzer. By Sophia Vilensky It’s called CE NOIR—and it’s available for pre-order. By Samantha Holender “It’s certainly been weird.” By Rachel Burchfield Healthy strands, here we come! By Gabrielle Ulubay Keep it fresh, my friends. By Gabrielle Ulubay Go ahead and kiss your messy lash glue goodbye. By Hana Hong Rapunzel hair, coming right up. By Gabrielle Ulubay The gift that keeps on giving—literally. By Julia Marzovilla Remember: Your curls are your crown. By Gabrielle Ulubay This is how we roll. By Samantha Holender The best part? They’re so easy to apply. By Samantha Holender Marie Claire is part of Future plc, an international media group and leading digital publisher.  Visit our corporate site.\n©\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\nNew York,\nNY 10036. ",
    "datetime": "2015-11-16T09:18:27Z",
    "url": "https://www.marieclaire.com/beauty/news/a16977/korean-beauty-lash-trick/"
}