{
    "title": "Korean Eyelash Curling with Fire - Using Fire to Curl Eyelashes | Teen Vogue",
    "text": "By Marissa DeSantis We've never met a Korean beauty trend we didn't love, until now. We're beyond happy to try out any of the trending Korean skincare products on our faces, from sheet masks to serums infused with snail mucin (that's code for snail guts), but we have to draw the line somewhere, and bringing fire into your beauty routine pretty much does it for us. According to Mic, some Korean women are using open flames and tiny wooden sticks to help give them lengthened, curled lashes that last all day.\n \nExplaining how difficult it is to get her lashes to curl, a Korean YouTube Vlogger who goes by the name of T0inky, describes the surprisingly popular fire lashes technique. Her method, which pretty much goes against everything Smokey Bear taught us, involves torching a small wooden stick in flames, waving it in the air for a few seconds to \"cool\" and then placing it by your actual eyeball to curl your eyelashes. Yeah, we'll just stick to our regular eyelash curlers and hope for the best, or throw on some falsies if we're really feeling crazy.\n \nSkip ahead to the 5-minute marker if you want to see the horrifying how-to, and please resist trying this at home. Related: How Part of One Girl’s Halloween Costume Might Make Her Partially Blind By Kara Nesvig By Kara Nesvig By Kara Nesvig By Sara Delgado More from Teen Vogue Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Teen Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "datetime": "2015-12-18T15:38:47.601Z",
    "url": "https://www.teenvogue.com/story/fire-eyelash-curling-korea"
}