{
    "title": "Korean Beauty Trends 2017 | POPSUGAR Beauty",
    "text": "Updated on 7/28/2017 at 2:25 AM Charlotte Cho is the editor in chief of K-beauty content site The Klog, which is dedicated to covering the innovative and fascinating world — and products — of South Korea. We are delighted to share her insights as a contributing editor on POPSUGAR Beauty. I'm looking forward to another year of amazing K-beauty innovations and trends that will take the global beauty industry by storm. As I have done in years past, here are my predictions for K-beauty in 2017 that will keep everyone on their pretty little toes! Last year, I predicted more makeup products fused with the benefits of skincare. Since then, I have already seen the rise in the \"base makeup\" category, along with developments in the cushion compact category. I expect more development here, starting first with cushion compacts that will have more options for various skin types and skin tones, plus some new innovations in the actual cushion technology (i.e. filter screens, mochi-based cushions). On a related note, I'm seeing more and more Korean beauty bloggers, the rise of which is influencing street style makeup trends for the millennial generation in Korea. You'll be surprised to know that they are actually going away from the \"no makeup, makeup look,\" and trending more towards the Western style of makeup, from contouring (yes, contouring!) and bright, vivid colors in eye shadows, brows, and lips. With this change, I'm excited to see how Korean makeup brands adapt to the trend and see if their color offerings will compete against the likes of color cosmetic powerhouses such as NYX, Urban Decay, and Tarte! As much as the 10-step skincare routine may be the gateway to K-beauty, get ready in 2017 to focus on the skin on top of your head (your scalp!) to maintain voluminous and silky smooth strands. Both Korean men and women are extremely invested in the health of their hair. Trust me, you'd be met with shock and horror if you told the average Korean girl that you don't usually use hair essence. Hair products from Korea are getting more acknowledgment, especially those from brands featured in top hair salons in Korea. It's not only about creating whole entire product categories, but it's also about making existing categories so much better, effective, and convenient! Case in point: Korean sheet masks are not limited to microfiber and hydrogel any longer. Now, you'll see thin, clay-based sheet masks that look exactly like a regular sheet mask. This clay sheet mask eventually hardens after the 20-30 minutes on your skin to remove excess oil and impurities. Then you peel it off and rinse for one simple, easy application and cleanup that traditionally messy clay masks don't offer. Try it: MANEFIT Beauty Planner Lavender Sheet Mask Set ($10) In 2017 it's all about the natural ingredients from plants and natural sources found primarily in Asian countries that have been used for centuries to soothe, hydrate, and brighten the skin. Think yuza (or yuju) for its concentrated vitamin C properties, bamboo for its ability to hydrate, and royal fermented honey as a natural humectant. Let's not forget birch juice, which is slowly making its way into many Korean products as a nutrient-packed substitute for water. It's not just the ingredients that are important. It's also about the way your skin interacts with the ingredients (texture, consistency), as well as the efficacy of the ingredients after they hits your skin. Cosmetic scientists are finding ways to slowly release powerful vitamins and minerals throughout the day and figuring out how to maximize the benefits of the active ingredients. Leave it to Korea to push the limits of ingredients and make sure they work well for us. Chances are that by now, you've spotted a cushion compact or a sheet mask from a Western brand. Long story short, you'll be seeing companies around the world double down on not only Korean trends, but also opting to work directly with Korean manufacturers to launch new, innovative concepts first. K-beauty is disrupting the cosmetic brands out there and bringing more love to the entire supply chain of cosmetics in Korea from packaging to ingredients and to final production and formulation. Easy tip to confirm sneaking suspicion about the origin of the product: Flip the bottle or compact over and checking for the \"Made in Korea\" stamp. However, even that won't be reliable for long, as some Korean manufacturers are building out their factories stateside. Counterfeit K-beauty is very real. As the category rises in popularity, be wary of fake products out there. Unfortunately, there are many cases of this. Make sure you are getting your products from a source that works directly with the brands in Korea, like Soko Glam, and has done proper US labeling, as well as FDA registration. ",
    "datetime": "2017-01-09T22:40:08.000Z",
    "url": "https://www.popsugar.com/beauty/korean-beauty-trends-2017-42931892"
}