{
    "title": "Korean It-Girl Irene Kim Shares Her Beauty Tricks – StyleCaster",
    "text": "By providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. A post shared by Irene Kim ðŸ¦„ á„‹á…¡á„‹á…µá„…á…µá†« (@ireneisgood)   Korean model and social media star Irene Kim became a bonafide street style sensation last year, largely thanks to her shockingly bright multi-colored hair. Photographers couldn’t get enough her, editors were clamoring to find out who she was, and now major brands are taking notice: The Seattle native was recently named Estée Lauder’s Global Beauty Contributor, meaning she’ll impart her modern take on makeup and her social media savvy to one of the most esteemed brands on the planet. But how does Kim—who’s amassed over 600,000 Instagram followers—stay on top of her hair and makeup game? The 27-year-old had plenty of wisdom to share about how she keeps her skin on-point during long (we’re talking 24-hours-long) flights around the globe, or what she reaches for when cruising the K-beauty aisles. Related Stories 5 Korean Beauty Products on Amazon With Major Discounts Right Now 15 Places to Shop When You Want the Best K-Beauty Products Let’s talk day-to-day beauty. Which products do you have to use to start your day?\nToday’s a long day, so I made sure my skin was very moisturized and prepped, and my makeup stays on as long as possible—I’m so dehydrated from being on the plane. So, I did a double micro-essence thing where I [used] the toner ($95) and then I did the micro-essence mask ($67), which I’m obsessed with now, but I put it in the fridge, then put it on a cream, and then I put on sunblock. Sunblock is so important to me. I use Crescent White ($50). You travel so frequently – do you ever dare to whip out a full beauty treatment on the plane?\nI do. I’m always piling on moisturizer on top of more moisturizer. And then I always carry face mist or toner. Do you just apply it in your seat, and go for it?\nSometimes! I use anything really soothing on my face on the plane, and there is something about the water in the bathroom that I don’t want to use, so I’ll ask for water and like I’ll carry cotton swabs and I’ll wipe my face with that water. And then I’ll do a cream mask so it’s not so obvious.  With all that traveling, how do you keep your skin in check?\nI still do break out a bit here [points to her chin] and I think it’s just, I have to wait it out and make sure I don’t pick at it, because it’s very tempting. Sometimes after a hot shower, you know how the shower steams up, I’ll take a cotton swab and soak it in toner – like my rose water one or a face mist – and I’ll just place it on the break out area. I feel like that helps to soothe it down a bit. A post shared by Irene Kim ðŸ¦„ á„‹á…¡á„‹á…µá„…á…µá†« (@ireneisgood)  Okay, let’s talk about your hair. You just went shorter for Fashion Week, right?\nI did! I wanted a little bit of a change and then I went for cooler tones.  It’s been a whole lot of different colors at this point.\nRight?! Yeah, I didn’t know that I was going to end up shocking people with my hair. It was very organic—but it’s kind of made me Irene, whatever that means! It’s been my signature—I’ve had it for three years now—and it’s fun to change it. Do you have any tricks to maintain the health of your hair?\nI usually work with my hairstylist in Korea. I’m just like his doll, his living doll. Every two weeks I’ll go in for a retouch and if I’m super busy or have to wash my hair more, I’ll go in sooner. He also gives me hair treatments at the salon that help keep up the strength and I actually don’t use hair oil or conditioner, I just use moisturizer. I feel like you know, whatever you put on your face is good for your hair, right? As long as it doesn’t get too greasy. So you actually just use your face moisturizer in your hair?\nYeah, I’ll take any of the leftovers and put it right into my hair. Because some of the hair oils I think are too strong, and sometimes you get breakouts from them. I feel like that causes breakouts – and shampoos and things – so I stick to what I put on my face for my hair. A post shared by Irene Kim ðŸ¦„ á„‹á…¡á„‹á…µá„…á…µá†« (@ireneisgood)   Let’s talk Korean beauty. What are your favorite brands right now?\nI really like Innisfree for skin care because they have very good products for sensitive skin and it’s not overly scented at all. I don’t really like things that have too powerful of a smell, I just feel like it could be irritating to the skin. Etude House has great lip colors and lip tints, Tony Moly has great lip stuff too and eyeliner and things like that. Oh, and Skin Food! They have tons of products that smell really fruity and edible, like their sugar mask. Do you think the fun and quirkiness of Korean beauty packaging will trickle down to other markets?\nI think it should. With all the social media, and all the different platforms, if your product is very cute and pops, you want to take a picture – it just looks really fun. And lastly, heading into Fashion Month, do you do anything to gear up for the back-to-back events, health-wise? Any weird tricks up your sleeve to keep you healthy all the way through?\nBefore I travel I head to the gym every day just to keep up the balance of my body. Not to lose weight, but just to keep up my energy. I try to have a healthy balanced diet too, I have lots of fish and vegetables and I try to hydrate as much as possible and sleep as much as possible. And actually, my agent prepared this for me before I came here – it’s like red ginseng extract, so it’s an energy booster to take when you’re tired! By providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. By providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. ",
    "datetime": "2015-09-11T17:30:35+00:00",
    "url": "https://stylecaster.com/beauty/beauty/480736/irene-kim-beauty-secrets/"
}