{
    "title": "Korean beauty products and colorful selfie walls at Seattle's K Ba-Nana | king5.com",
    "text": "SEATTLE — A new store in University Village showcases the vibrant, innovative, and on-trend products of K-Beauty. K Ba-Nana features curated beauty products from Korea, some of which have never been available in the states. \"People would carry some sheet masks here and there, but we wanted to be the place for Korean beauty, where we can share knowledge about the products and what's in them,” said founder Liz Kang Yates. The K-Beauty trend is based on self-care products that are easy to use and fun to experience. Customers can buy everything from a skincare line made with egg yolks and vinegar, to gel nail stickers that stay on for 2 weeks. There are also 150 different kinds of sheet masks - used to hydrate, restore and tighten skin. Social sharing is also encouraged, so three colorful walls are dedicated selfie backgrounds. Kang Yates’ formative years helped inspired the store. \"I'm Korean and my parents moved here and went to the University of Washington,” she said. \"Every time I went (to Korea,) whether it was the stationary or the candy packaging when I was young, to growing up with the fashion, I loved everything Korean.\" K Ba-Nana is the first store of its kind in the country, and Kang Yates said many of the products use natural and organic ingredients. \"And then it's also in cute packaging so you're like, 'I love this!'\" she said. \"It makes you happy.\" K Ba-Nana is located inside U Village next door to Sole Food and Amour Vert. You can also follow them on Instagram. KING 5's Evening celebrates the Northwest. Contact us: Facebook, Twitter, Instagram, Email. Next up in 5 Example video title will go here for this video     In Other News Notifications can be turned off anytime in the browser settings. ",
    "datetime": null,
    "url": "https://www.king5.com/article/news/korean-beauty-products-and-colorful-selfie-walls-at-seattles-k-ba-nana/281-588473200"
}