{
    "title": "Korean Beauty Sun Care and SPF Facts - Coveteur: Inside Closets, Fashion, Beauty, Health, and Travel",
    "text": "When Korean skin care went mainstream, it shook up our beauty routines significantly. The oft-lauded 12 steps championed by K-beauty aestheticians, brands, and influencers have made us all rethink self-care and wellness, with more focus on gentle, effective, and hydrating ingredients that can help your skin achieve that revered glow. Sun care is especially key to the regimen—not only in your daily SPF (sun protection factor), but as a component of countless other high-performing skin-care products.“From toddler age, Korean people (and women especially) are taught that caring for your skin is part of taking care of yourself,” Peach & Lily founder and aesthetician Alicia Yoon tells Coveteur. “The aesthetics do matter, but it’s more about making sure your organs are healthy—we’re being taught how to care for our skin at the same time we’re being taught how to properly brush our teeth.” She stresses that K-beauty devotees are taught to wear SPF from a young age and carry that sensibility into adulthood. That mindset stands in contrast with the US, where the conversation around safe sun practices is changing, albeit slowly. In fact, according to a 2013 CDC study, fewer than 15 percent of men and 30 percent of women regularly use sunscreen on their face and body when outside for more than an hour. Says Yoon, “In Korea, it’s more of an ‘of course I wear sunscreen’ mentality. It’s ingrained, and there’s an awareness that sunscreen is such an important part of your health and taking care of yourself.”SOKO Glam founder Charlotte Cho considers sunscreen the last and arguably most important step in K beauty’s multi-step skin-care routine. “Sun damage is the leading cause of premature aging, such as fine lines and dark spots, and you can reap the benefits from being skin savvy at any age, especially when it comes to protecting yourself from skin cancer.” One of SOKO Glam’s best-selling sunscreens that has over 300 five-star reviews. Your new favorite SPF product that also hydrates, brightens skin, and firms. Boasts 20 botanical ingredients, an essence-like texture that glides on, and a broad-spectrum SPF 50+ PA++++ rating. A favorite of Charlotte Cho for its cushion innovation, which makes applying sunscreen on the go effortless. A cult-classic SPF, this formula blurs your skin just ever so slightly for a gorgeous filter-type effect. If you’re experiencing any sort of irritation (especially with the constant mask wearing outside), the added aloe in this cream will help to calm and reset your skin. ",
    "datetime": "2020-07-16T14:00:20+00:00",
    "url": "https://coveteur.com/2020/07/16/korean-beauty-sunscreen-facts/"
}