{
    "title": "Korean woman Hang Mioku injects COOKING OIL into her own face after being refused more plastic surgery | Daily Mail Online",
    "text": "By Becky Evans Published:  12:45 BST, 7 May 2013   |  Updated:  10:06 BST, 9 May 2013 655 View  comments A plastic surgery addict injected cooking oil into her face when doctors refused to give her any more silicone. Former model Hang Mioku has been left permanently disfigured following the DIY beauty treatment. After injecting an entire bottle of black market silicone into her face, Hang resorted to using cooking oil that left her face severely swollen and scarred. Scroll down for video  Hang Mioku's face was left so swollen by the silicone and cooking oil, left, that her own parents did not recognise her. Despite 10 operations her face is still severely disfigured, right Hang Mioku had her first procedure aged 28 when she was a natural beauty  Her plights was featured on Korean television and viewers donated thousands of pounds to pay for corrective surgery. During the first of 10 operations, surgeons removed 60g of silicone, oil and other foreign substances from her face and 200g from her neck.  However, Hang is still disfigured and she said she wishes she could have her old face back. Hang had her first procedure aged 28 and then moved to Japan where she had repeated treatments. She quickly became obsessed with having smoother and softer skin. Doctors eventually refused to carry out any more work on her after her face became noticeably enlarged. Hang moved to Japan to pursue her career, left, and continued to have injections that enlarged her face, right  She was so disfigured that her parents did not recognise her and her story featured on Korean television However, she managed to get hold of a bottle of silicone and a syringe to self-inject but when that ran out she resorted to use cooking oil. Her face was so altered that her own parents did not recognise her and local children also used to call her 'standing fan' because her face was so large compared to her small body. Numerous operations paid for by donations have managed to reduce the size of her face and neck but she is still significantly disfigured. Recently the former model was working in a recycled clothes shop, called The Beautiful Shop, and receiving handouts from the state. Television viewers donated money for corrective surgery and 60g of oil and silicone was removed from her face Despite 10 operations, Hang Mioku, pictured working at a recycling shop in Korea, is still very scarred   Share what you think The comments below have not been moderated. The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. We are no longer accepting comments on this article. Published by Associated Newspapers Ltd Part of the Daily Mail, The Mail on Sunday & Metro Media Group ",
    "datetime": "2013-05-07T12:45:05+0100",
    "url": "https://www.dailymail.co.uk/news/article-2320679/Korean-woman-Hang-Mioku-injects-COOKING-OIL-face-refused-plastic-surgery.html"
}