{
    "title": "Korean Makeup Artist Ko Won Hye Explains the Chok Chok K-beauty makeup trend | Allure",
    "text": "By Sable Yong No-makeup makeup is the oxymoron that just will not quit. And not that we are complaining — but if we were it would be about not knowing the right way to do it, if there even is a right way to do it, and if this is just some sort of Emperor's New Clothes situation. I mean... wearing makeup to make it appear as though you are not wearing makeup... isn't that the whole point of makeup? Does makeup even have a point? I'm going down a dangerous and befuddling spiral here. I like makeup. Makeup is great. That said, if what you seek is a radiant dewy complexion and you want it now, go to South Korea. Or just have a Korean beauty expert debrief you on how it's done. Koreans take their complexions to a degree of seriousness that warrants its own government branch I'm sure, but considering how nearly everyone follows suit, given the homogenous beauty conventions and standards, when it works it really works. Koreans call it Chok Chok — that dewy bouncy fresh-as-a-daisy skin glow. I met with Ko Won Hye, South Korea's celebrity makeup artist who works on some of the top K-pop and K-drama stars, specializing in makeup that makes a face look expertly FaceTuned to the untrained eye — you know, that \"oh this old thing?\" kind of effortless glow. The cool part is that Ko Won Hye has managed to perfect this art using any kind of makeup — not just Korean-brand cosmetics, even considering that she's created her own skin-perfecting skin-care line to help give your canvas a leg-up in the makeup department. After all, it's very much the K-beauty philosophy to perfect your skin first and then enhance with makeup. About those makeup tips though: Did I not just expound upon the tenants of Chok Chok? If you want to glow goddamnit, you've got to hydrate! That said, choose a moisturizer that fills your skin with hydration rather than an occlusive cream that just sits on top. Ko Won's line Lagom offers two — a lighter emulsion and a richer cream. You can also try any of these summer moisturizing picks — try layering them if you really want to up the Chok Chok. Also, do not skip sunscreen. Lagom has one that Ko Won says she uses on every shoot, no matter where it is. Double-negative — tricky! What it means is that face mist is your friend. The key to dew is actual dew, so you may as well dew it up with your face mist of choice. Lagom has a face toning mist, which helps to balance pH but also veil the skin in hydration. In between each layer of makeup application, she mists to set and allow the makeup to further sink into your skin for a natural finish. Moisturizer — mist — foundation — mist — concealer — mist — blush — mist — keep up now. If you're going to contour, you pick one feature and go with that, according to Ko Won Hye. Koreans typically choose one product and one feature to sculpt — the jawline, the cheekbones, etc. If you're going to use a contour stick to shade and sculpt, then that's that. If you're going to highlight the high points of your face instead, then you wouldn't use a contour stick or blush. One or the other. Blush placement is a tricky thing since it tends to differ for everyone, depending on face shape. However, Ko Won Hye's blush strategy is about making the cheeks look bouncy and awake — dust blush on the apples of cheeks, nearer to the nose than you'd initially expect — for an extra youthful flush. Straight brow or no, brows are left quite natural — just a little brush up and soft definition with pencil stokes, none too precise. There shouldn't be any hard edges, just a bit of a deeper contrast to your natural face framers. Take cues from the ever popular gradient lip look, but with that \"French girl\" twist, which makes it all the more effortless and natural-looking, the blooming blossom lip makes your lips mimic the look of flower petals. Apply color to the center of lips and brush outwards, blurring and blotting the edges for a very soft focus look. Instant plumpness. Never not be misting! See Ko Won Hye in action for Allure Korea: More K-Beauty: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Sarah Han By Sarah Han By Angela Trakoshis By Dianna Mazzone More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2017-06-22T22:12:03.555Z",
    "url": "https://www.allure.com/story/how-to-do-chok-chok-korean-beauty-no-makeup-makeup"
}