{
    "title": "Korean beauty retailer Tonic15 opens second London pop-up for 2022",
    "text": "A selection of curated workshops and experiential events will also take place at the retail space throughout the remainder of 2022. Korean beauty retailer Tonic15 opened a retail pop-up at the Angel Central shopping destination in London on 6 October. \n\r\nThe beauty platform has previously hosted a stand at the ‘East in Angel’ festival in May 2022, an event which celebrates Korean and Japanese culture.\n\r\nTonic15 said the outlet will remain open for the remainder of 2022.\n\r\nK-beauty brands such as CORSX, Klairs, Dr Ceuracle and Aromatica feature at the 801sqft store, which was designed by the group’s in-house team.\n\r\n“Following our successful pop-up during the East in Angel festival in Islington, we were able to captivate the local community and share the attraction of Korean beauty,” said Jin Kwon, founder of Tonic15.\n\r\n“We are thrilled to return to the destination and open a store in such a prominent location and continue to showcase the best of Korean beauty and provide exciting workshops for consumers.”\n\r\nA selection of curated workshops and experiential events will also take place throughout the remainder of 2022. \n\r\nCBRE Investment Management, which owns Angel Central, said it saw an opportunity to provide Tonic15 with a dedicated space after its successful pop-up earlier this year.\n\r\n“The launch of Tonic15 demonstrates our successful strategy in providing unique brands and experiences for our local community, and how these activations continue to deliver for months ahead,” added Ciara Daffy, Asset Manager at CBRE Investment Management.\n\r\n“With community remaining front-of-mind, we are confident that this store will be yet another success.” Through digital, live and print products, Cosmetics Business informs and inspires business leaders and decision-makers around the world. With a digital-first strategy, the Group’s Editors write breaking news, product releases, technical papers, innovation features, trend reports and live content agendas covering the entire industry from ingredients and packaging to regulation, retail and marketing. ",
    "datetime": null,
    "url": "https://cosmeticsbusiness.com/korean-beauty-retailer-tonic15-opens-second-london-pop-up-for-2022-204154"
}