{
    "title": "Korean brand Sulwhasoo to open its first store in Paris - Premium Beauty News",
    "text": "Amorepacific Group has announced that its Sulwhasoo brand will open an exclusive store in September 2017 in Paris Galeries Lafayette, one of France’s biggest department store chains. Already one of the giants of the Korean cosmetics industry, Sulwhasoo aims to introduce its brand philosophy to customers in France.  The Korean cosmetics giant seeks to leverage the K-beauty trend that is steadily transforming beauty standards among women around the world. In addition to exlusive offline store in Galerie Lafayette, Sulwhasoo will also be available through the department store’s online mall. Sulwhasoo will introduce a range of its most important products, including the First Care Activating Serum EX, one of the company’s best selling products worldwide, as well as top-selling Concentrated Ginseng Renewing Cream EX, an anti-aging cream. The new store at Galeries Lafayette will be designed with Korean traditional herbal medicine as a key motif, displaying heritage ingredients such as ginseng to showcase the brand philosopy to customers in France. According to Amorepacific, the new store in Paris enables Sulwhasoo to gain a foothold in the broader European market as a global brand, helping to expand the company’s leadership beyond its base in Asia and the success that it has already found in other large markets like North America.  Starting with Hong Kong in 2004, Sulwhasoo has opened some 200 stores in 11 countries, including China, Singapore, Thailand, Indonesia, Malaysia, Taiwan, Vietnam, the US, and Canada. The Chinese market has stood out for especially strong sales, with annual growth coming in at 50% every year. Amorepacific is currently focused expanding internationally with its five global champion brands, Sulwhasoo, Laneige, Mamonde, Etude House, and innisfree. The company is accelerating its effort to add marketshare around the world as it finds new growth momentum. In addition, it will strengthen its foothold and facilitate global expansion in Asia and North America, while it prepares to enter Middle East and West Europe. The annual premium and luxury packaging trade show broke its attendance record for its 2023 edition, which was held... The expression “Beauty Tech & Skincare” now marks the entry of tech into the beauty sector. Several major brands offer to decode the... The quest for youth has existed for centuries, despite the inevitable effects of time on the body. Research shows that skin aging in... The quest for “in-and-out” beauty is gradually gaining ground in Europe, North America, and Brazil. This form of holistic beauty is meant... © 2023 Premium Beauty Media ",
    "datetime": null,
    "url": "https://www.premiumbeautynews.com/en/korean-brand-sulwhasoo-to-open-its,11604"
}