{
    "title": "Korean Brands Edge Out European Competition in China",
    "text": "Korean beauty brand Innisfree is one of the most popular foreign beauty brands in China. (L2) This article was published earlier in our weekly newsletter. Sign up through our “Newsletter Sign Up” box on the right. With a K-pop obsession and love for traveling to South Korea, Chinese consumers’ demand for Korean products is creating big competition for Western brands in the areas of beauty and fashion. Korean cosmetics exports to China surged 250 percent last year, and accounted for almost one-fourth of all of China’s imported cosmetics. This has caused a decline in Western brands’ market share of foreign beauty products in China, which decreased by 4.8 percent for skincare and 3.8 percent for color cosmetics in 2014. In addition, Korean fashion labels are becoming big business in China—Lane Crawford offers several Korean menswear brands like Woo Young Mi and is planning to start stocking Korean womenswear, according to a Reuters report. The ability to leverage Korean celebrities and TV shows—which are massively popular in China—has been one of the major reasons cosmetics brands have been able to surge ahead, according to a recent report on Korean beauty brands in China by L2. For example, Laneíge has been launching promotions with spokesmodel and Korean drama star Song Hye Ko since 2008, and recently saw a significant sales boost for a lip product that was featured in the show in which she stars. Meanwhile, Innisfree, one of the most popular Korean beauty brands in China, had a wildly successful “Summer Love” campaign in 2015 featuring Korean influencers Lee Minho and Yoona that saw an average of 181,000 views per video on Youku. While Korean celebrities are also frequently used by Western brands for marketing in China, L2 finds that Korean brands also have an edge in the tech arena. According to the report, Innissfree is the most-searched beauty brand on Baidu, coming in ahead of all French brands thanks not only to its viral celebrity-filled campaigns but also to its focus on technological development. For example, the brand offers a gamified omnichannel loyalty program as well as e-commerce through both Tmall and a standalone site that allows users to sign in through Weibo, QQ, or Alipay. Meanwhile, Laneíge is the dominant beauty brand on Weibo, with more average monthly mentions than any other beauty brand. There are several key things Western brands can learn from Korean success stories, according to the report. First, when searching for KOLs to influence the China market, don’t forget to expand beyond China and leverage the influence of Korean star power. In addition, brands can look to build their presence on e-commerce sites that are “prioritizing popular Korean brands.” Product selection is key as well, with the need for Western brands to provide more “innovative, competitively priced products targeting Asian-specific consumer needs,” especially when it comes to beauty.  Consumer Insights, Market Analysis china, china luxury, cosmetics, innisfree, k-pop, korean brands, korean cosmetics, laneige, Luxury © 2023 Herlar, LLC. All rights reserved. Jing Daily® is a registered U.S. trademark of Herlar, LLC. Sign up for our daily newsletter to unpack the business of luxury in China. Gain insights, analysis, and breaking news from our on-the-ground reporters. Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. ",
    "datetime": "2016-04-29T11:29:58+00:00",
    "url": "https://jingdaily.com/korean-brands-gaining-growing-edge-european-competition-china/"
}