{
    "title": "Korean Skin Care: Routines & Products You Need to Know About",
    "text": "The K-Beauty pioneer offers an exclusive preview of PIBUU, her encyclopedic new Korean beauty website. REWrite When Harvard Business School graduate Alicia Yoon founded Peach & Lily{: rel=nofollow} in 2012, there was little international fascination surrounding Korean skin care. Clearly, things have changed: Today, American beauty lovers can’t get enough of all things K-Beauty. To satisfy the craving, Yoon launched PIBUU{: rel=nofollow}, a site devoted to all things Korean skin care. To Yoon, it was important to provide people with not just Korean products, but reliable information, as well. So she created PIBUU (fittingly, it means “skin” in Korean). The site provides in-depth updates on innovations, a guide to skin-types and various best practices, an ever-expanding ingredient glossary, and a collection of personal skin stories (“skinterviews”). “We want to make it easy, convenient and interesting to learn about one’s skin and how to best care for it,” says Yoon. “In the U.S., there are so many in-depth conversations about personal approaches to fitness and nutrition, but much less about one’s approach to skin care.” Here, the forward-thinking aesthetician and entrepreneur answers our most pressing questions about Korean skin care routines and beauty. Alicia Yoon, CEO and founder of Korean skin care company Peach & Lily. Here are three easy things you can do! This is half the battle. Using an oil-based cleanser first (to remove everything) is incredibly important to draw out impurities that get easily trapped in pores, especially with excess sebum production. Oil casts out oil; not water. Following up with a water-based cleanser to remove all residue thereafter is also important. Essentially, cleansing skin thoroughly down to the pores each day, and not doing so in a way that damages skin or strips it dry goes a very long way in preventing bacterial infections and keeps the skin barrier strong. Well hydrated skin via humectant-rich products that draw moisture towards your skin not only helps skin not overcompensate with more oil production to combat the dehydration, but also creates a healthier skin environment overall. That means, skin’s cells function that much better in waste removal, sealing in moisture, keeping bacteria out (and also staying plumper). This is from personal experience. I have eczema-prone, dry skin, so acne was never a problem for me … until I was in my thirties. I did everything in the books: cleansing well, ample hydration, not touching my skin, clean towels and sheets, regular exfoliation. Those steps definitely helped a lot. However, it turns out that I was manifesting stress from a busy, urban lifestyle trying to juggle a lot of different things at once (I’m sure this sounds familiar to almost everyone reading this!) in the form of adult onset acne. I ended up doing a nutrition response testing program, and found out I needed to intake more minerals and vitamin B to combat the stress. So I did, and that cleared the remaining breakouts right up. In my case, the right diet really helped get to the root of the issue, but I still supplement with the right routine and skin care steps to make sure that my skin stays in the clear. Drinking a lot of water is great for healthiness, but that doesn’t directly deposit moisture to the skin from within. So, using a lot of products that are humectant-rich is what does the trick. In the world of Korean beauty, hydrating essences, serums and ampoules are incredibly important as they’re formulated to actually penetrate the skin and deliver these ingredients that will draw moisture to the skin from deep within. Blackheads are oil and dead skin cells inside pores that oxidized, which made them turn black. Scrubbing really hard won’t remove blackheads; it’ll only damage skin. Best bet is to use products that will help dissolve the blackheads or draw them out — reliable ingredients that help get this done include kaolin clay, AHA, BHA, salicylic acid or retinoids. Unfortunately, there are no shortcuts. The best kind of dewy glow comes from hydrated, well-balanced, healthy skin. To achieve that, the skin should be kept healthy. So proper cleansing, ample hydration, and enough vitamins, minerals and antioxidants. A well-balanced skin care routine that hits all these points — it doesn’t need to be ten steps long — really gets the job done. Just be sure to keep the skin care routine custom to your skin type; so if you have oily skin, using water-based, lighter textures that deliver the needed vitamins, minerals and antioxidants would be a better choice, and conversely, for dry skin types, using products with enough lipids/oils is important. Proper hydration to keep the skin environment healthy so that collagen doesn’t break down prematurely. Using products that include ingredients — peptides, kinetins, GAGs, snail mucin, glycolic acid to name a few — that help boost collagen production. And facial exercises! Keeping underlying muscles firm helps to keep face more taut with less sag. Prevention obviously works best — so ample SPF (about a quarter’s size worth for the face) with sufficient reapplication when you’re consistently out in the sun. If you’re already dealing with hyperpigmentation, my favorite ingredients to help lift off the dark spots are niacinamide, arbutin extract, snail mucin, and vitamin C. More steps and layers equals better skin care. It’s not about the number of steps you use, it’s about tailoring your skin care routine to fit your skin’s needs. As an example, I have anywhere between seven to fifteen (I know, it’s a lot) steps in my skin care routine depending on the season and circumstance of my life (if I’m jetlagged, I use more nourishing serums) because my skin is dry, eczema-riddled and this is the routine that works for me. My older sister, on the other hand, has all of three or four steps in her routine as she naturally has normal, very well-balanced, slightly thicker and stronger skin. With just these three or four steps, she’s been able to maintain incredibly healthy skin with a glow that everyone comments on. You just have to get to know your skin and figure out what works for you. Yes, it takes me about two to three times more steps than her, but that’s how I can achieve that glow. So don’t feel pressured to have so many steps in your routine — instead, focus on understanding what keeps your skin healthy and balanced. I always go to our family facialist in Seoul! I’ve grown up with her and she’s seen my skin through it all. She never tells me how much time she needs with me or what treatments she’ll be doing until she actually sees my skin that day. I clear my evening because sometimes I’m out in thirty minutes, and other times I’m there for three hours. Regardless, I always walk out visibly more radiant! She’s the ultimate skin-whisperer. Of course, because of Peach & Lily, I’m always researching, testing and learning and will check out all the latest treatments, spas, and innovations. But again, the power of personalization is what I think skin care is about. More than any of these cutting edge places, my family facialist is able to consistently achieve the results I want simply because she knows my skin incredibly well. Women in Korea definitely focus more on skin care than men in Korea as evidenced by the heavily skewing female clientele at most spas and skin clinics, as well as the skin care offerings you’ll find in retail stores. That said, the men in Korea are some of the most skin care-savvy and focused men compared to many other countries! My husband used to use rubbing alcohol on his face (so unbelievable!) before we met, but slowly he has adopted a skin care routine that is pretty impressive. The last frontier, though, is the double cleanse. He refuses. “Too time-consuming, plus, a bar of soap is more satisfying.” So, I found him a bar soap that isn’t drying, packed with amazing natural ingredients and oil-based so every oil-based impurity comes off (I think I deserve a pat on the back for being a great wife on this one). Stay tuned, this inspired me to curate these for Peach & Lily — coming to you this winter! Admittedly, most of what’s in my medicine cabinet is Peach & Lily products — when I spend months and months hunting down the best in Korea, I end up getting really attached to the products and after vetting them so rigorously, I want to use them because I know and trust the quality. Having said that, I also test a lot of non-Korean brands to see what else is out there and how brands compare against each other. And there are some non-Asian brands that I’ve also fallen in love with. I absolutely love the Cremorlab masks, particularly the Herb Tree Blemish Minus Calming sheet mask{: rel=nofollow} (the pink one!) because it’s so hydrating while calming skin, and I have been using our Peach & Lily{: rel=nofollow} sheet masks. It took 18 months, 2 labs, and 500+ iterations to finally formulate our dream sheet masks … and they’re pretty dreamy, I must say! Ginseng totally boosts circulation which gives skin a glow. Having said that, ginseng is not as great for those with too much body heat or high blood pressure according to nutritionists. There’s a deep understanding that skin is a reflection of overall health as well — not just skin health, but overall health. So there’s an understanding and movement to seek overall well-being, which refers to holistic health through a balanced and healthy lifestyle. I do find, though, that the focus for overall “well-being” is more on nutrition and not as much on exercise; though, there is a growing focus on working out and fitness. I’m not sure how this came to be, but it’s definitely a thing! Some say that it’s related to looking more youthful since as you age, your face may appear bigger (I suppose less firm skin and more sagging makes faces look bigger). Others say it’s because a smaller face makes the body seem leaner and taller. Still, others say that it’s because more dimensionality on the face is considered beautiful and that often will make the face look smaller. Whatever the reason, it’s a highly coveted beauty ideal! Treatments include: Facial massages that soften the facial muscles (“kyung-rak” massages) to help slim down the face. Facial massages that manipulate the fourteen facial bones via massages are also popular — even the slightest movement of one of the facial bones makes a big difference in how the face shape can look, so this is a popular treatment. Botox treatments especially on the masseter muscle to slim down the jaws. Various facial exercises that help to keep muscles firm, circulation high and swelling down to create a tighter, smaller face. And of course, plastic surgery procedures that can be as extreme as shaving off parts of the facial bones to make them physically smaller. And finally, a lot of makeup tips center around contouring to create a smaller-looking face (versus a more defined face with sharp features). Cremorlab Herb Tea Pure Calming Mask, $6, peachandlily.com Joanna Vargas Daily Serum, $85, joannavargas.com Atopalm Daytime Undermakeup Moisture Cream, $20, peachandlily.com Lagom Cellup Gel To Water Cleanser, $18, peachandlily.com Cremorlab Shadow-Off Eye Cream, $48, peachandlily.com Dr. Dream Dream Age Radiance Powder Essence (set of 4), $110, peachandlily.com Tata Harper Regenerating Cleanser, $40, tataharperskincare.com Be The Skin Botanical Nutrition Power Toner, $29, peachandlily.com Shangpree Bitgoa Hue Essence Toner, $57, peachandlily.com Koh Gen Do Cleansing Water, $39, peachandlily.com Cremorlab Aqua Essence Water Fluid, $40, peachandlily.com Kicho Sheep Oil Cream, $58, peachandlily.com Drunk Elephant Virgin Marula Luxury Facial Oil, $72, drunkelephant.com Mizon Egg White Bubble Cleanser, $23, peachandlily.com Shangpree S-Energy Long Lasting Concentrated Serum, $120, peachandlily.com Atopalm Intensive Moisturizing Cream, $42, peachandlily.com Cremorlab Hydro Plus Snow Falls Water-Full Serum, $48, peachandlily.com Kicho Ultra Moisturizing Sun Cream, $36, peachandlily.com S.W. Basics Cream, $32, swbasicsofbk.com Watch W’s most popular videos here: ",
    "datetime": null,
    "url": "https://www.wmagazine.com/story/everything-you-need-to-know-about-korean-beauty-according-to-peach-and-lilys-alicia-yoon"
}