{
    "title": "Korean Beauty Has Hit the Mainstream. Now What? | BoF",
    "text": "Agenda-setting intelligence, analysis and advice for the global fashion community. NEW YORK, United States — Sarah Lee and Christine Chang appeared on ABC's \"Shark Tank\" in 2015, attempting to convince the Sharks that their year-old Korean beauty e-commerce site Glow Recipe was worthy of investment. They spent most of their segment educating the panel of entrepreneurs about Korean skincare. Ultimately, the parties agreed to go their separate ways. Four years later, investors are knocking. Glow Recipe launched a K-beauty-inspired brand under its own name in 2017 that did $30 million in retail sales in 2018 and flies off the shelves at Sephora. The founders say they plan to shutter their multi-brand business next month so they can focus on growing their own line, which they hope will hit $100 million in sales by 2022. Lee and Chang are part of a wave of entrepreneurs who struck gold selling Korean beauty secrets to US consumers. Gel creams, sheet masks and other “K-beauty” products were all but unknown to Americans before 2012, when several K-beauty sites launched and began brokering relationships between Korean brands and national retailers like Sephora, Ulta and CVS. The K-beauty dust has settled Now the secret is out, and K-beauty’s original boosters have become brands in their own right. They are launching products that are competing head to head with top Korean brands as well as the wider skin-care market. Though some are still manufactured in Korea using traditional ingredients, Glow Recipe and other K-beauty pioneers have outgrown the category. \"The K-beauty dust has settled,\" said Charlotte Cho, who started K-beauty retailer Soko Glam in 2012 and launched her first brand, Then I Met You, last year. \"The skincare market in the US in general reminds me of what Korea's beauty market was like ten years ago. So K-beauty brands here have their work cut out for them. It all comes down to brand storytelling.\" The Original Skin-Care Craze Korean beauty products are characterised by affordable prices, whimsical packaging, innovative formulas (like oxygen bubble masks) and ingredients not often seen in the US, like snail mucin and donkey milk. The focus is on ingredients, cleansing, hydration and skin care-as-ritual. Until recently, it was a phenomenon largely confined to Asia. In 2012, Korean beauty exports to the US totaled $59 million, according to the US Census Bureau. Last year, that number topped $511 million. Early western K-beauty adopters gathered on Reddit forums in the late 2000s to discuss products, shopping on Amazon and Korean e-commerce sites that were willing to deliver to the US. Passionate bloggers shared reviews and tips for purchasing products. Glow Recipe products | Source: Courtesy Glow Recipe products | Source: Courtesy Glow Recipe products | Source: Courtesy Entrepreneurs soon began importing Korean beauty products on a larger scale. Alicia Yoon founded Peach & Lily and Charlotte Cho started Soko Glam in 2012. Memebox, founded by Dino Ha, launched in Korea that year as a multi-brand retailer, opening an office in San Francisco in 2014 to start shipping to the US. Glow Recipe came in 2014 as well, self-funded with $50,000. “None of the brands had product managers in the US, so we were doing all the translation, all the import/export,” Ha said. Memebox was accepted into Y Combinator and racked up $160 million in funding by 2016, plus $35 million in a round led by Johnson & Johnson in January. Glow Recipe, Peach & Lily and Soko Glam, in addition to selling Korean brands on their own sites, helped Korean brands find placement in large retailers. Some acted as distributors, buying the products and selling them to retailers, while others took a cut of sales. Sephora in particular was an early adopter of K-beauty. It has sold Dr. Jart, Belif and Amorepacific for years. These brands and others are featured in activations and special sections. This fall, it will run a digital campaign featuring K-beauty products and brands. K-beauty’s success helped touch off the wider skin-care craze in the US, said Sarah Jindal, a Mintel global senior analyst of innovation and insights who has worked with Korean beauty companies. In the US, prestige skin-care sales rose 13 percent in 2018, to $5.6 billion, according to the NPD Group. “We saw this big shift in consumer behaviour,” Jindal said. “This knowledge and understanding of ingredients, what they do, how you use them, pairing things together and layering, that all came from K-beauty.” Leaving the 10-Steps Behind Early on, K-beauty was best-known for the 10-step skin care routine, an approach advocated by the start-ups. But once the novelty wore off, the complicated routine, which included multiple serums and essences, became a bit of a liability, said Glow Recipe’s Lee. “American consumers ... want to see the benefits right away,” said Lee. “A lot of our customers were emailing us that they felt a little overwhelmed.” Now that brands from Garnier to La Mer offer sheet masks and gel creams, the challenge is to stand out in a crowded market. The original K-beauty distributors say years of data on customer purchases and their close relationships with Korean labs give them an edge. Five years ago growth might have come from just newness, but right now there is loyalty that has been built Memebox, for instance, started mask brand I Dew Care after noticing a spike in searches for clay masks. The company was the first to launch its own product assortment, and shut its US multi-brand operations in 2016, though its online shop in Asia still provides a rich source of data on consumer preferences, Ha said. Colour cosmetics brand Kaja launched with Sephora, while Nooni, another skin-care line, will soon be sold exclusively on Amazon. Peach & Lily launched a masstige line in 2017 called Peach Slices, carried in CVS. In 2018, it launched an eponymous skincare line at Ulta. Peach & Lily did $30 million in sales in 2018 via its own brands and its retail operation, which Yoon said she has no plans to shut down. “Five years ago growth might have come from just newness, but right now there is loyalty that has been built,” she said. Glow Recipe - the brand - launched in 2017 at Sephora with a cleanser and a pink sleeping mask in a chunky glass jar meant to look like a melting ice cube. The concept was born from both founders’ memories of their grandmothers in Korea rubbing watermelon on their skin in hot weather. The mask sold out seven times after it launched. A watermelon serum quickly followed, as did other fruit-themed products like an avocado sleeping mask and a pineapple serum. There are now six products with several more launching this year. Sephora carries the line exclusively in the US and Canada, but Glow has entered Germany, the UK and, soon, Australia with other retailers. Another brand, Sweet Chef, sells at lower price points at Target. The products are formulated both in the US and Korea, but K-beauty aficionados will recognise the DNA there. The range includes two sleeping masks, a category of night cream packed with active ingredients that is a hallmark of K-beauty. “We wanted to introduce everything that people loved about Korean skincare but in a version that American consumers would easily approach,\" said Lee. “We still want to make sure we’re always inspired by K-beauty as a category and that is our heritage.” K-Beauty 2.0 Brings New Competition Soko Glam’s Cho launched her first brand last year, Then I Met You, but doesn’t sell it on her own site. She wants the new brand to be separate from the 50 brands carried on Soko Glam, and for those labels not to feel like she’s introducing new competition. Our strong brand partnerships have been critical to our success “I want to make sure that Then I Met You has a long term vision. That’s why I separated the two. Our strong brand partnerships have been critical to our success,” she said. Amazon has always been a big driver of sales to K-beauty brands, but also carries grey-market goods from third-party sellers, often at lower prices than official carriers offer. Counterfeits are also a persistent concern. But Amazon launched a K-beauty vertical in the last two years and Ha thinks the environment there “has changed dramatically. You’re going to see the brands selling [directly] on Amazon, and it’s happening as we speak,” said Ha. Amazon did not respond to a request for comment. Cho said she tries to establish exclusive relationships with brands to avoid the reseller issue. “We want to work with brands that have a strong handle on the distribution,” she said. It's a race to stay in that innovative state of mind Other retailers are aggressively pushing into K-beauty, and even at Sephora, no one brand accounts for more than a sliver of the market. Amorepacific has the best claim to being a market leader. The Seoul-based beauty giant, with $5.6 billion in global sales, sells six brands in the US, with Primera joining Laneige and its namesake brand at Sephora this summer, while Innisfree is sold in freestanding stores. Retailers are still looking to add new lines. Peach & Lily’s Yoon introduced the first K-beauty assortment at CVS in 2017. The drugstore chain has since added K-beauty categories and as much as quintupled the number of masks it carries at some stores. “We’ve essentially taken the magazine rack and replaced it with a facial mask rack,” said Maly Bernstein, vice president of beauty and personal care at CVS. Mintel’s Jindal said there’s another reason K-beauty brands are launching so many new products - it’s the best way to stay ahead of the competition. “It’s a race to stay in that innovative state of mind,” she said. Related Articles: [ This K-Beauty Brand Is Bigger Than Chanel. But It’s In Trouble. ] [ Why International Beauty Brands Are Piling into South Korea ] [ K-Beauty: From Fad to Fixture ] © 2023 The Business of Fashion. All rights reserved. For more information read our Terms & Conditions The Business of Fashion has partnered with Soho House and Farfetch to give BoF Professional members access to two very special offers. Members of the industry index including Pierpaolo Piccioli and Francesca Bellettini connected over cocktails and canapes in Paris, celebrating new entrants including Pharrell Williams, Karol G and Sabato De Sarno. Pharrell Williams, Ashley Graham, Karol G and Naomi Campbell were among those who celebrated new entrants and longstanding members of The BoF 500 community during Paris Fashion Week. In addition to major fashion hubs like the US, UK, France and China, our latest additions to the BoF 500 come from emerging markets from Nigeria to Thailand. The essential daily round-up of fashion news, analysis, and breaking news alerts. Our newsletters may include 3rd-party advertising, by subscribing you agree to the Terms and Conditions & Privacy Policy.   ",
    "datetime": null,
    "url": "https://www.businessoffashion.com/articles/news-analysis/korean-beauty-has-hit-the-mainstream-now-what/"
}