{
    "title": "Korean Pop Beauty Icons | POPSUGAR Beauty",
    "text": "Updated on 3/18/2016 at 12:00 PM I'd like to think that I don't know how I got into Korean pop music. I was a rock snob from a young age, so pop has always been simply beneath me. But the truth is that I'm a sucker for a catchy song. Everything about the K-Pop genre is catchy: the clothes, the style, the beats, the little dances in each music video, and (thanks to a year of Korean classes) the lyrics I can almost follow along with. So, it's really not all that surprising how I, along with hundreds of thousands of other fans around the world, can talk for hours about Big Bang and shell out great deals of cash for a single concert ticket whenever the Hallyu wave heads our way. In addition to the global rise of the country's pop music, the obsession with Korean beauty trends has surged worldwide. These days, no self-respecting skin care and makeup junkie would be caught dead without Dr. Jart+, Sulwhasoo, or Chosungah 22 in their stash. Indeed, Koreans and K-Pop stars have been killing it on the beauty front for ages, and we're only just catching up. Need some inspiration? I've pulled 10 of the hottest K-Pop beauty icons to break down their must-copy looks for you to emulate ASAP. Prepare to be as hooked on them (and their music!) as I am! It's tempting to say that CL is the Beyoncé of K-Pop, but she's really a force unto herself. With a style that can't quite be pinned down (bombshell diva meets couture hip hop punk meets Jeremy Scott, maybe?), CL pushes the limits of fashion, beauty, and music further than any of her cohorts. Her signature look is a thick, dramatic cat eye that's sometimes smoky, sometimes razor sharp. A rosy sweep of blush highlights her high cheekbones. As for her go-to lip color? She dabbles in nude, deep red, and even blue hues — you just never know what she'll try next. IU has long held the title of \"Nation's Little Sister.\" She's the complete embodiment of the young, innocent, fresh-faced, and flawless beauty look that dominates the K-Pop industry. True to keeping with her nickname, IU's look is striking and beautiful, but always stops short of being too glam or overtly sexy. She accentuates her big doe eyes with just a dash of liner on the top lid and keeps her brows straight and well-defined. Her hair is never fussy, and she prefers to keep it long and tousled, adding to her simple look. While it;s likely that one day Nation's Little Sister might evolve her style to something a little more mature, for now, IU's approachable, everyday look is what everyone wants to emulate. Remember that one outrageously beautiful girl from high school who was also smart and somehow friends with everyone? Tiffany from Girl's Generation is kind of like that. Her signature beauty style is rather simple: long locks that usually fall in loose, effortless waves, filled-in brows, and a generally a neutral or light-pink lip. The effect is a relaxed, girl-next-door vibe, which is fitting since she was actually born and raised in San Francisco. Jia from Miss A has a much edgier look than many other K-Pop stars. Rather than curls that have been set just so and a perfectly sculpted pout, you'll see her with a messy mane and a smirky smize that would make Tyra Banks bow down. The key to Jia's look is all about the the smoky eye, which she tends to create in dark charcoal or neutral hues. Complete with a slick of black liner that elongates her lids and highlights her eyes' natural almond shape, this look screams don't-mess-with-me badass. Ga-In from Brown Eyed Girl always looks a little dangerous. Her short, piecey hair is never perfect, and you'll more often see her with a come-hither stare and a sultry smirk rather than a perky smile. Instead of traditional charcoal shades, you'll more often see her sport that smoldering smoky eye in dusty nudes, accented with a bright red or pale pink lips. Her brows also look natural and never over-manicured, adding to her effortless, #justwokeuplikethis appeal. I love BoA for her simple, natural look that veers into major glam territory. Though she's usually seen with just a sweep of eyeliner and a neutral lip, she's also no stranger to rocking a sultry smoky eye and a deep red lip, which offsets her wavy locks. However, what I really love is BoA's style from the start of her career back in the early '00s. She'd rock everything from cornrows, pin-straight locks, a spiky bun, or tousled pigtails, all parted down the middle. Along with all the neckties, graphic tees, track jackets and fedoras she wore, those 'dos give me major nostalgia for my own grade-school days. From fresh-faced girl-next-door to haute couture goddess to sexed-up-bombshell, Lee Hyori is a Korean style icon unlike any other. Of course, she wouldn't have had such a long career (she got her start in the late '90s) if she didn't evolve. While she's owned every look in the book, it's the later glam style that really sets her apart from other K-Pop stars. In an industry that highly values an innocent appeal, Lee Hyori isn't afraid to own her bold approach to beauty. Whether she's getting covered in body paint on the cover of W Korea, channeling Marilyn Monroe for the makeup brand Clio, or showing off her arm tattoos, Hyori just does her . . . and does it so, so well every time. At only 17 years old, Lee Soo-Hyun has made a name for herself alongside her brother in their fun, lighthearted duo known as Akdong Musician (or AKMU). As you can probably already tell, Soo-Hyun definitely doesn't look like the average K-Pop starlet. Rather than go under the knife to get the coveted heart-shaped face of other singers, Soo-Hyun has embraced her unique, natural features that ooze charm and innocence. Her typical beauty look incorporates a dusting of rosy blush to accent her full cheeks, a simple nude lip, and a little bit of liner to accentuate her unique eyes. It's worth noting that Soo-Hyun has what fans call an \"eye smile,\" which is not to be confused with a smize. When grinning, her eyes close and arch upwards, making her face even more expressive. Ailee is that cool, quirky girl everyone wants to be friends with — and whose style that everyone wants to emulate, but can never really reproduce. She rocks bold shadows and thick swipes of liner well, appearing sultry and a little mischievous but never overdone. Let's also take a moment to appreciate the girl's eyebrow game. Preferring a thicker, straighter brow to something thinner and more dramatically angled, Ailee uses her arches to achieve that chic ingénue look. Amber from F(x) is one of the only true tomboy K-Pop stars, always foregoing skirts and heels in favor of jeans, shorts, and sneakers. Her short hair tends to be choppy and full of highlights, which she wears either spiked up Ellen DeGeneres-style or pushed into a Justin Bieber-ish swoop. Amber has a great jawline and killer cheekbones that are contoured to perfection, alongside a subtle daytime smoky eye. In an industry that tends to have a very narrow idea of femininity, Amber deserves a ton of credit for daring to show that a woman doesn't have to be defined by long locks and a mini skirt. Pin it! ",
    "datetime": "2016-03-02T21:20:50.000Z",
    "url": "https://www.popsugar.com/beauty/korean-pop-beauty-icons-40415300"
}