{
    "title": "Korean beauty was big in 2021: Here are some trends we witnessed | Life-style News - The Indian Express",
    "text": "When it comes to taking care of the skin, many people swear by the Korean skincare routine, which is popular around the world. K-Beauty has made its mark with traditional ingredients along with modern ones. And when it comes to setting trends in beauty, we can blindly trust the Koreans. Commenting on it, beauty expert at Belif — a Korean skincare brand inspired by 19th century apothecary techniques — said: “From unique ingredients, inventive techniques to varied formulations, Koreans have got the solutions for every skin care needs.” Take a look back at some K-beauty trends that took the world by storm in 2021. 1. Carrot seed oil Carrot seed oil has been used in K-beauty for more than 10 years. It contains vitamin A and is a great antioxidant. It’s anti-aging, anti-fungal, anti-bacterial and anti-inflammatory and ideal for anyone looking to brighten their skin. The oil has been in demand since major K-Beauty brands adapted it into their skincare line. 2. Glass and honey skin Koreans love keeping things natural and these two enhanced that kind of beauty. Honey skin entails layering hydrating products that brighten the skin and leave it with a moisturised glow. Glass skin means going for a poreless finish and smoothing out the skin’s texture, while retaining a natural glow. 3. Slugging This K-beauty trend took moisturising to the next level. It involves using petroleum jelly at the end of your night routine. This entails that all the goodness and moisture from your moisturisers and serums are locked into the skin, creating a protective layer across your skin’s barrier. 4. Acid layering Just one acid is not enough and K-beauty approves. Their acid layering technique balances out acids like AHAs and BHAs that exfoliate your skin, while leaving it with a smoother texture. 5. Skinimalism Skinimalism is more about picking and choosing the bare necessities when it comes to skincare products. Since it is more skin type and concern focused, it is as effective but with the least amount of steps and products. 6. Mild retinols Retinol is one of the most effective skincare ingredients that works like magic, as it prevents wrinkles, brightens skin and minimises breakouts. But like all good things, this ingredient also needs to be used in moderation. Korean products are now using retinol but in lesser potencies as it decreases the risk of overwhelming the skin without changing the results. 📣 For more lifestyle news, follow us on Instagram | Twitter | Facebook and don’t miss out on the latest updates!  ",
    "datetime": "2021-12-16T10:00:31+05:30",
    "url": "https://indianexpress.com/article/lifestyle/life-style/korean-beauty-2021-trends-skincare-routine-k-beauty-7674063/"
}