{
    "title": "Korean Beauty | Asia Society",
    "text": "Unsupported Browser Detected.It seems the web browser you're using doesn't support some of the features of this site. For the best experience, we recommend using a modern browser that supports the features of this website. We recommend Google Chrome, Mozilla Firefox, or Microsoft Edge Video: Watch a trailer for Korean Beauty (2 min., 40 sec.) After three years of rigorous preparation, Asia Society Korea Center is pleased to announce the launch of Part 4 of the Korean Wave Initiative: a documentary called Korean Beauty. Fair skin, a well-defined nose, peachy cheeks, and cherry-red lips. For thousands of years, Korean women have favored this standard of female beauty with remarkable consistency. This standard has certainly not been immune to the passage of time, and modern-day advancements such as plastic surgery mean that women can beautify themselves beyond the appearance given to them by nature. Nonetheless, scholars and scientists today reveal that there is an unchanging set of values that continue to define the Korean aesthetic. Thus, the art and stories that were passed down for hundreds and even thousands of years in the culture display a common thread when it comes to the ideal concept of female beauty. Asia Society Korea Center has embarked on a journey to explore that thread of beauty throughout Korea's history, from painter Shin Yun-bok's famous Portrait of a Beauty to studying the altar portrait of Buddha and the bodhisattva Aryavalokitesvara; the \"virtuous women\" and \"temptresses\" of legends; as well as modern-day beauties that dominate Hallyu, or the Korean Wave. This journey will be captured in “Korean Beauty” with the aim of going beyond the façade and demonstrating the strength and inner beauty of Korean women to not only the young Korean generation, but also a global audience that is getting to know Korea. This documentary will also help people from around the world to delve deeper and encounter the unfamiliar treasures of Korean culture and history for the first time. Korean history and folklore often featured \"dangerous beauties\" that used their feminine charm to seduce men and even put them in danger. Mi-shil, the concubine of King Jinheung of the Shilla dynasty; the gisaeng known as Nongae; even the legendary animal the Nine-tailed Fox are examples of beauties that captured the hearts of men. Part 1 will introduce Korean culture and history by offering an engaging picture of the beauties of Korea's history and folklore. The women known as gisaeng occupied a space in Korean society that was full of paradoxes. The Korean government officially designated them as entertainers for the royal court and they interacted with the elite classes, but gisaeng were still considered part of the low class. They were seen as entertainers, courtesans, and symbols of luxury, yet they were actually highly-skilled artists, musicians, poets, and writers. Part 2 will provide an opportunity for people to appreciate gisaeng as the artists that they were. The king's women were never far from the heart of the history of the royal court's drama. The queen was at the top of the hierarchy — a woman from a noble family who exercised influence over the palace, but a woman who could never rest easy even in the midst of her regal raiment and finery. The royal concubines ranked below the queen, yet could wield their beauty and charm to claim the king's affections. In a political environment that left no place for women, female monarchs left indelible marks on Korean history and culture, whether they ruled in their own right or as regents for young kings. If ancient palace walls could speak, they would also whisper hauntingly of the countless women of the royal family whose lives were claimed by witch hunts and treacherous schemes. Beyond the royal family, there were thousands of court maids who entered the king's service around age 10. As young girls, they took part in an initiation ceremony that resembled a wedding, except that there was no groom. This ritual symbolized that they belonged to the king alone and could never marry or leave the palace. Part 3 will offer a vivid portrayal of the lives of the king's women; the way they blossomed, withered, and faded all in the king's shadow in order to win his love, and their lives at court, which depended upon gaining that love and producing an heir to continue the bloodline. The Joseon dynasty was also dominated by the strict \"Five Relationships\" of Confucian thought that prescribed certain duties: ruler and subject; father and son; husband and wife; elder brother to younger brother; and friend to friend. Part 3 will examine how the Joseon dynasty eventually gave way to modern Korean women's independence. In Korean culture, ajumma is the term used to refer to a married woman. In the past, Korean women were predominantly identified by their relationship with their father or husband, and called “so-and-so's daughter\" or \"so-and-so's wife.\" But in post-war Korea, women's status drastically changed socially, domestically, and regarding their economic responsibilities. As the mothers of the country, they made tremendous sacrifices and relentlessly pursued educational opportunities for their children. The mothers of Korea are truly the strongest people that can be said to represent the country, and this documentary will reveal their inner beauty to the world. Watch these short clips from the interviews with acclaimed Korean director Kwon Taek Im, and one of the last living gisaeng in Korea, Ryu Keum Sun.  * Please note: The following clips are in Korean.     Asia Society takes no institutional position on policy issues and has no affiliation with any government.\nThe views expressed by Asia Society staff, fellows, experts, report authors, program speakers, board members, and other affiliates are solely their own. Learn more.   ",
    "datetime": null,
    "url": "https://asiasociety.org/korea/korean-beauty"
}