{
    "title": "Korean Home Remedies For Skin Brightening: DIY K-Beauty Skincare For Glass Skin",
    "text": "The magic of K-beauty to your skin at your home Korea has been very impactful on the world at large and we aren't just talking about BTS here. Any skincare enthusiast worth their weight in serum will know how great the contributions of the Korean beauty industry are. Proponents of skincare routines that go into double digits and highly unique ingredients, they are also the trendsetters behind glass skin. Wondering what that is really? Well you're in the right place to find out. As the name suggests, glass skin is a skincare trend in which the face is so bright and clear that it almost appears to be luminescent and reflective, like glass. A mild exaggeration, certainly but in principle it promotes a clear, blemish-free and glowing complexion for all genders. Popularized by the world of K-beauty, glass skin has a multi-pronged approach to achieving it. While the right skincare products and a disciplined approach are essential, so is a healthy diet, adequate water, home remedies and ounces of patience to actually see a visible effect in turning your skin glass-like. K-beauty is best known for its mind-boggling array of skincare ingredients and innovative products that reach incredible new and trendy heights. What you possibly didn't know is that Korean beauty also has its own share of home remedies that have been religiously followed for decades. Staying true to native ingredients and homegrown techniques, these home remedies continue to feature in their beauty routines and are in part, responsible for their glassy, glowing complexions. If K-beauty sheet masks and snail slime essence is all you know of, we're taking you back in time with Korean home remedies for skin brightening, clarity and plumping. Ensure you first do a test patch and once you do, add these Korean home remedies to your own routine. When followed alongside a healthy diet, natural detoxification and sun protection, you are bound to see an improvement in your skin quality in a couple of months. The coveted glass skincare trend can be yours when you add these Korean home remedies for skin brightening and clarity to your own routine.        ADVERTISEMENT (Also Read: 9 Amazing K-Beauty Gems That You Haven't Heard About) Rice isn't just a dinner table staple in Asian countries. In many Asian nations such as China and Korea, fermented rice water plays a key role in skincare routines. The best part is it can be made at home. Boil rice, strain and collect water, allow it to cool and store in a spray container. You can also eliminate the boiling process by soaking rice in water overnight and collecting the water the next morning. Allow it to ferment for 2-3 days and then use the fermented rice water as a face mist in the morning and night. Yuzu lemon may be a Japanese ingredient but finds usage in Asian beauty regimes. In K-beauty, it is referred to as yuza and is revered for its citrus pop and antioxidants. Mix 2 drops of yuzu lemon essential oil with 5-6 strawberries mashed to a pulp and 2 tablespoons of fresh yogurt. Apply to your face and neck, let it sit for 30 minutes and wash off with warm water. You'll notice your skin feeling reinvigorated and fresher right after. Brew quarter of a cup of water to make green tea. Allow it to cool completely and use it as final rinse for your face after every wash. Green tea, while usually known to work as a detoxifier from the inside, works on blemishes and breakouts from the outside too. Combine 3 tablespoons of finely ground rice flour with 2 tablespoons of aloe vera pulp and cold water in proportion to form a runny liquid. Apply over the face and neck, let it dry for an hour and wash off with cold water. Your skin will feel calm and soothed once you use this face mask. (Also Read: For Radiant, Healthy Skin, Try The Quick 7-Step Korean Beauty Skincare Routine) Disclaimer: The Swirlster Picks team writes about stuff we think you'll like. Swirlster has affiliate partnerships, so we get a share of the revenue from your purchase. Best Moisturisers For Dry And Patchy Skin With Shimmery Eyeshadow And Radiant Skin, Malaika Arora's Apsara Avatar Is The Epitome Of Ethnic Glam Esha Gupta's Brown Hued 90s Glam With A Tousled Updo Makes For A Fabulous Throwback Aamir Khan's Son Junaid Khan's Stunning Long Hair Proves He Is \"Ready For Cameras\" And He's Not The Only One ",
    "datetime": null,
    "url": "https://swirlster.ndtv.com/beauty/korean-home-remedies-for-skin-brightening-diy-k-beauty-skincare-for-glass-skin-2330571"
}