{
    "title": "Korea’s viral #skincarediet is the antidote to its divisive 10-step routine | Dazed",
    "text": "Korean beauty exploded onto the scene in 2016, gaining attention for its use of, well, niche ingredients (snail mucin, donkey milk, pig collagen) and of course the now famous “10-step skincare routine” - a lineup of ten products to rub, blend and pat into your skin every morning in order to get that flawless “I woke up like this” look. Consisting of two cleansers, a toner, a carefully curated set of essences, serums and ampoules, a sheet mask, and (breathe) finally an eye cream, moisturiser and sunscreen, this extensive skincare regimen was more or less brought to the West by K-beauty entrepreneur Soko Glam, thanks to their 10-step skincare kits for every skin type. K-beauty companies such as Amore Pacific, who launched in France in 2017, followed suit exporting their myriad of skincare products overseas. That same year worldwide Google searches for “10-step skincare” soared. K-beauty had come through. But why is it so popular? Well, as well as promising to make skin flawless and glowing, the 10-step routine is also viewed as a relaxing act of self-care - a way of winding down after a stressful day or an energy boost to kick-start your morning. So as well as benefitting the physical health of your skin, it is said to work wonders on your mental health, too. And then there’s its perceived political symbolism. Only a few months ago, Slate published an article that proclaimed K-beauty as a feminist act of “radical self-care”, a rejection of the idea that women are meant to take care of others first and foremost rather than themselves, with a nod to the American writer and activist Audre Lorde who argued that “caring for myself is not self-indulgence, it is self-preservation, and that is an act of political warfare.” While connecting a commercial product to a political movement is always questionable, there is some truth in the claim that a daily skincare routine customised for each of your skin concerns can go beyond the simple concept of vanity. Cat Cactus, the woman behind the popular K-beauty blog Snow White and the Asian Pear says, “A multi-step routine can have benefits beyond the health of your skin - I know some women find a multi-step skincare routine gives them a ritual of calm at the end of their day, allowing them to focus on themselves and they enjoy the process.” However, others view this excessive skincare routine as nothing but an exploitative commercial ploy. “It's a marketing and media creation that makes consumers feel they aren't doing their skincare right if they aren't using every step or aren't using enough steps, which is completely wrong,” says Jude Chao, the writer behind another influential K-beauty blog Fifty Shades of Snail. With Soko Glam’s 10-step skincare sets retailing for more than £150 and the purchase of individual products on Amazon or K-beauty webstores adding up to more than £250, the hole in your bank account is not insignificant. Furthermore, there’s also an argument to suggest that using too many products can actually be detrimental to your skin.  \"People have been piling on so many different products that they've developed redness, sensitivity, and even worse — contact dermatitis,\" says Liah Yoo, founder of popular Korean skincare brand KraveBeauty. \"An excessive skincare routine can be harmful in the long term, not just to your wallet but also to your skin\" As a reaction to this, some Korean women have started to simplify their skincare routines - a movement which the internet has dubbed #skincarediet.  Ex-beauty director of Elle Korea and producer of the popular Korean TV programme Get It Beauty which reviews various beauty products from lip tints to foot masks, Pi Hyun Jung (or Director Pi, as she is known on her YouTube channel) argues that using more than three products is redundant and an excessive skincare routine can be harmful in the long term, not just to your wallet but also to your skin, making it thinner and more sensitive. Pi’s alternative to the “10-step skincare routine” is following the “333 rule” she introduced on Korean national TV JTBC this year - using only three products (a toner, essence and cream), avoiding three harmful ingredients (surfactants, antioxidants and parabens) and using no more than three different brands, sticking to only one if possible. And Pi is not alone - #SkincareDiet (or #화장품다이어트 in Korean) has gone viral with both Korean and non-Korean women taking to social media - through the Instagram hashtag or YouTube tutorials to share their tips on achieving more with less. K-beauty companies have responded to this shift by releasing a myriad of multipurpose products, such as Son & Park’s cult Beauty Water - a cleanser that doubles as a toner and a facial mist or Missha’s Signature Essence Cushion - a cushion foundation that moisturises your skin and also helps even out your skin tone (plus it has a high SPF). As someone who suffered from atopic eczema throughout most of my youth, the condition of my skin has always been closely linked to my self-worth and finding the right skincare has been a huge confidence boost. However, not every product that the £4.6 billion K-beauty industry claims will completely transform your skin will work. Whether you are someone who revels in the ritual of layering different products on your skin or someone who prefers to save that time for some quality beauty sleep, contrary to what marketers might say, Korean skincare offers no one-size-fits-all solution. The key to ‘getting it right’ is not spending more money on another magical serum to layer on top of the rest of your skincare routine, just because a magazine told you so. Instead get to know what your skin needs and find the right products that do their job - be it ten or three. As Cat points out, “If someone finds a path to self-care, as defined by Audre Lorde, through a multi-step skincare routine, I fully support them. If someone just wants to wash their face, I fully support that too.” ",
    "datetime": "2019-01-15T09:00:00+00:00",
    "url": "https://www.dazeddigital.com/beauty/article/42842/1/korea-viral-skincarediet-10-step-routine"
}