{
    "title": "Krista K goes on Asian tour",
    "text": " SUMMARY This is AI generated summarization, which may have errors. For context, always refer to the full article.  MANILA, Philippines – Krista Kleiner, or better known now as Krista K, will be one of the main acts during the 1 World Music Festival to be held in Singapore. 1 World Music Festival will be held during the prestigious Formula 1 Race in Singapore on September 20 and 21 (on which date she is scheduled to perform a 30-minute set). The 24-year-old American actress-singer with Filipino and German roots was crowned Bb. Pilipinas-International in 2010, one of many highlights during her brief stay in the Philippines. In Singapore, she joins a roster of star performers that includes Moby, Snoop Dogg, Far East Movement, Iggy Azalea, the Cataracs, and T-Pain. Also performing will be Taboo from the Black Eyed Peas, with whom Krista has performed in the past. The event is touted to be the biggest collection of international music superstars Asia has seen this year. It’s also part of Krista K’s Regional Tour, which has seen her perform at the WeLoveAsia Festival in Kuala Lumpur, together with Pitbull. Her upcoming gigs include performances in Jakarta and Bangkok. There are plans to cap her tour in Manila. “It’s such an honor to be performing at Asia’s biggest festival this year, with such an amazing lineup of artists. And to think I only started singing two years ago,” Krista K said. “It goes to show that hard work and commitment really pay off. I’ve never been happier in any other field of work and I look forward to rocking out with Singapore and all the upcoming stops on my regional tour. “At the moment, I’m working on adding a final show in Manila to wrap up the tour with a thank you to the country that gave me a start in the entertainment industry 5 years ago, when singing [brought] me to work there and move from California. “Even though I’m no longer living in the Philippines, Filipinos will always be close to my heart,” said Krista. – Rappler.com Here’s a video by Krista K:  Error. Please abide by Rappler's commenting guidelines. There are no comments yet. Add your comment to start the conversation. JOIN OUR NEWSLETTER Fearless reporting delivered to you follow us    ",
    "datetime": "2013-09-18T04:54:07+00:00",
    "url": "https://www.rappler.com/entertainment/music/39216-krista-k-asian-tour/"
}