{
    "title": "Latinx beauty is growing like K-Beauty, J-Beauty and A-Beauty before it",
    "text": "Like K-Beauty, J-Beauty and A-Beauty before it, Latinx beauty is gaining traction: Nordstrom announced the expansion of its selection of Latinx-founded brands in September, in time for and in celebration of Latinx Heritage Month, adding Costa Brazil, Joaquina Botanica, Nopalera and Vamigas to its roster. Multi-brand “clean” beauty retailer Beauty Heroes also carries both Joaquina Botanica and Nopalera, and featured Joaquina Botanica in its monthly discovery box for October. In speaking with Glossy for this piece, a number of founders in the space shared how they’re defining the harder-to-define category and growing their brands, and what makes their brands reflective of their own heritage. Sandra Velasquez conceived of her brand Nopalera in the summer of 2019. She looked at brands that embrace African heritage like Alaffia, Nubian Heritage and Shea Moisture, and wanted to create a brand that spoke to her own culture. “Latinos are actually the largest minority group in the country, so why is there nothing on the shelf that represents the culture?” she said. Those thoughts were shared by Giovanna Campagna when she launched her brand, Joaquina Botanica, at the start of 2020. “There’s this idea that things from Europe or, say, French beauty is somehow better — that you always want to look to the French brand for the really effective products,” she said. That’s part of what she set out to change. “I wanted to prove that a brand that is tapping into Latin American beauty traditions, created by a Latin person and built by Latin teams could be just as luxurious and sit on a shelf next to La Mer,”she said. Nobody thinks about French beauty as being just for French people. Latinx founders, on the other hand, are often asked if they’re creating products for their specific demographic, Campagna said. She sees that as underestimating what these brands are capable of and can bring to the table. “My dream is for our brand to appeal to everyone, and for everyone to see it as desirable and effective,” she said. While Latinx beauty does not (yet) have an ingredient with the strong identity (or, perhaps, simply strong PR) of, say, K-Beauty with its snail mucin, a number of ingredients can be found across brands, such as jasmine, prickly pear oil and calendula. Also key, according to Campagna, is the fact that “Latin America is the most biodiverse region in the world, so the amount of natural ingredients to draw upon, and discover really compelling clinical actives from, is unlimited.” Joaquina was the name of Campagna’s great-great-grandmother, who founded one of the first apothecaries in Cali, Colombia in 1875. Prior to founding the brand, Campagna worked at magazines including Vogue and W, and then worked with Latin American fashion designers to help them establish themselves in the States. It was that journey that inspired her to try to do the same thing in beauty. As of now, her brand has just two products: its Orquídea + Vitamin C Hydrating Glow Oil ($88) and its Calendula + Peptides Hydrating Essence ($54). Calendula, a flower in the daisy family, is an ingredient she learned to use from women in her family who used native flowers to create infusions and homemade products. The essence is like a “supercharged version of a home remedy,” Campagna said, explaining that she amped up the formula with clinical actives. “[It has] hyaluronic acids, glycerin and plant saccharides, and a blend of super potent antioxidants,” Campagna said. “And then it has peptides derived from sacha inchi, which is an ancestral superfruit that has been primarily used in its oil form or ingested.” Campagna noted that she aims to blend traditional elements with cutting-edge skin-care science.  A post shared by Joaquina Botánica (@joaquinabotanica)  The hero in Nopalera is nopal, which is a common Spanish name for cactus. The ingredient is used in all of the brand’s products. Three of the products in the current lineup of five are cactus soap, which Nopalera offers in three scents. They are richly hydrating, thanks to high levels of plant butters. The pink Flor de Mayo Cactus Soap ($14) is jasmine-scented. The jasmine flower is a precious flower found all over Mexico, Velasquez said. The green Planta Futura Soap ($14) is scented with lemongrass, an ingredient of personal significance to her. “I grew up with lemongrass. There was always a bush in my yard, and we would always go and cut it and boil it to make tea, especially when we had an upset stomach,” she said. The brand’s body scrub uses prickly pear oil, derived from the fruit that grows on the pads of the cactus. Nopalera is just one of many brands sold on Shop Latinx, an e-commerce platform founded by descriptor Brittany Chavez. Chavez said the brand epitomizes what she is looking to carry on her site. “Sandra has a compelling story. She’s so passionate and strong-willed about the integrity of her products, the ingredients, the storytelling — all the way down to the way it’s manufactured,” she said. Other notable products sold on the site include a Concha body butter by Becalia Botanicals. Concha is a pastry that is prevalent in Mexican and Central American communities, Chavez said. “As a Latina, I gravitate toward products that remind me of my culture,” she said. “And when you see those products on the shelf next to other products that are made by corporations and are not from our culture, it really stands out and evokes a sense of nostalgia. That’s what makes Latinx-owned beauty products so different. They pay homage to our culture and the way that we grew up.” In creating Nopalera, Velasquez said the branding was of equal, if not greater, importance than the products themselves. “The biggest opportunity was to create something a high-end, really overtly-branded Mexican brand,” she said. “I felt like a calling. I was like, I have to do this, because if I don’t, [a company] like Johnson & Johnson is going to come and try to do it, and it’s going to be bad. The most important thing was to get our culture out of the bargain bin. We built pyramids! And we’re the largest purchasers of beauty in the United States. We should have products on shelves that reflect us, and we should also be the owners of those businesses”  Get news and analysis about fashion, beauty and culture delivered to your inbox every morning. ",
    "datetime": "2021-10-13T09:46:45+00:00",
    "url": "https://www.glossy.co/beauty/latinx-beauty-is-gaining-traction/"
}