{
    "title": "Lawyer disbarred after stealing $500k from  Dunne ",
    "text": "It was Gayle Killilea Dunne’s first business foray into the US and not a happy one: She was ripped off by her lawyer, who stole half a million dollars within weeks of her wiring it to his account. But nearly four years later, she has earned some revenge as the lawyer, Phillip Teplen, has been disbarred and cannot even start to move for reinstatement for seven years. This followed her complaint he misappropriated the money, which was supposed to be used to persuade immigration authorities to grant her a US investment visa. Philip Teplen, who has remained a key background figure as Nama has pursued Sean Dunne through the Connecticut bankruptcy court, was forced to resign as a lawyer in New York. He agreed to step down from the bar because he knew the charges would warrant disbarrment. He admitted he used an escrow account containing $500,000 (€368,000) sent by Mrs Dunne from Switzerland in 2010 for his own personal use. Perhaps this was to fund the medical care of his mistress, the former gossip columnist suggested in an affidavit in a civil action filed with the New York Supreme Court shortly after the money went missing. Teplen, the now former immigration lawyer, has featured in Sean Dunne’s ongoing bankruptcy case. A $2.2m house in 38 Bush Avenue, Greenwich, was bought through him as trustee, with Mrs Dunne as the beneficiary. It was later sold for $5.5m, at about the same time Nama began its legal action in a Connecticut state court claiming Dunne tried to hide his personal benefit from a series of property deals in the US and Switzerland. That action has been stayed until the bankruptcy case is over. At the end of June, the New York Supreme Court ordered that Teplen be “stricken from the roll of attorneys and counsellors-at-law in the State of New York”. It was the end of a process started by Mrs Dunne in December 2012  alleging conversion of escrow funds. Mrs Dunne had wired €500,000 on November 18, 2010. On December 10, she asked for $170,000 for a different investment. “By that date, the respondent had depleted all of the $500,000 Ms Dunne had wired into his escrow account,” the June 24 order noted. Mrs Dunne launched a legal action on St Stephen’s Day 2010, zeroing in on the “sorry state” of Teplen’s finances, including his ex-wife’s debts and the foreclosure of his former home. She also suggested he may have “raided the escrow account to pay his family’s healthcare expenses”, referring to his mistress. Teplen, arguing he was not completely focused on business affairs, referred to her in correspondence with Mrs Dunne as she tried to pin him down about the money. In April 2011, Teplen agreed to pay back the money and claims he did so. That is disputed, the order noted. more courts articles More in this section News and analysis on business, money and jobs from Munster and\nbeyond by our expert team of business writers. Please click here for our privacy statement.     UNLIMITED ACCESS TO THE IRISH EXAMINER FOR TEAMS AND ORGANISATIONSFIND OUT MORE News and analysis on business, money and jobs from Munster and\nbeyond by our expert team of business writers. Play digital puzzles like crosswords, sudoku and a variety of word games including the popular Word Wheel Play Play Analysis Keep up with the stories of the day with our lunchtime news wrap. Thursday, October 26, 2023 - 10:00 AM Wednesday, October 25, 2023 - 10:00 PM Thursday, October 26, 2023 - 9:00 AM © Examiner Echo Group Limited, Linn Dubh, Assumption Road, Blackpool, Cork. Registered in Ireland: 523712. © Examiner Echo Group Limited ",
    "datetime": "2014-07-16T01:00:00+01:00",
    "url": "https://www.irishexaminer.com/business/arid-20275597.html"
}