{
    "title": "Lee Hyori Rules With ‘Bad Girls’ on K-Pop Chart – Billboard",
    "text": "With a decade in the K-pop industry under her belt, Lee Hyori nabs her first K-Pop Hot 100 No. 1 with her \"Bad Girls,\" the lead single off her fifth album \"Monochrome.\" By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin With a decade in the industry under her belt, Lee Hyori nabs her first K-Pop Hot 100 No. 1 with “Bad Girls,” the lead single off fifth album “Monochrome.” The K-diva hasn’t released a single in three years since her 2010 “H-Logic” album — before the Billboard Korea chart was created. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news Lee Hyori marked her grand return to the music world with the understated jazz-inspired ditty “Miss Korea.” The pre-release single, which peaked at No. 3, falls to No. 7 this week as official lead single “Bad Girls” nabs the top slot. The track also has a throwback feel led by piano, drum and funky guitar licks. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t06/01/2013 The music video for “Bad Girls” (with more than 1.5 million views) is a must-see with its “Gangnam Style”-like sensibility of Lee Hyori playing an evil stepmother and flashing her crotch in the story of a little girl (with some hilariously, out-of-control eyebrows) who grows up to be a sexy criminal.  Lee Hyori dethrones 4minute who are currently riding high with the success of their first No. 1 on the K-Pop Hot 100. 4minute–whose youngest member Sohyun is almost half Lee Hyori’s age–fall back to the No. 3 slot. As previously reported, the group is currently deciding how to extend promotions for their “Name Is 4minute” EP with a possible new single. The group held a “Goodbye Stage” on music program show M! Countdown to retire the song on air. Take one last watch of the fun performance below:  The R&B duo VIBE–aka Ryu Jaejan and Yoon Minsu–made the highest debut last week at No. 2 with their single “As I Grow Older” which slips to No. 10 this week. “As I Grow Older,” off their fifth LP “ORGANIC SOUND,” marks a major departure from their signature sounds. It’s an acoustic ballad about, as the title suggests, a man who too late realizes the importance of love and misses his ex-lover more as he grows older. The eagerly-awaited comeback album–their first in three years, like Lee Hyori–also garnered a chart smash with tearjerker “The Last Time” which peaked at No. 5 (at No.20 this week). The success of the “ORGANIC SOUND” album has even brought their 2010 hit, “Please Come Back Again,” to the charts at No. 71 this week.  Things aren’t slowing down for this soon-to-be mother and bride Baek Ji Young as she soars up to the No. 12 spot this week with latest single, “Reminded of You.” Baek Ji Young’s latest track was gifted to her by the famed producer Brave Brothers (who’ve crafted 2013 No. 1s for SISTAR19 and 4minute). The song is a disco influenced track modernized with a modern beat and lyrics that knock lovelorn ballads. Baek Ji Young’s agency revealed in a statement that “Reminded of You” will be the singer’s last dance track before her wedding on June 2.   In other K-pop and chart news, Akdong Musician (who won the second season of singing competition “K-Pop Star” and have a group of several Top 3 singles, though No. 1s) announced they signed with major agency YG Entertainment aka PSY, BIGBANG, Gummy and 2NE1’s label. The brother/sister duo–known for their self-composed arrangements–seem to be in good company if their fellow singing competition star Lee Hi is any indication. 16-year-old Lee Hi was the runner-up of the first season of “K-Pop Star” and wound up with two No. 1s on K-Pop Hot 100 since signing with YG. Needless to say, their official debut under YG will be a hotly-anticipated debut. Their latest offering “Bean Ice Flakes With Rice Cake” is the Hot Shot Debut this week at No. 2. Check out a live showing of the duo putting an acoustic spin on YG artist G-Dragon (leader of BIGBANG) and his hit “One of a Kind” on the show. The CEO of the label was watching them. Wonder if this persuaded him to sign them?  Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2013-06-01T18:00:00+00:00",
    "url": "https://www.billboard.com/music/music-news/lee-hyori-rules-with-bad-girls-on-k-pop-chart-1565452/"
}