{
    "title": "Lee Min-ho and Jung Eun-chae each donned one in K-drama The King: Eternal Monarch, so is the Cellreturn LED mask actually any good? We tried it for a month to find out | South China Morning Post",
    "text": "Thanks to the new normal of social distancing and homecations, in-home beauty treatment devices are here to stay. LED masks are on many people’s radars these days, and it seems that none are getting quite as much buzz as the Cellreturn LED Platinum Mask. So in reality, is the mask gold or just a gimmick? I tested it for four weeks to find out. What the mask does The technology behind the Cellreturn LED mask is nothing new. Light-based skin therapy is clinically proven to work and many dermatologists use light skincare treatments to boost skin health. What makes the Cellreturn mask unique is that it’s obviously convenient – no spa visits needed! Then there’s the fact that it comes with a whopping 1,026 LED lights that cycle three light wavelengths: red (and near-infrared), blue, and pink. The red light helps your skin produce more collagen, appear brighter, and minimise blemishes. The blue light soothes easily irritable skin. The pink light, meanwhile, helps to reduce scarring. How to use the mask The Platinum mask was surprisingly easy to put on despite its bulky appearance. The recommended duration per daily session is up to 20 minutes, though you should first ask your dermatologist’s advice before usage. Take note that you should never use it on bare skin; a layer of serum post-cleansing will do the necessary cushioning. The mask’s fast mode is a godsend on extra busy days. Lasting for nine minutes, the quick session starts with seven minutes of the red light, followed by a minute each of blue and pink. Results The Cellreturn mask dramatically reduced my skin’s tiredness and inflammation after only three uses. But it did not smooth out my fine wrinkles as I’d hoped. I know the mask promises smooth skin at the push of a button, but the result of your usage will truly depend on your genetic make-up. Now, if you’re a frequent jet-setter, then the mask is probably not the best idea, as it takes extra space and maintenance to take it with you. But as the recent health pandemic has proven, beauty starts at home. So if homebound sustainability is your new mantra, then this mask may just be your best investment yet. The Cellreturn Platinum LED Mask is priced at US$2,100. Want more stories like this? Sign up  here. Follow STYLE on  Facebook,  Instagram,  YouTube and  Twitter . Touted by Park Seo-joon and Kang So-ra, this beauty device is perfect for home spa treatments in the era of Covid-19 – apparently banishing spots, brightening skin and making you look years younger ",
    "datetime": "2020-10-17T16:00:20+08:00",
    "url": "https://www.scmp.com/magazines/style/news-trends/article/3105913/lee-min-ho-and-jung-eun-chae-each-donned-one-k-drama"
}