{
    "title": "Lee Seung Chul Topples SISTAR for No. 1 on K-Pop Hot 100 – Billboard",
    "text": "Lee Seung Chul dethrones last week's chart reign by SISTAR with his new track, \"My Love,\" on this week's Billboard Korea K-Pop Hot 100 chart. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin Lee Seung Chul, considered by many as one of Korea’s best live performers, dethrones last week’s chart reign by SISTAR with his new track, “My Love.” Lifted off Lee’s 11th LP, released June 18, the single is a mid-tempo pop-rock piece with uplifting synthesizer. The song is characterized by melancholic, sweet-sounding, melodies. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news   His long-awaited album contains songs that explore love and all that comes with the experience. The record features a star-studded lineup including Grammy-winning mixing engineer Steve Hodge, who has worked on projects by Mariah Carey and Michael Jackson. Keeping beat on the album is Nickleback drummer Daniel Adair. It’s a world-class album. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t06/28/2013 To commemorate the release, Lee will embark on his Korea-wide, seven-city tour on June 29. Lee Seung Chul expressed his excitement on Twitter (translated): “Wow, No. 1 on Billboard K-pop Hot 100. What an honor! Thank you my fans!” ??~??? k-pop?? 1? ????????????? ?? ??????? !!!!!!!!!!! ? ??? ????????^^ — LEE SEUNGCHUL(???) (@Lee_SeungChul) June 28, 2013 Last week, SISTAR charted ten songs on the K-Pop Hot 100 including occupying the top three slots with comeback single “Give It to Me” being crowned at No. 1. The single falls to No. 2 this week, leaving “Give It to Me” only one week at the top. Watch one of SISTAR’s latest burlesque-inspired performances below:  Last week saw seven Top 10 entries featuring girl groups or girl group members. They all fall this week, except for After School’s “First Love,” which rises to No. 7 — a new peak for the ’90s hip-hop/R&B-inspired single. Two of the eight members are still injured from their risky, yet truly impressive, pole-dancing live performance. Watch one of their latest below:   Quirky, yet very popular, act Sunny Hill recently returned with a new single, “Darling of All Hearts,” this week’s Hot Shot Debut. The folksy, polka single tells the downsides of being single, but through lighthearted, funny lyrics. The composition includes instruments such as Greek bouzouki, nyckelharpa, Drehleier and the Irish Whistle — rarely heard in K-pop. The fresh instrumentation and the funny lyrics add up to yet another innovative release from the group that’s dropped singles about the dark side of the K-pop industry in their acid jazz track “Midnight Circus” and the vainness in looking for relationships in their electro-pop banger “Is the White Horse Coming?”. Watch the Sunny Hill girls play up an old-school pin-up theme in the music video:  Next week should see even more girl groups joining the chart battle as it reflects a full week’s worth of sales from Girl’s Day (“Female President,” starting at No. 22) and 4minute (“Is It Poppin’?”). Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2013-06-29T01:19:00+00:00",
    "url": "https://www.billboard.com/music/music-news/lee-seung-chul-topples-sistar-for-no-1-on-k-pop-hot-100-1568680/"
}