{
    "title": "Lee Hyori Declares Everyone ‘Miss Korea’ in First Single in 3 Years – Billboard",
    "text": "2013 marks a decade in the K-pop industry for Lee Hyori. The K-diva is back with an understated new pre-release single \"Miss Korea\" before unveiling her fifth album. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin This year marks a decade in the K-pop industry for Lee Hyori. Despite spending the last three years on hiatus, the K-diva is back with the lovely new single “Miss Korea,” a pre-release before unveiling her fifth album on May 21. “Miss Korea” is an understated, jazzy ditty. While many K-pop fans remember Lee Hyori rocking fierce hip-hop and dance sounds in singles like “Chitty Chitty Bang Bang” and “Get Ya,” the song is a nice way to remind fans of the singer’s talent first and foremost. Plus, this is likely to be enjoyed by both older and younger generations with its classic, acoustic production. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t05/08/2013  The lyrics of the song, written by the singer herself, tell a positive message. The song says that everyone is great just the way they are and anyone can be “Miss Korea.” The confident words on the catchy chorus beg to be shouted (which translates to “Because I’m a Miss Korea! I’m the best girl in the world!”). The message is one undoubtedly needed to be heard more in South Korea; a country infamous for the major role plastic surgery plays in society. With the positive message, Lee Hyori and back-up dancers play actual “Miss Korea” beauty pageant contestants with a tongue-in-cheek twist. In different scenes, the star is surrounded by plastic surgery instruments and performs with drag queens. The drag queen inclusion may, perhaps, be yet another kick in the pants to South Korean society’s conservative mindset on homosexuality. All the while, the singer looks gorgeous in the 50/60s fashion and film styling for visual. Lately, it seems to be a (successful) trend for veteran artists to return with a pre-release single before their official lead single. Epik High returned in late 2012 with “It’s Cold” after two years gone and landed a K-Pop Hot 100 No. 1 before official single “Up.” As well, Cho Yong Pil made a major comeback knocking PSY’s “Gentleman” off the top with his pre-release “Bounce” track. With this majorly-anticipated return, Lee Hyori looks to be in good company when she makes her debut on the K-Pop Hot 100 (it didn’t exist when she last promoted in 2010). Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2013-05-08T05:45:01+00:00",
    "url": "https://www.billboard.com/music/music-news/lee-hyori-declares-everyone-miss-korea-in-first-single-in-3-years-1560748/"
}