{
    "title": "Less Expensive K-Beauty Skincare Products Score Green | Environmental Working Group",
    "text": "Creators of Skin Deep Database Tapwater Database EWG Verified The New LedeSearch WASHINGTON – A new EWG analysis of serums and essences, popularized by Korean beauty, or K-Beauty, finds that about 40 percent of the products were formulated with less hazardous ingredients. U.S. sales of K-beauty products have increased by almost 300 percent in the past two years alone. EWG researchers analyzed 352 products in the Skin Deep® database from U.S., European, Korean and other Asian companies, looking at the hazards posed by the ingredients and the price point per fluid ounce. Skin Deep assesses products based on the hazards associated with their ingredients. Consumers often assume that more expensive skin care products are made with healthier ingredients. This is not always the case. Many of the green-scoring products we assessed cost less per fluid ounce than did products with worse scores. Some of the most expensive products – costing as much as $640 per fluid ounce – scored in the red range. “We analyzed the ingredients used to make the serums and essences based on their hazard scores in Skin Deep,” said Kali Rauhe, an associate database analyst at EWG. “Sixty-six of the products met the strictest criteria for health and transparency, to earn the EWG VERIFIED™ mark. Five of these EWG VERIFIED™ products made our Best Bets list, meaning they are less hazardous for you and your wallet.” EWG researchers found that companies can make a trendy personal care product that also meets the rigorous standards for health and transparency dictated by the EWG VERIFIED™ program. “We wanted to highlight that product marketing, packaging and cost often have very little to do with the safety of the ingredients used in the product,” said Nneka Leiba, director of EWG’s healthy living science program. “Consumers are drawn to the design and price point without realizing that the information on the front of the package is not vetted by the Food and Drug Administration, the agency governing personal care products. So a company can claim almost anything and use almost any ingredients without penalty because they’re so poorly regulated.” The ingredient “fragrance” was found in nearly half the products evaluated. Ingredients classified under this umbrella term can be made up of a mixture of more than 3000 chemicals, including endocrine-disrupting phthalates. EWG’s assessment found some serums and essences also contained long-chain parabens, which have been linked to endocrine disruption as well. Endocrine disruptors often mimic hormones and disrupt the body’s endocrine system. This disruption affects many normal processes and development in the body. Exposure to endocrine disruptors has been linked to infertility, an increased risk of cancer, harm to metabolism and interrupted brain development. Consumers can use resources like Skin Deep to avoid products made with endocrine disruptors so that they decrease their overall body burden. “This is one reason why cosmetics reform is urgently needed,” said Leiba. “Companies can use almost any ingredient to make their products. People are exposed to chemicals like endocrine disruptors every day, but they can take steps to reduce their exposure with tools like EWG’s Healthy Living app or by buying products with the EWG VERIFIED™ mark. All of the ingredients used in consumer products should come with a cache of safety studies so we know how they’ll affect our health.” A new study from the Center for Environmental Research and Children’s Health at the University of California, Berkeley, found that exposure to endocrine-disrupting chemicals used in a wide array of personal care products has been linked to early puberty among girls. Until Congress updates the law regulating cosmetics, consumers need to rely on third party seals to know which products meet the highest standards for transparency and health. With the EWG VERIFIED™ mark, consumers know that researchers have found no worrisome ingredients, like the potentially harmful chemicals hidden under the umbrella term “fragrance,” and that the companies use good manufacturing practices. “If scientific evidence indicates that an ingredient is worrisome or concerning for health, the consumer should avoid it, because there are better options available,” said Leiba. “Europe has banned or restricted more than 1000 ingredients. In the U.S., consumers are used as guinea pigs. Until we’re sure that an ingredient is safe, people should choose a healthier option.” Cosmetics are woefully underregulated, and companies are not required to test their products for safety before they hit store shelves. Until the laws are strengthened, consumers should choose products that score well in Skin Deep or have been verified by EWG. They should also support companies that have reformulated their products to make them healthier. If a favorite product scores poorly, consumers should contact the company and tell it to do better. Here is the list of EWG’s “Best Bets” products:  ### The Environmental Working Group is a nonprofit, non-partisan organization that empowers people to live healthier lives in a healthier environment. Through research, advocacy and unique education tools, EWG drives consumer choice and civic action. View the discussion thread. In a major win for people aiming to live healthier lives, EWG has helped usher in six new California laws that will reduce exposure to harmful chemicals in food, cosmetics and other products – and... Babies spend most of their time in a crib. But many crib mattresses contain toxic chemicals that can harm the baby. If you’ve ever inexplicably felt sick around a new mattress or curtains, using air freshener, or visiting a nail salon, it could be you’re affected by chemicals called volatile organic compounds, or... On average, Americans spend almost nine hours a day sleeping – a huge amount of time. When you also factor in time just relaxing in bed, maybe reading or scrolling on a phone, it adds up to a... Environmental Working Group 1250 I Street NW\nSuite 1000\nWashington, DC 20005 All Offices    Contact Us EWG is a 501(c)(3) nonprofit corporation, EIN 52-2148600. Copyright © 2023, Environmental Working Group. All rights reserved.\nVisit EWG's 501(c)(4) organization, EWG Action Fund. Creators of Skin Deep Database Tapwater Database EWG Verified The New LedeSearch ",
    "datetime": null,
    "url": "https://www.ewg.org/news-insights/news-release/less-expensive-k-beauty-skincare-products-score-green"
}