{
    "title": "Lipstick in kindergarten? South Korea's K-beauty cosmetics industry targets young girls - NZ Herald",
    "text": "Share this article A young girl applies lipstick made for children at PriPara Kids Cafe in Yongin, South Korea. Photo / Jean Chung, Washington Post Last year in kindergarten, Yang Hye-ji developed her morning routine. Uniform? Check. Homework? Check. Makeup? Definitely. \"Makeup makes me look pretty,\" the 7-year-old said on her second visit to the ShuShu & Sassy beauty spa in Seoul. She was wrapped in a child-size pink robe and wearing a bunny hairband. Her face was gently touched up with a puff. Her lips got a swipe of pink gloss. South Korea's cosmetics industry, known as K-beauty, has become an Asian powerhouse and global phenomenon for its rigorous step-by-step regimens. But exacting beauty norms also put enormous pressure on South Korean women, making the country one of the world's centres for plastic surgery. And increasingly, the beauty industry is looking at younger and younger girls. That is stirring concerns that touch on many core social debates in South Korea: how much a society should value appearance, whether messages about beauty crowd out other aspirations for young girls, and whether it's right to add even more pressure to an already stress-packed childhood of long school hours and make-or-break exams. \"The shiny cartoon heroines young girls admire are fully made up from head to toe,\" said Yoon-Kim Ji-yeong, a professor at the Institute of Body and Culture at Seoul's Konkuk University. \"As they put on the makeup and put on the dress to imitate the characters, girls internalise that a woman's success is closely associated with beauty.\" Advertisers are not subtle. \"I watch my mom and I follow her. I am growing up today,\" a billboard advertisement selling makeup kits for 6-year-olds proclaims, with a photo of a young girl in school uniform applying lipstick. A YouTube video of a 7-year-old putting on lipstick, titled \"I want to wear makeup like mom,\" has attracted 4.3 million views, while similar videos show young girls sharing their \"elementary school makeup routine\" and \"unboxing my Hello Kitty makeup kit\". ShuShu Cosmetics is a pioneer in K-beauty's outreach to children. Started in 2013, it operates 19 boutiques across South Korea, offering \"healthier\" cosmetics for kids, such as water-soluble nail polish, and nontoxic lip crayons in a range of \"edible\" colours. There are sticker earrings and tattoos, \"sun-whipping\" cream cleanser, \"fancy girl\" soap and goat-milk shampoo carrying the slogan: \"I'm not a baby.\" In the spa and beauty parlour, girls ages 4 to 10 can enjoy a spa experience for $25 to $35, featuring a foot bath, a foot and calf massage, a face mask and makeup, and a manicure and pedicure. \"The motto of our beauty spas is that children can connect with their moms while playing with them,\" said Grace Kim, a manager at ShuShu Cosmetics. \"Our products are safe for pregnant women, as well.\" This is hardly a trend that is exclusive to South Korea. Kylie Jenner has built a cosmetics empire worth an estimated $900 million largely targeting teenage girls, while child beauty vloggers are also popular in the United States and elsewhere. For decades, academics of all stripes have pored over the impact of pressure on teenagers and young women in the West to conform with unreasonable standards of appearance and body type. But such concerns in South Korea also now include girls so young they can barely read the packaging on the beauty products aimed at the kindergarten crowd or younger. South Korea is home to one of the world's top 10 beauty industries, worth in excess of $10 billion, with per capita cosmetics spending of $45 in 2017, higher than the $37 Americans spend and a global average of $21, according to market research firm Mintel. It has one of the highest rates of plastic surgery in the world. One in three women aged 19 to 29 say they have undergone procedures, especially on their eyelids, according to a Gallup survey. It also has the world's highest number of plastic surgeons per capita, according to a 2017 study by the International Society of Plastic Surgery. K-beauty is also becoming popular in the United States. Last month, Democratic Reprsentative Alexandria Ocasio-Cortez shared her skin care routine inspired by K-beauty's elaborate multistep skin care regimen involving an arsenal of products. ShuShu is already selling its kids' cosmetics in Singapore and Thailand, and plans to expand to the United States and elsewhere. The kids' beauty market is expanding as makeup is promoted as a \"new play culture\" for children, said Lee Hwa-jun, an expert on South Korea's beauty industry at Mintel. \"Cosmetic companies in South Korea are increasingly interested in children as potential new consumers.\" Relatively small start-up companies are leading the way, Lee says. \"Cosmetic giants also show interest in expanding their customer base to younger women, but they are carefully weighing the pros and cons, as targeting children could stir a backlash.\" Some women are already fighting back. Freelance makeup artist Seo Ga-ram declared she would refuse clients' requests to apply cosmetics to child models. \"I found it absolutely bizarre that actual makeup kits have come in place of toys that children play with,\" she wrote in a Facebook post in May. \"Please stop consuming images of children posing with heavily coloured cheeks, red lips and curled hair.\" Nevertheless, the trend appears impossible to stop, said Kim Ju-duck, a professor of beauty studies at Sungshin Women's University in Seoul, as the media increasingly shows images of young girls wearing makeup, and cosmetics are accessible to preteens and younger children. He surveyed 288 girls in elementary school in 2016 and found that 42 per cent wore makeup. He said the proportion had risen since then. At the PriPara Kids Café on the outskirts of Seoul, girls ages 4 to 9 can dress up like their favorite anime character, enjoy a spa and have light makeup applied. They can bounce on a trampoline, shop for food in a play store, strut down a catwalk, perform their favorite K-pop song in a recording booth and dance in a mirror-lined studio. PriPara positions itself as a \"fun-filled space for children to learn beauty and grooming in a hazard-free environment,\" said the cafe's manager, Moon Young-sook. \"Girls naturally like to play with their mom's makeup,\" she said. \"Rather than putting on Mom's lipstick laden with chemicals, the pretend makeup here is a safer way to fulfill girls' dreams.\" Kwon ji-hyun, 36, brought her 6-year-old daughter and her 2-year-old son on a recent visit. She said the space reflects \"a girl's fantasies, a girl's psyche\". \"It does take children too early into gender roles,\" she said. \"But my daughter doesn't have a skewed gender role. I didn't raise her to have a very set idea about gender roles.\" But critics see a more damaging trend. \"From K-pop divas to K-beauty cosmetics, the market capitalising on women's objectification has become a hyper-saturated 'red ocean' in South Korea,\" said Yoon-Kim of Konkuk University, using a term describing an existing market with cutthroat competition. \"The market sees a 'blue ocean' for expansion in younger customers, ready to instigate and monetise their insecurities about their appearance.\" Share this article It's spooky season, which only means one thing - who's going to win best-dressed? ",
    "datetime": null,
    "url": "https://www.nzherald.co.nz/lifestyle/lipstick-in-kindergarten-south-koreas-k-beauty-cosmetics-industry-targets-young-girls/SLJI2DQHPJKRHNK3F5XMKAKDSE/"
}