{
    "title": "Little Mix’s ‘Wings’ Goes K-Pop With New Version: Listen – Billboard",
    "text": "A K-pop version of Little Mix's Billboard Hot 100 hit \"Wings\" landed on South Korean online music retailer Melon on Monday. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin Little Mix go K-pop?! Apparently so! On Monday, a Korean version of Little Mix’s Billboard Hot 100 hit (and UK No. 1 single) “Wings” surfaced on South Korean online music retailer Melon. Like many K-pop songs, the verses are sung mostly in Korean with English words peppered in. The original English chorus remains.  Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news While many K-pop acts have tested the Western pop market’s waters with English singles (such as BoA, Rain, Wonder Girls, BIGBANG, Girls’ Generation, 2NE1, miss A), rarely is the inverse seen with a Western act going Korean.  With a colorful image and hugely supportive fanbase, Little Mix isn’t too far a stretch from other K-pop girl groups — perhaps a more R&B-leaning SISTAR? Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t08/19/2013 Whoever they may emulate, the inspiration may have come from South Korean reality singing competition “K-Pop Star,” where a competing girl group quartet covered “Wings” on the show’s second season this January. Watch the cover — that delighted the judges — below:  At press time, representatives for Little Mix had not responded to K-Town‘s request for comment. Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2013-08-20T00:11:43+00:00",
    "url": "https://www.billboard.com/music/music-news/little-mixs-wings-goes-k-pop-with-new-version-listen-5657779/"
}