{
    "title": "Looking good under a mask: South Korean fashion evolves in the time of coronavirus | Reuters",
    "text": "Discover Thomson Reuters By Hyun Young Yi, Josh Smith 3 Min Read SEOUL (Reuters) - From tutorials on how to wear makeup with a face mask, to hats that incorporate a protective plastic face shield, South Koreans are seeking to make sure the coronavirus outbreak doesn’t damage their reputation for style. In one video that has gathered tens of thousands of views, 29-year-old beauty YouTuber SSUNZY gives tips for applying makeup in a way that looks good under a mask. “It’s very, very unfortunate that a mask hides your face,” she says in the video. “You can’t show off your charm. I’m going to do makeup that makes your face look good even when you’re wearing a mask.” SSUNZY recommends that viewers use more moisturizer, and stick to more natural shades rather than heavy colouring. A hydrating foundation, for example, makes it easier to touch up makeup after removing a mask, she said. Those practices seem to be popular, with sales of more colourful cosmetics falling while sales of skincare products have increased “We saw an increase in skincare product sales during the month of March compared to the previous month,” said Amorepacific Group, South Korea’s largest cosmetics powerhouse. “Anti-aging products show the most stable sales.” The ubiquitousness of face masks has made them an everyday fashion item for South Koreans, with K-pop music stars helping spread their popularity. “The public has become more comfortable with them as a countermeasure (to coronavirus) because G-Dragon wears them, BTS wears them, everybody wears them, so why can’t I wear them?” Korean fashion designer Park Youn-hee, who often works with K-pop idols including BTS and Girls’ Generation, said at her showroom in Seoul while suggesting a fashion style that fits for a face mask. “To us, and to K-fashion, the mask is a signature item.” Like many countries, South Korea has faced shortages of face masks. The government has imposed a rationing system to limit the number of masks each person can buy each week and placed export restrictions on masks. In response, some South Koreans have turned to other ways of combining protection and fashion. One item seen for sale in shops and online are hats with a clear plastic face shield. People of all ages have been seen wearing the hat in Daegu, the centre of South Korea’s coronavirus outbreak. “It goes well with all casual clothing,” Park said of the hats. South Korea has reported over 8,500 confirmed cases of coronavirus. Park said people should embrace some of the anonymity provided by masks and push the boundaries of their personal style. “I think a mask is an item that can give you confidence since people don’t recognise you clearly,” she said. “Try bold colours and different looks.” Reporting by Hyun Young Yi and Josh Smith. Writing by Josh Smith. Editing by Gerry Doyle Our Standards: The Thomson Reuters Trust Principles. All quotes delayed a minimum of 15 minutes. See here for a complete list of exchanges and delays. ",
    "datetime": null,
    "url": "https://www.reuters.com/article/us-health-coronavirus-southkorea-fashion-idUSKBN2170IB"
}