{
    "title": "\r\nLove Edellis, the representative brand of 'K-beauty and eco-friendly body mask pack,' participates in the '2022 Cosmoprof Worldwide Bologna Fair'",
    "text": "Most Popular G-Dragon booked for drug use South Korea, Qatar agree to elevate ties, forge $4.6b industry partnership Former Olympic hero battles rumors surrounding her groom-to-be S. Korea goes all out to contain lumpy skin disease Yoon pitches S. Korea's investment appeal to Middle East Yoon meets Park, honors father in gesture of conservative unity 4-meter deep sinkhole injures 1 in central Seoul Olympic medalist ‘tricked’ by fiance-turned-stalker [News Focus] A year after Halloween crowd crush, legislation remains stalled Braving wind and high water to celebrate Dokdo Day Start your day with a roundup of key stories from The Korea Herald with news and comment on all that’s happening in Korea. Published : April 20, 2022 - 11:10 Link copied SEOUL, South Korea, April 20, 2022 /PRNewswire/ -- Love Edellis, a representative brand of body mask packs for all body parts from hair to toe, will participate in the 2022 Cosmoprof Worldwide Bologna Fair in Italy and officially start exploring the global market. Love Edellis, a Swiss eco-friendly cosmetics brand using K-beauty technology with a focus on body mask packs The Swiss eco-friendly brand Love Edellis, which leads the trend of K-beauty technology, announced on the 11th that it will participate in the Cosmoprof Bologna, a beauty fair to be held this year, to enter the global market officially. The Cosmoprof Bologna is the world's largest and most prestigious beauty fair and a comprehensive beauty industry fair that will begin in Italy, followed by Hong Kong, Las Vegas, India, and Thailand. In particular, 3,300 companies from more than 70 countries, including Europe, Asia, and North America, had participated in last year's fair, drawing global attention. This year's fair will be held from April 28th to May 1st in Bologna, Italy. As a brand born in Switzerland of vast nature, Love Edellis continues to take steps toward nature and stated that it will showcase various eco-friendly products, including body mask packs using new eco-friendly materials that obtained USDA Certification and basic products using biodegradable and post-consumer recycled(PCR), recyclable packaging at this year's Cosmoprof Bologna. Love Edellis established a Korean branch, Edellis Korea, to develop various products based on Korea's advanced technology that has become a global beauty trend. It also collaborated with ELUO (CEO Park Yoo-seok), which developed and received a patent for the world's first all-in-one hand and foot mask pack, becoming one of the representative brands of body mask packs. ELUO, which acquired a patent for body mask packs for all body parts from hair to toe based on its product development expertise, was invited to participate in the Cosmoprof Bologna. During this time when home care and self-care markets have expanded due to the prolonged Covid-19 and post-pandemic era, Love Edellis will continue its growth by participating in the Cosmoprof Bologna. ELUO, a partner company, is a global cosmetics company that produces and supplies the highest quality cosmetics to more than 50 countries worldwide and is emerging as a global company with a presence in more than 50 countries, including France, Italy, the U.S., the Middle East, Japan, Australia, and Southeast Asia, based on its excellent products and technology. While the K-beauty craze is trending globally, ELUO is also accelerating exports by aggressively pushing marketing in the global market, including the U.S. Love Edellis is an eco-friendly brand that started with Swiss' beautiful nature and clean air and produces cosmetics that care for sensitive skin without irritation. All of Love Edellis' products use ingredients that are harmless to the skin and the environment, created with the consideration of the customer and the environment and adding art to allow consumers to enjoy their me-time and relaxing life. Love Edellis' signature products are body mask packs for dry areas, such as hands and feet, and a 3-type art mask pack containing the brand's main ingredient, the edelweiss extract. Love Edellis announced that it will broaden its products to basic cosmetics based on Korean technology to expand its market dominance in the beauty market. An ELUO representative said, \"ELUO plans to understand the global market trends by participating in Cosmoprof beauty fair with the invitation of Love Edellis. Through continuous research and development, we will expand our global market dominance with global cosmetics OEM·ODM leading the rapidly changing cosmetics market.\" Love Edellis Website_ www.edellis-cosmetics.comEdellis Korea Website_ www.edelliskorea.comLove Edellis Instagram_ @love.edellisELUO (Partner Company) Website_ www.eluo.com  The Korea Herald by Herald CorporationCopyright Herald Corporation. All Rights Reserved.  ",
    "datetime": "2022-04-20T10:50:00+09:00",
    "url": "https://www.koreaherald.com/view.php?ud=20220420000464"
}