{
    "title": "L’Oréal’s k-beauty acquisition: the latest big player to act",
    "text": "Or wait... Headlines Brand Innovation Formulation & Science Packaging & Design Business & Financial Market Trends Regulation & Safety Promotional Features Site Archive Multimedia Hot Topics Clean & Ethical Beauty Brexit COVID-19 Protection and Microbiome Active beauty and nutricosmetics Animal Testing Sustainability and circular beauty Beauty tech and digital Financial focus Naturals and organics Site Archive Multimedia Resources Type of resources Events All Events Shows & Conferences Online Events Editorial Webinars Events  27-Jun-2018\n                            - Last updated on\n                                26-Jun-2018 at 16:16 GMT It’s the latest move from a major player to buy into the Asian demand for k-beauty, following Unilever’s acquisition of Carver Korea​ at the end of last year, and is a sign that global appetite for the Korean beauty is there. Stylenanda began as a fashion business and is now spearheaded by its makeup brand 3CE (it makes up 70% of the company’s business), with a turnover of 127 million euros in 2017. It’s a sign that k-beauty is ready for the international market, both in Asia and more broadly, according to L’Oréal. \"With this acquisition, L'Oréal Korea will substantially reinforce its presence in the accessible make-up market. We are very proud to welcome the Group's first Korean beauty Brand and contribute to bring Korean beauty and style to the rest of the world​,” confirms Yann Le Bourdon, president of L’Oréal Korea. Alexis Perakis-Valat, President of L'Oréal's Consumer Products Division, also emphasised this international focus: \"We are thrilled to welcome this cool Korean brand in the L'Oréal family. Stylenanda captures Seoul's vibe, edge and creativity. It is perfectly positioned to nourish the growing appetite for make-up of millennials in Korea, China and beyond.\" ​ What is the future of k-beauty?​​ While this acquisition confirms the trend for k-beauty is still on the rise, where it’s likely to grow is up for discussion. In a feature published this week on our sister site CosmeticsDesign-Asia​, editor Natasha Spencer spoke to Ju Rhyu of Inside the Raum, who revealed the current state of k-beauty and where it’s likely to move from here. Find the full article here​. One key concern Rhyu picked out was, given the rising international presence of the trend, there is a growing lack of clarity on what exactly constitutes a k-beauty product and brand. “The K-Beauty boom in the US has unfortunately led to a dilution of what defines a K-Beauty brand. You see American brands like Julep that has a Korean American founder play into the K-Beauty trend,”​ she explains. “You see retailers like Sephora group Japanese brands like SKII under the K-Beauty section and Western brands like Glam Glow create “Korean-inspired” products. ​ “Do they qualify as K-Beauty? I say no. Part of the problem is that there is no definition or standard for what makes a K-Beauty brand.”​ Find out her recommendations for how to define a k-beauty player, and full insights on the current state of the segment, here​. Copyright - Unless otherwise stated all contents of this web site are © 2023 - William Reed Ltd - All Rights Reserved - Full details for the use of materials on this site can be found in the Terms & Conditions Related topics\nBusiness & Financial\nBeauty tech and digital\nColour Cosmetics Show more More promotional features ",
    "datetime": null,
    "url": "https://www.cosmeticsdesign-europe.com/Article/2018/06/27/L-Oreal-s-k-beauty-acquisition-the-latest-big-player-to-act"
}