{
    "title": "L’Oréal hosts first North Asia Beauty Innovation Summit - Global Cosmetics News",
    "text": "TRENDING: Posted by Georgina Caldwell | Nov 9, 2022 | Asia & Australasia, Ingredients, Technology | THE WHAT? L’Oréal hosted the first-ever North Asia Beauty Industry Innovation Summit during the China International Import Expo, focusing on the future of beauty powered by technology and innovation through co-creation in Japan, China and Korea. THE DETAILS The event was attended by key stakeholders from different industries and markets and speakers included experts from beauty, green sciences, AI, digital and medical sectors. During the Summit, L’Oréal decoded the latest consumer trends in the region around four key themes, namely self-expressive beauty, supercharged efficacy, skinification and sensorial matters. The company also illustrated key innovation breakthroughs echoing these trends, such as 3CE’s New Color Effects, Lancôme’s Dual LED Youth Treatment, YSL’s Touche Eclat Glow-Pact, Prada’s Paradoxe Fragrance, and Shu Cleansing Oil’s Shu Purifying Ritual. THE WHY? Fabrice Megarbane, President of L’Oréal North Asia & CEO of L’Oréal China, revealed, “L’Oréal is delighted to host the North Asia Beauty Industry Innovation Summit at this year’s CIIE.  The North Asia region represents more than one third of the world’s total beauty market. It has a unique eco-system of what we call the Beauty Triangle of C-beauty, J-beauty and K-beauty. There are a lot of cultural relevance and commonalities in beauty needs in the region while each market brings unique strengths. This dynamic is what makes the North Asia region special, not only as a growth engine but also an inspiration for technology advancement and innovation empowering beauty. The purpose of this event is to bring together the different wisdoms and accelerate technology and innovation through co-creation in the region.” Share: Rate: LATEST NEWS Unilever settles in trademark dispute ov...   Walgreens to settle Rite Aid suit for US...   L’Occitane Q2 2024: Sales rise 17....   Two Target executives to retire   Gillette signs up for another season as ...   PRESS RELEASE: Society of Cosmetic Chemi...   L’Oreal to dump Decleor in derma shake-u...   Hermes Q3 2023: sales up 16 percent to €...   Amazon to face lawsuit over data trackin...   J-beauty retailer Yoshitsu to open store...  GLOBAL COSMETICS NEWS Contact UsSubscribePrivacy PolicyCookie PolicyTerms & Conditions SOCIAL MEDIA FacebookTwitterInstagramLinkedInSoundCloudRSSYouTube NEWS HomeAll Regions Cosmetics News WirePodcastOpinionFashionProfessional BeautyTravelWellnessTop 100 Brands Copyright © 2023 Global Cosmetics Media Limited ",
    "datetime": "2022-11-09T06:01:00+00:00",
    "url": "https://www.globalcosmeticsnews.com/loreal-hosts-first-north-asia-beauty-innovation-summit/"
}