{
    "title": "L’Oréal channels K-beauty with Shihyo joint venture",
    "text": "The new Asia-inspired skin care brand has been created in collaboration with Hotel Shilla and Anchor Equity Partners L’Oréal has teamed up with Hotel Shilla and Anchor Equity Partners to launch a new luxury skin care brand, Shihyo, via the Loshian third-party joint venture. It marks the first time L’Oréal has brought a beauty brand to market through a joint venture model. Shihyo, which means ‘the wisdom of time’, is said to be inspired by the Asian concept of 24 seasons. The line-up features 24 ampoules based on different herbal ingredients, facial cleanser, essence and cream, as well as scalp care products, such as shampoo and conditioner. The 24 herbal ingredients that form the basis of each ampoule are said to be harvested at the peak of each season and are sourced directly from local farmers in Korea. All formulas include the brand’s signature ingredient ShiHyo24, a patented, nutrient-rich concentrate of the 24 herbal ingredients infused with fermented rice water and ginseng water. “Rooted in an exceptional traditional wisdom and knowledge of naturality, Shihyo represents the epitome of Asian luxury beauty,” said Cyril Chapuy, President of L’Oréal Luxe. “Empowered by science, Shihyo delivers the highest skin care quality thanks to its signature patented ingredient, offering the most elevated luxury beauty experience.” Hotel Shilla is a South Korean operator of luxury hotels and duty-free shops, while Anchor Equity Partners is a private equity firm focusing primarily on consolidation and growth opportunities in Asia. The first Shihyo flagship store, called Seoul Garden, will open in coming months at The Shilla Seoul Hotel in Korea; it aims to offer an immersive experience with an extensive luxury beauty range. “With our rich retail expertise married with L’Oréal’s strong brand building capabilities, we believe Shihyo will elevate the desire for natural, luxury beauty in Asia,” said In-Gyu Han, COO of Hotel Shilla. “We are glad to join this partnership to support the growth of the most unique brand in Asia and globally,” added Sanggyun Ahn, Managing Partner of Anchor Equity Partners. “We have full confidence that Shihyo will meet the discerning consumers’ needs with new luxury beauty routines.” Through digital, live and print products, Cosmetics Business informs and inspires business leaders and decision-makers around the world. With a digital-first strategy, the Group’s Editors write breaking news, product releases, technical papers, innovation features, trend reports and live content agendas covering the entire industry from ingredients and packaging to regulation, retail and marketing. ",
    "datetime": null,
    "url": "https://www.cosmeticsbusiness.com/news/article_page/LOreal_channels_K-beauty_with_Shihyo_joint_venture/205055"
}