{
    "title": "MAC Cosmetics is Launching A K-Beauty-Inspired Collection With Pony Park | BEAUTY/crew",
    "text": "The celestial collection you’ll want to add to your kit Beauty Crew Digital Content Editor / August 27 2019 The celestial collection you’ll want to add to your kit Beauty Crew Digital Content Editor / August 27 2019 With a casual 6.6 million followers on Instagram and 5.2 million YouTube subscribers, Pony Park Hye-Min is, without a doubt, one of the biggest beauty influencers of our time. Now, the Korean megastar has teamed up with MAC Cosmetics to release a K-Beauty-inspired makeup collection, and the range is positively spellbinding. Drawing on the aesthetic of tarot cards and astrology, the MAC Cosmetics x Pony Divine makeup collection features products designed to help you nail those big K-Beauty trends, like the perfect ombré lip and radiant, lit-from-within skin. “My collection with MAC is super meaningful to me in that I am able to bring K-Beauty, Korean culture, and Asian beauty and culture to the global market,” said Pony in a press release released by MAC Cosmetics. And the products look absolutely dreamy in their celestial-themed packaging. Included in the line is a ground-breaking new product: the Matte Lip Mousse. It has a weightless formula and a misty soft-matte finish to help you perfect the sought-after, gradient lip trend that’s huge in K-Beauty right now. Also featured in the collection are whimsical new shades of MAC Cosmetics’ Extra Dimension Skinfinish and a shimmery version of the cult-favourite Prep + Prime Fix+ makeup setting spray to help you achieve the elusive ‘glass skin’ look. The range is set to drop on 2 October at Mecca Maxima and then 7 October at MAC Cosmetics stores and maccosmetics.com.au. Check out the MAC Cosmetics x Pony Divine makeup collection teaser video below: If you’re looking for more exciting new beauty launches, you may like to hear about Selena Gomez’s upcoming beauty range. Main image credit: Supplied Isobel is a Digital Content Editor at BEAUTYcrew, marie claire and InStyle. When she's not busy hunting for the latest beauty news, you’ll find her arranging her skincare collection in search of the perfect “shelfie.” Isobel was previously BEAUTYcrew's Junior Beauty Writer. Article Article Article Article Article Article Article Article © Copyright  2023 Are Media PTY LTD All products are independently selected, tested or recommended by our team of experts. If you buy something, we may earn an affiliate commission.\r\n                                            Are Media and its brands may have generated text partially using generative AI. Upon generating draft language, our editors review, edit, and revise it to their own liking. \r\n                                            We take ultimate responsibility for the content of our publications. © Copyright  2023 Are Media PTY LTD All products are independently selected, tested or recommended by our team of experts. If you buy something, we may earn an affiliate commission.\r\n                                Are Media and its brands may have generated text partially using generative AI. Upon generating draft language, our editors review, edit, and revise it to their own liking.\r\n                                We take ultimate responsibility for the content of our publications. © Copyright  2023 Are Media PTY LTD All products are independently selected, tested or recommended by our team of experts. If you buy something, we may earn an affiliate commission.\r\n                            Are Media and its brands may have generated text partially using generative AI. Upon generating draft language, our editors review, edit, and revise it to their own liking.\r\n                            We take ultimate responsibility for the content of our publications. ",
    "datetime": "2019-08-27 00:00:00",
    "url": "https://www.beautycrew.com.au/mac-cosmetics-k-beauty-pony-park"
}