{
    "title": "MAC partners with South Korean pop star Lee Hi",
    "text": "Or wait... Headlines Brand Innovation Formulation & Science Packaging & Design Business & Financial Market Trends Regulation & Safety Promotional Features Site Archive Multimedia Regions All Asia-Pacific South East Asia South Asia East Asia Oceania Site Archive Multimedia Hot topics Clean & Ethical Beauty Sustainability COVID-19 Market Entry Anti-Aging / Skin Whitening Beauty From Within Nanotechnology Green Cosmetics Site Archive Multimedia Resources Type of resources Events All Events Shows & Conferences Online Events Editorial Webinars Events China 中国 Podcast  09-Jul-2017\n                            - Last updated on\n                                10-Jul-2017 at 11:00 GMT Related tags\nSouth korea\nKorea Pop star, Lee Hi, has joined the global beauty player on its marketing campaign for its limited edition lipstick called Lee Hi. K Beauty expansion​ As South Korea’s trade surplus sees the K-beauty phenomenon expand into US and European core markets: Spain, Italy and France,​ MAC focuses on building its presence through leveraging the popular K Beauty trend. Lee Hi, who appeared as a contestant on the K-Pop Star talent contest, now appears in MAC’s Future Forward campaign. As part of the campaign, the brand collaborates with emerging names from around the globe. The official MAC Cosmetics website has a caption that reads “Lee Hi thrilled South Korea on the TV show phenomenon K-pop star and is set to take on the world, boasting a jazzy, retro-upbeat spin on pop music,”​ MAC Cosmetics announced on its website. “Her exclusive matte Lipstick is a deep red, dreamy enough to match Lee’s own style and star power.”​ Lip campaign​ Embracing the motto, ‘​All ages. All races. All sexes'​, MAC’s latest campaign features Korean pop star Lee Hi, British artist Dua Lipa and US singer Justine Skye. “It feels like a great thing to be able to support artists who are breaking through but aren’t necessarily at the top top, to push them forward,”​ James Gager, Senior VP and Creative Director, MAC told the press. The company, which was founded in Toronto, Canada, in  1984, released its latest campaign to boost the concept of beauty from within using the slogan “Your Choice. Your Creation. Your Trend”.​ It created an accompanying social media marketing push using the hashtag #MACLIPSLIPSLIPS. Popular Korean-inspired portfolio​ MAC has raised brand awareness in recent years through embracing several key trends. Air cushion compact cosmetics with BB and CC creams resonate strongly with consumers​, particularly in South Korea. MAC followed suit in March 2016 with its Matchmaster Shade Intelligence Compact. Due to the expansion of its free-standing store model​, last year, MAC witnessed particular growth in new markets as the company engaged with prospective and existing companies through pop-up stores. Copyright - Unless otherwise stated all contents of this web site are © 2023 - William Reed Ltd - All Rights Reserved - Full details for the use of materials on this site can be found in the Terms & Conditions Related topics\nBrand Innovation\nAll Asia-Pacific\nEast Asia\nBeauty From Within\nColor Cosmetics More promotional features ",
    "datetime": null,
    "url": "https://www.cosmeticsdesign-asia.com/Article/2017/07/10/MAC-partners-with-South-Korean-pop-star-Lee-Hi"
}