{
    "title": "Macy's Launches Peach & Lily Korean Beauty Store So You Can Shop Sheet Masks & More IRL",
    "text": "Fashion  It seems like every day there's a new it-beauty product or gadget on the market, but Korean beauty products have officially reached mainstream popularity. According to Fashionista, Macy's is launching a Korean beauty shop just in time for holidays, in conjunction with e-commerce site Peach & Lily. Known for curating the top K-beauty products for customers, the company is going brick-and-mortar for the first time. Ever since the rise of sheet masks, interest in K-beauty has reached a fever pitch, and now you won't have to take a chance online in order to see what the hype is about. Fashionista reports that the \"Peach & Lily shop-in-shop is set to debut next week in the Flushing, Queens, store in New York,\" so you can add the products to your holiday shopping list. Peach & Lily will host an in-house mini-store filled with gadgets and top of the line skin care finds. \"It was very much a conversation about what we thought and where we wanted to be. I really wanted to be in the Flushing location because skin care is really important there,\" Alicia Yoon, founder of Peach & Lily, told Fashionista. \"There are brands like Le Mer and Chanel and SK-II. It’s so elevated and that really stood out to me.\" According to the Peach & Lily site, Yoon's Korean skincare education is a big part of why she wanted to start her online store. \"We started with Korean and Japanese beauty products and rituals because these amazing time-tested beauty traditions were largely missing from the beauty dialogue and shelves in the U.S. a few years back,\" Yoon writes on her site. \"Education and personalization are hugely important.\" So important, in fact, that the Macy's Peach & Lily locations will offer in-store beauty coaches that will check up with their clients to see how their skin is feeling. I call that excellent customer service! It's been a big year for K-beauty products. Check out some of the coolest Peach & Lily offerings — because it's about more than just sheet masks. Binchotan Charcoal Eye Mask, $23, Peach & Lily If you've ever used a charcoal eye mask, you know the benefits. The four-layer eye mask relieves fatigue and tension while you sleep. Essential Massage Cream, $34, Peach & Lily Enriched with vitamins, minerals, and sunflower oil, this hydrating cream is meant to brighten your complexion. Aqua Petit Jelly BB, $20, Peach & Lily You've probably heard of BB cream, but this is a bit different. With a watery jelly consistency, it supposedly spreads more evenly and offers more natural coverage. Dress Code Maskpack, $4, Peach & Lily This masquerade themed sheet mask is made with blueberry to help rid the face of any fatigue. Calendula Juicy Cream, $37, Peach & Lily This vegan cream is made for all-day hydration and calms skin. Water Volume Ex Mask, $3, Peach & Lily Adding tons of moisture to your skin, this mask is perfect for the cold-weather months ahead. Miracle Seed Essence, $57, Peach & Lily Not only is this lotion perfect for moisturizing, but it works as a toner as well. According to the K-beauty site, the lotus seed extract is a bestseller in Korea. I don't know about you, but my Christmas list just got a little longer. Want more beauty tips? Check out the video below, and be sure to subscribe to Bustle’s YouTube page for more hacks and tricks! Images: peachandlily/Instagram, Peachy & Lily (7) Choose an edition: ",
    "datetime": null,
    "url": "https://www.bustle.com/articles/125224-macys-launches-peach-lily-korean-beauty-store-so-you-can-shop-sheet-masks-more"
}