{
    "title": "Major trends for in-cosmetics Korea revealed",
    "text": "Or wait... Headlines Brand Innovation Formulation & Science Packaging & Design Business & Financial Market Trends Regulation & Safety Promotional Features Site Archive Multimedia Regions All Asia-Pacific South East Asia South Asia East Asia Oceania Site Archive Multimedia Hot topics Clean & Ethical Beauty Sustainability COVID-19 Market Entry Anti-Aging / Skin Whitening Beauty From Within Nanotechnology Green Cosmetics Site Archive Multimedia Resources Type of resources Events All Events Shows & Conferences Online Events Editorial Webinars Events China 中国 Podcast  29-May-2016\n                            - Last updated on\n                                30-May-2016 at 05:49 GMT To be held 6 – 7 July in Seoul, in-cosmetics Korea​ will gather industry professionals from across the supply chain to discuss the latest issues and opportunities, particularly those stemming from the relentless international rise of K-beauty, along with global topics too. The in-cosmetics team has released an overview of the programme of workshops and speakers set to be showcased during the event, noting that these span three core groups: cosmetics science and technology; technical innovation; and marketing trends and regulation. Cosmetics science and innovation​ A series of seminars will tackle the latest big developments coming out of R&D for the industry, particularly those being driven by Korea, with biotech, stem cells, nanotechnology, nutricosmetics and in-vivo skin analysis all up for discussion. Key industry experts lined up to speak include Dong Wook Shin of the AmorePacific R&D Center, and Professor Yunhi Cho from Kyung Hee University, with the programme being organised in collaboration with Korea's National Coordinating Centre for Global Cosmetics R&D (NCR). Naturals will also be in the spotlight, as consumer enthusiasm for green cosmetics continues to dominate. Technical innovation​ A second programme of seminars is planned to tackle the key topics for technical innovation within beauty. “From pollution protection and peptides to emollients and biosurfactants, these sessions are a must for visitors who want to discover what the future holds​,” the event's organisers explain. Masaki Furuya from the Dow Chemical Company, Paulo Yoon from Gattefossé Asia Pacific, Keedon Park of Incospharm and Chang Wang from Lipotec are among the industry experts billed to give their insights at the event. Market trends and regulations​ The latest insights into current and upcoming consumer demand will be covered in a series of marketing trends sessions, tackling the latest for topics like anti-ageing and skin whitening, K-beauty and halal. Alongside these, a series of regulatory sessions will also take place, covering computer-based animal testing alternatives, Chinese regulations, and global ingredient regulatory compliance. Register for the event for free here​ before 1 July. Copyright - Unless otherwise stated all contents of this web site are © 2023 - William Reed Ltd - All Rights Reserved - Full details for the use of materials on this site can be found in the Terms & Conditions Related topics\nMarket Trends\nAnti-Aging / Skin Whitening\nNanotechnology\nGreen Cosmetics\nAsia in Focus Show more ",
    "datetime": null,
    "url": "https://www.cosmeticsdesign-asia.com/Article/2016/05/30/Major-trends-for-in-cosmetics-Korea-revealed"
}