{
    "title": "Make Up For Ever Has Always Had 40 Shades of Foundation for Dark Skin Tones | Allure",
    "text": "By Sable Yong Obviously the big big news in Foundation Today was about the release of Fenty Beauty because a) it's a Rihanna makeup line and b) all those shades — 40 of them, from light-light to dark-dark. The masses applauded the ambitiously broad shade range for a debut makeup line, dark shades were all sold out tout suite and pretty much the entire makeup-wearing Internet finger-wagged at the all the brands that neglected darker shades with flimsy excuses about no one buying them. MEANWHILE. Your main dude, Make Up For Ever (a brand founded on serving the cosmetic needs of theater and film) is hurt. Make Up For Ever has been supplying foundation in deep shades as well, and they would like to remind you that they've been by your side all this time. Maybe you just never noticed because they've been low-key this whole time, fulfilling your needs with no fanfare. Maybe they're too polite to make a move; they don't want to make you uncomfortable because they just love you too much to ruin the friendship. Maybe they're a little hurt that just because there's a hot new kid at school who seems to offer you everything you've been wanting, doesn't mean that they haven't been by your side, offering support this whole time. This content can also be viewed on the site it originates from. I mean, obviously there are vast differences between Make Up For Ever's Award-winning Ultra HD Foundation and a certain 40-shade newcomer, like undertone and finish (for some harsher critique, just scroll the comments on that Instagram post there). Some folks have brand loyalty and some folks want to try what's sexy and new — either way, it's cool. Do you. But, like, if you want a broad range of foundation shades with long-wear capabilities... Make Up For Ever's just sayin'... it's here for you, girl. 🤔 : By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Kara Nesvig By Gabi Thorne By Marci Robin By Georgia Day More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2017-09-26T22:10:53.578Z",
    "url": "https://www.allure.com/story/make-up-for-ever-40-shades-of-foundation"
}