{
    "title": "Make-up: Have YouTube stars boosted beauty sales? - BBC News",
    "text": "This video can not be played How YouTube is changing the face of beauty From expensive brushes to fingertips, luxury mascara to budget-friendly concealers - make-up lovers all have their own tips and tricks. Millions watch YouTube beauty tutorials every day. Watching vloggers empty out bags after their latest shopping haul, expertly applying eyeliner or chatting about trends has become a favourite pastime. So, BBC News asks, how much do we spend on make-up and how do YouTube stars influence what we buy? In 2017, global sales of (colour) cosmetics reached £34bn ($45.5bn). That includes anything from blushers and bronzers to face powders and lipsticks. Looking good is big business. Market analysts Mintel estimate that sales will increase by 6% in 2018, with the US predicted to spend the most on make-up at £9bn ($12.1bn). Japan and South Korea also feature in the top five. The two countries' cosmetics markets are valued at an estimated £4.8bn ($6.4bn) and £1.6bn ($2.2bn). J-Beauty and K-beauty, the two countries' beauty industries, are responsible for bringing new, innovative products to the market, from snail-extract creams to sheet masks. So far in 2018, people have watched (on average) more than a million beauty videos on YouTube every day. Cosmetics companies are teaming up with YouTubers in an attempt to reach younger consumers. Sending sample products to vloggers, buying advertising in fan-favourite tutorials and using YouTube stars as brand ambassadors are tactics used by beauty brands to get their products noticed. L'Oreal Paris recently featured YouTubers such as Rosie Bea and Jennie Jenkins in a campaign for its True Match foundation. MAC Cosmetics has also signed up Patrick Starrr, with more than 3.8 million YouTube subscribers, to launch five make-up collections. Allow YouTube content? This article contains content provided by Google YouTube. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Google’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’. If YouTubers receive payment or free products in exchange for a post, they must inform the platform when they upload the video. In the US, any paid partnership must also be explicitly labelled as an \"ad\" or as \"sponsored\". In the UK, the Committee of Advertising Practice says that product placement in a make-up tutorial should be flagged in text on the screen, or by the vlogger explaining they've been paid to talk about a certain item. Instagram influencers are also obliged to tag business partners in posts or stories they might have been paid for, or that feature product placement. The world's most popular beauty vlogger is Yuya, a 25-year-old Mexican beauty expert with more than 21 million subscribers. UK-based Zoella is the world's second most popular beauty vlogger, with 12 million fans subscribed to her YouTube channel. With magazine covers, bespoke beauty ranges and book deals to their names - it seems that beauty influencers' influence is on the up. Young women aged 16-24 were the most likely to have bought face make-up in the past year in the United Kingdom, Germany, France, Italy and Spain. Of young Italian women surveyed by Mintel, 95% had purchased face make-up, and concealer was the most popular product. Customers hand over their money for the latest beauty buys from a young age. According to the Office for National Statistics, seven- to nine-year-old girls in the UK spend on average 20p a week on cosmetics and toiletries, rising to £1.70 for girls aged 13 to 15. However, boys of all age ranges spend less than 10p per week on these items. With more than ever being spent on beauty products, big brands battle it out to grab potential customers' attention. In 2017, the world's most valuable cosmetics brand was L'Oreal, with sales of £21.4bn ($28.6bn). This was followed by Unilever, Procter & Gamble, and Estee Lauder - companies that own make-up brands such as Bobbi Brown and Clinique. The L'Oreal Group is now the largest cosmetics company in the world, having acquired brands such as Nyx Cosmetics and Urban Decay. Their liquid lipsticks and eye-shadow palettes are the feature of many YouTube tutorials and Instagram snaps. In Great Britain, the most popular colour cosmetics are face make-up products. Most spending on beauty in the past year went on foundation, concealers and powders, according to market researcher Kantar Worldpanel. Make-up primers and highlighters, used to accentuate features such as cheekbones, are growing in popularity as young women pick up tips from their favourite YouTubers. Charlotte Libby, global colour cosmetics analyst at Mintel, says: \"The growth in the number of tutorial videos available has created a generation of make-up users who are confident and experimental with make-up. \"Young women have embraced new products, and are confident bringing them into their product repertoire; contouring, baking and strobing are all professional make-up techniques which have made their way into the consumer market thanks to YouTube tutorials.\" Growing up with vloggers and photo filters, young make-up enthusiasts are looking to create a selfie-ready look at home. However, it seems that customers still value going to the shops and trying out new products for themselves. In the year to 8 April 2018, just 20.8% of spending on cosmetics in the UK was online. Meet YouTube's menstrual cup vloggers YouTube fame didn't bring theatre role Korean men are starting a beauty revolution Hundreds of police search for Maine gunman as 16 feared dead Israeli tanks cross into Gaza for 'targeted raid' Humanity blasted and broken: Gaza through a medic's eyes Seoul crush: Survivors still tormented a year on The unending pain of India's sewer workers Bowen: Israelis and Palestinians fear worst is yet to come How two 4-year-olds were killed and social media denied it How one of gaming's lost sequels finally got made The chaotic search for Speaker... in 120 seconds. VideoThe chaotic search for Speaker... in 120 seconds Russia goes back to prisons to feed its war machine The dark side of touch-screen tipping Humanity blasted and broken: Gaza through a medic's eyes The town telling influencers to stay away What if a rogue nation dimmed the Sun? Why so many veterinarians suffer © 2023 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking. ",
    "datetime": null,
    "url": "https://www.bbc.com/news/business-43966384"
}