{
    "title": "Male skin care and sheet masks K-beauty",
    "text": "Or wait... Headlines Brand Innovation Formulation & Science Packaging & Design Business & Financial Market Trends Regulation & Safety Promotional Features Site Archive Multimedia Regions All Asia-Pacific South East Asia South Asia East Asia Oceania Site Archive Multimedia Hot topics Clean & Ethical Beauty Sustainability COVID-19 Market Entry Anti-Aging / Skin Whitening Beauty From Within Nanotechnology Green Cosmetics Site Archive Multimedia Resources Type of resources Events All Events Shows & Conferences Online Events Editorial Webinars Events China 中国 Podcast  Exclusive interview 21-Aug-2017\n                            - Last updated on\n                                22-Aug-2017 at 11:04 GMT Related tags\nGlobal skincare analyst\nCosmetics\nHuman skin color\nUs Communicating values​ South Korean cosmetics labels, ingredients, and trends are on the up in the US. There are a number of brands that are successfully managing to convey the values of Korean beauty in the US, such as e-commerce K-Beauty brand, Glow Recipe. “Founders have been successful in creating K-Beauty narratives of South Korean brands for the cultural nuances and skincare routines of women in the US,”​ relayed David Tyrrell, Global Skincare Analyst, Beauty & Personal Care at Mintel. For instance, Glow Recipe’s Blithe Patting Splash Mask is a prime example of how the company “re-positioned a K-Beauty product to hit the mark with the younger US consumer online and in Sephora stores”,​ Tyrrell emphasised. The right message​ This should be no different in the US market, Tyrrell argues. Especially as K-beauty brands entering the West have “an opportunity to develop messages and products that appeal to the younger US male who is looking to expand his skin care routine”.​ South Korean brands have continued to remain a cosmetics phenomenon, yet companies in the US perceive there to be vast differences between South Korean and US male shoppers, which may be hampering the marketing efforts of US companies. However, these differences may not be the case. Replicating South Korean marketing messages, ingredient inclusions and claims may be a viable solution. All-in-one formats​ “Brands might want to focus on time savings with all-in-one formats and lean towards acne control products showcasing well-known US hero ingredients such as charcoal,”​ Tyrrell iterated. Mintel found that 64% of US men aged between 18-34 years old have a strong preference for natural and organic ingredients in beauty products. A storytelling approach that highlights natural and organic products also has the potential to align well with both US and South Korean markets. Pharmaceutical connections​ At present, K-beauty products are going through a transition phase “from specialty retail in outlets such as Ulta, Sephora, Urban Outfitters and Anthropologie to mainstream stores”​. Also, K-Beauty products have entered the US's largest pharmacy chain, based on prescription revenue, CVS Pharmacy. Tyrrell revealed that founder of e-commerce K-Beauty brand, Alicia Yoon, has been signed up to choose products to fill the new K-Beauty HQ at 2,100 CVS Pharmacy stores. The move into pharmacies is a smart one as US Millennials are “gravitating more to pharmacies to find 'reasonably priced' natural skincare that is elevated in formula and packaging beyond the ordinary moisturiser or cleanser”​. Price, natural skin solutions, and fun campaigns are still fundamental drivers in product selection. Dermocosmetics delivery​ There is also a host of K-Beauty brands such as Dr. Jart+ (Have & Be) and Dr. G.(Gowoonsesang Cosmetics) that offer more therapeutic or dermocosmetic products. These offer appealing attributes to the younger male consumer markets as they provide effective solutions to skin care problems such as acne-related issues, very dry or eczematous irritated skin. “The pharmacy offers a believable setting to educate younger men on the use of K-Beauty inspired therapeutic, natural-based products to improve, keep and protect healthier looking skin,”​ Tyrrell advised. Marketing needs to be a core endeavour of brands looking to communicate their K-Beauty story in the US “to create a K-Beauty-inspired narrative that is uniquely personalised for the US young male, much like how it has been executed successfully for US women”​. Favouring functionality​ With males still opting for products that aim to overcome functional skin care issues such as acne control, these products provide a good market entry option for those looking to enter the marketplace. “It will be important to show the effectiveness and speedy results,”​ Tyrrell emphasised. Therefore, “brands will need to cut down the sheet wear time to five minutes or less, since time has become a most valuable asset.”​ Moving away from the female skin care or unisex male facial sheet mask is now a key focus for brands. Mintel highlights how design plays a big part in helping to make this happen through male-focused innovations. Protective masks that are worn during sports or at work is a strong segment to explore to start building adoption rates. Crafting celebrity endorsements that show males with sheet mask-clad faces and the utilisation of social media platforms through content and vlogging are also popular avenues to generate engagement. Copyright - Unless otherwise stated all contents of this web site are © 2023 - William Reed Ltd - All Rights Reserved - Full details for the use of materials on this site can be found in the Terms & Conditions Related topics\nBrand Innovation\nPackaging & Design\nMarket Trends\nAll Asia-Pacific\nEast Asia\nMarket Entry\nAsia in Focus\nSkin Care Show more  Content provided by Provital | 13-Jun-2023\n                     | Product Brochure Circanblue™ is a vegan postbiotic ingredient obtained from Lactococcus lactis that induces a resynchronisation of the skin’s circadian cycle after this... More promotional features ",
    "datetime": null,
    "url": "https://www.cosmeticsdesign-asia.com/Article/2017/08/22/Male-skin-care-and-sheet-masks-K-beauty"
}