{
    "title": "Maleficent and 16 Other Great Female Villains | Time",
    "text": "Everyone knows that the most interesting character in any movie is the villain—and no more so than when the bad guy is a lady. Perhaps that’s why Disney decided to make its latest feature, Maleficent, a retelling of Sleeping Beauty from the evil queen’s point of view. It stars a gorgeous and fearsome Angelina Jolie with a cameo by her daughter Vivienne. Here are 16 other magnificently mean female characters from Cruella De Vil to Nurse Ratched, and of course The Wicked Witch of the West. Write to Eliana Dockterman at eliana.dockterman@time.com. Hell hath no fury like a woman scorned. Maleficent was so angry when she wasn’t invited to Aurora’s christening that she doomed her to fall into an eternal sleep. And as if that weren’t bad enough, when she was outwitted, she turned into a fire-breathing dragon. But before we judge too harshly, we ought check out this new Disney feature to see what the story looks like from her point of view: Angelina Jolie stars as the villainess in a live action version of the story opening today. Even more than Voldemort, Bellatrix was the most terrifying character in the Harry Potter universe. She took perverse pleasure in torture and cruelty. She murdered her own cousin, and Harry’s short-time father figure, Sirius Black, with a laugh. Helena Bonham Carter brought a new life to the character in the films with her gothic beauty. Has there ever been a villain as stylish as Miranda Priestly, a thinly veiled take on Vogue uber-boss Anna Wintour? Priestly rules young assistants (played by Anne Hathaway and Emily Blunt) and the rest of the fashion industry with fear and fury. The Devil Wears Prada may have been based on a roman a clef by Lauren Weisberger, but Meryl Streep’s fearless performance brought her to life with just a few sharp intakes of breath and a terrifying speech about a cerulean sweater. With her tentacles flowing behind her and her two eerie eel sidekicks, Flotsam and Jetsam, adorning her like a scarf, Ursula was one imposing villain. The sea witch tricked merpeople who needed help into signing over their souls to her, all in a quest for power after being banished from Triton’s kingdom. As the heartless tyrant of the mental institution in One Flew Over the Cuckoo’s Nest, Nurse Ratched made life miserable for anyone who dared challenge her iron rule. The character is based on the antagonist of Ken Kesey’s 1962 novel of the same name, but Louise Fletcher’s Oscar-winning performance brought her terrifying dictatorship to life, and often shows up on lists of the greatest all-time villains. Her name is often used as a metaphor and a reminder that power corrupts. The Wicked Witch of the West from 1939 Wizard of Oz film with her green skin, her wart, and her black pointy hat became the iconic vision of a witch. The Wicked Witch’s scariest scene is perhaps when she sicks her evil flying monkeys on Dorothy just because she wants those magic ruby red slippers back. (Let’s be real, she doesn’t care that her sister died.) Sure, the Broadway Musical Wicked taught us that she was really just a misunderstood outcast. But that’s a whole lot of drama over shoes. Let’s be real: we’ve all been personally victimized by Regina George. Or at least, a Regina George. The character, played by Rachel McAdams in the 2004 cult classic, is the ultimate queen bee who doesn’t hesitate to stoop to new lows when she notices her crown slipping. Every little girl who was scared of their stepmom has Lady Tremaine to blame. Not only did she force Cinderella to labor while her other daughters did nothing, she even allowed them to pull Cinderella’s dress apart before the big ball. Lady Tremaine’s biggest transgression though was trying to stand between Cinderella and the Prince when he came to claim her. The shape-shifting X-Men supervillain is responsible for the assassination of many important leaders. She also happens to be the kind of villain that prefers not to wear clothes. Played by Rebecca Rojamin and then Jennifer Lawrence (as a younger version), Mystique is one of the most powerful of this tribe of mutants with her ability to fool anybody—and kick ass. Hell hath no fury like a woman scorned. Maleficent was so angry when she wasn’t invited to Aurora’s christening that she doomed her to fall into an eternal sleep. And as if that weren’t bad enough, when she was outwitted, she turned into a fire-breathing dragon. But before we judge too harshly, we ought check out this new Disney feature to see what the story looks like from her point of view: Angelina Jolie stars as the villainess in a live action version of the story opening today. Catwoman is one of the most devious Batman super villains, using her powers of seduction to accomplish her capers. After all, who can resist all that spandex? Michelle Pfeiffer, Halle Berry and Anne Hathaway have all taken turns as Selina Kyle a.k.a. Catwoman. In a movie filled with big bads, Lucy Liu’s O-Ren Ishii stands out, if only because of the epic fight scene she has in the snow with Uma Thurman at the end of Kill Bill: Volume One. But, like all good villains, she’s also a tragic figure that’s introduced with a stunning anime sequence that shows her tragic backstory. As one of the most fleshed-out characters in Quentin Tarantino’s epic spaghetti western and martial art movie mash-up, O-Ren Ishii is a true adversary for the Bride. This movie is the ultimate cautionary tale for anyone who has ever thought about cheating. As Alex Forrest, Glenn Close plays a spurned lover who decides to torment Michael Douglas and his wife when she realizes that he was just using her for a weekend fling. She’s an obsessive character and truly unhinged—something that didn’t exactly make feminists happy when the movie came out—but Close’s compelling portrayal makes for a terrifying character. Fair warning: Watching this movie will make you never want to look at a bunny again. Is there anyone quite as scary as an all-powerful tyrant whose favorite phrase is “off with their heads”? The Queen of Hearts has been immortalized again and again in different adaptations of Alice in Wonderland, perhaps most creepily when Helena Bonham Carter took a turn as her in Tim Burton’s live action version, her head ballooning into enormous proportions. Spoiler alert: do not watch this clip or read this blurb if you have not seen the end of the film. Superhero villains are often male, but that just makes the few female ones even more terrifying. In Christopher Nolan’s Dark Knight trilogy, Talia al Ghul masquerades as Miranda Tate, a wealthy board member at Wayne Enterprises (played by Marion Cotillard) who romances Bruce Wayne before she reveals her identity to him in the eleventh hour. She’s actually Talia al Ghul, hell-bent on avenging the death of her father, Batman supervillain Ra’s al Ghul, who was played by Liam Neeson in Batman Begins. Talk about a bait and switch with the bat. Kathryn Merteuil sealed her spot in movie history with a kiss. Sarah Michelle Gellar’s deliciously campy character in Cruel Intentions is a direct descendent of the Marquise de Merteuil from the classic Les Liaisons Dangereuses, a beautiful libertine who manipulates everyone around her in order to get her way. Evil has never looked this good. The Evil Queen is so evil, the word is literally in her name. There’s nothing scarier than a deranged woman who takes life advice from a mirror and is so vain that she’s willing to kill to be the fairest of them all. ",
    "datetime": null,
    "url": "https://time.com/2801704/maleficent-villains-wicked-witch-catwoman/"
}