{
    "title": "Man arrested in Newfoundland for traffic offences has $45K in fines",
    "text": "A 23-year-old man was charged with operating a vehicle with no license or insurance. A 23-year-old man was charged with operating a vehicle with no license or insurance. This article is over a year old, and the information within may be out of date. ST. JOHN’S, N.L.—A young man has been arrested in St. John’s, N.L., for numerous traffic offences, including about $45,000 in outstanding fines. The Royal Newfoundland Constabulary says officers stopped a vehicle for a traffic violation in the area of New Gower Street around 12:30 a.m. today.  They say the driver, a 23-year-old man, was charged with operating a vehicle with no license or insurance. He also has about $45,000 in outstanding fines. The vehicle’s owner was charged with allowing his vehicle to be operated by a unlicensed and uninsured driver. The driver of the vehicle was held in custody for a court appearance Sunday and the vehicle was impounded. Anyone can read Conversations, but to contribute, you should be a registered Torstar account holder. If you do not yet have a Torstar account, you can create one now (it is free). To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation Save $85 with our best offer. Cancel Anytime. It means the world to us that you choose to read our brand of trusted news. And as long as you continue to do so, we’ll continue to show you we appreciate it. Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:       Sign up with  Thank you . Your account has been registered, and you are now logged in. Check your email for details. Invalid password or account does not exist Sign in with Submitting this form below will send a message to your email with a link to change your password. An email message containing instructions on how to reset your password has been sent to the email address listed on your account. No promotional rates found.    Secure & Encrypted Secure transaction.\nSecure transaction. Cancel anytime.  Thank you. Your gift purchase was successful!\nYour purchase was successful, and you are now logged in. You will also start receiving the Star’s free morning newsletter, First Up, soon. A receipt was sent to your email. ",
    "datetime": null,
    "url": "https://www.thestar.com/news/canada/man-arrested-in-newfoundland-for-traffic-offences-has-45k-in-fines/article_132b5128-77c7-538b-866a-91aaebdbd451.html"
}