{
    "title": "Mario Dedivanovic Makeup Products | Allure",
    "text": "By Renee Jacques At this point, the name Mario Dedivanovic shouldn't just ring a bell: With clients like Kim Kardashian, Chrissy Teigan and Chanel Iman—and a few sold-out Master Classes under his belt—you should be intimately familiar. But just because he works with one of the most famous women in the world doesn't mean he uses only high-end products on her. Yesterday Dedivanovic gave all his Snapchat followers a treat when he casually strolled into a CVS in Miami and started sharing snaps of his favorite drugstore products (his Snapchat is \"makeupbymario,\" btw). First, Dedivanovic loves to use L'Oréal Paris Voluminous Mascara in Carbon Black because it provides \"two times the intensity.\" We're not sure what he's comparing it to, but sure! When it comes to makeup sponges, Dedivanovic likes Beauty 360 Jumbo Cosmetic Wedges. \"These sponges are great to apply moisturizer and setting powder under the eyes, and they expand when you wet them with water,\" he says. Dedivanovic also likes to use Essence of Beauty Wedges because \"they are really soft and really feel good on the face.\" Moving on to false lashes: Dedivanovic swears by Ardell. He also likes__Ardell Natural Demi Wispies__ because \"they look really pretty on the eyes, and you can double-stack them,\" he says. By Aliza Kelly By Gabi Thorne By Gabi Thorne And according to Dedivanovic, the line of L'Oréal Paris 24 HR Infallible Eye Shadows has \"literally some of the best eye shadows in general.\" Lastly, the hair spray he trusts is Redken Control Addict 28. \"I usually use 23, but 28 seems to have more control,\" he says. By Aliza Kelly By Gabi Thorne By Gabi Thorne Our picks for the best makeup products of 2015: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Jesa Marie Calaor By Dianna Mazzone By Sarah Han By Annie Blay More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2015-12-15T13:15:00.000Z",
    "url": "https://www.allure.com/story/kim-kardashian-makeup-artist-products"
}