{
    "title": "Mark your calendars: 'Beauty and the Beast' to be staged in Manila",
    "text": " SUMMARY This is AI generated summarization, which may have errors. For context, always refer to the full article. MANILA, Philippines – Years later, the appeal of Beauty and the Beast still hasn’t faded, and audiences will get a chance to relive it through the theater. Disney Theatrical Productions, NETworks and Broadway Entertainment Group, together with Ovation Productions, are staging Beauty and The Beast on January 9-25, 2015 at the Main Theater (Nicanor Abelardo Hall) of the Cultural Center of the Philippines, Roxas Blvd., Pasay City. According to the press release, Renen de Guia, President and CEO of Ovations Productions, said that they are happy to bring the production to the country as part of company’s 35th anniversary. “’Beauty and the Beast” is simply an incredible theatrical experience that will tug on everyone’s emotions,” De Guia said.  “All the characters – from Lumiere, Gaston, Belle and the Beast – are spot on, captivating and brilliant in their roles.” “The stage props are fabulous and as are all the colorful and cheery costumes.  The music, the songs, the choreography are spectacular.  Everything about it is mystical and magical and fun for both children and adults.  It will have you want to watch the musical every night,”  De Guia added. Beauty and the Beast tells the story of Belle, a young, adventurous woman, and the Beast, a prince transformed into a monster an enchantress until he learns to love and be loved. If the Beast does not learn to love, then he and his household will be doomed forever. The international touring production is directed by Rob Roth and choreographed by Matt West. Music is by Alan Menken with lyrics written by the late Howard Ashman, with additional songs by Alan Menken and Tim Rice. The musical, based on the 1991 Disney movie of the same title, premiered in 1994, and was nominated for 9 prestigious Tony Awards and ran for 13 years. It still ranks as one of the longest-running and highest-grossing Broadway shows of all time. – Rappler.com Tickets are priced at P7,895, P6,845, P5,790, P4,740, P4,210, P3,160 and P2,105, plus applicable service charges.  They are available at Ticketworld outlets (891-9999) and online at www.ticketworld.com.ph, beautyandthebeast.com.ph and Facebook.com/beautyandbeastph.   Error. Please abide by Rappler's commenting guidelines. There are no comments yet. Add your comment to start the conversation. JOIN OUR NEWSLETTER Fearless reporting delivered to you follow us    ",
    "datetime": "2014-10-21T06:59:07+00:00",
    "url": "https://www.rappler.com/life-and-style/arts-culture/72633-beauty-and-the-beast-manila-production/"
}