{
    "title": "Marketing lessons from the South Korean beauty industry - PR Daily",
    "text": "The nation exported nearly $625 million in cosmetics to the U.S. last year, and much of its global success is tied to vibrant packaging and marketplace agility. The nation exported nearly $625 million in cosmetics to the U.S. last year, and much of its global success is tied to vibrant packaging and marketplace agility. Editor’s note: This article is a re-run as part of our countdown of top stories from the past year. In the past decade, Korea has transformed itself into a cultural hub and a land of creativity. “Parasite” director Bong Joon-ho returned to his homeland as the director of the first foreign-language film to win Best Picture at the Academy Awards. However, he isn’t the only Korean who has been making cultural headlines. In January, BTS became the first Korean act to perform at the Grammy Awards. Beyond cinematography and K-pop, there is another major driving force behind Korea’s rising cultural economy: cosmetics. If you walk into most cosmetics stores around the U.S., you will see Korean brands on display. In 2019, the United States imported more than $624 million in Korean cosmetics, and this number is predicted to grow. The global cosmetics industry’s revenue is expected to grow to at least $379 billion, and skin care is its main driver. What’s the secret to its success? High-quality products and branding. Korean skin care products prioritize the use of natural ingredients and beautiful, often fun, packaging. K-beauty follows the “skin-first” philosophy, which emphasizes a preventative approach and the importance of taking care of your skin, rather than covering it up. This philosophy is growing in popularity in the United States, and Western brands must keep pace. Additionally, traditional K-beauty routines consist of more than 10 steps—ensuring consumers that the brands are not overpromising nor trying to cut corners for results. This method leads to more credibility, because the products speak for themselves. U.S. consumers expect quick results—a common hurdle for communicators and marketers—but asking consumers to put in the work to get the outcomes they want isn’t a negative. If anything, doing so will build consumers’ trust. What can communicators and marketers learn from K-beauty? Some K-beauty products follow an “Instagram-first” philosophy, meaning they are made with social media in mind—something Western brands don’t tap to the same degree. Influencers are a major reason K-beauty products are flying off the shelves globally. However, one notable difference between K-beauty influencers and traditional Western cosmetics influencers is that the former seem to genuinely like the products and use them in their personal lives. These influencers usually have beautiful skin, and what they say sounds authentic. Meanwhile, many Western influencers who promote skin care don’t always have skin to die for. Bridging the gap in professional endorsements and private use is essential in enhancing consumers’ trust in the reviews. Two kinds of packaging go into Korean products: fun, bright colors with cartoon characters, and sleek, minimalist designs. The brands usually use catchy, clear, memorable words in the product/brand names, making it easy for global customers to remember. For example, Skinfood’s Black Sugar Perfect First Serum: The name is so straightforward and easy to remember. Then there’s Glow Recipe’s Watermelon Glow Sleeping Mask, which makes your skin glow. The brand names are clearly geared toward millennials and Gen-Z. Western brands don’t always employ this aspect of skin care to its full potential and could benefit from names that are easy to pronounce and tell you what the product does. When it comes to bold moves in skin care, nobody does it better than the Koreans. Dr. Jart+, for example, produces popular masks that turn to rubber after they’re applied to the face. Another sensation is Elizavecca’s Milky Piggy Bubble Clay Mask, which turns your face into a “cloud.” K-beauty creators know that modern consumers want an individualized, Instagram-worthy experience that addresses their personal concerns. Western brands are creative in their products, but most stick to a traditional approach. Not many products do unusual or risky things—like using snail mucus. Such innovative approaches will get consumers talking and excited to try new things. K-beauty brands usually spend less than six months on planning and launching products, whereas Western brands take much longer, making them unable to respond to new trends or fads. Korea’s “fast beauty” approach also makes the products much more affordable, compared with what is available at large retail chains. For marketers and communicators, watching and responding to cosmetics trends is crucial for success. For example, right now everyone is talking about hyaluronic acid; last year the hot ingredient everyone was collagen. If you don’t keep up and launch products accordingly, you will miss out. In 2012, Charlotte Cho saw K-beauty as a potential trend and launched SoKo Glam, a retail website for K-beauty. SoKo Glam has a separate content website called The Klog, which explains to users how to use products depending on their goals and concerns. You can even talk to a concierge. Cho is now an influencer herself and even wrote the “Little Book of Skin Care.” By distinguishing SoKo Glam from The Klog, Cho created an authentic experience that didn’t feel as though someone was selling to you. Although many Western brands are using tutorials on their websites, fewer people watch them. The Korean influence is here to stay, whether through Korean films, K-pop performances or K-beauty products. Soon enough “K-“ will be in many more cultural aspects of our lives. Topics: Branding, Marketing, Social Media Topics: Branding, Marketing, Social Media This excellent story—plus the Covid-19 mortality numbers from Korea—spotlight a mistake many PR clients make.   They focus too much on how they look and not enough on how they are. Although much of PR is still about what to communicate in order to look good, a more fundamental PR question is what to BE. At top level meetings of C-suite executives and a PR firm’s senior officers, the corporate guys outline “what we want the public to realize.”  On any issue, they want the public to “recognize” their side and “not be taken in” by the other side.\nEven the most senior corporate executives may look anguished and almost in tears as they try to make their case. But top PR firms with strong research departments may do a study on not just what people think but what they NEED.  PR leaders guided by such research may counsel that a good way to help the public “realize”  the company goodness is for the company to realize how it may better serve the public interest. If you want to make paper, you are going to create pollution.  You can clean it up somewhat or even a lot but it will still be pollution.  If you buy car components from abroad, it may seem to mean fewer American jobs than if you’d source domestically. Actually your imports may mean MORE American jobs if low cost imports enable you compete successfully and sell a million more cars in the U.S. as you compete against companies that import entire cars, not just components.  BUT you may be much less than 100% successful if you try to explain economics to the public via PR or ads.  And you may shoot yourself in the foot (or worse!) if you try PR that says “we only pollute a little, not as much as we might.” So should management retain a PR firm, perhaps one with experience selling Korean or other cosmetics, to try making things look different than they are?   That’s one possibility but judge whether this could be a more profitable approach:  try to not just LOOK better but to BE better. How can management do this while still doing paper-making that pollutes and still importing what may seem to cost American jobs? By doing something ELSE for the public so that despite pollution and imports you are seen correctly as one hell of a major asset to the public! My own favorite corporate heroism, but maybe there’s something better or a dozen better ideas, is sponsoring anti-cancer or anti-Alzheimer’s research so your PR can show the public:  “Here’s how we’re trying to save your life.  Every five minutes, an American is diagnosed with lymphoma, and one in every four of us will get cancer but here’s what our company is doing for Lymphoma Research Foundation and others to eliminate lymphoma and to make cancer mortality one in 10 or 20 not one in four.  Look at these pictures of our senior executives in a research lab with the world’s top doctors.” Not many in congress will want to attack your management.  No activist mob may yell ”hey hey, ho ho” about your management having to go.  Millions of supermarket customers may pick your breakfast cereal or detergent instead of another brand.  Even a small PR advantage can produce a big upsurge in sales. Korean cosmetics can be sold successfully for helping customers to look good, and PR firms can sell potential clients successfully by helping them to BE good. It’s called CSR for Corporate Social Responsibility but could be called CSO for Corporate Social Opportunity.  Of seven ways to earn a raise, the best of all may be to take some Ragan PR courses, improve yourself and earn it.  Of 700 ways to raise a company’s public esteem, same thing: a good way—maybe the best—is to earn it. This article sums up pretty much everything successful brands in the Western world should do when they offer k-beauty products. It is not only about sales these days, it is about telling a story and helping people with the efficiency of Korean cosmetics. As we see from last year, people in Europe are starting to get into k-cosmetics more and this would bring stiff competition as time passes by, so if you take notes from this article, then the number one should be: step up your marketing game and offer “value” products. There is no way to fall flat if you do this. Name Mail (will not be published) Website    Sign up to receive the latest articles from PR Daily directly in your inbox.  Sign up to receive the latest articles from PR Daily directly in your inbox. Enter the email you used in your Ragan store purchase. Sign up to receive the latest articles from PR Daily directly in your inbox. Not a member? Join now. Enter the email you used in your Ragan store purchase. ",
    "datetime": "2020-12-29T15:58:38+00:00",
    "url": "https://www.prdaily.com/marketing-lessons-from-the-south-korean-beauty-industry/"
}