{
    "title": "Medicube Is Turning Seoul's Trendiest Skin Treatments into At-Home Devices — Reviews, Photos | Allure",
    "text": "By Devon Abelman All products featured on Allure are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission. Yes, I know microneedling is a popular skin-care treatment for plumping, smoothing, and brightening via forced collagen production, but I've never wanted to try it and probably never will. Something about minuscule needles rolling all over my skin and leaving tiny holes in its wake makes me cringe. The only time I'll willingly let a needle create a hole in my skin is when it's filled with ink, jewelry, or a vaccine. Plus, I don't need to get microneedled when the Medicube Age-R ATS Air Shot gives my skin the same glowing results without any sharp, painful jabs. Although the Korean at-home skin-care device launched in May 2022, it was countless years in the making. In 2020, Medicube's CEO Byunghoon Kim happened to meet well-renowned Korean doctor Shin Sae Woo at a convention. For several years, Dr. Shin had been studying ways to harness the benefits of microneedling without actual needles. Upon meeting Kim, Dr. Shin offered to collaborate with Medicube to create the Age-R ATS Air Shot based on his research. Thus, my favorite skin-care tool was born. Like microneedling, the ATS Air Shot creates microscopic passages in the skin to aid with deeper skin-care product absorption, Kim explains. However, the Medicube device zaps them into your face with mild electrical currents that feel like slight static shock — not with a potentially unhygienic multi-pronged needle situation. Also, microneedling, at home and professionally, comes with a hefty dose of probable user error. \"If you use that too much or with too much pressure, you can actually hurt your skin too much, and it'll be hard for your skin to recover from that,\" Kim notes. The small, handheld device is actually part of Medicube's effort to bring the best of Korean skin-care innovations directly to your bathroom — no matter where in the world you may be or what your level of skin-care expertise is. Kim started Medicube back in 2014, and its products have since won Allure Korea Best of Beauty Awards and count dozens of K-pop stars as fans. Over the past eight years, \"I tried to develop better and better products for skin, but at some point, I felt like there's a limit to what you can do with skin care,\" Kim tells Allure in his first-ever U.S. interview. Many dermatologists from here to South Korea will tell you the same thing too. Once, while interviewing a dermatologist in Seoul, they admitted that no skin-care product is truly as effective as a laser treatment. With this in mind, Kim began researching what exactly Korean celebrities do to take care of their skin beyond their product regimens, he says. Medicube owns a dermatology clinic in Seoul's Gangnam neighborhood, so Kim also worked directly with dermatologists to find out about Korea's most popular in-office procedures, like Ultratherapy, InMode, microneedling, and acupressure massages. Curious about how exactly they all worked, Kim even tried them all out for himself. \"I wanted to see if they were actually more effective than our skin-care products,\" he says. In the process, he learned just how greatly electrical stimulation can improve skin. From there, Kim had a mission to bring the best skin-care technology that Korean celebrities swear by for clear, glowing complexions to at-home skin-care routines. Of course, Kim acknowledges procedures done at dermatology clinics are extremely effective. He's also well aware that the at-home skin-care device industry is nothing new. However, \"not everyone can afford the time and money to get [in-office treatments] done,\" he says. \"And a lot of at-home devices that are already on the market have mostly a placebo effect.\" Plus, the Food and Drug Administration (FDA) doesn't even do its own testing on American at-home skin-care tools, so many have unsubstantiated claims for their efficacy, according to Corey L. Hartman, MD, a board-certified dermatologist in Birmingham, Alabama. \"[The FDA is] relying on existing testing, plus what the company provides as testing,\" he previously told Allure. By Aliza Kelly By Gabi Thorne By Gabi Thorne This content can also be viewed on the site it originates from. Needless to say, Kim wanted to create skin-care gadgets that unequivocally work — and in the most foolproof of ways. \"When developing them, I had to remember the fact that not every user is a professional,\" he shares. \"People that use these devices may not know how to exactly professionally you treat their skin, so the most important thing for us was to make sure the devices are safe for everyone to use.\" With the Medicube Age-R ATS Air Shot, for instance, all you have to do is press one button and hover it over dry skin. It automatically turns off after five minutes when the treatment is complete, and if it's not the right distance from your skin, it simply won't do anything. Plus, he worked with a team of dermatologists from the Medicube Clinic to ensure the technology is as effective as the brand says it is. I can also vouch for it. I started using the Air Shot around the same time it launched, and I swear you can always tell when I've used it the night before because my skin looks glassier and my breakouts are quelled. I reach for it whenever my skin is freaking out or looking a bit lifeless to zap it back into shape. Kim recommends giving the Air Shot, as well as the rest of Medicube's devices, a good two weeks to see results, though. The Airshot is one of three Medicube devices that debuted over the past year, and each has hilariously gone viral on TikTok whenever Medicube's social team posts a video of Kim demonstrating how to use them, as seen above. Let's dive into the other two. By Aliza Kelly By Gabi Thorne By Gabi Thorne In 2021, Medicube debuted its first device: the Age-R Derma EMS Shot. The V-shaped derma roller-like tool stimulates facial muscles with non-invasive electrical muscle stimulation (aka EMS) to help tighten and depuff skin, particularly along the jawline. For those unfamiliar, EMS \"drives the creation of collagen and elastin in the skin,\" according to Zain Husain, MD, a board-certified dermatologist and founder of New Jersey Dermatology & Aesthetics Center. This device is based on the effects of acupressure massages, which have been incredibly popular in Korea for years, Kim says. \"It basically uses your pressure points to smoothen the contours of your face and help define your facial structure,\" he explains. When you combine targeting those specific spots on your face, like under the eyes, the temples, and where your jaw hinges, with EMS, you get spectacularly sculpted, lifted skin results. All you have to do is roll the EMS Shot upward along those areas for 10 minutes. As you do so, you'll feel super-satisfying little zings of vibration that I truly believe help depuff my face in the morning after a long night. Honestly, I just started using this one, and I'm looking forward to seeing how it sculpts my face over the next couple of weeks. Next came the Age-R Ussera Deep Shot for those seeking out plumper, more radiant skin. It's basically a handheld, at-home version of InMode or Ulthera, which are beloved in-office treatments in Korea for smoothing out fine lines and wrinkles. These professional devices gently heat up tissue below the surface of skin with ultrasound energy to amp up the creation of collagen, as Melissa Levin, MD, a New York City-based dermatologist, shared on the wrinkle episode of Allure's Science of Beauty podcast. By Aliza Kelly By Gabi Thorne By Gabi Thorne Deep Shot does the same thing from the palm of your hand with not only ultrasound energy but also high frequency to boost collagen production, Kim says. He recommends it to those with mature skin. For this one, you give your face about 80 painless \"shots\" by simply holding it down onto your cheeks, smile lines, and jaw and pressing the shot button. It briefly beeps and slightly heats up with each one. A little ring goes off every 10 shots if you happen to lose track. Alternately, there is a continuous shot function so you don't have to keep pressing the button unless you want to. Deep Shot is my go-to device when I want to unwind because the way it heats up is incredibly relaxing and feels like a mini spa treatment. After about a week or so of using it, it helps my skin sustain that just-got-a-facial bounciness for weeks. Just a couple of days before our interview, Medicube launched its fourth skin-care device in Korea called the Age-R Booster Healer. Kim also hints that another targeting cellulite is also in the development stages. The Booster Healer, which will make its way to the U.S. market shortly, is based on Korean skin booster shots, like Rejuran and Exosome. The dermatologist \"physically puts skin-care products into your skin to make it appear more glowy and bouncy,\" Kim explains. In other words, it's injectable skin care. Like any needle-based procedure, skin booster shots come with potential side effects — mainly raised skin texture from the injections and potential bruising. I've been there, done that, and shed a couple of tears over them. The new mechanism pushes your favorite serums and creams into your skin without needles or pain, in general. \"You'll apply the skin-care product on your face first, and then, use the device to help it shoot into your skin deeper,\" Kim says. He even recommended reaching for the Booster Healer after an Airshot session for the ultimate absorption treatment. The two-step system is also an at-home version of the popular Korean Water Glow treatment, which I've always wanted to try to give me the dewiest skin ever but haven't had the chance to fly to Seoul to try. Once I get the Booster Healer, I'll be able to attempt a low-key version all by myself — just as Kim intended. Medicube's at-home skin-care devices range in price from $280 to $365 and are available now at medicube.us. By Aliza Kelly By Gabi Thorne By Gabi Thorne Read more about popular Korean skin-care treatments: Now, watch Kim Kardashian answer beauty questions from the internet: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Nicola Dall'Asen By Sarah Han By Devon Abelman By Dianna Mazzone More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2022-08-18T14:00:00.000Z",
    "url": "https://www.allure.com/story/medicube-skin-care-devices-review"
}