{
    "title": "Mediheal brings 2-step K-beauty masking to US market",
    "text": "Or wait... Headlines Brand Innovation Formulation & Science Packaging & Design Business & Financial Market Trends Regulation & Safety Promotional Features Site Archive Multimedia Hot Topics Companies looking to the future Consumer insights Formulation research Retail and DTC Sustainability Technology and Platforms Trends and Emerging Markets Expert Viewpoints Site Archive Multimedia Resources Type of resources Events All Events Shows & Conferences Online Events Editorial Webinars Events  25-Jul-2019\n                            - Last updated on\n                                25-Jul-2019 at 14:15 GMT L&P Cosmetic Company launched the Mediheal Beauty Science business in 2009 and it has since grown into a popular skin care brand around the world. Based in Seoul, South Korea, L&P itself got its start in 1969 (and was until 2009 known as Wangsang Chemicals). And according to this month’s press release announcing the Mediheal US launch, L&P “was recently awarded Korea's Presidential Industrial Service Medal for job creation and is consistently noted for its efforts to increase and improve the quality of jobs in South Korea.”​ Global expansion​ Mediheal products are sold in some 30+ countries; and the brand’s product portfolio isn’t limited to masks alone but to facial skin care more broadly. Still, the brand calculated its entry into the US market carefully. “As the K-Beauty phenomenon spread globally, many Korean beauty brands rushed to the US market,”​ points out Sunjoo Lee, CEO of Mediheal US, who goes on to explain that, “We waited until we understood the market enough to offer the right products and chose distribution partners who embraced our core value - making the most cutting-edge, effective beauty products accessible to all.”​ Masking innovation​ Clay masks, sheet masks, patches, and the like have gone through any number of trendy iterations—for the sake of Instagram, for the sake of partnerships with Disney and Marvel Comics, for any number of ventures that had little (or nothing) to do with effective skin care formulations or applications. Mediheal is one of the brands positioning itself, not in opposition to this masking craze exactly but as a skin care leader with an expertise in mask materials, production, formulation, and skin care product application. “Mediheal turned the sheet mask from a promotional novelty item into its own specialized and advanced skincare product, considered an essential part of anyone's daily routine,” ​asserts Kwon Oh-sub, CEO of L&P Cosmetic and founder of Mediheal. “We've shown the industry,” ​he says in the company’s recent press release that, “that sheet masks can become more innovative and can quickly (but effectively) address skin concerns according to an individual's specific needs.”​ Building reputation ​ The brand is now retailing at select Walgreens as well as on the pharmacy chain’s ecommerce site, and of course on MedihealUS.com. By November, the brand expects to be in over 1,000 more Walgreens locations across the States. And, Mediheal is banking on product quality, craftsmanship, and efficacy so far as that can help build loyal consumers and further retail partnerships. “All of our masks are made from the highest quality ingredients,” ​says Young Sook Lee, the brand’s global head of R&D and production, adding, “What distinguishes us from the rest of the category is our groundbreaking process. We take extra care in making sure our mask packs are made through rigorous, automated processes so that we can pack the essences, ampoules, and masks into one safe and clean package.”​ --- Deanna Utroske, CosmeticsDesign.com Editor, covers beauty business news in the Americas region and publishes the weekly Indie Beauty Profile column, showcasing the inspiring work of entrepreneurs and innovative brands. Copyright - Unless otherwise stated all contents of this web site are © 2023 - William Reed Ltd - All Rights Reserved - Full details for the use of materials on this site can be found in the Terms & Conditions Related topics\nMarket Trends\nSkin Care Show more  Content provided by Acme-Hardesty Company | 11-Oct-2023\n                     | White Paper Sharomix™ EG10, a versatile broad-spectrum antimicrobial liquid blend for preserving personal care products, ensures safety at usage levels ranging from...  Content provided by Acme-Hardesty Company | 07-Jul-2023\n                     | Product Brochure Acme-Hardesty’s latest expansion into Canada includes Resplanta®, Botaneco®, and BYK from our partners Sharon Personal Care and Eckart Effect Pigments...  Content provided by Covation Bio™ PDO | 22-Jun-2023\n                     | White Paper Zemea® propanediol is a 100% plant-based humectant and solvent that’s easy on skin and the planet. This single, natural ingredient boosts moisturization...  Content provided by Horphag Research | 10-Apr-2023\n                     | White Paper Pycnogenol® has 25+ clinical studies demonstrating its active properties for oral and topical skincare formulations. Results show the antioxidant stimulates... On-demand webinars More promotional features ",
    "datetime": null,
    "url": "https://www.cosmeticsdesign.com/Article/2019/07/25/Mediheal-brings-2-step-K-beauty-masking-to-US-market"
}