{
    "title": "Meet Superegg, The New K-Beauty Skincare Brand With Cutting-Edge, Plant-Based Ingredients | British Vogue",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, select My Account, then View saved stories To revisit this article, visit My Profile, then View saved stories To revisit this article, select My Account, then View saved stories By Lauren Valenti “An egg symbolises birth,” says Erica Choi, the lifestyle influencer behind @eggcanvas and cofounder of new skincare brand Superegg, out today. “Each new day is an opportunity to reset and start anew.” While Superegg’s DNA, from the sleek ovular packaging to its unique product formulations, is steeped in the egg as an emblem of rejuvenation, the breakfast staple is not, in fact, an ingredient: Its offerings are plant-based and formulated to match the egg’s nutritional value with entirely vegan ingredients. “Our idea was to take this inspiration to a higher level,” says Choi, who throughout her Korean upbringing saw eggs as an integral part of beauty rituals, as she watched her grandmother and mother apply different parts of the ingredient onto their faces. Her familial traditions had much precedent throughout Asian history: In 600 B.C. China, Zhang Lihua, a concubine recognised for her “legendary beauty,” was said to have whipped up a facial cream composed of egg white and powered vermilion, while in the last century of the Korean Joseon Dynasty, a guidebook for women called Gyuhap chongseo recorded a beauty regime of mixing eggs in liquor to be applied on the face for “glossy, jade-like skin,” Choi says. But while Choi has a deep-seated appreciation for eggs in their natural form, she felt compelled to rethink these traditions when she considered animal agriculture’s impact on climate change, and the rise of animal and egg-related issues, such as allergens, diseases, and preservatives. She sought to create vegan products that could honour the egg and its properties, but in a friendlier, eco-conscious way. The journey to launching Superegg began three years ago, with Choi joining forces with her husband, Hoon Kim, a fellow graphic designer and creative consultant, to create a skincare line inspired by the “clean egg” that “felt elevated and efficacious, yet gentle, and addressed the skin’s overall health.” At the beginning, Choi examined the different aspects of the egg, and realised that each part of it — the egg white, yolk, and eggshell membrane — contains unique properties that benefit the skin. She began a meticulous formulation process to create special egg duplexes for each component with powerful, plant-based equivalents: Egg yolk nutrients that help lock in moisture and smooth texture, such as collagen and lecithin, are duplicated with skin-barrier-function-supporting hydrogenated lecithin, restorative vitamin E, and soothing chicory root. Egg whites’ vital components — protein and collagen — are simulated with moisturising soy protein, healing tremella mushroom, and calming rice extract. The eggshell membrane’s water solubility is mimicked with hyaluronic-acid-boosting SYN-HYCAN and wrinkle-smoothing lupine protein to anti-aging effect. By Hannah Jackson By Alice Cary By Hannah Coates The first of Superegg’s duo of debut products is Sound Renewal, a lightweight gel-cream that combines its special Yolk Duplex with supercharged humectant panthenol, hydration-boosting squalane, gently exfoliating PHA, and calming flower water to yield soft, supple skin. The packaging, a smooth, circular form, is inspired by scientist Piet Hein’s superellipse shape, and is a “nod to sunny-side ups,” says Choi. Then comes Gentle Elements, a frothy, foaming cream cleanser that removes make-up, dirt, and excess oil while restoring and balancing the skin’s pH with barrier-strengthening moringa oil, brightening vitamin C, hydrating hyaluronic acid, and the smoothing White Duplex. Given Choi’s background as a graphic designer and content creator — she most recently held the role of vice president of digital design at Barneys — for her, crafting the brand’s visual and experiential identity was just as important as the function and efficacy of the products. “It would have no life and no community without a brand story,” says Choi of working alongside Kim, who runs creative consultancy Why Not Smile and has worked with a host of beauty clients (including K-beauty brands Dr. Jart+ and AHC) on everything from the packaging to the creative direction. “Quality and aesthetics, as well as an appreciation for art, architecture, and design, are very important to me, and I wanted to bring this part of me into the brand,” she adds. While the original plan was to launch Superegg this past spring, Covid-19-related supply-chain disruptions caused delays. “The silver lining was the massive amount of interest that skin care has received as people focused on their self-care rituals this year,” says Choi. By Hannah Jackson By Alice Cary By Hannah Coates From its unique “clean egg” concept to the objet d’art appeal of its packaging, Superegg’s offerings are destined to appeal to natural beauty enthusiasts and major #TopShelfie players alike. But above all else, Choi just wants her burgeoning beauty brand to help individuals take a moment for themselves, and support the wellbeing of their skin and the planet (the brand is working with organisation 1% for the Planet). “In this day and age, where everything moves so quickly, and everything seems fleeting, I hope [we can] slow down and enjoy the small joys in life, even if it is as simple as taking a minute to celebrate ourselves with our daily rituals,” says Choi. This article was originally published on Vogue.com. More from British Vogue: By Lauren Murdoch-Smith By Hayley Maitland By Marta Sundac By Calin Van Paris More from Vogue Condé Nast Britain © 2023 Condé Nast ",
    "datetime": "2020-12-09T09:58:23.773Z",
    "url": "https://www.vogue.co.uk/beauty/article/superegg-skin-care"
}