{
    "title": "Meet Edward Avila, the K-Beauty Vlogger You're About to Fall in Love With | Allure",
    "text": "By Devon Abelman Outside of the James Charleses, Manny MUAs, and Patric Starrrs of the U.S., there's a slew of boy beauty bloggers in Korea, and Edward Avila is one of them. (Sorry folks, but America hasn't cornered the market on boy beauty.) Several times a week, Avila posts beauty-related videos on his YouTube channel for his half-million subscribers to enjoy. In June, I saw him speak on a panel at KCON NY about boy beauty and it was love at first sight. This was the same panel, by the way, where I learned that some people in Korea use sheet masks up to twice a day I was fascinated by his explanations of how men in Korea do makeup as well as his go-to skin care tips. Once I got home, I binged on his YouTube channel harder than Younger. (If you haven't done so for either, I strongly suggest both.) Not only is he hilarious and possesses extensive knowledge of all things K-beauty, I also strongly identify with his pastel aesthetic and love for the beauty looks in K-pop music videos. He often re-creates K-pop idol looks, most recently the red eye makeup EXO's Baekhyun had in the \"Ko Ko Bop\" music video, and I'm living for every single second of Avila's 16-minute-23-second video. Wanting to learn more firsthand about Edward Avila — who isn't a professional makeup artist, BTW — as well as what boy beauty is really all about in Korea, I recently caught up with him via magical powers of email. First things first, the 25-year-old moved to Korea from California about four years ago and has been living in Seoul for three of them. Back when he was still living in America in 2008, he started his YouTube channel under the name \"mrpanda101.\" It didn;t focus on beauty the way it does now, though. \"It was really just posting videos of my friends I had on my old Nokia phone,\" he says. \"I started it mainly because I, too, wanted to join this new platform of sharing my random or creative content.\" Avila says he started doing his makeup during his senior year of high school (\"when my acne really started to come up\"), and from there, he wanted to learn how to cover up dark circles and breakouts. Another YouTuber actually inspired him to take the plunge into vlogging — and it's a name you definitely know. \"I believe it was a video of Michelle Phan showing how men can use makeup, too,\" he recalls. \"She showed how she covered up William Ray Johnson's dark circles.\" These days, he thinks of makeup as a way of \"putting out your best, enhanced version of yourself to the world,\" he says. \"When you think you look good, you feel good.\" Avila's everyday makeup ranges from no-makeup makeup to \"full-on bronze sultry eyes,\" he says. Either way, you can guarantee he uses a cushion compact all over his face (the Nakeup Face Waterking Cover Cushion is his go-to), plus some concealer on problem spots and a bit of powder on the center of his face. \"I really don't like heavy base, and feel like less is more,\" Avila explains. This philosophy is precisely why he loves the Pony Effect Cover Up Pro Concealer in Nude Beige. \"It covers everything with as little product as possible,\" he explains, \"and the texture is ideal for both blemishes and dark circles.\" For brows, he uses a pencil to fill them in, giving them a straight shade and matching them to his current hair color. (At the moment, it's teal with violet highlights.) His favorite brow product is the Pony Effect Contoured Brow Color in Customizing, because it \"knocks down the dark brown color of my brows, so I can easily recolor them,\" he says. By Aliza Kelly By Gabi Thorne By Gabi Thorne Once his base and brows are done, Avila decides it that's all he wants for the day or if he wants to take his look further. If he keeps going, Avila says he'll add brown and bronze eye shadow around his eyes to add definition (and in case you were wondering, he's loving the latest berry and brick shadow trends as much as you probably are). To extend his eye shape, Avila will draw on some eyeliner, as well. \"I'll usually just do a little contour and highlight if I feel like doing it, but if I want to wear blush, I'll only wear blush on my cheeks and everything else pared down,\" he says. The shades he particularly gravitates toward are reddish pinks, mauves, and oranges, which he applies high on the cheeks in the area under the outer corners of his eyes — placement he feels looks more youthful. Don't expect him to swipe on liquid lipstick next. \"I can't stand having anything heavy on my lips for a daily makeup,\" he says. Instead, he prefers a lip tint in an MLBB shade. By Aliza Kelly By Gabi Thorne By Gabi Thorne With a complete playlist on his channel called \"Kpop Idol Makeup\" complete with 35 videos — and counting — one of his biggest beauty inspirations is, unsurprisingly, K-pop idols. He also looks to makeup artists, \"whether they are doing it for the models on the runway or people on Instagram,\" and adds that \"the seasons and weather really give me inspiration the moods I want to display through my makeup.\" Avila is refreshingly open about his skin-care struggles on his YouTube channel. To combat his acne, he follows the typical K-beauty multi-step skin care routine, noting that \"the products always change but the steps don't.\" Right now, he's all about the skin-care selection from K-beauty brand Troiareuke. The actual steps are as follows: Avila starts out with cleansing with an oil or balm to remove his makeup. His holy-grail pick is Troiareuke's Oil Cut Cleanser. \"It's extremely gentle, controls oil production, and removes makeup,\" he explains. Next, Avila washes his face with a milk, lotion, foam, or gel cleanser and a By Stephanie Saltzman . Then, he sweeps on an acid-based toner, which he swears by. (You can find out more about the wonders of toner here, BTW.) The ACSEN TOC Toner is his favorite. He sometimes even indulges in the \"7 Skin Method\", which is a popular trend in Korea that involves applying seven thin layers of a hydrating toner. \"It helps your toner really penetrate deeply into the skin without the need of heavy creams and piling on extra steps in skin care,\" Avila explains. \"It's important, though, that the toner has no alcohol in it.\" By Aliza Kelly By Gabi Thorne By Gabi Thorne He follows toner up with a wash-off pore-refining mask. Lately, he's been using the Troiareuke Pore Control Mask, which he says \"brightens the complexion, removes excess oil and it prevents it from coming up throughout the day, shrinks pores, and firms skin.\" Then, Avila taps on some eye cream, smooths on a serum, and massages in a moisturizer. So, how does Avila's beauty routine match up to other men in Korea who wear makeup? It's slightly more involved. \"These days, it's quite common for men to wear a cushion or BB cream because they see the importance of maintaining one's appearance, skin, and overall complexion,\" he explains. \"But at most, they'll have base and brows. I think many people see me and assume Korean men also wear the same amount of makeup when really, it's just me.\" You can see this idea in action with the videos on Avila's channel of him doing his friends' makeup. By Aliza Kelly By Gabi Thorne By Gabi Thorne As for skin care, it just depends on the man. \"It's common knowledge in Korea that skincare should be multiple steps,\" Avila says. \"These days, many brands have come out with 'one-step solutions' for men that aim to fit multiple skin-care steps into one product. I think they know that skin care is the key to maintaining a bright and clear complexion, though.\" Curious, I asked Avila how the perception of men wearing makeup is different in Korea compared to the United States as my parting question. \"I think the main difference is that in Korea, it's more about enhancing your features, and in America, it's either that or showing your creativity and art via your makeup,\" he responds. K-pop idols also have a lot to do with how others react to men wearing makeup in Korea. \"On [them], most people don't bat a lash because they're performers, and it's practically expected that they have makeup on,\" Avila explains. \"For the regular boy, most people don't say anything or even care if it's simple (again, base and brows); and even if it's obvious that they have makeup on, I think most people just think, 'Oh, they're trying to improve their appearance' rather than 'why are they wearing makeup?'\" Got a curious guy in your life who's a little apprehensive about experimenting with corrective makeup? Point him in the direction of Avila's blog ASAP. Related stories: Now, watch the last 100 years of hair color: Follow Devon Abelman on Twitter and Instagram. By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Sarah Han By Dianna Mazzone By Sarah Han By Angela Trakoshis More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2017-07-27T13:53:05.973Z",
    "url": "https://www.allure.com/story/edward-avila-k-beauty-boy-interview"
}