{
    "title": "Meet Jeremy Scott's Muse K-Pop Star CL - CL of 2NE1 Interview",
    "text": "Photo: YG Entertainment CL—arguably one of the fiercest girls to come out of Seoul—is the leader of the mega K-pop sensation, 2NE1. The four-member band consisting of CL, Dara, Minzy, and Bom, first established themselves as a global act after winning MTV Iggy's Best New Band in the World contest in 2011, voted on by fans. Their music—a motley mix of electronic, hip-hop, pop, and R&B—has since found fans in artists like Will.I.Am, who recently took the girls under his wing. The hip-hop mogul went along to produce a few tracks for them, which was documented in an Intel campaign. The fashion world has taken notice as well, namely, Jeremy Scott who sees the members of 2NE1 as his muses and dedicated a shoe style to the group. Scott even designed the group's ensembles for their first worldwide tour last summer, with some of the styles trickling into his Fall 2013 collection's runway. The group also recently filmed a commercial for Adidas Originals with Nicki Minaj and Sky Ferreira, which whipped the online community into a frenzy. CL—on a small vacation stateside—was front row at Scott's show, sitting next to other downtown cool girls like Natalia Kills, Kat Graham, and rapper A$AP Rocky. A couple of days later, she had a photo shoot with Terry Richardson. Here, she takes a moment with ELLE.com to share what she's learned about becoming the world's next top pop star. ELLE: Who is CL? CL: I have an alter ego between CL and Chaerin. I can be the baddest female onstage. As CL I want it to be that way. When it comes to just me, when I'm by myself with my family with my best friends, I don't want to be CL. They know me so well that I can't be CL. But I want to keep it that way, you know? Like Beyoncé and her alter ego Sasha Fierce. ELLE: What's your relationship like with Jeremy Scott? CL: He's my best friend. He's like my big brother. He looks out for me. We met each other when he saw the \"Fire\" video [2NE1's first single] and flew all the way to Korea to see me. It was actually for a photo shoot for Adidas. He didn't have to come but he did. You know when you meet someone and you can connect, that click, we had that. ELLE: You have an empowering song called \"Ugly,\" about not feeling beautiful. Where did that stem from? CL: It kinda came from me. I was talking to him in the studio. And no one here understands, but they do back in Korea. You know how Koreans are more strict and people from around the world think that being different is wrong. I don't understand, you're unique. I love being myself and love people that are themselves and just, you know, \"I'm doing me\" type of people. I have respect for those people and love for those people but some people don't understand that. So for me, I'm seen in public so I'm attacked a lot. I was feeling down one day and talking to him. I was like, \"You know, maybe I am ugly to those people.\" So we talked on and on and he wrote that song. ELLE: In Korea, lots of people get plastic surgery. Do you ever feel pressured to get work done as well—especially as a star? CL: You know? YG [2NE1's record label] told me to. They told me to get plastic surgery before my debut. I stood up for myself and said \"No, I'm not doing it.\" Like I said before, I love CL, but I still want to be Chaerin. And if I felt like I had to change I would. But I love the natural way I look. I said no and I'm not planning to. ELLE: Tell me about the high fashion brands you wear. One video has you guys wearing all Balmain or all Givenchy, plus vintage Alexander McQueen or even young designers like Mary Katranzou and also Gareth Pugh. How did this come about? CL: We just love shopping. I don't look at the brand, I don't look at the most pricey outfit. Even if it's a dollar, I don't care. That's why I didn't really know what I was wearing today because I don't care. If it looks good it doesn't matter. ELLE: Your latest video, \"I Love You\" was a little more mature and looked very Versace-esque. CL: Exactly. That's what I was going for. Last year I was collecting vintage Versace and Chanel, the big medallions. And you know, right now everyone is going for that, it's funny. I started collecting it two years ago but they didn't have any. Now they're putting it out so much it's easy to get. You know those vintage scarves, the vintage Versace scarves? I was wearing them all the time. I told my stylist \"Let's go for it.\" In the video for \"I Love You\" we tried something different as 2NE1. We're more electro-hip-hop. I was like, \"We should do something different.\" There wasn't an album coming out but we wanted to drop a single for our fans and 2NE1's career. We went for a very sexy, mature—you got it!—Versace. You get my point. ELLE: Who is your favorite designer? CL: Am I allowed to say Jeremy Scott? Because people will always say anyone other than Jeremy Scott because he's my friend. I love Chanel. Everything about her was personal. All of those lions she made, she handmade them. Red and green, they were her favorite colors. She kept it personal and real and she was a woman. Everyone loves her. I really like Chrome Hearts, too. I know their family and designers. ELLE: And Fashion icons? CL: I love Grace Jones. She's everything. I don't know, There are so many that I don't want to shout out names. Aaliyah. I'm into '90's fashion right now. Like wearing those big pants and small tops. I'm really into that right now. ELLE: Any plans for a 2NE1 album stateside? CL: Not yet. But we want to do a couple of more songs in English. It's amazing how they can connect to it when it's in Korean. It's amazing when you're onstage and these people are singing in Korean. But in order to do this and understand the lyrics and get into the song I want to make a couple more English songs. ELLE: You have such a big gay following. Do you know about that? CL: Actually yeah. And lesbians too. And drag queens. I love them! I have so many gay friends and I love them so much because they're fun. You know, I can't be friends with guys. You can girl talk with them. They're so special and so talented. And they're so fast with stuff. I can't ask \"do I look good\" to my girlfriends but I will ask my gay friends because they will be honest. They'll be like, \"no girl.\" I can't do that to girls or guys, they won't be honest. I love them because of that. 2NE1; Photo: YG Entertainment Keep up with the latest pop culture news. David Yi is the founder of Very Good Light, a site that aims to redefine masculinity through a beauty lens, and good light cosmetics, a gender-inclusive beauty brand; Pretty Boys is his first book. Who Is Cole Tucker, Vanessa Hudgens’ Fiancé? All About Usher’s Girlfriend Jenn Goicoechea All About Lili Reinhart's Boyfriend Jack Martin All About Patrick Mahomes’ Wife, Brittany Mahomes All About Taylor Swift's Dating History All About Selena Gomez's Dating History Simone Ashley’s Boyfriend Constantin ‘Tino’ Klein All About Karol G's Boyfriend Feid Kylie Jenner on Co-Parenting With Travis Scott Kylie Jenner and Timothée Chalamet’s Timeline A Timeline of Kylie Jenner and Travis Scott Justin Is Considering Contacting Britney A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2013-03-21T11:30:00Z",
    "url": "https://www.elle.com/culture/celebrities/news/a15248/cl-2ne1-jeremy-scott-muse/"
}