{
    "title": "Meet the South Korean Beauty Importers: Insider Beauty, Peach & Lily, and Soko Glam | Vanity Fair",
    "text": "To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. By SunHee Grinnell Trust me when I say that Americans have only begun to experience all that the South Korean beauty market has to offer, as we have hit just the tip of the iceberg.\nThere are so many gems in skin care, from brands such as:  Laneige, Su:m37, and Belif to K-Pop-worthy fun brands like Too Cool for School and Etude, which have been slowly making their way Stateside via beauty destinations such as the international beauty mecca  Sephora and TonyMoly, a new chain of beauty boutiques that have popped up in numerous cities. I call them “eye-candy stores for Korean beauty essentials,” as they carry only Korean brands! But what about the rest of the country, where these stores are hard to find? That’s where these beauty purveyors come in. Meet the founders:\nAngela Kim of Insider Beauty, Alicia Yoon of Peach & Lily, and Charlotte Cho of Soko Glam—sites where you can experience, learn, and even participate in dialogue that is review-based. All of the offerings on these sites are carefully curated, cherry-picked products, and there is plenty of accompanying info about why they might be right for you. Here, the founders give insights into their beauty philosophies, and we highlight some of their current favorite products. Angela Kim: Insider Beauty Angela Kim What were your reasons for, approach to, and philosophy on launching Insider Beauty? Insider Beauty is about bringing a small but well-edited selection of Korean beauty Hall of Famers into the U.S.  A lot of beauty brands from Korea were starting to be offered in large U.S. retailers, but I noticed that many of the popular products Korean women bought weren’t readily available. I wanted to provide “insider” knowledge and bridge that gap by offering products that really put K-beauty on the map—brands like Iope, Hera, and Innisfree, which I would consider to be three indisputable beauty leaders in the K-beauty market—while also bringing in smaller indie brands with large followings. I wanted to create a one-stop shop where women can go in and be able to browse through a well-curated selection of Korea’s top skin care and makeup, with fast and reliable shipping. InsiderBeauty.com was formed to not only be a pipeline for women to easily access hard-to-find products from a place that’s consistent and reliable. It’s an e-commerce site, but we offer digital content, with a very active blog, so that we can educate women on Korean beauty rituals, trends, and culture. A lot of women in the U.S. who are just being introduced to K-beauty are curious but not sure where to start with products, because they often feel overwhelmed by the sheer amount of choices available and aren’t very familiar with the brands. Insider Beauty is really about giving a boutique experience to women in Korean beauty so they can quickly purchase cult-worthy products without doing all the due diligence. What are your current favorite K-beauty products? From left: Su:m37 Skin Saver Melting Cleansing Balm; Laneige Lip Sleeping Mask; Innisfree Sea Kelp Mask Pod. Su:m37 Skin Saver Melting Cleansing Balm is a current favorite. I’ve tried various cleansing balms on the market, and this one beats them out of the ballpark. Some cleansing balms and oils tend to dry out my skin, but this one, in particular, is extremely hydrating, soothing, and luxurious all at the same time. It comes with this ingenious magnetic applicator that conveniently attaches to the lid. You can use it to scoop out the sherbet -like balm, and, after a couple seconds, it’ll magically melt into soft oil that takes off all my makeup. The best part about it is the ingredients—it's chock-full of vitamins, contains fermented apricot-seed oil, and, unlike most balms out on the market, it’s formulated without any mineral oil. By Charlotte Klein By Eve Batey By Bess Levin Laneige Lip Sleeping Mask is also another favorite of mine. It’s packed with raspberry, goji berry, and blueberry extracts, to hydrate lips overnight. I love how intensely moisturizing it is—especially in the colder months, when I’m battling dry and semi-cracked lips. I use the applicator to apply a thick layer onto my lips, and by morning they feel incredibly soft and supple. For masks, I’m currently obsessed with Innisfree mask pods. Their sea-kelp version slowly warms up and helps open pores while nourishing skin. One pod can be used up to two to three times and comes with a tiny slit, so you can easily store it away. **Insider Beauty has changed its name to Via Seoul. The website will still feature the same roundup of cult Korean beauty products as before. Alicia Yoon: Peach & Lily Alicia Yoon What were your reasons for, approach to, and philosophy on launching Peach and Lily? I grew up in Seoul and attended skin school there, and that’s when my passion for skin care began. When I saw that I could transform my eczema-riddled, naturally dry, and fragile skin to be radiantly hydrated and glowing, I wanted to share that with the world. People in the U.S. often found skin care confusing and overwhelming. Therefore, I wanted to find a way to bring the skin-care savvy of Korea to the States: the culture of skin care, the rituals, and the best products. I travel to Korea every six weeks, on average, to work with our extended team there. We meet with the industry’s most trusted dermatologists, aestheticians, and R&D labs to learn more about what’s trending and what really works from a scientific perspective. Then, a careful curating process takes place for my site, along with licensed-cosmetologist-trained, bespoke skin coaches who are only an e-mail away (“Ask Lily”) for providing tailored-made recommendations for personalized skin care. I am a firm believer that skin care is a part of self-care and not about vanity.\nPeach & Lily is a platform to provide the right skin care—whether it’d be something fun, serious, or meditative, or a mindless activity—but we’re here to make sure that whatever approach is taken we provide relevant information, the right kind of tailored service, and the right products. By Charlotte Klein By Eve Batey By Bess Levin What are your current favorite K-beauty products? From left: Shangpree Gold Premium Modeling Mask; Dr. Dream Dream Age Radiance Powder Essence; Mizon Snail Repair Intensive Ampoule. Shangpree Gold Premium Modeling Mask: Spa-grade modeling masks are intensively hydrating and nourishing in a next-level sort of way. In picking the best spa-grade rubber mask, we decided to go with the best spa in Korea, where unparalleled aestheticians have helped to formulate every Shangpree product. The Gold Premium Modeling Mask is one of the most prized creations of Seoul, and it will not disappoint but leave you with an impossible glow. Dr. Dream Dream Age Radiance Powder Essence: Created by one of Korea’s leading plastic-surgery clinics, this powder is actually a liquid. Using a unique encapsulation technology, vitamin C and skin-nourishing ingredients are kept fresh and, therefore, potent, in tiny capsules that give it a powder-like feel. This scentless and colorless powder turns into liquid as soon as you apply it to your face. You can also mix this powder to any skin care to boost its potency. I’ve been using this every day for the last few months, and my skin is Benjamin Buttoning! By Charlotte Klein By Eve Batey By Bess Levin Mizon Snail Repair Intensive Ampoule: Snails might be old news at this point, but this bottle of ampoule takes the snail game up a notch. It’s fast-absorbing, and all the renowned benefits of snail mucin are delivered straight into the skin. Charlotte Cho: Soko Glam Charlotte Cho Your reasons for, approach to, and philosophy on launching Soko Glam? After spending five years in beauty-and-skin-care-obsessed Korea, I transformed my obsession with skin care into a passion project. My husband, Dave, and I launched Soko Glam in 2012 to help Western customers discover Korean cosmetics, beauty trends, and skin-care regimens. Though I am now based in New York City, I visit Korea every quarter, scouring the market, looking for only the best and most popular products to bring to the U.S. I also regularly meet with experts in the field to gain a deeper insight into the trends. I have shared the 10 Step Korean Skincare Routine and the latest Korean beauty trends many times over in The New York Times, Elle, Allure, Glamour, Into the Gloss, Teen Vogue, and more, helping women adapt the Korean “skin care first” philosophy into their own daily routines. Korea is known to be a decade ahead of the global beauty market. I believe learning about Korean skin care will change the way people will think about their skin and how they treat it. Since Soko Glam’s launch, I have received countless positive responses from men and women whose skin conditions have changed for the better. That has inspired me to pursue my aesthetician’s license and become board-certified in New York. Recently, I published the book The Little Book of Skin Care: Korean Beauty Secrets for Healthy, Glowing Skin. My goal is to help people gain a better understanding of their skin and show them that a Korean beauty routine isn’t only amazingly effective, but also that skin care can be fun! What are your current favorite K-beauty products? From left: Neogen Real Flower Cleansing Water; Son & Park Plumping & Shaping Pencil Duo; Banila Co It Radiant Lace Hydrogel Mask Sheet. Neogen Real Flower Cleansing Water: Cleansing waters are making a big splash in Korea, as they offer ways to cleanse and tone the skin in one step! The Neogen Real Flower Cleansing Water sweeps up any impurities, such as makeup and dirt, and it tones the skin. It has real rose petals suspended in the formula, which allow you to reap hydrating and soothing benefits straight from real ingredients (with no artificial colors or fragrance). Son & Park Plumping & Shaping Pencil Duo: A highlighting-and-contouring pencil for the eyes! Koreans like to highlight underneath the eyes, and they have a name for it: aegyo sal. It’s the cute little pudge under the eyes that shows up when you’re smiling. With this sleek tool, you can easily highlight under the eyes to create a bright and vibrant look! Banila Co It Radiant Lace Hydrogel Mask Sheet: One of Soko Glam 2015 Best of Beauty winners, this sheet mask is the prettiest I’ve ever seen on the market, thanks to its delicate lace pattern. Not only does it have style, but it also has substance, infused with ultra-hydrating aloe, sodium hyaluronate, collagen, and white-lily complex. By signing up you agree to our User Agreement and Privacy Policy & Cookie Statement. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. By Katherine Eban By Emily Jane Fox By Vanity Fair By Richard Lawson More from Vanity Fair Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Vanity Fair may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices CN Entertainment ",
    "datetime": "2016-01-20T21:05:59.585Z",
    "url": "https://www.vanityfair.com/style/2016/01/meet-the-south-korean-beauty-importers-insider-beauty-peach-and-lily-and-soko-glam"
}