{
    "title": "Meet the sheet: The rise of Korean face masks | The Independent | The Independent",
    "text": "Please refresh the page or navigate to another page on the site to be automatically logged inPlease refresh your browser to be logged in The Asian-inspired trend is a quick fix for every beauty need, writes Emma Akbareian Find your bookmarks in your Independent Premium section, under my profile From high-tech gadgets to exotic ingredients, you’d be excused for thinking that much of the beauty world is made up of fads. Whilst most bathroom cabinets are full to the brim, nowhere can quite compete with the exacting beauty standards of South Korea, or SoKo as all the cool kids call it. Those in the know have long hailed the superior skincare regime favored on the Asian continent and while 15 or so steps (think cleanse, tone, moisturize and then some) might be beyond most of us, sheet masks are one part even the most time-pressed can get on board with. Blame our new-found obsession with Korean beauty with brands such as The Faceshop and Erborian. Luxury goods conglomerate LVMH took the plunge with a $50m (£38m) minority stake in Seoul-based makeup brand Clio cosmetics last month. If you need any more persuading of the beauty invasion consider BB Cream; five years ago most of us had never heard of what was then a very niche product, but now the Asian staple has a firm place in many makeup cabinets across the globe. If you can’t beat them join them, seems to be the approach of beauty brands that have quickly cottoned on to the trend and are busy launching their own versions of the sheet mask, the product that is quickly becoming our favourite import of the SoKo beauty regime. Simply put a sheet mask is a cloth infused with product that is placed on the face to optimise the penetration and thus the results. There’s also the added benefit of simply massaging in the excess serum at the end, rather than having to wash it off, as is the technique with many conventional facemasks. For the time-pressed think of it as a shortcut to a facial; giving you the all the benefits of superior skincare but without the time and expense of heading to a spa. Estée Lauder launched its own version earlier this year to much fanfare, infused with the brand’s Advance Night Repair serum; it counts Victoria Beckham (who shared an image on Instagram of herself wearing the foil mask) amongst its fans. LA based skincare brand Lancer also launched this year with a lifting and plumping product specifically aimed at fatigued skin, ideal for anyone who is looking to hide the effects of one too many late nights.         Join thought-provoking conversations, follow other Independent readers and see their replies  Want to bookmark your favourite articles and stories to read or reference later? Start your Independent Premium subscription today. Please refresh the page or navigate to another page on the site to be automatically logged inPlease refresh your browser to be logged in Log in New to The Independent? Or if you would prefer: Want an ad-free experience?  ",
    "datetime": "2016-08-22T13:50:50.000Z",
    "url": "https://www.independent.co.uk/life-style/fashion/sheet-face-masks-trend-korea-what-are-they-dolce-gabbana-estee-lauder-starskin-shiseido-a7197021.html"
}