{
    "title": "Melbourne's 6 best Korean fashion and beauty stores",
    "text": "Awesome, you're subscribed! Thanks for subscribing! Look out for your first newsletter in your inbox soon! The best of Melbourne for free. Sign up for our email to enjoy Melbourne without spending a thing (as well as some options when you’re feeling flush). Déjà vu! We already have this email. Try another? By entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions. Awesome, you're subscribed! Thanks for subscribing! Look out for your first newsletter in your inbox soon! Love the mag? Our newsletter hand-delivers the best bits to your inbox. Sign up to unlock our digital magazines and also receive the latest news, events, offers and partner promotions. Déjà vu! We already have this email. Try another? By entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions. Get us in your inbox Déjà vu! We already have this email. Try another? By entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions. 🙌 Awesome, you're subscribed! Thanks for subscribing! Look out for your first newsletter in your inbox soon! Korean brands are taking the world by storm, so here are the best places to shop to revamp your wardrobe and skincare routine Thanks in part to the meteoric rise of K-Pop, Korean brands in the fashion and beauty realms are taking the world by storm. Australia in particular has finally gotten the chance to gain access to buzzworthy names like We11done, Hyein Seo, Cosrx and Dr Jart+ through online retail platforms. On top of that, other Korean labels have been able to set up shops in different parts of the country, including Melbourne. With the Korean fashion and beauty industries continuing to make a global influence, we’ve rounded up the best stores for you to check out. Whether you’re in the process of revamping your wardrobe for the spring and summer seasons or you’re on the hunt for new products to add to your makeup and skincare collections, the list below features a variety of Korean brands that are guaranteed to satisfy your shopping needs. An email you’ll actually love By entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions. 🙌 Awesome, you're subscribed! Thanks for subscribing! Look out for your first newsletter in your inbox soon! Acmé de la Vie, which translates to ‘the pinnacle of life’ in French, delivers up-to-date streetwear with a minimal aesthetic. Offering stylish silhouettes that provide comfort and performance, the Blackpink's Lisa-approved label is known for its graphic oversized hoodies and tees, as well as its matching sets and contemporary accessories. Located at the QV Shopping Centre and Chadstone Shopping Centre, Acmé de la Vie is your one-stop shop for all things trendy and cosy, especially during transitional weather. Acmé de la Vie, which translates to ‘the pinnacle of life’ in French, delivers up-to-date streetwear with a minimal aesthetic. Offering stylish silhouettes that provide comfort and performance, the Blackpink's Lisa-approved label is known for its graphic oversized hoodies and tees, as well as its matching sets and contemporary accessories. Located at the QV Shopping Centre and Chadstone Shopping Centre, Acmé de la Vie is your one-stop shop for all things trendy and cosy, especially during transitional weather. Nestled inside the Midcity Centre on Bourke Street, Unnie111 is fully stocked with charming, elegant designs. If you’re into cardigans, vests, knit tops, skirts and long trousers, this place is just for you. The brand also leans towards a more neutral colourpalette, so expect to be surrounded by shades of white, black and brown. With spring in full force, opt for the chic Suzy Blouse and pair it with your go-to denim shorts. You could also try out the Unique Cardigan if you plan to go on a night out in the city. Nestled inside the Midcity Centre on Bourke Street, Unnie111 is fully stocked with charming, elegant designs. If you’re into cardigans, vests, knit tops, skirts and long trousers, this place is just for you. The brand also leans towards a more neutral colourpalette, so expect to be surrounded by shades of white, black and brown. With spring in full force, opt for the chic Suzy Blouse and pair it with your go-to denim shorts. You could also try out the Unique Cardigan if you plan to go on a night out in the city. If you love your prints and vibrant hues, pay Keiko a visit at one of its four stores in Melbourne. With the warmer days ahead, spice up your wardrobe with new silhouettes like the oversized long-sleeve shirt with pockets in neon green or the sweetheart neck cardigan dressed in a floral print––did we mention it’s available in three spring-ready colours? Don’t forget to skim through its selection of sweaters, which arrive in an array of colourways and graphics. If you love your prints and vibrant hues, pay Keiko a visit at one of its four stores in Melbourne. With the warmer days ahead, spice up your wardrobe with new silhouettes like the oversized long-sleeve shirt with pockets in neon green or the sweetheart neck cardigan dressed in a floral print––did we mention it’s available in three spring-ready colours? Don’t forget to skim through its selection of sweaters, which arrive in an array of colourways and graphics. Founded in 2000 by Amore Pacific in South Korea, Innisfree prides itself on its sustainable products infused with skin-loving ingredients. The products use more than 15 natural ingredients sourced from Korea’s own Jeju Island, where the land is highly fertile from the island's volcanic soil. \nSome of the brand’s best-sellers from its skincare category include the new retinol cica repair ampoule and the classic green tea seed serum and cream. In the makeup range, customers love the vivid cotton ink, which is a moisturising lip tint available in eight shades, as well as the pore blur pact and pore blur primer. The brand is currently located in Melbourne Central, Chadstone, The Glen and Westfield Doncaster. Founded in 2000 by Amore Pacific in South Korea, Innisfree prides itself on its sustainable products infused with skin-loving ingredients. The products use more than 15 natural ingredients sourced from Korea’s own Jeju Island, where the land is highly fertile from the island's volcanic soil. Some of the brand’s best-sellers from its skincare category include the new retinol cica repair ampoule and the classic green tea seed serum and cream. In the makeup range, customers love the vivid cotton ink, which is a moisturising lip tint available in eight shades, as well as the pore blur pact and pore blur primer. The brand is currently located in Melbourne Central, Chadstone, The Glen and Westfield Doncaster. For those on the hunt for popular Korean beauty brands, W Cosmetics houses some of the best labels including Cosrx, Dr Jart+, Etude House, Laneige, Sulwhasoo and more. Whether you’re looking to restock your Laneige Lip Sleeping Mask or have been meaning to try out the Cosrx Advanced Snail 96 Mucin Power Essence, W Cosmetics has it all. You can find W Cosmetics at the Emporium in the CBD or Chadstone Shopping Centre. For those on the hunt for popular Korean beauty brands, W Cosmetics houses some of the best labels including Cosrx, Dr Jart+, Etude House, Laneige, Sulwhasoo and more. Whether you’re looking to restock your Laneige Lip Sleeping Mask or have been meaning to try out the Cosrx Advanced Snail 96 Mucin Power Essence, W Cosmetics has it all. You can find W Cosmetics at the Emporium in the CBD or Chadstone Shopping Centre. While Nudie Glow currently only operates online, the platform offers an extensive list of Korean (think Cosrx, Dr Jart+, innisfree, Missha, Nature Republic and Skinfood) and Australian beauty labels. From skincare to makeup, Nudie Glow has got your beauty needs covered. The platform also makes an effort to put sustainability to the forefront, so you can expect your packages to arrive in a simple white box without extra material like plastic, wrappers, ribbons, crinkle paper or frills. While Nudie Glow currently only operates online, the platform offers an extensive list of Korean (think Cosrx, Dr Jart+, innisfree, Missha, Nature Republic and Skinfood) and Australian beauty labels. From skincare to makeup, Nudie Glow has got your beauty needs covered. The platform also makes an effort to put sustainability to the forefront, so you can expect your packages to arrive in a simple white box without extra material like plastic, wrappers, ribbons, crinkle paper or frills. An email you’ll actually love By entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions. 🙌 Awesome, you're subscribed! Thanks for subscribing! Look out for your first newsletter in your inbox soon! An email you’ll actually love By entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions. 🙌 Awesome, you're subscribed! Thanks for subscribing! Look out for your first newsletter in your inbox soon! Popular on Time Out  Discover Time Out original video     Get us in your inbox By entering your email address you agree to our Terms of Use and Privacy Policy and consent to receive emails from Time Out about news, events, offers and partner promotions. 🙌 Awesome, you're subscribed! Thanks for subscribing! Look out for your first newsletter in your inbox soon! Follow us About us Contact us Time Out products ",
    "datetime": null,
    "url": "https://www.timeout.com/melbourne/shopping/melbournes-best-korean-fashion-and-beauty-stores"
}