{
    "title": "Memebox Closes $35 Million Financing to Fuel Innovation and Accelerate Company Growth | Business Wire",
    "text": "Johnson & Johnson Innovation – JJDC, Inc. (JJDC) Leads the Round SAN FRANCISCO--(BUSINESS WIRE)--Memebox, \n      the K-Beauty upstart known for building fast-to-market brands powered by \n      data-driven consumer insights, announced today that it has closed a $35 \n      million Series D funding round led by JJDC. The funding underscores how \n      digitally native brands that merge innovation with customer centricity \n      are disrupting the beauty industry’s status quo. This takes Memebox, which graduated Y Combinator in 2014, to $190 \n      million in funding to date. Other investors in the company include \n      Formation Group and Goodwater Capital. With K-Beauty principles at its core, the company has a diverse \n      portfolio of best-selling private label brands including I \n      Dew Care, Kaja, \n      Nooni \n      and Pony \n      Effect powered by the latest Korean technology and formulations. \n      Memebox will continue to strengthen its portfolio of indie brands by \n      investing in digital and working with innovative manufacturing and \n      retail partners. The funding will be used to accelerate overall growth for Memebox. “We \n      want to build the next generation of personal care brands by leveraging \n      Korean technology across beauty categories. We work closely with our \n      strategic partners so that together we can imagine and create the next \n      cult product. We are laser-focused on predicting and delivering what \n      consumers are craving and believe taking a science-focused approach is \n      key,” said Hyungseok Dino Ha, CEO and founder of Memebox. “That’s why we \n      are excited about the investment by JJDC as we will leverage the \n      company’s global capabilities and scientific expertise which will enable \n      us to take a big step forward in our focus on innovation, R&D, and \n      ultimately, reaching a global audience.” Memebox’s funding announcement follows the reintroduction of the \n      company’s e-commerce engine in June along with the unveiling of a \n      first-of-its-kind K-Beauty color makeup line, Kaja, in September in \n      partnership with Sephora. The Hatch AgencyMelissa Littlememebox@thehatchagency.com The Hatch AgencyMelissa Littlememebox@thehatchagency.com ",
    "datetime": null,
    "url": "https://www.businesswire.com/news/home/20190124005248/en/Memebox-Closes-35-Million-Financing-to-Fuel-Innovation-and-Accelerate-Company-Growth"
}