{
    "title": "Mercedes-Benz Fashion Week in New York: Nicholas K | Calgary Herald",
    "text": "Reviews and recommendations are unbiased and products are independently selected. Postmedia may earn an affiliate commission from purchases made through links on this page. The first day of Fashion Week is always the most hectic, yet exciting! I race to the Nicholas K show which is the opening act in the Pavilion of the Lincoln Center and I am thankful it has not started; thirty-minutes prior, I was waiting in the long media line-up to pick up my pass. Anyway, I am kindly shown to my seat by staff who point out the section I’m assigned to with the help of a large sign reading “GG” being held by another staff member. It’s a full house and the set up really catches your attention. Everyone is able to get a great view as the seating allows for all models, about to come out, be seen up close by the audience; the runway resembles the letter T. Subscribe now to read the latest news in your city and across Canada. Subscribe now to read the latest news in your city and across Canada. Create an account or sign in to continue with your reading experience. Don't have an account?  Create Account The lights dim and the beat of the music starts pumping. You can feel it in your soul. A spotlight flashes on and a male model by the name of Roberto walks out wearing an all black aka midnight outfit: a stealth jacket, auden shirt and fielding short. It really pops on him against his gorgeous porcelain skin. For this Fall 2014 Collection, designers Nicholas Kunz and Christopher Kunz, a brother and sister duo based in New York, got their inspiration from famous French photographer Jean Gaumy’s Men at Sea. The colour palette included black, burgundy, grey, navy and white. They incorporated layers into many looks and the cut of each outfit made it unique. Their use of accessories stood out. The captain hats, ear headbands and hooded scarves were fun making you want it to be just a bit cold out, so you could sport them.  Postmedia is committed to maintaining a lively but civil forum for discussion and encourage all readers to share their views on our articles. Comments may take up to an hour for moderation before appearing on the site. We ask you to keep your comments relevant and respectful. We have enabled email notifications—you will now receive an email if you receive a reply to your comment, there is an update to a comment thread you follow or if a user you follow comments. Visit our Community Guidelines for more information and details on how to adjust your email settings. To contribute to the conversation, you need to be logged in. If you are not yet registered, create your account now - it's FREE. 365 Bloor Street East, Toronto, Ontario, M4W 3L4 © 2023 Calgary Herald, a division of Postmedia Network Inc. All rights reserved. Unauthorized distribution, transmission or republication strictly prohibited. This website uses cookies to personalize your content (including ads), and allows us to analyze our traffic. Read more about cookies here. By continuing to use our site, you agree to our Terms of Service and Privacy Policy. ",
    "datetime": null,
    "url": "https://calgaryherald.com/life/fashion-beauty/mercedes-benz-fashion-week-2014-in-new-york-nicholas-k"
}