{
    "title": "Miley Cyrus to keep $250K engagement ring from Liam Hemsworth post-split as ‘Hunger Games’ actor moves on, kisses Mexican beauty Eiza Gonzalez days after breakup news – New York Daily News",
    "text": "Daily News e-Edition Evening e-Edition Sign up for email newsletters  Sign up for email newsletters Daily News e-Edition Evening e-Edition Trending: His love lost its luster, but Liam Hemsworth wants Miley Cyrus to keep her massive sparkler. The actor, now rebounding from the nixed nuptials, told Cyrus — whose new hit “Wrecking Ball” recently landed atop the Billboard singles list — that she can keep her $250,000 engagement ring as a symbol of their relationship, RadarOnline reported. Hemsworth was very involved in the design of the ring, going “back and forth” with designer Neil Lane until settling on a 3.5-carat cushion cut diamond in a vintage-inspired gold setting flecked with tiny diamonds, Lane told the Daily News last year. “He wanted something really romantic and beautiful,” Lane said after the pair announced their engagement in May 2012. “It’s really romantic, so she’ll always remember the day he gave it to her.” A New York appraiser estimated its value at a quarter of a million dollars. Cyrus, 20, was wearing the ring when she last appeared in public with Hemsworth at the Aug. 8 premiere of his latest flick, “Paranoia,” in Los Angeles. The doomed couple confirmed their split Monday. For Cyrus, it was a personal low right as her new song reached the top of the charts — with a huge assist from the YouTube viewers. Billboard’s charts now factor in YouTube views, and “Wrecking Ball” did monster numbers on streaming services last week, getting played 36.5 million times — with some 92% of those views coming from YouTube. But in the twerking singer’s personal life, Monday was a really bad day. At the same time the couple said they were through, Hemsworth, 22, was spotted leaving a Los Angeles house with Mexican starlet Eliza Gonzalez. A steamy snap obtained by E! News showed the pair locking lips outside her Beverly Hills apartment Tuesday. The “Hunger Games” hunk reportedly stopped by Gonzalez’s home around 3:30 p.m. to give her a piece of luggage, possibly one left at his house after they reportedly spent the night together following a rendezvous in Las Vegas last weekend. Sources told E! that Hemsworth stayed only for five minutes, but the duo “looked very happy together, chatting closely before the kissing started.” Gonzalez, whose full name is Eiza Gonzalez Reyna, is a 23-year-old actress and singer from Sonora, Mexico. She recently ended an intermittent, two-year relationship with Mexican businessman Pepe Diaz, announcing the split on Twitter Aug. 12. ” title=”Liam Hemsworth spends time with Eiza Gonzalez after splitting with his fiancee, Miley Cyrus. ” data-src=”/wp-content/uploads/migration/2013/09/18/XZ2DD456Z42X2YIIWFCQHCYBLY.jpg”> “I’m single for more than a month!” she told her 760,000 Twitter followers in Spanish. She said she was happy ending one cycle and “excited” about the future. Her Instagram account includes dozens of selfies showing off her supermodel stems and long flowing locks — and also showcases her sense of humor. “I’ve been single for a while and I have to say it’s going very well,” reads one message posted three weeks ago. “Like … it’s working out. I think I’m the one.” According to E!, the stunner only moved to Beverly Hills about two weeks ago to pursue acting opportunities in the U.S. Some highlights of Gonzalez’s career include her big break at 16 when she snagged a lead role in Mexican soap opera “Lola, Once Upon a Time” and her musical efforts, which took off in 2008 after she recorded the first of her two studio albums. Hemsworth and Cyrus, who were together for four years, met in 2009 when they co-starred in “The Last Song” in Georgia. They were engaged two years later. “Thank you for all the love today. I’m happy to share this news with you all,” Cyrus, who was 19 at the time, wrote on Twitter. “I feel like all my dreams are coming true.” Back then she was best known as the Disney star behind the blockbuster “Hannah Montana” franchise. She later ditched her good girl persona and released the edgy hit single “We Can’t Stop” this summer — a grown-up party anthem complete with a racy video. Her provocative performance at the MTV Video Music Awards last month, which included simulated sex with a foam finger and twerking with “Blurred Lines” singer Robin Thicke, completed the transformation. Hemsworth didn’t attend the Brooklyn show and reportedly was “mortified.” ndillon@nydailynews.com Copyright © 2023 New York Daily News ",
    "datetime": "2013-09-18T08:06:00+00:00",
    "url": "https://www.nydailynews.com/2013/09/18/miley-cyrus-to-keep-250k-engagement-ring-from-liam-hemsworth-post-split-as-hunger-games-actor-moves-on-kisses-mexican-beauty-eiza-gonzalez-days-after-breakup-news/"
}