{
    "title": "Missha Joins K-Beauty Boom at Target – WWD",
    "text": "The Seoul-born brand's BB cream, treatment essence and snail cream will soon be available at Target stores. Beauty Editor, West Coast Target’s Korean beauty news keeps on coming: The retailer is putting products from Missha on shelves. Twelve best-selling stockkeeping units from the BB cream powerhouse, which has been available on target.com since 2015, are launching in nearly 750 stores on Jan. 15. In select locations, they will be joining the 13-item lineup curated from various brands by Peach & Lily’s Alicia Yoon to make a major statement about the penetration of K-beauty in the American market. “Not only has K-beauty been growing extensively, but our products have been going viral all over Asia. They’ve already been established around the world, and that’s why Target is bringing us in now,” said Sena Lee, national account manager at Missha’s U.S. arm. “This is a very big deal for us because we’re reaching out to all consumers in the U.S. It will be so easy for them to see the brand, become aware of it and buy it.” Related Articles\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tBeauty Features\n\t\n\n\n\n\t\n\t\t\tBobbi Brown on Three Years of Jones Road\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tRetail\n\t\n\n\n\n\t\n\t\t\tCoperni Brings Parisian Chic to Shanghai With Machine-A Pop-up Priced from $6 to $49, Missha’s assortment within Target will include the BB cream M Perfect Cover in four shades with SPF 42; the primer M BB Boomer; treatment essence, treatment essence mist, treatment essence mask and night-repair ampoule offering from the brand’s Time Revolution range; and snail cream, snail sleeping mask and snail hydro-gel mask from the Super Aqua Cell Renew collection. There are three times as many Missha products housed on Target’s web site for consumers seeking to dive deeper into the brand’s merchandise. “Brands normally have a skin-care line or are just focused on makeup. We have both, and we have quality ingredients and technology for both,” Lee said. She pointed out M Perfect Cover exemplifies Missha’s merging of the best of makeup and skin care. It contains skin-care ingredient stalwarts such as such as chamomile extract, rosemary extract, hyaluronic acid and ceramides to sooth, hydrate and rejuvenate skin while providing coverage to hide imperfections. The BB cream has been Missha’s number-one product online at Target, but Lee underscored the Time Revolution items are hits as well. She highlighted that fermented yeast extract makes up 80 percent of the treatment essence’s formula. “That’s very condensed,” Lee touted. She said the wrinkle-care and brightening ampoule product, which features bifida ferment to strengthen the skin’s barrier and saccharomyces ferment filtrate for antioxidant properties, is also a strong seller. Missha’s owner, the publicly traded Seoul-based Able C&C Co. Ltd., is the third-largest South Korean beauty company trailing the Amorepacific Group and LG Household & Health Care. During the first half of last year, Lee disclosed it generated roughly $210 million in revenues. In 2015, she said its revenue turnover totaled approximately $407 million. Missha is known for an enormous, affordable selection topping 1,300 sku’s spanning skin care and makeup, and has sold more than 50 million BB creams since 2007. In addition, it makes K-beauty splashes by bringing out unusual ingredients like snail slime, a primary component of its Super Aqua Cell Renew products. The brand’s history in the U.S. dates back to 2005, when it opened a Manhattan store. Today, Missha has 11 stores in the country, notably two in New York. Worldwide, Missha has some 2,300 branded stores spread across more than 40 countries. Outside of its own stores, Missha’s American retail network exceeds 1,100 doors with the entrance into Target units. Bed Bath & Beyond, Harmon and Urban Outfitters are among the other retailers that carry Missha.  Sign up for beauty news straight to your inbox every day Top News Stories Alerts Straight to your Inbox. Send us a tip using our anonymous form. WWD and Women's Wear Daily are part of Penske Media Corporation. © 2023 Fairchild Publishing, LLC. All Rights Reserved. ",
    "datetime": "2017-01-12T17:27:48+00:00",
    "url": "https://wwd.com/beauty-industry-news/beauty-features/missha-korean-beauty-target-10746076/"
}