{
    "title": "Missha Announces Frida Kahlo x Missha Tension Compact | Teen Vogue",
    "text": "By Sophie Hirsh When you think of iconic Mexican painter Frida Kahlo's influence on the beauty world, you may recall her gloriously thick eyebrows. But the awesome Frida-themed makeup that K-beauty brand Missha just dropped is not eyebrow-related, but rather inspired by her art — and looking at her colorful paintings, it's easy to see why. The Frida Kahlo x Missha Tension Compact is a limited-edition foundation compact, available in five skin tones and two foundation formulas, all packed with SPF 37. The first formula, Intense Moisture, is made with olive oil, jojoba seed oil, grape seed oil, ceramide, hyaluronic acid, and triglyceride, and it claims keep skin hydrated for 24 hours. The second formula, Perfect Cover, is supposed to even skin tone and create a smooth texture. \"Using her art to channel the pain of tremendous physical adversity and express her progressive views, Kahlo has become an icon for strong women everywhere,\" according to  a press release sent to Teen Vogue. \"Missha is honored to present this collection of Tension Pacts that were designed with Kahlo's bold and vibrant sense of style and artwork in mind.\" The compact comes with a sponge for application and a \"just-right\" pigment balance, and it seems to withstand the summer weather. The news outlet also noted that the foundation also comes with a flowery scent, not unlike the one Kahlo's self-portraits evoke. \"As an organization whose founding principle is based on beauty from the inside out, we were inspired by Frida Kahlo's passion and fighting spirit in the face of the tribulations that plagued her life,\" a spokesperson for the brand told Teen Vogue. \"An icon for strong women, whose bold and unique sense of style pushed the norms of her time, Kahlo serves as a testament to the notion of beauty through individuality rather than conformity which is what we hope to help our customers bring out with our products, their own unique beauty.\" The compacts are scheduled to drop on www.misshaus.com on July 13, for $25 each. Related: The 15 BEST-SELLING K-Beauty Products You Need Right Now By Brianna Wiest By Kaleigh Fasanella By Teen Vogue By Teen Vogue Style Team More from Teen Vogue Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Teen Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "datetime": "2017-06-22T19:59:59.404Z",
    "url": "https://www.teenvogue.com/story/frida-kahlo-makeup-compact"
}