{
    "title": "Morphe drafts in K-beauty influencer Pony to promote spring collection - Global Cosmetics News",
    "text": "TRENDING: Posted by Georgina Caldwell | Jan 21, 2020 | Asia & Australasia, Fashion, Fashion Marketing, Marketing, Products | THE WHAT? Morphe has teamed up with Park Hye Min, a South\nKorean influencer popularly known as Pony, according to a report published by\nAllure. THE DETAILS The social media star will front the US\nbrand’s Icy Fantasy spring make-up line and had a hand in its creation to boot –\nshe’s credited with the creation of 35 pastel shades for the collection’s 351\nIcy Fantasy Artistry Palette. “I had so much fun partnering with Morphe on this cool\ncampaign and I can’t wait to share more with you soon,” Pony posted on Instagram. THE WHY? With 7 million followers on Instagram and a\n5 million-strong audience on YouTube, Pony’s influence is considerable, making\nher a smart choice for the LA-based brand. What’s more, she’s a tried and\ntested beauty partner, having collaborated with MAC last year. Share: Rate: LATEST NEWS Unilever settles in trademark dispute ov...   Walgreens to settle Rite Aid suit for US...   L’Occitane Q2 2024: Sales rise 17....   Two Target executives to retire   Gillette signs up for another season as ...   PRESS RELEASE: Society of Cosmetic Chemi...   L’Oreal to dump Decleor in derma shake-u...   Hermes Q3 2023: sales up 16 percent to €...   Amazon to face lawsuit over data trackin...   J-beauty retailer Yoshitsu to open store...  GLOBAL COSMETICS NEWS Contact UsSubscribePrivacy PolicyCookie PolicyTerms & Conditions SOCIAL MEDIA FacebookTwitterInstagramLinkedInSoundCloudRSSYouTube NEWS HomeAll Regions Cosmetics News WirePodcastOpinionFashionProfessional BeautyTravelWellnessTop 100 Brands Copyright © 2023 Global Cosmetics Media Limited ",
    "datetime": "2020-01-21T06:03:25+00:00",
    "url": "https://www.globalcosmeticsnews.com/morphe-drafts-in-k-beauty-influencer-pony-to-promote-spring-collection/"
}