{
    "title": "Most Popular Sheet Masks And Cleansing Oils | Allure",
    "text": "By Renee Jacques As everyone becomes more and more obsessed with Korean skin care products, beauty companies all over the world have been churning out their own takes on Korean-inspired products. Just think about how many cleansing oils and cushion compacts you've seen lately in Sephora and in drugstores. With so many out there, it's hard to know which ones are the best. So we partnered with the team at Polyvore to list the most popular cleansing oils and sheet masks on their site. When it comes to sheet masks, two Korean brands and one Japanese company made the cut. In third place is the more expensive Shiseido Benefiance Pure Retinol Intensive Revitalizing Face Mask ($63). The Real Nature Avocado Mask Sheet Mask ($4.50) took second place, and the cult-favorite Tony Moly I'm Real Lemon Face Mask Sheet Mask ($7 for two) took first place. It's no surprise that Tony Moly is the most popular sheet mask—we always see people scooping this up in Urban Outfitters. It came as somewhat of a shock to us that no Asian companies made the list of the top three cleansing oils. Instead, Estée Lauder–owned brand Clinique took third place with its Take the Day Off Cleansing Oil ($28), and all-natural American line Tata Harper took second place with its Nourishing Oil Cleanser ($68). The top cleansing oil is Philosophy Purity Made SimpleÂ™ Mineral Oil-Free Facial Cleansing Oil ($25), which hails from France. It kind of makes sense that Philosophy makes the most popular cleansing oil. The company's Purity Made Simple One-Step Facial Cleanser is consistently one of our Reader's Choice winners; it's one of the best and simplest face washes out there. Women Photoshop themselves with an Asian beauty app: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Nicola Dall'Asen By Devon Abelman By Sarah Han By Sarah Han More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2016-03-09T16:30:00.000Z",
    "url": "https://www.allure.com/story/most-popular-sheet-masks-cleansing-oils"
}