{
    "title": "Mugwort, SPF patches and spatulas: These are big trends of K-Beauty 2.0 | Dazed",
    "text": "What comes to mind when you think about K-Beauty? Snail mucin and bee venom, maybe? Or overcomplicated skincare routines with more steps than you thought possible? Well, it turns out that we’ve been getting Korean beauty practices wrong this whole time. “The biggest misconception is the ten-step skincare routine,” says Jin Kwon. “In the international market, people think of the ten-step skincare routine to be Korean. It never existed in Korea, actually.” No one in the UK is more informed on K-Beauty than Kwon, the founder of Korean Beauty distributor Tonic15. Highly curated and beautifully organised, the retailer is host to the best of what K-Beauty has to offer thanks to Kwon’s insider knowledge and rigorous testing procedures – so who better than her to give us the lowdown on what trends and practices are actually being used by the locals? Kwon says that one of the main skincare concerns in Korean metropolises like Seoul is the impact of pollution on skin, with many people opting for skincare products that are gentle, soothing and non-irritating. Skin that is well taken care of is the goal. To achieve this, the locals believe in a more pared-back approach. “Most Korean beauty brands and people think that if you have two or more [active] ingredients in one product, the more chances that it might irritate your skin,” Kwon explains. This also applies to extensive skincare routines. If there are too many steps then there are more chances of ingredients not pairing well together, which can lead to irritation and inflammation. Plus when using so many products on the skin, it’s hard to tell which ones are working well for you and which ones aren’t. Since the beginning of Tonic15’s journey, Kwon’s mission has been K-Beauty 2.0. For her, it’s not just about highlighting new trends, products and ingredients but also about re-educating the west on what we’ve got wrong so wrong about K-Beauty. To help teach beauty aficionados in the UK the true ways of Korean Beauty, Tonic15 opened a pop-up in London this month, which will run through to January 2023, where customers can stock up on beauty faves, trial out new brands and get personalised recommendations from the staff. Here Kwon gives us the lowdown on what’s really happening in the K-Beauty space and all the exciting new brands, trends and ingredients. “Korean people believe that keeping your skin hydrated is the basis for everything,” Kwon says. Hydration is a cure-all for many skin-related issues. “Oily skin becomes more oily when you don’t have enough moisture in your skin, it then tries to compensate for that by creating more oil. So the best way to combat this is to keep the skin hydrated. Same with acne and blemishes, I find hydrating your skin helps balance and strengthens the skin barrier. Koreans tackle blemishes this way rather than using strong actives.” K-Beauty enthusiasts swear by either layering a toner or an essence to help lock in hydration. Essences tend to be thicker than toners and lighter than serums, they help prep your skin for the rest of your routine and help increase the absorption of your serums and moisturisers into your skin. Kwon tells us you can use them interchangeably as long you find the right one. If you’d prefer to use a toner stay away from ones with synthetic fragrances and alcohol. You could layer using the seven-skin method, which means applying your essence or toner seven times to your skin, but Kwon doesn’t think that’s necessary. “You don’t need to layer seven times, but [Korean] people tend to layer their toners several times. They put a thin layer on their skin and then after a bit, apply another thin layer.” Long a popular sport in the country, golf took Korea by absolute storm this summer and to protect their skin out on the course many Koreans took to wearing not just SPF but ergonomic C-shaped patches that physically block the sun. “Sunscreen is a super big category in K-Beauty because people think it’s one of the best products to use for anti-ageing,” Kwon says. Once users are done with their day in the sun, they can simply peel off the patches and dispose of them. While the trend hasn’t reached our shores just yet, with the popularity of pimple patches skyrocketing these last few years, maybe it’s only a matter of time before we are also physically blocking UV rays with cute SPF patches. South Korea has a strict policy on recycling which has resulted in many beauty consumers being more conscious of buying products that are packaged in recyclable materials. Kwon believes that the K-Beauty brand that has responded best to the newer policies in the country is Aromatica. The brand uses 100 per cent recyclable packaging materials, houses its products in recyclable glass or finest PCR (post-consumer recycled) plastic and launched refill stations at its stores. Aromatica also aims to be the first beauty brand in Korea to send zero waste to landfills and incinerators in 2025 by achieving a complete resource circulation via their package tracking control system. “In my personal opinion, this is the most sustainable brand I've ever seen, not just in Korean beauty, but across everything,” says Kwon, who believes the brand is in a league of its own. “The company staff uses older electric cars. They’re putting systems in place to be carbon negative.\" Despite many in the west associating K-Beauty with animal-derived ingredients like snail mucin, Kwon says the majority of beauty products, as well as diets, are actually vegan as that’s believed to be more gentle for the skin. “You see more vegan beauty products than ones with snail mucin or any animal-derived ingredients,” Kwon says. At Aromatica, for example, product formulations are made from 100 per cent pure essential oils and botanical plant extractions. Mugwort might sound like an ingredient from a witch’s potion but the plant has become big in Korean culture in skincare and beyond. “Mugwort is very popular as it’s really soothing and hydrating,” Kwon says. “In Korea, we use it in our skincare and we use it as medicine. People believe that mugwort detoxifies the skin, not only the skin but the whole body.” Koreans love the ingredient so much that they even have dedicated mugwort spas to rejuvenate the body from the inside out. If you are looking for somewhere to start, Kwon recommends the I’m From Mugwort Mask. Centella is another star ingredient which is used to soothe inflammation, increase hydration and strengthen the skin barrier. Glass skin is a K-Beauty term to describe skin that is so smooth, poreless and luminous that it’s almost reflective like glass. You’ve probably seen countless people try to recreate it on TikTok where the hashtag #glassskin has over 600+ million views. In Korea, to achieve the effect many people have been turning to the viral Piccasso foundation spatula, a premium artistry make-up tool which helps apply products smoothly. While the spatula has been popular in Korea for the past year, Kwon was initially sceptical, unsure if it was worth the hype. “When things are trending in Korea, it makes me very careful as I don’t want to bring back something that could be gimmicky,” she explains. “So I actually tried it like a few months ago and I loved it.” The make-up tool was made in collaboration with Korean celebrity make-up artist Ham Kyungsik. “He came up with this method, he used it to apply foundation and then found it works really well. So he modified it by making the blade a lot longer and then the edges are a lot smoother. The weight distribution is really good. It’s made specifically for the face,” Kwon explains. “Isoi, along with Aromatica, is a brand that’s been very popular in Korea for around 10 years,” Kwon says. The brand’s best-selling Blemish Care Up Serum is a cult product – one of the most sold in the country – and made with Bulgarian rose oil and Centella extract for those with acne-prone skin. But if this product is so popular in Korea, why hasn’t it also made a big splash in the west as well? “A lot of [K-Beauty] brands that you see in the international market, people in Korea have never heard of. And a lot of brands in Korea that are doing so well, oftentimes the international market just doesn't know about them,” she says. “Because they are already doing so well in Korea, these brands don’t have the urgency to launch internationally.” Kwon partners with a lot of brands like Isoi, that want to launch in the UK but aren’t sure how. The Tonic15 founder helps with marketing, translation and product registration to ensure that all of the brands she carries are truly successful. “That’s what differentiates us from other retailers,” she says confidently. So if you’re ready to come across new gems, reunite with longtime faves and get the best education on what's really happening in the K-Beauty world then head to Tonic15's pop-up store, located at Angel Central, 21 Parkfield Street, London N1 0PS. ",
    "datetime": "2022-09-28T11:08:00+00:00",
    "url": "https://www.dazeddigital.com/beauty/article/57060/1/mugwort-spf-patches-and-spatulas-these-are-big-trends-of-k-beauty-20"
}