{
    "title": "My Experience With A Korean Heated Eyelash Curler Went Up In Smoke",
    "text": "Fashion  Sure, most Americans know about Korean beauty products, but the wide world of Korean beauty techniques is still relatively uncharted territory among even the most fervent K-beauty fans. One of the weirder Korean beauty techniques out there is curling your eyelashes with flames, which supposedly makes the curl last longer and seem more natural. Now, any beauty technique that involves fire and hair is fairly risky, for obvious flammable reasons. But there's a way to get the look without taking an open flame to your eyelid. Heated eyelash curlers are available at lots of South Korean drugstores and cosmetic stores, and these somewhat high-tech makeup tools purport to create the same effect as using a real flame, without significantly less concern of losing the very eyelashes you're hoping to curl. Even as someone who's always on the lookout for ways to make her stubby lashes look longer without resorting to falsies, I was skeptical that a heated eyelash curler would be the answer to my woes. I don't exactly have many eyelashes to spare, and I didn't want to burn off what I do have or, even worse, accidentally get a first-degree burn on my eyelid. But I'm also a sucker for a good K-beauty trick, so I figured I'd give a Korean heated eyelash curler a shot. The worst that could happen was a scorched eyeball, right? I headed over to my local Olive Young, which I describe as South Korea's Sephora, and found three different heated eyelash curlers from which to choose. Priced between $10 and $25 or so, two were made by a Korean brand, while a third, on the far left, was imported from Japan. I eliminated the option on the far right because the thought of clamping my eyelashes inside a hot plastic device seemed too risky. I was also scared away by the option in the middle because the instructions on the back were only in Korean, and though I can read the alphabet and ask for kimchi in restaurants, I don't speak much more Korean than that. All I could understand was at the very bottom of the packaging, listing the range of temperatures this tool could get to: 80ºC to 120ºC (which is 176ºF to 248ºF for us Americans). Seeing the actual temperature range made me sweat, because I clearly wasn't nervous enough about burning my eye before. The Japanese version of the heated eyelash curler at least had illustrated instructions, so I decided to go with that one. I brought the eyelash curler home, took it out of its casing and popped in one AAA battery, which was not included in the package. The little oval button you see by my thumb below is how you pop the grey stick out of the pink casing. It is not, as I initially thought, a power switch. In fact, this heated eyelash curler has no power switch and no indication whatsoever if it's on or off or even hot enough. I looked back at the instructions and realized that keeping it open was what heat it up, so I went to the bathroom, placed the opened curler on the counter while I took some selfies. To best see the effects of the heated eyelash curler, I decided that I would only use it on my right eyelid, but would then do my regular mascara routine on both eyes in order to see if the tool would make any difference. It should go without saying that this is what my naked eyelashes look like. In my words, they're decidedly stubby and difficult to style. If I'm going out or looking for a dramatic look, I'll layer on the mascara to pump them up, but even then, my lashes never look especially voluminous or lengthy, and I usually end up with black flakes of mascara in my eyeball. That's not to say that mascara doesn't help. In fact, a single swipe of mascara helps open up my eyes tremendously, which is why I'll put on mascara even if I'm not wearing any other makeup. Ignoring every rule my mother ever taught me about putting hot objects near my face, I took the tool up to my right eyelid. If you look closely, you'll see there are two sides to the curler: one smooth concave side and one convex side with a brush. That brush is where the heat is coming from; it actually contains a coil of some sort. (But let's be real: I'm a writer, not an engineer, so I don't know what kind of wizardry is in that thing.) According to the illustrations, I was to use the smooth side first, followed by the brush side. With nothing to lose but my eyelashes, I opened my right eye wide and brought the smooth side of the tool as close to the roots of my eyelashes as I dared. The heat radiated onto my eyeball, a terrifying and entirely unnatural feeling that I did not enjoy. But as I dragged the tool from root to tip, I settled into the strange sensation and became less fearful. I tried moving the grey wand back and forth across my lashes, as I would with mascara. After a few carefully placed swipes, I flipped the tool over and used the brush side. This was closer to the coil, which made it a bit more nerve-racking and a little hotter, but the process was exactly the same. If anything I was fairly more confident in my heated eyelash curling abilities, especially since I had spent about a minute brushing a piece of hot plastic next to my eye without any injury, and was curious to see if it would be effective. I was instantly disappointed because, as you might be able to see, there wasn't much of a difference between my right and my left lashes. The lashes on the right, which had undergone some rigorous heated curling, were slightly more fanned apart, making it appear as if I had a lot more single lashes instead of a few giant spikes of shorter lashes. But it wasn't anything you'd notice unless we were nose-to-nose. Feeling defeated, I went into my regular mascara routine. Recently, I've been digging L'Oréal Voluminous Miss Manga Waterproof Mascara. I took out the wand from the mascara tube, and was shocked at how easy the mascara went onto the heated and \"curled\" lashes on my right eye. There was no friction whatsoever and definitely no clumps, even after several layers of mascara. I moved on to the set on my left eye, which was distinctly more difficult. The brush stuck to my lashes a bit, and I had to get in there with a cotton swab to remove a clump, but after only two swipes, the unheated lashes on my left eye were ready for their close-up. L'Oreal Voluminous Miss Manga Waterproof Mascara, $7, Amazon Believe me when I say that I know this photo looks suspiciously similar than the one I took after I brushed the heated wand through the set of lashes on my right eye, but I swear that they're different. These are my eyelashes after those coats of mascara and if you really zoom in, you can see that the lashes on my left eye are more clumped than those on the right. But, again, the difference between the two is so small as to be negligible. When my eyes were open, you really couldn't tell the difference at all. It definitely was not a smoldering look, but at least I walked away unburned and unscathed and with relatively nice eyelashes. But now for the burning question... I've never had an easier time applying mascara than after using the heated eyelash curler, which was a huge bonus. There were no clumps whatsoever, and because there were no clumps, there were no flakes to worry about falling into my eyes. They application was smooth and the look was totally natural. But that's exactly why I didn't love the heated eyelash curler: My eyelashes looked too natural. There was no additional volume, no extra va-va-voom. And the stress of carefully brushing my eyelashes with a hot tool turned putting on makeup, an activity I usually enjoy, a distinctly unpleasant experience. This doesn't seem like a great long-term lash solution, either. I'd worry that using the heat on my eyelashes all the time could cause some lasting damage to the hairs, because if heated styling tools damage the hairs on your head, I can only imagine they also damage the tiny ones poking from your eyelids. It's also totally possible that I don't have the right eyelashes, or the right temperament for using extremely hot objects so close to my eyeball, to get the most out of the heated eyelash curler. But I probably won't be trying it out again, and I can definitely promise you that I won't be resorting to open flames anytime soon. Images: Maxine Builder Choose an edition: ",
    "datetime": null,
    "url": "https://www.bustle.com/articles/110769-my-experience-with-a-korean-heated-eyelash-curler-went-up-in-smoke"
}