{
    "title": "My sister, the beauty queen",
    "text": " SUMMARY This is AI generated summarization, which may have errors. For context, always refer to the full article.  MANILA, Philippines – “She was really nerdy” is how Victor Young describes his big sister, Miss World Philippines 2013 Megan Young. Up until last August, the 23-year-old former reality show contestant and ABS-CBN talent was just Victor’s ate [older sister]. Today, Megan is a full-fledged beauty queen. On Saturday, September 28, she’ll be competing for the crown of Miss World 2013 in Bali, Indonesia. Victor is the second of the Young siblings, Megan being the eldest, and actress Lauren, the youngest. While Megan never really hid her desire to enter the entertainment industry from her family and friends, the world of beauty pageants was, Victor admits, something of a shock especially when they first saw Megan sashay down the stage in what has now become her trademark pageant walk or pasarela. “I mean, I always see her in heels especially when she hosts events,” explains the 21-year-old graduating college student. “But the full beauty queen look is so different.” By “full beauty queen look” Victor means the full blown hair, thick stage makeup, tan skin, dramatic gown and sky-high heels. “I mean, I know it’s her; she still looks like my older sister. But then just seeing her there on stage, especially during the long gown competition [in Miss World Philippines 2013], it was just overwhelming for me and everyone else we were with. “We all just wanted to cry. I’d never seen her that pretty.” He means this in a good way, of course. Victor describes Megan as “the typical ate: independent, protective, but not overly. She looks after me almost like another kind of mom.” He adds, “We tell each other everything. It’s exactly like how you would talk to a best friend or, sometimes, a therapist. We give each other advice.” Now that a crown and a sash form part of Megan’s daily outfit, there is, Victor admits, a slight difference in his older sister now. “It’s like she became nicer,” he says with a smile. “Even if you don’t talk to her, she just seems nicer. She now gives off that certain aura around her that she’s a beauty queen, and beauty queens are supposed to be nice.” Beauty queens are supposed to be perfect, too. “Since the pageant, she became more cautious of what she does, unlike before. If you compare her with me, for example, I go out and hang out with friends, grab a few drinks. People don’t know me so I can do whatever I want. But Megan has that mindset that people know her and that she has to be careful. But she’s still the same ate for me.” Victor describes to Rappler the moment he became the brother of the beauty queen: “I remember talking to Lauren during that finals night, that Megan had so many awards, and that I felt like the judges were just going to give her all the awards but not the crown. But when she got the crown it was just, ‘Wow. I can’t believe she won.’” The change hasn’t just been in Megan. “One positive thing [out of her win] is that everyone’s getting together to support her,” says Victor. “It’s not just us, her immediate family — also our cousins, aunts and uncles. All of our relatives from abroad are actually getting together making Facebook pages, updating everyone, making t-shirts and are planning to go to Indonesia to support her.” The one negative thing the win has done, though, is that “we’re all separated right now. Lauren’s always working, so she’s never home. Meanwhile, Megan is out of the country. So the only person at home is me. We don’t really get to see each other that often now.” But they still get to talk to each other over social messaging apps. “We’ve actually gotten used to it.” As for his hopes for the upcoming finals night, “I think the qualities any other person would want a beauty queen to have, Megan has: she’s a good person, is giving, approachable and hospitable. I think those qualities will help her win.” Victor points out with a sly grin “if she says something about world peace, I think she’s going to lose.” WATCH: Rappler’s interview with Miss World PH 2013 Megan Young Check out the childhood photos Victor shares exclusively with Rappler:         – Rappler.com  Rappler will LIVE blog the Miss World 2013 coronation night on Saturday, Sept 28, 7pm Philippine time. You can also read:  Peter Imbong is a fulltime freelance writer, sometimes a stylist; and on some strange nights, a host. After starting his career in a business magazine, he now writes about lifestyle, entertainment, fashion, and profiles of different personalities. Check out his blog, Peter Tries to Write. Error. Please abide by Rappler's commenting guidelines. There are no comments yet. Add your comment to start the conversation. JOIN OUR NEWSLETTER Fearless reporting delivered to you follow us    ",
    "datetime": "2013-09-25T05:00:51+00:00",
    "url": "https://www.rappler.com/entertainment/pageants/39806-sister-beauty-queen-megan-young/"
}