{
    "title": "My Week of Doing a 6-Step Korean Beauty Routine Every Night",
    "text": "If you're a human and see this, please ignore it. If you're a scraper, please click the link below :-)\n  Note that clicking the link below will block access to this site for 24 hours. My face was glowing, I had less time for Instagram-scrolling, and I started feeling like my bathroom was my own private spa. Photograph courtesy of Sabbatical Beauty I’ve always had what you might call a “laid back” approach to skincare. I dabble in this product or that product, indulge in free samples, schedule facials too far between one another, and call it a win when I cleanse and add a serum at night. (I do always take my make-up off before bed. I don’t hate myself.) But, as I entered my 30s, I’ve started paying more attention: what products was I using? What ingredients were in them? Who was making them and were they going to help me undo the years of sun damage I did when I thought tanning beds were a recreational activity? I started taking my skincare seriously, and making changes in my routine. My skincare quest culminated in a “skincare consultation” with Adeline Koh at her local inclusive Korean-beauty-inspired outpost, Sabbatical Beauty, in the Bok Building. (They’ve been featured in Bust, Slate, Allure, Shape, and more.) Korean beauty itself is an umbrella term for skin-care products that derive from South Korea, but it usually involves natural ingredients and a rather intense (six-to-ten step) routine. Koh, who is originally from Singapore, has multiple talents — she was an English professor who started creating her own research-based, naturally-formulated K-beauty line in her kitchen in 2016 while she was “on sabbatical,” to deal with her own acne-prone skin. (She also practices martial arts.) Her company has grown from a small start-up to a beloved Philly name brand with a fierce online following. She walked me and some pals through each step of her recommended K-Beauty routine, and also filled me in on how she and her team create all the items in her studio, and hand-package and ship them. It looked like a very beautiful science lab. I was fascinated. I decided to try the full six-step Korean beauty routine for a week, and see what happened. Adeline Koh creating Korean beauty products in Philadelphia. | Photograph by Michael Persico Day 1I was gifted nine trial-size products for this bold beauty exploration, as well as a small guide as to what order to put them on. Adeline explained to me that I could think of the products more as “gentle optional layers of hydration on your skin, much like how you’d dress in layers when the weather turns cold.” That meant I could dress it up and down depending on what my skin needed that day. For my first day, I want to feel the full effect, so I put on as many layers as Joey in that episode of “Friends.” I started with a Vacuum oil cleanse, then a foaming Cucumber Mint vegan cleanse. This was my first time double-cleansing (or using an oil cleanser for that matter), and my face definitely felt like it was getting cleaned and massaged more than usual. I was pleasantly surprised by how easily the oil cleanser took off my waterproof mascara, and I liked the feel of it on my skin. Word to the wise: Oil cleansers are for use on dry skin only, so do not try to use them in the shower. My travel-size 6-step Korean beauty routine products. | Photo by Gina Tomaine After the double-cleanse, I did a Mermaid Jelly Mask for five minutes. This one had a bubbly texture and was made from 90% sea kelp bioferment and chlorella — so, algae. It’s supposed to firm, detox, and boost collagen production. When my skin felt taut I took it off with water and a washcloth, then added my powerhouse Botanical Acid Toner (Koh says this is the Biologique Recherche P50 of her skincare line.) It’s got tropical fruit enzymes from lychee, jujube and pineapple, and fruit alpha hydroxy acids that leave me feeling tingly and fresh. I let my toner sit for 10 minutes, then added an Asian Powerhouse Serum and Dorian Gray Anti-aging Serum (har har), which contains retinol. To top it all off, I moisturized with Donkey Cream, then sealed all those many layers in with a Sake & Rice Sleeping Pack. (Rice has been traditionally used in Asia to cleanse and brighten skin, and fermenting rice makes these properties more bioavailable,” Adeline informs me.) My face does feel like it has a lot of stuff on it, but it also feels very luxurious and pampered. Photograph by Michael Persico Day 2In the morning, I don’t want to go full on K-beauty. More like K-beauty lite. I use a cotton ball soaked with Beauty Water to remove remnants from the night before. The Beauty Water smells great, and contains a combo of rose, lavender, and Hydrolyzed silk. It’s a kind of gentle toner which feels like it gets the job done, but isn’t as harsh as the Botanical one. I add an Asian Powerhouse serum and a little bit of Donkey Cream. At night, I do the whole shebang all over again. Day 3I like the products not just for how they’re making my skin feel (like I’m a glow-y goddess) but also how they’re making me pay attention to the order of ingredients on the packaging.  “I was annoyed because I had acne-prone skin, and I was looking to buy K-beauty products, but many generic products are low in botanical active ingredients. That means I would find a product that has ginseng in the name but ginseng is the last ingredient on the list!” explains Adeline, “I ended up formulating my own products, because I couldn’t find anything with high enough botanical extract concentrations. I formulate using botanical actives at a much higher concentration level than you will find in most products. I also use herbs and cosmeceuticals (like retinol, vitamin C) together, so that I’m combining contemporary science with traditional medicinal knowledge.” Mind. Blown. Photograph courtesy of Sabbatical Beauty Photograph courtesy of Sabbatical Beauty Day 4I’m keeping pretty close to the routine, and also finding that adhering to it necessitates I step away from scrolling my phone, answering e-mails late night and scheduling them for the morning, and/or watching Grace and Frankie on Netflix. Instead, I find myself in my bedroom mirror with the lights dimmed, a candle on, and nothing to do but rub soothing botanical products on my face for about 10 minutes. It’s lost time I didn’t know I could so easily pick back up. It feels calming and also revolutionary. Day 5I’m still doing it, every night and every morning. And no joke, people are complimenting my skin. Korean beauty is now everything to me. How do I go back to life before this? Day 6Several people have asked me about my skincare routine in casual conversation so I’m clearly now a skincare influencer.  I happily point them in the direction of Sabbatical Beauty’s Instagram, and also mention there are other great skincare boutiques in Philly producing local, natural beauty products. Photograph courtesy of Sabbatical Beauty Day 7I’m now committed to this routine beyond the week. This is best my skin has ever felt or looked — granted it’s also the most attention I’ve ever paid to it, too. I’m planning to try new products (bless those travel sizes!) and see what works best for me. I’m intrigued by how this brand popped up in Philly, and its increasing popularity. When I ask Adeline about our local blossoming skincare scene, she’s quick to point out that there’s great movement in Philly with Korean beauty — and with inclusive indie beauty outposts in general. “New skincare boutiques like us, and like Marsh + Mane and Freedom Apothecary are curating what I consider to be ‘Radical Beauty.’ They’re pushing forwards beauty ideals that are actually diverse and don’t just talk the talk,” Adeline tells me, “Radical Beauty to me means seriously examining what it means to be an intersectional feminist, celebrating beauty when it looks so different across various shades of melanin, hair textures, skin types, life stages and body types — to envision beauty in the most inclusive way possible.” Want to hear more from us? Join Be Well Philly at:FACEBOOK | INSTAGRAM | NEWSLETTER | TWITTER 9 Healthy (and Cheap!) Fall Date Ideas in Philadelphia An Eight-Week Training Plan for the Philadelphia Marathon The Best Fall Foliage Hikes in and Around Philadelphia 2023  © Metro Corp. All Rights Reserved. ",
    "datetime": "2020-01-27T19:03:11+00:00",
    "url": "https://www.phillymag.com/be-well-philly/2020/01/27/korean-beauty/"
}