{
    "title": "Nesting owls close climbing routes in K-Country | Calgary Herald",
    "text": "Heads up! Yes, literally. Early this week, Kananaskis Country officials closed some rock climbing routes near Grassi Lakes because there are Great Horned Owls nesting in a nearby cave. Apparently the owls return to the same spot every year. And, every year, conservation officers get reports of the owls dive bombing the climbers in the area. So, it’s become an annual closure to prevent injury to people using the area and give the owls their space. “Typically we won’t remove it until late June or early July,”  said Arian Spiteri, conservation officer for Kananaskis Country. “We don’t want them to be disturbed.” There are, however, still areas that you can use for hiking or climbing around Grassi Lakes. For full details on the closure, see the poster below. Subscribe now to read the latest news in your city and across Canada. Subscribe now to read the latest news in your city and across Canada. Create an account or sign in to continue with your reading experience. Don't have an account?  Create Account Postmedia is committed to maintaining a lively but civil forum for discussion and encourage all readers to share their views on our articles. Comments may take up to an hour for moderation before appearing on the site. We ask you to keep your comments relevant and respectful. We have enabled email notifications—you will now receive an email if you receive a reply to your comment, there is an update to a comment thread you follow or if a user you follow comments. Visit our Community Guidelines for more information and details on how to adjust your email settings. To contribute to the conversation, you need to be logged in. If you are not yet registered, create your account now - it's FREE. 365 Bloor Street East, Toronto, Ontario, M4W 3L4 © 2023 Calgary Herald, a division of Postmedia Network Inc. All rights reserved. Unauthorized distribution, transmission or republication strictly prohibited. This website uses cookies to personalize your content (including ads), and allows us to analyze our traffic. Read more about cookies here. By continuing to use our site, you agree to our Terms of Service and Privacy Policy. ",
    "datetime": null,
    "url": "https://calgaryherald.com/news/local-news/nesting-owls-close-climbing-routes-in-k-country"
}