{
    "title": "New York's Seunghyun Suh Is the Stylist to the K-Pop Stars",
    "text": " Profile Sections tv Featured More From NBC Follow NBC News A man arrested in the killing of a Baltimore tech entrepreneur was suspected of raping a woman days before and was already under surveillance, police say September 28, 2023, 12:24 PM Michael Gambon, the actor best known for playing Dumbledore in the 'Harry Potter' films, dies at 82 September 28, 2023, 8:02 AM Morning Rundown: Biden impeachment inquiry's first hearing, Powerball jackpot nears $1 billion, and Kansas City's love story with Taylor Swift September 28, 2023, 7:36 AM U.S. soldier Travis King arrives back on American soil after being expelled from North Korea September 28, 2023, 4:04 AM Remains found in Colorado are identified as Suzanne Morphew, a mom who disappeared in 2020 September 27, 2023, 5:54 PM The mother of a man suspected of killing a Baltimore tech CEO urged him to surrender, fearing police would try to kill him September 27, 2023, 2:37 PM Seunghyun Suh doesn’t look like one of New York City’s most in-demand stylists. A petite woman with a short bob, Suh's understated demeanor hides her popularity in fashion circles and with South Korean celebrities. She’s gone on tours with K-pop idols and worked on countless ads and photoshoots, all from the heart of the New York City Koreatown salon she co-owns with her husband. “I like working with celebrities because I can be more imaginative,” Suh, 44, told NBC News through a translator. “When I work with a client in the salon, I work within the realm of what they want, but for stage you can be freer.” RELATED: Korean Beauty Products, Once Niche, Are Entering the U.S. Mainstream The stage has been where much of Suh’s work has been displayed. She traveled with Korean girl group the Wonder Girls and the Jonas Brothers during their 22-state tour in 2009 and more recently styled Korean singer Gummy as well as Kim Jong Gook and Haha, stars of the Korean variety show \"Running Man.\" Suh moved to the United States 11 years ago from Seoul, where she worked at a hair salon in the fashion forward Cheongdam-dong neighborhood. The move was difficult, but the city inspired Suh more than any other. Her salon reflects the inspiration, featuring a light fixture made out of musical instruments and a crystal chandelier. “At first it was hard to get business and adjust to New York City,” Suh said. “But after I figured out that doing fashion here was really unique, I fell in love with the city. My eyes opened up once I came to New York. In Korea, there’s a certain look that’s trendy. But here, because of the diversity, there’s so many different styles to work with.” https://www.instagram.com/p/9bcZc_ual2 \"My eyes opened up once I came to New York. In Korea, there’s a certain look that’s trendy. But here, because of the diversity, there’s so many different styles to work with.\" Suh’s Cheongdam-dong connections helped her become the in-demand makeup artist and hair stylist in New York for Korean stars. JYP Entertainment, one of Korea's largest entertainment agencies, chose her to style the Wonder Girls over several other stylists. She remembers working with the singer Rain and actresses Lee Yeon Hee and Han Hyo Joo, but said she's worked with too many stars to recount them all. Other clients include Korean boy band TVXQ, actor Lee Min Ho, and Seattle-raised entertainer Jay Park. “At first I didn’t really dream of working with celebrities, but then I found out that was the field I liked,” Suh said. “When you start doing hairstyling, people tend to go through a lot of slumps because it’s so hard. For me it was pretty smooth. I got lucky, so I was able to dream big. I never dreamt of quitting.” As interest in Korean beauty products have increased, Suh has worked on ad campaigns for the K-beauty brand Peach and Lily and drugstore cosmetic brand Kiss. The rise in popularity excited her, and she said her salon has been busier than ever. During New York Fashion Week, Suh had no time to spend at Kakaboka, working on location at fashion shows nearly the entire week instead. “Since K-beauty became more popular, an increasing amount of people have come to the salon for Korean makeup,” Suh said. Her K-Beauty–America love affair goes two ways, she said, noting how New York City has changed her and others she knows. “I think Koreans love New York City because there’s more to see here,” Suh said. “There’s more arts, fashion. There’s everything here. I’ve been to Europe and other places, but there’s nothing like the city. I feel younger since I’ve been working here and work with young, fashion-forward people. I became more open-minded.” RELATED: Filthy Rich Barbershop Gives Celeb-Status Cuts With a Hometown Vibe In the future, Suh wants to teach more people in New York about Korean beauty and launch a hair care line that will negate the damage done from frequent hair treatments, perms, and coloring. She also wants to help sustain the Korean beauty trend, which she is glad to be a part of. “I feel really proud that Korean makeup is getting more popular,” she said. “I want to get my name out there more about makeup. I want to make K-beauty bigger.” Follow NBC Asian America on Facebook, Twitter, Instagram, and Tumblr. © 2023 NBC UNIVERSAL ",
    "datetime": null,
    "url": "https://www.nbcnews.com/news/asian-america/new-york-s-seunghyun-suh-stylist-k-pop-stars-n546681"
}