{
    "title": "New Beauty Boutique Chain Offers One Stop Shop For Korean Skincare Products",
    "text": "Searching for your content... In-Language News Contact Us 888-776-0942\n\nfrom 8 AM - 10 PM ET ARITAUM features the largest curated collection of premium K-beauty brands in North America News provided by 22 Mar, 2016, 09:00 ET Share this article NEW YORK, March 22, 2016 /PRNewswire/ -- Korean skincare is one of the hottest trends in beauty right now, and a new chain of boutiques is offering women a one stop shop for all their K-beauty needs. From sheet masks and softeners to serums and cushion foundations, ARITAUM features the largest curated collection of premium Korean beauty products in North America. In addition to carrying such leading skincare brands as IOPE, Laneige, Mamonde, Hanyul and Sulwhasoo, the boutiques also offer a wide selection of makeup, bath & body and hair care items. There are over 70 ARITAUM locations across the United States and Canada with more opening throughout 2016. To locate the ARITAUM store nearest you, visit http://us.aritaum.com. The name ARITAUM (pronounced \"ar-ree-ta-um\") comes from the words for \"beauty\" and \"place\" in Korean. ARITAUM is a division of AmorePacific, South Korea's #1 skincare and cosmetics company, known for their innovative products that combine Asian botanical ingredients with cutting-edge technology. In recent years the popularity of Korean skincare has increased exponentially in North America with leading beauty outlets such as Vogue, Allure and Refinery29 praising their virtues and benefits. The active ingredients in these products are typically nature- and herbal-based remedies known for their medicinal qualities, such as red ginseng, lotus flower and green tea. As part of the Korean skincare philosophy, these creams, gels and mists are applied in concert with a holistic and customized regimen that emphasizes prevention, protection and rejuvenation. Some of ARITAUM's featured skincare brands include: \"Interest in Korean skincare products is at an all-time high for one simple reason: they work,\" said Jay Yim, Director of Marketing, ARITAUM AmorePacific. \"ARITAUM provides a convenient destination for these incredible products and offers our customers a chance to experience the fantastic world of K-beauty.\" About ARITAUMWith over 70 locations throughout the United States and Canada, ARITAUM offers the largest curated collection of premium Korean beauty products in North America. A division of AmorePacific, South Korea's #1 skincare and cosmetics company, ARITAUM features such leading brands as IOPE, Laneige, Mamone, Hanyul and Sulwhasoo. ARITAUM (pronounced \"ar-ree-ta-um\") comes from the words for \"beauty\" and \"place\" in Korean. To locate the ARITAUM store nearest you, visit http://us.aritaum.com or follow us on Instagram and Facebook @US.ARITAUM and Twitter @US_ARITAUM. About AmorePacificFor over 70 years, AmorePacific has provided global customers with a total package of beauty and health solutions through 30 brands spanning beauty, household, and healthcare products. With the increasing global demand for K-beauty products, the South Korea-based company has experienced unprecedented sales growth in recent years. AmorePacific's revenue increased by 21% to $4.5 billion in 2015 and is projected to exceed that figure in 2016. In December, Forbes Asia named Chairman and Chief Executive Suh Kyung-Bae as their 2015 Businessman of the Year. ©2016 ARITAUM Contacts: Jennifer Ju, IW Group, Inc Phone: (310) 289-5564 [email protected] Nina Shi, IW Group, Inc Phone: (646) 979-1840 [email protected] Photo - http://photos.prnewswire.com/prnh/20160321/346474 SOURCE ARITAUM http://us.aritaum.com Sign up to get PRN’s top stories and curated news delivered to your inbox weekly!  ",
    "datetime": null,
    "url": "https://www.prnewswire.com/news-releases/new-beauty-boutique-chain-offers-one-stop-shop-for-korean-skincare-products-300239114.html"
}