{
    "title": "New York's Sceney Beauty & Essex Clubstaurant Opening in Hollywood - Eater LA",
    "text": "Filed under: No confirmed location but most likely inside the new Thompson Hotel. Beauty & Essex, one of New York City's premier scene restaurants that offers dark, clubby environs, is opening in the heart of Hollywood, according to the LA Times. Though the Times doesn't offer a confirmed location, it does write that chef Chris Santos, a familiar sight on Food Network's Chopped, will open the place some time in 2016. Word on the street says that B&E will land in the new Thompson Hotel, which opens down the block from littlefork on the corner of Selma and Wilcox. According to Curbed, the hotel has a planned 7,300 square foot restaurant on the ground floor, plenty of space for Santos' clubstaurant to prosper. No word yet if that's where B&E will land but it seems like the ideal place. Here's what you need to know about Beauty & Essex. First, there's a bar in the women's bathroom that serves free champagne. Second, the decor is plenty of that flashy faux-vintage (you'll see similarities with Faith & Flower and Rose.Rabbit.Lie). Third, the fare is all over the place, with tuna poke wonton tacos, oysters, butter poached lobster toast, guanciale pizzettas, pastas, and baby back ribs. It's everything for everyone who ever wanted to eat food while also feeling cool. Santos also co-owns The Stanton Social, another over-the-top but well executed dining hall much in vein of Beauty & Essex. Santos is also opening Beauty & Essex inside the former comme ça at the Cosmopolitan in Las Vegas some time in 2016, which is no big surprise. This is the first time the Tao Group is making their mark here in Los Angeles. Sign up for our newsletter. Check your inbox for a welcome email. Oops. Something went wrong. Please enter a valid email and try again. Filed under: Filed under: Filed under: ",
    "datetime": "2015-08-19T12:58:35-07:00",
    "url": "https://la.eater.com/2015/8/19/9179115/beauty-essex-hollywood-opening-club-restaurant"
}