{
    "title": "Nordstrom Vancouver feeds K-Beauty craze with new skincare- and cosmetic-centric pop-up shop | Georgia Straight Vancouver’s source for arts, culture, and events",
    "text": "Style Choices  Even if you’ve never owned a Korean beauty product, you’re likely familiar with the nation’s 10-step skincare regimen—an exhaustive routine that promises a plump, glowing, and unblemished complexion with regular use—and its application of out-there ingredients (snail mucus, anyone?) that typically keep our Korean brothers and sisters way ahead of the cosmetic curve. Now, Nordstrom (799 Robson Street) is offering Vancouverites a new way to experience the K-Beauty craze with its latest pop-up shop. From today (February 17) until March 28, customers can visit the dreamy, pastel-hued space to browse over 500 makeup and skin- and body-care products for men and women. Up for grabs? Exfoliating swabs infused with 24-karat (!) gold, “whipped” facial treatments made from whole eggs, and face, nose, and foot (?!) masks as far as the eye can see. For your vanity, expect hydrating liquid blushes, smudge-proof metallic eyeliners, and long-wear lip tints stashed in adorable, cartoon-adorned tubes, plus never-before-seen-in-Canada items from cult brands such as Too Cool for School, IPKN, and more. The pop-up is the second installment of KPOP-IN @ Nordstrom, a three-part series that celebrates Korean fashion, beauty, and culture. Last month, the department store spotlighted Korean eyewear brand Gentle Monster. Check out a few of our favourite products from Nordstrom’s K-Beauty pop-up below. The Korean-inspired series wraps up in April with a temporary boutique dedicated to Korean-designed apparel. Lucy was a staff writer at the Straight from 2015 to 2018. She covered a myriad of topics, including, but not limited to, design, style, green living, and arts, culture, and film. When not writing, she can be found catching up on Justin Bieber’s latest antics (no prenup, though?), fine-... There are a lot of things about how Translink operates that I wish would change. Right now, I&... You were at the next table. You couldn't take your eyes off me, and you kept smiling and... ",
    "datetime": "2017-02-17T11:50:00-08:00",
    "url": "https://www.straight.com/life/870206/nordstrom-vancouver-feeds-k-beauty-craze-new-skincare-and-cosmetic-centric-pop-shop"
}