{
    "title": "Nordstrom Introduces K-Beauty Pop-In Shop | Teen Vogue",
    "text": "By Sarah Wu We’ve long suspected that K-beauty products actually come to us in a time machine from the future. The ahead-of-the-trend skincare, makeup, and haircare is like nothing else we already own, and the innovations just keep coming. If you live Stateside, chances are you know about popular sites like Peach & Lily or Soko Glam. But today, Nordstrom just made things more accessible than ever by introducing their major K-beauty collab, and you’re going to want to shop it, stat. Pop-In@Nordstrom is introducing 500 products (including some being sold in the U.S. for the very first time) for the next seven weeks — both in select stores and online at nordstrom.com/POP. The brands include popular names like Too Cool for School and Glow Recipe, as well as ones we’ve never heard of (like I Woke Up Like This, A’Pieu, and Onnu). We won’t even attempt to narrow down the sea of launches to a top-10 list, but if you’re feeling overwhelmed, try starting with a gemstoe soap or pumpkin sleeping mask. If you’re lucky enough to live near one of the pop-in shops (find the full list here), you’ll be able to browse the hydrating jelly eyeshadows and 24-karat gold swabs (yes, they do exist) in-person. And don’t worry — you can’t miss the stores. Just let the pink and blue gel walls, fuzzy yoga balls, and neon pink sign guide you to a better beauty collection. Related: The 15 BEST-SELLING K-Beauty Products You Need Right Now By Kara Nesvig By Shauna Beni-Haynes By Shauna Beni-Haynes By Aiyana Ishmael More from Teen Vogue Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Teen Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "datetime": "2017-02-10T20:49:25.473Z",
    "url": "https://www.teenvogue.com/story/nordstrom-k-beauty-pop-in-shop-details"
}