{
    "title": "Nordstrom’s Korean Beauty Shop Will Sell More Than 500 Products - Racked",
    "text": "This site uses cookies. Select \"Block all non-essential cookies\" to only allow cookies necessary to display content and enable core site features. Select \"Accept all cookies\" to also personalize your experience on the site with ads and partner content tailored to your interests, and to allow us to measure the effectiveness of our service. To learn more, review our Cookie Policy, Privacy Notice and Terms of Use. Filed under: Including some brands that have never been sold in the US. Racked has affiliate partnerships, which do not influence editorial content, though we may earn commissions for products purchased via affiliate links. We also occasionally accept products for research and reviewing purposes. See our ethics policy here. Racked is no longer publishing. Thank you to everyone who read our work over the years. The archives will remain available here; for new stories, head over to Vox.com, where our staff is covering consumer culture for The Goods by Vox. You can also see what we’re up to by signing up here. In case you needed more reasons to shop at Nordstrom, here’s one: lots and lots of Korean beauty products. Starting today and running through March 26th, the retailer is hosting a pop-up shop featuring over 500 K-beauty products. Seven stores in the US and Canada (see the list here) and the website will carry the K-beauty merchandise. The shop is part of Nordstrom’s “Pop-In” initiative, a series of themed pop-up shops. The first three of 2017 have been dubbed “KPOP-In” and focus on Korean brands. The first featured Gentle Monster sunglasses, and the last will focus on Korean fashion. According to Nordstrom, for many of the brands here, this shop will mark their US debut, which is pretty darn exciting if you’re a K-beauty fan or just love things that no one else can get. There are also some more familiar brands, like Too Cool for School and a mask collection curated by Glow Recipe, the K-beauty e-commerce site. Other brands include Sukoo Sukoo, A-Pieu, Crème, DTRT, Huxley, and Hanahzo. Prices range from $10 for makeup purse mirrors to over $80 for serums. You’ll find skincare, makeup, nail polish, little trinkets, and makeup bags. In case you’re a little overwhelmed by the wide selection, here are some intriguing products to toss into your cart: Who doesn’t love a good salt scrub? Plus, this packaging is A+. And soap in the shape of a gem is a no-brainer. Vant’s Facial Purify Mask can be used as a cleanser or a mask. It contains two types of clay plus charcoal and green tea extract. I’ve tried the Huxley serum and it is luxurious and not greasy at all, with a bonus inspirational quote on the bottle: “Great things never came from comfort zones.” Korean beauty brands are known for their crazy long-wearing lip stain formulas, and this one from TPSY looks promising. You also can’t go to a K-beauty sale without picking up some sheet masks, and this milk carton is adorable.    ",
    "datetime": "2017-02-10T11:32:01-05:00",
    "url": "https://www.racked.com/2017/2/10/14568928/nordstrom-korean-beauty-shop"
}