{
    "title": "Nordstrom's Korean Beauty Pop-Up Shop: Everything You Need To Know | Allure",
    "text": "By Gillian Fuller For those of us who live and breathe all things beauty, Korean beauty is a godsend: The foreign-born industry is packed full of innovative, fun products, often at super-low price points. Unfortunately, coming across these Asian beauty goodies isn’t always easy, especially if you don’t live within driving distance to a Sephora—or want to pay an arm and a leg for foreign shipping charges. Luckily, access to K-beauty just got a lot easier, thanks to Nordstrom. The department store—which made headlines earlier this week for dropping all Ivanka Trump products from its inventory—just launched a K- beauty concept shop, bringing high-end Korean makeup, skincare, body products and more to the masses. Trust me: You’re going to want to check this out. The pop-up shops, which are tricked out in kitschy Korean-inspired decor like fuzzy pink yoga balls and spinning light displays, launch at seven North American Nordstrom locations (in Seattle, Los Angeles, Dallas, Chicago,Vancouver, Toronto, and Bellevue, WA ) and online today, February 10. The shops feature more than 500 (!) beauty products, including cult faves from brands like Too Cool For School (we've obsessed with their Egg Mousse Body Oil) and Glow Recipe, to exclusive finds never before sold on this side of the Pacific. Best of all? Everything clocks in at under $100—so you’re safe to shop to your heart’s (or wallet’s) content. Unlike Nordstrom’s new natural beauty section, which launched last month, the K-beauty concept shop is separate from Nordstrom’s in-house beauty selection, and—at least, for now—temporary. Both the brick-and-mortar locations and the online shop will run through March 26th. However, according to Popsugar, if the pop-up proves successful, Nordstrom may consider permanently expanding its K-beauty offerings, making the world—or at least, um North America—a more diverse, prettier place for us beauty lovers. More on Korean beauty: Scroll down to see some of the coolest products on offer, and head to Nordstrom to shop the crazy-good selection for yourself. A'pieu Set of 7 Milk Sheet Masks ($18) Creme Simple Stone Soap ($18) By Aliza Kelly By Gabi Thorne By Gabi Thorne Hanahzo Cotton Candy Salt Scrub ($28) Watch: Korean Actress and Pop Star Jihae’s All-Natural Beauty Routine By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Sarah Han By Angela Trakoshis By AnaMaria Glavan By Sarah Han More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2017-02-11T19:00:00.000Z",
    "url": "https://www.allure.com/story/nordstrom-korean-beauty-pop-up-shop"
}