{
    "title": "North Korea to Develop Homegrown Beauty Market",
    "text": "Print No media source currently available  North Korea is asking its young, middle-class women to give up international cosmetics and use products made in their own country. The cosmetics campaign comes as international trade restrictions tighten, and products made in other countries become even more difficult to get. Pushing homegrown beauty has been a political goal since the days of the North’s first leader Kim Il Sung. But the effort has become stronger under his foreign-educated grandson, Kim Jong Un. Recent defectors and North Korea experts say the campaign is having some success because of the popularity of South Korea’s K-beauty movement. The K-beauty movement uses products with natural ingredients that are plentiful in both Koreas. But North Korea’s attempt to create K-beauty products of their own has met with some quality issues. Manufacturers also have difficulty importing the few foreign ingredients that cosmetics require. Leader Kim Jong Un once dismissed North Korean beauty products, saying they make “raccoon eyes,” reported the Japan-based Choson Sinbo newspaper in 2015. But Kim has since visited cosmetic factories several times with his wife to popularize the products. Earlier this year, North Korea’s state-run television KRT showed a video about Pyongyang Cosmetics Factory. It showed a woman replacing Chanel products with North Korean products. “Lots of foreign customers living in the state visit our shop,” Yang Su Jong told Reuters on a rare visit to the capital last year. She is a sales assistant at Pyongyang Cosmetics Factory. Chanel, in response to Reuters’ questions, said it did not export products to North Korea. It suggested the products were illegal copies. First lady and a girl band North Korea has long controlled its peoples’ appearance. Blue jeans and clothes with writing in English were banned under Kim’s father, Kim Jong Il. The closed country was trying to keep Western influences out. But that has changed since Kim came to power in 2011. He and his wife, Ri Sol Ju, began making public appearances. Ri, a former musician, wore colorful clothing that appealed to a desire for self-expression, explained Nam Sung-wook. He is a professor of North Korean studies at Korea University. “Kim Jong Un…gave rise to first lady Ri Sol Ju, who furthered the regime’s interest in cosmetics,” he said. Kang Na-ra is one North Korean defector who said she used to buy South Korean cosmetics at private markets that help form the North’s informal market economy. “I really wanted to copy (K-beauty) makeup…when I was in the North,” she said. Today North Korean women are asked to wear the kind of clothing and makeup used by either the first lady, or the all-woman ‘Moranbong’ musical group. Moranbong is North Korea’s answer to South Korea’s popular K-pop music. New markets and limits Pyongyang Cosmetic Factory shipped some Unhasu brand cosmetics to a new store in Moscow in May, Russia media reported. “Korean Care” is another Russian cosmetics shop selling South Korean products online. It started importing North Korean beauty products directly from Pyongyang last year. The company targets Russian women and has more than 10,000 customers. It says the products are popular because of their natural ingredients. “It was especially interesting because it’s North Korean,” said Margarita Kiselyova. She is a Russian customer who bought several products. “I am satisfied with the quality,” she added. A major South Korean cosmetics company called Amorepacific tested 64 North Korean products. It found some had small amounts of harmful ingredients. Amorepacific told Reuters it did not have additional details about the tests. I’m Susan Shand.  The Reuters News Agency reported this story. Susan Shand adapted it for VOA Learning English. Mario Ritter Jr. was the editor. Write to us in the Comments Section or on our Facebook page. _______________________________________________________________  cosmetic – n. a substance that you put on your face or body to improve your appearance defector –n. someone who leaves a country, political party or organization to go to its competitor or enemy plentiful –adj. available and easy to find brand – n. a category of products that are all made by a particular company customer – n. one who buys things regime – n. a form of government  ",
    "datetime": null,
    "url": "https://learningenglish.voanews.com/a/north-korea-to-develop-homegrown-beauty-market/5034646.html"
}