{
    "title": "Olivia Kim Launches Korean-Themed Pop-In Series With Gentle Monster",
    "text": "Searching for your content... In-Language News Contact Us 888-776-0942\n\nfrom 8 AM - 10 PM ET News provided by 06 Jan, 2017, 09:00 ET Share this article Korean fashion and style take center stage in the first three Pop-In Shops of 2017 SEATTLE, Jan. 6, 2017 /PRNewswire/ -- For the first time Nordstrom is unveiling a three-part shop in its series of pop-up shops, aptly titled KPOP-IN@Nordstrom, featuring the exciting and vibrant cultures of Korean fashion and beauty. Conceptual eyewear line Gentle Monster launches the series on January 6, followed in February by a shop featuring the obsessively fun world of K-Beauty. March brings forward-thinking Korean fashion brands curated by Olivia Kim, Vice President of Creative Projects at Nordstrom. Gentle Monster, the youthful and cult favorite Korean eyewear company will offer a selection of 40 styles of men's and women's frames reflecting the brand's unique design sensibility with angular and rounded styles fit for high fashion magazines and casual everyday wear. Included in the selection will be six styles exclusively available at Pop-In@Nordstrom. \"Gentle Monster is excited to be a part of Pop-In@Nordstrom,\" said Taye Yun, VP Gentle Monster USA. \"This amazing opportunity allows us to reach out to Nordstrom customers through space and design. Although we have been present in select Nordstrom stores, Pop-In provides us with the platform to creatively connect directly with customers and introduce our brand in a new and exciting way.\" Each Pop-In location was created with a unique look and design, yet with a common thread mixing a variety of fabrics and textures as the structure, like a thick knitted wall or chiffon drapes to suggest an atmosphere of tranquility. Fabric walls are accented with mirrors and objects to create a unique experience for the visitor, following the brand's ethos of using space and design as tools to lead visual conversations with its loyal fan-base. For the launch, Pop-In partnered with the Gentle Monster team to produce unique virtual reality and 360 video content that allows customers to explore the experience in Gentle Monster flagship stores in Shanghai, Nonhyeon-dong and Bukchon stores in Seoul, South Korea, as well as the Downtown Seattle Nordstrom Pop-In shop. Pop-In@Nordstrom x Gentle Monster will be found at Nordstrom.com/POP and in the following Nordstrom locations: Link to Dropbox with all product and editorial imagery - https://www.dropbox.com/sh/rt9k8qunnh6hycp/AAACP3lVLK3bTGscEgxs9CDda?dl=0. About Pop-In@Nordstrom Launched in October 2013, Pop-In@Nordstrom is an ongoing series of themed pop-in shops that transitions every four to six weeks to offer a new shopping experience and batch of new, often exclusive merchandise. Pop-In@Nordstrom was built on a monthly rotation to keep customers coming back to discover new brands, new merchandise and create a fun and compelling experience in stores and online. Each shop features a mix of hand-picked merchandise spanning the high/low price range, with price points often starting at $5. Pop-In@Nordstrom partnerships have included: Alexander Wang, Aesop, Warby Parker, Nike, VANS, Opening Ceremony, Topshop/Topman, Paris retailer Merci, rag & bone, Converse, Liberty London's Flowers of Liberty collection, Los Angeles based Poketo, the U.S. debut of Hong Kong fashion collective I.T., the Italian Trade Commission, and Danish home goods brand HAY. About Gentle Monster Founded in Seoul, Korea in 2011, Gentle Monster is the most rapidly growing eyewear brand in Asia. Now a global business, the brand is distinguished by its superior quality and unrivaled retail experience, aiming to provide a completely original experience with both product and brand. A philosophy stemming from the brand's core focuses: product, space, styling, technology, and culture redesign. Gentle Monster's experimental approach can be well observed through its unique showrooms, and through its unbound horizon of collaborative projects with Opening Ceremony, Tome, and Hood By Air. For more information, please visit www.GentleMonster.com. CONTACT:Anna BrownNordstrom(206) 303-4178 SOURCE Nordstrom Sign up to get PRN’s top stories and curated news delivered to your inbox weekly!  ",
    "datetime": null,
    "url": "https://www.prnewswire.com/news-releases/olivia-kim-launches-korean-themed-pop-in-series-with-gentle-monster-300386976.html"
}