{
    "title": "On Beauty: The Korean skincare routine might be a toner too far for Irish women – The Irish Times",
    "text": "A make-up artist and model at the Korea Beauty and Cosmetic Expo in Goyang, north of Seoul. Photograph: Truth Leem/AFP/Getty Images Korean women are crazy about beauty, skincare and cosmetics. They love cutesy packaging, products packed with snail slime, and skincare ranges that have no comparative products in the West, such as nutrient-packed facial spray Essence. Most of the innovation in cosmetics is happening in South Korea, and western beauty companies are desperate to copy Korea’s best sellers. BB Creams and sheet masks are all directly inspired by what the industry calls “K-Beauty” products. They are also mad about skin regimes that involve 10-17 steps. The Korean philosophy dictates that if you take 30 minutes to put on your make-up, you should devote the same amount of time to taking it off. This week I had a go at this daunting routine, substituting western products. For the first few steps I used Lancôme Bi-Facil eye make-up remover, Super Facialist Cleansing Oil, and Emma Hardie Foaming Cleanser followed by my husband's L'Oréal for Men Scrub (the only one I could find in the bathroom cabinet: I try not to use scrubs any more). The hydrating toner was a bit of a struggle also, as I don't think they are worth the plastic bottles they are poured into, but I had a bottle of Yon-Ka Lotion PS, which did the job nicely. Now came the difficult part: the magical Korean Essence, which we don't have here, although you can bet your Communion money it will be hitting the shelves with a vengeance in the next few years. I substituted a spray-on hyaluronic acid instead. Next I used a hydrating sheet mask from Maskeraide (available in M&S see my Picks of the Week, right). The next step is a category I love with the power of a thousand suns: the serum. Some Koreans use as many as three different serums in one routine, leaving 30 seconds between each one to let the previous serum sink in. At this point I would normally apply a facial oil, but I stuck to the K-Beauty programme and put on an eyecream, a light Nivea moisturiser, and finally a rich night moisturiser. The whole process took about 25 minutes (10 of which were for the mask). In the morning I awoke with skin much softer and more nourished than usual. Koreans will often add facial oils, chemical exfoliants and even more masks, but it will be a while before I can summon up the energy for yet more additions to my nightly routine. If you're keen to try the real products instead of western substitutes it is possible to buy directly from Korean websites, as they have recently begun to ship internationally, and Birchbox-style sample boxes can also be bought: the Memebox with its full-size products is the most popular. I’m not sure this level of maintenance will ever catch on here . Korean women are brought up to look after their skin on a level that most western women will find obsessive and unnecessary. The fact that the make-up wipe is our best-selling skincare product across all categories speaks volumes. Skincare obsessives will love the Korean routine, but for the rest of us it might just prove a toner too far. Twitter @ aismcdermott beauty@irishtimes.com Bourjois Colourband Eyeshadow and Liner Although this is available in several colours, black is the standout. It is ideal for for creating an easy smoky eye, to wear as a base to intensify other shades or to create a grungy look. As it is hard-wearing and long-lasting, invest in a good cleanser to take it off. Giorgio Armani Eye Tint Fluid Eye Colour Film (€32) A fluid eyeshadow in a lipgloss-style tube that dries quickly to a long-lasting satin finish. It is easy to build up the colour depth by layering the liquid and smudging it out to blend. Maskeraide Hydrating Sheet Mask (€7 from Marks & Spencer) If you have been inspired to add the occasional hydrating Korean sheet mask to your routine, then these single-use masks, complete with authentic Korean cutesy packaging, are ideal. Kiehl Clearly Corrective Dark Circle Perfector SPF30 I always test concealers on a little scar on my hand (damn you, grill pan). If they are able to disguise it, then I know they will cover the dark undereye area. This fluid concealer masked the mark completely and protects with a high SPF. YSL Volupté Tint-in-Oil (€27) Five different oils in the blend slowly soak in to even the driest lips to leave behind a wash of colour in a choice of eight shades. If you are a woman who loves make-up, resistance is futile. You have been warned. © 2023 The Irish Times DAC © 2023 The Irish Times DAC ",
    "datetime": null,
    "url": "https://www.irishtimes.com/life-and-style/Fashion/on-beauty-the-korean-skincare-routine-might-be-a-toner-too-far-for-irish-women-1.2089851"
}