{
    "title": "Once a billionaire factory, South Korea's beauty industry turns ugly | The Straits Times",
    "text": "SEOUL (BLOOMBERG) - Three years ago, Suh Kyung-bae was the second-richest person in South Korea. Today he's barely Top 10, a stark reversal in a K-beauty boom known for minting billionaires, not breaking them. Mr Suh's US$3.6 billion fortune (S$4.78 billion) - down from roughly US$8 billion in 2017 - is largely comprised of shares in his family's cosmetics conglomerate, Amorepacific Group, which have fallen more than 40 per cent from a mid-January high. The parent of brands like Innisfree, Laniege and Sulwhasoo, Amorepacific was struggling even before Covid-19, and the pandemic has ushered in a slew of lifestyle changes that have made cosmetics less central to women's daily routines. That's brought a halt to the wealth created by the rapid rise in popularity of Korean beauty products and the deal-making frenzy that followed. From 2010 to 2014, foreign companies spent at least US$215 million to acquire cosmetics firms there, according to a September report by Samjong KPMG. In the five years that followed, the country became the world's fourth-largest exporter of beauty products, and the deal volume ballooned to US$5 billion, not including transactions for undisclosed sums. Estee Lauder made Have & Be Co, widely known for its Dr. Jart+ line, its first acquisition of an Asian beauty brand in November 2019. That deal, worth US$1.1 billion, turned founder ChinWook Lee into a billionaire. Goldman Sachs Group bought a minority stake in GP Club, best known for face masks, making founder Kim Jung-woong one of the country's richest people. Unilever, L'Oreal and other multinational companies also got stakes in South Korean cosmetics firms, creating massive windfalls for their founders. But the pandemic has taken a double hit on K-beauty. Social distancing and remote work have lessened demand for make-up and led to store closures. Beauty retail sales in the US, the No. 3 market for Korean exports, will be down more than 7 per cent in 2020, according to market research firm Mintel. For Korea, coronavirus travel restrictions have also cut off the flow of big-spending Chinese tourists and individual merchants who buy tax-free goods in bulk and sell them back home. Meanwhile, China's customers have more access to global brands and are increasingly interested in products made locally. \"Now it's naive to think that cosmetic products with made-in-Korea tags would simply win over Chinese customers,\" said Lina Oh, a Seoul-based analyst at Ebest Investment & Securities. Neither Have & Be nor GP Club have released financial information for 2020; GP Club's plan for an initial public offering in 2019 hasn't been rescheduled. For Amorepacific, consolidated revenue for the first nine months of the year fell 23 per cent to 3.7 trillion won (S$4.47 billion) from the same period in 2019, according to a company filing. For the first time in its history, the group announced last month a plan to offer voluntary retirement targeting employees who have worked for more than 15 years. The company declined to comment on its plans or on Mr Suh's personal fortune. At the same time, the pandemic has accelerated the shift to online in the beauty industry. Amorepacific's revenue for the segment has seen substantial growth, pushing it to prioritize that part of the business. Cosmetics giant L'Oreal, whose sales dropped 12 per cent in the first half of 2020, launched 300 digital services this year, including live beauty tutorials. Amorepacific plans to reduce the number of Innisfree stores in China but anticipates that overall, digital sales will make up half its business there next year, according to Yuanta Securities Korea. In the domestic market, the company sees the share of online revenue growing to 30 per cent from 20 per cent. \"Spending on cosmetics was already down before Covid,\" said Hye-mi Kim, an analyst at Cape Investment & Securities. \"Covid made it even less necessary. Only must-have items like skincare products or those for facial problems are doing okay.\" Meanwhile, South Korea has new billionaires rising, like Seo Jung-jin, founder of pharmaceutical firm Celltrion, which is developing a Covid-19 antibody treatment. Mr Seo's wealth has almost tripled this year to US$14.6 billion, making him the country's new second-richest man. Join ST's Telegram channel and get the latest breaking news delivered to you. Read 3 articles and stand to win rewards Spin the wheel now MCI (P) 066/10/2023. Published by SPH Media Limited, Co. Regn. No. 202120748H. Copyright © 2023 SPH Media Limited. All rights reserved. ",
    "datetime": "2020-12-28T07:30:22+08:00",
    "url": "https://www.straitstimes.com/business/companies-markets/once-a-billionaire-factory-south-koreas-beauty-industry-turns-ugly"
}