{
    "title": "Our New Korean Beauty Obsession Has Something in Common With Kimchi | Allure",
    "text": "By Maddie Aberman Oil cleansers were my first Korean beauty obsession. Then came sheet masks. (What did my life even look like before sheet-mask selfies?) And I won't be caught without my cushion foundation, which makes on-the-go makeup application insanely easy. So what's the next game-changing Korean beauty import going to be? A likely answer: fermentation. In case you're not up on your chemical processes, fermentation is the breakdown of a substance using bacteria, yeast, or other microorganisms. It's commonly used in Korean cooking to make kimchi. And while we wouldn't recommend rubbing sour cabbage all over your face, fermentation does have a role in the beauty world. Some skin-care products include ingredients that have been fermented. Common in creams or essences, the centuries-old process is said to have anti-aging benefits. \"The idea is that fermentation naturally produces enzymes and amino acids that speed up skin-cell turnover,\" says Ranella Hirsch, a dermatologist based in Boston. Though there hasn't been much research on the subject yet, the thinking is that your skin will more readily accept these naturally derived ingredients. \"It's kind of like Korea's answer to organic skin care,\" says Charlotte Cho, the author of The Little Book of Skin Care: Korean Beauty Secrets for Healthy, Glowing Skin and the founder of sokoglam.com. \"[Fermentation] is cool because there's a cultural aspect,\" says Cho. \"Koreans have been fermenting their food for centuries.\" There are a handful of fermentation-based beauty lines currently available in the U.S. (think La Mer's famous Miracle Broth, which includes fermented sea kelp, or SK-II's main ingredient Pitera, which is made from fermented sake leaves). But while most of the products currently available Stateside contain one or two fermented ingredients, many of the Korean ones use up to 80 different fermented ingredients. Cho, who travels to Korea roughly four times a year to stay updated on the newest innovations, predicts that we'll be seeing a lot more fermented skin-care products soon. Best Beauty Products: Skin By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Nicola Dall'Asen By Sarah Han By Dianna Mazzone By Sarah Han More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2015-07-28T10:00:00.000Z",
    "url": "https://www.allure.com/story/fermented-skin-care-korean-beauty"
}