{
    "title": "Our top five Prime Day picks from cult K-beauty brand, Cosrx | Metro News",
    "text": "NEWS... BUT NOT AS YOU KNOW IT SHOPPING – Contains affiliated content. Products featured in this Metro article are selected by our shopping writers. If you make a purchase using links on this page, Metro.co.uk will earn an affiliate commission. Click here for more information. Skincare obsessives will know all about the cult status of Cosrx. The Korean brand, named to refer to cosmetics and prescriptions, is famous for its pimple patches, as well as its snail mucin products. Fans include skin guru Caroline Hirons and Riverdale actress Madelaine Petsch, and star products regular trend on Instagram and TikTok. For a brand with such a following, you may expect prices to be up there with high-end options. But that’s not the case. Not only is Cosrx on the more affordable end of the scale, you can save even more money by stocking up during the Amazon Prime Day Sale. There are savings of up to 64% to be made on the range, with the prices ofthose cult favourites slashed for a limited time only. To save you the faff of browsing, we’ve rounded up our top five buys that are worth giving a go. You can save 30% on a pack of 36 of these pimple patches today, which are placed onto spots to stop you picking and squeezing them. The hydrocolloid dots work in a similar way to blister plasters, protecting broken skin and speeding up the healing process. Containing tea tree, you’ll notice a difference after the first breakout. Buy for £6.99 (was £9.99) at Amazon. As the name suggests, this product is targeted towards blackheads, using concentrated Betaine Salicylate to reduce the appearance of pores and exfoliate dead skin. After cleansing, swipe this toner water over your skin to prevent blackheads andbanish dullness from your complexion. Just make sure to always wear SPF after using acids. Buy for £9.94 (was £25.99) at Amazon. Another liquid to use after cleansing, this one is great for people who want glowing skin without the effort. Which Wilko stores are reopening as Poundland? Full list revealed Shoppers hail this Amazon wireless bra with 8,800 five-stars 'like second skin' This heated airer is going to transform how you do your laundry this winter (and it’s on sale) Containing just 10 ingredients – including hyaluronic acid, glycolic acid, niacinamide, and apple water – it can reduce the appearance of fine lines, boost hydration, and exfoliate – all in one go. Buy for £9.16 (was £22) at Amazon. Which Wilko stores are reopening as Poundland? Full list revealed Shoppers hail this Amazon wireless bra with 8,800 five-stars 'like second skin' This heated airer is going to transform how you do your laundry this winter (and it’s on sale) For acne-prone skin, this moisturiser is a great all-rounder. Paraben and sulfate free, it contains 70% of natural willow bark water to maintain your skin’s hydration, while not feeling greasy or blocking pores. It’s suitable for all skin types, and has a 5.5 pH level so can work with your other products to keep things balanced. Buy for £17.10 (was £26.99) at Amazon. If you’ve never heard of snail mucin skincare, this probably sounds very odd. However, the gel these animals secrete (which is harvested in a safe and environmentally-friendly way) can do wonders for skin barrier repair. This cream contains 92% snail secretion filtrate, soothing irritated skin and effectively moisturising. It works for all skin types, but can be particularly beneficial for sensitive or damaged skin, as well as those with rosacea. Buy for £21.49 (was £27) at Amazon. Shopping: This article contains affiliate links. We will earn a small commission on purchases made through one of these links but this never influences our experts’ opinions. Products are tested and reviewed independently of commercial initiatives. Do you have a story to share? Get in touch by emailing MetroLifestyleTeam@Metro.co.uk. MORE : Church with plans for a games room and home cinema goes on sale for £205,000 MORE : Disenfranchised grief: Why mourning an estranged relationship is completely valid Sign up to our guide to what’s on in London, trusted reviews, brilliant offers and competitions. London’s best bits in your inbox By ticking this box, you confirm you are over the age of 18*. Privacy Policy »  Get us in your feed ",
    "datetime": "2022-07-13T10:40:08+0000",
    "url": "https://metro.co.uk/2022/07/13/our-top-five-prime-day-picks-from-cult-k-beauty-brand-cosrx-16990889/"
}