{
    "title": "Peach & Lily Launches Korean Skin-Care Brand Ground Plan in the U.S. - Exclusive | Allure",
    "text": "By Kaleigh Fasanella Since Korean beauty began gaining popularity stateside, it's become more difficult to discern the good from the great and the great from the unparalleled. Luckily, there are e-retailers like Peach & Lily to help streamline the product-picking process for us. Speaking of which, today actually marks a very special day for the e-commerce powerhouse, as it had the opportunity to bring Ground Plan — one of the most popular skin-care brands in South Korea — to the United States. \"This is a brand we curated because it was requested so much by our customers, which makes it really unique,\" Peachy & Lily's founder Alicia Yoon told me over the phone. \"It was founded by Kim Yoon-kyung, a highly respected female entrepreneur whose fashion retail business is in the top three in Korea, who then launched Ground Plan because she wanted to be able to use something she trusted when she became pregnant.\" It all started with a mist. Now called the 24HOUR Secret Mist, the facial spray was Yoon-kyung's very first product, which went viral for its ability to help dermatitis in babies (naturally, moms couldn't get enough). Word spread fast, and it sold one million units in just two years after launching. What's more, the hero mist is also hugely popular among those with acne-prone skin, as its comprised of 85 percent witch hazel extract, a known blemish-fighting botanical. Since then, Ground Plan has extended its range to include more skin-loving products, ten of which you can now get your hands on at peachandlily.com. Because Yoon-kyung developed the brand to be safe for babies' sensitive skin, each product is made with only natural, ultra-soothing ingredients such as green tea, oatmeal extract, niacinamide, and snail mucus. Even its Deep Wrinkle Eye Treatment Cream and 1-Week Miracle Ampoule Program — both of which are designed to fight fine lines, wrinkles, and dark spots — are rife with nourishing ingredients like macadamia seed oil, sunflower seed oil, and argan oil, to ensure the skin stays in an optimal state of comfort. What you won't find in Ground Plan's luxurious lineup is anything even remotely harsh or laden with chemicals. There are no abrasive exfoliants or cleansers that leave your skin feeling stripped, and there are no irritants that could cause an adverse reaction (as a reminder, Yoon-kyung wanted to be able to use these products on her own skin and that of her newborn). Already ubiquitously beloved in Korea, the 24HOUR Secret Mist is now available for purchase in the U.S. at $21 a bottle, and we have a feeling it's going to go fast. Needless to say, we highly recommend heading over to Peach & Lily to peep Ground Plan's product selection. More K-beauty goodness you should know about: Now, learn about 100 years of skin-care history: Follow Kaleigh on Instagram and Twitter, or subscribe to Allure's newsletter for daily beauty stories delivered right to your inbox. By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Sarah Han By Sarah Han By Nicola Dall'Asen By Sarah Han More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2018-05-15T14:43:27.766Z",
    "url": "https://www.allure.com/story/ground-plan-peach-and-lily-launch"
}