{
    "title": "Peach & Lily for Target Is the Ultimate Affordable Korean Beauty Collection | Allure",
    "text": "By Sarah Kinonen Obsessed with Korean beauty but can't seem to ever get your hands on the stuff? Well, get your credit cards ready because the wait is over. Peach & Lily for Target is set to hit stores later this month. As a refresher, Peach & Lily is a Korean beauty site founded by Alicia Yoon, and the brand is launching an affordable (and super-convenient) collection with the mass retailer. And if we're not mistaken, this is the first K-Beauty collab available somewhere as ubiquitous as Target. Now, who's excited? (We are, duh.) As avid fans of the (many) ahead-of-the-curve skin-care and makeup innovations Korea has brought us over the past couple of years (think: cushion compacts, face patches, and even cleansing balms, there's no question we're super-stoked to hear the best of K-beauty is heading to mass markets—and to the holy mecca of mainstream, a.k.a. Target, no less. Beginning January 22, a 13-piece curated collection of Peach & Lily K-beauty favorites will officially launch at Target with prices as low as $3.50 for each of the three varieties (Calming, Firming, Lift-Up) of single-use Mizon Face Masks (center) and maxing out at the $38 Mizon Snail Repair Cream, which contains a stomach-turning and impressive 92 percent snail extract. Other highlights we'd suggest peeping out: The set of seven botanical-extract based Ariul Sheet Mask Skin Texture Improvement Facial Mask Treatment for $20 (left, above), the nourishing and antioxidant-rich Lagom Spray Skin Texture Improvement Facial Toner for $21 (right, bottom), and the hydrating ceramide-spiked Caolion Stick Moisturizing Facial Moisturizer for $16 (right, top). More K-beauty news: Peach & Lily for Target comes just a few months after the brand launched a self-branded collection, a trio set of hydrating and paraben-free sheet masks, aptly named the Dream Sheet Mask Collection, which, yes, we're still obsessing over. (Especially in this god-awful weather.) If you're as hyped as we are over the Peach & Lily for Target news, mark your iCals because the collection is set to launch on January 22 on target.com, and we see it selling out fast. Now, find out how to make the world's simplest face mask: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Sarah Han By Sarah Han By Sarah Hoffmann By Sarah Han More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2017-01-09T19:45:23.217Z",
    "url": "https://www.allure.com/story/peach-and-lily-for-target-collab-korean-beauty"
}