{
    "title": "Peach & Lily Skin-Care Products Now Sold at Ulta Stores Nationwide | Allure",
    "text": "By Kaleigh Fasanella Calling all K-beauty connoisseurs: Peach & Lily, one of the major online meccas for all things Korean beauty, has just announced it is expanding its eponymous skin-care collection to all Ulta stores nationwide. Originally, the brand launched the line in just 250 locations, but after a mere six months of mega-success, the retailer requested a chain-wide expansion due to such high demand. This means it will now be even easier for Peach & Lily lovers to access to the brand's beloved products, including its wildly popular Glass Skin Refining Serum, the best-selling Wild Dew Treatment Essence, the KBeauty Rescue Balm, and the Matcha Pudding Antioxidant Cream. \"We are thrilled to have launched Peach & Lily at Ulta Beauty, as they are right on trend with clean, clinical, cruelty-free, and innovative formulas,\" says Ulta's vice president of merchandising for prestige skin care and fragrance, Penny Coy, regarding the news. \"We've seen the brand really resonating with guests and because of this, decided to expand Peach & Lily’s distribution from a select 250 doors to almost our full chain of Ulta Beauty stores within just six months.\" For those who don't know, Ulta has more than 1,100 stores around the world, and now Peach & Lily will be lining the shelves in all of them. Naturally, the brand's founder Alicia Yoon is thrilled. \"Today's customers are not only looking for an Instagrammable 'experience,' but for skin-care products that are safely formulated and deliver big results,\" she says in a press release sent to Allure. \"Through our partnership with Ulta, we can introduce our unique formulas to an even broader audience and make radiant, healthy skin more attainable for all.\" This content can also be viewed on the site it originates from. Peach & Lily also shared the news on its Instagram, writing, \"We're THRILLED to share that the Peach & Lily Collection will now be in every @ultabeauty store!! 🎉Thanks to your tremendous love and support 🙏We're SO excited to make our products all the more easily shoppable for you! 💕 Fans inundated the comment section with messages of excitement and thanks. \"You've made a die-hard fan out of me!!!\" writes one user. \"Ahhh thank you so much, amazing news!\" says another. Now that you can shop the full collection at any Ulta store, what are you waiting for? You and I both know the Glass Skin Refining Serum is calling your name. Now read more about Peach & Lily: Done reading? Now watch 100 years of face masks: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Sarah Han By AnaMaria Glavan By Sarah Han By Sarah Han More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2019-03-29T18:53:51.079Z",
    "url": "https://www.allure.com/story/peach-and-lily-skin-care-products-ulta-stores"
}