{
    "title": "Peach & Lily’s Alicia Yoon Brings K-beauty to Bergdorf Goodman. – WWD",
    "text": "Five South Korean beauty lines will be sold in the flagship and online. subscriber Bergdorf Goodman and Alicia Yoon, founder and chief executive officer of Peach & Lily, unwrapped a shop on the beauty floor Thursday at the retailer’s flagship New York City location. A tightly edited selection of South Korean beauty brands are available in the store and online until the spring. Additionally, Peach & Lily will offer master classes, makeovers, facials and other in-store experiences. Yoon has established herself as a leading authority on the burgeoning K-beauty market, as well as a master at omnichannel retailing. “At Peach & Lily, we seek to understand what draws customers to a specific retailer and within that context deliver a differentiated and customized Korean beauty curation,” Yoon said. “At Bergdorf Goodman, the opportunity was very unique because they have such a discerning clientele that trusts their exceptional curation and customer service.” Related Articles\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tWellness\n\t\n\n\n\n\t\n\t\t\tMeet Claudia Sulewski's Brainchild: Cyklar\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tDesigner and Luxury\n\t\n\n\n\n\t\n\t\t\tGiorgio Armani Celebrates Opening of New In-store Boutique on Bergdorf Goodman's Fourth Floor Angela Welcome, buyer for cosmetics at the luxury retailer, said the shop is a good fit for its beauty experience. “We believe we will exceed our customers’ expectations with this unique selection.” Bergdorf’s clientele, added Yoon, are skin-care savvy and interested in products developed in South Korea. “Those who gravitate toward Korean beauty first tend to be people who are seeking more information about skin care. They are the ones who want to understand formulas, ingredients and a brand’s point of differentiation,” she added, pointing out that’s a fit with Bergdorf’s core consumers. Yoon is getting her hands into the business at Bergdorf. The licensed aesthetician has access to facial treatment rooms and will personally perform (her services will be complimentary) facials, by appointment only. “I truly love giving facials, and I am really excited to demonstrate through facials how to approach skin care the Korean way. It brings a whole new level of interaction with the Korean beauty philosophy — as much as it is about the products, it’s about the technique, the massages and the approach to skin care,” she explained. The shop-in-shop footprint also affords the chance to tell the background of each brand. “To keep the storytelling rich, we wanted to limit the curation to five brands that each offer something different and interprets luxury in its own way,” Yoon said. The five brands she singled out for Bergdorf are Jungsaemmool, Atoclassic, Eco Your Skin, Abib and Femmue. Each brings something different to the mix. Abib, for example, is a unisex line with clean packaging and high-performance formulas. Yoon called Eco Your Skin a leading innovator in Korea. “Like a Willy Wonka factory for skin care, the brand is known for creating never-seen-before textures, superpotent formulations with professional-grade results,” she explained. Jungsaemmool was created by Korea’s top makeup artist Jung Saem Mool. “For the most part, K-beauty has been focused on skin care. We wanted to find the best makeup brand to bring over to the U.S. in a big way,” Yoon said. Prices range from $4 to $175, with the average ticket between $40 and $50.  Yoon describes the space like entering a sophisticated, beauty-forward Seoulite’s powder room rather than a store. “There will be beauty products to shop — and mementos from Seoul to browse through, to really immerse yourself in the K-beauty experience.” For More From WWD: Mass Market Retailers Shift Strategies Makeup Suffers in Mass Market Amid Channel Complexity New Eylure Vlogger Series Hits Shelves at Walgreens for Holiday Sign up for beauty news straight to your inbox every day Top News Stories Alerts Straight to your Inbox. Send us a tip using our anonymous form. WWD and Women's Wear Daily are part of Penske Media Corporation. © 2023 Fairchild Publishing, LLC. All Rights Reserved. ",
    "datetime": "2017-10-27T15:12:24+00:00",
    "url": "https://wwd.com/feature/peach-lily-expands-into-bergdorf-11037636/"
}