{
    "title": "Peach & Lily Launces In-House Skincare Line | Hypebae",
    "text": "Cult K-beauty retailer Peach & Lily has officially launched its in-house skincare line. Since the digital company is known for serving up the most innovative products of-the-moment, it goes without saying that some of the debut products have already sold out. The lineup consists of a Glass Skin Refining Serum, a Pure Beam Luxe Oil, a Matcha Pudding Antioxidant Cream and an Original Glow Mask Set featuring 20 masks. Two of the uber-popular items which have sold out on QVC are the Glass Skin Refining Serum and the Original Glow Sheet Mask. The serum is made up of a mixture of mainly peach extract and peptide complex which both hydrates, calms and brightens the skin, while the mask provides an original glow thanks to built-in antioxidants. To purchase Peach & Lily’s debut skincare line, head over to the brand’s web store. Pricing starts at $39 USD. Additionally, the drop includes a Super Reboot Resurfacing Mask which doesn’t have a release date yet. Stay tuned here as more news emerges on the release of the mask.\nWhile you’re here, check out the 3CE’s new “Take a Layer” collection.\n\n\n                                                                                                    \n\n                                                            Read Full Article While you’re here, check out the 3CE’s new “Take a Layer” collection.\n\n\n                                                                                                    \n\n                                                            Read Full Article    Keep updated on the latest news.  Keep updated on the latest news. We charge advertisers instead of our readers. Support us by whitelisting our site. Whitelist Us Already whitelisted us?\n                        \n                            Refresh page ",
    "datetime": "2018-07-17T13:58:58-04:00",
    "url": "https://hypebae.com/2018/7/peach-and-lily-skincare-line-sheet-mask-cream-serum"
}