{
    "title": "Peach & Lily’s Sample Sale Means K-Beauty Starting at $1 (!) – StyleCaster",
    "text": "By providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Peach & Lily is one of our favorite Korean beauty brands that continues to roll out innovative products we want to try. A new glass skin serum? A moisturizer? Yes, please! But we can’t forget the company also has OG faves, an affordable sister brand (Peach Slices) and even K-beauty best-sellers from other favorite brands. All of these are on major sale during the Peach & Lily’s sample sale. No, these aren’t samples, but that’s what the brand is calling its deals at up to 70 percent off.  While you’re picking up the new Glass Skin Water-Gel Moisturizer ($40 at Peach & Lily) with its long-lasting hydration and vegan prebiotic and probiotic complex, stock up on face masks, serums, moisturizers and more starting at $1. Yes, $1. The Cyber Sale is split into deals priced from $1-$30. Many of these are a full 70 percent off. You’ll be able to try some Peach & Lily and Peach Slice favorites, as well as unique products from brands such as Tosowoong, Saturday Skin and Lagom. Related Stories Here’s How To Watch TNT Live For Free To See Your Fave Sports Games How To Watch NBA Games Live For Free So You Don’t Miss The Basketball Action What are you waiting for? The deals end on December 14. We got you started with a few of our favorites, below. Our mission at STYLECASTER is to bring style to the people, and we only feature products we think you’ll love as much as we do. Please note that if you purchase something by clicking on a link within this story, we may receive a small commission of the sale. Aside from just being cute, this moisturizer uses cherry, peach and camellia extract to hydrate and soothe skin. Willow bark exfoliates, while hinoki cypress soothes, rose hydrates, citrus brightens and cinnamon clarifies skin. Aside from just being cute, this moisturizer uses cherry, peach and camellia extract to hydrate and soothe skin. This hydrating, universal salve is perfect for anywhere on your skin that needs a little extra love. This oil-based cleanser starts off solid and melts into your skin to remove dirt, oil and makeup.  By providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. By providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. ",
    "datetime": "2020-12-11T20:41:38+00:00",
    "url": "https://stylecaster.com/beauty/skin-care/1180986/peach-lily-sample-sale/"
}