{
    "title": "Perfume-Friendly Skin: Fact or Fiction? | Allure",
    "text": "By Alexandra Owens When you work in beauty, you become accustomed to hearing critiques of everything from the gap in a model's teeth to the way a woman walks. But it wasn't until the other day, when I was meeting with a fragrance expert, that I knew one could scrutinize the skin's ability to make a perfume smell good. Say what? Here's what went down: I was testing scents on my skin—all of which smelled perfectly fine to me, if a bit faint—with an individual who shall remain nameless. He informed me that my skin wasn't \"perfume-friendly\" and suggested that my body somehow distorts the way perfumes are supposed to smell. Furthermore, he guessed this about me the moment I walked in the door, when he spotted my fair skin and blue eyes. Normally I would dismiss all this as totally insanity, but I had heard talk before about the effect of things like diet and body temperature on fragrance. So I asked Dawn Goldworm, a perfumer and cofounder of the olfactory branding company 12.29, if an expert can really make such a blanket generalization. Her response: \"There are many factors, such as temperature, skin type, diet, and genetic makeup, that affect how an individual wears perfume,\" she says. \"There are no general rules. Everyone pushes different notes or accords of a perfume differently. As long as you love how it smells, it does not matter if you distort the scent.\" Goldworm did add that there is such a thing as good skin to test perfumes on when developing a fragrance, so the perfumer can assess what a fragrance smells like with the highest degree of accuracy. Clearly, I wasn't meant to be a perfume model! I also checked with my dermatologist, Debra Jaliman, the author of Skin Rules, about the science behind these claims. She confirmed that hormones, medication, and even stress can change the smell of perfume. \"The composition of your skin itself affects the scent,\" she says. \"We all have slightly differing amounts of water, fatty acids, salts, sugars, proteins, and hairs.\" So there you have it. Skin definitely does affect the way a fragrance smells on you, but that can always change. And whether that's good or bad is always up for interpretation. RELATED LINKS: • Insiders' Guide: How to Find a Summer Fragrance • A Quick Fix for Perfume Overload • How to Make Fragrance Last (Without Overdoing It) By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Sarah Hoffmann By Kara Nesvig By Kara Nesvig By Gabi Thorne More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2014-03-05T14:07:00.000Z",
    "url": "https://www.allure.com/story/perfume-friendly-skin-fact-or-fiction"
}