{
    "title": "\r\n\tPond's launches K-beauty inspired milk cream | ABS-CBN News\r\n",
    "text": "Home\n > \nLife Posted at May 08 2019 04:54 PM | Updated as of May 08 2019 05:19 PM Share In its mission to adapt to the latest beauty trends while responding to its market’s growing interest in Korean beauty skincare, Pond’s is launching its all new Instabright Tone Up Milk Cream - a strong addition to its White Beauty Line. More than just a primer \r\nPond’s White Beauty Instabright Tone Up Milk Cream seeks to give its users more than just a makeup base. It promises to instantly and effectively brighten the complexion with one application. It also minimizes the appearance of pores, and reduces dryness and dullness, making it easier to spot-correct the skin. Apart from its brightening effect, the product also packs other skin care benefits such as vitamin B3 which helps improve the skin's elasticity, and UV protection which helps prevent sun damage. Enriched with milk essence, it also helps lighten the skin tone noticeably, and in an instant. Affordable, easy-to-find “holy grail” Pond’s is committed to make its newest product more accessible to the market. The Instabright Tone Up Milk Cream comes in two affordable variants: The 50g glass jar at Php 259, and the 6g sachet at Php 15. Both are available at leading drug stores, beauty counters and online shopping sites. Get more details here. NOTE: BrandNews articles are promotional features from our sponsors and not news articles from our editorial staff. Share Happening this weekend: Whisky Live Manila and more October 26, 2023 Fil-Canadians share ordeal after Northwest Territories wildfires October 26, 2023 Vancouver program offers free legal services, resources to Filipino caregivers October 26, 2023 MPL Season 12: Blacklist ends 6-game drought vs. ECHO October 26, 2023 Google shows off generative AI productivity, cybersecurity tools October 26, 2023 © 2023 ABS-CBN Corporation. All Rights Reserved. AboutCareersPrivacyTermsContact UsAdvertise With Us ",
    "datetime": null,
    "url": "https://news.abs-cbn.com/advertorial/life/05/08/19/ponds-launches-k-beauty-inspired-milk-cream"
}