{
    "title": "Popular K-beauty Brand, Mamonde Arrives in U.S. Exclusively at Ulta Stores",
    "text": "Searching for your content... In-Language News Contact Us 888-776-0942\n\nfrom 8 AM - 10 PM ET News provided by 05 Mar, 2018, 03:53 ET Share this article NEW YORK, March 5, 2018 /PRNewswire/ -- Today, Mamonde, a popular K-beauty brand by global leader AmorePacific is launching in the U.S. at select Ulta doors nationwide, celebrating the brand's successful expansion outside of Asia. Aiming to simplify K-beauty, Mamonde features a full range of nature-inspired, award-winning skincare products that harness the beauty, energy and vitality of the flowers cultivated in the Mamonde Garden just outside of Seoul, South Korea. Mamonde's exclusive partnership with Ulta is one that both brands expect to continue to blossom.  \"We're delighted to be the exclusive U.S. brick and mortar retailer for Mamonde, with many additional items especially developed for Ulta Beauty. Mamonde, true to AmorePacific's deep heritage of innovation and trend leadership, is a fabulous addition to our continuously growing assortment of K-beauty products. Mamonde is botanical, nature-inspired and simplistic, even combining the ritualistic double cleanse routine into a single, rose-scented step,\" said Penny Coy, Ulta Vice President Merchandising, Prestige Skincare and Fragrance. With this brick and mortar launch comes great opportunity. \"We are thrilled to have Ulta as the exclusive retail partner for Mamonde. This brand is very special so it was important to find the right partner to help support its beautiful story,\" said Jessica Hanson, President and General Manager AmorePacific U.S. \"We are excited to be able to offer consumers a range of simplified K-beauty products that deliver beautiful skin benefits,\" she added. The NEW Mamonde K-beauty skincare collection ranges in price from $7.00 - $38.00 and is available in select Ulta stores nationwide beginning today, March 5. The complete collection is also available on Ulta.com. For additional information please visit: us.mamonde.com and @mamonde_us on Instagram About Mamonde: Owned and operated by AmorePacific, Mamonde has been dedicated to the research and development of beauty innovations through the cultivation of flowers found in the Mamonde Garden since 1990. Through advanced flower science research and technology, Mamonde, which means \"my world\" in French employs sustainable practices and expertly-trained scientists to continue to unveil skincare formulas that deliver the natural energy and essences of flowers. About AmorePacific: Since 1945, AmorePacific has had a single, clear mission: to present its unique perception of beauty– namely what it calls 'Asian Beauty' – to the world. As Korea's leading beauty company, AmorePacific draws from its deep understanding of both nature and human to pursue harmony between inner and outer beauty. With its portfolio of over 20 cosmetics, personal care, and health care brands, AmorePacific is devoted to meeting the various lifestyles and needs of global consumers around the world: Asia, North America, and Europe. AmorePacific's research hubs located around the world are dedicated to sustainable R&D that combine the best of natural Asian ingredients and advanced bio-technology. With its world-class products, AmorePacific is acclaimed for the innovative ways in which it is transforming global beauty trends. SOURCE Mamonde http://us.mamonde.com Sign up to get PRN’s top stories and curated news delivered to your inbox weekly!  ",
    "datetime": null,
    "url": "https://www.prnewswire.com/news-releases/popular-k-beauty-brand-mamonde-arrives-in-us-exclusively-at-ulta-stores-300608380.html"
}