{
    "title": "Post-pandemic Lipstick Effect in a Post-mask Germany - Euromonitor.com",
    "text": "Our premier, award-winning syndicated market research database provides detailed data and analysis on industries, economies, countries and consumers across 781 cities, 210 countries.​ Via helps you navigate a fast-changing digital marketplace. We extract and organise ecommerce data from over 1,500 online retailers in 40 countries providing daily updates on pricing, assortment size and key attributes. Our consulting team answers your commercial questions with data and insights generated by our research experts, industry knowledge and 1,200 on-the-ground analysts in 100 developed, emerging and frontier markets. Curious about how we partner with you to help you solve your complex modern-day business problem? Access and download reports and data purchased through Euromonitor.com. Your cart is empty. Mask wearing in Germany – or the country’s famously strict Maskenpflicht – has recently ended. Germans are no longer required by law to wear protective face masks in shops or restaurants. Consumers are able to shop and dine mask-less for the first time in over two years. Lipstick sales, and by extension facial make-up, are expected to surge in its wake. Post-pandemic lipstick effect to play out Manufacturers of lip products are hoping to recover to pre-pandemic levels, when 2019 value sales of lip products had reached EUR264 million (retail RSP, current). The greatest opportunities, however, will be brands offering \"accessible luxury’’, or a heightened preference for affordable premium goods. Consumers on the one hand, are more image conscious now that masks are no longer required, searching for premium and luxury offerings to “go big” after two years of covering up. On the other hand, the current economic climate means that consumers are also trying to be careful with their spending. The moment seems particularly timely for K-Beauty products in Germany. K-Beauty is an emerging, globally-recognised beauty trend from South Korea that leverages functional cosmetics with specific claims such as anti-wrinkle, brightening, and UV protection, supported by significant scientific research on ingredients. K-Beauty products are characterised by higher prices but still affordable to mid-income consumers, with whimsical packaging and innovative formulations. Another reason why K-Beauty colour cosmetics brands have the potential to be successful in Germany is the fact that this type of make-up aesthetic is subtle, with a focus on skin care; this is an aesthetic that German consumers are interested in. Although K-Beauty products have been emerging online and in stores for several years in Germany, the biggest shift now is that an increasing number of international and local brands are trying to capitalise on the trend with a similar positioning to capture more of the post-mask opportunity along the way.Masks off, lipstick onIn the wake of “lockdown fatigue”, local consumers are expected to seize the opportunity to use lipstick as a statement to highlight their individuality. Therefore, in the coming years, lip products is expected to register the strongest performance within overall colour cosmetics given the potential of the “lipstick effect” explaining consumer tendency to spend more on less costly luxury goods. Further innovations are expected to tap into this demand, in terms of format, functionality and care aspects cutting across various consumer segments. This trend is not only likely to lead to greater experimentation with lipstick in terms of making a statement by millennials and Generation Z, but also by older generations, pushed by brands as they try to gain the interest of more ‘’mature’’ consumers by updating 1990s trends with more sophisticated formulations and finishes. The launch of a lip product, Super Stay Vinyl Ink by Maybelline, is a perfect example of a lipstick/lip gloss with a modern spin. Maybelline’s new product with a vegan and long-lasting formula, which claims to prevent smudging and fading, in addition to offering a glossy finish available in 10 high-impact vinyl shades from poppy brights throughout saturated red tones to everyday neutrals, appears to be a good example of the 1990s beauty trend making a major comeback. In other Western European countries such as the UK, Denmark or the Netherlands, where mask restrictions have been lifted earlier than in Germany, the beauty industry is already showing early signs of a booming return for lip products. According to Euromonitor International’s latest research results, lip products in Western Europe is expected to record a 5% value CAGR (at constant 2021 prices) over the forecast period. There are several ‘’early contributors’’ such as the UK, Denmark or the Netherlands, which in 2021 recorded positive value growth, especially for lip products. According to Euromonitor International’s Beauty Survey published in 2021, respondents in the UK, Italy and Germany have shown significantly higher interest in purchasing lip gloss. In the case of Germany, the number of respondents who purchased lip gloss to complement their beauty routines increased by 21 percentage points.  Source: Euromonitor International’s Beauty Survey, October 2021 K-Beauty in the spotlight, and German companies are following suit After “masking up” for over two years, consumers are eager for new forms of expression while still coming across as natural as possible. Attributes such as the “gradient-over-lip” effect, velvety finishes, light application and “my lips but better” shades help support this look. These are the qualities that K-Beauty brands offer and have been slowly appearing in Germany for several years, although chiefly online. K-Beauty lip products are also priced accordingly to cater to upper-mid-income consumers searching for affordable luxury. According to Via, Euromonitor International’s e-commerce monitoring tool, popular K-Beauty lip product brands such as TonyMoly, It’s Skin, Dear Dahlia or Whamisa have not experienced significant price fluctuations from the period of January 2022 up until May 2022, which, in a time of rising inflation, ensures that they continue to offer ‘’affordable luxury’’. At the same time, the number of SKUs of these brands in Germany has increased significantly over the past two years. However, some have a mass positioning in South Korea, while they are considered masstige and mid-high tier in Germany. German brands are following the example of successful K-Beauty options. For instance, Henkel’s make-up line launch Got2be offers a wide portfolio of lip products that fit the entire concept of K-Beauty and multifunctionality (lip tints with intensive colours that serve as 3-in-1 products). Other local players tapping into the K-Beauty space include Cosnova, with the company recently launching new products under its Catrice and essence lines. The company advertises its products as plumping, providing glossy and shimmery finish and including extra care formulas that respond to the pH of the lips. Similarly, Laverana launched tinted lip balms, which tap into the skin care/health and beauty space (‘’juicy’’ products with fruity colours). German retailer dm with its Trend it up private label line is also targeting the recent most-wanted lip product features such as addition of moisturising oils and ingredients boosting the “push-up” effect.  Source: dm.de (accessed 9 May 2022) Future prospects for lip products These new brand launches are notable examples of capitalising on the opportunity offered by lip products over the coming years, with lip products expected to register a 5% value CAGR (at constant 2021 prices) to reach EUR226.1 million in 2026. It is not only the right timing, given the lifting of mask-wearing requirements, but also the innovations that offer opportunities for brands that follow the example of K-Beauty brands. As also noted in skin care, colour cosmetics brands have huge potential to create a new path for the category, closely following K-Beauty for inspiration and ideas on how to introduce new innovative products in their local markets to ‘’awaken’’ and revamp mature, sleepy and post-pandemic colour cosmetics in Germany. Beyond K-BeautyOther than K-Beauty, there are other international beauty concepts that are likely to gain traction over the forecast period. There is potential for Chinese beauty, of which cultural heritage and TCM (traditional Chinese medicine) have wide appeal to consumers of all ages. C-Beauty also focuses on modernised routines and on the blurring of skin care and cosmetics, which, with the growth of Chinese beauty influencers embracing Chinese brands on social media platforms, create considerable potential for these products in Germany. In the past, some Germans had a negative perception of “Made in China”, but for younger generations – who have witnessed the rise of China as a global economic powerhouse, boosting their quality of life and wealth – the updated term “Created in China” is a source of success and innovations, which is why C-Beauty, which marries the best of East and West and has a similar aesthetic as K-Beauty, is now riding the wave of popularity, and is likely to be a beauty direction that will have an impact on colour cosmetics in Germany. For further insight, read our report, World Market for Beauty and Personal Care. Older adults are a key consumer group, as companies explore opportunities in the context of an ageing population across Asia Pacific markets. This report… In 2023, the global marketplace for consumer health continued to be impacted by inflation and vacillating consumer demand, which limited innovation and… Beauty and personal care players face a challenging environment of tighter consumer spending. Volume declines and softness were a recurring theme as companies… ",
    "datetime": "2022-06-01T08:00:40.0000000+00:00",
    "url": "https://www.euromonitor.com/article/post-pandemic-lipstick-effect-in-a-post-mask-germany"
}