{
    "title": "Pressed Serum | Allure",
    "text": "By Renee Jacques If you're like me, you hold off on your nighttime skin-care routine until the absolute last few minutes before you're about to pass out. That also means you end up cutting corners and skipping certain steps (shh, don't tell my fellow Allure editors!). But I've recently discovered a glorious, magical serum/face-cream hybrid that's changed everything. Allow me to introduce you to the wonder that is pressed serum. When Christine Chang, a cofounder of the K-beauty site Glow Recipe, first told me about Blithe Tundra Chaga Pressed Serum, which is described as \"a serum and moisturizer combined,\" I was intrigued. This had the potential to be my dream product: Instead of having to pump out serum and delicately smooth it over my face and then follow that up with a separate moisturizer (life is so haaaard!), I could combine the two into one quick step. The texture of a pressed serum takes some getting used to: It has a spongy, jelly texture, but as you massage it into skin, it becomes thinner and more liquid-y, absorbing almost instantly. So it starts out looking a little like a cream, feels a little like Jell-O, and morphs into a featherlight serum-like state as you massage it in. It's a bit weird at first, but once you're used to it, there's something kind of mesmerizingly fun about it. Here's a close-up of what the consistency looks like (just try to ignore the not-so-pretty brownish color): It makes skin feel plump and hydrated, but not at all greasy. You'll notice that your face seems to be a little dewy and supple, but there's no noticeable film or slimy sheen left behind. Some nights, if I'm feeling particularly not-lazy, I'll smear an overnight moisturizing mask over it, but that's only if my skin is feeling especially dry and seems to be in need of heavy-duty moisture. After about three weeks of using the pressed serum, my skin looks and feels really good. How did Blithe manage to create such a unique product? Chang says it has to do with the way they mix the ingredients. \"They use a special method of 'slow cooling ' over a 36-hour period, versus processing ingredients with heat, so that efficacy is preserved and the unique texture is created,\" she says. \"They also use a blend of fermented natural oils. Fermentation helps to micronize ingredients and improve absorption—this is why the formula absorbs easily into the skin while leaving it hydrated.\" Oh, and about those ingredients. It's the unusual formula that makes the consistency so custard-like, says cosmetic chemist Randy Schueller. \"My guess is the polyurethane is the ingredient responsible for the jelly-like texture,\" he says. \"The glycerin, diglycerin, and 1,2-hexanediol will give it a serum-y consistency, and it doesn't contain any of the standard lotion ingredients like cetyl or stearyl alcohol.\" Blithe Pressed Serum is a part of the group of Korean products called multitaskers or supertaskers, essentially two or more products merged into one to save time and money. \"Despite the mistaken perception of a complicated 10-, 15- or even 20-step K-beauty skin-care routine, it's actually very fluid, and the demand for products that simply do more is on the rise,\" says Chang. Blithe isn't the first company to think of having a serum/cream hybrid that pulls double duty. Japanese brand Tatcha is also releasing a similar product, called Overnight Memory Serum Concentrate, in January. It's a slightly thinner, even more jelly-like formula, but it's equally lightweight and hydrating. I'll be keeping an eye out for more of these awesome multitaskers soon, but in the meantime, you can find me marveling at these addictively fun pressed serums. The best skin-care products of this year: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Sarah Han By Angela Trakoshis By Kara McGrath By Dianna Mazzone More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2015-12-16T13:00:00.000Z",
    "url": "https://www.allure.com/story/pressed-serum-korean-skin-care"
}