{
    "title": "Puppy Eyeliner Is the New Must-Try K-Beauty Trend - theFashionSpot",
    "text": "By\n\nCordelia Tai  When disc jockey extraordinaire Diplo transformed himself into the “vomiting rainbow” Snapchat filter this past Halloween, it got us thinking. If only there was a way to bring our favorite hilarious and inexplicably mesmerizing Snapchat personas to life. Well, for those of you obsessed with the “licking dog” lens, we’ve got good news. A new beauty trend just in from Korea — where seemingly all great skin and makeup tricks are born — takes its inspiration from (wo)man’s best friend. A photo posted by Kristinova (@katyaisabell) on Apr 16, 2016 at 6:39am PDT  “Puppy eye” creates the illusion of a rounder, larger eye, giving wearers an innocent, Bambi-esque gaze. The playful K-beauty liner technique is a welcome answer to the omni-present sultry cat eye and, thankfully, much easier to master. (To be frank, infuriatingly uneven wings were half the reason we hopped on the natural makeup bandwagon.)  “All you need to do is draw a line along the upper lash line and right when you’re about to the mid-point of the eye, instead of swooping it up like you do with the cat eye, you actually drop it down and follow the natural curve of the eye,” explained Charlotte Cho, founder of Soko Glam, during an appearance on Amazon’s Style Code Live. “Then you do the lower lash, and you line along that lower lash line and connect it to the top line and it almost forms a tiny triangle, right in the corner of the eye, which creates a very puppy[-like] look.” As with any makeup trick, you can be as bold or as subtle as you like with the look — check out the hashtag #puppyeyemakeup on Instagram for a handful of variations on the theme. A photo posted by CeeCee Rolle (@ceewor1d) on Feb 6, 2016 at 12:51pm PST  True, the cat eye has been around since Cleopatra’s day and will always be a staple of our makeup routines, but when we’re struggling to keep awake at Friday happy hour, liner that opens up the windows to our soul is very necessary. Plus, when you’re asking your boss for that raise at work, it couldn’t hurt to resemble a corgi who’s just gotten a whiff of bacon, now could it? [ via Marie Claire ] Cordelia Tai is a freelance staff writer at theFashionSpot. Her work has appeared on Refinery29 and the Huffington Post, among others. Ultimately, she plans to segue into fashion merchandising so that she can (judiciously) online shop for a living. Share article ",
    "datetime": "2016-04-19T15:31:55+00:00",
    "url": "https://www.thefashionspot.com/buzz-news/latest-news/690269-puppy-eyeliner-beauty-trend/"
}