{
    "title": "Putting Intel Inside Your 401(k)",
    "text": "This story appears in the December 15, 2013 issue of Forbes. Subscribe If there is a gigantic socioeconomic problem facing this nation that should be weighing heavily on policymakers, it's the retirement income crisis. Fact: There are 80 million baby boomers, and every single day for the next 17 years roughly 10,000 will turn 65. Fact: According to the Federal Reserve's most recent Survey of Consumer Finances, only 52% of Americans have saved anything for retirement, and for those aged 55 to 64 who have retirement accounts the median balance was $100,000. Factor in life expectancy already averaging 85 or so, plus a near-zero interest rate Fed policy, and you get a bleak future for masses of old folks. Think trailer park living and early bird specials at best; working until their dying days at worst. Enter Dimensional Fund Advisors, the Ivory tower mutual fund manager with $315 billion under management whose efficient-market-minded funds are sold either directly to large institutions or by hand-vetted financial advisors. \"Once you're lucky enough to be a firm of our size, you kind of start to think about what it is that you really want to do,\" says DFA's billionaire founder and chairman, David Booth, 66, sitting in his architecturally striking Austin office building with sweeping views of downtown. \"Helping people solve this problem is just about as cool as it gets. And we're in a position with these great financial thinkers that we'd like to take a crack at that. That's kind of going to be the focus of the firm, going forward.\" Booth's nonchalant musings about his firm's new \"cool\" mission understate how critical his new marching orders are. Among large fund companies, DFA, with a paltry $25 billion in retirement assets, has largely missed out on the explosive growth of mutual funds into the retirement market. As of 2010 the overall retirement market in the U.S. stood at about $18 trillion, up from $4 trillion in 1990. These days one of the fastest-growing parts of the retirement market is the $5 trillion in defined contribution plans, known mostly as 401(k)s. For traditional mutual funds, like the ones DFA manages, the market is probably the best growth engine left. DFA's retirement business is dwarfed by giants like Fidelity, Vanguard and Capital Research & Management Co. So DFA needs to grow in defined contributions, but it also needs to be careful not to go too mass market like Fidelity and Vanguard. DFA's highly successful operating model has long centered on maintaining low costs and the cultlike loyalty of some 1,800 independent financial advisors, who account for 60% of its assets. The genius of Booth's new retirement-market strategy comes from MIT economist Robert C. Merton, once described by his teacher, the famed economist Paul Samuelson, as \"the Newton of modern finance.\" Merton's eponymous Black-Scholes-Merton options-pricing model won him and Myron Scholes the Nobel Prize in 1997 (Fischer Black died in 1995). Merton was on DFA's fund board from 2003 to 2009 and now also holds the title of \"resident scientist.\" DFA's brain trust has always run deep. There are two other Nobel laureates on its boards: Scholes and Eugene Fama. It was Fama's work (and that of Kenneth French, also on DFA's board) on the efficient market theory that inspired his onetime University of Chicago graduate students David Booth and Rex Sinquefield to come up with DFA's fund strategy and the firm's philosophy. DFA funds are built around the idea that you can't outguess the market, but you can outtrade other participants. Scholarly research and Nobel credentials have become the biggest part of DFA's marketing shtick, but smart execution is its real core competency. \"Trading is the cornerstone of what we do,\" says Booth. Over the years Fama's and others' professorial theories have worked their way into DFA's \"passive\" approach to include three factors that improve returns over time: buying small-cap stocks, buying low price-to-book stocks and buying those with higher operating profits. But with mutual fund growth slowing, DFA went back to the academic drawing board in 2010 to buy a software platform that Merton and Boston University professor Zvi Bodie created in 2006 for a company in the Netherlands. Merton's SmartNest software is based on what is known in academic and financial planning circles as adhering to Life Cycle Finance Theory, in that its goal is not returns or growth of assets to some optimal \"value\" (think ING's \"Your Number\" ad campaign) or target date but rather meeting the liability of lifetime income. All outcomes communicated to plan participants are expressed according to what income they will be able to achieve after retirement over the course of their lives. In some ways its a back-to-the-future movement, explains Michael Lane, chief executive of Dimensional's SmartNest: \"SmartNest wanted to create a DC [defined contribution] plan that looked like a DB [defined benefit] plan in terms of reporting, where you'd see everything in income terms. Because it doesn't matter what it is in principal value. What matters is what's it going to give you every month.\" Merton's new software addresses a stark reality in the defined contribution business. Despite earnest efforts to educate 401(k) holders, the vast majority are clueless about how they need to structure their accounts now and over the course of their careers to ensure a reasonable income flow after retirement. The majority of 401(k)s today focus on asset accumulation and only gloss over income-planning postretirement. Here's how Merton describes the current defined contribution environment for the average worker: \"It is like being a surgical patient who, while being wheeled into the operating room, has the surgeon lean down and say, 'I can use anywhere from 7 to 17 sutures to close you up. Tell me what number you think is best.'\" Merton's SmartNest, now the engine for Dimensional's product called \"Managed DC,\" offers a simple Web interface that shows retirement plan participants four simple customizable variables: a desired income target, which might default to 50% of one's preretirement income and the probability of achieving it; a conservative income target, which by default has a 96% probability of success; pretax contributions; and retirement age. Those are the only variables people ever need to worry about. Since the system is integrated into employer plans, it already knows things like your current income and your expected Social Security benefits, and, if applicable, you can plug in expected income from a defined benefit pension plan. Sliders are provided that let you perform what-if scenarios. If you want to change your desired income from $5,000 per month to $6,000, the probability of you achieving that might drop from 75% to 35%. The only way to get back up to 75% would be to move the slider for pretax contributions from 4% up to 8% or slide your retirement age from, say, 65 to 70. For DFA the beauty lies under the hood because it would all be connected to three DFA portfolios: a global stock index and two inflation-protected bond portfolios of different durations, each charging 30 basis points in expenses. DFA adjusts your mix to match the duration of your income liability. No more choosing funds or reading prospectuses. Simply move your slider, hit \"confirm\" and let Dimensional handle it.  SmartNest gets around two big problems prevalent in the 401(k) business today. One is inertia, removing the large gap between getting sound advice and actually acting upon it, and the second involves the one-size-fits-all approach of target-date funds, which essentially assumes that everyone hitting retirement age in, say, 2025 is in the same financial bucket. According to DFA, engagement of SmartNest in the Netherlands by participants was as high as 50%, and, of those, 50% wound up saving more. Of course, the holy grail for DFA would be getting plan sponsors to assign SmartNest as a \"qualified default investment alternative\" for automatic enrollment, much the way they did target-date funds starting in 2006. According to a government study published in 2007, automatic enrollment will account for up to $134 billion in additional retirement savings by 2034. But before DFA can even contemplate this, it needs to get more plan providers to actually integrate and offer its service. One of its early adopters, Tampa's open-architecture Aspire, signed up a year ago but has had limited success. Dimensional also has agreements with SunGard and DST, but gaining traction in the byzantine and slow-moving world of defined contribution plan recordkeeping won't be easy. Already several sophisticated software-based retirement products, including Nobel laureate William Sharpe's Financial Engines, have a big head start. Listen to Heather Hooper, vice president of retirement strategies for Loring Ward, a $10 billion asset manager that serves more than 1,000 advisors, all using Dimensional funds: \"Most advisors place their own value in choosing and managing investments. Dimensional's Managed DC product is brilliant, but it takes them out of that client conversation.\" Hooper has been a fan of SmartNest for years, but Loring Ward has yet to offer it. \"I don't want to be the guinea pig,\" she says. DFA's Lane swears that SmartNest has no intention of undercutting the company's financial advisor base. \"SmartNest is Intel. You can read all sorts of interesting things about what Intel is doing, faster processors, but no one ever calls Intel or meets anyone from Intel. You're always calling someone at Dell or Apple,\" says Lane. \"In our case you will deal directly with the person who provides it, a financial advisor or a consultant or a plan sponsor.\" In order to make meaningful strides into the retirement market DFA needs to attract big retirement plans. Institutions of higher education would be a natural fit, and, according to industry insiders, DFA is currently working with TIAA-CREF to bring its SmartNest to the retirement plan of small liberal arts college Lewis & Clark in Portland, Ore. It's also working with Transamerica to sign on a small New Jersey hospital. Ultimately, Dimensional may even have to consider national advertising to spur demand for its Nobel laureate-endorsed approach to retirement much the way market giants like Fidelity and Prudential do. Given its reliance on low costs and loyal financial advisors, this could throw a wrench in the highly successful mutual fund model Booth and Sinquefield built.  ",
    "datetime": null,
    "url": "https://www.forbes.com/sites/schifrin/2013/11/27/putting-intel-inside-your-401k/"
}