{
    "title": "Q&A: f(x) Reacts to Topping K-Pop Hot 100 & World Albums Chart (Exclusive) – Billboard",
    "text": "Backstage at KCON 2013, the K-pop group talks their big year and details filming a Funny or Die skit with Anna Kendrick. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin Girl groups were in short supply at KCON 2013. Though, given f(x)’s whirlwind 2013, they likely would have more than sufficed even without a last-minute addition of Crayon Pop at the American K-pop convention. Despite being away from the K-pop scene for over a year, the female quintet saw their domestic and international popularity maintained with new single “Rum Pum Pum Pum” hitting No. 1 on the K-Pop Hot 100. Meanwhile, its accompanying full-length album, “Pink Tape,” not only topped Billboard’s World Album chart, but also placed on Billboard’s Heatseekers Albums chart — meaning a Billboard 200 entry wasn’t too far away. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t09/11/2013\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tExplore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news  Falling in line with past singles such as “Pinocchio (Danger)” and “NU ABO,” the 12 tracks on “Pink Tape” also mix fizzy electro-pop, icy harmonies and strange, yet addictive, hooks. One could argue the quirky confections on the LP represent the contrasting personalities of the five f(x) members — on display as the quintet sit down for an interview with Billboard hours before opening KCON’s grand finale K-pop concert. Cool and calm, members Sulli and San Francisco-bred Krystal appear guarded at first. However, undeniable f(x) sweetheart Luna wears a huge smile on her face the entire chat and during the KCON concert — at one point appearing to stray from her group’s choreography to wave to fans on the other side of the stage. 26-year-old leader Victoria is nice, but nervous; likely anxious to present her band in the best light possible. Meanwhile, Los Angeles native Amber enters the room like a sledgehammer of confident energy, perhaps from being most comfortable speaking in English and having sister Jackie backstage. But minutes into talking with f(x), the girls’ personalities blend into one with a collective concern for fans and a genuine excitement seeing their hard work result in success — even reserved Krystal breaks character for a second, loudly exclaiming “Really?!” after a mention that f(x) topped World Albums. Billboard gets f(x)’s reactions on the year so far. KCON 2013: 15 Things Seen & Heard  Welcome to Los Angeles, f(x). You’re here today to perform at KCON 2013, but you made your K-pop debut in 2009. How did you decide what three songs to perform today?  Krystal: We’re performing our new song “Rum Pum Pum Pum,” “Electric Shock” and “Hot Summer.” The reason why we’re performing them is that “Rum Pum Pum Pum” is our new song; it’s our first time performing it in the States. “Electric Shock” is really noisy. And we’re performing “Hot Summer” because it’s so hot outside.  “Rum Pum Pum Pum” has a lot of layers and harmonies. Are you at all nervous about performing it live tonight? Sulli: The song is difficult to sing live, but our main concern is that we just want our fans to enjoy our performances. NEXT: “We were like, ‘Dude! It’s been a year. How are we going to do?!'”  Another note about “Rum Pum Pum Pum” — it went No. 1 on the Billboard Korea K-Pop Hot 100, making it your first chart-topper. How did that feel? Luna: We were really nervous about releasing this song, we are always nervous before a comeback. So it’s really awesome that it is doing so well. Amber: It’s been a more than a year since we promoted. It was really reassuring to know our fans were still there and supporting us all the way. Honestly, we were really scared before we came back. We were like, “Dude! It’s been a year. How are we going to do?!” “Rum Pum Pum Pum” is lifted from the “Pink Tape” album, which gave you another No. 1, this time on Billboard’s World Albums chart. How does it feel to see your international popularity exemplified like that? Luna: First of all, we are really happy and when we first heard the news… we were really surprised. The fact that we are receiving so much love and attention from fans from all over the world is an amazing feeling.  Amber: Speaking for K-pop, it shows how global a group can be. It’s crazy. I was actually freaked out when I saw that. I’m glad the fans still love it and we want to do everything we can.  You’ve had such a warm welcome back, even though you’ve been gone from the scene for over a year. What were you up to that whole time? Victoria: We focused on our individual activities, including acting and other solo projects. But you did come together to perform at SXSW, not to mention collaborate on a Funny or Die skit with Anna Kendrick. What was that experience like? Victoria: It was fun! To be able to collaborate with a star like Anna Kendrick was an honor. We were able to balance out recording in English because we have English-speaking members. Do you anything you’d like to add for your fans? Luna: We want to show as much as we can to our global fans and visit many countries as much as we can.  Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2013-09-12T00:11:19+00:00",
    "url": "https://www.billboard.com/music/music-news/qa-fx-reacts-to-topping-k-pop-hot-100-world-albums-chart-exclusive-5687354/"
}