{
    "title": "Queen Of K-Beauty: The Founder Of Soko Glam Launched Her Own Skincare Brand",
    "text": " Charlotte Cho, Cofounder and Chief Curator of Soko Glam and founder of Then I Met You, Photo Credit:... [+] Meredith Jenks, Red Antler  To beauty insiders, Charlotte Cho is an icon. And now thanks to the launch of her own skincare brand, Then I Met You, Cho's business savvy is also getting its much-deserved time in the spotlight. Named among WWD’s \"40 Under 40\" in 2017, Cho pivoted from public relations to beauty, when along with her husband she launched the e-commerce site Soko Glam, dedicated to all things Korean beauty. A firm believer in the power of rich content, Cho launched The Klog (an editorial sister site to Soko Glam), and published her debut book, The Little Book of Skin Care: Korean Beauty Secrets for Healthy, Glowing Skin. The next natural step for Cho? Creating her own line of skincare, which she launched in mid-October of this year. Named Then I Met You, the premium skincare brand consists of a two-step cleansing process, which includes the Living Cleansing Balm and Soothing Tea Cleansing Gel. As opposed to using terms like \"quick and easy” as a selling point, Then I Met You’s ethos is all about the importance of taking one's time, enjoying every minute of one's skincare ritual, and “glowing deeper.” The double cleanse process is inspired by the Korean concept of jeong, which Cho defines as \"deep, emotional connections with people, places and things.\" (Cho's second book will dive deeper into the concept of jeong and is set for a 2019 release.) When it come to Then I Met You, the devil — or better yet, the beauty — is in the details. Cho was deliberate and intentional about every decision when it came to the development and production of Then I Met You, from the bright yellow shade of the cleansing balm and periwinkle blue tone of the packaging, to the scent and ingredients of the products. I spoke with Cho about her evolution from e-commerce and curation to skincare brand creator, why she's pushing #SelflessSundays as a movement instead of #SelfCareSundays, and why she's all about \"glowing deeper\" in everything you do. Karin Eldor: Congrats on the launch of Then I Met You! What inspired the idea to develop your own brand of skincare? Charlotte Cho: Thank you so much! In 2013, when Soko Glam was only a year old, everyone was asking me when I would develop my own products. I could have easily white labeled products and called it \"Soko Glam,\" but I wanted to take my time to do it right. In all, it took about a decade of testing, discovering new skincare innovations, getting my aesthetician license, and speaking to the Soko Glam community to understand how and what I would create. I created Then I Met You because I reached a turning point in my life where I wanted to challenge myself to create beautiful formulations, with premium ingredients that would enhance my skincare routine. Another goal I had was ensuring that this luxurious experience would be available to the community, at an accessible price point. Eldor: I love that you are intentional about everything you’ve done with Then I Met You and focused on creating less items but making them unique. Why was this important to you? Cho: Intentionality is a major part of my philosophy with Then I Met You, because  I believe you can create something meaningful and substantial if you take the time to go deeper. One example of this is when I was making the Living Cleansing Balm: the cosmetic scientist I worked closely with cautioned me to use less of the sea buckthorn oils in the balm, because at the current formulation, the product would have to retail at around $150. But I persisted and made sure I created a cleansing balm that was to my highest standard, and gave me the experience and results I wanted. He didn’t know that we always intended to go direct to our consumers and cut out the middlemen (retailers), and that I would be able to price it so that my community could get access to premium quality without an exorbitant luxury price tag.  Then I Met You, Living Cleansing Balm and Soothing Tea Cleansing Gel, Photo Credit: Red Antler  Eldor: How did you infuse the Korean concept of jeong into Then I Met You? Cho: We are living in an age of superficiality and distractions, and I truly believe we need to work towards creating deeper connections with one another. We infused jeong into Then I Met You, starting with our decision to sell direct-to-consumer so that we could focus on having an intimate relationship with our customers, all the way down to the pre-stamped postcards we include in every order as an encouragement to write a meaningful message to someone that matters in their life. On social, we have #SelflessSundays (instead of #SelfCareSundays), where we encourage people to post about what they’ve done to cultivate deeper relationships that day. Eldor: You’ve built a highly engaged community with Soko Glam. Tell us what you were doing before you launched Soko Glam, and what led to its launch? Cho: After moving to Seoul, Korea to work at Samsung, I discovered the world of Korean beauty and skincare. After using the products and applying the Korean “skin-first” philosophy, I saw my skin as well as my confidence transform, so it became my passion to share the products and techniques in the U.S., where I knew these were not easily accessible. My husband Dave Cho and I decided to start Soko Glam in 2012, despite the fact that there were many factors going against us. For starters, we had zero experience in e-commerce and beauty! Many doubted that we could get people in the U.S. to care about unfamiliar Korean beauty brands online, especially if they couldn’t touch and feel the products in person. We never started Soko Glam because it was a guaranteed business model; it was a passion project fueled by an interest in helping all people become more knowledgeable about skincare and finding the right products for their skin concerns (note: Soko Glam is credited with introducing the “10-Step Korean Skincare Routine” to North America). This genuine approach allowed me to build a community of skincare enthusiasts that were excited to discover and explore my curations. Now in 2018, Soko Glam has millions in unique monthly visitors, and we’ve been profitable since year two, growing an average of two to three times per year.  Eldor: What are your 3 biggest tips for female entrepreneurs looking to start their own company? Cho: 1- Start a company if you have a genuine desire or passion for the industry and the problem you are solving. If you’re doing it for the money or fame, you won’t get very far. 2- It took a decade of exploring Korean beauty trends, getting my aesthetician license, and speaking to my community to be able to grow Soko Glam to where it is today, and then launch Then I Met You on my terms.  Being an overnight success is a myth that you shouldn’t chase.  Know that anything that is worthwhile will always take time and hard work. 3- If you’re on the fence about launching your own business because you’re afraid of failing, I always say just go for it. If it doesn’t work out, you’re still smart and capable. There will always be another job waiting for you. Eldor: In today’s digital fast-paced era, I love the reminder to slow down, write a note to someone you love and “glow deeper.” Why did you tie this into Then I Met You? Cho: When you’re going through the motions of life at 100 miles per hour, it’s easy to lose sight of what’s meaningful. At 33, I am experiencing a turning point in my adult life as well, with the desire for meaningful connections, tangible experiences and a focus on substance. The name, Then I Met You, signifies a turning point in your life, which hopefully inspires you to pause, take a breath and cut out the noise, and go deeper in not only how you take care of your skin, but also the way you live.  ",
    "datetime": null,
    "url": "https://www.forbes.com/sites/karineldor/2018/11/13/how-this-k-beauty-expert-went-from-soko-glam-founder-to-skincare-brand-creator/"
}