{
    "title": "Rachel Zoe's DreamDry Opens Today, Plus, There's No Pettiness This Season on The Rachel Zoe Project | Allure",
    "text": "By Catherine Devine There's no doubt that Rachel Zoe's a busy woman. She styles plenty of Hollywood A-listers, designs her own eponymous collection, stars in a reality TV show, and now, she's adding blowout guru to her résumé—her first blow-dry salon, DreamDry, opens up in New York City's Flatiron neighborhood today. And somewhere during the craziness that is New York Fashion Week, she found time to chat with us about it all: Let's start with Fashion Week. You're here in New York to show your collection. What can you tell us about it? \"I'm super excited about it. I'm really proud of it. It's different than all my other collections. It's a bit more refined, but also younger. It has more of an edge to it. It's different, but still me.\" You have this '70s influence in your style. How do you make your inspiration fresh each season? \"It's about understanding who my woman is—who is this customer? Who are the women who want to wear these clothes? We try to keep it new and interesting, but still signature. And that's the challenge for any designer—doing new things, but it's about staying true to who you are. I'm always going to have a certain kind of vibe in my clothes, that air of '60s and '70s, but in this collection, it's got some '80s. It's a little tougher, but there's also glamour. It's about mixing all of these elements and never being too redundant.\" How does that translate to the beauty look that comes down the runway? \"I'm someone that never likes to overpower the girls in hair and makeup. Sometimes, it really completes a story, like it did for my fall look last year. I did heavier eye makeup and a pale lip, and that really spoke to the collection. But this season, I'm feeling the girls being more fresh-faced. The clothes speak for themselves, but the inspiration was equestrian. I'm thinking clean, dewy faces.\" Do you ever try the beauty looks yourself? \"It depends. Last year, I tried the braid, and after the spring show, I cut bangs. Wait, so actually, yes! I do!\" You travel a ton, especially during the shows. Are there any go-to products you won't travel without? \"God, yes. A ton. Arcona Triad Refresh Pads are everything. And Skyn Iceland Eye Gels. Oh, my god—I literally bring a box with me. I use one every day. It makes your eyes feel like they had a nap.\" Between showing your own collection and going to shows to find pieces for clients, you're insanely busy. How do you manage everything? \"Honestly, it's difficult. I'd be lying if I said it wasn't. It's hard when you go to sleep really late and then it's 6 o'clock in the morning, and my son's going, 'Mommy, wake up!' But it's heaven, so what can I do?\" And on top of it all, you're opening DreamDry, your first blowout salon. Why blowouts? \"I don't know one girl in my life that doesn't need them, or want them, or get them. Hair is a huge part of who I am and what I obsess over—I've had long hair my entire life. But at the end of the day, from a styling perspective, it completes everything. You can't get dressed without good hair.\" Where did the name come from? \"It literally just came to me—it says a lot about what it is. It's not expensive; it's under $40. You always dream that you can have this beautuiful red-carpet hair, a glamorous style, or just a blowout. It's DreamDry—you're in and out.\" What sets it apart from other blowout spots? \"It's just really beautiful. We offer a ton of styles—we name them after some of our favorite Hollywood icons, like Audrey and Sophia and Farrah. When you actually walk in there, you think you're getting a $200 hair service. There's a VIP room. The experience in and of itself will set it apart.\" Why New York? \"This is my original home, and this is where fashion is. We'll be in L.A. for sure—we're going to open a ton of these. This is just the first one, and it felt right to do it in New York.\" The fifth season of The Rachel Zoe Project airs March 6 on Bravo. What can we expect? You've obviously been up to a lot.... \"We just finished wrapping! It's a lot of me as a businesswoman this season, and a mother that's constantly juggling a lot of things. It's a really exciting time. This [is the] season I'm most proud of, if you want to know the truth. It's more interesting than it's been—there's no pettiness. It's just about everything we live through in life.\" RELATED LINKS: • Daily Beauty Reporter: Hair and Makeup Artist Joey Maalouf Talks Beachy Waves, Perfect Lips, and Surviving the World of Rachel Zoe • Daily Beauty Reporter: Allison Williams Dishes on Her New Skin-Care Endorsement, Bring Your Parents to Work Day, and Her Beauty Risks • Daily Beauty Reporter: Supermodel Secrets to Aging Gracefully (and Beautifully, and Sexily) By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Gabi Thorne By Gabi Thorne By Marci Robin By Gabi Thorne More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2013-02-14T11:00:00.000Z",
    "url": "https://www.allure.com/story/rachel-zoe-blowout-salon-dreamdry"
}