{
    "title": "Record 35 Billionaires On Forbes South Korea Rich List",
    "text": "SINGAPORE (April 30, 2015) – A record 35 billionaires are on this year’s Forbes’ South Korea Rich List. Most people returning to the list saw their wealth rise, partly due to an 11% increase in Korean stock prices. The complete list can be found here and in the May issues of Forbes Asia and Forbes Korea, the Korean language edition of Forbes. Topping the list again is Samsung Electronics Chairman Lee Kun-Hee, who is the country’s richest man with a net worth of $13.3 billion, up from $12.9 billion a year ago. Lee’s family members also have a strong showing on the list. Lee’s son, Jay Y. Lee, is ranked No. 3 with a net worth of $7.8 billion, and is steering the giant Samsung Group while his father remains in hospital after a heart attack last May. Jay Y. Lee’s sister, Lee Seo-Hyun, saw her wealth soar by 84% (No. 14, $2.25 billion) after the IPO of Cheil Industries. She is the co-president of the firm with her older sister, Lee Boo-Jin (No. 13, $2.3 billion), who is now South Korea’s richest woman. Ranked No. 2 on the list is the Chairman and Chief Executive of AmorePacific, Suh Kyung-Bae, whose wealth more than tripled to $9.2 billion this year. His company’s sales in China are soaring as young women are snapping up its cosmetics products. In addition, the growing popularity of K-beauty is also boosting sales worldwide. AmorePacific’s share price has nearly quadrupled since the beginning of 2014. At No. 4 is Hyundai Motor’s Chung Mong-Koo, who saw his net wealth decrease to $5.6 billion, from $7.1 billion last year. The stronger won, relative to the Yen, has been affecting sales abroad, while a stream of imports is impacting market share locally. His son, Chung Eui-Sun (No. 5, $3.8 billion) also saw his fortune fall by $300 million. This year’s tally produced eight new billionaires, and now the country boasts 35 ten-figure fortunes. Four of them join the list for the first time: Kwon Hyuk-Bin (No. 7), who owes his $3.6 billion net worth to the huge valuation of his privately held online-gaming company, Smilegate; Kim Nam-Jung of Dongwon Group, the company behind South Korea’s famous canned tunas (No. 21, $1.55 billion); construction magnate Kwon Hyuk-Woon (No. 26, $1.28 billion); and convenience store king Hong Seok-Joh (No. 31, $1.13 billion). Another notable billionaire is Cho Jung-Ho, Chairman of Meritz Financial Group and the subject of the cover story in the May issue of Forbes Asia. He debuted at No. 40 on the list last year with a net worth of $640 million and has since jumped 15 spots to reach No. 25 with a net worth of $1.3 billion. Cho inherited an insurer and a securities firm from his father, the patriarch of Hanjin Group. He later broke away from the family business and built a financial powerhouse - the Meritz Financial Group. Other newcomers on the list include: Furniture-maker Cho Chang-Gul (No. 41, $900 million); Hyosung Group President Cho Hyun-Joon (No. 49, $670 million) and Cuckoo Electronics CEO Koo Bon-Hak (No. 50, $665 million). Notable drop-offs are Kang Young-Joong of education company Daekyo and Cho Hyun-Bum, son of Hankook Tire’s Chairman Cho Yang-Rai (No. 37, $980 million). The minimum amount required to make the list was $665 million, up from $515 million last year. The top 10 richest in Korea are: 1)      Lee Kun-Hee; US$13.3 billion 2)      Suh Kyung-Bae; $9.2 billion 3)      Jay Y. Lee; $7.8 billion 4)      Chung Mong-Koo; $5.6 billion 5)      Chung Eui-Sun; $3.8 billion 6)      Chey Tae-Won; $3.7 billion 7)      Kwon Hyuk-Bin; $3.6 billion 8)      Kim Jung-Ju; $2.7 billion 9)      Lee Joong-Keun; $2.6 billion 10)  Lee Jay-Hyun; $2.5 billion This list was compiled using shareholding and financial information obtained from the families and individuals, stock exchanges, analysts, private data bases, South Korea's Financial Supervisory Service and other sources. Net-worth figures are based on stock prices and exchange rates as of the close of markets on April 17. Private companies are valued by using financial ratios and other comparisons with similar companies that are publicly traded. The figures often include assets held by spouses and dependent children. For more information, visit www.forbes.com/korea. Forbes Media: Forbes Media is a global media, branding and technology company, with a focus on news and information about business, investing, technology, entrepreneurship, leadership and affluent lifestyles. The company publishes Forbes, Forbes Asia, Forbes Europe and ForbesLife magazines as well as Forbes.com and ForbesLife.com. The Forbes brand today reaches more than 75 million people worldwide with its business message each month through its magazines and 36 licensed local editions around the globe, Forbes.com, TV, conferences, research, social and mobile platforms. The Forbes magazine iPad app merges print storytelling with social sharing and the web. Forbes Media’s brand extensions include conferences, real estate, education, financial services, and technology license agreements. Forbes Korea: Licensed in 2003, Forbes Korea is a monthly Korean language publication by Joongang Ilbo, one of South Korea’s leading media conglomerates. About one-third of Forbes Korea’s content is from Forbes and Forbes Asia; the rest are local stories. Content include news on South Korea’s entrepreneurs, celebrities, and philanthropists as well as on the lifestyle and insights of the rich and famous in Korea. For media queries, please contact: Catherine Ong Associates Pte Ltd Catherine Ong                                                 Farhan Zohri tel: +65 6327 6088                                          tel: +65 6327 6089 cell: +65 9697 0007                                        cell: +65 8318 9665 cath@catherineong.com                                 farhan@catherineong.com  ",
    "datetime": null,
    "url": "https://www.forbes.com/sites/forbespr/2015/04/30/record-35-billionaires-on-forbes-south-korea-rich-list/"
}