{
    "title": "Red Velvet's Yeri Teams Up on Lipstick With Colette  | Allure",
    "text": "By Devon Abelman From now on, every lipstick Yeri smears onto her lips will be from one brand and one brand only: Colette. The member of the beloved K-pop group Red Velvet made this grand announcement on her personal Instagram on Friday, alongside a French-inspired photoshoot that gave me major modern Marie Antoinette vibes. The post also linked out to the Instagram of Colette, a beauty brand I've never heard of before. The only information I know about it was shared on its Instagram: It's officially launching on Wednesday, January 8 and pays homage to French author Sidonie-Gabrielle Colette. On her Instagram Story, Yeri further explained she's working with Colette and helped create shades for the brand. Whether or not the beauty brand is her own or simply a collaboration is unclear at the moment. I did some digging and discovered a makeshift website for Colette listing two lines of smooth, long-lasting matte lipsticks with a cashmere-like texture that will be launching. One is called Nuances D' Yeri and includes two hues called Yoldé Yeri Rouge and Chocolat Et Vin. Actual photos of the lipsticks aren't pictured on the website just yet, but they seem to be a brick red and a dark chocolate brown, respectively. The Colette lipsticks don't mark the first time a member of Red Velvet has worked with a beauty brand. In fact, Joy is the face of Espoir, which is based in Korea. The whole group also collaborated with K-beauty brand Etude House on a line of liquid lipsticks in 2018. I'm looking forward to seeing what Yeri's lipsticks actually look like. My fingers are crossed Chocolat Et Vin looks like the dark lipstick she wore in the \"Psycho\" music video — don't even get me started on all the stunning makeup featured in it — and they will be available in America. By Aliza Kelly By Gabi Thorne By Gabi Thorne Read more about the beauty routines of the ladies of Red Velvet: Now, watch Tiffany Young try nine things she's never done before: Follow Devon Abelman on Twitter and Instagram. By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Marci Robin By Kara Nesvig By Marci Robin By Gabi Thorne More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2020-01-03T17:58:13.289Z",
    "url": "https://www.allure.com/story/red-velvet-yeri-colette-lipstick"
}