{
    "title": "Rejuvenate Your Skin with These K-Beauty Products – That’s Shanghai",
    "text": " 0\n\n\n\n\n0 Is the chilly winter weather leaving your skin dry and sensitive? Keep your skin moisturized and in tip-top condition with these items from Korean beauty brand 9CC, on sale right now.  Suffering from dry, flaky skin? Then we have the solution for you! 9CC Blue Sea Blanchiment Water Drops Cream is the perfect product to fulfill all your skincare needs. This Korean-imported cream has been specifically designed to sooth, comfort and brighten dry, sensitive skin. It uses natural, hydrating ingredients such as algae and Tahitian black pearl, providing lasting moisture for the whole day. It only contains ingredients that are tender and safe for the skin, making the cream suitable for use on all skin types.  As well as working as a moisturizer, this whitening cream can also help you keep track of your skin’s health. With its intelligent water drops feature, you can see if your skin is perfectly healthy, too dry or too oily, allowing you to keep your skin in top condition.   Buy a 100g bottle right now on thMart for just RMB98. Buy Now for ¥98 on thMart It has never been a more pressing time for young people to take care of their skin. With air quality residing firmly in the doldrums throughout China's major cities, we need to make constant efforts to ensure that our skin has a youthful glean. Not easy, right? But with 9CC's Sea Collagen Spheres, you can now prevent premature skin aging as easy as pie.  Collagen makes up an important layer of your skin that begins to break down as we age. As we lose collagen, we begin to notice new wrinkles and sagging. 9CC's Sea Collagen Spheres work to replenish your skin's store of collagen, nourishing and strengthening it in the process.  What makes 9CC's Sea Collagen Spheres special? Their product contains hydroxy poline, which accelerates collagen composition, and hydroxy lysine, which prevents the breakdown of collagen.  The sea collagen spheres come in handy packaging, which prevents bacteria from harming the collagen. All you need to do is tear open the packet, pair the collagen spheres with essential water to form a viscous fluid before rubbing it into your skin. Then sit back and watch as your skin feels nourished and glowing. Like we said, easy as pie! Order these sea collagen spheres for just RMB180 on thMart. Buy Now for ¥180 on thMart thMart\r\n is a new one-stop online shopping site that lets customers buy a range \r\nof products seamlessly, from anywhere, on the go, with shipping \r\navailable across China. Compatible on both desktop and mobile, customers\r\n can login through WeChat, with their mobile number or by registering \r\ndirectly on the platform. For business opportunities, please email us at thmart@urbanatomy.com. Click here to browse through thMart's catalogue of products. Extract the QR code below to follow thMart on WeChat:  Images via Quanjing, thMart skincare\nbeauty\nOnline Shopping\nE-commerce\ndeals\nDelivery\nk-beauty\nthMart\neditor's pick Health is beauty, and beauty is health Allelique is a truly international skincare brand, founded in Shanghai with headquarters in London. Doucéa is a skincare brand imagined with kids, for kids. Lose weight, compete for prizes, and transform your body and life with K2Fit. Neighborhood takes the stress out of shopping in person as the #1 most recommended Costco delivery service. Renowned British florist Shane Connolly teaches the art of environmental floristry in an online course. Excellent deals on this week's hottest items! Take advantage of these awesome 12/12 e-commerce deals on electronics, household essentials, apparel and more. Sign up to get the entertainment, lifestyle and event news from That's Shanghai every week! ADVERTISEMENT Nominate Now in the That's Shanghai 2023 Food & Drink Awards Lick Responsibly! A, WAY: Shanghai's 1st Luxury Booze Ice Cream Shanghai French School – We Change Lives with English 15 Amazing Afternoon Teas in Shanghai China, Here Are Your 2024 Public Holidays Scan our QR Code at right or follow us at Thats_Shanghai for events, guides, giveaways and much more! Weekly updates to your email inbox every Wednesday Never miss an issue of That's Shanghai! Visit the archives About Us |\n\t\t\t\t\tContact Us |\n\t\t\t\t\tAdvertise With Us |\n\t\t\t\t\tWork for Us |\n\t\t\t\t\tApp © 2023 JY International Cultural Communications Co., Ltd. 粤ICP备20064570号 ",
    "datetime": null,
    "url": "https://www.thatsmags.com/shanghai/post/26229/keep-your-skin-healthy-and-moisturized-with-these-k-beauty-items"
}