{
    "title": "Retailers Hunt for the Next Big Beauty Superstar at Indie Beauty Expo – WWD",
    "text": "Buyers from the likes of Ulta Beauty, HSN, Sephora, Costco, Amazon, Urban Outfitters and Peninsula Beauty attended the trade show held last month in Los Angeles. Beauty Editor, West Coast The indie beauty explosion isn’t fading anytime soon. Buyers from Ulta Beauty, HSN, Sephora, Costco, Amazon, Urban Outfitters Inc. and Peninsula Beauty, whose chief beauty officer Lori Silverstein revealed during a panel she’s culling products from major conglomerates to make way for smaller players on the California specialty chain’s shelves, wouldn’t have descended upon the second edition of Indie Beauty Expo in Los Angeles if there wasn’t supercharged consumer demand for cosmetics upstarts. Along with more than 1,000 attendees, they were among the nearly 310 buyers scouring 102 budding brands at the trade show trying to decipher which ones might become the next GlamGlow, Anastasia Beverly Hills or It Cosmetics.  “They all want to find the next hot indie brand,” proclaimed Nader Naeymi-Rad, cofounder of IBE, speaking to WWD last month from the expo’s penthouse venue at the California Market Center. “Indie brands hold about 5 percent of the market, but they’re growing at 20 percent, and the overall market is growing at 2 to 3 percent. So, they’re capturing the growth dollars. I was talking to a large online retailer with more than $100 million in turnover that was here, and he told me that roughly 40 percent of their online traffic is now coming from new brands. He said our page with new brands is where the bulk of our traffic is going because that’s what people want.” Related Articles\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tBeauty Features\n\t\n\n\n\n\t\n\t\t\tBobbi Brown on Three Years of Jones Road\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tFashion Scoops\n\t\n\n\n\n\t\n\t\t\tMellerio Unveils First Perfume Indie brands have captured the imaginations of Millennial beauty shoppers. Whether due to their digital prowess, healthy positioning or passionate founders, they’re pushing across mass and prestige beauty segments to reach those shoppers. Color cosmetics are clearly at the forefront of the indie beauty movement, but the fragrance and skin-care categories are certainly on board, too. At IBE, products from all categories were on display and even some unusual categories jumping into beauty, such as oral care, were present. A favorite exhibitor of IBE cofounder Jillian Wright’s was Lebon, a toothpaste specialist selling fresh mint, cinnamon-mint and licorice-mint options for $16 without synthetic fragrances, parabens, triclosan, fluorine, colorings or saccharin. The French brand has broken into around 20 retail doors in the U.S., including New London Pharmacy, beautyhabit.com and luckyscent.com. “The scent is like opening up a bottle of perfume,” swooned Wright. “It’s just the most gorgeous toothpaste and, if you see their Instagram, it’s really beautiful and it evokes emotion.” Korean brands seem to be conquering beauty aisles everywhere these days, and they were a force at IBE as well. Cle Cosmetics punched up lip products with its vibrant Melting Lip Powder for $20 that transforms from a powder to a lasting tint with a matte finish. It comes in five colors, and the bestseller is Barbie Pink. Speaking of Cle, Sarah Chung, chief executive officer of Landing International, a marketplace connecting retailers with emerging beauty brands, said, “They are one of the first K-beauty brands developed for the U.S. market.” She added that Cle Cosmetics has a wider shade variety than most Korean beauty brands. Its $49 Essence Air Cushion foundation is available in four tones, and its $31 CCC Cream, a combination of BB and CC creams, is in five: light, medium light, medium, medium deep and deep.  Natural beauty sales are on the rise, and the indie field offering them is increasingly crowded. But there remain niches within the natural beauty sector that have unrealized potential, according to brands and buyers. Fragrance is a key example. “For the longest time there was nothing [in natural perfume]. I hope to see more,” said Romain Gaillard, founder and ceo of Detox Market. The clean-beauty retail and e-commerce concept carries the scent brands Honoré des Prés, Strange Invisible Perfumes and Lurk. Los Feliz Botanicals, a fragrance line inspired by California landscapes containing $8 eau de parfums and $24 perfume balms, and Thorn & Bloom, an immaculately packaged brand with nine eau de parfums priced at $12, were standout IBE scent brands. Although not at the L.A. version of IBE, Thorn & Bloom’s Bird of Paradise eau de parfum, which has notes of jasmine sambac and pink champaca at its heart, was feted with a best in show award for fragrance. Gaillard also believes ingestibles like vitamins, supplements and beverages formulated to improve the appearance of hair, skin and nails are finally taking off. “I remember this discussion [about ingestibles] in the late Nineties where people were like, ‘Oh yeah, it’s the next big thing.’ When we launched The Detox Market [in 2010], we were advocating them as part of our holistic approach, but people didn’t care about them, even in Venice,” he said, continuing ingestible brands are now resonating with customers, specifically Moon Juice with its collection of dust herbal supplements. Notable brands bringing the message of inside-out beauty to IBE were The Beauty Chef and Hum Nutrition. While the ingestible category is very nascent within natural beauty and beauty generally in the U.S., natural color cosmetics is a maturing category with established brands that have evolved to better respond to consumers. Au Naturale, for instance, is upgrading its packaging and has expanded its shade range. In March, it’s moving to matte charcoal componentry that feels weightier than its previous componentry. On the shade range front, it’s boosted the number of foundation shades to 13 from eight at its founding six years ago. “African-Americans are really underserved in green beauty,” explained Au Naturale founder Ashley Prange. Prange’s distribution strategy for her brand is to go after Jane Iredale in spas, salons and hotels — and she’s finding a receptive audience. She said, “People who I never thought would be interested in learning about indie brands are listening to us.”  Sign up for beauty news straight to your inbox every day Top News Stories Alerts Straight to your Inbox. Send us a tip using our anonymous form. WWD and Women's Wear Daily are part of Penske Media Corporation. © 2023 Fairchild Publishing, LLC. All Rights Reserved. ",
    "datetime": "2017-02-01T21:02:58+00:00",
    "url": "https://wwd.com/beauty-industry-news/beauty-features/indie-beauty-expo-los-angeles-10773036/"
}