{
    "title": "Review: I Dew Care Disco Kitten Face Masks | Women's Health",
    "text": "Your skin will instantly feel the difference. Korean beauty, a.k.a. K-beauty, has managed to transcend its “moment” and become a mainstay in the beauty industry. While you may associate the trend with laborious 10-step skin-care routines, one brand aims to change that—after all, who has the time? Memebox’s I Dew Care is a skin-care line that’s not only convenient, but just as fun as the punny name suggests. And I’m completely obsessed with it. The line includes various masks in a rainbow of fun colors, as well as spot acne treatments, blackhead removal strips, and sheet masks. The idea is that the mask-based skincare routine can be easily tailored to whatever skin dilemmas you’re facing that day. And since all the products are available for under $25, it’s actually feasible that you’d have several masks in your medicine cabinet rotation. They even have a kit of Mini Magic Clay Masks ($20 urbanoutfitters.com) so you can purify on Monday, tighten on Tuesday, and calm on Wednesday. Also, speaking as someone with fairly sensitive skin, I’ve never run into issues with this line—the products are effective but far from intense. Here's everything you need to know about adult acne: Most popular on Ulta (and one of my personal favorites) is the Disco Kitten Illuminating Diamond Peel-Off Mask ($23, ulta.com). Yes, it’s as extra as it sounds and I love it. The metallic mask uses actual diamond and pearl powder to boost elasticity and gently exfoliate the skin, leaving it super-soft and glowy. After cleansing, I apply it all over my face with the I Dew Care silicone brush that's sold separately (your fingers will work too, it just gets a little messy). Just make sure to avoid your eyebrows and hairline as you don’t want to pull those off with the mask. Sit with your shiny mask for 20 minutes while it hardens, then peel it right off. (The peeling is the funnest part, obviously). After using, my skin instantly feels firmer, smoother, and 100 percent dirt-free. Another one of my faves is the Berry Bubbly Purifying Bubbling Berry Clay Mask ($19, ulta.com). The Kaolin clay blend deeply cleanses pores while gently exfoliating, leaving my skin refreshed, but never irritated. Additionally, the antioxidants from the blueberries deliver anti-aging benefits while the strawberry extracts control oil and fight back against existing blemishes. I use this once or twice a week on dry, clean skin to combat breakouts. It instantly starts bubbling once applied and continues to pop and fizz for the 10 to 15 minutes it’s on, making me feel like it’s really working to improve my skin. This mask is also great for deep cleansing after a night of heavy-duty makeup. Look how much it foams up! My bathroom cabinets and drawers are overflowing with skin-care products, but I keep coming back to I Dew Care for two reasons: They do exactly what they say they’ll do and they’re fun to use. The latter is something that I think is highly underrated—yes, we want results, but shouldn’t getting those results be enjoyable? Plus if a product is fun to use, I’m more likely to keep using it, and hence, more likely to see real benefits staring me back in the mirror. And at such an accessible price point (okay, three reasons, you caught me), why not give it a try yourself? 10 Best Boob Tapes For All-Day Lift And Support 🙌 The Best Facial Tools Of 2023 14 Best Laser Hair Removal Devices Of 2023 What To Know About Phenol Peels, Per Experts 11 Reasons Why Your Face Looks So Swollen 8 Best Derma Rollers Of 2023, Per Experts The 16 Best Hydrating Face Masks 19 Best Dark Spot Correctors, Per Dermatologists The Best Night Creams Of 2023, Per Dermatologists A Guide To The Best Gua Sha Tools 11 Best Face Razors For Women, Per Dermatologists 13 Best Wrinkle Creams, Per Skincare Experts A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2017-11-14T22:34:19Z",
    "url": "https://www.womenshealthmag.com/beauty/a19964218/i-dew-care-skincare/"
}