{
    "title": "Review: K West Hotel and Spa Divine chocolate body scrub and massage | London Evening Standard | Evening Standard",
    "text": "Lifestyle | Beauty To celebrate chocolate week, K West Hotel & Spa have conjured up a chocoholic treat with Divine chocolate for those with a sweet tooth. Experience The 55 minute treatment starts with the Chocolate and Sea Salt Body Scrub, which I was told encourages the production of endorphins and helps to firm the skin – something I was definitely in need of. Every last inch of dry skin was exfoliated away, my pores could breathe again, and the cellulite was shifting, before hot mittens wiped away the scrub in preparation for the massage. Limb by limb I was slathered in the dark chocolate and honey balm as the masseuse slowly kneaded and coaxed my muscles with fingertips, hands and forearm before firmly tickling and teasing away the tension in my shoulders. After bringing myself around, I was left to sip on a Divine chocolate and chili martini in the sanctuary of the Relaks room. Results I was left thoroughly relaxed and with deliciously smooth, chocolate infused skin. Simply Divine! Cost The K Spa Divine Day Package costs £85 and is available from 13 to 19 October. Visit k-west.co.uk to book yourself in Have your say... 1 boxing 30,760 Tyson Fury vs Francis Ngannou: Fight time, undercard, latest odds, prediction, purse and ring walks 2 football 23,471 Gary Neville convinced there is a 'problem brewing' behind the scenes at Arsenal 3 black friday 14,584 Best Currys Black Friday deals to expect 2023: Offers on smartwatches, washing machines and more 4 crime 7,241 Lewis Edwards: Paedophile police officer who incited girls to send degrading pictures is jailed for life 5 london 6,199 Clapham resident's makeshift Shetland pony enclosure sparks complaints from neighbours ",
    "datetime": "2014-10-15T14:39:59.000Z",
    "url": "https://www.standard.co.uk/lifestyle/beauty/review-k-west-hotel-and-spa-divine-chocolate-body-scrub-and-massage-9796404.html"
}