{
    "title": "Rihanna Just Dropped Another Summer Fenty Line - The Launch Includes the \"Moroccan Spice\" Eyeshadow Palette, \"Flyliner,\" and More. ",
    "text": "The line includes the brand's second-ever eyeshadow palette, an eye primer, new brushes, and a new liquid liner. It's the summer of Rihanna, so it seems. After launching Fenty's \"Beach Please\" collection in May and starring in June blockbluster Ocean's 8, Rihanna announced via Instagram that another Fenty Beauty launch is set to drop July 6. As for this collection, it's all about the eyes. At the core of the release is the Moroccan Spice palette (Fenty's second-ever eyeshadow palette, following the Galaxy palette last year), which features diamond-shaped shimmer and matte shades in toasty hues.  Also joining the Fenty family is a Pro Filter Eye Primer to prep lids for shadow, two new millennial pink eyeshadow brushes—built for packing on product and blending out a cut crease—and Flyliner, a flex-tip, long-wear liquid liner that's formulated to be water-resistant with a satin sheen. Fenty Beauty's latest launch will be available on July 6 at Sephora, Harvey Nichols, and on fentybeauty.com. 13 Best Japanese Skin Care Products to Shop Amazon Is Having a Major Beauty Sale Right Now Why Matrix Could Be the Next Best Skin Treatment Claudia Sulewski Launches CYKLAR First Class Beauty 2023 The 14 Best Expert-Approved Setting Sprays Austin Butler Doesn’t Think He’s a Beauty Icon Jelly Nails Are Back and Better Than Ever The Best Spring 2024 Beauty Trends to Try Now Add These K-Beauty Prime Day Deals to Your Cart The 20 Best Pore Minimizers for Baby-Smooth Skin Laneige’s Lip Sleeping Mask is on Sale Again A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2018-06-25T17:33:00Z",
    "url": "https://www.elle.com/beauty/makeup-skin-care/a21933168/rihanna-just-dropped-more-summer-fenty-beauty-products/"
}