{
    "title": "Rising Korean Brand Rbow Blends Beauty With Art | Hypebae",
    "text": "Launched in early 2020, Rbow is a rising Korean body care brand that aims to bridge the gap between beauty and art. The label’s offerings range from hand and body creams, to lip balms and perfumes. Sohyung Kim, the brain behind the label, utilizes her previous experience as the former director at Gana Art gallery. “There are tons of cosmetics brands in the world but there was nothing inspired or connected with art,” the founder explains. She additionally shares in a press release that Rbow aims to provide consumers with unexpected pleasure, just like a rainbow would. The brand’s hero products include a line of fragrances, which are formulated in partnership with french perfumers Symrise and Firmenich. Key scents include “Dance and Balance,” a spicy musk; “O.A.C,” a woody and floral aroma; “Untitled,” a spicy scent created in collaboration with contemporary artist Eddie Kang; and “Lights on Objet,” which boasts hints of ginger and pink pepper. As for lip care, Rbow offers a range of vegan balms in both colorless and tinted options.\nElsewhere, the label produces a body lotion and body wash with ultra-hydrating ingredients that are also found in its hand products. The line is rounded out with a hand and nail cream that only take three seconds to fully absorb into the skin.\nPeep some of Rbow’s offerings in the gallery above. You can shop the goods via the label’s online store, as well as retailers like 29CM and SSG.\nWhile you’re here, don’t forget to check out our list of K-beauty brands that are cruelty-free and sustainable.\n\n\n \n\n\n\n\n\n\n\n\n\n\nView this post on Instagram\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nA post shared by @rbow_official\n\n\n\n\n\n                                                            Read Full Article Elsewhere, the label produces a body lotion and body wash with ultra-hydrating ingredients that are also found in its hand products. The line is rounded out with a hand and nail cream that only take three seconds to fully absorb into the skin.\nPeep some of Rbow’s offerings in the gallery above. You can shop the goods via the label’s online store, as well as retailers like 29CM and SSG.\nWhile you’re here, don’t forget to check out our list of K-beauty brands that are cruelty-free and sustainable.\n\n\n \n\n\n\n\n\n\n\n\n\n\nView this post on Instagram\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nA post shared by @rbow_official\n\n\n\n\n\n                                                            Read Full Article Peep some of Rbow’s offerings in the gallery above. You can shop the goods via the label’s online store, as well as retailers like 29CM and SSG.\nWhile you’re here, don’t forget to check out our list of K-beauty brands that are cruelty-free and sustainable.\n\n\n \n\n\n\n\n\n\n\n\n\n\nView this post on Instagram\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nA post shared by @rbow_official\n\n\n\n\n\n                                                            Read Full Article While you’re here, don’t forget to check out our list of K-beauty brands that are cruelty-free and sustainable.\n\n\n \n\n\n\n\n\n\n\n\n\n\nView this post on Instagram\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nA post shared by @rbow_official\n\n\n\n\n\n                                                            Read Full Article View this post on Instagram\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nA post shared by @rbow_official A post shared by @rbow_official A post shared by @rbow_official Read Full Article    Keep updated on the latest news.  Keep updated on the latest news. We charge advertisers instead of our readers. Support us by whitelisting our site. Whitelist Us Already whitelisted us?\n                        \n                            Refresh page ",
    "datetime": "2021-02-27T01:00:48-05:00",
    "url": "https://hypebae.com/2021/2/rbow-k-beauty-brand-unisex-lip-balms-body-hand-nail-creams-wash-perfumes-fragrances-where-to-buy"
}