{
    "title": "Robinsons Retail buys Shiseido, Benefit stores",
    "text": " SUMMARY This is AI generated summarization, which may have errors. For context, always refer to the full article.  MANILA, Philippines – Gokongwei-led Robinsons Retail Holdings Inc. said its unit has acquired the assets of a company that operates Shiseido and Benefit cosmetics stores in the country. In a disclosure to the Philippine Stock Exchange on Monday, December 16, Robinsons Retail said its wholly-owned subsidiary Robinsons Specialty Stores Inc. acquired the assets of Beauty Skinnovations Retail Inc., subject to closing conditions and operational requirements. Beauty Skinnovations operates 8 Shiseido stores and two Benefit stores in various leading malls in Metro Manila, Cebu and Davao. The acquisition includes the right to sell Shiseido and Benefit cosmetics products under a distribution agreement with Luxasia Inc., a leading distributor of global fragrance and cosmetics brands in the Philippines, and L Beauty Luxury Asia Inc., distributor of LVMH beauty brands in the country. “The acquisition is in line with Robinsons Retail’s strategy of expanding into new retail segments the 10 cosmetics stores will add to Robinsons Retail’s store network which now totals over 1,000 stores upon completion of the closing requirements,” said Robinsons Retail. Benefit Cosmetics LLC is a US-based manufacturer of cosmetics headquartered in San Francisco, California. It was initially founded as a beauty shop that specialized in quick fix products but has growninto a global beauty brand now selling over at 2,000 counters in more than 30 countries. On the other hand, Shiseido Co Ltd., a Japanese hair and cosmetics producer, is the largest cosmetic firm in Japan and the fourth-largest in the world. Shiseido currently has 25,000 store outlets worldwide. Robinsons Retail is the retail arm of the Gokongwei group. It is engaged in 6 retail segments: department stores, supermarkets, home improvement stores, convenience stores, drug stores and specialty stores. Robinsons Retail is also the exclusive local franchisor of Japanese convenience store chain Ministop. It owns South Star Drug Store and a chain of specialty stores that carries the brand Toys R Us, Topshop, Topman, Dorothy Perkins, and Saizen. During the first 9 months, the company posted a 128.5% increase in net income to P2.04 billion from P894.5 million in the same period last year. In October, the company raised funds for its expansion by offering shares to the public. – Rappler.com Error. Please abide by Rappler's commenting guidelines. There are no comments yet. Add your comment to start the conversation. JOIN OUR NEWSLETTER Fearless reporting delivered to you follow us    ",
    "datetime": "2013-12-16T07:55:01+00:00",
    "url": "https://www.rappler.com/business/46004-robinsons-retail-shiseido-benefit-stores/"
}