{
    "title": "S. Korean cosmetics lay foundation to seduce Europe | Macau Business",
    "text": "Paris – South Korean cosmetics brands, wildly successful at home and across Asia, now have their eye on the European beauty market where their penetration is, for now, only skin-deep. Picking luxury goods powerhouse France as its bridgehead to seduce European consumers, South Korea’s leading cosmetics firm Amore Pacific launched its top brand Sulwhasoo at the upmarket Galeries Lafayette department store a few months ago. Britain is the next planned stop for Amore next year, when the company also plans to launch its other flagship brand, Laneige. The Korean industry has a solid reputation for innovation and a particular knack for blending natural far eastern ingredients — such as green tea, ginseng root or even snail slime — into beauty products. Hallyu, the “Korean Wave” of pop culture sweeping Asia since the 1990s, has given cosmetics sales a big lift, with young fans wanting to make up just like their K-Drama or K-Pop idols, or even become K-Beauty ambassadors for big brands. Amore Pacific, which had sales of around $5.6 billion last year, is still heavily reliant on its domestic market, which accounts for two-thirds of its revenues. Its European and North American operations pale by comparison, generating combined sales of less than US$100 million. “The company’s aim today is to widen its geographical presence beyond Asia,” Thierry Maman, head of Amore Pacific Europe, told AFP. Tensions with Chinese clients after South Korea allowed the United States to install a missile shield added urgency to the group’s ongoing drive towards “globalisation”, said Maman, who was a manager at French luxury conglomerate LVMH before joining Amore. One of the challenges for European expansion is that the Korean Wave of pop culture has not really taken off there. The Hallyu association can even be a bit of a drawback, says Laura Koeppler, who co-manages the Korean Smooch online store which sells avant-garde cosmetics made in Seoul to European customers. Koeppler said early Korean cosmetics imports to Europe rode a wave of enthusiasm for Kawai, meaning “cute” in Japanese, including TonyMoly and Skin79 which makes face masks in the shape of a panda. “Consumers thought that that is what South Korea is about,” she told AFP. Koeppler said that, actually “there is real skill” in K-Beauty, which has come up with game-changing products such as BB creams, good at covering imperfections, CC Creams, which improve complexion, and so-called “cushions”, which blend skincare and make-up ingredients into a single product. Merging traditional Asian ingredients with ultra-high tech components is another hallmark of Korean cosmetics making. South Korean beauty and skincare require different “application rituals” than those Europeans are used to, said Thierry Maman. “There is a need for guidance” for European consumers wanting to work Korean products into their routine. “The priority for western brands is the effectiveness and the quantity of active ingredients that they manage to incorporate” in a beauty product, he said. But in Asia “the smell, the touch and the pleasure that a cream brings” are just as important, according to Maman. A number of Western beauty companies have copied South Korean cosmetics inventions, industry experts say. But sometimes they simply buy into local companies for fast Asian market exposure, such as when Unilever picked up South Korea’s Carver, LVMH bought a stake in CLIO Cosmetics and Estee Lauder invested in Dr. Jar+ and DTRT. These acquisitions “show that western beauty giants acknowledge K-Beauty players as a fast and effective instrument to capture China and emerging Asian markets. Private equity firms will continue to drive such deals, attracting the appetite of western beauty giants”, said Sunny Um, Asian beauty sector analyst at the Euromonitor research firm. L’Oreal, the world’s biggest beauty products company, could be next on the takeover trail. “We’re looking at all acquisition opportunities in South Korea,” L’Oreal’s chief executive, Jean-Paul Agon, said recently. by Etienne Balmer  ",
    "datetime": "2018-02-25T06:30:01+00:00",
    "url": "https://www.macaubusiness.com/s-korean-cosmetics-lay-foundation-seduce-europe/"
}