{
    "title": "S. Korean Women Abandon Makeup to Fight Male Domination",
    "text": "Print South Korean university student Yim Ji-su used to sacrifice up to two hours of sleep each morning for her laborious makeup routine - from applying foundation and concealer to perming her shoulder-length hair. But about six months ago, she joined a growing band of young women who have given up makeup and cut their hair short to rebel against long-held ideals of beauty they claim to have been subjected to in male-dominated South Korea. The phenomenon has sparked debate in the beauty-obsessed nation, and brands are rethinking their marketing strategies to cater to the growing movement. \"We are not dolls, we are human beings,\" Yim, a third-year student in Korean literature told the Thomson Reuters Foundation from the capital Seoul. She was bare-faced and sporting a buzz cut. \"By escaping this corset, I feel like I am myself again,\" she said, adding that a number of students at her campus have also jumped on the bandwagon. South Korea's wide range of skincare and cosmetic products has earned the industry the name \"K-beauty\", a term reminiscent of the moniker \"K-pop\" which refers to the booming pop music scene. South Korea has become one of the world's top 10 beauty markets, according to global market research firm Mintel, with many women taking it to the extreme of plastic surgery to reach uniform beauty standards. But it is also known as a socially conservative country - it has one of the worst gender wage gaps among developed nations, and is ranked 115 out of 149 countries in the World Economic Forum's 2018 Global Gender Gap report. Against this backdrop, discontent among women about society's patriarchal aspects has been slowly growing. ‘I would kill myself' Tens of thousands of women took to the streets in Seoul last year to protest against the spy-camera porn phenomenon, where victims were filmed illicitly when changing or having sex. Around the same time, a small group of women also began joining what is known as the \"Escape the corset\" movement, taking to social media to post images of themselves destroying their cosmetics. YouTube star Lina Bae used to offer makeup tutorials on the video sharing site, but in a viral video last June, she revealed the dark side of the rigid beauty standards and the ridicule she has had to suffer. In her video, which has attracted nearly 7 million views, Bae said some viewers told her \"I would kill myself if I were you\" and \"Didn't know pig can make up.\" She said many women were so insecure about their own appearances that they have to put on makeup even for a short trip to nearby supermarkets. \"I am not pretty but it is fine,\" said Bae, whose real name is Bae Eun-jeong, as she wipes away her bronze eyeshadow and red lipstick in the video. \"I will not be able to wear this corset forever,\" she added. Despite the growing movement, analysts said the K-beauty sector is unlikely to be affected, and Mintel data showed it is expected to reach a retail market value of $11.4 billion in 2019, from $10.7 billion in 2018. \"(It) is a movement that is emerging among South Korea's younger generations today, but it is a trend that has not yet reached the mainstream public,\" said Hwa Jun Lee, a senior beauty analyst at Mintel in Seoul. But he warned brands not to take the trend lightly. Some companies have already begun responding to the growing movement by shifting away from the existing rigid beauty standards to emphasize minimalism, with \"all-in-one\" beauty products that simplify skincare routines, said Lee. Popular Korean cosmetics brand Missha, meanwhile, has featured a short-haired female model in one of its latest commercials, and other local brands like LAKA are the same. \"While still in its nascent stage, it is important for brands to note that the 'Escape the corset' movement has the potential to grow further in the future,\" the analyst said. Sustained effort Supporters of the movement said giving up makeup is only the start of a bigger push for greater gender equality, as South Korean women confront daily sexism. \"It is about women's choice... The movement is about changing our everyday culture,\" said Shin Ji-ye, a 28-year-old politician who stole headlines last year when she ran for the post of Seoul mayor but lost. But campaigner Heather Barr said it would be a long haul for feminists in South Korea to achieve greater women's rights, including introducing stronger legislation against abuse and sexual harassment. \"(It) will take a sustained effort, but they show no signs of giving up,\" said the senior women's rights researcher at global watchdog Human Rights Watch.  ",
    "datetime": null,
    "url": "https://www.voanews.com/a/south-korea-make-up-strike/4793929.html"
}