{
    "title": "Salmon Sperm Is The New Anti-ageing Ingredient K-beauty Can't Get Enough Of - Forbes India",
    "text": "Present in many K-Beauty cosmetics, salmon PDRN is a powerful anti-aging agent.\r\nImage: ShutterstockYou can't stop progress. In search of natural alternatives to the chemical components found in some cosmetics, sometimes the beauty industry makes unexpected finds. One of the latest is salmon sperm. Already present in several formulas from K-Beauty brands, it's appreciated for its numerous anti-aging virtues.It's become clear that nature is full of treasures with properties that are beneficial to our health and skin. Olive oil, shea butter, aloe vera and tea are all ingredients that fit well in our beauty routines. But some cosmetic brands aren't content with these well-known ingredients and are choosing to use totally unexpected, and sometimes frankly unappealing sources. One example is salmon sperm, a substance that we certainly didn't expect to show up in our beauty products... But K-Beauty has made it a hot commodity.An anti-aging miracle ingredient?If you're a fan of K-beauty—and there must be more than a few around, given the 3.2 billion views for the hashtag #kbeauty on TikTok—you may already be taking advantage of the benefits of salmon sperm. Whether this name is really the correct one to use remains to be seen, as many sites offering cosmetics with PDRN, the trendy substance, tend to remain vague on the subject. Some speak only of salmon DNA, while others refer to an essential component of salmon DNA.\nRelated stories\n\n\n\n\n\n\nBootstrapped Lotus Herbals is not afraid of MNC invasions. Here's why\n\n\n\n\n\n\n\n\n\nPlum: On a mission to make positive impact with vegan beauty\n\n\n\n\n\n\n\n\n\nHow Purplle is solving beauty for women in tier 2 cities and beyond\n\n\n\n\n\n\r\nLaboderm International, a professional skincare product retailer and supplier of Korean beauty salons, is a little more explicit, referring to \"DNA obtained by extracting from the testicles of salmon fish.\" This is confirmed by the South China Morning Post, which speaks alternately of \"salmon sperm,\" \"salmon testicle DNA\" and \"salmon PDRN.\" It is likely under this last name that you will see the substance listed in some cosmetics formluations, starting with Korean beauty brands such as young skincare brand KAHI Cosmetics.No matter what you call it, salmon PDRN is said to be a powerful anti-aging agent, capable of improving skin elasticity, reducing fine lines and wrinkles, regenerating the epidermis, and enriching it with collagen. It won't take much more than a few more research studies for cosmetic brands to start snapping it up.Tested and approved by Doja CatIn the music video for \"Vegas,\" released just before the summer, the American rapper Doja Cat smears her neck and face with a cosmetic stick whose name and brand are clearly visible. It is the Wrinkle Bounce Multi Balm from KAHI Cosmetics. The details on the e-shop of the Korean brand reveal that it is formulated from salmon collagen to fill wrinkles, proteoglycans also derived from salmon to moisturize the skin, and salmon PDRN to improve skin elasticity. Proof that this very specific DNA has already made its way into the world of cosmetics.Also read: G-beauty, C-beauty, T-beauty: Beauty takes on the world and the alphabetAnd that's not the only area where salmon sperm is gaining traction. Chinese researchers have recently developed a new biodegradable material made from the sperm of the fish. It remains to be seen whether these innovations will eventually become part of our daily lives. For hassle free instant subscription, just give your number and email id and our customer care agent will get in touch with you OR click here to Subscribe Online Photo of the day:  Inching towards Diwali Aakanksha Monga: Breaking the taboo of solo travel for Indian women Inflexor Ventures: Taking a broader view on deeptech Why Pi Ventures likes to be one of the first investors in a startup India's Top 100 Digital Stars 2023: The changing landscape of influence Digital Stars 2023: Rise of the influencers Morning Buzz: Debit cards losing out to UPI; RBI directs banks to have two wholetime directors, and more Bitcoin price surge spurs asset outflows from crypto exchanges EBA and ESMA release joint guidelines for crypto entity suitability Drought in Brazil's Amazon reveals ancient engravings The Woman In Me: Britney Spears tells of troubles in new memoir Celesta Capital: At a sweet spot in India's deep tech startup landscape In pictures: Ramlila, keeping the tradition alive H1B changes aimed at curtailing efforts to game the lottery system Photo of the day: Inconsolable ",
    "datetime": null,
    "url": "https://www.forbesindia.com/article/lifes/salmon-sperm-is-the-new-antiageing-ingredient-kbeauty-cant-get-enough-of/79879/1"
}