{
    "title": "Salmon Sperm: Skincare's Next K-Beauty Craze?",
    "text": "According to consumer data analyst Spate, salmon sperm DNA is gaining traction in the South Korean skincare market, perhaps pointing to a fishy new arrival on the beauty scene. By now, it's no secret that K-beauty trends tend to trickle down — or rather, West — to the United States. Buzzy ingredients such as snail mucin, rice, and centella asiatica (also known as \"cica\") all got their start as K-beauty favorites, eventually catching on among Western audiences. As interest in salmon sperm DNA grows in South Korea, stateside skincare fanatics might follow suit. Before you wrinkle your nose in disgust, we're not suggesting you wash your face in fresh salmon sperm. According to a recent explainer, skincare brands are using DNA harvested from salmon sperm, an additive that typically shows up on ingredient labels as Sodium DNA, HP DNA, or PDRN. The ingredient is said to help increase cell turnover, a process that helps maintain skin elasticity and aids in wound healing. While studies on the clinical uses of the ingredient appear promising, there's still not enough research to conclude that salmon sperm DNA is an effective skincare ingredient. Still, several companies tout the cosmetic power of the salmon. Rejuran Skin Healer, an injectable treatment for skin rejuvenation has been available in South Korea for several years (the search term \"Rejuran Healer\" currently boasts over 19 million views on TikTok). Shangpree, a skincare line and Seoul-based spa, offers salmon sperm supplements. KAHI, another Korean skincare brand, sells an entire salmon-powered routine including a \"Wrinkle Bounce\" cleanser, moisturizer, and multi-use balm. As Finding Nemo once taught us: fish are friends, not food! Now, our slimy pals might also be the secret to glowing skin. Titelmedia (Highsnobiety), is committed to facilitating and improving the accessibility and usability of its Website, www.highsnobiety.com. Titelmedia strives to ensure that its Website services and content are accessible to persons with disabilities including users of screen reader technology. To accomplish this, Titelmedia has engaged UsableNet Inc, a leading web accessibility consultant to help test, remediate and maintain our Website in-line with the Web Content Accessibility Guidelines (WCAG), which also bring the Website into conformance with the Americans with Disabilities Act of 1990. Please be aware that our efforts to maintain accessibility and usability are ongoing. While we strive to make the Website as accessible as possible some issues can be encountered by different assistive technology as the range of assistive technology is wide and varied. If, at any time, you have specific questions or concerns about the accessibility of any particular webpage on this Website, please contact us at accessibility@highsnobiety.com, +49 (0)30 235 908 500. If you do encounter an accessibility issue, please be sure to specify the web page and nature of the issue in your email and/or phone call, and we will make all reasonable efforts to make that page or the information contained therein accessible for you. ",
    "datetime": "2022-10-28T16:32:28+00:00",
    "url": "https://www.highsnobiety.com/p/salmon-sperm-skincare-trend/"
}