{
    "title": "Scarlett Johansson Is Launching A Beauty Line",
    "text": "Coming to your homes in 2022. The latest in a long line of celebrity-founded beauty lines is none other than ScarJo! The Marvel actress revealed that her new beauty line, which is slated to launch sometime in early 2022, is her take on \"a clean, accessible approach to beauty.\" While there's no info yet on what kinds of products Johansson is working on, the funding for her line comes from The Najafi Companies, which also work with Tracee Ellis Ross' Pattern Beauty haircare line, and Moon Oral Care, which is partnered with model Kendall Jenner. Johansson's partner in this venture, Kate Foster, has worked with Victoria's Secret Beauty and Juicy Couture in the past. ScarJo is no stranger to beauty brands as the actress has been the face of L'Oréal Paris, both makeup and hair, for years now. So will Johansson's first-ever independent beauty brand be giving us products to mimic her glowing skin or her must-haves for her tousled locks? Maybe the key to her shining smile? Only time will tell! For now, we can all get excited about her upcoming next act, a solo Marvel movie Black Widow, set to hit theaters July 9th. Maybe the action star will give us a sneak peek of her upcoming beauty brand in the film. Superhero with a side gig that happens to be beauty? Sounds like a great plot point for Black Window 2. Tatjana Freund is Hearst's Fashion & Luxury Commerce Editor, covering beauty, fashion and more across multiple brands. Previously, she worked at ELLE.com and Marie Claire. She's a fan of whiskey neat, podcasts that give her nightmares, and one time Zoë Kravitz laughed at a joke she made. Simple Nail Designs for Your Manicure Mood Board 14 Vanilla Perfumes That Smell Absolutely Amazing 13 Best Japanese Skin Care Products to Shop For Breast Cancer, 40 Is the New 50 Meet YSL Beauty’s Most Unconventional Scent Yet Amazon Is Having a Major Beauty Sale Right Now Why Matrix Could Be the Next Best Skin Treatment The Best Neutral Nail Colors for Every Skin Tone Claudia Sulewski Launches CYKLAR Beyoncé Is Finally Releasing a Perfume A No-Damage Routine for Colored Hair First Class Beauty 2023 A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2021-06-28T15:54:00Z",
    "url": "https://www.elle.com/beauty/a36864951/scarlett-johansson-beauty-line/"
}