{
    "title": "Schwanen Garten Is The New K-Beauty Skincare Brand Centered Around Antioxidants & Immunity",
    "text": "(Beauty)  In the near-bottomless category of K-beauty, brands survive by being really good at one thing: For Peach & Lily, it's glass skin; for Skinfood and Glow Recipe, it's creating cosmetics out of fruits and veggies. For the new Seoul-born skincare brand Schwanen Garten, antioxidants are king. Now, any true K-beauty obsessive would look at their well-stocked collection of green tea-spiked cleansers, toners, serums, etc., and rightly side eye a claim that antioxidants are, by any means, groundbreaking. But here's the difference between Schwanen Garten and other labels: Its founders have been doing the work for two decades. Their 20 years of research on self-immunity started after Suan Hwang's mother died of cancer. Hwang and partner Sung Hyun Kim began exploring the benefits of antioxidants and their anti-inflammatory properties as a means of potential disease prevention, with no initial plans of breaking into the beauty industry. \"Our initial mission was to use our formula in antioxidant supplements,\" Hwang told The Zoe Report. \"When we first began our research, we focused on the body and the powerful effects of antioxidants in strengthening our immunity, but a fortuitous experience at a beauty industry event opened our eyes to something new and convinced us to pivot our vision to skincare products.\" What culminated was a clean, sustainable, decidedly chic, antioxidant-touting range by the name of Swan's Garden, in English, inspired by the \"transformational journey of self-acceptance and innate beauty\" demonstrated in Hans Christian Andersen's fairytale, The Ugly Duckling. The brand debuted its inaugural six-piece range, all $20 to $52, on Sept. 16. Included is a cleanser featuring lichen and a gentle, biodegradable surfactant, a lavender- and centella asiatica extract-spiked hydrating mist, a green tea serum, a botanical-packed face oil, and a smoothing and brightening eye cream. These are what Hwang describes as skin \"must-haves,\" but according to her, the brand's hero product is the ampoule (but of course — it's K-beauty). The $52 Antioxidant Ampoule is a combination of extracts from larix sibirica wood, birch bark, and licorice root, which together combat free radicals and act as a booster for serums and creams. All products within the range are free of parabens, sulfates, phthalates, silicone, mineral oil, PEG, alcohol, colorants, GMOs, and fragrances, and they're packaged up in minimalistic Forest Stewardship Council-certified paper for optimal recyclability. Next up, Schwanen Garten plans to launch daytime and nighttime moisturizers with its proprietary Antioxidant Source complex (containing 16 key ingredients), Hwang says, so keep an eye on the K-beauty newcomer at SchwanenGarten.com. A few of the first drops from the brand, ahead. We only include products that have been independently selected by The Zoe Report's editorial team. However, we may receive a portion of sales if you purchase a product through a link in this article. ",
    "datetime": null,
    "url": "https://www.thezoereport.com/p/schwanen-garten-is-the-new-k-beauty-skincare-brand-centered-around-antioxidants-immunity-33867177"
}