{
    "title": "Score Great Deals at the Soko Glam Best of K-Beauty Sale!",
    "text": "We love these products, and we hope you do too. E! has affiliate relationships, so we may get a small share of the revenue from your purchases. Items are sold by the retailer, not E!. Skincare fans, this one's for you: Soko Glam just revealed their 2020 Best of K-Beauty Winners, and you can shop them all at 15% off for a limited time! As shared on the content site The Klog, the Soko Glam Best of K-Beauty Awards were launched to recognize the most efficacious and curated products that helped others to transform their skincare routines. This year's winners went through a two-fold voting process, with the Soko Glam community voting first, then a panel of industry leaders helped select the final list of 10 winners. Judges included Em Cosmetics founder Michelle Phan, Very Good Light founder David Yi, and Wander Beauty CEO Divya Gugnani, among others. With the final list voted on and determined by the guest judges, the end result is a collection of 10 skincare must-haves that'll help you look luminous... and you can get 15% off anything on the 2020 winner's list by entering code ELITE15 at checkout! And we do mean anything. It doesn't matter if you want Neogen's Real Ferment Micro Essence to give yourself glowing, supple \"honey skin,\" or Good (Skin) Days C's The Day Serum, a concentrated, stable vitamin C serum that diminishes dullness and improves tone. Add 'em to cart, enter the code ELITE15, and poof! You get 15% off your order. And if you decide you want more, like the cult favorite Some By Mi AHA-BHA-PHA 30Days Miracle Toner, designed to effectively boost cell turnover and keep skin smooth and healthy, you can get 15% off that, too! (Just act fast, 'cause a bottle of that multi-tasking toner is sold every three seconds, so it might sell out!) But remember: this deal doesn't last forever. So make sure you shop Soko Glam's 2020 Best of K-Beauty Winners now, and get your 15% off with code ELITE15! Meanwhile, Grove Collaborative just launched a new line of plastic-free and totally sustainable cleaning products to help you freshen up your home, so make sure you check them out! And if you'd like deals delivered directly to your in-box, sign up for the Shop With E! Newsletter! Your source for entertainment news, celebrities, celeb news, and ​celebrity gossip. Check out the hottest fashion, photos, movies and TV shows! © 2023 E! Entertainment Television, LLC A Division of NBCUniversal. All rights reserved. ",
    "datetime": "2020-10-08T10:00:00.000Z",
    "url": "https://www.eonline.com/news/1196011/score-great-deals-at-the-soko-glam-best-of-k-beauty-sale"
}