{
    "title": "Second Gen Korean-American Starts eCommerce Site For High-End Korean Fashion, Beauty",
    "text": "Searching for your content... In-Language News Contact Us 888-776-0942\n\nfrom 8 AM - 10 PM ET News provided by 08 Dec, 2016, 08:40 ET Share this article LOS ANGELES, Dec. 8, 2016 /PRNewswire/ -- When someone mentions Korean fashion, 9 times out of 10 they're referring to Seoul, South Korea's eye-catching street fashion scene. Photo - http://photos.prnewswire.com/prnh/20161207/446838 Logo - http://photos.prnewswire.com/prnh/20161207/446840LOGO  Chances are, most people don't know much about Korean fashion, or \"K-fashion\" as it is better known. Most of K-fashion's self-professed admirers are either fashion insiders or roaming photographers who have taken an interest in capturing portraits of the hip, the bold, and the edgy of Seoul's bustling streets. And then, there's the cult-like following of Hallyu. Hallyu, or \"The Korean Wave,\" is the rise of worldwide interest in Korean entertainment which spans pop music, TV dramas, and movies since the 1990s. In recent years, popular Korean celebrities have held concerts and fan meetings in cities like Jakarta, Buenos Aires, and New York. Korean beauty products, or \"K-Beauty\", have similarly been gaining popularity not only for their proven skincare benefits, but also for their bizarre ingredients. Snail secretion under-eye patches, donkey's milk sheet masks, and salmon egg night creams aren't even the most eccentric and yet can be seen in many K-beauty product assortments. However, despite The Korean Wave of K-pop celebrities, unusual masks, and bold street fashion, the complexities of Korea's fashion industry have largely been overlooked, namely its higher-end brands. Sonia Kim, a second-generation Korean-American and the founder of Stylebyseoul.com, hopes to bring more attention to Korea's high-end fashion that offers a fresh take on individual style and an undeniable commitment to quality that rivals that of Europe's iconic fashion houses. \"Korean culture has always been a strong presence in my life. As a Second-Gen Korean-American, I grew up watching Korean dramas with my family and used Korean skincare products from an early age,\" said Kim. \"But, it wasn't until I had a career in fashion and started traveling to Seoul frequently that I noticed how neglected Korea's domestic high-end brands were internationally, given how competitive they are both in terms of style and quality.\" Stylebyseoul.com will offer a collection of one of a kind clothing, accessories, as well as beauty products for both women and men personally curated by Kim's American sensibilities and near decade-long fashion retail experience. \"The secret really is that Koreans are addicted to trends. Addicted! And so, Korean designers are constantly innovating in order to stay relevant in the market, resulting in clothing and accessories that quite frankly push the boundaries of fashion and style and inevitably end up in other markets long after Koreans have moved on to another trend,\" said Kim. Working with both established Korean brands and emerging designers, Kim envisions Stylebyseoul.com to be a platform for up-and-coming Korean designers to grow and develop their businesses. \"As a female entrepreneur who has had to face her own fair share of hurdles, I understand better than anyone the obstacles one can face in making their dream into a reality,\" said Kim. Serving as both an eCommerce site and a wholesale showroom, Stylebyseoul.com will also offer marketing services to Korean brands looking to re-brand themselves for the U.S. and international markets. Stylebyseoul.com launches in the new year on January 8, 2017. Media Contact:      Paul Kim[email protected]   213-590-8372 SOURCE Stylebyseoul.com http://Stylebyseoul.com Sign up to get PRN’s top stories and curated news delivered to your inbox weekly!  ",
    "datetime": null,
    "url": "https://www.prnewswire.com/news-releases/second-gen-korean-american-starts-ecommerce-site-for-high-end-korean-fashion-beauty-300375207.html"
}