{
    "title": "Senators ask: Are colleges ready for K to 12?",
    "text": " SUMMARY This is AI generated summarization, which may have errors. For context, always refer to the full article.  MANILA, Philippines – With only 3 years left before schools open their doors to the first batch of senior high school students, senators are worried “no one really knows exactly what’s going on” when it comes to the K to 12 program. At a budget hearing at the Senate on Monday, October 14, Commission on Higher Education (CHED) chair Patricia Licuanan said even higher education institutions (HEIs) will have to find solutions to K to 12 challenges. “We have various technical working groups and task forces [tasked] to think of how to mitigate the [temporary] negative impact of a truly positive reform,” she added. (READ: CHED to colleges: Rethink business model) But members of the Senate finance committee present were surprised to hear that part of the plan is for some colleges to absorb grade 11 students come 2016. (INFOGRAPHIC: 10 things about K to 12) “I need to put on record because the committee on education budget hearing was conducted by a different chair….and none of this was discussed, which I feel is not very responsible because if it is an option, we should know,” Senator Pia Cayetano said. She said it’s either she stepped out of the room during the Department of Education (DepEd) budget hearing, the senators were misled, or “there’s just total confusion and no one really knows exactly what’s going on.” “DepEd was always just assuring us everything is in place pretty much,” Cayetano added. Senator Edgardo “Sonny” Angara defended DepEd but admitted a definite roadmap must already be in place at this stage of preparations for 2016. “To be fair to DepEd, they had estimates of how much budget would be needed [during the debates on the K to 12 bill]…and came up with the high and low estimates of enrollment absorption in grade 11.” He said the absorptive capacity of HEIs, especially the infrastructure, must already be at the top of the agenda and not just something that is still in the works. Whose budget is it? But while anything K to 12 is mainly a DepEd issue, whether or not private and public HEIs can absorb the influx of students is “a big burden” for CHED. Cayetano said senators cannot assist the commission by way of providing a proper budget if CHED itself does not have a specific plan for it. “Tama yung sinabi ni Senator Pia–walang budget ‘to. ‘Di pwedeng iwan yan kasi hindi mangyayari yan by itself. ‘Pag ‘di natin nilagyan ng pera yan, ‘di mangyayari yan,” Angara agreed. (What Senator Pia said is right–this has no budget. You can’t leave that alone because it will not materialize by itself. If you don’t put money into it, it will not materialize.) For now, the money for it will come tentatively from DepEd, Licuanan said. Teacher-training Meanwhile, Cayetano lamented the decrease in the budget of the Philippine Normal University (PNU), especially at a time when more teachers will be needed for senior high school. “We are in the period of introducing a hugely very new concept, the K to 12, and we will need to teach so many thousands of teachers for this two additional years and specializing in many different tracks, and the budget of the university that’s training the teachers is going down? I do not understand,” she asked Licuanan. But Licuanan clarified the PNU budget presented in the hearing does not yet include the university’s allocation from the P2.5 billion lump sum for capital outlays. (READ: Pork barrel for CHED?) If their proposal – already with the Department of Budget and Management (DBM) – is approved, PNU will get an 18% increase from the lump sum. At the end of the hearing, the committee only approved the 2014 proposed budget of Luzon state universities and colleges (SUCs). CHED will return to the Senate during the hearing for Visayas and Mindanao SUCs on October 21, hopefully to present the itemized lump sum already approved by DBM. – Rappler.com Error. Please abide by Rappler's commenting guidelines. There are no comments yet. Add your comment to start the conversation. JOIN OUR NEWSLETTER Fearless reporting delivered to you follow us    ",
    "datetime": "2013-10-15T00:00:22+00:00",
    "url": "https://www.rappler.com/nation/41366-senate-budget-hearing-ched-sucs/"
}