{
    "title": "Seoul Unniedeul aims to make ‘Star Secret Korea’ the No. 1 K-beauty brand content platform in Myanmar - KoreaTechDesk | Korean Startup and Technology News",
    "text": "KoreaTechDesk | Korean Startup and Technology News Thu, October 26, 2023 Sign in Seoul Unniedeul's Star Secret Korea in Myanmar Korean startup Seoul Unniedeul has been growing by converging with K-content and K-beauty and has found a thriving market in Myanmar. It has entered the Myanmar market among Southeast Asian countries and is planning to grow into the No. 1 K-Beauty content platform in the Myanmar market. The K-Beauty content platform Star Secret Korea has over 1.05 million Facebook followers and is Myanmar’s number one K-beauty content commerce platform. The startup operates Star Secret Korea (SSK) platform, which connects K-beauty content and commerce in Myanmar. It provides beauty-specialized content such as reviews, brands and product introductions written by editors, as well as news of star beauty tips and Hallyu. It helps them purchase products suitable for them. Seoul Unniedeul plans to enter Indonesia and Singapore by producing K-beauty & style tourism-related content to introduce Korean tourist attractions. Star Secret Korea’s platform followers can enjoy beauty content curated by professional Korean beauty editors and purchase products through 1:1 consultation. The company’s target audience is young women in their 20s and 30s, seeing an overwhelming response. The average number of views per beauty content in Star Secret Korea is over 800,000. Over 40 high-quality K-beauty brands can be found on Star Secret Korea’s commerce platform. The platform has generated more than 3000 different video content and is growing. Seoul Unniedeul works on the brands’ behalf by handling FDA issuance and export and marketing licenses needed to enter the Myanmar market. Grand event to promote K-Beauty in Yangon Seoul Unniedeul is launching a grand event for its Myanmar customers on October 1 at the Timecity Mall main event hall in Yangon on October 1. The K-Beauty brand platform has engaged local influencers and buyers in Myanmar for the event. Brands such as Haruharuwonder, Mixsoon, SAM’U, Nowter, VERTTY, ETUDE, and Radimery will be introduced to consumers. Seoul Unniedeul was selected as a participant in the Seoul Beauty Tech business in Myanmar for the event. This event will allow locals to meet Korea’s leading beauty brands in Myanmar, which they have only encountered through the content platform. A total of 15 beauty tech companies and 15 beauty brands are participating in the event. Seoul Unniedeul also wants to translate K-Beauty content into English and promote them on various media platforms such as Facebook, Youtube and TikTok to other major language markets.   Subscribe and be informed first hand about actual Korean startup news. All the day’s headlines and highlights, direct to you every morning. Subscribe and be informed first hand about actual Korean startup news. All the day’s headlines and highlights, direct to you every morning. © 2023 Koreantech News & Media Korea Zrt. All rights reserved. You can see how this popup was set up in our step-by-step guide: https://wppopupmaker.com/guides/auto-opening-announcement-popups/ You can see how this popup was set up in our step-by-step guide: https://wppopupmaker.com/guides/auto-opening-announcement-popups/ dgdfgfdgdf Enter the destination URL Or link to existing content ",
    "datetime": "2022-09-14T15:29:12+00:00",
    "url": "https://www.koreatechdesk.com/seoul-unniedeul-aims-to-make-star-secret-korea-the-no-1-k-beauty-brand-content-platform-in-myanmar/"
}