{
    "title": "Sephora Gets Ready to Launch New K-Beauty Brand for Gen-Z - Slice",
    "text": "Follow Us With most people’s makeup bags collecting dust in a cupboard, Sephora has leapt on the opportunity to create a new skincare line — this one for Gen Z. The line will be a K-beauty brand in collaboration with MBX (formerly known as Memebox), as a follow-up to their 2018 success, Kaja. The new brand, OTZI (pronounced oat-zi), will launch Dec. 16 with five products including a makeup removing cleanser, brightening serum, resurfacing serum, gel moisturizer, and pore treatment mask. Gen Z is all about ingredients, so the line will have to come correct in this department. There hasn’t been much news on the ingredient list, but we do know that the moisturizer will contain hyaluronic acid and at least one serum will contain brightening elements like ginseng berry and mulberry extract. Related: 10 natural solutions for dry winter skin.The name OTZI is a rearrangement of a Korean word which translates roughly to the word ‘us’ (or sometimes ‘mine’). It hints at the inclusive nature of the brand which can be seen in the gender-neutral packaging. “We believe that skin care isn’t just meant to be a one-dimensional experience for a certain type of humxn.” they wrote on their Instagram. To appeal to Gen Z, they also boast being eco-conscious, vegan, cruelty-free, and certified Clean at Sephora. Whether you’re a K-Beauty fan or just craving something new in your skincare routine that you’re going to feel good about, OTZI might be for you.Related: Beauty gift sets your loved ones will actually want. The new brand, OTZI (pronounced oat-zi), will launch Dec. 16 with five products including a makeup removing cleanser, brightening serum, resurfacing serum, gel moisturizer, and pore treatment mask. Gen Z is all about ingredients, so the line will have to come correct in this department. There hasn’t been much news on the ingredient list, but we do know that the moisturizer will contain hyaluronic acid and at least one serum will contain brightening elements like ginseng berry and mulberry extract. Related: 10 natural solutions for dry winter skin. The name OTZI is a rearrangement of a Korean word which translates roughly to the word ‘us’ (or sometimes ‘mine’). It hints at the inclusive nature of the brand which can be seen in the gender-neutral packaging. “We believe that skin care isn’t just meant to be a one-dimensional experience for a certain type of humxn.” they wrote on their Instagram. To appeal to Gen Z, they also boast being eco-conscious, vegan, cruelty-free, and certified Clean at Sephora. Whether you’re a K-Beauty fan or just craving something new in your skincare routine that you’re going to feel good about, OTZI might be for you. Related: Beauty gift sets your loved ones will actually want. © 2023\n\t\t\tCorus Entertainment Inc. All rights reserved. Corus Television.  Remember me for 30 days. This device is not shared with anyone under the age of 19. ",
    "datetime": "2020-12-11T16:46:14+00:00",
    "url": "https://www.slice.ca/sephora-gets-ready-to-launch-new-k-beauty-brand-for-gen-z/"
}