{
    "title": "Sephora's New Social Shopping Platform - The Beauty Board",
    "text": "Every item on this page was chosen by an ELLE editor. We may earn commission on some of the items you choose to buy. If you love all things beauty on Pinterest, chances are you've encountered the infuriating situation in which you love a makeup look but have no inkling as to which exact products are needed to recreate it. Leave it to Sephora to give us a solution to that issue. The cosmetics retailing giant launched Beauty Board this morning, a new Pinterest-esque social platform that allows users to upload pictures of their own makeup looks—with the option to shop the look. In other words, if you really love how a shade of eyeshadow looks on a user, you can immediately add the exact product to your virtual shopping cart. And on the flipside, if you've been thinking about a product or color but aren't sure what it really looks like, you don't have to rely on picture reviews (or Google)—just search the Beauty Board, and you'll have your answer (and inspiration!) in no time. Users who've uploaded the looks can leave product reviews as well. Of course, it's not just a tool for gawking at pics—users can \"like\" a look or leave comments. So if you're wondering how well you're pulling off that orange lipstick, just snap a picture, upload to The Beauty Board, and get instant global feedback. In a way, it's like Sephora just gave its customers the opportunity to all be beauty bloggers. Maybe you'll log on just to post a review, and end up inspiring thousands of people to try your look. Who knows? Images: Courtesy of Sephora Related: 13 Beauty Trends that Ruled the Spring Runways Related: How to Wear the Best Beauty Trends from the Runways Simple Nail Designs for Your Manicure Mood Board 14 Vanilla Perfumes That Smell Absolutely Amazing 13 Best Japanese Skin Care Products to Shop For Breast Cancer, 40 Is the New 50 Meet YSL Beauty’s Most Unconventional Scent Yet Amazon Is Having a Major Beauty Sale Right Now Why Matrix Could Be the Next Best Skin Treatment The Best Neutral Nail Colors for Every Skin Tone Claudia Sulewski Launches CYKLAR Beyoncé Is Finally Releasing a Perfume A No-Damage Routine for Colored Hair First Class Beauty 2023 A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2014-03-13T10:30:00Z",
    "url": "https://www.elle.com/beauty/news/a19096/sephora-beauty-board/"
}