{
    "title": "SHINee on ‘Dream Girl,’ MJ Comparisons and K-Pop Globalization: Exclusive – Billboard",
    "text": "Boy band SHINee are celebrating five years on the K-pop scene and sat down with Billboard to talk about their latest music and plans for the future. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin As is the case with labelmates Girls’ Generation and TVXQ!, there is always a huge amount of hype whenever SM Entertainment returns with one of their artists. There was no exception when five-member boy band SHINee — who have proven themselves as Korea’s five mini Michael Jacksons with their harmonies recalling The Jackson 5 — returned last month. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news The release of their latest album “Chapter 1. ‘Dream Girl-The Misconceptions of You'” marks almost five years in the business — a length sometimes considered the expiration date for K-pop idols. But with this latest album, SHINee confirms they are more than just a flashy idol group with a catchy single here and there. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t03/12/2013 The 2011 mini-album “Sherlock” indicated the path with seven solid tracks even though two of them (“Clue” and “Note”) were combined for a hybrid remix that was lead single “Sherlock” that peaked at No. 3 on the K-Pop Hot 100. On their latest album, the first part in a two-disc collection, SHINee crafted nine even stronger tracks to push themselves into album artist territory. The lead single, “Dream Girl,” is a safe, enjoyable mainstream single and, unexpectedly, brings them back to the top of the charts; this week at No. 4 on the K-Pop Hot 100. But the album is a triumph that never lacks in energy and balances nods to 80s pop stars and forward-thinking pop. Songs like “Punch Love Drunk” and “Aside” sonically recall the sounds of Michael Jackson and Lionel Richie, respectively. While tracks like “Beautiful” and “Runaway” combine unique electronic production elements over sugary boy band harmonies to create year-round pop music. SHINee took time to chat about their new album and entering a fifth year in the industry at Billboard Korea’s studios. Check out the exclusive video interview and Q&A session below.   Tell us about the new album.With this album, we tried our best to put out music that really defined us. Although, we’re satisfied with the results, there are some parts that we feel like are still missing or lacking. [Our last EP] “Sherlock” was musically well made, but it was hard to sing along. The strength of [new single] “Dream Girl” is that it has metro vibes and it’s easy to follow. “Chapter 2” will be released soon. This year, we are going to be releasing a lot of our music. What drew you to “Dream Girl,” your latest single?We found “Dream Girl” after searching for a song that is relatable and easy sing along to. SHINee’s musical color was incorporated in it, as well. I think we were able to try out many new things with our careers, because of our fans support. We know that we can’t be afraid of new challenges or we won’t gain anything. Now, with almost five years in the industry, what do you feel is the biggest misconception about SHINee?Jonghyun: The misconception that the public has of us is that they think we are still teenagers. [Youngest member Taemin just turned 20] It’s a misconception that makes us feel good! [laughs]. Our fans think that we are still teenagers. The only negative thing about that is we have more pressure when trying out new endeavors. I hope we can somehow naturally break everyone’s conception of our boy-like image and age. But we are still enjoying it. We had our first club performance not too long ago, and the audiences seemed baffled. I think they thought we were too young to be at a club! Was SHINee influenced by any artists while working on this album? Your work has drawn comparisons to Michael Jackson and The Jackson 5’s work. Jonghyun: It’s not that we want to copy what he [Michael Jackson] does, but, rather, we wanted to pursue similar values and a similar musical path. NEXT: “The barriers to the worldwide music market are slowly breaking down”   Over the years, you’ve become synonymous with spot-on live performances. What’s the secret?Minho: Every time we prepare for our concerts or performances, we always go in with the mindset that we are lacking in something. We have this urge to be flawless on stage. I think people look at us in a positive light, because they can see and feel our efforts. What were some of the hardships you’ve endured in the last five years?Jonghyun: It is our job to get over our hardships and slumps. We rest when we are sick because, even if we wanted to, our bodies wouldn’t really function the way we want to. Now, our members are good at taking care of their health; we work more effectively. Are there overseas fans or concerts that particularly stand out in your memory?It’s hard to pick one specific fan or country, because there are too many we’ve visited. But every single concert and fan will forever be embedded in our memory. We haven’t been to South America yet. We would love to perform in South America one day.  Do you guys have any plans to crossover to the States?The barriers to the worldwide music market are slowly breaking down. It is now a generation where K-pop can be easily heard anywhere. K-pop doesn’t necessarily have to officially debut on an extravagant scale to be accessed or heard. We are promoting in Korea, but our fans outside of Korea get to see us through many outlets. If given a good opportunity, then we want to debut in the U.S. What are your favorite SHINee songs?Key: “Dream Girl” is great, but I think audiences enjoyed “Sherlock.” I think it’s because there are a lot of elements packed into one song.Taemin: I would like to recommend “After Putting On Makeup” off our 1st LP, “The SHINee World.” All of our albums are meaningful to us, but I have more attachment towards it because it is our first album.Jonghyun: I would like to recommend our ballad tracks, “I Can’t If It Isn’t You,” and “Arrow.” We never sang these songs on TV. Most people think we are a very performance-oriented group, but upon hearing these songs, people will realize we are a group that can do other genres like ballads.Onew: I want to recommend “Dynamite.” I had fun recording this song, because it’s such an exciting, refreshing track. My vocal range isn’t that high, but while recording this song, my voice opened up. Looking forward, what are SHINee’s goals?It is our goal to find our distinct musical colors as well as our individuality. This year, we are going to be showing and presenting a lot of our music…as well as many other things! Looking at your fellow members, what would you like to learn from one another?Jonghyun: I want to pull fancy dance moves like Taemin.Onew: I want to be able to dance well, too.Minho: I have a lower vocal range, so I would like to hit higher vocal pitches.Taemin: I envy Jonghyun’s technique and energy, Onew’s voice, Key’s rapping skills and Minho’s looks. SHINEE’s musical growth over the past five years is stunning. To get these results, how much research do you think the management put in and how much effort did SHINee put in?Taemin: The group is under a large agency, so we did get those benefits. However, each and every member has a strong will and is very ambitious. We practiced a lot.Onew: Our seniors from TVXQ! have been a huge inspiration to us.Key: We constantly practiced even after we debuted. We don’t just sing and dance, we act too. While working on this album, there were multiple times where we went into the studio when the sun rose and left only after the sun set.  Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2013-03-12T22:00:00+00:00",
    "url": "https://www.billboard.com/music/music-news/shinee-on-dream-girl-mj-comparisons-and-k-pop-globalization-1551342/"
}