{
    "title": "Shopping for K-beauty? Check out these new Korean beauty websites",
    "text": "Where to shop for Korean skincare in 2020? These new Korean beauty websites make sure your shopping bag is filled to the brim with the best of K-Beauty. If there’s one skincare need that doesn’t ever go out of style, it’s the fact that Indian women are obsessed with Korean skincare. The reason is multi-faceted – Korean skincare is known to be effective, created with high quality ingredients and the results are almost always instant. That, apart from the fact that they have a few innovative sheet masks and come with acids and serums that are jam-packed with anti-oxidants and exotic ingredients like snail mucin and green tea. We have already listed a few of our favourite mainstream websites that are delivering everything from popular labels like Cosrx to lessen-known (but powerful nonetheless) Wishtrend classics. 2020 though, saw a bigger draw in Korean skincare and with rising demand came in bigger brands and better delivery systems and so a new set of Korean beauty websites are now here to give you your daily dose of K-beauty. Here are the new Korean beauty websites for the best of Korean skincare that is 100% authentic and directly sourced from the brands or authorized distributors.  The website aims to bring together clean and natural Korean skincare solutions with labels like Cosrx, By Wishtrend and Rovectin. There are not too many labels to choose from but the options in the brands put up is interesting and the collections are pretty much perfect for Indian skincare needs. You can also DM them for a free skin consultation and they even help you create a personalised and bespoke skin regime. What to pick up: Rovectin Skin Essentials Activating Treatment Lotion, Rs 2,599  This new beauty retailer is not essentially only a Korean hotspot. It has a section of beautiful mainstream Korean buys with great discounts on and off. From popular ones like Innisfree, Laneige to Faceshop to new brands like Laluseed and Cosrx, there’s a lot to choose from. What to pick up: Laneige Lip Sleeping Mask, Rs 500  A relatively new label, we are very excited about this one because the website retails some really great labels like Some by Mi, Primera, Purito and more. The interface of the website is easy to navigate and the product range is varied and sorted according to skin concern too. So it’s easy for you to navigate the complicated world of K-Beauty with some help. What to pick up: Purito Comfy Water Sun Block, Rs 1,450  Started by skincare addict and popular South Indian playback singer and dubbing artiste, Chinmayi Sripada, this website caters to those looking for personally whetted products. Chinmayi is already known for her honest reviews, her penchant for finding great products online and her knowledge and one look at the website, you know your skin needs are met. Isle Of Skin prides on the fact that they have a collection of products that are carefully researched and fact-checked too. To top it off, there are fun tutorials and DIY skincare and self-care routines on the social handle that add to it’s charm. What to pick up: Dr. Ceuracle Tea Tree Purifine 95 Essence, Rs 2,150  A favourite with K-beauty addicts, this retailer has a wide range of brands and options to choose from and almost all of their products come with interesting ingredients and effective formulations. The most popular brands like Huxley, Rovectin, Neogen and Heimish and their newest fare is available, alongside subtler ones like Aromatica and Real Barrier. What to pick up: Cosrx Low pH Centella Cleansing Powder, Rs 1,797  Another well-known site that really caught us by surprise is Maccaron Beauty with a fun range of products ranging from brands like A by Bom, Goodall and Coony that are widely loved by A-List Korean influencers to niche brands like Accoje, Dewy Tree and Keep Cool – there’s a lot to choose from. The beauty experts at the e-tailer handpick each of the products and curate them with utmost care – and mostly, it’s the one stop shop for most Korean labels that come with result-driven products. What to pick up: A. by BOM Ultra botanic skin water, Rs 2,330  Just like the name, the website is filled with minimal beauty straight from Korea – the formulations and products are chosen and curated well. There are few interesting labels that caught our eye – Make P:rem and Klairs being the most popular from the lot. The e-tailer seems to be new and there is a limited range to work with but the pricing is affordable and perfect for Indian skin. What to pick up: Make P:Rem Safe Me. Relief Green Ampoule, Rs 1,890 Deputy Editor When she's not trying on a new serum, researching on yet another classic fragrance and sharing lip balms with her 5-year old daughter, Latha Sunadh keeps it reined in with a nice song and a good book. Special skills include obsessing over handmade, home-made and handcrafted luxuries. Yes, I agree to the Privacy Policy Follow our daily snapshots at @lifestyleasiaindia Yes, I agree to the Privacy Policy Subscribe to our newsletter to get the latest updates.  Thank you for your subscription. ",
    "datetime": "2020-07-22T13:25:11+00:00",
    "url": "https://www.lifestyleasia.com/ind/beauty-grooming/skin/new-and-exciting-places-to-shop-korean-skincare-in-2020/"
}