{
    "title": "Shu Uemura x Kye brings Seoul’s K-pop style to a colourful new makeup collaboration - Premium Beauty News",
    "text": "After being announced in February, Japanese brand Shu Uemura’s makeup collaboration with South Korean fashion design Kathleen Kye, a haute-couture streetwear specialist, has given fans a glimpse of what’s to come, both in terms of products and packaging design. The range will be available from the end of May in selected retail outlets. Just like her own fashion collections, Kathleen Kye’s packaging nods to the Korean lifestyle and, above all, to K-pop style. Graphic motifs include sunglasses, a hibiscus flower - Korea’s national flower - a plastic coffee cup, headphones and a symbol showing \"5:10am,\" the first train of the day’s departure time. With its Korean street style inspirations, the collection features 24 limited-edition products, including revisited Shu Uemura classics and new products created exclusively for the K-pop collaboration. Eyebrows — neatly shaped but always bold — hold a central place in the K-pop look. The Shu Uemura x Kye collection includes three products dedicated entirely to eyebrows, with the \"brow:palette\" landing in a new set of kooky colours (cappuccino x dark rose), plus the \"brow:sword\" eyebrow pencil and the \"eyebrow manicure\" coloured brow mascara, both available in new shades (dark rose and dark violet). And since no K-pop look would be complete without a bold stroke of eyeliner, the brand’s \"drawing pencil\" is available in white, blue, black or pink, packaged in the colorful patterns of Kathleen Kye’s creation. The collection also includes two products for the face — \"cushion blanc:chroma\" foundation and \"blush cushion\" blusher — as well as \"sheer color balm\" lip balm. Two of the brand’s iconic cleansing oils — \"ultime8 sublime beauty cleansing oil\" and \"POREfinist anti-shine fresh cleansing oil\" — have also been given the Kathleen Kye treatment. All products in the collection are proposed in eye-catching shades (with the exception of the oils) and come in the designer’s quirky packaging. The annual premium and luxury packaging trade show broke its attendance record for its 2023 edition, which was held... The expression “Beauty Tech & Skincare” now marks the entry of tech into the beauty sector. Several major brands offer to decode the... The quest for youth has existed for centuries, despite the inevitable effects of time on the body. Research shows that skin aging in... The quest for “in-and-out” beauty is gradually gaining ground in Europe, North America, and Brazil. This form of holistic beauty is meant... © 2023 Premium Beauty Media ",
    "datetime": null,
    "url": "https://www.premiumbeautynews.com/en/shu-uemura-x-kye-brings-seoul-s-k,9631"
}