{
    "title": "\n \n \n Signal-noise-K-beauty-boom\n \n",
    "text": "This site uses cookies to enhance your user experience. By continuing to use this site you are agreeing to our COOKIE POLICY. ERROR 1 ERROR 1 ERROR 2 ERROR 2 ERROR 2 ERROR 2 ERROR 2 Password and Confirm password must match. If you have an ACS member number, please enter it here so we can link this account to your membership. (optional) ERROR 2 ACS values your privacy. By submitting your information, you are gaining access to C&EN and subscribing to our weekly newsletter. We use the information you provide to make your reading experience better, and we will never sell your data to third party members. Already have an ACS ID? Log in here   Already an ACS Member?\n               Log in here $0 Community Associate ACS’s Basic Package keeps you connected with C&EN and ACS. $80 Regular Members ACS’s Standard Package lets you stay up to date with C&EN, stay active in ACS, and save. $160 Regular Members & Society Affiliates\n$55 Graduate Students\n$25 Undergraduate Students ACS’s Premium Package gives you full access to C&EN and everything the ACS Community has to offer. Your account has been created successfully, and a confirmation email is on the way. Your username is now your ACS ID. Most Popular in Analytical Chemistry\n\n\nThirty years of DNA forensics: How DNA has revolutionized criminal investigations\n\n\nThe chemistry behind Leonardo da Vinci’s paintings\n\n\nBreaking down biomass with enzymes from an ant farm\n\n\nDuct tape can fix anything—even DNA sequencing experiments\n\n\nFingerprints are more than just patterns; they’re chemical identities  Long popular in South Korea, “BB creams”—trendy, all-in-one products meant to replace serum, moisturizer, primer, foundation, and sunblock—are now a fixture of drugstore shelves in Asia and the rest of the world. An analysis by CAS, a division of the American Chemical Society, reveals the intellectual property behind the explosion of this and other “K-beauty” products, which are a growing component of the more than $110 billion global skin care market. On a per capita basis during 2010–15, South Korea’s patenting in these areas was twice that of Japan, three times that of France, and five times that of the U.S. Article:  This article has been sent to the following recipient:  Contact the reporter Submit a Letter to the Editor for publication Engage with us on Twitter Already have an ACS ID? \n                                    Log in Sign up for C&EN's must-read weekly newsletter Copyright © 2023 American Chemical Society. All Rights Reserved. ",
    "datetime": null,
    "url": "https://cen.acs.org/articles/94/i36/Signal-noise-K-beauty-boom.html"
}