{
    "title": "Singer Florence K credits relies on yoga to stay strong and connected to her daughter",
    "text": "    Singer-Songwriter Florence Khoriaty packs her yoga mat first when preparing for a trip. This article is over a year old, and the information within may be out of date. beach_yoga Montreal singer-songwriter Florence K with daughter Alice. Yoga helps the little girl \"in her ballet and gymnastics,” Khoriaty says. “Now she’s so good at it.”   Singer-Songwriter Florence Khoriaty packs her yoga mat first when preparing for a trip. And the Montréal artist has travelled regularly since she debuted her first CD at 21. Now 30, the prolific performer and single mother, known professionally as Florence K, has recently released her sixth studio album, I’m Leaving You.  Khoriaty credits yoga for helping her voice, helping her stay strong helping her make an extra connection with her 7-year-old daughter, Alice Rose. She doesn’t miss a day at her local yoga studio when she’s home. “If I’m not in town, I have my yoga mat and I practise wherever I can,” she says. “When I discovered yoga it opened a new door to me.” Two years ago, Khoriaty hit a low point after suffering a breakdown that made her stop everything. “I saw it coming,” she says. Years of hard work started taking a toll — she had recorded her second album while pregnant and hadn’t stopped touring since. “I was taking 20 planes a month,” she says. Then she split from her daughter’s father and the experience — coupled with the sudden shift to single motherhood — proved too much. “I couldn’t find myself anymore and I couldn’t function,” she says. “I could go seven nights without sleep. I couldn’t work, I couldn’t focus — I had no concentration at all.” And she had also stopped practising yoga earlier that year. Khoriaty’s breakdown lasted three months. “I was very well surrounded by my family, friends, my manager and my work team,” she says. “They gave me the time and space that I needed to get back on my feet.” She attended counselling with her daughter, to ensure Alice, then 5, understood what was happening. Once Khoriaty started eating and sleeping again, she returned to yoga, with an initial pledge to practise daily for one month. “I do it every day now, no matter what,” she says. Yoga has now become something mother and daughter do together. They sometimes do it spontaneously at the park or the beach. “It helps her a lot in her ballet and gymnastics,” Khoriaty says. “Now she’s so good at it.” Other lessons she learned from that bleak period include communication, organization, self-care and a positive outlook, she says. “Children listen and hear everything, so you want to live the best possible life,” Khoriaty says. “You want to be an example for your children. I’m her everything, so that means I have to take care of myself.” Khoriaty still travels frequently, but everything negative has changed. She hired a nanny for when she’s away. Wherever she is, she stays fully engaged with Alice. Sometimes they talk about when she was sick. “I want her to accept herself with everything, the highs, the lows, the great moments, the tougher moments,” she says. “And I want to give her the right tools to do that. “I feel like my giving her the gift of yoga, I am giving her a tool for life,” she says. Florence K performs at Toronto’s Jazz Bistro, at 251 Victoria St., on Dec. 3. The pay-what-you can show is a fundraiser for the Unison Benevolent Fund, which provides support to Canadian musicians. Anyone can read Conversations, but to contribute, you should be a registered Torstar account holder. If you do not yet have a Torstar account, you can create one now (it is free). To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation Save $85 with our best offer. Cancel Anytime. It means the world to us that you choose to read our brand of trusted news. And as long as you continue to do so, we’ll continue to show you we appreciate it. Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:       Sign up with  Thank you . Your account has been registered, and you are now logged in. Check your email for details. Invalid password or account does not exist Sign in with Submitting this form below will send a message to your email with a link to change your password. An email message containing instructions on how to reset your password has been sent to the email address listed on your account. No promotional rates found.    Secure & Encrypted Secure transaction.\nSecure transaction. Cancel anytime.  Thank you. Your gift purchase was successful!\nYour purchase was successful, and you are now logged in. You will also start receiving the Star’s free morning newsletter, First Up, soon. A receipt was sent to your email. ",
    "datetime": null,
    "url": "https://www.thestar.com/life/singer-florence-k-credits-relies-on-yoga-to-stay-strong-and-connected-to-her-daughter/article_03903aa8-679e-5fb0-83c8-515f34ca6f94.html"
}