{
    "title": "SISTAR’s Hyorin Earns 1st Solo, 6th Overall No. 1 on K-Pop Hot 100 – Billboard",
    "text": "A deeper look at the K-Pop Hot 100 featuring SISTAR's Hyorin, Kara, CNBLUE, 4men, SHINee and more. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin Crayon Pop’s viral hit “Bar Bar Bar” may have hoped to have “Gangnam Style”-like legs, but its two-week stint at No. 1 has been stopped by a singer from chart queens SISTAR. The group’s lead vocalist, Hyorin, has reached the top spot with a solo track recorded for the soundtrack accompanying popular South Korean drama show “Master’s Sun.” The piano ballad “Crazy of You” showcases the diva toning down her Mariah Carey-esque belting in favor of a hushed, whispery vocal approach. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t08/30/2013\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tExplore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news   The chart peak of “Crazy of You” marks a special accolade for Hyorin, who has now reached the summit of the K-Pop Hot 100 six times through her various projects: four times with her idol girl group SISTAR, once with the SISTAR splinter group SISTAR19 and now on her own. Remarkably, half of those No. 1s have come just this year, with Hyorin spending six weeks at the top, so far. With Hyorin snagging the No. 1 slot, that means Crayon Pop will have settle for No. 2. Just below them is EXO, whose single “Growl” grows even hotter, hitting a new peak of No. 3 after four weeks on the chart. Bumkey’s collaboraton with Dynamic Duo, “Attraction,” slips one spot to No. 4 after debuting a slot higher last week. Last weekend, Crayon Pop, EXO and Dynamic duo all performed in Los Angeles as a part of KCON 2013 and Mnet’s special L.A. taping of K-pop chart show “M COUNTDOWN.” Girl group Kara return to the K-Pop Hot 100 with a pre-release single, “Runaway.” The light rock track precedes their officially promoted single, “Damaged Lady,” coming Sept. 2. Fans last saw Kara on the K-Pop Hot 100 with synth-pop single “Pandora,” which peaked at No. 3 in summer 2012. The girls have actually found more chart success in Japan, earning two No. 1s on the Japan Hot 100 (“Electric Boy” and “Thank You Summer Love”) since that time.   The four-member rock band CNBLUE’s new track, “Feel Good” (released Aug. 23), debuts at No. 15 this week. As the title suggests, the single is an uplifting song with lyrics focused on the idea of freedom and fun. Member Jung Yong Hwa helped with production. The music video, where the boys perform and go camping, generated over 350,000 views since its Aug. 22 release. In other CNBLUE news, the quartet was selected as a representative band for Samsung’s 2013 Galaxy Music Project, a marketing program that was created to provide an innovative way for consumers to approach music through various mobile applications.  The ballad trio 4Men’s new soundtrack single, “I Love You I Love You I Love You,” for Korean drama “Empire Of Gold,” leaps to No. 16 from No. 52 this week. The heartbreaking ballad was written and composed by member Kim Young Jae and expresses a man’s regret at realizing his love for a woman too late. 4Men has released a slew of soundtrack hits, including “Reason,” “Only You” and “I Couldn’t.”  This week K-pop also makes it mark on Japan with idol group SHINee’s new Japanese single “Boys Meet U” at No. 2 on the Japan Hot 100. The high-energy pop track (that recalls the style of One Direction) marks the group’s highest Japanese chart showing since their debut single in the country, “Replay ‘Kimi Wa Boku No Everything,'” which hit No. 2 in July 2011.  Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2013-08-31T01:09:20+00:00",
    "url": "https://www.billboard.com/music/music-news/sistars-hyorin-earns-1st-solo-6th-overall-no-1-on-k-pop-hot-100-5679849/"
}