{
    "title": "Skincare coreana: consigli e prodotti k beauty per una pelle luminosa | Vogue Italia",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, visit My Profile, then View saved stories di Tish Weinstock Ispirazione skincare coreana per la routine estiva. Dal caldo che disidrata la pelle passando per i pori ostruiti a causa dell’umidità ai danni dei raggi UV: ecco qualche consiglio che davvero potrebbe esservi utile durante le vacanze a casa o in città. di Tish Weinstock Partiamo dalla base, cosa possiamo fare per proteggere la pelle in estate? Per scoprirlo, abbiamo chiesto alle maggiori esperte di beauty e skincare coreana i loro suggerimenti e trick collaudati. “Il caldo e l’umidità portano i pori a produrre più sebo e sudore. Di conseguenza, [in estate] la pelle può sembrare più grassa e sporca. Detto questo, è importante mantenere una skincare routine delicata, anche in fatto di detersione. In questo periodo dell’anno, la gente tende a lavareil viso in maniera eccessiva e a utilizzare detergenti troppi aggressivi impoverendo la struttura della pelle che diventa secca e, a volte, può persino produrre più sebo. “Utilizzare un detergente a pH basso è un modo delicato ma efficace di lavare via le impurità accumulate durante la giornata mantenendo allo stesso tempo un’epidermide sana. Nella K-beauty, la detersione costituisce lo step più importante e farla nella maniera corretta determinerà il buon esito della vostra routine estiva. Un suggerimento: lavorando su singole aree del volto per circa un minuto, usate i polpastrelli per massaggiare effettuando piccoli movimenti rotatori. “Io e mio marito adoriamo il detergente a basso pH 107 Chaga Jelly. Si risciacqua facilmente senza lasciare residui e la composizione a base di polvere di foglia di tè verde abbinata all’aceto stagionato promuove una delicata azione esfoliante”. This content can also be viewed on the site it originates from. “La crema solare è un must e va applicata ogni giorno, anche se rimanete in casa o uscite per soli pochi minuti. Personalmente amo Cosrx Aloe Soothing Sun Cream in quanto non lascia alcuna patina bianca, non appiccica ed è ottima da utilizzare sotto il make-up. Altro step essenziale: riapplicare lo schermo solare nell’arco del giorno più e più volte. Consiglio di passarlo sia sul collo che sulle mani e di includere anche un burro cacao con protezione SPF: queste sono le aree che la gente tende a dimenticare, ecco perché sono così importanti. Non dimenticate inoltre di indossareun cappello o un copricapo con visiera per proteggere il viso dal sole. di Alessandra Signorelli di Melisa Vargas di Julia Hobbs This content can also be viewed on the site it originates from. “In estate, mi piace usare prodotti rinfrescanti. A tale scopo, vi suggerisco di tenere la maschera in tessuto e i patch per gli occhi in frigorifero per un maggior effetto rinvigorente. Amo anche incorporare tool per massaggiare il viso (anche questi da tenere in frigo) come le sfere di ghiaccio Fraîcheur Paris. Il mio tool preferito è un roller ghiacciato da passare sopra la maschera in tessuto. “Consiglio anche di applicare prodotti idratanti dalla texture leggera: provate il tonico Keep Cool Soothe Bamboo e la crema Keep Cool Soothe Bamboo Lotion. Oppure, potete usare un’acqua in spray o tonici per il volto che mantengono la pelle leggera e rifrescata. Vi suggerisco Pyunkang Yul Mist Toner o Cosrx Centella Water Alcohol-Free Toner. Mi piace anche Benton Aloe Propolis Soothing Gel dall’azione refrigerante, lenitiva e calmante. È ottimo in caso di scottature. Se soffrite di acne, consiglio Dear Klairs Midnight Blue Calming Cream: rinfresca la pelle e agisce sui brufoli allo stesso tempo”. di Alessandra Signorelli di Melisa Vargas di Julia Hobbs This content can also be viewed on the site it originates from. “Il miglior consiglio per l’estate che vi possa dare è un mantra in 3 parti anche se in realtà è semplicissimo: Keep it cool, keep it simple and keep it calm (Rinfresca, semplifica e lenisci). Innanzitutto, per me, in estate, tutto ciò che viene dopo i vari detergenti va tenuto in frigorifero.Non c’è niente di più rinfrescante di una maschera in tessuto fredda. O di un patch per gli occhi in gel. Quando la mia pelle scotta, diventa anche rossa e sofferente quindi le vengo in soccorso con dei prodotti che la calmano e la dissetano. Ho una vera ossessione per gli spray ma, siccome ho la pelle secca, voglio che la face mist che scelgo non sia una semplice acqua. Farm Stay It’s Real Collagen Gel Mist è un po’ come una crema idratante in spray. La adoro! di Alessandra Signorelli di Melisa Vargas di Julia Hobbs “I mesi più caldi non sono il periodo adatto per usare esfolianti chimici. Una buona filosofia da seguire è: l’estate serve al mantenimento e l’inverno per i trattamenti. La protezione solare è sempre importante, ma ancora di più quando si trascorre tanto tempo all’aria aperta”. “La mia pelle trattiene molto calore e questa è una problematica con cui le estetiste della Shangpree Spa di Seoul mi hanno aiutata insegnandomi come trattarla. Joo-Eun Kim, la responsabile della Spa, mi ha spiegato che quando la pelle è calda devo utilizzare le mani per applicare i prodotti della mia skincare routine in quanto i dischetti di cotone e altri tool possonocausare ulteriore irritazione. Mi ha inoltre resa consapevole del fatto che la pelle secca e arrossata disperde l’idratazione più in fretta ed è quindi importante reidratarla con toner e maschere in tessuto rinfrescanti”. “Crescere in Corea significa osservare le nostre madri e nonne eseguire i propri rituali di bellezza ogni giorno. È loro abitudine massaggiare bucce di anguria fredda sulla schiena durante i mesi estivi più caldi. È in grado di lenire e guarire all’istante l’eritema solare: questo super frutto èdiventato quindi l’ispirazione per il nostro primo prodotto – la Watermelon Glow Sleeping Mask — e fa parte della nostra caratteristica formulazione Glow Recipe per ottenere un incarnato naturalmente luminoso. L’anguria è ricca d’acqua, di vitamine, aminoacidi e minerali anti-infiammatori che la rendono l’alleato ideale per idratare e lenire. This content can also be viewed on the site it originates from. di Alessandra Signorelli di Melisa Vargas di Julia Hobbs “Questa maschera è un trattamento dalla straordinaria azione calmante dopo una giornata al sole: si può utilizzare come ultimo step della propria routine serale come maschera da portare tutta la notte oppure sotto forma di trattamento da risciacquare dopo 10 minuti per una pelle immediatamente sana e florida. Oltre all’anguria, contiene acido ialuronico e AHA per esfoliare delicatamente e idratare – formulazione che la rende adatta a tutti i tipi di pelle. Amo metterla in frigorifero almeno 30 minuti prima dell’applicazione per un’azione ulteriormente rinfrescante. I nostri primi ricordi beauty guidano la ricerca in materia di innovazione, che poi immettiamo nella nostra Glow Recipe e ci ricordano l’efficacia degli ingredienti naturali. “Un altro suggerimento per contrastare i detriti tissutali della pelle durante l’estate è quello di utilizzare un trattamento viso all’argilla. Di norma le maschere all’argilla possono essere troppo aggressive per tutti i tipi di pelle, specialmente il tipo sensibile o secco. Per questo motivo, di recente, abbiamo lanciato il trattamento Watermelon Glow Hyaluronic Clay Pore-Tight Facial. La nostra argilla abbinata all’acido ialuronico elimina le cellule morte e attira le impurità mentre gli esfolianti chimici, gli enzimi dell’anguria e gli acidi BHA e PHA liberano i pori ostruiti. Assieme all’azione delicatamente esfoliante della polvere di semi di mirtillo, questo trattamento viso di 5 minuti promuove un incarnato più morbido, luminoso e pulito”. This content can also be viewed on the site it originates from. “L’anguria è un ingrediente lenitivo e calmante che mixa splendidamente tutta una serie di elementi attivi. Amiamo formulare prodotti che idratano, levigano e equilibrano la pelle grazie all’estratto di anguria, sfruttando e massimizzando le sue proprietà. di Alessandra Signorelli di Melisa Vargas di Julia Hobbs “Tre prodotti must-have per una pelle sana tutta l’estate sono: il tonico astringente Watermelon Glow PHA + BHA Pore-Tight Toner, le gocce illuminanti Watermelon Glow Niacinamide Dew Drops e il trattamento idratante Watermelon Glow Pink Juice Moisturizer.” This content can also be viewed on the site it originates from. di Alice Abbiadati di Alessandra Signorelli di Silvia Pisanu di Silvia Pisanu Scopri le ultime notizie Condé Nast Italia © EDIZIONI CONDÉ NAST S.P.A. - PIAZZA CADORNA 5 - 20121 MILANO CAP.SOC. 2.700.000 EURO I.V. C.F E P.IVA REG.IMPRESE TRIB. MILANO N. 00834980153 SOCIETÀ CON SOCIO UNICO ",
    "datetime": "2021-08-16T13:58:51.580Z",
    "url": "https://www.vogue.it/bellezza/article/skincare-coreana-prodotti-k-beauty-pelle-luminosa"
}