{
    "title": "Skin Inc. Announces Beauty and the Beast Serum | Teen Vogue",
    "text": "By Sophie Hirsh If you want your skin to glow like Emma Watson's in Disney's live-action remake of Beauty and the Beast, Skin Inc. has you covered. The brand is known for making some excellent serums, and they recently partnered with Disney to create a limited-edition, Beauty and the Beast version of their famous Get Glowin’ Serum Kit, called \"Disney's Beauty and the Beast Get Glowin' Serum.\" The company announced the collaboration on Instagram on Friday. \"Unveiling our much anticipated collaboration with Disney's Beauty and the Beast,\" Skin Inc. captioned a photo of the serum with a rose seemingly growing out of it. \"We celebrate this timeless story with the creation of an exquisite Limited Edition Disney's Beauty and the Beast Get Glowin' Serum, for all you modern heroines to take control of your skin and let your inner light shine. 6 more days to D-Day.\" The formula is reportedly a blend of three ingredients: plumping hyaluronic acid, brightening chlorella, and vitamin A, which work together to target dark circles and uneven skin tone. Skin Inc. first started teasing the special product several days ago with a sneak-peek video to Instagram that featured a bottle of serum surrounded by red rose petals. \"We have a top secret collab up our sleeves...do you know where this line comes from: 'She warned him not to be deceived by appearances, for beauty is found within.'?\" Skin Inc. wrote. The company followed it up with several hashtags, one of which was \"#taleasoldastime,\" making it pretty clear that something BATB-related was up their sleeves. The limited-edition kit will sell for $90 on Skin Inc.'s website starting March 15 — two days before the live-action film, starring Emma Watson, hits theaters. This content can also be viewed on the site it originates from. This content can also be viewed on the site it originates from. Related: These Beauty and the Beast Nail Polishes Will Make You Feel Like a Disney Princess By Sophie Hirsh By Alyssa Hardy By Karen Brill By Kara Nesvig More from Teen Vogue Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Teen Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "datetime": "2017-02-24T22:19:52.108Z",
    "url": "https://www.teenvogue.com/story/beauty-and-the-beast-collaborates-with-skin-inc-on-face-serum"
}