{
    "title": "Skin Garden's Point Makeup Products Popular as a Gift for Those Graduating from or Entering into a School | Business Wire",
    "text": "Skin Garden, a K-beauty cosmetics shop located in Shinjuku, Tokyo, is crowded with customers looking for gifts in the graduation and school entrance season. (Photo: Business Wire) Skin Garden, a K-beauty cosmetics shop located in Shinjuku, Tokyo, is crowded with customers looking for gifts in the graduation and school entrance season. (Photo: Business Wire)  TOKYO--(BUSINESS WIRE)--Skin Garden (http://www.skingarden.jp), \n      a K-beauty cosmetics shop located in Shinjuku, Tokyo, is crowded with \n      customers looking for gifts in the graduation and school entrance season.  From mid February, the graduation period, to April when entrance \n      ceremonies are held in schools, K-beauty cosmetic products are popular \n      as a gift item for those graduating from or entering school. For the college freshmen or those taking their first steps into the \n      “real world,” point makeup products to accentuate a single feature in \n      the face, such as lips, are popular rather than the overly fashionable \n      makeup. As a result of this trend, “Berrisom Angle Lip Tattoo” is very \n      popular in Skin Garden as a gift for people graduating from or entering \n      school. “Berrisom \n      Angle Lip Tattoo” is a lip gloss version of “Berrisom \n      Oops! My Lip Tint Pack.” It is easy to apply and the color is \n      long-lasting as if tattooed on the lips, which eliminates the need to \n      fix makeup. The lovely design that touches women’s heart and the bright \n      colors add the popularity of this product. Skincare sets to moisturize the skin that has become dry because of the \n      use of heaters and cold wind in winter are also popular items for the \n      season. In Skin Garden stores, professional consultants provide \n      assistance so that the customers can pick out and purchase skincare \n      products that best suit their skin types. Jung Joo Park, Manager at Skin Garden said, “Among Japanese women, \n      K-beauty has been established as a trend. To reflect this, customers \n      looking for Korean cosmetics as a gift for people graduating from and \n      entering school are rapidly increasing.” Continuously publicizing the technological power and excellence of \n      Korean cosmetics, Skin Garden, which has four branches in Japan, is a \n      K-beauty select shop offering over 500 varieties of Korean cosmetics \n      including Day By Day brand of Gyeongbuk Cosmetics Industry Development \n      Cluster.  Skin GardenJung Joo Park, +82 70-8786-5439jayp@skingarden.jp  Korean point makeup products, \"Berrisom Angle Lip Tattoo\" are very popular in Skin Garden, a K-beauty cosmetics shop, as a gift for people graduating from or entering school. Skin GardenJung Joo Park, +82 70-8786-5439jayp@skingarden.jp  ",
    "datetime": null,
    "url": "https://www.businesswire.com/news/home/20160216005762/en/Skin-Gardens-Point-Makeup-Products-Popular-as-a-Gift-for-Those-Graduating-from-or-Entering-into-a-School"
}