{
    "title": "Slice Masks Are K-Beauty’s Fresh New Sheet Mask Trend | Allure",
    "text": "By Erika Where would we be without Korean beauty? The industry has single-handedly made applying a face mask so damned easy, thanks to sheet masks, and some major innovation. But now, say hello to slice masks, the latest in mask innovation and maybe the most Instagrammable yet. Slice masks are just sheet masks cut into round disks and made to look like slices of cucumber, strawberry, kiwi, tulip, rose, and other fruits and flowers. As Marie Claire U.K. reports, the masks made by K-beauty brand Kocostar are comprised of 12 round pieces, each with a formula aimed at targeting different skin concerns. Watermelon and cucumber versions are designed for hydrating skin. Lemon slices help brighten complexions, and the tomato formulation is geared to detoxify and improve elasticity. Unlike traditional sheet masks, disks can be used as spot treatments for the face — or anywhere on the body. But the real hype comes from their fruit and flower designs. Once they are dotted on the complexion, it’s hard not to look like an IRL Snapchat filter (or resist at least posting a photo to Instagram). Beauty bloggers like Chloe Morello and Nina Vee have already gotten in on the action, posting slice mask images and racking up the inevitable likes on social media. Meanwhile, Korean beauty blogger Sarah Oh couldn't help but compare the company’s sunflower slice mask to a certain leopard Snapchat filter. This content can also be viewed on the site it originates from. This content can also be viewed on the site it originates from. This content can also be viewed on the site it originates from. By Aliza Kelly By Gabi Thorne By Gabi Thorne The masks just became available at Sephora Malaysia — and we’re waiting with bated breath until they’re released at Sephora Stateside. But until then, they can be ordered on asos.com in watermelon, tulip, sunflower, lemon, tomato, and other versions for a mere $6.50. Sure, our foremothers may have used real sliced cucumber to help soothe and hydrate sun-soaked skin, but given the climbing price of organic produce, we’re happy to go faux by grabbing slice masks fresh from the fridge to cool our complexions instead. Plus, why waste the food? More K-Beauty: Sara Benincasa Reviews Weird Beauty Products: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By AnaMaria Glavan By Kara Nesvig By Kara Nesvig By Gabi Thorne More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2017-05-23T20:53:54.565Z",
    "url": "https://www.allure.com/story/slice-masks-sheet-mask"
}