{
    "title": "Snail slime hits beauty mainstream after taking South Korea by storm",
    "text": "Digital Replica Edition Sign up for Newsletters and Alerts  Sign up for Newsletters and Alerts Digital Replica Edition Trending: By Christine Jenkins and Javiera Quiroga, Bloomberg Snail slime. On your face. All for the sake of beauty. And, hopefully, a handsome profit for U.S. retailers looking to push it along with other K-beauty trends into the mainstream — if people can get over the “ick” factor. Korean consumers are on a constant hunt for innovative products and unusual natural ingredients. Now, the decade-old craze is making its way to everyday consumers in the U.S., as K-beauty products jump from niche websites and slide onto the shelves at Target, CVS and Ulta Beauty stores. The retailers earlier this year announced expansions of the merchandise. “People used to talk about French skincare,” said Sarah Chung, the head of Landing International Inc. which partnered on Ulta’s Korean collection. “We don’t really call it that anymore. Right now we say it’s K-beauty, but it’s really just great skincare.” Target is selling the products in about 850 stores and said they represent about 25 percent of its total premium offerings. Ulta said it expanded its offerings with a prestige collection in March and CVS began rolling K-Beauty HQ at 2,100 stores in April. Target and CVS both partnered with Alicia Yoon, the founder of K-beauty retail platform Peach & Lily. While none of the three stores provided sales data, CVS said the launch had been “very successful” and it’s gotten positive customer feedback on the collection’s innovation, high quality and accessibility. The timing couldn’t be better for South Korean cosmetic companies. Exports to the U.S. already increased by about half in 2016 from a year earlier to $300 million while the country’s total exports declined, according to the Korea International Trade Association. Brands are getting more aggressive about their international expansion as sales to Chinese shoppers suffer amid strained ties between the two countries. South Korea’s biggest beauty company, Amorepacific Corp., already has five brands in the U.S. and is poised to start selling a sixth, innisfree, targeting Millennials with cheaper products, Amorepacific said in an email. Revenue at the group largely comes from South Korea, with 71 percent as of last year, and 19 percent from China, according to data compiled by Bloomberg. While Koreans put snail slime on the map, it’s Chileans who get the credit for discovering its apparent benefits. The Bascunan family started selling snails for food — escargots — to French wholesalers in the 1980s. The business wasn’t a great success, but it made an unexpected discovery while harvesting the animals. The secretion filtrate seemed to heal cuts and grazes caused by handling the metal cages containing the snails. The story became lore for the brands that followed, with some of the first competitors advertising that the gastropods came from Chile. “South Korean consumers are always looking to the next innovation and snail slime when introduced was well-received,” said David Tyrrell, a global skincare analyst at Mintel Group. “It was new, arguably exotic and recognized by consumers to readily moisturize the skin and produce anti-aging related benefits.” The use of filtrate has actually begun to wane in South Korea as the novelty wears off. The fascination for natural ingredients remains in line with “hanbang,”or traditional Korean herbal medicine — some 69 percent of facial skincare launches in South Korea last year featured botanical claims, including fermented tea, black olives and volcanic ash, according to Mintel. While there’s “strong” potential for Korean brands to continue the transition to mainstream stores from specialty retail, the products need to be priced to encourage first-time buyers, Tyrrell said. The treatments may be more expensive than drugstore brands such as L’Oreal and are similar to premium offerings like La Roche-Posay. Target is stocking the $33 Missha Super Aqua Cell Renew Snail Essential Moisturizer, which is 40 percent slime extract. At CVS, you’ll find the $24.99 Elisha Coy Skin Repairing Snail Cream with 91 percent snail secretion filtrate, as well as products like the $6.99 Saem Saemmul Wrapping Tint — which consumer are supposed to apply and peel to reveal a long lasting “lip tattoo.” Ulta offers a $9.50 kit to sample brands with a mineral face peel that will ball up as you rub it into your face, and a cleansing “sherbert” made with fermented organic grains. “There is realization by mainstream retailers that K-beauty cosmetic products can add to the bottom line,” Tyrrell said. “We’ll see in the next six months how successful these campaigns are.” At Ulta, early reviews for the $21 COSRX Advanced Snail 96 Mucin Power Essence look good: “Take the leap of faith. Once you get over the idea of the main ingredient…. you will love this stuff!” — Bloomberg’s Heejin Kim and Sohee Kim contributed. Copyright © 2023 MediaNews Group ",
    "datetime": "2017-07-23T03:55:32+00:00",
    "url": "https://www.denverpost.com/2017/07/22/snail-slime-beauty-south-korea/"
}