{
    "title": "Snail Slime and Bee Venom Are K-Beauty’s Secrets to U.S. Success - Bloomberg",
    "text": "Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world Americas+1 212 318 2000 EMEA+44 20 7330 7500 Asia Pacific+65 6212 1000 Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world Americas+1 212 318 2000 EMEA+44 20 7330 7500 Asia Pacific+65 6212 1000 Bloomberg Brief delivers the market news, data and analysis you need to set your agenda. Bloomberg Daybreak, anchored from New York, Boston, Washington DC and San Francisco provides listeners with everything they need to know. Hear the latest economic, business and market news, as well as global, national, and local news. Giant Leap explores how startups and governments are cashing in on the commercialization of space. Repsol Warns It May Cut Spanish Investments on Tax Concerns House Republicans Finally Pick A Speaker: Big Take Podcast US GDP Data to Show Temporary Boost from Summer-Spending Frenzy German Businesses Trim Investment Plans Zambia Reaches Deal With Bondholders on Debt Restructuring Danone Raises 2023 Outlook as Sales Beat Expectations Hyundai’s Profit Beats Estimates on Luxury Car and EV Growth Fintech Firm Wex Is Said to Acquire Payzer in $250 Million Deal Chinese EV Maker Xpeng to Bring Assisted-Driving Tech to Europe Next Year Big Tech’s Disappointing Earnings Erase $200 Billion in Value Hollywood Actors Fighting Over ‘Basic Principles’ of AI Replicas Google, Nvidia Back AI Startup That Helps Combat Chip Shortage Microsoft Sales Top Estimates as Cloud Growth Picks Up Steam Russia’s Frozen Cash Earns €3 Billion as EU Haggles Over How to Tap It Ukraine Recap: Zelenskiy to Urge EU to Tighten Russia Sanctions Brazil Congress Approves Bill to Tax the Rich, Raise Revenues Griffin Says Scrutiny of SEC Basis Trade ‘Utterly Beyond Me’ How to Maximize Your Odds for a Hotel Upgrade Taylor Swift Mania Sparks Jump in Singapore Bank’s Card Fees Bonds as Diversifiers Aren’t Dead — Just Dormant China Is Beating the US in the Race for the Seabed’s Riches Markets in an Era of Clashing Superpowers The War That Broke Social Media Sam Bankman-Fried Takes Stand in Reminder of Crypto’s Epic Fall X, One Year Later: How Elon Musk Made a Mess of Twitter’s Business Thailand Renews Efforts to Guarantee Rights of Same-Sex Couples Google, Bank Coalition Pledge Billions to Underserved Businesses Tesla’s Cybertruck Will Test America’s Great Political Divide EU Markets Watchdog Says Companies Spending More on ESG NYC Mayor Warns of ‘Draconian’ Steps If Migrant Flow Continues Oil Bosses Try to Sell Tax-Leery Texans $1.4 Billion School Bond The Minnesota Mayor Making Space for Monarch Butterflies Sam Bankman-Fried Testimony Is Trial Climax for FTX Court Watchers Bitcoin Faces Reality Check if ETF Launches Spark ‘Sell-the-News’ Pivot Sam Bankman-Fried Takes Stand in Reminder of Crypto’s Epic Fall Peach & Lily products. In 2012, Alicia Yoon quit her job and hopped on a plane from New York to Seoul to scour South Korea for its most advanced skin-care products. She’d started to hear some buzz about lotions and potions coming from research labs in the country, soothing creams and pore-minimizing serums with ingredients, such as snail slime, not used by any mainstream brand. Yoon’s goal was to persuade the makers of some of the products to allow her to sell their wares in the U.S. It would take only a few weeks, she figured, so that summer she crashed at her parents’ house—Yoon was born and raised in South Korea—and spent her days knocking on laboratory door after laboratory door. “It was like a disaster, I had no income,” she says. “I thought, If in six months I’m not able to secure my first brand, the timing is probably not right.” It ended up taking 5½ months for Yoon to get a single label, called Be the Skin, to sign on with her new business, Peach & Lily. Korean companies were initially wary of expanding beyond their own borders, especially with unknown sellers. So entrepreneurs like Yoon had to focus on cultivating relationships with owners. Her timing wasn’t so bad after all—awareness of K-beauty was just starting to sprout abroad as several other businesses, picking up on the interest, came to life. ",
    "datetime": null,
    "url": "https://www.bloomberg.com/news/articles/2019-05-02/snail-slime-and-bee-venom-are-k-beauty-s-secrets-to-u-s-success"
}