{
    "title": "SNEAK PEEK: blk Cosmetics’ summer collection is all about K-beauty",
    "text": " SUMMARY This is AI generated summarization, which may have errors. For context, always refer to the full article. Photo by Martin San Diego/Rapple  MANILA, Philippines – Anne Curtis has brought her love for Hallyu to her makeup brand blk Cosmetics, which is set to officially launch its K-beauty-inspired summer collection in April. The new line takes blk’s promise of “uncomplicated beauty” to heart with products that can be applied with just your finger, and will fit in even the smallest of makeup kits. “When it’s summer, I just like to wear sunscreen and cheek tint. We have the lipstick shades, we have the liquid eyeshadow. We’re all about being an uncomplicated brand right so you don’t really need all the makeup brushes and everything so it’s easy – you just use your fingers and you’re good to go,” Anne told Rappler at the opening of the first blk boutique at TriNoma on March 24. (IN PHOTOS: Anne Curtis opens first blk Cosmetics store) At the center of the blk summer collection is the K-beauty starter kit, which has everything one needs to create that fresh, dewy Korean makeup look: lip/cheek tints, liquid eyeshadow, and a BB/CC cream stick for coverage. It comes in a limited edition box with an inside cover that outlines a 3-step routine using the products.   The lip/cheek tints (P249 each) come in 4 shades: red, orange, cherry, and pink.    The liquid eyeshadow (P299 each) also comes in 4 shades: Hello (shimmery brown), Gorgeous (matte brown), I Love You (shimmery bronze-orange), and Cute (shimmery champagne).    The BB/CC cream sticks (P449 each) come with a built-in foundation brush and is available in 3 shades: ivory beige (for fair skin tones), light beige (for medium skin tones), and natural beige (for tan skin tones).  Aside from the K-beauty starter kit, the summer collection also includes 3 new Korean-inspired shades of blk’s all-day intense matte lipsticks (P299 each), and 2 shades of creamy cheek paint (P349 each). For now, the K-beauty starter kit and other K-beauty products are only available at the blk boutique at TriNoma mall in Quezon City, and blk counters at select SM stores. Online, the products are available on the blk website . The summer collection will be released in all blk counters on April 6.  – Rappler.com Love K-beauty inspired makeup? Shop your favorites on Althea and enjoy exclusive 10% off sitewide with our coupons. Error. Please abide by Rappler's commenting guidelines. There are no comments yet. Add your comment to start the conversation. JOIN OUR NEWSLETTER Fearless reporting delivered to you follow us    ",
    "datetime": "2018-03-26T05:00:00+00:00",
    "url": "https://www.rappler.com/life-and-style/198888-anne-curtis-blk-cosmetics-k-beauty-summer-collection/"
}