{
    "title": "Snoop Dogg to Star in ESPN Series on Youth Football – The Hollywood Reporter",
    "text": "Subscribe for full access to The Hollywood Reporter Subscribe for full access to The Hollywood Reporter The documentary-style series follows the gangster rapper and his son By \n\n\tDiana Swartz Snoop Dogg visited India for the first time, performing in the cities of Pune and Delhi. Having previously guest-rapped on the title track of 2008 Bollywood hit Singh Is Kinng, the flamboyant artist enthralled fans with a live rendition of the track, donning a traditional Indian outfit. But Snoop Dogg also was put on the spot when, at his Mumbai press conference, he dodged questions about his views on the portrayal of women in music and the horrific Delhi gang-rape incident. Snoop Dogg is starring with his son in a new documentary-style series on ESPN about youth football. The five-part series, Snoop & Son: A Dad’s Dream, follows the gangsta rapper and his son Cordell Broadus on their adventures trying to launch Broadus’ football career. Broadus is a high school football star who has been recruited by USC and Notre Dame.  The series launches Jan. 14 at 7 p.m. ET. Read more Snoop Dogg Aims to Raise $20K Via Crowdfunding Site for Des Moines Footballers  Snoop started the Snoop Youth Football League in L.A. almost 10 years ago to foster a positive environment through recreational sports. Snoop has served as both a coach and mentor in the league, and he got Broadus involved in the sport early. Watch a trailer for Snoop & Son: A Dad’s Dream, below.  Sign up for THR news straight to your inbox every day Sign up for THR news straight to your inbox every day Subscribe for full access to The Hollywood Reporter Send us a tip using our anonymous form. ",
    "datetime": "2014-12-19T17:19:09+00:00",
    "url": "https://www.hollywoodreporter.com/news/general-news/snoop-dogg-star-espn-series-759653/"
}