{
    "title": "Social golfer’s $39k joining fee to be returned ",
    "text": "A former member of Doonbeg Golf Club has secured judgment of $39,500 (€28,608) against Doonbeg Golf Club concerning a refundable joining fee of $45,000 the firm had refused to return to him. At Ennis Circuit Court, pharmacist Dermot Reidy, of Greenlands, Rathfarmham Castle, Dublin, secured the order after the court was told the liquidator and receiver to Doonbeg Golf Club, which was owned by US-based Kiawah, were not opposing his claim. In 2006, Mr Reidy’s nephew Mark paid $90,000 in two separate bank drafts of $45,000 for his uncle and himself to Doonbeg Golf Club Ltd to join the club. The assets of the club, but not outstanding liabilities, including Mr Reidy’s legal action, were recently bought by US billionaire Donald Trump after Doonbeg Golf Club Ltd went into receivership. In evidence yesterday, Mr Reidy said he signed up in 2006 after being told by club official Peter Houlihan that the joining fee was being raised from $45,000 to $75,000. He said: “Mr Houlihan told me ‘if you get me down the $45,000, I will get you in at that rate’.” Mr Reidy said Mr Houlihan told him that the $45,000 would be refundable if he resigned as a member of the club. Mr Reidy said he joined and paid his annual dues of $5,500 for 2006, 2007, and 2008. However,  in 2009, he told the golf club he could not continue to pay rates at that level. Mr Reidy offered instead that the golf club could subtract his 2009 sub from his $45,000 deposit. This was rejected by the club. Describing himself as a “social golfer”, Mr Reidy said he resigned from the club in October 2009 and the money he was seeking  was the $45,000 minus the 2009 dues of €$5,500. Mr Reidy said that his membership was terminated by Doonbeg Golf Club shortly after. He told the court that he realised in 2010 he had no copy of his contract with the club, and requested the contract from the club. He said: “When I received the contract, I was surprised to see the purported signature on the contract was not mine. “I had never seen that document.” Counsel for Mr Reidy, Paul Hutchinson BL, said  page 11 of the contract said  repayment of deposit was at the sole discretion of Doonbeg’s US owners, Kiawah. Asked whether he aware of that, Mr Reidy said: “No, I was not. It was my understanding that if I was resigned, for whatever reason, my deposit would be returned.” Mr Hutchinson said  a liquidator was only appointed to Doonbeg Golf Club Ltd two days ago. Judge Gerald Keyes awarded judgement against the two defendants, Doonbeg Golf Club Ltd and Kiawah Island Llc, in the sum of $39,500 (€28,608) in favour of Mr Reidy and that the sum be held in trust for Mr Reidy. Judge Keyes also awarded costs in favour of Mr Reidy. Speaking outside court, Mr Reidy said that was “very happy” with the outcome. Asked was he confident he will receive his monies in spite of Doonbeg Golf Club Ltd entering receivership and liquidation, Mr Reidy said: “Yes, I’m very confident. Placing the sum in trust will, I’m told, ensure that I get my money back.” Mr Reidy’s nephew Mark said his legal action seeking the return of his $45,000 joining fee is pending. He said: “There will be a lot of interest in the outcome today, as I know personally of eight other former members apart from myself looking to have their deposit returned.” George Sorial, vice president  of the Trump Organisation, said from New York yesterday: “As everyone knows, we purchased the property through the receivership process. “The liabilities incurred by the prior owner remain the sole responsibility of the Kiawah group. Pursuant to our discussions with them regarding this specific litigation, they have agreed to assume complete responsibility and intend to honour their obligations.” more courts articles More in this section Sign up to the best reads of the week from irishexaminer.com selected just for you. Please click here for our privacy statement.     2023 Constituency Interactive Map See all the changes and how they impact you Explore Explore For a fresh perspective on life today Thursday, October 26, 2023 - 10:00 AM Wednesday, October 25, 2023 - 10:00 PM Thursday, October 26, 2023 - 9:00 AM Analysis © Examiner Echo Group Limited, Linn Dubh, Assumption Road, Blackpool, Cork. Registered in Ireland: 523712. © Examiner Echo Group Limited ",
    "datetime": "2014-03-21T00:00:00+00:00",
    "url": "https://www.irishexaminer.com/news/arid-20262742.html"
}