{
    "title": "Soho House launches Soho Skin, its own skincare line",
    "text": "The global club for creatives is now taking on the beauty industry. Here at LSA HQ, we’re big fans of Soho House. I don’t know if I’m allowed to say this, but our Editor-in-Chief is always there drinking tequila sodas and our Social Media Manager regularly hosts events in collaboration with the Hong Kong house. But before you accuse us of any sort of bias, let me just say I’m clean. Guys, I’m not even a member. So today’s article is definitely not slanted; it’s simply what I thought was some pretty cool news. In case you haven’t heard — and you probably haven’t, because it hasn’t even been announced to members yet — the global hospitality brand and private members’ club is branching out into the beauty space. Yup, that’s right, Soho House is releasing its own skincare line. And it’s named Soho Skin, naturally. First, like Aesop, Le Labo and our all other favourite genderless scent creators, Soho Skin’s collection caters to all sexes — so inclusive! Next, it was developed not only by professionals, but also Soho House members themselves. The community was asked about their skincare goals and what they felt was missing in the current beauty market. All this makes me feel like Soho House is really onto something with its new venture. Ten hyper-functional products, designed to be used both at home or during your travels, come with the debut of Soho Skin. They include a cream cleanser, an eye cream, a face cream, a shaving gel, an exfoliant treatment and a brightening renewal serum. The complete Soho Skin collection is now available in all Soho House bedrooms and online via the brand’s website. Editor Charmaine enjoys eating steamed broccoli and knocking back cups of spearmint tea, all in the name of health. Covering art, beauty and music :) Yes, I agree to the Privacy Policy For your daily updates on all things luxury, follow us at @lifestyleasiahk Yes, I agree to the Privacy Policy Subscribe to our newsletter to get the latest updates.  Thank you for your subscription. ",
    "datetime": "2022-09-16T09:58:10+00:00",
    "url": "https://www.lifestyleasia.com/hk/beauty-grooming/skin/soho-skin-soho-house-skincare-line/"
}