{
    "title": "Soko Glam’s Charlotte Cho Shops for Korean Beauty in Seoul | Vogue",
    "text": "To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. By Zoe Ruffner “I calculated, and for 2016, I spent a third of the year in Korea,” says New York–based Soko Glam cofounder Charlotte Cho, who travels to Seoul upwards of eight times a year to source the latest and greatest of K-beauty for her online shop. And yet, despite her frequent flyer status, Cho admits that she has a hard time keeping up with the market: “Korean products are changing so quickly. There’s always something new on the shelves!” For her most recent trip in June, this was no exception. For seven days, Cho traversed the bustling city seeking out unique finds to bring back with her from the likes of concept shop 3CE—complete with a beauty counter, hair salon, and movie theater—and Jakeunchai where she underwent a K-pop makeover. “The emphasis is on a heart-shaped face with a pointy chin,” Cho explains of the favored look. “They’re really about contouring as well, but in a more subtle way [than Americans]. It’s not like Kim Kardashian.” But don’t be fooled by the plethora of clever cushion compacts and panda-patterned under-eye masks on offer. “When people think of K-beauty they think, ‘Oh, products!’, but there’s so much more to Seoul than makeup and skincare” insists Cho, who squeezed in an aromatherapy tea tasting and acupuncture session, too. Here, from a custom lipstick–making experience to a traditional ginseng foot scrub, a look at Cho’s whirlwind of a week in Seoul, South Korea. By signing up you agree to our User Agreement and Privacy Policy & Cookie Statement. By David Graver By Daniel Rodgers By Nick Remsen By Jenna Rennert By Kiana Murden By José Criales-Unzueta More from Vogue See More Stories © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices CN Fashion & Beauty ",
    "datetime": "2017-07-03T12:00:00.000Z",
    "url": "https://www.vogue.com/article/soko-glam-korean-beauty-charlotte-cho-seoul-photo-diary"
}