{
    "title": "Soko Glam 2019 K Beauty Winners Are On Sale – StyleCaster",
    "text": "By providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Since 2012, we’ve been following Charlotte Cho’s lead when it comes to Korean skincare. She and her then-boyfriend (now husband) Dave launched Soko Glam to bring the best of Korean beauty into our lives. They recently announced Soko Glam’s 2019 K-beauty winners and they’re good, which isn’t surprising. Cho has been a leading voice in the space and has even gone on to create her own skincare line, Then I Met You. Now’s your chance to pick up her favorite products of the year—and for 15 percent off. Related Stories 5 Korean Beauty Products on Amazon With Major Discounts Right Now 15 Places to Shop When You Want the Best K-Beauty Products Use code BEST15 to grab your discount on acne patches, toner, eye cream, cleansers, sheet masks and more, from top K-beauty brands. Plus, if you spend $125, you’ll nab a free Mediheal sheet mask set. The sale only goes until October 16 so now’s the time to stock up on your favorite products or to try something new you’ve had your eye on. Amazingly, none of the 2019 winning products cost more than $25. Score. These 100% virgin coconut oil-soaked pads remove makeup and impurities while lightly exfoliating skin. $21.25 (were $25) at Soko Glam These are the most affordable and effective hydrocolloid patches on the market, full stop. $4.25 (was $5) for 24 patches at Soko Glam  Hydrate your skin with hyaluronic acid, amino acids and more skin-soothing ingredients. $8.46 (was $9.95) for 4 masks at Soko Glam  This eye cream promises to brighten, hydrate and tighten your skin—no matter how little sleep you got. $17 (was $20) at Soko Glam Calm stressed, irritated skin with this skin-calming cream. $20.82 (was $24.50) at Soko Glam Mix this vitamin C powder with your favorite toner or essence for a DIY brightening treatment.  $17 (was $20) at Soko Glam Aloe smoothes and hydrates, while salicylic acid helps keep acne at bay. $16.15 (was $19) at Soko Glam This oil-to-foam cleanser removes dirt and impurities without drying out your skin. $17.85 (was $21) at Soko Glam Lightly exfoliate skin with PHAs, tea tree leaf oil and jojoba oil. $21.25 (was $25) at Soko Glam Apply this hydrating mist throughout the day for a shot of moisture that’s never greasy. $20.40 (was $24) at Soko Glam Our mission at STYLECASTER is to bring style to the people, and we only feature products we think you’ll love as much as we do. Please note that if you purchase something by clicking on a link within this story, we may receive a small commission of the sale. By providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. By providing your information, you agree to our Terms of Use and our Privacy Policy.\n\t\t\t\tWe use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. ",
    "datetime": "2019-10-09T19:47:05+00:00",
    "url": "https://stylecaster.com/beauty/skin-care/1052951/soko-glam-2019-k-beauty-winners/"
}