{
    "title": "Soko Glam Opens K-Beauty Shop at Bloomingdale’s SoHo – WWD",
    "text": "It is the first foray into brick-and-mortar retail for the K-beauty purveyor. Beauty Editor, Mass Market Soko Glam is setting up shop in Bloomingdale’s. The digital K-beauty company has opened a temporary pop-in shop on the cosmetics floor of the retailer’s SoHo outpost. The space holds 11 brands and 70 K-beauty skin-care and makeup products, and is equipped with iPads that display a revolving stream of how-to content featuring Soko Glam’s cofounder and chief curator Charlotte Cho. “We identify as a totally digital company, and we have this e-commerce community with thousands of reviews, and it was our community that really wanted us to have this in-person experience,” said Cho of the Bloomingdale’s shop, Soko Glam’s first-ever retail concept. American-born Cho, a licensed aesthetician, founded Soko Glam in 2012 after getting hooked on Korean skin care while living in South Korea for the first time in her early 20s. Today, Soko Glam operates as both an e-commerce site and K-beauty blog called The Klog, which focuses on education around Korean skin-care routines. Related Articles\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tBeauty Features\n\t\n\n\n\n\t\n\t\t\tBobbi Brown on Three Years of Jones Road\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tBeauty\n\t\n\n\n\n\t\n\t\t\tThe Best Dyson Airwrap Dupes, Tested and Reviewed For Bloomingdale’s, the Soko Glam shop is a chance to offer a more trend-driven beauty assortment. “The SoHo customer is very savvy and also focused on health and wellness. This is the perfect target audience for K-beauty,” said Stacie Borteck, vice president and DMM of cosmetics and fragrances at Bloomingdale’s. Cho emphasized that the shop is designed to make K-beauty accessible to consumers who only know it for gimmicky items like animal sheet masks or complex 12-step routines. “There are a lot of misconceptions about Korean skin care being complicated, but it’s really about what your skin needs what concerns you have,” Cho said. To that end, the store is organized by a streamlined five-step routine, and the sheet mask wall is divided into sections based on specific skin concerns. Three iPads on each wall of the shop demonstrate a revolving stream of how-to content, featuring Cho herself applying products. Products in the shop range from $2 to $50, an accessible price point Cho thinks will resonate with younger consumers looking to experiment with new skin-care items. She expects bestsellers to reflect what sells well in her e-commerce shop, including the Etude House Moistfull Collagen Emulsion, Neogen Dermalogy Bio-Peel Gauze in Peeling Wine — they’re peel pads steeped in resveratrol and lactic acid — and the Cosrx Acne Pimple Master patches, which are sticker spot treatments for acne. Cho also chose to carry makeup from Etude House and Klavuu, something most K-beauty purveyors in the U.S. have shied away from. “I really think makeup is part of the next K-beauty wave,” said Cho, who noted that color trends in South Korea are becoming increasingly Westernized, sparking product development of American-friendly makeup products. The shop is also social-media friendly — shoppers who post to social media and tag @sokoglam are given product samples. And new content and products will be continuously rotated in, keeping the shop current at all times. “This goes along with how retail isn’t straightforward anymore and people want that personalized experience,” said Cho, who noted she’ll see how the pop-in fares at Bloomingdale’s before considering further retail expansion.  Sign up for beauty news straight to your inbox every day Top News Stories Alerts Straight to your Inbox. Send us a tip using our anonymous form. WWD and Women's Wear Daily are part of Penske Media Corporation. © 2023 Fairchild Publishing, LLC. All Rights Reserved. ",
    "datetime": "2017-06-06T17:06:22+00:00",
    "url": "https://wwd.com/feature/soko-glam-k-beauty-shop-bloomingdales-10902742/"
}