{
    "title": "Soko Glam's Korean Beauty Products Are on Sale Right Now | Allure",
    "text": "By Gillian Fuller In 2014, Asian beauty e-tailer Soko Glam launched its annual Best of K-Beauty Awards, honoring the year's top Korean beauty products. Now, three years later, following the crowning of this year's 10 winners, the K-beauty shop has decided to take the celebration one step further — with a shopping extravaganza, along with a deep discount to boot. For a limited time, Soko Glam is offering 15 percent off (!) to all winners — starting right now. The discount, which you can get using the code \"BOKB17\" at checkout at sokoglam.com, may not seem like much at first glance — but considering not one of the hundreds of available products exceed $70 regularly, we'd say it's pretty significant price-slashing. Unsure of what to score at the sale? This year, winners include products from nearly every category: skin care (Soko Glam x CosRx Triple C Lightning Serum), hair care (British M Organics Annatto Hair Oil), and makeup (Etude House's beloved Dear Darling gel lip tints). Unfortunately, the sale only lasts until the products sell out on sokoglam.com — so scroll on ahead to see which winners are worth your hard-earned cash, and get to ordering. You know we'll be doing the same. This top-rated hair oil smoothes flyaways and tames frizz without weighing down the hair, thanks to a blend of lightweight oils (including anatto, pumpkin seed, and argan). The lightweight formula also protects the hair from environmental and UV damage — two major contributors to dull strands. ($67 reg; $56.95 sale) With more than 20 percent vitamin C, this skin-brightening serum is a must-have in our get-glowy beauty routines (and we’re not alone: It once had 10,000 person wait list). The inexpensive fluid — which, thanks to its high concentration of antioxidants, helps to promote brighter, clearer and more-even skin — usually retails for $27, but you can snag a bottle (or two) right now for just $22.95. If there's anything you should buy right now, it’s this — because you can bet it’s going to sell out fast. ($27 reg; $22.95 sale) By Aliza Kelly By Gabi Thorne By Gabi Thorne Made with moringa seed extract and iris extract, this rich cleansing cream pulls triple-duty, removing makeup, dissolving dirt and oil, and boosts collagen production. It’s also a great pick for those with sensitive skin, as — with all of ENature’s products — it’s formulated without parabens or artificial fragrances (both of which can worsen irritation in sensitive complexions). ($23 reg; $19.55 sale) We're huge fans of makeup that actually stays put — and this super-affordable lip tint certainly fits the bill (one tester proclaimed it would \"basically last through the zombie apocalypse\"). There are eight shades available, all of which give the lips a pretty, popsicle-stained effect that, as mentioned above, seriously lasts. We'll probably be buying them all. ($5 reg; $4.25 sale) This sprayable serum (one of our all-time fave K-beauty buys) stars antioxidant Vitamin C to brighten the skin, plus centella asiatica extract to calm inflammation and redness. Plus, it's sprayable. Does it get any cooler than that? (No, it doesn't). By Aliza Kelly By Gabi Thorne By Gabi Thorne ($19 reg; $16.15 sale) Scoop up your fave K-beauty products for 15 percent, starting now, at sokoglam.com. More on K-beauty: Now, watch Jessica Williams review weird beauty products: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Sarah Han By Nicola Dall'Asen By Devon Abelman By Dianna Mazzone More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2017-10-06T13:07:36.315Z",
    "url": "https://www.allure.com/story/soko-glam-korean-beauty-products-sale"
}