{
    "title": "Soko Glam's Charlotte Cho Is Leading a Korean Beauty and Skin-Care Revolution",
    "text": "Charlotte Cho is leading a revolution in skin care and beauty with Soko Glam, one of the largest Korean Beauty (K-Beauty) websites in the United States. Considering that K-Beauty is a billion-dollar industry, Cho's foothold on the market is clearly impressive. Now with her new own skin-care brand, Then I Met You, Cho is proving that the K-Beauty craze is not only here to stay, but also becoming an essential part of the American beauty market. \"I think K-Beauty is synonymous to innovation,\" Cho told Newsweek Conversations. Its popularity in the United States has led to \"a merging of Western philosophies and Asian philosophies,\" with plenty more to come, says Cho. \"You will always see something new coming out of Korea.\" In 2012, Cho and her husband, David, launched Soko Glam, a K-Beauty and skin-care e-commerce site, offering a curated selection of Korean skin-care products. Originally from Southern California, Cho had never spent much time thinking about skin care until she moved to Korea at age 22; there she discovered that skin-care regimens weren't seen as a chore, but rather as a form of self care. \"I saw the impact it had on my confidence and my skin. I got compliments from my mom, who never compliments me. I knew that I had found something special.\" What makes Soko Glam so popular with consumers is that Cho herself picks the brands featured on the website, giving shoppers the intimate connection they're seeking when choosing beauty products. Through her reviews and the website's blog, The Klog, Cho has established herself as an authority on skin-care, as well as having literally written the book on it—Cho's The Little Book of Skin Care was published in 2015. It's these past years of using other products that led Cho to create Then I Met You, a product line of cruelty-free and vegan balms, toners and cleansers. Her ability to develop this brand from scratch grew out of years of product testing and the relationships she has made with her Soko Glam consumer base. \"I think I have a very unique lens and perspective on skin care because I've literally tested hundreds of thousands of products over this seven-year journey with Soko Glam.\" Perhaps what Cho is most known for is creating the popular \"10-Step Korean Skin-Care Routine,\" which features essential steps to healthy skin. But she's quick to note that you don't have to follow every step; in fact, you can pick and choose what works for your individual skin. \"Skin care doesn't have to be a one-size-fits-all solution at all. It is very customizable to your preferences.\" For more about Cho and K-Beauty, watch the full interview on Newsweek Conversations. Newsweek is committed to challenging conventional wisdom and finding connections in the search for common ground. Newsweek is committed to challenging conventional wisdom and finding connections in the search for common ground.  To read how Newsweek uses AI as a newsroom tool, Click here. ",
    "datetime": "2020-01-23T07:00:01-05:00",
    "url": "https://www.newsweek.com/soko-glams-charlotte-cho-leading-korean-beauty-skin-care-revolution-1483506"
}