{
    "title": "Soko Glam's the Klog Box Brings Korean Beauty Goodness Straight to Your Door | Allure",
    "text": "By Sarah Kinonen Here at Allure, we love subscription boxes. So much so that we even curate our own every month, called the Allure Beauty Box, which is filled to the brim with luxe samples of makeup and skin- and hair-care products. (If you're not a subscriber, here's where to get the hookup.) But we recently came across something totally new to the subscription box world: a Korean beauty box! Soko Glam, a K-beauty retailer touting the latest in essences (you know, for the 7 Skin Method), super serums, and sheet masks, just launched a one-time-only box, called Soko Glam's the Klog Box, which sends K-beauty favorites straight to your door. Cool, right? But there's a catch. It's not available—yet. The Klog Box, which officially launches on March 2, will feature six new K-beauty skin-care launches, including the Allure-editor-beloved unicorn cream-inspired Erborian Glow Creme; the soothing green tea-spiked Manefit Natural Gift Green Tea Pore Care Sheet Mask, which made its TV debut on a recent Allure Facebook Live appearance; the hydrating E Nature Birch Juice Hydro Sleeping Mask designed to make your skin silky smooth while you snooze; the exfoliating lactic acid–based Neogen Bio Peel Gauze Peeling Lemon; the nonirritating, nonstripping Klavuu Pure Pearlsation Revitalizing Cleansing Foam; and the Missha All Around Safe Block Sebum Zero Sun, which is formulated with UV protection SPF 50+. More on Korean beauty: Want in on the K-beauty goodness? Soko Glam's the Klog Box, which is only available for presale at the moment, officially launches on sokoglam.com on March 2 and will retail for $50. Sure, that may sound a little pricey, but when you think of the six full-size bottles of top skin-care picks you'll be taking home (as opposed to the one pair of Zara shoes you could snap up for the same price), it's kinda hard to argue with that. This content can also be viewed on the site it originates from. Now, watch Korean actress and pop star Jihae’s all-natural beauty routine: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Sarah Han By Nicola Dall'Asen By Kara McGrath By Devon Abelman More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2017-02-28T13:00:00.000Z",
    "url": "https://www.allure.com/story/soko-glam-the-klog-box-korean-subscription-box"
}