{
    "title": "Soko Glam Is Like Sephora for Korean Beauty and Skin Care Products",
    "text": "Jump to        When you buy through our links, Insider may earn an affiliate commission. Learn more In 2011, makeup brand Dr. Jart introduced the US to its first BB Cream. Seemingly overnight, the country became obsessed with K-Beauty — tuning in to something Korea has been doing well for many, many years: fantastic, ever-advancing, \"skin first\" skincare. The thesis of K-Beauty is simple: treat your skin well. Be consistent, use products packed with natural ingredients, and protect your skin from pollutants and UV rays. Rather than focusing on the reactionary steps of cloaking it in expensive, pore-clogging makeup or sterilizing it with harsh ingredients, just focus on babying the skin itself. In other words, if you're going to spend 20+ minutes putting on makeup for the day, you should be willing to invest 20+ in your skin itself. Logically, this makes sense; prevent rather than react. And, not coincidentally, simplicity and consistency happen to be the building blocks for any good skincare routine ever. In the years since the fateful BB. Cream, the interest in K-Beauty hasn't gone anywhere. Korea's exports of cosmetics in 2016 surged more than 40% on-year and beauty exports actually surpassed their imports. Reddit users archive their best finds in collaborative threads. Similar to the reverence with which French pharmacy products are regarded, tourists go from store to store filling up suitcases with the most sworn-by sheet masks. And, somewhere in the mix, Soko Glam (the Sephora of K-Beauty) popped up to help shoppers find and buy the best products within the genre. You'll probably still come home from a Korean vacation with sheet masks in your pockets, but it's now much cheaper to replenish the stock. The site is also supposedly credited with being the first to make the now-famous 10-Step Korean Skincare Regime widely available. The site is great for the initiated to find their Holy Grail products and discover new ones, but it's also a welcome and knowledgeable guide for those who may be new to K-Beauty and don't know where to start. You can build your own K-Beauty routine based on skin concerns, type, and brand; shop the concise and definitive 'Best of K-Beauty' award winners; or leave it up to Soko Glam entirely and order an already curated 5-Step or 10-Step Korean Skincare Routine based on your skin type. And for tips and tricks, the site also has a lively blog nicknamed \"The Klog\" that covers skincare and cosmetics available in K-Beauty more in-depth. If you're unsure of your skin type or have questions about the products, you can take the site's skin quiz or sign up for Soko's complimentary 1:1 skin consultation with a Soko Glam skin expert. Admittedly, when I tried to schedule a 1:1 consultation I got tired of clicking before I found an available date (three months away). It's a popular site and Soko acknowledges you might have trouble nabbing one; they're free, and they fill up quickly. Soko Glam was actually founded in 2012 by wife-and-husband team Charlotte and Dave Cho, but its inception began much earlier. As a 20-something, Cho moved halfway across the world to Seoul for her first post-grad job. Mesmerized by what she described to \"Into the Gloss\" as a \"magical mecca of flawless, dewy skin [that...] believes in a million-step skincare regimen and very minimal makeup\" Cho became deeply interested in K-Beauty — eventually going on to earn her esthetician degree, switch careers, and create Soko. For Cho, it must have felt a bit like stumbling across a variant of the Fountain of Youth in broad daylight — the sort of thing that makes you ask \"how can people not know about this?\" The resultant company is, in part, one way to make it easier for people to discover the same skincare, trends, and cosmetics that seemed so revolutionary to Cho in her 20s. Soko Glam is based in NYC, but the company says the team regularly travels to Seoul to scour a fast-moving Korean skincare and makeup market for the Next Big Thing(s), consult industry experts, and meet tastemakers to ensure they're bringing the best selection back for the site. For everyone from K-Beauty veterans to amateurs looking to get their feet wet, Soko Glam is an unusually good tool — and one you're likely to bump into if you spend 10+ minutes looking into K-Beauty online. If you're looking for a spot to source all your favorite K-Beauty, get some insight from experts, or know about the next Holy Grail product before everyone else, you're going to want to check it out. Subscribe to our newsletter.\nYou can purchase syndication rights to this story here.\n                            Disclosure: This post is brought to you by the Insider Reviews team. We highlight products and services you might find interesting. If you buy them, we get a small share of the revenue from the sale from our commerce partners. We frequently receive products free of charge from manufacturers to test. This does not drive our decision as to whether or not a product is featured or recommended. We operate independently from our advertising sales team. We welcome your feedback. Email us at reviews@businessinsider.com. Subscribe to our newsletter.\nYou can purchase syndication rights to this story here.\n                            Disclosure: This post is brought to you by the Insider Reviews team. We highlight products and services you might find interesting. If you buy them, we get a small share of the revenue from the sale from our commerce partners. We frequently receive products free of charge from manufacturers to test. This does not drive our decision as to whether or not a product is featured or recommended. We operate independently from our advertising sales team. We welcome your feedback. Email us at reviews@businessinsider.com. ",
    "datetime": null,
    "url": "https://www.insider.com/guides/beauty/soko-glam-k-beauty-review"
}