{
    "title": "Son Ye-jin, Hyun Bin and Seo Ji-hye: the biggest K-drama stories about the Korean stars of Crash Landing on You – in review | South China Morning Post",
    "text": "Even though Crash Landing on You ended a few weeks ago, we know you are not over it yet (neither are we). Here, we recap the hottest news you need to know about this mega-hit drama, from its memorable looks and anti-ageing skincare secrets to fun facts about the stars. 1. The heiresses are fashion icons Actresses Son Ye-jin and Seo Ji-hye looked sensational, from head to toe, in every scene with their high-end ensemble straight off the runways. Son Ye-jin’s most striking looks were from Balmain, Burberry, Celine, Louis Vuitton, Off-White and Chanel, while Seo Ji-hye glowed in Valentino, Tod’s, Ports 1961, McQueen and Jigott. 2. Glowing and age-defying skincare secrets Thirty-eight-year-old Son Ye-jin, one of the actresses on the list, uses beauty tools such as Manyo Factory Bifida Complex Ampoule, Vanav UP6 Galvanic Ion Massager and facial masks, for a radiating facial glow. 3. Real-life fun facts about the star-crossed lovers If you are familiar with the show, you will know what the star-crossed lovers, Ri Jeong-hyuk and Yoon Se-ri, are like. But are the characters like the celebrities who play them? You be the judge. Introverts might get a warm feeling inside, as Hyun Bin, who plays Ri Jeong-hyuk, confesses to be one of them. He prefers to stay away from the spotlight, but is aware of the lifestyle demands on celebrities. The hunky actor also reveals that he almost joined a rock band. The female lead, Yoon Se-ri, played by Son Ye-jin, is not interested in any career break and is looking for new acting opportunities and projects. She is enthusiastic about the arts, an avid traveller, and a natural beauty. 4. Real-life chaebol When thinking about themes that often run through K-dramas, do chaebol (wealthy business heirs) spring to mind? We look at some of the most powerful chaebol of South Korea, from Chung Kyung-sun, CEO of Root Impact; Chey Min-jeong of SK Hynix; Koo Kwang-mo, chairman of LG Group; to Park Seo-won, vice-president of Oricom and CEO of Doosan. Which story did you find the most enticing? Let us know. Want more stories like this? Sign up  here. Follow STYLE on  Facebook,  Instagram,  YouTube and  Twitter . In case you haven’t got over Crash Landing on You, STYLE recaps the hottest news from the hit drama, and helps you decide whether the lead characters are like the celebrities who play them ",
    "datetime": "2020-03-02T19:05:06+08:00",
    "url": "https://www.scmp.com/magazines/style/news-trends/article/3064639/crash-landing-you-hot-news-skincare-secrets-and-fun"
}