{
    "title": "South Korean Women 'Escape The Corset' And Reject Their Country's Beauty Ideals : NPR",
    "text": "Anthony Kuhn A South Korean woman has her head shaved in a photograph taken by Jeon Bora. Having short hair and no makeup is a common symbol of the \"escape the corset\" movement, which aims to reject South Korea's standards of beauty and social pressure to conform. Jeon's photographs document the women involved in this movement in stark black-and-white images.\n                \n                    \n                    Jeon Bora\n                    \n                \nhide caption A South Korean woman has her head shaved in a photograph taken by Jeon Bora. Having short hair and no makeup is a common symbol of the \"escape the corset\" movement, which aims to reject South Korea's standards of beauty and social pressure to conform. Jeon's photographs document the women involved in this movement in stark black-and-white images. At a gallery in Seoul's fashionable Gangnam district, the walls are lined with stark black-and-white photographic portraits of young women. Some smile, some stare at the camera impassively. Some are naked. All have short hair and no makeup. It's the third such exhibition by South Korean photographer Jeon Bora, who seeks to document women who reject the country's standards of beauty and the social pressure to conform. The women liken this pressure to a corset and have dubbed their movement, which began last year, \"escape the corset.\" Jeon, 25, describes using her camera lens to show her subjects as they really are, and not how South Korean society wants them to look. Advertising, entertainment and other media in South Korea commonly promote a female appearance that includes a porcelain complexion, luxuriant long hair, lots of makeup and form-fitting dresses. An emphasis on big, round eyes has helped fuel a boom in cosmetic procedures. \"I wanted this exhibition to destroy the socially defined idea of a woman,\" Jeon tells NPR. The exhibition is open only to women. (NPR received special permission to attend.) Just as visually striking as Jeon's portraits is another wall at the gallery, covered with before-and-after photos submitted by her subjects who \"escaped the corset.\" In some cases, the change is so drastic that it's hard to believe the two pictures are of the same person. A pedestrian walks past an ad for a cosmetic surgery clinic at a subway station in Seoul in 2014. Such ads were later restricted after complaints that they were fueling an unhealthy obsession with body image.\n                \n                    \n                    Jung Yeon-Je/AFP/Getty Images\n                    \n                \nhide caption A pedestrian walks past an ad for a cosmetic surgery clinic at a subway station in Seoul in 2014. Such ads were later restricted after complaints that they were fueling an unhealthy obsession with body image. Jeon herself was largely spared pressure to conform to South Korean standards of beauty because she was a judo athlete in high school and had to put athletic performance above all else. But no sooner had she quit the sport and started college than friends started to comment about her lack of makeup and loose, unisex clothing. \"You're not taking care of yourself,\" she recalls them saying. \"Do you want me to teach you how?\" She declined. As she became aware of the \"escape the corset\" movement, she set out to document its effects on other young women. When she photographed her subjects, she asked them to fill out questionnaires asking what message they wanted to convey in order to understand them better. Jeon Bora is a photographer seeking to document women who reject South Korea's standards of beauty. Her aim in a recent exhibition was \"to destroy the socially defined idea of a woman,\" she tells NPR.\n                \n                    \n                    Claire Harbage/NPR\n                    \n                \nhide caption Jeon Bora is a photographer seeking to document women who reject South Korea's standards of beauty. Her aim in a recent exhibition was \"to destroy the socially defined idea of a woman,\" she tells NPR. One responded: \"Dear sisters and friends, I wish we could become humans that exist as we are, and love and be loved as we are. You are you, I am me, we are us, without the makeup, without the corset. Just a human. I love you, always, as you are.\" Jeon also encouraged her subjects, who were at various stages of \"escaping the corset,\" to look at themselves without makeup or photo editing. For many, she says, this was awkward at first. Some cried during their photo shoots. Jeon describes using her camera lens to show her subjects as they really are, and not how South Korean society wants them to look.\n                \n                    \n                    Jeon Bora\n                    \n                \nhide caption Jeon describes using her camera lens to show her subjects as they really are, and not how South Korean society wants them to look. \"They said they didn't have the confidence to look themselves in the eye,\" she recalls. \"But after several viewings, they started to pick out the pictures they liked and find features that they like about themselves.\" The movement is most visible on social media, where women have posted defiant pictures of hair they've shorn and cosmetics they've smashed, with a Korean hashtag meaning \"proof of discarded corset.\" Yoon-Kim Ji-Young, a professor at the Institute of Body and Culture at Konkuk University in Seoul, argues that in South Korea, women are up against a multibillion-dollar industrial complex, including cosmetics, plastic surgery and entertainment, which sends women mutually reinforcing messages. \"This huge mechanism unilaterally defines the ideal body image for young women, as well as the direction and size of their dreams,\" she says. As a result, she says, many young Korean women aspire to become YouTube makeup coaches. Traditionally, she says, Korean women are taught that beauty is their biggest asset. By getting married, they can exchange that asset for social and economic status. Even today, such views affect women's options and choices related to careers, marriage and motherhood. Rejecting beauty standards leads some women to rebel against an entire social structure, she says, and that means boycotting romance, marriage, sex and childbirth. \"Women are not simply looking to destroy the cosmetics industry by smashing makeup,\" she says. \"Their aim is to subvert the huge male-centered matrix called the patriarchy.\" Yoon-Kim adds that not until they have \"escaped the corset\" do many women realize that they've been taught to blame themselves for the discrimination they encounter, and to feel that it's their own fault for not being young, skinny or pretty enough. A 2017 poll found that nearly 40 percent of respondents experienced discrimination based on their appearance when applying for jobs. Applicants are commonly asked for photos, as well as information about their height and weight. \"The constant feeling of obsession, self-hatred and fatigue in this competitive society,\" she says, \"robs us of the energy to address its fundamental, structural inequality.\" Kim, 20, is a college fine arts major who draws cartoons about women who rebel against beauty standards. \"Keep your sorrow brief and your anger long,\" one of her characters says. \"That anger will be your revolution and your beginning. The harsher the backlash, the greater your relief will be.\"\n                \n                    \n                    Claire Harbage/NPR\n                    \n                \nhide caption Kim, 20, is a college fine arts major who draws cartoons about women who rebel against beauty standards. \"Keep your sorrow brief and your anger long,\" one of her characters says. \"That anger will be your revolution and your beginning. The harsher the backlash, the greater your relief will be.\" Some women say they've paid a high price for escaping the corset — they've been fired from jobs, and reportedly even assaulted. Such stories make other women fear for their own safety. Kim, a 20-year-old college fine arts major who asked for reasons of security that NPR use only her surname, says she was harassed by strangers and her own family after she cut her hair last summer. She decided to do it simply because having long hair was too hot. \"When you get an undercut, men stare at you on the street,\" she says. \"They look at you up and down. My parents asked me, 'Why did you cut your hair? Have you gone out of your mind?' They even asked me if I'm a lesbian.\" These reactions prompted her to question her beliefs about beauty. To help give other women courage, she started drawing cartoons about women taking actions to escape the strictures of beauty. One popular scene from her cartoons, which she posts in an online community, shows an anguished young woman sweeping a table full of cosmetics onto the floor. \"Keep your sorrow brief and your anger long,\" advises another character. \"That anger will be your revolution and your beginning. The harsher the backlash, the greater your relief will be.\" Kim was encouraged to see some quotes from her cartoons on placards carried by feminists last summer in Seoul at street protests against spy cams in women's bathrooms. She tried to raise about $500 online to support her work and says she has received 300 times that amount. But she says her escape from the corset has brought mixed results. On the one hand, she has found that men now treat her as an equal. They give her access to social circles and information previously forbidden to her. They invite her to smoke with them after classes. But they don't invite other women whose appearance is more conventional, and she feels that she is treated simply as one of the guys. Seoul bureau assistant Se Eun Gong contributed to this report. Sponsor Message Become an NPR sponsor ",
    "datetime": null,
    "url": "https://www.npr.org/2019/05/06/703749983/south-korean-women-escape-the-corset-and-reject-their-countrys-beauty-ideals"
}