{
    "title": "South Korean High Schoolers Get Plastic Surgery for Graduation  - The Atlantic",
    "text": "\"It's common to change one's face in Korea.\" '\"I think I'm ugly, and nobody wants to love me. Just like her I wanna be pretty. I wanna be pretty,\" sings Lee Chae-lin, member of the four-person Korean girl group 2NE1. The song, \"Ugly\" was released in July 2011 in South Korea and rose to number one in the Korean charts. One reason for its success is that its themes -- of insecurity, social awkwardness and body awareness -- resonated deeply within South Korea, a culture where children are bred to be brilliant, in both studies and appearance. \"That song was a backlash against the cookie cutter images of beauty you see here,\" said Mallory Thornberry, a Florida native who moved to South Korea in 2009 to teach English. \"Despite the lyrics, the band members have also had surgery and fit the ideal beauty standard here.\" When students at Gumi Girls High School told Thornberry, 30, that she had a small face, she was offended. \"I thought they were making fun of me,\" she said. \"I've been teased about having a small head on a big body before.\" It was only when Thornberry mentioned this comment to her fellow teachers that she realized it was a compliment. \"I'd just moved to South Korea to teach English, and everything was new to me. The idea of certain physical traits being coveted and considered beautiful hadn't crossed my mind.\" This wasn't Thornberry's only surprise. \"There were multiple mirrors in the school, full length ones in every hallway,\" she said. \"Men and women here are always looking in mirrors, and they're not shy about it.\" Large scales were on the second floor corridor of the school, free for any students to use. \"Weight is tied to health and beauty here,\" said Thornberry. \"If Koreans think you are overweight, they're not shy of telling you to your face.\" Thornberry didn't have this problem, as her slim physique, blonde hair and blue eyes represented a certain stereotyped American ideal. \"This teacher, she is pretty,\" said schoolgirl Ye Jin-Kim, 16. \"Small face, big eyes, oh so pretty.\" Jin-Kim doesn't regard all her teachers so highly. \"We had an art teacher who went to have a baby and she came back with a new nose. She looked so much better!\" Cosmetic surgery is rampant in Gumi Girls High School -- and indeed, in all of South Korea. The International Society of Aesthetic Plastic Surgeons reported that one in five South Korean women have had some form of surgery, and this number includes adolescents. The most common procedure by far is that of the double eyelid, also known as blepharoplasty. This type of surgery creates an extra fold of skin above the eye that is visible when the eyes are open. Only around 50 percent of the East Asian population is born with a natural \"double lid.\" Jin Kim is planning to have eyelid surgery next year when she graduates high school. She will be joining a large number of her classmates when she does so. \"In our school most students want to have a plastic surgery,\" Seonghee said. \"They plan to do it during their ... winter vacation.\" A number of her friends have already undergone this process, and she thinks it's very pretty. There is also no stigma attached. \"Why would there be?\" she said. \"It's common to change one's face in Korea.\" \"Students would come back from vacation and tell me that they had gotten eyelid surgery,\" said Thornberry. \"It was very strange, as my background predisposes me to tell them that they don't need to change anything, but they are looking for congratulations -- they want me to tell them that they look 'pretty' now.\" One of the main reasons that eyelid surgery is so prevalent here is that it is considered on par with beauty treatments, not surgery. Citizens see it as so minimally invasive that they rarely take time off work or studies afterward. The practice dates back to the 19th century: In 1896, Japanese physician known as Mikamo performed the first recorded double-eyelid surgery in Japan. His motivation was to make the Japanese face \"more attractive\" during a time of cultural transition. These days, an increasingly skilled workforce needs to unwind, and the Korean Pop scene provides a respite to those working 16-hour shifts. Pop singers shape the youth culture and alleviate work stress through repetitive songs and flirty short skirts. They've created a beauty physique that is adored by both sexes, and their blend of lighthearted pop and innocence has lead to their images being plastered onto everything from cereal boxes to beach towels and socks. This type of beauty is idolized by Korean media, and its influence has led to specific requests in cosmetic surgery clinics. \"Some patients bring photos of K-pop stars and request to look like them,\" said Kevin Van Noortwyk, the international business development coordinator for JK Plastic Surgery Center in Seoul, South Korea. \"One's appearance is very important in this country. Competition is fierce here to get a job, find a partner and so on.\" Korean dramas regularly feature a society where cosmetic surgery is a large part of the plot, thus normalizing the concept of operations and changing the way the citizens view the procedures. A good example of this is the 2006 movie 200-Pound Beauty. \"It stars a fat girl who is really good at singing,\" said Bae Seonghee, 16, earnestly. \"But she sings at the back of the stage as she is ugly. A doctor does plastic surgery on her whole body and she becomes a singer.\" The movie doesn't shy away from graphic detail, and it focuses on the transformation of the body through face reshaping, liposuction, and what is essentially a face transplant. A new body is revealed, and actress Kim Ah-Joong then needs to re-adjust her expectations of what being beautiful means. Ironically , Ah-Joong was later \"outed\" as having had double jaw surgery. \"The place of plastic surgery narrative in Korean popular culture is a great indication of how normalizing it is there,\" said Sharon Hejiin Lee, an associate professor in the Department of Social and Cultural Analysis at New York University. \"All these films with sub narratives about minor characters that have had or are having plastic surgery. The stars of pop culture are getting younger, and so are their fans.\"  Another influence for Korean schoolchildren is their struggle to get ahead. The attraction of cosmetic surgery lies in the notion of being able to transform yourself, to create an identity that you feel you should have been born with, regardless of nature and history. Living this kind of \"knifestyle\" does indicate issues within the society, but that's an easy point to argue that from the outside. Enmeshed in the culture, it's easy to see why so many might change their faces to fit in. \"Investment is the key word people use,\" said Hejiin Lee. \"Forget about procedures, it's about investment in their futures, whether it's about getting a better job or a better husband, people are thinking about this in economic terms.\" ",
    "datetime": "2013-06-27T13:00:51Z",
    "url": "https://www.theatlantic.com/international/archive/2013/06/south-korean-high-schoolers-get-plastic-surgery-for-graduation/277255/"
}