{
    "title": "South Korea’s next big economic leap: innovation - The Globe and Mail",
    "text": "This article was published more than 9 years ago. Some information may no longer be current. Memebox’s Doin Kim is among a new breed of South Korean entrepreneurs.NATHAN VANDERKLIPPE/The Globe and Mail Suzy Mortemer looks at the camera through a heavy veil of makeup. She wears her hair midnight black on the left, platinum blond on the right. On the YouTube video, her eyes pop out behind striking circle lenses – cosmetic contact lenses, popular in some Asian countries, that make the iris appear larger. She pulls out a bag of \"natural cocoon peeling silk balls.\" The contents are, she explains, a tidy passel of exactly that: silkworm cocoons, designed to be heated in water, worn on a finger like a glove and used to scrub away dirt, dead skin and facial makeup. \"I'm kind of creeped out by it, guys,\" she says. \"Like, no joke, there's all kinds of organic matter on these. They are actual cocoons.\" But there's a reason Ms. Mortemer, a California makeup reviewer, is trying them out, along with a cocoon facial soap she's also pulled from a box of other beauty products delivered by Seoul startup Memebox. \"Because it's one of the top-selling products in Korea right now. So why wouldn't I want to try it?\" South Korea is the world's top shipbuilder, a major oil refiner, steel maker and car manufacturer. But beneath the glittering skyline of Seoul, that industrial might is giving way to something more creative. It's something the country's leaders hope will be transformational as they struggle to find a new footing amid the dimming of the last few decades of incandescent growth. Seoul today is home to a thriving K-pop music and soap opera industry that has the world lusting for South Korean fashion and cosmetic surgery, beauty products – not to mention the coterie of ambitious entrepreneurs bringing those products to the world. When Stephen Harper landed in Seoul this week to conclude Canada's first free-trade agreement with an Asian country, he was there to smooth the path for Canadian beef and whisky into South Korean fridges, and for cheaper Hyundais and Kias into Canadian driveways. But he was also building a Pacific-spanning corridor to a nation with a growing thirst for modernization, one that has found ways, in part by spurning conventional Western wisdom, to ignite the kinds of innovation that have often eluded Canada. There is broad agreement, in business, politics or otherwise, that \"without innovation, we, Korea, cannot live,\" says Sung-Soo Seol, who leads the Seoul-based Hi-Tech Business Research Institute and edits the Asian Journal of Innovation & Policy. \"Silicon Valley is the target of many levels of Korean policies.\" Little more than a century ago South Korea, much like its northern cousin today, was an imperial hermit kingdom, closed to the outside world and poor. But a flourishing of democracy – with a boisterous legislature frequented by brawls and even smoke bombs – and years of government-directed growth have brought a transformation more striking even than its headline-grabbing neighbours. South Korea is unencumbered by the heavy-handed oversight that plagues China, or the sometimes-oppressive insularity in Japan. It's also the beneficiary of decades-long government efforts to make South Korean brains the source of its wealth. No other developed country is more literate, or spends more in relative terms on research and development – nearly 3.5 per cent of South Korean gross domestic product, and growing at 10.5 per cent a year since 2002. The government is obsessed with turning the mountainous wedge of a country – a bit bigger than Nova Scotia, with a population of 50 million – into a nation of high-tech titans. Within months of taking office last year, South Korean President Park Geun-hye met with Bill Gates, Facebook Inc.'s Mark Zuckerberg and Google Inc. co-founder Larry Page. She has since sought to make good on promises to build up a \"creative economy\" for the country. Canada is already home to some 200,000 people of Korean descent, and the deepening ties to their homeland offer promise to Canadian inventors looking for new buyers for their technologies. But South Korea also offers competitive peril. Among its most vibrant corporate offspring is a mobile chat company now signing up millions of new subscribers in Indonesia, eating up market share in a region where BlackBerry Ltd. has pinned its fortunes. It's now easier to slap together a startup in Seoul than San Francisco, says Jimmy Rim, a youthful venture capitalist who founded K Cube Ventures. He said he sees 30 to 40 new business plans a week. Among the new entrepreneurs is Hyungseok Dino Ha, the 30-year-old who co-founded Memebox (pronounced mee-mee-box) with partner Doin Kim. Born in South Korea and educated in the United States, Mr. Ha ditched a job with Tom Ford, the fashion name, for the thrill of startup culture. The company sends out boxes with an array of beauty products – moisturizers, fragrances and yes, cocoons – to subscribers and is slowly developing its own brand of beauty goods. In two years, Memebox has grown to 260,000 South Korean users, and another 10,000 American and Canadian ones, each sampling and buying goods from 450 partners, including Estée Lauder and L'Oréal. It has 80 per cent of the online beauty market in South Korea, and nearly 80 people on staff, most of them women. Mr. Ha is currently in Palo Alta, Calif., as the first South Korean company at Y Combinator, the prestigious startup accelerator. The workload – only four hours off on Saturdays – is as enormous as the ambition, which is to grow by 10 per cent a week. Last December, Ms. Park, the South Korean president, sent him a rice cake with best wishes for 2014. It hit home that \"she really cares about innovation and I should really try to help and do what I can,\" he said. \"I'm on a mission that the Korea brand – or Korea itself – has to really stand out in the world.\" Growth miracle at risk South Korea has 0.03 hectares of arable land per person, placing it in the company of Greenland and Kuwait (Canada has 42 times that). Its energy supplies are minuscule, pumping just 1,000 barrels of oil a day in 2011; it used 2.2 million. The lack of natural resources has long made innovation a do-or-die question for the country, but perhaps at no time more than now. In the 1960s, the average Seoul worker made as much as someone in sub-Saharan Africa; today, the city's wealthy Gangnam district sports a Ferrari dealership. South Korea has succeeded by doing just about everything Western thinkers tend to oppose, not least using a dictatorship to establish a series of monopolies in car manufacturing, chemicals, steel, shipbuilding and electronics. For decades, that model worked. \"If you look at the Korean industrial topology, you will find that in all of these five areas, we have the top firms in the world,\" said Wonjoon Kim, an associate professor at the Korea Advanced Institute of Science and Technology, who studies the economics of innovation. But the growth miracle is at risk of becoming history. Those industries face increasingly difficult prospects. Recent years have seen slowing GDP growth and growing levels of indebtedness. The International Monetary Fund projects growth of about 3.7 per cent this year, though some forecasts are lower. South Korea's risk-averse banks are among the least profitable in their peer group, and the country suffers from a deep conservative streak sometimes mixed with toxic gender imbalances. Ten conglomerates account for more than 75 per cent of the country's GDP. Young people face such strong expectations from parents to work for those stable giants that some risk being booted from home if they strike out on their own. \"These are probably the most fiscally conservative people on Earth. Behind the Estonians maybe, but that's about it,\" says Isabelle Mateos y Lago, the IMF's mission chief for Korea. Something has to give, Ms. Park said in February. The old model has \"reached its limit,\" the President said in a major speech unveiling a plan to boost research and development spending to fully 5 per cent of GDP, and pour more than $4-billion into sparking new startups. \"Unless we change the fundamentals of the economy and break from the trap of slow growth, there will be no future for us,\" she said. The question is how to find a new future. The answer likely lies in the distinct advantages South Korea already possesses. \"This is by far the most educated population on the face of the planet,\" Ms. Mateos y Lago said. \"That has probably contributed to a development model that was more tilted towards high technologies than in other places.\" And it has outpaced other countries in building lightning-fast, cheap Internet connections, which has \"really helped us to build a data-intensive kind of society,\" said Sirgoo Lee, co-chief executive officer of Kakao Corp. Kakao is South Korea's chatting and gaming heavyweight, and one of its digital stars, with an estimated value of $2.4-billion (U.S.) and plans for an initial public offering in 2015. It believes chat apps are as central to phones as search has been to the desktop Internet. And the company is going abroad, with roughly half its 140 million users now overseas. The biggest group lies in Indonesia, where in a year it has gained some 15 million people. The company is well aware it's eating away at BlackBerry's prospects in what has been one of the Canadian company's brighter markets. In many ways, that's the goal. And Kakao has something Waterloo, Ont., doesn't: the power of BigBang, a South Korean boy band the chat company has made the frontman of its overseas advertising. In the long list of factors underlying the country's innovation success, pop music hardly rises to the top. But it has become surprisingly important. In Indonesia, where BigBang is popular, its five-member ensemble – once called the \"gods of K-pop\" – are paying surprising dividends for the country. \"The fact that our service is Korean really does appeal to the local population\" in Indonesia, Mr. Lee said. \"Korea symbolizes being hip, being innovative. They think that really shows who we are. So it's a good match.\" Follow Nathan VanderKlippe on Twitter: @nvanderklippeOpens in a new window Report an error Editorial code of conduct Build your personal news feed Build your personal news feed © Copyright 2023 The Globe and Mail Inc. All rights reserved. Andrew Saunders, President and CEO ",
    "datetime": "2014-03-14T19:30:00-0400",
    "url": "https://www.theglobeandmail.com/report-on-business/south-koreas-next-big-leap/article17504954/"
}