{
    "title": "South Korea brings BTS, Squid Game and K-beauty to the globe as a soft power counter to China's economic heft - ABC News",
    "text": " South Korea brings BTS, Squid Game and K-beauty to the globe as a soft power counter to China's economic heft Surrounded by China to one side and Japan to the other, Korea's geography is a blessing and a curse. Its relationships with its bigger neighbours have always been complicated. But in recent decades, that proximity has been advantageous for Korea's growth. Its economy has boomed in part because of China's extraordinary rise and hunger for Korean products and services. Computer chips are needed to power everything from phones to cars to fridges and keep economies rolling. But a global shortage is sparking a battle for control. Although Korea has enjoyed the benefits of its proximity and tight links with the Chinese economy, it knows that such ties also carry great risks. \"China accounts for about a quarter of Korea's total trade. Since Korea's economic structure is highly dependent on exports, economic retaliation from China could be fatal,\" economist Kim Gwang Seok said. \"Korea is afraid of China.\" But while China might have an outsized economic advantage against South Korea, Korea has a major card up its sleeve; it's now one of the most culturally influential nations on earth. In recent years, Australian producers have learnt the hard way that China is willing to disrupt trade to make a political point. Australia's barley, lobster and wine exports to China all substantially fell after Chinese leaders took offence to a range of perceived slights, including a call for an investigation into the origins of COVID-19. South Korea learnt the lesson first, five years ago. In 2016, the South Korean government had agreed to install a United States missile defence system, the Terminal High Altitude Area Defense or THAAD. The South Koreans said it was about protecting the country against North Korean aggression, but China saw it differently, as a check on its own military capabilities. Chinese Foreign Minister Wang Yi said at the time it would \"directly damage China's strategic security interests\". After unsuccessfully lobbying diplomatically for the plan to be shelved, China flexed its economic muscle. Through a range of measures, the Chinese government punished parts of South Korea's economy including department stores, exports, K-pop groups and outbound Chinese tourism. \"Since Chinese tourists account for more than half of the total number of tourists to Korea, if Chinese tourists are blocked as in the case of the THAAD retaliation, Korea's travel services almost paralysed,\" said Mr Kim, from the Institute for Korean Economy and Industry. \"Various service industries connected with travel services, such as airline services, duty-free shops, travel, hotels, and lodging businesses, all suffered at the same time.\" South Korea's vulnerability to Chinese coercion was exposed and the country set about diversifying its markets to reduce its reliance on the economic superpower. More recently, China's war on 'sissy men' was seen by some as an attack on one of Korea's other economic engines, K-pop. Although the crackdown was supposed to be directed particularly at Chinese pop stars who were deemed too effeminate, given how much they drew their cues from their Korean contemporaries, it again demonstrated how a change in policy in China could have an outsized impact in Korea. Despite these setbacks, in 2021, South Korea has never had so much social and economic capital. The country has outperformed almost all others in terms of weathering the pandemic storm. Despite borders being put up or strengthened all around the world, this highly export-oriented country has had a stellar 2021. The president says he expects exports will hit $US630 billion this year, well up on the previous record of $US604.9 billion set back in 2018. It's the fastest recovery among the G20 nations. The OECD expects South Korea will grow at 4 per cent next year. There seems to be an insatiable hunger for South Korea's high-tech gadgets including the fundamental building block, computer chips. Consumers around the world striving for Ulzzang — \"best face\" — are buying up every Korean beauty product they can get their hands on, from sheet masks to snail serum. Since cracking the US market around 2011, the industry has risen dramatically, with one study predicting K-beauty could be worth $US13.9 billion by 2027. International consumers are also thirsty for Korea's pop and movie stars. Super group BTS continues to set new records for their output, recently collecting the American Music Award for best artist to complement the billions of streams and views of their music and videos. Last year Bong Joon-ho's Parasite won the academy award for best film. This year Squid Game has become a massive surprise television hit. Ten other popular shows and moves from South Korea you might've missed. Both artistic representations give a more complicated picture of modern Korea than the saccharine, purposefully non-confrontational music embodied by K-pop acts like BTS. But their popularity and acclaim demonstrate that the world is interested in South Korea and wants to buy what it's selling. The Korean cultural ascendancy itself was not an accident. The South Korean government recognised the soft power and that cultural exports and have been active in cultivating the sector. Now that the so-called 'Hallyu', or 'Korean wave', is washing through the region, it's marshalling its power to help sell other Korean products. \"The boom of Hallyu has provided a new opportunity to promote Korean products,\" said Kim Hyun-beom, manager of consumer goods at the Korea Trade-Investment Promotion Agency (KOTRA). \"The recent popularity of the Korean pop culture industry such as K-pop, K-dramas and movies, helps naturally promote the Korean consumer goods in other countries.\" Some manufacturers are directly cashing in on Korea's current cultural might. K-pop fans have raised money for Black Lives Matter, humiliated Donald Trump, and criticised Thailand's Government. Now they're rallying for a new cause. Baek Seung's company NP Inc produces the technology used for relatively cheap but glossy K-pop videos. He says despite NP Inc being a private company, the government still provides critical support. \"We are receiving all-round support from the government for the business of creating content and business of making LED-based studios, making it possible to export content such as K-dramas, K-pop and K-movies,\" he said. While Korean cultural cache might organically give Korean products some reflective glow, the government goes much further by trying to directly link up culture and products. KOTRA lines up stars of Korean pop culture to help promote the products of small Korean manufacturers, with K-pop stars' faces adorning the packaging of K-beauty products. \"We are using influencers to help small and medium enterprises increase product awareness and increase exports,\" KOTRA's Mr Kim said. Economist Kim Gwang-seok says the government is right to be focusing on new markets. \"The economic power of South-East Asia and West Asia continues to grow,\" he said. The per capita income is rising at a fast pace, and the economic growth rate is very high. \"Countries such as Indonesia and Vietnam have significant populations, so the market potential is very high,\" Mr Kim said. \"We do not want to leave the Chinese market completely, but rather maintain the current market while concentrating on the newly emerging market. \"It's an organic way of being less reliant on just one country.\" We acknowledge Aboriginal and Torres Strait Islander peoples as the First Australians and Traditional Custodians of the lands where we live, learn, and work. This service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced. AEST = Australian Eastern Standard Time which is 10 hours ahead of GMT (Greenwich Mean Time) ",
    "datetime": "2021-12-29T19:01:57+00:00",
    "url": "https://www.abc.net.au/news/2021-12-30/south-koreas-soft-power-to-counter-china/100726712"
}