{
    "title": "South Korea’s cosmetics exports soar to make it the world’s third-largest cosmetics exporter",
    "text": "Or wait... Headlines Brand Innovation Formulation & Science Packaging & Design Business & Financial Market Trends Regulation & Safety Promotional Features Site Archive Multimedia Regions All Asia-Pacific South East Asia South Asia East Asia Oceania Site Archive Multimedia Hot topics Clean & Ethical Beauty Sustainability COVID-19 Market Entry Anti-Aging / Skin Whitening Beauty From Within Nanotechnology Green Cosmetics Site Archive Multimedia Resources Type of resources Events All Events Shows & Conferences Online Events Editorial Webinars Events China 中国 Podcast  28-Jun-2021\n                            - Last updated on\n                                28-Jun-2021 at 01:48 GMT Related tags\nk beauty\nSouth korea\nExport According to data released by the Ministry of Food and Drug Safety (MFDS), the country’s combined exports of cosmetics products increased 16.1% to KRW8.28tn (U$7.28bn) in 2020. These figures now place the country ahead of other leading cosmetic exporters such as Germany, Japan, Italy and China. China was the biggest importer of K-beauty last year at U$3.8bn, accounting for more than half of total exports. After China, top importers of K-beauty goods were Hong Kong with U$714m, the US with U$640m, Japan with U$639m, and Vietnam at U$263m. Exports to markets such as Russia, Indonesia, Australia, the UK, Poland, Canada and Kazakhstan all increased. Furthermore, South Korea had diversified its export countries from 137 countries in 2019 to 160 countries in the past year, helping to boost the country’s exports. With increased overseas demand, South Korea reported a cosmetics trade surplus of KRW7.92tn (U$6.4bn) in 2020, up from KRW6.15tn (U$5.4bn) a year earlier. South Korea’s first recorded a cosmetics trade surplus of over KRW100bn (U$87.9m) in 2012 and that figure has been steadily increasing over the years with the growing popularity of Korean pop culture, including its beauty influence. In terms of export volume, cosmetics outperformed home appliances, smartphones, and pharmaceuticals, which were valued at $7bn, $4.1bn and $7.2bn respectively. Overall, cosmetics products accounted for 14.3% of the country’s combined $44.86 billion trade surplus, rising from 13.6% in 2019. Meanwhile, South Korea cosmetic imports were valued at $1.16bn. At U$366m, France was the country’s biggest exporter, followed by the US and Japan with $279m and $119m worth of exports respectively. However, South Korea’s domestic cosmetics production dropped 6.8% to KRW15.2tn ($13.4 billion) in 2020. However, because of the pandemic, production performance by category was mixed. As the demand for sanitising products such as hand sanitiser increased, production also increased by 20.5%. On the other hand, production of make-up products fell 21.5% over the year due to the decreased demand for make-up in the midst of the pandemic. However, production of eye make-up products remained relatively unaffected by the pandemic, even increasing slightly by 0.3%. South Korean conglomerate LG Household and Healthcare (LG H&H) was the largest producer of cosmetics, beating out rival K-beauty giant Amorepacific. Products from LG H&H’s prestige brand The History or Whoo, as well as Amorepacific’s Sulwhasoo and Laniege were among the top 10 items that were produced and were largely skin care products. Copyright - Unless otherwise stated all contents of this web site are © 2023 - William Reed Ltd - All Rights Reserved - Full details for the use of materials on this site can be found in the Terms & Conditions Related topics\nBusiness & Financial\nEast Asia\nAsia in Focus\nSkin Care\nHair Care\nColor Cosmetics\nFragrance\n COVID-19 Show more  Content provided by Naolys | 07-Jul-2023\n                     | White Paper Naolys presents HairRevive [MM+Zn], a pioneering plant-based ingredient revitalizing hair.  Content provided by Provital | 13-Jun-2023\n                     | Product Brochure Circanblue™ is a vegan postbiotic ingredient obtained from Lactococcus lactis that induces a resynchronisation of the skin’s circadian cycle after this... More promotional features ",
    "datetime": null,
    "url": "https://www.cosmeticsdesign-asia.com/Article/2021/06/28/South-Korea-s-cosmetics-exports-soar-to-make-it-the-world-s-third-largest-cosmetics-exporter"
}