{
    "title": "South Korea is currently seeing a backlash against K-Beauty. Here’s why it’s important | Vogue India",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, visit My Profile, then View saved stories By Suzanne Scott K-Beauty is evolving again, but not in the way you’d expect. After igniting beauty trends on a global scale, South Korea is now seeing an underground revolution that is calling for more realistic beauty standards. So, why now, and what’s changed? The international enthusiasm for beauty technology and innovative delivery systems from South Korea is seemingly insatiable, with retailers, including Sephora, launching dedicated space on their sites for their K-Beauty offering (so-called for its sibling export, K-Pop). This furore accounts for K-Beauty’s value tipping $13 billion with $511 million worth of K-Beauty exported to the US in 2018 alone. Global market research and insights firm Mintel reports that South Korea is now among the top 10 global beauty markets, with facial skincare accounting for 51 per cent of that sum. It also predicts that by 2020, K-Beauty colour cosmetics will be worth in the region of $2.8 billion and facial skincare will hit $7.2 billion. K-Beauty hasn’t only introduced us to new products, it has established a “look” that’s desirable for some but almost mandatory in South Korea. Outward appearance is not merely about self-expression in most traditional South Korean circles, it’s about what is considered feminine and appropriate. Wearing no makeup when you go out, for example, is considered bad manners. And individuals expressing themselves through their makeup is rare; conforming to a homogenised idea still reigns. Delicate features, pore-free, porcelain skin, large, doll-like eyes with sweeping lashes, rose-petal lips and long hair have become a compulsory uniform of sorts. YouTube is buckling under the weight of millions of tutorials detailing how to create this cartoon-esque look and social media filters pick up where the makeup brushes stop. South Korea has a higher per capita rate of cosmetic surgery than anywhere else in the world. Women are asking for procedures to create a double eyelid and surgery to create a narrower jawline. The end goal is a prescribed, youthful appearance and the pressure on women to fit into this unattainable mould is spiralling rapidly. Beneath the cacophony of beauty YouTubers, social influencers and near constant assault of ad campaigns for plastic surgery clinics, a social movement has been bubbling away, and now this rumbling of unease has spilled over into a very loud war cry against the unrealistic societal expectations levied against women. The Escape the Corset movement is South Korean women’s public display of dissatisfaction with the status quo, a challenge to anyone who expects women to dress or wear their makeup and hair a certain way, for what is primarily a traditional male gaze. By Hasina Jeelani By Prabal Sharma By Kejhal Kalra “This feminist movement is symbolic in nature,” explains Alicia Yoon, a South Korean entrepreneur and founder of skincare brand Peach & Lily. “Women are discarding their makeup and cutting their hair short to signify that they will no longer conform to a specific look. Of course you can love long hair and makeup and still be a feminist, but this movement is a way for some women to express themselves and fight patriarchal standards.” Escape the Corset joins other feminist movements happening in Korea at the moment, including #MeToo in the workplace and increasing demands for equal pay. “I think the broader feminist movement is critically important, and the micro-movements that take place within this tapestry, including the Escape the Corset movement is great as it helps to move the needle,” says Yoon. Last year South Korean news anchor Lim Hyeon-ju swapped her usual contact lenses for a pair of glasses on the MBC morning show. They were discreet and not too dissimilar in design from the styles often worn by her male counterparts; the difference being, however, that women do not wear glasses on TV in South Korea, which made Lim the first female presenter ever to wear them on a mainstream network show. A flurry of similarly bold actions have followed in the wake of Lim’s on-air sartorial protest. Former beauty YouTuber Lina Bae posted a video in June 2018 titled “I am not pretty”, in which she goes through the motions replacing her glasses with contact lenses, blending foundation into her skin, buffing multiple eyeshadows onto her lids, applying false eyelashes, mascara, blush and, finally, a vibrant red lipstick. So far, so standard makeup tutorial. However, as the makeup builds, harsh comments about her looks flash up on the screen—presumably from trolls—until she eventually wipes away all of the makeup, removes her contact lenses, puts her glasses back on and gathers her long hair back into a ponytail. The final caption reads, “I am not pretty, but it’s fine… Don’t compare yourself to (a) media image. You’re special just the way you are.” The video has been viewed over 7.7 million times. By Hasina Jeelani By Prabal Sharma By Kejhal Kalra Jiwon Park (who goes by @3xl_joy on Instagram) is a part-time, plus-size model who describes herself as a body positive influencer and activist. She tells me, “There is a saying in Korea that you have to be slim to be a woman. We have been trained to wear certain clothes since school. We wear uniforms—women wear skirts while men can wear trousers. As women, we are suppressing ourselves, we are suffering depression and self-loathing just so we can meet beauty standards.” Frustrated and determined to make a difference, Joy started her own Instagram account where she shares body positive imagery and advice. “I hated myself and I hated my body, but after seeing other body positive accounts I found the courage to change my life and try and bring some of that positivity to Korea. Now I get messages from other girls, telling me that my account has helped them to make changes in their lives too.” While Escape the Corset strengthens its position in the public consciousness, many other women in South Korea are adopting the practice of Skip-Care, where the traditional multi-step skincare regime is abandoned in favour of a simpler, more pared-back routine. Hwa Jun Lee, senior beauty and personal care analyst at Mintel, says, “Skip-Care is a rising trend among beauty minimalists in South Korea. In essence, a backlash against complex beauty routines which are common in K-Beauty.” However, as Yoon is quick to point out, while Skip-Care does reflect a growing desire among women to distance themselves from a time-consuming and conforming beauty routine, it doesn’t carry the same message as Escape the Corset, especially as the trend has mostly been driven by brands looking for a commercial take on the movement. “I think it’s important not to conflate the two,” she says. “Escape the Corset is very much a statement of expression against patriarchal pressures, while Skip-Care is essentially a shortening of a skincare routine. In Korea skincare is still very much part of wellbeing and self-care, and you are unlikely to hear women say they are no longer going to take care of their skin because they want to fight the patriarchy. But some will certainly stop wearing makeup to do so.” This is what the future of makeup, skincare and haircare looks like What makes K-beauty a global skincare phenomenon? Is an essence the skincare step you’ve been missing all along? By Prabal Sharma By Christian Allaire By Haiqa Siddiqui By Matt Simon See more stories Condé Nast India © 2023 Condé Nast. All rights reserved. Use of this website constitutes acceptance of our Terms of Service and Policy and Cookie Statement. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. ",
    "datetime": "2019-07-19T06:07:36.686Z",
    "url": "https://www.vogue.in/beauty/content/south-korea-backlash-against-k-beauty-body-positive-moment"
}