{
    "title": "South Korean Parents Are Making Their Kids Get Plastic Surgery",
    "text": "A South Korean woman who's had both nose and eye plastic surgery. Image via As I'm sure you'll know by now, plastic surgery is a pretty big deal in South Korea. Remember last week when those photos popped up of all the South Korean beauty-pageant contestants who looked exactly the same? Everyone was all, \"Hey, those guys sure do love their surgery,\" with a brief chuckle, before moving on to autotuned Charles Ramsey videos and forgetting about the whole thing. Then, of course, the internet lost its shit in a monsoon of moral outrage and started to scrutinize why Korean girls are trying to look more Western, saying how awful that all is. I decided to call up my girl Sparkles (not her real name), who recently returned to live in her home city of Seoul, to find out what the reaction there was like to all this commotion. Turns out the plastic surgery trend has already become a running joke, with girls laughing about the fact that they probably all have the same doctor and teasing one another about not having their eyelids torn apart enough. She also told me something else slightly worrying. Parents are pressuring their daughters into having cosmetic procedures. It all starts to get a little dark when weapons-grade stage moms are guilt-tripping their daughters into splicing up their faces. Anyway, here's that chat. A plastic-surgery advert on the side of a bus in South Korea. Image via VICE: What's the surgery scene like nowadays?\nSparkles: We have trends, like to tear the inner corner of the eye so it's more almond-shaped. Or, for a while, it was liposuction and putting that fat into your forehead. It's hard to say if they're conforming to a Western ideal of beauty, though—no one will take a photo of a caucasian celebrity to the surgeon and ask for that. That idea may have started off only because white people generally have taller noses and larger eyes, so it's easy to describe it as a Western look, but no one in Korea will say they want to look Western. In Korea, we call doing your eyes and nose the \"basics.\" They're the standard procedures. That sounds like you're ordering a burger: \"I'll just get the basics, thanks.\"\nYeah. Like, \"Oh, you haven't even gotten plastic surgery yet? You should get the basics!\" That's nothing. So many people do it that it's got to the point where people say things like, \"But you only got your eyes and your nose done, it's not a big deal.\" Do you have friends who have had plastic surgery?\nI don't think I have a single friend who hasn't had some kind of procedure done. Everyone has something. Normally they pay for it themselves, but there are a lot of mothers who will pay for their daughters. Everyone is getting prettier and prettier and some parents don't want their child to be the ugly one. It's like in the 90s if you got a Discman because your parents didn't want you to be the only kid at school without one. Why did you decide to have surgery yourself?\nIt wasn't my idea. My mum kept saying, \"It's not that big of a deal, just close your eyes, go to sleep and it's done. You wake up and it's with you for the rest of your life.\" She started saying that when I was in high school. She wanted me to get my nose done because she wanted that transition time before college. A South Korean surgeon showing before and after plastic surgery photos. Image via Why did she want you to do it?\nThe main reason was—and this is true—that, in society, there's an idea that the prettier you are, the more benefits you get. People tend to be more inclined toward attractive people when they make decisions like with jobs. That's the standard of beauty here, so everyone wants to be that way. The culture has made it normal. A lot of people don't think too deeply about it. They're like, \"Oh I wish my eyes were bigger—OK, I'll go get it done.\" Do you notice these benefits now that your face has changed?\nI personally—not only in Korea, but while traveling—have noticed that people are nicer to me. I feel that I can get away with more. You're going to rob a bank, are you?\nNo, I'm not saying I take advantage of it, but I feel like the way people treat me is different. It makes me feel like people were right. I read somewhere that, psychologically, people trust prettier people more. Was it weird seeing your face for the first time?\nI was on pain meds and sleeping medication for a week when I had my nose done, so I literally just slept. When I first saw it, it was really weird. I thought it looked too tall, I didn't like it and I didn't think it suited my face. When I got used to seeing myself with my new nose, though, it was that feeling like when you go shopping and get the perfect outfit and you're happy that it's yours and you can't wait to wear it. It's that feeling times a million—just so amplified. And your dad wanted you to get your ears done too, right?\nYeah, one was smaller than the other. He was very emotional about the fact that I would one day feel self-conscious at my wedding when I put my hair up. So weird. A plastic surgeon in South Korea checking his nose job handiwork. Image via Have you had anything else done?\nI've had my eyes done, and that's really freaky because you have to stay awake. They use local anaesthetic on your eyelids and below your eyes. It was horrible because you can feel something going through your skin, like when they're tugging thread through it. I was covered in sweat because I was so nervous. I had it done at the same time as my nose, but it didn't heal well, so I got it done again. Initially it was my mom who wanted me to do that. Were you scared before surgery?\nI was mostly worried that people would be able to tell. I kept saying to the doctor, \"Please can you do my nose as natural as possible?\" And he sort of got annoyed at me and was like, \"Why don't you just not do it then? Why would you get surgery if you don't want anyone to know?\" His consultant told me not to worry and that humans are creatures of adaptation, which is true; I can't imagine my face before. It was meant to be eyes first then nose, but since I was so scared they just put me to sleep and did my nose first. Do you ever look at old photos of yourself?\nIt's shit. Like I said, I can't even imagine my old face. Around the house, that's also a very lighthearted joke in our family. I'll say I have to set the photos on fire and my dad will throw me a lighter. The presurgery photos I've kept on Facebook aren't closeups or in focus. At first I didn't care, but then I started making new friends, so I thought I should delete them. If someone asks me if I've had my nose done, I won't lie, but I'm not gonna be like, \"Hi, I'm Sparkles, I got my nose done,\" you know? It's not a very common topic socially—people are more interested in which procedures you had done and where. Are you more confident?\nDefinitely. The exciting thing was that I could change my hair for the first time. I always had long and wavy hair because different facial types suit different hair, so when I got it done I cut it all off. Also, with single eyelids it's very hard to wear make up. Eyelashes look shorter and eyeliner and eyeshadow aren't visible. Now that I've got double eyelids I can do so much. It's fun! Great. Thanks, Sparkles! Follow Camille on Twitter: @CamStanden Watch - Fashion Week Internationale: Seoul Fashion Week By signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content. ",
    "datetime": null,
    "url": "https://www.vice.com/en/article/avnb7z/south-korean-parents-are-making-their-kids-get-plastic-surgery"
}