{
    "title": "South Korea’s exports of cosmetic products continue to soar - Premium Beauty News",
    "text": "Korean cosmetic products are still doing it pretty good around the world. Actually, South Korea’s beauty exports reached US$ 2.75 billion in 2015, an increase of 53.6 per cent over the previous year, according to statistics from the Korea International Trade Association (KITA).  The country’s cosmetics exports have enjoyed double-digit growth since 2010, surpassing the US$ 1 billion mark in 2013. Korean make up and skincare brand Toly Moly is entering European markets with Sephora. This strong growth contrasts with Korea’s overall exports that dropped by 0.2 per cent in 2015 due to the lack of global demand.  Indeed, Korean cosmetic makers have been able to take advantage of the strong demand in the neighbouring Chinese market. Exports of South Korean cosmetics to China doubled in 2015, confirming the popularity of K-beauty in the country.  Sales to China reached US$ 1.09 billion in 2015, accounting for 39.5 per cent of South Korea’s exports of cosmetic products. “The influence of Korean beauty brands is such, that the ’Seoulista’ virus has stormed over all the Asian countries, especially China. This Korean beauty is truly staged,” explain the organisers of the MakeUp in Seoul tradeshow, which will be held on 6-7 April 2016. Korean beauty brands now stand right behind French brands in China, but rank before Japanese (3rd) and US (4th) brands. Innisfree, the budget cosmetics brand owned by South Korea’s beauty giant AmorePacific, is a good illustration of this success. It is now one of most popular Korean beauty brand in China.  It has now expanded its number of stores in China to 100, since opening for the first time in 2012. After China, Hong Kong is the second destination of Korean cosmetics exports. In 2015, Korean cosmetics exports soared to US$ 663 million, a growth of 64.4 per cent compared to 2014. However, the downside of the K-beauty boom is that another business is booming in China: counterfeits of Korean brands. Beyond Chinese markets, Korean brands are also expanding in the rest of the world, primarily in the USA.  In 2015, Korea’s exports of cosmetic products reached US$ 663 million, up 56.1 per cent compared to last year.  USA are now the 3rd destination for ‘made in Korea’ beauty products. Korean manufacturers are eager to quickly increase their global footprint by leveraging on their reputation of makers of quality and trendsetting products.  The AmorePacific Group (Laneige, Etude House, Innisfree, Sulwhasoo, etc.) has recently launched in the Middle East, starting in Dubai, with the aim to rapidly grow in Saudi Arabia, Turkey and Iran.  The group also intends to launch some of its brands in Latin America. Similarly, Korean make up and skincare brand Toly Moly, which is already sold in Sephora’s stores in the US will soon be sold in the beauty chain’s stores in fifteen European countries. As far as Europe is concerned, while Korean cosmetics exports are still low they are growing quickly. In France alone, they rose by 140.3 per cent in 2015 to reach US$ 15 million. The annual premium and luxury packaging trade show broke its attendance record for its 2023 edition, which was held... The expression “Beauty Tech & Skincare” now marks the entry of tech into the beauty sector. Several major brands offer to decode the... The quest for youth has existed for centuries, despite the inevitable effects of time on the body. Research shows that skin aging in... The quest for “in-and-out” beauty is gradually gaining ground in Europe, North America, and Brazil. This form of holistic beauty is meant... © 2023 Premium Beauty Media ",
    "datetime": null,
    "url": "https://www.premiumbeautynews.com/en/south-korea-s-exports-of-cosmetic,9409"
}