{
    "title": "South Korea’s Growing Obsession with Cosmetic Surgery  - ABC News",
    "text": "An estimated one in five South Korean women has had some sort of work done. June 20, 2014&#151; -- America is a country obsessed with plastic surgery. Countless tabloids and gossip sites constantly speculate on what celebrity has had work done and where. Americans dished out an estimated $12 billion on cosmetic enhancements last year alone. But there is a foreign city where plastic surgery is even more extreme than here in the U.S. Roughly 7.5 million people have traveled to this plastic surgery mecca to get work done, where there is an entire district filled with plastic surgery clinics. That city is Seoul, South Korea. There, “Gangnam Style” has become a worldwide phenomenon -- Korean pop star Psy's music video is the most watched video in YouTube history, with more than two billion views.  A staggering one in five South Korean women has had cosmetic work done, compared to about one in 20 American women, according to the International Society of Aesthetic Plastic Surgeons. Korean women are seemingly trying to emulate the doll-like features of the K-pop girls in the \"Gangnam Style\" video and bands like Girls Generation. Christina Lim, 19, is one of those women. Plastic surgery is “a normal thing,” she said. “My friends, they would actually just go on vacation and then they would come back with a new face.” Lim has appeared occasionally as a translator on Korean TV and aspires to make it a career, but feels the pressure to make some serious physical changes first. “I got lots of hate comments, like, ‘Why is she even on TV? Why is she so fat?’ and I don’t have the looks, I don’t have that idol figure, I don’t have that face,” she said. She wanted surgery to have her jaw slimmed down and another to reshape her nose. “I guess everyone wants to look like K-Pop idols,” Lim said. “You have to look pretty, you have to have double eyelids, you have to have your v-line face, you have to be slim, but you have to have big breasts and stuff. “I think everyone is trying to delete this Koreanness,” she added. “In Korea, you go down the streets, you see this girl. And you walk down the street, and you see that girl again. It actually is a different person.”  It’s not just women living in South Korea who feel that way. People from all over the world flock to Seoul for plastic surgeons with expertise in Korean features and competitive pricing. Jessica Choi, a 33-year-old property manager for a real estate company 6,000 miles away in Los Angeles, flew to Seoul to undergo her own plastic surgery overhaul. “I just always feel like my eyes were never big enough. I used to even get made fun of when I was little for having ‘Asian eyes,’” Choi said. “I think the results will be better in Korea because they know the Asian face better.” She hoped to improve surgeries she had in the United States and undergo a series of new ones, including having her forehead reshaped, her eyes extended, her nose and chin reshaped and lip injections. “In high school, my first procedure was getting this double eyelid crease put in, and it made my eyes so much bigger. I remember how exciting that was,” she said. “Just recently, I had my nose done by a Beverly Hills plastic surgeon, sort of a plastic surgeon to the stars ... but it’s still not what I’m looking for. “It was $8,000,” Choi added. “In South Korea, it’s anywhere from $2,000 to $4-5000, so it’s significantly cheaper.” Her motivations for going through with the surgeries were more than just for looks. Choi claimed she was in an abusive marriage.  A few days later, they were recovering in neighboring twin beds in excruciating pain. Lim said she would never go through it again. “It hurts so much,” she said. “I can’t even describe the pain. At nighttime, without the pills, I constantly feel like this knife [is] cutting through my bones, and I can’t say anything because my mouth is open and I’m drooling and I have cotton up my nose from the nose surgery. ... No it was a nightmare.” Choi, too, felt regret after undergoing the surgeries. “I've never gone through childbirth so I don’t know what that kind of pain is like, but I feel like that this is the most pain that I have ever experienced in my life,” she said. “I just feel like I sinned. I feel like I’m hearing God say, ‘Sweetheart why would you do this? I made you perfect.’ That’s just the voice I kept hearing.” In the next few days after her surgery, Choi documented her recovery and, as the pain diminished, so did her regret. Three months after Lim had her procedures, she was still lying in a hospital bed in almost unbearable pain. She was slightly less hard on herself than before when describing her looks. “I wouldn't say pretty, but I can say that I look better now,” she said. “I’m happy with this face now. I’ll live with this face. “It was worth it,” she added. “But still, if I were to tell all my friends, if they don’t have a problem living with their faces, a big face or whatever, I would tell them not to do it. I would tell them to get new friends who like their big faces.” As for Choi, three months after the surgery, the pain she suffered in that hospital bed in South Korea seemed worlds away. “I love it. I feel softer. I feel more feminine. I have more confidence,” she said. I really believed that death would have been better during those first few days of recovery, but it was well worth it. “It’s really been a sort of reflection of what transformation has been going on in the inside of me, and a lot of that is because I feel physically more attractive, and there is value to that,” Choi added. “I’m meeting the world with a fresh face. ... Same firecracker personality, but a new outlook on life.” 24/7 coverage of breaking news and live events ",
    "datetime": null,
    "url": "https://abcnews.go.com/Lifestyle/south-koreas-growing-obsession-cosmetic-surgery/story?id=24123409"
}