{
    "title": "Spa Review: Luxus introduces Korean luxury brand “Phymongshe”",
    "text": "If you’re a skincare fanatic like me, you’d know about the massive, seasonal sales in Seoul. And if, like me, you used to do a yearly girls’ trip there with an empty suitcase, only to return with it absolutely stuffed with skincare and K-beauty steals. And if, like me, you’re currently missing the head-to-toe Korean spa experiences? Well, you’re in the right place: Introducing the Phymongshe treatments at Luxus. Luxus will be opening a new outlet in Central soon, but as of now, the two outlets you can enjoy is in Wan Chai or Parkview estate where I visited. I know, I know — having gone for multiple playdates there in my youth, I had no idea the location housed a whole spa by the entrance. The things you learn as adults… There’s something about entering a wellness space that invokes calm: the soothing, tinkling background music, the soft shades of timber, the beautifully curated products on display. It’s a monthly ritual that I always look forward to, and this time was no different. Luxus at Parkview is a massive space that offers a full range of treatments from body or foot massages, skin-glowing facials, nail care, and even scalp treatments — one that I’ve realized I need to do quite regularly to stave off greasy roots; but I digress, we’re here for a facial. And it’s one that I’ve been excited for ever since learning about Phymongshe, a Korean spa brand that launched for the first time in Hong Kong via Luxus. Couples and best friends alike will be delighted to know that double-treatment rooms are available here; excellent for a spa date to relax and recuperate, while also enjoying a good natter with your pal. Phymongshe is a highly focused Korean skincare brand that seeks to develop treatments to enhance the skin and body. With a philosophy of highlighting “genuine beauty” through a more mindful life, their branding is aesthetically gorgeous (just look at it!) and mindfully formulated. The range is free of parabens, synthetic fragrances and artificial colourants, ensuring a treatment experience with minimal irritants. After a quick chat with the on-site beautician, we determined that, for my slightly dry and dehydrated skin, the Water Blossom Hydrating Facial (HK$1180 / 60 min) would be most suitable for me. For the curious, Luxus also offers an Express Facial (HK$680 / 30 min), a Mindful Moment Signature Treatment (HK$1,980 / 90 min) and various other treatments under the Phymongshe line. The rituals of a professional facial are no revelation. However, I need to gush over the gorgeous, delicate floral aroma of the products throughout the session — so soothing, especially with the soft tunes in the background, that I was lulled into almost a sleep-like state. What more could one hope for out of a treat yo’self afternoon? With how fast-paced life in the city is, it can be hard to justify putting time away for a little self-care, but, in all honesty, a facial should really be everyone’s monthly staple at the very least. If I had more time, I would go weekly if I could! Perhaps my skin was in desperate need of some pampering; the changing of seasons certainly didn’t help, either. Ultimately, it was apparent after coming the treatment that my skin was aglow with the tell-tale Korean ‘chok-chok’ aura. The radiant, bouncy skin of K-Pop starlets. I felt renewed, and my skin looked better than it has in weeks. There’s something to be said about the Phymongshe product line, too. For all the buzzwords that the beautician threw at me, the product line genuinely was as light and effective as they say. Would I recommend this treatment to my friends? Absolutely. The Water Blossom Hydrating Facial is priced at HK$1,180 with a 40% discount for first-timers trying a Phymongshe treatment at Luxus. G/F, 135 Queen’s Road East, Wan Chai, +852 2866 3328 Level 1, Spa & Resort, Parkview Hong Kong, 88 Tai Tam Reservoir Road, +852 2523 8663 Features Editor A perpetually hungry individual paired with an acute dirty martini obsession. You'll catch Sandra waltzing around town from gallery openings to various happy hours. Usually waxing lyrical about her 10-step skincare routine or her latest gadget. Currently missing: long ski runs in Hanazono. Yes, I agree to the Privacy Policy For your daily updates on all things luxury, follow us at @lifestyleasiahk Yes, I agree to the Privacy Policy Subscribe to our newsletter to get the latest updates.  Thank you for your subscription. ",
    "datetime": "2021-11-04T08:51:15+00:00",
    "url": "https://www.lifestyleasia.com/hk/beauty-grooming/skin/spa-review-luxus-phymongshe-facial-treatment/"
}