{
    "title": "Splash Masks: Everything You Need to Know About the Latest K-Beauty Trend | Allure",
    "text": "By Katie Becker The latest K-beauty trend to make it stateside are a new kind of skin treatment: splash masks. These liquid masks, though, aren't anything like the clay (the millennial mask of choice) or peel-off varietals. They actually fall somewhere between an essence and a booster, are meant to bestow the benefits of a mask in seconds. But the name does sound like a bit of an oxymoron, I know: The usual thick goops sit on the skin for 5, 10, or 20 minutes while you catch up on Facebook (or try to carefully eat a snack, if you dare), but these liquids are far more simple. Because it turns out splash masks are a pretty easy way to add some extra benefits into your skin-care routine: dry, oily, or otherwise. Here's everything you need to know about the latest skin-care trend that's going to blow up the K-beauty world. \"In Korean beauty tradition, people used to splash and pat water onto the face repeatedly to mechanically cleanse” cleanse their explains Alicia Yoon, aesthetician and founder of Asian beauty retailer Peach and Lily. (Yoon and her K-beauty brand also launched their own collection curated exclusively for Target, too, BTW). “Some Korean women pat and splash plain water onto their faces up to a hundred times each day to get the deepest clean possible—they swear by the process.” This is of course a hard left from the slew of face cleansers available right now, formulated many different ways for many different skin types. So rather than leave Korean women washing with just water, K-beauty brands an \"a-ha-like moment,\" according to Yoon, to create liquids boosted with additive treatments to make their OG cleansing process even more beneficial. “Depending on the splash mask, the benefits vary,” explains Yoon. “Some will help brighten, some help to calm—it all depends on what's added to the water.” For now, you can expect to find ones with cleansing, brightening, or lightly moisturizing benefits—but nothing too heavy-hitting or strong to deeply hydrate (hello, hyaluronic acid) or lift and firm your complexion. Korean beauty line Blithe, for example, has three different splash masks, all laced with exfoliating and brightening lactic acid. However, each has its own twist—there's one that utilizes honey for its humectant, moisturizing properties, while others use antioxidants to brighten and calm skin. Instead of seeing \"splash mask\" on the bottle, tube, or jar, you'll see the term \"patting\" in the product name. “They’re not really referred to as ‘splash masks’ in Korea, but rather as ‘patting masks’ or ‘patting packs,’” says Yoon. And that patting motion (which we've been employing since we learned it helped to temper the appearance of fine lines) is part of what makes them effective. “We recommend patting with the full pads of your fingers versus rubbing, because it helps the formula apply more evenly and it’s more gentle on skin,” explains Michelle Fry, the director of product development at Boscia. The K-beauty brand (whose beloved charcoal cleansing balm is an Allure editor favorite), recently launched their own iteration of a patting mask—with a souped-up ingredient list, too. The Tsubaki Splash Mask ($38, boscia.com), which moisturizes with camellia oil while also helping to reduce the appearance dark spots with rice bran oil, winds up being a watery liquid that's  \"more thoughtful than [just] slapping anything on the skin,” Fry says. If you wanna go OG style, use the splash mask to spike a bowl or sink basin of water. (You can watch Blithe's full how-to video below.)  While the exact ratio of splash mask formula to water isn't the same from brand to brand, it should be something like 1:100, just a bit of splash mask is used each time. There are also formulas, like Boscia’s, that can be used in the shower and diluted by the water in your hands (and obviously surrounding you). It's as simple as patting a few pumps onto a freshly cleansed face. But, never apply the mask without adding it to water first. “Applying directly to skin won’t irritate skin--we’ve tested it--but water helps with absorption,” explains Fry. “Skin draws water in more readily than straight oil, but water alone evaporates quickly, so you get maximum results with a combination.” Traditional face masks can take time to work their magic, but this isn't the case with a patting mask. And you can forget those 100 pats Korean women did in days past. Both Blithe and and Boscia suggest 15 to 20 seconds with their products; Yoon says to aim for 30 splashes total when using one. “It’s best to splash many times, but more is not necessarily better,” she says. Because with the new class of patting masks and their \"active ingredients, it is possible to overdo it.” In other words: It's basically instant gratification. (Bless you, splash masks.) “The splash mask contains higher concentrations of potent ingredients, so you can get the same intense results of a 20-minute mask in an instant,” Fry says. More skin-care trends we're loving: Even though you’re probably used to washing and drying post-shower or mask, splash masks are left alone to dry on skin, skipping the towel-off process. It's kinda like air drying your hair, but for your face. After I gave the Boscia mask a go round in my bathroom sink full of warm water, I will admit it was a bit awkward to not towel my face off after. (As in, you may be left hovering over your sink for a few minutes while the excess water drips down your chin or trying to find something to fan your face to make it try faster.) But once it dried down, there was no film left (or filmy feel) on my face—instead, my skin was slightly softer. It actually, if you can stay with me here, felt like a pre-hydrator, in the same vein, again, as an essence. Like you know that crazy-tight sensation you can get after a good deep cleanse, or even if your skin just errs on the dry side? That's what I mean by pre-hydrated—almost like a step ahead of the game. (Which is always, always a good thing.) While it may be a phenom—and a cultural tradition—in the K-beauty world, derms aren't ready to 100 percent sign on to the concept so fast. “I would treat this as I would those wash-on sunscreens: a great invention that would provide me with a base, but I’d still rely an additional product with SPF,” New York dermatologist Dendy Engelman tells Allure. The thing is, while the whole pat-and-go concept is great, it's the speediness of the splash mask itself that Engelman says could lead to active ingredients being absorbed. But if you don't have the time to wait for a traditional mask, which can usually guarantee better results because of the contact time, then maybe a splash mask would be a helpful boosting treatment,” she notes. By Aliza Kelly By Gabi Thorne By Gabi Thorne Watch CoverGirl spokesperson James Charles and learn his must-know, two-minute glowing-skin trick: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Nicola Dall'Asen By Sarah Han By Devon Abelman More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2017-01-25T14:00:00.000Z",
    "url": "https://www.allure.com/story/splash-masks-patting-masks"
}