{
    "title": "Step aside glass skin, Cream Skin is the newest K-beauty trend you need to know about | Vogue India",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, visit My Profile, then View saved stories By Avanti Dalal Korean beauty consumers have a massive appetite for skincare—the famed 10-step skincare routine, sheet masks and snail mucin are all exports of the industry—which gives Seoul-based skincare companies the license to find new cutting-edge technology and ingredients that percolate to international markets. Korean women and men focus on hydration—layering on toners, moisturisers, oils and essences in an attempt to make their skin plumper, younger, brighter and glowier, with nary a pore or blackhead in sight. When you think of K-beauty, glass skin is one of the first terms to come to mind—it was major beauty trend that was seen on the runways, on influencers and all over Instagram, which was then magnified by a whole skincare category created to precipitate the look. This content can also be viewed on the site it originates from. So what’s on everyone’s mind in Korea right now? The answer is cream skin. \"Laneige launched their Cream Skin product, which is a fusion between a hydrating toner and moisturiser, and it started the whole trend,” says Charlotte Cho, co-founder of Soko Glam, which is credited as one of the first retailers to bring Korean beauty to the USA. “It’s a unique product formulation that is milky in texture and not creamy or heavy as the name may imply—it’s quite lightweight and refreshing and absorbs quickly into the skin, which is one of the reasons for its popularity in Korea and now in the US,” she explains. By Hasina Jeelani By Prabal Sharma By Kejhal Kalra This content can also be viewed on the site it originates from. If you’re thinking that it sounds a lot like glass skin anyway, Cho points the difference. “Glass skin was a trend that promised translucent and poreless skin, achieved after exfoliating and hydrating it the right way with the right products. In comparison, the cream skin category helps to cut down the number of steps in your skincare routine while softening and nourishing the skin, with a focus on deep hydration,” she says. Experts say that cream skin could have been a response to ‘Skip-Care’, the more extreme version of the practice. After years of the popularity of the multi-step beauty routine, some young Koreans began to favour a more pared-back routine, suggesting that a simple cleanser and moisturiser could do the job of all the steps combined. The Skip-Care exercise also served as a cultural battle—women began to fight against the notion that their femininity and self-worth was directly related to the translucence and beauty of their skin. Cream skin sits right in the middle—it puts the best of K-beauty (the soothing toner and plumping moisturiser) into one all-in-one product that can help to brighten and hydrate skin, without the expense required to complete a more time-consuming routine. Is an essence the skincare step you’ve been missing all along? South Korea is currently seeing a backlash against K-Beauty. Here’s why it’s important These were the biggest beauty game-changers of the 2010s By Hasina Jeelani By Kejhal Kalra By Hasina Jeelani By Hasina Jeelani See more stories Condé Nast India © 2023 Condé Nast. All rights reserved. Use of this website constitutes acceptance of our Terms of Service and Policy and Cookie Statement. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. ",
    "datetime": "2020-01-13T11:48:27.922Z",
    "url": "https://www.vogue.in/beauty/content/skin-care-tips-new-korean-beauty-trend-after-glass-skin-cream-skin"
}