{
    "title": "Studio K Beauty Salon Opens in Syracuse – InkFreeNews.com",
    "text": "JAVASCRIPT IS DISABLED. Please enable JavaScript on your browser to best view this site. Syracuse-Wawasee Chamber of Commerce held a ribbon-cutting event Friday, Sept. 23, at Studio K Beauty Salon in Syracuse.Pictured in front from left are Staci York, chamber executive director; Priscilla Guevara, Studio K hairstylist; Mason Slabaugh, chamber board member, Tippecanoe Lake Country Club; Krista Metzger, Studio K owner; Kassi Perzanowski-Wolf, Studio K owner; Lindsay Senders, Studio K aesthetician; Chris Scheeren, chamber board member, Blue Barn Berry Farm and Event Venue; Kim Strawbridge, chamber board member, Lake City Bank; and Jeanetta Slabaugh, chamber board member, Horizon Bank. InkFreeNews photo by Phoebe Muthart. SYRACUSE — The Syracuse-Wawasee Chamber of Commerce held a ribbon-cutting ceremony Friday, Sept. 23, at Studio K Beauty Salon in Syracuse. The stylists and owners are Krista Metzger and Kassi Perzanowski-Wolf. The women say it was a dream come true to open their own hair salon. They want the public to feel welcome when they walk in the cozy hair salon by having a relaxing ambience. At Studio K, the business pride itself in offering a welcoming, fun atmosphere with experienced professionals in a variety of areas. Studio K Beauty Salon, which opened in May, serves men, women and children. Services include haircuts, perms, color and hair extensions. An aesthetician, Lindsay Senders does lash extensions, massages, facials, waxing, brow tint, brow lift and makeup. Priscilla Guevara is also a hairstylist. The salon is located at 201 E. Palm Drive, Suite E, Syracuse. Appointments are preferred, as walk-ins are not guaranteed. For more information, call (574) 325-5654 or visit facebook.com/studiokbeautysalon. About Phoebe Muthart Phoebe Banks has been with The Papers Inc. since 1999. She is an editor, photographer, and reporter. She has won numerous awards, including several from The Hoosier State Press Association and NAMPA. She is a Nappanee resident. Comments are closed.           ",
    "datetime": "2022-09-23T17:30:10-04:00",
    "url": "https://www.inkfreenews.com/2022/09/23/studio-k-beauty-salon-opens-in-syracuse/"
}