{
    "title": "Style News: Beauty pop-ups from Ksisters, Clarins, Maison Margiela and Infinity Kose | The Straits Times",
    "text": "No need to feel envious about your friends’ holiday snaps in Jeju Island. Local K-beauty, fashion and lifestyle e-commerce platform Ksisters has recreated a slice of the picturesque destination with its latest pop-up, Jung Island, at social club and co-working space Crane Living in Joo Chiat. Soak in Jeju-inspired vibes with yellow canola flower fields as a backdrop for pictures and the scent of Jeju cypress in the air. Ksisters has curated a selection of South Korean brands it carries, many of which contain ingredients native to the island, such as Jeju volcanic ash. These include new launches from beauty labels Lavien, Pink Wonder and Ohiohoo, and lifestyle brands Cosmic Mansion and Hinok. Jung Beauty, the platform’s in-house brand, is also launching its new Probiotics Firming & Brightening Eye Serum ($75) at the pop-up. Visitors can also sign up for a hands-on workshop ($10 a person) on Bojagi, a textile art form using traditional Korean wrapping cloth. Or enjoy free Jeju-themed ice-cream treats in two new flavours – Jeju Sunshine (Apricot Yogurt) and Jeju Breeze (Blueberry Yogurt) – created in collaboration with Kooks Creamery. Info: Till Sept 11 at Crane Living, 281 Joo Chiat Road The latest pop-up from French beauty brand Clarins should delight those who love immersive experiences. As a nod to its expertise in plant science, the brand has conceptualised a laboratory-style pop-up.  Launched this month, it takes over a shop space at The Shoppes at Marina Bay Sands and runs till January next year. Visitors are taken on a journey to learn about the brand’s bestsellers and key botanical ingredients through themed corners such as an Extraction Lab, Mixologie Rooms and Colour Zone. You can try products, purchase limited-edition bundle sets and snap plenty of pictures. End your experience with a free beauty consultation with Clarins’ beauty coaches, and do not forget to pick up a skincare sample kit before you leave. Info: Till Jan 31, 2023, at 01-68 The Shoppes at Marina Bay Sands, 10 Bayfront Avenue Fans of Maison Margiela’s Replica line of fragrances can treat their noses at the brand’s new pop-up in Paragon. Introduced in 2012, the Replica scents were made to evoke memories of a specific time and place – and are just as provocatively named. Discover the latest launches here, including the newest scent, When The Rain Stops ($97 for 30ml, $185 for 100ml) – a heady mix of aquatic accord, rose petal, bergamot oil and patchouli meant to evoke the feeling of a tranquil spring afternoon. And if you love the line’s popular Lazy Sunday Morning fragrance – a clean, fresh-linen scent – you can now complete your scented ritual with the new Bath And Body collection comprising a shower gel ($56), body lotion ($76) and hand cream ($46). Receive three sample scents with any purchase and a personalised pouch with every purchase of a 100ml fragrance. Info: Sept 9 to 15 at Level One Paragon Shopping Centre, 290 Orchard Road It is the Japanese brand’s 20th anniversary in Singapore, and what better way to celebrate than with a pop-up? Located in front of Ngee Ann City, this fancy little booth is filled with metallic balloons and Infinity Kose’s full range of products. Visitors will also be treated to a sneak preview of the brand’s latest Unlimited Key Serum ($150 for a 50ml bottle), which will be available at Kose counters only from Sept 15. This anti-ageing serum – filled with micro capsules made from plant-based beauty oils like green tea and artichoke extract – bursts and moisturises skin upon application. The formula is translucent, lightweight and said to imbue skin with “firmness and vibrancy”. Shoppers enjoy a 15 per cent discount and receive a four-piece gift set with each purchase. Those who spend $180 and above will receive an eight-piece gift set and get to participate in a sure-win game to win products. Info: Till Sept 11 in front of Ngee Ann City, 391A Orchard Road Join ST's Telegram channel and get the latest breaking news delivered to you. Read 3 articles and stand to win rewards Spin the wheel now MCI (P) 066/10/2023. Published by SPH Media Limited, Co. Regn. No. 202120748H. Copyright © 2023 SPH Media Limited. All rights reserved. ",
    "datetime": "2022-09-08T15:00:00+08:00",
    "url": "https://www.straitstimes.com/life/style/style-news-beauty-pop-ups-from-ksisters-clarins-maison-margiela-and-infinity-kose"
}