{
    "title": "Sulwhasoo's parent firm and Shopee tie up to push growth of K-beauty in SEA | Marketing-Interactive",
    "text": "published author share on Korean beauty brand Sulwhasoo's parent company, Amorepacific, has inked a deal with Shopee to accelerate the growth of Korean beauty (K-beauty) in the online beauty category in Southeast Asia. This is an expanded partnership which will see Amorepacific driving data-driven strategies, joint marketing efforts and more co-branded collaborations. The beauty brand also aims to expand the coverage of its current portfolio of brands on Shopee to more markets, in order to meet \"untapped demand\" and provide more assortment to consumers. These brands include Sulwhasoo, Mamonde, Ryo, Mise en scene, and Etude. Starting with Sulhwasoo, Amorepacific will be launching its first regional campaign for the brand on Shopee Premium this April, to drive online sales and premium category growth on eCommerce. This follows \"the exemplary performance\" of Sulwhasoo’s launch in Indonesia, Vietnam and Thailand on Shopee last year, the beauty company said. Using Shopee Premium as a platform, Sulwhasoo will be curating brand content and tapping on Shopee Premium's differentiated user experience to enhance its own brand storytelling, as well as deepen engagement with the growing number of premium and luxury consumer segments. As part of the partnership, Amorepacific also looks to leverage Shopee’s deep data insights into consumer shopping trends and behaviour to help pre-launch new exclusive products that serve existing brand lovers and acquire new users. Additionally, it will explore launching a brand membership programme on Shopee, as well as introducing its brand ambassadors into its Shopee campaigns. This will strengthen brand affinity and awareness with consumers across the region, it said in a press release. Besides focusing on growing its online presence in Southeast Asia, Amorepacific has also included Taiwan as a new market within the partnership to boost its reach and share in the wider region. Amorepacific first launched on Shopee Mall in 2018, and said it has since recorded more than 13 times of growth in gross merchandise value. It has also doubled its eCommerce business regionally in 2020. Michael Youngsoo Kim, head of Amorepacific APAC regional headquarters, said: “As our key eCommerce partner in the region, we are glad that we have seen strong and successful results with Shopee, and want to take it further by collaborating on new and innovative initiatives. With Shopee’s deep understanding of the local market landscape in the region, engaged users, and data expertise, we believe that Amorepacific and Shopee together, will be able to better serve the needs of consumers by bringing more of our world-class products to them.\" Chris Feng, CEO at Shopee, added that the partnership will enable Shopee to tap on Amorepacific's portfolio and industry expertise to strengthen the platform's beauty and personal care offering. This also provides its shoppers with more choices, as well as upgrades the online shopping experience. \"We are confident of helping Amorepacific capture more growth and opportunities regionally with priority access and support on all regional initiatives and resources,\" Feng added. In a press statement, Shopee said Amorepacific brands such as Laneige and innisfree consistently ranked in the top five of the beauty category for its mega campaigns from 9.9 to 12.12. It added that this demand is driven by consumers’ preference toward skincare products made with unique, natural ingredient formulas and personalised beauty solutions, as well as the global rise of Korean pop culture throughout Southeast Asia. Amorepacific previously tied up with another eCommerce platform Lazada in 2019 to boost its online business in Southeast Asia as well. The partnership was said to allow both companies to launch new brands and collaborate on various projects, as well as innovative data marketing. The two companies subsequently launched Amorepacific's first-ever \"new retail\" concept store \"AMORE Store x Lazada\" at Funan in Singapore. The shop aimed to blend online-to-offline shopping elements, as well as deliver customer experience from browsing and sampling products to purchasing and fulfillment. MARKETING-INTERACTIVE's Content 360 Week is back from 6 to 8 April this year! Super charge your content production, distribution and monetisation strategies by learning from brands such as NBA Asia, P&G, Malaysia Airlines, and Marriott International, among others. Sign up today! Related Articles:Amorepacific and Lazada unveil O2O concept store at FunanAmorepacific aims to 'invigorate' SEA presence with Lazada tie-upAMOREPACIFIC Singapore says marketing on social is key in 2019  share on We break down the big and messy topics of the day so you're updated on the most important developments in Asia's marketing development – for free. MARKETING-INTERACTIVE is an online publication of Lighthouse Independent Media. ©  Lighthouse Independent Media. All rights reserved. Marketing Interactive is not responsible for the content of external sites. ",
    "datetime": null,
    "url": "https://www.marketing-interactive.com/sulwhasoos-parent-firm-and-shopee-tie-up-to-push-growth-of-k-beauty-in-sea"
}