{
    "title": "Susan Sarandon Named New Face of L'Oreal Paris - Susan Sarandon L'Oreal Paris Campaign",
    "text": "\"'Mother' would be the title I want after my name–the other one anyone can do. 'Mother' is what's hard.\" Everyone's favorite Stepmom and Burning Man's most stylish attendee Susan Sarandon can now add brand ambassador and international spokesperson for L'Oréal's Age Perfect line to her list of accolades. L'Oréal broke the news today with a series of photos and a #nofilter starring Sarandon, who admits to stalking her three kids on social media. FYI, she prefers the title \"Mother\" over \"Oscar-Winning Actress.\" Sarandon also shared another candid clip on her Instagram: \"When L'Oréal Paris and [brand global president] Cyril Chapuy first approached me, I was so flattered,\" Sarandon says in a statement.\"The very first time I heard 'Because I'm Worth It,' it definitely was a shift in the framing of why you should look good. It had to do with women becoming the master of their own lives and decisions. It's an extremely powerful statement that has transcended time.\" She adds, \"I look forward to being older, when what you look like becomes less and less an issue and what you are is the point.\"  Kristina Rodulfo is the Beauty Director of Women's Health—she oversees beauty coverage across print and digital and is an expert in product testing, identifying trends, and exploring the intersections of beauty, wellness, and culture. Prior to Women's Health, the Filipino-American, NYC native and NYU alumna was at ELLE.com for four years. As Senior Beauty Editor, she reported and co-produced the Webby Award-nominated documentary Beat: How Drag Queens Shaped the Beauty Industry and hosted the millions-viewed video series \"Beauty Haul.\" She can never decide whether or not to get bangs, feels naked without winged eyeliner, and will never shut up about running the NYC Marathon. 13 Best Japanese Skin Care Products to Shop Amazon Is Having a Major Beauty Sale Right Now Why Matrix Could Be the Next Best Skin Treatment Claudia Sulewski Launches CYKLAR First Class Beauty 2023 The 14 Best Expert-Approved Setting Sprays Austin Butler Doesn’t Think He’s a Beauty Icon Jelly Nails Are Back and Better Than Ever The Best Spring 2024 Beauty Trends to Try Now Add These K-Beauty Prime Day Deals to Your Cart The 20 Best Pore Minimizers for Baby-Smooth Skin Laneige’s Lip Sleeping Mask is on Sale Again A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2016-01-08T18:19:00Z",
    "url": "https://www.elle.com/beauty/makeup-skin-care/news/a33123/susan-sarandon-named-new-face-of-loreal/"
}