{
    "title": "The 10-step hair care guide that Korean beauty lovers swear by - Elle India",
    "text": "Apart from being well known for their multi-step skincare routines, Koreans are quickly becoming frontrunners in the hair care game as well. K-beauty philosophy towards hair is simple: treat your scalp like it’s an extension of your face. Before you get intimated by the number of steps in this regime, it’s important to remember that you don’t have to practice it every day or even every time you wash your hair. The main steps that are like your skincare basics–cleanse, exfoliate and nourish—the other rituals can be practiced once a week. To make thing easy, we’ve put together a complete Korean hair care primer with products to use, when to use them and how to make the most of them to get the glossy hair of your dreams… What: A salicylic acid-based formula that dissolves dead skin cells and oil build-up on the scalp. Massaging it also helps improve blood circulation, and it’s great for extremely dry or oily scalps. How: Apply it once a week on dry hair. Let it sit for a few minutes and then wash it off. What: Pick a formula suited for your scalp, and doesn’t strip away moisture from your hair. How: You already know the drill: lather the shampoo between your palms, then massage it into your scalp with your fingertips. What: A brush-like tool to improve blood circulation and exfoliate any leftover build-up. It’s great for a deep cleanse and to boost hair growth. How: Work the brush on your scalp in small, circular motions right after shampooing it. What: Just like a face exfoliator, a scalp scrub is grainy and often dense. It rids the hair roots of all the grime accumulated in the pores and helps in oxygenating the scalp. How: Use it once a week on shampoo-washed hair. What: Any Korean beauty routine is incomplete without a dose of hydration. A deep conditioner replenishes hair’s moisture levels, making it softer and stronger. How: Apply it on towel-dried hair and leave in on for 10-15 minutes. This step is very important for curly hair girls. What: Scalp mask is the new face mask. It soothes, restores moisture, strengthens hair from the roots and fortifies the scalp. The rinse-off mask is not a replacement for your regular conditioner. How: Apply the treatment on damp, freshly washed hair. Depending on your scalp type you can use it one every two week. What: A vinegar rinse can help soothe an itchy scalp. It helps maintain hair’s pH levels, seals cuticles and discourages bacteria growth. How: Dilute regular vinegar or ACV with water and rinse your hair and scalp with it. Rinse out abundantly! What: This creamy overnight, no-rinse mask is a super treatment to hydrate dry cuticles. You can use it between washes to keep hair shiny. How: Apply a generous amount from mid-lengths to tips. What: It’s the equivalent of a face toner that preps your skin to absorb products better and boosts microcirculation. It’s very helpful when dealing with scalp concerns or thinning hair. How: Spray or apply the tonic on your scalp every time you step out of shower. What: The water-like formula is easily absorbed into the scalp and works on the deeper layers of your scalp. How: Spray it into your scalp and gently massage it in. This can also be used daily. Photograph: Sahil Behal Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment.  Previous post Goa has reopened for tourists. Here’s what you need to know before hitting the road Next post Boost your immunity with celebrity nutritionist Rujuta Diwekar’s monsoon food guide ",
    "datetime": null,
    "url": "https://elle.in/article/korean-beauty-hair/"
}