{
    "title": "The 5-Step Secret to Dewy Skin From Korea’s Top Makeup Artist | Vogue",
    "text": "To revisit this article, select My Account, then View saved stories To revisit this article, visit My Profile, then View saved stories To revisit this article, select My Account, then View saved stories By Monica Kim  When Park Tae Yun arrives at the Vogue.com offices, he sports a serene smile and—despite having just flown in from Seoul—supernaturally perfect skin. This is, after all, one of Korea’s top makeup artists, a man who studied with Shu Uemura in Tokyo and helped pioneer no-makeup makeup back home, launching his popular line, Son & Park. Park is here to break down his secret to dewy skin—that almost surreally radiant glow that K-beauty is known for and which Park and his business partner, Son Dae Sik, have championed for years. For Korean women, he explains, it’s about youth over beauty. “Instead of being told they look pretty, they want to be told they look young,” Park says, sweeping a soft cotton pad across my face. “That means dewy skin—not matte and dull like mature skin, but shiny and soft like a baby’s.” According to Park, the two most important steps toward achieving this effect are exfoliation and hydration. To help with the latter, his foundation stick comes formulated with hydrating shea butter and essence, while its argan oil core gives skin an extra glow, especially when buffed out with a brush. A small pop of color on the lips and cheeks will also brighten the skin, he explains. “The red on your cheeks also looks a bit like blood, which makes your skin look thinner,” Park says, dabbing lightly. “Babies have very thin skin.” Believe it or not, Park’s signature look can be achieved in just five minutes, using the same techniques he delivers to stars like Doona Bae. “It’s so simple,” he says. “And with this skin, when you smile, you glow even more.” What better look to take with you into party season—and beyond? Below, makeup artist Park Tae Yun’s five-step guide to dewy skin. Choose a cleansing micellar water with exfoliating properties and sweep it across your face with a cotton pad, which provides additional ingredients to clear pores. Son & Park Beauty Water, $30, sokoglam.com Apply a thick layer of moisturizing cream all over the face, again using a cotton pad to help exfoliate during application. Bioderma Sensibio Rich Cream, $23, amazon.com Choose a hydrating cream foundation and draw six lines across your face from the center outward, then buff and blend the formula into your skin with a makeup brush. Son & Park Glow Ring Foundation, $37, sokoglam.com Take a cream-based highlighter and dot it on the high points of your face—the cheekbones, cupid’s bow, and one long streak on the bridge of the nose—then blend. Wander Beauty Catch the Light Highlighter, $25, net-a-porter.com Pick a colorful lip and cheek tint duo and blend a little onto the apple of each cheek. Apply the rest on the center of the lips, then press your lips together to create a bright stain. By Terry Aqua Tiny Lip & Cheek Duo, $54, barneys.com By Kiana Murden By Kiana Murden By Violeta Valdés By Kiana Murden By Fiorella Valdesolo By Ana Morales More from Vogue See More Stories © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices CN Fashion & Beauty ",
    "datetime": "2015-12-07T19:26:19.000Z",
    "url": "https://www.vogue.com/slideshow/korean-beauty-dewy-skin-how-to-park-tae-yun"
}