{
    "title": "The force is with Canadian rapper k-os | Toronto Sun",
    "text": "The force was definitely with Canadian singer-songwriter-rapper-producer k-os when he was making his new double album of hip-hop and rock, BLack on BLonde. K-os, whose real name is Kevin Brereton, wound up at the Laurel Canyon house of Canadian actor Hayden Christensen, who played a young Darth Vader in the Star Wars prequels. \"Oh, my God, I'm a Star Wars nerd,\" said the Whitby, Ont.-born, Vancouver-based artist, 40. \"It just made sense where I was like four or five records (into my career). I'd already done a lot of stuff in Canada and being in a new environment, but also having a place of my own, especially that place, cause it's very much a barren Miami Vice old '80s mansion. It's nothing glamourous. There's a lot of space. But there's that lonely feeling that you can channel. (Hayden's) also a musician. He's a great piano player. We'd jam together. He's a renaissance dude. So he totally relates to everything I do.\" It turns out k-os met Christensen on a flight to Vancouver during the 2010 Winter Olympics, and moved to L.A. for five months in 2012 originally because of a girl, an actress, but they've since broken up. \"It's all about her,\" said k-os who will start a Canadian tour in April. \"We don't talk. But it is what it is. I think she came into my life to inspire me and it's cool.\" Further Can-con came in the form of many guest vocalists and rappers, including '80s heartthrob Corey Hart, who sang the hook on Like a Comet (We Rollin'), and a difficult-to-obtain sample of Neil Young's Cowgirl in the Sand used as a loop on Play This Game. The friendship with Hart began back in 2008 when k-os wanted him to perform Sunglasses At Night at the end his Juno performance of Sunday Morning. Hart was unavailable but they stayed in touch. \"He kind of became a mentor. He's kind of a lone wolf and understands the music industry and I'd be like, 'Why is this like this?' And he would tell me and between all that, sometime he brought up, 'We should do a song together.' \" Other Canadian guests include frequent collaborator Sam Roberts, Metric's Emily Haines, Death From Above 1979's Sebastien Grainger, Bedouin Soundclash's Jay Malinowski, rappers Saukrates and Shad, along with some American imports -- The Roots' Black Thought, and Travie McCoy of Gym Class Heroes. BLack On BLonde is a play on Bob Dylan's Blonde On Blonde, and Mos Def's Black on Both Sides. \"I've always been inspired by Dylan,\" said k-os. \"Simply because he was somebody that I related to as someone who was uncomfortable with the fame that he had from doing something that just felt super natural to him.\" K-os, whose last album was 2009's Yes!, said he started out making a hip-hop record but then discovered he had enough material for a double album with a rock side, too. \"The cells split,\" as he describes it. \"It was really an Albert-Einstein-splitting-of-the-atom-Eureka moment, where I don't have to cram all my musical identities into 15 songs, which is what I have been trying to do from the inception of my career. And I'm not saying that's bad, 'cause it's yielded some really weird test tube results like Crabbuckit and Sunday Morning, which are all great songs of genres of music smashed up. But as I mature, I really would say the double album is actually going to become my format. I might do a jazz record and a reggae record next time.\" Subscribe now to read the latest news in your city and across Canada. Subscribe now to read the latest news in your city and across Canada. Create an account or sign in to continue with your reading experience. Don't have an account?  Create Account 365 Bloor Street East, Toronto, Ontario, M4W 3L4 © 2023 Toronto Sun, a division of Postmedia Network Inc. All rights reserved. Unauthorized distribution, transmission or republication strictly prohibited. This website uses cookies to personalize your content (including ads), and allows us to analyze our traffic. Read more about cookies here. By continuing to use our site, you agree to our Terms of Service and Privacy Policy. ",
    "datetime": null,
    "url": "https://torontosun.com/2013/02/08/the-force-is-with-canadian-rapper-k-os"
}