{
    "title": "The world of K-pop beauty is changing as we know it—and it begins with NewJeans",
    "text": "Vogue Singapore Vogue Singapore is the undisputed fashion authority that empowers and inspires through elevated imagery and intelligent stories to drive change for good Beauty By\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\tAzrin Tan 22 November 2022 South Korean girl group NewJeans may have just debuted this year, but they're already setting a new standard of fresh-faced beauty in K-pop If NewJeans is looking for attention, then they’ve surely got ours. Just earlier this year in July, the rookie K-pop group under Hybe’s sub-label Ador, made their high-impact debut with ‘Attention’ and ‘Hype Boy’, the leading singles of the group’s first EP that propelled them to the top of multiple global music charts. Breaking records as the fastest idol group to have their debut song hit over 100,000 plays on Spotify, the South Korean quintet comprising Minji, Hanni, Danielle, Haerin and Hyein have also been the talk of town lately for their strides in the fashion scene—with Hanni recently announced as Gucci’s global ambassador. But lean a little closer and you might notice how they’re heralding a shift elsewhere in the K-pop world: its longstanding beauty standards. For over a decade, South Korean idol groups have been known to perpetuate certain beauty ideals, some affecting self-image more than others. Considering how many of these idols were often costumed and made-up to reflect the idealised aesthetic of their time, it’s no surprise that many of these embodied visual concepts were the catalysts of new beauty trends for the younger set to emulate. One only needs to take a walk back down memory lane to witness how veteran girl groups such as Girls’ Generation and Wonder Girls had set the standard. Softly curled tousles and smoked out liners often spotted in their early music videos soon transformed into rainbow-inspired manes and bright, flirty pouts. This preceded more ethereal affairs of gravity-defying nails and bejewelled lids—spotted on the helming idol groups of K-pop’s later generations such as Red Velvet, Twice, ITZY and Aespa. These ever-evolving beauty looks worn on idols in recent years have become moodboards of inspiration for MUAs and Korean beauty enthusiasts all the same; each one with its own aspirational aesthetic to work towards. But enter: NewJeans. Right from the first hit of the play button for ‘Attention’, we’re already convinced that what they’re meant to bring to the table isn’t just a fresh sound, but a new aesthetic that goes against the grain of predisposed beauty standards in K-pop. Flipping around their straight, black hair as they groove to the beat, running free on the streets with minimal base on their miens teamed with nude, muted hues on their lips, the NewJeans girls are going au naturel and they’re owning it. ﻿ Instead of heavy faces of make-up—complete with impeccably styled manes and exquisite manicures—the music video for ‘Attention’ portrays the girls in a sprightly, youthful light imbued via barely-there looks, almost like the perfect embodiment of a girl their age (their oldest member Minji, is only 18). Whilst their nails are left naked or nude, their faces see a tone-on-tone approach: where their blush shades match the soft hue on their lips, creating a slightly pinked look that’s still playful and fresh. Stray strands of hair fall across their faces as they joyfully dance away, echoing the sporty dynamic channelled through their Y2K-inspired style; an aesthetic that carries through the music video for ‘Hype Boy’ as well. Not only is it a stark shift away from the usually high-octane aesthetic of idol groups, it’s also one that doesn’t seem to be limited to just this season of their career. Whilst it’s definitely in line with the post-pandemic trends of beauty—think TikTok’s reigning clean girl aesthetic—their embodying of a fun, fresh look establishes a new standard of beauty in K-pop that can actually be practically achieved by other girls of their age. It dials down on the dazzle overall but plays into the sentiment of each individual’s blooming strengths instead of trying to fit them all squarely into the same box. So be it a light base, a rosy blush or glossy, tinted pouts, these girls are representative of an alternative beauty aesthetic we can only hope to see more of in K-pop from here on out: fresh-faced, natural and ultimately carefree.  Beauty By\n\n\t\t\t\t\t\tDana Koh Beauty By\n\n\t\t\t\t\t\tAlli Sim Beauty By\n\n\t\t\t\t\t\tHasina Khatib Skin By\n\n\t\t\t\t\t\tHannah Coates Beauty By\n\n\t\t\t\t\t\tEmily Heng and Sophie Tan Beauty By\n\n\t\t\t\t\t\tAlli Sim, Emily Heng, Azrin Tan, Janice Sim and Valecia Lee Skin By\n\n\t\t\t\t\t\tAzrin Tan Beauty By\n\n\t\t\t\t\t\tCalin Van Paris Countless conversations featuring a cacophony of voices. Vogue Singapore's anniversary October issue culminates the spirit, strength and beauty from diverse individuals across Southeast Asia, styled in this season’s gender-neutral offerings. Following our recent heat-reactive September issue, comes a collectible cover that transcends the conventional realms of print: embedded with an NFC-enabled Continuity™ chip by Spatial Labs, where a simple tap of your mobile phone unlocks a Vogue Singapore original soundscape experience. Become a Club Vogue member to receive an annual subscription, a Vogue Singapore tote bag, an exclusive bundle of gifts, as well as playing a part to support the local creative industry. Edition Follow Us © 2023 Media Publishares Follow Us Edition ",
    "datetime": "2022-11-22T07:00:57+00:00",
    "url": "https://vogue.sg/new-jeans-kpop-beauty/"
}