{
    "title": "The best Korean skin care products of 2021: What is K-beauty?",
    "text": " Sections Shows More Follow today More Brands Korean beauty, or K-beauty, is a growing trend in the U.S., thanks to TikTokers and other social media influencers showing off the innovative and effective products. Ryan Sullivan, co-founder of The Beauty Spy, is on a mission to spread knowledge about K-beauty and its benefits. The Beauty Spy is a bit of a middle man for K-beauty products, and Sullivan told Shop TODAY that's because for a long time, it was difficult to purchase Korean beauty products if you didn't live in Korea. “People were hearing about this stuff in America, but they couldn’t get their hands on it,\" said Sullivan. \"So about four years ago, we created this concept linking the two things together: The innovation coming out of Korea, brought over through The Beauty Spy.” “It's the idea that, from generation to generation, you pass down these traditions and routines that get put together with innovations and science,\" Sullivan explained. \"When you put those two things together, you get manufacturers who are competing in a market designed for the customer that really cares about their skin and wants skin that looks glassy and silky and smooth. They’re creating these amazing technologies that aren’t available in other parts of the world.\" The good news? In addition to websites like The Beauty Spy, K-beauty products are becoming readily available everywhere, from Amazon to Target to Ulta. Here are some of the best Korean skin care products you can currently get your hands on. To shop this article by category, click on the links below: One of the staples to a classic K-beauty routine is double-cleansing, according to Sullivan. From cleansing balms to foaming cleansers, hitting the face washing double time is the perfect way to cleanse and balance skin so its ready for the next step in your skin care routine. In one simple step, this all-in-one cleanser cleanses, removes makeup and gently exfoliates. If you're a fan of bar soaps, try this hydrating soap that contains botanical extracts and other moisturizing ingredients. Hydrating and gentle, this facial cleanser contains hyaluronic acid, an ultra-moisturizing ingredient that locks in moisture. Remove makeup and give skin an extra vitamin boost with this BornTree cleanser. Using a naturally soothing plant mucin called pholiota, this balm from Hanacure is gentle on your skin but removes impurities and retains moisture perfectly. A cult favorite of Belif users, this cleanser starts as a jelly texture before foaming up, helping handle dryness, dullness and uneven skin texture. Exfoliation is another important step in a K-beauty skin care routine, according to Sullivan, as the dead skin on the surface of the face needs to be removed so your skin barrier can absorb your products more effectively. He also says the most important part of exfoliating the skin is finding a gentle product that doesn't abrade the skin but still gets you the results you want. \"Korean skin care is all about listening to and appreciating your skin,\" said Sullivan. Gentle enough to be used daily, this facial scrub is infused with naturally occurring ingredients like coconut oil, sea water and noni extract. Sullivan says K-beauty facial peeling products are all about the acids they contain. \"Acids like AHA, BHA and PHA are very common in K-beauty, offering a solution for your specific needs,\" he said. \"Alpha hydroxy acid is great to exfoliate and polish away dullness to your skin; beta hydroxy acid gets deeper into your pores to remove buildup and excess oils; [and] poly hydroxy acid is great for sensitive skin because it softy removes the dead skin cells off the surface.\" Containing PHA, this gentle exfoliating skin care peel helps your face appear hydrated and plump with moisture while minimizing the appearance of pores. Available in wine, lemon and green tea varieties, these pre-soaked, three-layer pads help exfoliate skin and even out texture using AHAs and antioxidants. Papaya enzymes are one of the key ingredients in this multi-action gel peel, which exfoliates dead skin cells and improves the skin's texture. While facial toners may be more common in American skin care, essences are a popular K-beauty method for prepping the skin. \"Toners are more common in American skin care for removing cleanser residue, smaller pollutants left on the skin after cleansing and helping to keep your skin's PH at a healthy level,\" said Sullivan. \"The same hold true for the Korean skin care routine. Essence is a smaller molecule formula that absorbs into skin to prep your skin to be ready to receive the rest of your treatments.\" But some toners double as an essence. Sullivan says many of these products embrace the K-beauty trend of \"skip-care,\" one product fulfilling two skin care needs so you can skip a step and save time. Made of 92% moisturizing ingredients, this toner soothes and balances skin while refining the skin's texture. This age-defying toner restores the skin's pH balance and helps boost the effectiveness of your skin care regimen using a powerful blend of peptides, protein water and hyaluronic acid. Age-defying ingredients like peptides and hyaluronic acid make this essence a great way to hydrate the skin and smooth fine lines and wrinkles. Hydrating and lightweight, this toner has three types of hyaluronic acid to provide maximum moisture to skin. This pore-tightening toner helps with achieving pillow soft skin and provides a major hydration boost. The watermelon extract will also make your face smell amazing. An easier way to tone your skin, these vitamin C-packed toner pads make toning on-the-go a snap. \"Serums are known to have high concentration of active ingredients in a lightweight consistency to treat your targeted skin care concerns,\" Sullivan explained. \"An ampoule is what we like to call a super-charged serum. It usually has a higher concentration of ingredients that, similarly to serums, are used to target specific concerns from anti-aging and pigmentation to lifting and firming.\" Need to control oily skin and keep pores clean? This ampoule contains ingredients like tea tree leaf water that exfoliate the skin and remove waste and build-up. This super-charged serum helps minimize fine lines and wrinkles and tightens sagging skin. Red ginseng and pure gold come together in this ampoule to promote radiant, glowing skin. Formulated with red berry ingredients, this serum exfoliates, polishes away dullness and fights blemishes. This moisturizing hyaluronic acid serum boosts collagen production and helps eliminate signs of aging. Combining Korean skin care ingredients and CBD, these serum pearls can offer relief for skin conditions like rosacea, acne, psoriasis and eczema. Loaded with hyaluronic acid, mineral-rich seawater and aqua ceramide complex, this concentrated serum quenches dry skin and refines its texture. Achieve a \"glass skin\" look with this silky serum, made to replenish lost lipids and restore broken elastin from your skin barrier. The end result will leave your face illuminated and glowing! Avon's first holistic approach to skin care, this serum utilizes anti-aging ingredients like niacinamide and panthenol, along with a unique peony extract, to leave your skin feeling firmer and tighter. This fast-absorbing serum helps skin feel brighter, firmer and more hydrated thanks to powerful ingredients like vitamin C and peptides. Looking to reduce dark spots and fine lines? This serum can be applied by itself or mixed with moisturizer for the perfect amount of hydration. This bestselling vitamin C-packed serum is packed with unique skin-toning ingredients like cold-pressed green tangerines, licorice root extract and niacinamide. You'll start noticing visible results after two weeks of use, according to the brand. Sullivan says \"cream skin\" is the dewy, subtly shiny finish of glassy skin, which offers a youthful bounce with the simple application of a blended essence and moisturizer formula. And, when it comes to K-beauty, moisturizers and eye cream are a must. \"Moisturizer is essential to keeping your skin barrier healthy and functioning to protect your skin,\" he explained. Another K-beauty collaboration from Avon, this eye cream is great for achieving creaseless makeup application and soothing dry skin around the eyes. Help the delicate under eye area look refreshed and moisturized with this silky eye cream. With \"glassy skin\" in the name, this moisturizer from Touch In Sol is the perfect way to hydrate your skin or prep your face for a flawless makeup application. This concentrated facial cream is crafted using natural skin nurturing ingredients like jojoba, argan oil, shea butter and olive oil. Its nutritious formula ultimately supports a healthy skin metabolism, resulting in nourished, brighter skin. \"Like 10 creams and serums in one,\" this moisturizer is safe for sensitive skin and is made with a mushroom extract that optimizes absorption. This lightweight moisturizer gives skin a dewy appearance, thanks to a blend of hydrating hyaluronic acid and hydrolyzed collagen that restores natural plumpness and firmness. Spiked with vitamin C and watermelon extract, this oil-free moisturizer is readily able to hydrate the skin and prep it for the day's makeup. Sullivan is a big fan of incorporating K-beauty tools into your skincare routine. \"One of the greatest things Asian culture has shared with the rest of the world is gua sha,\" he said. \"The practice of massaging your facial muscles with a specially designed tool helps to lift and contour, while promoting lymphatic drainage and relaxing facial muscles to lessen the look of fine line and wrinkles.\" Dragging this gua sha stone across moisturized skin helps skin care products absorb into your skin and aids with bloating and lymphatic drainage. These ultra-soft cotton pads are a great way to spread toner and essence onto your skin. This roller tool helps reduce inflammation, aid with absorption and relaxes facial tension. \"It is so important to keep your skin hydrated and dewy throughout the day,\" said Sullivan, \"but reapplying moisturizer all day is not always an option.\" For that, he recommends facial mists. \"They're a great way to keep skin hydrated even in the driest indoor conditions, like on an airplane or when you’re having a stressful day.\" This refreshing and hydrating facial mist contains probiotics and prebiotics to help balance the skin. Whether you're interested in moisturizing the skin or nurturing sore, sun-damaged skin, this decadent aloe mist will get the job done. While it's hard not to pick at facial acne, Sullivan says instead of pinching or prodding, it's better to look for products that soothe the breakout. In fact, the acne patches many of us turn to have roots in Korean beauty. \"One major innovation to come from K-beauty is the use of invisible patches that disguise your blemish while treating it,\" Sullivan said. These breathable acne patches promote healing by absorbing pus and and protecting the blemish from infection. This time-release serum uses meadowsweet and licorice to treat acne and reduce pores in just a few days. Using a blend of essential acids, this acne spot treatment also brightens and soothes skin and reduces acne scarring. Made of hydrocolloid dressing, these self-adhering pimple patches work to secret fluid from the blemish and come in two sizes. Daily use of face masks is standard in Korean beauty routines. \"A sheet mask creates a seal on your skin and prevents the moisture and ingredients from evaporating too quickly, giving your skin plenty of needed nourishment,\" said Sullivan. \"Korean beauty set the standard for a mask a day, so much so that beauty stores in Korea sell them in packs of 300.\" No time to mask during the day? Sullivan says that's what a sleep mask, which nourishes skin while you sleep, is for. These hydrating face masks are infused with CBD to give you the utmost relaxation. This package contains a week's worth of deeply penetrating sheet masks, each of which target a different skin care need. Formulated with a blend of vitamin C and peptides, this serum-loaded mask will leave your face brighter and refreshed after 10 to 20 minutes of use. With a near-flawless 4.9-star rating from over 9,600 customers, this award-winning all-in-one set removes impurities, smoothes and evens skin tone and leaves you with a visibly radiant and refined glow. This amino-rich, watermelon-infused sleep mask moisturizes and refines the skin while you catch some zzz's. This \"pillow-proof\" jelly-pudding sleeping mask locks in moisture all night long, resulting in super-hydrated skin in the morning. For more stories like this, check out: To discover more deals, shopping tips and budget-friendly product recommendations, download the new TODAY app and subscribe to our Stuff We Love newsletter! Terri Peters is a writer and editor for TODAY.com. She lives in a small beach town on the Atlantic coast of Florida with her husband and two kids. When she isn't writing, she can be found at the beach or exploring Florida's theme parks with her family. © 2023 NBC UNIVERSAL ",
    "datetime": null,
    "url": "https://www.today.com/shop/korean-skin-care-products-t213989"
}