{
    "title": "The Secret to Keeping Your Skin Oil-Free All Day",
    "text": "We may earn commission from links on this page, but we only recommend products we love. Promise. From how to get rid of dark circles, to how to deal with the effects of hard water, to the secret to oil control on your skin — you've got questions and Cosmopolitan.com's beauty editor Carly Cardellino has answers.  Q: \"My dark circles can be covered with concealer, but the actual shadows never disappear. What can I do non-surgically?\" — @kayleeslaterIf you inherit fair or thin skin under your eyes, it's more obvious when blood pools there (often because of slower circulation from lack of sleep). This accumulation causes fragile capillaries to stretch and leak. A: Chances are your dark circles are part of your genetic makeup, since they're always visible. So, aside from camouflaging them with concealer (if yours are reading red, choose a concealer that is green to cancel them out, and if they're a darker brown, opt for an orange cover-up to diminish the look of them), there are a few things you can do to minimize their appearance. Neal Schultz, M.D., a cosmetic dermatologist in NYC, suggests getting seven (or more) hours of sleep each night, and then using a peptide-infused, collagen production-building product daily. One of Schultz's mainstays complete with peptides: Beauty Rx Skincare by Dr. Schultz Gentle Exfoliating Eye Therapy Cream, $50, beautyrx.com. He also recommends patting on an under-eye concealer with light reflecting particles that will distract from any darkness — try: Yves Saint Laurent Touche Éclat Radiant Touch, $40, sephora.com — and wearing sunglasses, \"since when you squint in the sunlight it creates folds underneath your eyes and each fold of skin casts a shadow on your under-eye area, making your dark cirlces appear worse.\" Q: \"Is there a good hard-water shampoo/conditioner on a Pantene budget? #buildup #tangles\"  — @TheMonalysia A: Yes, there are actually a bunch of inexpensive options that can help with your hard water issue. Basically, what's happening to your hair is that the minerals, like iron, in the hard water are affecting it, leaving it too-soft and unmanageable, says , a celebrity stylist at the Serge Normant Salon in NYC. \"Plus, hard water has a tough time rinsing shampoo and other styling products out of your hair entirely, so often times you're left with a greasy film that's a build up of detergent that makes your hair feel dirty and oily and look weighed down.\" Tommy Buckett But don't worry, there is a light at the end of this tress tunnel. Buckett recommends using a detoxifying shampoo once a week to remove mineral and product build up; that way your hair looks healthy clean with a side of volume. One Buckett likes is: Garnier Fructis Pure Clean 2-in-1 Shampoo and Conditioner — it contains zero silicones, parabens and dyes, leaves your hair super clean and full of body, and it's affordable! Q: \"What is the best oil control makeup or secret? An hour after mine goes on I need a blotter sheet..help!\" — @bananana713 A: The secret to controling the oil on your face, so that your makeup doesn't slide off midday comes down to these four things:  washing your face with an  in the shower — that way you're already decreasing the amount of oil on your skin from the start.  Using a primer, like  to help mattify and prep your skin before you put colored cosmetics on, giving your makeup something to adhere to so it stays on longer.  Choosing an oil-free foundation, like . This one is non-acnegenic, so it won't cause breakouts and it also contains oil-absorbing silica to soak up oil throughout the day.  Spraying your makeup with a finishing spray, like , which helps makeup stay put, controls oil, and keeps your skin from getting shiny midday. 1)oil-reducing cleanser2)Clarins Instant Smooth Perfecting Touch Make-up Base3)CoverGirl Clean Oil Control Liquid Makeup4)Urban Decay De-Slick Oil-Control Makeup Setting Spray Photo Credit: Getty Images Carly Cardellino was the beauty director at Cosmopolitan. If you follow her Instagram, then you know she'll try just about any beauty trend or treatment once (the pics of her purple hair are on IG to prove it). But her favorite part about being in beauty is finding the most effective products, and then sharing that intel with others—because who wants to spend money on stuff that doesn't work? No one, that's who. Her most recent discovery: De La Cruz Sulfur Ointment, which will change your blemish-clearing game! Hopefully through the beauty stories she writes—and the experiences she shares—you can see exactly why she's in this business. Your 101 Guide to Laser Treatments for Acne Scars 19 Genius Serums That'll Smooth and Firm Your Skin These Bath Gift Sets = Immediate R&R 25 Face Serums For Supremely Glowy Skin Found: The Most Effective Dark Spot Correctors The Holy-Grail Makeup Removers You Need RN The Skincare Deals Post Prime Day >>> 9 Serums That Are Basically Filler in a Bottle Add These K-Beauty Prime Day Deals to Your Cart Rn I Slathered My Whole Face in Aquaphor for 30 Days 13 Best Natural Retinol Serums The Best Hyaluronic Acid Face Serums. Period. A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2013-12-26T23:47:00Z",
    "url": "https://www.cosmopolitan.com/style-beauty/beauty/advice/a17591/cosmo-beauty-advice-column-concealer/"
}