{
    "title": "The 7 Best  K-Beauty Lip Tints ",
    "text": "Every item on this page was chosen by an ELLE editor. We may earn commission on some of the items you choose to buy. We heart, like, and DM them all. South Korea’s beauty game is top notch. In recent years, K-beauty has become so mainstream stateside that even our drugstores have robust sections for it. But for all the essences and ampoules, sleeping packs and cushion compacts, getting your hands on some real (and not inspired!) South Korean makeup is harder than it looks. And you need the real deal if you’re going to accomplish the popsicle-perfect stained lips of Pony or any of the other Korean makeup influencers on Instagram. You’ve been seeing them too, right? K-beauty lip tint swatches make up about a third of my explore page, tied with pictures of food and jewelry I can’t afford. It turns out, ‘lip tint’ is about as catch-all a phrase as ‘lipstick’: some lip tints are matte, some are shiny, some are meant to be buffed out, and some leave a stain that lasts all day. Ahead, I tried out dozens of lip tints to find your perfect match. Tint Type: comfort matte ShadesAvailable: 6 Wear: a couple hours Arguably the lip tint that started it all! For whatever reason, I was surprised to discover that under the Baby Bottle Pop-looking cap there was actually a stout doe foot. You can use it to scoop some of the incredibly light, liquid powder-y formula onto the back of your hand (it won’t stain), and from there apply it to your lips with a fluffy brush in tiny circles. It’s the best way to get an even, blurred coat all over. To copy the popsicle lips popular in Korea, after sweeping a thin coat of Airy Velvet to the edges of your lips, go back in dab a more concentrated layer in the center of your mouth. The finish is matte without cracking, but I did find my lips got a little dry after an hour of wear. Tint type: stain Shades Available: 4 Wear: till noonIn a more literal world, you’d be able to pull Etude House’s little plastic popsicle right out of its shell. Instead, here’s what happens: the little handle twists out, and inside is a sheer lip stain with a doe foot applicator. This stain is traditional in every way: it’s sheer, long-lasting, but also feels slightly drying on lips and comes with a bitter aftertaste. But if you’re already a fan of Benetint, the Popsicle Tint offers a similar formula in more shades—the lightest, Apricot Red, is a barely-there peach on fair skin tones, while Oink Red is a good option for those looking for something less cool-toned than the Benefit version. Tint Type: stain Shades Available: 4 Wear: till noon For all intents and purposes, let’s call it a stain because it’s a sheer, longwear liquid lip that leaves you a healthy pink glow (as a treat!) when it mostly wears off. It also dries like a stain, by which I mean close to the lips and not at all sticky. But it does have a little bit of shine on its own that other stains simply don’t. It’s almost like a lip lamination—picture a thin veil of plastic wrap rather than the dimensional, plush shine you’d get from something goopier. The final effect is the closest I got to matching the K-beauty lips on Instagram, thanks to a combo of the finish and blendability. The feel of a stain, with the shine of a gloss: this lip tint belongs in a category all its own. Tint type: balm stain Shades Available: 8 Wear: all day, baby Balm. Stain. Balm stain! Why didn’t anyone think of this before?! True to form, Holika Holika’s Water Drop Tint Bomb comes in a raindrop-shaped stick applicator—the tapered top helps for applying it precisely along the cupid’s bow and the corners of your lips. It goes on smooth and feels moisturizing, and then… you can’t wipe it off! The color of your lips doesn’t change from the first application to 10 AM, to after lunch, to after work. Once, I applied this before going to bed, and I woke up with pink lips and clean white sheets. If you’re looking for a tinted balm that lasts, this is the only answer. Tint Type: stain Shades Available: 1 Wear: till noon This tint takes the cake for the easiest to apply, that’s for sure. The little ball on top is actually a felt-tip applicator, and because it’s a ball and not a point, it’ll never get bent out of shape or dulled. The round edges also ensure soft yet precise application—trace it along your lips like a liner, and then color everything in. The formula is liquidy enough to spread well all over large areas. All in all, an excellent stain! The one drawback is the shade range: there’s only one color, to be exact, and it’s a bright orangey-red. If that’s not your style, carry on! Tint Type: comfort matte Shades Available: 4 Wear: a couple hours Maybe you’ve seen this type of puff applicator before (Chanel’s Rouge Allure Liquid Powder uses it, as does its drugstore dupe Nyx Powder Puff Lip Cream)—heck, maybe you’ve even tried it out! If you have, you know that the diffuser sponge allows for super soft blurred lip line, so you don’t need an extra brush for application. I’m calling it a comfort matte, because the formula is thick and fluffy, unlike other liquid mattes you might be familiar with. And the final result is beautiful! I’d say this lip tint falls squarely in the same category as other similar products—it’s slightly cheaper ($6 less) than the Chanel, with comparable staying power and about half as few shades. Tint Type: stain Shades Available: 5 Wear: all day, baby Yes, Chateau Labiotte is a Korean makeup brand moonlighting as a fake French winery. And yes, the result is the cutest makeup vessel I’ve ever seen—a bizarrely lifelike wine bottle for ants. But this is also the perfect lip tint. This tint looks and lasts like a traditional stain, but doesn’t have that bitter taste or drying, astringent feel typical in other products. It’s also easy to apply: the sheer formula takes its time to dry down, so you can blend outwards for a popsicle look or fix any spots out of bounds. (You can even dab the doe-foot applicator along your cheeks for a flush that lasts.) It didn’t grab on to my dry spots in a gross looking way. And, OK, have you seen the packaging?! The shade Merlot Burgundy RD03, a translucent stunner somewhere between plum and brick, is the one to grab. Ali Oshinsky is a writer and licensed esthetician based in New York. She spends a lot of time thinking about high-tech skincare (ingredients! tools!) and what John Mayer‘s makeup stash might look like (eyeshadow?). Probably has six lip products at the bottom of her bag at any one time, but if you asked her she’d say they’re all lost. email: Amazon Is Having a Major Beauty Sale Right Now Why Matrix Could Be the Next Best Skin Treatment Claudia Sulewski Launches CYKLAR First Class Beauty 2023 The 14 Best Expert-Approved Setting Sprays Austin Butler Doesn’t Think He’s a Beauty Icon Jelly Nails Are Back and Better Than Ever The Best Spring 2024 Beauty Trends to Try Now Add These K-Beauty Prime Day Deals to Your Cart The 20 Best Pore Minimizers for Baby-Smooth Skin Laneige’s Lip Sleeping Mask is on Sale Again Hailey's Go-to Skin Tool Is on Sale for Prime Day! A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2020-02-27T14:20:00Z",
    "url": "https://www.elle.com/beauty/makeup-skin-care/g31116489/best-korean-makeup/"
}