{
    "title": "The Glow Recipe Founders Have the Best K-Beauty Tips",
    "text": "View Our Print IssuesBack to Main Site  See Our Newsletters Share It started over sheet masks and wine. That’s how Christine Chang and Sarah Lee would often unwind after long days at work. They’d spent nearly a decade at L’Oréal, both in the Seoul and New York offices, and that summer in 2014, like most of their North American colleagues, they were thinking about K-beauty. Essences, cushion compacts and countless other Korean-born trends were taking the West by storm. “That’s when inspiration hit,” says Chang. “We needed to put our stamp on this because there was a lot of conversation around the time about K-beauty but not a lot in the natural, clean or cruelty-free sphere.” “Our grandmothers would use watermelon rinds to help heal our rashes in the hot summer months in Korea. We’d see results overnight—it was miraculous.” They decided to launch Glow Recipe, an online shopping destination featuring their K-beauty go-tos, all free of controversial or animal-derived ingredients. Three years later, they took Glow Recipe to the next level, developing their own range of bespoke products. The idea for their first launch, a pink jelly-like Watermelon Sleeping Mask, was sparked by a childhood memory. “Our grandmothers would use watermelon rinds to help heal our rashes in the hot summer months in Korea,” recalls Lee. “We’d see results overnight—it was miraculous.” They harnessed those hydrating and soothing properties to create what would go on to become a bestseller at Sephora. There have been more fruits and more bestsellers since, including a blueberry cleanser and banana soufflé moisturizer, and now a new product joins the range: a papaya cleansing balm inspired by enzyme baths found in Korean spas. Here, the co-founders tell us all about their latest baby and share some of their favourite K-beauty skin tips. Lee: “We’ve been double cleansing for a long time. It’s a very Korean-inspired ritual we learned at a young age from our moms. We wanted to do something a little bit different with this product, which was to provide extra skincare benefits because cleansing is so important. It’s the number one priority in terms of your skincare routine. We thought we could use a cleansing balm that helps to remove makeup, SPF and all the oils off of your face, but why not add enzymes? We love enzymes in general; we’ve been taking enzyme baths in public bathhouses in Korea since forever, and papaya has enzymes that are super effective but gentle at the same time. They help to remove dead skin cells and resurface the skin in a very gentle way.”  Chang: “Back when we got to go to Korea very frequently, one of our first pit stops would be a bathhouse that had these huge tubs of enzymes, and the person who was managing the tubs would feed them rice bran to keep the enzymes alive. You’d dip your whole body in and they’d cover you in the enzymes. Enzymes are different from acids in that they only dissolve the keratin protein in the skin, which is what binds dead skin cells. Because you’re loosening those binds, you’re lifting away just the dead skin cells and it doesn’t impact living skin cells, so you’re getting that gentle, ‘just enough’ exfoliation. It would be an instant jet lag cure. As I’m speaking about it, I’m missing it already!” Chang: “There’s the 1+1 method, which basically keeps you honest in terms of cleansing long enough. You massage your cleansing balm on your face for a full minute and then you use a foam cleanser for a full minute. It makes sense because you’re brushing your teeth for two minutes, so why would you think you could cleanse your face in 10 seconds? But a lot of people don’t do that, so this is a good trick to make sure you’re really getting that thorough cleanse.” Lee: “And then the rule of thumb in the Korean beauty world is you never want to leave your skin dry; it always needs to be a little damp and hydrated. So there’s a three-second rule where you don’t leave your skin dry for more than three seconds. No pressure! [laughs] As soon as you wash your face, you can just grab your facial mist and spritz right away or you can move onto your toner step and start drenching your skin in the liquid treatment. The less time you have between each step, the less dry it is, the better hydrated your skin is.” Lee: “It’s always a little damp during the whole process, and we actually don’t use towels because we don’t want it to cause any friction or micro tears. In Korean beauty, the philosophy is to maintain a gentle approach, so avoiding anything that could be harsh like rubbing, tugging, pulling, swiping—all of those are banned. Not allowed! [laughs].” “[My mom] told me to make sure to take care of my neck skin all throughout my routine. She still tells me that on the phone to this day—every single day! [laughs]” Lee: “I think both of our moms were our skincare idols and role models. I still remember when I was a little child, I would hear my mom unpack her skincare products, from her cleanser to her creams, and I would know she was sitting in front of her vanity, taking care of herself. That was always an inspiration. We learned a lot of DIYs growing up, including cucumber masks for brightening and soothing, we did a lot of watermelon misting from the juice that was left over. We put it in a spray bottle and we would spritz it in the hot summer months. That was really nice. My mom used to grind green tea leaves with yogurt and honey, and that was a brightening and moisturizing DIY facial that we did once in a while. She also told me to make sure to take care of my neck skin all throughout my routine. She still tells me that on the phone to this day—every single day! [laughs]” Lee: “The first thing that comes to mind is that it’s complicated and it’s 20 steps. That’s just not the reality; I can’t think of a single person who actually uses 15 steps in Korea. I understand why that became a viral statement, because a lot of Korean women love to experiment with different products, so their medicine cabinets might be a bit fuller. We call it the “skincare wardrobe,” because it’s about understanding your skin and giving it what it needs—you don’t always use the same recipe every single day.” Chang: “I completely agree. There is so much technology and ingredient research and every time we’d go back to Korea, we’d be blown away. We just figured there was a better way to bring about these technologies and inspirations to the U.S.. Our brand is K-beauty-inspired. It’s about that holistic approach to beauty, understanding the self-care moment, the ritual of it—as well as clean formulations. It’s really next-gen technology inspired by all that heritage.”  Share I never take an Everything Shower on a weekday. Why? Because the Everything Shower is sacred. It is not to be mixed with the stress of Monday, Tuesday or any other day when I’m expected to interact with the outside world. It’s a time dedicated to taking caring of myself in all the ways I see fit. It’s meditative, magical and the furthest thing from exhausting—as long as you have the right perspective. An Everything… “It’s a bit of a dumpster fire” is a sentiment echoed by thousands. How we got here, and what can help They were snapped on sunny Canouan, St. Vincent. Let's all go? From Lauren Chan's scarlet ensemble to Sarain Fox's repurposed parka She and Jeanne Beker talk fashion's glory days, their breast cancer journeys and anti-aging's downside    SIGN UP FOR OUR NEWSLETTERSGet the latest beauty and fashion news, trends, contests and more - straight to your inbox  Thank you for signing up!  Δ © The Kit 2022, The Kit, a division of Toronto Star Newspapers Limited 8 Spadina Ave, 10th floor The Well, Bldg G, Toronto, ON, M5V 0S8, 416-945-8700 ",
    "datetime": "2020-08-05T21:31:03+00:00",
    "url": "https://thekit.ca/beauty/skin/glow-recipe-founders-k-beauty-tips/"
}