{
    "title": "The rise of K-beauty in Singapore and globally | The Straits Times",
    "text": "In August, Korean beauty fanatics will have something new to cheer about - the premium Korean skincare label The History Of Whoo will open its first Singapore booth in Tangs in Orchard Road. Whoo means empress in Korean and one of its star products is its Bi Chup Ja Saeng Essence, an anti-aging serum that has, among its list of ingredients, deer antler, angelica root and wild thyme. Korean beauty labels have been making inroads here with their fastidious skincare products. These are often the building blocks to double-digit-step nighttime regimens and feature wildly exotic ingredients such as snail and snake venom essences, donkey milk and bee sting toxins. Like K-pop, Korean cosmetics have grown a following here. Heard of cushion compacts? It is a cushion soaked in liquid foundation that you can re-apply all day to achieve that dewy look favoured by Korean celebs. No? But you must have heard of the ubiquitous BB cream - that tinted moisturiser- foundation-sunblock hybrid that has become a beauty staple. Last month, Etude House launched its 17th outlet here at VivoCity. This follows the opening of its 2,300 sq ft global flagship - the brand's largest in the world - at Wisma Atria in October last year. And it looks like the Korean influence is set to grow. Like in the Western beauty industry, the scene is dominated by a few big companies with a plethora of smaller labels. The History Of Whoo, for example, is owned by South Korean electronics giant LG, which controls popular K-beauty masstige brands The Face Shop, Belif, and VDL. The Face Shop has 22 stores here and VDL opened its fifth standalone store at Ion Orchard Linkway last month. Korea's largest cosmetics manufacturer AmorePacific's stable of 26 labels includes Sulwhasoo, Etude House and Innisfree, brands which have made lucrative inroads into Singapore in the past few years. Laneige is the most popular, with 17 stores and counters islandwide. Sulwhasoo, which has four counters in department stores here, opens its first standalone store in South-east Asia at Capitol Piazza next month. Innsifree will also open a 2,450 sq ft shop - its sixth and largest store here - at VivoCity next month. In the last five years, the number of K-beauty labels available here has more than tripled, going up from about 15 in 2010 to more than 50 now. This is in part thanks to multi-label stores. At Changi Airport, the South Korean duty-free chain The Shilla Duty Free opened last October, introducing brands such as Ryo, RE:NK and Giverny. Multi-brand beauty chain Sasa rolled out its Selectiv concept store at Ion Orchard Linkway in April, with 11 Korean beauty brands including 3 Concept Eyes, Soo Beaute and Cliv. The amount that Singaporeans spend on beauty products is growing, though at a modest pace. Market research firm Euromonitor International reports that the market value for premium as well as mass skincare and colour cosmetics here totalled $694.5 million last year, up just 5.3 per cent from 2013. There are no figures on the percentage of sales that come from spending on K-beauty products, but Ms Grace Ban, former managing director of a multinational beauty corporation, thinks Korean brands have some part to play in the overall growth in the beauty sector. Internationally, the South Korean beauty industry is booming. According to a Bloomberg article published in April, South Korean beauty companies such as Amorepacific and LG are growing at breakneck speed compared to other industries in the country. The Washington Post recently estimated that the South Korean beauty industry rolls in around US$10 billion in sales annually. While the Chinese have long been voracious consumers of Korean products, the American market is also increasingly receptive to labels such as SkinFood, AmorePacific and Banila Co. Ms Cheryl Chio, 34, an editor at an investment bank who travels to Seoul at least once every quarter to stock up on the latest beauty products, spends $1,000 or more each time. She is excited by the constant stream of new launches. Typically, masstige - a market segment poised between drugstore and premium - Korean brands offer new collections almost every month, while other international brands in the same category do this at a slower pace. She says: \"I'm a sucker for pretty and limited- edition packaging from brands such as Etude House and Hera.\" The K-beauty brands' lower prices are also a draw. \"I get more satisfaction when I spend around $50 to get three lipsticks from Etude House, instead of just one lipstick from Chanel,\" she adds. Ms Ban says the prices of Korean brands are \"extremely sharp\" and consumers are encouraged to experiment with the labels as they come in affordable mini-sized bottles. Korean beauty brands are also popular because they are made for Asians, says Ms Stenifer Tan, senior merchandising manager for beauty at Tangs. She says: \"The textures are lighter, so they're great for our climate. Korean products are focused on hydration, whitening and skin elasticity, which are the key skin concerns of most Asian women. The make-up shades match fairer Asian skin tones too.\" It also helps that dewy-skinned K-drama and K-pop stars are often the spokesmen for beauty brands. For example, Innisfree is fronted by actor Lee Min Ho and singer-actress Im Yoona, actress Song Hye Kyo is the ambassador for Laneige, while the face of The History of Whoo is actress Lee Young Ae. But Korean brands are not the only ones perpetuating the Hallyu influence in the beauty industry. French, Japanese and American brands now churn out glow-enhancing foundations that promise to give \"mul-kwang-pi-bu\", or a water glow finish. Lancome launched its Blanc Expert Cushion Compact earlier this year and its selling point is the in-demand dewy skin look. Japanese brand Shu Uemura produced its glow- enhancing Lightbulb Fluid Foundation in 2013. It has proven to be so popular that it added the Stage Performer Glow Creator Base And Top Glow Boosting Cream to its line-up earlier this year. In September, American brand M.A.C, which usually stocks matte foundations, will launch its Studio Waterweight Foundation that gives skin a \"luminous finish seen on Korean celebrities\", says Mr Beno Lim, M.A.C Singapore's senior make-up artist. Bright coral and pink lipsticks, the finishing touch of the K-celeb look, have also proliferated across international brands. New York-based Bobbi Brown has recently gone the whole hog to take advantage of the K-beauty trend as well. In April, it announced South Korean actress Claudia Kim as its first Asian celebrity face. Better known as Kim Soo Hyun, the model-actress recently starred in the Marvel movie, Avengers 2: Age Of Ultron. The campaign she fronts will be released in Asia next month. Kim will star in Bobbi Brown's online beauty make-up lessons, a move in tandem with the K-Beauty Make-up Lessons that Bobbi Brown will roll out in its Asia Pacific stores in August. Mr Felix Nguyen, the brand's artistry manager for Asia Pacific, says: \"The K-beauty trend is in sync with Bobbi's make-up philosophy - not too much make-up, flawless glowing skin, fun pop or nude colours on the lips and well-defined eyes.\" For all the hype, not everybody is completely sold on K-beauty. Mr Afif Haddar, the general manager of Sephora South Asia and South-east Asia, says that while Korean cosmetics such as Laneige have innovative products that \"represent the quality of Korean brands\", others do not. Sephora stocks mainly American and French brands. It carries just a handful of South Korean cosmetics, including Laneige and Pure Heal's. He adds: \"Some are just surfing on the Korean beauty reputation, while their products are average. They think that when the product is made in Korea and branded as Korean, half the job is done.\" Indeed, not all K-beauty brands are successful on the local scene as competition is stiff. Too Cool For School, known for its cute packaging as well as interesting skincare formulas made from makgeolli rice wine and yogurt smoothie, pulled out in April. It had opened four outlets before its exit. What the Korean brands offer is not to everyone's liking either. Bank manager Joan Soon, 31, says she will stick to her favourite American brands such as M.A.C. and Urban Decay. \"The Korean beauty brands focus on light and natural-looking make-up looks. I prefer to wear heavy eye make-up. I find that the eyeshadows from those brands are not pigmented or long-lasting enough,\" she says. \"Make-up colours are also limited. The darkest foundation shade from the K-brands are too light and pinkish for my olive skin tone.\" But Ms Sarah Boyd, chief executive of the Guardian personal care chain, is confident that Korean beauty products are here to stay. She says the words \"Korean beauty\" was a top ethnic beauty Google search term in 2014. In the coming months, she plans to expand the K-beauty selection in the shops. Mr Nguyen of Bobbi Brown also insists that the Hallyu beauty look will become a \"normal style of make-up\" for Asian women as it is flattering on most of them. He adds: \"The techniques are classic and timeless. And who doesn't want plump, glowing and flawless skin?\" gladysc@sph.com.sg Mizium sparks new beauty product ideas At the outskirts of Seoul in Gyeonggi-do, rising out of manicured lawns like an architect's dream, is a building called Mizium. Completely made of grey stone, its clean cuboid shape towers over the viewer with edges sharp enough to cut paper. This is a research and development centre run by South Korean beauty conglomerate AmorePacific. Built in 2010, the 26,000 sq m complex was designed by Portuguese architect Alvaro Siza to house 400 researchers who are creating new cosmetics and beauty products for the brand, the country's largest cosmetics manufacturer. Its 26 brands include international beauty labels Laneige, Etude House, Sulwhasoo and Innisfree. Inside the Mizium, the vast lobby features works by South Korean artists such as Choe U Ram, Park Seung Mo and Kang Hyung Koo. On one wall, there is a gigantic portrait of an old man's face, lined like a map. In another corner, layers of wire mesh create the optical illusion of a woman's body floating on a swathe of silk. The company hopes the artistic surrounds can spark new ideas. After all, innovation is what keeps it at the top of its global beauty game. AmorePacific chief technology officer Han Sang Hoon says: \"Our researchers go to the stores to observe customers, find out what their complaints are and see if they are using products in ways we did not intend. Then we go back to the drawing board.\" Founded in 1945, AmorePacific is one of South Korea's oldest beauty companies. In the post-World War II years, it launched the country's first fragranced plant-based pomade. It was also one of the first to introduce a multi-step skincare routine that includes toners and lotions, to South Korean women in the 1960s. One of its biggest claims to fame is the cushion compact launched in 2008. Mr Han says: \"It is a new make-up category that never existed in the past.\" Inspired by the ink pad, the product is essentially a cushion soaked in liquid foundation, or BB cream. It offers women a fuss-free no-spill option for on-the-go touch-ups. AmorePacific claims that more than 50 million cushion compacts have been sold worldwide to date. Hoping to ride on the product's success, French beauty brand Lancome recently launched its own version. Another original from AmorePacific is the Laneige Water Sleeping Mask, a hydrating leave-on gel mask released in 2002. Previously, most masks had to be washed or peeled off after 10 to 15 minutes. \"We realised that women find it a hassle to rinse their faces after using a mask. So we thought about a product that provides hydration while they sleep and yet will not smudge onto the pillow,\" Mr Han says. The convenience it offers has made it a bestseller. The brand says 16 million jars have been sold since it was released more than a decade ago. Laneige is one of the first to offer such masks. Now, labels such as The Body Shop and Taiwan- based For Beloved One have similar products. AmorePacific is also a pioneer in skincare formulas that tap on traditional Asian ingredients. \"For instance, Sulwhasoo products are created based on historical Korean medical records, and tweaked with modern technology,\" says Mr Han, whose team registered some 200 patents worldwide last year. Traditional Korean ingredients commonly used in the company's formulas include red beans, camellia, apricot blossoms, pine tree and bamboo extracts. Its star ingredients, however, are ginseng extracts (AmorePacific launched one of the world's first ginseng-based cosmetic in 1966); and green tea essence (the corporation has been doing research on its benefits and cultivating green tea fields on Jeju Island since 1979). Green tea and ginseng are now relatively common additions in cosmetic products from international labels. So far, the corporation seems to be on the right track. According to Bloomberg, AmorePacific's net income last year rose by 42 per cent. Bloomberg reported that AmorePacific's stock rose 158 per cent in Seoul trading over the past year, topping the global beauty and personal-care segment. AmorePacific's 2014 Sustainability Report shows that the group's sales totalled 4,711.9 billion Korean won (S$5.8 billion), a 21 per cent rise from the previous year. Join ST's Telegram channel and get the latest breaking news delivered to you. Read 3 articles and stand to win rewards Spin the wheel now MCI (P) 066/10/2023. Published by SPH Media Limited, Co. Regn. No. 202120748H. Copyright © 2023 SPH Media Limited. All rights reserved. ",
    "datetime": "2015-06-13T10:05:29+08:00",
    "url": "https://www.straitstimes.com/lifestyle/the-rise-of-k-beauty-in-singapore-and-globally"
}