{
    "title": "The Best K-Beauty Products for Black Women 2019",
    "text": " Things you buy through our links may earn Vox Media a commission K-Beautiful: Helping you navigate Korean beauty in 2019. K-Beautiful: Helping you navigate Korean beauty in 2019. K-beauty products have always appealed to me because they excel at being everything I want in a skin-care product: hydrating, soothing, and refreshing. I don’t necessarily need my face to look damp all the time, but you best believe I want it to feel damp, from the third time I hit snooze to the moment I finally lay my head to rest, two hours past my intended bedtime. I’m also equal parts Korean and black, which means while I’m used to texting my mom for free label translations of the sheet masks that came from her hometown, I’m just as familiar with searching for my brown skin tone on swatches and shelves to no avail. Thankfully, times are a-changing, and as K-beauty products continue to be mainstays in many a good skin-care routine, it’s easier than ever to construct a lineup that’s a great match for the skin-care issues black women deal with the most, like hyperpigmentation, dryness, inflammation, and cursed acne scars. So in addition to these very good Korean skin-care recommendations for black women, here are seven more K-beauty products my melanin and I are big fans of these days. Few things can completely ruin a skin-care routine like that tight, stripped feeling right after you cleanse. This silky gel cleanser has a low pH, which means it keeps your moisture barrier content by not disturbing it. It also has the perfect mix of hydrating things, cleansing things, and soothing things, which leaves your skin feeling clean, calm, and ready to receive the next steps in your routine. Mamonde’s Rose Water toner is a fan-favorite, but I love this pore-refiner for when I can tell a breakout is on its way or when most of the “dewiness” on my face is just pore-clogging sweat. A few swipes of this after cleansing leaves you with a cleaner, zipped-up feeling, like you took a nice vacuum to your face before inviting the rest of your skin-care routine over. Plus, it has a light herbal scent that’s a nice change from all the other flowery and fruity stuff that usually fills medicine cabinets. The best way to battle hyperpigmentation when it rears its large, annoying head is to always be one step ahead of it. This moisturizing blend of brightening ginger and vitamin C has helped me keep things bright and even on a regular basis, and it always comes to the rescue when I need it most (following the death of a hormonal breakout or particularly evil cyst.) Texture has a lot of bearing on tone and dryness, and this sleeping mask does all the the dirty work of sloughing stuff off for you while you’re passed out. In addition to the delicious cocktail of hydrating and soothing watermelon every thirsty face loves to drink, this has AHA, a blend of plant-derived lactic acid and glycolic acid, both of which gently exfoliate overnight so you start waking up with glowier and glowier skin, before even grabbing your Killawatt. This is quite possibly the most refreshing and mesmerizing product I own. A single squirt (a little goes a long way) emits a shiny gel that literally bursts into brightening liquid (water, if you will), once it touches your skin. It gives inflamed skin an instant refresh, keeps your skin feeling like it’s been drinking the recommended ounces of water all day, and leaves a dewy shine that’s especially welcome when your focus is on evening out your skin tone and/or taking very good selfies in the sun. If a breakout nevertheless persists, I’ll slap one of these on to calm everything down before moving into the scar-fading and brightening stage. These particular sheets are more like gels, which gives one the sensation of putting a huge, face-shaped cooling eye gel speckled with green tea leaves on the entire face. And f you really think about it, that’s something we should all aspire to do at the end of any day. Mists seem superfluous when you’re not the one in possession of one, but they’re honestly an excellent away to keep everything moist all day without 1) having to touch your face with hands that have been everywhere, 2) dunking your face in water and, 3) fastening on a face mask while you attempt to work and what have you. This spray fast-forwards straight to the part where you’re left with serum seeping into your now moist, glassy-looking face. If you buy something through our links, New York may earn an affiliate commission. By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us. Things you buy through our links may earn Vox Media a commission                 ",
    "datetime": "2019-08-12T17:43:09.891-04:00",
    "url": "https://www.thecut.com/2019/08/korean-beauty-skin-care-routine-for-black-women.html"
}