{
    "title": "The K-Beauty Secrets of Up-and-Coming Model Sunghee Kim",
    "text": "From the best face mask to hair oil. Model Sunghee Kim’s career has taken off–most recently she hit the runway at New York Fashion Week and Seoul Fashion Week. Here, the Korean beauty dishes out her best beauty secrets, from coconut oil masks to protein shakes and aerial yoga to her mother’s homemade body scrub and her best tips on how to apply skincare products. Your look in three words: Clean, Neat, Classic. Medicine cabinet snapshot: For the skin products, I use the Radiant Multi Repair Oil from Clé de Peau Beauté. A good hair day starts with: Moroccan Oil Serum, and a coconut oil hair mask. Makeup miracles: I cannot live without are my red lipstick and sunblock. Nails must be: My favorite nails must be done by Jin Soon Choi. Sheet mask or mud mask: My favorite mask is the Klavuu White Pearlsation Enriched Divine Pearl Serum Face Mask, or  sometimes I use velvet sheet masks that I wet it with water or essence. Related: 7 Designers You Need To Know From Seoul Fashion Week Bronze or blush: Tom Ford Shade & Illuminate Cheeks Shading Cream. Beauty from the inside out: For nutrition, I drink a smoothie everyday which is made out of kale, apple, banana, avocado, coconut water, protein shake, vitamins, and an evening primrose oil. Exercise obsession: I love pilates and yoga, especially aerial yoga. Drink of choice: I usually drink Juice Press or protein shakes. Product that you borrow from the boys: I borrow cologne from boys. A woman should smell like: Diptyque L’Ombre dans l’Eau only. Spa-cation at: In Seoul, I go to a place called Just Spa and in the U.S., I go to Korean-style saunas. Best advice from mom: My mom always make her own scrub that’s really great by putting black sugar, Vaseline, and little bit of coconut oil. Anything else: When you wash your face, wash carefully around the face line and hair line, use a mist to give moisture right after washing your face and when you put on your makeup base, it is better to lightly pound than to rub. ",
    "datetime": null,
    "url": "https://www.wmagazine.com/story/sunghee-kim-model-beauty"
}