{
    "title": "The Latest K-Beauty Items That Are Utterly Unmissable | Soompi",
    "text": "Korea is the beating heart of beauty innovation, which is why we’ve curated an exciting edit of the coolest K-Beauty cosmetics and skin care with Kmall24 who we recently worked with in creating the ultimate K-pop star beauty box. (Check out the unboxing video of the K-pop beauty box by Rising Legends winner Alex Christine here!) So sit back, pour yourself a cup of green tea, and browse our Eastern beauty hall of fame. The winter weather can ravage the delicate skin on lips, so it’s important to take care of them in order to look flawless after applying lipstick. The Laneige Lip Sleeping Mask nourishes your lips so you can wake up to plush and moisturized lips in the morning.  [LANEIGE] LIP SLEEPING MASK BERRY (SWEET BERRY COMPLEX) After your lips are moisturized, you’ll be ready for any lip color from something more natural to an eye-catching statement lip. Dear Dahlia’s lipstick combines plant based natural ingredients with skin conditioning properties to provide beautiful pigmented color without any dryness and flakiness.  [DEAR DAHLIA] LIP PARADISE INTENSE SATIN (806 RUBY) We do love a good eyeshadow palette, but sometimes a compact, all-in-one set is way handier. Whether you use it for a weekend away or during a commute, multi-purpose palettes containing both eye and face products are excellent to invest in. The palettes below have combinations of eye shadows, blushes, and highlighters!  [ROM&ND] PERFECT STYLING EYE PALETTE  [ETUDE HOUSE] UNIVERSE MULTI PALETTE When we first heard of cleansing water, we thought it had something to do with body cleanses or detoxing. However, it turns out that cleansing water is actually a multitasking skin-care product that’s here to change the way you cleanse your skin. It’s a popular product amongst makeup artists, a must-have for Korean women and it could be your new best friend.  [ATRUE] SWEET SONG ONE-STEP CLEANSING WATER  [SON&PARK] BEAUTY WATER With the mercury rapidly falling, you need to find the perfect ‘winter coat’ for your complexion – a rich cream to prevent dehydration and deflect the harmful effects of the plummeting temperatures.  [CUTEM] DAILY CREAM If you’re running short on time in the lead up to a fancy soirée, these sheet masks will help transform your tired, sallow skin into that of a glowing red carpet goddess. JUMISO Water splash sheet masks will instantly give you glowing and nourished skin.  [HELLOSKIN] JUMISO WATER SPLASH SHEET MASK (5EA) The sooner you start with anti-aging, the better! With game-changing devices and precision implements to help you face the future looking fabulous, these tools will help minimize fine lines and guarantee an immaculate makeup look.  [MERBE] SELF-SKINCARE DEVICE WITH ION AND ULTRASOUND  [ECO FACE] ECO FACE LIGHT THERAPY LED MASK You can find all the products above at Kmall24, the online store for fans of Korea. Use Coupon Code “Welcome” to get $5 off your first order. ",
    "datetime": "1514362731",
    "url": "https://www.soompi.com/article/1098851wpp/latest-k-beauty-items-utterly-unmissable"
}