{
    "title": "The Newest Korean Beauty Trend Is Green Vegetables for Your Skin | Glamour",
    "text": "By Deanna Pai When we saw the freshest trend rolling out of beauty hotspot South Korea, we couldn't believe our eyes. Not because it was that groundbreaking—because really, it's not earth-shattering stuff—but because no one had thought to blend greens into skin care products before now. We're talking about good-for-you greens—think artichokes, parsley, kale, cucumber, lettuce. It opened up a lot of questions: While they're beneficial to your body, are they really as good for your skin? Does our face need green juice, too? It's not like plant life is new to the skin care world. Algae has been a main player in anti-aging formulas for a long time, as have mushrooms and botanical extracts. But this crop of skincare products more closely resembles what you'd find in a cold-pressed juice shop. The trend, like many of the moment, has its roots in Korea. \"Korean brands have been known to formulate their products using extracts and ingredients that aren't cultivated in a lab,\" says Charlotte Cho, a registered esthetician and founder of K-beauty site Soko Glam. \"I'm definitely seeing this more and more across all products and brands. It's a nod to the real ingredients that make it a high-quality skin care product.\" Plus, their effects speak for themselves. The latest must-have in Korea is not mists or tree sap (which we're just starting to get excited about here in the states), but something called glass skin. \"Glass skin refers to a luminous, clear, plumped look that's aspirational for Korean women,\" explains Sarah Lee, co-founder of Korean beauty e-tailer Glowrecipe. \"Having skin with a glass-like quality is the ultimate in mul gwang or 'wet-looking luminosity.'\" In other words, it's that dewy glow we're all after. And, says Lee, these veggie-packed juices are the way to get it. Spinach Spinach is just a part of this potent mask, which also includes antioxidant-packed green tea and spirulina, a kind of algae that's a major food group of super-healthy people like Gwyneth Paltrow. But spinach is the true star of this show. It's packed with antioxidants, beta-carotene (a precursor to Vitamin A), and more vitamins than we can count—so it really makes no sense not to include it in your skin care regimen. Origins By All Greens Foaming Deep Cleansing Face Mask, $36, sephora.com Lettuce Even if your stomach isn't the biggest fan of salad, your face at the very least should be. \"Both lettuce and cucumbers are extremely hydrating and are also rich in vitamins A and C,\" explains Cho. \"Vitamin A actually stimulates collagen production and slows down the breakdown of elastin, while vitamin C not only prevents brown spots from occurring, but lightens them as well.\" It's basically an anti-aging powerhouse in a little, unassuming package. Skinfood Premium Lettuce & Cucumber Watery Essence, $25, sokoglam.com Kale Kale had its 15 fifteen minutes of fame when the green-juice trend started...and clearly, it's about to get another. But that's a good thing, since it's a smart skin care ingredient. The leafy green is like an antioxidant bonanza, delivering vitamins A, C, E, and K, which makes it perfect for cleansing skin after a day in the not-so-clean outdoors. Vitamin E softens skin—and is a pretty potent antioxidant in its own right—while dark under-eye circles don't stand a chance against K. Ariul Kale & Grapefruit Juice Cleanse Mask, $4, peachandlily.com; Youth to the People Age Prevention Cleanser, $36, b-glowing.com Artichoke \"Artichoke extract contains cynaropicrin, an anti-inflammatory agent that inhibits free radical activity while increasing circulation,\" explains Lee. But the extract itself also helps cells retain moisture and build up cell-wall density, which in turn keeps pores tight and tiny. Yuri Pibu Artichoke Power Essence, $38, glowrecipe.com Herbs Even in cooking, throwing in a few herbs can make a huge difference. It applies to beauty, too: Many herbs, like rosemary and peppermint, have astringent properties, meaning they slow oil production and take down excess sebum (a.k.a. the stuff that clogs pores and leads to breakouts.) And parsley in particular pairs brightening vitamin C with carotenoids, which speed up skin healing, says Lee. Bonus: Herb-packed formulas also smell insane. By Andrea Navarro By Emily Tannenbaum By Elizabeth Logan Yuri Pibu Parsley Herb Toner, $36, glowrecipe.com; REP Bio Fresh Mask with Real Nutrition Herb, $41, sokoglam.com Watch Charlotte Cho Explain What You Really Need to Know About Korean Beauty: By Shanna Shipin By Fiona Embleton By Danielle Sinay By Alessandra Signorelli More from Glamour See More Stories © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Glamour may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "datetime": "2016-04-28T21:00:00.000Z",
    "url": "https://www.glamour.com/story/vegetable-skin-care-korean-beauty-trends"
}