{
    "title": "The ancient Japanese beauty hack that you need for glowing skin? Rice water | Vogue India",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, visit My Profile, then View saved stories By Hasina Jeelani From double-cleansing to glass skin, we have plenty to be thankful to the world of Japanese and Korean beauty for, and the list just grew further with the addition of a skincare saviour that is as effective as it is accessible: rice water. Now, bear in mind that there are a few parameters that skincare superfoods must fulfil—a glowing recommendation from a Kardashian nearly always tops that list. Kim Kardashian swears by its benefits for strengthening her tresses, and experts believe that rice water spells good news for your skincare goals as well. While the sudden influx of rice water-infused formulas in the beauty aisle might make it seem like K-beauty’s latest export, it is actually the oldest trick in their beauty bible. Dr Madhuri Agarwal, founder of Yavana Aesthetics Clinic, believes that the easy accessibility of rice has a huge role to play in its popularity as a skincare saviour. She says, “Rice is a staple of the Asian diet. Being an economical and natural ingredient, it can be easily added to the everyday skincare routine. Indians consume rice water for its starch content to hydrate the body in debilitating health disorders. Meanwhile, Japanese and Korean women have been using it since centuries in their skincare regimen for its rich mineral content that aids healthy skin.” She also confirms that there’s a larger wave of old-made-new-again skincare superheroes at play. “The flawless, youthful skin of Korean women has triggered an interest in rice water in the Western world and it is now reaching Indian shores. It is similar to our traditional Ayurvedic skincare rituals. They are now embraced with renewed interest by international as well as homegrown brands,” she explains. For starters, you can expect relief from inflammation and smoother skin. The Mumbai-based dermatologist elaborates, “Rice water contains starch that is often added to bathwater to reduce inflammation in itchy skin conditions, such as atopic dermatitis. It is also used to soothe sunburn and reduce blemishes by some experts. It is shown to have antioxidant activity by virtue of ferulic and phytic acid elements. Certain studies in 2018 also claim that it shows anti-ageing potential by hydrating the skin and giving it a smooth, porcelain-like finish.” By Hasina Jeelani By Prabal Sharma By Kejhal Kalra If you’re looking to add rice water to your routine, she recommends storing boiled or soaked rice water in a refrigerated spray bottle for use up to a week. Fermented rice water can be kept for a longer time when stored hygienically. For best results, it can be directly sprayed on the face and left on for half an hour or overnight for brightening the skin tone. Rice water also serves as a facial cleanser for double cleansing at night. She advises, “Soak a cotton ball with rice water and apply it on the face. You can further use it for a gentle massage after a long day and wash it off after ten minutes. Upon spraying the cold rice water, you will feel the instant tightness and freshness of the skin.” Those in search of a DIY project for the weekends will delight in knowing that there are several at-home concoctions to experiment with. “Rice is an everyday staple in most homes and hence, rice water can be easily made at home—half a cup of rice can afford up to one week’s worth of rice water. Take the excess water from the top of your daily boiled rice or drain the excess water after boiling the rice, put it in a spray bottle and refrigerate it to use,” she says. On those days when you want the easy way out, uncooked rice can also be soaked straight out of the bag in warm water for 30-40 minutes. It can then be decanted in a bottle to use as and when needed in your skincare routine. A more time-consuming approach would be to ferment rice water—the payoff comes in the form of higher efficacy as it reinstates the high pH and antioxidant levels. After making rice water by the boiling or soaking method, it can be stored for 24 hours at room temperature in a glass jar and then refrigerated for two-three days. The fermented rice water will be ready for use after being transferred to a spray bottle. Dr Agarwal advises a final word of caution, “Rice water is a regular household ingredient and extremely safe to use without any known side-effects. However, it is advisable to avoid leaving the rice water at room temperature for longer than 24 hours as it will tamper with its nutrient potential and the water will be devoid of its benefits. It also pays to bear in mind that the rice water use is still under study by dermatologists and most of the benefits are anecdotal.” 7 top Korean beauty skincare trends of 2020 for glowing skin like never before How to transition your skincare routine for summer, according to K-beauty What makes K-beauty a global skincare phenomenon? By Violeta Valdés By Namrata Kedar By Hasina Jeelani By Neeti Mehra See more stories Condé Nast India © 2023 Condé Nast. All rights reserved. Use of this website constitutes acceptance of our Terms of Service and Policy and Cookie Statement. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. ",
    "datetime": "2020-09-04T10:13:27.053Z",
    "url": "https://www.vogue.in/beauty/content/japanese-beauty-hack-for-glowing-skin-rice-water"
}