{
    "title": "The Correct Way to Use Sheet Masks to Get Better Skin | Allure",
    "text": "By Renee Jacques If you haven't used a sheet mask yet, do your skin a favor and get on it, ASAP. The skin-care staple is a favorite among celebrities, beauty bloggers, and, of course, Allure editors. Infused with fortifying serums or essences, they allow the ingredients to absorb into skin more effectively because they prevent evaporation. We love them so much that we've picked 13 of our favorites for every budget. But there's a right way to use them, according to this adorable illustration. If you've been winging your sheet-mask application until now, this adorably informative illustration from a new book by Charlotte Cho, the blogger behind the Korean-beauty site Soko Glam, should help. Drawn by cartoonist Gemma Correll, the illustration breaks it down into six simple steps. The book, The Little Book of Skin Care (available now!), is packed with other helpful illustrations by Correll and tips that draw on Cho's extensive knowledge of Korean beauty and skin care. \"I started Soko Glam after I'd been living in Seoul for five years and adopted a Korean skin-care routine,\" says Cho. \"It completely changed my skin. I got compliments—and I had never gotten those before.\" So for three years now, on her blog, Cho has been a major advocate of Korean beauty products, encouraging her readers to incorporate them into their daily skin-care routines. \"I was inspired by how Korean women think of skin care as a part of their well-being and something that allows them to pamper themselves and feel good every day,\" says Cho. \"Being really obsessed with skin care, I realized that since it's kind of a dry and boring subject, I tried to make this book as fun as possible. The book is really about the Korean mind-set and philosophy.\" You'll also find an entire glossary that explains Korean skin-care ingredients. Our top ten Asian beauty products: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Nicola Dall'Asen By Kara McGrath By Devon Abelman By Sarah Han More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2015-11-11T09:30:00.000Z",
    "url": "https://www.allure.com/story/sheet-mask-how-to"
}