{
    "title": "The Tonymoly and Pokemon Go Collaboration Is So Damn Cute | Allure",
    "text": "By Rachel Jacoby Zoldan I've been a big Tonymoly fan ever since I got superserious about Korean beauty. Not so much with Pokemon Go, despite my husband's addiction. But the Tonymoly and Pokemon Go collaboration is just about the cutest thing I've ever seen—even though no, I still don't want to play Pokemon Go with my husband or you. (Even if it's now available on the Apple Watch I want so badly.) More K-beauty products you should probably buy right this very second: Maybe it's because I'm a sucker for K-beauty as I mentioned, maybe it's because I'm a sucker for adorable packaging, but the Tonymoly and Pokemon Go collaboration is a skin-care junkie's dream limited-edition launch, in my opinion. And because the slogan for Pokemon is \"gotta catch 'em all,\" I figure, yes, yes I should catch them all and take 'em for a test-drive, especially while I'm just hanging out at home during the holiday break. If I'm being really, really honest, what I love most about Tonymoly products in general—Pokemon Go collection included—is their affordability. Their sleeping packs, hand creams and facial mists are just as quality as some pricey prestige products, but only for a fraction of the cost. Similarly, the prices on the Pokemon Go collection are easy on the wallet too, starting at $5 for a single sheet mask, while the most expensive of the lot—the face cream—will set you back just $23. The thing is, though, I'd argue any Tonymoly face cream is as close to By Alison Caporimo and Catherine Q. O'Neill as you can get for far less money—and in far more adorable packaging. Also in the collection are a trio of lip tints (a big K-beauty trend I'm expecting to see blow up the makeup scene in 2017), nine different hand creams, and cleansing foams. The well-edited line offers the basics for any skin-care starter, which is why I'm glad my husband is a Pokemon Go fan—he's about to partake on his first-ever K-beauty routine when the new year kicks off. He just doesn't know it yet. (He's off the hook on the lip tints, though—I'm stealing those.) You can catch of all these Pokemon (see what we did there?) on kbeautynow.com before they're gone. However, there's a litany of additional Tonymoly and Pokemon Go in Korea, where the brand is based and the collaboration was primarily released. Check out a few choice Instagrams from their official account to get you in the Pokemon training mood—and hoping products like the elusive temporary tats, colored mascaras and skin-friendly toners (pictured below) make it over stateside. This content can also be viewed on the site it originates from. This content can also be viewed on the site it originates from. By Aliza Kelly By Gabi Thorne By Gabi Thorne This content can also be viewed on the site it originates from. This content can also be viewed on the site it originates from. By Aliza Kelly By Gabi Thorne By Gabi Thorne This content can also be viewed on the site it originates from. This content can also be viewed on the site it originates from. By Aliza Kelly By Gabi Thorne By Gabi Thorne This content can also be viewed on the site it originates from. Now watch this video from The Weather Channel in which they investigate if Pokemon Go can actually help fight depression: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Nicola Dall'Asen By Sarah Han By Dianna Mazzone By Devon Abelman More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2016-12-25T19:32:42.170Z",
    "url": "https://www.allure.com/story/tonymoly-pokemon-go"
}