{
    "title": "The beginner's guide to K-beauty makeup - GirlsLife",
    "text": "     Maybe you've already integrated a 10-step Korean skincare routine into your nighttime regimen. Maybe you're completely new to the world of K-beauty. Or maybe you've simply been influenced by the countless TikToks about lip stains! No matter your familiarity or experience with Korean makeup, don't be afraid to dip your toe into the world of K-beauty. Meant to emphasize your natural beauty and ~inner glow~ from within, these techniques and products used in Korean-style makeup will def catch your eye (and perhaps your shopping cart). Lightweight base Missha M Magic Cushion SPF50+/PA+++, $19 Ever heard of the term \"glass skin\" while watching Korean skincare routine videos on YouTube? To enhance the look of luminous, even-toned skin, try going for a more lightweight base rather than a heavy foundation. BB creams (especially with SPF—protect your skin!) can help you achieve a more even complexion without too much coverage of your au naturale skin. Cushion foundations are another staple of K-beauty and are often buildable to provide low to high coverage. Simply apply the pigment with the cushion puff, gently patting your skin to blend and layer if needed. Your skin is flawless skin! @_mariahwasa Fresh blush 3CE Mood Recipe Face Blush, $20 Instead of applying blush only on the apples of your cheeks, try extending your blush to your undereye area. This might be uncharted territory at first, but trust us—this technique can totally give a healthy, bright and fresh look to your face. Just be sure to start with a light hand so you don't accidentally go overboard with it! (Bonus points if you dust a bit of blush over your nose, and even across your eyelids for a monochromatic look.) @_zyozyo Glowy eyeshadow Etude House Play Color Eyes Palette, $30 Anyone else obsessed with \"wet\" eyeshadow looks? If you're on the prowl for a gorgeously reflective eyeshadow glitter, browse through some Korean makeup brands. For a glowy yet subtle look, start with a matte base all over your eyelid, deepen it with a slightly darker shade and apply a shimmer to your liking, highlighting your inner corners and \"aegyo sal\" (the pocket of fat directly under your eye that shows up when you smile). @iam.fleur Enhancing eyeliner CLIO Superproof Pen Liner, $18 If you're a lover of a dramatic cat-eye or a tight waterline, try switching it up with a natural, thinner winged eyeliner look to open up your eyes without overpowering your features—and yes, this is beginner-friendly for eyeliner newbies! With liquid eyeliner or an eyeliner pencil, follow the natural curve of the top of your eyes and extend it to your liking. Pro tip: Try switching out your jet black eyeliner for a brown one to achieve a more subtle look. @itzy.all.in.us Pouty lips rom&nd Juicy Lasting Tint, $14.99 You can't have a convo about lip stains without bringing up Korean lip products! Though these products usually range from nude shades to deep wine colors, many K-beauty looks feature a brighter lip shade. Lip tints will generally slightly stain your lips with pigment, allowing for a beautiful, long-lasting pout. Instead of perfectly outlining the shape of your lips, try dabbing a bit of product in the middle of your lips and blending outwards to enhance the poutiness. Absolutely gorg. @akmu_suhyun Check out these posts for more makeup inspo:\n🤍 6 makeup products for the perfect dewy look\n🤍 Our step-by-step guide to a glowy glam look\n🤍 Your guide to the best eyeliners Tag us in your makeup looks inspired by K-beauty on Instagram @girlslifemag! Slider image: @for_everyoung10\nTop image: @erikamtitus POSTED IN STYLE, Beauty, makeup How do you like to be active when it gets colder outside? How do you like to be active when it gets colder outside? You + Barbizon = model magic 📸  We've partnered with Barbizon—the ultimate place to get discovered—to help one lucky GL reader live their model moment. Enter to win here! WIN! The Queen and the Knave  Romance and mystery in Victorian London. Enter to win here! Plan your ideal trip and we'll tell you which European city to visit Why does your BFF heart you? Which fall Starbucks drink are you? ",
    "datetime": null,
    "url": "http://www.girlslife.com/style/beauty/40839/the-beginners-guide-to-kbeauty-makeup"
}