{
    "title": "The Easy 6-Step Korean Skincare Routine For Radiant Skin At Any Age | British Vogue",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, select My Account, then View saved stories To revisit this article, visit My Profile, then View saved stories To revisit this article, select My Account, then View saved stories We may earn a commission if you buy something from any affiliate links on our site. By Hannah Coates Regardless of our age, when it comes to our skin, we’re all on a quest for the same thing: a plump, glowing, and healthy complexion. In Korea, they call it “choc-choc”, explains facialist and founder of 001 Skincare Ada Ooi, who counts everyone from Lady Gaga to Rooney Mara as clients. Far from the elaborate, 12-step K-Beauty skincare regimes you’ve heard about, Ooi believes that skin like this can be achieved with half the number of steps. All you need is to know how – and in what order – to properly apply your products. Here, she shares her six-step skincare regime for your juiciest skin ever. By Georgia Day As with any good facial, your first step should be cleansing the skin effectively. To remove your make-up, look to a formula like Augustinus Bader’s The Cream Cleansing Gel (£50, Selfridges), or Comfort Zone’s sumptuous Sacred Nature Cleansing Balm (£44, Selfridges) to lift grime from the face, and use a muslin cloth to wash it off. Next, Ooi recommends using the AHC Aqualuronic Cleanser (£18, LookFantastic) to double cleanse. “It’s very different from most foaming cleansers – it starts foamy, but add some water and it has a very creamy texture, which means it doesn’t dry out your skin,” she says. She advises looking for cleansers that, like this one, contain hyaluronic acid molecules in a number of different sizes, as they create water pathways through which subsequent active ingredients can successfully make their way into the skin. If you thought toner was a thing of the past, think again. “Toning is one step that has been neglected in the UK for far too long, but in K-beauty it’s extremely important,” says Ooi. “After you’ve cleansed your face, your skin’s pH will be all over the place – especially in England where the water is hard. When water is hard it means that even the gentlest of cleansers can be quite harsh to skin.” Toning helps to balance out the skin’s pH (it is naturally slightly acidic), which is important for a strong skin barrier. The toning step is also a chance to hydrate while the skin is still warm and pores are open after cleansing. Look for ultra-hydrating toners – avoid anything astringent or with alcohol – with ingredients like hyaluronic acid, coconut water and vitamins, like Elemis Superfood Kefir-Tea Mist (£25.95, BeautyBay). Ooi advocates adding a few drops into the palms of hands and then patting and pressing it into the skin. “This will help ensure all the formula sinks into the skin, rather than sitting on top of it, evaporating and taking the water in the skin with it. If you think about the motion of tapping and pressing, you can imagine how molecules will just roll into the pores. It’s very important.” By Hannah Coates If you suffer from acne however, applying it with a cotton wool pad is your best bet, Ooi says, pointing out that areas of acne indicate an imbalance of sebum that needs to be remedied. “Think of the skin as a series of fish scales – all the scales (or cells) should be aligned. If, however, you have a scab, blemish or cystic spot, the scales are misaligned, and water comes out and pollution and bacteria seep in. You need to fill those gaps with good, balancing products, like toner.” Those with blemish-prone skin are especially likely to benefit from Medik8’s new Press & Glow Daily Exfoliating PHA Tonic (£25, SpaceNK), which is super-gentle and helps to keep the skin’s surface clear and healthy while hydrating, unlike some acid toners which can over-strip the skin. By Alice Cary By Hannah Jackson By Hannah Coates Emulsion? What’s that? In skincare, an emulsion is a lightweight, semi-transparent lotion that works to deeply hydrate the skin. “Sixty-five per cent of our skin is water, the rest is oil,” says Ooi. “The emulsion step is to replenish the lipids and oil in the skin.” As you did your toner, press the emulsion into skin – not forgetting the neck – and look for formulas that contain hyaluronic acid, ceramides and botanical extracts. We love DHC’s Urumai Lotion (£22, LookFantastic) and Origins Dr Andrew Weil Mega-Mushroom Relief & Resilience Soothing Treatment Lotion (£32, Selfridges). Next up, it’s serum time. The main criteria here is that you look after your skin and its specific needs. Hydration is always key, so a good hyaluronic acid serum, like Elizabeth Arden’s Hyaluronic Acid Ceramide Capsules (£45, LookFantastic), will suit every skin type. Other excellent serums to try are Aurelia Probiotics CBD Super Serum (£64, CultBeauty) to calm, balance and hydrate, and Volition Strawberry-C Brightening Serum (£36, CultBeauty) to boost radiance. While in Asia the concept of an eye cream for the face is now run-of-the-mill, we’re just waking up to it over here. “Usually eye creams contain more potent ingredients like peptides, and they’re not as concentrated in the face creams,” says Ooi. “But these new hybrid products are designed to be used all over, to help soften fine lines and wrinkles.” L’Oréal’s new Revitalift Filler Eye Cream For Face (£19.99, LookFantastic) is packed with hyaluronic acid and works to plump, fill fine lines and hydrate, while AHC’s Eye Cream For Face (£26, LookFantastic) is full of vitamins and peptides to firm and nourish. “Eyes are one place where massage can really help. We look at our phones and sit in front of the computer for a long time each day, and our muscles around them cannot relax – even if you tell them to relax, they can’t. That’s why you get eye bags and ‘11’ lines between your brows,” she says. For a simple DIY massage, try pressing your thumb down on the inside tip of both brows to release tension, then pinch along the eyebrows. Then, use fingertips to gently circle the eye, moving along the cheekbones to inner corners. Ensure you don’t drag the skin, and finish by pressing your temples. By Alice Cary By Hannah Jackson By Hannah Coates The last step in your routine is designed to seal in all of the products you’ve used, and awaken and energise the face. “You want to do some vigorous massage at this point, to help your skin face the day,” says Ooi. “Loosen your wrists and just pat around your face. Jaw muscles are typically tense so break that tension down – use your knuckles to knead it.” After applying your moisturiser, take your first two knuckles on either side of the jawline and draw them back towards the ear, working into any areas of tension. Shiseido’s Enmei Ultimate Renewing Cream (£410, Harrods) is excellent for this, and although it is expensive, has been clinically proven to renew and energise skin. Kiehl’s Super Multi-Corrective Cream (£55, Selfridges) is another excellent cream that works well on all skin types, helping to boost elasticity and even skin tone. More from British Vogue: By Hannah Coates By Georgia Day By Hannah Coates By Kiana Murden More from Vogue Condé Nast Britain © 2023 Condé Nast ",
    "datetime": "2020-10-04T06:00:00.000Z",
    "url": "https://www.vogue.co.uk/beauty/article/korean-skincare-routine"
}