{
    "title": "\n        The Shilla Duty Free officially opens Singapore Changi cosmetics and perfumes stores    ",
    "text": "By  Andrew Pentol \nin  Airports, Asia/Pacific, Brand News, Cosmetics, Fragrance, Latest News, Retail News\nFebruary 10, 2015 Comments Off on The Shilla Duty Free officially opens Singapore Changi cosmetics and perfumes stores The retailer is operating 19 cosmetics and perfumes stores across the airport’s three terminals Travel retailer The Shilla Duty Free has today officially opened 19 cosmetics and perfumes stores across all three terminals at Singapore Changi airport. Korean pop stars TVXCQ and Chinese actress and model Angelababy, the stores’ official ambassadors, held exclusive fan engagement events in terminal three departures, where fans received exclusive The Shilla Duty Free giveaways. The Shilla Duty Free beauty duplex store in T3 is due for completion in June and the mezzanine level will house a Dior make-up flagship store, a beauty Café, and SK-II Pitera Spa. To celebrate the opening, travellers can enjoy promotions and exclusive deals from various brands throughout February. Shoppers will receive a range of free gifts and free face-mask with every purchase. They will also receive special instant savings off their total bill (S$18 with purchases over S$388, S$28 with purchases over S$588 and S$48 with purchases over S$988 in a single receipt). With 182 cosmetics and perfume brands, The Shilla Duty Free, which secured the coveted six-year contract at the start of 2014 and begun operating the stores On October 1 2014 boasts the largest collective beauty offering in Singapore with prices up to 40% cheaper than downtown. The stores are designed to provide customers with the best beauty shopping experience at a duty-free store, according to the retailer. Based on a hierarchical in-store layout, major cosmetic brands are given larger areas at the back of the stores, allowing customers to easily identify their favourite brands and browse latest products and promotions. Beauty and luxury brands are set-up as mini themed shop-in-shops, creating a pathway for consumers to walk through mini-boutiques from the word’s renowned beauty brands in one store. Retailing over 80 brands at the airport which are exclusive the retailer at Singapore Changi airport — 26 are new to the Singapore market— the stores feature popular international brands such as Jo Malone, Giorgio Armani cosmetics, NARS, Burberry cosmetics, Makeup Forever, Clarisonic and Fresh. At the start of the year, The Shilla Duty Free Singapore, through its partnership with SK-II launched the world’s first new SK-II new SK-II AurActivator Complete Correction Cream at its T1 store. The Shilla Duty Free Changi airport stores offer various local skincare and cosmetics brands and the retailer has created the world’s first K-Cosmetics hub outside Korea. Shoppers have access to more than 35 Korean cosmetic products, including popular brands such as Sulwhasoo, Whoo, Laneige, Hera and It’s skin. The Whoo brand is exclusively available at the airport with non-travellers able to purchase at its new flagship T1 departure check-in hall store. The Shilla Duty Free senior executive vice-president Jason Cha said: “The grand launch of cosmetics and perfumes stores at Changi airport marks a significant milestone for The Shilla Duty Free. In collaboration with our brand partners and Changi Airport Group, our vision is not only to enhance the diversity in brand assortment, but offer new innovative travel-retail concepts to customers visiting Changi. As an international hub for travellers, Singapore is the perfect location to create a beauty epicentre for the region, and we are confident that our expansive offering will be warmly welcomed.” Changi Airport Group senior vice-president airside concessions Ivy Wong added: “At Changi airport, world-class retail offerings are an integral part of our award-winning airport experience. With the arrival of The Shilla Duty Free at Changi airport, we have strengthened our retail value proposition for both Singaporean shoppers as well as international travellers. Changi airport now offers the largest collective offering of beauty products in the country, and the world’s first K-Cosmetics hub outside South Korea—at the most competitive prices compared to downtown, Singapore and regional airports. The suite of newly revamped beauty stores by The Shilla Duty Free positions Changi as the best location in Singapore and the region to shop for beauty products.” Tagged with: Changi Airport Group ",
    "datetime": "2015-02-10T11:59:40+00:00",
    "url": "https://www.dfnionline.com/latest-news/retail/shilla-duty-free-officially-opens-singapore-changi-cosmetics-perfumes-stores-10-02-2015/"
}