{
    "title": "The Best Places To Shop For K-Beauty In The UK | British Vogue | British Vogue",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, select My Account, then View saved stories To revisit this article, visit My Profile, then View saved stories To revisit this article, select My Account, then View saved stories We may earn a commission if you buy something from any affiliate links on our site. By Daniela Morosini It's a heartbreaking tale we all know too well. You hear of an über-cool, must-try K-Beauty brand and excitedly start making your mental shopping list of everything you're going to buy. Except, when you come to try and place an order, the website keeps flickering between different languages. You're trying to convert dollars or South Korean won to pounds, while calculating exactly which month your order will arrive, and suddenly, at checkout, you have to pay an eye-watering delivery fee. You give up. Fortunately, there's now a handful of UK-based businesses that take all of the legwork out of shopping for Korean beauty. They've hand-selected the nichest of the niche, giving you the power to finally order as much TonyMoly and Laneige as you wish, without fear of an astronomical customs charge landing in your lap. Here's Vogue's edit of the best to try now... By Hannah Jackson By Alice Cary By Hannah Coates If you're something of an online beauty neophyte, and prefer to actually head in-store for a good old rummage through all the serums, essences and sheet masks, make a beeline for Selfridge's. Inside their cavernous beauty hall, they stock everything from Dr Jart+, Too Cool For School and NeoGen, and have Oozoo and Skinmiso exclusives. The sheet mask wall, piled pleasingly high, is an ideal pit-stop before your next cosy night in. Vogue's picks: Too Cool For School Dinoplatz Escalator Mascara, £22.50, NeoGen Gentle Wine Peeling Gauze, £25, The Ooozoo Face Hydrolift Mask, £8. If you're already a K-beauty connoisseur and know your Itsskin from your Innisfree, head to Kosame. The newly-launched retailer carriers of the more hard-to-find brands in Europe, like IOPE and Primera. The former's Bio Essence Intensive Conditioning Essence is a Seoul best-seller, while the latter fuses K-Beauty with the clean movement. They also carry the ever-popular but elusive Laniege and Sulwhasoo. Vogue's picks: Laneige Lip Sleeping Mask, £19, Bio Essence Intensive Conditioning Essence, £42. Founded by former beauty journalist and model Alexia Inge, Cult Beauty have consistently supplied British beauty obsessives with the best and newest - they were the first to bring BeautyBlender to the UK. The edited selection on their website includes TonyMoly, J.One, and Instagram favourite, Glow Recipe. Vogue's picks: Glow Recipe Watermelon Glow Sleeping Mask, £42, J.One Black Jelly Pack, £32, The Konjac Sponge Company Bamboo Charcoal Pack, £8.99 By Tish Weinstock By Lauren Murdoch-Smith By Violeta Valdés By Annie Lord More from Vogue Condé Nast Britain © 2023 Condé Nast ",
    "datetime": "2019-04-08T12:21:29.000Z",
    "url": "https://www.vogue.co.uk/article/korean-beauty-brands-uk"
}