{
    "title": "The Truth About Korean Skincare From A Korean Dermatologist ",
    "text": "\"Is the time, expense, and effort really worth it?\" As a dermatologist who has suffered from acne, I have access to every dermatologic prescription, but my Korean mother insists that her buzzy multi-step regimen is the remedy. Like many Korean women, my mother credits her flawless complexion to the super-intense skincare regimen that American women have begun to adopt in recent years. Studies have shown that South Korean women spend more money on skincare than dermatologic procedures. A traditional Korean skincare regimen goes something like this: pre-cleanse, cleanse, exfoliate, and then apply the following: toner, essence, ampoule, face mask, eye cream, emulsion and moisturizing cream. But is the expense, time and effort really worth it? Is there any science behind it? What many K-beauty devotees don't know is that cosmeceuticals are not required to undergo stringent clinical trial testing, unlike prescription medications, injectables, lasers, and devices. According to Zoe Draelos, MD, Consulting Professor at Duke University, the Korean approach to skincare has some validity because, \"instead of using a strong surfactant, oil-based products help to remove makeup, while water soluble products help to eliminate any remaining makeup,\" she says. \"The essence contains a humectant, which rehydrates the skin as so much sebum has been removed from the cleansing steps. A separate moisturizer is needed for the eyes because it is a dryer area, these products are usually more occlusive for more moisturization.\" While the jury is still out on 10-step skincare, one thing is certain: An arduous process does not guarantee flawless. Clear skin is often genetic (and not all Asians have flawless skin). However, heightened skin-awareness can improve bad habits such as sleeping in makeup, or skipping daily sunscreen. Cleansing and moisturizing is essential, but if you don't use the treatments designed specifically to target your skin ailment, the likelihood of improvement with a skincare line is nil.  This is a skin care regimen to maintain your skin, not to treat chronic skin conditions. Consult with your dermatologist before incorporating such a regimen into your daily skincare routine. 13 Best Japanese Skin Care Products to Shop Amazon Is Having a Major Beauty Sale Right Now Why Matrix Could Be the Next Best Skin Treatment Claudia Sulewski Launches CYKLAR First Class Beauty 2023 The 14 Best Expert-Approved Setting Sprays Austin Butler Doesn’t Think He’s a Beauty Icon Jelly Nails Are Back and Better Than Ever The Best Spring 2024 Beauty Trends to Try Now Add These K-Beauty Prime Day Deals to Your Cart The 20 Best Pore Minimizers for Baby-Smooth Skin Laneige’s Lip Sleeping Mask is on Sale Again A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2015-09-13T14:00:00Z",
    "url": "https://www.elle.com/beauty/makeup-skin-care/news/a30379/korean-dermatologist-on-beauty/"
}