{
    "title": "The Sheet-Mask Scandal: Here's Exactly What You Need to Know | Allure",
    "text": "By A. Khan Seems like everyone we know is basically living for facial sheet masks. On Insta, Snapchat, and even on planes, it seems like we can't escape the sheet-mask craze that's swept the skin-care world. Maybe you're even using one right now, because, you know, it's Labor Day Weekend? Well buckle up because there's a sheet-mask scandal that's rocking the K-beauty world and has us questioning our #FacemaskMonday go-tos. With single-serving packages, we assume that sheet masks are extra clean, no germs in sight—right? Not quite. Our friends at Racked did some digging into just how clean these masks are. And you really won’t like what they found. For example, it was discovered that the masks weren’t folded by machines, but by human hands using the same piece of cardboard to manually fold each mask over and over again. What's more, “Racked found in a review of Korean press and social media coverage that several brands have been identified as using at-home labor for folding and stuffing sheet masks into their envelopes,” the story reads. At-home labor for skin care? Not. Cool. __Here's what happens when a few friends tried the carbonated bubble mask: __ This at-home labor—without a license—is illegal in Korea, however, because the industry isn't tightly regulated by the KFDA, it happens more commonly than you'd expect it to. (Could you fold a sheet mask without contamination in your home?) If all this wasn’t enough to turn you off to using masks, maybe this photo of an actual factory will. A Korean blogger posted images of unsanitary conditions several years ago. Peep the photos Racked ran of masks with what looks like random hair on them (we can't be sure.) Either way—gross. If you just can’t give up your masks, do some research before you put one on. Ask questions: Is the brand using entirely automated facilities? Is there any bit of at-home labor? If the purpose of these is to soak in whatever’s on the mask, you’d better make sure you know exactly what that is. So go wash your face and maybe skip the sheet mask this weekend if you haven't done your research. We'll be sure to update this post if we learn more about the sheet-mask scandal Watch the video below to learn exactly what causes wrinkles and how you can get rid of them: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Sarah Hoffmann By Sarah Han By Kara Nesvig By Sarah Han More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2016-09-02T17:53:10.279Z",
    "url": "https://www.allure.com/story/sheet-mask-scandal-k-beauty"
}