{
    "title": "The Next Big K-Beauty Trend? Doing Less  | Vogue",
    "text": "To revisit this article, select My Account, then View saved stories To revisit this article, visit My Profile, then View saved stories To revisit this article, select My Account, then View saved stories By Audrey Noble Beauty lovers know Korean beauty for its innovative products and routines to get the healthiest and brightest skin. While it has become synonymous with the admittedly intimidating 10-step skincare routine, the latest K-beauty trend is now turning our attention to a more minimal practice that might better suit busier lifestyles: Say hello to skip-care. “People lead really busy lives and skincare technology is constantly evolving,” says Peach & Lily founder Alicia Yoon. “K-beauty in particular is always looking for the newest innovations—part of that is efficiency.” Skip-care is a consolidated skincare routine that consists of multi-tasking products; a reaction to the idea of an overly complicated multi-step routine. “There's a lot of general misconceptions that a 10 to 15-step routine is a must in Korean beauty rituals,” says co-founder and co-CEO of Glow Recipe Christine Chang. “Instead of counting the number of steps, the true approach to skincare is more about being receptive to your skin’s condition and customizing your routine according to how your skin feels that day, which is very much in line with the philosophy behind skip-care.” Chang’s business partner, co-founder and co-CEO of Glow Recipe Sarah Lee, agrees. “[It’s] all about focusing on what your skin truly needs and getting rid of any excess,” says Lee. “It’s not about sacrificing good ingredients or necessary steps. Instead, maximize the products and application methods you use in your routine to get amazing results.” Lee says to look for “hybrid products” that can cut out the number of steps in a routine without sacrificing efficacy. For a cleanser, she suggests looking for a product with soothing and hydrating ingredients. Instead of cluttering your routine with tons of toners and serums, she says to find one nourishing toner that you can layer multiple times with ease. For the last step, she picks a sleeping mask that works overnight so you wake up with brighter and healthier skin. This doesn’t mean that the 10-step skincare routine is now extinct. All three women agree that both routines will still give you desired skin results—it’s all about what works for your skin and lifestyle. “It's all about personalization,” says Yoon. “We see longer routines remain popular as people see great results by hand-selecting products that work well together for their comprehensive skin needs.” But for those who choose to pare down their routine, skip-care has the added benefit of making beauty more sustainable, simply by reducing the number of packages required. Curious about simplifying your daily beauty? Below, a few multi-tasking products that make productive additions to a skip-care routine. All products featured on Vogue are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.  Peach & Lily \"They're super soft pads we soaked in this beautiful formula of plant-based, antioxidant-rich ingredients, and they're a toner-serum-and-moisturizer-in-one,\" says Yoon. \"They're so intensely hydrating, too—we tested in so many different environments, including the desert, and we saw how skin stayed hydrated and nourished, just by swiping one of these pads all over skin. They're the ultimate product to include in a skip-care routine.\"  Peach & Lily \"This decadent oil-and-serum-and-ampoule-in-one deeply moisturizes while helping reverse visible signs of aging,\" says Yoon.  Peach & Lily \"This is a lightweight serum-and-moisturizer-in-one that's particularly great for acne-prone or combination skin,\" says Yoon.  Amazon Made with green coffee bean oil and antioxidants like vitamin E, this nourishing face oil doubles as a firming serum and moisturizer as it infuses the skin with hydration and helps promote the skin's collagen production. By Hannah Jackson By Hannah Jackson By Alexis Bennett Parker  Ulta This multitasking rose water combines a toner and essence into one and tones, soothes, and hydrates skin for a soft and radiant complexion.  Acaderma Those looking to prevent further skin damage should turn to this serum. Powered by a cocktail of antioxidants, it protects skin from free radicals while also improving skin's texture and brightness.  Sephora \"I use a sleeping mask which does all the hard work overnight so I can wake up to brighter and healthier skin,\" says Lee. \"When my skin is irritated and sensitive, feeling dry and stressed out, and craving a bit more firmness, I would apply a generous layer of this.\"  Dermstore \"For make up remover, this cleanse leaves skin soft rather than tight like other cleansers,\" says dermatologist Annie Chiu, MD. \"This reduces the need for a double cleanse.\" By Kiana Murden By Kiana Murden By Violeta Valdés By Lauren Valenti By Ana Morales By Kiana Murden More from Vogue See More Stories © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices CN Fashion & Beauty ",
    "datetime": "2019-08-30T19:01:52.149Z",
    "url": "https://www.vogue.com/slideshow/korean-skip-care-skincare-trend"
}