{
    "title": "The 5 Fenty Makeup Products to Buy From Rihanna’s Debut Beauty Line | Vogue",
    "text": "To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. By Lauren Valenti At long last, Fenty Beauty is here—and as usual, Rihanna did not disappoint. Nearly two years in the making, the singer’s makeup range serves multiple roles, reimagining the basics every woman needs, such as blotting papers (yes, RiRi does, in fact, sweat) or foundation that makes “skin look like skin,” while serving up off-kilter offerings for those who want to go rogue in bad gal fashion. Would you expect anything less from a woman who wears a classic black smoky eye and shocking purple lipstick with the same aplomb? But to beauty’s resident rule breaker, inclusivity is just as important as innovation. In Rihanna’s case, that meant ardently fine-tuning formulas that work for all women, particularly with her long-wearing, shine-proof foundation, which comes in 40 different shades. “I don’t want women to [say], ‘That’s cute, but it only looks good on her,’ ” says the star, who paired a canary ball skirt ensemble with an iridescent, gold-draped gaze, courtesy of her Match Stix Shimmer Stick in “Blonde” and Killawatt Freestyle Highlighter in “Trophy Wife,” for the brand’s global launch party in Brooklyn. “I wanted things I love that girls of all skin tones could [also] fall in love with.” Her emphasis on diversity is also punctuated by her newly released campaign video, which features models of various ethnicities, including It girls Duckie Thot, Paloma Elsesser, Halima Aden, and Slick Woods. And rest assured, there’s plenty more on the way. “There are endless possibilities,” she says. “You’re just going to have to wait and see.” Ahead of the collection’s global release on the Fenty website at midnight PST, here are the standouts every Fenty girl needs in her arsenal. *Pro Filt’r Soft Matte Foundation Longwear Foundation, $34*\n“It has just the right amount of moisture and dries down to this soft matte that doesn’t require a lot of powder,” explained Rihanna of the featherweight formula, with its cutting-edge climate-adaptive technology. *Invisimatte Blotting Paper, $16*\nArriving in a lipstick-shaped compact with a hidden mirror for touch-ups, these fine blotting papers ensure skin that’s photo-ready anywhere, anytime. By Hannah Jackson By Hannah Jackson By Alexis Bennett Parker *Match Stix Shimmer Skinstick, $25*\nMultitasking shimmer sticks come in a variety of vivid shades, like ultraviolet and tangerine, and can be layered on to take highlights to the next level, or used as a creamy blush. *Gloss Bomb Universal Lip Luminizer, $18*\nMeet the rosy nude lip color of your future, crafted to be universally flattering on every skin tone and customized with a lingering faint peach scent. “It gives you a bit of shimmer, but it doesn’t look like you’re doing the upmost,” she explained with a laugh. By Hannah Jackson By Hannah Jackson By Alexis Bennett Parker *Portable Highlighter Brush 140, $24*\nA beauty nomad’s best friend, this portable retractable highlighter brush is made for strobing on the go, thanks to its deftly angled brush. By signing up you agree to our User Agreement and Privacy Policy & Cookie Statement. By Lauren Valenti By Hannah Jackson By Alex Kessler By Fiorella Valdesolo By Alexis Bennett Parker By Hannah Jackson More from Vogue See More Stories © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices CN Fashion & Beauty ",
    "datetime": "2017-09-07T23:30:00.000Z",
    "url": "https://www.vogue.com/article/rihanna-fenty-makeup-beauty-foundation-highlighter-blotting-papers-lip-gloss"
}