{
    "title": "The backlash has begun: Could ‘Escape the Corset’ spell the end of the K-beauty boom? - Global Cosmetics News",
    "text": "TRENDING: Posted by Blogger | Mar 1, 2019 | Opinion | Sephora is said to be opening its first store in South Korea in the second half of the year after studying the market for nigh on six years. But could it be poised to open in the midst of an identity crisis for K-beauty? Because after taking their complex beauty routines and hero products global, it looks like Korean women may be rebelling against the beauty standards that propelled them to fame. Indeed, a new movement, dubbed Escape the Corset, has swept across the nation since its inception last year, encouraging women to down their brushes and creams for the first Sunday of every month and go au naturel. The battle cry has been taken up by prominent YouTubers such as Shim Jung-hyun, who boasts nearly half a million subscribers, Cha Ji-won and Lima Bae, whose reverse ‘before and after’-style video has racked up some seven million views. Many more have posted images and videos of them smashing their stash on social media. Some have shorn their hair and one brave anchor has even become the first woman to appear on TV in glasses (yes, that is, apparently, controversial). “I’m no longer happy with making myself up beyond the point of gaining self-satisfaction,” said Shim in a video posted in June, per Korea Expose. “Lately, I’ve considerably reduced the time spent on putting on make-up. And I’m spending that time on myself – even if it’s just 10 minutes – and it’s making me much happier each day.” And although the K-beauty big guns continue to post impressive results – The Guardian reports that the new trend is causing concern among beauty executives who, behind a mask of confidence are busy drafting contingency plans – launching more multifunctional, time-saving products, for example, hiring spokesmodels who don’t conform to the strict beauty ideal and making eyes at the male market. Enter the ‘skip-care’ trend – a pared down routine of hybrid products designed to appeal to the time poor. The government has even stepped in, with the Ministry of Gender Equality and Family publishing guidelines last week designed to tackle ‘lookism’ in the media (although it hasn’t been thanked for it). However, Mintel analyst Hwa Jun Lee, told the Thomson Reuters Foundation that the movement wouldn’t cause any noticeable change in the research organisation’s predictions for market growth – the K-beauty sector is expected to hit a market value of US$11.4 billion at the end of this year. “It [Escape the Corset] is a trend that has not yet reached the mainstream public,” Lee told Reuters. “While still in its nascent stage, it is important for brands to note that the movement has potential to grow further in the future.” So will Sephora’s opening bomb amid a wider zeitgeist of beauty backlash? In short, no. For a start, the rebellion isn’t necessarily against the use of beauty products per se, it’s the expectation; the rigid beauty standard that they are seen to represent. If Sephora is clever, it’s import will be a new relationship between beauty and consumers – self-expression, playfulness and self-acceptance over conformity and duty. Although if Zara’s recent experience is anything to go by, it’s going to have to tread very carefully. South Korean women need to shape their own conversation now more than ever. Share: Rate: LATEST NEWS Unilever settles in trademark dispute ov...   Walgreens to settle Rite Aid suit for US...   L’Occitane Q2 2024: Sales rise 17....   Two Target executives to retire   Gillette signs up for another season as ...   PRESS RELEASE: Society of Cosmetic Chemi...   L’Oreal to dump Decleor in derma shake-u...   Hermes Q3 2023: sales up 16 percent to €...   Amazon to face lawsuit over data trackin...   J-beauty retailer Yoshitsu to open store...  GLOBAL COSMETICS NEWS Contact UsSubscribePrivacy PolicyCookie PolicyTerms & Conditions SOCIAL MEDIA FacebookTwitterInstagramLinkedInSoundCloudRSSYouTube NEWS HomeAll Regions Cosmetics News WirePodcastOpinionFashionProfessional BeautyTravelWellnessTop 100 Brands Copyright © 2023 Global Cosmetics Media Limited ",
    "datetime": "2019-03-01T07:00:29+00:00",
    "url": "https://www.globalcosmeticsnews.com/the-backlash-has-begun-could-escape-the-corset-spell-the-end-of-the-k-beauty-boom/"
}