{
    "title": "\n\tThe origins of Mrs. Chennai - The Hindu\n",
    "text": "To enjoy additional benefits CONNECT WITH US October 18, 2014 08:27 pm | Updated May 23, 2016 07:34 pm IST - CHENNAI COMMents SHARE READ LATER From being a neighbourhood event in Ashok Nagar, the show has went on to become pan-Chennai. Every December, a few married women showcase to the world their charisma and talent. Out of them, three get to climb on to a podium. One of the three is crowned Mrs. Chennai. This pattern has been repeated for the last 15 years. As the event celebrates its 15th year, here is a look at how it graduated from a neighbourhood programme to a pan-Chennai attraction. It all started in 1992 when Poornima Kumar was trying to beat boredom, staying at home. Looking at what her neighbourhood, Ashok Nagar, lacked, she decided to start a summer camp for the children of the area. Then next year, she went a step further and launched a hobby centre, where dance, music, art and craft were taught. She eventually started a fitness centre and a parlour exclusively for the women in the neighbourhood. As a promotional event, she started Mrs. Ashok Nagar in 1995. The beauty pageant was open only to members of the gym and customers of the parlour. After five years of successfully running the show, Poornima decided to go big and in partnership with her friend Latha Krishna started Virgo Event which organises Mrs. Chennai. “Our shows are not about looks and beauty. They are about personality and talent. It is also a platform for these married women to re-discover themselves. In our queens, we look for smartness, fitness and confidence. We don’t have titles such as beautiful hair or skin. External qualities are just minor criteria,” say Poornia and Latha. The event stretches over 45 days and the organisers say there is a huge transformation in this short period. “Participants undergo intense fitness training and grooming sessions. You can hardly recognise them on the day of the finals,” says Poornima. From the portfolios received, 60 are shortlisted for screening. Out of them, 25 are selected for the semi-finals. After completing rounds such as cookery, mobility, talent and designing, 12 go to the finals. “Mrs. Chennai also promotes go-green initiatives. We get our participants and winners to plant trees in schools, college and spread awareness about the environment. Even our crowns are made out of plants just to emphasise the message,” says Latha. As most participants are working, events and rounds are held on weekends. This being a special year, all 15 past queens will walk the ramp at this year’s show and share their experiences with the participants. Entry is open. Women who wish to participate can call Poornima at 99410 18210 and Latha at 98410 83510. COMMents SHARE Chennai\n\n/\n\nChennai Downtown BACK TO TOP Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. ",
    "datetime": "2014-10-18T14:57:25.000Z",
    "url": "https://www.thehindu.com/features/downtown/the-origins-of-mrs-chennai/article6514607.ece"
}