{
    "title": "The ‘Chok-Chok’ K-beauty look",
    "text": "ANNE HATHAWAY swears by South Korean beauty brand AHC’s Eye Cream for Face that has amassed a cult following. Famed fashion blogger Aimee Song most recently became the brand’s ambassador, using the AHC Hyaluronic range and even attempted the K-beauty trend by applying facial toner seven times. South Korean actress Oh Yeon-seo - the embodiment of Korean beauty - too joined the ranks as AHC ambassador. She shared: “People talk about the radiance of Korean beauty as if it’s a mystery. What’s my secret? I use AHC skincare, created and perfected in Korean aesthetic clinics. Now my secret can be your secret.” The brand prides itself in ensuring that hydration is the core benefit in every of its skincare range. In fact, AHC stands for “Aesthetic Hydration Cosmetics”. Here are four AHC skincare products that will set you off on the right path to achieving that dewy, soft and bouncy, fresh as a daisy skin glow (Chok-Chok). After all, it’s very much all about the K-beauty philosophy to perfect the skin first before enhancing it with makeup. 1. Premium Hydra B5  Cleanse, tone and hydrate are undeniably the most basic and important steps in every skin care regime. For a refreshed skin with an effervescent complexion, AHC’s premium Hydra B5 line is optimised for deep moisture care. It combines the replenishing properties of vitamin B5 and moisture-binding hyaluronic acid to form a protective moisture seal in keeping skin hydrated throughout the day and night. Add on the Hydrating & Soothing Ampoule for even more intense hydration to ensure supple and smooth skin. 2. Eye Cream Rumour has it that one AHC Eye Cream for Face is sold every two seconds in South Korea. If there’s one product to get, it’ll definitely be this. Among all skincare products, eye creams have the highest concentration of the most advanced anti-ageing technology, while being gentle enough for the delicate eye area. AHC has formulated the best anti-ageing solution for use on both the face and the eye area to help moisturise, smooth, firm as well as improve skin elasticity. 3. Premium Cellulose Masks  In South Korea, masking every day is common and part of a religious beauty ritual. It’s no wonder why most Koreans have such flawless skin. If you want to glow, you’ve got to hydrate, hydrate and hydrate! Every AHC Mask is supercharged with a full bottle of undiluted ampoule to energise the skin back to its glory. Its blend of moisturising properties and patented protective and soothing agents are infused into the 100% pure cotton sheet, hug the facial contours like a second skin, allowing even and maximum absorption. 4. Sun Sticks  Do you use protection? If you don’t, then you totally should. Any type of sun protection is crucial in preventing the skin from premature ageing and discolouration. AHC Sun Sticks are formulated with over 400 natural ingredients to shield the skin against the sun exposure, harmful UV rays and other radical particles. It not only brightens and moisturises the skin, but also keeps makeup waterproof for 24 hours.  Tel: +603-7784 6688      Fax: +603-7785 2624 / +603-7785 2625 ",
    "datetime": null,
    "url": "https://www.thesundaily.my/style-life/fashion-beauty/the-chok-chok-k-beauty-look-BE1024425"
}