{
    "title": "The Wait is Over…Top K-Beauty Brand, innisfree, Launches at Sephora Canada This Month",
    "text": "Searching for your content... Phone 877-269-7890 from 8 AM - 10 PM ET Contact Cision 877-269-7890\n\nfrom 8 AM - 10 PM ET News provided by 16 Feb, 2021, 08:00 ET Share this article Naturally derived, effective skincare solutions from the pristine Jeju Island TORONTO, Feb. 16, 2021 /CNW/ - The wait is finally over. One of Korea's top beauty brands, innisfree, is launching at Sephora Canada this month making its renowned line of naturally derived products for effective skincare solutions available to all Canadians. Since launching in Canada in 2019, innisfree has opened 4 stores in Toronto. The brand is now set to expand its distribution online through availability on Sephora.ca and the Sephora Canada App starting February 16th. In addition to the online expansion, select items will be available in Sephora stores across Canada in March. Innisfree is bringing 28 of its hero products to Sephora — including five online exclusive items — representing some of the brand's most coveted ingredients from Jeju Island, including: Green Tea, Volcanic Clusters, Orchid, Cherry Blossom, Bija, Ginger Honey and Tangerine. The product assortment offers affordable prices ranging from $13 to $48, keeping with innisfree's longstanding commitment to deliver naturally derived skincare at an affordable price. Since launching in Canada in 2019, innisfree has opened 4 stores in Toronto. The brand is now set to expand its distribution online through availability on Sephora.ca and the Sephora Canada App starting February 16th. In addition to the online expansion, select items will be available in Sephora stores across Canada in March. Innisfree is bringing 28 of its hero products to Sephora — including five online exclusive items — representing some of the brand's most coveted ingredients from Jeju Island, including: Green Tea, Volcanic Clusters, Orchid, Cherry Blossom, Bija, Ginger Honey and Tangerine. The product assortment offers affordable prices ranging from $13 to $48, keeping with innisfree's longstanding commitment to deliver naturally derived skincare at an affordable price. Since 2000, innisfree has established itself as a pioneer in sustainable skincare in Korea, existing at the crossroads of nature and beauty. Its key ingredients, sourced from Korea's pristine volcanic island of Jeju, promotes healthy-looking and radiant skin in perfect harmony with an eco-conscious lifestyle. The brand's bestselling and nourishing Intensive Hydrating Serum with Green Tea Seed will be a particular highlight of the Sephora Canada launch. With 1 sold every 10 seconds globally*, this lightweight Green Tea serum instantly replenishes and moisturizes the skin with 16 different amino acids to promote a soft and glowing complexion. *Based on global unit sales data aggregated from Jan- Nov 2019. \"It's an exciting time for innisfree as we introduce the natural benefits of Jeju Island to Sephora Canada's discerning clientele,\" said Minchul Shin, Brand General Manager. \"Our brand is committed to delivering on the promise of being sustainable while also benefiting the skin. innisfree brings affordability to the forefront with quality ingredients at a reasonable price point, building a bridge between mass and prestige products; we are confident Sephora Canada customers will love and trust our products from the first moment they try them.\" For more information, visit innisfree.com or follow along for updates on @InnisfreeCanada on Instagram. ABOUT INNISFREEinnisfree, a South Korean beauty brand that launched in 2002, now has over 950 stores in Korea and over 1,770 stores across 17 different countries. Dedicated to sharing the benefits of ingredients sourced from Jeju Island, the brand's core focus is on responsibly sourced, naturally-derived ingredients and sustainable practices. The wide range of products for both men and women includes skin care, makeup, hair and body products, fragrances, and beauty tools. About SEPHORA AMERICAS:Since its debut in North America over 20 years ago, SEPHORA has been a leader in prestige omni-retail with the purpose of creating an inviting beauty shopping experience and inspiring fearlessness in our community. With the goal of delivering unbiased shopping support and a personalized experience, SEPHORA invites clients to touch and try 25,000 products from 400 carefully curated brands, enjoy services at the Beauty Studio and engage with expertly trained beauty advisors in more than 490 stores across the Americas. Clients can also experience SEPHORA online and through our mobile app, access the free-to-join Beauty Insider program and digital community, which together enhance the experience of SEPHORA's passionate clients. SEPHORA has been an industry-leading champion of diversity, inclusivity, and empowerment, guided by our longstanding company values. In 2019, SEPHORA announced a new tagline and manifesto, \"We Belong to Something Beautiful,\" to reinforce its dedication to fostering belonging amongst all clients and employees and to publicly strive for a more inclusive vision for retail in the Americas. SEPHORA continues to give back to our communities and advance inclusion in our industry through our SEPHORA Stands social impact programs. For more information, visit: https://www.sephora.ca/about-us and @SEPHORACANADA on social media. SOURCE innisfree Canada For further information: For high-res images or additional information please contact: 1Milk2Sugars Communications - Amanda King, [email protected] and Alexandria Horvat-Becevello, [email protected] ",
    "datetime": null,
    "url": "https://www.newswire.ca/news-releases/the-wait-is-over-top-k-beauty-brand-innisfree-launches-at-sephora-canada-this-month-815727321.html"
}