{
    "title": "The Korean Beauty Brand Paring Things Back with Cactus Oil | AnOther",
    "text": "Who is it? Korean brand Huxley’s less-is-more approach offers an alternative to the upwards of ten-step routines that K-beauty has become known for. Huxley favours timelessness, holistically: its founder Hoon Lee named the brand after Aldous, his favourite writer (“Like Huxley predicted, in the future, there is so much information out there that it’s hard to tell what’s true and what’s false,” Lee told W Magazine) and makes a point of not chasing trends when it comes to developing and releasing products. Huxley’s roster of creams, essences, toners and masks currently numbers at less than 30, a testament to the strength of its collection – as is its popularity, both in- and outside of Korea (where it is apparently a favourite among perfectly complexioned flight attendants). “When it comes to K-Beauty, most people tend to think about an elaborate ten-step skincare routine combined with exotic ingredients – snail mucin, for example – and kitsch packaging,” says Jin Kwon, founder of TONIC15, Huxley’s sole distributor in the UK. “There are more than 20,000 beauty brands currently competing in Korea and multiple beauty stores on every street,” she continues of the “incredibly fast-paced” industry. Where Huxley sets itself apart, then, is through its minimalism of both product (its ingredients and range) and appearance (chic, sparse labelling). Why do I want it? Impressing the Korean beauty consumer – who Kwon describes as “incredibly well educated and savvy when it comes to ingredients and formulations” – is no mean feat in such a saturated industry, but Huxley’s natural, cruelty-free and organic approach has resulted in cult products. The star ingredient? Prickly pear seed oil. The succulent’s essential oil is rich in Vitamin E and fatty acids, but is lighter on the skin than argan or coconut oil. “The Vitamin E in prickly pear seed oil is a super antioxidant that protects and repairs the skin. It also protects against free-radical exposure which damages skin’s collagen and results in dryness, fine lines and wrinkles,” says Kwon. “Linoleic acid, an essential fatty acid in the prickly pear seed oil, has anti-inflammatory, acne-reductive and moisture-retentive properties.” Such properties are exemplified in the brand’s oil and extract set sheet mask, which combines the oils and essences of the plant to create an intensely hydrating, and long-lasting, formula. (The actual mixing of the two is left to the customer: stored in separate halves of a plastic pouch, the oil bursts in to mix with the essence after a series of folds creates pressure and pushes them together.) This cactus oil is at the heart of each of Huxley’s products, and has proven key to its popularity (the brand holds exclusive rights to the use of Moroccan prickly pear seed oil in Korea). Simultaneously nourishing and barely there on the skin, the intense moisturisation is just what’s needed as winter sets in. The temptation may be to pile on the products, but – while the formulations are buildable – not much is needed to feel the effects: apply a pea-sized amount of Huxley’s Good Night sleep mask for glowy hydration come morning; a few drops of the uniquely formulated Oil Essence: Essence-Like, Oil-Like adds a weightless layer of moisture underneath a cream. The prickly pear seed oil lends a clean scent to each product too, that falls somewhere between cucumber and grass in its freshness. Where can I get it? Online at TONIC15 and in store at Harvey Nichols. ",
    "datetime": "2018-11-20T12:24:00+00:00",
    "url": "https://www.anothermag.com/fashion-beauty/11327/the-korean-beauty-brand-paring-things-back-with-cactus-oil-k-beauty"
}