{
    "title": "The Year In K-Pop 2013: Sistar19, Cho Yong Pil, Lee Seung Chul Triumph – Billboard",
    "text": "Sistar19's melancholic \"Gone Not Around Any Longer\" held the year's longest run for K-Pop No. 1 - and now it takes its place as the K-Pop Hot 100's top song of 2013. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin Last year, “Gangnam Style” defined K-pop. Not only was the PSY smash the No. 1 song on 2012’s year-end K-Pop Hot 100 chart, but it brought K-pop culture to a global audience. But in 2013, despite PSY’s success, most Korean artists didn’t succumb to copying to hit the top of the charts; opting for alternate routes to land themselves among 2013’s top K-Pop Hot 100 entries. YEAR-END K-POP HOT 100 CHART • Buy a Copy • Subscribe  • Billboard on iPad THE YEAR IN MUSIC 2013: Main Bruno Mars: Artist of the Year YEAR-END 2013 CHARTS:Hot 100 | Billboard 200 | Tours The year kicked off on an innovative note when Girls’ Generation dropped “I Got a Boy” on New Years Day. Jam packed with clunky electro-pop, minimal drum’n’bass and drastic tempo changes, “I Got a Boy” was 2013’s first new No. 1 — ending Lee Seung Gi’s record-breaking, six-week reign. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t12/13/2013 The standard was set high, but acts rose to the chart challenge. While the genre mashing in “I Got a Boy” was smoothed over with peppy, oh-so-catchy hooks, other acts found success going darker: Sistar19’s melancholic “Gone Not Around Any Longer” held the year’s longest run for K-Pop No. 1 with four weeks at the top – and now it takes its place as the K-Pop Hot 100’s top song of 2013. BAE CHI GI and Ailee’s moody collaboration, “Shower of Tears” was a winter smash and has come in at No. 4 on the year-end K-Pop Hot 100 tally. Monster rookie Lee Hi compared herself to a thorny “Rose” on her third chart topper; all of which utilized darker lyricism and chilling arrangements to hook listeners. But that doesn’t mean K-pop didn’t have loads of fun either. Girl groups like 4Minute, f(x) and SISTAR turned up the tempo to snag K-Pop Hot 100 No. 1s during the year. And both 4Minute (“What’s Your Name?”) and SISTAR (“Give It To Me”) have landed on the 2013 year-end K-Pop Hot 100 chart, at No. 6 and No. 8 respectively. THE BEST OF 2013: THE YEAR IN MUSIC MAIN PAGE The K-Pop Hot 100 also saw much-missed veterans return with feel-good tracks: Cho Yong Pil’s “Bounce” now owns No. 2 on the 2013 year-end K-Pop Hot 100. Lee Seung Chul brought bouncy synths for “My Love” and has landed at No. 3 on the 2013 K-Pop list. Despite the colorful variety, the year’s most unexpected success story comes from one who capitalized on PSY’s hitmaking formula: Crayon Pop with their viral hit, “Bar Bar Bar,” which earned the No. 9 slot on the 2013 year-end K-Pop Hot 100. The rookie girl group hadn’t even charted on the K-Pop Hot 100 with prior singles, but “Bar Bar Bar,” with its quirky video, fun dance and catchy hook, sent the track on a slow, six-week rise to the top during the year. While the adorably-quirky “straight-five engine dance” didn’t catch international eyes a la PSY’s horsey dance, it did captivate the K-pop scene to shoot the girls to domestic stardom. Last year, it was easy to pinpoint a track defining the 2012 in K-pop. One can’t do that as easily in 2013. K-pop listeners showed lasting love for soundtrack ballads and uptempo bangers, supporting veterans and newcomers, embracing viral hits and honoring top vocal performances and proving that an artist showing a different side of themselves — whether as a soloist, in a sub-unit or via an innovative collaboration — can lead to big chart success. Daily newsletters straight to your inbox Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2013-12-13T13:00:15+00:00",
    "url": "https://www.billboard.com/pro/the-year-in-k-pop-2013-sistar19-cho-yong-pil-lee-seung-chul-triumph/"
}