{
    "title": "The KKW Beauty & Fragrance Pop-Up Feels Like A Larger-Than-Life, Kim K Beauty Wonderland",
    "text": "Style  Los Angeles, brace yourselves: Kim Kardashian West has officially set up shop at Westfield Century City mall. On Wednesday, June 20, the KKW Beauty and Fragrance Pop-Up opened its doors, welcoming fans from all over to touch, feel, and play with Kardashian West's products in real life for the very first time. From now through July 27, the newly-renovated shopping center will be teeming with contour and concealer fanatics aplenty, waiting for their moment to stock up on never-before-seen goodies and snap photos against the very Instagrammable nude pink walls. The pop-up is small, but sleek and very on brand with all things KKW Beauty and Kanye West. After all, he did play a huge role in helping his wife with the overall vision of the store, like he does with many of her projects, she tells me. \"Anytime I need something visual, I call my husband. He set me up with his tour designers, so we were able to get it all together and he completely influenced it,\" the beauty mogul shares. Kardashian West really just wanted the store to feel like her and her beauty brand. \"I really went for just me, and Kanye really helped me.\" It feels like a museum-meets-amusement park when you walk in — there are giant concealer tubes that greet you when you enter and on the opposite wall, an enormous, spinning version of the real Mario Dedivanovic x KKW eyeshadow palette. This, of course, was all intentional. \"I just wanted everything very larger-than-life and oversized. It’s everything and more. The spinning Mario palette on the wall is so cool and the giant perfume box [next to it] — that’s the big box — if you walk into my body cut-out and go in, [you'll find] the perfume.\" Surprisingly, the pop-up was sort of an overnight production. According to Kardashian West, it was less than a month in the making. \"We thought of it three weeks ago, maybe a month ago, and got it all done.\" Between the 'grammable walls are all of the products, neatly organized in a row and displayed in clear, lucite boxes. Behind them is perhaps the most crucial part of the pop-up — a massive mirror so you can see how all of the KKW Beauty products look when you try them on. There will also be a bunch of fun, exclusive events happening at the pop-up. On June 21, the store will celebrate National Selfie Day and the one-year anniversary of KKW Beauty. On June 30, there will be a private opening celebration hosted by Kardashian West and Dedivanovic with 50 winners. And on July 14, there will be a new Kimoji Fragrance launch. According to the beauty entrepreneur, these scents are going to be her \"fun mood\" fragrances. \"They’re so fun — it’s like my fun mood. It’s like a peach with the drippy cream on it and a cherry and a bottle that says 'vibes.' So that’ll be really fun,\" she shares with me. Kardashian West is super excited to have the chance to share her fragrances with her fans in real life. \"It's really exciting because it’s usually e-commerce and you have to really educate the consumer on what it smells like, so to have it here in store where people can just smell it [is great].\" If you're hoping Kim will take the KKW Beauty and Fragrance pop-up on the road to a mall near you, you are going to have to be patient. \"We’re going to see how it goes. I’m just so excited to see how the response will be [for this]. I don’t have a roll-out plan just yet.\" But if this pop-up is any indication, anything can happen — and in a matter of days, no less. Keep those fingers crossed, KKW Beauty fans! Choose an edition: ",
    "datetime": null,
    "url": "https://www.bustle.com/p/the-kkw-beauty-fragrance-pop-up-feels-like-a-larger-than-life-kim-k-beauty-wonderland-9515811"
}