{
    "title": "The Way South Korean Women Amp Up Their Skin Care (and Now You Can, Too) | Allure",
    "text": "By Elizabeth Siegel Lazy people, meet sleep masks. Sleep masks, lazy people. I just know you'll have a lot in common. Because sleep masks are exactly what they sound like. Slap one on before bed, and instead of rinsing it off like a normal mask, go to sleep. (And no, they're not messy, so you won't have to do even more laundry.) \"Sleep masks are already hugely popular in South Korea, where women layer them over serums and creams before going to bed,\" says Charlotte Cho, a cofounder of Soko Glam, a website that specializes in Korean skin care. Doris Day, a dermatologist in New York City, says, \"Their purpose is to create a permeable seal on top of your skin that makes anything underneath it penetrate better.\" It's kind of the same principle as putting on a heavy night cream over a serum, but the beauty of sleep masks is that they're lighter and tackier, so they stick to your skin instead of gunking up your hair or your pillowcase. A few of our skin-firming and -softening favorites: Garnier Ultra-Lift Miracle Sleeping Cream,Tata Harper Moisturizing Mask (an all-natural mask with rose oil and avocado proteins), and Fresh Black Tea Firming Overnight Mask. Like Allure on Facebook and get more beauty news and daily tips in your feed. #iframe://www.facebook.com/plugins/like.php?href=https%3A%2F%2Fwww.facebook.com%2Fallure&width&layout=standard&action=like&show_faces=true&share=false&height=80||| By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Devon Abelman By Dianna Mazzone By Nicola Dall'Asen By Kara McGrath More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2015-01-22T10:00:00.000Z",
    "url": "https://www.allure.com/story/skincare-sleep-masks"
}