{
    "title": "The Newest Korean Beauty Craze Is Egg White Skincare | Vogue",
    "text": "To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. By Amber Kallor The latest skincare craze coming out of Korea is already an established beauty (and diet) staple on American soil. The incredible, edible egg—long cited as a natural source of protein (including skin-tightening albumin) and collagen—is staging an impressive topical comeback in Asia via high-tech formulas with airy, meringuelike textures that promise to eliminate blackheads, smooth fine lines, and brighten dull complexions—no shell cracking necessary. “Korean beauty brands are constantly innovating or bringing back trends in an upgraded way to delight consumers and stay competitive,” explains Peach & Lily founder Alicia Yoon, who says she started seeing egg whites emerge as a “hero ingredient” on the Eastern beauty scene about five years ago. The latest batch of eye-catching and effective beauty imports offers all the benefits found inside the egg’s fragile exterior, minus the mess and risk of salmonella that the food is associated with. “Egg whites contain collagen and a good bit of protein, which can enhance skin tone and vibrancy,” says Connecticut-based dermatologist Mona Gohara. Infused into everything from creams to serums to sheet masks, the ingredient is perhaps most popular in the form of face wash: The second half of Soko Glam cofounder Charlotte Cho’s double-cleansing routine consists of Skinfood Egg White Pore Foam, while Yoon says Mizon Egg White Bubble Cleanser has become a best-seller on her site and in her new brick-and-mortar boutique. The addition of egg whites to cleansers helps offset the drying side effects of surfactants and boost the skin’s natural lipids, explains New York City dermatologist Ellen Marmur. Other egg-centric finds to add to your basket: Too Cool for School’s Egg Mousse face mask has already reached cult status in Korea, with its fluffy combo of pore-minimizing egg white and nourishing yolk extracts that leaves skin looking fresh in five minutes. TonyMoly’s egg-shaped blackhead gel—a self-heating balm that uses charcoal powder, sea salt, and eggshell powder as a magnet for dirt and oil—spotlights the ingredient’s purifying powers. However, Korea isn’t the first country to harness the ingredient outside of the kitchen. Swedish women have sworn by Lanolin-Ägg-Tväl egg white soap to maintain their clear complexions for generations. And stateside, Perricone MD employs the fine-line–fighting powers of eggshell membrane and retinol in its latest serum. Above, eight products that lend new meaning to the idea of egg on your face. By signing up you agree to our User Agreement and Privacy Policy & Cookie Statement. By Kiana Murden By Kiana Murden By Violeta Valdés By Kiana Murden By Zoe Ruffner By Kiana Murden More from Vogue See More Stories © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices CN Fashion & Beauty ",
    "datetime": "2016-01-15T14:40:39.000Z",
    "url": "https://www.vogue.com/article/egg-white-skincare-new-korean-beauty-craze"
}