{
    "title": "The best and affordable beauty guide this holiday 2022",
    "text": "It’s truly the season of giving, and what better gifts to give this holiday season than products that make you look and feel great. But with so many beauty products launched this 2022, we’ve made it easier for you to pick from our list below—for your besties and even for yourself! Who doesn’t want clear spot-free skin? Ever Bilena Plus 5% Niacinamide + Zinc Refining Serum, P395, promises to deliver smoother skin texture and lighten dark spots. Zinc helps keep sebum production at the bay with its anti-inflammatory properties, lessening acne, too! Let’s face it! Environmental pollutants and skin aggressors will always be there, and we just have to deal with it. Ever Bilena Plus Ceramide Barrier Sealing Cream 30ml, P395, works for our tropical weather with its lightweight moisturizing cream that’s packed with hyaluronic acid, panthenol, shea butter, and ceramides. All of these help to lock in moisturize, reduce fine lines, soothe redness, soften and repair skin damage, and strengthen the skin’s protective barrier. Have fun coming up with different looks with Spotlight Cosmetics Scene Stealer 8-in-1 Eye Palette, P495. Great for day to night looks, this multi-colored eyeshadow palette has six matte shades with two shimmer shades to make your eyes stand out. This palette can also be used to fill in brows, contour, highlight, and even add color to your cheeks. Best of all, it comes with a mirror for application on-the-go. With parties and reunions left and right, our skin is subject to more layers of long-wearing and transfer-proof makeup products this month. We don’t want to keep retouching, right? But this leaves us with the tiring task of taking them out before we go to bed. Careline Skin Gentle Jelly Cleanser, P285, is a mild cleanser that is up for the challenge of even taking out waterproof makeup products. With aloe vera and centella asiatica extracts, this cleanser leaves your skin moisturized and hydrated–even after cleansing. Looking for a unique lippie shade that will make you the talk of the party? With Careline Magic Serum Stain, P165, no one will have the same lip hue. This lightweight gel formula reacts to your lips’ acidity levels, creating a shade that’s made for you. Vitamin E and other antioxidants keep your puckers healthy, moisturized, and plump. If there’s one product that’s a favorite among beauty enthusiasts for this year, it would be the colored liquid eyeliners. Bring out the fun and creative side in you with Carline Colored Ink Liner, P195. Line your upper and lower lids with fun colors of brown, pink, red, green, yellow, and white. Feeling more confident? Its flexible tip lets you go for geometric shapes on your upper lids, and it’s smudge-free, too! Stand out from the crowd with Careline Graph-Ink Liner, P220. This intense-black hue helps you achieve that bold, sexy, mysterious cat-lined eyes. Long-lasting, transfer and waterproof, you don’t have to worry with retouches. One of the best and tried-and-tested gifts to give is Ever Bilena Lip and Cheek Stain, P200. Seen on Heart Evangelista, Ellen Adarna, Megan Young, anyone will get kilig to own and use something that these well-loved celebrities trust. And why wouldn’t they? It’s quick to dry and delivers natural and rosy cheeks for that dalagang Pilipina look. Applying body lotions in our humid country is not something most of us look forward to, but we all know that it’s a must. Ever Organics Soothing Gel 300 ml, P199, comes in gel formula that’s perfect for our tropical weather. Almost weightless post-application sans the stickiness, skin is left refreshed and hydrated all day long. Choose from different variants of Tomato for brightening, Hyaluronic Acid for hydrating, Snail for anti-aging, Cica for skin repair, Jeju Ice for oily skin, and the OG Aloe Vera for all skin types. Everyone has at least one friend who is into K-drama. Let them (or you) live out their K-drama dreams with Ever Organics Serum Sheet Mask, P38, which they can put on while watching their favorite shows. With so many variants to choose from, you can give them one of each without breaking the bank. Another skincare set inspired by K-beauty brands, Hello Glow Blemish Miracle Set, P360, is perfect for those who want to keep a good skincare routine. It comes with four products that work on keeping dryness, redness, and impurities at bay. Chemical exfoliants such as AHA and BHA help to gently exfoliate to clear oily skin from acne and blemishes. Centella asiatica, licorice root extract, chamomile, rosemary leaf and green tea extract add to the efficacy of this skincare set in delivering smoother, clearer, and blemish-free skin. No matter where you are, even if you are indoors, your skin needs sun protection. Hello Glow Ultralight ++ Matte Sunscreen SPF 30, P320, offers more than just sunscreen. This multipurpose product acts as a primer with its matte finish to prep your skin for makeup application, blurring the skin for a flawless finish while strengthening the skin barrier with its three types of ceramides. It also moisturizes while preventing acne and hyperpigmentation from surfacing. All products are available at Shopee, Lazada, Watsons, and SM Beauty Section. ",
    "datetime": null,
    "url": "https://mb.com.ph/2022/12/18/the-best-and-affordable-beauty-guide-this-holiday-2022"
}