{
    "title": "The Best New K-Beauty Products For Every Skin Type",
    "text": "Between snail creams, sheet masks, niacinamide, and other cutting edge ingredients, Korean beauty brands have always been ahead of the curve when it comes to skincare innovation. With a focus on nourishing your way to a luminous “glass” complexions and ultra-hydrated skin, it’s no surprise many brands have developed devoted followings worldwide. Whether you’re shopping online at Soko Glam or at your beloved local K-beauty store, there are always a few exciting new launches to keep your eye on. From award-winning favorites like Then I Met You to newcomers like Schwanen Garten, we’ve rounded up a few of the best new products of 2020 to keep your skin soft and dewy all winter long, whether you’re looking to address dry skin, an oil imbalance, or dullness. Best for Fine Lines: There’s a Peach and Lily’s Glass Refining Serum is often waitlist-only. Grab their newest eye cream—packed with bakuchiol and rosehip seed oil—while you wait for it to come back in stock. This gentle formula helps smooth and brighten the delicate skin around your eyes. Best for Sensitive Skin: The antioxidant cleanser from new K-beauty brand Schwanen Garten has already garnered some buzz on social media, but this gentle, low foaming cleanser is perfect for washing off what little makeup you put on for your daily zoom. Best For Dry Winter Skin: Launched this past spring, this new gel cream from award-winning K-beauty brand Then I Met You contains ceramides and niacinamide to add an extra layer of hydration after your multi-step cleansing, essence, and serum. Best For Very Dry Skin: This new cream locks in moisture by strengthening the skin’s barrier—a must-have for the dry winter days ahead. Best For Dull, Tired Skin: Get glowing skin while you sleep with Sulwhasoo’s overnight mask, which is packed with jujube and pomegranate extracts to build up your skin’s moisture barrier. Best Prep for No-Makeup Makeup: Launched in mid-October, this pink primer from Erborian is suitable for all skin tones and grips makeup with a balm-like texture. Best for Flaky, Dull Skin: For the double cleansing people out there, this new balm from Glow Recipe is full of papaya enzymes to gently resurface skin, plus antioxidant-rich blueberry extract. Best for Anyone Looking to Overhaul Their Full Routine: Soko Glam, and it’s affordable offshoot, Good (Skin) Days, is a great starting point for skincare enthusiasts looking to get into K-beauty. This set has garnered countless accolades for it’s effective but wallet-friendly system. Best for Oily, Sensitive Skin: Botanical-based Femmue just launched a floral toner to soften and reinvigorate skin with 90% Damask Rose Water. ",
    "datetime": null,
    "url": "https://www.wmagazine.com/gallery/best-new-k-beauty-products-every-skin-type"
}