{
    "title": "The latest Korean beauty products to add to your skincare routine",
    "text": "Korean beauty products have saturated our social media feeds and are now cemented in our regimes.  Yet if you thought the trend had peaked with cartoon sheet masks and watery lotions, you'd be mistaken, as a new batch of beauty innovations are destined to command the same attention. \"The focus is shifting from the quirky, fun collections to ground-breaking formulations and smart application,\" says  Emily Saunders, Selfridges beauty buyer. As of next month, the department store is expanding its offering by installing a South Korean Beauty Workshop, which will debut with six new brands and continue to grow over time. \"This will give consumers the chance to explore, experience and embrace the latest K-beauty products and easily integrate them into their daily ritual,\" says Saunders. Alexia Inge, founder of Cult Beauty believes the next phase of the K-beauty trend is down to the speed of product development. \"It's awe-inspiring. They never rest on their laurels even with incredibly successful products, the focus is always on improvement, which make it a skincare addict’s dream,\" she says. So, for those who always want to stay ahead of the curve, here is the latest wave of products to pique your interest... When you think of Korean beauty it's likely that sheet masks spring to mind. Many European brands have replicated the product and while an Oozoo mask might look similar when it's on, it actually offers a completely new approach. The potency issue of sheet masks, whereby the active ingredients could loose their effectiveness, have tarred the trend slightly. Oozoo has avoided this entirely as instead of pre-soaking the mask, the active formula comes in syringe and you infuse the fabric with the active ingredients just before using it. While Oozoo might have been one of the first to come up with this concept, we're betting that by next year plenty of other brands will have joined the bandwagon. Thanks to J.One Jelly Pack, it is now possible to condense your entire morning skincare routine into one product. Part of a line created by Korean actress and beauty muse Ha Ji- Won, the products are designed for fast-paced women who are on a quest to bridge the gap between skincare and make-up. Best described as a treatment primer, it has a  heavy jam-like consistency. Don't be dissuaded, as the key is to pat it onto skin rather than rub. Antioxidants work to address free radical damage and brighten the appearance of skin,  while new Korean technology - fragmented hyaluronic acid - hydrates for a plumper-looking appearance. However it's real star quality is it's cosmetic-enhancing format that grips onto make-up by creating a lock-tight surface across the skin.  Even at 9pm, you'll be sporting the same picture-perfect skin that you walked out the front door with. South Korean women are fastidious about sun care, so when they champion an SPF, its worth taking note. Thank You Farmer Sun Project Shimmer Essence SPF 30 combines the skin-plumping hydration of a moisturiser with the soft-focus effect of a blurring balm and the youth-giving glow of a highlighter. Unlike chemical SPFs that can irritate skin, its harnesses titanium dioxide, to create a physical shield between your skin and the damaging effects of sun and pollutants. It's also a brilliant buy for darker skin tones as  its packed with niacinamide, a skin-brightener that helps to halt hyper-pigmentation. As for the texture, it's chiffon-light so can be worn under or even over foundation. Angry red blemishes can often take a long time to appease, and while it's tempting to squeeze and then cover with concealer, this often aggravates them further. Enter, Corsx Acne Pimple Patch. Its name may scream novelty, but the science behind it is actually pretty impressive. Based on high-tech medical wound care, the breathable hydrocolloid, skin-like bandages conceals the spot to create an effective barrier and prevent further infection.  It's also  infused with active ingredients that swiftly heal, drain and minimise the risk of  discolouration and scarring. Pores have long been the bête noire of beauty, but Skinmiso is set to change all that. The brand's hero products include a serum that acts in the same way as a corset to tighten and shrink, while the Real Clean Peeling Gel gives pores a deep cleanse to prevent further enlargement. CC creams have earned a rapturous applause for breaking the beauty mold. They offer the coverage of concealer with the lightness of tinted mosturiser. It's no surprise that a brand is now marketing a CCC Cream. The third C signifies the addition of skin 'conditioning' agents that shield skin from environmental aggressors and reverse signs of ageing. Cle Cosmetics CCC Cream is available in five shades. Impressively, each shade is packed with adaptable pigments that subtly shift to offer a truly bespoke base, so whether you're Tilda Swinton or Lupita N'yongo this small wardrobe of shades will still camouflage any imperfections. Do you sigh when you catch your shiny complexion in the mirror at 3pm? Then you'll want to add this new-age polish from ORG into your morning routine. It might be unassuming after you've first sprayed it, but you as to start to rub the formula in, the action causes the formula to ‘pill’, gathering all the dead skin, oil and dirt into little balls that drop off into the sink. The process is unbelievably satisfying, but it's the results that will really blow you away. Skin is left totally renewed. It's brighter with a soft uniform surface that is ready for your morning make-up. After one use, you'll find your foundation no longer slides off around oily zones, and dry flecks will no longer show up across your forehead. ",
    "datetime": null,
    "url": "https://www.telegraph.co.uk/beauty/face/latest-korean-beauty-products-add-skincare-routine/"
}