{
    "title": "The Best New K-Beauty Skin-Care Products and Makeup of August 2019 | Allure",
    "text": "By Marci Robin In just a few years, we've gone from having a limited number of Korean beauty brands available in the U.S. to pioneering curators here and getting K-beauty launches at the very same time as South Korea. And as more and more K-beauty products become widely available, it's apparent that there's no single type of K-beauty brand. We're regularly seeing everything, including cute-as-can-be, cartoonishly packaged products, elegantly presented items with incredibly effective ingredients, and of course, sheet masks in every different variety. This month, we're seeing cheekily named new brands, surprisingly bold lip colors, and a mystery product that promises to do almost everything in your skin-care routine. Without further ado, keep scrolling to see the latest and greatest K-beauty products from brands such as Skinfood, Re:P, and more, hitting real and virtual shelves in August. All products featured on Allure are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission. Beigic has already snagged several Editor’s Pick honors from Allure Korea this year, and thanks to the brand finally landing in the U.S., we can all find out why its vegan products, like the Regenerating Oil are, well, generating so much buzz. Our best guess: It’s the combination of green coffee bean, argan, and rosehip oils that quickly absorb to hydrate and brighten skin, giving it that coveted dewy look. $52 (Shop Now) August is an exciting month for new K-beauty masks, thanks largely in part to Peach & Lily. This new Pore Proof Perfecting Clay Mask promises to \"pull even the deepest impurities out of pores and minimize their appearance, doing double-duty to soften and nourish, leaving skin baby-soft and sparkling clean,\" with the help of bentonite and kaolin clay, wild cherry and strawberry extracts, and licorice root extract. The added benefits of anti-inflammatory and antioxidant properties mean calmer, protected skin. $43 (Shop Now) Another Peach & Lily Mask arriving this month is the Overnight Star Sleeping Mask, which takes the notion of night cream to a new level. It helps firm and brighten skin with açai berry and fatty acids, while a blend of jojoba, squalane, and macadamia deeply hydrate skin while controlling sebum. And don't worry — you won't get the pretty blue color all over your pillow. The jelly-balm texture absorbs quite quickly. $43 (Shop Now) If you've used gel-cream moisturizers that get you glowing immediately only to leave you less dewy when its fully absorbed, this moisturizer is your new hero. Part of Innisfree's new Cherry Blossom collection, which also includes an emulsion and a toner, Dewy Glow Jelly Cream gives you a moisturized radiance that's essentially sealed in thanks to a fast-absorbing formula featuring hydration-holding betaine. Skin looks and feels soft, and the glow keeps going. $25 (Shop Now) Bold lipstick may not be the first thing that comes to mind when you think of K-beauty, but Yulip founder Hyesung Won is on a mission to change that — and with the new shades of the brand's lipstick, she'll probably succeed. The three semi-matte colors — Daring Nude, Superstar, and Iconic (above) — join an array of reds and pinks, all of which are formulated without synthetic dyes, sulfates, parabens, or nano ingredients. $26 (Shop Now) The phrase \"I woke up like this\" has gone from a Beyoncé song to a meme to — plot twist — the name of a new K-beauty brand. Calling itself IWLT for short (it's unclear where the U went, but that's OK), the brand produces all of its products in Korea, touting cruelty-free formulas with combinations of natural and synthetic ingredients \"that simply works best when used together based on their bio compatibilities.\" One of those formulas is Protective Base Sun Cream SPF 50, which not only promises to protect skin from UV damage but also minimize pores and keep oiliness under control. $39 (Shop Now) I have no idea what a \"multitem\" is. A portmanteau of \"multi item\"? Perhaps. But even then, it's not entirely clear what Nutrinature Ultra All-In-One Multitem is. What is clear is that it's now available at Ulta with the rest of the Re:p skin-care like, and I want it. It promises to be and do basically everything — \"a toner, essence, and moisturizer in one that softens, brightens, hydrates, and fights wrinkles with the nourishing properties of olive, avocado, and brightening rose hip oil,\" Ulta's product page reads — using naturally-derived ingredients. After cleansing, you could arguably end your skin-care routine with just this, but if you prefer to add on more, Ulta now has Re:p toners, creams, and masks to help you do just that. $34 (Shop Now) Skinfood is known for its edible ingredients, so it's wild to think it only just launch a Royal Honey line considering honey has long been a favorite food and skin treatment for centuries. The star of the new collection is the Royal Honey 100 Hour Moisture Cream, an intensely hydrating cream that relies on royal black honey to deeply yet gently moisturize thirsty, sensitive skin. $21 (Shop Now) By Sarah Han By Chloé Valentine Toscano More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2019-08-01T22:30:38.495Z",
    "url": "https://www.allure.com/gallery/new-k-beauty-products-august-2019-launches"
}