{
    "title": "The Rise of K-Beauty Trademark Filings - Lexology",
    "text": "Review your content's performance and reach. Become your target audience’s go-to resource for today’s hottest topics. Understand your clients’ strategies and the most pressing issues they are facing. Keep a step ahead of your key competitors and benchmark against them. add to folder: Find out more about Lexology or get in touch by visiting our About page. The Korean Intellectual Property Office (KIPO) recently issued a press release discussing the recent substantial increase in trademark filings by Korean cosmetic companies.  In the past five years, the top cosmetic related filers have been LG Household & Heath Care Ltd. and Amorepacific Corporation.  These two companies are also ranked as the top three filers overall within Korea. Trademark applications in Korea for cosmetics have increased about 39.6% from 2014 (15,017 cases) to 2019 (20,956 cases).  The increase in trademark applications for Korean cosmetics seems to reflect the rising global popularity of Korean products in general, including K-Beauty, K-Pop, K-dramas, etc.  Further, large companies such as LG and Amorepacific are not the only companies that are participating in this K-Beauty boom.  KIPO's press release indicates that there also has been an increase in cosmetic-related trademark filings by small to medium sized companies and individuals (7.7% increase from 2015 to 2019), as it has become easier for smaller companies and individual business owners to enter the domestic cosmetic market as a result of easier online distribution, increased availability of OEM/ODM products, and low cost marketing through social media.  add to folder: If you would like to learn how Lexology can drive your content marketing strategy forward, please email [email protected]. © Copyright 2006 - 2023 Law Business Research ",
    "datetime": null,
    "url": "https://www.lexology.com/library/detail.aspx?g=d29b37b7-3a3e-470d-93bf-c8c6b56813fc"
}