{
    "title": "The 12 K-Beauty Trends to Try in 2021, According to the Experts | Vogue",
    "text": "To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. By Tish Weinstock All products featured on Vogue are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission. Snail mucin. Bee venom. Glass skin. These are just some of the beauty trends to emerge from South Korea in the past five years. Whether you’ve dabbled in a bit of donkey milk (good for rejuvenating the skin with protein and fatty acids) or you’ve played it safe with a weekly face mask, K-beauty is everywhere. In fact, Allied Market Research says that by 2026, the K-beauty market will be worth an estimated $21 billion. According to Jenni Middleton, director of beauty at trend forecasting company WGSN, “During the coronavirus pandemic, consumers searched more for K-beauty, looking for innovative products to add to their lockdown beauty regimes.” Like most cultural phenomena, K-beauty is ever-changing—what was big last year may not be as popular this year. As Middleton observes, we’re seeing the traditional 10-step routine give way to a more minimalist approach as conscious consumers react against fast fashion and excessive packaging. Elsewhere, playful gimmicks such as color-changing effects or jellylike substances are being passed over in favor of science-backed formulas. To find out more about the biggest K-beauty trends of 2021, we spoke to some of the industry’s leading skin-care experts. 1. Hanbang ingredients “Hanbang ingredients are traditional herbal ingredients used in Korean medicines and they’ve long been a staple in Korean life. For example, ginseng root, houttuynia cordata, sacred lotus, and rehmannia boast antiaging, anti-inflammation, and regenerative properties.” 2. Acid layering “K-beauty has been incorporating more acid into its products, but with a gentle approach that focuses on striking the balance: Too much can irritate and aggravate your skin, too little will yield no results, so products with an optimal amount is key. Use the right balance of AHAs and BHAs (plant and animal-derived acids) to gently exfoliate dead skin cells and smooth skin texture.” 3. Carrot seed oil “Carrot seed oil is an unsung hero at the moment, although it has been used in K-beauty for more than 10 years. It contains vitamin A and is a great antioxidant. It’s antiaging, antifungal, antibacterial, and anti-inflammatory—so it’s ideal for anyone looking to brighten up their skin.” 4. Gentle retinol “K-beauty’s ‘skin first’ approach will continue through 2021, especially given that self-care and skin care are so important right now. There’s no denying retinol’s powerful antiaging properties, but the K-beauty approach uses a lower percentage, so the skin stays healthier and less irritated. Retinol is highly efficacious without causing unnecessary damage.”  Beauty of Joseon Radiance Cleansing Balm BEAUTY OF JOSEON  Isntree Clear Skin 8% AHA Essence ISNTREE 5. Centella asiatica “[The year] 2021 is less about what’s ‘buzzy’ and more about what’s tried-and-true, with a focus on calming the skin. Centella asiatica [an herb grown in Asia, known for being anti-inflammatory]—or ‘cica’—is huge right now. With everyone dealing with the prolonged stress of the pandemic and dreaded ‘maskne,’ soothing irritated, angry skin seems to be at the forefront of people’s minds. Cica is the ingredient that everyone wants to add to their routine.”  Neogen Dermalogy Real Cica Pad NEOGEN  Laneige Hypoallergenic Cica Sleeping Mask LANEIGE 6. Clean beauty “More brands are developing products free of chemical additives, artificial ingredients, and fragrance. Products will be even more gentle with effective plant-based ingredients, and many brands are becoming vegan as well. Consumers are more aware of what they put on their skin.”  Belif The True Cream Aqua Bomb BELIF  Primera Black Seed Cold-Brew Serum PRIMERA 7. Pre-, pro-, and postbiotics “This year, inner and outer wellness brands and products will gain more popularity. For example, brands that focus on pre-, pro-, and postbiotics; microbiome-friendly skin care; and consumable supplements, which benefit both the skin and the gut. K-beauty will shift more towards a holistic approach, linking skin care and internal health. I take probiotic supplements for my bouts of eczema and I love using K-beauty products with fermented ingredients. I regularly use 107—it uses aged [seven- and 10-year-old] vinegar [that promotes good gut health]. Their vinegar tastes delicious with honey!”  107 Micro Drizzle Hydro Toner 107 BEAUTY  107 Hanega Black 10-Year Vinegar 107 BEAUTY 8. Flexible minimalism “A few years back, we were oversaturated with the ‘10-step Korean skin-care routine.’ The ‘skin-care diet’ [using fewer products and steps] that followed was a pushback against that, but it was too restrictive for those who wanted more results than could be attained with just the basics. Flexible minimalism is a focus on clean and simple product lines, which makes customizing your routine easier. There will also be a push towards pared-back lists of ingredients. Single and minimal ingredients are appealing because of their simplicity and high concentration of the hero component.”  Manyo Factory Pure Cleansing Oil MANYO FACTORY  Etude House Soon Jung PH 5.5 Relief Toner ETUDE HOUSE 9. At-home indulgences “Skin care has a functional element—it has to work and deliver results—but I expect products that provide meditative, soothing, and spa-like moments to take off in a big way. They can transport you mentally and emotionally to another headspace.”  Peach & Lily Matcha Pudding Antioxidant Cream PEACH & LILY  Shangpree S-Energy Repair Eye Cream SHANGPREE 10. Hyphenate and hybrid skin care By Hannah Jackson By Hannah Jackson By Alexis Bennett Parker “We’ve started seeing ‘skipcare’ as a K-beauty trend, where the focus is on a pared-down, simple, and minimalist routine. We will be seeing more efficient and effective multitasking and versatile products—what we like to call ‘hyphenates’ or ‘hybrid’ skin care.” 11. Skin detoxifying and barrier strengthening “The belief that ‘skin is a reflection of your mental state’ comes from Korea, and growing up, my mother emphasized this to me many times. We’ll see more barrier-strengthening ingredients that boost immunity, such as mushrooms, plus detoxifying herbs including mugwort and ginger. Ceramides [which form a protective layer to help prevent moisture loss and visible skin damage] will make a comeback too.” 12. A boost in body care “In Korea, many body-care rituals originate from the bathhouse culture, where milk treatments are slathered on the face and body, and baths are steeped with skin-beneficial ingredients, such as green tea and probiotics. During a difficult year, personal self-care has taken on new importance for many, so we expect to see the definition to include all of the skin, from head to toe.”  Glow Recipe Papaya Sorbet Smoothing Enzyme Cleansing Balm & Makeup Remover GLOW RECIPE  Glow Recipe Plum Plump Hyaluronic Serum GLOW RECIPE By signing up you agree to our User Agreement and Privacy Policy & Cookie Statement. By Kiana Murden By Hannah Coates By Kiana Murden By Kiana Murden By Kiana Murden By Kiana Murden More from Vogue See More Stories © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices CN Fashion & Beauty ",
    "datetime": "2021-01-15T00:42:05.365Z",
    "url": "https://www.vogue.com/article/k-beauty-trends-to-try-in-2021"
}