{
    "title": "The Sheet Mask Sanitation Scandal Rocking the K Beauty World - Racked",
    "text": "This site uses cookies. Select \"Block all non-essential cookies\" to only allow cookies necessary to display content and enable core site features. Select \"Accept all cookies\" to also personalize your experience on the site with ads and partner content tailored to your interests, and to allow us to measure the effectiveness of our service. To learn more, review our Cookie Policy, Privacy Notice and Terms of Use. Filed under: You’ll never guess where your favorite sheet masks might be folded If you use popular Korean sheet masks, there’s a fair chance that the sheet itself was folded by a human, not a machine. Photos and a video show workers folding masks at home on household furniture such as a coffee table with their bare hands. One set of photos from June 8th of this year appears to show a recycled piece of cardboard being used over and over again as a folding guide. Racked is no longer publishing. Thank you to everyone who read our work over the years. The archives will remain available here; for new stories, head over to Vox.com, where our staff is covering consumer culture for The Goods by Vox. You can also see what we’re up to by signing up here. 마스크팩 위생상태에 대해 말이 많았지만 메디힐 너마저 그럴 줄은 몰랐다;; 재활용한 종이 쪼가리로 접는 건 너무하지 않나. 시드물이 마스크팩 설명에 백프로 기계공정 어쩌고 강조했던 이유를 이제야 알겠네... pic.twitter.com/KWNjOhGKTe A post on the popular Asian Beauty subreddit by a new user called dvaonline22, self-identified as a Korean woman living in Seoul, brought the issue to light for English speakers early Saturday morning. With the nation and Korea Food and Drug Administration (KFDA) focused on scores of deaths due to humidifier disinfectant, coverage of sheet mask sanitation issues and labor practices has been limited. dvaonline22 told Racked via online messaging that she has some experience working in the cosmetics industry and hoped that international outcry might persuade Korean companies to change how they fold masks, employ and pay workers, and operate their factories. Racked found in a review of Korean press and social media coverage that several brands have been identified as using at-home labor for folding and stuffing sheet masks into their envelopes. Making cosmetics in a private home without a manufacturing license is illegal in Korea, but because there are so many small cosmetic brands it is fairly common. Moreover, this has been happening for years. In 2008, Big Three Korean broadcasting company MBC ran a story explaining that the era of sewing eyes on dolls at home was over and the new way for housewives to earn extra money was folding sheet masks. The at-home folding process works like this: mask sheets and envelopes are dropped off to mask folders, who often work in teams of two or three. The stacks of masks are folded using a guide, much like the sort used to fold shirts in a retail shop, and inserted into a mask envelope. There the envelopes sit, one side open, until they’re collected and taken to the factory. https://t.co/u0VBbadKyF상위에서 맨손으로...상처난 손으로....위생관념은 찾아볼 수 없는 수준 pic.twitter.com/yDpDk7znQx Once in the factory, Weekly DongA reports that \"M\" facial masks (first letters are used by DongA and other news organizations to avoid liability) made by \"company L\" are sterilized, filled with essence, and subjected to microbial checks. A post on the Pann news forum noted that sterilized masks could still contain debris such as hair. Company L emphasized that mask sheet folding is a \"subsidiary process\" that should have been better managed by subcontractors, not a manufacturing process that takes place in the company’s factory. Nonetheless, company L imported mask folding machines from Japan at the end of April and now their mask-folding production is entirely automated. Racked’s requests for more information from company L were not answered at press time. Far from being a rare practice of low-end companies, brands endorsed by top actors that rank among the bestsellers in Korea and abroad such as Mediheal, SNP, and Forencos have been identified by Korean news outlets as using mask folding labor. An unnamed source told Weekly DongA that the use of manual folders is widespread in the industry, and most of the top 15 bestselling sheet masks are folded by hand. Mediheal (made by L&P Cosmetic) and SNP have not responded to inquiries made by Racked over the weekend by the time this article was published.  Mediheal confirmed while most of their sheet masks are made in automated factories, some of their sub-subcontractors use at-home workers. When contacted for comment, a Forencos representative stated: \"House folding mask issue is not related to our company if you use our product image with the article, we will seriously consider to sue for libel.\" Forencos has stated in the past that they make their product entirely within licensed facilities, and promised to focus on hygiene in the future. When asked if Korean companies are aware of the Asian Beauty subreddit, dvaonline22 wrote, \"If they knew this subreddit, they would already have asked to cut off the links I provided [to Korean posts] by contacting IT companies, which is a common practice in Korea.\" Wikitree reports that Mediheal confirmed while most of their sheet masks are made in automated factories, some of their sub-subcontractors use at-home workers and explained that the use of human labor for mask folding is a necessity due to having over 200 different types of masks, which would make automated folding difficult. SNP also admitted to the practice, telling Sports Kyunghyang that workers and their homes are strictly supervised and checked. Yet even within Korean sheet mask factories, sanitary concerns have been raised in the past. A 2011 post by a Korean blogger who claimed to have worked part-time at a factory making Sulwhasoo masks included photos purportedly showing unsanitary conditions. MBC investigated sheet mask industry in 2014 and discovered, among other things, workers smoking at the manufacturing site. For folding a delivery of 1,200 masks, the pay could be as low as the equivalent of $3.21 total. Compounding the issue is the fact that workers who do \"sideline\" or moonlighting mask folding labor are paid very poorly. Weekly DongA reported that workers are paid 3 South Korean won for folding single sheets, which is equivalent to about ¼ of a US penny. For folding masks with a backing layer workers could earn 4 to 5 won each. Yes! Top News reports rates as high as 5 to 7 South Korean won per folded mask; about half a penny. For folding a delivery of 1,200 masks, the pay could be as low as the equivalent of $3.21 total. At the time Weekly DongA searched popular moonlighting job directories there were several listings for \"mask pack folding moonlighting.\" In the wake of the news coverage in Korea, only one mask folding job — and that for a mask pack folding moonlighting recruiter earning 6,030 South Korean won per hour (approximately $5.37) — remained when Racked searched alba.com, a moonlighting job listing site popular with students, housewives, and workers with full-time jobs looking to earn some extra money. Work listings, before they disappeared, centered in Incheon, near Seoul, a port city of three million people. It’s difficult to gauge the impact of at-home mask folding and factory sanitation standards on the quality of the masks consumers receive. The kbeauty customers Racked talked to reported few instances of finding debris in their masks or adverse skin reactions from masks that they connected to poor sanitation during the manufacturing process. Most felt shocked that there would be any quality control issues since Korean skincare is routinely touted as years ahead of the West — when in fact, the manufacturing process for some brands appears to most resemble the early modern putting-out system. Photo credit: Alana A few cases of debris and off smells in masks have been noted. Kukmin Ilbo reported on one individual in Korea finding an insect in their sheet mask in the wake of the at-home mask folding scandal. The bug incident went viral, leading the manufacturer to issue an apology, and promise to do microbial testing on all sheet masks before shipping. Earlier this year, Alana, a kbeauty fan, posted a photo showing a long, dark hair between her illi sheet mask and the mask’s backing that she discovered upon opening the mask. About one year ago, Marianna was just getting into kbeauty when she asked a private Facebook group if her SNP mask — not yet expired — was supposed to have black spots on it or not. Sheet mask designs have been very popular in the last year, but that particular mask was supposed to be just a white sheet. Snow White and the Asian Pear — who, full disclosure, works on a podcast with the author of this article — reported in April 2015 that her Sooryehan Pomegranate Mask smelled like \"laundry detergent and stale nicotine\" despite the ingredients not accounting for the smoky scent. Photo credit: Marianna The revelations about how some sheet masks are made in Korea have proved deeply unsettling to many fans of kbeauty who are concerned about the issue for both hygienic and ethical reasons. Beauty blogger Vanity Rex wrote in an online message to Racked, \"I'm staring at my stash of sheet masks, including some from Mediheal, trying to figure out what to do with them because I don't want to risk putting something contaminated on my face.\" Concerns about the amount of waste generated by sheet mask packaging and \"inadvertently supporting unfair labor compensation and conditions kills the enjoyment for me.\" The economic impact could reach far beyond the companies named in Korean news reports. Even if reforms are implemented, some kbeauty fans like Vanity Rex are pulling back: \"I'm...going to take a break from buying any more sheet masks for the foreseeable future.\" Editor's note: Here is a running list of companies that have said they only manufacture in approved facilities. ",
    "datetime": "2016-08-29T16:05:24-04:00",
    "url": "https://www.racked.com/2016/8/29/12698288/sheet-mask-sanitation-scandal-k-beauty"
}