{
    "title": "The Korean beauty trend celebs use to get red carpet-ready",
    "text": "Thanks for contacting us. We've received your submission. Now that buzzed-about multistep Korean skin-care regimens have taken hold in the US, it’s time to take our resulting radiant complexions to the next level with the next big trend straight from Seoul: whisper-thin treatment foundation contained in a springy “cushion” sponge compact. Dabbed on with a puff applicator, it delivers a gorgeous glow. “It’s almost like a second skin,” raves Sir John Barnett, celebrity makeup artist for L’Oréal Paris, who’s been patting the brand’s new True Match Lumi Cushion makeup on red-carpet clients like Beyoncé and Karlie Kloss. “I call it an ‘invisible’ finish.” Indeed, it lent a flawless characteristic to Naomi Watts and Jennifer Lopez during awards show season. Think of cushion foundations as portable liquid that combine the ease of a powder compact with the effect of barely-there base. As long as the lid is clamped tight, a foundation-drenched sponge stays wet. They’re pretty ingenious. While there are plenty of new American and French offerings hitting the market, there’s no question where this next-gen foundation type got its start. “Koreans typically aim to achieve a soft, dewy, luminous complexion, and the focus is really on the skin,” says Charlotte Cho, the founder of Soko Glam, a K-beauty e-tailer. “That’s why they created the cushion compact. It’s considered a fusion of skin care and makeup because it doesn’t just cover, it also improves the look, feel and health of the skin with its anti-aging, brightening and moisturizing effects.” Jersey City-based IT Cosmetics got the skin care-meets-makeup memo. Its new CC+ Veil Beauty Fluid Foundation not only boasts sun-safe SPF 50, it’s also laced with a slew of vitamins, peptides and complexion-plumping hyaluronic acid. Portable hydration is the key selling point for Givenchy’s chic Teint Couture Cushion. And MAC Cosmetics’ Matchmaster Shade Intelligence Compact, offered in 12 hues, dispenses product in a microfine layer for a “you, but better” look. The smart-cushion technology has even been used in a complexion product that’s layered beneath foundation. Lancôme’s new Miracle CC Cushion Color Correcting Primers, in pinky peach, purple, yellow and green, are designed to spot-correct, neutralize redness, and boost radiance. K-beauty guru Alicia Yoon handpicks and stocks an array of Korean cushions on her Peach & Lily site, including Hera’s popular UV Mist Cushion. “That’s the one every Korean stewardess I speak to uses,” she notes. “Which says a lot, considering they stay flawless throughout an entire 14-hour flight.” ",
    "datetime": "2016-04-29T12:00:19+00:00",
    "url": "https://nypost.com/2016/04/29/the-korean-beauty-trend-celebs-use-to-get-red-carpet-ready/"
}