{
    "title": "The Story Behind Korea's Hottest Makeup Brand | Allure",
    "text": "By Sophia Panych If you're a Sephora Beauty Insider, a self-proclaimed beauty junkie, or you travel frequently to South Korea, then you're familiar with Chosungah 22. The Korean makeup brand launched Stateside in the fall of 2015 and has already gained a huge fan base among beauty enthusiasts and makeup artists alike. Backstage at New York fashion week, makeup artist Tom Pecheux gushed about the products he recently discovered. \"They look crazy, but they're so good!\" he laughed. And while many of us are familiar with the cutesy packaging, innovative delivery systems, and superb formulas, not many people know the incredibly talented woman behind the brand. Chosungah was the number-one makeup artist in Korea for over 25 years, working on celebrities, models, and VIPs. When she made a rare appearance at an event to introduce the full line in New York City a couple weeks ago, I got the chance to chat with her and hear her story. Why did you decide to start a makeup line?\"I worked as a makeup artist for 26, 27 years, and I worked with celebrities and non-celebrities, you name it. And the thing that everyone had in common was they all wanted to look better, except they didn't know exactly how because there are a lot of products to use and a lot of methods to know. I wanted to turn using makeup into a very fun, easy process—kind of like when you take your kids to Toys R Us and let them loose. You let them figure out what to play with and how to have fun without being told what to do. I wanted to create the same experience for women in terms of makeup.\" In my years as a beauty editor I've learned that makeup can be intimidating to a lot of people. \"I completely agree. It's very easy to get intimidated and then get discouraged. So making the process of putting on makeup easy and fun is why I came up with the line; it's really our philosophy.\" What was the first product you developed?\"The C&T Blend Liquid Foundation, which is all about re-creating that fresh look of someone in their 20s, which is the mantra of K-beauty. Everyone is preoccupied with covering things up, but the most important thing is expressing the true texture of your skin, making sure it looks really nice and moist and hydrated. And in order to achieve all that, we created this two-in-one product that combines a honey essence, which comes out as a gel, and foundation. You mix the two before you apply it so you're providing hydration and cover-up at the same time.\" What's the benefit of mixing them together first, rather than layering them on top of one another? \"Because foundation is still powder-based, so even if you've done your whole morning skin-care ritual, once you put on foundation that powder base takes over, and it dries out your skin. When I was a makeup artist I would mix foundation with a gel-type cream or an oil, and that mixture of foundation and the oil or the cream really lasted the whole day. So I really came up with the product based on my experience.\" By Aliza Kelly By Gabi Thorne By Gabi Thorne Are there any other products you created based on this sort of problem-solution idea?\"I would say most of them were came from tricks I did as a makeup artist. The Brow Maker, for example, has an edge to create sharp lines and a spooley brush to add volume, so that combined a two-step process that requires two different tools into one product.\" Many makeup artists have a favorite part of the face to work on. What was yours? \"Because I worked so much commercially, I always focused on the concept and the entire look. But at the end of the day, whether my client was an ad-industry person, or a model, or a superstar, my main goal was to maintain the quality of the skin's texture—making sure the skin looks good—and that has definitely carried on to my products. Almost all of our products, even if they're color cosmetics, have a moisturizing effect so you're getting skin-care benefits no matter what. I'm 47, and I'm always focusing on hydration. I never, ever let my skin get dry, and that is key.\" By Aliza Kelly By Gabi Thorne By Gabi Thorne Why do you think K-beauty has become so popular around the world? \"I think it's because K-pop has been spreading and been getting a lot of attention, and it's proven to be appealing to a lot of people. There are also a lot of Asians in the West, so there's a lot of traction that starts from there and spreads. K-beauty is huge in China as well, so you have large populations near and outside of Korea that are definitely contributing.\" What are your consumers in Korea asking for right now? \"They haven't said anything specific, but Korean women are very involved in social media, and they are very quick to say what they need and want. They also need new products very, very quickly, so it's critical to be able to come up with those products and get them on the market fast. I think the quick response is definitely the perk of the K-beauty market.\" Check out these amazing Asian beauty products: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Sarah Han By Kara McGrath By Sarah Han More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2016-04-12T16:00:00.000Z",
    "url": "https://www.allure.com/story/chosungah-22-korean-makeup"
}