{
    "title": "The next big thing in Korean beauty: Muscles | The Straits Times",
    "text": "SEOUL (REUTERS) - Looks no longer centre only on the face in beauty-obsessed South Korea, where more women are hitting the gym to improve muscle tone and physical health. As the ideal of beauty evolves in a country that is a trendsetter in cosmetics and the pursuit of plastic surgery, women's fitness has become a growth business, say purveyors of health products, from diet supplements to dumb-bells. \"Women used to starve in order to lose weight. Now they exercise,\" said celebrity trainer Ray Yang, who leads a workout session during the Body Show, a weekly television event targeted at women that is now in its second season. South Korea is a beauty powerhouse, with a US$12-billion (S$17-billion) cosmetics industry and home-grown brands from the likes of Amorepacific Corp and LG Household & Healthcare riding a wave, or \"hallyu\", of cultural exports, from television dramas to pop music. In July, Olive Young, a health and beauty chain owned by CJ O Shopping, began selling health products targeted at women, including dumb-bells and a mini gym ball. Lotte Shopping's rival chain LOHB's said annual sales of items such as gym balls, jump ropes and dumb-bells were up 9 per cent this year by Oct 15. As in other Asian countries, the popular depiction of Korean women has tended towards the slim, fair-skinned and demure, reinforcing gender stereotypes in a male-dominated society. Until recently, physical fitness was not much of a priority for Korean women, despite an emphasis on appearance that has fuelled a US$5-billion plastic surgery industry, which accounts for a quarter of the global market. Thinness was so prized that young women often steered clear of sports such as hiking and cycling, for fear they would leave them with thicker legs. \"Women used to think muscles would have side effects, or negative effects, on their body type and looks,\" said Kim Min-jeong, a professor of global sports science at Hankuk University of Foreign Studies. The desire for a more robust physique comes as female workforce participation reached a record high this year, while Koreans of both sexes are delaying marriage and childbirth. Many fitness conscious Korean women are adopting as role models well-toned celebrities, from domestic K-pop girl group Sistar's Hyorin, to global figures such as US first lady Michelle Obama and Kate Middleton, the Duchess of Cambridge. \"The strength, the outer beauty of muscles, the positive attitudes and energetic images of these women become the motivation,\" said Kim. \"Women now have higher social status and bigger roles in society.\" The number of fitness centres registered in South Korea has increased steadily, growing more than 5 percent last year to stand at 7,363 outlets, government data show. At one exercise centre in Seoul recently, 29-year-old You Ri-seul followed the same routine as the men, from barbell drills to a rowing-machine session and dead lifts. \"Female celebrities with healthy images became popular in the mass media in recent years, so I think a more healthy-looking body is ultimately becoming the wannabe model,\"she said. Join ST's Telegram channel and get the latest breaking news delivered to you. Read 3 articles and stand to win rewards Spin the wheel now MCI (P) 066/10/2023. Published by SPH Media Limited, Co. Regn. No. 202120748H. Copyright © 2023 SPH Media Limited. All rights reserved. ",
    "datetime": "2015-10-24T11:16:29+08:00",
    "url": "https://www.straitstimes.com/asia/east-asia/the-next-big-thing-in-korean-beauty-muscles"
}