{
    "title": "The Best Korean Beauty Serum Is the Whal Myung Skin Elixir | The Strategist",
    "text": "Every product is independently selected by (obsessive) editors. Things you buy through our links may earn us a commission. As a person with perennially dry skin, central-heating season is one of my personal nightmares. There is no tiny humidifier or French face mist in the world that can actually prevent my skin from looking flushed after a few hours with the heat cranking. That was until I chanced upon this small skin miracle while stalking the Nordstrom Korean-beauty section, a K-beauty elixir that’s gotten me more compliments from friends and colleagues on my luminous skin than anything I’ve ever used, though somehow no one has heard of it before. And perhaps for good reason: Whal Myung calls itself a Korean royal secret. Dong Wha, the oldest pharmacy in Korea, crafted the original 11-herb formula “Whal Myung Su” in 1897 for the royal family as an herbal medicine ingested to stave off indigestion. (The name “Whal Myung Su” literally means “lifesaving water.”) For the product’s 120th anniversary this year, Dong Wha released the skin elixir as a topical treatment with five of the original Whal Myung Su herb extracts, plus shea butter and natural oils — including beauty favorites argan and squalane. Conventional wisdom tells you that all-in-one products don’t work, but this hybrid product — a serum, toner, and oil — keeps my skin feeling refreshed and supple without looking like I just slathered my face in canola oil. Here’s how I use it: After swabbing my face with micellar water in the morning, I shake up the bottle to make sure the oils don’t separate, pour a dime-size amount into my palm, and massage it onto my face and neck. (The bottle comes with a spray nozzle that mists a light, but not overpowering, dusting on your skin, but I ditch the nozzle completely.) I’ll finish with a light layer of moisturizer on top, but some days, I’ll even skip moisturizer to look as radiant as a Glossier model. A little goes a long way — I’ve gone through one bottle after using it on and off for a few months. The results speak for themselves. Co-workers will comment and question me. Friends want to know what I’m doing. While at a party recently, I was crammed onto a couch with two pals when one of them studied me at close range and commented, “Your skin looks really glowy today.” The other agreed and immediately asked me what I was using. After being complimented and asked, I’ve also spilled the secret to my roommate and a beauty editor friend. Now, you know, too. By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us. The Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best women’s jeans, rolling luggage, pillows for side sleepers, ultra-flattering pants, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change. Every editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission. Every product is independently selected by (obsessive) editors. Things you buy through our links may earn us a commission. ",
    "datetime": "2017-11-28T15:59:58.686-05:00",
    "url": "https://nymag.com/strategist/article/best-korean-beauty-serum-whal-myung-skin-elixir.html"
}