{
    "title": "The 5 Biggest K-Beauty Trends of 2022 | Allure",
    "text": "By Elizabeth Siegel Once upon a time, Allure ran advice columns by our favorite beauty pros. In celebration of our 30th anniversary, we're bringing back the tradition — but this time the expert is: us (we've learned a lot over the years). Send your burning (or itching, or otherwise inflamed) questions to beautyexpert@allure.com, and we might answer them in an upcoming story. I was debating whether to get a lob and a Netflix account when Dr. Jart+ Water Fuse BB Beauty Balm SPF 25 came to the U.S. from Korea, around 2011. It was a breakthrough moment — the stuff in that aqua tube gave me dewy cheeks with zero sunspots — and it was happening in front of millions of mirrors that year. I am old enough to remember how BB creams jump-started the K-beauty phenomenon that has shaped the last decade of beauty, which means I am also old enough to be highly invested in what comes next from the world's skin-care epicenter. Pronounced hahn-bahng — but you will know that very well, very soon — these are traditional Korean medicinal ingredients, like lotus and ginseng. \"You are seeing hanbang translate into a lot of Korean products,\" says Charlotte Cho, founder of Then I Met You and cofounder of K-beauty retailer Soko Glam, who notes that some brands are basing their entire ethos on this category. Acwell, for example, uses traditional herbs and licorice extract. \"Hanbang materials usually have great antioxidant and anti-inflammatory effects,\" says cosmetic chemist Ginger King, who likes lotus root for brightening and ginseng for boosting microcirculation. What's the next snail mucin, that gloopy (and hydrating) secretion we've seen in so many Korean sheet masks and serums? Well, snail mucin. But minus the snail part. \"The younger generation of Koreans cares more about animals and, as a result, vegan skin care is top of mind,\" says Cho. (Snails aren't killed for their mucin: Usually, they crawl over mesh, their mucin is collected, and then sterilized.) \"You're going to see brands rolling out 'phytomucin,' a vegan alternative, in the next year.\" It can be made from wild yam, okra, or seaweed. Says King, \"seaweed and okra have similar moisturizing and firming benefits as snail secretions, and wild yams may have antioxidant and moisturizing benefits.\" As waterless formulas — which could help lower the beauty industry's environmental footprint — gain popularity, \"freeze-dry technology will continue to blossom,\" says King. One technique that has not yet come to the U.S. but is popular in Korea is to \"steam an ingredient nine times and use ultrasonic technology to extract the essence with the most potency,\" says King, who is hoping to use the technology later this year. One constant in Korean culture is masking — sheet masks, yes, but also the surgical variety. \"Ten years ago, I'd see people wearing masks [in Seoul] as a courtesy to not spread their cold,\" says Cho. Recently, antibacterial mists for decontaminating masks between uses have hit the market in Korea, but proceed with caution when you inevitably see them here. \"I am in favor of anything to help prevent maskne, but skin bacteria are only one component,\" says Jill Weinstein, MD, clinical instructor of dermatology at Northwestern University's Feinberg School of Medicine in Chicago. \"Other factors include occlusion and friction from a mask, even heat and humidity under a mask. Plus, spraying a liquid onto paper masks may compromise their integrity.\" As more Koreans use gadgets like LED masks as part of a daily routine, Cho has one last prediction: \"Your next big Korean skin-care trend may not be in the form of an essence, mist, or serum. It is going to come from a top electronics company, such as Samsung or LG.\" This story originally appeared in the April 2022 issue of Allure. Learn how to subscribe here. More K-beauty: Now, watch Barbie Ferreira's drugstore hack for perfect brows: You can follow Allure on Instagram and Twitter, or subscribe to our newsletter to stay up to date on all things beauty. By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Nicola Dall'Asen By Sarah Han By Devon Abelman More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2022-03-27T16:00:00.000Z",
    "url": "https://www.allure.com/story/korean-beauty-skin-care-trends-2022"
}