{
    "title": "The Best New Korean Beauty and Makeup Trends - Coveteur: Inside Closets, Fashion, Beauty, Health, and Travel",
    "text": "1. Just-Cried EyeshadowSee on Instagram\n        I am a huge proponent of the red eyeshadow look, so I was pleased to find that Korean woman feel the same. They tend to use a brighter, more matte shade, because it mimics the look of having cried, and they believe that makes them more attractive to men—seriously! If a woman is upset, a man will want to protect them, which is why K-pop stars love a red eye look. Whether or not you agree, you can’t deny that this shadow looks fabulous on just about everyone.2. Teardrop GlitterSee on Instagram\n        Koh told us that most Korean women enjoy a subtle splash of glitter, almost like a teardrop level of shine, again, as if you had been crying. Is she wearing glitter, or is she not? You’d have to get close to her to tell. She prefers a fine line of sparkle under the eyes, or in the corner to catch the light, making it super wearable, even for daytime.3. Puppy-Eye EyelinerSee on Instagram\n        I’ve never had a makeup artist reference a cartoon before for a beauty look, but that’s exactly what Koh did when she described the hot new eyeliner trend. Instead of flicking the tail of your liner up in the usual cat-eye style, Korean women are following the natural downward slant of the eye to achieve “puppy eyes.” Or, if you’ve seen the movie Puss in Boots, think of the scene when his eyes grow big and sorrowful—that’s the look you’re going for here.4. Straight EyebrowsSee on Instagram\n        Everywhere I looked in Seoul, women were sporting medium-thick brows, but instead of the clearly defined arch and overdrawn style made popular by the Kardashians, the Korean brow is as straight as possible. Koh told us that it makes you look younger, since babies don’t have any sort of arch to their brows. Cushion compacts for brows are popular, as well as liquid formulas, because Korean women want to mimic the look of real hair and avoid making them appear too thick or fake. They even have a term for the Instagram brow trend—seaweed brows!5. Fruit Juice MakeupSee on Instagram\n        This style of makeup is especially popular for K-pop artists or anyone wanting to look like their music idols. Koh explained that to achieve fruit juice makeup, you should use a lot of color on the cheeks so that they appear like ripe fruit ready to burst. And instead of applying in the popular “C” shape—meaning from the apples up towards the temples—blush is swept over the top of the cheekbone to the ends of the brows, no further. This shape is thought to be more youthful, like a flush you’d get if you had just finished singing for an hour onstage. My favorite part of this trend is that many Korean women apply blush to the top of their ears—again, to appear flushed and youthful.6. Gradation LipsSee on Instagram\n        Every beauty editor I traveled with wanted to know how to achieve the infamous Korean blurred lip, where the center of the lips is more pigmented, with the color softly fading towards the edges. Koh corrected us, explaining that Korean women actually call this a gradation lip, and again, it’s inspired by babies—they have darker colors in the center of their mouths, and as Asian women age, the outside of their lips get darker. That’s why they prefer to concentrate the color in the center of the mouth, for a youthful, juicy finish. Koh applied roughly three coats of color to the inner part of her top and bottom lips, smacked them together, and miraculously, it looked perfect right away. I think it takes a bit of practice, but believe me, I am putting in the hours to make mine just like hers.7. Autumn LipsSee on Instagram\n        Aside from perfectly blurred lipstick, I also noticed that almost every Seoul local wore a variation of one gorgeous berry shade. AmorePacific has this color in every one of their brands, and for good reason—it looks stunning on all skin tones. It’s called “Autumn Color” and has clearly taken over the Korean lipstick market, with every tone you could imagine in glosses, stains, and cream formulas. I brought six different varieties back with me—it’s really that good.Want more stories like this?This Is What Happened When I Tried a Korean Beauty Regime for a MonthThe Korean Beauty Trick for Long-Lasting MakeupThe Truth About the Korean Beauty Routine See on Instagram See on Instagram See on Instagram See on Instagram See on Instagram See on Instagram See on Instagram ",
    "datetime": "2018-10-24T10:30:19+00:00",
    "url": "https://coveteur.com/2018/10/24/best-new-korean-beauty-makeup-trends/"
}