{
    "title": "There Are Peach & Lily Sheet Masks Now | Allure",
    "text": "By Sarah Kinonen You're probably already well versed (and well stocked) on Korean beauty. If you're not, quick refresh: K-beauty is constantly launching innovative new products and tricks stateside that garner almost immediate cult-like followings. But we just learned of one more K-beauty secret (that we suppose isn't a secret anymore). Peach & Lily sheet masks are coming, the first in-house line from the the online (and brick-and-mortar) destination. Peach & Lily, the K-beauty site founded by Alicia Yoon, is already filled with an abundance of extremely well-curated K-beauty products, carrying both under-the-radar labels and big brands alike. (It's also broken down extremely well, making it easy to tackle every issue or find any product fast.) But the new Peach & Lily sheet masks, aptly called Dream Sheet Mask Collection, are all paraben-free and packed with antioxidants. The three different masks in the collection—Good Skin Day, Chubby Cheeks, and Reset Button—are each tailored to different, specific skin needs—yours of which could easily change on a daily basis. (Why do you think combination skin is such a thing?) Good Skin Day is packed with hyaluronic acid, ceramides, and algae to moisturize and brighten your complexion, while Chubby Cheeks has collagen-boosting, plump-inducing ingredients like peptides, niacinamide, and ginseng. (Basically, helping you channel your inner Gigi.) And then for stressful days (maybe like today, just saying), you can reach for Reset Button, which calms irritated skin with rosewater and aloe extract. I think of them as an anti-aging wonder trio, TBH. More skin-care launches to get excited about: While we want to completely sign off on the masks because we trust Yoon implicitly and adore many of the products Peach & Lily carries, we haven't been able to test any of the masks from the Dream Sheet Mask Collection just yet. Of course, we'll update this post as soon as we do. Turns out you're going to have to wait a bit longer, too: The Peach & Lily sheet masks officially launch November 11 on peachandlily.com for $6 each (or you can get the set of three for $15). Until then, start practicing your sheet-mask selfie game. Because if not for the skin-care benefits, do it for the Instagram. Take a peek at our exclusive Chanel spa tour: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Sarah Han By Sarah Han By Sarah Han By Angela Trakoshis More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2016-11-08T20:33:49.523Z",
    "url": "https://www.allure.com/story/peach-lily-sheet-masks"
}