{
    "title": "These Women Have Combined The Best of South Korean Beauty With Affordable Prices",
    "text": "Sign up for our biweekly newsletter! Kayla Bertanga and Lisa Ballestaedt created Soon Skincare with a mission to bring high quality K-Beauty to the world Kayla Bertanga and Lisa Ballestaedt created Soon Skincare with a mission to bring high quality K-Beauty to the world Bertagna & Ballstaedt’s story, as told to The Story Exchange 1,000+ Stories Project: We started Soon Skincare to create a product that embraced the best of South Korean beauty standards but tailor-made for women everywhere. Success is completing a goal or objective. It is also being able to look back at your work with a feeling of satisfaction and pride that you really put a lot of time and effort into something and the end result reflects that. We hope to become an internationally known beauty brand that empowers women to look and feel great in the healthiest skin they can imagine. We are traveling back and forth to Korea to create new formulations of cleansers, toners, sun protection, moisturizers and more. We also hope to connect with global influencers and beauty media as we develop and deliver innovative skin care solutions for all ages and stages of life. We are so proud of the products we launched. It definitely took us longer to start selling them than we hoped, but at the end of the day we took the time to make sure the products were how we wanted them to be, and feel like entering such a crowded marketplace with products like ours that are unique and high quality feels like a success in and of itself. Our top business challenge would have to be the process of creating and perfecting our products. Working on formulas, researching the ingredients, making changes to the products, and testing each new version. All of this delays how soon you will receive and be able to start selling them. We have learned you need to be patient and know that the end goal is to come up with something amazing, knowing we were involved in every detail. We are proud that we have created products we can really stand behind, even though it took us longer than we originally planned. We would have to say that finding ample amounts of time to dedicate to our families while growing this business has been a personal situation that we have been trying to navigate. We both have young children and we are very hands on when it comes to parenting them. So we have become creative in how we schedule our time to work and our time with our kids so everything gets taken care of. It means that sometimes emails don’t get answered until after bed time, and sometimes class projects don’t end up being the Pinterest-worthy version I envisioned, but at the end of the day the task always gets done. My most important role model is my Grandpa Hong, who translates for us sometimes in our meetings in Korea. He grew up in war-torn Korea and has overcome poverty and personal loss. He also worked hard on an education at the most prestigious University in Korea, moving to the US, getting his PHD, working in Aerospace, and is now a college professor in his retirement. He has told me to find the hardest work I will ever love, and co-creating Soon Skincare with Kayla has definitely been that way. It has been a lot of work, but it is work that I genuinely love doing, especially with Kayla as a partner. Website   www.soonskincare.com\nFacebook   www.facebook.com/soonskincare\nInstagram   @soonskincare The Story Exchange is an award-winning nonprofit media organization that provides inspiration and information to entrepreneurial women. Sign up for our biweekly newsletter! The Story Exchange is an award-winning nonprofit media organization that provides inspiration and information to entrepreneurial women. ",
    "datetime": "2018-10-31T13:33:47+00:00",
    "url": "https://thestoryexchange.org/kayla-bertagna-lisa-ballstaedt-soon-skincare/"
}