{
    "title": "These Korean beauty brands are minimalist wonders | Wallpaper",
    "text": "When you purchase through links on our site, we may earn an affiliate commission. Here’s how it works. RboW, Tamburins, and Nonfiction are three Korean beauty brands using minimalist designs to create eye-catching products We have always had a taste for minimalism here at Wallpaper* HQ, from architecture to design, fashion to beauty. So it’s no surprise that our interest was been piqued by a few new South Korean beauty brands with bold, sleek packaging that played right into our minimalist sensibilities. K-beauty might have skyrocketed to popularity with its ten-step regimes, but these brands prove the power of simplicity.  Body care and fragrance brand RboW was founded by former contemporary gallery director Sohyung Kim as a way to combine her passion for art and fragrance. All the products come in packaging decorated with abstract drawings that express the mood of the scent inside. For instance the packaging of O.A.C, a woody floral scent, displays two circles to demonstrate the symmetry between its dual aspects. The artistic inspiration also applies to the scents themselves. Take, for instance, OooooF, a potent blend of ceder, musk, and vanilla that draws its inspiration from minimal art by combining a few elements to have a highly impactful result. rbowofficial.net  Designed by the minds behind Gentle Monster, Tamburins’ products feel more akin to a designer accessory or mini object d’art rather than, say, a hand sanitiser. Take, for instance, its signature hand cream, which comes on a gold chain, or its new The Shell hand cream, which is designed to be used as both a perfume and moisturiser. It comes in variety of curious scents, including Fear (a blend of ‘hard soil, grapefruit, and fresh air’) and Posy (‘rose bushes, patchouli, and wet soil’). We also recommend trying the brand’s signature Tiger Leaf masks in the morning before make-up application. They quickly hydrate the skin without making it greasy, making them a perfect primer for foundation or tinted moisturiser. tamburins.com  Nonfiction’s efficacious and easy to use product line is designed for the realities of everyday life. Body odour, dry hands, snd chapped lips are all alleviated by the brand’s coolly packaged products. We recommend trying the Santal fragrance if you’re a fan of the Le Labo classic, but would rather wear something a bit less ubiquitous. The Vegan Lip Balm is an ideal addition to any handbag as winter starts to settle in. And the Hand & Lip Care Trio with soap, lotion, and lip balm makes an elegantly packaged gift to please anyone. nonfiction-beauty.com Receive our daily digest of inspiration, escapism and design stories from around the world direct to your inbox Mary Cleary is the Beauty & Grooming Editor of Wallpaper*. Having been with the brand since 2017, she became an editor in February 2020 with the launch of the brand’s new beauty & grooming channel. Her work seeks to offer a new perspective on beauty, focusing on the pioneering personalities, product designs, and transformative trends within the industry. Thomas Heatherwick's 'Humanise' is a new book - and the start of a campaign - by the designer, arguing against 'boring' buildings By Ellie Stathaki\n\nPublished 23 October 23 'Now You See Me! An Introduction to 100 Years of Black Design' is a new book by Charlene Prempeh covering fashion, architecture and design By Shawn Adams\n\nPublished 23 October 23 ‘A reflection of design today,’ Matter and Shape is a new initiative by journalist Dan Thawley and fair specialist WSN, taking place 1-4 March 2024 in Paris’ Jardin des Tuileries By Rosa Bertoli\n\nPublished 23 October 23 A Drop d'Issey is the new female fragrance from Issey Miyake Parfums. American designer Todd Bracher discusses his intriguing bottle design and the future of perfume packaging, as we look back at innovation from Issey Miyake perfumes past By Mary Cleary\n\nLast updated 7 October 22 Wallpaper* is part of Future plc, an international media group and leading digital publisher.  Visit our corporate site.\n©\nFuture Publishing Limited Quay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. ",
    "datetime": "2021-10-13T14:53:52Z",
    "url": "https://www.wallpaper.com/beauty-grooming/minimalist-korean-beauty-brands"
}