{
    "title": "This $49 K-beauty eye cream sells once every three seconds in Korea | Daily Mail Online",
    "text": "By Alice Murphy For Daily Mail Australia Published:  05:22 BST, 31 October 2019   |  Updated:  08:06 BST, 31 October 2019   View  comments  A revolutionary eye cream suitable for the entire face has become so popular, it sells once every three seconds in Korea - with users claiming it makes them look years younger. Unlike traditional eye cream, the Perfecting Eye Cream for Face, from Korean skincare brand AHC, is designed to be applied all over the face, not just under and over the eyes. Said to be owned by almost all Korean women, it claims to hydrate, brighten and tighten skin, and reduce the appearance of fine lines and wrinkles, making skin appear youthful and radiant. And it's good news for Australian skincare enthusiasts, because the cream has just launched exclusively at Myer for $49. The Perfecting Eye Cream from Korean skincare brand AHC (pictured left and right) is so popular, it sells once every three seconds in Korea To achieve the best results around the eyes, the cream should be lightly dabbed onto the under-eye area and over the eyelid after skin has been primed with toner. When applying the product all over the face, it should be used as the last step in your skincare routine and gently dabbed evenly across the forehead, cheeks and chin. Korean beauty products have become all the rage in recent years, thanks to widespread endorsements from major stars and influencers. Australian TV presenter Ksenija Lukich was recently announced as the latest brand ambassador for AHC, while celebrity fans of the brand include Hollywood actress Anne Hathaway, who reportedly swears by the best-selling eye cream. Australian TV presenter Ksenija Lukich (pictured) was recently announced as the latest brand ambassador for AHC, while celebrity fans of the brand include Hollywood actress Anne Hathaway, who reportedly swears by the best-selling eye cream Acclaimed American fashion blogger Aimee Song is the US ambassador for AHC. The cream was ranked number one in a blind test for skincare products on popular Korean TV series 'Get It Beauty'. AHC's Marketing Manger Stephanie Ko said it's the first time a skincare brand has released an eye cream suitable for the whole face. 'AHC is the first brand in the beauty market to break category molds and elevate an eye cream into the realm of total facial care to provide resilience, hydration, brightening and nourishing effects,' she said. A-list actress Kate Hudson is a fan of AHC's sheet masks (left), while Refinery29's deputy beauty editor Jessica Cruel proclaimed she 'can't spend more than one day without' the Aqualuronic Hydrating Emulsion (right), which costs $59 at Myer The eye cream for face isn't the only AHC product being hailed as a miracle worker. Actress Kate Hudson regularly posts Instagram selfies in the heavily hydrating $12 Hydra Gold Foil Mask. Refinery29's deputy beauty editor Jessica Cruel proclaimed she 'can't spend more than one day without' the Aqualuronic Hydrating Emulsion, which costs $59 at Myer. AHC is exclusively available at Myer, with products ranging between $50 and $80. Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts,\n      or debate this issue live on our message boards. We are no longer accepting comments on this article. Published by Associated Newspapers Ltd Part of the Daily Mail, The Mail on Sunday & Metro Media Group ",
    "datetime": "2019-10-31T05:22:59+0000",
    "url": "https://www.dailymail.co.uk/femail/article-7633197/This-49-K-beauty-eye-cream-sells-three-seconds-Korea.html"
}