{
    "title": "This Awesome Korean Foaming Body Oil Is a Total Game Changer | Allure",
    "text": "By Stephanie Saltzman Ask anyone with soft, supple, unscaly skin in the dead of winter for their secret to pulling off this near-freakish feat, and chances are it's body oil. But there are also plenty of downsides to the average body oil: If it comes in a bottle, it's almost impossible to dispense the right amount; the runny formula drips through your fingers; and it's a total wasteful mess. Or if it's a seemingly more convenient spray-on, you end up coating your entire body—along with the floor of your bathroom—in a slippery film (which is as hazardous as it is annoying to clean up). And finally, the oils that are thick enough to deliver truly intense moisture often soak in with what can best be described as a slothlike lack of urgency. But then I found Egg Mousse Body Oil, a revolutionary formula made by Too Cool for School, an innovative Korean brand that's been around since 2009 but just recently came to the U.S. It's unlike anything else out there, and it solves just about every body-oil gripe imaginable. In contrast to the aforementioned pour-out or spritz-on oils, this one is a fluffy, airy mousse that forms stiff peaks—almost exactly like a meringue you'd see the Barefoot Contessa making. (And somewhat weirdly, it actually has egg in it, but I'll get to that in a second.) The frothy foam dispenses much like a shaving cream, so there's zero dripping or messiness. And then comes the most miraculous part: It transforms into a clear oil that absorbs into skin in just a few seconds. When I say seconds, I'm talking fewer than 15. Here it is in action: Much like the spray-on body lotions Vaseline makes, this product is a lazy girl's dream come true. You can apply it to your entire body, rub it in, and then get dressed without even a hint of stick-to-your-clothes-ness in under a minute. And multiple testers found that it softened and quenched even the flakiest, most neglected skin, leaving it smooth all day. With a quick glance at the ingredient list, that level of effectiveness isn't much of a surprise. The formula is spiked with glycerin, trehalose, shea butter, avocado oil, almond oil, olive oil, jojoba oil—so pretty much every moisturizer in existence. Oh, and there are also some definitely not-vegan components in there: milk-protein extract and, yes, egg-yolk extract. Both are known moisturizers, which is why they're often used in DIY beauty recipes. It's heavily perfumed (think soapy floral rather than scrambled eggs), which one tester found to be comforting and another, nauseatingly cloying. But that's the one and only gripe we can think of. Maybe that and the fact that it doesn't come in a bigger, lifetime-supply-size bottle. For a peek inside the Allure beauty closet, watch: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Sarah Han By Angela Trakoshis By Sarah Han By Dianna Mazzone More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2015-11-03T10:00:00.000Z",
    "url": "https://www.allure.com/story/foaming-body-oil"
}