{
    "title": "This K Beauty Brand Just Released a Marvel-Inspired Makeup Collection | Allure",
    "text": "By Rosemary Donahue Makeup is part of many folks' every day routines, but that doesn't mean it has to be boring. That's why many brands are looking to bring a little fantasy into their collections by taking inspiration from the movies. There are collections inspired by Harry Potter, looks inspired by mermaids, and makeup collections inspired by nearly every Disney movie under the sun. Now, Cosmopolitan is reporting that K Beauty brand The Face Shop is taking inspiration from Marvel superheroes to create their new collection, and the items look absolutely stunning. This content can also be viewed on the site it originates from. The gorgeous collection includes everything from lipstick to eyeshadow to mascara and the graphics seem to focus primarily on Captain America's shield, though there are some other characters that make an appearance. Spiderman, Iron Man, and the Black Widow are also featured characters in the collection. This content can also be viewed on the site it originates from. This content can also be viewed on the site it originates from. As pointed out by Cosmopolitan, The Face Shop doesn't typically sell their goodies in the U.S. so they may be harder for those of us residing stateside to snag, but if any of the items look like must-haves to you, you can shop some of them here and here. It looks like the collection also includes a few items for men (though really, makeup is for everyone), including Hydrating Fluid and BB Cream, so check out the entire collection and see what strikes your fancy. More on makeup: How to Get the Unicorn Hair Trend: Follow Rosemary on Instagram and Twitter. By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Sarah Han By Kara Nesvig By Sarah Han By Sarah Han More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2017-07-16T17:12:26.404Z",
    "url": "https://www.allure.com/story/k-beauty-the-face-shop-marvel-collection"
}