{
    "title": "This Korean Beauty Glass Skin Routine Has Never Steered Me Wrong",
    "text": "(Beauty Report Card) And it never will. As someone with oily skin, I always opted for skin care products with specified mattifying and oil control properties. That is until I came across the K-beauty phenomenon that is ‘glass skin’ (pioneered by Peach & Lily founder Alicia Yoon), which refers to a dewy light reflective glow that, as the name suggests, resembles glass. I began to come out of my fear of looking too ‘oily’ and embraced the idea of an impossibly glowy complexion that isn’t due to oiliness but rather a very hydrated dermis. With my newfound obsession with a glass skin care routine came an introduction to Korean skin care products, which now take up most of my beauty cabinet. K-beauty is steeped in rich Korean history and traditions that stem from the natural and herbal remedies used within the country and neighboring areas for various bodily ailments and skin care issues. For example, centella asiatica (also known as gotu kola), found in many K-beauty products, is a medicinal plant found in parts of Asia and has been used in folk medicine for hundreds of years as a way to treat surface skin issues like wounds, burns, and psoriasis. In addition to pioneering ancient ingredients, K-beauty is also responsible for a number of  skin care trends and hacks including oil cleansing (washing your face with an oil-based cleanser) and using an essence (a product somewhere between a serum and a toner). “Korean skin care is a wellness practice, and considers how skin is related to the whole body as well as considering how the skin works as an ecosystem,” says Peach & Lily founder Alicia Yoon to TZR. The traditional 10-step Korean skin care routine became popular when Soko Glam founder Charlotte Cho coined it back in 2014 in an Elle interview and shortly thereafter to Into The Gloss. Back in college I was super fascinated by the complexity of having a long robust skin care routine and so I adapted one for myself, but it turned out to be disastrous — which is inevitable in skin care if you don’t do your research. I overloaded my routine with useless buzzy products I saw trending on the internet and ended up with a routine that included a sugar face scrub, an acid-based toner, an abrasive cleanser, a facial steamer, a drying face mask, and an ineffective moisturizer, to name a few products. A few years later, with a substantial amount of research under my belt and an increased appreciation for the gentle and holistic origins of the 10-step skin care routine, my regime is now just as many steps as it was in college (some days and nights), but much more effective. It includes K-beauty staple products and practices that are as authentic as they are effective. “Rather than a specific ingredient, I think [K-beauty] is more about the approach and the practice,” says Yoon. “In my opinion, what sets apart the Korean approach to skin care is the focus on the holistic health of skin and body, versus on ‘perfection’ of the skin.” Below see the K-beauty skin care routine I currently use when I want to achieve the ultimate glass skin glow. We at TZR only include products that have been independently selected by our editors. We may receive a portion of sales if you purchase a product through a link in this article. I was apprehensive of oil cleansers for a while because already having oily, acne-prone skin I could only imagine that massaging an oil into my skin for a minute would end up in clogged pores and disaster. Little did I know it would only take the right cleanser to get me hooked on the K-beauty practice. Incorporating oil cleansing as the first step in my nighttime routine has helped significantly with reducing excess oil, and improving my skin’s overall texture. Before adapting K-beauty practices into my skin care routine I’d always opt for a foaming cleanser, some of which would leave my skin dry. Switching to gentle water-based cleansers like this pick from Naturium has truly made the difference in my moisture barrier. My skin still feels clean but also super supple and hydrated, making the next steps of my routine sink in seamlessly. Giving up abrasive physical exfoliators for more effective chemical ones was one of the best switches I made in my skin care journey. However, every once in a while I still want the satisfying feeling a physical exfoliant provides and the global K-beauty catalog is full of products that strike the perfect balance of physical and chemical exfoliators, like this rice mask from SkinFood. I get the gentle scrub factor from the small grains which slough off dead skin cells, while the rice bran water helps to brighten skin. If you would’ve told me a few years ago that I didn’t have to apply a toner with a cotton pad, I’d be shocked. But that’s also because I used to assume all toners were astringent — meant to purify pores with a strong alcoholic scent and drying effect. Little did I know that there was a whole world of hydrating K-beauty toners that I could pump into my hand and pat directly into my face, and that would help all my other serums and creams absorb and perform better. Truthfully, sometimes I’m still confused on what exactly an essence is (somewhere between a serum and a toner), but I stopped asking questions once I came across this cult-favorite essence from Cosrx. Like most other people, I was originally put off by the mention of snail mucin, but once I got passed that, I was met with one of the most hydrating products I’ve ever used. It sinks into the skin, leaving it plump with a dewy glow. This product needs no introduction, nor explanation as to why it’s great. Any skin care fanatic has surely come into contact with this light, hydrating serum. What I will say is, no matter how many hyaluronic acid serums I go through (and as a beauty editor it’s a lot) I always come back to this one every time. I’ve always been a bit of a sheet mask skeptic, thinking they’re really only meant for skin care ‘vibes’ and not actual results. I still don’t reach for sheet masks often (I’m more of a clay mask girl myself), but when I do it’s usually a K-beauty one — plus, when I’m doing a complete 10-step routine a sheet mask just rounds out the experience. This cotton mask from Innisfree actually isn’t just for vibes. The light weight sheet, when placed on a clean and hydrated face, delivers ceramides deep into the skin — for which your moisture barrier will thank you. With the large amount of moisturizers I accumulate and rotate through it’s rare that I’ll consistently use one for months at a time, but lo and behold I’m reaching the bottom of the new Laneige Water Bank Cream Moisturizer because I’ve been using it nonstop for months. From the texture and light scent to the way it just melts into my skin leaving it baby soft, and the fun packaging, I truly can’t get enough of this cream. Some will tell you that an eye cream is unnecessary, but if you’re really about the skin care life you’ll have a solid one (or two) in your rotation. I always opt for eye products that contain caffeine to help with my dark circles and the gel from Klairs does just that. Last but certainly not least is sunscreen. I only use SPF in the day time but that doesn’t undermine its importance — everyone should be wearing sunscreen everyday. My SPF level of choice is 50 courtesy of NEOGEN. It’s lightweight, doesn’t leave me feeling greasy, and arguably most importantly (at least to me), it doesn’t leave a white cast. In the daytime, this routine is usually eight steps for me (no oil cleanse or sheet mask) and at night it tends to be nine steps (no SPF). Though it may seem long and tasking, it really isn’t — and in fact one of the things I love so much about the 10-step Korean skin care routine is how in-depth it is, allowing me to take my time and pamper myself a bit whether before I start my day and as a way to unwind after a long one. Even if you don’t implement all 10 steps, even just adding one or two K-beauty products is sure to elevate your skin care game and boost your glow. ",
    "datetime": null,
    "url": "https://www.thezoereport.com/beauty/glass-skin-care-routine-korean-beauty"
}