{
    "title": "This Korean Beauty Regimen Could Be The Answer To All Your Cystic Acne | Teen Vogue",
    "text": "By Sarah Wu It’s patently untrue to suggest that any breakout is a welcome sight, but the deeply embedded blemishes known as cystic acne cause a special kind of dread. If you’ve encountered this skin condition before — particularly around a certain time of month — you already know what a complete pain these inflamed bumps can be to treat.\n \nCue two of our favorite beauty sources to the rescue: K-beauty expert (and founder of Soko Glam) Charlotte Cho and the online goldmine of skincare secrets, Reddit. The duo came together when Charlotte discovered a Reddit thread on cult K-beauty brand COSRX, which uses simple, natural ingredients to address the root of your acne issues. After thoroughly testing the line on her own skin, she decided to introduce it as the first acne-targeted collection curated through her site, a major stamp of approval that instantly got us curious. \n \nAfter trying the products ourselves, we’re here to tell you that this line is legit. It’s packed with effective ingredients like snail secretion filtrate (good on dry patches, acne, and hyperpigmentation) and hyaluronic acid — so your complexion heals, but doesn’t dry out. To get the scoop on using these products effectively, we turned to Charlotte for the seven-step, blemish busting tutorial. Here’s the rundown:\n \n1. Cleanse. Ridding your skin of dirt and debris is one of the best ways to prevent breakouts in the first place. “I use the COSRX Low pH Good Morning Cleanser as the second part of my double cleanse,” she says. The low pH of 5 won’t strip your skin of its natural oils, but the inclusion of mild acids helps clear your complexion. The formula goes on as a clear gel and transforms into a foam as you work it in, meaning it removes makeup as well!\n \n2. Tone. Toning isn’t always an essential step in your skincare routine, but a BHA toner like COSRX Natural BHA Skin Returning A Sol can make a huge difference on breakouts and rough spots alike. “Tap with fingers to absorb,” instructs Charlotte. The key ingredient is a 60% concentration of black bee propolis, which helps inhibit bacterial growth while soothing and repairing skin. As for the BHA, that’s paired with natural AHAs to control excess sebum and speed cellular turnover.\n \n3. Exfoliate. The next step is to penetrate deeper into your pores to completely clear away bacteria and debris. For this, Charlotte recommends the [COSRX AHA 7 Whitehead Power Liquid](http://sokoglam.com/products/cosrx-aha-7-whitehead-power-liquid(, which harnesses more AHAs. “It’s a powerful exfoliant,” she notes. “It not only treats existing breakouts, but also prevents them from occurring.”\n \n4. Treat. You can think of ampoules as the next step after a serum: similar formula, but a higher concentration of active ingredients geared toward skin in crisis mode. Dab0COSRX Centella Blemish Ampoule on any breakouts — it’s specifically formulated for sensitive, stressed-out skin. The base is made from centella asiatica leaf water, a medicinal herb that’s used to treat wounds and small infections. As a bonus side effect, it also hydrates and promotes collagen production and elasticity, while reducing the appearance of pores (try applying a thin layer to your T-zone if you tend to get oily).\n \n5. Hydrate. It’s important to keep skin moisturized, even when attempting to reduce breakouts. For a light layer of serious hydration, Charlotte likes the COSRX Natural BHA Skin Returning Emulsion. It’s ideal for keeping your skin clear because it mixes clarifying ingredients like AHAs and BHAs with hydrating additions like hyaluronic acid. The texture of an emulsion is that of a lightweight fluid, so those who shy away from thick, heavy moisturizers won’t feel weighed down with product.\n \n6. Heal. Still with us? Here’s our pick for the hero product of the line. You may be familiar with pimple patches, which have a pliable texture and adhere directly to your blemish. While they’re usually only effective on surface acne, COSRX has somehow managed to make a version that helps treat cystic acne. “The COSRX Acne Pimple Master Patch treats acne for what it really is — an infected wound,” says Charlotte, who refers to the product as an overnight miracle worker. “It even helps flatten and heal cystic acne faster,” she adds. The thin, hydrocolloid patches work by breaking down debris and absorbing gunk from any type of breakout. Stick one on before you go to bed, and marvel in the morning.\n \n7. Brighten. So you’ve successfully vanquished your blemishes, and now want to brighten any leftover hyperpigmentation. Your final step is the COSRX Galactomyces Whitening Power Essence, which causes cellular turnover to move faster than its normal, 28-day cycle. The active ingredient is fermented yeast extract, which is the same star ingredient used in lines like Missha and SK-II. Charlottes parting tip for maintaining that clear complexion? “Besides topically applying products, you can pay attention to what you eat,” she advises. “You might want to test how dairy, coffee, or sugar affect your skin.” Consider yourself fully armed to fight your next cystic acne breakout. Related: This 5-Minute Secret to Beautiful Summer Skin Couldn't Be Easier By Kara Nesvig By Anoushka Lal By Sara Delgado By Gabi Thorne More from Teen Vogue Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Teen Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "datetime": "2016-06-02T14:59:56.424Z",
    "url": "https://www.teenvogue.com/story/korean-beauty-regimen-cystic-acne"
}