{
    "title": "This K-Beauty Serum Works Wonders on Hormonal Acne | Allure",
    "text": "By Sara Spruch-Feiner When we think about hormonal acne, images of dermatologists and prescription pills come to mind. But one writer says she’s got hers under control with this K-beauty brand’s serum (which is conveniently available at your local Sephora). “In the morning, even my deepest, reddest, most under-the-skin blemishes have significantly improved and then disappear within about 48 hours,” Popsugar writer Madison Meltzer says. In fact, we’ve sung its praises here on Allure before too. The product in question is Dr. Jart’s Cipacair Tiger Grass Re.Pair serum, and it’s just what you need when you’re about to hit the panic button on your complexion. The main ingredient is centella asiatica, an herbaceous plant that’s been used for centuries to calm angry skin (the folklore goes that Asian tigers are known to roll around in it to get the most of its soothing properties). And now, we too can reap its benefits. Dr. Jart’s taken the extract and combined it with a mineral solution containing copper, zinc, and selenium to create a soothing serum that forms a protective barrier over the skin. Centella asiatica is also rich in chlorophyll, which gives plants their energy. Gentle enough to be used daily, you can slather your face in this stuff. It’s lightweight too, so you’ll likely want to apply your regular moisturizer on top. You can expect to see rosacea, acne, and general sensitivity calmed. You only need a small drop of the pale green liquid to cover most of your face, too. Angry skin — rejoice! \"The longer I've used it, the more it's become a spot treatment rather than a part of my nightly routine,\" Meltzer writes, \"it's that good.\" If your skin loves this natural extract as much as Meltzer's, you'll be pleased to know it's one of four products in the Dr. Jart line that harnesses its power.\nThere's a cream, a color correcting treatment, and a pack of 30 individual packettes of an overnight mask. Of course, what worked for Meltzer won’t calm everyone’s hormonal acne, but for under $50, it's certainly worth a try! Related: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Annie Blay By AnaMaria Glavan By Gabi Thorne By Fani Mari More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2017-10-11T20:21:20.647Z",
    "url": "https://www.allure.com/story/k-beauty-serum-treats-hormonal-acne"
}