{
    "title": "This New Korean Beauty Hack Will Blow Your Mind",
    "text": "From Cosmopolitan Water is traditionally a makeup-wearer's worst enemy. But this Korean beauty trend claims that a bowl of water, coupled with a healthy dusting of baby powder, might just make your perfectly matte, long-lasting makeup dreams come true. Enter jamsu: a term, according to Vogue, that roughly translates to \"diving\" or \"submerging\" in Korean. The beauty trend, which involves coating your face with baby powder before submerging your face in water, was introduced by a Japanese beauty blogger and swept across Korea this past summer when the weather was sweltering and makeup was in dire need of an anti-melt remedy. Similar to the popular beauty technique baking, the powder claims to set the makeup, while the water supposedly seals it. Today Show's Emily Slawek recently gave the trick a try and documented her experience, which was, for all intents and purposes, a success: Watch NBC TODAY Show on Yahoo View, available now on iOS and Android. Here's how to try this trend at home: Step 1: Put on your foundation and concealer. Step 2: Cover your face in baby powder. Step 3: Dunk your head in a bowl of cool water for 15- 30 seconds. According to Vogue, the dryer your skin, the less time you should submerge your face in water. Boom: flawless. Emily claims her makeup lasted through a 10 hour day that included a messy quesadilla meal and a three mile run. Damn. Others who've tried the trend have had varying results. YouTuber Sabrina Anijs gave the trend a try and was super-dissatisfied with the results. Commenters suggested she try translucent powder instead of baby powder to get rid of the ghoulish glow left over from the baby powder. YouTuber Beauty Vixxen, on the other hand, said she ended up with flawless foundation coverage and was \"in love\" with the trend. So, does jamsu work? There's only one way to find out. Get non-boring fashion and beauty news directly in your feed. Follow Facebook.com/CosmoBeauty. You Might Also Like ",
    "datetime": null,
    "url": "https://finance.yahoo.com/news/korean-beauty-hack-blow-mind-171039279.html"
}