{
    "title": "This Korean beauty trend is great for dry and combination skin types | Life-style News - The Indian Express",
    "text": "In the last few years, we have been flooded with K-beauty trends — whether it is the detailed 10-step Korean skincare or the cream skin trend. And whenever there is a new beauty trend on the block, we look forward to trying it out, isn’t it? So get ready, as we have yet another trend for you today; and if have dry or combination skin then this one is just for you! Slugging — the new trend — has taken the internet by the storm. But before you jump right in, find out what it is all about. What is slugging? Unlike the detailed 10-step skincare regime, slugging (thankfully!) requires just one step, and is tailor-made for those who love the ‘glow-from-within’ or the ‘dewy’ skin look. The basic principle behind this trend is to protect the barrier of your skin and making sure it remains hydrated which, in turn, will make it glow and look supple. READ| Korean skincare: Try this step every morning to get firm, glowing skin How do you incorporate this trend into your routine?  A post shared by Jennifer Casasola (@jencasasola)  This one-step, one product trend only requires you to apply a thick layer of petroleum jelly on your face before you sleep at night. The idea behind sleeping with a thick layer of jelly is that given its occlusive nature, the jelly will clog the skin pores keeping skin issues at bay. But, remember that this step works best for dry skin or combination skin. Begin by double-cleansing — a mainstay of Korean beauty (know more about it here). Once done, follow your regular skincare routine — toning, moisturiser, serum and then finally apply a thick layer of petroleum jelly and sleep! When you wake up, remove the remnants of the petroleum jelly with a soft napkin and there you have glowing soft and supple skin. READ| This simple hack can significantly change your beauty game Are there any benefits? The best thing is that you don’t have to change your skincare routine because slugging will always be your last step. If done correctly, it helps the other products perform better, too. This simple step also heals the barrier of your skin. However, if you are someone who has acne or oily and sensitive skin then stay away not only from petroleum jelly but also other kinds of occlusives. READ| Korean beauty: Common beauty mistakes you may be making For more lifestyle news, follow us: Twitter: lifestyle_ie | Facebook: IE Lifestyle | Instagram: ie_lifestyle  ",
    "datetime": "2020-12-08T20:50:19+05:30",
    "url": "https://indianexpress.com/article/lifestyle/life-style/korean-beauty-trend-dry-combination-skin-type-7084700/"
}