{
    "title": "This K-Beauty Brand Is Bigger Than Chanel. But It’s In Trouble. | BoF",
    "text": "Agenda-setting intelligence, analysis and advice for the global fashion community. SEOUL, South Korea — Women in their teens and 20s fill a recently opened store by Amorepacific-owned beauty brand Etude House, where snail slime, bee venom and white jelly mushroom extract — ingredients often heralded in South Korea for their skin-enhancing qualities — feature in products that line the shelves. The retailer's bestselling cushion compact foundation can be found among 1,000 other skincare products like serums and sheet masks. You’d be forgiven for thinking this is just another store in the beauty giant’s domestic market of South Korea. But it is not. The boutique is located inside the Dubai Mall — the world’s largest shopping centre, drawing 80 million visitors a year — marking Amorepacific’s first gateway into the Middle Eastern market. The move is part of chief executive Suh Kyung-Bae’s ambitions for it to become a global elite beauty brand. Amorepacific has come a long way since its humble beginnings in 1945, when Suh’s grandmother, Yun Dok-Jeong, discovered the potential of the camellia plant. Based in the city of Gaesong — now a part of North Korea — that prospered as a trade centre producing ginseng after Korea was liberated from Japan, Yun would spend hours pulverising the flower’s delicate seeds, turning it into a prized oil that fashionable Korean women would use in their hair. Eight decades later, Suh, now chairman and chief executive of Amorepacific, has turned the beauty company into one of Asia’s most powerful cosmetics empires. Amorepacific headquarters in Seoul designed by David Chipperfield | Source: Courtesy Amorepacific headquarters in Seoul designed by David Chipperfield | Source: Courtesy Amorepacific headquarters in Seoul designed by David Chipperfield | Source: Courtesy Amorepacific’s new $470 million headquarters, designed by British architect David Chipperfield, opened in 2018 in Yongsan — a strategic location sandwiched between Seoul’s two major cultural and economic centres, Gangnam and Jongno. According to a spokesperson, the building, which has been in development and construction for eight years, was part of Suh’s desire to create something grander than an ordinary office space. One could easily liken the sprawling cube-shaped campus, which boasts green terraces and a courtyard populated by trees and water basins, along with a museum, tea room, restaurant and retail space, to an entertainment venue. Above the public facilities are 25 floors of office space, echoing Suh’s aspirations to make Amorepacific a modern organisation that mediates between local and global; private and public; collective and individual. He has certainly succeeded. From Grandma’s Kitchen to the World With sales of $5.6 billion, Amorepacific is not only Korea's biggest beauty firm, but also the seventh-largest cosmetics maker in the world, surpassing beauty sales of Chanel and LVMH in 2017. It operates across 20 markets and counts over 30 brands as part of its portfolio, including champion lines Sulwhasoo, a luxury range based on ginseng and other herbs; Laneige, a premium brand with a whitening line that promotes translucent skin; Mamonde, flower-based products for the mass market; green-tea based Innisfree; and bubblegum-pink Etude House, an inexpensive makeup line for teenagers. While Amorepacific's roots remain a key source of inspiration — there is a replica of Yun's original kitchen inside the brand's museum in Osan, a city south of Seoul, where the aromas of camellia, ginseng and other Asian plants fill the room — it has grown far beyond what one might have expected. Among Asian beauty firms, only Japanese company Shiseido generates bigger numbers in Asia. Worth an estimated $13 billion, South Korea's beauty industry is among the world's top ten, after the US and Japan. Geopolitical trends have helped to drive its success: worth an estimated $13 billion, South Korea's beauty industry is among the world's top ten, after the US and Japan. But K-beauty also holds sway among its neighbours. According to the Korea Customs Service, K-beauty exports have more than doubled from $1 billion in 2012 to $2.64 billion in 2017. Jung Kuho, executive director of Seoul Fashion Week, told BoF that sales of Korean cosmetics have overtaken fashion. The surge has gone hand-in-hand with hallyu, a South Korean cultural wave that has swept the globe, especially in China, which is set to become the world's largest market for beauty products, according to Morgan Stanley. It's been a boon for South Korea, which became China's top source of cosmetics imports by value for the first time, dethroning France, where L'Oréal had long led the beauty products market. Amorepacific has been one of the biggest beneficiaries of this coup. The company’s sales in China have grown at a rate of 40 to 50 percent annually since 2002. “If you consider the growing population and their consumption power, China is a market where we definitely want to succeed,” Jennifer Rho, Amorepacific Group’s business strategy advisor, told BoF. Combatting a China Slowdown Yet, over the past few quarters, Amorepacific has struggled. For the third quarter ending September 2018, the cosmetics giant reported a 24.3 percent drop in operating profit, to 76.5 billion Korean won ($67 million), from the same period a year earlier. Sales gained 5.7 percent to 12.8 trillion won over the same period but the results were far below analyst expectations of 131 billion won for operating profit and 13.4 trillion won for sales. The cosmetics firm's sales were hit over the past year by lingering diplomatic tensions with China that reduced Chinese tourists to South Korea, after the country angered Beijing by deploying a US Terminal High Altitude Area Defence (THAAD) system, which Chinese officials view as another American effort to contain China. Relations are now on the mend and it has had a noticeable effect: sales for labels like Sulwhasoo and Hera — the latter having sponsored makeup at Seoul Fashion Week since 2016 — jumped 11.6 percent in the third quarter, thanks to a recovery in Chinese customers. Amorepacific's headquarters in 1976 and in 2018 | Source: Courtesy Amorepacific's headquarters in 1976 and in 2018 | Source: Courtesy Amorepacific's headquarters in 1976 and in 2018 | Source: Courtesy Amorepacific is scheduled to release earnings results for the fourth quarter, as well as for the whole of 2018, later this month. But if there is one thing the conglomerate learned last year, it is just how much the company was leaning on a turbulent country like China, which combined with South Korea generated 90 percent of its revenue in 2017. “We realise that it makes [us] vulnerable if we are too dependent on a single market. That’s why we are trying to diversify our global portfolio,” said Rho, noting that the company was aiming to triple sales in Southeast Asia by 2020. While Southeast Asia brought in less than 3 percent of Amorepacific’s revenue in 2017, \"it has been growing at the same rate, which is 30 to 40 percent,\" she continued. \"There’s a young population with growing income and we see huge potential.” For Rho, that means taking account of the region's cultural and ethnic differences, including catering to Muslim women in countries such as Indonesia, Malaysia and Thailand. “[It’s] not a single market. There are different cultures, histories, languages, religions… there are more needs, so we need to locally target our products,” she said. This includes developing halal products, where ingredients like pork and alcohol aren't used in the manufacturing process. By 2020, Amorepacific is planning to open a new production facility in Malaysia and add 150 stores to the 250 it already has in the region. It's also partnering with Muslim influencers, such as Nisa Kay, who has over 74,000 followers on Instagram. But conquering international markets is easier said than done. The company has so far struggled to crack the European market, which saw shrinking sales of 11.8 percent in the third quarter, to 6.4 billion won. On the other hand, sales in the US grew 35.9 percent to 18.6 billion won. In 2018 the firm launched Laneige at Sephora US and also hosted its first pop-up in New York. According to a spokesperson, the store was so popular that it remained open for an additional week. Rho said that Amorepacific plans to bring one of its luxury brands to the UK and Germany this year, following its launch in France in 2017, when it started selling Sulwhasoo in Paris at the Galeries Lafayette department store. “The biggest challenge for us right now is coping with this fast pace of globalisation,” she said. A Fierce Fight to the Finish Amorepacific also faces competition at home, where emerging rivals like Stylenanda and large conglomerates like LG Household & Health Care have been riding high on K-beauty’s success and offer cosmetics and skincare products at competitive prices. The biggest blow to the cosmetics giant, however, was last summer, when it lost a patent for one of its most successful innovations, the cushion compact. (In June, the Supreme Court ruled in favour of a group of six Korean beauty manufacturers, including Nature Republic, Cosmax and Tonymoly.) Cumulative sales of the cushion compact reached 100 million units in 2016, when one was sold every 1.2 seconds. Launched in 2008, the cushion compact is a trifecta of skincare, sunscreen and liquid foundation combined in one formula. It quickly changed the makeup habits of South Korean women, thanks to its portability and ease of application. “The idea came from observing our customers’ needs,” said Rho. “A lot of women are very busy and don’t have much time for makeup, but there’s huge demand to have flawless, healthy, glowing skin. So we developed this all-in-one product [which] has been very successful [and] has contributed to Amorepacific’s growth.” Cumulative sales of the cushion compact — now available in over 19 different styles across more than a dozen Amorepacific brands — reached 100 million units in 2016, when one was sold every 1.2 seconds. Amorepacific's Etude House store | Source: Courtesy Amorepacific's Etude House store | Source: Courtesy Amorepacific's Etude House store | Source: Courtesy Unsurprisingly, formidable competitors want in. L’Oréal’s Lancôme was the first Western brand to follow suit, launching its own version a year later. Brands such as Shiseido’s Nars have also released a version of the product. Meanwhile, the cosmetics giant has had to battle against counterfeit versions of its popular cosmetics, many of which are sold on Chinese online shopping sites. Both market observers and local media have questioned how much the loss of the patent would hurt its position as a leader in the global cushion compact market. The Korea Times' Park Jae-Hyuk wrote that Amoreapacfic's \"supremacy\" was \"at stake,\" as a growing number of consumers have complained about poor-quality products, many of which could be imitations. “In recent years we have seen many other brands introduce their own version of the cushion foundation. That means increased competition for Amorepacific, but it’s recognition that we are not just a brand that produces what’s already on the market. We are the ones who look for innovative ideas and [act as] a benchmark for others,” commented Rho. As for its patent, she said: “The lawsuit is not finished. It’s an ongoing battle.” The Next Big Cushion-Compact Idea Yet, as competition intensifies, some experts believe there are plenty of opportunities for the South Korean company. “One of Amorepacific’s key success factors has been its continuous focus on innovation, with the cushion being a great example. Within a few years, it expanded from a foundation to new formats, triggering a true global ‘cushion craze,’” said Jun Lee, senior beauty and personal care analyst at Mintel, also citing its sleeping masks and boosting essences. While K-beauty has typically been celebrated for its skincare offering, Lee said that the growth rate for colour cosmetics \"is much higher\" and \"there’s plenty of space for colour cosmetics to lead [Amorepacific’s] growth in the future.\" She advised that the firm would do well to develop its makeup range since the Korean cosmetics market is growing steadily. “We expect the facial care market to grow 3.5 percent in 2019, but sales of colour cosmetics are expected to grow 7.4 percent.” Ultimately, Rho believes that it will come down to developing the right products at the right time, because “trends in Korea change fast,” she said. “It’s a very dynamic market [but] one consistent trend we’ve observed is the demand for personalisation and customisation.” In addition to the launch of a new customised face mask — Amorepacific has developed a first-of-its-kind mask solution that features serums and ingredients personalised for every customer — the conglomerate also has new cosmetics products in the pipeline, such as an improved two-tone lipstick. Amorepacific's cushion compact product development | Source: Courtesy Amorepacific's cushion compact product development | Source: Courtesy Amorepacific's cushion compact product development | Source: Courtesy Since its release, some 3.7 million units of two-tone lipsticks have been sold worldwide. Following this success, Amorepacific is rolling out a two-tone lip bar, which it first launched through its brand Laneige at one of its flagship stores in Seoul late last year. Customers are able to create personalised dual-shade lipsticks in store by mixing and matching two colours out of 700 colour combinations with the guidance of beauty specialists. \"R&D and innovation is what Amorepacific has always been good at,\" said Lisa Hong, senior research analyst at Euromonitor. However, she warned that more innovation will also come from other Korean manufacturers. \"Yuhan Corp recently signed [a deal] with New Zealand deer milk provider Pamu to develop deer milk skincare in 2019,\" she said, adding that global competition from retailers like Sephora, which will launch in Seoul in the fourth quarter of 2019, remains fierce. Meanwhile, e-commerce, which accounts for only 7 percent of Amorepacific’s sales, is another key opportunity for growth. After all, the Korean market is one of the world’s most digitally savvy, with an incredible 99.2 percent internet penetration rate and the fastest internet speed in the world. Rho acknowledged that “the internet and new technology is transforming the beauty industry,” but \"successfully navigating this digital transformation is a challenge.\" Despite the beauty giant's various challenges, Liz Flora, editor of APAC research at Gartner L2, has faith in its ability to stave off the competition. “In terms of digital competence, Amorepacific brands are [already] the [leaders] in the Korean market among both major K-beauty and international brands,” she said, noting Amorepacific’s own direct-to-consumer e-commerce platform Apmall. “[Among its competitors] more than half of non-Korean brands rely on external online retailers that are less effective [than Amorepacific's].” IAJSN5NEUZAXLBXB3QERDIVLT4 Related Articles: [ Why International Beauty Brands Are Piling into South Korea  ] [ K-Beauty: From Fad to Fixture ] [ Can Halal Cosmetics Outgrow Their Niche? ] © 2023 The Business of Fashion. All rights reserved. For more information read our Terms & Conditions As strategics like Unilever and L’Oréal divest from once-core lines, a more selective approach to M&A is underway. Welcome to Haul of Fame, a weekly roundup of the biggest beauty moments of the week, why they matter … and why some of them might not, even though they sure are gorgeous. The platform’s freewheeling approach to e-commerce has opened the floodgates for established labels, grey-market sellers and influencers to entice beauty shoppers to buy. But with little oversight over fake product listings, brands must negotiate how much control they want to give over to the app. Gwyneth Paltrow’s lifestyle label is introducing an accessibly priced beauty line at Target and Amazon. The essential daily round-up of fashion news, analysis, and breaking news alerts. Our newsletters may include 3rd-party advertising, by subscribing you agree to the Terms and Conditions & Privacy Policy.   ",
    "datetime": null,
    "url": "https://www.businessoffashion.com/articles/beauty/secrets-of-amorepacific-south-koreas-biggest-beauty-brand/"
}