{
    "title": "This Korean Beauty Trick Will Make Your Skin Look Dewy | SELF",
    "text": "By Sarah Kinonen With Korean beauty moving to mainstream markets (like these new Target finds), it's safe to say K-beauty is making a major mark on the west. And now, the \"7 Skin Method,\" a multi-application toner technique, is the latest K-beauty craze to make waves on the Internet, and we predict it's only going to get bigger. What exactly is the 7 Skin Method, you ask? Well, to put it simply, it's the act of applying a toner or a lightweight, watery essence to your face up to seven times—hence, the name \"seven\"—right after you cleanse and before you moisturize, explains Young-Ji Park, the founder of Korean beauty skin-care brand Purpletale. Oh, and if you're wondering why it's called 7 \"Skin\" Method, in Korea, toners are commonly referred to as \"skins,\" meaning the literal translation for the 7 Skin Method is the \"7 Toner Method.\" Sounds easy enough, but what's the benefit of ditching your entire routine for just one product? \"Hydration, minus the extensive Korean skin-care routine,\" says Park. \"By layering your toner multiple times, your skin gets to absorb more of the hydrating ingredients, ultimately giving you hydrated and healthy skin.\" And putting the toner technique into practice is just as easy as it sounds. Before applying your moisturizer, pour a small splash of toner onto a cotton pad and rub it all over your face and neck. From there, while your skin is still slightly damp, pour the same amount of toner into the palm of your hands and pat it onto the skin. It's this last step that you continue with for up to five more times. But, Park warns, if you're hesitant to repeat for the full seven steps, you should start slow and build up to the full amount. \"Test the method by applying your toner two or three times and go from there,\" she advises. More K-beauty launches we love: While we can get behind almost anything (we said almost) in the innovative world of K-beauty, the thought of over-applying a product scares us a bit, so we tapped New York City-based dermatologist Joshua Zeichner for his expert insight on the trend. His take? The 7 Skin Method is totally safe for the skin as long as the toner (or essence) you're applying is alcohol-free, as toners and astringents made with alcohol can lead to dryness and irritation, he warns. Luckily, with K-beauty, the most recent crop of toners and essences already come alcohol-free and are filled with hydrating and brightening properties that \"give results as good as traditional moisturizers,\" says Zeichner. Bottom line: The 7 Skin Method is the real deal. Not only will it boost your skin's hydration, but it's also light on the wallet. \"It's like utilizing your wardrobe essentials for various occasions,\" says Park. Now that's a metaphor we can actually get behind. Now, find out how to treat dry, winter skin: Vote for your favorite makeup, skin, hair, and body products by February 20, 2017, and you'll be entered for chances to win one of four awesome beauty prizes! More from Allure: 10 Celebrity Hairstyles That Make You Look 10 Years Younger Find the Best Haircut for Your Face Shape The 9 Prettiest Date-Night Makeup Looks 7 Weird Tricks Stars Use for Looking Great in Photos SELF does not provide medical advice, diagnosis, or treatment. Any information published on this website or by this brand is not intended as a substitute for medical advice, and you should not take any action before consulting with a healthcare professional. More from Self Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. SELF may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "datetime": "2017-02-10T19:58:53.611Z",
    "url": "https://www.self.com/story/korean-beauty-hack-for-glowing-skin"
}