{
    "title": "This K-Beauty Frozen Cream From Vue De Pulang Is TikTok-Famous",
    "text": "It’s viral to the tune of 707.8k views. Rachel is a journalist, writer, and editor who specializes in the beauty and wellness industry, writing about the best, safest products the industry has to offer for InStyle, Byrdie, and Shape. We independently evaluate all recommended products and services. If you click on links we provide, we may receive compensation.\n Learn more. Korean beauty is to thank for countless skincare innovations. There are products with just plain good formulas, like EmRata's favorite hydrator and I Dew Care's brightening eye cream, and then there are ones that combine routine with entertainment, like Vue De Pulang's Frozen Cream moisturizer. According to shoppers, this next-generation cream gets results that are as breathtaking as its formulation. The undeniably fun formula is a clear gel cream that the brand recommends chilling to see transform into a shaved-ice texture. Videos of the metamorphosis and subsequent application have garnered over 707.8 thousand views on TikTok, where creators marvel at how refreshing the crystallized texture feels. But what's most impressive is that the moisturizer goes beyond spectacle and actually delivers results. One Amazon shopper says that in the space of a week, they saw the Frozen Cream \"working wonders\" on a deep wrinkle in their forehead. Another person with dry, mature skin says that the moisturizer keeps their skin smooth and dewy, and storing it in the freezer reduces their undereye puffiness as soon as it goes on — much like the old trick of keeping a spoon or eye masks in the fridge, but without the extra step. Shop now: $15 (Originally $27); amazon.com and beautyspy.com Even if you don't stick it in the fridge or freezer, shoppers still say the moisturizer becomes cool on your face, toning down irritation and creating \"something like heaven\" for redness and rosacea. Repeated use sees shoppers' skin fantastically hydrated and soft, the cooling sensation able to revive dull skin like a splash of water that long-term moisturizes. The fragrance-free formula supports those effects with an ingredient list that features redness-reducing niacinamide, hyaluronic acid, allantoin, and the saps from bamboo, birch, and white cedar, which the brand says supports elasticity and healing. Despite the sap, shoppers note it's not sticky in the slightest. Savants among us will order this and save it for the summer's humidity and sunburns, especially while the price is docked by 43 percent. ",
    "datetime": null,
    "url": "https://www.instyle.com/beauty/vue-de-pulang-frozen-cream-tiktok-amazon"
}