{
    "title": "This is how a Korean beauty product is actually made | Vogue India",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, visit My Profile, then View saved stories By Anjan Sachar If you're on the Korean beauty bandwagon and have been keeping up with the country's imports with baited breath, you've probably heard of Charlotte Cho. It's safe to say that Cho is responsible for the K-beauty wave in America, which has now made its way around the world (remember how excited BB creams got us?). She founded Sokoglam.com, one of the best sources of K-beauty in the West, with her husband in 2012, and frequently travels to Seoul to update herself with the latest developments in the beauty space. The famed 10-step Korean skincare routine is their most popular sale category. “People get really excited about starting the routine and then when they actually see results, it's very powerful,” says Cho. “The Korean skincare routine is so comprehensive, there's so many steps and an actual science behind why you use them. Your skin is hydrated, you see a reduction of fine lines and fading of acne scars, and you look healthier and younger.” An aesthetician, author, entrepreneur and most recently, product developer, Cho has enough hats in her bag for us to consider her advice as the ultimate on South Korean beauty. We got on a call with the expert to learn more about the industry and what goes behind creating a product. She cares about what you think Cho is the proud mother to three skincare products: the Manefit Green Tea Pore Care Moisturising Sheet Mask, Neogen Green Tea Cleansing Stick and the Cosrx Triple C Lightning Liquid, in that order. “They all took about a year to manufacture, conceptualise, create, test and then package,” says Cho. “The reason we decided to make these three products is because we saw what was popular on Soko Glam.” Cho's business philosophy is very consumer-driven. “We have a really unique site because all our customers and fans are very passionate about our products and write really in-depth reviews on our social media as well. They even ask us for recommendations on skincare or what they should get, so we know what people are looking for. Most beauty retailers are very large and people don't see them as a trusted authority on skincare.” She utilises her experiences in the best way possible When it comes to formulating products, she customises them based on her previous experiences. “Cleansing sticks are still a rare category, my favourite before Neogen was the SU:M37 Miracle Rose Cleansing Stick. It's still a very popular product on Soko Glam but I wished that a few things about the product could be changed. Hence, when Neogen asked me to produce a skincare product of my choice, I went with a cleansing stick. I wanted to make it low pH because the original one I loved was a little bit drying. I also wanted the product to help remove make-up better which is why I used more oils. We also added a little bit of fragrance so it would be an aromatherapy-type experience. We have rave reviews of the product and it's my favourite travel product as well.” By Hasina Jeelani By Prabal Sharma By Kejhal Kalra She loves the tried-and-tested method Contrary to what you'd believe, Cho prefers staying away from trendy products and ingredients and likes sticking to ingredients that have proven to be beneficial. “When it comes to formulation, I'm more for the tried-and-true ingredients. I know Korean beauty has a lot of innovative ingredients but I'm more focused on using something that has been around for a long time because I want people to see results. I'll always pick natural and established, well-studied ingredients as opposed to something that is trendy or fresh.” Plus, you know she's not serving up gimmicky products, because she actually tries them all. “The most interesting part of the product creation process was that it really does take a very long time to finalise formulation, because you want people to see results. It was very important for me to see results myself so every time we tweaked the formulation, I would have to reuse it for four-five weeks to see results.” She's in for the complete ride And no, it doesn't stop at creating the formula—she looks into everything from packaging to educating her audience about how to use the product and how to store it. “With skincare, how you store the product is just as important as the fragrance, texture and consistency. We went through several iterations of the type of packaging it [the vitamin C serum] is in because vitamin C is a very unstable ingredient. So we had to make sure the bottle was dark and that oxygen couldn't penetrate to the formula through the dropper. Pure vitamin C is not for your average skincare user, you've to keep it refrigerated and cool. A lot of education goes into creating these products that are so active; 20.5 per cent of vitamin concentrate, in this case. We believe we can share digital content through The Klog, videos and tutorials with FAQs to help people see the results. There is a changing dynamic with beauty and skincare, people are willing to research and learn more before they actually purchase and use a product.” She's keen to learn As always, she's on the lookout for ingredients and technologies that tickle her fancy. “I'm really interested in white truffle as an ingredient, it's very luxurious, rare and expensive but I've been seeing an emergence of white truffle used in a lot of skincare products. Neogen and Skinfood both have lines with white truffle, which I think is very exciting. They contain an enzyme called superoxide dismutase, which helps isolate free radicals, prevents them from damaging your skin and helps your skin maintain moisture.” What really sticks with you as a consumer is how a product feels on your skin; if it feels too sticky or too dry, you're not going to use it. “I believe that the textures and consistencies of products are going to become more and more developed. Facial oils are usually very heavy and used at night because it breaks up your make-up. Now, I'm seeing that even facial oils can transform into a light liquid so it still has the nourishing benefits of an oil but it's still very lightweight and absorbs very quickly to use in the day.” She makes sure you only get the best With thousands of options in the market, how do you really know what works? Cho's top tip: Look out for the ingredients. “I curate every single product at Sokoglam, I touch each of them, have an aesthetician background and I ask the brands for the percentages of the ingredients in each product. I test the products directly on myself, which is a big part of Soko Glam, and why people gravitate towards our site; everything is vetted. There are thousands of brands being born every year and not everyone has a commitment to the. For me, it's really about making sure the ingredients are solid and the packaging makes the product more efficient, easy to use, absorb, and an overall great experience. There's so many factors to why a product is your favourite and I'm here to pinpoint which are the best.” By Kejhal Kalra By Namrata Kedar By Hasina Jeelani By Neeti Mehra See more stories Condé Nast India © 2023 Condé Nast. All rights reserved. Use of this website constitutes acceptance of our Terms of Service and Policy and Cookie Statement. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. ",
    "datetime": "2017-04-19T18:39:32.000Z",
    "url": "https://www.vogue.in/content/this-is-how-a-korean-beauty-product-is-actually-made"
}