{
    "title": "This Is the $8 Mascara That Jason Wu Just Sent Down the Runway | Allure",
    "text": "By Sophia Panych When we left off last fashion week back in October, makeup artists were all about the lashes. We saw clumpy lashes, wispy lashes, graphic lashes, colorful lashes, you name it. And as we ease into the beginning of the fall 2016 shows, it seems like the trend continues. This morning, at Jason Wu, makeup artist Yadim created a superspidery lash look using a product that'll be available at drugstores very soon. The product in question is Maybelline The Colossal Spider Effect Mascara, and it hit shelves at the end of April. Inspired by the spidery lashes we saw on last season's runway, the product is literally made to give you thick, clumpy lashes without applying 6,000 coats of mascara (which if you like that effect, is awesome news). And while the brush was made to make lashes clump, Yadim had to do some troubleshooting backstage to bring the models' lashes to Man Ray–levels of spikiness. The makeup artist pulled out the stopper of the mascara tube—the plastic insert that siphons the pigment inside the tube onto the wand—so the wand was literally drenched in mascara. \"It gives them a vinyl effect and helps bunch the tips of the lashes together,\" said Yadim. \"It's definitely a more conceptual look—I call it beauty with distortion.\" I'd call it very cool, but maybe not very realistic for your every morning makeup routine. For the right occasion, spidery lashes actually look kind of sexy (a makeup artist tried it on me last season, and surprisingly, I really liked the effect), but I'd definitely suggest keeping your tube of mascara intact if you want to go for it—and invest in a good eye makeup remover. By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Jamie Ballard By Nicola Dall'Asen By Sarah Hoffmann By AnaMaria Glavan More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2016-02-12T14:30:00.000Z",
    "url": "https://www.allure.com/story/maybelline-colassal-spider-effect-mascara-jason-wu"
}