{
    "title": "This Easy 5-Step K-Beauty Routine Gives Me Major Glow | Glamour",
    "text": "By Maureen Choi Photography by Michelle Sulcov When I was 12, I walked into the kitchen to discover my mother gingerly scraping the goopy jelly from an aloe leaf she had just picked from the garden into a mason jar. She poured two cups of soju—a clear fermented-rice liquor from her native South Korea—over the top, followed by the juice and zest of a lemon. To give the ingredients time to mingle, it went into the fridge for a month, right next to her smorgasbord of homemade kimchi. When the liquid was ready, she strained it through a fine-mesh sieve until every trace of muck was gone. The secret sauce left behind: so le al (Mama Choi’s acronym for soju, lemon, and aloe), a DIY facial toner meant to brighten, tighten, and clarify her skin. She kept the concoction in a spray bottle and spritzed a mist all over her just-washed face every morning and night. Her routine was simple, cheap, and very effective, because that stunner is now in her late sixties and doesn’t look a day over 45. A few years later, when I started dealing with breakouts, she gave me my very own bottle, along with a soap made of pungent oriental herbs and ginseng-infused lotion. I’m embarrassed to say that, initially, I snubbed it all. Korean culture, food, and certainly its beauty secrets—homespun or manufactured—weren’t cool in the nineties, and so I dismissed my mother’s alchemist abilities and skin care know-how as weird and inferior. But when my teenage acne went next-level, I was despondent enough to think, What the hell—give me the stinky K-beauty stuff. And you know what? The ­regimen worked. I fell in love with her recommendations because they cleared up my skin (suck it, zits), but I also loved how they made me feel. The twice-daily ritual felt fancy and insanely confidence-boosting and, if I’m being honest, like a rite of passage—of both mastering good skin care governance and appreciating my cultural roots. The ancient beauty wisdom of my ancestors had been bestowed upon me, and I was hooked. Fast-forward nearly two decades and the rest of the world has reached peak K-beauty love too. I’m happy to be its number-one cheerleader. Snail slime? OK! Sheet masks on the daily? Into it! But there’s one major thing I do have beef with: the idea that you “need” to follow an excessive 12-plus-step routine to see results. Not true! In fact, streamlining your regimen, K-beauty or other­wise, can be beneficial. Because the great paradox of the multistep, mix-and-match approach to skin care is that while you can get the perfect-for-you routine, you could also overdo it and turn your skin into a real grouch (as in current mood: red, irritated, and irrationally sensitive). I love products, and I’m all for a little self-care moment. But you don’t need a shelfie full of stuff—or a ton of time—to make good skin a reality. To help you cut through all the K-confusion, here’s my no-B.S., tried-and-tested K-beauty course of action. Cleansing twice is the best way to ensure that every trace of gunk is removed. Dissolve makeup and pollutants first with a cleansing water like the one from Botanic Farm, then rinse at the sink with a cream cleanser, if you have normal to dry skin, or a gel formula, if you’re oily, to break up any dirt and oil still lurking. Once you’ve cleared the path, you’re ready to add a ridiculous amount (like seven freakin’ layers’ worth, two to three drops at a time) of hydrating toner or essence. I’m telling you, these thin layers of moisture are what make the biggest difference in your skin. Afraid it’s going to feel heavy? Nah, Korean toners are formulated to be super concentrated but surprisingly whisper-light, so doing the “seven-skin method” is the best way to drive in moisture without clogging pores. I like the AmorePacific Vintage Essence—it's pricey, but so hydrating. Pat in each layer to help maximize absorption. Choose a formula that targets the specific issues you need to treat (pores, lines, acne, dehydration) or an all-around winner like Peach & Lily's Glass Skin Serum. The patting technique you use for toner pays off big-time here too. This move's pretty self-explanatory; it’s what locks in all that dewy goodness you just applied. Bonus points if your cream or lotion has free-radical-fighting antioxidants like the ones in Glow Recipe's Watermelon Moisturizer. No self-respecting Korean woman skips this step, because there’s zero point in doing the moves above if you’re going to let UV damage eff it all up. Using a broad-spectrum physi­cal blocker like Neogen Day-Light Sun Screen SPF 50 daily can stop a host of concerns (hyperpigmentation, wrinkles, even skin cancer) in their tracks. Steadfastly do these five things every day, and there’s no way you won’t get better skin. True story. By Kristin Granero By Deanna Pai By Dana Leigh Smith By Andrea Navarro More from Glamour See More Stories © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Glamour may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices ",
    "datetime": "2018-09-21T15:05:00.000Z",
    "url": "https://www.glamour.com/gallery/this-5-step-korean-beauty-routine-changed-my-skin"
}