{
    "title": "Tom Ford gets scientific about skincare – and keeps it sexy with luxury ingredients | South China Morning Post",
    "text": "Tom Ford Beauty has joined the likes of Armani, Chanel and Dior. The fashion brand launched its first skincare line for both men and women, accomplished through advanced scientific research and clinical testing at its personal incubator, Tom Ford Research. The two skincare items – Tom Ford Research Crème Concentrate (50ml; US$450) and Tom Ford Research Serum Concentrate (20ml; US$360) – feature strong concentrations of three key ingredients: white porcelain cacao, caffeine and gyokuro. “My vision is to merge breakthrough skin science with true luxury, to create transformative skincare regardless of skin type or gender,” says the eponymous luxury brand founder Tom Ford. Working closely with the scientific team, the incubator found that caffeine was shown to increase the skin’s natural energy, hydration and brightness. In particular, sodium ions naturally found on the skin’s surface to bring in hydration and moisture experienced accelerated movement with caffeine compounds. The rare white porcelain cacao, which comprises 0.5 per cent of cacao production, offers complementary benefits of caffeine. Gyokuro, a highly prized variety of green tea, is said to soothe the skin and provide protection from antioxidants. In addition to these three key ingredients, the Tom Ford Research Crème Concentrate features algae extract and peptides to reduce wrinkles and fine lines, and hyaluronic acid to give the skin deep hydration. The Serum Concentrate also contains glycolic and lactic acid to deliver visibly smoother skin. Want more stories like this? Sign up  here. Follow STYLE on  Facebook,  Instagram,  YouTube and  Twitter Tom Ford Beauty’s first skincare line for men and women – Serum Concentrate and Crème Concentrate – features caffeine in both products, derived from gyokuro, and white porcelain cacao ",
    "datetime": "2019-08-20T11:00:10+08:00",
    "url": "https://www.scmp.com/magazines/style/news-trends/article/3023424/tom-ford-gets-scientific-about-skincare-and-keeps-it"
}