{
    "title": "Top beauty trends spotted at Cosmoprof Asia Digital Week 2021 - Premium Beauty News",
    "text": "With rigid beauty stereotypes still the norm in many Asian societies, anti-ageing cosmetics are traditionally a large and important market in the APAC region. In countries such as China, for example, anti-ageing buyers are getting increasingly younger and even women in their early 20s are starting to purchase beauty products that promise to guard against signs of early ageing. At CADW, many of the face care products had a distinct high-tech or medical vibe. Japanese manufacturer Alen International introduced Skin Scientist AI, described as an anti-ageing serum formulated with “smart” capsules of ingredients that recognise damaged areas in the skin barrier and deliver the specific actives that are needed. Malaysia’s Sky Resources presented the Age Halt Needle-Free Serum which contains Neodermyl complex and hyaluronic acid. And Changzhou Weibo Hi-Tech Biotechnology from China specialises in freeze-dried functional cosmetics. The brand’s Centella Repairing Freeze-Dried Mask is a sheet mask “activated” with water which turns the active ingredient into a rich, thick essence. The global microbiome skin care trend was also visible at the show, especially amongst Korean exhibitors. Product launches highlighted calming and microbiome-strengthening ingredients like ferments and probiotics. K-beauty brand Reinplatz’s Calming Sensitive Serum contains centella asiatica and saccharomyces ferment to strengthen the skin’s barrier while Aqua Derma Cream in Korean microbiome researcher Bifido’s Bifidolab face care range combines probiotics with hyaluronic acid to strengthen the microbiome. And fellow Korean Biomeek’s Sensimetic Soothing Toner contains a special barrier complex and hyaluronic acid to deeply hydrate sensitive skin. While international skin and body care labels are, of course, still popular in APAC there has been a distinct rise in domestically-manufactured cosmetics brands across many of the major regional markets. Local pride is ruling supreme in a number of Asian countries. In China, the recent popularity of local beauty products rose on the back of the guochao trend [Chinese retro trendy] which, in turn, has been fuelled by the current surge in patriotism amongst the younger generation. Hanbang beauty [based on traditional Korean medicine] has been popular in Korea for decades whilst Japanese consumers are traditionally deeply appreciative of regionally specific beauty or food ingredients. However, the price-performance ratio also plays a crucial role in some APAC markets. In the developing economy of Indonesia, for example, domestic beauty has also grown since the pandemic began but here the cheaper price tag (when compared to imported brands) is playing an important role. At CADW many of the Asian exhibitors presented products with specific regional ingredients. Japanese beauty brand Edobio, for example, recently launched the Saketernal Hydration Serum which contains lactobacillic fermented sake lees and sweet potato root extract. Korean manufacturer Roots Base face care line-up is formulated with ingredients traditionally used in Korean medicine. The Roots Base Hydrating Essence Toner includes poria cocos, a medicinal mushroom that grows amongst the roots of pine trees. Fellow K-beauty label Accoje’s products are based on ingredients sourced from Korea’s famed Jeju island. The brand’s Dust Block Finisher is an anti-pollution moisturizer formulated with Jeju pine leaf extract and Jeju green tea. Another product category that made a strong appearance at CADW was personal fragrance. Traditionally perfumes are not a big market in APAC and up until a few years ago, the Asian fragrance sector was dominated by the classic international mainstream fragrances. Then niche fragrances appeared on the scene – in China, for example, demand for indie fragrances went quickly through the roof – and now a clutch of new Asian fragrance houses is shaping the domestic fragrance markets, especially amongst GenZ consumers. Subtler fragrance options like solid and cream fragrances are a popular format in Asia judging by the number of domestic fragrance houses presenting these types of products at the show. Korean newcomer brand Come Inside Me, for example, offers several cream perfumes packaged in tubes, while Japanese fragrance house Sholayered top sellers include their Crème de Parfum and Crème de Cologne. The brand has also just launched a Non-Alcoholic Perfume Spray said to be particularly suitable for customers who want to avoid alcohol or don’t usually wear strong perfumes. Fragrance is also increasingly associated with well-being and mental health in Asia, with aromatherapy-influenced fragrance products very visible at Cosmoprof Asia Digital Week. This trend is, of course, directly related to the effects of the on-going pandemic, correlating to the global surge in popularity of personal care products promising relaxing, calming or sleep-enhancing benefits. Korean fragrance brand I Gentleman for Homme showed its two new scented sprays for fabrics based on the brand’s iconic men fragrances. Scented aromatherapy mask sprays are also popular pandemic launches – Sholayered recently brought out a mint-scented fabric mask spray. Japanese exhibitor Edobio launched Aroma Floreeze Spray, which is formulated with lactic acid, green tea extract and lavender. Korean fragrance start-up Deepscent presented its Arom Official “aroma styler”, a smart fragrance device that is filled with scent capsules and can then be programmed with the user’s favourite fragrance blends. The latest Arom Official launch is a range of curated scent travel sets which take customers on an olfactory journey to nine international destinations, including the Korean island of Jeju, the French city of Grasse, Sapporo in Japan, the Maldives, Los Angeles and Seattle. The next Cosmoprof/Cosmopack Asia trade fair is set to take place in Hong Kong from 17th to 19th November 2022 (hopefully), celebrating the 25th anniversary of Asia’s leading trade show. The annual premium and luxury packaging trade show broke its attendance record for its 2023 edition, which was held... The expression “Beauty Tech & Skincare” now marks the entry of tech into the beauty sector. Several major brands offer to decode the... The quest for youth has existed for centuries, despite the inevitable effects of time on the body. Research shows that skin aging in... The quest for “in-and-out” beauty is gradually gaining ground in Europe, North America, and Brazil. This form of holistic beauty is meant... © 2023 Premium Beauty Media ",
    "datetime": null,
    "url": "https://www.premiumbeautynews.com/en/top-beauty-trends-spotted-at,19553"
}