{
    "title": "Toronto condo parking spaces can fetch $60K",
    "text": "  The resale market for parking spots and condos is steady with some ranging in price up to $60,000. Still, there are a few wrinkles in selling a spot. The resale market for parking spots and condos is steady with some ranging in price up to $60,000. Still, there are a few wrinkles in selling a spot. This article is over a year old, and the information within may be out of date. A parking spot can add $50,000 the price of a con suite. With parking a hot commodity for downtown residents who drive, condo owners are taking advantage of the demand and selling their parking spaces. A spot that was purchased for $18,000 about 15 years ago, for example, was recently sold by its owner for $38,000.  Still, that was a bargain compared to prices that begin at $55,000 — and generate bidding wars — for parking spots in newly built downtown condominiums. Most buildings have fewer parking spaces than condo suites, and many have no visitor parking at all. Yet even at $40,000 to $60,000, Toronto condo dwellers are still in a sweet spot. In cities such as London, England and New York, parking spots for multi-million-dollar condo units can run up to a cool one million dollars. In Singapore, one luxury builder has installed a parking elevator to bring owners’ cars to their units where they are off-loaded into a special ensuite parking bay. A home with a two-bay parking garage is $7.7 million. In Toronto, the resale market for parking spots and condos remains steady with MLS for early March showing some 23 parking spots ranging up to $60,000 and also three lockers for sale with prices from $4,000 to $6,000. Still, there are a few wrinkles in selling a spot or a locker. First, read your condominium declaration, says Lorne Shapiro of Basman Smith LLP , a real estate lawyer who works with developers. “It’s the bible and it will spell out what you can and cannot do,” he said. While some older condo corporations may not have anticipated sales of parking spots and storage lockers, most declarations allow sale only to another owner in the building, Shapiro said. And there are reasons why: mainly security. Assuming it’s permitted, selling a parking spot or locker is the same as selling title to your condo, he said. “The residential unit, parking spot and locker are all titled and numbered separately so there are no issues with title,” he said. “And you have to pay the maintenance fees on them.” You also might want to read over your mortgage documents if you’re thinking about “flipping” a parking spot or locker soon after purchase, warns Robert Wong, a real estate broker with Keller Williams Realty . In fact, it’s a good idea to check with your mortgage period. “If you’ve got a mortgage then the locker or parking spot will likely be included in the value of you condominium,” he said. “If you sell the parking spot or locker, you have changed the value of the property and there could be a problem.” With more downtown condos going up with fewer parking spots — the 42-storey project at the old Royal Canadian Military Institute on University Ave. near Dundas St., will have none at all — the price for those suites that do have spots, and the resale market for parking spaces, are both escalating. Politics has also raised its head in the condo parking issue. The city of Toronto usually demands .67 to .75 parking spaces per unit for most condos and up to 1.1 in some outlying areas but will waive that ratio depending on location. Homeowners in the Woodbine Ave. and Queen St. E. area in the Beach were recently incensed when they learned a 70-unit condo planned for the neighbourhood would have only 65 spaces — actually more than the requirement. The residents fear an overflow of cars will flood their streets and force those homeowners with street parking further from their regular spots. Of course, getting a parking spot with a condo all depends on location, location, location. Buyers in the suburbs usually expect parking included the deal, along with a locker, because transit isn’t always close, fast or convenient depending on where they work. Singles, young couples and empty nesters who buy within the city’s core for the lifestyle, however, aren’t usually interested in parking spots said Jim Ritchie, Tridel’s senior vice president of sales and marketing. Those residents don’t rely on cars and instead use streetcars, subways, bicycles and even shared rides such as ZipCar or AutoShare when they need wheels, he said. “A car is more important as you move away from the core,” said Ritchie, explaining the demand curve for parking. “Cars are expensive,” said Debbie Cosic, of In2ition Realty who specializes in marketing and selling new home developments. “Parking spots can add $50,000 to the cost of buying a condo, that’s another $240 a month in mortgage payments. Then’s there $300 a month for the car, $100 a month at least for insurance, gas. That’s nearly $1,000 a month for something you don’t need every day.” Developers are increasingly reluctant to offer parking, she said. Because the cost of land continues to climb, they have to go higher to create enough units to pay back their investment costs. This, in turn, means developments with small footprints must go deeper to create multi-level parking floors. “You’d think the cost would go down as they went down but it’s the opposite, the costs increase the deeper you go to build more parking levels,” Cosic said, adding the extras can also be bargaining chips to make or break a sale. “In the 905 and outside, if they’re having trouble selling they throw in parking spots and lockers to drive sales.” Wong agrees. “It does depend on where you want to buy,” he said. “Typically now, the new condos downtown are selling parking spots and lockers separately. But if you go out a bit, say Parklawn Rd. and Lake Shore Blvd., they might offer to throw one in.” Even lockers are add-ins to a deal, Wong said, and can be sold off — more likely so because some of the lockers in new buildings are cramped and there is not always a ratio of one locker for each unit. The mix of units in a development will also dictate parking, Cosic said, noting those buying a two-bedroom unit and planning a family will likely end up getting car. They may anticipate that when they buy, even if they don’t initially need parking. Meanwhile, buyers of small, entry-level units downtown won’t make parking a priority. Lockers, too, are becoming premium items as condo spaces get tighter, she said. Most start at around $2,500 and go to $7,500, depending on size and location. Lockers in luxury buildings can hit $10,000. “There are some lockers we’ve put in a project on the same floor — like a pantry — which are really cool,” Cosic said. “They’re in the nooks and crannies left after the mechanicals, like the plumbing and electrical, are run. Others are part of the parking space which people like, as well.” Anyone can read Conversations, but to contribute, you should be a registered Torstar account holder. If you do not yet have a Torstar account, you can create one now (it is free). To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation Save $85 with our best offer. Cancel Anytime. It means the world to us that you choose to read our brand of trusted news. And as long as you continue to do so, we’ll continue to show you we appreciate it. Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:       Sign up with  Thank you . Your account has been registered, and you are now logged in. Check your email for details. Invalid password or account does not exist Sign in with Submitting this form below will send a message to your email with a link to change your password. An email message containing instructions on how to reset your password has been sent to the email address listed on your account. No promotional rates found.    Secure & Encrypted Secure transaction.\nSecure transaction. Cancel anytime.  Thank you. Your gift purchase was successful!\nYour purchase was successful, and you are now logged in. You will also start receiving the Star’s free morning newsletter, First Up, soon. A receipt was sent to your email. ",
    "datetime": null,
    "url": "https://www.thestar.com/life/home-and-garden/toronto-condo-parking-spaces-can-fetch-60k/article_5a766968-c8d3-56ea-89d3-e8a0e34ea8f0.html"
}