{
    "title": "Trade show shines spotlight on Korean, Chinese and Japanese beauty | CTV News ",
    "text": "FOLLOW ON Advertisement MakeUp In Seoul will examine beauty trends in Korean, Japanese and Chinese markets. (btrenkel/Istock.com) The cosmetics industry is once again turning its attention to the beauty mecca of South Korea this week, as the trade show MakeUp In Seoul opens its doors for the third time. The main focus, of course, will be on the hottest new developments to come out of Korea, whose K-beauty concept has reached cult status over the past year in Europe and North America. The show's program includes a conference on the new beauty concept of the \"Seoulista,\" led by Division Director of cosmetics company HERA, Lee Eun-im. There will also be a talk led by Mrs Lan Vu, Founder and CEO of BeautyStreams, looking at the considerable influence of South Korea on the US market, in terms of consumer habits such as skin care and color cosmetics, and what Korean brands can do to harness the current trend for all things K-beauty. But Korea isn't the only nation making headlines at the moment, and the show will also focus on the booming beauty business in neighboring China and Japan. Things will kick off with a conference titled \"After skin care, this is the time for color cosmetics in China,\" led by Caroline Moulin, CEO of Nao Design Trends. The talks will also look at how Korean classics like BB cream and cushion foundation can be adapted to the growing Chinese market, in addition to examining the Chinese trends of the future. \"What's hot in Japan?\" is the title of a conference set to look at how Japanese makeup is evolving to meet the skincare needs of different generations of women, with participants including Tatsuno Meg, International Marketing Director at Shu Uemura and Mayumi Satoshi of the Cosmetics Information Development Group at Shiseido. The MakeUp In trade show has become one of the pivotal events in the beauty calendar, with shows in Seoul, New York, Paris and Sao Paulo. MakeUp In Seoul will run April 6-7. Advertisement Use of this Website assumes acceptance of Terms & Conditions and Privacy Policy | Accessibility © 2023All rights reserved. Back to top ",
    "datetime": "2016-04-03T09:03:40-04:00",
    "url": "https://www.ctvnews.ca/lifestyle/trade-show-shines-spotlight-on-korean-chinese-and-japanese-beauty-1.2843282?cache="
}