{
    "title": "Transgender Model Andreja Pejic Just Made History in the Beauty World",
    "text": "A big week in the transgender community just got bigger: Days after Caitlyn Jenner's debut, model Andreja Pejić has made history in the beauty world as the first transgender female model to front a major cosmetics campaign, according to WWD. Pejić is the face of Make Up For Ever's latest Be Bold campaign, along with actress Jamie Chung. The images were unveiled in a brief video: Pejić, who has walked top men's and women's runways for the last decade, just completed her gender reassignment surgery last year. \"It's a dream to have a cosmetics contract as my first major campaign as a female model,\" Pejić told the outlet. \"Being bold is about freedom. It's hard for anyone to grow up and not be afraid of what others think. Makeup helps me express myself, and I've used it in varying ways throughout my life. I have strived to live life on my own terms, to never have to hide and to never have to feel shame about who I am. I can be proud of that and I'm equally proud to share that message through this Make Up For Ever campaign.\" The ads will start appearing July 16 in Sephora stores. Alyssa Bailey is the senior news and strategy editor at ELLE.com, where she oversees coverage of celebrities and royals (particularly Meghan Markle and Kate Middleton). She previously held positions at InStyle and Cosmopolitan. When she's not working, she loves running around Central Park, making people take #ootd pics of her, and exploring New York City. 13 Best Japanese Skin Care Products to Shop Amazon Is Having a Major Beauty Sale Right Now Why Matrix Could Be the Next Best Skin Treatment Claudia Sulewski Launches CYKLAR First Class Beauty 2023 The 14 Best Expert-Approved Setting Sprays Austin Butler Doesn’t Think He’s a Beauty Icon Jelly Nails Are Back and Better Than Ever The Best Spring 2024 Beauty Trends to Try Now Add These K-Beauty Prime Day Deals to Your Cart The 20 Best Pore Minimizers for Baby-Smooth Skin Laneige’s Lip Sleeping Mask is on Sale Again A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2015-06-04T20:47:10Z",
    "url": "https://www.elle.com/beauty/makeup-skin-care/news/a28717/andreja-pejic-makeup-for-ever-campaign/"
}