{
    "title": "Trendmaker wants to bring Korean tourism to the forefront with its K-Beauty brand Dinto - KoreaTechDesk | Korean Startup and Technology News",
    "text": "KoreaTechDesk | Korean Startup and Technology News Thu, October 26, 2023 Sign in Trendmaker's K-Beauty brand Dinto is getting global consumers. K-Beauty brands and products have a vast customer base worldwide. It has brought the superior quality of Korean beauty products much interest and based on it, Korean startup Trendmaker wants to expand to encourage tourism led by K-beauty. Trendmaker wants to combine the richness of K-Beauty brands with tourism in a unique endeavour. Its product Dinto is drawing attention from the market as an innovative K-beauty brand. Upon its launch in February, TrendMaker signed an exclusive contract in Japan and has entered try into Olive Young, a large domestic drugstore, drawing keen attention from consumers. TrendMaker plans to expand to the K-beauty tourism market by recommending tourist attractions with the flagship store. Dinto is a vegan brand inspired by Korean colours and ingredients. The products’ formula has Korea’s vegetable mucin (Yam in Angdong) and vegetable collagen (white wood mushroom in Jinju) as the main ingredients. Korean artist Uncho Kim Bin Yung inspires its primary collection. Trendmaker’s travel diary introduces 69 Korean tourist attractions presented by 23 Korean literature artists for its various products. Dinto’s products are already popular in Korea’s online and offline stores. The introduction of Dinto to offline stores like Olive Young and Isetan in Japan, has helped the company take a step towards bringing the K-beauty brand to the world. Trendmaker wants to open more overseas avenues for Dinto, with its unique tourism descriptions. It intends to engage influencers, has pop-up stores, and invests in branding and marketing strategies. Also Read,  Subscribe and be informed first hand about actual Korean startup news. All the day’s headlines and highlights, direct to you every morning. Subscribe and be informed first hand about actual Korean startup news. All the day’s headlines and highlights, direct to you every morning. © 2023 Koreantech News & Media Korea Zrt. All rights reserved. You can see how this popup was set up in our step-by-step guide: https://wppopupmaker.com/guides/auto-opening-announcement-popups/ You can see how this popup was set up in our step-by-step guide: https://wppopupmaker.com/guides/auto-opening-announcement-popups/ dgdfgfdgdf Enter the destination URL Or link to existing content ",
    "datetime": "2022-09-05T15:25:56+00:00",
    "url": "https://www.koreatechdesk.com/trendmaker-wants-to-bring-korean-tourism-to-the-forefront-with-its-k-beauty-brand-dinto/"
}