{
    "title": "Trend Alert: Cloud Skin From K-Beauty For The Ultimate Skin Glow",
    "text": "Cloud skin is what everybody is taking about Asia is home to some of the finest beauty trends. From Chinese wisdom using rice water for hair care to Korean sheet masks taking over skin care, there's always something new happening from this side of the world. And that continues with the brand new K-beauty makeup trend on the block which is called cloud skin. As you probably know, Korean beauty focuses a great deal on skin texture and finish. After the likes of K-beauty trends like glass skin and dolphin skin, this one too is on similar lines. You're bound to be asking yourself what exactly is the cloud skin beauty trend. Well, you've come to the right place. Visualise the sun shining on a cloudy day. While its rays do penetrate through the fluffy clouds, they have a soft and hazy look to them. That is the inspiration behind the cloud skin K-beauty trend which is the brain child of makeup artist Dominic Skinner. (Also Read: From Clearing Blemishes To Hydrating Skin, These K-Beauty Serums Can Do All That)        ADVERTISEMENT The only similarity between the various popular K-beauty trends is that they prioritize the skin. Glass and dolphin skin trends are all about making skin luminous and shiny; the brighter, the better. But not cloud skin. In fact, it takes the opposite route for makeup products applied to look radiant from within instead. From the outside, skin has a soft focus, almost blurred-like appearance. A post shared by Nina Park (@ninapark) The best part is cloud skin is actually incredibly easy to try and perfect if you've grown weary of luminous makeup and possibly even run out of highlighter. Follow these beauty tips to get the cloud skin makeup look. Use a dewy makeup primer and foundation to give your skin radiance right from step one without making it look shiny. Mix a few drops of liquid highlighter with your foundation and then apply for a luminous look which is natural and not at all excessive. Do not apply any other form of highlighter post this step. Choose cream products and tints to further enhance the naturally radiant makeup look that is fresh, bright and seamless. Disclaimer: The Swirlster Picks team writes about stuff we think you'll like. Swirlster has affiliate partnerships, so we get a share of the revenue from your purchase. (Also Read: Korean Home Remedies And K-Beauty Tips To Get Dewy, Glass Skin At Home) Best Moisturisers For Dry And Patchy Skin With Shimmery Eyeshadow And Radiant Skin, Malaika Arora's Apsara Avatar Is The Epitome Of Ethnic Glam Esha Gupta's Brown Hued 90s Glam With A Tousled Updo Makes For A Fabulous Throwback Aamir Khan's Son Junaid Khan's Stunning Long Hair Proves He Is \"Ready For Cameras\" And He's Not The Only One ",
    "datetime": null,
    "url": "https://swirlster.ndtv.com/beauty/trend-alert-cloud-skin-from-k-beauty-for-the-ultimate-skin-glow-2389364"
}