{
    "title": "Trouble Maker Becomes K-Pop’s Bonnie & Clyde in Lana Del Rey-Esque ‘Now’ Video – Billboard",
    "text": "K-pop stars 4minute's HyunA (of \"Gangnam Style\" fame) and Beast's Hyunseung play troubled lovers in a R-rated music video for \"Now\" as the Trouble Maker duo. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin Those familiar with K-pop music videos and hoping to find a glossy, colorful, sugary-sweet visual from Trouble Maker — the duo project of 4minute rapper/”Gangnam Style” star HyunA and Beast vocalist Hyunseung — may be disappointed with “Now.” The video for the duo’s latest single appears to be heavily influenced by a modern-day, badass Bonnie and Clyde storyline that pop fans have come to expect from an artist like Lana Del Rey or Rihanna. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t10/28/2013\t\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tExplore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news Trouble Maker push and slap each other one minute and the next engage in a drunken makeout session in their car in the visual. It has already given South Korea’s “19+” rating, labeling it as only appropriate for those older than 19 — the equivalent of Rated R in America.  Despite the warning, the video has received more than 3.6 million views a day after its Oct. 27 reveal.  “Now” shows the two K-pop idols engaging in very un-idol-like behavior: smoking cigarettes, drinking beer, there’s even an implied threesome with Hyunseung. Still, it’s the type of shock tactics that American pop fans have become indifferent to. Trouble Maker’s “Now” feels like a concentrated effort to get Western attention. There is loads of imagery familiar to American audiences from Budweiser and Heineken beer bottles to a scene where Hyunseung sports the Joker makeup Heath Ledger donned in “The Dark Knight” film. While HyunA looks completely different than she did in the “Gangnam Style” or  “Oppa Is Just My Style” videos (with 1.8 billion and 423 million views respectively), her sex appeal is upped with revealing clothing along with an edgy, blonde hairdo. Earlier this year, HyunA told Billboard that “positive ideas are being discussed” for a proper U.S. debut for the 21-year-old. While “Now” is sure to shake up the K-Pop Hot 100 these coming weeks, this Trouble Maker promotion feels like a well-calculated step to help garner more attention for HyunA to break into the Western mainstream — while her labelmate Hyunseung reaps the benefits, putting him and Beast in better position for pop penetration. Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2013-10-28T23:50:29+00:00",
    "url": "https://www.billboard.com/music/music-news/trouble-maker-becomes-k-pops-bonnie-clyde-in-lana-del-rey-esque-now-5770632/"
}