{
    "title": "Trump agency stiffed Jamaican model out of $200K: suit",
    "text": "Submit Δ Thanks for contacting us. We've received your submission. A Jamaican-born beauty is accusing Donald Trump’s modeling agency of breaking federal immigration laws and stiffing her out of more than $200,000 in salary – by docking wages for dermatologist bills, walking lessons, limo rides and other “required” expenses. Alexia Palmer, 21, of St. Albans, Queens, slapped Trump Model Management, its president Corinne Nicolas and other company honchos with a class-action lawsuit Thursday in Manhattan federal court accusing the modeling giant of racketeering, breach of contract, mail fraud and violating wage laws for immigrants. The suit seeks back pay and other money damages on behalf of Palmer and, potentially, other models. The stunning 5-foot 10-inch Palmer – who has posed for Chanel, Teen Vogue and other top clients – claims in the suit that Trump’s company lied to the federal government by documenting on her work-visa application that she’d be paid a yearly $75,000 salary while living in the United States. Instead, Palmer worked exclusively for Trump from 2011 through 2013 and only received a total of $3,880 in pay over the three years after the agency deducted a 20 percent handling fee and various “insignificant expenses,” the suit says. “[Palmer] was … charged for postage and makeup kits [and] was sent to a dermatologist upon the defendants’ recommendation,” the suit says. “She was asked to take walking lessons, constantly supplied with numerous unnecessary cosmetics kits, and made to take expensive limousines, all at [her] expense,” the suit says. Palmer claims she only moved to the US after being promised a guaranteed salary. Her lawyer, Naresh Gehi, told The Post, the model’s rights were “miserably violated.” “My client should be paid what she was promised,” said Gehi. But Trump Organization EVP and general counsel Alan Garten called Palmer’s claims “frivolous and bogus.” He said the expense deductions are “standard” and that the $75,000 figure was an “estimate” — and not part of any binding employment contract. “We’re a modeling agency – not an employment agency – so had she been more successful as a model, she would have made more money,” Garten said. Palmer was reportedly discovered as a high school teen in 2010 when she placed second in Liverpool-based modeling titan Pulse’s 2010 “Caribbean Model Search.” Her images were soon featured throughout London promoting top cosmetic lines, and she scored a shoot for Teen Vogue with members of the cast of the TV hit “Glee.” Founded by The Donald in 1999, Trump Model Management is among Manhattan’s elite modeling agencies. It’s stable of current and former A-list models include Carol Alt, Kim Alexis and former Miss Universe and Miss USA Olivia Culpo. Trump is not individually named as a defendant in the suit. ",
    "datetime": "2014-10-18T04:34:35+00:00",
    "url": "https://nypost.com/2014/10/18/trump-agency-stiffed-jamaican-model-out-of-200k-suit/"
}