{
    "title": "TWICE Share Skin-Care Secrets and Growth as a K-Pop Group —  Interview | Allure",
    "text": "By Devon Abelman Although our May 2020 issue features Jihyo, of Korean girl group TWICE, on the cover, she is one of nine members. All stopped by the photo studio to not only try out vibrant makeup and nail art but also chat with me. I had 20 minutes with Nayeon, Jeongyeon, Momo, Sana, Mina, Dahyun, Chaeyoung, and Tzuyu, one after another, like someone's dream version of speed dating. Each briefly brought me into their individual parcels of the sparkly TWICE world they've occupied since debuting in 2015. As a group, they've achieved worldwide success over the past five years — most recently, partnering with American record label Republic Records, and soon, launching a YouTube Originals series — so these rare, one-on-one glimpses into their individual paths to this point felt particularly special. (Pun intended.) First, I meet Mina. Her demeanor may seem demure, but the thoughts she shares with me are as bold as the mesmerizing star-shaped glitter sprinkled around her eyes. \"Even though we work, we sing and perform as one group, we are different individuals with different characters,\" she reveals, setting the tone for the rest of the interviews. Chaeyoung, follows. As she tells me about all the ways she seeks out ways to express herself and escape boredom — namely drawing and vintage shopping — I notice the one thing she doesn't bring up: tattoos. Colorful ink decorates the 20-year-olds fingers and arms. She's also known for having equally as bright hair. (At the moment, her ends are electric teal.) I ask Chaeyoung if she gets bored easily. \"Oh yeah, totally,\" she remarks. Momo sits down with me next, dressed in an oversized, red Budweiser sweatshirt. The dancer, who also hails from Japan, surprised me when she told me she looks to YouTube for skin-care advice. (Relatable.) Don't worry, I'll share her findings soon enough. The cozy vibe continued with Dahyun. She arrived in a hoodie and plaid pajama pants. Don't let her constantly changing rainbow hair fool you, this is her ultimate aesthetic. Whenever she can, Dahyun answers in English and with a beaming smile. Like many of the other members, she lovingly called her hairstylists and makeup artists her unnies (or big sisters, in Korean), showing me just how close of a relationship the girls have with their glam team. Nayeon is dreaming of a girl crush concept, I gather during our time together. For those unfamiliar, \"girl crush\" is the name given to looks in the K-pop world that are on the more mature, edgier side. TWICE is known for veering toward cuter, more unapologetically feminine styles. Think Britney Spears' \"Toxic\" versus \"...Baby One More Time.\" Jeongyeon, on the other hand, seems averse to the overall concept of makeup. Although most of the members seem experimental with their eye makeup choices, the vocalist is wearier about trying new things. Instead, she'd rather go onstage bare face. I swear I can see my reflection in the apples of her poreless cheeks, so I don't blame her. After having the dreamiest pink hair I've ever seen for TWICE's \"Feel Special\" music video, Sana tells me she's toning things down these days. The Japanese vocalist's auburn lob is giving her a calmer vibe, she says, but she's as bubbly as ever. My day with TWICE wraps up with the youngest member, Tzuyu. It's past 9 p.m., but her cheerfulness is keeping the energy up. Hailing from Tainan, the 20-year-old recalls how she's flourished since moving to Korea and debuting with TWICE. \"My personality has changed,\" she notes. \"I used to be very shy, but I express myself more than ever before.\" The other members also shared how TWICE has transformed them over the past five years, as well as their go-to skin-care tips and definitions of beauty. Nayeon: \"Living with eight other people teaches you what to give up and what to take from others, and you have to appreciate each other.\" Momo: \"Before I came to Korea, my family worried about me because I came here when I was very young. But now, I never regret it. I really enjoy it. I like the food here.\" Sana: \"I receive a lot of love from our fans, so I learned how to take back that love to people who love me. Most of all, I also learned how to take care of myself and love myself.\" Mina: \"Since we lived together for a long time, we can read each other's emotions without just speaking to each other.\" Chaeyoung: \"I know how to yield now. Sometimes, you need to step back.\" Tzuyu: \"My personality has changed ever since I came to Korea. I used to be very shy, but I express myself more than ever before.\" Momo: \"I take it as a new challenge every time, but I really enjoy it at the same time.\" Sana: \"With all the glitter and colorful makeup, I feel like a more eccentric Sana.\" Mina: \"I'm very happy that I don’t have to stay on just one look. I love trying different things all the time. [Growing up,] I guess I was the same way. Sometimes, I had bangs. I had short hair, long hair.\" Chaeyoung: \"Well, when we are in concert, we try really flashy and vibrant colors, but when I'm not on stage, I only put on lipstick. Right now, I'm very into nudes.\" Nayeon: \"Because I always try natural looks, I want to try something very strong, bold, and provocative — something bad girl, kind of.\" Jeongyeon to Nayeon: \"Black lipstick?\" Nayeon: \"Black lipstick is too much, but something provocative. I want to look bad because I always look really nice.\" Mina: \"I often give my opinion. When I find something colorful or beautiful that I want to try, I tell them about it. Right now, I'm interested in brow shapes, and I want to draw my eyeliner a little bit higher at the ends.\" Mina: \"I describe myself as a style chameleon. I try different looks and styles depending on my mood.\" Dahyun: \"When I'm not on stage, I always try to wear something comfy because I have to wear very tight [clothes] every time I'm on stage. I'm rather happy with sweats, slippers, and no makeup on.\" Chaeyoung: \"While I work, there are certain concepts and styles we have to stick to it. But when I'm not [working], it's a chance for me to show myself, my true self. I try vintage clothes. I like things with an unpopular look — something very colorful and a little weird. I don’t care whether it's feminine or masculine, either.\" Momo: \"I've always had bangs, [but] the first time I had them, I cut [them myself] when I was in kindergarten.\" Momo: \"It is very dry while in flight, so I try to bring a lot of masks with me. I also use a cleansing device and put on a sleeping mask every night.\" Dahyun: \"I try to drink a lot of water and sleep well. When I don't get enough sleep or I'm really stressed out, it always shows through my skin.\" Nayeon: \"Cleansing balm.\" Jeongyeon: \"Oil cleanser, cleansing milk, then cleansing foam.\" Jeongyeon: \"I never use a towel to dry off my face. Instead, I put on toner when my skin is still damp.\" Nayeon: \"I also never use towels after I wash my face.\" Sana: \"I constantly look for something that can lift my mood, something that smells good, like perfumes and candles. [I like] something sweet like candy but with a hint of floral.\" Chaeyoung: \"I like to draw things. Anything that I can do to express myself can be a way to be my true self. I don't really think that much when I draw. It's just freestyle. I like to watch documentaries about the deep sea, and sometimes that inspires me to draw.\" Tzuyu: \"I listen to music and write in a diary. I just started writing in it again.\" Nayeon: \"Beauty is what I believe in. I want to act and make decisions based on what I believe. Having concrete, strong thoughts is very important.\" Mina: \"That is something I'll be eager for forever. Even though I won't be beautiful all the time until I die, I understand the beauty standard always changes as time goes by. I can never be perfect. I have to try new things and always take interest in what goes on around me. I will keep searching for beauty to find its true meaning.\" Dahyun: \"I concentrate more on inner beauty because when I worry too much or think negatively, it shows through my skin. I try to be positive and calm all the time. There's a Korean saying that you smile, not just because there is something to smile about because when you smile, there's going to be something to be smiling about.\" Want to learn more about TWICE? The girls are dropping their very own YouTube Originals series called TWICE: Seize the Light on April 29 at 10 a.m. EST. It documents as the group prepares and embarks on their sold-out 2019 world tour. Read more interviews with K-pop stars: Now, see a professional mermaid's daily beauty routine in action: Follow Devon Abelman on Twitter and Instagram. By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Marie Lodi By Devon Abelman By Gabi Thorne By Marci Robin More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2020-04-13T12:00:00.000Z",
    "url": "https://www.allure.com/story/twice-members-interview"
}