{
    "title": "U-KISS to Hold First U.S. K-Pop Concerts of 2014 – Billboard",
    "text": "K-pop boy band U-KISS will hit the East and West coasts in January with a three-date U.S. tour. By\n\t\t\t\t\t\t\t\t\t\t\t\t\n\n\tJeff Benjamin Korean acts like Drunken Tiger, INFINITE, B.A.P, f(x) and more all performed on American soil in 2013 and boy band U-KISS will kick off 2014’s string of K-pop concerts in January. The six-member group will embark on their first U.S. tour starting next month in New York. The boys will hold one show on the East Coast and two on the West. Explore\t\t\n\t\n\n\n\n\n\n\t\tExplore\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee latest videos, charts and news\n\n\n\nSee latest videos, charts and news See latest videos, charts and news See latest videos, charts and news   Starting Dec. 2 at 7 p.m. local time, fans can purchase VIP tickets early. The first 150 purchasers will be given early entry to the show plus a photo opportunity with the U-KISS members before the boys take the stage. Those can be bought via Powerhouselive. Related\t\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\t\n\t\t\n\t\t\t\t\tBTS' V Drops Two Very Different Remixes of 'Slow Dancing' Solo Single\t\t\n\t\n\n\n\n\t12/03/2013 Regular tickets go on sale Friday, Dec. 6, at 4 p.m. local time via Powerhouse, AXS and Ticketmaster. Despite debuting in 2008, U-KISS has never toured America. Their U.S. fans have shown their support for the boys, sending four of their releases on Billboard’s World Album chart. U-KISS most recently released electro-pop single “Standing Still” (listen above), which peaked at No. 82 on the K-Pop Hot 100. Their highest-charting single on the K-Pop chart is 2012 single “For Kiss Me” (below).  Ticket prices range from $50 to $180. U-KISS “First U.S. Tour” Dates: Jan. 9 – New York, N.Y. – Best Buy TheatreJan. 1 – San Francisco, Calif. – Warfield TheaterJan. 14 – Los Angeles, Calif. – Club Nokia Theatre Live Get weekly rundowns straight to your inbox A daily briefing on what matters in the music industry Send us a tip using our anonymous form. A daily briefing on what matters in the music industry Send us a tip using our anonymous form. Billboard is a part of Penske Media Corporation. © 2023 Billboard Media, LLC. All Rights Reserved. ",
    "datetime": "2013-12-04T01:05:22+00:00",
    "url": "https://www.billboard.com/music/music-news/u-kiss-to-hold-first-us-k-pop-concerts-of-2014-5812366/"
}