{
    "title": "Ulta Beauty to Launch Korean Skincare Brands – WWD",
    "text": "The retailer's new K-beauty section will be in 300 doors by March 6. Beauty Editor, Mass Market Ulta Beauty wants to show its customers that K-beauty is about more than just kitsch. This week, the beauty emporium is launching the Ulta K-beauty collection, with a selection of 25 products from six K-beauty brands hitting 300 high-volume Ulta Beauty doors and ulta.com by March 6. Each line is a leading Indie skin-care brand from Korea that focuses on efficacy and high-quality ingredients. The K-beauty units will be situated in Ulta Beauty’s prestige section, and fixtures will highlight a simplified four-step version of a Korean skin-care routine — cleanse, treat, hydrate and fight aging — as well a section with cult Korean beauty products. “More and more, beauty lovers in the U.S. are going out of their way to get authentic Korean beauty products in their hands. We’re making it simple for our guests by rolling out a K-beauty collection in select stores and bringing together brands that are the real deal,” said Tara Simon, senior vice president of prestige merchandising. “Our special selection is a curation specific to Ulta Beauty that simplifies the Korean beauty routine, presenting lush and effective products known for the excellence of their ingredients.” Related Articles\t\n\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tBeauty Features\n\t\n\n\n\n\t\n\t\t\tBobbi Brown on Three Years of Jones Road\t\n\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tBeauty\n\t\n\n\n\n\t\n\t\t\tThe Best Dyson Airwrap Dupes, Tested and Reviewed In selecting its assortment of K-beauty products, Ulta Beauty wanted to steer clear of gimmicky items like snail creams and animal sheet masks, according to Sarah Chung, founder and chief executive officer of Landing International. Chung’s company worked with Ulta to curate the K-beauty collection. “I know these products sell and perform,” said Chung. “People will fall in love and come back for more because they’re great, good quality products; it’s not something where they’re like, ‘Oh I want to try this for fun.’ It’s something they can use day to day.” Brands included in the collection are SkinRx Lab, Thank You Farmer, ORG Skincare, CosRX, Botanic Farm and CLE. Prices range from $18 for a rice-based night cream to $58 for a repairing serum. Two products will be exclusive to Ulta Beauty in the U.S.: the Thank You Farmer True Water Light Gel Cream and Botanic Farm Mineral Pop Sparkling Bubble Pack. Ulta Beauty is the latest U.S. retailer to introduce a K-beauty initiative — Target teamed with Peach & Lily on a K-beauty launch earlier this year, and Nordstrom introduced a K-beauty pop-up. Sign up for beauty news straight to your inbox every day Top News Stories Alerts Straight to your Inbox. Send us a tip using our anonymous form. WWD and Women's Wear Daily are part of Penske Media Corporation. © 2023 Fairchild Publishing, LLC. All Rights Reserved. ",
    "datetime": "2017-03-02T19:09:53+00:00",
    "url": "https://wwd.com/beauty-industry-news/beauty-features/kbeauty-shop-ulta-10829426/"
}