{
    "title": "Ulta's Korean Beauty Section Just Got a Whole Lot Bigger | Allure",
    "text": "By Sarah Kinonen As if you couldn't get enough Korean beauty this week, here's some Seoul news to get you through the weekend: Following in the footsteps of mainstream mecca Target, yet another major retailer, Ulta, has welcomed the best of K-beauty skin care to its shelves. Technically speaking, Ulta has quietly offered K-beauty serums, essences, and sheet masks from Seoul giants Tony Moly, Missha, and Skin Food for the last year or so, but it was the beauty retailer's recent partnership with Landing International, an online marketplace for a slew of fashion- and beauty-based businesses, that brought in the K-beauty big guns. With the new collaboration, Landing International is bringing in the best of six brands—O.R.G., SKINRx LAB, Thank You Farmer, COSRX, Botanic Farm, and Cle—with a total of 24 products, plus one \"K-Beauty Survival Kit.\" Of the lot, notable mentions include a spray-on exfoliator—made with exfoliating grapefruit-seed extract and nourishing milk thistle—from O.R.G. called the Mineral Peel Face (which, yes, is similar to this Allure-editor-loved mist); the Cle Radiant Skin Melting Cleanser, which has hydrating sodium hyaluronate (the salt of hyaluronic acid) to moisturize skin while it's wiping away days-old mascara smudges; and the detoxifying COSRX BHA Blackhead Power Liquid made with willow bark to target blackheads, breakouts, and dirt overload while tightening pores. Also included in the curated K-beauty collection are two Ulta exclusives: the lightweight, glycerin-packed Thank You Farmer True Water Light Gel Cream and the tingly-on-contact foaming Botanic Farm Mineral Pop Sparkling Bubble Pack. Needless to say, there's tons to check out. More on Korean beauty: Check out Ulta's full selection of Korean beauty products at ulta.com—and then try not to buy everything. Now that you've learned about Ulta's Korean beauty offerings, watch Korean actress and pop star Jihae’s all-natural beauty routine: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Nicola Dall'Asen By Kara McGrath By Sarah Han By Devon Abelman More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2017-03-03T15:00:00.000Z",
    "url": "https://www.allure.com/story/ulta-korean-beauty-section"
}