{
    "title": "Ursula K. Le Guin on Italo Calvino | The New Republic",
    "text": "The Italian writer Italo Calvino died on this day in 1985. In 1980, American author Ursula K. Le Guin reviewed George Martin’s new translation of Calvino’s Italian Folktales. Prowling among dictionaries, I discovered that the word “fairy” is fata in Italian and that it derives, like the word “fate,” from a Latin verb fari, to speak. Fate is “that which is spoken.” The Fates which presided over human life dwindled away to fairies, fairy godmothers, inhabitants of fairy tales. The English word “fable,” Italian fiaba or favola, a  story, “a narrative or statement not founded on fact” as the Shorter Oxford puts it, descends from the Latin fabula, which derives from that same verb fari, to speak. To speak is to tell tales. The predestined spindle has pricked her thumb; here lies the Sleeping Beauty in the silent castle. The prince arrives. He kisses her. Nothing happens. So the prince comes back again next day, and the next day too, and his love is so intense that the sleeping maiden gave birth to twins, a boy and a girl, and you never saw two more beautiful children in your life. They came into the world hungry, but who was to nurse them if their mamma lay there like a dead woman? They cried and cried, but their mother didn't hear them. With their tiny mouths they began seeking something to suck on, and that way the boy child happened to find his mother's hand and began sucking on the thumb. With all that sucking, the spindle tip lodged under the nail came out, and the sleeper awakened. 'Oh, me, how I've slept!' she said, rubbing her eyes. The two children are named Sun and Moon, and Sleeping Beauty's mother-in-law tries to have them served up stewed for the prince's supper, but he hears the silver bells sewn on his wife's seven skirts ringing, and saves everybody—except the mother-in-law—and they live happily ever after, in Calabria. To find the moral, the message, the meaning of a folktale, to describe its \"uses,\" even so circuitously as Bruno Bettelheim has done, is a risky business; it is like stating the meaning of a fish, the uses of a cat. The thing you are talking about is alive. It changes and is never quite what you thought it was, or ought to be. One of the innumerable delights of Italian Folktales is its mixture of the deeply familiar with the totally unexpected. Most of the basic \"story-types,\" of which Calvino says there are about 50 represented here, are more or less familiar to members of the English folk/literary tradition. The themes that recur in all Western folktales run through these; we meet the youngest son of the king, the wicked stepmother, the stupid giant, the helpful animals, the magic boots, the house of the winds, \u2028the well that leads to another world: \u2028people and places we all recognize, \u2028archetypal forms of our perception of\u2028 life, according to Jung, embodiments of\u2028 ideas as basic to our subjective existence \u2028as the ideas of extension, right/left reversal, are to our existence in space. \u2028But the recombinations of these themes \u2028mostly are not familiar. This is much \u2028more than Cinderella served up with\u2028 salsa di pomodoro. The tales are endlessly surprising. And their mood is quite different from the elegance of the French contes, the iconic splendors of Russian skazki, the forest darknesses of German Marchen. Often they resemble British tales of the Joseph Jacobs collections in their dry and zany humor, but they have more sunlight in them. Some are wonderfully beautiful. “The natural cruelties of the folktale give way to the rules of harmony,” as Calvino says in his introduction: Although the notion of cruelty persists along with an injustice bordering on inhumanity as part of the constant stuff of stories, although the woods forever echo with the weeping of maidens or of forsaken brides with severed hands, gory ferocity is never gratuitous; the narrative does not dwell on the torment of the victim, not even under pretense of pity, but moves swiftly to a healing solution. Italo Calvino's part in this book is not\u2028 that of the eminent author condescending to honor a collection of popular tales \u2028with an introduction—anything but.\u2028 Essentially the book is to Italian literature what the Grimms' collection is to\u2028 German literature. It is both the first \u2028and the standard. And its particular glory is that it was done not by a\u2028 scholar-specialist but by a great writer \u2028of fiction. The author of The Baron in the \u2028Trees and Invisible Cities used all his skills \u2028to bring together the labors of collectors and scholars from all the regions of\u2028 Italy, to translate the tales out of dialects into standard Italian, and to retell \u2028them: I selected from mountains of narratives . . . the most unusual, beautiful,\u2028 and original texts….I enriched the text\u2028 selected from other versions and whenever possible did so without altering its\u2028 character or unity, and at the same time filled it out and made it more plastic. I touched up as delicately as possible those portions that were either missing or too sketchy…. With absolute sureness of touch he selected, combined, rewove, reshaped, so that each tale and the entire collection would show at its best, clear and strong, without obscurity or repetition. It was, of course, both his privilege and his responsibility as a teller of tales to do so. He assumed his privilege without question, and fulfilled his responsibility magnificently. One of the best storytellers alive telling us some of the best stories in the world—what luck! The Fiabe italiane were first published in Italy in 1956. My children grew up with an earlier, selected edition of them—Italian Fables, from Orion Press, 1959. The book was presented for children, without notes, in a fine translation by Louis Brigante, just colloquial enough to be a joy to read aloud, and with line drawings by Michael Train that reflect the wit and spirit of the stories. Perhaps a reading-aloud familiarity with the cadences of this earlier translation has prejudiced my ear; anyhow I found George Martin's version heavier, often pedestrian, sometimes downright ugly. I don't hear the speaking voice of the storyteller in it, or feel the flow and assurance of words that were listened to by the writer as he wrote them. Nor does the occasional antique woodcut in the present edition add much to the stories. But the design of the book is handsome and generous, entirely appropriate to the work. For here for the first time in English all the tales are included, as well as Calvino's complete introduction, and his notes (edited by himself for this edition) on each story. The notes illuminate his unobtrusive scholarship and explain his refashioning of the material, while the introduction contains some of the finest things said on folklore since Tolkien— such throwaway lines as: “No doubt the moral function of the tale, in the popular conception, is to be sought not in the subject matter but in the very nature of the folktale, in the mere fact of telling and listening.” Come and listen, then. Come hear how a girl named Misfortune found her Fate on the seashore of Sicily: At the oven Misfortune found the old woman, who was so foul, blear-eyed, and smelly that the girl was almost nauseated. ‘Dear Fate of mine, will you do me the honor of accepting—' she began, offering her the bread. ‘Away you! Begone! Who asked you for bread?’ And she turned her back on the girl. But Misfortune persists in showing good will toward this nasty hag, and so we find how Fate may turn to Fairy by the magic of Fable. The Fate, who was growing tamer, cameforward grumbling to take the bread. Then Misfortune reached out and grabbed her and proceeded to wash her with soap and water. Next she did her hair and dressed her up from head to foot in her new finery. The Fate at first writhed like a snake, but seeing herself all spick-and-span she became a different person entirely. ‘Listen to me. Misfortune,’ she said. ‘For your kindness to me, I’m making you a present of this little box,' and she handed her a box as tiny as those which contain wax matches. And what do you think Misfortune found in the little box? ",
    "datetime": "2013-09-19",
    "url": "https://newrepublic.com/article/114763/ursula-k-le-guin-italo-calvino"
}