{
    "title": "Valentino Makeup is On The Way",
    "text": "With 50 foundation shades to start. Do you remember where you were the first time you watched Maison Valentino's whimsical couture gowns draped around a diverse cast of models down the runway? Or the first time Pat McGrath's ethereal beauty entranced you looks backstage at Valentino shows? Valentino's commitment to inclusivity is reinforced with each passing runway season and campaign, which brings us to the house's latest trick—Valentino Beauty. Designed by creative director Pierpaolo Piccioli, three words can best describe what's to come with Valentino Beauty: uniqueness, extravaganza, and experimentation. With experimentation being the operative word here, Valentino Beauty will debut with 50 foundation shades, 40 lipstick shades, and a slew of \"multi-use, multi-finish products, that speak to the freedom of expression and individuality that lies at the core of the brand because everyone is beautiful in their way,\" the brand explains. The lipsticks and eyeshadow palettes arrive in refillable cases that encourage users to mix and match to fit their taste. Piccioli also stepped out of the chemist lab and behind the lens to shoot the upcoming campaign, which features 16 talents representing each of the Valentino shades. \"Beauty is a complexity resolved through love. Beauty is democratic. I look at the identity of each individual, the uniqueness that encloses diversity and inclusivity. Beauty is about grace. Grace is something that you cannot describe; it is a perception. Beauty is something that gives me emotion. It is a connection. For Make up my vision is Rosso Valentino 22, on the morphing of 16 people,\" Piccioli says in a statement. The complete collection will be unveiled on May 31, ahead of its worldwide launch in August 2021. Nerisha is the beauty commerce editor at ELLE.com, covering all things beauty (and fashion and music). She has a penchant for sneakers and nude lip glosses, and spends way too much time re-watching 90s sitcoms. 13 Best Japanese Skin Care Products to Shop Amazon Is Having a Major Beauty Sale Right Now Why Matrix Could Be the Next Best Skin Treatment Claudia Sulewski Launches CYKLAR First Class Beauty 2023 The 14 Best Expert-Approved Setting Sprays Austin Butler Doesn’t Think He’s a Beauty Icon Jelly Nails Are Back and Better Than Ever The Best Spring 2024 Beauty Trends to Try Now Add These K-Beauty Prime Day Deals to Your Cart The 20 Best Pore Minimizers for Baby-Smooth Skin Laneige’s Lip Sleeping Mask is on Sale Again A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2021-04-29T16:41:00Z",
    "url": "https://www.elle.com/beauty/makeup-skin-care/a36289241/maison-valentino-inclusive-makeup-collection/"
}