{
    "title": "VDL Just Arrived at Ulta — Here's What to Shop From the Korean Makeup Brand | Allure",
    "text": "By Devon Abelman Finding Korean makeup in the States just got even easier. K-beauty brand VDL launched at Ulta this week with a selection of incredible cosmetics. Now, when you stock up on your favorite pimple patches and toners from the beauty superstore's Korean skin-care section, you can also add foundations, primers, and lip tints straight from Seoul to your cart. VDL officially launched in America last summer, but was only available on its website. Now, you can earn and redeem Ultamate Rewards points while you shop its products. As a noted fan of the K-beauty brand, here are some of my go-to picks from Ulta's new VDL offerings. Meet my go-to foundation: VDL's Perfect-Lasting Foundation. All you need is half a pump of the liquid formula to give your skin a glowy, glassy finish. It has sheer, natural coverage so it's impossible to overdo. I usually buff it on with a Real Techniques highlighter brush to ensure even application. Makeup artists for K-pop stars, like boy group SF9 (hi, Young Bin), love it, too. The shade range is pretty limited, though. In Korea, only four hues are available, but VDL upped it to 12 when the foundation launched in America earlier this year. Hopefully, the K-beauty brand will keep adding to make it more accessible because everyone deserves to try it. It's that good. I hate primer and avoid it at all costs — unless it's the Lumilayer Metal Cushion Primer. Ever since New York City-based makeup artist Nam Vo introduced me to it, I've been hooked. Its thin, fluid consistency feels weightless on skin. I prefer subbing in the purple-tinted liquid for highlighter and tapping it onto the high points of my cheekbones for a multidimensional glow. Vo, on the other hand, uses it as a primer not only for foundation but also for powder highlighter, as well as a color corrector. By Aliza Kelly By Gabi Thorne By Gabi Thorne The Lumilayer Primer for Eyes comes in more than just a neutral hue. You can also pick from a shimmer option to amplify the glitz of your favorite metallic shadows. It also stands on its own for a subtle twinkle on your lids. Some of my favorite lip products in my makeup bag are from VDL. I often reach for its lipsticks in the traditional bullet and liquid varieties. Neither are available at Ulta yet, but you can find the Expert Color Lip Cube Marble Glow there. I love this one because it's an amazing everyday option compared to the colorful aforementioned lipsticks. The square-shaped tube is filled with two tinted balms that are swirled together to create an aesthetically pleasing marble effect. When swiped onto lips, it gives a hint of color for a luscious look. My favorite shade is Blessing Coral. By Aliza Kelly By Gabi Thorne By Gabi Thorne No matter what mascara I use, smudges on the outer corners of my eyes always happen. The Expert Eye Bomb Boosting Fixer Mascara is the first product I've ever brushed onto my lashes that keeps it from happening. It's a primer, but also a top coat, so you can swipe it on before or after your go-to mascara to make it last longer than ever. It also gives lashes an extra volumizing boost, too. You can shop all these VDL products and more on ulta.com right now. Read more about K-beauty brands available at Ulta: Now, learn about 100 years of foundations: Follow Devon Abelman on Twitter and Instagram. By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By AnaMaria Glavan By Marci Robin By Dianna Mazzone By Kara Nesvig More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2019-05-13T17:04:51.107Z",
    "url": "https://www.allure.com/story/vdl-ulta-k-beauty-makeup"
}