{
    "title": "Versus Versace For K-Way - Jacket And iPad Case | British Vogue | British Vogue",
    "text": "To revisit this article, visit My Profile, then View saved stories To revisit this article, select My Account, then View saved stories To revisit this article, visit My Profile, then View saved stories To revisit this article, select My Account, then View saved stories We may earn a commission if you buy something from any affiliate links on our site. By Sarah Karmali VERSUS VERSACE's collaboration with activewear brand K-Way has been unveiled for the first time. The special one-off partnership - which was first announced back in May - comprises a pack-a-mac jacket (the piece for which K-Way is renowned), and an iPad case.\nThe jacket fuses the functionality of K-Way (windproof, waterproof, adjustable and lightweight), with the attitude and style for which the Italian diffusion label is known - featuring an optical print from the new Versus collection. The iPad case features the same matching print.\n\"I love the Versus Versace and K-Way collaboration because Versus Versace lives on the street,\" said Donatella Versace. \"The jacket and iPad case are an amazing new way to get the Versus Versace look, and to bring attitude and energy to everyday essentials.\"\nThe one-off collaboration is part of the new-look Versus, which will partner with a series of guests designers on capsule collections in the coming months - alongside its seasonless in-house range. The last collaboration was a full-scale clothing collection with London-based designer JW Anderson.\nThe K-Way collection is available to buy online today at versusversace.com, priced £297 for the jacket and £79 for the iPad case. The Versus Versace K-Way jacket, £297 The Versus Versace K-Way jacket, £297 The Versus Versace K-Way iPad case, £79 By Alice Cary By Hannah Jackson By Hannah Coates By Joy Montgomery By Naomi Smart By Emily Chan By Joy Montgomery More from Vogue Condé Nast Britain © 2023 Condé Nast ",
    "datetime": "2013-07-10T16:22:31.000Z",
    "url": "https://www.vogue.co.uk/gallery/versus-versace-for-k-way-jacket-and-ipad-case"
}