{
    "title": "Virgil Abloh, Louis Vuitton’s Singapore show, K-beauty: Top fashion and beauty stories of 2021 - CNA Lifestyle",
    "text": "Entertainment Entertainment Entertainment Entertainment Women Women Singapore Women Wellness Women Women Wellness Buyers' Guide Obsessions People People Style & Beauty Entertainment Style & Beauty People Dining Experiences Dining People Experiences Singapore Travel Travel Style & Beauty Style & Beauty CNA Lifestyle looks back at the most significant fashion and beauty events, as well as, trends of the year. Squid Game's Jung Ho-yeon, Virgil Abloh and Zoe Tay. (Photos: Instagram/hoooooyeony, Reuters, Louis Vuitton) This year had its fair shares of ups and downs in the world of fashion and beauty. On the news front, we went from the high of Louis Vuitton pulling out all the stops for Singapore’s first physical fashion runway show since the pandemic gripped the world to the low of losing three great designers: Tiffany & Co’s Elsa Peretti, AZ Factory’s Alber Elbaz (formerly of Lanvin fame) and Louis Vuitton’s Virgil Abloh. But those weren't the only stories that mattered to readers, who were also interested in everything from looking and feeling exceptional, especially in these trying times. CNA Lifestyle looks back the most popular stories from our Style & Beauty section. FASHION GIANTS WE LOST IN 2021 We lost a few greats this year. Famed Tiffany & Co jewellery designer Elsa Peretti died at age 80 on Mar 20. An ex-Halston model, Peretti began designing for the famed American institution in 1974. Drawn from everyday designs, the Italian-born designer dreamt up more than three dozen collections for Tiffany & Co, the most iconic being the wrist-hugging Bone Cuff and Diamonds By The Yard. Read the story here. Alber Elbaz succumbed to COVID-19 on Apr 25. He was 59. The Moroccan-born fashion designer was best known for reviving the French couture house Lanvin with his modern takes on silk cocktail dresses and colourful, feminine designs during a 14-year tenure there. Elbaz had been working on AZ Factory, a fashion joint venture with Richemont since 2019 till his death. Read the story here. Louis Vuitton’s star designer Virgil Abloh died on Nov 28 following a private battle with cancer. He was 41. Abloh had been undergoing challenging treatments privately since his diagnosis in 2019, while helming Louis Vuitton’s men’s universe and Off-White that span fashion, art and culture. His last menswear collection for Louis Vuitton was transformed into a tribute to Abloh. The show closed with a recording of Abloh’s voice. “There’s no limit,” said Abloh in the recording. “Life is so short that you can’t waste even a day subscribing to what someone thinks you can do versus knowing what you can do.” The night sky was set ablaze with an eruption of fireworks of a scribble that read: \"Virgil was here.\" Read the story here. LOUIS VUITTON’S FIRST PHYGITAL FASHION SHOW IN SINGAPORE Pandemic or not, the show went on. Louis Vuitton pulled off the first runway show in Singapore since COVID-19 struck. The Women’s Spring/Summer 2021 Spin-Off show was held at the ArtScience Museum and included a star-studded guest list. Celebrities Stefanie Sun, Rebecca Lim, Zoe Tay and Desmond Tan turned up in full force for the phygital show that was equal parts actual runway show that featured 69 looks modelled by local models and digital extracts from Wim Wender’s iconic Wings Of Desire movie projected onto the green screens at the venue. Read the story here. NEW K-BEAUTY TREND ALERT: JUNG HO-YEON’S NATURAL LOOK Forget glass skin, bid the 12-step routine farewell and say hello to a pared down approach that focuses on natural ingredients. The bare skin trend that Jung championed was the K-beauty trend that came from nowhere. To achieve good skin health, we listed some clean K-beauty products to start with (keep an eye out for botanical or traditional Korean herbal ingredients). Read the story here. JEANETTE AW’S TRICK TO NOT CLOGGING UP PORES Jeanette Aw made this shocking admission to us when we interviewed her: “I don’t use foundation, even when I’m filming.” That’s how she gets around the sticky issue of clogged pores! One of Singapore’s favourite celebrities also shared her belief that less is more. “My skin must be able to breathe even when I’m wearing makeup.” Are you taking notes yet? Read the story here. TELL-TALE SIGNS TO REPLACE YOUR BRAS If you’ve been going braless at home for what feels like forever, this year was probably a good time to check if your bras were still in “working” condition. We compiled six tell-tale signs that can help you decide which to keep and which to chuck. Read the story here. CHANTALLE NG AND LIN MEI JIAO’S BEAUTY SECRETS REVEALED PSA for your next staycation: Don’t leave your skincare regime at home – you’ll never know when you’ll need to look great. Check out CNA Lifestyle’s fun short film Staycay with celebrity mother-daughter duo Lin Mei Jiao and Chantalle Ng, done in partnership with Clarins. Good skin matters no matter if you’re in your 20s or 50s. We got this celebrity mother-daughter duo to share their beauty tips on how best to care for their skin, as well as skincare pitfalls to avoid. If you’re still applying sheet mask on a daily basis, you’ve really got to listen to what Ng has to say. Read the story here. WILL SKIPPING BREAKFAST LEAD TO HAIR LOSS? A trichologist reveals how hair loss can be affected by factors we didn’t expect. These six common hair care mistakes we all make can cause our crowning glory to suffer. Read the story here. PHYLLIS QUEK’S AGELESS BEAUTY APPROACH Quek is 47. Yet she doesn’t look any different from when we caught her on-screen appearance as the peony fairy Bai Mudan in Mediacorp’s 1998 drama Legend Of The Eight Immortals. Enough said. Read the story here. HOW LOVE, BONITO’S RACHEL LIM IS BUILDING A FASHION EMPIRE OUT OF SINGAPORE We interviewed the 34-year-old mumpreneur behind Love, Bonito, one of Singapore's most successful homegrown labels and also one of the largest omni-channel women’s fashion brands in the region today. Read the story here. RED, YELLOW OR HUAT? THESE ARE THE COLOURS YOU SHOULD WEAR AT CNY Depending on what’s on your agenda – to attract luck, prosperity or success – you'll always need to dress the part every time Chinese New Year comes around. Getting in the right colour will get you ready to tackle your goals. Don't forget to bookmark this story for 2022! Read the story here. Copyright© Mediacorp 2023. Mediacorp Pte Ltd. All rights reserved. We know it's a hassle to switch browsers but we want your experience with CNA to be fast, secure and the best it can possibly be. To continue, upgrade to a supported browser or, for the finest experience, download the mobile app. Upgraded but still having issues? Contact us ",
    "datetime": null,
    "url": "https://cnalifestyle.channelnewsasia.com/style-beauty/virgil-abloh-louis-vuitton-k-beauty-fashion-trends-2021-292346"
}