{
    "title": "Vivian Geeyang Kim is a plus-size challenge to South Korea’s beauty norm | South China Morning Post",
    "text": "In a country with beauty ideals that pre-makeover Barbie would struggle to meet, South Korean plus-size model Vivian Geeyang Kim is facing down online trolls in her defiant campaign to persuade curvy women they have nothing to be ashamed of. Kim has modelled for US firms, but at 165 centimetres tall and weighing 70 kilograms, she was described as “too skinny” for some full-figure fashion show work in America. But in her looks-obsessed homeland, she is mocked and ridiculed on social networks as “flat-out fat” or even “disgusting.” “In South Korea, the ideal weight for women is 50 kilograms, and many women who weigh more than that think they are fat,” the 30-year-old said. “That is a ridiculous, impossible standard that cripples many South Korean women’s self-esteem. And that has to change,” she said after a recent photo shoot. Kim, who is a US size 10, runs an online clothing shop and publishes a fashion magazine specifically for plus-size women in South Korea - a first in a country where beauty is defined by rail-thin teenage K-pop stars and TV actresses whose diets are strictly controlled by their management. The pressure to conform is such that many turn to the country’s US$4.6-billion plastic surgery industry which offers everything from a nose-job to radical double-jaw surgery. The sort of weight-loss advert that was banned earlier this year in Britain for its image of a bikini-clad woman and the slogan “Are You Beach Body Ready?” would barely raise an eyebrow in South Korea. Similar products are promoted on posters pasted on subway walls and women’s toilet stalls, showing models mocking “lazy girls” or asking questions like: “How long are you going to roll around like that?” It is precisely this type of widespread, casual body-shaming that Kim is seeking to tackle head-on. “People hate it when a ‘fat girl’ like me parades her body without looking ashamed ... they say I should not be seen in public or on the media,” Kim said. “Despite all this, I love my job,” she said. “I wanted to send this message to girls like me out there that they are not alone and they are beautiful no matter what.” After a failed bid to compete in a local modelling TV reality show, she left for the United States in 2010, where she eventually worked a number of full-figured shows. On her return, she searched for similar opportunities in the South Korean fashion scene - only to realise that there were none. According to Lee Chung Chung, a prominent Seoul fashion designer, using models of varying sizes in magazines or fashion catalogues is still a foreign concept in South Korea. “The beauty ideal among many of our customers is being thin ... and we have to cater to that demand to sustain sales,” Lee said. Gong Ji-Woo, head of Seoul-based New Face Model agency, said demand for plus-size models was “non-existent” - with the exception of some TV shopping channels where they are shown eating food products or trying exercise machines. “I do feel the need for more development in plus-size model runways and programmes,” Gong said. “But in order for this to happen, Korean clothing companies and the fashion industry must change to accept them... rather than for a one time event or our amusement,” he added. Shut out of the mainstream, Kim set up - and models for - her own quarterly magazine which offers fashion and styling tips for plus-size women and well as advice on how to deal with bullying. “I hear heartbreaking stories from so-called ‘fat girls’ all the time - being constantly abused and mocked by their own families, bosses, friends and strangers on the street or on the Internet,” she said. “Honestly, some of them are not even that fat. But here, the standard of ‘thin’ is just way too cutthroat and only women as slim as K-pop band members can satisfy that norm,” she added. Among her many fans and clients is Baek Soo-Jung, 31, who said Kim had created a sorely-needed safe refuge. Also a US size 10, Baek said she had been mocked by her own mother, who once refused to take the same bus with her because of the shame of being called “mom” in public by a chubby daughter. Baek said Kim’s store was the first to produce pretty, well-fitting clothes, instead of the “dull, baggy, ill-fitting sacks local brands call plus-size clothes.” “Regardless of my size, I am a human and a woman who wants to feel pretty and to love myself...and Kim is the person who started this conversation in this country,” the 31-year-old said. “She took a big, brave step for all women like me.” ",
    "datetime": "2016-08-30T14:30:30+08:00",
    "url": "https://www.scmp.com/news/asia/east-asia/article/2011172/vivian-geeyang-kim-plus-size-challenge-south-koreas-beauty-norm"
}