{
    "title": "Watch out for fake K-beauty products – made-in-China copycat items are flooding Southeast Asia | South China Morning Post",
    "text": "By Kim Jae-heun Korean cosmetics firms are grappling with a rise in trademark infringements and design copies in China and Southeast Asian countries, according to South Korea’s intellectual property protection agency. Last year, China had the most cases of K-beauty infringements, with a total of 2,920. Indonesia was next with 840 cases, followed by Vietnam with 660 and Thailand with 550. Korean companies are calling for the international prevention of intellectual property rights infringement, but businesses in the countries mentioned are ignorant when it comes to observing the law. Counterfeit product manufacturers copy a brand’s image or item design and sell them at lower prices. For example, the Eye Palette and Kill Cover from Korean make-up brand Clio were copied by a company named Pony Clio, which made similar items named Eye Palette and Kiss Cover. They were sold in China and Southeast Asian countries. Korean cosmetic company Holika Holika’s 99 per cent Aloe Gel was also copied, according to the Korea Intellectual Property Office. Chinese brokers register the trademarks of the copied products before anyone else can, and they also have better knowledge of the difficult Chinese hygiene certification process. Korean companies find it difficult to obtain a hygiene certification from the National Health Commission of China as they are required to list all the ingredients as well as the technology used to make them. The certification procedure itself is complicated, too. The number of brokers registering the trademarks of existing Korean brands or their products in China has increased in the past three years. Brokers will either sell those trademark rights back to the Korean firms or use them to sell counterfeit products to their consumers – essentially selling them as originals in China. This makes it hard for Korean firms to sell their products through the official retail channels, which means they have to rely on Korean online shopping channels or Chinese sellers. “We have seen the orders of our popular products in China or Vietnam decrease year after year,” one Korean cosmetics firm official said. “The main reason is that local brokers first show our original products to customers and then sell them their fake items instead. There is not much Korean firms can do for now. “However, we will continue to monitor unofficial online channels in China and report them.” ",
    "datetime": "2022-12-21T11:15:08+08:00",
    "url": "https://www.scmp.com/lifestyle/fashion-beauty/article/3203824/look-out-fake-k-beauty-products-china-indonesia-have-most-counterfeit-goods-k-beauty-companies-say"
}