{
    "title": "Waterless washing and fermented beauty lead cosmetics NPD in 2022\r\n",
    "text": "WGSN predicts usability and sustainability will drive key trends for the next 12 months Trends forecaster WGSN has unveiled its 2022 beauty trends, which centre around usability and sustainability, from water-saving hygiene to faster make-up routines. Among the six ‘ones to watch’, as highlighted by WGSN, is ‘waterless washing’, an evolution of waterless beauty encompassing showerless shampoo and no-water shaving products. ‘Fermented beauty’, meanwhile, taps into the desire for potent products and is driven by K-beauty and J-beauty trends. Fermentation releases enzymes that break down molecules so they can better penetrate the skin. The fermentation process also results in the formation of acids, such as lactic and acetic acids, which act as natural preservatives, prolonging shelf life. ‘The two-minute make-up bag’ features products offering smart beauty hacks to save on effort, money and commitment. The trend, said WGSN, aligns with the convenience of fast, low maintenance looks adopted during the pandemic. Another new beauty trend that emerged during lockdown is ‘beauty snacking’, a term for those micro beauty moments incorporated into consumers’ lives to break up the monotony of lockdown or working from home, such as flash treatments and even skin care sweets. ‘Wild bathing’ takes its cues from the urge to reconnect with nature and people’s embracing open water, outdoor swimming and therapies such as Japanese onsen. As this moves indoors, WGSN predicts that products based on seaweed and seawater, and bathing materials derived from nature will prove popular. Finally, moving inland, ‘coastal-foraged ingredients’ will incorporate skin care and personal care based on ingredients like kelp, sea fennel and algae, famed for soothing, detoxifying and hydrating benefits. Local, seasonal and wild-harvested will be keywords here. “The trends for 2022 are a translation of WGSN’s global consumer expertise and product design knowledge, which spans teams working across the globe,” said Clare Varga, WGSN’s Head of Beauty. “The top beauty trends for 2022 reflect wider societal changes, as consumers continue to look to sustainably minded practises and products including waterless elements and longer shelf lives.” Through digital, live and print products, Cosmetics Business informs and inspires business leaders and decision-makers around the world. With a digital-first strategy, the Group’s Editors write breaking news, product releases, technical papers, innovation features, trend reports and live content agendas covering the entire industry from ingredients and packaging to regulation, retail and marketing. ",
    "datetime": null,
    "url": "https://cosmeticsbusiness.com/news/article_page/Waterless_washing_and_fermented_beauty_lead_cosmetics_NPD_in_2022/181122"
}