{
    "title": "Waterfront Toronto boss defends purchase of $12K pink umbrellas",
    "text": "    Waterfront Toronto CEO and president John Campbell fires back after Toronto councillor Denzil Minnan-Wong criticizes pink umbrellas and rocks on Sugar Beach. Waterfront Toronto CEO and president John Campbell fires back after Toronto councillor Denzil Minnan-Wong criticizes pink umbrellas and rocks on Sugar Beach. This article is over a year old, and the information within may be out of date. sugar_beach The 36 pink umbrellas on Sugar Beach were purchased for $12,000 each, something Councillor Denzil Minnan-Wong is criticizing as a waste of taxpayers' money.   In the face of a city councillor’s criticism, the head of Waterfront Toronto says spending close to $1 million to buy two giant rocks and 36 pink umbrellas for Sugar Beach was a prudent investment. “What’s the big picture? Some people just can’t see the forest through the trees,” Waterfront Toronto president and CEO John Campbell said Thursday.  “It’s all about building a better city. Yes, you can pick a light pole here, an umbrella there, that’s really not the point. The point is we are delivering on our mandate to provide a great community . . . this is about revitalization.” Parks and a public space such as Sugar Beach have helped lure development to Toronto’s waterfront, he added. Tax revenues generated from waterfront revitalization and the $2.6 billion investment from developers have effectively paid back to the federal, provincial and city governments almost all of the $1.5 billion they provided to Waterfront Toronto, he said. Councillor Denzil Minnan-Wong is accusing Waterfront Toronto of wasting tax dollars when it paid $500,000 to purchase two “designer rocks” and about $12,000 each for three dozen pink umbrellas, “that look like they’re wearing out.” The waterfront park on Queens Quay opened in 2010, but Minnan-Wong said he only just obtained the invoices, which he said he had to “rip out” of the agency. “I get mad when we can’t improve parkland deficient areas and our tax dollars are being used to buy two rocks and a bunch of umbrellas for close to a million bucks,” Minnan-Wong said Thursday. “We should be making it look nice, but it’s a question of value and it’s a question of transparency,” he said. Campbell noted the umbrellas are not the kind you take to the beach. They are permanent “art structures” equipped with LED lights and designed to withstand the weather for decades. The rocks, which feature coloured stripes — in keeping with the park’s sugar theme — were chosen by the firm that won an international design competition “that was public,” Campbell said. He rejected Minnan-Wong’s suggestion the umbrellas need replacing. Next week, the city’s executive committee will consider a report on the next phase of waterfront revitalization. The agency, established in 2003, is running out of money and is looking for additional funding for flood protection and transit, as well as asking the city for more borrowing powers for new projects, Campbell said. Minnan-Wong, who sits on the committee, calls Waterfront Toronto “an expensive organization with lots of people with high-priced salaries and they’re anything but transparent.” Campbell dismissed that as nonsense and invited the public to check out information posted on Waterfront Toronto’s website. Betsy\nPowell is a Toronto-based reporter covering crime and courts\nfor the Star. Follow her on Twitter: @powellbetsy. Anyone can read Conversations, but to contribute, you should be a registered Torstar account holder. If you do not yet have a Torstar account, you can create one now (it is free). To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation Save $85 with our best offer. Cancel Anytime. It means the world to us that you choose to read our brand of trusted news. And as long as you continue to do so, we’ll continue to show you we appreciate it. Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:       Sign up with  Thank you . Your account has been registered, and you are now logged in. Check your email for details. Invalid password or account does not exist Sign in with Submitting this form below will send a message to your email with a link to change your password. An email message containing instructions on how to reset your password has been sent to the email address listed on your account. No promotional rates found.    Secure & Encrypted Secure transaction.\nSecure transaction. Cancel anytime.  Thank you. Your gift purchase was successful!\nYour purchase was successful, and you are now logged in. You will also start receiving the Star’s free morning newsletter, First Up, soon. A receipt was sent to your email. ",
    "datetime": null,
    "url": "https://www.thestar.com/news/gta/city-hall/waterfront-toronto-boss-defends-purchase-of-12k-pink-umbrellas/article_d4c7dae2-d16a-5754-a08c-edf46583d506.html"
}