{
    "title": "Watermelon for the skin: That's how K-beauty brand Glow Recipe proposes to get you ready for spring - Los Angeles Times",
    "text": "The Korean beauty category — K-beauty for short — has exploded in the United States with products with intriguing names and more intriguing ingredients such as snail slime, bee venom, starfish extract and pig collagen. One of the latest all-star beauty ingredients is watermelon extract. That last item is where Sarah Lee and Christine Chang, founders of Glow Recipe, come into the mix. Glow Recipe, which claims to offer natural Korean beauty products, has a new one that you might consider for your beauty repertoire this spring. It’s called the Watermelon Glow Pink Juice Moisturizer, little sister to the brand’s Watermelon Glow Sleeping Mask. The moisturizer, which launched last month, is $39 and available at www.glowrecipe.com and Sephora stores and www.sephora.com. It’s packaged in a wavy glass bottle with a baby-pink pump top. Having worked for a major beauty brand, Lee and Chang, who started Glow Recipe in 2014, have continued to use their beauty knowledge to  curate K-beauty trends and ingredients for the average American woman. “We were in the beauty industry at L’Oréal in Korea for a really long time and then in the U.S.,” Chang said during an L.A. event earlier this year to celebrate the arrival of the new moisturizer. “We’ve seen the best of the best in Korea. … We have that direct line, but we know what works for U.S. women. When we curate something, it is not just the best of Korea, it is the best of Korea that works for women here.” That turned out to be the addition of the Watermelon Glow Pink Juice Moisturizer, which has a gel-like texture that drenches the skin with hydration. The anti-aging, oil-free moisturizer for all skin types contains vitamin- and amino acid-rich watermelon extract, hyaluronic acid and  botanicals.  It has 90% watermelon extract. Watermelon naturally contains antioxidants and free radical-fighting lycopene, a go-to ingredient for natural anti-aging skin care. Lee said she remembers as a child seeing her grandmother rub cold watermelon rinds on her skin to soothe sunburns as well as dryness and skin irritations. Now, if you go the full K-beauty route, just remember that following a traditional regimen  requires committing to a routine  that’s not for the faint of heart;  it involves cleansing, toning and moisturizing and, in some cases, 20 different steps. However, Chang said it doesn’t have to be so involved for the person who’s always on the go. “We are here to break down skin-care [practices] and not make it hard,” Chang said. “We want to make it easy and fun.” Tara Paniogue is a former multiplatform editor and occasional writer for the Calendar and Image sections at the Los Angeles Times. Lifestyle Oct. 16, 2023 Movies Oct. 12, 2023 Opinion Oct. 7, 2023 Opinion Sept. 27, 2023 Subscribe for unlimited accessSite Map Follow Us MORE FROM THE L.A. TIMES ",
    "datetime": "2018-03-23T12:00:04",
    "url": "https://www.latimes.com/fashion/la-ig-glow-recipe-watermelon-glow-20180323-htmlstory.html"
}