{
    "title": "Watsons develops successful partnerships with K-Beauty brands in Asia",
    "text": "JUST as K-Drama and K-Pop have surged in the entertainment scene, K-beauty is making inroads in the skincare and cosmetics industry. But is it here to stay? According to the data released by the Korea Customs Service and Korea Cosmetic Association, South Korean South Korean cosmetics exports climbed 16.1 percent to reach nearly USD7.6 billion in 2020 despite the pandemicWatsons, the leading offline and online (O+O) health and beauty retailer in Asia, was quick to recognize that K-Beauty “is highly sought after by our Watsons customers even during the pandemic,” says Susanna Yen, Exclusive Brands Director of Watsons International.With this, “Watsons has partnered with a number of K-Beauty brands to deliver more choices to beauty lovers across Asia while helping to incubate up and coming brands to expand their penetration.Mise En Scène and COSRX are two outstanding examples that show how Watsons has helped K-Beauty brands enter new markets and build up a strong market positionMise En Scène is a total hair cosmetic brand that offers a diverse range of hair styling products. The brand’s Perfect Serum has been Korea's #1 for nine consecutive years with its unique intensive care formula featuring seven nature-derived ingredients. This cult-favorite, along with Mise En Scène's other popular styling products, is exclusively available in Watsons online and select physical stores, promising shoppers smooth, silky, easy to style, and healthy hair.COSRX, on the other hand, is another K-Beauty brand that has benefited hugely from its exclusive partnership with Watsons. This skincare brand was launched through Watsons in Singapore, Malaysia, Thailand, and the Philippines exclusively in 2017, resulting in a compound annual growth rate of over 80 percent.Watsons also reinforces the demands for their K-beauty products by highlighting K-Beauty as part of their Asian Beauty Campaign.“The demand of K-Beauty products keeps growing but due to the pandemic, customers are not able to travel to Korea to shop for the hottest K-Beauty products, so we have highlighted Watsons K-Beauty as part of the Asian Beauty Campaign. With over 5,000 products to choose from in-store and online, Watsons K- Beauty land is expected to become the go-to place for all K-Beauty lovers.\" Yuen mentioned.Watsons' strong O+O capabilities enable customers to enjoy the benefits of convenient shopping either at home or in-store, which effectively helps K-beauty products and many other health and beauty brands to engage and connect with its target customers.In the Philippines, Mise EnScene, COSRX and other K-beauty brands are available at Watsons stores located in most SM Supermalls nationwide. (PR) Follow Us ©Copyright 2023 SunStar Publishing Inc. Powered by Quintype ",
    "datetime": null,
    "url": "https://www.sunstar.com.ph/cagayan-de-oro/lifestyle/watsons-develops-successful-partnerships-with-k-beauty-brands-in-asia"
}