{
    "title": "We tried everything from Aldi's new K-beauty range – here's what we thought | Metro News",
    "text": "NEWS... BUT NOT AS YOU KNOW IT We recently reported on the launch of a new collection by Lacura at Aldi, all inspired by K-beauty brands like Laneige. The range featured a whole host of skincare products in pastel colours, claiming to be dupes of Korean favourites. From the Glow Recipe-esque pineapple serum to the Laneige-style night mask, we gave everything from the line a go. Although we love a dupe, the proof is always in the formula, so we put those formulas to the test. Here are our reviews: The eye cream is pillowy, comforting and makes me feel like my skin is really being well protected at night. I love that it has retinol as the active ingredient, so I know it will be working on those crows feet. Rating: 4/5 This serum smells literally so good I want to eat it. It’s really nice for an added hit of moisture if you feel like your skin is a bit dry, or if you want a boost of dewiness before putting on make-up, but it doesn’t seem to last as long as other serums I have for my face. Rating: 3/5 Again this smells ridiculously edible. I love how bouncy and almost gel-like this moisturiser is, I feel like it creates a brilliant protective barrier for my skin – but I’m not sure that it sinks in quite as deeply as other moisturiser. It’s best if you’re looking for a lighter product. Rating: 3/5 Not to be a party pooper, but this didn’t totally do it for me. It’s a night mask you wear over your usual moisturiser that should see you waking with plump and moisturised skin. This feels nice on the skin, but if I’m honest, I found the gel texture wasn’t occlusive enough, and I still woke up feeling a little tight in certain areas. Rating: 2/5 This 'thickening' scalp treatment has got shopper's hair 'growing like wildfire' Where to buy the cheapest frozen turkey this year as Aldi hikes price by 20% This Aldi favourite will keep you warm this winter — and costs just 2p an hour to run The new Lacura lip balms I tried have a beautiful texture, going on like a non-sticky gloss that coats the lips as well as hydrating them. I tried all three – pear, grapefruit, and cherry – and can confirm they all smell delicious and provide the same healthy, plumped finish. Not to mention, at that price point I’m not worried I’ll lose it and waste a load of cash. Rating: 5/5 Do you have a story you’d like to share? Get in touch at MetroLifestyleTeam@metro.co.uk.  Get us in your feed ",
    "datetime": "2021-05-15T08:52:14+0000",
    "url": "https://metro.co.uk/2021/05/15/we-tried-everything-from-aldis-new-k-beauty-range-heres-what-we-thought-14583468/"
}