{
    "title": "Welcome to Hallyu-wood! The addiction to Korean dramas – why big brands should be watching - Lexology",
    "text": "Review your content's performance and reach. Become your target audience’s go-to resource for today’s hottest topics. Understand your clients’ strategies and the most pressing issues they are facing. Keep a step ahead of your key competitors and benchmark against them. add to folder: Find out more about Lexology or get in touch by visiting our About page. Hallyu-lujah! The Korean drama is the perfect case for the new globalization of content. For the vast majority of global citizens participating in this social world, we are all too familiar with the phrase “oh-bba Gangnam style.” Psy’s Gangnam Style video is one of the most globally viewed videos of all time with over 2 billion views. Yet to grasp scale, Psy’s popularity is only a very small portion of the overall Hallyu movement – the term used to refer to the Korean Wave or Korean Fever, the global fascination with South Korean pop culture and media known as KPop. Hallyu emerged in the 1990s in other parts of Asia, but the movement has been propelled into a true international market with the global growth of online and mobile content consumption. The two strongest areas of interest in KPop are in music and TV content. The popularity of KPop music is often covered and well-known. And now, TV drama series known as KDramas are grabbing the attention. The typical KDrama is most similar to what we know as a miniseries in the United States. They often tell a complete story in one series, self-contained typically in 16 to 24 episodes. With dozens of new shows produced each year, with a constantly revolving list of featured multimedia talent, there is no shortage of KDrama fandom. With a deeply engaged and loyal audience, KPop is widely consumed not just in South Korea and throughout Asia, but also has rapidly growing interest from Latin America and the United States. In the United States, English subtitled KDramas are most popular on YouTube and streaming sites DramaFever, Crunchy Roll (KDrama), Viki, and MNet America, as well as select content available on Hulu, Netflix, Amazon and iTunes. KDramas are more popular than ever with Millennials, especially with 18- to 24-year-old American women, not of Korean heritage. DramaFever reports that 85% of its audience is non-Asian, with 45% being Caucasian and 25% being Latino. It is no surprise that this premium content has sparked the interest of global investors, romanced by that growing, global loyal fan base. In December 2013, The Chernin Group acquired a majority stake in Crunchy Roll, an anime and Asian drama streaming site, for roughly $100 million. In the months that followed, Crunchy Roll spun off a Korean entertainment-focused site called Kdrama, featuring a library of top K-Dramas, variety, and music shows. In May 2014, Crunchy Roll acquired Soompi, a Kpop news publisher and community website. And in recent days, it was announced that Kdrama and Soompi would rebrand to form SoompiTV. Currently, most of SoompiTV’s content is only licensed for the United States and Canada, but it is working on gaining licensing rights to the global audience. Impressively, Crunchy Roll and SoompiTV – distributors of KPop and other Asian content – are part of the first few video services invested in and managed by the highly anticipated and highly regarded The Chernin Group/AT&T OTT joint venture, Otter Media. In September 2013, Japan’s Internet e-commerce giant Rakuten purchased Viki, a premium video streaming service run out of Singapore, featuring Korean dramas and other Asian content. That deal was rumored to be at $200 million. With close to $20 million in revenue this past year and a very global audience, DramaFever is another leader in the KPop/KDrama media space. With a rumored valuation near $120-$140 million, Drama Fever is being pursued and courted aggressively. To date, DramaFever has raised $11.5 million from investors that include AMC Networks, Bertelsmann, NALA, and Softbank. These are some serious bets being placed on the global value of KDramas as a major media asset. Here’s why more media companies and brands will be addicted: 1. Deeply engaged, fiercely loyal global audience Not too long ago, before many of the streaming sites had international licensing rights, KDramas had limited availability outside of South Korea, and pirated videos made their way around the world fueled by the crowdsourced, multilanguage subtitling of popular series. A large community of fans was dedicated to making this content available, and the loyalty and following of audiences are still reflected in the ongoing virality of what many would deem as obscure, foreign content. Today, subtitling is still crowdsourced on sites like Viki and YouTube, with the more popular KDramas subtitled in over a dozen different languages. Throughout Asia, the content has cross-generational appeal with both men and women. Earlier this year, a very popular series, My Love from the Star, debuted in Korea and had an average viewership of 24% in Korea. It then sold rights to China, where it’s been viewed online through iQiyi, a Chinese video streaming platform, over 14.5 billion times. The series finale was so widely anticipated and watched by all ages, that Chinese news outlets covered people calling in sick and taking time off to watch the finale and alluded to the high probability that the national productivity of China was impacted by the fandom around that show. 2. Deep library of addictive, binge-watching-worthy content With the soap opera-like cliff-hangers commonly written into each episode, coupled with the availability and ease of online and mobile consumption, KDramas are ideal for binge-watching through the series. I’d argue that KDramas were the original binge-watching type of content. There are hundreds of past KDrama titles, with constant, year-round production of new content. With this rich library, DramaFever reports that its subscribers watch, on average, 54 hours (3,234 minutes) per month. In comparison, subscribers on Netflix and Hulu are reported at monthly average views of 644 minutes and 223 minutes per month, respectively. 3. Growing interest in the KPop lifestyle This past summer at the KCON conference, an annual K-Pop convention held in Los Angeles, attendance doubled from the previous year to over 42,000 in attendance, with nearly 40% coming from outside California. Most of the attendees were female, and less than 10% of the attendees were of Korean heritage. KPop is not only relevant in music, TV and film, but it is also making significant plays in fashion lines, and even skincare and makeup. There is also a very large global following of Korean beauty content creators on YouTube, furthering the allure and appeal of the KPop lifestyle with a highly engaged audience. However, there are some significant challenges that KDrama creators and distributors need to overcome to fully optimize and monetize their assets. As seen with the industry and ecosystem around KDramas, the growth and monetization of global content are still in their infancy, with great opportunities for distribution licensing/rights, brand integration, advertising and subscription models to advance. Welcome to Hallyu-wood! Fun fact: Korean management companies are run much like the old studio system, where the studio contracted talent and only made movies around those contracted artists. Similarly, Korean management companies target and manage talent, often with the triple-threat formula in singing, dancing and acting. Many of the KDramas are cast with stars who are solo artists or a member of a group, and are trained, cast, produced and promoted by the same major management company. Korean management companies constantly scout and train new talent, and are often seen as cutthroat talent factories. Implied criticism of this system comes as no surprise. add to folder: If you would like to learn how Lexology can drive your content marketing strategy forward, please email [email protected]. © Copyright 2006 - 2023 Law Business Research ",
    "datetime": null,
    "url": "https://www.lexology.com/library/detail.aspx?g=0d6d0e4e-3e70-4de0-aac7-4c7922f3d1d7"
}