{
    "title": "What Is Glass Skin? This K-Beauty Trend Is About To Be Everywhere",
    "text": "Style  When previously researching K-Beauty, Young-Ji of purpletale told me via email that the K-Beauty system makes \"skincare feel more like a pampering experience than a chore.\" Indeed, the multi-step and several product process is time consuming and requires dedication. You can't take shortcuts. But, in the end, your skin will look gorgeous. Glass skin is the latest K-Beauty trend, and it features a smooth and hydrated skin that has a wet look sheen. It's also almost entirely poreless and skin appears luminous and translucent... like glass. It sounds so delicate and lovely. Glass skin is also incredibly true to K-Beauty form in that it involves many steps and products. You don't sprint to glass skin. Rather, you train for it like a marathon. Here's what it is, what it isn't, and how to get it. Peach & Lily guru Alicia Yoon told Refinery 29 that glass skin is incredibly sought-after in Korea, as it is a sign of youthfulness. It's also the result of a commitment to the labor-intensive K-Beauty process and it doesn't come easy. Yes, it's about layering products to achieve that extra dewy look. But it's not simply about products sitting on top of skin. Glass skin also involves exfoliation so that the deeper layers are really healthy, too. \"Getting this fresh-faced texture comes two-fold,\" Yoon told R29. \"First, you'll need an exfoliator to buff skin so it has that very smooth texture. Secondly, a hydrating serum to help give that glass-like appearance.\" Be The Skin Purifying White Waterful Serum, $40, Jet  |  Mizon Aha 8% Peeling Serum, $11, Amazon  |  Mizon Collagen 100, $11, Amazon Christine Chang and Sarah Lee of Glow Recipe, who are launching new simplified K-Beauty products at Target, agreed with Yoon's assessment that glass skin is much-desired by Korean women. They told Allure that \"glass skin is a skin ideal in Korea.\" The duo said that several light layers of hydrating products are necessary for the face to look dewy and plumped. Vita-Propolis Ampoule, $38, Target They also recommended Vita-Propolis Ampoule, which is a glow-giving serum, as part of the regimen and for strobing skincare, which also helps skincare obsessives get that glass-like sheen. If you prefer more of a matte complexion, then you will want to move right along without making a pitstop at glass skin. \"Gwang,\" which is Korean for \"dewy glow,\" is the ultimate goal here. I have incorporated K-Beauty products and methods into my personal face care routine over the past 18 months. I have long-since graduated from washing, moisturizing, and makeup-ing in the morning and washing and moisturizing before bed. That's too basic for me, and I'll never go back to my pre-K-Beauty days. Instead, I have added serums and essences and my skin is always soft, conditioned, and smooth. I unlearned previous beauty habits and re-trained my brain to view the application of several products to my face after washing it as essential for my skin to look and feel good for the long term. If you follow Yoon on Instagram, you are well-aware that she sheetmasks like it's her job. Oh wait, it is her job. But clearly, you can witness her ardent commitment to moisturizing and babying her skin. Her Insta is a reminder of the fidelity that followers of the K-Beauty system must have. If you love the look of glass skin but are iffy on the investment of time, think of it this way. Keeping your skin healthy is way more than a chore. It is a form of self-care and an absolute necessity for your overall well-being. Even if you forgo the major glow of Glass Skin, we could all use a little more self-love on the regular. K-Beauty isn't just a fad. It's a way of life. Choose an edition: ",
    "datetime": null,
    "url": "https://www.bustle.com/p/what-is-glass-skin-this-k-beauty-trend-is-about-to-be-everywhere-2343861"
}