{
    "title": "What Is Donkey Milk Beauty? | POPSUGAR Beauty",
    "text": "Updated on 8/4/2016 at 9:00 AM Korean culture has become famous for its attention to skin care. With Korean women having skin care routines with up to 10 steps, it's obvious that they take beauty very seriously. That being said, Korean beauty brands can feature some interesting packaging and ingredients. Just when we had gotten used to the idea of sea kelp, bee venom, pig collagen, and even snail slime in our products, the Korean beauty industry threw us a curveball: donkey milk. Yep, those sheet masks and creams you're going to start to see everywhere are really made from milk from a real-life donkey. Why would anyone choose to put milk from a donkey on their face? The skin benefits, of course. Donkey milk is so gentle that it's been used as a substitute for breast milk for infants. According to the International Dairy Journal, it's tolerated by 90 percent of infants with food allergies. That's comforting in an ingredient you're going to apply to your face. Donkey milk is hydrating and has four times the amount of vitamin C than cow's milk. The many vitamins, proteins, minerals, and essential fatty acids make this ingredient a potent and effective one for your skin. It's hydrating and brightening, and it's believed to help with eczema, acne, and psoriasis. With all these benefits, why shouldn't we be putting this all over our faces? Cleopatra is known for her incredible beauty and is said to have taken milk baths. According to legend, it took at least 700 farmed donkeys for her daily milk baths. If it's good enough for the Queen of the Nile, it's good enough for us. Read on to find your own donkey milk beauty product. Freeset Donkey Milk Skin Gel Mask Pack Aqua, 10 Count ($30) The SAEM Royal Natural Donkey Milk Moist Drop Cream ($34) Donkey Milk & Argan Oil Steam Cream ($51) ",
    "datetime": "2016-06-23T22:05:04.000Z",
    "url": "https://www.popsugar.com/beauty/what-donkey-milk-beauty-41755233"
}