{
    "title": "What Is Slugging? This K-Beauty Skincare Trend Is The Trick To Beating Dry, Winter Skin | Marie Claire Australia",
    "text": "The time is here, the dark and dry grasp of winter has officially arrived in the Southern Hemisphere, and it's safe to say, that our skin is paying the ultimate price. And with the crisp, cold days biting at our complexions, the cooler season can only mean one thing—it's time to switch up our skincare. For some, the same skincare routine can carry them through every month of the year. But much like switching out your seasonal wardrobe, others need to amp up their hydration when the temperature starts to drop. With moisturisers and hyaluronic acids a plenty, dry-skinned folks can still struggle to get adequate hydration, until now. Thanks to TikTok, a beloved Korean Beauty trend has been catapulted into the mainstream, with all eyes on their most treasured, complexion-loving technique, called 'Slugging'. The philosophy behind the trend promotes using emollient-textured skincare products—typically Vaseline—to serve as a barrier between your skin and the relentless winter air. The result? A dewy, slug-like complexion that's protected from environmental aggressors, locking in the much-needed moisture that's so easy to lose in cold weather. Curious? Below, we deep dive into the TikTok-approved, K-Beauty trend—from what 'slugging' is and how to 'slug' your skin to the best products to get your hands on. So, what exactly is slugging? At the time of writing, the hashtag #slugging boasts over 306.7 million views on TikTok, with endless users ranting and raving by the trend. The last step in your nighttime skincare routine, slugging involves using petroleum jelly to seal moisture by creating a barrier, it also helps your regular products sink into your skin more efficiently. Petroleum jelly, or products of a similar consistency, are typically used for dry lips and cracked skin, but when it comes to slugging, the emollient is applied all over the face, as per Versed. While the heavy consistency can bring fear into the eyes of our easily-blocked pores, the method prevents transepidermal water loss, and surprisingly, it's a game changer for healing the top layer of skin and leaving a more plump and youthful appearance. Before you start running to the pharmacy to pick up all the Vaseline in stock, your sole focus should be what your skin needs. So, listen to your skin. If you're more on the dry side, then slugging every day would likely be beneficial. But if you're the bearer of oily skin, then tone down the slugging to perhaps once or twice a week at most. And for some, it may be best to even dodge it entirely, because it could create active breakouts or make oil-prone skin even worse. If you're not sure if slugging will agree with your skin, try it out once and monitor the effects it has on your complexion. If the coast is clear, try it again in a few days and slowly increase the frequency if you're starting to see benefits. If you're ready to give your skin the slugging it needs, then don't stress. First, ensure that you're starting with a clean face, especially if your skin is more on the oily side—clogged pores or residual makeup won't fare well once it's sealed. Once your skin is cleansed and exfoliated, make sure the products that you choose next are formulated to moisturise your skin. If you haven't already, get your hands on hyaluronic acids, glycerins or aloe-based offerings and apply them to your skin while it's still damp. As for what you should avoid, well, you should steer clear of active ingredients, such as AHAs, BHAs or retinoids. Speaking to InStyle U.S., dermatologist Dr. Kavita Mariwalla says that sealing your skin will just trap these already-strong actives and increase their potency beyond what they were intended for, and your skin could end up with more damage than before. When you've got a line up of moisture-loving, non-active products, it's time to slug. Once you've cleansed, exfoliated and applied your moisture-loving serums, go in with about a pea-sized amount of Vaseline or an occlusive-style product and gently massage it into your skin. For best results, your routine should be done around 30 minutes before you go to bed, so the products can effectively soak into the skin. Of course, if you're worried about messing up your surroundings, it's best to lay a towel over your pillow and keep your hair back while you sleep. Once you wake up, remember to head straight to the basin, wash it all off and go about your morning skincare routine as usual. Ready to face the harsh, winter chill? Below, find our favourite slugging products, so your skin doesn't fall prey to the impending wrath of the cold weather. ​Petroleum Jelly Original by Vaseline, $4.49 at Chemist Warehouse. Healing Ointment by CeraVe, $49.95 at Dick Smith.​ Hydra Balm by SkinCeuticals, $28 at Adore Beauty. Rose Deep Hydration Face Cream Moisturiser by fresh, $64 at Sephora. Intensive Extra Hydration Moisturising Cream by DermaVeen, $11.39 at Chemist Warehouse. Ultra Facial Cream by Kiehl's, $52 at Adore Beauty. Ultra Repair Cream by First Aid Beauty, $73 at Sephora. Vinosource-Hydra S.O.S. Intense Moisturising Cream by Caudalie, $57 at Sephora. Save 50% on your subscription and receive two free copies. Save 50% on your subscription and receive two free copies. Subscribe to Marie Claire-+ save! ",
    "datetime": null,
    "url": "https://www.marieclaire.com.au/what-is-slugging-skincare-trend"
}