{
    "title": "What the Heck Is Slugging & Should I Add It to My Skincare Routine?",
    "text": "We independently selected these products because we love them, and we think you might like them at these prices. E! has affiliate relationships, so we may get a commission if you purchase something through our links. Items are sold by the retailer, not E!. Prices are accurate as of publish time. If you've been on TikTok searching for new beauty products or hacks to try, chances are you've come across the term slugging. Although it's nothing new, it's gained popularity in recent weeks for being a hack to keep dry winter skin moisturized. But what exactly is slugging and is it something you should add to your skincare routine? We talked to a couple of dermatologists to get their take on the viral skincare trend and the products you need to try it. \"Slugging refers to a skincare step that consists of applying a petroleum-based moisturizer or emollient like Vaseline or Aquaphor to the face as the last step in your nighttime skincare routine,\" cosmetic dermatologist Dr. Michele Green, MD, told E! News. \"The goal of slugging is to seal in moisture and skincare products, like serums, overnight. Unlike lotions, which absorb right into the skin to deliver hydrating benefits, petrolatum was made to prevent water loss by acting as a barrier.\" Here are some answers to questions you may have about the skincare trend that everyone's talking about. In short, yes. But there are some things to keep in mind. Vaseline is typically used for slugging, and according to Dr. Michele, it's a great product because it's safe to use on sensitive skin and is \"noncomedogenic.\" That means it shouldn't clog your pores. However, slugging is typically recommended for those with dry skin. If your skin is oily or acne-prone, there is a higher chance that Vaseline may clog your pores. \"Those with oily skin tend to have larger oil glands and produce more sebum, making the skin more susceptible to clogged pores that cause acne,\" Dr. Michele said. \"Additionally, slugging may cause irritation on oily skin.\" If you have oily skin, she recommends using Vaseline as a spot treatment for any dry patches on the face, and using a moisturizing cream containing a mixture of occlusives, emollients, and humectants to lock-in moisture on your entire face instead. Cold weather during the winter months can cause your skin to become dry, so adding Vaseline or Aquaphor in your nighttime skincare routine can be useful in treating and preventing dry, flaky skin. According to Dr. Michele, Petrolatum, Vaseline's main ingredient, has been proven to be safe to use on sensitive skin and even babies. \"A small pea-sized amount of Vaseline is enough to cover the face and lock in moisture,\" she said. On days that you're slugging, you may have to adjust your nighttime skincare routine. As Dr. Elyse Love, MD, FAAD, board-certified dermatologist and Ulta Beauty dermatology partner, told E! News, \"Potentially irritating products, such as retinol and acids, should be avoided on slugging days.\" Retinol on its own can be pretty strong, so just imagine locking that into your face. According to both Dr. Michele and Dr. Elyse, it does. In fact, Dr. Elyse said, \"Slugging is excellent for increasing skin hydration and preventing water loss, especially during dry winter months.\" It is important, however, to be mindful of your skin type and the products you use in your nightly routine. If you're more prone to acne, you may want to stick to moisturizing creams instead of Vaseline. Although Vaseline is commonly used, \"any barrier cream/ointment can be used including the CeraVe Healing Ointment and Aquaphor,\" Dr. Elyse said. \"CeraVe's Moisturizing Cream is a great option that contains hyaluronic acid and three essential ceramides that work together to lock in hydration and restore the skin's protective barrier,\" Dr. Michele said.  Looking for more great things to shop? Check out this $20 vitamin C serum with 56,000+ five-star reviews on Amazon. Your source for entertainment news, celebrities, celeb news, and ​celebrity gossip. Check out the hottest fashion, photos, movies and TV shows! © 2023 E! Entertainment Television, LLC A Division of NBCUniversal. All rights reserved. ",
    "datetime": "2022-02-17T23:20:00.000Z",
    "url": "https://www.eonline.com/news/1320253/what-the-heck-is-slugging-heres-everything-you-need-to-know-about-the-viral-k-beauty-skincare-trend"
}