{
    "title": "What Is Hanbang Skin Care? - Coveteur: Inside Closets, Fashion, Beauty, Health, and Travel",
    "text": "These traditional ingredients deserve a spot in your skin-care routine. Ever since K-beauty was introduced to Americans in 2011, the main goal of the multi-step routine has remained the same—hydration, hydration, and more hydration. The whole philosophy behind Korean skin care is about adding moisture back into the skin rather than stripping or drying it out with layers of harsh exfoliants. And that's the same mindset behind the latest K-beauty trend: hanbang. While hanbang ingredients—aka traditional Korean herbal ingredients—have been used in Korea for hundreds of years, they're now starting to pop up in brands sold in the U.S. If you're curious to learn more, we spoke with three K-beauty experts to learn why hanbang ingredients are worth adding to your skin-care rotation.  \"Hanbang is a traditional Korean approach to wellness,\" says Sarah Oh, the founder of Oh My Gloss! \"You'd go to a hanbang specialist, they'd take your pulse to see whether your body is hot or cold,\" she adds. So, for example, if the specialist discovered that someone had a cold body, they'd mix together a drink or prescribe natural pills that would help warm up the body to an even temperature. \"It's a very holistic experience,\" says Oh. \"They'd never say, 'Oh, you just have a rash,' they would ask, 'Well, what are you eating or what are you doing?'\" Basically, the specialist looks at your daily habits to get to the root of the problem versus offering a Band-Aid solution.  \"When it comes to skin care, the same ingredients used in hanbang medical treatments, like ginseng extract or green tea, are the same ingredients used to formulate Korean skin-care products,\" says Oh. \"I think that hanbang takes a traditional approach to wellness, and Korean skin-care brands try and incorporate the holistic approach,\" she adds. Compared to Korea, the U.S. approach to skin care is very reactive, as consumers are focused on quick fixes and fast results. \"I know a lot of Western brands are pushing a lot of exfoliation at the moment,\" says Oh, \"but Korean skin care is always focused on more of a slow, steady, and long-term approach.\" With K-beauty, it's all about prevention. Caring for your skin in Korea is something that's introduced in childhood, so it's a ritual that's similar to brushing your teeth or washing your hands. Just like you wouldn't wait for cavities before you start using a toothbrush, in Korea, you wouldn't wait for acne or dark marks to appear on your skin before you begin a routine. This focus on consistency and achieving results over the long haul is at the heart of hanbang skin care. The ingredients focus on healing, soothing, and hydrating in order to strengthen the skin's barrier (aka the outermost layer). \"You've got this ancient knowledge coupled with new manufacturing techniques and new scientific knowledge,\" says Coco Park, co-author of Korean Beauty Secrets. \"It's marrying the best of both worlds—hanbang sits at the intersection of innovation and tradition.\" Some people aren't so sure if the natural ingredients and traditional, holistic approach are worth all the hype they get. In a 2017 New York Times op-ed, Euny Hong writes that \"ginseng and Jeju volcano water are not the whole story behind that flawless skin.\" Hong goes on to state that the \"flawless\" Korean skin we all aspire to is probably due to cosmetic surgery, injectables, and retinol (Korean retinol products contain higher concentrations of the vitamin A derivative than American retinol products do). When I asked Chloe Kwak, the founder of 107Beauty, about Hong's piece, she didn't deny the claims. But she also adds that Korean culture doesn't treat the skin as a separate entity—there's a belief that how you treat your insides has an effect on what shows on the outside, hence the strong emphasis on eating healthy and nutritious foods in Korea. \"Plastic surgery can do a lot, but it's not going to heal inflammation or eczema,\" Kwak says. \"You still have to get to the root of the problem.\"  Hanbang ingredients include herbal ingredients like ginseng root, rehmannia, and sacred lotus. \"The natural plant extracts have great skin-care benefits,\" says Oh. \"They're very hydrating and help soothe acne-causing inflammation.\" It is also not just the ingredients that increase the efficacy of these products. \"You have all of these tried-and-true ingredients and then they're prepared in a very thoughtful way—it's kind of like a super concentrate,\" says Park. The vinegar Kwak uses to formulate her skin-care products falls into this category. It's made from scratch and fermented for at least three years—some vinegar is aged 30 years—before it's used as an ingredient. The aged vinegar contains probiotics and other ingredients that focus on hydrating and creating a healthy microbiome. Interested in incorporating hanbang ingredients into your skin-care routine? Check out the product recommendations below. Thanks to the anti-inflammatory properties of hanbang ingredients like ginseng root water and licorice root extract, this lightweight and moisturizing serum works to reduce redness and soothe irritated skin. Washing your face can strip your skin of its natural oils, leaving it dry. This unscented toner adds moisture back into your skin to balance your pH levels, while also prepping your face for the rest of your skin-care routine. It's also formulated with licorice root extract to help gently calm inflammation. The MVP ingredients in this serum are red ginseng extract and ginseng oil. The dynamic duo work to minimize fine lines and wrinkles while also boosting moisture levels, giving your skin a plump and dewy glow. On top of the brand's aged vinegar, this face cream is also packed with squalane, fermented soymilk extract, and amino acids to repair and strengthen your skin's barrier and target dryness and dullness in one swoop.  Top photo: Courtesy of Instagram/@sugarpeachesloves  Want more stories like this? You Thought Korean Skin Care Was Intense? Try Korean Hair CareThis K-Beauty Favorite Is Our Secret to Deeply Hydrated SkinThis New Skin-Care Line Will Make Your Vagina Feel Pretty ",
    "datetime": "2021-06-07T16:00:00+00:00",
    "url": "https://coveteur.com/hanbang-skin-k-beauty-trend"
}