{
    "title": "What Is A-Beauty? - 17 Australian Beauty Brands to Know",
    "text": "Every item on this page was chosen by an ELLE editor. We may earn commission on some of the items you choose to buy. Australian brands are moving us away from multi-step complicated regimens and toward natural ingredients-focused, multitasking products. You know K-Beauty. You know J-Beauty. But there's another emerging global beauty trend on the rise, and it's coming from Down Under: A-Beauty. Known for their less-is-more approach to beauty regimens, Australian companies are staking claim in the beauty industry and bringing a host of natural ingredients with them. Kirsten Carriol, founder of Sydney-based brand Lano, defines A-Beauty as \"the opposite of K-Beauty.\" Says Carriol, \"Aussies are much more laid back with much less time invested. We prefer to be at the beach. Some may call us lazy! But we love to cut corners—and a beauty hack—and we are very no-nonsense and no bullshit, which is why a lot of our products are multi-use. It’s about less, but better. One product that does eight things—not eight products.\" Jess Hatzis, co-founder of Melbourne-based Frank Body agrees, claiming Australian women take a \"more benefits, less worries\" approach to their routines. To her, A-Beauty is defined by choosing products that are so effective you don't have to work so hard. \"This effortless-yet-effective philosophy is grounded in highlighting natural ingredients that protect, nourish, and soothe skin without complex routines, steps, and formulas,\" she explains. \"It's the antithesis of the multi-step modern skincare routine.\" Read on for more about A-Beauty, plus the Australian beauty brands that should be on your radar. Lano is best known for its ultra hydrating lips and body moisturizers that all harness the power of lanolin (a natural, human oil-like byproduct made from sheared sheep wool). Carriol came up with the idea for Lano when she experienced dry lips during a long-haul flight. \"Aussies are really hardcore about flying—for us, 12 hours is nothing. 24 hours is pretty much standard,\" the founder says. \"I wanted to formulate wake-me-up ingredients to really give your skin a proper jolt during and after a long flight.\" Recently, introducing face products to the brand, one standout is the Aussie Flyer Mask. It includes caffeine, mint, and ginger, which all create a mild \"buzzing\" sensation on the skin as it boosts circulation. \"You're left with a really juicy just-had-a-facial-skin-feel,\" she says. You've probably heard of Frank Body—the brand's coffee scrub debuted in 2013 and instantly took over Instagram with its playful product. After all, how could anyone resist 'gramming their body covered in the coffee grinds exfoliant that helped minimize the looks of cellulite and moisturize? Since then, Frank's expanded to face masks, cleansers, and lip products. \"As an Australian founded and made brand, we have long prided ourselves in our local roots. Our natural ingredient philosophy is the focal point of all products,\" Hatzis says. See: Frank Body's latest launch, the A-Beauty scrub, created with native Australian ingredients like Vitamin C-rich kakadu plum, eucalytpus, and finger lime, a naturally occurring AHA exfoliant. The combo of ingredients fight hyperpigmentation and help fade scars. Sand & Sky is a big on A-Beauty—in fact, they have a whole page on their website that outlines the time-saving, multitasking philosophy. True to its minimalist approach, the brand just has two products, including a wildly popular pink clay mask boasting Australian botanical ingredients that clean and smooth the skin. Founded by Jose Bryce Smith, O&M originally started as a salon in Sydney. Carriol calls O&M \"a clean beauty pioneer\" and never travels without the natural haircare brand's Thickening Spray. Expect the look and feel of luxury products with ultra clean formulas free of harsh chemicals like parabens, phtalates, and sulfates. Instead, the brand uses native Australian ingredients sourced from the country's vast geographical offerings from the desert to the ocean. The product catalog is massive and caters to every hair concern— from protecting color treatment and taming frizz, to pumping up volume and repairing strands. If you're looking for a nail polish with clean ingredients, insiders suggest Kester Black. Founded in 2014 by Melbourne designer Anna Ross, the brand calls itself \"Australia's most ethical beauty brand.\" Its vegan, mostly organic polishes are 10-free and water permeable, which means they allow water penetration and better breathability for the health of your nails. The permeability also makes it halal-certified so Muslim customers can use the lacquers, a win on the inclusivity front. As for the actual shades, there's something for everyone:  pastels, metallics, neon brights and more. This haircare brand uses the best of Australia's native ingredients including kakadu plum, frankincense, macadamia oil, passionflower, and acaí berry. The products are minimalist in packaging and formulas, created without parabens and sulfates, and PETA-certified. True to its Aussie roots, the brand aims to make hair care simple with a high-fashion sensibility. It's been used backstage at fashion week for runways like Noon by Noor, Area, and Brandon Maxwell. \"The Foundation is the best thing that ever happened to my limp hair,\" Hatzis says of the brand's pre-styling volume-boosting protectant. Former beauty editor Zoë Foster Blake used her 15 years of experience to create this effective, clean, BS-free line of skincare. Go-To has all your face and body basics (made with plant-derived ingredients), garnering a cult following. \"Minimal ingredients, maximum results\" is the mantra of Dr Roebuck's, a skincare brand founded by sisters Kim and Zoe Roebuck. The duo's line is inspired by their own experience with dry, sensitive skin and eczema caused by spending long days under the sun and swimming at Bondi Beach. 30 years ago their parents, both doctors, developed a minimalist formula that healed them and would inspire their line of multi-tasking masks, moisturizers, scrubs, cleansers, and more. Expect botanical ingredients even the most sensitive skin can benefit from, like jojoba, primrose oil, kakadu plum extract, and rosehip oil. \"If you wouldn't put it in your mouth, we won't put it in our products,\" reads the Edible Beauty Australia website, founded by Anna Mitsios, a Sydney-based naturopath. Her philosophy is to create skincare products so clean they're safe enough to eat—that means the wildcrafted, botanical goods are free of parabens, sulfates, artifical fragrances, and instead chock full of antioxidant-rich, Australian native herbs. This line of hair products prides itself on vegan formulations powered by Australian ingredients like kakadu plum, olive leaf extract, and grape seed extract. Hair and scalp health is the priority, so the plant-based shampoos, conditioners, and more are free of any harsh chemicals and parabens. Davroe also specializes in caring for colored hair, with a range of gentle products that won't strip dye. Supermodel Miranda Kerr has long been a green beauty devotee, first launching this line in 2009 in Australia—and now it is in 25 countries. The certified organic skincare and makeup products use ingredients like rosehip oil, noni, and chamomile for spa-quality results. Every product will make you glow, glow, glow. Eleven Australia is the brainchild of hairdresser Joey Scandizzo and photographer Andrew O'Toole, who took what they learned from working on photoshoots and runway shows to launch the brand in 2011. The products—many of which are vegan friendly—use plant ingredients like avocado oil, papaya extract, Australian macadamia nut oil, argan oil, and more to infuse ultra nourishment in styling products. Australian model Jessica Hart, a self-professed natural beauty lover, brings the A-Beauty approach to makeup with Luma. True to the less-is-more philosphy, the brand is all about a no-makeup makeup look with BB creams, subtle cheek and lip tints, and highlighters.  The line also includes unfussy skincare products meant to simplify your routine and make skin look radiant with crushed pearl powder, jojoba oil, and hyaluronic acid. Amy Jean, Australia's resident eyebrow queen, has shaped everyone from Naomi Campbell to Mel B—opening her first studio in 2004. She now has five studios across the country from Brisbane to Melbourne and launched her own line of products in 2018. Carriol recommends the eyebrow gel: \"So good to take on the edge of my brows when they go dark in the winter,\" she says. Skinny pencils that mimic microblading, concealer sticks, and a \"veil\" for shading the arches are also a part of the collection. This Byron Bay, New South Wales-based skincare company was founded by Ross Macdougald, a chemist committed to proving organic ingredients can outperform manmade ones. Biologi is a 100 percent active natural plant serum (other products have active ingredients at only 2 percent), made without chemicals, additives, perfumes, and even water. It uses homegrown ingredients like Davidson Plum, great for anti-aging and acne prone skin, finger lime, great for hydration, and kakadu plum, which treats hyperpigmentation. No A-Beauty guide would be complete without the O.G., Aesop. The Melbourne-based brand's black and white, glass jars are status symbols, elevating every vanity they occupy. There's a reason they've maintained popularity since 1987—the plant-based formulas are effective and the luxe experience is incomparable. Jurlique is another leader of the A-Beauty wave—Carriol calls the brand \"a genuine natural beauty pioneer in Australia.\" The founders, Ulrike and Jurgen Klein, launched the brand over 30 years ago using their backgrounds in botany and biochemistry to make high performing, plant-based products. All the ingredients are harvested from a sustainable farm in Adelaide Hills, South Australia where flowers like lavender, rose, and calendula thrive. Kristina Rodulfo is the Beauty Director of Women's Health—she oversees beauty coverage across print and digital and is an expert in product testing, identifying trends, and exploring the intersections of beauty, wellness, and culture. Prior to Women's Health, the Filipino-American, NYC native and NYU alumna was at ELLE.com for four years. As Senior Beauty Editor, she reported and co-produced the Webby Award-nominated documentary Beat: How Drag Queens Shaped the Beauty Industry and hosted the millions-viewed video series \"Beauty Haul.\" She can never decide whether or not to get bangs, feels naked without winged eyeliner, and will never shut up about running the NYC Marathon. Simple Nail Designs for Your Manicure Mood Board 14 Vanilla Perfumes That Smell Absolutely Amazing 13 Best Japanese Skin Care Products to Shop For Breast Cancer, 40 Is the New 50 Meet YSL Beauty’s Most Unconventional Scent Yet Amazon Is Having a Major Beauty Sale Right Now Why Matrix Could Be the Next Best Skin Treatment The Best Neutral Nail Colors for Every Skin Tone Claudia Sulewski Launches CYKLAR Beyoncé Is Finally Releasing a Perfume A No-Damage Routine for Colored Hair First Class Beauty 2023 A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2023 Hearst Magazine Media, Inc. All Rights Reserved. ",
    "datetime": "2019-04-09T05:20:00Z",
    "url": "https://www.elle.com/beauty/a27046264/australian-beauty-brands-a-beauty/"
}