{
    "title": "What Is \"Cloudless Skin\"? New Korean Beauty Trend Meaning | Allure",
    "text": "By Kaleigh Fasanella When I first heard about the \"new\" trend in Korean skin care, dubbed \"cloudless skin,\" I almost rolled my eyes. Another one?, I thought, thinking back to the two previous K-Beauty stories we've covered, first on \"glass skin\" and then on \"honey skin,\" both of which are centered around achieving a hydrated and healthy complexion. How could this be any different?, I asked myself. Nevertheless, I reached out to a few Korean skin-care experts to learn more about \"cloudless skin,\" and more importantly, how it compares to the two aforementioned trends. Little did I know, I was in for a bit of a surprise. \"Unlike glass skin, mochi skin, and honey skin, 'cloudless skin' is not really a trend,\" Liah Yoo, a YouTuber and founder of the skin-care brand KraveBeauty, tells me. \"It's the ultimate skin condition that motivates Korean women to do skin care so deliberately, and it's a term that's been used in many advertisements for decades,\" she explains. Put simply, cloudless skin refers to a completely clear, flawless complexion. See where the \"cloudless\" descriptor came into play? But, the difference between it and the former fads, if you will, is that it's much more connected to the \"healthy aura\" that one exudes from the inside out, as well as someone's emotional state. (For instance, Yoo says you would hear this as a compliment a lot when you fall in love, whether it be with a partner or with yourself). Alicia Yoon, the founder and curator of Peach & Lily is on the same page as Yoo, explaining to me in a lengthy response via email that \"cloudless skin\" refers to an inner, healthy radiance. \"Think of a young child who has yet to see skin damaged by the elements — skin is so full of life, vibrancy, and seems almost transparent,\" she says. On the flip side, according to Yoon, as we get older and go through the daily wear and tear that's inevitable (especially if you live in a big city), you'll see the underlying damage and dark spots that have sprouted over time, below the surface of the skin. \"[It's] the constant exposure to pollution, UV rays, and stress,\" Yoon says, the latter we know has the potential to greatly impact the overall health and vitality of our skin. So, how can one actually attain the Korean skin-care ideal that's been around for decades? Through a mix of healthy living habits as well as top-notch skin-care products. Nutritionist Keri Gans recommends getting your daily dose of dark, leafy greens (which are chock-full of skin-loving vitamin C) and 100 percent whole grains, rather than relying on overly processed meals with added sugars. Similarly, Yoo advises sticking to a diet with low-glycemic foods like vegetables, sweet potatoes, and oatmeal, rather than high-glycemic foods, like white rice and bread, which spike up insulin and eventually break down the collagen and trigger hormonal fluctuation and inflammation, both of which encourage the formation of acne. Yoo also puts a huge emphasis on sleep and stress, both of which can impact optimal skin health. New York City-based dermatologist and founder of Smarter Skin Dermatology Sejal Shah explains that cell turnover and DNA repair are highest at night, whereas during the day the skin is in more of a \"protective mode.\" \"Interestingly, blood flow to the skin and the skin's permeability are higher at night,\" says Shah, \"so sleep is a time for repairing and renewing your skin.\" What's more: Sleep and stress tend to go hand in hand, as too much of the latter can make it harder to get a good night's rest, and lack of proper shut-eye can lead to even more anxiety. Shah advises penciling in seven to nine hours per night, especially for those with existing skin conditions, as she says not enough sleep increases inflammation and can potentially exacerbate the issue. \"We all know stressed-out skin looks like a cloud, but more than that, the stress hormone cortisol [makes] skin reactive and makes the skin barrier more vulnerable,\" she explains. \"Managing stress is the most crucial tip that's needed in modern life, and a good night's sleep helps your skin to rejuvenate in optimal condition.\" Another key component to achieving \"cloudless skin\" is to keep inflammation at bay, as Yoon says it can contribute to everything from breakouts to dark spots. For keeping it under control, she swears by the Atoclassic line, which is solely focused on fighting inflammation. \"The brand uses a unique cocktail of traditional medicinal herbs, like coptis root, gromwell, and di-yu roots concocted by one of Korea's most famed century-old herbal medicinal clinic to smack down inflammation,\" she says. By Aliza Kelly By Gabi Thorne By Gabi Thorne As far as hyperpigmentation is concerned, prevention is everything. \"The cornerstone of any treatment regimen is good sun protection,\" says Shah. \"[Besides sun protection] the gold-standard topical ingredient is hydroquinone, but there are a number of non-hydroquinone options available as well, such as kojic acid, arbutin, vitamin C, and licorice extract to name a few,\" she explains. Yoon recommends pure vitamin C powder to mix in with products, that way it's in its most potent and non-oxidized form and can, in turn, do its best work at eradicating dark spots. What else can you do? It really, truly, all comes back to the basic pillars of skin care: proper cleansing and exfoliation, protecting skin with SPF (and remembering to reapply), as well as using deeply hydrating products that help seal in moisture, which leaves less room for the skin to react to daily stressors. A few of our favorites include the Saturday Skin Freeze Frame Beauty Essence, Cremorlab Hydro Plus Snow Falls Melting Cream, and Mizon Intensive Skin Barrier Serum. As for sunscreen, Yoon swears by Lagom Sun Gel, which she says sold out 11 times in eight weeks. Finally, I'm certain we've all heard this a million times. It is integral to remember that consistency is key. \"Changing products too often is making our skin so confused, which leads to sensitized and inflamed skin,\" explains Yoo. \"Knowing what your skin needs is the first thing, and adopting the products that respect your skin is the second, but what really makes you the winner is consistency, as you really need to give more time for your skin to transform and get back to its healthy state.\" The reward? Cloudless skin, which we're referring to as a lifestyle — with clear, radiant skin as the ultimate goal. Read more stories about great skin care: By Aliza Kelly By Gabi Thorne By Gabi Thorne Now, learn this year's Best of Beauty winners in the breakthroughs category: By signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. By Annie Blay By Sarah Han By Nicola Dall'Asen By Sarah Han More from Allure The BEAUTY EXPERT Contact © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our \n             User Agreement and Privacy Policy and Cookie Statement and \n            Your California Privacy Rights. \n            The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. \n            Ad Choices. ",
    "datetime": "2018-01-22T23:10:09.449Z",
    "url": "https://www.allure.com/story/what-is-cloudless-skin-is-perfect"
}