{
    "title": "What is ‘slugging’? Here’s what you need to know about the viral K-beauty hack for dry skin - YP | South China Morning Post",
    "text": "This winter, many people are dealing with unbearably dry, patchy skin. But lucky for you, dermatologists have a simple solution. The latest viral skincare trend is called “slugging,” which involves coating your face in petrolatum, or Vaseline, to moisturise your skin overnight. Though the fad has become a talker recently (with over 80 million views on TikTok), it is not particularly new. It has long been popular in the Black community as well as in the K-beauty world to replicate that natural, dewy glow and combat dryness. A trend called time blocking is taking over TikTok. What is it? “Petrolatum is an underrated ingredient that dermatologists have used for so many different things, including slugging,” says Dr Jenny Liu, a Fellow of the American Academy of Dermatology. “Not only has it been used safely for babies as a body moisturiser, or used on wounds … but it offers great hydration to dry and irritated skin.” Many people have used slugging to obtain plump skin at home, because it only requires one product. All you need is a thick, ointment-based moisturiser like Vaseline, Aquaphor, CeraVe Healing Ointment or Cetaphil Healing Ointment. Experts say slugging should be used as the last step of your skincare routine – after cleansing and moisturising. Dr Lindsey Zubritsky, a board-certified dermatologist with over 400,000 TikTok followers, recommends a “very thin layer” over your whole face – especially during the winter months. “By adding this as the final step to your nighttime regimen, it works well to keep skin moisturised and hydrated all night long … It also allows the skin barrier to repair by acting as a protectant,” she says. This is because unlike most lotions, Vaseline isn’t absorbed directly into the skin. Rather, it acts as a surface barrier to “prevent further water loss and lock in hydration,” Liu says. However, the trend may not be for everyone. Though petrolatum in itself is unlikely to clog pores, it can still irritate acne-prone skin and potentially cause breakouts. “In general, if you have oily, sensitive skin, you may not like slugging because it can feel heavy and greasy,” Liu warns. Zubritsky also recommends avoiding slugging in combination with any active ingredients like retinols, retinoids, alpha-hydroxy acids, or beta-hydroxy acids, which “can cause more irritation and sensitivity by locking these strong ingredients on your skin.” ",
    "datetime": null,
    "url": "https://www.scmp.com/yp/discover/lifestyle/article/3164124/what-slugging-heres-what-you-need-know-about-viral-k-beauty"
}