{
    "title": "What to Buy at Innisfree, New York’s All-Natural K-Beauty Import | Vogue",
    "text": "To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. To revist this article, visit My Profile, then View saved stories. By Monica Kim Five years have passed since the Korean beauty wave first struck the U.S., and the global phenomenon shows no signs of slowing down. Yet the latest news from Seoul is particularly thrilling, even among jaded fans: Innisfree will finally bring its cult natural skin care and makeup to New York this fall. The brand launched in 2000 with a name plucked from a Yeats poem and a concept that felt revolutionary at the time—a focus on natural, often organic ingredients, locally sourced from nearby Jeju Island. Now an industry powerhouse (owned by the corporate juggernaut Amore Pacific), Innisfree’s minimal glass-box shops can be found on what feels like every other Seoul block; in the heart of Myeong-dong, there is in fact an Innisfree across the street from an Innisfree. On September 15, they will open a two-story boutique in a brownstone a few paces north of Union Square, filled with crawling ferns and ivy. There will be a reclaimed wood bar with piles of sheet mask packets and pods of paintable cream, as well as an expanded color range of cushion compact foundations, including a brand new matte full-cover cushion formulated exclusively for the U.S. customer. Even without a buzzy opening and exclusive items, Manhattan’s first Innisfree will earn its following the same way it did in Seoul. The packaging is chic and clean, compared to the country’s cutesier output, and the ingredients themselves evoke calm, quiet things: acres of green tea fields or plots of winter orchids, whose lilac buds burst through the snow. Yet for this Vogue editor, who makes an average of three trips to Seoul every year, it simply checks all the boxes: easy, effective, affordable. An angled bit of brown cream crayon is a perfect brow pencil; it lasts through a full workday and a sweat-drenched boxing class without the slightest budge. A palm-sized beige tube of “no-sebum primer” miraculously fills in pores, leaving a smooth canvas for makeup, while a single olive oil wipe removes all traces of it with one moisturized swipe—fail-proof and foolproof. Here, 11 game-changing products to pick up at Innisfree next month. By signing up you agree to our User Agreement and Privacy Policy & Cookie Statement. By Elise Taylor By Elise Taylor By Kristen Bateman By Kristen Bateman By Marley Marius By Samantha Rees More from Vogue See More Stories © 2023 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Vogue may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices CN Fashion & Beauty ",
    "datetime": "2017-08-17T23:13:56.274Z",
    "url": "https://www.vogue.com/article/innisfree-store-nyc-korean-beauty-skin-care-brand-comes-to-us"
}